{"ratings": 39798, "userreviews": [{"userName": "Chelsea Humphrey", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "This might be one of the most difficult reviews I’ve had to write in the entire time I’ve been writing reviews. How does one convey their thoughts on just how addicting, intriguing, and consuming of a book this was, without exposing all the delicious spoilers that make it such a fun read? Behind Her Eyes was the 200th book I’ve read this year, thus completing my Goodreads challenge early, so I guess you could say I’ve read quite a bunch of books in 2016. Out of all those books, this one will stand out for many reasons, but one of the largest would be due to the fact it is quite unlike anything I’ve read thus far in the genre.I can’t rave enough about how compulsive a read this was. I found myself wandering in and out of rooms to avoid people so that I could sneak in “just a few more pages”. The slow building suspense was gripping and so incredibly well written. Sarah Pinborough has become of my top 10 favorite authors this year and for good reason. Earlier this year I read The Language of Dying and was blown away by her creation of something so beautiful yet disturbing; it absolutely wrecked me. Her talent can’t be confined to one genre; it’s too complex and excellent for that tiny box. She has taken the typical love triangle and made it anything but; there are multiple POVs and storylines intricately woven together to seem unrelated but, come on, we know better. She delicately brings each piece together until the precise moment she wants to drop the #WTFthatending moment. IMO there were really multiple twists that connect into one; the how/why/who was just as important separately as they were in one entity.I read quite a few early reviews on this book, and while some chose to include elements that I view as spoiler material, I almost wish I had seen them prior to reading this book. I believe my expectations would have been altered and I could have accepted this for what it was; an excellent book with a clever, mind-blowing twist that shouldn’t be confined by genre. The best way I know how to explain what I mean is that it doesn’t play by the usual rules of a psychological thriller. If you’ve seen anything yet about this book, you are clearly aware that there is a shocking ending with a whopper of a twist. The catch 22 is that, if this particular element I’m referring to was hinted at via genre description, the surprise aspect of the book is spoiled. The entire ending and twist are dependent on this aspect being kept secret, so you can see the dilemma I’m facing. I take full responsibility for this as it’s a personal problem based on my expectations of something filed in the “psychological thriller” genre.I can’t really say anything else without taking the fun out of reading this one; suffice it to say this is a must read. I think the most wonderful aspect of this book is that you don’t have to love how the plot works out to love reading the book. Whether you are drawn toward the ending or throw your book across the room, this is a story you must read if you call yourself a fan of any type of thriller. You might even need to read the beginning pages again for full clarity and comparison at just how beautifully Sarah Pinborough has slapped you across the face. This book buried into my brain so deeply that it was in all my waking thoughts and dreams for days; I couldn’t shake it. I’m just going to go ahead and let her take all my money; I’ll read anything she writes compulsively and will be sitting on pins and needles waiting for her next book.Many thanks to Sarah and Flatiron Books for my treasured copy. She worked tirelessly to make sure my arc arrived and I’ll never forget that kindness. I’m paying it forward to Amy at Novelgossip so that we can discuss like ditzy school girls. ;)"}, {"userName": "Emily May", "userReviewDate": "Nov 15, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "[How did she know that Adele dreamed of the \"second door\" just because Adele's sleeping habits were the same as hers? (hide spoiler)]"}, {"userName": "Kristin (KC) - Traveling Sister", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/4971692-kristin-kc---traveling-sister", "userReview": "*4.5 stars*...Sickeningly delicious storytelling!Boom. That ending. That \"WTF-That-Ending\" heard ‘round the world, or at least, the social media book-reading community. It feels like this author just said, “Know what? Screw this, I’m doin’ it”, and then she did it. Seriously. She WENT for it.It’s been a while since I’ve been legitimately shocked as a reader, and I don’t care how much this ending can be reduced down to utter nonsense, I’m embracing the hell out of it and you can’t stop me. Because the fact is, when I swiped those last few virtual pages, my tired eyes narrowed, my offended guts twisted, my face took on a just-sucked-lemon contortion, and my lips curled into a tight little opening that spewed a whispered \nwhat the fuck?\n declaration. And there is was. Sarah Pinborough’s writing is strong, and she paints a picture well without having to tell us the colors she’s using. There were no holes in this plot, no loose ends left untied. Everything made sense, even when it somehow didn’t. The perspectives shifted between characters, and the narratives sometimes switched from first and third person at random. It’s as though this story unveils itself from every angle possible, and yet still it goes and throws me off my feet. I know some readers couldn't get past some of the farfetched scenarios in this one, and I get it. I really do. I'm not one who readily ingests an over-the-top idea if there's not enough conviction behind it. In fact, I typically hate when I'm forced to suspend too much belief for an idea to \"work\". But this story was clever enough to become an exception. I can’t tell you details of the plot because I am your friend and I won’t ruin it for you. But I can tell you this: Soften your critical eye (if possible) when going into this one, so you can just enjoy the journey. Because it really is one hell of a ride..."}, {"userName": "Meredith", "userReviewDate": "Dec 04, 2016", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "2.5 starsBehind Her Eyes is very readable; I couldn’t put it down and I was constantly trying to figure out what was going to happen. However, once all was finally revealed, I came to the conclusion that I did not like this book. It’s nearly impossible to write a summary of the events of this book without giving too much away, so I am just going to keep it as this: A man, his wife, and his secretary get caught up in a tangled web. I know that I am in the minority with my feelings about this one. I found it gimmicky and the twists ruined it for me. It's just not my cup of tea."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Holy shite balls people!!! Okay, so I checked my Overdrive this morning and it said this book was going back in 4 hours so I thought I would try it right quick. I COULDN'T put it down! Funny to think I probably wouldn't like it! Let me tell you, this freaking book blew my little mind! Just right out into space!!!There are mixed reviews about the book like there are many books but I don't give a rats behind because this book was AMAZEBALLS. Talk about crazy train!!! So, Louise is a single mom that works part time at a psych office. She works three days a week. One day she gets a new boss and it turns out it's the same dude she made out with the night before. Seriously? And he's married. Well, isn't this all happy day news for Louise. Idiot. Adele is David's wife and her and Louise become friends. NOT A GOOD IDEA PEOPLE! Leave work, leave town, never come back! There are secrets that David and Adele are keeping but what are they? Why is Adele so freaking terrified of David? That's all I'm going to say because this book is one you need to read. Yeah, you might not like it but it was freaking awesome! I started to become aware what was going on toward the end of the book and thought it was pretty cool. And then . . . .THAT ENDING!I loved it! There are seriously no words. I'm still blown out into space over this book! MY BLOG: Melissa Martin's Reading List"}, {"userName": "Paromjit", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "This is a character driven psychological thriller. It is well written enough to keep the reader engaged. The three main characters of Louise, David and Adele are unlikeable. Louise finds herself involved with David who turns out to be her new boss. She runs into his wife, Adele, and a cloying, claustrophobic, but close and secretive relationship develops between them. Since her divorce, Louise has had a stagnant and isolated personal life, and she needs the attention she has begun to receive. David is the first man she has a sexual affair with since her husband. Despite the guilt she feels, she gets drawn to and more closely entwined with Adele. A sinister and toxic image of Adele and David's marriage emerges. Louise has night terrors which Adele wants to help her with. She gives the mysterious notebook of the elusive Rob to guide her to counter those terrors. In a tale that takes in cats, fires and constant relocations of David and Adele, Louise may find that she has bitten off more than she can chew as she enters the uncharted waters of David and Adele's marriage. I am aware that many really love this novel, unfortunately I am not one of them. For me, the story developed does not segue well into the twists that unfold at the end. The dissonance I experienced between the rabbits pulled out of the hat at the close of the novel, felt like the author had arrived at calculated intellectual solutions which fail to match the revealed storyline. The character of David feels underdeveloped, and I did not have sufficient reasons to believe in his and Louise's relationship. However, I am sure the majority of readers will like this book. Many thanks to HarperCollins for an ARC."}, {"userName": "Dem", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "2.5 StarsIf I had known then what I know now I may not even have bothered reading this Novel as I felt it strayed from psychological thriller to Fantasy/Paranormal which didn't work for me. I have a hard time suspending disbelief at the best of times in books and therefore stay away from novels where fantasy or magic realism play a role but I do like a good well written Psychological thriller and have read a couple this year that I really enjoyed. While Behind Her Eyes is unique and well written and there is no doubt the author holds your attention throughout but I did find a find myself having to seriously suspend disbelief and there was a lot of eye rolling not to mention a couple of choice words mouthed close to the end of the book for reasons that are best left unsaid.I would probably have rated the book 4 stars for suspenseful and original plot, great character development but what a let down the belief element was. I know I am in the minority on this one and so many readers have loved it but this is just my reaction to the book.I listened to this one on audio and the narration was excellent.An enjoyable read just not one for my favourites list."}, {"userName": "Larry H", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Umm, seriously? What did I just read?Sarah Pinborough's new book, \nBehind Her Eyes\n is one crazy book, one that at different times had me totally hooked, rolling my eyes, predicting (incorrectly) how the plot would be tied together, and then, ultimately, re-reading the last few chapters a few times to make sure what I thought happened actually did.So, let's see how to review this. \"Secrets, secrets, secrets. People are filled to the brim with them if you look closely.\"Louise is a single mother to a young son. She works part-time as a secretary at a psychiatry office, and for the most part, spends her evenings caring for her son and drinking a little too much wine, and at times suffers from night terrors she can't explain. She'd love to meet a new man but doesn't really want to make the effort.Then she meets him. Smart, funny, handsome, seems completely interested in her. They spend a somewhat drunken evening in a bar, and clearly there's chemistry between the two of them. After a passionate kiss, he flees, but she feels heartened that finally, someone special took an interest in her. Then on Monday, Louise discovers that this man is David, her new boss. Oh, and he's married, to a beautiful, elegant woman. Bollocks. Louise bravely tries to soldier on despite her disappointment and David's occasionally flirtatious nature, but she is determined not to be one of those women. One day, while walking near her office, she (literally) runs into Adele, a beautiful, lonely woman clearly in need of a friend. And then, Louise quickly realizes Adele is David's wife. Adele starts to encourage Louise on ways to improve herself—cut back on the wine, quit smoking, join a gym.When David's interest in Louise starts to intensify, she doesn't know what to do. She definitely has feelings for David, but she likes having Adele as a friend, even under the circumstances. She knows the secrets she's keeping from each of them are wrong, but she can't break up with either of them. And it appears both of them need her, in their own ways, as much as she needs them.If you think you know what's going to happen from here, you're probably right—and you're utterly wrong. Pinborough combines elements of your typical love triangle and the story of the marriage that no one understands with some seriously bizarre, suspend-your-disbelief plot elements. When it works, the book practically hums with finesse and intrigue, and when it doesn't work, it's one of two things—you just can't wrap your head around what is allegedly happening, or you feel the book has fallen into such stereotypical territory it annoys you.Ultimately, why this book worked for me (despite having to suspend my disbelief) is Pinborough's storytelling. These aren't likable characters, the plot jumps back and forth between narrators and time periods, and sometimes you wonder how the characters know what's going on. But Pinborough's writing mesmerized me, and the originality she demonstrates helps the positive outweigh the negative.This will not be a book for everyone. But if you want to go on a crazy ride with some crazy characters, pick this one up. Because when a book comes with a hashtag, \n#wtfthatending\n, you know you need to give it a try.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Kaceey - Traveling Sister", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/13442817-kaceey---traveling-sister", "userReview": "Get ready for a wild ride! This was not what I expected, though I wasn’t even sure what was in store for me when I started this read. But I’d read enough reviews to know there was an off-the-charts spin at the end. Even forewarned, it still stopped me in my tracks!Told from 2 points of view. Adele - married to David since she was a teenager. She is beautiful, ethereal, with a hint of vulnerability that draws people to her. Only she may have something hiding beneath the surface. (Well, of course!)Louise – adjusting to being newly single, raising her young son. Working as a secretary for Adele’s husband, David.When the paths of these three characters cross into a distorted love triangle, you just know that no one’s going to come out of this unscathed! One of them has an agenda! And one of them has vowed to never be stopped! But which one?Oh this cannot end well!I think this is one of those books that it will either work for you and will absolutely love it. Or you will walk away saying “what did I just read!” Personally...It totally exceeded my expectations and I loved it! After reading so many thrillers, I wanted something original! Careful what you ask for! I got it...in spades! A completely different take on a domestic thriller. Keep an open mind and you’ll be pleasantly surprised!"}, {"userName": "Celina Grace", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/8471587-celina-grace", "userReview": "I suppose I really shouldn't be surprised that, in an era where Donald Trump becomes president and Britain exits the European Union, that this book is lauded as one of the top psychological thrillers of the year. I could have overlooked the pedestrian prose, the utterly unlikeable (and unconvincing) characters and the plodding plot (done much better by other writers a billion times before) because I was looking forward to the twist of the year.To give an indication of just quite how bad it actually is - an insult to every reader's intelligence - I'll give you a few examples of how it could work in other books:Pride and Prejudice: Mr Darcy is actually really haughty and stand-offish because HE'S A ROBOTTo Kill a Mocking Bird: Atticus Finch is a really great lawyer because HE'S TIME-TRAVELLED FROM THE FUTUREJane Eyre: Mr Rochester is moody and troubled because HE'S A SHAPE-SHIFTING WEREWOLFI'm sure you get my point. This book is ridiculous and I suppose I should have known better, given that I'm currently living in a surreal dream-world."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "What?  Ugh!  Seriously?Oh my I don’t even know how to rate this one let alone review it! So for now 3.5 stars rounded down.Did this novel pull me in?  Most definitely!  I was hooked right away and absolutely could not put this book down. It totally consumed me and I was constantly trying to figure out what the heck was going on!  Was it him…..was it her….and then the ending….oh brother, seriously!  That is what my thoughts were exactly after reading!BEHIND HER EYES by SARAH PINBOROUGH was an intriguing, gripping, exciting, and compulsive psychological thriller that grabbed my attention from the very first chapter and had me on the edge of my seat in anticipation for that ever so exciting and unforgettable ending that everyone seems to be talking about.  Except after finishing reading this book I was a little disappointed about that ending. Sorry!And here is why…..trying not to reveal too much of why this didn’t work for me and spoiling the ending for someone else I will try to explain myself.  Simply I seen it coming and I didn’t want it to go there.  You might ask how did I see it coming?  Well, I have a really overactive imagination and like to see things in a different light and what might be seen as eccentric. If I didn’t see where the author was going with it would it have still been surprising?  Absolutely!  Was it a good read?  Absolutely!I must say that BEHIND HER EYES is an absolutely brilliant title for this book!  Absolutely brilliant!  SARAH PINBOROUGH does deliver an extremely gripping story here that was well-written and had me totally engaged in the slow-building suspenseful story-line with a few good twists that had me questioning and guessing what was actually happening until I actually figured it all out.  I think if I didn’t figure it out it might have been a much better read for me!To sum it all up it was an entertaining, enjoyable, suspenseful, fast-paced, quick and easy read with a twist ending. Would recommend!!All of Brenda & my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Linda", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "\"Love dies hard, you know?\"And that eye, fully dilated and widely on alert, says it all.Now, let me just say that this one is not gonna be on everyone's radar. Having read Mayhem and The Language of Dying, Behind Her Eyes ventures into a deep psychological pond. The fish swimming there seem to glide against the tide of reality. You really wouldn't want to go wading into that pool of murky water on your own.Louise, a single mom and a part-time employed secretary, dips her toes into that pond one night. She shares a passionate kiss with a man at a crowded bar. That kiss still lingers as she comes to find out the next day that he is her new boss, David, the latest psychiatrist in her office. That kiss should also have come with a High Voltage warning. David and Louise can't get enough of one another and so it begins......And in walks Adele, David's beautiful wife. Strangely, Louise and Adele become friends and even share outings to a gym together. Let the games begin. David knows nothing of this bonding by the women. And Adele seems to know nothing about these two enamored fish. Oh, and Louise? She's certainly not saying much these days. This is a real cat and mouse tale told through chapters entitled \"Then\" and the shift back into the present. None of these characters are likeable for a multitude of reasons that will be revealed. But you find yourself unable to look away. Which one is more unstable than the other?Sarah Pinborough presents a story that is driven on a curvy road by these characters. I kept looking in the rearview mirror to see if I should have gotten off at the last exit. The last chapters will either hang your mouth open in shock or will tap on the brillance beacon. Sideline anything you've read before. This one dabbles in strange, very strange waters. So consider all things before taking this one on. The water's fine for some, but not for all."}, {"userName": "Maureen", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "Who's a clever girl then? No not me! The author Sarah Pinborough. When I say she's pulled a blinder with the conclusion of this book I'm not exaggerating.Louise is a single mum on a rare night out when she meets a man in a bar. They share a drunken kiss and then he leaves, but Louise can't stop thinking about him, she felt a connection during their very short flirtation. When she arrives at the office after the weekend she's introduced to her new boss, and yes it's 'the man in the bar' David. It would be crazy to get involved with your boss especially as he's married right? Well Louise does become involved but oh boy she sure is going to regret it! When Louise accidentally bumps into Adele (David's wife) she finds herself pulled into a friendship with her that is bound to end in disaster, considering she's seeing David behind Adele's back.There was everything you could want in 'Behind Her Eyes'. It had an air of menace throughout in this twisted tale of love and obsession, and the plot was SO different, with even a touch of the supernatural. Just try to keep an open mind.I've read more than my fair share of psychological thrillers but I have NEVER come across such a complex and clever ending. I kept trying to pre-guess where this story was going but I had no chance - what a twist, I could never have created such a corker of a finish. Wow!*Thank you to Netgalley and Harper Collins UK for my ARC in exchange for a fair and honest review*"}, {"userName": "Jennifer Masterson", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/28953843-jennifer-masterson", "userReview": "Brilliant! Just brilliant! This novel! Wow! Just wow! If you like unpredictable thrillers than you should check out \"Behind Her Eyes\"!I listened to the audio version. The audio is awesome. The last 10 minutes turned this book from a 4 Star to a 4.5 Star for me! What a freaking ending! I was worried that I would figure out the ending because I read a bunch of reviews. Nope! Complete shocker! I love crazy endings! Great audio! Would make a great first listen. Wonderful narrators.Highly recommended to people who can suspend disbelief and like thrillers.That's all I'm going to say. Stop reading reviews and check it out!"}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "Holy shit.You're either going to love this thriller with a hint of supernatural or not at all. That ending though!"}, {"userName": "Karl", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "Perhaps \"Behind Her Eyes\" is a solid four and 1/2 stars, however the round up is necessary so as not to round down, in order to not give a false impression that this book is a fantastic read. Ms. Pinborough is a fun, sly and smart author when all is said and done.So why quibble over that half a star ? To be honest I had some slight issues with the beginning of the book, which were overcome the further the story unfolded. My fear was what I call \"The Gone Girl\" syndrome, where you have this apprehension that the author is just flat out messing with the reader.However Ms.. Pinborough is much more cleaver than your run of the mill word scribe. She has inserted enough clues into her narrative to give the reader the clues necessary not to feal swindled by unfolding events. The book is part family relationship drama with twosoms and threesoms, part mystery, part horror, layered and unfolded like an onion finally exploding with a creative and unique ending. Applause to Ms. Pinborough."}, {"userName": "karen", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "oooh, goodreads choice awards semifinalist for best mystery! what will happen?some years back, i was at BEA with greg, and we were on line for something or other, and he’d wandered off to a nearby booth while i held our place. there was a gaggle of librarians behind me in line, and the boy-librarian was holding court, impressing all the girl-librarians* with his game of thrones knowledge by giving a highly detailed and booming synopsis of everything that happens in A Storm of Swords, which i had not yet read, but i knew from greg was the book with all the stuff and things. once i realized what was happening, i made the emphatic but unobtrusive clicking noise that means “come here now, please,” developed during many years of working in the bookstore trenches together, and the moment he returned to my side, i bounced outta earshot without a word of explanation. in a perfectly executed choreography of facial expressions and ASL (which only one of us has studied, rendering it a gesture more decorative than useful), we established when it was safe for me to come back. which, for the record, was much longer than it should have taken - that nerd was on fire with detail.i’ve since read the book and seen the show and i’m safe as safe can be from that particular spoiler-landmine, but the world is as full of twist endings as it is incautious booknerds, and with Behind Her Eyes, pretty much the only thing i knew about it was that it was ALL ABOUT THE TWIST, and OMG, and i approached all reviews of it gingerly, not wanting to tempt fate or the spoiler monster.i succeeded, but i wasn’t, of course, able to escape the knowledge that there was a twist, which comes with its own set of reader-distractions - finding myself subconsciously squinting for clues and developing theories while reading, which i 100% did not want to do, but every time i had to put the book down for any reason, my mind would slink into investigative/analytical mode and try to work out the twist without my consent. fortunately, investigative karen is a moron, and it’s a fast enough read that i was able to push most of life off to the side and gulp this down pretty quickly, and i figured out some things, but not that half-twist jab that comes after the main twist, which was a fun “hey now!” that tied up some lingering questions, but also created new ones.here's the thing - in this case, the twist IS the book’s selling point. it’s a fun glossy pageturner; the book-equivalent of clickbait that sucks you right in (LGM) with its promise of YOU’LL NEVER GUESS, and YOU WON’T SEE IT COMING, and it’s an entertaining read, although peppered with implausible character behavior inspiring many “who would DO that?” eyerolls, but the momentum is all driving towards this promise of JUST YOU WAIT that, granted, delivers what it promises and is an unusual deviation from other books in this genre. however, it's not a tightly-fitting lid, and there's a lot left unresolved, sloppily explained, or significance overemphasized. paint color is just paint color, after all.it's fun fluff, but i'll take fun over tedious any day. * presumably."}, {"userName": "Suzanne Leopold", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/9004645-suzanne-leopold", "userReview": "Louise is a divorced mother working as an assistant in a psychiatrist’s office. On a night out, she meets a gentleman in a bar, they share drinks, a connection, and a kiss. The following Monday, Louise is nervous about meeting her new boss. She is introduced to David, and is horrified. Her new boss is the mysterious man from the bar!A few days later after dropping her son off at school, she makes a new friend named Adele. Louise senses Adele is lonely and seeking friendship having just recently moved to town. It take Louise a while to figure out why Adele seems so familiar. She makes the connection after seeing her in a photo on David’s desk.Louise and Adele become close friends having much in common. They each share information and deep secrets from their pasts. As the friendship develops, Louise becomes very concerned about Adele’s welfare.This psychological thriller is filled with twists, turns and building tension. I was quickly pulled into the story and could not put the book down. Sarah Pinborough has delivered a fun and suspenseful read!5 copy giveaway on my blog until 2/27 https://www.facebook.com/suzyapproved..."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "I know you love the internet. I love the internet too.\nBUT FOR THE LOVE OF HELLO KITTY DON'T GET SPOILED IF YOU ARE PLANNING TO READ THIS BOOK! You know some turd is going to do it...so stay far away from the reviews.I'm going to try to not spoil nothing but I'll gif the heck out of the review and annoy half of Goodreads anyways.These three main characters are not your friend. At least I hope the heck not. They are some selfish, mean ass characters.\nSorry, Janis..these people are both types.Then they get themselves in a big old hot mess.\nBut I didn't care! BECAUSE\nAnd that ending. Hell to the yeah. That was one of the best endings I can remember in awhile.\nI almost gave this sucker five stars..but at times it does get overly talky and it has some plot holes bigger than my butt. I don't give a crap though it was gooooood. 4.5 stars!"}, {"userName": "Diane S ☔", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "Oh dear, well........ let me just say this is very inventive, very imaginative, but just couldn't go there. A little too much for me, too twisty, too much back and forth. Who is telling the truth? Nothing ever certain, even if you think you know. Dislikable characters to boot, well except for little Adam, who is actually a minor character. Loved her last book, but this one, can't say I enjoyed. Though I know many loved it and many more will. ARC from Netgalley."}, {"userName": "Susanne Strong", "userReviewDate": "Aug 18, 2017", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "4 Crazy Frakking Stars.Oh My Gosh. What did I just read? I haven't the faintest idea! Crazy with a side of Tabasco thrown in? Something like that.And now for my review? I don't even know what to say. First, this book is bat-sh&t cray cray. Second, you must believe the hype people, it's real. So what’s the story? Louise, a single mother, is out one night having a drink – there she meets a man (David), whom she is immediately drawn to. The night is mostly innocent, though there is an instant connection. You know how it is. The next day Louise goes into the medical office where she works as a secretary and discovers that David is her new boss. And he’s married. Talk about uncomfortable. Later, while out and about, Louise meets his wife, Adele, and finds that Adele is absolutely amazing. Over time the two somehow become besties, all the while Louise carries on an affair with David and Louise just can’t choose between the two. AS IF. Thereafter, things become a little strange (RIGHT?!) and Louise gets drawn deeper and deeper into David and Adele’s crazy as heck marriage. As you might be able to tell, this is one crazy, compelling and totally compulsive read. I admit that towards the end, I snuck in time to read this whenever I could (at times when I should have been well, say - doing more productive things). Sarah Pinborough’s writing is suspenseful, gripping and full of life. Her writing can’t be confined, nor can it be perfectly presented in a pretty little package. It’s crazy, wild and totally out there. The characters are all consuming, I got so wrapped up in them - especially the character of Adele, that I felt like I couldn’t escape. And perhaps that was the point. At the end, my eyes flew open, I re-read the last few pages several times and thought I might have gone nuts, but alas, I’m only a little crazy (I think). It might have been one of the craziest, strangest endings I have ever read. But I think you all know that by now. You’ve read enough reviews. It is a WT-Frak ending. Nothing you have read will prepare you for it. And if you think for a second that you are going to figure this out, I just have one thing to say: You’re never going to get it - so just quit while you're ahead! Then again.. my GR “sister” Norma apparently figured it out (based on her splendid review), so maybe, just maybe you will actually be able to figure it out after all. Regardless, it is one insane ride and is well worth it. Recommended for anyone looking to be entertained. Published on Goodreads and Amazon on 8.18.17."}, {"userName": "j e w e l s [Books Bejeweled]", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/68216634-j-e-w-e-l-s-books-bejeweled", "userReview": "I read BEHIND HER EYES a few months ago when I received the paper ARC unexpectedly in my mail. Thank you Flatiron Books! I appreciate the hard work that you do to promote authors and new books. Having said that, I am always a bit leery of books that are sent out to the social media world with such grandiosity and heavy-handed publicity. Can't a great book get footing on its own? Sadly, maybe not. Oh well, never mind that thought. I am somewhat of a realist, but I'm open-minded and curious about subjects like lucid dreaming, mainly for the psychological aspects that may pertain to a murder mystery. You are led as a reader to think this book is traveling the byways of memories, dreams, affairs and murders. The pages fly fast and I was so involved in this story - until the abrupt end. The publishers strongly encouraged all the ARC readers to discuss the book with the hypey #WTFthatending. Well, I guess that is an appropriate hashtag, but it goes either way. I detest the ending. Such a cheap gimmick. It's like having your mouth all set for a T-bone steak and it morphs right on the grill into a shape-shifting slice of frozen pizza. I know there are thousands of reviews out there on this book and my opinion appears to be in the minority. Not gonna lie, the ending of the story was like a sucker punch to the gut and I actually got angry. I tossed the book on the floor and didn't even bother writing a review for it. I felt used and abused as a reader.I live for plot twists. I love when authors write from different points of view. Heck, I want SHE LOVED PLOT TWISTS written on my tombstone. Not only that, but BEHIND HER EYES has a couple of unreliable narrators- my absolute favorite literary device! How could all these elements be in this one book, yet go so wrong?The ending of this book is more of a deus ex machina than anything else. Deus ex machina is a Latin term meaning \"god out of the machine.\" It refers to an unexpected, artificial or improbable character, device or event introduced suddenly in a work of fiction to resolve a situation or untangle a plot. It is disappointing to me that a writer of Sarah Pinborough's caliber would end such a great story with a cheap plot device. There is barely a hint of where the book is going until the last few pages and then ridiculously, hideously its over. CRAZY TOWN!!"}, {"userName": "Debra", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "This is how you write a psychological thriller!!!!! Holy Hell! I DID NOT SEE that ending coming. Please, Please, Please, READ this book but do not read ahead!!!! Do not peek (or scroll) to those last remaining pages, Don't spoil it for yourself. I LOVE when a book can take me by surprise. I read A LOT and when a book can pull off a Mind Fuck like that - I love it!!!! First off, this book grabbed me from page one and did not let go and by then end I was excited - not sure if this is correct. I was elated that this book totally blew me away.Louise is a single Mom who does not have much excitement in her life. I wanted to whisper in her ear for her to strap herself in because things are going to get real interesting real quick. She goes to a bar one night and meets an interesting man, David. It is not like her to flirt but they hit things off instantly and they shared a passionate kiss. Finally she has meet someone! Her excitement is dashed when her new boss starts work the next morning and she quickly learns that her new MARRIED boss is David, the man from the bar with whom she felt an instant connection. Embarrassed they both acknowledge what happened between them and agree to have a professional working relationship. But then, Lousie runs into (literally and physically) David's elegant and beautiful,wife, Adele. To make things even more complicated she also feels a connection to Adele. Adele and Louise become friends. It appears that both women have sleep issues and helps cement their bond. Louise really enjoys their friendship. Adele seems to really enjoy Lousie's friendship. Talk about being torn, Louise can't keep her eyes and her hands off David. David can't keep his hands off Louise. David and Adele clearly have a strained and toxic relationship. David, who seems so warm and loving to Louise, is controlling and hostile to Adele. Adele seems fragile and afraid of David.As Lousie attempts to have a relationship with both - without the other's knowledge - it becomes obvious that not everything is as it seems. Who is telling the truth? Something is very, very wrong in David's and Adele's marriage. What will happen when the \"truth\" comes out?I thought I knew what was happening and how the book was going to end. Boy, oh boy was I shocked. Not everything or everyone is as they seem. Just when I felt I know what was happening, the Author picked up the plot and shook it up a couple of times. There are parts where the reader needs to suspend disbelief. Things get a little out-there in a metaphysical sci-fi way. But DO NOT let that stop you. I would not have picked up this book if not for a book club challenge (thank you KUYH). I LOVED this book. It was my first book by this Author and it will NOT be my last. I HIGHLY recommend this book! Books like this one are why I love reading so MUCH! The suspense was spot on. This was a delightfully dark page turner for me. See more of my reviews at www.openbookpost.com"}, {"userName": "Victoria Schwab", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/1695365-victoria-schwab", "userReview": "I was so convinced I had this one figured out. I was wrong."}, {"userName": "Julie", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Behind Her Eyes by Sarah Pinborough is a 2017 Flatiron publication. The reviews for this book were amazing for the most part, so I was eagerly awaiting my copy from the library. In the meantime, I got acquainted with the author by reading “Mayhem”, which was pretty good, and made me even more excited about delving into this one. The book gets off to a sinister start because Adele and David are obviously having a hard time in their marriage. David appears to be the classic abusive control freak, while Adele is the docile, reclusive, stay at home wife. Enter, Louise, David’s new secretary and suddenly a highly unusual triangle develops between the three of them. Louise suffers from night terrors and Adele helps her find a way to control them as their friendship continues to develop, despite the fact that Louise and David are carrying on together. As Louise gets more involved with the couple, she begins to understand there is something very wrong going on and finds herself caught in their web. If you have read any other reviews of this book, you will have no doubt heard about the surprise, ‘what just happened’ ending. While the majority of people have praised the conclusion,and I admit it was a total shock, I was mostly irritated by it, although as crazy as it was, it was also pretty chilling.  The buildup of suspense was very effectual, and the characters were well drawn for the most part. I was fully engaged in the story, which is certainly a mind trip, even before the ultimate shock ending, but I have to say that instead of feeling wowed, I was underwhelmed by the sucker punch twist. Still, I have to give the author kudos for pulling it off without a hitch, and I do ‘get’ why some people were impressed by it and why they have been raving about this book. The writing is stellar, but while I would love to say I really enjoyed this one, sadly I did not. So overall, this on gets a 2.5 rounded to 3."}, {"userName": "*TANYA*", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "I'm torn up about this book...the beginning was good, the middle dragged and that ENDING??!!? Is it just me or should some of the genres associated with this book include fantasy or perhaps paranormal??? Somebody tell me what I just read!!! Lol."}, {"userName": "Malia", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/5953660-malia", "userReview": "When a book comes with the hashtag #wtfthatending, I am intrigued and slightly dubious. However, in the case of Sarah Pinborough's latest, Behind Her Eyes, the hype is justified.The story is told by Louise and Adele, two women who meet after Adele's husband, David, takes a new job at a doctor's office where Louise works. Louise is a single mum, newly divorced and a bit down, and she is quick to form a deep tie with Adele. Yet, she also quickly notices something is quite odd in Adele and David's marriage.There is so much I want to say about this book, but I won't because too much information would just spoil it, even though that ending is so unpredictable!There is an element of the supernatural in this story, which can really backfire, but in this case, it reminded me of Rosamund Lupton's, Afterwards, where it worked perfectly to built the eerie atmosphere and deliver a shocking ending. I had guessed a part of it, but the final twist was totally twisted and unexpected, but when I went back a little, the clues were sort of there, which makes this book all the more inventive and clever.This story was definitely an original, smart page turner, and I can't wait to see what the author comes up with next!I was thrilled to receive and ARC of this book by Flatiron Books in exchange for an honest review.Find more reviews and bookish fun at http://www.princessandpen.com"}, {"userName": "Melisa - Traveling Sister", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/42481357-melisa---traveling-sister", "userReview": "I don't even know what just happened. #wtfthatending is right. All I'm gonna say is suspend your disbelief and go along for the ride. That is hard for me to do too, just do it and you will be pleasantly surprised. That is all."}, {"userName": "Skyler Autumn", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/12859342-skyler-autumn", "userReview": "[ THE ENDING!!! What the fuck. I was reading a thriller not a fantasy. Might as well have had a unicorn make a guest appearance if you want to completely dismiss logic. When someone tells you, you will in no way guess the ending. That is absolutely true because at no point will you think this book will leave the world of reality and become about Voodoo magic. WHAT A CHEAT ENDING!! I bought a thriller not a fantasy novel. Suddenly I'm suppose to go oh my god how did I not guess magic. It was magic all along!! LIKE REALLY?!?! It's suppose to be a domestic thriller not an episode of CHARMED!  (hide spoiler)]"}, {"userName": "Holly  B", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/39749481-holly-b", "userReview": "NOW I understand the Title!You have to read until the very last page to learn the final \"twist\". I really enjoyed this mystery/psychological thriller and wanted to find out what was going on in Adele and David's marriage. I \"had\" to find out! I was turning pages quickly and very interested in what Adele was \"up to\" . Was she hiding something? I was so curious about Adele and wondering if something was really wrong with her! She is quite the actress .I was totally invested in the story until the end. It is full of \"secrets\" and I just wanted answers. I had to keep reading to try to figure out who the manipulator was and this is a must for a good book for me.This is one you won't want to \"skim\" or you might miss something! You won't be disappointed. I kept thinking \"what if this could happen\" while trying to fall asleep the first night that I finished the book. Terrifying!! The thought stayed with me for many weeks! I loved this thriller, Shocking end!! It is in my top reads of 2017."}], "description": "Louise vorrebbe dire ad Adele tutta la verità, anche se si sono appena conosciute. Anche se Adele le sembra una donna così fragile, tormentata com'è dall'insonnia e dalla solitudine. Louise vorrebbe dirle che quella sera, al bar, quando è entrato quell'uomo, lei ha provato qualcosa che, nella sua vita di madre single, non provava da tempo. Vorrebbe dire ad Adele che le dispiace di averlo baciato. E che non poteva sapere che quell'uomo era suo marito.Anche Adele ha i suoi segreti. Non fa parola della nuova amica con David. E nasconde a Louise ciò che accade quando, nella loro splendida casa nel cuore di Londra, lei e il marito sono finalmente soli dietro porte chiuse. Così come ogni giorno, da anni, Adele nasconde a tutti quello che accade nella sua mente. Là dove nessuno può spiarla.Perché tante bugie, si chiede Louise? Divisa tra il suo fascinoso amante e la nuova, bellissima amica, soffocata dal castello di menzogne che lei stessa ha costruito, Louise dovrà trovare il coraggio di guardare dentro il matrimonio di Adele e David. Sapendo che le verità più spaventose si annidano nella mente, dietro quegli occhi che Adele, insonne, non chiude mai.Dagli stessi agenti di Paula Hawkins, arriva in Italia il nuovo fenomeno del thriller, una travolgente storia di amore e ossessione, con un finale impossibile da indovinare. Mantenete il segreto. E preparatevi a non dormire la notte.", "title": "Dietro i suoi occhi", "url": "http://www.goodreads.com/book/show/35610051-dietro-i-suoi-occhi", "average": 3.75, "cover": "https://images.gr-assets.com/books/1499328483l/35610051.jpg", "reviews": 7880, "authors": [{"url": "https://www.goodreads.com/author/show/457300.Sarah_Pinborough", "name": "Sarah Pinborough"}, {"url": "https://www.goodreads.com/author/show/15845962.Rachele_Salerno", "name": "Rachele Salerno"}], "type": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/35610051-dietro-i-suoi-occhi", "http://www.goodreads.com/book/show/28965131-behind-her-eyes", "http://www.goodreads.com/book/show/31285838-behind-her-eyes", "http://www.goodreads.com/book/show/33230997-behind-her-eyes", "http://www.goodreads.com/book/show/34118869-behind-her-eyes", "http://www.goodreads.com/book/show/34098205-behind-her-eyes", "http://www.goodreads.com/book/show/26842622-13-minutes", "http://www.goodreads.com/book/show/17185863-poison", "http://www.goodreads.com/book/show/17213020-mayhem", "http://www.goodreads.com/book/show/23566382-the-death-house", "http://www.goodreads.com/book/show/17899321-charm"]}