{"ratings": 2416360, "userreviews": [{"userName": "Wigs", "userReviewDate": "Dec 03, 2011", "userURL": "http://www.goodreads.com/user/show/4719641-wigs", "userReview": "[AND WHY DID YOU KILL WILL? WHY? YOU SHOOT ERIC IN THE FOOT, PETER IN THE ARM, PEOPLE YOU HATE, BUT THEN WILL, ONE OF YOUR ONLY FRIENDS, IN THE HEAD? IT WASN’T EVEN A RAGE KILL. YOU SPECIFICALLY TOLD US YOU AIMED AT HIS HEAD. RIGHT AFTER YOU SAID YOU KNEW IT WASN’T HIS FAULT. RIGHT BEFORE YOU SAID YOU NEEDED TO WAKE UP ALL THE DAUNTLESS AS THEY DIDN’T KNOW WHAT THEY WERE DOING. OH YEA THAT’S RIGHT WE NEEDED A KILL-YOUR-FRIEND SCENE. CUZ THAT’S WHAT HAPPENS IN THESE STORIES, RIGHT? (hide spoiler)]"}, {"userName": "Nataliya", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "[Tris on purpose nonfatally shoots two bad guys (one of whom tried to actually rape her and kill her) - but kills one of her friends (who was mind-controlled via the actions of one of the aforementioned villains) on purpose, when a disabling shot would have worked just as well. And she shoots her friend AFTER she thinks she won points with God by not killing the villain.  (hide spoiler)]"}, {"userName": "Tatiana", "userReviewDate": "Jan 26, 2011", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As seen on The ReadventurerWe all know why Divergent was written. There is no doubt 99% of dystopias published during the last year or so have been trying to at least partially replicate the success of the trilogy. Public wants to read more dystopian stories, publishers want to sell them, authors want to write them. Everyone is happy. I have read a few new dystopias recently and liked or disliked them to various degrees. There are dystopias for any taste, dystopias that emphasize separate aspects of the trilogy. There are dystopias that bank on romance (Matched or Delirium). There are dystopias that take the shock value route (Wither). And then there is Divergent that caters to the crowd who wants more action in their dystopias. And action this novel delivers!In a few words, Divergent is a one long initiation trial. Beatrice Prior is a member of a society that has been maintaining its peaceful existence by separating its citizens into 5 distinct factions. These factions are formed on the basis of virtues they cultivate in their members - Candor values honesty the most, Abnegation - selflessness, Dauntless - bravery, Amity - peacefulness and Erudite - intelligence. At 16 all citizens take a test that is supposed to help them decide if they want to stay with the faction into which they were born or transfer to another faction forever. Beatrice's test results are inconclusive and puzzling. Ultimately she decides to abandon her own faction (Abnegation) and her family and enter another (Dauntless). But of course, the transfer is not easy. The initiation trials are grueling. Divergent is essentially a depiction of Beatrice's road to becoming a Dauntless, both physically and emotionally. Beatrice's unusual test results come to play too, and in a major way.This emphasis on multiple trials and exercises is the strongest and the weakest part of the story. Veronica Roth has a special talent for writing great fighting scenes, pulse-raising and adrenaline-pumping scenes. Her imagination in terms of inventing different tests and challenges seems to be limitless. Something exciting happens to Beatrice every day of her trials. But that is also the weakness of the story. About 85% of the book is dedicated to action and exercises. The actual story starts only around page 415 of this 500-page book. Only then stakes are raised and real action begins. If you ask me, 400-pages is a lot of prep to finally get to the meat of the story.Don't get me wrong, I liked the book (3 stars means \"i liked it\" on Goodreads). Divergent is good entertainment. I liked it, I was engaged in the story, I was even excited quite often. But something was missing for me. The novel has good characters, but they are not quite as interesting and compelling as they could have been; it has a lot of action, but the justification for the amount of violence involved is not quite adequate; it has a cute romance, but it never quite makes your heart contract in that sweet, painful way (you know what I am talking about, don't you?); the concept of factions is a unique one but not quite plausible; the explanation what a Divergent actually is is not quite climactic; finally, except for one plot twist (p 415), the story takes a rather predictable road.I liked Divergent. I liked it more than Matched, Delirium or Wither. I liked it less than Blood Red Road or Ship Breaker. It entertained me. It promotes all the good things - bravery and self-sufficiency, friendships, honesty, determination. It is all about girl empowerment. But as the same time it isn't particularly thought-provoking or chilling. It never truly touched my heart. It is a write-by-numbers dystopia.The verdict? I guess, you'll have to see for yourself?P.S. While I am on the subject of dystopias and have your attention, I want to recommend one of my most favorite dystopias that doesn't get nearly as much acknowledgment as it deserves. Please, check out Neal Shusterman's Unwind \nYou will not regret it."}, {"userName": "mark monday", "userReviewDate": "Jun 21, 2013", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "Dear Hunger Games,I miss you. I really do. Our relationship is over and done with but the memory of you still lingers on. I know that's a terrible cliché - and you hate clichés - but it's a true one, at least in this case. I don't think I'll ever be over you. You are fucking special.It took me some time, but I finally met a new girl. Her name is Divergent. She's quiet and strong and short-tempered and insular and brave... a lot like you, I suppose. But is she really? This is hard for me to admit but I think I was initially attracted to her because she reminded me so much of you. I know it's not fair for me to think this way, I should be looking at her on her own merits. At the very least I could have looked at the relationship as a fun rebound and not as a search for a replacement you. Easier said than done. I loved you, I love you, I'll always love you... and I'm not sure I even like her.First of all, she copies all of your moves and all of your traits. It's so obvious. It's clear she's modeled her whole life on you and what you've achieved. At first that similarity is what caught my eye about her. And she is an exciting person, she's always hurtling forward, she barely stops to take a breath. I like that. But in the end, there's also a fakeness and even a kind of desperation. She's not you, not even close. Why can't she be her own person?Unlike you, she's really into guns. I know you see the necessity of guns, sometimes, but I also know you don't see them as an answer. I didn't mind her love of guns at first - I kinda like guns, I'll admit that. But eventually I realized she was equating the use of guns with bravery. What the hell? On the one hand she says \"true bravery is selflessness\" but on the other hand she insists that she doesn't feel fully herself unless she has a gun in her hand. Ugh.She also has a thing against intellectuals. She finds them innately suspicious and they are the first kind of person she'll automatically reject. Honestly I don't know where that comes from. But it makes my skin crawl.With all the gun love and the anti-brains bias, she reminds me at times of my redneck relatives. Which is not attractive.The worst thing - and I know I'm about to sound like a real dick here - is that I've realized she is actually pretty stupid. She breaks people down into different groups, just like you do. But while you have a realistic, complicated perspective on class and power and economics and the media and self-awareness and how all of those things contribute to the boxes we put ourselves into, the decisions we make, who we are... she just divides people up into a handful of finite personality traits. Abnegation, Candor, Erudite, Dauntless, and Amity. it's such a ridiculous, shallow idea. My God, she even lumps adjectives and nouns together as her labels - as if they were the same thing! It's teeth-grindingly naive and yet this idea of hers is her whole foundation. Even worse, she seems to think that only the very rare person, the very special few, are able to combine these traits in relatively equal proportions. To be \"Divergent\". Sometimes I wonder if she's actually ever really known a person. Her theory is like something a child thought up.Okay now I'm feeling bad for bashing her so much so I'll say some good things. She can be pretty enthusiastic and, at her best, she can keep me up all night just having fun. Her insights about this guy Al (you don't know him and you probably wouldn't like him) are really surprising and deep. So she's not that shallow, not really. She has her moments. And just like you, she sure knows how to make some money.Still, I don't think I will be continuing the relationship. There's a new girl I've met named Daughter of Smoke & Bone. She seems really cool and smart and mysterious. I'm looking forward to getting to know her.But in the end, you know you'll always be number one.Much love,\nUPDATE 10/17/14: just saw the movie. it was awesome!"}, {"userName": "Elle", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/4090840-elle", "userReview": "[image error]"}, {"userName": "Kat Kennedy", "userReviewDate": "Aug 17, 2011", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "Today I almost attacked a man in public. A man who was yelling at and abusing his partner. Kicking the trolley, shoving her and screaming obscenities at her. I ditched the trolley I'd been pushing and stormed toward them, my mind blank of anything but ruthless fury.The next part was like out of some stupid romance novel. Mr Kennedy pulled back on my arm and said, \"No. There is no way you're going over there!\" He took off the baby sling, handed it to me and sent me to go put the groceries and baby in the car while he handled it.Usually that's the part of the novel where the female heroine swoons or something but I only got angrier. Did he just relegate me to child-minding and packing away groceries? Because I have a uterus? To say I was unimpressed would be an understatement.Never before have I actually wanted to be a man. I love being a woman and I think being a woman is a fantastic thing to be. But I wanted to kick that man's ass. I absolutely hated myself for being weak and puny. It's not fair. To not be able to fight your own battles, to not be able to stand up for weaker people when you want to. It's so, incredibly, painfully unfair. Why can't I have big muscles? Why couldn't Mr Kennedy wait by the car while I got to go up and play harpsichord with his lower intestinal tract? Why must I swallow my pride and accept that I'm just not as strong or muscular as Mr Kennedy?Perhaps it's that drive that made me connect so much with Tris. I wonder what kind of personality types would enjoy this novel? I've seen a lot of three star reviews and I just can't fathom why when this book was a solid five stars for me. Even with it's somewhat implausible storyline I loved it.I loved all the characters, especially Tris, for being a hardass, cold motherfucker when other YA protagonists would whither and melt into a gooey puddle of patheticness. Maybe I connected with it because I could absolutely imagine being Dauntless. Catching moving trains? Abseiling? Fighting? Sign me up now. I think I would have loved every minute of it.The writing was quite smooth and the action sequences were clear, concise and well-explained. The pacing and the plot never really give up, making this book difficult to put down. Over all, I thoroughly loved this novel. I'm hard-pressed to come up with any flaws or issues that annoyed me.Most of all, it made me wish I really could kickass and take names like Tris does. Perhaps taking up kickboxing would be a good place to start.Don't forget to check out my blog, Cuddlebuggery, and add me on twitter!"}, {"userName": "karen", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[fucking BUTTER KNIFE in THE EYE!!! (hide spoiler)]"}, {"userName": "Rick Riordan", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/25375513-rick-riordan", "userReview": "I definitely enjoyed it. At first, I had trouble convincing my older son to read it, because he was convinced that every dystopian novel is a \"Hunger Games\" wannabe, but he read it on a recent plane trip and we had a great in-depth discussion about the characters and their motivations.The premise: Chicago of the future is a closed city-state. The citizenry really doesn't have any idea what is beyond their borders. They just know it's dangerous. Inside the city, humanity is divided into five factions based on moral imperatives. Candor, for instance, values truth above all else. They serve as lawyers and public speakers. Erudite values knowledge. They serve as teachers. Abnegation values self-denial and community service. They are the community's leaders, since they alone can be trusted not to be power-hungry.Our heroine Tris is born into Abnegation, but during her choosing ceremony at age sixteen, she decides to join the Dauntless, who value fearlessness and serve as the society's soldiers and guards. The novel follows her through her initiation training, during which Tris discovers that their society is not as harmonious as she once believed. Making things even worse, Tris must keep her true aptitude secret. She is in a small minority of people who are divergent -- whose skills could suit them for more than one faction. What this means is not at first clear, but it will make Tris's life very dangerous."}, {"userName": "Hannah", "userReviewDate": "Dec 12, 2011", "userURL": "http://www.goodreads.com/user/show/2411388-hannah", "userReview": "THE SEVEN STAGES OF READING HELL: When You Realize You're Going to be the Odd Man Out (Once Again) With a Wildly Hyped and Popular Book that Everyone Else Lovedas Presented by:The Coterie of Emotive Kittehs (courtesy of Google Images)December 13, 2011Page 30:Page 77:Page 145:Page 270:Page 354:Page 404:Page 475:Final Analysis of my Reading Experience:(What? You didn't think I was going to show a kitteh with a knife in its eye, did you?)Rating: A (Very) Generous 1 StarThe Moral of this Review:I should not read any more YA dystopian novels.THE END"}, {"userName": "Reader-ramble", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/9590328-reader-ramble", "userReview": "Okay, so the movie came out on disk, and I was surfing one of my favorite channels on YouTube, when I found this video by CinemaSins. It's a fun and irreverent bit of criticism. Enjoy!Since I managed to get 100 likes before the movie came out, I will be reviewing Insurgent and Allegiant in the future. It may be a while though. Life is a bit in the way.Okay, time to get serious. I wish I could be funny like my Mortal Instrument reviews, but my intellectual has kicked in because this book manages to be defined as part of a genre that I have always adored, especially in short stories.Before I begin, my usual disclaimer that this review will contain logic, griping, complaining, spoilers, and the general deconstruction of everything that the fans hold dear. If you wish to berate me for this, don't waste your time. Nothing you say will convince me. This book is just that bad.So, my initial reaction was thus:Dramatic, I know. But not as dramatic as wanting to take a shot gun or lighter to a library book. I'm at least glad I didn't pay for it.To get into the mood, some foreplay.Beatrice - the main character - lives in a Chicago where everyone is divided up into six groups. The Abnegation (selfless people), Dauntless (brave people), Erudite (intelligent people), Amity (friendly people), Candor (honest people), and the Factionless. When a child reaches sixteen, they must take a test that will tell them what faction they belong into, but then they still get to pick the faction. Now, each faction has a specific lot in life.Let's break it down, shall we?Abnegation: (Noun) The act of instance of abnegating, or denying oneself some rights, conveniences, etc. This is Beatrice's faction. They are supposed to be entirely selfless. They wear all gray, eat insipid food, and everything is considered self-indulgent to them. You could say they are beyond Amish. Oh, and every member of the government is Abnegation. Every member. Yeah. They're referred to as \"selfless leaders in government\" at one point, but when is it ever smart to have one faction in control? Here is the kicker, they aren't the bad guys. They actually don't do anything wrong that an oppressive regime would do, like make the rest of the factions give up \"indulgences\" or go to mass every day. They are doormats.Dauntless: (Adjective) Not to be intimidated; fearless; intrepid; bold. This is the faction Beatrice joins. They are defined as \"protection from threats both within and without.\" They are the security forces of Roth Chicago. The truth is that the Dauntless are reckless idiots. Their transportation is a train that never stops, so they must jump from it. They dye their hair, get piercings and tattoos, and wear tight clothes. They are more like rebellious high schoolers than a militant force. I'll write more about them later since the reader spends the most time with this faction. I'll at least add that they are proof of Roth's lazy writing.Erudite: (Adjective) Characterized by great knowledge; learned or scholarly. The faction Beatrice's brother, Caleb, joins. The book defines them as \"intelligent teachers and researchers.\" If a society could have and R&D department, this would be it. I'm sad to say that smart people are not depicted well in this story. They are shown to be smug, mean, and power hungry. There are no scientists who understand that scientific break-throughs are a double edged blade; one side will do good and another evil. This faction is the bad guy because they believe the Abnegation are holding back prosperity and progress. That would make sense if their way of going about it wasn't so stupid. Slander and brainwashing never works in the end.Amity: (Noun) (1) Friendship; peaceful harmony. (2) Mutual understanding and a peaceful relationship, especially between nations; peace, accord. Book defines as \"understanding counselors and caretakers.\" They do the farming and smile a lot. That's the extent of it.Candor: (Noun) (1) The state or quality of being frank, open, and sincere in speech or expression; candidness. (2) Freedom from bias; fairness; impartiality. Most of Beatrice's fellow Dauntless initiates are from Candor. The book defines them as \"trustworthy and sound leaders in law.\" Yes. They are all lawyers that we know of. They're supposed to be honest people, but they're honest to the point of being rude and come across as being quite judgmental. They also dress like Mormon missionaries because they believe the truth is black and white. How has a faction full of completely honest people not killed each other already? It would be like living with a bunch of Sherlocks in a John Grisham novel.The Factionless: Those that did not pass the initiation for their chosen factions or dropped out. They are essentially homeless day laborers who are paid in food and clothes. They live in old subway tunnels. No body loves them or wants to be them. The only thing people fear more than being factionless is the prospect of war. No executions or murders or anything like that. Just being factionless and an abstract idea of war. I have a headache now.Okay, now that we have the basics, what is the economy like? Oh, Roth doesn't tell us. Then what world shattering event led to the formation of the factions? It says they were formed by different people who believed those were the most important traits, but not why? No bad weather. No nuclear war. No civil war. No raising tides. Nothing. Nada. Then why is Lake Michigan an effing marsh? Not only that, but do you know how many cities there are on the edges of Lake Michigan? How are they not fighting Chicago over water if it's scarce?Okay. Okay. Maybe I'm over-thinking her TOTAL LACK OF WORLD BUILDING. I mean, I've seen more world building in short stories, and the short story format isn't even set up for world building. Despite the little bit of information on the factions, the reader knows almost nothing about this society Roth has set up. None of it makes a lick of sense. If I sat down and mapped out how the different functions interacted and what held them together, there would be squat. It's more entirely dysfunctional than a dystopia. And what makes a dystopia exactly?I believe this paragraph from John Joseph Adam's Introduction from his anthology of dystopian short stories, Brave New Worlds, sums it up the best:\nThe roots of the word dystopia, dys- and -topia, are from the Ancient Greek for \"bad\" and \"place,\" and so we use the term to describe and unfavorable society in which we live. \"Dystopia\" is not a synonym of \"post-apocalyptic\"; it also is not a synonym for a bleak, or darkly imagined future. In a dystopian feature, society itself is typically the antagonist; it is society that is actively working against the protagonist's aims and desires. This oppression frequently is enacted by a totalitarian of authoritarian government, resulting in the loss of civil liberties and untenable living conditions, caused by any number of circumstances, such as world overpopulation, law's controlling a person's sexual or reproductive freedom, and living under constant surveillance.\nNow, I would love to put almost the entirety of Adam's tiny essay here, but there isn't enough room for it with this stinking word count limit. My point is, Divergence isn't a dystopia.\"But what about Tris being a Divergent, and not being able to see her brother, and being torn from her family? How is that not a dystopia? It's bad!\"Not necessarily. You see, because the Abnegation run the government, technically they can control the other factions, but they don't. They're inept. They actually have no way to enforce the rules that everyone follows. They have no security force of their own, or punishments. This society could not exist because it could not function.\"But the Erudite were in charge! And the brainwashing!\"The Erudite weren't in charge at first, and even then, not everyone would have been behind it. Also, the Abnegation's viewpoint on the world doesn't give them the back bone to push against at least three factions of obnoxious individuals. They should have toppled from power generations ago, but since Roth never gives us an idea about how long her Chicago has been around, the reader doesn't know. This society is not plausible. At. All.Watch. Get five friends together and each have them represent a faction. Then have Selfless tell Intelligence, Honesty, and Muscle what to do. Think about it. Even the US Armed Forces push back against Congress. \"But she explains all your gripes in Insurgent.\"Then let me talk about Tris, the main character.She is the daughter of an Abnegation government official. She is small for her size and built like a boy. She wishes she was more selfless like her family, but instead lies and wishes vengeance on just about everyone that hurts her. She is a giant hypocrite.Take her fight with Molly after she's \"pantsed\" in the dorm. Tris keep's kicking her while she's down out of vengeance. That is just petty and mean. If she keeps wishing she's selfless, that would be a moment where she could demonstrate it. And Al after he apologizes for trying to hurt her, she doesn't forgive him. Tris is a horrible, horrible person. She isn't Divergent. She's Dauntless through and through. She is not selfless, honest, smart, or friendly. She's suspicious, spiteful, and dense. If she was the least bit pretty, I'd get why Four was into her. But she isn't, so I don't.And that brings me straight to our hunky hero who is oh, so dreamy. He's a virgin, hot, wounded, and mysterious. He only has four fears. That is why he has a nickname reserved for science experiments. Isn't he the best!Four has about as much life as a Ken doll. Probably the genitals of one too. His real importance is that he's also a Divergent.Now I will talk about Divergents and the nuances of Dauntless now that I've brought up Tris and bitched about how this is not a dystopia.I've already said that Dauntless were crazy people that do stupid stuff to seem brave. Roth tries to make the initiates go through a difficult training regimen, but they only beat on each other. There is no learning of throws, holds, or grabs. No learning of efficient ways to take down enemies without killing them or brutally beating them. Roth doesn't even know that most fights are won in the grapple. It's like she did no research about how to train security based forces what so ever.It's even more apparent when she brings in guns. Yes, guns. To Roth, they are never rifles or pistols. They are never semi-auto or bolt action. She doesn't even know what a magazine is. Need an example?\"She pushes the bullet chamber open and peers inside. Seeing how many bullets she has left. Then takes a few out of her pocket and reloads.\"Unless the gun is a revolver, which is unspecified, the magazine would have to be removed to see how much ammo is left and to reload it. And if I'm running around with a semi-auto pistol, I would try to carry loaded magazines with me instead of individual bullets if possible. Seriously, just the technical knowledge alone was torture to get through. I don't need to know how to field strip a P-90, but at least the basics is needed when you are writing about a militant faction.And the Divergent thing. Basically, they can't be brainwashed. Roth tries to justify it wish an explanation given by Tris' mom:\"But our minds move in a dozen different directions. We can't be confined to one way of thinking, and that terrifies our leaders. It means we can't be controlled. And it means that no matter what they do, we will always cause trouble for them.\"Do you see the problem with that one? Do you?First off, they are Abnegation. THEY ARE THE LEADERS.Second, I don't think Roth has ever read 1984, Brave New World, or Fahrenheit 451 where a bulk of the population's way of thinking was quite successfully controlled through fear or bliss. Sure, there were a few outliers, but in two of the three, they were dealt with through discreet means. And the sad thing, all three of those futures have come true in some sense or another. We will never come anywhere close to the world depicted in Divergence.So, to sum it all up because I don't have enough words to keep going into the massive problems this book has, don't bother. Read The Hunger Games if you haven't yet (even though I thought Collins kind of dropped the ball in Mockingjay). Or you could pick up the anthology I mentioned earlier since it has awesome dystopia shorts written by women like Shirley Jackson, Usula K. Le Guin, and Carrie Vaughn. Or read anything else really.And if anyone wants me to do Insurgent, I would have to get 100 likes on this review. Even if I do, I can't guarantee this wouldn't happen after I read it.So it's been fun. I'm going to go bleach my brain now.Edit 8/16/2013: There is this thing I've been thinking of for some time now. The Dauntless are always trying to have these kids get rid of fears. There is this saying that I think people should keep in mind, \"Those without fear are missing a good friend.\"If you don't quite understand it, it means that those who are fearless don't have an important survival mechanism. Fear is what stimulates the \"fight or flight\" response that sends adrenaline coursing through our veins. Bravery is controlling your fear, utilizing it, not getting rid of it. It really bothered me that this book interpreted bravery as the absence of fear. Bravery, courage, is taking a step forward and facing the thing that makes you want to piss yourself and dive for cover.But fear should also be listened to. If someone says you have to jump off a building to prove yourself, and you know you could die, true bravery would be to look them in the eye and tell them it's stupid and pointless. It's to stand up for yourself.Take the fact that Four turns down the position that Shower Curtain (Eric) takes over. That was cowardly. It would have been braver for him to take the position so he could protect the students from the corruption. He could also try to dismantle the corrupt from the inside out. Yeah, it's more dangerous, but if this book is supposed to be about utilizing your fear for change, then that would have been a perfect little parallel sub-plot. It's a shame Roth isn't a more talented writer."}, {"userName": "Emily May", "userReviewDate": "May 31, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Okay, okay, I completely understand why people could really like this and also why people could find it a huge disappointment. As for the latter... well, this was one of the most highly anticipated works of dystopian fiction to be released this year and the fact of the matter is that it just really doesn't work as a dystopia. Or, at least, what seems to be the general definition of a dystopia.I can highlight the problem really well by referring to a conversation I had with my mum when she saw the book lying on the table.mum: ooh, what's this book about?me: I haven't started it yet but it's supposed to be a dystopia.mum: [blank look] ??????me: you know, like The Handmaid's Tale or 1984? Basically, it's where the author imagines a hypothetical world that's usually set in the future and takes a relevent political or social issue or issues and creates a fictional society that could possibly be what might happen if humanity was to follow a certain idea or movement or perhaps even carry on behaving the way they are. For example, failing to improve the world's environmental problems. [okay, that was a load of B.S. and I never talk so lah-di-dah with my mother, but the ideas were all the same]....................................................................................................................Anyway, the point is that Divergent has no political or social relevance and the fictional society is just not going to happen in a million years. If it was marketed as a fantasy, then perhaps you have something here. The world that the author has dreamt up is fantastical and too unrealistic for a truly good dystopian novel, the idea that there would be five factions who all believe the world's problems are down to one main issue that differs depending on which faction you consult is ludicrous... I mean, if only there were just five different opinions of what's wrong with the world.And again with the bizarre: Dauntless. This is the faction that is in the limelight here and it has to be the most stupid of the lot. 1) They think the world's problems can be solved by combating cowardice. That isn't even remotely believable.2) They think that the way to prove their bravery is to jump off trains and beat each other up and almost get themselves killed for the sake of proving that they're not afraid to get themselves killed. Stupid, stupid, stupid. What's the point?This isn't dystopia, it means nothing, it sends no message, it won't ever happen.Alright, here it is: I COULD NOT PUT IT DOWN!!I know, I'm ashamed, I'm a traitor to real dystopian fiction everywhere. But I found the story so addictive, the characters so interesting and I was even completely won over by the intricate mysteries beneath this godawful stupid society that would never happen. I cared what happened to Tris and I cared whether her and Four would get it on and I cared what would happen if the factions went to war. I was hooked on this crap and I simply cannot deny it!I think they should have just said it was a fantasy and it would have all been alright. I could forgive the stupid pretend world because in a fantasy pretty much anything goes. I know... I don't get it. I was reading this book and people were jumping off trains and punching each other in the face as part of pointless activities and I was thinking \"damn, that's stupid\" whilst my next thought was \"gosh, I wonder what's gonna happen next\". I had to read on. I still have to read on because somehow whatever happens in Insurgent has suddenly become very important to me.I even liked the love story. Not that I don't like love stories normally but I usually give any dystopia or science fiction a hard time for having to squeeze a romance in there to make the book complete. But I was there with it. I liked both characters, I wanted it to work out. It's weird because Tris actually becomes increasingly hard and selfish as the novel moves on... but strangely that's an important part of her coming to understand that you cannot live selflessly in a competitive world and that, though others matter, sometimes you do have to put yourself first. I really liked the changes and development of her character.So, there you have it. It's a shitty excuse for a dystopia but I found it an extremely enjoyable read."}, {"userName": "Wendy Darling", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[The eye! The eye! Oww. :-O And poor Will, of course. (hide spoiler)]"}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "I'm going to do something that I have never done before. I'm going to rate this book lower than every single one of my Goodreads friends. Do you know why? Because I hated the CRAP out of this book. Now what follows might offend some lovers of this book. To \"Divergent\" fans: I'm sorry I'm going to rip on one of your favorite books. But honestly I almost wish I had this in paperback form so I could get the satisfaction of throwing it in the garbage. With gusto. Or maybe the fireplace...Let me start with the \"world building\", which I put in quotation marks because the world building here is some of the laziest that I have ever seen. Basically, the author explains that the society was split up into five factions, Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent), because of... reasons. Something vaguely alluded to a war and the factions splitting up bringing peace. Then all the world building is dropped. It just is. The splitting up into factions made absolutely no sense and it wasn't further explained at all.On to the absolutely ridiculous way the factions were described. It was like a pre-teen girl was describing what was \"cool\" or \"dangerous\" or \"boring\" when the factions were given their unofficial dress codes. The Dauntless wore tattoos and black, because, you know, black is sooooo fearless. Also they had lots of piercings, which obviously translates to the recklessness of the Dauntless faction because God forbid the smarties get a piercing! And the Abnegation wore gray because gray clearly means you care for others. It was like a joke it was all so stupid.Speaking of the Dauntless, what the F is with them and their trains? Is there any purpose of these trains? I know there are cars in this world so why don't the Dauntless drive cars? Do they want to be hobo-chic? They are always jumping on and off their trains. Is there is schedule? It seems mighty inconvenient. And these trains never seem to stop? Who designed this horrible system. And why do the Dauntless live underground? Because they just felt like it??? Another case of the horrible world building... *gah* And the totally pointless initiation process of the Dauntless? TOTALLY pointless! It wasn't like \"The Hunger Games\" when the games actually served a purpose, these initiation fights and trials seemed so trivial that I couldn't care less one way or another what happened in them. It was dumb, dumb, dumb. *bangs head on wall*I have to get to my mother of all pet peeves about this book: the idea of people being Divergent, or basically more than one faction. This has to be one of the most poorly executed concepts in the history of dystopian fiction. I have to ask, why is Tris so freaking special?? Multiple times it is mentioned that you can be shown to have an aptitude for one faction yet get initiated in a different one of your choosing. So wouldn't those people be Divergent????? If you can hack it in more than one faction, don't you possess the traits of both of those factions? Also, the transfers from other factions still possess traits of their home factions. Candors still tell the truth, Erudites still spout knowledge, and so on and so forth to infinity. So what made Tris such a special snowflake?? Why is she Divergent when the rest are just brushed aside??? I can't, I can't even...And the romance... just NO. It felt so forced that it made me uncomfortable. We get almost no character development from Four and he had about as much chemistry with Tris as oil and water have together. It was painful, just painful.Tris herself was also a terrible character. I didn't care for her at all. She was judgmental and irritating and NOTHING that I want in a heroine. I was so annoyed with this book that the killings (which made no sense, by the way, because they seemed to serve no purpose, unlike in Red Rising or The Hunger Games) failed to move me at all. I didn't care one iota. Does that make me a horrible person?I'm mad I wasted precious reading time with this book. I'm mad it is almost 500 pages of garbage. I'm mad that I'm the only one of my friends that hated it so I have no one else on my side. I give up."}, {"userName": "Steph Sinclair", "userReviewDate": "Mar 25, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "[Four (hide spoiler)]"}, {"userName": "Arlene", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "[as we learn his real name is Tobias and the reason they call him Four is because there are only four fear factors in his character (hide spoiler)]"}, {"userName": "Lyndsey", "userReviewDate": "Sep 16, 2010", "userURL": "http://www.goodreads.com/user/show/4224396-lyndsey", "userReview": "Everything that rises must Diverge.Or that seems to be the philosophy of this book. Divergent poses that as a society progresses, it becomes more segregated, as opposed to more integrated. Likely? NO. Fun? HELL YES.Does it smell like Hunger Games in here to you?Check out the video for this Hunger Games parody at the end of the article Part Two of The Best YouTube Book Trailers.Imagine a culture where everyone is separated into groups based on their one key defining character trait.One of these five traits: Honesty. Selflessness. Intelligence. Bravery. Peacefulness.We all know that honesty is the best policy and that money is the root... YAWN!! We want to know about those dystopian shenanigans!Some of the Dystopian Shenanigans in Divergent * Jumping off moving things. * Jumping off tall things. * Climbing tall things. * Making out with a camp counselor, I mean, another member of Dauntless. Haha, whoops, just got, um, confused there for a second. *clears throat* I wouldn't know anything about making out with a camp counselor. Because, yeah, who does that?Beatrice Prior is a member of Abnegation, the selfless, but she dreams of another life. One where she can look at her own reflection without being scolded or dress in something other than a gray potato sack (Fine, they don't actually wear potato sacks, but it sounds like they might as well have). So she chooses to join Dauntless, the fearless and brave, and her life, as well as her disappointed family's, is forever altered. Now known as Tris, she gets thrown into a world of speeding trains, speeding bullets, and unusual looking lead male characters.You want to know about our Dauntless hottie?Here are a few snippets of description: The corners of his mouth turn down naturally. He has very long thin fingers, a scar on his chin, and eye sockets that are so deep they sound like a deformity when described by Tris, with eyes so dark blue they're almost black... and a light blue patch in those eyes.So basically, he looks like.....this?My Beatrisssssssssssss.Regardless of the less than stellar description of our love interest, named Four, I still managed to imagine him as a hottie toward the end. (Click to see how I really imagined him.) However, I just wasn't all that interested in him, which seems to be a common occurrence for me lately. Color me blinded by Barrons, I guess. Nearly every love interest I have read since, just doesn't live up to my expectations.Now, a love interest who would have been intriguing and a major shock: Peter. This douchebag was the Dauntless nemesis of both Four and Tris: however, he was way more interesting to me than Four. If he had turned out to be the other Divergent and had been just acting like a jerk the entire time, it could have been different for me. There was an instant where I thought, \"Maybe?\" But alas, no. He was still just being a douche.I have to say that, although the world itself doesn't make much sense, since when does any oppressive society make SENSE? At least to those of us who have common sense. Horrible and ridiculous things happen all the time and there have been many ages of oppression throughout history. None of them make a hell of a lot of sense. Slavery? The holocaust? Genocide? Nope, I don't get it. But that doesn't mean it can't and won't happen.If you are one for analyzing the politics and economics of the world you are reading about, then this one may fall short for you. If you are someone who can easily suspend your disbelief in favor of action and new experiences, then you just might love this. Me? Well, I fall somewhere in between, but more toward loving it.For nay-sayers who claim that dystopian fiction is unrealistic because those kinds of societies would never work:I think that is the point these books are trying to make, isn't it? It doesn't work. That's why those types of government either self-destruct or are deconstructed by others, and those who initiate those governments either fall apart or are taken apart. That's one reason that I think books like this are so important; they exist to remind us what humans are capable of: the good and the bad.Humans can kill and be killed, give life and have it taken from them, love or hate, help others or help destroy them.Even though this book concentrates on just 5 important characteristics, there are so many more traits that are important. So, what character trait is your strongest? Are you brave? Helpful? Funny? Creative? A good listener? What trait can you use to help transform others? Or the world? That's a question that can be found in between the lines of this book, and it's an important one. One that we should all ask ourselves.Divergent was one of those books that just consumed every corner of my mind while I was reading it. As much as I love The Hunger Games, the subsequent deterioration of my interest in the sequels still weighs heavy on my mind. Here's to hoping that this is a series that only gets better with age.You can find this review along with bonus material on my blog: Strangemore."}, {"userName": "Stephen", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "This book’s sobriquet should be \"the comeback kid\" because its final rating of 3 solid stars required it to overcome a seriously frustrating first half that had me ready to do great violence to it. Before I expound on the redemptive, grace/face/rating saving virtues of second half of the book, I need to rant vent a bit regarding what turned my hackles all red and puffy. THE SIN:I am a SF dystopian connoisseur and I love a well-conceptualized “world in the shitter” set up. I am happy if the author wants to make the dystopian vision the narrative centerpiece and explore the subtle nuances of day to day life throughout the story (e.g., 1984, The Jagged Orbit or The Windup Girl). I am also just fine if the author wants to simply grab our attention with a dystopian world and use it as a springboard for introducing us to the story they “really want to tell” (e.g., Sea of Glass, Genesis, Native Tongue and Parable of the Sower).For me these dark, distorted mirrors of our present do not need to stand up to nit-picking dissection or rigorous extrapolative analysis. It just has to be sufficient to allow my sense of disbelief to see it, smell it and give it a once over before kicking its feet up and suspending itself for the rest of the story. Houston…we have a problem….my disbelief wasn’t ameliorated. It rolled its eyes, squinched its nose, got up and packed a suitcase and then went fishing…leaving me in the precarious position of trying to read the novel while banging my head against the wall trying to help the world-building maneuver in past my logic circuits. Twas a painful failure as this was not a believable dystopia. I remember having a similar problem with Shusterman’s Unwind, but, in that case, the premise was so darned intriguing that I was able to run with it anyway. Here, the central world-building concept is…..completely….and utterly….and (almost) unforgivably…horrendous. It felt desperately silly and poorly thought-through. The dystopia’s premise didn’t pass even a drive-by smell test. In essence, the author simply replaced one set of arbitrary and ridiculous divisions with another. Thus, rather than people being irrationally and stupidly being divided by social lines, ethnic lines, racial lines, religious lines, familial lines, political lines, wealth lines, geographical lines, educational lines, …Roth created a brand new but even MORE arbitrary division that makes even less sense than the original and doesn’t even allow for “cross-over” appeal by making each faction exclusive. Therefore, by their very existence, these group are inherently laden with friction and must, by definition, clash with one another which guaranteeing the fomenting of further discord and the creation of an even shittier world. The logic escaped me and this was a major, major failure.. Worse, the dystopian element was not even bizarrely interesting (as it was for me with Shusterman’s Unwind). Thus, in addition to be nonsensical, it lacked the “grab you” factor that might have allowed me to tell my brain to pipe down and just go with it. So, for a dystopia-lover like me, this was a steep hill to climb. \nNow, on the average to good side, the writing was fine. It wasn’t lush or pleasing enough to make reading the words in themselves fun, but it certainly wasn’t clunky or distracting to the story either. I would call it invisible which is just fine for a story like this and I felt the same way while reading stories like The Hunger Games. Good, solid prose and doesn’t make a nuisance of itself and creates an environment conducive to good story-telling. THE REDEMPTION: It starts with Tris who, like Katniss and Anaximander (from Genesis) before her, wormed her way into my heart and smote it with her buckets full of awesomeness. She was smart, confident, courageous and an ass-kicker extraordinaire. My kind of heroine. She picked up this struggling story with an ill-formed back-story, looked me in the eyes and said, ‘Stephen, I’m gonna make you like this story anyway because I…am…simply…that…cool.’ She was…she did…I did.As Beatrice during the first half of the book, I was mostly under whelmed, but I fell hard for Tris once she entered the picture and she made me forget, by and large, my earlier misgivings. Insecure scared and questioning yet decisive, brave and loyal. Plus a volcanic temper that was just terrific. She was well-drawn, well shaded and felt very, very real. As good as Tris is I don’t want to pin the entire comeback on her sack-squelching shoulders. The story itself ramped up and really gained momentum in the second half when the various pieces started to fall into place. I loved the “big reveal” and was impressed with how the scope of the plot slowly but inexorably grew until we had a story that was truly epic. CONCLUSION:Had I not been so off put by the “sins” of the early part of the book, I think this would have been a strong 4 star effort. As it is, I think the second half of the book was excellent and sets itself up very well for the next installment. Add to that a truly engaging, endearing character in Tris that the reader can fully connect with and I think this series has the potential to be very strong going forward. 3.0 stars. Recommended."}, {"userName": "Jessica Edwards", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/25183684-jessica-edwards", "userReview": "I read this book before actually watching the film, and I'm going to be honest and say that I prefer the book. I've said before that I don't like to read a lot of Dystopian books, but I made an exception on this book because it was coming up a lot on my Goodreads Homepage, and I was surprised with how much I enjoyed it. Sixteen year old Tris Prior lives in a futuristic world in which society is divided into factions. When each person enters adulthood, he or she must choose a faction and stay in it for life. There is; Abnegation, which values selflessness. Amity, which value peace. Erudite which values knowledge.Candor which values honestly. Dauntless which values bravery. Beatrice Prior (Tris) is a member of Abnegation with her brother Caleb. Every boy and girl must take an aptitude test to decide which faction they are most suitable for. The test starts with a confrontation with a vicious dog. Tris shows Abnegation, Erudite and Dauntless and because of this, it means she is something called Divergent. Tris is warned to never tell anyone about her results, because being a Divergent is incredibly dangerous. Tris is strng willed, brave and she's reluctant to show any kind of weakness which I freaking loved!The Dauntless instructor known as Four, becomes Tris' primary love interest. He is known as Four because during his own Dauntless initation, it was revealed that he only has four years. Four was also born Abnegation, but he chose to Dauntless to escape the abuse of his father. At first, Four has an elusive, mysterious personality and he's quite mean to Tris, but he eventually allows himself to become close to Tris. Now I'm going back to reading Dark and Twisted books xD"}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Nov 29, 2010", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "[Tris (aka Beatrice) is divergent. She fits into more than one faction and can't be mind-controlled (we learn that divergent people can't be mind-controlled at the end of the book). She is told to keep this secret from the very beginning of the book when she first learns that she is divergent. Why would any one care if she is divergent (can fit into more than one faction), if going into the faction is her own choice (regardless of what faction you test in).It's the Erudite that eventually control the Dauntless through the mind control. But the people that told Tris to keep her divergent status a secret didn't know that the Erudite were trying to control the Dauntless. So, why would the people tell Tris to keep it a secret? Because it worked well in the story (later in the book) is the only reason I can come up with?  (hide spoiler)]"}, {"userName": "Michelle", "userReviewDate": "Jul 18, 2010", "userURL": "http://www.goodreads.com/user/show/2606359-michelle", "userReview": "I did not like this book. I started reading it at about 3pm in the afternoon and finished at about 9:30. When I finished I sat there, stunned. In awe. It is one of the best Young Adult novels I've ever read. One of the best novels I've ever read, if we're going to go there, too. It was, in a word, flawless. How can you \"like\" flawless? How can you \"love\" it? DIVERGENT is powerful. It is moving. It is extraordinary. My only regret? That the whole world hasn't read it yet, because my need to talk about it is so fierce that I barely want to do anything else."}, {"userName": "Abbi Glines", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/5629438-abbi-glines", "userReview": "I'm not a big fan of dystopian but I LOVE THIS! Four is now my new book boyfriend. Well…. he is at least my back up in case I break up with Travis one day."}, {"userName": "Peep (Pop! Pop!)", "userReviewDate": "Jul 25, 2010", "userURL": "http://www.goodreads.com/user/show/2507910-peep-pop-pop", "userReview": "[Being shot in the arm won't bother you. You can do pretty much anything because the bullet wound only makes you slightly dizzy. You only grimace when you remember. In paranormal books the hot alpha shifter gets shot and cut then wipes off the blood and laughs. Guess what? In this book the human girl gets shot and goes with the flow. I was beginning to think that the author was lying to me. Is reacting considered selfishness in Abnegation? Was she even a human? Or, was she the robot that I suspected?? 4. Gunshots don't hurt you but it sure as hecky hurts your enemy. Also, it's ridiculous to expect said enemy to walk when he's been shot.5. For people that have been raised around nothing but selflessness, seeing someone getting a bullet removed from their shoulder, with a knife, is not as bad as you think. It's apparently the same as watching fresh bread being pulled out of the oven. Exactly.6. Having your mom AND dad being murdered in front of you is no biggie. That's what being Dauntless is about. It's like having your souffle fall. It kind of sucks, but whatevs! 7. It's totally fine to (in the same conversation) to mention to someone that, “woah, your parents have been murdered” and in the next few sentences say, “this might be a bad time, but I am in love with you”. (she didn't think it was a bad time because she loved him in return). 8. You can murder your friend without a thought, but only slightly disable those you hate because – I don't know why. (hide spoiler)]"}, {"userName": "K.D. Absolutely", "userReviewDate": "Oct 19, 2011", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "This book is just not for me. I should not have borrowed this. I should have ignored this book even if this is this month's read for our book club. I have no intention of attracting attention by disliking this popular book. I am just being honest to myself.Please allow me to explain.(1) Late last year, I read and liked Suzanne Collin's The Hunger Games. I don't read lots of dystopian and I thought I read it even before I read William Golding's Lord of the Flies. So, the idea of kids or young adults killing each other like how they do it in a TV reality show shocked me literally and it made me finish all the three books in that series. This despite my older brother making fun of me reading a YA book while our two families are enjoying our annual Christmas break in a resort. I did not care. The book was engaging and I had to continue reading.Sadly, Divergent, by yet another female American writer Veronica Roth, uses the very same formula. There is nothing wrong with this tactic. Strike while the iron is hot. It is just not for me. The similarities are glaringly obvious: survival of the fittest, a virginal vulnerable girl in the brink of adulthood, first love, first kiss, defying convention, same love for the family, against all odds, despite all obstacles, triumph in the end, etc. DON'T KID YOURSELF into saying that this is different. These writers will continue to write this kind of novels as long as there are readers patronizing them. Let's all do ourselves a favor by moving on. Let's read books with new and not recycled plots. I know Veronica Roth, a graduate of creative writing, has many many other nicer plots in mind and let's encourage her to write a different novel so she has a better use for her creative juices.(2) This book is for young girls. Maybe even for the girls who still dream of their young selves. It is a romance novel hiding under the cloak of dystopian genre. Traditionally, dystopian used to be a genre identified with male readers and crossing the line gives female readers the opportunity to show their tough side because they also read and appreciate dystopian books. However, read their reviews here at GR. They are all in love with Four or Al just like how they debated about Peeta or the other boy in THG. I would imagine that when Four was kissing Tris for the first time, those female readers who have never been kissed were imagining themselves as Tris. I should know. I am a father of a 16-y/o girl and we are closed the she tells me what she wants in a boy and who her crushes are. So, if you are a girl, DON'T KID YOURSELF that you enjoyed the killing here just like how the young male readers would have enjoyed it. (3) The plot lacks believability. The overall scheme of the society is not explained. For example, who put the Abnegations in the government? Isn't it that brains (of the Erudites) are also needed not only in running the government but also in all other things? Where do the factions get their income to run their affairs? Don't tell me that Amities just make friends all day long and they earn money to put food on the table just by being friendly. Again, going back to THG, at least Suzanne Collins, in the first book, made her milleu believable. But not Veronica Roth. She just thought that these questions are not important so she just labelled and grouped all people into five factions. Oh, how convenient. Then the readers just take everything in stride and say this is awesome!, this is the best book i've ever read. ever. And to think that the ones who commented these are male! Maybe they need to expose themselves into more believable novels say by George Orwell, Margaret Atwood, Aldous Huxley, Kurt Vonnegut, etc. All those dystopian or sci-fi masters. They'll see semblance of this book's basic plot in those earlier and definitely more brilliant works. They'll realize that they should not be saying that this is the best ever book as this is just a painful rehash of what those gurus have already written. DON'T KID YOURSELF that this is all-original.\nSorry, Maria. I perfectly understand why you love this book. It is just not for me. You cannot hate me anyway since we work in the same company and I know that my disliking this book is not enough for you to consider me your enemy. Oh, I agree that you and Four can make a wonderful couple ha ha! Thanks for lending me this book. :)"}, {"userName": "Dd", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/9444787-dd", "userReview": "[Divergent (hide spoiler)]"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Divergent (Divergent #1), 2011, Veronica RothThe novel is the first of the Divergent trilogy, a series of young adult dystopian novels set in the Divergent Universe. The novel Divergent features a post-apocalyptic version of Chicago and follows Beatrice \"Tris\" Prior as she explores her identity within a society that defines its citizens by their social and personality-related affiliation with five factions, which removes the threat of anyone exercising independent will and re-threatening the population's safety. Underlying the action and dystopian focused main plot is a romantic subplot between Tris and one of her instructors in the Dauntless faction, nicknamed Four. The novel has been compared to other young adult books such as The Hunger Games and The Maze Runner because of its similar themes and target audience.عنوانها: ناهمتا؛ سنت شکن؛ نویسنده: ورونیکا راث؛ تاریخ نخستین خوانش: از روز بیست و ششم ماه جولای تا اوایل ماه آگوست سال 2015 میلادیعنوان: ناهمتا؛ نویسنده: ورونیکا راث؛ مترجم: امیرمهدی عاطفی نیا؛ مشخصات نشر: تهران، آذرباد؛ 1391، در 528 ص، شابک: 9786006225326؛ موضوع: داستانهای نویسندگان امریکایی قرن 21 معنوان: سنت شکن؛ نویسنده: ورونیکا راث؛ مترجم: هدیه منصورکیایی؛ مشخصات نشر: موسسه فرهنگی هنری نوروز هنر؛ 1393، در 390 ص، شابک: 9789647109529؛ عنوان دیگر: ناهمتا؛پس از جنگی جهانی، جامعه‌ ی شهر شیکاگو به پنج فرقه‌ ی مجزا تقسیم شده‌، که هر یک از فرقه‌ ها از یک فضیلت خاص انسانی حمایت می‌کنند. این فرقه‌ ها: فداکاری، صلح طلبی، صداقت، شجاعت و دانش هستند. هر سال در یک روز مشخص، نوجوانان شانزده ساله باید در آزمون استعداد سنجی شرکت کنند تا بدون توجه به فرقه‌ ای که در آن به دنیا آمده‌ اند تصمیم بگیرند که باقی عمر خود را در کدام فرقه سپری کنند. بئاتریس پرایر، شانزده ساله عضو خانواده‌ ای از فرقه ی فداکاری ست، اما گویا میاندیشد که خصلت از خودگذشتکی در ذات او وجود ندارد. وی تحت تاثیرمحیطی که به او فشار آورده، احساس می‌کند که به آن‌جا تعلق ندارد. بئاتریس در آزمون استعداد سنجی شرکت می‌کند، ولی نتایج آزمونش شگفت‌ انگیز است. وی با تمام ورودی‌های دیگر یک فرق اساسی دارد، چون یک ناهمتاست، و این موضوع می‌‌تواند زندگی او و اطرافیانش را تحت تأثیر قرار داده و خطرناک باشد...؛ کتاب را هدیه گرفته ام، ترجمه ای را که دارم میخوانم، بسیار آزارنده است، پر از فعل «میباشد» است، و اشتباه تایپی، بسیار دارد، داستان اما کشش لازم را دارد، و با این قیمتها انگار میکنم نوبر است؛ برای مثال در چاپ نخست واژه ی «اینه» همه جا «آیینه» تایپ شده و بسیار است واژه های اشتباه دیگر، دلم میخواست پس از این کتاب؛ که نخستین گام برای طی کردن سه گام از سری ناهمتا بود، یاغی را بخوانم که گام دوم از سه گانه است، به خویشتن چند روز فرصت دادم تا نخست کتاب جزء از کل را بخوانم. ا. شربیانی"}, {"userName": "Alejandro", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "A book with its ups and downs.\n\nROLLERCOASTER OR FERRIS WHEEL?\n\nPoliteness is deception in pretty packaging.\nThis novel was a rollercoaster for me. Maybe it should be a ferris wheel (pun intended) but no, it was a rollercoaster since at some moments I was quite high, real excited about the story, but at some moments I was way down, getting into my nerves.It wasn't easy to rate the book, since I liked the general story in the novel, but I really liked several unexpected twists in key moments of it.So, it was hard to reflect my overall reading experience in 3 or 4 stars. At the end I chose 3 stars weighting more the general experience over particular surprises. (It was of those times where having the option of giving a half star could be real helpful to be more accurate in my general rating).\nDIFFERENT DYSTOPIAN HERO(INE)\n\nIt's easy to be brave when they're not my fears.\nIt was kinda different dystopian story since usually, the hero(ine) finds inside of the strange (for us) society and something unexpected happens and the hero(ine) realizes that how the society is working is wrong and he/she takes a rebellious position against the system. However, in Divergent, the heroine, Tris is working hard to fit in the system, of course, she has some doubts here and then, but in general, she is playing along with the dystopian society and its rules. She doesn't think that the dystopian society is wrong. She knows the rules, she accepts them, and she worked hard to make her own future into this society.In here, the system itself will fall apart without a participation of the heroine.Tris will only have to react to a \"failure\" of the dystopian society and trying to survive, but the \"failure\" is unrelated to her and she isn't the one who incites it.\nA DOOMED SYSTEM IN ITS ROOTS\n\nIt must require bravery to be honest all the time.\nI didn't surprise myself that this dystopian society could starting to fall apart by itself.I mean, the very system is odd. (To say it in a mild way)At least, the way that people reacts to the base of the system.You have 5 factions, each faction with very distinct features, but when you get to be 16 years old, you have to choose a faction, the one where you already are or another one, even you have to take a test that giving you the results to know if your personality is more \"tuned\" to the characteristics of other faction.So far, sounds nice. BUT, if you choose a different faction to the one where you grew up......ZAP! CRASH! KAPOW!......you're considered a traitor to your original faction and it's very likely that your family won't seeing you anymore.Ah?! What the heck just happened?If changing of faction is something SO terrible, why the heck they force you to take a dang test and choosing?Also, you will find out, in the story, how few characters born in their current factions, so, if they also chose a different faction, why the heck are they so mad when their sons do just the same dang thing? Geez!!!Oooh! And if you fail to enter into your new faction, you ended to be \"factionless\"......Why even there are \"factionless\" people?!!!There is enough hate between official factions, and are they engrossing AND feeding a faction (only without a cool name) that they have even more valid reasons to hate to the rest of whole bunch of the five official factions?No wonder why this dystopia doesn't really need Tris (or any other hero(ine)) to fight against the system, since the very conception of it was doomed to fail for itself, sooner or later.\nTHOSE DANG MOVING TRAINS\n\nA chasm reminds us that there is a fine line between bravery and idiocy.\nIt's funny how being \"divergent\" seems to be something unusual in that dystopian society but you will meet more people than you would expect that they are like that, so how strange really is? Also, I don't like when the story shows the advantage of being like that and the very book that you are barely enjoying that, ZAP! KAPOW! TOMA GUACHO! something came up to nullify that. (No, I won't spoil what is).But geez! It's like... \"Hey! I'm Superman!\" ... \"Oh, really? Sorry chump, I have Kryptonite.\" ... All the fun of being Superman going to the sewers.I would accept that some weakness to the \"Divergent\" state would be developed but, was it too much to wait until the second book at least?What I really like was that you can't foreseen how the relationships between the characters will be. At some moments, you will like a lot some characters and later you will hate them or feeling sorry for them, or just the opposite way too. Indeed it was of the strongest points in the narrative.I would like to meet the \"good old times\" of the Dauntless faction when \"teamwork and risking your life for a higher purpose\" were priorities and not this bunch of train-jumpin' psychos that they are now......Did they really think that bravery is shown only for being so stupid of jumping from and into moving trains?!!!\"Thanks, Mom and Dad for sacrificing so much for me during 16 years only for me getting my brains spread out in the pavement while trying to jump into a freaking moving train!\"Are there even some train station in that city?!Honestly, it seems that those dang train never stop at any moment!Due stupid actions like those and others such, \"safe mode\" isn't activated in this novel, so you will find blood here and there, showing once and a while, some pointless deaths.Amity and Candor factions are nothing but a bunch of wimps and cowards.I wonder how smart really are Erudite faction if they came up with such society system doomed to fail.And finally, Abnegation faction isn't any real better, I mean, they are soooooooo selfless that they will give their seats to you in a bus, BUT driving that bus is something beneath them, something to do for those poor souls of the \"factionless\".Also, Abnegation people can put in order a hall after a high profile event, BUT working as full-time janitors is deserved for the \"factionless\". This is not a society, but a freaking ticking bomb!"}, {"userName": "Kristi", "userReviewDate": "Jun 05, 2010", "userURL": "http://www.goodreads.com/user/show/1310688-kristi", "userReview": "WOW. WOW.... no really, just wow. Could not put it down... and I CAN'T STOP THINKING ABOUT IT! One of my favorites books this year, no question about it!I've been trying to write this review for the last two hours... and nothing is coming to mind but \"AWESOME\" and \"WOW\" and \"WOW\".... did I say wow? I apologize that this review is going to be incoherent, and mostly fangirly, but that's the state of mind this book has left me in! I'm in shock of its spectacular-ness. Is that even a word?I'll admit it, it was the cover that first drew my attention.... I read the summary and my first thought was, meh. Yes, I'll admit it, meh. Then I started hearing all the hype. When I went to a signing, in March, a few bloggers were talking about how fantastic it was. I'm always leery of hype for some reason.Needless to say, I picked it up, and I'm SO GLAD that I did. You should pick it up too!There are many things that make this a great book. The story, the characters the writing. It wasn't just one thing that stood out to me, this was a perfect mesh of all the things that make a book unforgettable.When I talk about connecting with characters, this is the type of book I'm talking about. I don't mean, connection in a way of relating to them. I mean connection in a way that these characters meant something to me, that I felt their pain, their happiness, their despair. I cared what happened to them. That's what connection means to me. Divergent gave me that and so much more.What a talented author. What an unforgettable book.If you didn't buy it yesterday, go get it today."}, {"userName": "Mohammed Arabey", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "[But hate seeing her dying, specially with a sleeveless shirt!!!! (hide spoiler)]"}, {"userName": "Ceilidh", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/3229028-ceilidh", "userReview": "Veronica Roth started writing “Divergent” in college, and was quickly signed up by agent Joanna Stampfel-Volpe . The book rose to success at an unusually enthusiastic pace, with a 200,000 copy first run by HarperCollins , and a huge online promotional campaign. The campaign is what interested me the most upon the book’s release. Part of the promotional campaign included a Facebook campaign where you could “discover your faction”, and to me this is a huge reason as to why the book was so successful, certainly selling more copies than similarly themed and promoted novels. A huge attraction of the novel’s concept is the idea of choice, of looking inside yourself and deciding which human traits you value the most, and having your entire life dictated by that choice. As I mentioned before, much of the appeal in teen dystopian novels these days lies in the inherent choices one must make, and the subsequent consequences of that decision. Unfortunately, “Divergent” fails on this front by falling into several major pitfalls of the genre. The Chicago of the future depicted in “Divergent” is one divided into five factions, with the citizens of each faction devoting their lives to one specific virtue that they consider the most important: Amity (peace), Abnegation (selflessness), Candor (honesty), Erudite (intelligence) and Dauntless (bravery). Upon turning 16, each citizen must take a series of tests to discover which faction they are most suited to, but are then given the freedom to choose whichever faction they wish to join later on. This confusion is one of the first big missteps of the novel. Why introduce mandatory tests to find a suitable faction if the citizens then have free will to decide differently? Beatrice/Tris, our heroine, belongs to Abnegation, but decides to join Dauntless, after receiving inconclusive test results which identify her as Divergent, the name given to those who are shown to possess more than one of the allotted virtues. Once again, the red flags come up, revealing my biggest issue with the novel. The world building makes absolutely no sense. The concept of dystopian societies relies on the notion of a world that seems perfect but is shown to be extremely flawed and often dangerously problematic (an idea many writers and publishers can’t seem to wrap their heads around), but while the concept of a world run by a series of such virtues sounds interesting at first glance, I cannot think of an instance where this would work without someone calling it out. How can you divide humanity into one of five virtues? How on earth can you be brave and not honest, or intelligent and not peaceful? Why would possessing more than one of these virtues be dangerous, as Tris is told? I can understand brainwashing one’s citizens into wholeheartedly believing in this system but by offering choice surely that gives them agency to question it? Those who do not pass initiation are sent out into the outskirts to be faction-less, taking on the grunt jobs and living on hand-outs, and yet the possibility of a completely justifiable uprising is never mentioned. Even if the society of this world had been watertight in its depiction of an entirely subservient society, I can’t imagine those without factions not rebelling in some way. The way in which every character just accepts this, along with every other world-building hole, felt lazy.How on earth is this system governed? It is mentioned that Abnegation are in charge of politics of the city because of their selflessness, which sounds divine in terms of contemporary politicians, but who decided this? How can one be selfless when it is one’s job to dictate to others how to rule their lives? We’re given no indication of how the rest of America outside of Chicago works, which constantly raised questions as to the function of local government versus the role of Washington and the Congress and Senate (granted, I’m a politics geek so I doubt most teenagers are stressing over this like I am). Tris also attends high school with other factions, which logically makes no sense since surely allowing such a system would only encourage rebellion. Each faction is assigned a different job to do but the idea that each position would only require one virtue is ridiculous and illogical. This complete lack of sense is present throughout the entire book and is impossible to overlook. I cannot invest in a novel that leaves me asking so many questions. The concept and its lack of thought reminded me of Lauren Oliver’s “Delirium”, set in a world where love is a disease. It sounds like an interesting concept until it’s thought about for longer than five seconds. Upon leaving Abnegation, Tris is sent to the Dauntless camp to begin her training for initiation. The biggest chunk of the book is spent in what I find easiest to describe as an extended training montage. Since the Dauntless value bravery above all else, naturally their training process is like a big adventure camp, complete with punch-ups, tattoos and paintballing. These frivolous activities are supposed to be what proves, for the biggest part of the story anyway, who the truly brave are. The Dauntless spend a lot of time getting tattoos, dying their hair wild colours and generally dressing like Sex Pistols fans. The definition of bravery presented is questionable at best. The stakes, which make Dauntless seem more like a summer camp than a truly life-changing initiation, are set ridiculously low, except for the frequent punch-ups the trainees must go through. While this element of the world is questioned by Tris, she buys into it ultimately but I don’t – why is violence brave? Surely the braver thing would be to say no? This element is set up for a later pay-off into the evils of another faction but once again the mishandling of the world-building raises some questions. Who is monitoring the factions? Leaving them self-governed is just asking for trouble. There’s no authority present, which also means there’s no real villain or sense of threat. The closest the novel comes to having a villain is the opposing faction Erudite, because apparently valuing intelligence makes one instantly maniacal and ready to take over the world. There’s a less than subtle anti-intellectual tone throughout the book which seriously annoyed me. The inherent premise of the book is where the issue of this lies, but given that the supposedly heroic Dauntless are happily beating up each other, I fail to see them in a better light than those who value intellect. One of the tensions of the novel lies in Erudite’s slandering of Abnegation, yet one would expect Candor to be doing their job of being honest about the inherent flaws of the city’s governmental rule. Once again, too many questions. The stakes are raised in the second stage of initiation when Tris and company must go through extremely life-like hallucinations of their worst fears to learn to overcome them (because the true definition of bravery is overcoming one’s fear being attacked by rabid birds). Given that not much of any true consequence happens throughout this large portion of the book, I was disappointed by the lack of real character development, both for Tris and the supporting cast. I genuinely forgot the names of several of the Dauntless trainees, who remain distinguishable only by their token roles – best friend, love interest, bully – while Tris veered between cold, dull and a bit of a hypocrite. She has a distinct lack of compassion that I found to be a complete turn-off due to the inconsistencies of her depiction. While Tris admits she is too selfish to stay in Abnegation, but this doesn’t explain her often cruel nature as well as her habit of passing judgement on everyone. Characters exist to serve purposes and not much else. Peter is a bully and not much else. Al is the nice boy having trouble fitting in until he suddenly turns bad then kills himself for a cheap emotional pay-off. Not one supporting character makes a lasting impression and all feel entirely disposable.  Of course, her emotions change quickly for the romantic interest, Four, who I am sorry but not at all surprised to say is a typical YA jerk. Then again, I can’t think of many YA romantic leads who managed to draw blood from their supposed true love. I tend to get very angry when the “I was only trying to protect you” card is played in any novel, but here it angered me more than usual since “trying to protect” Tris includes physically hurting her, demeaning and humiliating her in front of others and treating her like a child (although she is often immature and dim-witted). Of course, he also has a tortured past and is brooding but gentle and loving, ticking off so many clichés in one swoop. The fact that the supposedly strong Tris falls for this hook, line and sinker entirely contradicted her depiction as a “strong female character”. It does not help that Tris seems to pick up each part of her training with ease. I’m not sure knife throwing and using a gun (something Tris finds a lot of security in, and don’t even get me started on the pro-gun stuff) are something that just come naturally.The moral element of the novel feels shoehorned in. Tris makes references to God and praying but we are given no sense of the role of religion in this society. While the factions suggest an inherently Christian foundation to the city’s new rule, there’s no depth to this, nor any real rules put in place. It’s difficult to imagine a society without religion, or something resembling a religious element, be it the “worship” of a leader or the following of a divine theistic being, and I think the world of the novel would be much more complex and interesting if this was explored in more depth, but the author can’t just add a few references to God and hope for the best, especially when most of what the societies do to rule their city contradicts the inherent teachings of God and Jesus. In terms of general prose, pacing, etc, the novel is serviceable at best and plodding at worst. Clocking in at almost 500 pages, the story feels sluggish, poorly developed and more concerned with an extended action montage than any semblance of developing its poorly structured society and undeveloped characters. I have no issue with the novel’s less than original concept since strong execution can more than make up for that, but there are too many holes in this novel for me to ignore. One cannot shove the major plot developments into the final 50 pages after expecting the reader to trudge through such boredom for so long. And here’s my biggest issue beyond the basic structuring of the novel – this is a world where the essential message is those who value intelligence are all greedy, selfish, power-hungry schemers who are working to take over and destroy all that is good and selfless, and if those who are truly “brave” need to shoot them in the head to stop them, so be it. Dystopian fiction is inherently political, I have no problem with authors taking a specific slant, even if it’s one that directly contradicts my own politics, but the basic premise of “Divergent” is one that is flawed to the extreme, and one that any reader can pick apart within 10 minutes of the first page. Tris may express disagreement with the violence of Dauntless but she is only happy to use it herself, frequently, and it always works. The generalisation and complete misunderstanding of basic human thinking is mind-boggling. “Divergent” is weak in almost every way. Its world-building has more holes than Princes Street’s tram building project, weak characterisation, plodding pacing, predictable and tired romance and inherently fails in its objective. Needless to say I will not be reading the sequel."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I don't know how I feel about this book so I'm going for the 3 star okay for now. I saw the movie a long time ago and loved it, then liked it, then I don't know. Now I feel the same over the book. I love a lot of the characters but I just don't know. And does it really matter what I think? I will finish the box set I own to see if I change my mind."}], "description": "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.", "title": "Divergent\n      \n          (Divergent #1)", "url": "http://www.goodreads.com/book/show/13335037-divergent", "average": 4.22, "cover": "https://images.gr-assets.com/books/1328559506l/13335037.jpg", "reviews": 103534, "authors": [{"url": "https://www.goodreads.com/author/show/4039811.Veronica_Roth", "name": "Veronica Roth"}], "type": ["Young Adult", "Science Fiction", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/13335037-divergent", "http://www.goodreads.com/book/show/8306857-divergent", "http://www.goodreads.com/book/show/9717320-divergent", "http://www.goodreads.com/book/show/10089874-divergent", "http://www.goodreads.com/book/show/25964074", "http://www.goodreads.com/book/show/11735983-insurgent", "http://www.goodreads.com/book/show/18710190-allegiant", "http://www.goodreads.com/book/show/18126198-four", "http://www.goodreads.com/book/show/13615258-free-four", "http://www.goodreads.com/book/show/18080920-the-transfer"]}