{"ratings": 9647, "userreviews": [{"userName": "Jaidee", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/17295672-jaidee", "userReview": "5 \"hypnagogic\" stars. 2015 Silver Award (2nd Favorite Read) What is this book? Oh my goodness.... Oh my goodness.... Oh my God!!Mr. Ondaatje captured snippets of dreams and put them in a beautiful violet tinged jar and shook them gently until they coalesced into one syrupy whole.I wanted to read this book slowly but I could not as the prose had a force of its own. It made me quiver with melancholy and at times made my heart skip in joy. Everything unfinished but infused with a primitive wisdom that seeped deep down into my consciousness. Characters loosely sketched in greys, mauves and indigo....moving towards love at the price of life, sanity and freedom.I am truly amazed at the genius of this writing and through these weeks felt the words of this novel tickle my chin, stoke my heart and feed my soul. I am so incredibly moved as I write this...the way I am when I witness the birth of kittens, the Pacific Ocean in a storm or deep in conversation with God.This little review may make little sense but I sincerely hope you experience some of the depth of feeling I felt as I read Mr. Ondaatje's Divisadero."}, {"userName": "Brad", "userReviewDate": "Jul 09, 2009", "userURL": "http://www.goodreads.com/user/show/1022982-brad", "userReview": "Divisadero is not a story about the things that happened; it is a story about the things that were felt, and there is no living author better at telling a tale of feelings than Michael Ondaatje.Ondaatje's prose is poetry, and for me, his poetry is lyrically sublime, in the romantic sense of the word. I am awed by what he does, and I long to do it in my own prose. I don't care whether Anna and Coop and Claire ever find each other through the divisions of solitude they've embraced, and I don't feel at all cheated by never knowing. I don't care how Roman disappeared, where Astolphe came from, what happened to Anna and Raphael, nor when Marie-Neige died because Ondaatje makes me care more about what they felt in the short, intoxicatingly brief moments that he lets me share with them. But more than all of these wonderfully realized characters, I love Lucien. One-eyed, desolate, literary, simple yet complex, war ravaged, marriage ravaged, love ravaged but rich in love, sensuous, sensual, paternal in spite of himself, childlike, needy, giving and other things I am certain I have missed. His story is Divisadero to me, in much the same way that Caravaggio was The English Patient. And though his story is inextricably bound to the life of Anna, his literary biographer, illuminating the events of her life and the shattering moment that thrust her old life into the new, it is his love for his mother, his daughter, Marie-Neige, and Raphael that tell the story that reaches me most deeply.I get Lucien in a way I don't get the others, or maybe it is simply that my own internal world most closely resembles his. Whichever it is, I am sad that my time with Lucien Segura -- poet, adventure novelist, lover, soldier, possible madman -- is over. And oh, how I wish I could read his poems and novels. Those fictional works of fiction sound marvelous, but it is not to be, and I imagine the best I can do is return to the pages of Divisadero when I need to connect with Lucien again. I am afraid that won't be enough, but it will have to do.I had intended to write a review about Ondaatje's use of time and space, his skill with multiple perspectives, his intertextuality, his prose technique, his wide ranging settings, but my review became something other, which is fine by me. And I hope it is fine by you too.But I must add a note of warning for anyone interested in reading Divisadero -- do not expect a classic story with easily wrapped up plot lines and linear movement of action. That is not, and has never been, how Ondaatje works. Come to Divisadero to lose yourself in the lives of fascinating people, to feel what they feel for just a moment. If you're looking for anything else you would be doing yourself a favour by staying away."}, {"userName": "Sawsan", "userReviewDate": "Nov 19, 2016", "userURL": "http://www.goodreads.com/user/show/11592808-sawsan", "userReview": "رواية للكاتب والشاعر السريلانكي مايكل أونداتجي وسرد بدون نهايات مرئيةحدث عائلي عنيف يُحدث انقسام حاد في حياة عائلة في الريف الأمريكيينتقل أونداتجي بين الماضي والحاضر ليتتبع حياة أبطال روايته وفي محاولة للتعافي من الحزن والفقد تلجأ آنا الراوية إلى الأدبتقوم بدراسة وتوثيق الكاتب الفرنسي لوسيان سيجورا وتُعيد ترتيب تفاصيل حياتهفتتواصل الأحداث بين أزمان وأماكن مختلفةالعنوان جميل يعبر عن الانقسام الذاتي الداخلي الذي يحدث في النفس عن وجود الانسان المادي في عالم, وذهنه وأفكاره ومشاعره تحيا في عالم آخر"}, {"userName": "Mark", "userReviewDate": "Sep 17, 2007", "userURL": "http://www.goodreads.com/user/show/229886-mark", "userReview": "This book is full of the wisdom of a writer who is both a poet and a novelist. Divisadero: the divisions between our lives and the lives of others, and even between our most secret lives inside of us too secret to admit to ourselves. Divisadero: the connections between the divisions that cause us to yearn for the comfort of togetherness, of intimacy. On a palimpsest of a novel painted over by centuries of division and that longing for togetherness, Ondaatje brushes words that will stay with me for a long time. Every so often, I read a book that deeply affects me like this one, but it's not as frequent as I would like. This is a book to read for all the reasons we read for pleasure, and also for all of the life reading can give to life.I have noticed that Ondaatje perceives men, especially his protagonists, as wounded souls, scarred and disfigured by the accidents of life, and disfigured also by the weight of responsibility that comes with being a man. This in no way detracts from his characterization of the burdens that women must carry. But as a man himself, Ondaatje understands the wordless anguish of being a man, with all of its opportunities, tragedies, successes, and yearnings for love. He sets words to that anguish. His wounded and vulnerable male characters are cared for and healed by the female characters, who they thank by healing them in return in different ways. His prose here is full of masterfully crafted metaphors and full of pieces of wisdom about life, about writing, about what I said above, and about much more."}, {"userName": "Trish", "userReviewDate": "Dec 04, 2008", "userURL": "http://www.goodreads.com/user/show/1190625-trish", "userReview": "God I did not like this book. Really, really did not like it. I read all the 4 and 5 star reviews, I get what people are saying, and I'm just not there. Why get us interested in characters and then abandon them? and why spend time telling us boring things about them (like a whole paragraph describing how she planted seeds in the field by scattering them instead of burying them) and then we find out about major dramatic events only in one passing sentence told as a part of someone else's narrative (like \"------ was put in prison for nearly killing a man in a jealous rage\"). This was like a bunch of pieces of stories. I get it - Divisadero. They're being divided. Lots and lots of divisions. And yes, we have a dark and stormy night, and bad things happen, and the snow comes down, and people are feeling upset - Isn't this a bit heavy handed? Never mind that setting a book in Northern California should prevent an ice storm from occurring (and no, it doesn't work for me to throw in a line later saying it was a rare event). And the last thing that drove me crazy was how the book just leaves out the How of things. There is no connection from one event to another - you are just supposed to leap. They know each other, and now they are sleeping together. We see no evidence of romance building, but boom there it is. So, it was not believable, and just felt like some clever writerly experiment. Which was not a pleasure to read."}, {"userName": "Emily", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/1113562-emily", "userReview": "For those who have not read an Ondaatje book before, \"Divisadero\" may not be a good first start. A newer reader may be expecting a plot that rises and crashes as much as the one developed in \"The English Patient,\" which Ondaatje became known best for after the success of the film version. (And even if you haven't watched the movie 10 times over like some of us, you get it: War, lust, affair, secrets, heartbreak, the end.)But for those who have eaten, lived and breathed his words relentlessly since that wonderfully told story, \"Divisadero\" is a welcome return to what Ondaatje brings beneath plot: an endless exploration through history and language, and an intimacy with characters unsure of their situations.I couldn't turn three pages of \"Divisadero\" without learning a new word or anecdote or strategy to a different way of life. I'm convinced the man must read every book in the library to have such a catalog of knowledge. Did you know there's a word the old poets used for when a person calls their lover by a different name? How did people break down a rough field's terrain to turn it into rich soil before the days of Miracle Grow, Home Depots and pesticides? Ondaatje drops the answers and details to little bits without speaking above the reader or losing his characters in his explanations.In reading \"Divisadero,\" we walk through the different lives of a farmhand, a gambler, a gypsy and a writer. We learn not only about their trade, but also their fears and secrets, information casually unfolded much like a new friendship. For all that Ondaatje reveals about his characters, you almost feel as if he's trying to not reveal too much - he's holding a hand up to the camera at points, closing a door before too much air comes in. Their details fall underneath a loosely woven plot which is also detached, and has holes in it. This may be frustrating for those looking for a resolution - one demonstrated by actions and conclusions made by characters and narrators - but once you get past the untraditional structure, it feels very much like real life. These are lives like many of ours; even in good circumstances, our relationships and identity are divided by past and distance and conflict. We won't always know what brought us to here or there, or what made so-and-so act like that, or how to bring everyone back together after an almost unforgiveable act. So we piece our stories together, as Ondaatje has his characters do here, with photographs and stories and memory, or the absence thereof."}, {"userName": "Ryan Chapman", "userReviewDate": "Jun 03, 2007", "userURL": "http://www.goodreads.com/user/show/18213-ryan-chapman", "userReview": "This might bear more fruit on a second reading, but as it is right now I would consider this a lesser Ondaatje than the brilliance displayed in  Anil's Ghost and Booker Prize winner  The English Patient. The first two-thirds of the text spans the young lives of a mixed family in Northern California and Nevada--the trio of sisters Anna and Claire with adopted farmhand (and John Grady Cole archetype) Coop. There's a predictable/inevitable running through of paradise attained and lost for this family involving a violent incident with their sketch of a father; the second part catches up with the trio as their lives spiral out into disparate/desparate conditions. Claire's a legal assistant in SF, Coop's a gambler in Tahoe and Vegas, and Anna's an archivist in the south of France researching the poet Lucien Segura.The prose is still as revelatory as ever, but Ondaatje's subjects seem randomly chosen and weakly justified. Instead of following any of his characters' emotional arcs, he prefers to introduce new characters and extreme parallelism to indirectly address the themes of loss, memory, and sublimated desire. Ondaatje makes an audacious formal experiment here, creating an ambiguous level of intertextuality for the last third of the novel--which at best helps us understand either Anna's approach to her past or the idea that these kind of things happen all the time. If Ondaatje were a more experimental novelist, in which the architecture of the book was foregrounded over his characters (see  Cloud Atlas), this might work. Instead he wants to eat his cake and have it too: characters the reader emotionally identifies with but is fine abandoning every fifty pages for a new set of very similar characters. What we're left with is a clever hall of mirrors reflecting something beautiful, but incomplete."}, {"userName": "Serenity", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/1254023-serenity", "userReview": "I just finished reading this book. I found it beautiful, haunting, and while at first I was dissatisfied with the loose and ultimately unresolved nature of the novel, I later decided to accept it and consequently appreciated it much more. Ondaatje is a poet as well as a novelist, and he lets poetry infuse his fiction richly. In this work, I feel that he has taken it one step further and stripped the events in the book to their essence, as in a poem. Read in that way, it no longer matters whether there is a tidy resolution to the collage of plots and characters. Although there is in fact resolution to the intertwining stories, the reader must decide it for herself, as in a poem.The book takes on as one of its themes the very function that art performs for us as human beings, on a psychological level, and Ondaatje seems to be saying that we use it to protect ourselves from the life's harsher truths. As the voice of the narrator, Anna, tells us in the novel, \"...this is where I learned that sometimes we enter art to to hide within it. It is where we can go to save ourselves, where a third-person voice protects us.\" It serves to \"transcribe a substitution/ like the accidental folds of a scarf.\"The characters in this book have much to hide from, and it is their lack of relief from the pain in their lives that resonates most deeply, in the end."}, {"userName": "Teresa", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "To explain why I liked this book so much would be to give too much of its pleasures away. I will say, though, that the writing is beautiful and seems effortless. And that its themes are my favorites: memory, loss, connections that are made (but are too soon gone) and connections that are missed (in more than one sense of that word), never to be forgotten and seen everywhere."}, {"userName": "Miriam", "userReviewDate": "Jan 31, 2008", "userURL": "http://www.goodreads.com/user/show/27572-miriam", "userReview": "Oh my god. Every once in a while and this happens like maybe once a year, I find, you read a book that is just the RIGHT BOOK at the right time. And this is it. Amazing. Gorgeous. It's hard to even say. Because there is also a roughness to it, to the characters that is almost gripping. That and, ta-dah it is so intricately structured. I love structures that I want to think about. And this is one. I want to just turn it over and read it again and again.It also makes me want to go back and read The History of Love which was that most perfect book about two years ago. Sigh. Now I have to read something very silly otherwise I will be sorely disappointed. Everyone who hasn't read this one must read it right away. You will be awed and amazed."}, {"userName": "Janet", "userReviewDate": "Feb 09, 2015", "userURL": "http://www.goodreads.com/user/show/1421407-janet", "userReview": "This was a fascinating unfolding of story, and simply heavenly writing. What a giant he is.Divisadero begins as a Steinbeckian story of a small family in the Gold Rush country of California, circa around 1970--a rancher and his two daughters (his wife has died giving birth to one of them, and he left the hospital with another baby, whose mother has similarly died giving birth two her), plus the hired hand, who was taken in by the rancher when his own family was murdered, leaving him the sole survivor, and follows them (the natural daughter, Anna, is the only one with a first person point of view, the other two young people are told in third person.) through a terrible incident which explodes the family, into the separate lives of each of them as they grow older. But Ondaatje's project is far different than Steinbeck's, which is to go further and further into the soil of that particular landscape and unfold it completely. Ondaatje's is about fragmentation, the fragmentation of life, and how people change one another as they enter each others' lives, if only for a little while. Anna, the first person narrator, becomes an archivist, and we find her in France, working on the papers of a mysterious minor writer, Lucien, and enter his life, and a family of 'travelers' he later encounters. The book becomes more labyrinthine in the second part, and there are wonderful echoes between the various parts of the story, which is a delicate construction of extremely collapsable parts, which could come apart at any moment, but the voice--the author's voice--is so strong and knowledgeable and clearly capable of anything, we just ride right along with him.The title, Divisadero, is the name of a street in San Francisco, which had been the dividing line between the city proper and the pastures of the Presidio, the military base. But it's a lot about people leaving on borders, of their own lives--people who have walked out of one life and are never fully integrated into another one. And the language here, the confidence of the way he puts these disparate elements together, lightly, so lightly, it makes reading the book a lot like sitting out on a summer night watching the Northern Lights. God knows what it \"means\", you just lie out and watch it dance."}, {"userName": "David Sasaki", "userReviewDate": "Jul 18, 2008", "userURL": "http://www.goodreads.com/user/show/880021-david-sasaki", "userReview": "There is not much I can write about Michael Ondaatje's Divisadero without echoing what all the other reviewers have already written: Ondaatje is a craftsman. His writing reveals decades of self-scrutiny, of each year wanting to say more with fewer words.Divisadero is about love and the loss thereof. Love falls victim to the jealous wrath of a protective father, to drug addiction, to the minor details of our daily lives, and the greater mystery of the entropy of desire:Lucien and his future wife left the curtained parlour and walked arm in arm for an hour or two along a road banked with poppies and into a marriage that created two daughters. There would be years of compatibility and then bitterness, and who knew when that line was traversed, on what night, at what hour. Over what betrayal. They slipped over this as over a faint rise in the road, like a small vessel crossing the equator unaware, so that in fact their whole universe was now upside down.Much of the novel takes place in the parts of California that even most Californians don't visit: Petaluma, Grass Valley, Santa Maria, Lake Tahoe. I have strong memories of all four places and Ondaatje's descriptions are not only apt; they also manage to capture the aesthetic of the 'other California', far from the bleached hair and blonde sand of Southern California and the cosmopolitanism of the Bay Area. I can only assume that his descriptions of provincial France are equally percipient.There is also, it turns out, a link between this novel and Brazil. On the acknowledgements page of the book facing the back cover, Ondaajte writes:The song 'Um Favor' (partially described on page 73) by Lupicinio Rodrigues in essence began this book.Here is that partial description from page 73:\n  All of the world there must be people like us, Anna had said then, wounded in some way by falling in love - seemingly the most natural of acts.\n  He told her there was a song he no longer performed that had to do with all of that. It was about a woman who had risen from their bed in the middle of the night and left him. He would hear evidence of her in villages in the north, bust she would be gone by the time the rumour of her presence reached him. A song of endless searching, sung by this man who until then had seldom revealed himself. His tough fingers would tug the heart out of his guitar. He'd sing this song to those who had grown up with his music over the years, who were familiar with his skill at avoiding the limelight. He knew his reputation for shyness and guile, but now he conceded his scarred self to his friends. 'If any of you on your journeys see her - shout to me, whistle ...' he sang, and it became a habit for audiences to shout and whistle in response to those lines. There was nowhere for him to hide in such a song that had all of its doors and windows open, so that he could walk out of it artlessly, the antiphonal responses blending with him as though he were no longer on the stage.\nAnd a related quote from Divisadero, originally muttered by Nietzche:We have art so that we shall not be destroyed by the truth.For your listening pleasure, here is Lupicinio Rodrigues' 'Um Favor'. (Right click, save as)."}, {"userName": "Khashayar Mohammadi", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/32374363-khashayar-mohammadi", "userReview": "Can't say its my favorite book of Ondaatje's, but its still Ondaatje. Certain passages were exceptionally breath-taking, even by his own standards, and on the whole i enjoyed the majority of it so damn much. However, when compared to the subtlety of his other works (English Patient Excluded!), the dramatic turn of events was somewhat off-putting to me. On a side note, Ondaatje seems to have an impeccable talent for speculative fiction. Its heartening to see how well he can slip into such a colorful spectrum of characters from different countries, different times, different belief systems. It was only after finishing this book that I realize what I found most interesting in his writing. He masterfully maintains an objective narrative while telling incredibly intimate and subjective stories. Kudos to the empath par excellence!"}, {"userName": "Mark", "userReviewDate": "Jan 01, 2008", "userURL": "http://www.goodreads.com/user/show/348966-mark", "userReview": "Maybe 4 +half—Ondaatje’s novels always seem somehow flawed, because they’re not like any other author’s novels. They leave me a little confused and not a little mystified—but a confusion stemming from awe and wonder. Ondaatje’s novels are poems—or, rather, collections of poems in prose of varied pace and pitch—and they can’t be read by the ‘normal’ rules of novel-reading. So, to call “Divisadero” a strange and beautiful concoction is just to say it’s a Michael Ondaatje novel. I say all this because if you’ve read any reviews of “Divisidero,” you’ll maybe have come away with the impression that the novel doesn’t work; its storylines and central characters are incomplete, its title cryptic and its narrative voice inconsistent. Yeah, it’s an Ondaatje novel. I’m here to say that if you know what I mean by this, or even if you don’t, it’s an amazing work. “’We have art,’ Nietzsche said, ‘so that we shall not be destroyed by the truth’”: This quote frames “Divisidero,” and in the pages between is the proof."}, {"userName": "John", "userReviewDate": "Apr 25, 2008", "userURL": "http://www.goodreads.com/user/show/353993-john", "userReview": "A very disappointing read. A book that started off with a bang and then just faded in the middle. This fairly recent book was available for sale at the inflated price of $30 in Singapore bookshops so when it popped up in the American Club Library, I figured it was a smart, cost-efficient move. It was since buying the book would have been a waste.The man can write. His account of a tragic incidents in the lives of two young girls and an orphaned hired hand on a northern California farm creates suspense and interest. But then it's like he starts over in the middle and begins writing another book about the life of an obscure French writer in another century. I missed the parallels and subtleties, failing to make connections. The prose hit the wall and I found my reading speed accelerating not out of interest but simply out of determination to finish it before the expiry date and return it to its rightful place on the shelves of the American Club library."}, {"userName": "Elyse", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Fantastic!!!!!When I saw Jaidee review this book today...( Thank You, Jaidee).., I was bursting withCheer!!!Why have people not read this book???It's a slice of heaven. Much of it takes place Napa, Calif. plus, \"Divisadero\", is afamous street in SF .. where the one of the characters -(Anna), - grows up..,,so, much of the location - of the storytelling is also in SF I still own it, this nov..( treasure it) I remember 'pre-ordering' it. I had no idea I hadn't reviewed this. I happen to love how Michael Ondaatje's writing makes me feel. For those who don't know this author..He wrote 'The English Patient'It's a 'experience' reading Michael Onndaatje Viva-la-melty!!"}, {"userName": "Shawn Mooney", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/50408211-shawn-mooney", "userReview": "Bailed on page 75. The opening scenario was gripping, but then one of the women is in France and seems to be falling in love with a Romani dude, and things turn cloyingly horrible. I refuse on principle to finish a book that has this sentence in it: \"All over the world there must be people like us, Anna had said then, wounded in some way by falling in love— seemingly the most natural of acts.\" Just no. No! Nooooooo!"}, {"userName": "emily", "userReviewDate": "Mar 14, 2010", "userURL": "http://www.goodreads.com/user/show/104806-emily", "userReview": "For a brief moment, I wondered if maybe I wasn't smart enough. Especially with all the comments on here saying things like \"hey, this is just like life, because sometimes in real life narrative threads are lost and we don't really understand what happens.\"Then I realized that that's a cheap argument. Because sometimes in real life, my cat poos on the floor and I step in it, but you can't argue that that is therefore deep because it is real. (I am not comparing this to cat poo. Honest.)My book club read this, and we were pretty evenly split. Some people really liked the fogginess and the timeshifts. However, I was really frustrated by them, and especially by the book's mid-stream transition to being about a French novelist instead of a California sibling-ish trio. There are regular swaps in narrator, in time, in place, and few (if any) real transitions, and this is, in itself, not a huge problem.However, there's a feeling of unfinishedness about it -- we leave characters at major life transition points, then don't bother to go back to learn what happened. Other characters show up and fade out. The characters themselves (I'm looking at you, Coop) seem as confused as we are -- they form temporary alliances without much real explanation or evidence of thought. Once again, some of my book club argued that this is because we don't always understand why other people do what they do, but I disagree: if we're being told, even via third person, a story that really does take place from a specific person's point of view, I don't want to just hear, again and again, that he is confused and unsettled and thinks he might have sex with her and is confused and where is he again? Unsatisfying and, ultimately, it lost me."}, {"userName": "Sara", "userReviewDate": "Jul 14, 2007", "userURL": "http://www.goodreads.com/user/show/119675-sara", "userReview": "Another outstanding offering from one of my favorite authors. The narrative travels back and forth in time, forging links between the past and the present. Ondaatje gives clues in the content as to the critical themes. \"All over the world there must be people like us. . .wounded in some way by falling in love--seemingly the most natural of acts.\" \"We live permananetly in the reoccurence of our own stories, whatever story we tell.\" \". . .what is most untrustowrthy about our natures and self-worth is how we differ in our own realities from the way we are seen by others.\" In a sense, this is a story without ending, just as our lives are without ending. Lives continue on until they stop, with no tidy, neat resolution of the plot points. And so it is with \"Divisadero.\" Some might think that the stories of Anna, Clair, and Coop stop in mid-air and disappear. Ondaatje gives us all we need to envision for ourselves what their lives might turn out to be, and what connections linger, or are re-forged. Each of us is free to end the story of Ondaatje's main characters by in a sense superimposing our own narrative onto his. Perhaps odd, yet for me, entirely satisfying. The language as always is georgeous--perfectly envisioned sentences, perfectly executed. Every one of Ondaatje's books I've read has lingered in my mind. I return to their thoughts and structures over and over, and in turn get captured again and again. Certainly a book that I will re-read."}, {"userName": "Laura Byrnes", "userReviewDate": "Oct 22, 2008", "userURL": "http://www.goodreads.com/user/show/395480-laura-byrnes", "userReview": "Beautifully written, and frustratingly unfulfilling...but I think that may be the author's point. The three storylines (filled with a multitude of engrossing characters) are divided by time and place but are supposed to intersect with one another symbolically, spiritually and metaphorically. Sound confusing? It is. It is also hard to articulate a cold hard opinion of this book; to do so lessens the effect of the book. Ondaatje's style is so lyrical, I'd find myself stopping and wanting to write down a phrase or image he desribed, so I wouldn't lose it. This is a novel written by a poet. A poet's take on the themes of loss, endless searching for connection and escape from the past. When you finish, because of the different time continuums that occupy the novel, you'll will want to go back to page 1 to fill in the missing pieces. It's hard to digest in one reading."}, {"userName": "Pat", "userReviewDate": "Jun 22, 2008", "userURL": "http://www.goodreads.com/user/show/1255876-pat", "userReview": "This book is beautifully written. It is three disconnected stories in a mosaic. Each beautiful and complete in itself. The stories are linked to each other through a common character. I loved all the characters and was sad to leave them behind as the book moved on to the next story. In this way, it seemed to me to be a more of a collection of short stories sharing characters (similar to Franny and Zooey) than a novel."}, {"userName": "Janice", "userReviewDate": "Jun 09, 2008", "userURL": "http://www.goodreads.com/user/show/628875-janice", "userReview": "I very much enjoyed this book. But it was a little confusing toward the end. so I think it may need a second read. I came away with beautiful imagery of how people, specifically all the main characters fragment themselves. I think that the format of the book is also a story/metaphor of this fragmentation. I'm not saying that any of his other books has straight forward, linear, single protagonist narration, but this literally felt like the narration was shattering towards the end into more and more characters and more and more time periods. I felt at the end I was not perfectly clear about whose story I was reading... which I believe was part of the point, but also not completely pleasant. It was a bit confusing. I also did come away with the \"moral\" that we all see our own story everywhere. It was an interesting break in the narrative for me... literally bringing me out of the complex web stories to look at myself and why I read and question why I read and how I look at others. Do I constantly draw my story on others... over and over? of course I do. Which brings me to another theme.Is this only because I have felt trauma? Then there is this theme of trauma and who has not felt trauma and in whose perspective is trauma? Yours. Not others. So any event that heavily/intensely impacted you and formed you negatively may be trauma. But there is also the perspective of keeping things in perspective; remembering the human connection and how your trauma is not perceived so by others. It was also a study in how people get over trauma. The sudden break, the different persona, the contstantly taking different personas, risk taking drama seeking, running away, writing/art, seeking stories to absorb yourself in, being a work-a-holic, adopting new families, do-gooding, denial... But this may only be my take on it because I am drawing my story over and over again. But regardless of all this, I did enjoy it. On a basic level, there are beautiful lines and imagery in it."}, {"userName": "Charlaralotte", "userReviewDate": "Aug 02, 2008", "userURL": "http://www.goodreads.com/user/show/892994-charlaralotte", "userReview": "Well...When you've already written \"The English Patient,\" it's hard to do much better. Unfortunately, it also seems to mean you don't get good editorial advice anymore.This book has the makings of two good, separate books that would be tied together by a slim plot connection. As it is now, the two story lines are poorly integrated & feel forced.I found the Cooper story dull, if only because I'm tired of Texas Hold 'Em poker & Las Vegas & America in general.The Lucien story, on the other hand, is magnificent & I could read about him forever. Lucien's story is what kept me reading the book. Wonderful descriptions of clock repairers journeying through the French countryside to keep the clocks on time. Wonderful descriptions of the travelers. Ondaatje should stick with writing about Europe. His style is much more appropriate for the continent. But if he's got to write about America, let's give him some help learning about more interesting things than poker."}, {"userName": "b borkent", "userReviewDate": "Feb 02, 2008", "userURL": "http://www.goodreads.com/user/show/390997-b-borkent", "userReview": "as usual Ondaatje incorporates some beautiful imagery and there are some really outstanding sections of this book. However, on the whole, a disjointed piece with a whole lot of exposition and background description, but no sense of resolution to 2 out of 3 parts of the story. The good part, near the end, is just a back story about a character that is already dead and has almost nothing to do with the rest of the book at all. One of the very main characters is conveniently beaten to crap and has amnesia, and that's where his story ends. Come on! It's no wonder this book was passed over for prizes this year."}, {"userName": "Mark", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/7956175-mark", "userReview": "Divisadero, as its clunky Spanish title unintentionally implies, will divide your opinion at the same time it hovers in the memory long after you finish. Magnificent as well as overblown; embarrassing, yet also intense and ultimately moving; filled with moments that belong in a Mills & Boon romance counter-pointed by mind-blowing feats of linguistic energy and narrative multiplication. It's a wonder someone can be this great and so lushly bad all at once. What you can't fault Michael Ondaatje on is his ambition – and the restlessness beneath it.My first impression on finishing this book, though, was strangely extra-literary. What is it about suicide that so obsesses Michael Ondaatje? All through his novels there is a fascination with self annihilation, with the urge, at best, to disappear and reinvent another life, or give one-self up to destructive fates. According to Anna, his main narrator in Divisadero, “sometimes we enter art to hide within it. It is where we can go to save ourselves, where a third person voice protects us.” If that is so, it’s the dark stuff at the root of - and increasingly hidden by - Ondaatje’s florid gifts that may well decide what it is you prefer to draw from this book. Will it be the deep violence and fragmentary accelerations; or the beautiful poetics and romantic lattices of plotting and character? Is it the early, wild, unsettling Ondaatje of Coming through Slaughter (1976) you like most? Or the later, lyrically rich Ondaatje of The English Patient (1992), the Booker Prize winning novel, and then film, that made him a literary superstar?In Divisadero those preferences can be measured almost entirely along gender lines: by whether you favour the parallel tales of Anna or Coop. Anna is an academic researching the life of a deceased poet and novelist called Lucien Segura while staying at his deserted manoir in rural France. Coop is a cardsharp who misadventures among ‘60s dropouts (“hippies are living proof that cowboys still fuck the buffalo”) in the casinos of Tahoe, Nevada. Inevitably Anna and Coop’s thoughts turn to each other and their upbringing on a Californian farm in the 1970s. Divisadero opens with a winter reverie of this farm as Anna watches her adopted sister Claire riding in the snow as “she persuades the horse down through the whiteness alongside crowded trees”. We meet the girls’ father, a stoic widower who allows rare moments of intimacy when he falls asleep on the sofa and Anna climbs up beside him to “lie like a slim dog in his arms”. The choice of language is typical Ondaatje: ‘persuades’, ‘like a slim dog’... here is a writer who uses every note musically, who can knock you sideways with a single word, and most certainly a phrase. As teenagers Anna and Claire form a love triangle of sorts with Coop, who is just a few years older and lives and works on the farm. Their world is shattered when the girls’ father finds one of them together with the boy. We flee with all three into adulthood, and from the scattered vantage points of Anna’s literary research in France, Coop’s gambling adventures in Nevada and Claire’s work as a legal investigator in San Francisco we re-gather who they were and what they have become.Depending on whether you define Ondaatje’s first book The Collected Works of Billy the Kid as a novel or a narrative collection of poetry (it was subtitled ‘Left Hand Poems’ so that probably decides the matter), Divisadero ranks as his fifth novel. Born in Sri Lanka and educated in England before emigrating to Canada at age 21, Ondaatje seemed at the apex of a re-appraisal of narrative strategies and novelistic form when he burst on the scene with Billy the Kid (1970) and then the remarkable Coming Through Slaughter (1976), an imagined autobiography of the life of the early jazz musician Billy Bolden: “When he bought a cornet he’d shine it up and make it glisten like a woman’s leg.” In a discontinuous method that was similar to Billy the Kid, Ondaatje tracked Bolden’s descent into madness and obscurity through a mix of poetry, narrative, song, photographs and documentary fragments. Coming through Slaughter remains the author’s trimmest and most shattered, as well as shattering work. At least some its energy undoubtedly derives from rumors of a personal breakdown and the end of his first marriage around the time it was written.Ondaatje followed through with Running in the Family (1986). Part memoir, part dream of return to his boyhood home in Sri Lanka, this non-fiction work showed Ondaatje tracking down the ghosts of his family in what was once known as ‘Ceylon’ – and, of course, the stories and memories he had grown up with or tried to repress, most of all the exploits of his alcoholic father. It is one of the best ‘travel’ books ever written, overflowing with the sensual beauty of Sri Lanka, a country whose outline the author compares to “the shape of a tear”.Since those books Ondaatje’s novels have grown larger, richer, more ambitious and inevitably more frustrating. Set in the 1930s and ‘40s of Toronto, Canada, In the Skin of the Lion (1987) broke him to an international audience with its streaming paens to work, love, dynamiting, bridge-building and the lives bound up in the monuments and history of a city. Arriving on the heels of Running in the Family it also marked a more fluid voice for Ondaatje, moving away from his devastatingly fractured early style and a focus on individuals into what he now termed “an interest in community”. The English Patient would go on to confirm as one of the world’s leading novelists, submerging – or is that refining? – his early radical style even further. It’s now been seven years since Anil’s Ghost, Ondaatje’s last novel, which felt in many ways like a re-write of The English Patient - more controlled, better edited, and somehow less energetic despite the obvious commitment behind it.Ondaatje still seems to be trying to get out of his narrative cul de sac in Divisadero, though it feels much closer to a breakthrough than Anil’s Ghost ever did. Yet he retreats into scenes and themes so familiar we’d accuse another writer of plagiarism if they tried it: a deserted house that is occupied temporarily (like the villa in The English Patient); an aerial scene that involves architecture and a rope harness (like the bridge building in In The Skin of the Lion, or the mural scene in The English Patient); the use of a past story and a damaged mentor to overlap a present tale (again, like The English Patient).You put down Divisadero a little stunned by this almost gratuitous and unnecessary repetition. Pondering the reverberations of an overheard radio broadcast in Divisadero where the author of Sophie’s Choice is heard to say, “You know I think I have already written the most intimate and profound book I will ever be able to write. I don’t think I can go as far as that again. From now I should try comedy. Comedy is not easy, I know. But at least it is not the same road.”It could be that the poet in Ondaatje is so trapped by his own particular obsessions with image and metaphor that he can no longer support his narrative interests as a novelist. And yet Ondaatje is notorious for his depth of research, be it the five years he spent at perusing the journals of explorers in the library of the Royal Geographic Society for The English Patient, or the time he has clearly spent among gamblers to gain a working grasp of Texas Hold ‘Em poker for Divisadero.Certainly Coop’s story forms the most compelling thread of Ondaatje’s latest book. And though background broadcasts of the First Gulf War and the Iraq invasion feel forced as a political theme, it’s thrilling to see Ondaatje engage with contemporary American culture in a way that’s reminiscent of Cormac McCarthy’s highly paced moves in No Country for Old Men. Let’s put it frankly: Ondaatje’s best writing has always been connected to his American obsessions – the American West, jazz music – rather than his European longings and the cultural self consciousness this can effect in him.This self conscious note is almost inevitably struck during Anna’s story, reaching absurd lengths when she encounters a gypsy called Rafael whose “pockets always held a few herbs, basil or mint, so he could rip off a heel of bread and create a meal wherever he was.” By the time Rafael is playing guitar like Django Reinhardt and we are meeting his mother ‘Aria’ the whole thing sounds like something dialed in from Gypsy Romance Central.In these moments we see Ondaatje’s tendency to lean on rich language to do the work that believable character and dialogue are failing to achieve. And yet Ondaatje finally triumphs in this strand too as Anna’s story dissolves into the extended tale of Lucien Segura (or it his tale that dissolves into her telling?) and we witness how the French writer’s childhood, later experiences of war and a frustrated love affair echo all that has later transpired in the lives of Coop, Claire and Anna.At one point Ondaatje has Anna reflect what could serve as a manifesto for the entire novel, and perhaps all of his work as a writer: “Everything is biographical, Lucien Freud says. What we make, why it is made, how we draw a dog, who it is we are drawn to, why we cannot forget. Everything is collage, even genetics. There is a hidden presence of others in us, even those we have known briefly. We contain them for the rest of our lives, at every border that we cross.”Ondaatje’s use of over-shadowing, echoing elements of plot and language, along with his sense of psychological collage in the storytelling, are all used in an attempt to bind Divisadero – the results are unsuccessful, though sometimes emotionally powerful. In the end, however, Divisadero still feels like the work that it is: four novellas woven together to form a literary house of mirrors: from Anna’s stay at the French manoir in all its sensuousness and pretentiousness, to the wild yet overly-compressed gambling stings that Coop is enmeshed in, to Claire’s even sketchier role as a mediator, to the beautifully extended, concluding life of Lucien Segura, and his final observations from a fragile row boat on a pond, of “birds in the almost dark… flying as close to their reflections as possible.” Much as I was incredibly moved by this closing image, it also signals the romantic narcissism that drowns as much of this book's poetic energy as it releases. Divisadero isn’t just about the divided lives of its antagonists, you see – it’s a reflection of Ondaatje's own profoundly splintered abilities and vision as a poet and a novelist.- Mark Mordue* This review was first published in an edited form in the Sydney Morning Herald Spectrum Books, May 19th, 2007. Now located in full as above as www.markmordue.com"}, {"userName": "Alex Nye", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/9293875-alex-nye", "userReview": "Again, read this in tall narrow house in Nerja, Spain, overlooking Andalucean mountains. Had it on my table to read for months, and didn't get round to it. What I really loved about this book was the fact that Ondaatje is brave enough to let his fiction/story/narrative take him where he pleases. He doesn't feel constrained by some imaginary editor sitting on his shoulder saying critically 'you can't do that' or 'the publisher won't like that.' The beginning of the book opens with a painful love triangle, two sisters, a sort of cuckoo Heathcliff character, and a father who reacts violently to finding his daughter 'intimate' (I'm so polite!!!) with the boy. What is amazing is that the narrative then seems to leave these characters completely behind, and the busybody editor in me was saying 'but surely they would tell him - you are not in control of your narrative, you must get back on track'. And yet it worked. Two thirds of the way through you realised that he knew what he was doing after all; he was spreading the story thinly, and created not one but (I counted them) six different love triangles throughout the story, all gently linked simply by virtue of their symmetry. The stories were poles apart, in different countries and time periods, but it worked so beautifully. And that is what took my breath away - the realisation that you can forget the advice of the editor on your shoulder, causing too much restraint, and go with your instinct. The other thing which struck me was that the publishers obviously didn't know how to express this in a blurb, because the back cover only mentions the first love triangle, which is slightly misleading because the novel is actually much more than that. But then again, how do you express that in a blurb? Ondaatje is the only novelist I know who has the courage to keep you guessing, to make you realise that you have to be patient, that although he may seem to be going off on a tangent, there is an order of some kind - it's just not the one you expected, and it's certainly not the one that fits the usual conventions of what publishers expect of plot. But that's why I like him. He's unpredictable and gives me the courage to write how I want to write, without constraint."}, {"userName": "Simon Robs", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/50133154-simon-robs", "userReview": "Four star? Might be. Good read."}, {"userName": "Claudia Putnam", "userReviewDate": "Aug 15, 2015", "userURL": "http://www.goodreads.com/user/show/4162791-claudia-putnam", "userReview": "4 because it's O, and there are so many moments of surpassing brilliance in the writing. It's not the EP, and not the Skin, and not Billy, and not even Anil's Ghost. I was listening to this rather than reading it, and so I might have missed something, but I decided that Anna must have been the narrator throughout. Does anyone disagree? That she was imagining all the other shards? Which is why all of them, other than Segura's, in whose she is most deeply invested and most immersed at the time of the telling, kind of wander off. In Segura, she is hoping to find the mirror for the rest of her shattered life.It's beautiful, but.It really is, as Lahiri put it, a handful of glass. WHY DOESN'T ANYONE EVER CALL AN AMBULANCE in this family? The girls are left to lie, desperately injured, in the stable when they are 12 and no one ever looks for them. They are unconscious for an entire day and are never taken to the doctor. Ok, people got concussions a lot back then and no one thought much of it, but... odd. I wasn't exactly sure of the timeline, ie, how old Anna is at the time o the telling, but I thought 40s, and I thought it was early 2000s, and so I also thought it odd that Claire had polio as a child. Thought she would have missed that party.Since I think it is Anna who is narrating, we can't be sure Coop survived that beating in the cabin. So therefore I will let it slide that he is not severely head injured in that first beating, and that Claire does not call for medical help (yes there is an ice storm, maybe an ambulance can't get there, maybe the lines are down, whatever). And since we can't be sure that Claire ever ran into Coop again, I suppose we can let it slide that she didn't take him to a hospital after the second beating, though it seems odd that even Anna would imagine that \"medics\" (ahem, EMTs) would arrive and just leave him in that condition without loading him into the ambulance and taking him regardless of what Claire said. I mean, it's around 2002, right? In California or Nevada? (The other reason I thought maybe Anna was imagining this is that \"Lake Tahoe\" is imagined vaguely as \"Lake Tahoe\" rather than as a specific town on the shores of the lake. If you're gambling you're on the Nevada side, such as in Sparks, where Sierra Sid's is.) Also, there are medical responses and therapies for memory loss, and again it seemed odd that he wouldn't be in a brain injury treatment ward and that an educated person like Claire wouldn't want him there pronto. So, it seemed to me this was made up to serve Anna's emotional needs. It was Anna who needed the reunion with Coop and her father. The only reason I could see that Anna would not have contacted her family was that she really believed her father had killed Coop. Otherwise she would have tracked Coop down to be sure he was all right. And surely she would have at least googled her sister. So, that's the shattering event. That's why there's no going back. The horror, for Coop, of dying much the same way as he'd witnessed his parents dying, and also--doesn't that raise some questions, that Anna in no way throughout the whole novel wants to address. There is so much here. It's very rich. The other thing that bothered me slightly was the Segura ending. I wanted it to end with the girl (I have no idea how to spell it as I was listening to the book on CD) realizing that there will always be peasants like her and always romantic heroes racing away on a steed, and always the gulf between them. That was the truth. All the sap about Segura trying to close that gap that could not be closed--no. And that final image, sure beautiful, but also bullshit. And unfortunately, I've seen it on a hallmark-type card that you buy for the bereaved..."}, {"userName": "Nick", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/1927524-nick", "userReview": "Smooth, skilled writing (if on occasion at bit purple), well-developed characters, generally interesting settings (particularly the early twentieth century French part) all left of the floor at the end as if the author had lost interest and walked away. \"Divisadero\"--I get it, the fragmentation of modern life the way in which people permanently alter the lives of others and then move on, occasionally circling back, a theme stated clearly and with eloquence in the final pages. The novel shifts narrators and settings (one character's profession as a cheating dealer is no doubt a meta-commentary on the role and duplicity of the fiction writer), and in general strains to live up to the title. (The San Francisco district that gives the novel its name gets a mention, not even a cameo.) The novel's first section addresses the curious, and not fully explored, situation of a California widower who adopts two infants, one of them male, in addition to his own child. That family, with its unrelated adolescents, seems again like an authorial manipulation, although the crisis, when it comes, has an authentic feel. That crisis sends the three children out into separate lives. The adopted son becomes the aforementioned card shark, and the narration of his life has a noir-ish tone that never seems quite right. The adopted daughter, in an underdeveloped strand, becomes a paralegal for a public defender. The real daughter becomes an academic (as the child of an academic family, I am particularly immune to the charms of fictional representations of university life, and have for example been unable to finish \"The Corrections\"). The book loiters for a while on her residence and love life in the farmhouse once inhabited by the poet she is studying, before swerving back in history to that poet. At least in this novel, Ondaatje appears most engaged when he is invoking history, as in both the early California and early twentieth-century sections. The section on the poet as a soldier in World War I is particularly effective. The novel appears to be a series of triangles, the theme forbidden or frustrated or inadvisable love (at times, all of the above) and how it resonates through the years. The construction of those triangles feels at times rushed, even haphazard, and Ondaatje, as he states at the end, is more interested in posing the question than in offering even a partial answer. The result is a novel in which the most effective pieces do not provide sufficient support for the overall structure."}, {"userName": "Heather", "userReviewDate": "Mar 30, 2011", "userURL": "http://www.goodreads.com/user/show/2697646-heather", "userReview": "I evidently haven't read a Work of Literature for a while. I want to talk about this book with someone who read it!! There was much I loved about each fragment of the story, but only the last part of the novel seemed \"complete.\" I kept waiting to return to the original three characters, and was disappointed. I know this was deliberate on the author's part, but I want to figure out why!!!"}], "description": "From the celebrated author of The English Patient and Anil's Ghost comes a remarkable, intimate novel of intersecting lives that ranges across continents and time. In the 1970s in Northern California a father and his teenage daughters, Anna and Claire, work their farm with the help of Coop, an enigmatic young man who makes his home with them. Theirs is a makeshift family, until it is shattered by an incident of violence that sets fire to the rest of their lives.Divisadero takes us from San Francisco to the raucous backrooms of Nevada's casinos and eventually to the landscape of southern France. As the narrative moves back and forth through time and place, we find each of the characters trying to find some foothold in a present shadowed by the past.", "title": "Divisadero", "url": "http://www.goodreads.com/book/show/80063.Divisadero", "average": 3.49, "cover": "https://images.gr-assets.com/books/1431274286l/80063.jpg", "reviews": 1433, "authors": [{"url": "https://www.goodreads.com/author/show/4030.Michael_Ondaatje", "name": "Michael Ondaatje"}], "type": ["Fiction", "Cultural", "Contemporary", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/80063.Divisadero", "http://www.goodreads.com/book/show/17559057", "http://www.goodreads.com/book/show/2080832.Divisadero", "http://www.goodreads.com/book/show/1787711.Divisadero", "http://www.goodreads.com/book/show/1287465.Divisadero", "http://www.goodreads.com/book/show/11713.The_English_Patient", "http://www.goodreads.com/book/show/11076177-the-cat-s-table", "http://www.goodreads.com/book/show/5946.In_the_Skin_of_a_Lion", "http://www.goodreads.com/book/show/5942.Anil_s_Ghost", "http://www.goodreads.com/book/show/5941.Running_in_the_Family", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}