{"ratings": 20574, "userreviews": [{"userName": "Jesse (JesseTheReader)", "userReviewDate": "Sep 16, 2015", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "While this was an interesting read and even a bit creepy, it didn't completely grab me like I'd hoped it would. The romance in this book felt so out of place and unnecessary. It didn't do anything for me and I didn't find that it did anything for the plot. I also felt like the pacing of this book seemed a bit off. I am happy that I took the time to read this, but to me it just wasn't anything spectacular."}, {"userName": "Hannah Greendale", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Zach, Poppy, and Alice have been playing make-believe for as long as they've been friends. With pirates and mermaids, thieves and warriors, their imaginary realm is ruled by the Great Queen, a bone-china doll Poppy's mom keeps locked in a cabinet. When their dreams reveal the bone-china doll is haunted by a girl who longs to be buried with her deceased family, Zach, Poppy, and Alice set off on a real adventure to lay the girl to rest. Doll Bones doesn't shy away from the macabre and there are quite a few instances where the spook factor is employed to great effect: Poppy carefully took the bone china doll from her backpack. Zach drew his breath and went silent. The [doll's] dull black eyes were open, her gaze boring into his own. He'd always thought she was creepy-looking, but in the reflected beam of the flashlight, she seemed demonic. The problem with Doll Bones is that it flounders in its identity. It reads as though the author had two separate stories in mind, which she wrote and then merged together with clunky stitching.It's Poppy who drives the story, though she's not the primary protagonist. She's the first character to dream about the china doll's past: \"Did you know that bone china has real bones in it?\" Poppy said, tapping a porcelain cheek. \"Her clay was made from human bones. Little-girl bones. That hair threaded through the scalp is the little girl's hair. And the body of the doll is filled with her leftover ashes.\" Poppy is also the instigator of the grand adventure, one that was doomed to fail from the start. Along the way they break into a building and steal from multiple people, always justifying their actions by saying they'll return the items when they're done. They suffer no consequences for these reprehensible actions - a terrible message to promote to impressionable young readers. Though Poppy is the device used to propel the story, Zach is the protagonist. Doll Bones is a coming of age story. Zach's rocky relationship with his father, his desire to play with action figure toys as a pre-teen, and his budding interest in girls are explored amidst the journey to deliver the doll to her final resting place. These dual stories overlap in an awkward, forced manner. Poppy drives the story, because it's ultimately her desire to lay the doll to rest; Zach more or less tags along and just happens to hit puberty along the way. Doll Bones is a coming of age story shoved into the tale of a haunted doll. The book's macabre foundation and spooky interludes aren't enough to make up for its disjointed approach to storytelling."}, {"userName": "Micah Francis", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/33809095-micah-francis", "userReview": "I loved this book! I was hesitant going in because it is a middle grade book. I was pleasantly surprised. This book pulled me in immediately. The writing was amazing and I loved the illustrations. Three friends play an imaginary game. When Zach can no longer play, the game is over. Until Poppy has a dream about the bone China doll that acts as the queen of their game. Thus begins their quest and creeping happenings along the way. This book was fun and the writing was perfect. Recommend for everyone. 🌟🌟🌟🌟🌟"}, {"userName": "Betsy", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "I don’t watch much horror in general. I’m what you might call a chicken. When I do see it, though, I’m not particularly disturbed by random splattering and gore. The psychological stuff is far more of a lure for me. If I’m going to be honest, though, one of the scariest things I ever saw was on the cheesiest of television shows. It was this insider look into the world of ghosts and on the show we heard about a haunted home. It was a well-lit suburban house and we watched as a woman took off her shoes, walked over to the couch, and took a nap. When she woke up, the shoes were next to her. And that right there is what scares me half to death. Which is probably why a book like Doll Bones by Holly Black works for me on a horror level. Yet for all its creepy packaging, Black’s latest hides at its heart a remarkable, thoughtful take on what it means to grow up and pass from childhood into adolescence. Dark enough to attract fans of Goosebumps and the like yet able to make them actually think a bit about their own lives on a deeper level, Black strikes the perfect balance between the sensational and the smart.By and large middle schoolers do not play with dolls. But Zach, Poppy and Alice have been playing “the game” for years and it’s only gotten better with time. Using dolls of every type they spin wild tales and live out personalities different from their own. That is, until Zach’s dad throws out his toys in an effort to stop the game. Ashamed, Zach lies to his friends that he no longer wants to play. This act leads to unforeseen consequences when, in desperation, Poppy releases a bone china doll from her mother’s cabinet, only to find herself haunted by the ghost of a long dead girl. Inside the doll are ashes and if any of the three is to get any peace they will have to bury the doll in a specific grave. If they succeed they’ll have fulfilled their quest. If they fail? They may suffer worse than a ghost’s wrath. They might be . . . ordinary.Essentially what you’re dealing with here is what would happen if R.L. Stine every wrote a Newbery quality horror book for kids. And though it may not sound like it, this is high praise. I’ve always been fascinated with the nature of horror in books for children. Kids adore being scared. I recall well the adorable three-year-old who would return to my reference desk over and over again asking for “scary books” (I’d just hand him some very tame vampire or ghost fare and he’d be happy as a clam). The fascination fades for some, but for others it taps into the same instincts that drive adults to watch loads of horror films. The trick to writing really good horror literature for kids is to strike the right balance between the creepy and the safe. Go too far in one direction and you’re no longer writing for children but for teens. Go too far in the other direction and you’re not creepy enough, the kids tossing you aside the minute you bore them. Do not be mistaken. Doll Bones isn’t a chill-a-minute festival of screams. It’s smart and thoughtful and just happens to be about a doll constructed out of human marrow and stuffed to the brim with a little girl’s ashes. To my mind Doll Bones fits neatly into two distinct trends I’ve picked up on in 2013. On the one hand, it’s a book that doesn’t give up its mystery readily. You can read this book for a long time before figuring out whether or not the book really is a horror fantasy or if it’s just an elaborate con by one of our heroes. A book that is similar in its reluctance to give up the goods too soon is the remarkable science fiction/mystery The Water Castle by Megan Frazer Blakemore. These authors appear to be inclined to believe that their readers will stick with their novels partly for the good writing and partly to see if the book lives up to the promises of its dust jacket and cover. They aren't wrong.The second trend in chapter books for the kiddos I’ve notices is a prevalence of titles where characters must say goodbye to childish things. The aforementioned Water Castle does this, and the new Jerry Spinelli Hokey Pokey does little else. In Doll Bones, Black separates this book from being yet another average ghostly tale by giving it a tragic edge. The tragedy is partly the characters', sometimes admittedly inane, inability to talk to one another honestly about what’s going on in their lives. It’s also the tragedy of getting older and realizing that the friends you had as a kid may not be the friends you'll have as a teen. What once you had in common with other people fades away in the face of looming adolescence (a theme of the Frances O’Roark Dowell book The Kind of Friends We Used to Be albeit with less sentient dolls). All this talk of letting go of your youth and babyhood is told in the context of dolls. The kids play with dolls and the storytelling relies on their physical presence. So is storytelling itself childish to kids? Playing pretend is, and Black has to provide her child readers with the question of whether creating stories is an act of adulthood or childhood. Certainly Zach is good at it. You can hear him standing in for millions of writers all over the world when it says, “He liked the way the story unfolded as he wrote, liked the way the answers came to him sometimes, out of the blue, like they were true things just waiting to be discovered by him.” Transitioning from pretend to some kind of a creative output is often so difficult people will just abandon the act when they become teens. You can feel Doll Bones fighting against this tendency. In telling this tale Black holds herself back in a number of ways. She never shows too much of her hand when recounting multiple creepy moments throughout the quest. By the same token, she could easily have turned the kids’ fantasies with their dolls into separate narrative moments. You could have begun the book with a rip-roaring delve into the adventures of William the Blade and the hearty crew of the Neptune’s Pearl and then revealed that it was all the fantasy of three tweens. Instead, Black chooses to remain entirely in the real world. The gift of this book is that it feels like it could happen to the kid reading it. No one walks through a magic door into a strange land or encounters mystical creatures. These three kids have to get, on their own, to a graveyard far away and they have to deal with some VERY realistic problems like weird strangers on buses, bus tickets in general, suspicious adults, and cell phones (Black is to be commended for not ignoring their existence and instead weaving them skillfully into the plot). This grounding in reality is what makes the horror that much more engaging.\tIt is interesting to note that as of this review Ms. Holly Black is not a particularly well-known name amongst the younger set of readers. Years ago she helped Tony DiTerlizzi create the Spiderwick Chronicles and all the books in that series. Kids these days don’t remember Spiderwick all that well, though. So while Ms. Black continues to impress on the YA side of things, she hasn’t connected with children in a while. Happily, this solo outing does her proud. She indulges in smart wordplay and strong good writing for much of the book. I enjoyed lines like, “Before Lady Jaye, Alice’s favorite character had been a Barbie named Aurora who had been raised by a herd of carnivorous horses.” And the little details delight, like the fact that Zach’s cat’s name is The Party, or the fact that Poppy refers to her rear as her “buttular region”, or even the donut shop that has every possible donut flavor, from wasabi or acorn flour to Pop Rocks or spelt. If the book has problems it probably has something to do with the suspension of disbelief. The entire story tips on the fact that Zach refuses to tell either Alice or Poppy why he won’t play the game any more. So why exactly does he make everything so monumentally worse by not telling them what his father did to him? For a long time this fact plays out as a convenient plot point and not a believable fact. It isn’t until you’re at the tail end of the book that Zach’s confession “ripped away the fog of numbness and made him grieve.” Until that moment he claims he doesn’t want to play the game because it’s easier than admitting he never can again. I buy it, but I didn’t buy it for a very long time before that explanation. Also unclear is the ghost/doll. It’s hard to root for folks to help something malicious. Was the doll evil and ghost good? Were they one and the same or different? All unclear.It all comes down to something Poppy says near the end of the book. She’s upset that her friends are growing up and possibly apart from her. So she gives voice to a fear that so many children feel but are unable to verbalize on their own. “I hate that you’re going to leave me behind. I hate that everyone calls it growing up, but it seems like dying. It feels like each of you is being possessed and I’m next.” Pair that line with one earlier concerning Zach. “He wondered whether growing up was learning that most stories turned out to be lies.” Doll Bones positions itself to look like a simple ghost tale about a creepy doll, then sneaks in an engaging, thoughtful look at the ramifications of adolescence and storytelling. Consider this the thinking child’s horror novel. A devilishly clever read from an author too long gone from the children’s book genre.For ages 9-12."}, {"userName": "Giselle", "userReviewDate": "Sep 18, 2012", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Holly Black is one of few who can write something as cute as it is creepy!Doll Bones is a Middle Grade novel that is full of adventure and friendship--really the only type of MG books I read and enjoy. It's the story of Zach, Poppy, and Alice who have been friends for such a long time that their friendship feels familiar even to us. I immediately felt attuned to their mutual trust and support. Not giving in when the other kids laughed at them for playing with action figures. But then one day the game got a little bit more real, and it involves a creepy devil doll who is made of little girl bones!\n\"Her clay was made from human bones. Little girl bones. That hair threaded through the scalp is the little girl's hair. And the body of the doll is filled with her leftover ashes.\"\n*shivers* Obviously, there is a fantastic creepy factor to this book, mostly all due to this hell's creature doll, but the fact remains that it is an MG novel so it's the fun kind of creepy-- nothing to give you nightmares over, but still enough to appease the creep fanatics such as myself. A lot of it is due to it being open to interpretation: Did the doll really move itself during the night, or was it the animal who trashed their campsite? This is why movies like The Blair Witch Project became so popular, or why most books are better than movies; imagination can be most powerful. Imagination is what's at the heart of this whole book; it's what brought the friends together from day 1, and it's what turned this story into a fantasy adventure. If imagination is at its heart, it's the friendship that keeps it beating. These kids, determined and stubborn, go through a fair amount of difficulty to get to where they want to go and, even though there are many arguments and disagreements, they stick up and care for each other until the end. The narrator being Zach, we're privy to what it's like to be a young, hurt, pre-teenaged boy who wishes he could stay a kid for just a little while longer. These kids are 12 year olds, thus are still in that imaginative stage without being too childish. So we get a pretty balanced read with some dangerous happenings, a little thievery, risky antics, but it's all in good fun. To keep things even more interesting, aside from the doll we're kept from forgetting, we get a mysterious and quite disturbing story that surrounds the death of the girl whom she was created from--or so we're told ;)Delightfully sweet with a deliciously eerie vibe, Doll Bones is perfect for the young at hearts who like to plunge into a fun adventure that has all the innocence of a child's story, but the excellent storytelling any adult can enjoy. --An advance copy was provided by the publisher for review.For more of my reviews, visit my blog at Xpresso Reads"}, {"userName": "Kayla Dawn", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/70522717-kayla-dawn", "userReview": "Super schöne und ein klitzekleines bisschen gruselige Geschichte :)"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\nI read Doll Bones a couple of weeks ago, but then life got in the way as it sometimes does and I didn’t ever get around to writing a review. BUUUUUUUUUT! I remembered I had not yet reviewed it and made sure to do an “auto renewal” of my library book in order to save all the highlighting and notes about the story that were contained on my Kindle. And then I received notice that my auto renewal failed, but the book was still available for me to re-download (without all of my noted info). *insert sad face*\nYeah, library, why?Have I not cooperated with you and read a couple of seriously pukeable romance suggestions in order to pass your Winter Reading Challenge? Why you gotta be so rude????\nSo yeah, this sucks and you’re just going to have to believe me when I say if you have a young’un I recommend this one (this is noted as a “middle grade” story, but if your kid’s reading level is high enough I’d offer it up as a suggestion to the higher elementary grades as well).Doll Bones is about three friends (Zach, Poppy and Alice) who have spent their childhood imagining a world of fantasy and adventure starring their action figures – all of whom are overseen by the “Queen.” The Queen is an antique doll who holds all the answers to where the adventures will lead the toys, but who is in a locked cabinet and therefor can never tell the trio her secrets. When Zach’s father decides Zach is too old to be playing make-believe and throws away his old toys, Poppy breaks the Queen from her cabinet in hopes it will lure him back to the game. What happens instead is Poppy finds herself haunted by the true story behind the bone china which created the doll and insists Alice and Zach help return the Queen to the cemetery where she was supposed to be buried. If your kids are anything like mine and have enjoyed coming of age stories like . . .\nor . . . \nThey should find Doll Bones an absorbingly quick read. There’s a good chance you parents might even like this one too. Highly entertaining with just enough creepiness to add some thrills to the story, but not so much as to scare the pants off the little ones. Who couldn’t use a little more adventure in their life?"}, {"userName": "Calista", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "This reminds me a little of John Bellairs stories. It is about kids with the unknown and supernatural stuff happening to them. I enjoyed this read. It was pure fun.Zac, Poppy and Alice use toys and action figures to make up stories. It's really about the joy of imagination. Well, Zac's dad doesn't get it an he throws all his toys away saying it's time to grow up. So they think the game is over. Poppy is having dreams about a very creepy doll that is supposedly made out of bones. They then go on a quest of their childhood to break a curse. It was fast paced and well written. This is entertaining and there are plenty of chills to go around. I'm a fan."}, {"userName": "Laura", "userReviewDate": "Sep 19, 2012", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "[ The stealing. Not a fan. Plus it happened more than once. The kids do show remorse and make steps to amend their wicked ways, but it still remains my only disappointment here. You can call it “borrowing” all you like, but we all know what it really is. Just a heads up.  (hide spoiler)]"}, {"userName": "Trudi", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "I came at this little book with expectations waaaay too high, and my overall tepid response to it is the result. That cover, that awesome cover screams epic creep. I wanted Coraline. This is not Coraline. I hate to pit books against each other in caged death matches, but my reader brain kept doing that here, and guess which competitor got gutted and left for dead? It was gruesome to watch so ill-prepared was the one for the other. Doll Bones will have some appeal to younger middle-grade readers. It's not too scary, and has likeable protagonists who hit the road on an adventure Stand by Me style. You've got two girls and a boy, so there's a nice gender balance too."}, {"userName": "Richard Denney", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/4588953-richard-denney", "userReview": "Holy FUCK, I need this book!!!"}, {"userName": "Sara (sarawithoutanH)", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/7397330-sara-sarawithoutanh", "userReview": "3.5/5I really enjoyed this book! I haven't had much luck with other Holly Black books in the past, so this one surprised me. It's a book that I would have loooooved as kid. I was super into spooky stories. I really liked both the characters and the writing. I just wish there'd been a little more ghost activity. The story felt like it was missing something for me. But, overall, I thought this was really cute and I had a lot of fun reading it."}, {"userName": "Hayley Knighten", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/20875298-hayley-knighten", "userReview": "I read this to my 9-year-old son and we both loved it. He loved the adventure, I loved how Black so perfectly captured that age just before adolescence.As an adult, I think we forget sometimes how scary it was being a kid and realizing that growing up means putting away your toys and venturing off into the unknown of dating and adolescence.The kids in this book are so fun and the parents were also incredibly well-crafted.Then there is the ghost story, that was spooky enough to keep our interest without being too scary for kids. Black leaves much to the reader to decide what is real and what is fantasy which suited this coming of age adventure perfectly.This is a book that we both loved and one I doubt either of us will soon forget.I highly recommend this to anyone with elementary or middle school aged children that enjoy a good ghost story."}, {"userName": "Ferdy", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/4596358-ferdy", "userReview": "Pretty boring. The characters weren't very interesting or likeable, all they did was snap at each other, and the MC was so unbelievably generic and dull. There was nothing remotely scary, creepy, adventurous or dramatic about the story, it was all so blah.The illustrations weren't impressive either, they didn't really add anything to the book."}, {"userName": "Kristina Horner", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/3070540-kristina-horner", "userReview": "I ended up having a good time reading this book, but I didn't love it. I often had a hard time believing these kids were twelve and not in their late teens, the crush between two of the main characters felt shoe-horned in, and the way Zach reacted to his dad throwing out his toys (refusing to tell his friend what happened and just closing off) seemed... I don't know. Extreme. Unnecessary. While the plot was fun, it felt like a book trying to achieve A Series of Unfortunate Events levels of disbelief suspension, but it didn't quite get there for me. It just felt far-fetched. This is the first Holly Black book that didn't scratch an itch for me, and maybe it's because I am about 15 years older than the target demographic, but this one felt off."}, {"userName": "Barb Middleton", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/4361541-barb-middleton", "userReview": "My best friend, Ginny, and I would sneak into the storm sewer system that emptied into the nature center bordering our adjacent backyards, huddle around a candle (it was more exciting striking a match than flipping a flashlight switch) and whisper ghost stories to each other. We'd hike in the inky darkness bent at the waist until reaching a manhole where we'd straighten up looking at a spotlight of sunshine near a small hole at the top. Sometimes I'd climb the rungs to get closer to the light feeling relief from the stale, black claustrophobic enclosure. One time, we reached the third manhole and spun a wild bigfoot tale. When we finished the story we heard a loud scraping noise and a gust of air blew out the candle. Screaming at the top of our lungs and convinced a monster had found us in an underground grave, Ginny dropped the candle and we sprinted hunched over taking the skin off our elbows and heads as we banged along the narrow concrete tube toward the only exit. We burst out into the sunlight, flopping onto the grass, laughing hysterically and savoring the joy of a fun adventure. This book reminds me of those good times as a youngster. Not only does it scare the reader, it explores the idea that when people grow up they stop making up imaginative creative stories like they did in childhood. As adults creative outlets change; as a child, the belief in magic and the impossible still exits. Holly Black has created a well-crafted, suspenseful, horror story that will appeal to adults and children. She hasn't written a children's book since \"The Spiderwick Chronicles\" with Tony DiTerlizzi and while I have seen some of her graphic novels, I haven't seen a middle grade book in a long time. This one is terrific. I can see why it is on Newbery lists as a contender this year. Twelve-year-old Zach, Alice, and Poppy have created an imaginary world for years using action figures and dolls. Their swashbuckling pirate adventures are pretty elaborate with Poppy usually playing the villain, Zach the pirate, and Alice his crazy, loud sidekick. When Zach's dad tosses out his action figures because he thinks Zach shouldn't be playing with dolls, Zach is so upset he can't talk about it. When he tells Alice and Poppy he isn't going to play \"the game\" anymore they can't understand why. Poppy gets so upset that she takes her mother's forbidden antique doll from the case. This creepy doll is the Queen in their pretend play and everything done is meant to please her. The doll is haunted by a ghost who tells the three that they must bury her or terrible things will happen. They take off on an adventure to not only bury the Queen doll, but say, \"Goodbye,\" to their childhood games. The intricate plot between the imaginary play and real life events and relationships of the three make this a fascinating read.I want to explore this book more in depth than creating a surface review so this is your spoiler alert. Stop here if you don't want to know the plot.We first meet Zachary, Alice, and Poppy where they are pretending the pirate, William the Blade, is on a quest to find who his father is on the high seas. This reflects Zach's real life where his dad left their family three years ago in pursuit of a dream to own a business that didn't come true and left him bitter and angry. Zach is not happy that his dad moved back home. He isn't sure he wants to claim him as a father. Alice's parents died and she lives with an overprotective, smothering grandmother who won't even let her choose what clothes to wear. In the pirate game, Alice plays her alterego GI Joe Lady Jaye, who does as she pleases. Lady Jaye steals from everyone and gets mad at Poppy who likes to improvise and dominate the storyline. Poppy is fierce and dramatic which makes her good at playing the villains. Poppy (which means friendship) doesn't want her friends to change and desperately tries to keep their pretend game going to the point of making up, or not, the ghost haunting the doll. William the Blade, who rescues Lady Jaye and is the hero mirrors Alice's crush on the unbeknownst Zach that she wants to date. In the beginning of the story, the mermaid (played by Poppy) asks for a sacrifice to cross the sea and grabs Lady Jaye (played by Alice). When Alice says that Poppy can't just change the rules and grab her it foreshadows the sacrifices the three will face on their quest to bury a doll. Poppy sacrifices her friends by letting them not play the game. Alice sacrifices being grounded by her grandma for the rest of her life. And Zach sacrifices not playing the game anymore because his dad destroyed his action figures.There are so many layers to this book I can't possibly write them all but I'll try to touch on a few. The peer pressure and its affect on friendships is shown in Poppy's older brothers who laugh at Zach when the three are playing at Poppy's house. Zach is also worried about his friends on the basketball team finding out that he plays with the two girls. The game and the sport are important to Zach and he doesn't want to give either up. He talks about the special basketball handshake and says, \"... and every time Zach did it, he felt the warm buzz of belonging.\" The author does a fantastic job showing how the three friends have created a sophisticated game and how it helps them cope with fears and life. For instance, the antique doll they named, \"The Queen,\" is incorporated into the pretend game because she is scary. The Queen is also a symbol of absolute authority which is a reflection on the life of a child who has little say in what he or she does each day. Another important part of the game is the three friends pass notes to each other and ask questions directed at characters. Poppy writes William the Blade some questions in a note she gives to Zach. She asks if William would give up being a pirate? Which is basically the same as asking if Zach would give up the game. Poppy wants to know if William would miss the game. She asks who he thinks his father is which mirrors Zach's struggles with his father currently. The next question asks if William the Blade likes Lady Jaye. Poppy is trying to find out for Alice if Zach likes her. The last question is if William has nightmares. Zach describes William's nightmare of drowning and wanting to be buried at sea. Again some clever foreshadowing occurs through this technique as the next chapter has Zach's dad tossing out William the Blade who ends up buried in a garbage landfill.Zach doesn't tell Alice and Poppy the real reason he can't play the game. I did wonder why, but it becomes clear at the end that he can't because it hurts too much and he'd be admitting that he can't ever play again. I wished the author had implied this more when Zach first made the decision to not tell the girls. This made that turning point seem a bit contrived, but it didn't bother me too much because I remember as a teenager holding back on friends and not really knowing why. Poppy is so upset he won't play that she pulls the Queen doll out of the case so that Zach will play with them again. When the doll starts to speak to her and say that she is a ghost who was murdered and needs to be buried in a specific grave, the three embark on an adventure that reflects their pretend game. We never really know if Poppy is really seeing a ghost or manipulating her friends. When Zach thinks he dreams about the dead girl it involves an evil stepmom tossing out her toys and it leaves the reader guessing if the real quest is helping him deal with his dad's actions or is it a real ghost? Alice doesn't believe in the ghost because if she did then why hadn't her two dead parents come to talk to her? The author does a great job maintaining this tension and suspense. Other adult characters add to this as they comment on the four of them and refer to the doll as a blond-haired person. Throw in the mystery of how the doll was made and history of the girl's death and you have a fun scary story. Light a candle when you sit down with this one.All the characters go through an emotional arc but I was pleasantly surprised and pleased with Zach's dad. He's a minor character but it is a good message to kids that adults make mistakes. When Zach's dad first tosses out his toys, Zach's mom is really upset because the dad didn't talk to anyone first. The dad apologizes the next morning but Zach knows that it isn't sincere. Zach reflects on when he was forced to apologize for something he didn't feel sorry about and sees his dad doing the same thing. When Zach runs away with Poppy and Alice and everything goes kerplooey, Zach talks to his dad on the phone. This time, Zach not only gets a sincere apology, he finds the answer to William the Blade's question as to who his father is in the pretend story. In real-life Zach's father is a man who makes mistakes, is willing to admit it, and truly loves his son.The author captures the age well from the giggling friends at school to the difficulty of changing friendships. Zach says \"Sometimes it seemed to him that girls spoke a different language, but he couldn't figure out when they learned it. He was pretty sure that they used to speak the same language a year ago.\" Later when Poppy and Alice get into a nasty fight it is because Alice wants to stop playing the game and abandon the adventure of burying the doll, but Poppy refuses. Poppy expresses her fear of the three growing up and growing apart. Hanging on to the game means their relationship won't change.I like the author's homage to storytelling whether intentional or not. Childhood imaginative storytelling has a creative abandonment that can be magical. As people get older their stories change and the magic can be lost such as it is for Zach's dad. The last pretend story I wrote was when I was 13 years old. I read it now and it doesn't make much sense but I am nostalgic for a time when I didn't self-edit my writing and be judgmental. Even now I keep thinking this review is a meandering mess and I should work on it again. Holly Black tells a terrific tale and she says in the notes that this was a story she had wanted to write for a long time. I wonder if when an author finishes the story it feels like a death and the doll being buried is also a symbol of the death of a story. Who knows? I do know I didn't want this tale to end and when I finished I turned around and started rereading it. Something I rarely do. \"That was why Zach loved playing those moments where it seemed like he was accessing some other world, one that felt real as anything. It was something he never wanted to give up.\" Books have become my adult imaginative playground where magic exists and anything is possible."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I didn't place this on any of my shelves as it comes to us in the clothes of a ghost story but I would say that it's not truly that. Mostly I believe this is what I'd call a \"coming of age story\". The book is more the story of three young people growing up and trying to move from childhood into adulthood (with the cards often stacked against them) placed in the atmosphere of a ghost story.We meet the 3 young people that we will \"travel\" with as the book opens. A young man and two young women (or a boy and 2 girls) as they play their favorite fantasy game with dolls and action figures. One of the girls is good at innovation and frequently tweaks their story on the fly. We find that this often provokes disagreement and negotiation until the story's direction is established. We can tell that this has gone on for a long time and there is a well established story to their game...including the Queen of all the land who is trapped in a glass tower. She has great power and can do anything, except escape her tower.The Queen is an antique doll residing in a glass case in living room of \"Poppy's\" house. Poppy is the youngest of our 3 protagonists along with Alice and Zach.Zach is 12, he's on the basketball team at school and has begun to live in fear of his friends on the team finding he still plays with his action figures. This is made no easier by Poppy's older brothers who \"tease\" Zach, in a cruel way.Also Zach's father, who dropped from his life years before leaving Zach and his mother to \"get by\" has now...drifted back into Zach's life and also wants him to \"grow up\".Zach worries over this, but the story the 3 tell and play is so real to him and the characters he's created based on his figures (especially one figure) are also so real to him that he writes the story down and creates plots for their world.Then one day when Zach gets home from school he finds that his father has thrown out all his toys.Zach is almost shattered...mostly he's angry but doesn't know how to deal. Then Poppy has a dream about the Queen and a little girl who died tragically and can't rest. She tells Poppy in her dream that she will never let any of them rest unless they help her.There is I believe supposed to be an eerie atmosphere that surrounds the book. Dolls (especially old ceramic dolls) are somewhat inherently creepy. There are a few scenes where this is played on and there are the dreams. I never really felt the \"creepy\". Mostly this is a tragedy of cruelty, abuse and even Non-supernatural horror. I don't think I'm actually the target audience for this book and I never really got into it. I didn't connect with the characters even though I think some other readers will. This will appeal to some readers just as it failed to connect with me at all. In saying I didn't connect...I did want to punch the people teasing Zach, cold-cock his stupid insensitive father and then tell the kid to enjoy his fantasy if he wanted it was nobody's business. But I couldn't...I just had to \"nerd fume\".Anyway, didn't get into the book much past that... to each their own taste in novels."}, {"userName": "Donalyn", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/829035-donalyn", "userReview": "What if our childhood games and fantasies were real? When is childhood over? Three children--on the edge of adolescence--set off on one last adventure in answer to a dead girl's wishes. Beautifully written. I particularly enjoyed the friendships between Poppy, Zach, and Alice. Scary, but not too scary. I plan to read Doll Bones to my 5th graders this year."}, {"userName": "TheBookSmugglers", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/1223249-thebooksmugglers", "userReview": "Zach, Poppy and Alice are friends who have known each other for ever. The three love coming up with awesome stories and to play them out with their action figure toys. Their current story follows pirate William the Blade and his ally the thief Lady Jaye on a quest for The Queen, “played” by an ancient china doll. When they reach a point when William the Blade is about to find out the truth about his past, the unthinkable happens: Zach’s father throws away all of his action figures because according to him, at 12, Zach should no longer be playing make-believe.Zach is furious but also ashamed and confused and instead of talking to his friends, he closes himself off and stops playing with them altogether. But then one night the girls show up at his house saying Poppy has been contacted by the ghost of The Queen – who claims that her soul is trapped in the china doll which has been made from the bones of her murdered body. The only way to free her (as well as the kids from its haunting) is to find where the girl used to live and bury the doll.Adventure ensues as Zach, Poppy and Alice run away from home and go on their – this time, real – Quest.Doll Bones was not quite what I was expecting. I thought this was going to be a good old romp with a strong horror bend. And in a way it was: there is a lot of fun adventure to be had and the doll is genuinely creepy especially since, for most of the book, we (and the characters) are not really sure if this is all happening in reality or only in their imagination.But those aspects are almost bare foundation from which the author builds a story with a stronger focus on the relationship between the three kids and the importance of storytelling and creativity. Above all, I feel this is a tale about three kids on that threshold between childhood and adolescence and one that is deftly, thoughtfully handled by Holly Black here.Zach’s father’s thoughtless action of throwing away his toys propels the story in a very interesting way. It is an outside force that informs internal conflict: adults telling kids they can be no longer kids and that their hobby of choice is childish and undesirable. The kids have to grasp this idea, and choose whether they internalise it or question it. There is a very interesting conflation here between the toys and their ability to continue with their game. Zach for example, believes he can’t play without them. But are the toys an essential part of their game or just tools? Similarly, Poppy, Zach and Alice are in that moment that growing up is just around the corner but not for all them at the same time or in the exact same way – Poppy for example is still desperately trying to hold on to what they have now, whereas Alice and Zach are almost eager to embrace change. Do finding new ways of interacting with the world, becoming interested in different pursuits as well as forming friendships with other people mean that their interaction need to change or that their friendship is no longer meaningful?The answers to those questions are not clear-cut and in the end there is a feeling that things will have to inevitably change but not necessarily in a fundamental way. Storytelling, creativity, role-playing is something that can be equally important to adults and teens as it is to children. In addition to all of this, each kid’s family is also extremely important in how they interact with the world and I thought really interesting how each kid had a different background which created a more dynamic and diverse story. I really appreciated that Zach’s father’s action is addressed in the story very nicely and with unexpected poignancy.In the end, Doll Bones turned out to be not as creepy as expected but more thoughtful than I was hoping. All in all, a very good read."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "Did you know that the fear of dolls is called Pediophobia? It is. I just learned something new just now about my deep-seated fear of antique dolls. Suffice it to say that I for one find antique dolls very creepy. Apparently, I'm not alone. Holly Black seemed to take pediophobia and run with it. Imagine these kids who have their elaborate role-playing game that involves action figures and dolls, and they employ one of the girl's mom's prized possessions as the Great Queen. She rules over the imaginary lands in their games like a sinister matriarch.When Zach's father throws away his action figures, Zach is devastated, and he is forced to abandon the games he plays with Poppy and Alice, leaving them both confused and feeling betrayed. Poppy decides that they need a quest, and the quest takes the form of a mission given by the spirit of the doll, a young girl named Eleanor, who comes to Poppy in her dreams. Zach needs and craves an adventure, even if he's not sure he believes completely in this Eleanor. Although the doll does seem to have a creepy life to her. Alice is the peacemaker of the trio, with a very overprotective, controlling grandmother, and she's developing feelings for Zach that go beyond friendship.This trio of friends go on an adventure to settle the restless spirit of Eleanor, and perhaps in the process, they can mend their broken friendship.I listened to Doll Bones on audio, and I think this is the ideal format for this book. The narrator makes the most of the creepy elements of this story. He's good with voices and altering his pitch to mimic the voice of tween girls in a way that feels authentic. He also captures the chaotic emotions of children of this age, especially those with troubled home lives like all three kids. I wouldn't say this was scary enough to cost a woman my age some sleep, but it did give me a shiver or too. It also made me feel nostalgic for the imaginative games of childhood that are now in my past. I didn't have the same close trio of friends to play dolls with, but I did play Barbie dolls on my own for longer than I care to admit, and the power of one's imagination takes those dolls to a place where they are endowed a life one wouldn't expect of carved figures of plastic.As far as parental guidance, the aspect of these young kids taking off on an adventure in the middle of the night would probably make the average parent's hair stand on its end. There are some other questionable moral choices that would make me caution a parent to have some oversight if their younger child read this book. Nothing too crazy, but certainly worthy of caution.This was good but not great. I definitely recommend reaching for the audiobook if one's interest is perked.Overall rating: 3.5/5.0 stars."}, {"userName": "Benji Martin", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/1627753-benji-martin", "userReview": "Oh man. Where did this Holly Black come from? She's always been a pretty good writer to me. I really liked the Curse Workers series, but this is a new, and drastically improved Holly Black. This is Newbery award worthy stuff, guys. This passes anything Holly Black has written so far, by miles, and it's also better than any 2013 book I've read so far. I really think it's leading the Newbery race at this point.The problem is, when a book is leading the Newbery race, people start picking at it and looking for \"flaws\" in a way they wouldn't do to other books, that they are just reading for fun. It's tough to be at the top. I personally don't think it has any noticeable flaws, but here are the two that I've heard so far 1. Middle schoolers don't play with dolls. That part isn't believable, and if that part isn't believable, the whole book isn't and 2. Why didn't Zach just tell his friends about his dad throwing the dolls away? That would have made sense. That part wasn't believable and Holly Black just used it to help the story move along.So here's how I answer these objections.1. I clearly remember being in 6th grade (middle school) and playing with my Teenage Mutant Ninja Turtle toys for hours. Once a girl in my class stopped by the house with her mom to drop something off for church, and saw me playing. I was mortified. I knew I was too old to be playing with action figures, but I really liked telling stories to myself through them, just like Zach, Poppy and Alice. So yeah. Some middle schoolers do indeed still play with dolls. 2. I did want Zach to tell his friends the truth, but I never once questioned the believability of it. I've been a middle school boy, and I never want to see inside a middle school boy's head again. It's not logical and there are tons of hormones raging around. Zach doesn't think like a logical adult nor should he. Maybe he was embarrassed that his dad thought he was too old for the toys? Maybe his feelings about Alice got in the way. I dunno, but I don't need to know. I believed the story, just fine. Any other book wouldn't have to answer these questions or stand up to this kind of scrutiny. The fact that Doll Bones is already getting picked at, months before Newbery season, is really a testament to how darn good it is.I was recommending it to a student and they asked me, \"Is is this year's Ivan?\" I smiled and told them, \"Nope. But it is this year's Graveyard Book.\""}, {"userName": "pink (not just another shade of red)", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/30212137-pink-not-just-another-shade-of-red", "userReview": "Doll Bones is not just a story about a doll possessed by a ghost. It's not just a story about three kids going to an adventure to bury a dead girl's remains. It is a story about pirates sailing unto endless quests, mermaids asking for sacrifices, dangerous dukes, thieves, and the changes and choices everyone has to go through growing up. It reminded me so much of my own childhood, making up worlds and adventures in my own backyard, inventing ghosts rattling outside the window, and being both scared and excited about growing up because it feels as though you have to give up a part of yourself in order to grow and gain the mysteriously boring things adults know and have.To be completely honest Doll Bones turned out to be very different from what I expected. It's not that scary but with just enough creepiness to make you a bit wary of that creaking door or the strange sound coming from downstairs while reading it. In the end I figured it's probably a really good thing that it turned out differently because, after all, the best stories are the ones that surprise us , and the ones that let us decide whether to continue or not. \"Maybe no stories were lies. Not stories about aliens. Not stories about things getting better or getting worse. Clearly, not stories about the Queen. Maybe all stories were true ones.\""}, {"userName": "rachel • typed truths", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/17290119-rachel-typed-truths", "userReview": "I know a lot of older readers avoid middle grade stories because they feel ‘too old’ to be reading them. I’ve always scoffed at those types of readers because a truly good story should be accessible to all readers. There is no age limit on adventure.... but Doll Bones with its twelve-year-old protagonists made me feel old, despite the mere five year age gap between me and the characters. I struggled to get invested into this story and, as much as I tried, I could not relate to either Poppy, Alice or Zach.One of the reasons that I struggled to immerse myself in this story was the fact that I found it unbelievable that completely able-bodied and mentally-sound twelve-year-olds still played make-believe with dolls. These are high school students we are talking about. I know that HS students may seem immature at times - maybe even the majority of time - but that doesn’t change the fact that I do not know a single person this age that would play such childish games, let alone act them out with dolls. I don’t know if that’s harsh or maybe this is different in other cultures - not that America is really all that different to Australia, for the most part - but I found the obsession of Zach and Poppy with their game over-the-top. It really ruined the foundation of this story for me. I could not buy into this premise and found myself shaking my head the whole time.With that being said, I think that if the book had focused on the mystery of the creepy doll it could have made for an intriguing story. The idea of a little girl dying and her bones being used to make a bone china doll is… creepy, definitely creepy. However, I found that mixing this plotline with the character drama and the slow-paced beginning diluted the spookiness. The story ended up stagnating in boring stretches of dialogue and Zach’s internal debates. I liked that the story didn’t shy away from the obstacles that these characters would have faced on their ‘quest’ but I struggled to enjoy this plotline. I personally found it tedious and dull. I wanted more ghostly hauntings and creepy doll stuff. On top of that, this story suffers from a fatal flaw: if Zach had told Poppy and Alice the reason why he could no longer play the game, none of this story would have happened, which - seeing that Zach had no logical reason for not telling them the truth - meant that the story’s foundations were shaky.I will say that choosing to ‘read’ this book in its audiobook format was a good choice. The narrator did a brilliant job of bringing Zach’s voice to life. I honestly think I would have struggled with these characters a lot more in written format. The narrator was able to provide that extra dimension to Zach’s character that really propelled the story forward - an element that story desperately needed. I did struggle to distinguish Poppy and Alice’s characters at first but I’m not sure if that is because of the narrator or the story itself. Overall?I struggled with this book. I didn’t understand the point of the plot and found it hard to believe that twelve-year-olds would play such childish games. Due to that, I never came to care about any of the characters and struggled to get invested in their story. The whole time, I was busy wishing that the plot would focus on the creepy doll stuff. I don’t know what else to say other than this one was just not for me."}, {"userName": "Jessica", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/202724-jessica", "userReview": "A charming coming-of-age story and a ghost story all rolled into one. I was worried that this would be too scary for me, I'm a huge chicken when it comes to ghosts, but it's lite on horror and goes into far more depth about the nature of friendship and how that can change as you grow up. A lovely book!"}, {"userName": "Jonathan Peto", "userReviewDate": "Apr 27, 2016", "userURL": "http://www.goodreads.com/user/show/4107370-jonathan-peto", "userReview": "Doll Bones is simpler than I expected. Elements of it were ambiguous, and those elements seem to mask a complexity that has not completely sunk in, but for now, for me, what I loved, or almost loved, or would have absolutely loved, remained undeveloped.Oh, well.Those undeveloped things include the interesting dynamic between Poppy, Zach and Alice. Zach narrates. They have been friends for years but they’re entering a time of change and their friendship seems unlikely to last. This was fascinating territory, especially as they traveled, and I wanted more impact from it.Another undeveloped aspect of the story was the spooky horror of the ghost girl, which was the reason Poppy, Zach and Alice head to East Liverpool in the first place. The quest itself, its rationale, was first-rate, because I love an angry ghost as much as some singer loves a rainy night. But, it came undone. It did not fizzle. It snapped, like kite string, but less dramatically.So, I like simple stories that are mythic, like The Old Man and the Sea or Coraline. Or, if not mythic, other simple stories I’ve enjoyed have been sincere, like Sadako and the Thousand Paper Cranes or Riding Freedom.Unfortunately, this simple story was too long, or not long enough? Or maybe it was just too erratic? Okay, I bet you can name a great simple story that isn’t mythic, such as The Miraculous Journey of Edward Tulane, which I gave four stars. Furthermore, Edward Tulane, like Doll Bones, is erratic. Yet… [shrug].No, maybe not too anything. Maybe the ambiguity failed for me. I’ve spent too many years trudging off to work every morning. I have one loose screw that needs tightening. Tighten that one screw, and I think I’d love this book!"}, {"userName": "Maxine (Booklover Catlady)", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/22943325-maxine-booklover-catlady", "userReview": "I received a copy of this book from the publisher via NetGalley in exchange for an honest review, my thanks for the opportunity.China dolls, creepy looking china dolls. Oh yes, I know what they are like. This book made me remember being a young child and being afraid of a porcelain doll that sounded similar to the doll in the book. This doll sat in a cupboard at my Nana's house and everytime I got sent to the cupboard to get something one eye open would watch me. I remember my heart hammering in my chest. Doll Bones is about many things, an adventure, friendship, maturing and a ghost. Three children Zach, Poppy and Alice have been friends for a long time, they play many imaginary games together and all have a spirit of adventure in them. One night, Zach is woken from his sleep by the girls, Poppy is convinced the doll came to her in a dream and is now haunting them. They must do what the doll asks or bad things will happen.In the middle of the night they start their adventure to give the doll the peace she is asking for, creepy things happen to them on the way, shivers and feelings that can't be explained, dreams of the ghost of the little girl, apparently her bones were ground up to make the porcelain of the doll (this is why it's called bone china). They must set all of this right.It's a middle grade coming of age story as well as an adventure, it was a lot less creepy than I expected, I think I had higher hopes for some good old spooky stuff. The illustrations in the book are really well done and add a touch of atmosphere. I think a bit more creepiness would have sat really well with me as a reader, but I also have to think would I have enjoyed this book as a middle grade reader and yes I would have.As they go on their journey with THE QUEEN (the china doll) they discover new things about themselves, their friendship, their feelings, their courage and their fears. All of this is intertwined with some strange goings-on around the doll, she is with them all the way. It's a ghost story for sure, not sure if it would scare the middle grade reader much or not, but it's a lot of fun. 3.5 stars from me."}, {"userName": "Robert", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/3810541-robert", "userReview": "**** Newbery Honor (2014) ****Three friends go on a quest of adventure to put the spirit of long deceased girl at rest. Quite a lot of fun and just the right amount of spookiness. It will make you believe in ghosts! One thing, and this is probably just me, I kept confusing the characters of Poppy and Alice. There are portraits of the three characters on the back cover, which I appreciated. But still, it seemed to me that Poppy was a better name for the dark haired girl, and Alice was better suited to the redheaded girl. But as I said, that is probably just my own thinking and nothing against the story itself. The audio edition is well performed by Nick Podehl."}, {"userName": "Janni", "userReviewDate": "Jan 20, 2013", "userURL": "http://www.goodreads.com/user/show/1292720-janni", "userReview": "Sure, this book is about creepy dolls and bone china made with real bones, which would be reason enough to read it. But it's also a story about pretend games and story telling, how we need them, how we struggle to hang on to them as we get older, and how their role changes and doesn't change as we do. Lovely stuff that hits the right buttons for those of us who never gave up on playing pretend ourselves."}, {"userName": "Julie Zantopoulos", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/51094260-julie-zantopoulos", "userReview": "So not okay with a book about a ghost possessed doll but this was a cute story about kids coming of age, questing, feeding their imaginations and facing difficulties with families. It was a really cute middle grade ghost adventure and a fun audiobook read."}, {"userName": "Suzanne", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/4117491-suzanne", "userReview": "When I was a kid, there was a ghost story we told called \"The China Doll.\" It had the reputation for being the most terrifying story anybody knew, and before a telling began, we'd repeat the lore about the previous times it had been told. At so-and-so's slumber party it made someone cry. At a different party, it made a girl puke! And finally, the worst, a girl got so scared she had to call their mom to pick her up. Everyone was offered the opportunity to leave the room before the story began, in case they thought they'd get too scared. Sometimes, just the lore about the story got everyone so freaked out that we left it at that and did not tell the story...So, between the creepy doll and themes about childhood storytelling, I was prepared to love this book. The idea that the porcelain in the doll might contain the ground up bones of the girl haunting it? Even better. My hopes were high. But, maybe too high.I don't think it's a bad story, I just wanted more depth. I wanted the creepy moments to be creepier. The kids' characters felt a little flat to me, so there wasn't much impact from their coming of age story. I suppose it's not a spoiler (since it's up there in the summary) to say that Zach's father is a major catalyst, but what he does, specifically... I don't know. It just didn't ring true for me, and again I think it's a characterization problem. Something similar happened in Scowler, but because of the way the parents characters had been developed, it made perfect sense.So, a good story, but not a favorite."}], "description": "Zach, Poppy and Alice have been friends for ever. They love playing with their action figure toys, imagining a magical world of adventure and heroism. But disaster strikes when, without warning, Zach’s father throws out all his toys, declaring he’s too old for them. Zach is furious, confused and embarrassed, deciding that the only way to cope is to stop playing . . . and stop being friends with Poppy and Alice. But one night the girls pay Zach a visit, and tell him about a series of mysterious occurrences. Poppy swears that she is now being haunted by a china doll – who claims that it is made from the ground-up bones of a murdered girl. They must return the doll to where the girl lived, and bury it. Otherwise the three children will be cursed for eternity . . .", "title": "Doll Bones", "url": "https://www.goodreads.com/book/show/15944406.Doll_Bones", "average": 3.7, "cover": "https://images.gr-assets.com/books/1424981042l/15944406.jpg", "reviews": 3513, "authors": [{"url": "https://www.goodreads.com/author/show/25422.Holly_Black", "name": "Holly Black"}, {"url": "https://www.goodreads.com/author/show/4281427.Eliza_Wheeler", "name": "Eliza Wheeler"}], "type": ["Fantasy", "Childrens", "Horror", "Mystery", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/15944406-doll-bones", "http://www.goodreads.com/book/show/16071969-doll-bones", "http://www.goodreads.com/book/show/18071620-die-puppenk-nigin", "http://www.goodreads.com/book/show/17406530-doll-bones", "http://www.goodreads.com/book/show/18070700-doll-bones", "http://www.goodreads.com/book/show/16071823-doll-bones", "http://www.goodreads.com/book/show/18668502-doll-bones", "http://www.goodreads.com/book/show/19290282-doll-bones", "http://www.goodreads.com/book/show/46777.Tithe", "http://www.goodreads.com/book/show/12813630-the-coldest-girl-in-coldtown", "http://www.goodreads.com/book/show/20578940-the-iron-trial", "http://www.goodreads.com/book/show/26032825-the-cruel-prince", "http://www.goodreads.com/book/show/283494.Ironside", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}