{"ratings": 1658, "userreviews": [{"userName": "karen", "userReviewDate": "Sep 26, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "another firstreads book i was denied!!this one is about a woman with so many food allergies, it makes my head spin: all dairy, eggs, soy, beef, shrimp, pine nuts, cucumbers, cantaloupe, honeydew, mango, macadamia nuts, pistachios, cashews, swordfish, mustard... and not just eating them - sitting at a table where cheese once touched - eating from \"contaminated\" plates, secret ingredients in spice blends or poorly-labeled drinks... it is horrible! i don't know anyone with severe food allergies, and it sounds just awful, especially when it is not just one or two, but a million. and being allergic to cucumber makes no sense to me. i'm not knocking anyone's allergies here, i am just trying to wrap my head around an allergy to something that is essentially a green water-log.it seems so innocent! it saddens me, because i love food so much - almost all of it, and i would hate it if my body told me \"no\".i usually try, if i am eating alone with a vegetarian, to either order meatless, or at least try not to order anything gratuitously meaty, like cowface, but after reading this book, i am hesitant to eat any food near any person, not as a courtesy, but because it is possible that my food could kill someone else.i could breathe near someone and cause them to seize. i could make out with someone after eating some delicious cheese and kill them.they would die happy.but let's see - what did i eat yesterday? a rainbow-sherbet-flavored jello yogurt cup.peanut-butter toastbarry's tea with milkartichoke and pepperoni pizzaand she couldn't have eaten any of it. or made out with me.in fact, if i had eaten what i did and then used the phone, and if she had used the same phone hours later, i could have caused her to have a severe allergic reaction.how can i continue to eat in these circumstances? who could? i feel for her, i really do. because she sounds so rad - she isn't whiny about her condition - she isn't one of these people who wants to ban peanuts from restaurants or schools or the planet -she is uncomfortable with some measures she sees as overreactions. she seems like a cool lady, who takes care of her ownself, and is living with her allergies, not using them for attention.i hate that she has had so many severe reactions at so many pivotal moments in her life: the weddings of friends, vacations, dinner parties, i hate how many times food has tried to kill her. but i love that she keeps trying - cooking classes, children's birthday parties, travel. she is willing to give food one more try, despite being told as a child that she was \"not designed to survive\"and despite all of the dangers and past failures: halloween, college, airplanes, grammar school cupcakes... i will never be able to take her on an AIFAF, but i applaud her, from afar, in a bubble where i am eating fondue. eat those french fries and mushrooms, my dear, show the food who's boss..."}, {"userName": "Jaime Lee", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/195560-jaime-lee", "userReview": "I'll admit. In the past I was always the person standing off to the sidelines thinking, \"Are you serious?\" when a friend listed off the foods to which he or she was allergic and then shared the extent to which they must take precautions against a reaction. I witnessed so many of the people in my life claiming 'allergy' when in fact they merely had an intolerance or worse, simply a dislike, that I became desensitized to the fact that there are so many children and adults out there who truly need to watch every bite. After reading Ms. Beasley's memoir I feel as though my eyes have been opened. I have a much better understanding of the differences between a 'true allergy', an intolerance, etc. I believe that having the knowledge from this book will help me to be more aware of the difficulties that many of my friends endure, ones I'm lucky enough to be able to not worry about personally. Armed with the many facts, figures and anecdotes shared in this book I will now also be able to remark to others that their dislike of peanuts is a far cry from an allergy to peanuts and that, perhaps, it's not such a good idea for them to make a stink in a restaurant about not having nuts touch their plates. Beasley made an excellent point about the case of the proverbial 'boy crying wolf' in these instances - If a restaurant is constantly being forewarned of 'allergies' from patrons who really aren't suffering from them, then those who do need special consideration when their food is being prepared run the risk of not getting the special treatment they really do require. That's a deadly gamble to be taking and a scenario that I feel people would do well to remember. In our society the term 'allergy' is running rampant. I think this book did an excellent job of putting things into perspective. Many of us many have intolerances or dislikes to certain foods. And certainly, no one enjoys the scratchy feeling in their eyes during the height of hay fever season. However, there are really people out there who run the risk of having their throats close if they are exposed to allergens that are truly toxic to their bodies. I think this book serves as a great reminder that many people out there should be grateful that their 'allergies' don't hinder their lives in the same way that Ms. Beasley's have for her."}, {"userName": "Candy", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/2290766-candy", "userReview": "As someone that suffers from food and environmental allergies, when this book became available, I jumped at the chance to read it. Like the author, many foods cause anaphylaxis for me. Unlike the author, mine are all related to Oral Allergy Syndrome and I'm not allergic to near the number of things that she is. So, I'm coming from a place of mostly understanding while reading it. No one can explain the amount of panic that occurs when you realize your throat is closing up and your mouth is on fire from itching.I'll be honest and say that I was expecting a real \"woe is me\" tale here. I expected her to stomp her foot and want the entire world to revolve around her and her allergies and expect that all restaurants should ban beef just because she was in the area. I expected this to be one big whine fest with the author on a quest to ban tree nuts from the entire continent. We've all read books where the author is on a mission and I somehow thought this would be one of them.Imagine my surprise when it was none of those things. Oh, she's definitely a bit of an activist, but I think Sandra leads more to wanting people to understand and wanting restaurants to give full disclosure. What struck me the most is that while she has some REAL issues with food - seriously scary stuff - she understands that the world doesn't revolve around her problems. She is understanding when she realizes that a chef cut cantaloupe with the same knife as her strawberries or whatever. Not once did I hear her rail against others, but it was more of internal monologue. She talked about how she needed to adapt her life to fit around others.At the same time, you can tell that her friends and family genuinely appreciate the way she chooses to live her life. They try to make things that she can eat too, to cook around her allergies. I enjoyed hearing about her life, especially as a child. My allergies didn't show up until adulthood, so it kind of made me also realize what the parents must go through of children who have serious food allergies - and multiple ones on top of that.I also absolutely loved that she took time to go through some of the science of allergies - mast cells - proteins, etc etc. While I knew most of it, it felt really nice to have someone explain on it a \"real life\" level instead of using big words and making my eyes cross.Most of all, I enjoyed her attitude, as I've mentioned. She truly has a great way of handling things and a great way of looking at the way she chooses to lead her life. I'd recommend this for anyone with allergies or for someone with a loved one in their lives that has allergies. It gives you a true look into what it's like to live your daily life with severe food allergies. It'd be great for a fan of memoirs in general as well."}, {"userName": "Connie", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/1789921-connie", "userReview": "This has easily entered my top 10 favorite books, simply because \"she gets me\". I was so happy to finally discover a memoir of someone like me: with multiple food allergies running the span of my lifetime and having to endure unintentional ignorance from the public, especially as a kid when allergies were not as acknowledged by the general population, much less were we as protected by law, as today. I almost screamed aloud, \"I KNOW\" when she described restaurants who didn't get cross contamination issues (even if I ask for no nuts IN my salad, do NOT use the same instrumentation or surface which was used for the nutty salad to prep MY meal!!!), or horrible teachers who rolled eyes at my nut allergies and not being able to eat a homemade birthday cupcake of a classmate due to possible allergens, and especially non-sympathetic gym teachers who forced me to run (i.e. walk) the dreaded mile, lest I fail gym (it's no wonder I grew up seeing working out or running as torture!!). And the topper: trying to explain (to this day, even) why an EpiPen is NOT a fix-all solution and when I have a reaction; it is not the go-to problem solver. Sometimes, no matter how painful, you have to ride it out with Benedryl or a stomach coater (like Pepto or Pepcid) and sleep it off. It SUCKS. I really appreciated the science & theory mixed into her story. In a perfect world, this would be required reading for any closed minded, or still in-the-dark, person who does not get that asthma & allergies are real and NOT in the person's head."}, {"userName": "Erin Nudi", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/4743975-erin-nudi", "userReview": "Interesting book, it has a lot of information on allergies in addition to the personal stories relating to them. Any foodie should definitely read this book. Beasley goes into, among other things, the whole peanut allergy fiasco that is still going on today - how some are trying to ban the iconic peanut butter and jelly sandwich from schools. The author's opinion seems to be that she doesn't understand why peanut allergies are getting all the media attention when there are in fact eight main, common allergies. What is really interesting about allergies is that there is such a broad scope with them - some foods you can be more allergic to than others, you can outgrow allergies, you can develop them later on, you can have a \"fake\" bad reaction, you can have a worse reaction one time than other, you can have a reaction hours after being exposed to the allergen, etc, etc, etc. For example, a person allergic to soy can probably handle it in small amounts (the author says she dips her sushi in soy sauce with no problem despite being allergic). But if you're allergic to peanuts, for instance, you like, can't even be in the same room as a peanut.Another interesting topic covered: the complexity of hidden ingredients in foods (potentially bad news for vegetarians). In the case of a person severely allergic to egg, using the same cutting board or knife or fork that has touched the egg can produce traces of egg in another dish without meaning to - something that is untraceable to most, but can cause a person allergic to egg to break into hives or even go into anaphylaxic shock. Should egg, in that case, be listed on the ingredient list? I feel like I could have used a better example there, but you get the point.All in all very good book, but I would have liked to see slightly more anecdotal stories and slightly less medical terminology. I do have slightly more respect for my ex boyfriend after reading this book, who has several food allergies in addition to severe acid reflux, and who constantly drove me nuts with his food requirements. =P"}, {"userName": "Melissa", "userReviewDate": "Jun 06, 2012", "userURL": "http://www.goodreads.com/user/show/287912-melissa", "userReview": "Let's all be happy, for the entire rest of today, that we do not have catastrophic food allergies, shall we? Assuming that you don't, that is. I am planning on being grateful for the rest of my life that my son doesn't appear to be allergic to anything - I have certainly never lived through the horror of seeing him rub cake frosting on his tiny face, which then raises welts in the exact shape of the frosting smears. Good grief! I'm not particularly enamored of Sandra Beasley because of some of the choices she makes in this book, which make it seem like she's doing things so she can put them in her memoir. For example, the taking a cooking class with her boyfriend to see if she can be like \"normal\" cooks. Well, no you can't. If milk products touch your skin, you break out in terrible hives. Why on earth would you want to try to make whipped cream? Or the chapter on food rituals, which seems predicated on her complaining that she can't participate because she has to be so careful about what she ingests - but which is worse in this situation, taking a minute or two to make sure that there's no milk product in the shot you've just ordered, or doing the shot without asking so you can \"stay in the moment\" with your friends, which leads to you throwing up all night & having no moment with them anyway? I'm probably being too picky. This is a good, quick read despite all that, and very interesting look at catastrophic allergies, which I with my hay fever had never really considered. And I really don't think I can like Ming Tsai, who G calls Sim Ping because he can't yet say Simply Ming, more than I already do. I've always liked him quite a bit, & his cameo in this book just makes him even better."}, {"userName": "Lisa", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/2717795-lisa", "userReview": "Finally a book about living with life threatening food allergies by someone who have first hand experience. She is witty and heart warming and ultimately must rely on herself and not the rest of society to protect her. This is a must read if you or someone you care about lives with food allergies. I especially liked her look at the histroy of medicine and food allergies. Growing up as the only child anyone had ever heard of with food allergies, I was laughing and crying along wiht her. I also have vivid memories of teachers or others thinking I was just picky and forcing a peanut butter cookie on me and the life threatening reaction that followed. It is an odd paradox that I thought was just me...but when having an allergic reaction, I rarely, unless I need an ER trip, report it to those I am with....I thought this was just me, but she did it too, repeatedly. I know there are much more devasting things to live with but it was exciting to read about the advances. Sad to read about the increases and why."}, {"userName": "Videoclimber(AKA)MTsLilSis", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/2585455-videoclimber-aka-mtslilsis", "userReview": "I could relate to this book in so many ways. I do not suffer from food allergies but I am an insulin dependant diabetic and have been since the age of three. It is amazing what has sugar in it, much like an allergy sufferer I am vigilant about labels and checking. I enjoyed the book. The parts about her life were interesting and I could relate to those also. Trust me suffering from a low blood sugar reaction in a room full of third graders must feel much like having an allergic reaction at a wedding. Beasley's writing was witty and interesting. I enjoyed reading about how her parents helped her throughout childhood and beyond. This book will appeal to many, not just those who suffer from allergies."}, {"userName": "Anna", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5880843-anna", "userReview": "I really didn't like this book. I thought it would be funny and interesting and some of it was but most of it was just facts and statistics. I actually got bored of it and didn't finish reading it."}, {"userName": "Nancy Kennedy", "userReviewDate": "Feb 03, 2012", "userURL": "http://www.goodreads.com/user/show/5471413-nancy-kennedy", "userReview": "It's tough to cook for people these days -- allergies galore, vegetarians, caffeine and sugar free folks, gluten sensitivities, lactose intolerances. It's easy to view all of this negatively, as if these overly fussy folks were willfully making our lives hard... and somehow perversely enjoying it.But Sandra Beasley illuminates the terrors and complexities of the allergic life in such a winning way that you might just let go of your resentments. Until I read this book, I just couldn't imagine how allergies can shut down a person's life so completely. Ms. Beasley is allergic to everything you could imagine, from dairy foods, beef and shrimp to melons, mustard, cucumbers and nuts. \"That's not somebody designed to survive, now, is it,\" opines a nutritionist in her fourth-grade class.With humor and pathos, Ms. Beasley shows how allergies put many of the things we take for granted out of her reach. The food rituals of childhood that she couldn't share, the spontaneity of love that is denied her, the deadly perils that lie on every plate put before her. Her life is one tenuous day after another, her survival continually in the balance.Ms. Beasley interweaves her personal story with research and data about allergies and allergic reactions. If you're not a fellow-sufferer, you might choose to skip over some of this very detailed information. But slow down when you come to her life story, because she tells it well.I particularly cheered for Ms. Beasley when she goes alone to Galatoire's in the French Quarter of New Orleans and studies the menu carefully for something she can eat. A solicitous waiter assists her, and after a slight misstep, she has a meal to savor and remember. \"The pleasure of each bite was intensified by the risk of trusting an unfamiliar city to take care of me,\" she writes. The reader comes away glad that she's being taken care of and that she is enjoying herself at last."}, {"userName": "Simeon Berry", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/143942-simeon-berry", "userReview": "As far as I'm concerned, Eula Biss's On Immunity should always be paired with Don't Kill the Birthday Girl. One is about anxieties acted out and one is about anxieties enacted. Both harrowing, sobering, and necessary. Reading this book made me aware of how much of an idiot I was about allergies before."}, {"userName": "Beth", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/16068891-beth", "userReview": "I picked up this book because it caught my eye as I was leaving the library one day. It'd been highlighted by our wonderful library staff as a \"Hot Pick\" and I quickly scanned the back and thought \"why not\". I'd like to tell you it was a genuine interest in what my children are going through, as children living with severe food allergies (as compared to my rather minor and manageable peanut allergy and my more life threatening, though not terribly problematic in the sense that they don't often \"hide\" in food Brazil nut allergy), or that I was hoping to learn more about how I can help them be safer in the world when I'm not around to run interference for them. But the reality is, I'm not one of those food allergic moms whose lives revolve around their children's food allergies. I'm not in any way criticizing or otherwise saying there is something wrong with those mothers, I am simply acknowledging that I am not one of them. In contrary to my otherwise rather \"when in doubt--research!\" personality, when my oldest daughter was diagnosed with food allergies, I did not run out and join the various food-allergy related parenting boards, or bookmark food allergy news websites or start following the latest research in food allergies. Those are all great things to do. Knowledge is power and when you are battling for your children's lives, you do whatever you can to keep them safe. But I didn't. Instead I just learned how to read labels, gave up a few of my favorite dishes because there was no way to make them \"girl safe\" and I was SO not interested in cooking two dinners, and learned not to \"guess\" at restaurants when the wait staff \"wasn't sure\" and to insist that yes, your waitstaff really does need to check with the kitchen instead of just hypothesizing whether or not there is dairy in the soup or egg in the pasta, then more or less went on with life. And I've always had a little bit of guilt about that, I guess. Should I have? Was I not doing enough to protect them? Should I be advocating more? Should this take up more of my life than it already does? All right, maybe I shoulder a LOT of guilt about this. And maybe picking up this book was my nod toward \"educating\" myself about food allergies. But let's be real. I've been at this for 8 years now. Well, 33 if you count the years of my life I have been aware of having a food allergy and at least partially involved in the responsibility of managing it. But 8, since I've had to learn how to live with highly allergic children. I am, at minimum, not a rookie in this game. So no, I don't know why I picked this book up and I don't know what I expected to get out of it. But now I can tell you what I DID get out of it, which I can unequivocally say was more than I expected. I saw echoes of myself growing up in a world that barely understand environmental allergies, let alone food allergies. I remember conversations with others about how the peanut allergy was in my mind. My sister didn't believe me until I was in college and insisted that there was peanuts in an eggroll I had eaten. She thought I was crazy until the waitress explained that they use peanut butter to seal up the egg roll before frying. Not in my head. But far more valuable, I have learned a lot about the challenges my daughters will have to navigate as pre-teens, teenagers and (hopefully) college-bound young adults. I realized that my own fear of revealing my asthma to friends, hiding my inhaler (or worse, leaving it behind at the cabin when we were going for a hike, etc. as I used to do in camp), would manifest in their own ways with food allergies--from potentially eating something they're allergic to, just so they won't have to go through the whole drama of explaining food allergies to new friends, to not telling an adult (or when they ARE the adults, a friend/loved one/roommate/residence assistant/911 operator) when they are having an allergic reaction and need treatment. I am now thinking a lot more of those years and what I can do, as a parent, to help them learn to advocate for themselves, to help them come up with strategies for avoiding ingesting an allergen even when they don't FEEL like explaining why they can't have the main course at dinner and may be tempted to just eat it. I need to discuss with them a plan for getting help with a reaction even if they feel like it may ruin their best friend's bridal shower... These are situations that, hopefully, they won't find themselves in, but if they do...how do they manage? I have been, so far in their lives, teaching them strategies to simply avoid food. I am now aware, especially as Eowyn sits on the cusp of pre-teen, that we are going to soon start dealing with the social aspects of this as well. And then of course was Sandra's frank discussion of her relationship with food--and eating almost on autopilot, as much as you can now because you don't know when the next safe meal will come along. Our girls', to my experience as their mother, have never experienced this. I fed them on demand as infants, and even as toddlers I never forced them onto an eating schedule. If they were hungry, I got out the food. But perhaps their experiences away from home, being told \"there's nothing here you can eat\", \"I'm sorry honey, you're just going to have to wait...\" although minimal, have been traumatic enough to their brains that it explains some of, especially Eowyn's, drive to eat. And eat. And eat. ALL of it. As soon as I put the first helping on her plate, she is asking about seconds. Every night. Like she doesn't have seconds and thirds, if she wants them, EVERY SINGLE NIGHT. I never understood what almost seems like a compulsion to her but perhaps that's part of it. I'd never thought to relate it to her allergies but I saw a similarity between Sandra's descriptions of her behavior, and Eowyn's behavior, anyway. It's a place to start if the eating ever gets to be a big enough concern to discuss with her doctor. Right now I just chalk it up to a healthy appetite.I also thought Sandra's insight into the language of allergic families was interesting. Like her, I always assumed my family's shorthand labeling of anything my daughter's can have as \"girl safe\" was our own vernacular. It's so much easier to say \"girl safe\" instead of saying \"there's no dairy, egg, fish/shellfish, nuts/peanuts\". Apparently this is a common shorthand for families of the food allergic. There was also comfort in knowing that, despite Sandra's mother's, and later, Sandra's, own best efforts at avoiding allergens, accidental exposures happen. Sounds strange to say. \"I'm glad you got accidentally dosed and had an allergy attack.\" Not what I mean. But that guilt I was referring to earlier? There's a whole lot of it that I carry around about the handful of times I have been diligent but NOT DILIGENT ENOUGH and the girls' have gotten exposed to something they are allergic to. Like the 8 hours of travel from Sioux Falls, SD to Seattle WA that ended with the girls vomitting all over the backseat of the car because even though I'd mentioned the girls' egg allergy earlier in the ordering process, I had only specified DAIRY when asking about the ice cream, and the place we'd eaten dinner had a sorbet that contained egg. It's always good to know you aren't the only one screwing up. But at the same time, this book has given me a sense of gratitude. I'm grateful that my daughters are growing up in an era where having a food allergy doesn't make you the odd one out. They are talked about, openly, by adults. Other kids they know, other kids they LIKE, even, have food allergies. And many without allergies have other dietary restrictions. One kid in their class doesn't eat pork for religious reasons. One of their aunts is a vegetarian. There is a social acceptance there now that didn't used to be. But that doesn't mean there won't still be the occasional landmine. The boyfriend they want to kiss and don't want to have to say NO because he just drank a big cup of milk or ate a handful of peanuts. And while I don't need to address that particular issue now, I will, one day. We'll have to talk about it. We'll have to help them figure out how to handle it so when the moment arrives, they don't have to work it out on their own. They've already got a plan in place. Tucked away, in one of the last chapters of the book, almost as a throwaway, was the bit of information that many allergy medications contain dairy, in the form of lactose. I just finished reading the book and I still feel like an idiot, and a little shell-shocked, by the fact that I did not know this. I suppose had I joined those allergy message boards and followed blogs from other parents of food allergic kids and read newsletters from the Allergy and Asthma Network, I would have known. But I didn't, and so I just learned it tonight. I immediately went into the bathroom to verify and yep. Sure enough. Under the inactive ingredients list on my daughters medication--the pill form which I started giving them both about six months ago after my youngest learned to swallow a pill (and I celebrated freedom from the crazy expensive dissolving strips)--is lactose. The kind I diligently search all processed foods for containing. And here I've been dosing them daily. This gives me hope for the oldest--I have suspected for awhile she may be outgrowing her dairy allergy. Unfortunately, this also explains the youngest's ongoing asthma exacerbation for oh...the last six months or so, assuming it's a reaction to the dairy. We'll find out soon if both have outgrown the allergy but in the meantime, I'll be switching them to a \"girl safe\" formula and making sure to ask if any medications they may be prescribed contain lactose. Just one more landmine to dodge--and not an expected one, at that. By reading this book, I got a glimpse into how life with food allergies has changed--in some ways, dramatically--and how it hasn't--in many ways particularly when it comes to treatment options, the science is still essentially the same. And I got a glimpse into the world as my girls' experience it, the way their allergies may affect their behaviors, their choices, and the decisions they will make as they get older. All in all, far more than I expected when I picked it up off the library shelf. I won't try to say that EVERYONE should read this book. Obviously, it's not for everyone. But as the mom of two food-allergic kids, I am very glad that I did. And I would certainly encourage anyone who knows someone with food allergies and is struggling to understand how their friend/loved one experiences the world, to read this book as well."}, {"userName": "Sarah", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/8200640-sarah", "userReview": "I've seen - plenty of times - the unconscious frown of a waitress when you ask for a minor change (no onions) to a recipe. Imagine having to do that any time you go out to eat because those ingredients could kill you.Given all of the current news reports on schools creating peanut-free leper colonies, teenagers dying from contaminated kisses, and the rise of gluten-free everything, this book seems very timely. It gives a great glimpse into how difficult managing an allergy, or multiple allergies, can be. Perhaps it could help you find a little empathy for the friend who limits your dinner party menu, instead of scratching her off the list for next time.Beasley shares her experiences with a laundry list of allergies, including milk, eggs, soy, beef, shrimp, tree nuts, mango, etc. Even trace amounts - a milk-based binding agent in an allergy medication, for example - causes her throat to itch or close completely. Nearly all of the stories in this book end with her clutching a toilet or in an emergency room. Interspersed with her personal experiences are some interesting tidbits on the history of allergy science and current breakthroughs. Some of these sections drag, but others provide some interesting background or allergy trivia.I read this book in less than a day. Beasley is funny and engaging, and even though the stories are a bit tense (will her meal at a swanky New Orleans restaurant end in happiness or in a dose of Benadryl?), she tells them very well so that one can see the humor in each situation. Even during the story of her attempting to cook all of the foods she's allergic to (including a chocolate mousse, which is basically a mixture of some of her worst allergies), an overly optimistic I plan, I found myself rooting for her even while I shook my head at the risk."}, {"userName": "Jennifer Wilson", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/3114983-jennifer-wilson", "userReview": "Have you ever read a book that made you want to eat an omelet with hazelnut chocolate sauce with a glass of soy milk? Well, I never had until I read this book! I wanted to celebrate being able to eat these foods! In Don't Kill the Birthday Girl: Tales from an Allergic Life , Sandra Beasley presents a sad but at the same time humorously written account of life with multiple food allergies. Weddings? As careful as she is, nearly half of them have left her gasping for air during an allergic attack. Traveling overseas? Don't forget plenty of meds, they may not have the same items available. Family reunion? What a joy when a doctor relative gifts you with six months of allergy samples. While this is a memoir, I learned a lot about food allergies and some of the theories behind them. Did you know that China doesn't have the incidence of peanut allergies the United States does? Does dry roasting peanuts make a difference in the higher rate of peanut allergies in America? While that's not known, she does present some interesting facts about food allergies sprinkled through the book. From childhood until now, she chronicles what life was like without whining, but instead making it almost laugh out loud funny. From being \"Fish Girl\" in college to rejoicing at receiving raisins in her Trick-Or-Treat bags, or not being able to kiss a boyfriend after he ate a forbidden to her food, she shows how life, all of life, is affected by food allergies. This is a fantastic book, and one of the best I've read this year! I received this book through the Goodreads First reads program. The opinions are my own."}, {"userName": "Jane", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/1181602-jane", "userReview": "As the mother of an extremely allergic daughter and as a long-time fan of Sandra Beasley (since she spent a small fraction of her junior year excelling in my class), I completely enjoyed this book. Sandra explains everything you ever needed to know about allergies, and more than I ever knew. Having observed my daughter break out in hives when the wrong food touched her lips, I can vouch for the veracity of Sandra's descriptions of her allergic reactions. She is a very brave woman who, when I knew her, never complained about her disability but took part in all the school activities with intelligence and energy. I cringed when I read about her having to pass up on birthday snacks shared at school, for I always encouraged (and enjoyed) such tasty celebrations. Sandra's wonderful sense of humor permeates the book but doesn't detract from the impression of danger the reader takes away. People die when they are not careful, and Sandra has had more than her fair share of close calls. On a more personal note, I remember the high school boyfriend Sandra describes, and seeing that relationship from her perspective was fun. I learned quite a bit about her experiences at UVA and after college, so reading the book was like a mini-reunion with Sandra herself. Sandra worries that if she has children she'll not be able to parent them properly. Sandra, you will be a wonderful mom, just as your mom was."}, {"userName": "Jenifer", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/3756117-jenifer", "userReview": "This book is heavy on the history, the medicine and the politics of allergies. It may be off-putting to those looking for more anecdote than fact. But I thoroughly enjoyed those aspects of the book and I learned a fair amount I didn't know before about allergies and current research. My son is allergic to peanuts, tree nuts - especially hazelnuts (!), soy, corn, wheat, apples and a host of environmental allergens. His reactions aren't as severe as Beasley's but we do have to be vigilant (and carry the dreaded EpiPen)."}, {"userName": "Kelley", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/1758840-kelley", "userReview": "The book jacket promised me wit and a journalist's curiosity. I was disappointed. This is mostly facts about allergens and the people who have them interspersed with personal anecdotes. All-in-all it left me a little bored and dissatisfied. The facts were well sourced within the text. I did appreciate that."}, {"userName": "Sheri", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/7803624-sheri", "userReview": "Engaging, well researched, eye-opening book. Saying it's about food allergies doesn't capture the readable combination of information and personal experience."}, {"userName": "Dan Herman", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/19685823-dan-herman", "userReview": "Sandra Beasley is an allergy sufferer, and she has plenty of funny/terrifying anecdotes to share. She's also well-researched on the topic, and provides lots of useful scientific information about how allergies actually work.I was once a food allergy skeptic. Not that I totally disbelieved in their existence, of course: I was fully aware there people out there who could have up to and including fatal reactions to eating certain foodstuffs. I more fell in along the lines of accepting the need for a peanut-free table in the lunchroom, but thinking that most people were probably overdoing it a little. My skepticism relaxed significantly when I found a best friend (whom I later began dating) with a host of food allergies that could be set off by the slightest fragment of the food in question - soy, pineapple, etc. She takes care to point out when she can't eat something (every time we go out for hibachi, it's a hard-and-fast rule that there are to be no sesame seeds involved for anyone at the table).After reading this book, though, I'm starting to think that we need to take it a step further. Like, legislating that people are only allowed to drink water in a public place, lest they inadvertently explode someone else standing nearby when they take a bite of Snickers.Most allergy sufferers would take offense at that joke (and, I assure you, it is a joke), but not for the reason you'd expect. It's not that they're insensitive to jokes about their condition, it's that most only ask others to modify their lifestyles when it's absolutely necessary. The peanut-free table is a good example: It's not calling for a blanket ban on peanuts in schools. It's saying that, because severe reactions are possible even through airborne exposure, kids can't just bring a PB&J over and sit next to the kid with peanut butter allergies. (Some people do call for a blanket peanut-ban in schools, but this seems an unsustainable course as the kid grows up. Best to just invest in a bubble suit now and save everyone the trouble.)All of this is by way of saying that we as a society can definitely do some (relatively easy) things to make sure allergy sufferers have a little bit easier time. (And no, I'm not just saying this because I want my girlfriend to live. Though that's definitely a factor.) We see a societal good in having AEDs on hand because for a relatively low cost, we can save some lives. Similarly, clearly (and accurately) labeling possible allergens in food is not harmful to the manufacturers. Indeed, they're not losing any more money than they already would have (because the peanut allergy guy probably figured it out on his own after the first purchase). You don't have to ban peanuts from the ballpark, but you don't have to go throwing them in lightly-packaged bags in front of other peoples' faces, you know?"}, {"userName": "Jackie", "userReviewDate": "Jul 15, 2011", "userURL": "http://www.goodreads.com/user/show/1147841-jackie", "userReview": "It was the title that caught me. I was just going to skim through it to get an overview, but I quickly got pulled in by Beasley's honest and quirky writing style as well as the amazing amount of information that she's packed into this book. I've been affiliated with the food industry for a big chunk of my life, and the issues covered in this book address that side of things, as well as the terrifying realities of living with multiple and severe food allergies.Beasley really got the short end of the stick when it comes to allergies--the title refers to the idea that she can't even eat her own birthday cake at her parties, she can't even be kissed on the cheek by someone who did without getting a kiss shaped hive from it. Her salad, cut up special for her but, alas, with a knife that had also been used to cut cheese leaves her curled up fighting for breath and consciousness on a secluded couch at a wedding reception. Nightmare scenarios abound. But she's got a great attitude about it, though she must always, always, always be hyper vigilant and questioning of just about everything to keep herself safe. Despite all of this, she was a food writer for a couple of years, and she's very good about adding all sorts of background to the foods and why they cause allergic reactions in some, as well as just a general history of food that I found very interesting.This book really opened my eyes to a whole lot of dangers and difficulties suffered by the allergic, and has increased my compassion level and sensitivity significantly. It's very well written, and very worthy of a read by just about everyone."}, {"userName": "Julie King", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/19888005-julie-king", "userReview": "As a mother of a child with a life-threatening food allergy, I was anxious to read this book. The author does a great job of describing her allergic reactions as well as outlining the scientific history behind food allergies and current theories and treatments as well as their limitations. I did find some of Sandra's thoughts lacking in compassion. She seems to focus in on peanut allergies which have gotten the most press as well as the most focus on treatment options from allergists. She states that peanut-free schools are excessive. While my child does not suffer from peanut allergies, I see how these steps may need to be taken when a child has a severe allergy. I disagree with Sandra in that she goes to restaurants and hopes they can accommodate her, but seems lacking in empathy for others who are asking for the same treatment (peanuts are one of her back-up foods). I was also disappointed to see her heavily rely on Benadryl when epinephrine is the treatment for anaphylaxis. Her refusal to use an Epi-pen was stunning as a parent who has administered one at least 4 times. She does a great job of articulating her struggles as well as concerns about whether she will allow foods she cannot eat in her home when she becomes a mother. While her story is compelling and will hopefully spread education about food allergies, her lack of empathy for others was disappointing."}, {"userName": "Kelly Hager", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/1436215-kelly-hager", "userReview": "Part anecdotal memoir and part scientific piece, this is about what it's like to grow up living with a variety of food allergies. Beasley is allergic to a variety of things, including (but not limited to) dairy, egg, beef, soy, shrimp and a variety of nuts and melons. Because her list of allergies is extensive, it can be hard for her to do things like, say, eat at a restaurant or even at a friend's house.We are the same age, and I don't remember anyone in my elementary school classes suffering from food allergies. I point that out to illustrate how hard it must've been growing up before people were so aware about this, the way they are now. (In one story, she details how cupcakes are handed out to everyone else in class while she eats 12 hazelnuts, a \"Sandra-friendly\" snack.) And we won't even talk about the years where you don't want to be seen as different from your friends, but in this case, a difference could be fatal. (And literally fatal, not just fatal to your standing in the high school social scene.)But this is not a \"woe is me\" tale. It's a witty, informative book, one that anyone connected to food allergies should read (whether you have them, or a relative or friend)."}, {"userName": "Allison Marti", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/20690292-allison-marti", "userReview": "As a mother to a child with multiple and life-threatening food allergies - this book was both of comfort and concern. Comfort because of being able to read that someone \"gets it\" and can relate/describe what life is like when dealing with this health issue. Concern because of worrying how my daughter will handle it as she gets older - that she will make choices that may jeopardize her life because she is tired of having to explain/be different or have \"that conversation\" with someone she is dating/interested in. I bought two copies of this book - one for my daughter to have and one to lend to friends/family who have misconceptions re: food allergies. Most people who read it quickly realize the emotional/physical/spiritual/mental toll of having to check everything/anything you put in your mouth every meal/snack - everyday - for the rest of your life...and most can walk away from the book being thankful they are \"free\" to eat whatever they want without a second thought or concern for their life. That freedom is taken for granted. And many of us having to live with life-threatening food allergies would give anything to have that freedom back."}, {"userName": "Meels", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/629685-meels", "userReview": "I don't know how I ended up on a list from Crown Publishing to receive Proof and ARCs, but I did. So far I have just given them away or chucked them, because they were NOTHING I would have wanted to read. But, this one looked interesting. I hung on to it to see if it would talk to me. It was great! I really enjoyed it. And, for an uncorrected proof, I have to say the writing/editing was better than most books I buy off the shelf! Sandra Beasley is a poet who decided to write a memoir based on her life as a person with severe food allergies since birth. She is smart and knowledgeable, thankfully, but also funny. Her humor, even in the face of trauma (or in hind sight of it) makes what could be a very dry and sorrowful story engaging and entertaining. I recommend this book for just about any one with any interest in the topic, or just a wonderful story from a very talented writer. Certainly if you know anyone with severe food allergies or for sure a parent of a child with severe food allergies this book should be recommended, if not bought out-right and handed to them."}, {"userName": "Katie", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/706193-katie", "userReview": "An enlightening (and quick!) read about someone with severe food allergies and how on earth she gets through life. Should be eye-opening for those who \"don't believe in\" allergies. The woman erupts in hives if someone who just ate a dairy product kisses her on the cheek... there's no faking that.I enjoyed reading her anecdotes about various reactions in various inconvenient places, and how they occurred. It could be as minor as eating something with the same knife used to cut something she was allergic to. Truly amazing how she gets by. I also liked her attitude--she believes the world should not change to fit HER needs, but she needs to learn how to successfully live in it. It was refreshing to hear that. My favorite anecdote was about the successful experience dining at Galatoire's (in New Orleans... I'm partial to all things New Orleans), where an accommodating waiter not only made a dinner that worked for her, but adapted a Galatoire's signature dish to work for her."}, {"userName": "Stephanie", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/2391704-stephanie", "userReview": "Beasley missed a big opportunity with this book. She could have really gotten into the nitty gritty of food allergies and life with multiple allergies, but instead she struggles to find balance between memoir and science.The book jumps all over the place to the point that it is almost impossible to follow. Each chapter floats back and forth between personal stories and research with almost no connection between the two. I often couldn't figure out how she got from point A to point B, because the two had absolutely nothing to do with each other. She's likable, and I am sad she has to spend her life worrying about everything from shaking hands to cross-contamination. She shares some really scary stories about how little of concern a lot of restaurants have for food allergies.It really isn't worth reading. There has to be better books out there on living with allergies. I can't imagine this is the only (or best) one."}, {"userName": "Brandy", "userReviewDate": "Sep 06, 2016", "userURL": "http://www.goodreads.com/user/show/5531911-brandy", "userReview": "The book is surprisingly entertaining; it takes a gift to make nearly dying multiple times humorous. It also helped clear up a few misconceptions I had about the different types of allergies. It doesn't assume you have a lot of preexisting knowledge or experience with the subject.The only part I'd suggest skimming is the science in the end, some of it has been updated. The author leaves several helpful suggestions in the back to places you can learn more online.With the rise in food allergies and the EpiPen scandal recently; I'd highly recommend the book."}, {"userName": "Jessica", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/3015560-jessica", "userReview": "We have all read books like this. The beginning and end are very good. Well written, informative, ... However the middle of the book reads like a text book."}, {"userName": "Susan Bazzett-Griffith", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/19421489-susan-bazzett-griffith", "userReview": "Half memoir, half nonfiction reference about food allergies and their history, prevalence, and the science behind the different sorts of allergic reactions, this was an interesting, if at times, a little dry, read. Sandra Beasley is allergic to so many foods- I enjoyed the memoir part of this book way more than the science and history- it is a viewpoint that a lot of parents who do not have kids with food allergies struggle to understand, though I find it interesting that Beasley is not necessarily someone who advocates for banning any foods from public places or schools ( peanuts, for instance), rather she thinks that reasonable accommodations surrounding keeping areas within these places contamination free and educating school employees further on proper epi-pen usage and signs of allergic reactions, including delayed reactions would be more effective in abating tragedies. Overall, not the best book, but its a short and easy read--the writer's voice is likable and informative and kept my attention. Three stars."}, {"userName": "Riah ", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/3016625-riah", "userReview": "This was an interesting memoir about living with a lot of very severe food allergies (dairy, egg, soy, beef, shrimp, pine nuts, cucumbers, cantaloupe, honeydew, mango, macadamias, pistachios, cashews, swordfish, and mustard). It's a mix of her personal history, along with the science and culture surrounding allergies. I really had no idea that allergies could be quite as extreme as hers are, with a kiss on the cheek by someone who ate one of her allergens being enough to cause her hives. It's also interesting to realize how much allergies are equated with peanut allergies in the US, and she points out that some of the things that sort of win up pitting one allergy against the other (particularly since peanuts are a food she actually can eat), which is an aspect I hadn't thought about before. All in all an enjoyable and informative book."}], "description": "A beautifully written and darkly funny journey through the world of the allergic.Like twelve million other Americans, Sandra Beasley suffers from food allergies. Her allergies—severe and lifelong—include dairy, egg, soy, beef, shrimp, pine nuts, cucumbers, cantaloupe, honeydew, mango, macadamias, pistachios, cashews, swordfish, and mustard. Add to that mold, dust, grass and tree pollen, cigarette smoke, dogs, rabbits, horses, and wool, and it’s no wonder Sandra felt she had to live her life as “Allergy Girl.” When butter is deadly and eggs can make your throat swell shut, cupcakes and other treats of childhood are out of the question—and so Sandra’s mother used to warn guests against a toxic, frosting-tinged kiss with “Don’t kill the birthday girl!”It may seem that such a person is “not really designed to survive,” as one blunt nutritionist declared while visiting Sandra’s fourth-grade class. But Sandra has not only survived, she’s thrived—now an essayist, editor, and award-winning poet, she has learned to navigate a world in which danger can lurk in an unassuming corn chip. Don’t Kill the Birthday Girl is her story. With candor, wit, and a journalist’s curiosity, Sandra draws on her own experiences while covering the scientific, cultural, and sociological terrain of allergies. She explains exactly what an allergy is, describes surviving a family reunion in heart-of-Texas beef country with her vegetarian sister, delves into how being allergic has affected her romantic relationships, exposes the dark side of Benadryl, explains how parents can work with schools to protect their allergic children, and details how people with allergies should advocate for themselves in a restaurant.A compelling mix of memoir, cultural history, and science, Don’t Kill the Birthday Girl is mandatory reading for the millions of families navigating the world of allergies—and a not-to-be-missed literary treat for the rest of us.", "title": "Don't Kill the Birthday Girl: Tales from an Allergic Life", "url": "https://www.goodreads.com/book/show/9833965.Don_t_Kill_the_Birthday_Girl_Tales_from_an_Allergic_Life", "average": 3.58, "cover": "https://images.gr-assets.com/books/1320458547l/9833965.jpg", "reviews": 356, "authors": [{"url": "https://www.goodreads.com/author/show/1043497.Sandra_Beasley", "name": "Sandra Beasley"}], "type": ["Autobiography", "Nonfiction", "Food and Drink", "Biography", "Health"], "outlinks": ["http://www.goodreads.com/book/show/9833965-don-t-kill-the-birthday-girl", "http://www.goodreads.com/book/show/18162566-dont-kill-the-birthday-girl", "http://www.goodreads.com/book/show/7691238-i-was-the-jukebox", "http://www.goodreads.com/book/show/2321813.Theories_of_Falling", "http://www.goodreads.com/book/show/28789659-count-the-waves", "http://www.goodreads.com/book/show/34455687-small-kingdom", "http://www.goodreads.com/book/show/24488107-none-in-the-same-room-poems-from-the-traveler-s-vade-mecum", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}