{"ratings": 1041, "userreviews": [{"userName": "Wendy Darling", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "I guess all the calm discussions advocating respectful author-reader relations were for nothing, eh?"}, {"userName": "Noelle", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/2448124-noelle", "userReview": "So I typed out a whole review but then Goodreads went down and...well, I've wasted enough time on this book. By reading it. It is ridiculous! The only realistic thing about it is how annoying and self-centered the teenage protagonists are! Otherwise? What a mess. Why not make this a road trip book? Was the convoluted, unbelievable fake kidnapping plot really necessary? There are so many more realistic reasons to go on a road trip than to leisurely track down your maybe-fake-kidnapped friend (who is emphasized as being not really that close of a friend, but someone the heroine will lie to parents and law enforcement about?!) Also, talk about convenient parental supervision. Oh, what's that honey? You're wanted by the FBI for questioning about a missing persons case but for some reason are going on an impromptu road trip across state lines without telling me where you are going or coming home to pack? Doesn't sound suspicious at all! See ya when I see ya, child o' mine! Pshhhh. There was a huge disconnect between Lil & Josh's wacky touristy adventure and Penny & her abusive boyfriend storyline too (don't even get me started on that). The only explanation is that this did indeed originate as a road trip book and the unfortunate Penny storyline was shoehorned in later? So sloppy. And you know what? I should have just used this GIF and called it a day:"}, {"userName": "Brooke", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/3179484-brooke", "userReview": "I've been in a road trip reading mood of late, and 'Don't Stop Now' didn't disappoint. While it wasn't as deep as another road trip book I've recently read ('Saving June'), I found it to be very different in mood (much lighter, it that wasn't clear), which was exactly what I was hoping for.While the story is described as being about a road trip taken by Lil and Josh to track down Lil's kind-of-friend-but-kind-of-not-friend Penny, the story is definitely focused on the road trip and their relationship rather than Penny. That being said, at the end of most chapters there were diary-like entries from Penny's point of view which, while they didn't really give the reader a chance to know her, gives a glimpse into her life. I felt so sorry for her at times, I don't think it's really a spoiler to reveal that she seems to be in an abusive relationship (which, seemingly, was a contributing factor to her running away), and the way her entries are written shows just how insecure and frightened she is. I just wanted to give her a big hug. Other times I found myself annoyed with her, I mean, take a stand! Get out! Don't just take it. Lil and Josh were so easy to like. I loved their chemistry and banter, and they were two people I found so easy to imagine. They had a lot of fun together but there was a lot of awkwardness which, if you've ever had a crush on a male friend, was so easy to relate to. Lil was witty and clever, although she definitely had her snarky side, and Josh was fun, flirty and definitely a goofball - I loved both of them immediately. Julie Halpern writes in a way that makes it so easy to become absorbed in the story, before you know it you've read 60 pages and just want to keep going. Her writing style was funny and light, and the humor had me chuckling constantly. I'm actually considering going back and marking my favourite quotes, but I'm a bit worried to do so as once I get started, I think the list is going to be huge. I've got to say, there was not a dull moment in this book! There was so much going on with Lil and Josh visiting so many awesome, quirky places that you just can't get bored. I noticed someone has reviewed on here and linked images of some of the tourist stops in the book which was awesome, some were different to what I imagined but others - spot on.If you're looking for a road trip read that's fun, cute and something a bit different, I'd definitely give this one a go. While it wasn't overly 'deep' or thought provoking, the plot was so much fun that it didn't matter. I'm about to start 'Get Well Soon' by the same author, I have high hopes for it and I'm sure I won't be disappointed."}, {"userName": "~Tina~", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "Now this book was a lot of fun!Don't Stop Now is the story about Josh and Lil, two best friends on a quest to find their kinda-sorta-friend, Penny, who looks like she faked her own kidnapping, and Lil is the only one who kinda-sorta knows where she might be and Josh is only to happy to help her on this mission. Road trip! Destination, to find one lost misfit-girl and hopefully discover many other... possibilities along the way. Hands down the best thing about this book is Josh and Lil's chemistry. They are a hoot! They have thee best banter, wit and sarcasm. They have such an awesome feel good comfy hum around them, not to mention some really sweet moments that made me smile.But with the ease of Josh and Lil's adventure, we also get a bit of Penny's point of view, and I gotta say, it kinda ruined the ride. The book is set to two completely different tones. One is carefree and happy and the other is more serious and troubled. I wanted to sympathize with Penny, truly I did, but it's really hard when your around someone like Josh and Lil and I wish that Penny's thoughts weren't included. Josh and Lil are on this fabulous adventure to find Penny, yes, but it really just felt more about their friendship/relationship more then anything else. Which is fine by me. I wish I could say that I loved-loved the ending, but it lingered, and anyone who knows me knows that I like my books that ends on hope or closure, which sadly we didn't get in this book. I still enjoyed it however, but I think I just wish there was just that little bit more added.Julie Halpern is a fantastic writer, this would be my first book from her, but I'm definitely gonna have to check out her other ones. She writes with pure confidence, really bringing these characters to life. All in all, this book was a fun experience. It's a fast funny read that is perfect for those who love road-trip books and craves that escape.Josh and Lil are a HooT, I tell ya! Read it!"}, {"userName": "Katy", "userReviewDate": "Apr 08, 2012", "userURL": "http://www.goodreads.com/user/show/4572741-katy", "userReview": "Another one? I wish I had known about the controversy with this author BEFORE I had read the book. I know authors have feelings too, but I don't understand why authors insist on publicly blogging to complain about reviewers. Vent away and set it on private or punch a wall or better yet, go read the good reviews to make yourself feel better. I've had authors kindly tell me I'm entitled to my own opinions, and that's a gracious way to handle it. Chances are, you are going to have more likes than dislikes, so take it with a grain of salt. Because those \"beyotch\" reviewers WILL tell their friends, and they can blackball you before you even begin thinking of a concept for your next book.Having said that, this review and rating will be STRICTLY on the book and not influenced by the controversy.Overall, I thought this book was just okay. I'm usually a sucker for stories about friends becoming lovers, but this book, quite frankly, was very unsatisfying. I mean, Halpern tells about what Lilian and Josh are going through, but I found it really hard to sympathize with their situation because I felt they spent more time whining about it and avoiding it and then putting each other through this yo-yo situation than actually wanting it badly enough to try. And the end? I spent the last two hours reading this book and the end makes me want to pull my hair out.Now about the story itself. It's a bit unrealistic. Why are Penny's parents calling Lilian's cell phone if they're just sort-of friends and she tells them they're not really friends? And if Lilian is waiting to hear back from Penny, where she's already missed a few calls from her, why is she letting calls go through to voicemail? And they expect to find Penny by pure luck? No last name and no information about Ethan and they just happen to run into her? And just for the record, cell phones do not last as long as Lilian's did.Overall, it's not a bad book - two stars for just okay. I wasn't expecting something mind blowing, but I was expecting to at least leave the book with a slight warm and fuzzy feeling, and disappointingly, this book did not leave me that."}, {"userName": "hayden", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/2995566-hayden", "userReview": "This book didn't look appealing before this little incident and it certainly the hell doesn't now. I don't know what's gotten into YA authors these days, but they need to BTHO. (Back The Hell Off.)"}, {"userName": "Nancy", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/3122452-nancy", "userReview": "[image error]"}, {"userName": "Sab H.  (YA Bliss)", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/2401865-sab-h-ya-bliss", "userReview": "I LOVED every bit of this! Just loved it. The writing was easy-going and witty and fully enjoyable. The book was so fun without been cliched or repetitive. We have the unexpected road trip that *may* put things in motion between Josh and Lil, who have been best friends for years. I always love the bff turned love interest. It's so real it reminds me of a personal experience. One that I'm sure many of us have in mind because I'm sure everyone has/will crush on someone who only considers you a friend at some point. Julie describes the insecurities and awkwardness perfectly. All the double-meaning interactions and the friendly gestures that make you want to melt inside. Ah, it was so cool to be in love with Josh through Lil.Also, after every other chapter there are diary entries written by Penny (Lil's friend who faked her own kidnapping and the reason of the unexpected road trip) so you also have a subplot of sorts from Penny's eyes and what's going on with her, but you also get to see Josh and Lil from a different perspective. That really added to the story.And then there's the actual trip. I have to admit I have not read many road trip books. Nor have I been in a road trip myself. With that said, I feel I have. Lil's descriptions of the places and Julie Halpern's pictures on her website have created a perfect mental image. They went to The House on the Rock, Mars Cheese Castle, Wall Drug and so many awesome places.It was just such a cool book. THE perfect summer read. I highly recommend it."}, {"userName": "Natasa", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/2075644-natasa", "userReview": "After reading The Story Siren’s review, I was very excited to get my hands on this book.The verdict? Disappointment. I was expecting a light summer read, which admittedly, I got, but what I was not expecting was the bombardment of materialist and consumerist advertisements of half the tourist attractions in the USA.I’d just get a travel guide if I were you.Sure, in the beginning it was cute but by the end I felt I knew more about the fun places of America than the supposed couple/best friends. I don’t remember any character development. I don’t remember having any empathy for the main characters. I certainly don’t remember any romance for 99% of the whole book. The smidgen of actual romance that (finally) appeared was so weak it was quite pathetic and lasted so short it was a relief when it ended.I closed the book with not a little bit of frustration, because I loved the sound of the premise. The idea of best friends falling in love might not be original but the idea of a road trip held promise. Sadly, the bizarre ending and the lack of any real character development or conflict throughout the book ruined it for me."}, {"userName": "Ricki", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/1037651-ricki", "userReview": "When Julie Halpern spoke with my class, she told them that, in high school, a friend called to tell her that she faked her own kidnapping. Julie took that event of her past to create this incredibly fun, laugh-out-loud, road trip book. I identified with Lillian, and I think many teenage girls will. She is in love with her best friend, Josh, and continually questions and analyzes aspects of their relationship. Lillian is quite insecure, and I think she is a great depiction of the average teenage girl (...and most adult females, to be honest). Her friend, Penny, is emotionally unstable, and I think we all have a Penny in our lives that we want to nurture (or is that just me?).DON'T STOP NOW is a great book, and I can't wait to recommend it to my students."}, {"userName": "Eve Davids", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/3437007-eve-davids", "userReview": "This is the worst book I have ever read in my life. I fucking hate all the characters in it. They were one dimensional, useless, and boring. Oh dont let me forget to add, they were all huge biyotches as well. Please dont ever read this book. Even if someone held a gun to your head, do not go near this book."}, {"userName": "Danya", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/4108618-danya", "userReview": "Take the disappearance of a not-so-close friend. Add a promise not to tell, some calls from the cops and FBI, and a spontaneous road trip with your best friend/crush. Mix in some tourist attractions, metaphors, and close-to-the-heart confessions along the way. The result? Don't Stop Now by Julie Halpern.Characters:Don't Stop Now is all about the characters and their relationships. Often if characters frustrate me a little but I keep on reading, that's a good sign that there's some great characterization going on there, and that's what I found with this novel. The main characters are given enough flaws that they seem like real people, but not so reprehensible that you give up because you just can't stand them.Lillian: she isn't the most likeable protagonist right off the bat, but Lillian grows on you. She's got a strong sense of herself, her opinions and her wants — no weak, wishy-washy protagonist here — but she has to learn to see things from others' perspectives as well. Her friendship, if you can call it that, with Penny is key in this area, because at the beginning of the novel she doesn't really care very much about Penny. The stabs of conscience she feels over the knowledge that perhaps she might have been able to prevent Penny's disappearance annoy Lillian more than anything else, and she uses Penny's faked kidnapping as an excuse to spend time with Josh on a roadtrip. Concern about whether Penny is actually safe? Not so much.And while Lillian sometimes gets annoyed with Josh's immaturity, she's not exactly a model of responsibility and common sense herself. She talks to Penny more than once without managing to get an address for her; while I understand that there probably wouldn't have been a story if Lillian had been a little savvier or rule-obeying, it didn't reflect particularly well on her. Eventually, towards the end of the novel, Lillian does seem to come to some realizations about how she's been acting and what she should do to help Penny. Josh: so while I didn't always agree with Lillian's decisions and actions (lying to the cops and FBI is not really my thing) I did appreciate her as a character who felt 3-D and real.  Likewise, Josh sometimes irritated me as well, but he too was a mix of good and bad. I didn't blame Lillian one bit for calling him out on his immaturity when it came to the future and his career plans (or lack thereof — a band? Really?) or his mixed signals when it came to their relationship. His carefree, blase attitude towards life in general, taking for granted that everything will work out just fine, made me want to shake some sense into him. However, we can see that he's been a close, loyal friend to Lillian and that they have a strong bond and shared memories. Lillian & Josh: Halpern was able to create a pair of characters where I wasn't sure if I was rooting for them to get together romantically or stay friends. Honestly, this is a bit of a rare occurrence; usually I'm either cheering for the guy and girl to admit they're in love, or I'm going, \"no, they're all wrong for each other.\" Well, with these two I kept hemming and hawing, seeing both sides of it and not knowing which side I should land on. It was clear that they had a long history of being friends, and that they both relied on each other in different ways, but I also got the sense that they didn't have as much in common now as they used to. So I was caught between \"Awww, they obviously care about each other, there could definitely be something there,\" and \"They are good friends, but if they're going down such different paths, I don't see much of a future there romantically.\" The only thing I knew for sure was that I thought they should give it a try. No spoiling, but because of this see-sawing I was experiencing, I thought the way the book ended was very fitting.Penny: while her narrative is sympathy-inducing, I felt like we only see one side of her — the girl caught in an unhealthy relationship — which made her character seem a bit stereotyped. The excerpts from her point of view helped to give us a sense of where she was coming from, but I would have liked to see other facets of her character. I think there was a completely separate story happening with Penny, that we are just given glimpses of; it comes across quite obviously that this book is Josh and Lillian's tale, not Penny's.  Plot:From the description the book comes across like a bit of a mystery, but that's really not the case. The focus of the story is not on Lillian and Josh finding out where Penny is and what happened, but on their experiences on the road and their relationship dynamics. The pace is slow and easy for a journey that's supposed to be all about tracking down a missing person, which is reflective not only of Lillian and her \"friendship\" with Penny, but also of Josh's laid-back devil-may-care personality. Frankly, they're mostly on this roadtrip to enjoy themselves, even if they may pretend it's for more altruistic reasons. I did often wish that Lillian cared more and realized the urgency and potential danger in Penny's situation, but I understand that this reflected her character and how she operated. Although I've gotta say, if I was in danger or need of help, I wouldn't be counting on Lillian or Josh to come to the rescue.That said, I appreciated that the Penny disappearance sub-plot did keep the story moving and give it direction. I thought the ending was a bit rushed, everything wrapping up easily and conveniently with both Lillian and Penny coming (at least somewhat) to their senses. Setting:Since it's a roadtrip novel, the setting really adds to the storyline. Though their stops at each place are pretty brief, and I thought they could have used some more description, having the various tourist attractions sprinkled along the way was fun. Unique places like the House on the Rock, Mars' Cheese Castle, and the Corn Palace keep the story feeling fresh.Writing style:I thought the use of excerpts from Penny's perspective at the end of each chapter was marvelously done, giving the reader an idea of how she got to where she is now without getting bogged down in any long flashbacks that would take away from the current storyline. Penny's darker story also makes for a nice counterpoint to the more upbeat vibe of the roadtrip.For the most part the writing is smooth and flows well, and despite the relaxed pacing I don't recall that it took me very long to read. I did find some of the slang to be a bit confusing — I'm not sure if I'm just not familiar with it or if it's slang invented by the characters, but it made me go, \"Do teens really talk like this?\" a few times.Final verdict: 4 shooting stars. Disclaimer: I received the ARC of Don't Stop Now from the publisher for review.For my full review, see my blog,  A Tapestry of Words ."}, {"userName": "Cecelia", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/67555-cecelia", "userReview": "You know how sometimes a song or a particular book reminds you of a day, or a place, or a season? I’ll forever associate Julie Halpern’s latest novel Don’t Stop Now with summertime, roadtrips without air conditioning, and intense heat. It’ll be a reminder of those shimmering waves of hot air that seem to billow out of the asphalt along the horizon line, of the windows down and the music too loud (so you can hear it over the rush of the wind), and of the inevitable orange snacks you pick up at an anonymous corner store.Julie Halpern has a way with characters (and, of course, a way with words) that puts her up at the top of my list when I’m recommending contemporary YA lit. Her stories feature realistic teens, situations, and friendships – the things that broke your heart, changed your life, and formed the foundation of who you decided to grow up to be. It’s no surprise, then, that her latest novel is a winner.With her mother’s benediction, Lillian, or ‘Lil’, has given herself the summer before college (where Sarah Dessen heroines live forever) to savor being free of responsibilities, adulthood and the real world. But on the first day of that freedom, her pity-friend (yes, I think that’s a thing) Penny calls and leaves a message that changes everything. Lil and her best friend Josh set out on a cross-country roadtrip to find out what’s really going on. What ensues is not only a fact-finding mission, but an adventure that will change them all – perhaps forever.Ah Penny, and her fateful phone call. Penny has been a ‘quest’ for Lil – her good deed of the year is an ongoing effort to get Penny to hang out. Problem? Lil sees Penny more as an object than as a person. In fact, the reader sees her this way too, in 2D, an object to be pitied rather than a real character. The ‘mystery’ of where Penny is and what she’s doing is fairly transparent and predictable.But the real meat of the novel is Lil and Josh’s relationship, and how it develops over the roadtrip. Speaking of roadtrip: I have LIVED THIS STORY. Really. I mean, not with a platonic best friend of the opposite sex, but I have driven cross-country in a car without air conditioning and visited these attractions (okay, most of them) in August. Multiple times, actually. I’m not going to lie, Halpern is spot on. It’s the next best thing to actually experiencing it yourself (and very possibly better than experiencing it yourself, to be quite honest).Josh and Lil come across as real, authentic characters who have reached a point of comfort in both their skins and with each other. Lil wants to take their friendship to the next level, Josh doesn’t want to change anything – about, well, anything. Over the course of the trip they discover that much more about what they want, who they are, and where it all goes from here.What to say? This novel felt honest. I liked it. I didn’t necessarily get what I wanted, but I did read something true, and that’s probably better. Don’t Stop Now had its flaws (ahem, Penny!), but it will go down for me as one of the most summery books I have ever read. Can’t wait to pick it up on a frigid winter day and relive the heat and memories!Recommended for: fans of Sarah Dessen and Jenny Han, those looking for a stellar poolside YA read on a hot day, and anyone who has experienced (or dreamed of) a summer road trip with no rules and no responsibilities."}, {"userName": "Mundie Moms & Mundie Kids", "userReviewDate": "Apr 03, 2011", "userURL": "http://www.goodreads.com/user/show/4397975-mundie-moms-mundie-kids", "userReview": "3.5 stars, reviewed by Cynthia for MM's-When I started reading Don’t Stop Now I thought it was just going to be a fun light-hearted read, it was actually pretty funny and was making me laugh out loud with the hilarious conversations between Lillian and Josh but I soon realized that there was going to be more to the story, something more serious.The story starts off pretty much on the light side, we have Lillian who’s had a crush on her best friend Josh since the first time they met but Josh is unaware of her feelings and she’s never really acted on them. They embark on a road trip to Portland where they’re suppose to find Penny, Lillian’s friend because Penny has faked her own kidnapping and Lillian wants to get her to come clean about it, but she‘s also using it as an opportunity to spend alone time with Josh. Throughout the book we get snippets of what I assumed was Penny’s diary because they pop up in between paragraphs and the first time it happened it confused me, I wasn’t really sure if it was Lillian or Penny but it soon became clear and we begin to see how hard Penny’s life had been. I felt pretty awful for poor Penny, her parents never paid much attention to her or made her feel loved, they pretty much only used her as a babysitter and driver for her little sister, never really showed any interest in her life. Besides the problems she had at home she was also trapped in an abusive relationship.I loved Josh, he was a fun and sarcastic, so oblivious to everything and made a joke about anything even at the worst times which lighten the mood in the story during the tense scenes and had me laughing several times. Lillian was like the other half of Josh, she had a great sense of humor which made the friendship perfect even though she had higher goals in her life they got along great, they seemed to have a deep connection, which made the story so easy to get lost in and a great read. I think what I would've liked to have seen a little bit more focus on Penny's problems, the ending seemed to resolved too easily for me, but she was more of a side character and the story focused mainly on Lillian and Josh. Don’t Stop Now had a bit of seriousness in it but it was also mixed with a lot of fun light moments and hilarious dialogue between the two main characters. It was a great story about love, friendship, taking on responsibilities, letting go. The writing was easy flowing, the characters likable and it had a deeper message than I expected which was a great surprise. I think older teens and adults will enjoy this one and seeing these character come to terms with the changes of life from high school to becoming adults."}, {"userName": "Lesley", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/4306985-lesley", "userReview": "Posted on http://mykeepershelf.blogspot.com/201...My rating 4.5 out of 5I adored the snarky banter between BFF's Lillian and Josh as they head West on a road trip with Josh's car and his rich but absent Dad's credit card to track down their troubled friend Penny who appears to have faked her own kidnapping to escape an abusive boyfriend and her QVC addicted mother who ignores her.Josh and Lil's road trip is full of hilarious pit stops at places such as Mars' cheese castle, the enchanted world doll museum and the spam museum (who knew such a place could exist?) and buying \"cheese makes it taste better\" t-shirts along the way. Their relationship is that of BFF's, full of in jokes and snarky comments however, Lil has been in love with Josh for years, he  is flirty with everyone (including waitresses and shop assistants) everyone EXCEPT lil and yet, in the moment looks at her and it's all *le sigh* They have amazingly zingy chemistry but there are also awkward \"almost\" moments, lots of unrequited love and unspoken feelings. Although the story focuses mostly on the road trip there is the slightly more serious storyline concerning Penny's pretty awful life and her cry for attention but it is very much in the background of the book.Great characters, snarky humour, romance and a quirky road trip all rolled into one fantastic tale. Definetly well worth a read."}, {"userName": "♡ Half Blood  Prince ♡", "userReviewDate": "Jan 18, 2012", "userURL": "http://www.goodreads.com/user/show/6231585-half-blood-prince", "userReview": "Will not be reading.What a great way to win our hearts. And over this apparently \"nasty\" review."}, {"userName": "Emily May", "userReviewDate": "Aug 18, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I just wanted to say a massive thank you to Jasprit for letting me borrow this book and I'm just sorry I can't get into it. I don't want to put people off, it just wasn't for me :("}, {"userName": "Lauren", "userReviewDate": "Nov 19, 2010", "userURL": "http://www.goodreads.com/user/show/1676535-lauren", "userReview": "I always adore road trip books, and Julie Halpern's Don't Stop Now was no different. Romantic, quirky, and fast paced, it constantly had me flipping the pages, eager to know what would occur next.Lil and Josh are preparing for an easy and relaxing summer, as it is her last one before her college and the last time they will be together for a while. However, everything changes when Lil gets a voice mail from Penny, their sort-of friend, simply saying, “I did it.” Lil does not put much thought into it until the FBI gets involved. Apparently, Penny’s MIA and Lil was the last person to hear from her. Lil knew Penny was in a twisted and confusing relationship with her boyfriend and was constantly seeking a way out, but why would Penny do something so drastic. Before Lil knows it, she is on a road trip with Josh to find Penny and bring her home. However, there is another problem on this road trip, one between Lil and Josh, because Lil likes (no, LOVES) Josh, but he will not seem to recuperate the feelings. Will they find Penny? Better yet, what will happen between Penny and Josh? Will they get together, or manage to ruin their friendship by the end of the trip?Lil and Josh were unique and interesting characters, and their relationship was even more so. I don't think I have ever seen a relationship just like theirs in a YA novel and I found that very refreshing, as not only did it seem realistic and authentic, but it also the ignited the kind of tension and drama I love seeing. Better yet, it was always fun seeing Lil and Josh interact with each other, because they played of the other’s emotions and feelings so well, which often made the dialogue and situations they got themselves into all the more hilarious.The road trip aspect of this was also full of fun. Their adventures were another unique aspect, as the places they stopped were almost as always as dysfunctional as they were. The Penny part was another part that introduced some suspense, and I especially enjoyed how I was able to see a little into her head through the journal entries Julie included. Penny was not my favorite character by far, but it was still interesting to see her drama unfold.This was my first time reading something by Halpern, and I really enjoyed her writing style. It was breezy and quick, easily something you could read in a couple of hours. Best of all, I really liked the ending in this- it was open-ended but in a way that still gave you hope of what has to come for the characters. However, I have to say I would love to see a follow-up.Don’t Stop Now is the perfect summery read, especially if you’re one who likes eccentric characters and funny dialogue.Grade: B+"}, {"userName": "Laura", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/2555689-laura", "userReview": "Review posted 8/16/2011 at Owl Tell You About It.I'm at a weird place on this one. There are things I loved and things I didn't like so much. I loved Lily and Josh. They were great characters, but I wasn't totally satisfied by where their story went. It just left to much open for me. I was expecting a feel-good story with a road trip, and it didn't quite deliver.Lily is a good character. She's quirky and laid back. Or, at least, she acts laid back most of the time, when she's really stressing about whether or not Josh was flirting with the cashier at the convenience store or if he thinks she's pretty. She had the potential to be a really engaging character if it wasn't for her obsession with what Josh is thinking. I understand how that can be when you're young, but life doesn't revolve around boys. The good thing is, she has plans and she worries about how Josh will fit into them rather than how she can mold them to fit Josh. That's good. At least she has some priorities.Josh is sweet most of the time. He can get a little cocky, and definitely self-righteous about his music. I can definitely relate to being the person who wants to drone on forever about stuff none of my friends care about (like books), so I tried to sympathize, but at some point you have to just take the hint and shut up about it. Or find a different outlet (like blogging). It was polite of Lily to let him talk about his musical interests, but I'd personally rather someone care and listen than let me talk while they're off daydreaming. It feels too fake, and I'm not into fake.Penny is screwed up. I'll agree to that, but I think everyone was too hard on her. She was scared. Not everyone can be strong and assertive. There are people out there who are just a little weak and need help. Penny was one of those people, and I felt like everyone just whined at her about the trouble she was causing, which is selfish. Yes, she was being selfish, but it was a cry for help. I just think Lily could have been a little more understanding. I guess driving across the country to find her was a pretty big gesture, but se was so angry the whole time and it kind of ruined it.It's a cute book, but it didn't deliver the way I wanted it to. I expected a little more from it. It happens. It's still pretty good though, so if you're in the mood for a road trip book this one is a good pick. The characters are quirky and the places they see are strange too.Prude Filter: This book contains profanity and sexual references. I suggest 13 and up."}, {"userName": "Melissa", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/4368718-melissa", "userReview": "The comparison to Amy & Roger’s Epic Detour are inevitable and while I still like Amy & Roger better, Don’t Stop Now did have its moments.Penny has faked her own kidnapping and now, Lillian believes it’s her responsibility to go after her. Together with her own best friend, Josh, they take a road trip to Portland to find Penny. But Lillian has a massive crush on Josh. Will this road trip help her give voice to her feelings and does Josh feel the same way?Don’t Stop Now is a much more serious novel. Penny is a girl who is going through some family problems and has an abusive boyfriend at the same time. She sees faking her own kidnapping as the only way out. That in itself is no laughing matter and I think Julie Halpern handles the severity of the situation very delicately and very sensitively as well.Characterizations were done well in this story. There is a lot of focus on Lil and Josh’s friendship but what I’d like to read more about is their personal lives. I’d like to know more about Lil, apart from her indecisiveness when it comes to college. I want to know more about Josh, something other than his father being super rich and him not wanting to go to college. Don’t Stop Now is also very much Penny’s story. While we only get glimpses of her life, it’s easy to relate to her and it helps us understand why she did the things she did and we do feel a little sorry for her.I didn’t really enjoy the road-trip aspect of Don’t Stop Now. It felt sort of rushed and not just because they had to get away from the police in the beginning. I didn’t feel like there was a point in their making stops on the road trip. They seem to always be having fun and I find myself wondering if they understood the severity of the situation, like their friend Penny could be in serious trouble, or worse, lying dead in a ditch.The romance too was all right in Don’t Stop Now but it was certainly done very maturely and I quite liked it actually. The ending, while ambiguous in certain areas, did give readers a small amount of closure and I suppose a novel like this can't really have a clean-cut ending."}, {"userName": "Britta", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4369642-britta", "userReview": "This book was really fun and I enjoyed it quite a bit. It was quirky, odd, random and everything you could wish for in a road trip.Lilian semi-regrets her decision of taking Penny, the outcast, under her wing. But regardless, she has, and now she has to deal with all of Penny's crazy antics. The most recent? Leaving her a message at four in the morning stating only, \"I did it\". Did what? Luckily (well... thankfully), Lil decodes this to mean that Penny had faked her own kidnaping. Well great. What the heck should Lil do now? Well, what any one would do! Go on a road trip with her Bestie Josh and try to find her before the police either figure out Lilian's involvement, or get to the bottom of it themselves.Although this book has a great plot, I felt like it was much more character driven than plot based. Lilian loves her relationship with Josh, he makes her feel comfortable and they've been friends forever. Now she wants more. But does he? To me, this story felt like less of Lilian finding Penny, and more of Lilian finding Josh, even though he's been there the whole time. That aspect was really cute, but didn't feel like that plot was overdone (meaning, it didn't sound like every other story that goes that way). Also, like I sort of mentioned below, this book was super fun. Both the main characters were really random, whimsical, fun, and free-willed. I loved that aspect. I liked both of their quirky humor and outlooks on life. And the stops they have along the way of their road trips are laugh-out-loud-funny. So all in all, this book is a nice, quick summer read. It is a good book to read if you want to laugh (and who doesn't want to laugh? Haha)."}, {"userName": "Louisa", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/2054481-louisa", "userReview": "Was \"Don't Stop Now\" as good as \"Into the Wild Nerd Yonder\"? Of course not. Was it absolutely mindless drivel? Nope. Frankly, there are two camps concerning Julie Halpern's new-ish book. Either it's amazing or it's the worst thing ever written. And truly, it's neither. It's both. Does the weird fake kidnapping of the main character's quasi-friend who is most likely the victim of parental neglect and domestic violence feel like a pretty under-handed plot device created in order to get said main character and her super hunky best friend on the road in order to then get them to declare their love for another? Yes. It did. And it still feels icky and sad and just in really bad taste.However, (And I hate myself just a little for writing this) I forgot all about it until the end of the book. The road trip and cutie-pie romance between Lillian and Josh is that winning and adorable. When those two crazy kids finally did get together around Idaho, I was happy for them. Did I wish Julie Halpern had come up with another situation which would allow them to do so? Of course, I did.See, this is the quandary of \"Don't Stop Now,\" it's like two separate novels, one icky and one awesome, that were forced to become one. I guess, one just has to decide for one's self whether one can just read it for the good stuff. I could...but I'm simple like that."}, {"userName": "Sarah Rosenberger", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/1449506-sarah-rosenberger", "userReview": "When best friends Lillian and Josh go on a road trip to track down a friend who has faked her own kidnapping, Lillian has more on her mind than just finding the missing Penny. She has had more-than-friendly feelings for Josh for a long time, and hopes spending a bunch of time together will make him finally realize he returns her feelings. A light-hearted, unconventional romance with some serious undertones. I really liked Into the Wild Nerd Yonder because of its realism, and was disappointed that parts of this book felt contrived and unnatural. It's possible I was being unfairly harsh, because I kept comparing it to Amy & Roger's Epic Detour, a very similar book (right down to the Elvis obsession) that had a lot more emotional impact. That being said, I'm a big fan of Halpern's stong female characters, and I liked that Lillian wasn't afraid to go out and try to get what she wanted.Good for girls who want a road trip book, a book about graduating high school and moving on, or for those who like pop culture and atypical romances."}, {"userName": "Frannie Bottorff", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/45752564-frannie-bottorff", "userReview": "This book is a good read for the summer. I highly suggest reading this because it has just the right amount of adventure, and a little bit of romance towards the end that comes into play. The way the author uses description makes you feel as if you are right there beside the narrator, seeing and feeling everything that is going on. \tThis is a good book to read for teenagers to read because they are always thinking about adventure and all the “what ifs” that go through an adolescent's mind. This book is based around two best friends, a male and a female to be specific. These two set off across the country to find their other friend who has disappeared. \tI enjoyed this book because once something got calm in the book all of a sudden something major would appear in the plot. These two best friends are very fortunate to have come across this summer and all adventure that it brings to them. I really hope you give this book a read because it is worth it."}, {"userName": "Jeff Raymond", "userReviewDate": "Feb 22, 2011", "userURL": "http://www.goodreads.com/user/show/32271-jeff-raymond", "userReview": "Ah, the fabled teen road trip story.The twist in this one is that the boy and girl friends (as opposed to the couple, to establish the conflict) are on a cross-country road trip to look for her friend who has faked her kidnapping. Yup.So this is one of those books, it's a weird adventure, and I'm honestly not sure how it works, if it works at all. It's readable and enjoyable, yes, but it's fairly surface-level and surprisingly predictable. This is kind of along the same lines as I've felt about other Julie Halpern books, and perhaps I'm just looking for something that was a little more...something from this and other books like it. On a whole, not a bad read, but not one I was in love with, either."}, {"userName": "Kelly", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/732347-kelly", "userReview": "I liked the Lil/Josh story line, despite it being kind of unbelievable. Their parents were way too lenient and willing to go along with their road trip without consequence. But the big problem I had with the novel was the way underdeveloped storyline with Penny. It was a thin thread to use as the catalyst for the road trip, and it was clear that was never the real intention for the road trip anyway, as that story line was wrapped up very tidily in a couple page. Didn't buy it. The writing itself, though, is fun and fresh.Full review here: http://www.stackedbooks.org/2011/10/d..."}, {"userName": "Pink", "userReviewDate": "Apr 14, 2014", "userURL": "http://www.goodreads.com/user/show/1369767-pink", "userReview": "Liked hearing about the cool road trip places they went, especially when their destination is Portland and I'll be going there next month. They even stopped by the craters of the moon by/in(?) Rupert! Didn't find it believable that it took this girl 4 years to approach her best friend with the whole 'do you like me' subject...This was a fun easy breezy read. I enjoyed the banter between the two of them and I even laughed a few times. The characters were 'witty' in a believable sense, rather than the overdone one...if you get what I mean..."}, {"userName": "Mickie", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/1746356-mickie", "userReview": "Lil makes me angry. You don't browbeat your best friend (whom you have had a crush on for four years) into sleeping with you eventhough he admits that his is insecure and feels you will immediately leave him and THEN LEAVE HIM. gawd. lame.I am really disappointed in this book. It touches on abuse with oblique hints and it NEVER DEALS with it. So what was the point, shock value?you are better than this JULIE!!"}, {"userName": "Vivian", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/3319020-vivian", "userReview": "Just extremely, extremely unrealistic- oh yeah, we'll take a road trip and dodge the FBI! No big deal! My friend just faked her own kidnapping but I'm muuuuch more worried about whether or not this guy likes me, so I'll just turn off my phone and not worry about that for now.It was just so completely unrealistic that it was shallow and annoying."}, {"userName": "narajaponesa", "userReviewDate": "Jul 05, 2011", "userURL": "http://www.goodreads.com/user/show/929433-narajaponesa", "userReview": "Some of the choices Halpern made in terms of the core relationship were well done, but for the most part, I'm sorry to say, it's a somewhat forgettable book. As a new transplant to PDX, though, I enjoyed the descriptions of the city."}], "description": "On the first day of Lillian’s summer-before-college, she gets a message on her cell from her sort-of friend, Penny. Not only has Penny faked her own kidnapping, but Lil is the only one who figures it out. She knows that Penny’s home life has been rough, and that her boyfriend may be abusive. Soon, Penny’s family, the local police, and even the FBI are grilling Lil, and she decides to head out to Oregon, where Penny has mentioned an acquaintance. And who better to road-trip across the country with than Lil’s BFF, Josh. But here’s the thing: Lil loves Josh. And Josh doesn’t want to “ruin” their amazing friendship. Josh has a car and his dad’s credit card. Lil has her cellphone and a hunch about where Penny is hiding. There’s something else she needs to find: Are she and Josh meant to be together?", "title": "Don't Stop Now", "url": "http://www.goodreads.com/book/show/9578331-don-t-stop-now", "average": 3.42, "cover": "https://images.gr-assets.com/books/1316638970l/9578331.jpg", "reviews": 184, "authors": [{"url": "https://www.goodreads.com/author/show/256405.Julie_Halpern", "name": "Julie Halpern"}], "type": ["Young Adult", "Contemporary", "Romance", "Travel", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9578331-don-t-stop-now", "http://www.goodreads.com/book/show/12414327-don-t-stop-now", "http://www.goodreads.com/book/show/12439304-don-t-stop-now", "http://www.goodreads.com/book/show/457060.Get_Well_Soon", "http://www.goodreads.com/book/show/6318413-into-the-wild-nerd-yonder", "http://www.goodreads.com/book/show/17286812-the-f--it-list", "http://www.goodreads.com/book/show/12981956-have-a-nice-day", "http://www.goodreads.com/book/show/23848171-maternity-leave", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}