{"ratings": 424, "userreviews": [{"userName": "Roxane", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "The stories in this collection reflect a really unique and always engaging voice. I've not read a book like this which is also how i felt after reading Hunter's first collection, Daddy's. There's ugliness in these stories. Most of the people Hunter writes aren't terribly pleasant but they are real. They are the people we know and love and hate. There's a lot going on here with syntax and language and rhythm. Some of the stories will just break your heart with the truths they tell. I think I will review this with Susan Steinberg's Spectacle. I look forward to reading this collection again."}, {"userName": "Richard Thomas", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/3333483-richard-thomas", "userReview": "THIS REVIEW ORIGINALLY RAN AT THE NERVOUS BREAKDOWN.Lindsay Hunter owes as much to Denis Johnson as she does to Mary Gaitskill. Her short stories, collected in Don’t Kiss Me (FSG Originals) do not hesitate to descend into the primal urges and dark, lusty behaviors that make us all animals at our core, but they also shine a light on the truth, a nugget of goodness at the center of what is quite often a lonely, depraved and tragic journey, one blanketed in a desire to be seen, to be loved—no matter who we are, or what we’ve done. Hunter’s characters work at diners and long to be included, they take care of their children while embracing their shortcomings, they chase boys into cornfields and kiss their best girlfriends, all the while longing to feel special and included.One of the early stories in this her second short story collection, “Dishes” starts off in typical Lindsay Hunter fashion, setting the stage by showing us the raw recounting of every humble and embarrassing moment—no filter, just a mix of pride and surrender:“At breakfast my kid practices his ABCs and barfs into his cereal bowl just before Q. My other kid points out how the barf had splashed onto the table in the shape of Oklahoma. I don’t tell him it looks more like Texas, he’s a little kid and if he wants to mistake Texas for Oklahoma it’s no skin off my tit. My husband wipes up the barf and I watch his shorts bunch in his ass.”There is so much going on here. First, it’s funny, right? Whether you’ve been there a million times before, or this whole scene is a window into what parenthood might look like, the casual retelling, the “no skin off my tit,” summons up laughter. Later, as a chorus through the story, our protagonist keeps saying, “Big girls gotta eat!” She laughs at the fact that she’s overweight, she knows it, and she embraces it. She is who she is. You can almost picture her shrugging her shoulders as she says it. Her son packs her a lunch of nothing but Fruit Roll-Ups, Tootsie Rolls, half of a juice box, and a single Goldfish cracker. It’s funny, it’s sweet—and it’s kind of sad. We go along with the joke, but quite often after the punch line, there is an extended darkness that hangs in the air to remind us that these are people, not jokes—these are real lives, not just there for our amusement. Take the final lines from this same story, “Dishes” and tell me how it feels:“…a song about a lonely desert wandered starts, I pass tacos pizzas chicken ice cream barbeque. The sky is pink meatblood, is a runny sorbet, the sun is a melting butterscotch, the sky is a dirty plate.”Not so good, I think.Another story that does a great job of luring us in with soft memories and sweet adolescence is “Three Things You Should Know About Peggy Paula.” This might be my favorite story in the collection, and since it leads off the book, Lindsay Hunter may agree with me. The first thing we learn is that Peggy works in a diner, where she watches the popular kids come in after games and dances, always in the shadows, picking up lost lipsticks, making them her own, transferring the lust and heady glow that the girls have to her own seduction of the red-headed dishwasher weeks later.The second things we learn is that “Peggy Paula has a kidney-shaped scar on her lower back from falling backward out an open window backward at a disco.” She went there to meet men, but it was a gay nightclub, so she didn’t have any luck. Tumbling into a dumpster, pissed on by an apologetic blonde boy, this is a memory that she cherishes, even though she was hurt, even robbed by the club goer. The memory she clings to is that he called her special.The third thing we learn about Peggy Paula is that she is having an affair with a married man who worked at the local video store. Throughout the story we get all of the sweaty moments in back seats, the desperation and grunting, the echo of shut doors as these men use her, and walk away. But what brings the story full circle, what really punches you in the gut are the final lines of the story, after they’ve been caught, what Lindsay Hunter does best—showing us the truth and motivation that drove Peggy to commit these questionable acts:“…and maybe that’s why she let the man in two nights later, had to see his eyes, had to feel again, and she kept letting the man in, she kept letting the man in, his smell the hair on his chest the delicate skin above his pelvis the muscles in his thighs his calloused hands the shapes of his toes the gold in his eyes the missing molar the mole on his back the heart in his chest the breaths in and out he was alive he was another he was a man and Peggy Paula let him, she let him, because if no one is there to touch you are you even really there?”If you don’t take a deep breath there, and let out a heavy sigh, nodding your head, maybe tearing up a bit, swallowing your judgment, muttering, “Damn,” under your breath—then maybe you don’t have a heart, just a lump of coal where that pumping, anxious beast should rest.And the taboo—what about that, the deviant, the sexual, the secrets? That’s another part of what makes Lindsay Hunter such a brilliant writer, her willingness to risk everything on the page, to say what we’re all thinking, to reveal those moments we’d prefer the world never saw. Here are two quick examples.The first is from “Plans,” where our female lead kisses a teacher, and steals a lipstick, just to see how it feels, to get that rush of adrenaline:“I wore that lipstick one night when we all met up to swim and it was so dark I let a boy take off my bottoms, the lipstick smeared and greasy all around my mouth and its crayon smell all over the boy, and then I put a ribbon on that lipstick and gave it to Momma for Christmas.”She likes to cross lines, break rules—stealing, kissing teachers, taking off her pants at the lake, the dirty lipstick now a gift to her mother? “Do you kiss your mother with that mouth?” you might ask. It seems that she does.And then there is “Me and Gin.” It’s a sweet story on the surface, but just under the bruised flesh is a dysfunctional childhood, parents that are damaged and absent, friendships that are anything but healthy. The opening lines:“Me and Gin play Lips. This a game where you see how long you can touch lips before you need to scream. Gin always the one screaming first, I guess not always, sometimes I scream first cause I don’t want to seem like no weird lips lover.Me and Gin’s both girls. See.”And no, I’m not giving you all of the juicy parts in this review, you’ll have to pick up the book and read it yourself.When I think of the rabbits in “Summer Massacre,” it immediately reminds me of “Emergency” by the aforementioned Denis Johnson. When I read the slick sex in the back seat of a car in “Three Things You Should Know About Peggy Paula,” I think of the previously cited Mary Gaitskill and the power struggle that is “Romantic Weekend.” When I pause to remember “Plans” and the final words of the boy hovering over our girl when she says, “I ain’t no bitch like your brother called me,” and he answers, as they finish their grunting and heaving, “Ain’t you, he said, ain’t you?” I’m transported to the heartbreak that is the final scene in “Life Expectancy” by Holly Goddard Jones. But whatever other voices flitter about you as you read Don’t Kiss Me, familiar dysfunction, dark roads you’ve been down before, know that Lindsay Hunter is an original, she is fearless, and she will always be a soothsayer—telling stories with heart, compassion, and authority."}, {"userName": "Kevin", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/142320-kevin", "userReview": "Another book of jaw-dropping fictions from Chicago's most loveable freakazoid. Sentences come at you so ruthless and broken glass-sharp. Hunter relishes in her characters' grossest utterances. There were times when I was reminded of the wild cut-up style of William S. Burroughs and other times when I was reminded of the unhinged fictions of Lidia Yuknavitch. But mostly, this is Lindsay Hunter, creating her own mad territories. And even though there were a few times when I felt like the work was hard to grasp, for the most part, my mind was blown, amazed, lit up, and scared."}, {"userName": "Blair", "userReviewDate": "Feb 22, 2015", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "There are some truly brilliant stories in this collection, but really it's more about the details than the whole. That goes for the stories themselves, as well as the style. The best - such as 'Three Things You Should Know About Peggy Paula', 'Plans' and 'Heart' - are short and broken-up snapshots of the lives of dysfunctional characters; weird, dirty and bleak, but really, really gorgeous anyway. The high-concept stories don't always work quite as well, partly because you're constantly being propelled back to the striking beauty and effectiveness of particular sentences rather than whatever they're skirting around. Occasionally, Hunter's depictions of everyday discomfort stray further into more explicit disgust and border on bizarro, for example 'After', which begins 'After the apocalypse...' and goes on to, mainly, list outlandishly grotesque sights.The showpiece story, the longest, is 'Our Man', which - seriously - reminded me of Roberto Bolaño's \nAntwerp\n, with its fragmentary and surreal narration, stray threads and recurring characters, its side-on, non-linear examination of an indistinct and possibly imagined crime. Like Antwerp, I wasn't sure whether it was nonsense or a work of genius, or, of course, both. A more general comparison for the whole collection is Amelia Gray's \nThreats\n - equally off-kilter and vaguely disturbing/disturbingly vague, with a similar overarching voice - although I enjoyed this more. I probably did this book a disservice by hungrily reading most of the stories at once. Mostly bite-sized - there are 26 of them in this 193-page collection - Hunter's stories are so sharp and bright that they are best devoured individually, spread out between other reading."}, {"userName": "Melanie", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/4093022-melanie", "userReview": "Reading the many reviews on GRs I imagined wild, damaged and grotesque characters challenging the reader to a point that sets you squarely in their desperate sights, where you can't help but be damaged and exhilarated along with them. To my disappointment I landed somewhere distant to that strange centre, a place far less exciting. On one hand there are a few 5 star gobsmackers, such as the opening short story (Dearest Peggy Paula) and the wondrous RV People, but there are also stories that fester in self loathing and whilst I don't mind the dark, there was too much ugly hate in it and more importantly, no human face to put on it. At times the prose had the succinct and succulent phonetics of great poetry (Catie Rosemurgy, Sharon Olds). Those moments stood alone but entirely out of place, like a peace offering at a slaughter. The bawdy laughs and heart wrenching milliseconds strewn about are just not enough to go on but with a writer with a story like Peggy Paula in her, I'm interested in what is next. 2.5 stars"}, {"userName": "Hannah ", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/1395653-hannah", "userReview": "One of the most well-written, funny-sad, beautifully disgusting books I have read this year. I loved every one of these short stories, which is rare. Each story is unique and Hunter's ability to write so convincingly from male/female/child/adult perspectives is amazing. Some of the stories reminded me of a darker, woman-writer version of writer/debutante Scott McClanahan. I think I have fallen in love with Lindsay Hunter.These were my favorite 'quotes' from DON'T KISS ME:\"Me wondering why they don't say nothing about a kiss being salty as a tear.\"\"...THE SUN MELTING LIKE THE DISCONTINUED PSYCHEDELIC SHERBERT LINE.\"\"The sky is pink meatblood, is a runny sorbet, the sun is a melting butterscotch, the sky is a dirty plate.\"\"Time is a thing that moves. We are not the ones moving.\"\"He wondered if things shimmered when she looked at them as they did for him. He wondered if she felt like her insides were on her outsides all the time like he did.\"\"Loneliness is a nightly death, bed a burial.\"\"It's me. You can be you. I've been honest and I'm being honest now. Blood is just as thick as we've heard. Blood doesn't cool if you admit relief. That rust-colored pump will throb on and on.\"\"How about: blood congeals and forms a skin. Or: our man's dying breath lasted fifteen seconds. This: we both love(d) you more than life itself.\"\"Dearest love, let me count the ways. Dismemberment, garroted, poisoned, drowned, named. I read that as soon as a species is named it begins its travels up the endangered list. Discovery meaning death.\"\"If the end of the world came...what? If the end of the world came...but he just felt tired. If the end of the world came, good night.\"\"...I ain't no delicate sunflower juddering in your grandma's vase...\""}, {"userName": "Pat Pujolas", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/6854690-pat-pujolas", "userReview": "This one was hit-or-miss for me, but in a grand slam-or-home run kind of way. Some of the stories here are perfectly devastating, while others felt technically flawed, when the author's own intelligence and insights conflicted with the stylized vernacular. Perhaps that's more of an editorial critique. There's no denying the author's mastery of language, her courageous choices, and her stark originality. Highly recommend. Be the first to tell your friends about this beautiful new voice in contemporary fiction."}, {"userName": "Eric Wojciechowski", "userReviewDate": "Aug 02, 2013", "userURL": "http://www.goodreads.com/user/show/7032663-eric-wojciechowski", "userReview": "There is journalling, where you brainstorm out your thoughts. No editing when it's done. There is staring into space, day dreaming, running through a list of thoughts, sometimes linking mostly not. To lay out that my eyes set on the red traffic light. Then noticed it was kinda hot pink, well with the sun in its position and all, flimsy bulb maybe, a guy with two coats and no shoes rides a bike right through it, causes on comers to hit their breaks, back end of a Volkswagon bounces up then back down again, a middle finger pushed in the direction of the daredevil, the daredevil completely unaware he's been a daredevil. The light is more red, I guess, not so much hot pink, the sky behind it is pink, rain is coming...This is what DON'T KISS ME reads like. Like a thought train captured on paper. There are more commas than periods. And more “Look! A Squirrel!” moments than concentrated observations. I loved it. There are rules in writing. Or, more like tried and true suggestions. But I love seeing them broken. If you can break them, you gotta do it like a boss. And Lindsay Hunter does such a good job with each of her stories. Some are all in capital letters with no punctuation. Some are one complete paragraph, thoughts separated by commas, and so forth. Rules broken and it all works.My favorite has got to be CANDLES. A woman describing her body type like a candle. Rattling on with a small, almost unnoticeable plot that she's into this guy named Julian. It's broken up by the worst case of ADD I've ever read, mixed with how scented candles really smell. Favorite line: There came a day when I ran out of class to barf up against the lockers, there was a baby for awhile but then it went away.” Comes out of no where.I dug each short story because they were honest, underbelly of a person stuff. No holds barred. While most were reflections on personal relationships and self-worth, LETA'S MUMMY was a very unique break. A story about a young girls pet mummy the family has no idea how to control.The final story in this volume, for which the entire collection borrows its name, DON'T KISS ME, has got to be the most honest, outrageous story of obsession that I've ever enjoyed. A great finisher to this collection.But what I came away with was an interest in Lindsay Hunter as a writer. I want to know how she writes. My imagination says she pounds away at a keyboard, letting loose a brainstorm of thoughts. In one take, the story is there. Because that's how each reads. And if she does manage to do this, that makes her rather exceptional. I wish to see more from Ms. Hunter. I'll be there buying a copy of her next work.And if I have yet to convince you that this collection of shorts deserves your time and the five stars that I grant it here, consider my favorite quote from the entire volume, one that made me pause and cry with all hilarity, from the story, OUR MAN: “The detective held his breath driving past the cemetery, pushing the panties in his mouth just short of gagging.” How can you not want to read that?"}, {"userName": "Christina Pauley", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/21795269-christina-pauley", "userReview": "All in all, I enjoyed these stories. The voice is very unique, and very real. Some of my favorites were \"Three Things You Should Know About Peggy Paula,\" \"Brenda's Kid,\" \"Leta's Mummy,\" \"Darren's Baby Girl,\" and the title story, \"Don't Kiss Me.\" I found these stories to be the most unique, enjoyable, and personally relatable.I do wish the book was a bit longer though--I finished it in about four hours. I also wish there had been a bit more of a variety in the stories; nearly every character had that 'Junie B. Jones, but vulgar' tone--uneducated, yet sassy. Also it seemed like every single character was fat and ugly, or at least considered themselves fat and ugly. There was plenty of variety in the situations and lives of the characters, yet sometimes it felt like it was the same person telling each story.I found this to be a quick, enjoyable read. I loved reading from the uncomfortable places that are the minds of sluts, drug addicts, and crazy people, with low self-esteem to boot. This was my first Lindsay Hunter book, and I plan on checking out her other titles."}, {"userName": "Keith", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/3011493-keith", "userReview": "Much like Frank Bill's Crimes in Southern Indiana: Stories and Alan Heathcock's Volt: Stories, the characters who populate Lindsey Hunter's second collection of short stories, Don't Kiss Me, are broken, intensely raw human beings existing along the fringes of America's heartland. Each story offers a brief glimpse into lives distorted by oddball obsessions and all too common abuses of trust. What I found most striking about these stories is Hunter's near stream of conscious style--which harkens to the styles of Hubert Selby, jr. and Dennis Johnson--that perfectly captures the mindset and base nature of her characters. But most of all, it's Hunter's wholly believable characters that make this collection such an intense reading experience. These men, women, and children are your wives and husbands, teachers, next door neighbors, your nieces and nephews; they are the ignored and the barely there."}, {"userName": "Matt", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/10709651-matt", "userReview": "There's so much to love about Lindsay Hunter's writing. I can honestly say she is uniquely her own. This collection showed me all she can do, in a way that even raised the fictive ante on 2010's Daddy's collection (and to be sure, that is a great book). I mean, she effectively renders a post-presidential Nixon. Cuts to a believable man beneath the veneer of evasion, traducing and undeniably effective politicking. Surreal elements abound and thread the narratives of very real living, breathing characters, whose vices and motives might not be entirely alien to us (even when their behavior and fantasies are). It's a real gem. It should be on your shelf sooner rather than later, if you ask me."}, {"userName": "Bert", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/5870798-bert", "userReview": "Hmm...i liked how bratty and potty-mouthed it was, it felt kinda cartoony and trailer-park glamourous like Lana Del Rey, which i dug, but on the back it says things like fearless and risky and 'most daring writer of any generation' and it would've been better if it didn't say that...Leta's Mummy was a good one, about this girl who gets her hand gnawed by a mummy 'At school ever since her hand got chewed up Leta is the shit. Girls be chewing they hands all through class to get em nice and mangled, and boys be offering up the high five and then saying, No, the other one, when Leta raises her good hand.' Heh."}, {"userName": "Drew", "userReviewDate": "Jun 24, 2013", "userURL": "http://www.goodreads.com/user/show/3679784-drew", "userReview": "This is a tough book to rate/describe – on the one hand, the technical ability on display is amazing. The way Hunter writes is immediate and potent and you can’t deny that. But I could imagine someone else – or even myself, at a different time or in a different place – reading these stories and being completely turned off by that ability instead of cautiously in awe of it. These stories are at times gross, sad, depressing, hilarious, frightening, confusing… but they’re all intensely refreshing. Take that as you will.More at RB: http://wp.me/pGVzJ-LB"}, {"userName": "Frankie Brown", "userReviewDate": "Jul 25, 2013", "userURL": "http://www.goodreads.com/user/show/18460397-frankie-brown", "userReview": "You'll read this collection of short stories with a combination of electrified intensity and mild disgust. At times it seems Hunter is assaulting the reader with the originality of her language and style, an assault that might make you recoil, until somewhere around page twenty you find yourself begging Hunter to hit you again."}, {"userName": "Alan", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/698826-alan", "userReview": "I loved 'Daddy's', one of my books of the year in 2010, so looking forward to this new collection, once again brought to my attention by the admirable Kevin Sampsell."}, {"userName": "David", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/1439856-david", "userReview": "I love the rawness in these stories. By raw, I don't mean the writing, which is definitely honed and crafted (particularly the amazing voices). I mean the rawness in the humanity of the characters, the urgency and the mashing of the normal/beautiful/disgusting. These are powerful stories."}, {"userName": "Nancy", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/10162654-nancy", "userReview": "Just could not get with the scatter-gun, disjointed style, the vernacular, nothing. Someone here suggested that if you read the first - 3 page - story and liked it, you would enjoy the rest. I wish I had read that before I chose it."}, {"userName": "Matt", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/306277-matt", "userReview": "This collection is a slow dance with words that can't be forgotten. Their weight grows by the day. After the first piece I could only say \"I feel crushed\" to explain my delight."}, {"userName": "Kennedy Dawn", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/44594825-kennedy-dawn", "userReview": "Such a great collection. Super quirky and imaginative. Definitely out of left field and is written to shock the audience! I loved this collection of short stories, refreshing in a dark, dirty way."}, {"userName": "Brooks", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/1651733-brooks", "userReview": "I interviewed Lindsay at the Tin House blog: http://www.tinhouse.com/blog/28456/te..."}, {"userName": "Jim", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/141982-jim", "userReview": "In your face, first person monologues from the sexually exploited underclass that somehow also manages to be mind-blowingly funny."}, {"userName": "Joseph Michael Owens", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/2644963-joseph-michael-owens", "userReview": "As if there was any question that this book would get 5 stars — incredible!"}, {"userName": "Erik", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/8535973-erik", "userReview": "This is the type of fiction and short stories I have been waiting for all my life. Not every story was a banger, but I tell you what, when they were, they hit hard. I'm so glad Pissed Jeans put her on a record. Moving on to her novel next. She makes me want to up my game. I know I should feel disgusted by this work, but I don't."}, {"userName": "Jameil", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/8364377-jameil", "userReview": "Well. I really did not like this book and would not have finished if it wasn’t for me just trying to get through it and meet my reading goal for the year. Even with that, it was a struggle. I like approximately two of the stories. Some I was indifferent to, others I hated. Too many fell into that last category."}, {"userName": "Joe", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/3223267-joe", "userReview": "If short stories are the punk rock of prose, then Lindsay Hunter's flash fiction is power violence: short, brutal, and visceral. The theme dominating all these stories is barf. Not for the faint of heart, but a thrill ride I would heartily recommend."}, {"userName": "Mitchell Sunderland", "userReviewDate": "Sep 03, 2017", "userURL": "http://www.goodreads.com/user/show/71049875-mitchell-sunderland", "userReview": "I have always wanted to read a short story collection where moving, complicated, funny characters interact in malls and Outback Steakhouses. This book does all that without ever being quirky. Everything reads as authentic and honest. A perfect read."}, {"userName": "Kathleen", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/21741708-kathleen", "userReview": "A few really interesting stories with just the right amount of grotesque and weird, but the majority were blah."}, {"userName": "Melanie Page", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/1519649-melanie-page", "userReview": "Even when I thought a character was in trouble or messed up, Hunter made the character appear surer than me, stronger than me. How did she do that?Some of Hunter’s strength came out in her ability to change one word and scare the crap out of me. The “we” (instead of “I”) from “RV People” become menacing. There are no individuals, only a mass that crashes in waves over newcomers to the RV. When “we” picks up a woman with a baby, “We take her baby from her, we pass it forward, we rock it in our arms.” Our arms removes the individual and turns people something monstrous, like a demon (or tarantula?). Perhaps “we” will feed upon this baby…but in a twist, “we” feeds upon the mother instead. The whole story felt like realizing there is a hair in your mouth…and finding that it is your hair…and then trying to pull it out and realizing you’ve swallowed most of it…and as your hair comes out of your throat, you find food still attached to the hair.Hunter’s voice was consistent despite changes in narrator, which made me curious, but the slow drawl of each voice and the use of bad grammar lulled me into a familiar place, one I thought filled with simple people. Hunter crafts characters who say things like, “They’s biscuits and jam and shit in the kitchen, help yeself.” But I never knew of what those simple folks were capable. I realized one young female character’s attitude reflects the direction in which Hunter’s stories go: “Just think something up and then do it. That’s all.” Just as the motto works for the young woman, it works with Hunter, too.One of the best stories, notably so for it’s style, voice, and it’s up and up and up anxiety-factor is “Birthday Luncheon.” One long run-on sentence, the story begins with the narrator’s brother’s pregnant girlfriend grinding on a food table and raises in intensity when we realize the guest of honor, the father of the narrator, is racist–in fact, vile. But in this very short piece, Hunter made me laugh, as if I were witness to this horrible cluster-fuck of a party. Imagine this: “…they was a pair, your daddy in his wheelchair and your step-aunt in her scooter, your brother told you they just rammed wheels and tallied that up as sex, the jostling was enough…” Hunter chooses her words carefully; notice how using incorrect subject/verb makes the tone of the piece read like chronic black-bottomed bare feet. There’s just something deliciously nasty there.Prepare to read Hunter’s collection with a bit of attitude before you get going. Prepare to walk over her words as if they are shards of glass. Prepare to get lost in the wilderness. Prepare to be unprepared."}, {"userName": "Dlvierck", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/26757907-dlvierck", "userReview": "I fell into love with Lindsay Hunter after I read the Rumpus (or Millions? [no, HTMLGiant?]) interview with her, and then read a few of her stories online. I got Daddy's and burned through it faster than I've ever read a book before in my life.When I tried to read it a second time, however, there was a lot of turbulence.Then Don't Kiss Me came out and I was looking forward to another firecracker enema, but instead found - mostly - the same gags taken for another time 'round the pole. She does a few things really well, and unfortunately she doesn't do much else (yet [I am committed to a lifetime of supporting Lindsay Hunter]).She uses first person so often, and so often therein she regurgitates an iteration of patented broken dialect, that the tactic loses considerable verve. And even though she's the BEST at conjuring up unique sensory images, it got to point that you knew one or two of those would show up in a story and they lost their punch, too.It should be said that these stories, presumably, came from the same situation as the stories in Daddy's, which is that Hunter head's an open mic/reading series called Shorty's. So that all the stories lean, to some extent, on shock value, is understandable.My favorite is the second to last story: Darren's Baby Girl, a first person girl-on-the-run vignette chuck full of 'I know what I'm doing' as opposed to 'I'm doing the best I can.'The word is that Lindsay Hunter is working on a novel next, and I'm on tenterhooks to see if she'll try to sustain a broken voice for a long narrative or if the different format will have her paving a different path from the heart/soul/bowel to the page."}, {"userName": "Tracy Robertson", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/5052989-tracy-robertson", "userReview": "A few of these stories had me talking back to my book, the way sports fans yell back at the TV. I'm reading and saying \"Are you serious?\" \"No way!\" How the characters came to life! My favorite story was probably \"My Boyfriend Del\". The character is a female pedophile, I think. Or is there a different word for an adult who has a love-obsession with a child where it isn't all about sex? In the lead story \"Don't Kiss Me\" the character is obviously very mentally ill. Ah, no one is as interesting as mentally ill people! Several of these stories left me wanting so much more. How did these people get this way? What happens to them later? Though Lindsay Hunter wrote a proper short story and didn't leave me hanging on the plot, I was still hungry for more. On the other hand, there were a few stories that I just couldn't get in to. I read the first two pages of \"Our Man\" and skipped the rest. It was written in a strange format as though it was supposed to be a play or something. In my opinion, the story \"After\" didn't fit well in this collection. It seemed like Science Fiction for middle school boys. That's why I couldn't give this collection 5 stars, but it definitely contains some 5 star stories. I'm generally not much of a re-reader and pass along most books after I finish, but \"Don't Kiss Me\" will take up permanent residence on my bookshelf so I can revisit some of my favorite stories later."}], "description": "An explosive story collection from a bold, blistering new voiceWith broken language, deep vernacular, unexpectedly fierce empathy, and a pace that’ll break your granny’s neck, Lindsay Hunter lures, cajoles, and wrenches readers into the wild world of Don’t Kiss Me. Here you’ll meet Peggy Paula, who works the late shift at Perkin’s and envies the popular girls who come in to eat french fries and brag about how far they let the boys get with them. You’ll meet a woman in her mid-thirties pining for her mean-spirited, abusive boyfriend, Del, a nine-year-old who is in no way her actual boyfriend. And just try to resist the noir story of a reluctant, Afrin-addled detective.  Self-loathing, self-loving, and otherwise trapped by their own dumb selves, these characters make one cringe-worthy mistake after another. But for each bone-headed move, Hunter delivers a surprising moment that chokes you up as you peer into what seemed like deep emptiness and discover a profound longing for human understanding. It’s the collision of these moments that make this a powerful, alive book. The stories of Don’t Kiss Me are united by Hunter’s singular voice and unflinching eye. By turns crass and tender, heartbreaking and devastatingly funny, her stories expose a world full of characters seemingly driven by desperation, but in the end, they’re the ones who get the last laugh. Hunter is at the forefront of the boldest, most provocative writers working now.", "title": "Don't Kiss Me: Stories", "url": "https://www.goodreads.com/book/show/16059557.Don_t_Kiss_Me_Stories", "average": 3.66, "cover": "https://images.gr-assets.com/books/1375931564l/16059557.jpg", "reviews": 85, "authors": [{"url": "https://www.goodreads.com/author/show/3369554.Lindsay_Hunter", "name": "Lindsay Hunter"}], "type": ["Short Stories", "Fiction", "Adult Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/16059557-don-t-kiss-me", "http://www.goodreads.com/book/show/16066917-don-t-kiss-me", "http://www.goodreads.com/book/show/19341325-don-t-kiss-me", "http://www.goodreads.com/book/show/20613663-ugly-girls", "http://www.goodreads.com/book/show/31450596-eat-only-when-you-re-hungry", "http://www.goodreads.com/book/show/7715816-daddy-s", "http://www.goodreads.com/book/show/19421772-three-things-you-should-know-about-peggy-paula", "http://www.goodreads.com/book/show/13552088-kitty"]}