{"ratings": 31, "userreviews": [{"userName": "Julia Wilson", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/29770295-julia-wilson", "userReview": "Donuts And Daydreams by Elizabeth Maddrey is another delightful contemporary Christian offering in the Baxter Family Bakery series. It is also part of the Arcadia Valley Romance series and is a wonderful warm read.Meeting up with familiar characters meant I felt right at home. People bond over food and there were some deliciously tempting moments.God is at the centre of lives. He longs to hear from us. Sometimes life is confusing and we have no words to say. We are \"trying to find the words to pray, thankful... that the Holy Spirit knew her [our] heart.\"At times there are no words, but we can turn our worship into prayer. \"Worship music... when she needed to pray but couldn't find the words.\"People and family are important. We need to have correct priorities and not be job focused and money driven. \"Take your time to sit on the porch and enjoy the people you love.\" We need to make time for the things that really matter.Life is not always easy but \"God doesn't promise us easy. He promises to walk beside us.\"We need to take care of the earth's resources. The Arcadia Valley series concentrates on local sustainability and is all for reducing the carbon footprint.Love hurts. Sometimes we wall up our heart but we need to begin to live again by trusting others and letting them in to our lives.The novel deals with divorce, infertility, adoption and premature birth. We never know what life will throw at us. We need God and good friends and family to get us through.I adore Elizabeth Maddrey's books. They are full of warmth, life lessons and relationships with God. Her books always leave me smiling and I cannot wait for her next book to tempt me. More please Elizabeth Maddrey.I received this book for free. A favourable review was not required and all views expressed are my own."}, {"userName": "Beth Erin", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/40899796-beth-erin", "userReview": "Full review on Faithfully BookishI am a big fan of family-centered series and the Baxter family has earned a special place in my reader heart! In this third and final installment, readers are treated to a storyline involving all the Baxter siblings and a couple of unexpected secondary characters as well.Jonah Baxter has thus far been the epitome of patiently impatient in love. Jonah isn't perfect and he honestly makes some boneheaded mistakes but he's faithful, loyal, and has a heart of gold.Gloria Sinclair has a secret and it's pretty huge. When her past unexpectedly impacts her present, the quiet life and relationships she has spent years building are suddenly strained. This series is one yummy romance after another and I highly recommend it! Although this series is part of the larger Arcadia Valley Romance collection, it can be read and enjoyed apart from the other series as well.I received a complimentary copy of this book from the publisher and was under no obligation to post a review. The opinions expressed are my own."}, {"userName": "Phyllis", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/20954624-phyllis", "userReview": "“Every good love story starts with a certain amount of stalking.”When Jonah decided to bring Kenia to Micah’s wedding, I wanted to yell, “You can’t do that!” From reading the previous books in the series, I knew that Jonah and Gloria belong together. Whatever Gloria’s secret was, it couldn’t be so bad it would keep them apart, right? Right?As with most of this author’s books, the story was a combination of humor, sweet romance and slightly uncomfortable situations that make me think about what the right thing to do is. She sprinkles Christian teachings throughout as a fine chef spices his food.Speaking of chefs, (like how I did that?) Jonah has been so fun to read about through this series. He is a talented chef and baker who loves to experiment with various flavors of donuts. He is kind and loyal, but certainly not perfect. Both he and Gloria needed to learn to be willing to talk instead of assuming things, and they both needed to learn to be vulnerable so they could be open to receiving God’s best for them.I think my favorite part of the story is where Gloria was in church and realized that she had never allowed herself to fully open up to God and trust Him.There was a part of her that wondered how much she held back from God the way she tried to hold pieces of her heart back from the people she loved.I love the way Elizabeth Maddrey ties the books in her series together, and yet allows them to each stand on their own. The Baxter Family Bakery series books are all by Elizabeth Maddrey and intertwine more closely than the Arcadia Valley Romance series and so for the fullest enjoyment, I recommend you read them all.This review was originally posted on Among the ReadsI would like to thank Elizabeth Maddrey for giving me this item. My opinion and review were not influenced by this gift."}, {"userName": "Margaret Nelson", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/32582749-margaret-nelson", "userReview": "Elizabeth Maddrey's final work in her share of the Arcadia Valley stories is well done. I'd love to read more about the Baxter family in the future, but she does wrap up a lot of loose ends. The story will keep you on the edge of your seat, with plot twists, miscommunications, plans that go awry, and so on. I'd wondered what Gloria's secret was, and I had not guessed it ahead of time! At one spot in the story, I quit reading for the night because I knew a plot twist was coming, and didn't want to read it just before bed. Well, there was a plot twist, but it was totally different than what I expected!"}, {"userName": "Lyndon", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/5730242-lyndon", "userReview": "Well-rounded conclusion to the Baxter Family series (set in the shared world of Arcadia Valley - 18 books by 6 different authors, including Maddrey's trilogy). Donuts & Daydreams weaves together a nice balance inspy romance elements - misdirection, comedy of errors, competing love interest, budding romance, tension/crisis, Christian themes, and of course a happily ever after resolution. If you lean at all toward clean romance, check out not only this set of Baxter bakery novels but the whole multi-author series."}, {"userName": "Renate", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/51444728-renate", "userReview": "A well crafted page turning romance with likable characters and setting, contemporary topics of premature births, infidelity, and hiding from an abusive spouse. Mouth watering bakery treats and restaurant entrees. Sad to see the Baxter Family Bakery Arcadia Valley Romances come to an end. Elizabeth Maddrey satisfactorily brings closure to her delightful bakery series. Each book can be read as a stand alone."}, {"userName": "Debbie", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/23009683-debbie", "userReview": "Gloria and Jonah’s story is truly wonderful. The author will have you on the edge of your seat waiting to see what happens next with these two. The characters in this story are very special people who you will love. God is working throughout this whole book. I had the honor to review this book for the author for a honest review. I would give this book a higher rating than a five star review if I could."}, {"userName": "Embgram", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/8213137-embgram", "userReview": "Love the Baxters!Elizabeth Jeffrey has another winner with Jonah's love story. I have thoroughly enjoyed reading about all of the Baxters finding the love of their lives. The paths they had to follow were bumpy, but the trials made the happy endings that much sweeter. Jonah and Gloria both needed to overcome challenges but became stronger in their personal lives as well as their faith."}, {"userName": "Debbie Clark", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5261235-debbie-clark", "userReview": "Loved Donuts & Daydreams!I am really loving The Baxter Family series. I have not necessarily been reading them in order, although it would be easier to put all of the pieces together. Each of the authors have been doing a great job! If you have not yet read any of the Arcadia Valley Romance books you are in for a real treat!"}, {"userName": "Marcia A.", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/59610377-marcia-a", "userReview": "I love this series! I have enjoyed reading about the siblings in this family. Gloria has been mentioned in all of the previous books. Finally getting to read her story, and find out why she kept herself from dating, was very satisfying."}, {"userName": "Linda", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/21026204-linda", "userReview": "I waited for this story in the series. Gloria and Jonah danced around each other for years. We, the readers, couldn't figure out why they didn't get together. And this is their story and we even find out why."}, {"userName": "D'anah", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/3792585-d-anah", "userReview": "Love the seriesLove the Baxters, every one of them. Have enjoyed every book with them in it. This one as well, just frustrated with Jonah, so slow on the uptake!! Enjoy the whole Arcadia series."}, {"userName": "Paula Marie", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/10734053-paula-marie", "userReview": "Finally Jonah and Gloria's story!!I am sad that the Baxter series has come to a conclusion, but so happy to see Jonah and Gloria have their story!"}, {"userName": "Diana", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/42667020-diana", "userReview": "Unusual coupleFun , sweet , unexpected romance. Two very different people are attracted to each other but have to work through a secret past."}, {"userName": "Wilani Wahl", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/17864113-wilani-wahl", "userReview": "Loved this story. I am sad to see this series end. I loved this family. The writing is great. The inspirational thread is wonderful."}, {"userName": "Linda Rainey", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/23269085-linda-rainey", "userReview": "A Beautiful RomanceWhat a beautiful romance,the last in the Baxter Family Bakery Series.I am happy we finally got to read Jonah's story and twists and turns as he finds love.I recommend this book for those that love Christian romance."}, {"userName": "Piepie", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/663327-piepie", "userReview": "I loved this yummy series about a quartet of siblings who run a bakery in Idaho. Full of love, faith, hope, and grace, these books are perfect for readers who love food and also love a happily ever after. Delicious!!"}], "description": "She has a secret. Telling him will tear their world apart. Everything in Gloria’s life was perfect, if boring, before Jonah Baxter moved to Arcadia Valley. Now their friendship—and the feelings that stretch the word’s boundaries—threatens everything she’s worked so carefully to build. Jonah has been drawn to police officer Gloria Sinclair since she began frequenting his family’s bakery three years ago, but every time he asks her out, she shoots him down. When she refuses to accompany him to his brother’s wedding, even as friends, Jonah vows to give up and move on. Watching Jonah date stabs Gloria to the core, but she isn’t free to fight for the man she loves. Can she clear the way for him to see beyond her devastating revelation, or will they be stuck with a relationship made of donuts and daydreams? Welcome to Arcadia Valley, Idaho, where a foodie culture and romance grow hand-in-hand. Join my friends and me as we release a book every month set in Arcadia Valley. You’ll enjoy meeting old friends and making new ones as each of the six authors’ books intertwine with the previous stories in this Christian romance series. Get started with Romance Grows in Arcadia Valley and follow along at Arcadia Valley Romance dot com to make sure you don’t miss any installments! Donuts & Daydreams is the third and finaly full-length novel in the Baxter Family Bakery series set in Arcadia Valley. It follows the novels, Cookies & Candlelight and Muffins & Moonbeams. The series begins with a novella, Loaves & Wishes, that was introduced in Arcadia Valley Book 1, Romance Grows in Arcadia Valley. Get your copy today to spend more time baking with the Baxter family.", "title": "Donuts & Daydreams: Baxter Family Bakery Book Three\n      \n          (Baxter Family Bakery #3)", "url": "http://www.goodreads.com/book/show/38103424-donuts-daydreams", "average": 4.61, "cover": "https://images.gr-assets.com/books/1516395524l/38103424.jpg", "reviews": 17, "authors": [{"url": "https://www.goodreads.com/author/show/6585434.Elizabeth_Maddrey", "name": "Elizabeth Maddrey"}, {"url": "https://www.goodreads.com/author/show/17094314.Arcadia_Valley", "name": "Arcadia Valley"}], "type": ["Christian Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/38103424-donuts-daydreams", "http://www.goodreads.com/book/show/16164189-wisdom-to-know", "http://www.goodreads.com/book/show/27858009-operation-mistletoe", "http://www.goodreads.com/book/show/23353716-kinsale-kisses", "http://www.goodreads.com/book/show/25003983-a-splash-of-substance", "http://www.goodreads.com/book/show/33855551-muffins-moonbeams"]}