{"ratings": 2140, "userreviews": [{"userName": "Michael Flanagan", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/3789573-michael-flanagan", "userReview": "This short story nestles itself between book 3 and 4 of the Zombie Fallout series and is a prequel to the series. As a reader I find that prequels can be fraught with risk and I often find myself asking questions like:Is this just a grab for some cash? If it is so important to the story the why not include it in the first book? Will it add any value to the story and series?Is this a result of lazy story development?What I got in this prequel was a valued pack story that not only added to the series but stood alone as a separate story. Mark Tufo has nodded his cap to his readership by adding some great tongue in cheek references to the series. The book tells the tale of the discovery of the virus that will one day bring the world to its knees and adds a tantalizing link and teaser to what is to come in the series. I for one want to know what the hell is in that suitcase.I always come away from Mr Tufo's books feeling greatly entertained and for some reason craving pop tarts. For those of you yet to sample what this author has to offer it's time you jump in with both feet and immerse yourself in his world."}, {"userName": "Katie Kenig", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/841891-katie-kenig", "userReview": "Oh, for heaven's sake.Alright, I know I said I was taking a break from this series because I was getting a bit burnt out on them, but since this was a prequel, I thought I'd give it a shot. I'm not particularly happy that I did.This short novella, tucked between books three and four of the series, gives some history of the virus that causes the Zombie Apocalypse in the Fallout series. It follows Dr. Hugh Mann (yes, it's really that ridiculous), a physicist around the turn of the 20th century, who discovers a tiny race of humans that are engaged in a full-out war with dust mites.I'm actually not kidding.Without the humour that peppers the other books in this series, I found this novella falling flat for me. The history was so outrageous, so impossible to quell the stirrings of \"Too far\" in my brain, that I couldn't turn on the suspension of disbelief that makes zombie novels so much fun to read. I feel like the author was trying to take things too seriously (beyond the name which was too punny for me). The fact that he was, additionally, supposed to be a family ancestor of the main characters in the series, and that he had met Tommy just pushed it too far for me.My brain snapped. I could almost hear it. I listened to this on audiobook, and it's short - about three hours - and it occupied me while I was doing housework. If I'd been reading this instead of listening, I wouldn't have made it through. If I hadn't had other things to occupy my thoughts as well while listening, I wouldn't have made it through. What was the author thinking? Just... why?Okay, usually I'm all about the in-between novellas in a series, but not here. Don't do it. Don't read it. If you are enjoying this series? Just keep reading the regular books. This is not worth three hours of your life. You can't get those hours back, man! Pet a cat or go for a walk or listen to some bad music instead. You'll thank me someday, I think."}, {"userName": "Rusty Duncan", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/3192771-rusty-duncan", "userReview": "wtf?Look, I have read a lot of zombie novels. A LOT of zombie novels, not all of which have (surprise) been Pulitzer material. Many were in dire need of an editor; some begged for a spell checker (c'mon folks it's 2014 for goodness sakes - press F7 at least once), while others took themselves way too seriously (Rambo Conquers the Zombies).What I love about these books so far is the generous infusion of sarcasm and humor that MT uses to bring his protagonist to life. I really did enjoy books 1-3.This is even though I'm not especially a fan of zombies with supernatural powers or sinister purposes. But I can tolerate this, for the 'greater good' of the novel/series - up to a point. See Monster Island series by David Wellington.Unfortunately, this prequel goes up to that point and skids out past the cliff's edge, like Wiley Coyote in a Roadrunner cartoon (cue the handheld sign - BYE - and the cloud of dust).So, after tolerating the sketch behavior of the zombies and other supernatural heavies in the first three books of this series, I now discover in this book that the entire premise of Zombie Fallout (its \"raison d'mortre\", if you will) is SO STUPID that I can't go on.I don't give up easily on books. It's part of my stubborn nature to soldier through many a lost literary cause, even if the forecast is for extensive crap starting at page five.Part of being a zombie hugger is the ability to 'drink the Kool-Aid', to join in the mantra \"I do believe in fairies - er, zombies - I do, I do, I do\". But I do not believe in fairies, and I do NOT believe in these zombies, Sam I Am. Not on a boat, not with a goat, and definitely not for another three books.Farewell Zombie Fallout - the fallout is permanent!"}, {"userName": "Vix", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/7521915-vix", "userReview": "am a massive fan of Mark Tufo so maybe a little bias in my review.... but this little novella in the story line is a wonderful little rounding out of certain characters... a great new twist in how Zombies are caused.....very clever really! really felt for all the characters as was charmed to read about the lovely Tommy always with humour... another great part of the magnificent ZF world"}, {"userName": "Unapologetic_Bookaholic", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/1125077-unapologetic-bookaholic", "userReview": "I was not disappointed with this book. It did not have the tone as the other books in the series had, but it was nice to get more background on the series as a whole. My opinion is if you're fan of the series and have read the whole series a couple times and want a little extra. Read this. I wouldn't say you're missing anything if you skip it."}, {"userName": "Annie", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "This is a great back story...I was confused at first...until the pieces started falling together...Now I know how it all started and I like it!!! If you have read the ZFO books you need to read this too...and all the unanswered questions will become clear...or at least most of them...lol Great little story!!!"}, {"userName": "AudioBookReviewer", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "Please find my review here: http://audiobookreviewer.com/Audioboo..."}, {"userName": "Jennifer", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/1578083-jennifer", "userReview": "I enjoyed having some history explained, BUT there were things in this that had me rolling my eyes."}, {"userName": "April Parrish", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/2203488-april-parrish", "userReview": "Miniature humans?!? Dust mites battling these miniature humans, really? I was in disbelief through most of this novella. The last part of the story is pretty good though which is why it got 2 stars. Also what is in that briefcase and how long will we have to wait to find out."}, {"userName": "Jessica Pratt", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/35565205-jessica-pratt", "userReview": "Good short story providing more background to the Zombie Fallout series."}, {"userName": "Shirley Shaffer", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/55048255-shirley-shaffer", "userReview": "The Virus has been unleashed. This book explains the origins of the virus. It is troubling how close to truth it is or could be."}, {"userName": "Crystal Marcela", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/7252224-crystal-marcela", "userReview": "Interesting...Even though it was a short book, it was very interesting. It left me wanting more. Reading this answered some questions the main book didn't."}, {"userName": "CJ", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/7106184-cj", "userReview": "Mark makes you want to go with Mike. Even through you know it's gonna go wrong. This was a cool look back at how it started."}, {"userName": "❤ArtfullySinful❤ ", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/37584317-artfullysinful", "userReview": "A gripping novella that describes how the dreaded zombie apocalypse came to be. Sr. Hugh Mann, a scientist back in the early 1900s was a man with a young daughter Marissa who be barely paid mind to. Marrying Jonathon Talbot a month prior, her father leaves a suitcase with them, them being unknown to the secrets kept within. Tommy, or Tomas faked selling pastries to gain access to their home in order to steal the suitcase and hide it for close to a decade. It wasn't until twelve years later, when Dr. Hugh Mann dies, does Tommy tell Marissa that locket she wore, belonged to his sister who would come after her to retrieve it, as well as return the suitcase the military was so armament of having.Then in late 1980s, scientists at area 51, began experiment on prisoners of war, like murders, child molesters and repeat. One subject, Named Sam, after receiving a swab, became infected immediately and bit a scientist in the room, infecting him as well. In order to contain it, the room was set a blaze.Lastly, in 2010, four men working for a senator of the United States, stole the H1N1 virus from a military base, planning on using power to start the apocalypse. What they didn't realise, that no vaccine, ment no body was safe."}, {"userName": "Jamey Goodyear", "userReviewDate": "Apr 11, 2016", "userURL": "http://www.goodreads.com/user/show/25337564-jamey-goodyear", "userReview": "Zombie Fallout 3.5 Dr. Hugh Mann is a short novella in the horror series Zombie Fallout by Mark Tufo. Dr. Hugh Mann is a scientist with a university in the early 1900’s. After the arrival of a new high-powered microscope, he discovers something amazing in a sample of blood. A big university fund raising events gets planned around this discovery and the discovery takes on a life of its own. In this story we meet Dr. Mann’s daughter who turns out to be Mike Talbots grandmother. And, of course, the military takes a disastrous interest in Dr. Mann’s discovery.I was very skeptical at the start of this story about how it would fit in with the series and why Mark Tufo had written it. However, with continued listening I decided the story is absolute genius and fits very well. Sean Runnette excellent reading enhances the story. If you are reading the Zombie Fallout Series, don’t skip this Volume 3.5. If you aren’t reading the series, but enjoy Zombie stories, you need to read this series. You won’t regret it. This is my favorite Zombie series. You will know why when you read it."}, {"userName": "Gryffin", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/7448449-gryffin", "userReview": "3.5 StarsWon from a Goodreads giveaway. Having not read the other Zombie Fallout books, I decided to read the prequel first. The few parts that were unexplained in this book I assume to be explained in the other books, but otherwise I could read this book without any difficulty. This book was short enough to read in one sitting, and was interesting enough to do so. I would probably recommend this book for somebody who already has read the previous books, considering there are certain things that might confuse somebody who hasn't read the other books. The one question I still have is how the human beings (\"Hugh Manns\") were actually created in the first place. I could not find that answer to that question in the book, though the explanation for that may be in later books.Overall, I would recommend this book for people with an interest in the series, but mainly those who have already read at least some books in the Zombie Fallout series."}, {"userName": "Linda", "userReviewDate": "Sep 05, 2011", "userURL": "http://www.goodreads.com/user/show/6213718-linda", "userReview": "*** An excellent addition to an excellent Series ***It's almost as if Mark gave us a present in releasing Dr. Hugh Mann. He must have known we were 'jonesing' for his writing. Thank you Mark! Although it's a prequel, if you're new to the series, read this AFTER book 3. This is from someone else's review of the ZF series, but I couldn't say it any better and thoroughly agree: Cumulatively, they are an epic apocalyptic tale, which reminded me of Steven King's The Stand and Robert McCammon's Swan Song. Elements of horror, paranormal, supernatural, and dark humor elevate this series beyond your typical zombie fare. These elements, along with Mike's quirky personality & fierce, protective love of his companions, make this series poignant and worth reading. Highly recommended. I am so excited for ZF 4 to arrive in October."}, {"userName": "Susu", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/5202097-susu", "userReview": "Wonderful story of the true origin of the zombie fallout. My reaction to this novella was like a slap to a hysterical person. At first I was like, 'Wait! Where is Mike, Tommy, Alex, Paul?' I even thought to myself 'Maybe I'll just skip the story and go right to the next book and come back to it.' Again my OCD comes into play preventing me from reading out of order.By the end of the book my thinking is more along the lines of 'Wow, I needed that'.Very interesting if not scarily realistic possibility of the virus' conception and utilization. And of course its nice to see that Tommy hasn't changed at all over the years.After this brief detour I am ready to jump back into the fallout and see where we go from here."}, {"userName": "Amanda Felix", "userReviewDate": "Mar 11, 2013", "userURL": "http://www.goodreads.com/user/show/17820136-amanda-felix", "userReview": "Well now we know what really started the ZF and how Michael Talbot gets involved. Dr. Hugh Mann is as arrogant and egotistical as a genius could be. However even his maniacal ego is brought down by his discovery. At first he is elated and wants to share the news then he realizes the mistake he has made when trying to confide in a fellow scientest. Every thing spirals down really fast after that. If you are a fan of the ZF series, you will enjoy this and it will give the reader a pleasant surprise as to how Michael Talbot is involved. Some of the history of how it all began is not surprising to me but it does connect the past to the present. I gave it 4 stars because I did find the ending a bit cliche and wished it had been longer."}, {"userName": "Joseph Barnes", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/5862806-joseph-barnes", "userReview": "This series reminded me of a combination of other books. This particular book is very short and is a prequel to the Zombie Fallout Series. If you liked \"The Path\" \"The Stand\" \"Swan Song\" and \"Autumn\" you will enjoy this series.The prequel was a little far fetched but then again the books I mentioned early were also. With the exception of Autumn. The other books had a supernatural twist to the stories. Of course Autumn does not. I read the first book in the series and then this one which whould actually be read after the 3rd book. But oh well. It was short and I read it all in one sitting. Check it out!"}, {"userName": "Sarah", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/10258995-sarah", "userReview": "Mark TufoZombie Fallout 3.5: Dr. Hugh MannThis was a sideways step from the Zombie Fallout Series a Prequel, it is the book I liked the least only because I missed the characters from the main series. This book explains how the horrors and evils in the main series came to be, therefore it has to be read as part of the set, it is only a short book and can be finished in a couple of hours. If you like the Zombie Fallout series then this is still a \"must read\"."}, {"userName": "Gadget Girl", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/23283946-gadget-girl", "userReview": "This is a short story in this Zombie Fallout novel series and it will fill in the blanks of how it all started; and for the best flow of the series needs to be read after book #3. A refreshing and original change to how all things zombie began, its set years before it all started and was so good I read it twice to make sure I got everything; as its a brilliant base to the whole series.Its a fascinating insight and yet another great set of characters to add to this zombie masterpiece series. We learn a bit more about the old Tommy and a taster to why Eliza is after Mike.If your loving this series its another must have read from the amazing library of Mark Tufo."}, {"userName": "Eric", "userReviewDate": "Jun 29, 2012", "userURL": "http://www.goodreads.com/user/show/10219196-eric", "userReview": "Although this is book 3.5 in a 4 book series,I went a little out of order and read this one first. I had heard it was the prequel and thought it would be a good place to start. a very interesting twist on where the concept of zombies come from. The authors ability to take a character such as the \"doctor\", and despite his shortcomings as a father and a member of society, make you understand his personality so he becomes likable is a talented skill he seems to use with ease. Even with characters that don't have large roles in the book, he makes you understand them.. A \"good read\" ;). I cant wait to read the other books now (in the proper order of course)."}, {"userName": "Ash", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/11719506-ash", "userReview": "This story was ridiculous. I had a feeling it would be because it seemed as if it would have to take a more serious, historical feel, and I was right. I enjoy the other Zombie Fallout books because they are humorous, and even though they are ridiculous as well (Eliza? Like, seriously, come on), they are still fun.This was just... Bad. It was bad. I guess it was kind of needed to clear up some story points mentioned in the first three books, but I somewhat think I would have been just fine skipping this one. But oh well! It was only $.99"}, {"userName": "Andrew", "userReviewDate": "Jan 29, 2014", "userURL": "http://www.goodreads.com/user/show/14294579-andrew", "userReview": "Read this after finishing Zombie Fallout 7. I think I appreciated it a little more then I would have if I had read it earlier. There were some spoilers for later books in the series.This book was more serious and dealt with information leading to the start of the zombie fallout. I missed the familiar characters and humor from the series, but still appreciated everything a learned as a fan.If you love the series, I would suggest reading it for the little tid bits of information it will have for you. If your so-so on the series, its probably a book you could do without then."}, {"userName": "Caridad cruz", "userReviewDate": "Dec 08, 2012", "userURL": "http://www.goodreads.com/user/show/5133919-caridad-cruz", "userReview": "i enjoyed the book because i knew that it had to do with how zombie fallout all started. i can better understand the zombie fallout book now. i was a little confused with 2 parts, one was the little boy tom who came bearing pastries,who hasn't aged a day old in over 10 years and has some kind of mystical powers, and his sister is a vampire, i am like what? really???? the other is the container that the thieves stole was the virus, and next to that, there was a vampirism container??????? i guess i have to find out in the zombie fallout series!!"}, {"userName": "T.D.", "userReviewDate": "Oct 24, 2012", "userURL": "http://www.goodreads.com/user/show/7942714-t-d", "userReview": "I enjoyed this book for the background information it gave but didn't enjoy this book as I have the others in the series. It is a very different book. It is by no means a bad book, just not what I was expecting ( when reading a series I don't tend to read the blurb beyond what order to read books in). Anyway, I liked this book, the characters were strong, the story interesting, the background intriguing but I wasn't blown away or transported like I am when reading the others in the series. It is very much worth reading before book 4."}, {"userName": "Melinda Lopez", "userReviewDate": "Feb 07, 2015", "userURL": "http://www.goodreads.com/user/show/22063396-melinda-lopez", "userReview": "This book was a little harder for me to follow along to but I don't regret buying it. I listened to it on audiobook rather than reading because I love Sean Runnette's work. He is a great narrator. It does give you a look into how the zombie apocalypse started but if you didn't read/listen to this one I don't think you would be lost or out of the loop. It's a book you can take or leave but either way it's entertaining."}, {"userName": "CJ Long", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/50161828-cj-long", "userReview": "Loved it.....I love that it filled in how the plague was created and why it wasn't fixed right away. Kind of missed following Mike but on to book 7."}, {"userName": "Stoxy001", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/21338875-stoxy001", "userReview": "not sure this warranted another book in the series. I understand the point of telling the story of 'how it all began', but why not stick this in the back of number 3 or the beginning of number 4? totally different in style to the first 3 books, but nice and easy to read.i've rated it 3 stars, much in line with how i've rated the first 3 books of the series. even though i'm enjoying the zombie fallout books, i'm still hoping it gets better in the next book cos it's too late to turn back now."}], "description": "Before there were zombies there was the virus.....", "title": "Dr. Hugh Mann\n      \n          (Zombie Fallout #3.5)", "url": "https://www.goodreads.com/book/show/25805557-dr-hugh-mann", "average": 3.96, "cover": "", "reviews": 100, "authors": [{"url": "https://www.goodreads.com/author/show/2990843.Mark_Tufo", "name": "Mark Tufo"}, {"url": "https://www.goodreads.com/author/show/3143450.Sean_Runnette", "name": "Sean Runnette"}], "type": ["Horror", "Horror", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25805557-dr-hugh-mann", "http://www.goodreads.com/book/show/12756432-dr-hugh-mann", "http://www.goodreads.com/book/show/11803203-dr-hugh-mann", "http://www.goodreads.com/book/show/15807294-dr-hugh-mann", "http://www.goodreads.com/book/show/15807337-dr-hugh-mann", "http://www.goodreads.com/book/show/21602328-dr-hugh-mann", "http://www.goodreads.com/book/show/15807360-dr-hugh-mann", "http://www.goodreads.com/book/show/8167001-zombie-fallout", "http://www.goodreads.com/book/show/15756383-a-plague-upon-your-family", "http://www.goodreads.com/book/show/10867262-the-end", "http://www.goodreads.com/book/show/12855784-the-end-has-come-and-gone", "http://www.goodreads.com/book/show/13506310-alive-in-a-dead-world"]}