{"ratings": 566877, "userreviews": [{"userName": "Manny", "userReviewDate": "Nov 20, 2008", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "There's a characteristically witty essay by Borges about a man who rewrites Don Quixote, many centuries after Cervantes. He publishes a novel with the same title, containing the same words in the same order. But, as Borges shows you, the different cultural context means it's a completely new book! What was once trite and commonplace is now daring and new, and vice versa. It just happens to look like Cervantes's masterpiece.Similarly, imagine the man who was brave or stupid enough to rewrite Dune in the early 21st century. Like many people who grew up in the 60s and 70s, I read the book in my early teens. What an amazing story! Those kick-ass Fremen! All those cool, weird-sounding names and expressions they use! (They even have a useful glossary in the back). The disgusting, corrupt, slimy Harkonnens - don't you just love to hate them! When former-aristo-turned-desert-guerilla-fighter Paul Muad'Dib rides in on a sandworm at the end to fight the evil Baron and his vicious, cruel nephew, of course you're cheering for him. Who the hell wouldn't be?So that was the Dune we know and love, but the man who rewrote it now would get a rather different reception. Oh my God! These Fremen, who obviously speak Arabic, live on a desert planet which supplies the Universe with melange, a commodity essential to the Galactic economy, and in particular to transport. Not a very subtle way to say \"oil\"! They are tough, uncompromising fighters, who are quite happy to use suicide bombing as a tactic. They're led by a charismatic former rich kid (OK, we get who you mean), who inspires them to rise up against the corrupt, degenerate... um, does he mean Westerners? Or only the US? And who is Baron Harkonnen intended to be? I'm racking my brains... Dubya doesn't quite seem to fit, but surely he means someone? Unless, of course, he's just a generic stereotype who stands for the immoral, sexually obsessed West. This is frightening. What did we do to make Frank al-Herbert hate us so much? You'd have people, not even necessarily right-wingers, appearing on TV to say that the book was dangerous, and should be banned: at the very least, it incites racial hatred, and openly encourages terrorism. But translations would sell brilliantly in Pakistan and Saudi Arabia, and a bad movie version would soon be made in Turkey.I honestly don't think Herbert meant any of that; but today, it's almost impossible not to wonder. If anyone reading this review is planning to rewrite The Tale of Benjamin Bunny, you'd better make sure you get your timing right. Who knows how it will be interpreted five years from now?"}, {"userName": "John Wiswell", "userReviewDate": "Jun 24, 2007", "userURL": "http://www.goodreads.com/user/show/147818-john-wiswell", "userReview": "No one should argue the importance Dune. It laid the foundations for a great deal of the themes and constructs in modern science fiction. Frank Herbert was as important to the genre as Isaac Asimov and Arthur Clarke. Unfortunately, just like them, he's quite dated, and his books can be a labor to read. One thing he maintained from old science fiction was prim and scientific dialogue that no one would ever actually speak. I've known many scientists, and they don't talk like this. You're not going to convince me a child does.The stuffy dialogue is inserted into even stuffier narrative, until it feels like nothing is organic about Herbert's prose. This is a terrible tragedy when you've got a world that he put so much effort into building - and it is an amazing feat of world-building, technically interplanetary building. But unlike J.R.R. Tolkien, who he is so frequently compared to, Herbert didn't make sure to include a great story in his world. Instead he included a story that frequently illustrated how clunky an artificial world can be, even if it's lovingly crafted. I struggled to attach or find interest in anyone, yet they're more archetypes than human beings, whose logic races past modern skepticism and whose dialogue is cloyingly artificial, the way people cared for the Hobbits, Dwarves and Rangers. In his world-building, Tolkien at least saved himself from being dated by antedating himself, and even with his illuminated prose, wrought more characteristics in just one protagonist than all of Dune's cast. Even the political intrigue Herbert tries to fall back on was overdone in the Spy genre decades before he started this book. All fans of the \"Genre\" genres should appreciate Herbert's massive contributions, but they shouldn't pretend to enjoy the books if they don't, and they should be wary of certain pitfalls typical of science fiction that survived into his landmark work."}, {"userName": "Rajat Ubhaykar", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/4686064-rajat-ubhaykar", "userReview": "In my head, the purpose of this review is very clear. It is to convince YOU to read this book. Yes, you! Waste time no more. Go grab a copy.Machiavellian intrigue, mythology, religion, politics, imperialism, environmentalism, the nature of power. All this set in a mind-boggling, frighteningly original world which Herbert ominously terms as an \"effort at prediction\". Dune had me hooked!First impressionThe very first stirring I felt upon opening the yellowed pages of Dune was that of stumbling upon an English translation of an ancient Arabic manuscript of undeniable power and potence which had an epic story to narrate. The tone was umistakably sombre and I realized Herbert was not here to merely entertain me, he was here to make me part of the legend of Muad'Dib. It was intriguing and challenging and heck, since I live for challenges I decided to take this one up too, gladly. The challenge was the complexity and depth of the plot, which left me perplexed, in the beginning. I knew there were dialogues which meant much more than their superficial meaning and was unable to grasp at it. I felt a yawning chasm between Herbert's vision and my limited understanding of it. However, of course, I plodded on and could feel the gap closing in with every page much to my joy and relief. The Foreword\"To the people whose labours go beyond ideas into the realm of 'real materials'- to the dry-land ecologists, wherever they may be, in whatever time they work, this effort at prediction is dedicated in humility and admiration.\" The foreword makes it pretty clear that Frank Herbert isn't kidding around. This is a serious effort at predicting how our world is going to look two thousand years from now and by God, it's a bloody good and detailed prediction. However, the real merit in this effort lies in the commentary on our lives in the present.Why Frank Herbert is a geniusThe setting of the book is arid futuristic. the plot is driven by political mindgames reminiscent of The Game of Thrones. The issues he tackles are as modern as the colour television. Herbert's genius manifests itself in his ability to combine the past, the present and the future in one sweeping elegant move called Dune.Plot and SettingDune is set in a futuristic technologically advanced world which after the Butlerian Jihad (the bloody war between Man and Machines) has eliminated all computers and passed a decree declaring \"Thou shalt not make a machine in the likeness of a man's mind\". Since there are no computers, the essential working of the galaxy is still medieval and feudal with heavy reliance on men and their dallying around. Lots of thriller potential right there. Men with superhuman analytical abilities called Mentats have taken the place of Computers. On the other hand, we have the Bene Gesserit, an ancient school of mental and physical training for female students (it gives them superhuman intuitive powers) who follow a selective breeding program which makes them feared and mistrusted through the Imperium. Their desired end product of this breeding program is the Kwisatz Haderach, a superman who’ll be able to glimpse into the future. How he’ll be able to do this is rooted in Herbert’s idea of determinism: given that one can observe everything and analyze everything, one can effectively glimpse the future in probabilistic terms. Quantum physics anyone? The Kwisatz Haderach is the proposed solution to the male-female dichotomy, between the analytical and intuitive.The plot of Dune is almost wholly set on the desert planet of Arrakis (also referred to as Dune), an arid wasteland where water is so scarce that men have to wear stillsuits which recycle human moisture for further consumption. The source of the galaxy’s interest in the planet is Melange, a spice which bestows upon one longevity and prescient powers. Everything on the planet is permeated with the spice, the air, the sand, the food. Everybody on the planet is hopelessly addicted to the spice, their only hope for survival being their continued intake of the spice. The Spacing Guild, the economic and trading monopolistic arm of the Galaxy badly needs the spice for interstellar transport. This is because their frigates travel faster than the speed of light and hence travel backward in time. The spice is the only way they can look into the future and see their way ahead. How cool is that! All the powers on the Galaxy are out to mine the spice, braving the sandworms, their name merely an euphemism, for they are gigantic 200 metre long creatures which always come digging through the sand whenever spice mining is undertook. Always. There’s also another little glitch. There exist on the planet, the kickass native desert tribal Fremen, whom the foreign powers look down with suspicion and disdain. The Fremen ethos is one of survival and scarcity, driven by tribalism and egalitarianism. Okay, I’ll stop right there. No more spoilers about this. Except that they value water to the extent that spitting on a person is the highest honour they can bestow upon him.Our protagonists are the Atreides family, consisting of the Duke, his Bene Gesserit concubine Jessica and their son Paul, who have been entrusted the stewardship of Arrakis. We discover the alien planet of Arrakis along with them, firstly with fear, suspicion and wonder and ultimately, love and respect. Paul Muad’Dib, however is no ordinary prince. There’s a teeny weeny chance he might be the Kwisatz Haderach, something which troubles him constantly and gives us our conflicted hero. The poor chap trips balls over the spice and has visions of black hordes pillaging and murdering around town bearing his flag and sees his dead body multiple times.My favourite character, however has to be the Baron Vladmir Harkonnen, the most evil character I’ve ever come across in my literary excursions. He is ruddy ruthlessness, he is virile villainy, he is truculent treachery. He executes the inept chess players in his employ which says oodles about his badassery and his fondness for cold-blooded logic. He sees everything in simplistic chess terms. What is my best move? What is my opponent’s best move? Is there anything I can do to completely squash his move? Is there a tactic which leads to mate in three? ThemesIn this setting, Herbert does so much, it’s unbelievable. Religion, politics, the dynamic nature of power, the effects of colonialism, our blatant destruction of our environment are themes which run parallel to the intensely exciting and labyrinthine plot. He shows the paramount importance of myth making and religion for power to sustain over long periods of time. Man, as a political animal is laid completely bare.Real lifeNow these are my thoughts about what Herbert could have meant to be Arrakis-It makes perfect sense. Herbert draws heavy inspiration for the religious ideology of Muad’Dib from Islam. He says “When religion and politics ride in the same cart and that cart is driven by a living Holy man, nothing can stand in the path of such a people.” which is the philosphy of the politics of Islam. Islamism in a nutshell. The spice, much desired by everyone, is the oil. Baron Vladmir Harkonnen is symblomatic of the wily Russians. The Desert foxes Fremen are representative of the native Saudi desert-dwelling Bedouin tribe who have a strongly tribe-oriented culture and undoubtedly value water in equal measure. And the ultimate loser is the environment.Why do good books get over?I almost forget this is a science fiction novel, it’s that real. It is also scary and prophetic. It is a reading experience that will leave you dreaming of the grave emptiness of Arrakis and make you wish you were there to brave it all in the privileged company of the noble Fremen. Frank Herbert achieves the pinnacle of what a sci-fi author aspires to rise to; authentic world building."}, {"userName": "Lyn", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Dune.No other single syllable means as much to the science fiction genre, a single word that conjures images of sandworms, spice wars, great battles between rival dynastic families and a massively detailed and intricately crafted universe. No wonder this is widely regarded as not just a Science Fiction masterpiece, but a literary achievement as well. Like a study of Shakespeare, the reader finds that this is an archetype upon which many influences and imitators have based their works. The complexity and depth of the creation is staggering and I am continually astounded at the discipline with which Herbert must have focused his imagination.This is the book upon which Herbert would base his greatest series and one that would outlive him as his son has continued to expand and add detail to the vast, immaculate tapestry woven by a true master of the genre. Encapsulating political, economic, sociological, biological, cultural and dynastic themes, Frank Herbert has set a high standard for later practitioners.Brilliant.***2015 reread - Read years later, this has lost none of its narrative power, if anything I can better appreciate the virtuoso attention to detail Herbert exhibited in his epic creation. From the perspective of having read his later 5 Dune sequels, I am astounded at the rich tapestry he has woven. Most impressive was his close omnipresence, analyzing the thoughts and minute actions and subtle nuances of his complicated dynamic interplay of characters. The exhaustive training of the Bene Gesserit and the intricate relations of the Houses and the Guild would stand as a monumental benchmark for speculative fiction ever since.This time around I found myself looking more closely at the Harkonnens and will likely read some of Brian Herbert's additions to his fathers great work"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Update: $1.99 on kindle US today 8-6-17I was so worried that I wouldn't understand a thing in this book. I will admit there are some things that went over my head but for the most part I figured it out. I remember a billion and 65 years ago I watched the movie and was like what the? Basically all I remember is Sting and sandworms. I would love to watch it again and see if I understand it more after reading the book. I'm still not sure what all the spices were about on Arrakis. I keep thinking it's like their farming like we would farm corn or tobacco, etc. I could be wrong and I didn't get the connection between the spice and the sandworms. Is it like a drug to them? I did read in the back of the book that is was like a drug when taken in small quantities and really addictive when taken in large quantities and that Muad'Did felt his prophesies were because of the spice. I liked Duke Leto and I hated that he was betrayed not long after they got to Arrakis. There is always some twat out there causing trouble. I really enjoyed Paul's character and his mother Jessica. They seemed like really strong people and adapted very well in everything they were put through. I didn't really pay too much attention to the other characters or I guess I should say I didn't have many thoughts about them. With the exception of the ones that betrayed them. I really enjoyed when Paul and Jessica had to travel to get away from the evil Baron Harkonnen before they were killed too. I don't know why, but I enjoyed their little journey. I think they were both great in their roles when they were found by the Freman and showed they were a force to be reckoned with. Now maybe I'm getting this all wrong but I'm trying to tell it through the way I saw it in my mind. I don't understand how Paul's sister, Alia, was an abomination. That one must have went over my head too. It might have had something to do with the poison Jessica took to become the Reverend Mother. I'm not sure but I know some of my goodreads friends that read this will get me sorted out =)Other than the sandworms and traitorous people on Arrakis, I was most freaked out by the thought of the water issue! I would NOT was to live somewhere there was a water shortage. And the part where they were talking about selling foot water, I can't even. Which basically means your stinky foot sweat! Overall I really liked the book. I enjoyed traipsing through this desert with Paul and his mother. Only in book form though, not in real life! Since they are doing re-makes of about a million different movies, I wish they would re-make this one because I think it would be really awesome! I would like to see this land come to life in today's time! I don't know if I'm going to continue with the series as I have heard this is the best one and the others get confusing. But I would like to see how Paul is as a ruler and what all happens to them, or maybe not depending on what all happens. If anyone can answer any of the things I was confused with that would be helpful =)Also, I have seen some pictures on here of this really cool Dune book with art in it. Does anyone have a link of where to get that book or is it still available? Thank you :-)MY BLOG: Melissa Martin's Reading List"}, {"userName": "Bookdragon Sean ", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I’m sort of tempted to try this again. I don’t think it’ll be worth the hassle though. I could never give Dune five stars because I really struggled to get into the novel in the beginning. It has taken me almost two months to read. This, for me, is a very long time to spend on a book. It took me so long to read because I found the writing style incredibly frustrating. I had to read whole chapters again so I could get the gist of the plot. This was more so in the beginning, which I found particularly hard to read because of the author’s way of shifting between the thoughts of multiple characters. I found this very annoying; however, I persevered over my initial despondency towards the writing, and plodded on through the book. I’m glad I did so because in the end I did come to really enjoy it. Indeed, the story is fantastic, but the writing will always remain unbearable for me.  A truly brilliant plot Dune is to science fiction what The Lord of the Rings is to high fantasy; it is the novel that officially, and unarguably, defines the genre. The story begins with the house of Atreides accepting the Dukedom of the planet Dune. The former Baron has been ousted by the Emperor, and is no longer of consequence. Well, that is how it initially appears. Very early on it revealed that the whole thing is a political ploy to bring the house of Atreides to its knees. The Baron lies in wait, and is ready to strike against the new, and benevolent, approach the Duke uses on the Fremen. The Fremen are the natives of the dessert planet; thus, they know how to survive its harshness above all others. They do this through their frugal approach to water. They value it above all else, and will never waste a drop in earnest. The Baron Harkonnen, as a chide against the natives, squanders water in the cruellest ways. He, and his dinner guests, throw cups of water on the floor of the dinner hall; it was his tradition. The wasted water was soaked up with towels, which the Baron allowed the Fremen to suck the water out of. When the Duke enters he rejects this custom, and is more respectful to the Fremen way of life. He and his son and heir Paul, who is the protagonist of this novel, go as far as to try the Fremen’s grossly effective water saving suits. These Stillsuits, quite literally, recycle all the water the body wastes and feeds it back to its wearer. The Fremen way is the right wayThis early familiarity, with the Fremen technology, no doubt helps to keep Paul’s mind open when he is later forced to live amongst the Fremen. Paul is somewhat of a marvel; he is prophecy’s chosen one. When he eventually gains the trust of the Fremen they allow him to choose a Fermen name. He calls himself after their most revered prophet: Muad'Dib. They accept this and follow him as their leader. His inherited title of Duke dictates that he is their lord, but their religion determines their real loyalty. He has to, quite literally, fight for every ounce of their trust. Indeed, it does not come cheap, and will only be given to one who is a member of their people. “Without change something sleeps inside us, and seldom awakens. The sleeper must awaken.”Thus, Paul becomes their saviour. Consequently, he receives heaps of character development through this book. He goes form boy to the revered leader of a nation. The Fremen, like Paul, want the evil Baron Harkonnen gone from their planet. They do no want a cruel oppressor who is ignorant to their ways: they want Paul. I think the imagination behind the Fremen culture really is wonderful. They have efficiently adapted to survive their harsh planet. To emphasise this point you need only look at the fact that off-world humans live in fear of the giant Sandworms that infect the planet whereas the Fremen ride them as a coming of age ritual. Indeed, Paul has to ride a worm if the Fremen are to follow him. Deep characters The result of this is a very complex, and intriguing plot. I found the first third of this book to be very perplexing initially. This is a world we are told about rather than shown at the start. We hear about the Fremen but do not truly understand them till the very end. I was very overwhelmed at the beginning, and in all honesty I do think this novel merits a re-read to further establish my understanding of it. This did affect my rating because it inhibited by enjoyment of the book. “Deep in the human unconscious is a pervasive need for a logical universe that makes sense. But the real universe is always one step beyond logic.”Indeed, aside from Paul there is a whole host of dynamic, and well rounded, characters. His mother is to be the new revered mother of the Fremen people, which for someone of her age is quite remarkable. There is also the captain of Duke Leto’s household guard who is a very deep and honourable individual. As much as I came to like these characters I was still frustrated with the writing of them in the beginning. I found it difficult to read scenes in which up to four characters internal thoughts are portrayed alongside their dialogue. It wasn’t always clear who was thinking. I much prefer a narrative that is focalised through one person. Well, at least one person per chapter. Overall, I thought the idea behind this novel was utterly fantastic. However, my personal reaction to the writing style limited my overall enjoyment of the book. I do intend to read some of the sequels. However, I do not have any intention of doing so in the near future. Maybe, in a couple of years I will return to the brilliant, and annoyingly written, world of Dune.Postscript: I thought |I’d show of some more pictures of my beautiful folio society edition of Dune. Also, all of the pictures (except the first) in my review are from the artwork in this edition. Enjoy!"}, {"userName": "Carol. ", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "I blame the movie.I was an avid but novice fantasy and sci-fi reader in 1984 when David Lynch’s Dune rolled out as a big-budget adaptation of the 1965 classic book. It was an artistic and box-office failure with Roger Ebert calling it “a real mess, an incomprehensible, ugly, unstructured, pointless excursion.” Numerous references were made to its excessive length, particularly a tv edition that was over 3 hours long. I never did pick up the classic sci-fi book, assuming the commentary heard about the movie applied to the book. All that changed when I broke my finger and found myself with a lot of extra time on my hands (groan).Besides, sandworms.Dune has a lot of ingredients that don’t fit into my preferred stories, yet the gestalt was not only tolerable, but engrossing. It begins with the Atreides family preparing to shift their holding from their current home to the planet of Arrakis. The Emperor has given the Atreides the territory and trade on the planet of Arrakis, formerly under control of their enemies, the Harkonnen. The planet Arrakis is hot, arid and generally hostile to life. There is, however, a small population of native, fierce Freman who have managed to build an existence in the desert.Paul Atreides is the young heir of the family, and mystical testing reveals he might be the one prophesied.Paul undergroes a rapid growth curve, facilitated by his teacher Dr. Yeuh and his father’s advisors.But it is in the desert that Paul will discover his strength as well as his new people.Seriously, now.Honestly, I have to wonder how much of this like is generational. If Sanderson or Rothfuss wrote this book, two chapters in Dune would have made a whole book, and while detail may have been added, it likely would have made for a book as slow as the movie. I liked the scope of Dune, and that there is a resolution to the initial conflict. It is also interesting that despite the volume of concepts packed in here, with political maneuvers, terraforming, technology, cultural assimilation, and mysticism all playing roles that I didn’t find it overwhelming, perhaps because so much is genre-familiar. On the downside, it could have perhaps used a bit more transitions, particularly near the end when months at a time are skipped. Writing was solid; nothing really stood out, but it told the story well. There’s some vague mysticism that might irritate those who like explanations. It was a bit of an eye-roller to have the chief villain be a fat, gay, sadistic pedophile, but Herbert really isn’t thinking outside the trope character box much (it’s not enough that he sentences people to death but he has to be physically abhorrent? And gay?). World-building is fun, but standard desert.Overall, I’m glad that I finally took the time to read it and put those old assumptions to rest. I love a good hero."}, {"userName": "J.G. Keely", "userReviewDate": "Jun 01, 2007", "userURL": "http://www.goodreads.com/user/show/84023-j-g-keely", "userReview": "People often forget that this series is what innovated our modern concept of science fiction (up until Neuromancer and The Martix, at least). Dune took the Space Opera and asked if it might be more than spandex, dildo-shaped rockets, and scantily-clad green women. Herbert created a vast and complex system of ancient spatial politics and peoples, then set them at one another's throats over land, money, and drugs.Dune is often said to relate to Sci Fi in the same way that Tolkien relates to Fantasy. I'd say that, as far as paradigm shift, this is widely true. Both entered genres generally filled with the odd, childish, and ridiculous and injected a literary sensibility which affected all subsequent authors.Few will challenge the importance of Star Wars' effect on film and storytelling in general, but without Dune, there would be no Star Wars. Princess Alia, the desert planet, the Spice, the Bene Gesserit, and Leto II all have direct descendants in the movies. It is unfortunate that Lucas seems to have forgotten in these later years that his best genius was pilfered from Herbert, Campbell, and Kurosawa.Though I have heard that the later books do not capture the same eclectic energy as the first, Dune itself is simply one of the most original and unusual pieces of Sci Fi ever written. Read it, Starship Troopers, Ringworld, Neuromancer, and Snowcrash and you'll know everything you need to about Sci Fi: that you want more."}, {"userName": "Bradley", "userReviewDate": "Mar 25, 2013", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Update 8/28/17Re-read. Number 13. :) I cry when Paul meets Gurney. I shiver when Jessica consoles Chani. I'm awestruck by the peaks and troughs of time, free-will, and the weakness in Paul even as he heroically strives against the evil that is about to be unleashed upon the universe. *sigh*Perfection. Easily the number one book I've ever read. :)I waver, sometimes, but right now, it is my absolute favorite. :)Original Review:This is a phenomenal classic of literature.It's not just science fiction. It transcends science fiction, as a fascinating discussion of free-will versus inevitability. Can the Jihad be denied? Can Paul ever really avoid his own death, despite seeing every time-line play out with him as the butt of every cosmic joke? Can even cruelty or mercy even remain comprehensible after such knowledge?Yes, I think this work outdoes Nietzsche. It certainly does a great job of making us care about the question.Is this all? Is this just a work that pays great justice to philosophy of action and inaction? Or is the novel merely a clever play at turning the Heisenberg Uncertainty Principle into the physical embodiment of a man? It is that, of course. The Kwisatz Haderach can be many places at once, and he can be both alive and dead at the same time just like that certain cat.Is the novel a coming of age tale, first set as a mirror against his father Leto, only then to mirror the whole universe that had just turned against him? Yes, of course. He was, after all, both the product of all his upbringing and his genes, embodying the question of nature versus nurture. He was taught within many schools of martial arts and assassins, as well as training the mind in both the schools of the Mentats with their pure logic and that of the mystics, the Bene Gesserit, that allows complete control over the body down to the cellular level. And if this training wasn't enough, he was deeply schooled in politics, leadership, and the meaning of loyalty. The boy was raised right. Of course, that is nothing without ninety generations of genetic bloodline tampering from the Bene Gesserit, right? To become the fulcrum between cellular memory, tapping the minds and lives of all your genetic ancestors as well as tapping the ability to fold time and space, to become the eye of a storm of time.What a damn brilliant setup for one tiny character, no? His training links to the unlocking of his genes and to the life-extending and enveloping spice, Melange, to make him not merely aware of time in a theoretical sense, but eventually to be unable to discern what was in the past, the present, or the future. Here's a true Super-Man, well beyond Nietzsche.And don't believe for one second that this serious discussion about what would make a superior man makes for dull reading. No. We've got PLOT that's probably some of the most exciting and visceral in all of literature, driving us right into the web of intrigue, vengeance, treachery, and galactic politics. To quote the text, we've got \"Plans within Plans,\" and it hardly stops there. We know the House Atreides is falling into a trap laid by the Emperor and House Harkonnen, and yet free-will and pride prevents any chance to avoid it. The setup is brilliant and extremely political, giving us character sketches of some of the most brilliant and memorable characters of all time.Duke Leto, the Red Duke, the most honorable and beloved leader.Duncan Idaho, the emotional and intuitive hero.Gurney Halleck, archetypal loyalist and troubadour.Lady Jessica, the woman who ought to have had all honor in life, but was unjustly reviled and set aside for political necessity. (Chani being both her mirror and her eventual glory.)And of course, my favorite character of all time, Paul Muad'dib Atreides, the one that would prevent the greater evils he foresaw, and went to enormous lengths and sacrifice to achieve, but who eventually failed in his task because even a god cannot overcome destiny. (Or the will of so many minds set as one.)So damn brilliant.Frank Herbert spent five years writing this treasure, working and reworking it until he published it at age 25. None of his other works come close to this masterpiece, and there's little wonder. It was birthed, fully-formed, like Athena from Zeus's head, with enormous forethought and care. The worldbuilding was just as carefully formed, from the ecology of Arrakis and the life-cycles of the sandworms, to the history and the creation of the Fremen from their mild beginnings as Zensunni Wanderers, adherents to the Orange Catholic Bible, to their history of oppression so like those of those who are Jewish, to their settling and hardening of their bodies and souls in the wastes of Arrakis, also just like the Jewish who carved out a place for themselves in Israel. (Current politics aside, this was a very potent idea before 1965 when Herbert wrote this, and indeed, the core is still just as powerful when you turn it back to Muslims.)The Galactic culture is rich and detailed. The CHOAM economic consortium, with their monopoly on space travel and their need for the Spice to allow them to see a short period into the future to plot a safe course before folding space. The Empire is caught on a knife's edge between a single power and every other House who sit in the possibility of putting aside all their squabbles for the sole purpose of checking the Emperor, if they so desired. (And Duke Atreides was such a possible popular leader among all the Great Houses, which was the primary reason the Emperor wanted him dead.) And of course, we have our Villains. The Baron Harkonnen has always been a crowd pleaser. Brilliant in his own right, devious and able to corrupt anyone with just the right sorts of pressure, including a certain absolutely trustworthy doctor we might mention.\"The Tooth! The Tooth!\" -- You can't handle the Tooth!Feyd Rautha Harkonnen is especially interesting for the question of nature versus nurture.The Bene Gesserit had intended him to mate with Paul, who should have been Leto and Jessica's daughter, and that offspring should have been the cumulation of ninety years of a breeding experiment to recreate the Kwisatz Haderach which had come about almost by accident during the Butlerian Jihad in the deep past, to overthrow the AI overlords.He was practically Paul's genetic twin, or at least, his potential to be the \"One who can be many places at once\" was on par with Paul. But instead of fulfilling the kind of destiny that we get with Paul, we see him grow up under the auspices of his Uncle the Baron, becoming as cruel and devious as he was deadly. He was the argument of nurture in the conversation, of course, and having so very little of it eventually cost him his life.I often wonder about the directions that Dune could have taken, all those little paths in time and circumstance that could have been. What if Feyd had been brought to Arrakis earlier and overwhelmed with Spice the way that Paul had? Sure, he wouldn't have been able to convert the unconscious changes into conscious manipulation, but he might have had enough glimpses of the future, the way that the Fremen did, to have given him the edge he would have needed to kill Paul.And then there's a relatively minor character, Hasimir Fenring, the Emperor's personal assassin, who was nearly the Kwisatz Haderach, himself. Unable to breed true, he was still potent enough to be completely hidden to Paul's time-sight in the same way that Paul was hidden from the Spacing Guild's weaker time-sight. His training as a skilled killer was also superior to Paul. He was, by all the hints and tricks in the tale, Paul's perfect downfall. It always gives me shivers to think about, and it was only in a single instant of both recognition and pity from Paul that stayed Fenring from killing our hero. It was just a moment of whim.The setup was gorgeous. Paul's pity, had it been missing at his moment of greatest triumph over the Emperor, would have meant Paul's assured death. I still wonder, to this day, what stayed Frank Herbert's hand from killing his most wonderful darling. We knew the pressure of religion and politics was going to have its way upon all the oppressed peoples of Dune. The return of a monstrous religious Jihad was going to happen one way or another, sweeping across the galaxy and toppling the Empire, regardless of Paul's frantic plans and desires. Paul's own death would only mean a higher level of fanaticism, and Frank Herbert's warning against unreasoning devotion would have been made even clearer with Paul's death.Perhaps it was pity that stayed his hand. Who are we to say who lives and who dies?If you really think this review is overlong, then I apologize, but please understand that I could absolutely go on and on much longer than this. It is a symptom of my devotion to this most brilliant of all tales.And yes, it still holds up very, very well after twelve reads. I am quite shocked and amazed."}, {"userName": "Petrik", "userReviewDate": "Nov 10, 2017", "userURL": "http://www.goodreads.com/user/show/59458347-petrik", "userReview": "3.5/5 StarsDune oh Dune, seems like I need to raise my Shield Wall for this review.Dune is one of the most important pieces of literature for the Sci-Fi genre. I’ve been raking my brain for hours on how to properly explain the importance of Dune in the sci-fi literature but you know what? I dune (hehehe) think it’s necessary for me to do so. If you truly wanna know why, you can search it on whatever search engine you use and you'll find hundreds of articles or reviews on why this book is that important; and they’ll do a much better job than me. I won’t even deny any of them because, in my opinion, this book was truly revolutionary. Dune didn’t become the number one highest selling Sci-fi novel of all time for no reason; like Brian Herbert said, it is to Sci-Fi, what the LOTR trilogy is to fantasy.Theoretically, if I’m reviewing this by putting my head as someone from 1960’s or 1970’s, I know I would think of this book as my bible. 1965 was the year when Dune was published for the first time, 24 years before I was born. There are just too many groundbreaking ideas, world-building, that would become the inspirations for many Sci-fi in our time; I only realized this after reading this book. I mean, the gigantic Sandworm alone has inspired many video games to use it as a common monster or enemy. Picture: Dune by Marc SimonettiDesert planet, Stillsuits, space exploration, and Zen Buddhism, Dune was truly a groundbreaking novel, almost everything in this book somehow seems prophetic because it has predicted our current society, especially when it comes to faith, emotional control, empathy, and the importance of ecology and scarcity.\n\n“The mind commands the body and it obeys. The mind orders itself and meets resistance.”\n\nPart of what made this book was great for me was Herbert’s prose. I haven’t read enough classic to claim it was classical, but Herbert’s prose was definitely unique to me. It has a lot of freedom by writing it from a limited omniscient narrative; changing POV’s repeatedly in a single chapter without any warning. This is, honestly, one of my biggest pet peeves in my usual read, but Herbert made it work because all his characters were really well written, distinct in their personality, and the dialogues are really well dune (HEHEHE). Plus, there are so many motivational and extremely philosophical quotes that seem to make this book a combination of Sci-Fi & self-help book, such as:\n\n“It is so shocking to find out how many people do not believe that they can learn, and how many more believe learning to be difficult.”\n\nAnd of course, the most famous and one of the best quote I’ve ever read out of any book\n\n“I must not fear. Fear is the mind-killer. Fear is the little-death that brings total obliteration. I will face my fear. I will permit it to pass over me and through me. And when it has gone past I will turn the inner eye to see its path. Where the fear has gone there will be nothing. Only I will remain.”\n\nI can’t believe I have gone through life without knowing about this litany against fear. It’s applicable in any kind of hardship we faced in real life, and I know it will be one of my motto starting from now. If I’m judging this book solely from how significant this book was, I’ll give it maximum score in a heartbeat. However, I’m reviewing this based on one question and how I rated all the books I read: was it enjoyable?The answer is yes and no, it was a mixed bag. The first part of this book was incredible, I couldn’t put down the book and everything was so interesting and compelling. Then comes the second part, where the pacing just became really draggy and somehow, boring. However, my hope was restored for a while during the third act, until the anti-climax happened. My expectation is obviously at fault here but hey, this book is the number one highest selling sci-fi book of all time and one of the most highly acclaimed book, I expected there to be a mind-blowing climax sequences to close the book in an epic way. But no, there wasn’t any. Not only it felt anti-climactic, Herbert’s prose in describing settings and actions didn’t age well or up to current standard. The main reason for this is that this is a book that relies heavily on character’s dialogues to do everything; world-building, plot, characterizations were done solely through dialogues. This leads to the great plot but weak action sequences and no vivid settings. Sure there was some explanation on the settings, but other than the planet—which is just a desert, just search Sahara or Planet Tatooine and voila—the interiors were given only brief description, which makes it hard to imagine; I had to look up some artworks to be able to immerse myself in the settings of the book.Overall, Dune was truly a revolutionary book for its time that is filled with tons of imaginative and fantastic ideas. Although there were some parts that disappointed me, I still liked the book and I finally understand why there are so much discussion and praises around this book. I recommend this to every Sci-fi fans for its importance and also, it’s good to know where most fantastic Sci-Fi you’ve read or you’re reading now got its idea from. However, this is also where I’ll stop with the series.You can find this and the rest of my Adult Epic/High Fantasy & Sci-Fi reviews at BookNest"}, {"userName": "Kemper", "userReviewDate": "Jul 02, 2008", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "I have to write this review without rhythm so that it won’t attract a worm.In the distant future Arrakis is a hellhole desert planet where anyone who doesn’t die of thirst will probably be eaten by one of the giant sandworms. It’s also the only place where the precious spice melange can be found so it’s incredibly valuable, and the honorable Duke Leto Atreides has been ordered by the Padishah Emperor to take over control of Arrakis from his mortal enemies, the House Harkonnen. While this seems like a great offer on the surface the Duke and his people realize that it’s actually a cunning trap being set by the Emperor and Baron Harkonnen. The only hope seems to be allying with the local populace called Fremen whose harsh environment has led them to become an incredibly tough and disciplined people, but they have their own vision of what Arrakis should be. They also have a prophecy about the coming of a messiah figure who will lead them to freedom, and the Duke’s son Paul looks like he may be exactly who they’ve been waiting for.This is classic sci-fi that really deserves the label. What Frank Herbert accomplished in one novel is stunning because he built a fascinatingly detailed universe in which the politics, religion, economics, espionage, and military strategy are all equally important. He then blended these more grounded concepts with bigger sci-fi ideas like being able to use spice to see through space-time, and the scope of that encompasses trying to pick the proper path through various potential timelines as well as free will vs. fate. I think one of the factors that helps this story stay timeless is that so much of it is based on what humanity becomes vs. trying to predict what futuristic technology would be like. This is a society that once had a war with machines and has since rejected any type of computers so people have developed to fill the gap with the help of the spice. The Mentats are trained to use data to predict outcomes. The Navigators of the Guild have used so much of the spice to help them move through space that they’re mutating. The all female Bene Gesserit have developed a variety of skills to place their members alongside positions of power to help advance their breeding scheme that spans generations. Herbert also cleverly came up with an excuse that explains why knives and hand-to-hand combat are so important with the idea of the personal body shields. So even though we still got a good sci-fi’s novel worth of cool gadgets the emphasis is on what the people can do and how that’s developed over a long period of time. It also adds a lot of depth to the political dimensions because all of these groups have different agendas that cause them all to mistrust each other, but because they all fill these various roles none can exist with the others.There are also parallels to our world that are still in play because the idea of a desert people caught up in the power struggles of various outsiders because of their valuable natural resource is an obvious allegory to the Middle East that still works today. Plus, the classic film Lawrence of Arabia came out a few years before Herbert published this, and you have to think that it had some influence on him because there are elements of the story that seem very much inspired by it.While the whole concept of a Chosen One has gotten a bit worn over time that’s not Herbert’s fault, and this is still a fantastic sci-fi story with big ideas that also works as space opera as well as being an epic adventure story."}, {"userName": "Matt", "userReviewDate": "Jun 02, 2008", "userURL": "http://www.goodreads.com/user/show/1205220-matt", "userReview": "Like most of my five star books, I’ve read Dune multiple times. In fact, I’d say that what makes a book more than just enjoyable and instead truly amazing is that you want to read it more than once and are rewarded for doing so. I’ve probably read Dune six times, and I’ve never gotten tired of it but my understanding of the work has increased over time.To begin with, the first time I read Dune, I got about three pages into it, realized I didn’t understand a thing and that I was hopelessly confused. I had to go back and reread what I had read, and then go back again and reread the whole chapter. I would excuse myself by saying that I was 10, but I’m sure I’m not the only one that has had that experience. Don’t be dismayed if it happens to you - whether 10, 18, or 45. If you are confused at first, consider that Paul is also confused and finds so much that happens strange and new. Understanding will come in its proper time.At one time at least, there was a fairly famous website (at least among geeks) that humorously summarized books in thirty words or less. Maybe it still exists, but its name escapes me. The summary provided for Dune read something like this, “I’m Frank Herbert and I’m a lot smarter than you are.” When I was younger, this would have seemed a fair appraisal of the work. One of the most central aspects of ‘Dune’ is Herbert manages to write convincingly about people whose intelligence is supposed to vastly exceed that of the reader. More than anything, to create a believable Messianic story, the writer has to create a Messiah possessing believable Messianic wisdom and insight, and Herbert succeeds at this invention probably better than any other writer. We come to believe that the protagonists do have deep and profound insight into the question of ‘Life, the Universe, and Everything’ so that we do not immediately feel cheated and we are able to believe in the characters – even someone like Maud’Dib. As I’ve gotten older, and hopefully wiser, I’ve come to see that Herbert is not in fact possessed of superhuman intelligence, but that he creates the illusion of superhuman intelligence by a variety of clever devices. The appearance of a superhuman intelligence and wisdom is really a sham and the pool is really pretty shallow, but even this revelation does not reduce the esteem in which I hold the work. It’s not Herbert’s real job to be a prophet: he’s an artist. Herbert succeeds brilliantly in what he should be judged on – the ability to paint the illusion deftly and convincingly. If we acquire the sophistication to see through it, it shouldn’t reduce our appreciation of the artistic mastery used in creating it. I think now I would amend the summary of the work to be, “I’m Frank Herbert, and I’m a lot better writer than you are.”If all that could be said in Dune’s favor was that it had one of the most convincing invented prophets in literature, it would still be a worthwhile work. But Dune has abundant pleasures beyond the richly realized illusion of philosophical depth and even the deftly realized setting. Chief among these for me is the truly deep and intricate relationships Paul has with the other characters. There is a real depth of feeling here, and I love the way each of the complicated nuanced relationships is portrayed as we are introduced to the cast of Paul’s complicated life. Each character feels a deep mixture of feelings for Paul who is boy, man, friend, soldier, sovereign, and Messiah and much else. There is tenderness to this work. We sense that complexity and tenderness right from the start, when his mother allows him to be tortured and to face murder, and then immediately thereafter experiences profound hope and joy: “My son lives.” We feel Paul’s boyish love for his friends and companions, who are also his father’s henchmen and his teachers and who he is in turn their future Lord. We feel the more mature manly love that these companions have for their young charge and future ruler. Even Yueh loves the boy he must destroy. We feel the boyish admiration Paul has for his father as he strains to be worthy of him and to make his father proud, and we feel the returned pride and satisfaction that his father feels. We feel the aching love of a boy for this Mother when he has already lost everything else when Jessica is buried in sand, and we feel her returned love when she says, “I knew you would find me.”And though there love is only briefly on stage, still I find the love between Paul and Chani among the sweetest and most charming in literature. Who cannot thrill when scarcely knowing each other, but seeing their lives together stretching out before them both good and terrible, the young becoming but not yet lovers promise with tender vows nonetheless to be forever each other's comfort and joy and they feel their hitherto unseen future becoming a real solid now. Isn’t that how it is in some way for all of us when we meet the one who will be the one and we suddenly realize we want to and we will spend the rest of our lives together regardless of what will happen? And how often have we felt the total unabashed joy as Paul does when we know our lover is now near?“That could only mean Chani was near by—Chani, his soul, Chani his sihaya, sweet as the desert spring, Chani up from the palmaries of the deep south.”All that and ‘Dune’ is a wonderful exciting action adventure story filled with thrills and chases, fights and battles, and supersized edge of our imagination wonders. Worms.It’s no wonder that this is one of the best beloved books of all time. If you haven’t read it, you should. If you have read it, read it again."}, {"userName": "Matthew Quann", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/22699228-matthew-quann", "userReview": "I’ve been sitting at this keyboard for longer than I care to admit trying to coalesce my thoughts about Dune into something coherent. You already know it’s fantastic though, right? Dune is one of those novels that is spoken of in reverential tones by seasoned reader and relative newbie alike. It’s considered by many to be THE best sci-fi novel of all time and Herbert’s son, Brian Herbert, rightfully calls it sci-fi’s equivalent to Lord of the Rings for inspiring all that came after its publication. So, I mean, what in the name of Shai-Hulud am I supposed to add to that?Well, I’ll begin with the story of how I came to read Dune. I’m sure that there have been ample opportunities to read the book. I can remember seeing the black-spine amidst a forest of other spines on my cousin’s bookshelf, of which I had free reign. Yet something always kept me from picking it up. It could have been my obsession with fantasy novels at that time with only the briefest allowances for sci-fi. Whatever the reason, the book continued to pop up. Its sliver of desert on a black background called to me from piles at used bookstores, the shelves of friends and relatives, and even on public transportation. All the same, I never got around to it.Two factors finally made the difference. The first, my well-read friend (Josh Bragg in real life, but he’s on Goodreads too!) always brought it up as one of the best books he’s ever read. He also took the opportunity to remind me to read it whenever book recommendations went flying between us and, foolishly, I kept putting him off. But I’m a sucked for a great looking book and these Penguin Galaxy sci-fi collections sealed the deal for me. Their elegant cover designs, the intros by Neil Gaiman, a selection of books I’d always been meaning to read, AND Dune was on it? I was absolutely delighted to find the book under the tree on Christmas morning and tore into it in earnest. THE TIME HAD FINALLY COMEThough it took near 200 pages to really pick up speed, the novel had me hooked from its immersive opening. Here was a world that was familiar and strange at the same time. There are elements of fantasy and religion coupled with interplanetary travel and space empires. The characters touted titles that were inscrutable at the beginning, but became part of my vocabulary before the novel’s end. The novel refused to tell me everything I needed to understand, secreting mysteries without ever outright stating them. How could I not want to know what Kwisatz Haderach meant? How could I not want to know the secrets of Arrakis? The Layers of DuneI was swept away by this novel that mixes sci-fi concepts of higher dimensions with political intrigue. Environmental change mixed with an unlimited cast of enthralling characters, and a drop of religious philosophy. Dune is a novel of the highest order: it combines entertainment with brilliant questions that pull from an incredible number of disciplines. Of course, if you just want to read a compelling tale of political plotting, murder, adventure, and discovery, you can totally do that too.In the afterword, Brian Herbert notes a conversation he had with his father about the writing and structure of Dune. Frank Herbert constructed Dune so that it would be immensely dense. Herbert wanted to create a tale that could be enjoyed on the level of the central conflict: a boy becoming a man trying to reclaim his heritage against astounding odds in a world beyond imagining. Here’s an excerpt from that afterword about the layers.Ecology is the most obvious layer, but alongside that are politics, religion, philosophy, history, human evolution, and even poetry. (Pages 693 of the Penguin Galaxy Edition) The fact that the novel can be enjoyed from any number of different readings alone makes it a novel of huge significance. Dune doesn’t force you into thinking, but it invites the interested to partake in its rich metaphor and multifaceted meaning. What’s more, Herbert makes statements about his concepts, but rarely does he offer them as the only solution (barring, perhaps, an ecological viewpoint that bemoans industrialization). I dove into different fields of thought between and during readings. I contemplated elegant ideas Herbert proposes and marveled at the structure of the plot and the boundless ideas of this world.What a world it is! The world building here could fill a university course as Herbert establishes a world unlike any other, but totally believable. When I read about the stillsuit I was astonished by its creativity, but also how it imparted valuable information about the world of Arrakis. Though the sandworms scream for attention throughout the novel, equal care is given to the hierarchy of the Empire, the mystical Bene Gesserit religion, and the curiosities of culture. Herbert also seems to have invented a group of hallucinogenic compounds that are in equal parts trippy, interesting, and betray an interesting look at 1960s culture.Dune drew me in and took me for a ride that I never wanted to get off.Of course, when the ride does end, it is immensely satisfying. Dune ends leaving unanswered questions in a fashion that made me feel like I knew enough to be entirely contented. Which, of course, begs the question: will I read the other Dune novels? Welllllllllllllllll, maybe. It’s highly daunting to look at the entire Dune Chronicles and think that I would tackle that. Especially when Dune ends in a way that makes me so happy, and especially when the subsequent novels purportedly deliver diminishing returns. For now, I’m too overjoyed and impressed by Dune to consider returning to the world anytime soon other than to re-read the novel.Obviously, I can’t recommend Dune enough. That’s also not a recommendation that goes to the sci-fi crowd alone. Oh no, this is a book that has great appeal to a wide variety of people. You like A Song of Ice and Fire? Perfect: you’ll love the backstabbing, the plots-within-plots, the combat, the story. You don’t read sci-fi? No worries: there’s a wealth of important themes upon which to reflect. You like sci-fi, your friends continuously recommend you read Dune, and you keep putting it off?Goodreadians, I think you know what you need to do!"}, {"userName": "Luffy", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/7407364-luffy", "userReview": "This science fiction book was scary. The story set very far into the future has no prudence in it. This is a possible scenario. When I read this book, I was affected by this dark and dismal future.Sure, the book is sometimes like an adventure. But a lot of it has to do with politics. There is a struggle to control the only planet (Arrakis) which has the spice melange in it. The French noun mélange means mixture. Melange practically makes a superhuman out of a mere man.I was drawn into the story from early on. Sometimes one can know that the entire book one is reading is bad or not. Dune is like the lightning captured in a bottle. Books like this happen once in a generation. A 5 star book once again. Fully deserved."}, {"userName": "Joe Valdez", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "I can't explain what attracted me to Dune--the 1965 science fiction epic by Frank Herbert, winner of the first Nebula Award and (in a tie, with This Immortal by Roger Zelazny) the Hugo Award--any better than T.E. Lawrence could explain what attracted him to the Arabian Peninsula. The book's prestige among genre fans was a factor, as were admissions by many that they read it in junior high school and found Herbert accessible. As inclined as I am towards local coffeeshops, perhaps Herbert's head space while writing the novel in Santa Rosa, California from 1959-1965 appealed to me most. I could almost smell the incense burning.The galactic intrigue begins in the year 10,191 with excerpts from writings by the Princess Irulan, daughter of the Padishah Emperor Shaddam IV and a holder of literary pretensions. The princess offers some perspective at the beginning of each chapter, hipping the reader to what's happening behind the scenes. We're introduced to Paul Atreides, the 15-year-old heir of Duke Leto Atredies, a charismatic planetary governor of Caladan whose popularity among the noble houses of the universe has garnered the attention, and jealously, of the emperor. Setting a trap, he offers Leto the planet of Arrakis, the most valuable real estate in the universe.Arrakis is inhospitable to all but titanic-sized sandworms and a fierce tribe of desert dwellers known as the Fremen, but produces the priceless spice melange. In a future where mankind no longer relies on computers, the spice is a transformative agent that expands consciousness: empowering the navigators of the Spacing Guild who travel through space, the savvy Mentats who advise heads of state and the bewitching Reverend Mothers of the Bene Gesserit sect who see the future. Leaving their ancestral home on the verdant Caladan for Arrakis with Paul is his mother, the Lady Jessica, the duke's concubine and a Bene Gesserit, who is a black sheep among the Reverend Mothers.Thus spoke St. Alia-of-the-Knife: \"The Reverend Mother must combine the seductive wiles of a courtesan with the untouchable majesty of a virgin goddess, holding these attributes in tension so long as the powers of her youth endure. For when youth and beauty have gone, she will find that the place-between, once occupied by tension, has become a wellspring of cunning and resourcefulness.\" -- FROM \"MUAD'DIB, FAMILY COMMENTARIES\" BY THE PRINCESS IRULANOn moving day, Paul is visited by the Reverend Mother Gaius Helen Mohiam, Jessica's teacher, for a rite of passage and a test. The old crone confronts Jessica, who defied the Bene Gesserit order that she bear a daughter the sect intended to marry off to Feyd-Rautha, heir to the House Harkonnen, the industrious enemies of House Atredies. The Bene Gesserit believed the progeny of such a pairing would have produced the Kwisatz Haderach, a male with the power to see through space and time as they do. Jessica opted to bear Duke Leto the boy he wanted instead. The Reverend Mother sees some potential in Paul, but offers no hope his father will live to an old age. Paul's education is overseen by his father's advisors--Thufir Hawat (a Mentat), the troubadour-warrior Gurney Halleck, the swordmaster Duncan Idaho and Dr. Wellington Yueh--but mostly by the Lady Jessica, who has trained her son in Bene Gesserit meditative techniques. Arriving in the garrison town of Arrakeen, Jessica encounters a housekeeper named the Shadout Mapes who is full of Fremen superstitions, intrigued as to whether Jessica may be the One, mother to the messiah who their prophecy holds will lead their people out of slavery. After Paul saves the housekeeper's life from a Harkonnen booby trap intended for him, she confides to the boy that there is a traitor among them.Duke Leto forges an alliance with the Fremen, using imperial planetolgist Liet Kynes--who's gone native on Arrakis--as a liaison. Operating with the blessing of the Emperor and the assistance of his Sardaukur troops, the gluttonous Baron Vladimir Harkonnen and his Mentat, Piter De Vries, attack Arrakeen after the traitor in the House Atredies lowers the garrison's shields for them. The Baron exiles the Lady Jessica and Paul so he can claim plausible deniability in their deaths, but mother and son find refuge with the Fremen, with the tribe's revered leader Stilgar and Kynes' daughter, Chani. Paul learns of the prophecy of Muad'Dib, the desert mouse, who the Fremen hold as their messiah. Muad'Dib could indeed see the Future, but you must understand the limits of his power. Think of sight. You have eyes, yet cannot see without light. If you are on the floor of a valley, you cannot see beyond your valley. Just so, Muad'Dib could not always choose to look across the mysterious terrain. He tells us that a single obscure decision of prophecy, perhaps the choice of one word over another, could change the entire aspect of the future. He tells us \"The vision of time is broad, but when you pass through it, time becomes a narrow door.\" And always, he fought the temptation to choose a clear, safe course, warning \"That path leads ever down into stagnation.\" -- FROM \"ARRAKIS AWAKENING\" BY THE PRINCESS IRULANDune held me for over 616 of the paperback's 794 pages (appendixes, a map and an afterword by Brian Hebert stretch this edition to 883 pages) and in spite of its headlong dive into anticlimax, distilling the novel's pleasures have reminded me of what a fantastic trip it is. What separates Dune from the work of most of Herbert's peers is the finesse of its prose and the depth of its characters as well as its ideas, which in a novel of this size, are plenty. Rather than write a novel in six sleepless nights as many before and since have done in this genre, Herbert took six years to research and write his science fiction, and the quality control shows.Names like \"Beast\" Rabban or Count Hasimir Fenrig materialized to form clear images of Herbert's characters in my mind, and I liked how each of them--whether noble, assassin or servant--served their institutions and played their part in this galactic intrigue to their end. No one in Dune remains static; there is work to be done or movement to be had at all times. The novel is like a chess game and the faster it plunged toward its climax, these characters did begin to resemble game tokens instead of humans. Herbert also writes entrances much better than he does exits--a symptom of book one in a series, perhaps--but envisions a wealth of roles for women in his universe.Dune is science fiction and if you're in the market for having your imagination stretched, you came to the right place. I found Herbert's ideas to be vastly compelling, many of them explored in detail and at length with fluid prose, as if the author were an anthropologist reporting back on a real universe: A future where expanded consciousness is more powerful than any machine. A matriarchal religious sect steering the genetic future of mankind. A consciousness expanding spice exploited as a commodity. A planet so arid that special suits are required to retain the body's moisture and tears are a phenomenon. There's even song verse! \"This was a song of a friend of mine,\" Paul said. \"I expect he's dead now, Gurney is. He called it his evensong.\"The troop grew still, listening as Paul's voice lifted in a sweet boy tenor with the baliset tinkling and strumming beneath it:\"This clear time of seeing embers--A gold-bright sun's lost in first dusk.What frenzied senses, desp'rate muskAre consort of rememb'ring.\"Jessica felt the verbal music in her breast--pagan and charged with sounds that made her suddenly and intensely aware of herself, feeling her own body and its needs. She listened with a tense stillness.“Night’s pearl-censered requi-em …’Tis for us!What joys run, then—Bright in your eyes—What flower-spangled amoresPull at our hearts …What flower-spangled amoresFill our desires.”And Jessica heard the after-stillness that hummed in the air with the last note. Why does my son sing a love song to that girl-child? she asked herself. She felt an abrupt fear. She could sense life flowing around her and she had no grasp of its reins. Why did he choose that song? she wondered. The instincts are true sometimes. Why did he do this?After several abandoned attempts to adapt Dune to film, particularly in the wake of Star Wars, a big screen version produced by Raffaella De Laurentiis and written and directed by David Lynch opened in December 1984. Notable today for being the first big budget motion picture produced by a woman (with a production price tag of $40 million) and a rare studio assignment from the visionary who'd give the world Blue Velvet and Twin Peaks, the film was a commercial disappointment and was nearly universally panned by critics, but has resurfaced as a cult movie. Shot in Mexico, the eclectic cast featured Kyle MacLachlan as Paul, Francesca Annis as Jessica, Jürgen Prochnow as Duke Leto, Freddie Jones as Thufir Hawat, Patrick Stewart as Gurney Halleck, Richard Jordan as Duncan Idaho, Dean Stockwell as Yueh, Kenneth McMillan as Baron Harkonnen, Brad Dourif as Piter De Vries, Sting as Feyd-Rautha, Linda Hunt as Shadout Mapes, Max Von Sydow as Dr. Kynes, Everett McGill as Stilgar, Sean Young as Chani and Virginia Madsen as Princess Irulan. Herbert's ideas are evocatively translated, but Lynch's commitment to imagery over story is an acquired taste."}, {"userName": "Terry ", "userReviewDate": "Jul 14, 2008", "userURL": "http://www.goodreads.com/user/show/1262683-terry", "userReview": "[ Duncan Idaho  (hide spoiler)]"}, {"userName": "Markus", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/26681101-markus", "userReview": "Buddy re-read with Athena!“To begin your study of the life of Muad'Dib, then, take care that you first place him in his time: born in the 57th year of the Padishah Emperor, Shaddam IV. And take the most special care that you locate Muad'Dib in his place: the planet Arrakis. Do not be deceived by the fact that he was born on Caladan and lived his first fifteen years there. Arrakis, the planet known as Dune, is forever his place.”Thus begins one of the greatest novels ever written.About ten years ago, when I was ten or eleven years old, I took my first cautious steps away from children’s and young adult books and into the wonderful world of adult literature. I remember that there were especially two grand works of fiction that shaped this period of my life, and eventually managed to change it forever. The first was a huge brick of a fantasy novel whose name was The Lord of the Rings. The second was a rather small, blue book with a particularly interesting cover, which I discovered in one of my father’s bookshelves. Its name was Dune.And that was how I first came along on the adventures of Paul-Muad’Dib on the endless sands of Arrakis. I met people like the warmaster Gurney Halleck and the swordmaster Duncan Idaho, the aging assassin Thufir Hawat, the wise and powerful Lady Jessica of the Bene Gesserit, the disgustingly evil Baron Vladimir Harkonnen, and the stunningly beautiful Princess Irulan. I encountered the greatest of the sandworms in the deep desert, and I witnessed Muad’Dib as he lived amongst the mysterious blue-eyed Fremen and as he struggled and fought against those who betrayed his family.Now, ten years later, I have read the book once more. And to my great satisfaction I discovered that it had lost none of the magic that worked so well on me the first time. The political machinations of the Great Houses and the Imperium were still as interesting and exciting as the first time. The sandworms were still as awe-inspiring as when I last read about them. And even though the book could not possibly have the same effect on me today as it had on that little boy ten years ago, it was still an amazingly enjoyable book from the first page until the very end. There was more than a fair bit of nostalgia involved when it came to settling on a final rating, and I find it likely that the rating would have been lower if I were reading this for the first time. Still, I would argue that Dune is not only one of my personal favourites, but one of the absolute best examples of fictional literature ever. It has become a pillar on which dozens of later works now stand, from Star Wars to the Wheel of Time. What is it that makes this book so great? My answer would be neither the story nor the characters, even though both of those are great. No, the most extraordinary aspect about this book is most certainly its setting. In contrast to a great majority of science fiction, this novel takes place almost exclusively on one single planet. Arrakis. Dune. Desert planet. This is the world that inspired Tatooine. This is the world on which House Atreides fights for its survival in the heart of a treacherous universe. And, last but not least, this is the world where the sandworms roam. The world of the shai-hulud.\n”History is written on the sands of Arrakis.\""}, {"userName": "Trish", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/3461034-trish", "userReview": "[their first-born son they've lost (hide spoiler)]"}, {"userName": "Apatt", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/2457095-apatt", "userReview": "Does the world need another Dune review? I very much doubt it needs mine but that never stopped me before, saturation be damned!Dune in and of itself, in isolation from the rest of the numerous other Dune books, is by general consensus the greatest sci-fi novel of all time. You may not agree, and one book can not please everybody but statistically Dune comes closest to achieving just this. Witness how often you see it at or near the top of all-time best sf books lists.I never read Dune with the intent to reviewing it before, it makes for a more attentive and actually more enjoyable reading experience. When I first read it in my early teens I did not really appreciate it, I thought it was good but overrated. There are just too much depth for my young mind to handle. I got the gist of the story just fine but the richness of the novel completely escaped me.What makes Dune superior to most sf books is the quality of the world building. Frank Herbert went into painstaking details of Arrakis without ever bogging down the story. During the main body of the novel (excluding the appendices) he did not once resort to making info dumps. How many modern day sf authors can do that? Still, world building alone can not possibly account for the legendary status of the book. Herbert places equal emphasis on the characterization, plot and prose. The book is full of memorable characters from the badass Lady Jessica, to Paul Atreides who starts off as a fairly generic Luke Skywalkerish “chosen one” kid to a messianic figure always ready with a sage comment for every occasion. The villains are even more colorful, especially the super-sized Baron Vladimir Harkonnen, so fat he needs anti gravity devices to help support his girth (cue worthless yo papa so fat he needs suspensors jokes). And his psychotic nephew Feyd-Rautha who is a ruthless natural born killer and seems kind of gay for some reason. When I read it as a young lad the book seemed very long, but by today’s gigantic epic sf/f books standard Dune’s 896 pages length does not seems like much of a challenge if you take into account almost 100 pages of appendices and glossary. It is a highly readable and accessible book that transports the reader to a very vividly realized place. If you are looking for a bit of escapism you can not beat reading Dune for the first time.That's enough review I think, I just want to make a few random observations for people who are familiar with this book (more than half the people who read this review imagine):- Most memorable scene for me is the “Gom Jabbar” test where Paul Atreides has his humanity tested by the Reverend Mother. What is yours?- I love the little quotes from all those Muad'Dib books by the Princess Irulan. How many are there? Is there a “Muad'Dib’s Cookery Without Water” or perhaps a Muad'Dib popup book for the kids?- The stillsuits are great, I want one!- What is with all the “ah-h-h” business most (lesser) writers make do with an \"ah!\" or an \"aha!\". Are the characters having orgasms?- Don’t skip the appendices, they are well worth reading.- Last but not least, do check out Dune - Book Summary & Analysis by Thug Notes on Youtube, preferably after you have finished Dune; it's funny, insightful and informative. Come to think of it, if you are having any difficulty getting through Dune you may want to watch this."}, {"userName": "Alexa", "userReviewDate": "May 12, 2014", "userURL": "http://www.goodreads.com/user/show/17295220-alexa", "userReview": "Welcome to Unpopular Review Time! Where I go against what almost everyone else says about a book.Before we start, please do not be fooled by the three star rating. Even if I didn't like really like the book, I have to acknowledge there are reasons why Dune is a cornerstone of the Sci Fi genre. Now, let's talk about the important stuff.This is a masterpiece of world building.We get a new planet, and while it's obvious that Herbert based his desert planet on real sights and cultures, it's still awesome. The Fremen and their culture, the stillsuits, the worms, the plight for water... It's all explained in such a vivid detail without being boring or repetitive. And while reading you can see the references! Can we talk about how many movies and books have been influenced by this?We also get a future Empire where machines are no longer used for computation purposes. Instead, humans have been trained to unlock their full brain potential and make such calculations. And we get two schools of these \"enhanced\" humans: the Bene Gesserit and the Mentats. And we get lots of details explaining this new society: the Empire, the Noble Houses, the Guild, how each group interacts with the others, the intrigue surrounding all dealings... The plot is straightforward and follows a 'Chosen One' pattern. Paul, is the 'Chosen One', the Lisan al-Gaib, the Kwisatz Haderach. He gets many names. After a betrayal, he finds refuge among the Fremen and seeks revenge from those who wronged his house. Here comes my first problem with the book, you can divide it in a before and after around the betrayal point. (I'm not spoiling anything by telling you this, believe me, the book will tell you ALL about it) Before this the plot drags along at a slow and unpleasant pace (at least for me.) The story is told in a third person omniscient point of view, and the author uses this liberally, giving us a peek into the different characters' thoughts. And he loves repeating ideas. So we get to know about the betrayal from the bad guy who planned it, from the traitor himself, from everyone inside House Atreides who knows that there's a traitor and suspects everyone,... and all this before anything actually happens! When the scene finally rolls in I was so tired of the plot I almost gave up on the book.After this the plot actually picks up and there's lots of action. However I had some more problems with it, as I'll explain ahead.While they were all artfully created and developed; there's no way to connect with any of these characters.The way Herbert planned his 'Chosen One' and his society, most of the characters are deeply logical and, dare I say, stuffy? They think and re-think, and plan and plot, and think again, computing everything with a very small dose of humanity. (Ha! And they call themselves humans.) Paul is wise beyond his years, not only by his training, but by his evolution during the story. It made me think of another chosen child: Harry Potter, but where we all wanted to be Harry, or at least one of his friends; I really had no thought of befriending this one. (I did pity him a lot.)And then there's the bad guy! Oh Gods. I've never in my life seen such a TERRIBLE antagonist and I don't say this lightly. He's a fat ugly guy, who cannot even move himself. He's a pedophile, a slave worker, treats everyone horribly including his own family. There is absolutely no redeeming quality to this guy. He's almost cartoonish in how bad he is. And I never ever got his hate for the Atreides, I can understand greed, personal vendettas, house wars. But his hate seemed too personal and at the same time too huge to be understandable. Also, he was the typical movie villain that loved to rehash his plots over and over again, and brag about how cunning he was. Complete freaking waste of time.Last, but not least. The ending is incredibly abrupt and I DID NOT like it. Call me romantic, call me naive, call me soft. I don't care. I thought that last paragraph was the wrong thing to say. All in all this was a great book, but it wasn't my cup of tea. I suggest you read it. If only so you can see Star Wars in a pretty different light. ---Image Credits'The Defeat of the Sarduakar' by John Schoenherr.\"Fremen of Dune\" by Sammy Hall \"Vladimir Harkonnen\" by a-hour"}, {"userName": "Evgeny", "userReviewDate": "Sep 05, 2012", "userURL": "http://www.goodreads.com/user/show/9340136-evgeny", "userReview": "This is a classic science fiction book with both movies and miniseries adaptations, so I assume the majority of the people are familiar with the plot which means I will be a little less careful about giving spoilers than usual.In the distant future the humanity is ruled by an intergalactic feudal Empire - is absolute monarchy the best the humanity could come up with after all its history? Anyway, Duke Leto Atreides accepts control of a desert planet called Arrakis (aka Dune) which also happened to be the only source of some substance called spice which importance is slowly revealed in the course of the book. By the way the reasons for this duty and its acceptance are at best murky to begin with and they are never explained and become even more unclear down the road.Dune used to be a stronghold and the major source of wealth of Duke's sworn enemy Baron Vladimir Harkonnen who actually somehow managed to arrange the whole thing to finally deal a mortal blow to the Duke.And so the story begins. I just barely scratch the surface of it as it deals with a lot of intrigues, politics, religion issues, secret societies, survival on the planet which never saw a single drop of rain and where the wealth is counted in the amount of water owned. The most importantly, this is a story about the danger of creating a hero prophet.The book was originally published in 1965 and it does show its age, especially in the light of countless other books it inspired with the quality of the latter ranging from really pale imitations to great pieces of literature in their own way. I would not even call it a work of science fiction in the modern definition of the world. A relatively new term \"sword and planet\" would be a better genre description for it.I already mentioned the inspirations and imitations of the book. The reason for them is a very detailed world which looks completely unlike ours, yet is so similar to it. More importantly, it feels alive with its own landscapes, culture, religion, people, their rivalries and friendships. The worldbuilding is top-notch easily holding its own against undisputed king of that in fantasy, Middle Earth.The characters and their development are different story though. The only character who feels completely 3-dimensional with a good development is Paul Atreides, the Duke's son. I can somewhat agree that Jessica almost - but not completely - qualifies. The rest of the characters feel like cardboard cutouts, even the most important ones like Stilgar. As to the Baron Vladimir Harkonnen: he looks like an absolutely static caricature with practically all imaginable bad human indulgences thrown into to make him look completely repulsive.The strengths of the book easily overweight the weakness I mentioned before; the latter can be easily overlooked. The book became a victim to its own hype: it does not deserve the title of the most important and the best science fiction work ever which it is often credited with. Due to all the hype I am a little disappointed - enough to lower its rating by half a star. This review is a copy/paste of my BookLikes one: http://gene.booklikes.com/post/897366..."}, {"userName": "Otis Chandler", "userReviewDate": "Aug 29, 2006", "userURL": "http://www.goodreads.com/user/show/1-otis-chandler", "userReview": "When people ask me what my favorite book is, Dune is always my answer. Words cannot even do justice to what an epic tale this is. We learn about spirituality, human nature, politics, religion, and the making of a hero.I loved the spiritual aspects of the book the best. The philosophies and practices and Pranu Bindu training of the Bene Gesserit that Paul learns and builds upon. The Bene Gesserit believe in a training regiment that results in a superior human being - one with every sense as refined as possible. This means a focus on learning, on controlling emotion, on controlling your body. My absolute favorite quote from Dune is the Bene Gesserit litany against fear:\"I must not fear. Fear is the mind-killer. Fear is the little-death that brings total obliteration. I will face my fear. I will permit it to pass over me and through me. And when it has gone past I will turn the inner eye to see its path. Where the fear has gone there will be nothing. Only I will remain.\"The litany is meant to be recited when you are in a moment of fear, and as I first read Dune 20 years ago, I've employed it many times. After Paul employs it when he is fighting Jamis, the affect on him is described as \"a cool bath washing over him. He felt muscles untie themselves, become poised and ready.\" I have read a lot about people who perform at high levels - whether it be in athletics or business, and success is all about getting into that zen state where you have a clear, focused mind. Fear is the biggest thing that can cloud one's mind - usually fear of failure, but there are other forms too. While this Litany won't always eliminate it, I've felt it to be useful to recognize the fear and call it out for what it is.There is also a focus in the book on being able to read people by paying attention to the minutia. In many crucial scenes we see Paul and Jessica and others employing this skill, using not only their eyes, but reading the tone of what a person says, what their body language or actions say, and more. Imagine the poker player I could be if I learned these skills!\"If you rely only on your eyes, your other senses weaken.\"It's interesting to me that so many science fiction novels contemplate a future with AI (aka post-singularity). In Dune, the Butlerian Jihad was the human rebellion to rid itself of AI or \"thinking machines\". They are now banned, and in their place we have Mentats, who are humans with processing powers far greater than any thinking machine. It's unclear to the software engineer in me how exactly that could be without some sort of physical manipulation (insertion of massive amounts of transistors, for instance), but the affect is pretty cool, we get Spock-esque beings who analyze everything extremely logically, and are great at political planning \"feints within feints within feints\". There was a lot in the book about leadership. It started with Paul first learning about it from his Father, and also from the Bene Gesserit. This quote stood out to me:\"She asked me to tell her what it is to rule,\" Paul said. “And I said that one commands. And she said I had some unlearning to do.\" She hit a mark there right enough, Hawat thought. He nodded for Paul to continue. \"She said a ruler must learn to persuade and not to compel. She said he must lay the best coffee hearth to attract the finest men.\"Later as he grows into a leader himself, Paul learns that the most essential ingredient to be a leader is to lead people to a worthy goal.\"It was another of the essential ingredients that she felt her son needed: people with a goal. Such people would be easy to imbue with fervor and fanaticism. They could be wielded like a sword to win back Paul’s place for him.\"Much has been made in modern reviews of Dune of the fact that it's clearly a statement about oil and the Middle East. The book even admits the Fremen are of Sunni descent, and many words they use (Jinn, Jihad, etc) are Arabic. I'm not sure I understand all the undertones, but one thing that was clear was about control of the worlds most precious commodity: \"The people who can destroy a thing, they control it.\" I hope we are closing in on the end of the days when oil controls so much, but we aren't there yet. In the meantime, we had best beware of any future Harkonnen's."}, {"userName": "Richard Derus", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Rating: 4* of fiveUPDATE 2/15/17: I found this 2003 mini-documentary about the 1984 film on YouTube. I wasn't wrong. The film wasn't very good. Beautiful, yes; good, not so much.I first read this novel in 1975. It seems impossible that it was over 40 years ago, but the math is inescapable and time inexorable. My teenaged brain was rewired by the read. I had a standard by which to judge all future SFnal reads, and it was a high one. I was transported into a future I was utterly convinced would be the the one I'd have descendants to live in. I suppose that could yet happen. I'm a lot less convinced now that the human race's future is that long. Age might bring wisdom, I wouldn't know about that, but it sure brought me a booster shot of cynicism.The Orange Catholic Bible, the books of the Empress Irulan, they all seemed to me so real...the cry \"never to forgive, never to forget\" rings louder today than it did in 1975 because I've lived through so many iterations of it by now. Us people, we love the shit out of our vicious vengeful vendettas, don't we. Frank Herbert got that right as all hell.Trouble is, ol' Frank wasn't any kind of a writer, was he? He had flashes of good phrasemaking, he had long stretches of competent prosemongering, and then there was the rest of the ninety jillion words in the novel. Serviceable is le mot juste. And TBH I feel pretty generous putting it that way.But then came David Lynch. Oh dear, oh dear. I'm not a worshipper of Lynch's at the best of times. I thought Blue Velvet was brummagem and boring; Twin Peaks was portentous twaddle. So the Kool-Aid passed my seat, I fear. His 1984 adaptation of Dune was downright laughable. I left the theater torn between gales of laughter and gusts of grief-stricken tears. Sting in that stupid winged underwear! KYLE MacLACHLAN as Paul Atreides!! Ludicrous, all of it, and the problems started with the butchery of so much of the novel that even the bones were scattered in no sensible pattern. Inevitable, really, as the runtime of the film was a paltry two hours and seventeen minutes. Imagine trying to wedge a 600-page magnum opus dense with world-building and replete with internal ironies and levels of meaning into the length of a good winter's nap. Didn't work so good.SciFi Channel, gods please bless their collective hides, approved a mini-series written and directed by John Harrison in 2000. It was 4:17:07 in total. That was *almost* enough to do justice to the story. The result was infinitely superior to the Lynch version. It was a joy to watch for me, a forty-year-old cruelly wounded mess of a man, and felt like a balm to my fanboy memory of the novel. Perfect? No. Great? Yep!Then I found it on YouTube and thought I'd take a respite from reality by giving it a rewatch. You know what? Special effects age badly. Mid-budget TV ones age really, really, really badly. The screenplay clunked a good deal. The story, however, was all there and was well done, with the prunings and bonsai sculptings well chosen and well shaped. And the story was just about as timely as anything I could've hoped to avoid!Dune bashed me upside the temples with its portrayal of the collapse of Empire and revolution of the have-nots in a way it couldn't have 17 or 42 years ago. It felt more timely, it packed more wallop than it possibly could have in fatter times. This is my idea of good myth-making: A story that isn't finished telling us the truth yet, and doing so in a way that compels, impels, propels us to go on the journey ready or not. The idea of a Savior come to rescue us is eternally appealing, the sight of the unworthy getting their comeuppance is evergreen. It wasn't what I was seeking, wasn't escapist boom-bang-blowwie, but it was what I needed. A bit of heartening to fight again, odds be buggered.And now I'm told that there's a new version on the way, possibly to be directed by Denis Villeneuve of Arrival fame. That's some fire-power there. A director with clout and access to Hollywood's cash box could do something special with this epic...though I'm still very concerned with the issues inevitable in adapting the story to movie length. Isn't it interesting how every decade seems to call for a new version of the story? The 1960s had the novel; the 1970s the unmade Alejandro Jodorowsky adaptation, a perfect reflection of the decade's malaise/limitation mentality; the 1980s cheesy, overblown one-note-and-it's-the-wrong-one ethos; the 1990s void, again perfectly in keeping with the culture; the 2000s TV version, as everything shrunk in the aftermath of the floodwaters of Bush's election stealing; and now a big-budget, major-talent remake! That hasn't happened yet! And bids fair not to, in the parlous economic times ahead!Frank Herbert's Dune is a great rewatch. The novel hasn't finished with us yet. I hope it won't any time soon."}, {"userName": "Jan Philipzig", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/32295170-jan-philipzig", "userReview": "Familiar yet strange, realistic yet fantastic, prosaic yet poetic, crystal clear yet mysterious, stiff yet graceful, cold yet passionate, detailed yet abstract, rational yet delirious, disciplined yet boundless, conservative yet progressive, obsessive yet sublime – aaah, I think the spice melange is starting to kick in..."}, {"userName": "Keith Mukai", "userReviewDate": "Feb 05, 2007", "userURL": "http://www.goodreads.com/user/show/1994-keith-mukai", "userReview": "I guess I'm one of the few that bridge the gap between the Pride and Prejudice camp and the Dune camp. I loved both.Dune isn't a light, enjoyable read. At times it reads more like excerpts from geology, ecology, zoology, sociology, pscyhology, and political textbooks. The characters are more like mega-archetypes than real human beings.The appeal of Dune is peculiar. In order to enjoy Dune you have to enjoy complexity. All authors create little worlds in their stories but Herbert created a world.He doesn't just say that Arrakis is a desert planet, he engrosses himself and the reader into the geology.He puts people on the planet, governments, conflicting cultures, conflicting religions, conflicting ways of life that are thought out to the Nth level above and beyond anything else I've ever read. You could write a sociology or politics dissertation on the societal relations Herbert conceived for Dune.Now is complexity itself a thing to be admired in a work of fiction? Generally no, but Dune is so immense and so detailed that it creates and inhabits a category of its own. The very fact that it often reads more like a National Geographic article than a sci-fi novel speaks to its peculiar charm.Admittedly, this will not appeal to everyone. In fact, odds are that it will appeal to hardly anyone. But limited appeal should in no way factor into a work's quality. Compare the Academy Award-winning films against the yearly box office numbers if you don't agree. I'm sure Armaggeddon outgrossed Monster's Ball.And amidst all this complexity lies a kind of new myth that blends mysticism, religion, and crass real-world politics. It's a hybrid; it's not The Odyssey and it's certainly not Star Wars but I do find great appeal in its particular take on Campbell's hero's journey. And the fact that it plumbs the intricacies of Muslim/Arab/desert culture adds another layer of exotic flair to the work.As if all that wasn't ambitious enough, it even articulates a fascinatingly dark but pragmatic destiny for humanity as a whole.And all of these incredibly ambitious elements are all tightly woven together. Take out one element and the story loses its cohesion. Despite all the ridiculous amounts of detail there is nothing extraneous in this novel.Dune is a remarkable, magnificent accomplishment. But it's okay if it's not to your taste."}, {"userName": "Adina", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/22189348-adina", "userReview": "Amazing! A masterpiece of SF with which I will probably compare all SF books that I’ll read in the future. It goes in my favorites shelf. This is my 3rd attempt to read Dune and I am really grateful that I did not succeed the first two times I tried as I was too young to understand all the subtleties. I would have probably enjoyed it as a very well written adventure novel but nothing more. That would have been a pity as Dune is so much more than a story about space travel and epic battles between good and evil. It presents complex philosophical ideas, explores ecological issues, cultural identity and differences. Also a major theme is represented by religion and religious leadership. The disturbing part about this book, taken in the current political context, (I am not sure if Herbert did it on purpose or not) is how easily the Fremen can be identified with an Arab nation. The spice can be seen as “oil” and the Harkonnens as evil westerners/Russians that are exploiting the natural resources without thinking about the locals and the environment. I saw that others reviewers saw this as well."}, {"userName": "Christopher Paolini", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/33610695-christopher-paolini", "userReview": "Dune is one of the best examples of the hero’s journey in fiction. Most authors, myself included, need more than one book in order to tell an epic coming-of-age story. Herbert did it in one while also creating a unique and interesting setting. Part of his genius as an author was his ability to imply far more about his world than he actually showed. As a result, Dune feels as if it was written by an inhabitant of Herbert’s universe; no small achievement.As with Anna Karenina, Dune goes beyond the usual surface elements that so much of fiction relies upon. It deals with questions of leadership, ecology, and philosophy (and so much more) while also telling a darn good story.And it contains one of my favorite quotes:“I must not fear.Fear is the mind-killer.Fear is the little-death that brings total obliteration.I will face my fear.I will permit it to pass over me and through me.And when it has gone past I will turn the inner eye to see its path.Where the fear has gone there will be nothing.Only I will remain.”The book does have some flaws (the death of Muad’Dib’s son is dealt with too quickly, and the only homosexual character is the villain), but even with them, Dune is a masterpiece."}, {"userName": "Jay Z", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/5153399-jay-z", "userReview": "If this is the gold standard against which all science fiction must measure and be judged, let's just blow our brains out right now and call it a day. As far as I can tell, Dune largely inspires two points of view. One marvels at its historical importance and world-building (unique, fascinating, complex, rich), and the other dislikes the stilted writing but does so apologetically because Frank Herbert couldn't help the fact that he wrote science fiction in the 1960s and that Edward Said hadn't done his thing yet. Come  on , people of the world. Linear models of progress don't apply to good writing. Frank Herbert can't write because he's a shitty writer, not because it was the 1960s. The dialogue is clunky and characters have endless internal monologues (in italics) that serve no purpose but to explain incredibly obvious plot points to the reader. This is an embarrassingly novice mistake. The plot also lacks any element of surprise. Princess Irulan, oblivious to the concept of spoiler alerts, summarizes all major plot points in her historical vignettes which introduce every single chapter. We can't wonder about whether and how  Jesus Christ  Paul will become the messiah of the people because the princess has already told us before we've begun the book. We can't wonder about who the traitor in the Atreides house is because Princess Irulan's vignette is all like \"Yueh! Yueh! A million deaths were not enough for Yueh!\" And then there's the world-building. It is So. Fucking. Lazy. Half the words are lifted from Arabic and  Arab  Fremen culture is the result of a scavenger rampage through Islamic concepts, scraps of Buddhism, and Frank Hebert's Orientalist curiosities all cobbled together into a cringe-inducing whole. The main subject of this book, the  sand niggers  Fremen, have been in the desert for thousands of years, border on religious fanaticism, and haven't changed a bit over time. They pray salat, conserve water (because hello, desert), and wait for their white savior Paul to bring them out into the light (or into the shade, as it were). They frequently declare Muslim-sounding things in bastardized Arabic and are very upset because the Imperial forces are preventing them from doing Haj. It's unclear how the Imperial forces have blocked all outbound flights to Saudi Arabia, but we'll take it on faith. There was a jihad situation, like, hundreds of years ago but it was apparently a jihad against computers? I don't know. The  ragheads  Fremen also do this thing where two men will fight to the death and the winner will take the dead man's woman as his wife or his servant. Given the history of the U.S., I think it's hilarious that a book full of racism, imperialism, and misogyny was considered groundbreaking in the 1960s. The other thing that makes this book unreadable is Frank Herbert's I-Tarzan-You-Jane approach to gender:“There is in each of us an ancient force that takes and an ancient force that gives. A man finds little difficulty facing that place within himself where the taking force dwells, but it’s almost impossible for him to see into the giving force without changing into something other than man. For a woman, the situation is reversed … The greatest peril to the Giver is the force that takes. The greatest peril to the Taker is the force that gives.\" Man has the mighty penis. Mighty penis does the thrusting action. Woman has the sacred hole. Sacred hole is warm and open for mighty penis penetration. Thanks for clearing that up, Frank. Male and female characters in this book align nicely with Frank's pole-in-hole view of the world. The men do the war because the penis. The women do the manipulation and mind control because the vagina. They are either wives or concubines, and having children is of utmost important. Man and his woman sometimes have tender conversations about all of this. Observe: \"[Paul] began tightening his still suit. \"You told me once the words of Kitab al-Ibar,\" he said. \"You told me: 'Woman is thy field; go then to thy field and till it.'\" \"I am the mother of thy firstborn,\" she agreed.\" How romantic. Anyway, let's talk some more about Paul, our white messiah. When he's taking a break from tilling his fields, he's busy being a cartoon hero. He has no flaws. Like, none. He sees everything, understands everything, knows the future, and every word out of his mouth is prophetic and vaguely Shakespearean. This is the kind of shit he says: [Re. aforementioned penis/vagina theory]\"\"And you, my son,\" Jessica asked, \"are you one who gives or one who takes?\" \"I'm at the fulcrum,\" he said. \"I cannot give without taking and I cannot take without [giving].\"\"You're SIXTEEN, bitch. Sit down and shut the fuck up. Nobody cares. Opposite the cartoon hero is the cartoon villain. He's really, really evil. He wakes up evil, goes to bed evil, and all the time in the middle, he has evil conversations and evil thoughts. Many of his evil thoughts are in italics so we know EXACTLY where the story is headed because plot twists are also evil and will not be tolerated. Please note, he is also fat as fuck and eats a lot. Also, he's a big homo. And the homo's a pedo. I really have nothing more to say. I AM glad I took the time to wade through this shitstorm of misogyny and orientalism. You can't read sci-fi and not have read Dune. I always suspected I might hate it, but at least now I have proof."}, {"userName": "Stuart", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/9456990-stuart", "userReview": "Dune: The greatest SF novel of all time, never to be matched by later sequels (Review of 1965 Novel, 1984 David Lynch Film, 2000 Sci-Fi Channel Miniseries, and 2013 Jodorowsky documentary)Originally posted at Fantasy LiteratureWhat more can be said about Frank Herbert’s 1965 masterpiece? This massive epic of political intrigue, messianic heroes, vile villains, invincible desert fighters, telepathic witches, sandworms and spice, guild pilots who fold space, and a relentless action-packed narrative that still has ample room for beautiful descriptive passages and copious philosophizing on the mythology of the messiah/savior. In short, Dune is a perfect SF novel that both entertains and engages the mind, a book frequently cited as the greatest single work of imagination produced in the genre, rivaled only by J.R.R. Tolkien’s The Lord of the Rings.And yet the book had a troubled birth, being rejected by over twenty publishers before being accepted by Chilton Books, better known for publishing repair manuals. How could a book later considered a masterpiece be so roundly rejected? The answer lies in the status and expectations of the genre in the 1960s. At the time, SF was still mainly known for its most famous practitioners, Robert Heinlein, Arthur C. Clarke, and Isaac Asimov, who represented an older Golden Age of SF, focused mainly on science, technology, and space adventure.Dune was a completely new creature, so far ahead of its time with it’s emphasis on a baroque far-future universe dominated by competing Great Houses bound to an Emperor, a guild of space pilots, the matriarchal Bene Gesserit witches, geneticall-modified humans called Mentats that served as computing devices, and the complexities of a galactic economy dependent for commerce on a substance known as the “spice“ mélange that extends health and lifespan, expands consciousness, and most importantly allows the guild pilots to fold space and connect the disparate planets of the Empire. In addition, Frank Herbert was very interested in Middle Eastern cultures and Eastern religions like Zen Buddhism, as well as in desert ecologies and the preciousness of water. Weaving this massive and complex group of themes into a coherent, exciting, and moving narrative following the fate of messiah Paul Atreides, later known Muad’Dib, was a feat that few authors have ever achieved since then, including Frank Herbert himself. In fact, Dune spawned five sequels directly written by Frank Herbert, and then over 10 books that fill in the numerous details of his universe, written by his son Brian Herbert and Kevin J. Anderson, who seems to specialize in co-authoring various series such as Star Wars, X-files, and all kinds of novelizations. Most recently his book The Dark Between the Stars was a 2014 Hugo Award nominee. I'm not really interested in reading these spin-off books, when there are so many other books to be read. I did read the five sequels written by Herbert back in high school, and it was a punishing experience, as the first two books (Dune Messiah and Children of Dune) deliberately debunked the messiah mythology established in Dune, showing how the Fremen used Paul Atreides’ status as messiah to wage a destructive jihad across the universe. It’s interesting to hear comments that Herbert intended all along to show what happens when the masses believe in a messiah, and how they participate in the process of creating one. His view is actually quite skeptical, but since Dune is about the rise of the messiah, it benefited from the positive early stage of Paul’s story arc. However, his follow-ups quickly drained my enthusiasm. I guess it should come as no surprise that we prefer to be swept along with the rise of a messianic superbeing, rather than observe the messy aftermath after his rise to power, and various political and religious divisions complicate the world after he takes over. Herbert wanted to explore these themes in great detail, but they were certainly much less commercially-appealing that Dune. I found the next three books (God Emperor of Dune, Heretics of Dune, Chapterhouse Dune) more interesting but also very complicated and hard to enjoy. Herbert wrote quite a number of other SF novels outside the Dune universe, but he will always be known best for Dune to the exclusion of his other works, and this must have weighed heavily on him as a writer.The story itself focuses on two feuding families, the House Atreides and House Harkonnen. The latter has been in charge of administering the production of Spice on Arrakis, but as House Atreides has gained in power, the Padishah Emperor Shaddam IV decided to place the Atreides in charge of Arrakis, with the intention of drawing them into conflict with the Harkonnes and keeping both in check. House Atreides is led by Duke Leto Atreides, his concubine the Bene Gesserit Lady Jessica, and Leto’s son Paul, who is part of a secret breeding program to create a Kwisatz Haderach, a male messiah with incredible mental powers who will lead the Bene Gesserit and humanity to greater heights.The levels of intrigue and complexity are staggering, and though a description cannot do it proper justice, Herbert’s complete dedication to his creation recalls the massive world-building achieved by Tolkien in Middle Earth. Despite all the alien concepts, politics, intrigues, warring groups, desert warriors, and mish-mash of Zen Buddism, Islamic and Christian mythology about messiahs and jihads, and the complex economic and ecological implications of the sandworms and spice, the reader is completely drawn into this world and believes in it. It is truly an amazing achievement, recalling how fans embraced George Lucas’ Star Wars universe, but so much more complex, dark, and mature in its themes. As this was the first time I revisited Dune since high school, I decided to get the ensemble-cast audiobook version. It’s complete with sounds effects like the sound of desert winds blowing and ominous music, and these are carefully done not to detract from the narration. A note on the narration, however: the books starts out with a full cast of voice actors, but then switches to a single narrator (Simon Vance?) midway and towards the end, with a few scattered scenes with the full cast. It’s a bit disorienting, especially as the voice of Baron Harkonnen switches from a simpering evil character to a deep-voiced and powerful voice akin to Michael Clarke Duncan. It would have been better to kept the full cast for the entire book, but for some reason it got a bit jumbled. Still, it’s an excellent audiobook production.Jodorowsky’s Dune (2013 documentary; actual movie never filmed)It was inevitable that Dune captured the imaginations of film directors, but the scale and complexity of the story made the transition to film extremely difficult. Film rights were acquired in 1971 but little progress was made until 1974, when a French group acquired the rights and Alejandro Jodorowsky, a Chilean avant-garde film maker, writer/poet and spiritual figure most famous for his 1970 bizarro Western El Topo and The Holy Mountain. His ambitious plans for the film would have reached about 12-20 hours in length, and featured roles for Salvador Dali (lured by ego-stroking), Orson Wells (lured by food and drink), David Carradine, Pink Floyd, Magma, and even Mick Jagger. The artwork would involve the legendary Jean Giraud (of Moebius fame) and H.R. Giger (of Alien fame). Alas, such an ambitious and sprawling project was doomed to failure, and this story is detailed in the 2013 documentary Jodorowsky’s Dune. I watched this recently, and it’s a very revealing portrait of an avante-garde artist. His vision was so wild and hallucinogenic that he said audiences would not need to drop LSD because his film could replicate that experience. His statements about his vision are quite eye-opening:In my version of Dune, the Emperor of the galaxy is insane. He lives on an artificial gold planet, in a gold palace built according to not-laws of antilogical. He lives in symbiosis with a robot identical to him. The resemblance is so perfect that the citizens never know if they are opposite the man or the machine...In my version, the spice is a blue drug with spongy consistency filled with a vegetable-animal life endowed with consciousness, the highest level of consciousness. It does not stop taking all kinds of forms, while stirring up unceasingly. The spice continuously produces the creation of the innumerable universes.I changed the ending, evidently … I did that. It was my Dune. When you make a picture, you must not respect the novel. It’s like, you get married, no? You go with the wife, white, the woman is white, you take the woman, if you respect the woman, you will never have child. You need to open the costume and to rape the bride. And then you will have your picture. I was raping Frank Herbert, raping, like this! But with love, with love.No wonder Frank Herbert disavowed any connection with this project. And despite Jodorowsky’s clear fascination with the source material, he saw no reason not to change it completely. In fact, he hadn’t even read the book when he pitched the idea, and his screenplay demonstrates a willful lack of knowledge of the actual events in the book. It’s not clear that he ever read the book, period, and the same goes for H.R. Giger. Not a biggie when we’re talking about artists, apparently. My ambition with Dune was tremendous. So, what I wanted was to create a prophet. I want to create a prophet... to change the young minds of all the world. For me, Dune will be the coming of a god. Artistical, cinematographical god. For me, it was not to make a picture. It was something deeper. I wanted to make something sacred, free, with new perspective. Open the mind! Because I feel, in that time, myself, inside a prison. My ego, my intellect, I want to open! And I start the fight to make Dune.The documentary suggests that, although the film was never actually made, its influence on other SF film projects is huge, probably because the pitch-book made the rounds of the Hollywood studios. The film can take credit for bringing together Dan O’Bannon (producer of The Dark Star) and H.R. Giger (Swiss artist who created the drawings for Ridley Scott’s Alien), for getting legendary French artist Moebius to make thousands of storyboard sketches and full-color character drawing, and also well-known SF artist Chris Foss to contribute his iconic spaceships. It ends with a series of overlays of the storyboard with actual films, frequently with astonishing similarities in costumes and images, as diverse as Flash Gordon, Star Wars, Raiders of the Lost Ark, He-Man, and Prometheus. While it’s debatable exactly how much these films were directly inspired, it’s certainly food for thought. So in the end, though it was probably not “The Greatest Film Never Made”, it was an admirably insane and unwieldy project that produced a spurt of creative energy that was simply too much for Hollywood’s commercial studios. It may have been incredible masterpiece, or a complete and utter disaster, but it’s unfortunate that we never got to see Jodorowsky’s mind-altering vision on film. David Lynch’s Dune (1984)After plans for Ridley Scott to direct fell through, it was not until 1981 that Dino De Laurentiis’ daughter approached David Lynch to bring Dune to the big screen. Wait, you mean the director of Eraserhead, Blue Velvet, Wild at Heart, and Twin Peaks? That’s right. It’s still a mystery why Lynch chose to direct Dune, since he had not shown interest in the SF genre and had not even read the book (a common theme here). But to his credit, he made a valiant effort to put on film this notoriously difficult and sprawling work.As could have been predicted, the Lynch film was severely panned by film critics, moviegoers, and fans of the novel. It was dark, confusing, and incoherent (due to excessive cutting to get it to 2 hrs 17 min in length), and the Baron Harkonnen was so physically revolting to look at that I had to turn away from some of his scenes. But it did feature a great soundtrack by Toto (especially the haunting closing credits) with the prophecy theme written by Brian Eno. And it I will never forget Kyle MacLachlan as Paul Atreides in the final climactic scene, a knife fight to the death with Feyd Rautha Harkonnen, played perfectly by Sting! Even Sean Young and Patrick Stewart have important roles as Chani and Gurney Halleck. But this was another doomed attempt. Try to imagine cramming all the plot details, background information on the political machinations of the dozens of characters and factions, details on the complex ecology of Arrakis, the relationship of the sandworms and spice, the Fremen and Bene Gesserit, into a film just over 2 hours long. The studio’s demands for cuts were so drastic that Lynch has since dissociated himself from the film and refuses to talk about it. That’s a shame, because many have revised their initial negative views on the film and I consider it a valiant if failed attempt at scaling the Everest of SF films.Sci Fi Channel Miniseries (2000; Director’s Cut: 295 min)This is by far the least well-known version of Frank Herbert’s SF masterpiece. In fact, it’s not easy to get a copy as it’s not available for sale new on DVD or download. That should have set off alarm bells, but what the heck, I had to see for myself. I finally had to order a used DVD copy on Amazon. Big mistake~What can I say other than, “Oh the humanity!” I’m fully aware that a TV miniseries does not have access to the same budget resources, A-list actors, top-notch special effects, and artistic talent. But what a disaster this was. Within a few minutes I knew I was along for a long and painful ride. Every frame is amateurish, the amount of inept fight scenes and obvious blue-screen work made me suppress chuckles, but that was only topped by the hopelessly wooden acting of a cast of unknowns expect for William Hurt, who must have deliberately toned it down not to make the others feel bad. The entire production is clumsy through-and-through, and the only redeeming feature is that the costumes in the film are SO OUTLANDISH that they provide entertainment of a different sort. For example, the stillsuits of the Fremen, which looked believable in the Lynch film, have become flimsy green-camouflaged rain jackets found in the discount bin:https://mialacostumes.files.wordpress...And the Fremen themselves are just low-rate extras from a different back-lot set filming Middle-Eastern marketplace scenes. Even more gut-busting were the blatant samurai armor rip-offs that passed for Harkonnen soldiers’ armor:http://vignette3.wikia.nocookie.net/v...If that wasn’t enough, the Imperial Sardaukar storm troopers, supposedly the most lethal and feared fighters in the galaxy, had silly black headgear like this:https://s-media-cache-ak0.pinimg.com/... Finally, I had to save a special place for the ridiculous outfits of the Guild Navigators’ representatives:http://dvdmedia.ign.com/dvd/image/dun...It’s easy to ridicule film-making this bad, but I have to give credit for one thing. One of the fatal flaws of Lynch’s Dune was that it tried to cram an incredibly-complex SF epic into just 2 hours+ of film (unwillingly, I know). So anyone familiar with the book could lament the wholesale destruction of the plot to force the story into that timeframe. It’s no surprise that most critics and viewers unfamiliar with the book were completely lost. Well, the mini-series does put back in dozens of story arcs to make it much more faithful to the book, and that was appreciated. It’s easier to recognize the source material in this version, but the poor production and acting quickly torpedo this.In fact, the miniseries essentially re-shoots almost the entire Lynch film, scene by scene, in an attempt to do it ‘better’. There are hardly any scenes left untouched, but I couldn’t help thinking I preferred the actors and cinematography of the Lynch film in almost every case. I can imagine the producers pitching this project as “let’s do Dune again, and get it right this time.” Well, I second those feelings, but this was not it, not by a long shot. Judging from the recent prominence of big-budget cable TV productions like Game of Thrones, Man in the High Castle, the 300, the Expanse, and the vast improvement in special effects, it strikes me that Dune is ripe for another adaptation, and could easily fill several quality seasons in the right hands. Imagine the creative team of GOT getting behind this project – it could be amazing. Because Dune the book has yet to be done justice, so there’s a great opportunity here for a skilled team. Any takers?"}, {"userName": "Michael Finocchiaro", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "I reread Dune for the first time in several decades and immensely enjoyed it. I also went back to watch the feature film and had quite mixed feelings - while it was close to the overall aesthetic that Frank Herbert describes with the gorgeous desert sets and the terrifying worms, the parts of the story that were necessarily culled out was disturbing (that and the woeful special effects at the time trying (and IMHO failing) to visualize the personal shields that the characters wear in hand-to-hand combat). For those who are just discovering Dune for the first time, it is essentially a messianic story on a desert planet (think of Jesus or perhaps Mohammed on Tatooine) in a universe dominated by a cartel (the Guild also known as CHOAM) with a monopoly on a drug (called mélange) derived from a rare material (spice) available only on the desert planet Arrakis (Dune). This drug is so powerful that it allows the Guild (and later Maud'dib) to leverage space-time singularities to defy the speed of light and travel anywhere in the universe. Overlaid on this foundation, the epic battle of the feudal houses of the noble Atreides and the evil Harkkonen houses rages, the betrayal of the former by the latter explicitly endorsed by the Emperor (himself an almost impuissant pawn of the Guild as well). All that to say that the fabric of the story is multilayered and as complex and complete a universe as you will find in George RR Martin or Dan Simmons. There are several enhanced human species running around: the Mentats who have been cerebrally enhanced to be able to calculate like supercomputers and thus give their predictive analytics to their assigned Dukes (or the Emperor) and the Bene Gesserit cult who are a sort of quasi-religious non-celibate nuns who have honed perception and language to the point of having developed nearly superpower-level strengths of persuasion which are almost universally feared and vilified as sorcery in the rest of the universe. Paul Atreides, heir to the throne, is born to Jessica, a Bene Gesserit, possessed some of these powers and when the family moves to Arrakis (part of the aforementioned Harkkonen plot) from their home planet, he appears to the native Freeman population as perhaps a fulfillment of their messianic prophecies and hopes. In perhaps the most critical departure from the book, the movie does not really show Paul questioning the awesome power that he possesses and his assumption of the mantle as the Arrakis Messiah, the Maud'dib. In the book, one aspect that I loved was how Paul struggled with this messianic destiny and did everything he could to subvert it. One of the unique gifts he received, presumably as the rare and unique offspring of a Bene Gesserit, was the ability to see possible outcomes (like a Mentat) and thus he could take decisions based on the most likely foreseen outcome. It made for great reading.The other great thing about Dune is the aesthetic of this desert planet with impossibly huge worms under the surface who are mysteriously connected to spice and pose a danger to all creatures in the desert except for the Freeman. The still suit which recycles body water in the deep desert was brilliant as was the ever-present obsession with \"water debt\" of the Freemen. I really felt like I was walking unevenly (must not attract the worms!) through the sand with Jessica and Paul before their fateful encounter with the Freemen. Dune is a well-deserved classic for all the reasons I mentioned above and probably much more that I missed. I have read it twice and gotten almost entirely different things out of it each time. I have not gone further in the Dune series as most folks told me that the first one was head and shoulders better than the following ones. Let me know in the comments what you liked about Dune and whether you continued to Dune Messiah or not."}], "description": "Set in the far future amidst a sprawling feudal interstellar empire where planetary dynasties are controlled by noble houses that owe an allegiance to the imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source of the 'spice' melange, the most important and valuable substance in the cosmos. The story explores the complex, multi-layered interactions of politics, religion, ecology, technology, and human emotion as the forces of the empire confront each other for control of Arrakis.Published in 1965, it won the Hugo Award in 1966 and the inaugural Nebula Award for Best Novel. Dune is frequently cited as the world's best-selling sf novel.", "title": "Dune\n      \n          (Dune #1)", "url": "https://www.goodreads.com/book/show/13536892", "average": 4.2, "cover": "https://images.gr-assets.com/books/1331543359l/13536892.jpg", "reviews": 14612, "authors": [{"url": "https://www.goodreads.com/author/show/58.Frank_Herbert", "name": "Frank Herbert"}, {"url": "https://www.goodreads.com/author/show/44554.Scott_Brick", "name": "Scott Brick"}, {"url": "https://www.goodreads.com/author/show/524200.Orlagh_Cassidy", "name": "Orlagh Cassidy"}, {"url": "https://www.goodreads.com/author/show/2961721.Euan_Morton", "name": "Euan Morton"}, {"url": "https://www.goodreads.com/author/show/5602.Simon_Vance", "name": "Simon Vance"}, {"url": "https://www.goodreads.com/author/show/511951.Ilyana_Kadushin", "name": "Ilyana Kadushin"}], "type": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/13536892-dune", "http://www.goodreads.com/book/show/1000049.Dune", "http://www.goodreads.com/book/show/53732.Dune", "http://www.goodreads.com/book/show/234225.Dune", "http://www.goodreads.com/book/show/20441724-dune", "http://www.goodreads.com/book/show/25394068-dune", "http://www.goodreads.com/book/show/1685995.Dune", "http://www.goodreads.com/book/show/29889255-dune", "http://www.goodreads.com/book/show/11273438-dune", "http://www.goodreads.com/book/show/3394373-dune", "http://www.goodreads.com/book/show/104.Dune", "http://www.goodreads.com/book/show/1022863.Dune", "http://www.goodreads.com/book/show/11323604-dune", "http://www.goodreads.com/book/show/53747.Dune", "http://www.goodreads.com/book/show/25772375-dune", "http://www.goodreads.com/book/show/106.Dune_Messiah", "http://www.goodreads.com/book/show/112.Children_of_Dune", "http://www.goodreads.com/book/show/53764.The_Great_Dune_Trilogy", "http://www.goodreads.com/book/show/42432.God_Emperor_of_Dune", "http://www.goodreads.com/book/show/117.Heretics_of_Dune"]}