{"ratings": 923, "userreviews": [{"userName": "Andreas", "userReviewDate": "Jul 13, 2014", "userURL": "http://www.goodreads.com/user/show/20379307-andreas", "userReview": "This Hard SF novelette was originially published in Edge of Infinity and won the Hugo and Locus novelette awards 2013. I've read it as part of The Year's Best Science Fiction: Thirtieth Annual Collection.She tells the story set a couple of generations in the future solar system from the perspective of a transhuman octopus - one form of the eponymous \"sushi\" - mining, building and cleaning up around Jupiter's orbit. It is about stellar politics - the inner \"Dirt\" planets versus the outer sushi planets and in-between Jupiter. But also about tolerance and racism - only featherless bipeds are allowed to work as medicines and on the other hands it is fashionable to be a nautilus as a lawyer. These two themes get into the moving when a large comet is expected to hit the gas planet and one former beauty queen wants to get surgically transformed to sushi-form. I love Cadigan's relaxed characterizations and atmosphere sprinkled with jargon and interesting ideas that make you think a while after closing the last page. Cadigan seems to write way out of her usual comfort zone but she does manage it formidable. A grand world-building, nice prose and very good tension arc. As I heared, Cadigan is currently working on a novel based on the novelette. I'll definitely buy that one. After all, I love sushi!Merged review:GR doesn't handle short stories well enough, so I've outsourced my story reviews to my blog. If you're curious, please follow the links to detailed reviews of each story.Summary: 18 views at a \"industrialised, colonised Solar System during a time when starflight is yet to emerge, and imagines life in the hottest places close to our star, and in the coldest, most distant corners of our home.“ It is a setting which was defined previously, most recently in novel form with the great 2312 from Kim Stanley Robinson. The terrific lineup of authors include names like Bruce Sterling, Elizabeth Bear, Alastair Reynolds, or James S.A. Corey. It is Strahan's second anthology installation of what he calls \"Fourth Generation of SF\" which started with Engineering of Infinity (2010) and was carried on with Reach for Infinity (2014). All of the stories feel plausible and are different.I seldom find anthologies containing no bad story at all. I liked nearly all of the stories, some were great. That deserves 5 stars.My favourite ★★★★★ stories wereThe Girl-Thing Who Went Out For Sushi by Pat CadiganSwift as a Dream and Fleeting as a Sigh by John BarnesThe Peak of Eternal Light by Bruce Sterlingno ☆ or ★ Contents:  ★★★★★ • “The Girl-Thing Who Went Out For Sushi” • novelette by Pat Cadigan • review\n ★★★ • “The Deeps of the Sky” • short story by Elizabeth Bear • alien mining a gas planet's troposphere for a dowry • review\n ★★★★ • “Drive” • Expanse prequel by by James S. A. Corey • the invention of the Epstein drive • review\n ★★★ • “The Road to NPS” •  short story by Sandra McDonald and Stephen D. Covey • road-trip on Europa • review\n ★★★★1/2 • “Swift as a Dream and Fleeting as a Sigh” • short story by John Barnes • near-singularity AI working as psychologist • review\n ★★★ • “Macy Minnot's Last Christmas on Dione, Ring Racing, Fiddler's Green, the Potter's Garden” • shortstory by Paul J. McAuley • review\n ★★★ • “Safety Tests” • short story by Kristine Kathryn Rusch • a day in the live of a spacepilot test instructor • review\n ★★★ •  “Bricks, Sticks, Straw” • short story by Gwyneth Jones •  remote-controlled A.I.s loose connection  • review\n ★★★1/2  • “Tyche and the Ants” • short story by Hannu Rajaniemi • review\n ★★ • “Obelisk” • short story by Stephen Baxter •  how to build a huge obelisk on Mars • review\n ★★★1/2 • “Vainglory” • short story by Alastair Reynolds • asteroids used as sculpture material • review\n ★★1/2 • “Water Rights” • short story by An Owomoyela • water runs dry in a orbital station • review\n ★★★★1/2 • “The Peak of Eternal Light” • novelette by Bruce Sterling • bicycling on Mercure • review"}, {"userName": "Liviu", "userReviewDate": "Nov 27, 2012", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "Finished the anthology which i bought 2 days ago for the Baxter/Reynolds/McAuley stories and they delivered“The Girl-Thing Who Went Out for Sushi” by Pat Cadigan- nothing for me here as the author's style just doesn't work for me; “The Deeps of the Sky” by Elizabeth Bear- a story from an alien's point of view on Jupiter; see comment above“Drive” by James S.A. Corey- excellent story set early in the Expanse; short but quite human-oriented more than anything; people discussing politics, science, engineering with the threat of war hanging above their heads; one of the big highlights of the anthology and showing how good the authors are at their best“The Road to NPS” by Sandra McDonald and Stephen D. Covey- nothing for me here as the author's style just doesn't work for me; “Swift as a Dream and Fleeting as a Sigh” by John Barnes- very good story about AI's tending to humanity and what happens when they try to be more like humans so to speak“Macy Minnot’s Last Christmas on Dione, Ring Racing, Fiddler’s Green, the Potter’s Garden” by Paul McAuley- not as coherent as other Quite war stories but a great visit through the universe; highly recommended for any fan of the novels and the milieu“Safety Tests” by Kristine Kathryn Rusch- nothing for me here as the author's style just doesn't work for me;“Bricks, Sticks, Straw” by Gwyneth Jones- a decent story that I read and immediately forgot; something with a mission to Jupiter“Tyche and the Ants” by Hannu Rajaniemi- another fast read through and forget as the author's style seems not to work for me; wants to be deep and funny and comes out as pretentious by and large“Obelisk” by Stephen Baxter- excellent story set on a future Chinese Mars where a former heroic ship captain who seems himself as a failure and a conman/businessman with pretensions of grandeur change the future between themselves; another huge highlight of the anthology“Vainglory” by Alastair Reynolds- another superb story with asteroid sculptures and the vanity of the rich“Water Rights” by An Owomoyela- decent story about water and its preciousness when disaster strikes;“The Peak of Eternal Light” by Bruce Sterling- this one could be funny and entertaining but comes up on the smug and annoying side despite some interesting cool world-building on mercury for a change; someone like JC Wright who could write a story like this earnestly, could have made it very good but Bruce Sterling writes it parodically and then it becomes a repeat of essentially steampunk ethos in spaceOverall 5 excellent stories (Corey, Baxter, Reynolds, Barnes, McAuley) two with enough stuff to keep me reading and remembering them for a little while at least (Owomoyela, Sterling), two that I passed fast through and forgot but were readable (Jones, Rajaniemi) and four basically unreadable for me (Cadigan, Bear, McDonald/Covey, Rusch) though the surprise would have been to find them readable. Overall a pretty good ratio for a thematic anthology and I recommend it"}, {"userName": "James", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/6022914-james", "userReview": "[I was a little thrown though by how a group of AIs that so obviously exceed and control the humans were so easily sent packing by the end. (hide spoiler)]"}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "Nominated for the 2013 Hugo Award for novelette.I really like this story for the questions it asks. Would you change your species to survive in space?And going out for sushi isn't what you think. Definitely worth the read, and I'm still thinking."}, {"userName": "Tudor Ciocarlie", "userReviewDate": "Oct 28, 2012", "userURL": "http://www.goodreads.com/user/show/4854547-tudor-ciocarlie", "userReview": "Best anthology of 2012 with great stories by Pat Cadigan, Elizabeth Bear, James S.A. Corey, John Barnes, Paul McAuley, Gwyneth Jones, Hannu Rajaniemi and Alastair Reynolds."}, {"userName": "Alytha", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/7363625-alytha", "userReview": "“The Girl-Thing Who Went Out for Sushi” by Pat Cadigan- Interesting ideas, but unfortunately doesn't bother to explain basically anything, so it gets a bit deliberately confusing.“The Deeps of the Sky” by Elizabeth Bear- A story told from the p-o-v of an alien. Really liked it.“Drive” by James S.A. Corey- Gives some background to tech in the Expanse books. Apparently scientists work on their own, without failsafes then...also, gritty inter-personal stuff.“The Road to NPS” by Sandra McDonald and Stephen D. Covey- Ok story about a race across a frozen moon“Swift as a Dream and Fleeting as a Sigh” by John Barnes- A computer tries to interact with humans, but they're sooo slow...“Macy Minnot’s Last Christmas on Dione, Ring Racing, Fiddler’s Green, the Potter’s Garden” by Paul McAuley- Can't really remember this one, something about a woman retracing her dead father's steps across the moons. Ok story“Safety Tests” by Kristine Kathryn Rusch- Basically mine and my \"expert\"'s job in a couple of hundred years. Ok if pretty dark psychologically.“Bricks, Sticks, Straw” by Gwyneth Jones- Can't remember this one, sorry“Tyche and the Ants” by Hannu Rajaniemi- A girl builds her own reality on the Moon, after her parents leave. Or something. A bit pretentious“Obelisk” by Stephen Baxter- Tedious story about how people in the future are still selfish bastards.“Vainglory” by Alastair Reynolds- A very long-hedged terrorist plan happens. “Water Rights” by An Owomoyela- Somewhat tedious story that could have eased up on the morality cudgel.“The Peak of Eternal Light” by Bruce Sterling- Interesting ideas on a form of society, but doesn't realise its full potential.In general, decent collection with a good average quality, with few highlights, but also few bad stinkers."}, {"userName": "Michael Burnam-Fink", "userReviewDate": "Feb 04, 2013", "userURL": "http://www.goodreads.com/user/show/4828849-michael-burnam-fink", "userReview": "This is an amazing collection of contemporary space-oriented scifi, mostly bent towards the weird, optimistic, and humanistic. Mosts fans will probably pick this up on the strength of a favorite name or three, since a good chunk of the last few decades is represented, but I enjoyed every story. All of them deal with space as a canvas for our ambitions, and ways in which those ambitions mix and collide. The stories are set within the solar system, so no FTL and only a few aliens, but that only increases the wonder of gas giant skies and Titanian snow storms. As with all of these collections, some stories are stronger than others (I'd like to give props to Cadigan, Rausch, and Reynolds), but even the \"bad\" stories are worth your time.First five star book of the year!"}, {"userName": "Krbo", "userReviewDate": "Feb 03, 2015", "userURL": "http://www.goodreads.com/user/show/20371267-krbo", "userReview": "OK pričica, ništ' posebno"}, {"userName": "DMS", "userReviewDate": "Nov 28, 2012", "userURL": "http://www.goodreads.com/user/show/174863-dms", "userReview": "http://dms.booklikes.com/post/382116/..."}, {"userName": "G33z3r", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/7136749-g33z3r", "userReview": "This anthology of stories based in near future in the solar system, featuring a hard SF theme, had a number of really entertaining stories (and a few puzzling ones.)\"The Girl-Thing Who Went Out for Sushi\" by Pat CadiganI think \"The Girl-Thing Who Went Out for Sushi\" is an excellent story of both scifi and social commentary. The author, Pat Cadigan, writes with smooth, highly functional prose that contains a transient sense of humor. The story takes place in Jupiter space, where formerly human workers have been radically genetically modified to be optimized for work in zero gravity. Called \"sushi\", the most common form being an octopus-like being with 8 arms and suckers. One of those \"sushi\", Arkae, provides the narration to the story of a human girl, Fry (the titular girl-thing, also known as the featherless biped) who's been assigned to work in their all-sushi crew. Cadigan told an interesting story. I like her prose style and her occasional sense of humor. She's created several interesting sushi personalities as well as Fry, the human girl-thing. While the sushi normally work mining the rocks around \"the big J\", the story takes place in the run-up to the major comet impact on Jupiter, similar to 1993's Shoemaker-Levy 9's impact, except since there are now people orbiting Jupiter, it's the focus of intense scientific study of the Big J's atmosphere.Cadigan gives a pretty good sense of the working class life of the sushi and the camaraderie among their team. It's also clear that the humans (featherless bipeds) consider themselves the superior masters of their sushi creations, even though the sushi are formerly human and every bit as intelligent and even more capable as they are. Management is all two-steppers, as are all the medical personnel. In the entire operation reports to dirt-siders.Clearly the situation is ripe for change & unrest,....It's tempting to compare the Sushi to Bujold's Vorkosigan Saga's \"Quaddies\", a race of zero-G optimized humans with four hands and no feet. (Their \"origin story\" is told in Falling Free.) The main difference there is the Quaddies didn't start off as bipeds, they were born Quaddies (and unlike Sushi, have the ability to reproduce biologically.) Again, the Corporation feels it owns the life form it created.The tension between the workers at Jupiter and Earth is a pretty common theme in science fiction. E.g., it shows up again in the Expanse story later in this anthology (\"Drive\"), as well as various works of Heinlein and Niven, to name a few. That's a reenactment of the colonial era: European nations create colonies, and eventually the colonies forget their purpose in life is to serve the homeland and start getting subversive ideas like independence.4 Stars ****\"The Deeps of the Sky\" by Elizabeth BearI usually like Bear's science fiction, and her \"The Deeps of the Sky\" is no exception, though I didn't love it.It took me a while to get traction reading this. Given the stated \"hard SF\" nature of the anthology, I was a little surprised to discover a story written in the PoV of an intelligent alien lifeform. The story takes place in the atmosphere of an unidentified gas giant, I'm guessing Jupiter, in these Jovians fly around in the upper atmosphere collecting blowing resources. There's a bit of a worker bee/queen bee division among the Jovians.And into this society, unmanned probe from Earth (I assume) drops down into the atmosphere.There does an interesting job dealing with the alternate chemistry of Jupiter, pointing out that the gases of Jupiter's atmosphere become quite volatile in the presence of oxygen, and that oxygen and nitrogen would likely be poisonous to a ammonia-based life form. As to the alien biology, Bear more or less waves her hands over that, except for such reproductive aspects as are necessary for the plot.As for the First Contact story, I didn't think it broke any new ground.By the way, Bear has previously imagined a different form of life in the upper atmosphere of gas giants. See her short story Boojum.It's also interesting to compare the story to it's counterpart from Arthur C Clarke, A Meeting With Medusa. Clarke also imagines a life form floating in the upper atmosphere, though his is written from the point of view of the \"human\" (who is actually genetically enhanced for his role as explore.)3 Stars ***\"Drive\" by James S. A. CoreyA prequel to Leviathan Wakes, though I think it stands alone fine. The main character, Solomon Epstein, is mentioned once in the Expanse, at the very start of Leviathan Wakes, where he's an historical figure.In some ways I thought reading this was similar to reading McCaffrey's Moreta: when you read a story about a \"historical figure\" from a previous read, you probably know the outline of the story and how it's going to end.Anyway, with that preamble aside, I thought it was a decent standalone story. I thought the transition to flashback was a bit abrupt. \"He met her ten years before.\" Who her? No other character had been even hinted at prior to that sentence. The authors want to drop in the backstory after using the opening paragraphs as the hook to the story. I thought it was a little awkward.So, 3 stars ***\"The Road to NPS\" by Sandra McDonald and Stephen D. CoveyThis is a reasonably straightforward adventure story for relatively low stakes (guy wants to make enough money to go home.)Again we have the presumption of indentured servitude for outer planet workers: the company pays to ship you out to Jupiter orbit, so you owe the company big time and have to work it off.Again I'm surprised at having a \"hard SF\" story discovering life on Europa, though not intelligent. But it doesn't say much about that life, either.On the refreshing side, we have a story with a man and a woman, and no romantic involvement. 3 Stars ***\"Swift as a Dream and Fleeting as a Sigh\" by John BarnesBoy, there was so much great stuff in \"Swift as a Dream and Fleeting as a Sigh\", but such a flat, hasty and disappointing ending.I really liked the exploration of the AI. We have two different varieties. The AI as psychologist, who has, together with his brother AI's, been trying to guide the human race (which has been slowly dying out, it seems.)We also have some fascinating, adaptive AI's in small worker robots. They've been set up to innovate and evolve, in the hopes that they occasionally hit on improvements it can be passed on to their silicon brethren. And one of them has developed a fascinating strategy of sucking up to the boss. (Which apparently really ticks off the boss when he discovers the AI is manipulating him. Strangely, that discovery of AI manipulation doesn't change their trust for the psychotherapist AI.)I read this eagerly, because it seemed like a fascinating story. I was wondering if the psychotherapist AI would either take the side of the worker bot AI's, or another conspiracy or something.Instead the ending was abrupt, flat and unmotivated by the lead-up. An unfortunate conclusion to a story that really had me intrigued.I'm only taking off a few points for the ending, because I enjoyed the trip....4 Stars ****\"Macy Minnot’s Last Christmas on Dione, Ring Racing, Fiddler’s Green, the Potter’s Garden\" by Paul McAuleyBored me totally.1 Star *\"Safety Tests\" by Kristine Kathryn Rusch\"Safety Tests\" is an enjoyable enough story, not breaking any new ground but being interesting in its own way. Not-too-distant future, cis-lunar space, translates the modern techniques for getting a pilot's or driver's license to space with a future DMV flight test official. Amusing enough first-person narration, more situational than plot driven story.3 stars ***\"Bricks, Sticks, Straw\" by Gwyneth JonesInteresting story concept, solid execution.Four rovers operated by telepresence are exploring the Galilean moons, linked to Earth by the Medici craft orbiting Jupiter. Because of the lightspeed time lag, the rovers essentially carry AIs imprinted with the personalities of their Easthbound operator, so that telepresence seems mostly observation, correction of errors, and anticipatory suggestions.When Medici goes into safe mode during a solar flare, the four rovers with their surrogate personalities are left on their own for an extended period, and slowly start to go mad, each in its own way. It took a little time getting into the PoV of Sophie's surrogate AI on Callisto after the opening setup on Earth, Sophie is the most sane of the rover personalities, as she works to maintain her own sanity and tried to snap the others back so they could work together to restart Medici and continue the mission.I felt just slightly let down by the ending, after telepresence was restored, and the human operators may or may not have received a summary of what transpired during their lengthy absence. I tried to read something in the final paragraph, but really couldn't suss it out.By the way, I thought it was interesting that in the opening, Cha was described as the senior citizen of the Medici telepresence team, and in the denouement it's mentioned he's 30 years old.4 Stars ****\"Tyche and the Ants\" by Hannu RajaniemiSomewhere in this childish imagination/hallucination there is a sci-fi story lurking, though it's hard to dig it out. (It's amazing what qualifies as hard SF these days!)A few hundred years in the future, on the moon,...Orphan girl, Tyche, being raised by AI on moon, apparently because genetically enhanced trans-humans such as her parents were outlawed and hunted to extinction a century earlier. She's constructed a fantasyland, I think all in her mind, inhabited by personifications of Moon-related fables from half a dozen national cultures, who seem to keep her original memories.And then the \"Ants\" arrive, some sort of swarm of drones from Earth, searching for her kind. (Presumably to study her modifications and/or complete the extermination.)Evidently nobody wants to tell the girl the truth except her imaginary friends.Not really my style of storytelling, all this abstract pseudo-symbolic hallucinations. (I didn't care for Rajaniemi's Quantum Thief either.) I prefer my stories to make a bit more sense.2.5 stars **1/2*\"Obelisk\" by Stephen BaxterA seemingly pointless story.There's a whole introduction to Wei Binglin, a passenger spaceship captain whose ship was disabled between Earth and Mars due to some undisclosed problem (meteor strike?) He feels guilt for the passengers whose lives were lost, but the rest of the world apparently considers him a hero for managing to get the ship into Mars orbit and save many other lives despite the crippled ship. Baxter never gives us enough information to understand his guilt. At any rate, he decides to settle down on Mars.And somehow, years later, he's mayor of a small Martian settlement (because despite his guilt, he can't help accepting responsibility for others? Seeking a new leadership role seems a strange thing for a guilt wracked man in self-imposed exile to do.)Enter the brash American engineer, Kendrick , apparently exiled from Earth for undisclosed engineering aspirations (If we leave him on earth, he'll talk us into doing something foolish, so we'd better banish him to save us from ourselves? Just saying, \"no,\" apparently not an option.) Both these backgrounds are annoyingly facile. And yet Kendrick somehow talks Mayor Wei Binglin into some grandiose new construction projects. He's that persuasive with his own reality distortion field. All of this seems pretty inconsequential as the story jumps glibly ahead in time. Then we get to the end, and suddenly we're expected to care about a third character whose barely been mentioned, a paradox since apparently both men are alleged to have some sort of emotional tie to the woman. Nonetheless, her entire personality is conjured out of a hat for the last couple paragraphs.The story seems as pointless as Kendrick's obelisk.2 Star **\"Vainglory\" by Alastair ReynoldsNo surprise Reynolds tells an excellent story.Apparently after future humanity has reached all the planets, established a few outposts, and started mining the outer solar system but some serious effort, it's also time for Art to migrate out as well. Most of the story is told in a flashback as a private investigator catches up with an artist talk about a commissioned piece that hardly anyone ever had a chance to see: the head of Michelangelo's David chiseled out of a kilometer-wide asteroid. A bravado statement that was quickly trumped by the sponsor's own sense of art.We have a pair of relationships, one between artist and sponsor, and one between artist and investigator, both are pretty interesting.3.5 stars ***1/2*\"Water Rights\" by An Owomoyela \"Water Rights\" tells a reasonably straightforward story, and I enjoyed reading it. There's a crisis caused by a technological failure/sabotage on the space elevator. Without regular shipments of air, water, and food, the various human-occupied outposts in Earth orbit don't have sufficient supplies to be self-sufficient. Water rationing is especially complicated, because food production via hydroponics is the largest user of water. (Any relationship you may find here to the current discussion of the drought in California and competition between Central Valley agricultural interests and Southern California population centers is purely coincidental, since this book is a couple of years old. :)I liked the storytelling. It starts off with a good hook, and propels itself forward with a sense of urgency, even though that urgency is purely technical and without high risk personal heroics.4 Stars ****\"The Peak of Eternal Light\" by Bruce SterlingU;timately, I missed the point of this story of an elaborately constructed society on Mercury.Some guy named DeBlakey apparently had a dream to colonize first Mercury and then the Sun! Apparently he led a cult-like following of believers to colonize Mercury, using artificially built underground tunnels, because the surface is clearly too hot for anything but robots, and even they only in the terminator zone. Apparently DeBlakey also left them with a strange societal morality involving strict segregation of the genders, both in living and work. There are the number of oddities in the society. Apparently there are ice deposits when Mercury, and initially those glaciers seemed large enough to quench the thirst of millions. But now that there are millions living in the warrens beneath Mercury, the water supply isn't looking so secure. Not that anyone seems to seriously worry about that. DeBlakey blithely sent out a giant manned spaceship to go out to the Ort belt and bring back some comets.Our PoV character, an engineer name Pitar, as reasoned out for himself that a smaller fleet of unmanned robotic crafts could have collected ice far more reliably, but using robots would denigrate Man's proper place in the Universe with. Pitar senses the growing crisis over lack of water, but seems very content to simply accept the wisdom of the heroic ice hunt. When confronted with alternate social arrangements for genders living together practiced on other planets, he dismisses them all has sluts and without honor.I'd expect this sort of passive acceptance of the status quo, sometimes even in the face of evidence that it's not sustainable, to be part of some cultish religious fanaticism, but Sterling doesn't suggest any religious basis for these beliefs, just DeBlakey in some vague concept of honor.In the end, I just didn't understand what Sterling was getting at. There are some obvious satire, some ecological and some social, but if the story had a point, I missed it.2.5 Stars **1/2*"}, {"userName": "Otherwyrld", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/10781757-otherwyrld", "userReview": "A really good collection of short stories set around the exploration and colonisation of the solar system. While I pretty much enjoyed all the stories, the highlight was the Expanse> prequel on the live of Solomon Epstein and the story of how he came to create the drive named after him. It's a sublime piece of work on it's own by James S.A. Corey but taken into context of the series as a whole transcends this story into a 5 stars piece of work. Even if the rest of the stories in this collection do not rise to that level, there is something for everyone in this collection, especially if you are looking for realistic visions of humanity's future in space."}, {"userName": "Paige Ellen Stone", "userReviewDate": "Apr 22, 2013", "userURL": "http://www.goodreads.com/user/show/6789258-paige-ellen-stone", "userReview": "I recently reviewed \"Engineering Infinity.\" It is an anthology edited by Jonathan Strahan, as is this volume. Edge of Infinity, iis, in a sense, a sequel to Engineering Infinity. The premise is the same, put together an anthology of wonderful short works by some of today's Science Fiction and Fantasy writers.As with his previous book, Mr. Strahan has triumphed in his quest. Now, I admit, I just simply LOVE anthologies since I can read shorts works by some of my favorite writers and I am introduced to new ones. It is, in a sense, the best of both worlds. As with all anthologies, I loved some of them, \"The Peak of Eternal Light,\" by Bruce Sterling, whom I would put in the top ten list of sci-fi authors writing today. It demonstrates Sterling's ver dry sense of humor, as well as his unique take on our current culture.I cannot say I disliked any of the stories, not at all. For example, Paul McAuley's, \"Macy Minnot's Last Christmas on Dione, Ring Racing Fiddles's Green, the Potter's Garden,\" is a good, entertaining story, good, but not great. It did not inspire me, as so often happens when I read anthologies, to run out and buy up everything he's written. On the other hand, \"Drive,\" by James S.A. Corey, is good enough that I will look into reading more of his stuff. (BTW, sorry if I offended any McAuley fans.)All in all, if you are a sci-fi enthusiast, you will, I am certain, find some things that you will like in this book. If you are curious about sci-fi and want to know more about it, Edge of Infinity is a great place to start, as is Engineering Infinity. Between the two of them, they demonstate just how far and wide this genre can range. The curious reader will also find that some authors do require more than casual reading, i.e., the reader has to pay close attention, while others can be read in a more leisurely fashion. I apologize for the rambling review, but in conclusion, this a a very fine anthology of modern science fiction writing today. My guess is that all readers will find something they like in the book. Recommended."}, {"userName": "Ananda", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/6762068-ananda", "userReview": "Good set of short stories about humanity's first steps into space. As with most collections they vary in quality but there are only a couple that I thought were not up to the standard of the rest. I really liked the stories from Corey, Reynolds, Barnes, Owomeyela, and Sterling. Corey's is a neat \"origin story\" for his Expanse series, in which he describes the mostly-accidental discovery of the Epstein drive from the point of view of its inventor, Solomon Epstein. Reynolds tells a neat story about an advanced art form, asteroid carving, and a resulting atrocity. Owomeyela, whom I'd never heard of before, tells us about an important decision facing a lunar frontierswoman in the face of a sudden catastrophe. Barnes' entry is basically a well-told Ozymandias on Mars. And Sterling's considers the possibility of massive cultural divergence among the extraterrestrial colonies."}, {"userName": "Katharine (Ventureadlaxre)", "userReviewDate": "Sep 22, 2012", "userURL": "http://www.goodreads.com/user/show/1094570-katharine-ventureadlaxre", "userReview": "Katharine is a judge for the Aurealis Awards. This review is the personal opinion of Katharine herself, and does not necessarily reflect the opinion of any judging panel, the judging coordinator or the Aurealis Awards management team. To be safe, I won't be recording my review here until after the AA are over."}, {"userName": "Sunil", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/7364359-sunil", "userReview": "An impressive amount of worldbuilding for a novelette. Clever, original premise with a good sense of humor from its narrator. Although it was hard to follow, I enjoyed the detailed zaniness of it all, which is actually treated pretty seriously for such an oddball premise."}, {"userName": "Kevin Kelsey", "userReviewDate": "Jan 21, 2015", "userURL": "http://www.goodreads.com/user/show/10445368-kevin-kelsey", "userReview": "Great little short detailing the genesis of the epstein drive."}, {"userName": "Fil Garrison", "userReviewDate": "May 14, 2014", "userURL": "http://www.goodreads.com/user/show/5306860-fil-garrison", "userReview": "The Girl-Thing Who Went Out for Sushi\n by Pat CadiganWhoa. I've never been as plunged headfirst into a universe or world in a short story before. Struggling to catch up to the lingo, the slang, the world itself - it felt a bit like Ann Leckie's Ancillary Justice packed into a shorter format. And that's actually a good thing. The voice telling the story, the world and the ideas really sold me on this story. I give it 4 stars. The idea that people have been evolved into sea-life to colonize and exist in interplanetary space was something I hadn't seen before. In a few short pages, we get the whole idea of how the world works, who these people are, and what it takes to \"go out for sushi.\" It's a wonderful introduction to the series of shorts, and gives a couple of wholly original takes on science fiction, at least in my opinion. I greatly enjoyed the story, but was left lacking for the meat. It didn't quite scratch the itch I was hoping it to.\nThe Deeps of the Sky\n by Elizabeth BearTwo for two in this collection. A very, very weird story with an almost wholly alien protagonist, and a story to compete. Following a Jupiter exploration from the POV of an insectoid/hive mind/angler fish sentient Jovian native, the story itself is an immerse experience, but what really hits home is the final two paragraphs, when you finally realize just how alien the protagonist is. 4 Stars. Much like the story before this, We're introduced to a truly alien landscape, with different ideals and aspirations than humans would normally have. The introduction is a bit long, and again the meat of the story comes in a bit too late for my taste, the authors so far seem very interested in giving information about the world and fleshing it out rather than focusing on character and drama. It's what I expect from a collection like this - focus on ideas over story, but as a writer, it feels like being shortchanged. The final words of the story do really bring it in and actually teared me up a bit. It's a really solid entry, and a pretty fun read.\nDrive\n by James S.A. CoreyThis is really the short story that I bought the whole collection for, so, needless to say, it's my favorite so far. James SA Corey just hits my perfect G-spot of sci-fi action space opera goodness, and this story is no exception. It follows Solomon Epstein, a figure from the past of the Expanse's history, inventor of the technology that allows rapid travel. Superbly written, amazingly done, five stars. I'm trying to look at this story as something without the context of the Expanse Universe behind it, and I think the story still is a compelling one. Like most of the greatest stories ever told, it's part romance, but follows Solomon in his quest to make the drives of ships more efficient, trying to give Mars a leg up on the technological front, bridging the gap between Mars and its parent Earth, working to offset the differences between them. The framing device works so well for this kind of story, and as the it progresses, it becomes more and more apparent that we're reading something special in the context of the Expanse, that it has some kind of small idea that makes it a little different from the kind of story you might expect. It's a great introduction to the Expanse, and a good story in general. That's three out of three stories in this collection that have been really solid.\nThe Road to NPS\n by Sandra McDonald and Stephen D. CoveyThis collection just doesn't seem to want to disappoint. A great drama about a paranoid man who sets out to be the first to prove that Europa can be navigated to deliver cargo via ground rather than orbital arcing, this is a well-told story about a man's struggle to get home and prove himself. A stowaway changes all that, and he's left trying to work with her to get home. 4 stars, due to the ending. I really enjoyed each of the well-shaded characters, each with a life of their own outside the story, and the protagonist, especially, was a peculiar kind of man, almost unlikable, but still grumpy and gruff enough of an anti-hero to enjoy riding with for 85 hours. My only complaint about the story would be the ending. It seems like the authors reached a point where they had simply told all the story they wanted to tell, then wrapped up the rest of the journey in a single sentence, skipping forward in time to the wrap-up. I felt like this had at least another couple of pages left in it, detailing the exhaustion, the paranoia, and the frustration of the main character's journey. But honestly, it's a minor quibble, as the rest of it was very well written, and enjoyable.\nSwift as a Dream and Fleeting as a Sigh\n by John BarnesNow this is just getting ridiculous. This story was fantastic, as they all have been in this collection. A unique perspective, an interesting story that's sort of a non-story, and implications which reach deep into the human condition, this story exemplifies the problems and questions of what it means to be human living with machines, what happens when machines help. 4 stars. The story revolves around a machine that's trained to be a therapist for the remainder of humanity, talking with coal mining robot technicians, working them through their problems while taking time in between answers to read, study, consult, and dream. It's fascinating to watch a therapy session from the point of view of an AI, and this story pulls it off with flying colors. The implied future, the story that presumably follows, they create an excellent world outside the short story, something that all of these shorts have done so far - it goes beyond worldbuilding, and just really fills out that the story is taking place in a real and fleshed out universe.\nMacy Minnot's Last Christmas on Dione, Ring Racing, Fiddler's Green, The Potter's Garden\n by Paul McAuleyI'm beginning to suspect that my love of this short story collection has more to do with the subject matter than anything else. This story has little in the way of plot development, but maximizes the characterizations and descriptions of the future these people inhabit. Stunning description and wonder pervade this 4 star story. At the beginning of this, I really felt like I might not like it. It's an aimless sort of story, all description and characterization - no plot, not point. I was almost ready to write it off as the one bad story in the collection. But looking back at it, it's strange - this actually has more highlights in this one story than in all the others combined - it's a different kind of story. The language is so beautiful. It's almost poetry, which fits because the story deals with art and artists on the frozen moon of Dione. I became engrossed in it. And by the end, it might be the most powerful story in the collection. I looked up the author (which I've done for most of the stories) and find that this is a short story from his series of Quiet War books. Another series added to my list.\nSafety Tests\n by Kristine Kathryn RuschA fun story about what is essentially the DMV in space. Only this job is one of the most dangerous and hazardous you can have, given how easily space can kill you. The story involves a single day in the life of our instructor pilot, his easygoing voice and manner betraying a hard military background. It's an enjoyable piece, fun and sobering. Not as good as the others in the collection though. 3 stars. It's always interesting to see the differences between the authors in this collection, right on the heels of a poetic story, we have a flippant DMV instructor going through his daily routine of trying to fail out pilots due to the fact that it's nearly impossible to fly safely. Our guy is a stickler for the rules, but that keeps him alive - and he's got to deal with six different candidates on this day, something he may or may not make it out alive from. No planetary exploration in this one, but a great look at a minute portion of future space travel nonetheless.\nBricks, Sticks, and Straw\n by Gwyneth JonesAnother of the somewhat poetic stories in this collection, this revolves around a group of Artificial intelligences who are left to their own devices after a solar flare cuts them off from humanity. The structure of this story is the most uplifting I've seen so far - this ignited a ton of story ideas for me, and reminded me of Thomas Was Alone and parts of Portal. Very enjoyable, 4 stars. I've found that the ideas of AI having their own unique personalities and quirks is something that's very enjoyable and beautiful, that something so intricate and perfectly designed has a flaw or a personality trait that would be considered odd or strange. It's the central idea behind all great stories about artificial intelligence, I think - an off the cuff thought, but something that makes them interesting. HAL has his psychopathy, the bots in AI have their love and their need for acceptance, the same goes for video games. We're fascinated with the idea of AI as life we've bestowed, growing and learning with their quirks and eccentricities. This story highlights these in the best way possible. The idea of a memory house and the main AI trying to reignite her friends' passions, pulling them back from the quirky abyss of self-actualization - all handled deftly with a sad pull and an interesting narrative makes this one of the sadder and more beautiful stories in the collection.\nTyche and the Ants\n by Hannu RajaniemiI enjoyed this story, although I think it was a little bit out of sync with the rest of the collection. It involved a rumination of genetic engineering as told through the eyes of a child in a highly imaginative setting. It's one of the stranger stories to grasp in this collection, more questions than answers, but a welcome addition in terms of variety. No disappointment. Three stars to this one. I almost want to go back and read it again to make sure I understand everything. An immortal girl abandoned by her parents on the moon has created a sort of fantasy world for herself with the basalt rocks and the AI managing her. It's an Alice in Wonderland kind of story that takes place on the moon, but ultimately deals with the pain and sadness of being abandoned and different, of being lied to. The Ants themselves figure very little in the story, and I get the feeling that this was a novel idea first, and a short story second. As a novel, it's something I would love to get into, but there's just not enough time it seems in the short. As with many of the other stories, however, I've enjoyed the writing style, and will likely need to seek out this author's other stories.\nObelisk\n by Stephen BaxterThis was the first story that I thought didn't quite have the heart that I'd come to expect from the other stories. It's an interesting tale of architecture and a rumination on taking structures for your own, and how they end up defining your culture and your people, but in the wake of this story, characters are forgotten, and when we reach the end, the punchline isn't as strong because of it. Three stars. I could tell that the author was a lot more interested in exploring the ramifications of a giant structure on Mars geopolitically or in the context of history than it was with the characters that inhabit the world. It felt like a throwback to some of the older science fiction I'd read, more interested in the concept than the story. It works here, but ends up with the climax falling flat, as a character we're supposed to care about commits suicide in front of two people we've been following. It's conceptually great, and I feel like with a novel in between, this would be an excellent story - but as it is, there just wasn't enough room to make this one compelling enough.\nVainglory\n by Alastair ReynoldsMuch in line with the previous story, this is about the future of art and architecture, with artists carving asteroids into gigantic works of art as a testament to themselves and their lives - this story is all about legacy, and it's done with more finesse than the last one, pitting two characters against each other at the end of their lives in an attempt to be remembered. Four stars for this one. It ties together thematically very well, as two 80 year olds talk about the future and what will happen to their names when they're gone. Oddly enough, the story revolves around an act of terrorism so horrible and so disgusting to the main characters, that the entire plot revolves around it - yet by the end of the story, they're discussing their own legacy, which was what motivated the act of terrorism in the first place. It's an examination of human influence on the future, and it works incredibly well as a fable for one's future and what happens when one is gone from this earth. The world presented is great, and the idea is interesting, but theme is where this one really shines.\nWater Rights\n by An OwomoyelaOne of the first stories so far in this collection I didn't much care for. It deals with a woman who is on the frontier of setting up outer-Earth hydroponics business, and her reaction to an explosion that causes a shortage of water in outside of Earth. The way it's told felt a little cold, and I didn't feel much for the characters, though I sympathized with them, it didn't grab me. Two Stars here. The idea itself is interesting, but the introduction and one-note style characters kept me from being instantly engaged in their plight. A couple of small gestures here or there to let me know who these people are, why I should care about them, and why this is such a big deal would have gone a long way. As-is, these elements are glossed over in the bigger scheme of things with the simple idea that \"In the future, water will be a precious commodity, we need to band together.\" It's a fine sentiment, but the story needs roots in character to care. This is the only disappointing story so far in this otherwise fabulous collection.\nThe Peak of Eternal Light\n by Bruce SterlingThe final and longest story in the collection is also somewhat disappointing to me on a tonal and character level, although it's right in line with the world-building focus of the collection. This story deals with a pair of characters who are colonists on Mercury, a strictly separated gender-based society that's reminiscent of the Victorian times, all prim and proper and propriety. It's this angle that doesn't quite work for me - as the reasoning behind the society being structured this way is somewhat thin. Outside of the main story points, of the man and woman interacting as if they are talking with aliens, there are a lot of great ideas in this story. The idea that every planet has its own kind of woman or societal structure, and that the settlers of Mercury look on these \"foreigners\" with disdain is really interesting, as is Sterling's description of one man's pioneering vision of colonizing the sun and humanity's vision of being freed from the solar system, harnessing the power of the sun and using its energy to spread out through the universe unhindered and unimpeded. Although the world-building is great, honestly the characters and their plights turned me off from the story somewhat - there are gender stereotypes being poked fun at here, a lot of \"women think this way, men think this way\" kinds of passages. Although I'm sure the author doesn't actually think this way, it's enough that the characters subscribe to this without much along the lines of satire to turn me off from the story. Their situation isn't silly enough to pull you out of the fact that their society is completely backwards. Overall, this story gets 3.5 to 4 stars from me for it's grand ideas, but poor character and plot execution, with a muddled theme.Overall, this collection really impressed me. Most of them had some really really great aspect of world-building in them, really taking some thought and transporting you into their reality and their world, trying their best to take out from this life on Earth into the near future, not quite galaxy-spanning, but also not quite near-near future. The purpose of this collection was to enter the mid-range area where humanity is spreading out to the other planets and moons in the solar system, and in this, in almost every story, it succeeds. I've really enjoyed reading this off and on over the past few months, and I'm glad to have been introduced to so many great authors from my love of James S.A. Corey. The collection overall is a 4 star ordeal, if only because it loses a little bit of steam at the end, starting with the wildly imaginative stories, then morphing into the traditional power-struggle conceptual stories we're used to."}, {"userName": "Anissa", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/7538688-anissa", "userReview": "I never feel that I read enough in the way of short stories, so I try to get them in through anthologies (I seem to love acquiring solely science fiction anthologies). I bought this one a while ago and am glad to have finally got around to reading it. There are some gems here and as usual, some new to me authors that I now want to seek out longer works by. The Girl-Thing Who Went Out For Sushi by Pat ConroyExcellent story & my measure of those is that I get to the end & want to know more. I hoped the rest would live up to such a wonderful beginning & then thought I was glad this one wasn't put at the end. Humans going through some serious changes to live and work out in far space. Fascinating and kind of scary. Definitely an author whose work I'll seek out.Drive by James Corey As a fan of The Expanse series, I'd already read this short and can say, it's very good. It reminded me that I need to get back to reading that series.Safety Tests by Kristine Kathryn Rausch. Even in space the licensing of vehicle operators is dicey. This definitely made me want to get back to her Retrieval Artist series.Vainglory by Alastair Reynolds. I really enjoyed this short about an artist whose medium is asteroids and the guy who basically uses her art as a conduit to mass destruction all for his, well the title says it all. I have lots of Reynolds' books in my deep TBR pile & I've put reading them off because getting drawn into yet another series is a bit daunting a thought (I've so many I'm in the midst of already!). But, I'm thinking I'm going to just have to because this made me hope this was part of those worlds and I want to know more.Water Rights by An Owomoyela. Tense times after the ascender from Earth that transports water to space is disrupted by what may not have been an accident. Jordan, owner of the hydro rig Owole Hydroponics has her dreams of roses in space evaporate but only temporarily. A good story about the importance of water and peopel helping one another out & also making the dream of one, the rallying point for all. This definitely made me want to read more by Owomoyela.Overall, this was a pretty good collection. I've mentioned my favorites here but that's not to say the other stories weren't good as well. With anthologies, it's always about personal taste so I'd recommend this one. I found enough that makes me want to seek out the \"new to me\" authors' other work and that's one of the things I always look for."}, {"userName": "Francisco Colmenares", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/42159798-francisco-colmenares", "userReview": "Lots of good stories here. Well worth the price. Some are straightforward in plot. Others require careful reading or repeat reading to grasp the author's point. For the most part these stories are about the implications of a situation or technology. Others are simply a short exploration with some world building. Not every story satisfied me, as I found a few lacking the proper execution. Others left me wanting to know more about the world presented to me. On balance it's a positive collection for stories to read."}, {"userName": "Patrick", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/2025025-patrick", "userReview": "It's definitely a mixed bag. There were plenty of stories I enjoyed, and a few that were not quite my taste, but I suppose that's the interesting part of an anthology...plenty to choose from, and you can just skip what you aren't into."}, {"userName": "Agnieszka", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/704067-agnieszka", "userReview": "This is an anthology of of short stories set in the mostly human inhabited solar system, by different authors. Some of the stories are stronger than others."}, {"userName": "Joe Karpierz", "userReviewDate": "Jul 04, 2014", "userURL": "http://www.goodreads.com/user/show/12907299-joe-karpierz", "userReview": "I've been finding myself reading a lot of short fiction recently. When I try to determine the reason for that, I come to the conclusion that it's either because I have a shorter reading attention span these days, or short fiction is suited for air travel, which I'm doing a lot of these days for work. It's probably some of both. I definitely am tired of door stop sized novels, or certainly very long ones anyway (I certainly do pine for the long ago days in which novels ran from 200 to 250 pages in length).EDGE OF INFINITY is the second book in editor Jonathan Strahan's Infinity project. The third book, REACH FOR INFINITY, has been promoted closer to the top of my to-read list, and the fourth book, MEETING INFINITY, is set for publication later this year. I wasn't overly fond of ENGINEERING INFINITY, the first book of the project, but EDGE OF INFINITY was terrific, and has me looking forward to more books in the project.The stories in EDGE OF INFINITY explore the future of humanity in our Solar System. Every story takes place there, and the anthology covers a wide range of topics and themes, which makes sense, given the vastness of the Solar System. There should be all sorts of stories on all sorts of worlds. And, where I was a bit disappointed in more than a few of the stories in ENGINEERING INFINITY, I had almost no issues with any of the stories in EDGE OF INFINITY. Maybe that's because of the focus of the stories, maybe not. But it is so nonetheless.Strahan doesn't waste any time, leading the book of with 2013 Hugo Award Winning novelette \"The Girl Thing Who Went Out for Sushi\". This is one of three or four stories that I have read and reviewed elsewhere, and upon a second (or maybe third) reading of this Pat Cadigan gem supports and strengthens my positive feelings about this story. Other stories that have appeared (and I have read elsewhere) include Hannu Rajaniemi's \"Tyche and the Ants\", Gwyneth Jones \"Bricks, Sticks, Straw\", and Bruce Sterling's \"The Peak of Eternal Light\". As with the Cadigan, multiple readings of these stories have made me like these stories more than I did before - especially when I may not have liked them as much the first time around.The authors of the rest of the stories in this anthology reads like a Who's Who of the field: Alastair Reynolds, Stephen Baxter, Kristine Kathryn Rusch,Paul McCauley, Elizabeth Bear, John Barnes, and James S.A. Corey. There are names that are new to me as well. For the most part they are good, solid,readable, and enjoyable stories. Rusch's \"Safety Test\" is a glimpse into the workday of a guy who tests the ability of space pilots; think the guy at the DMV who rides in the car with the teenager looking for his or her first license. \"Vainglory\", by Alastair Reynolds, gives us a look at an artist looking to leave cement his legacy in a way that has unintended consequences (or are they?). \"Macy Minnot's Last Christmas on Dione, Ring Racing, Fiddler's Green, the Potter's Garden\" by Paul McCauley follows Mai Kumal looking to respect her father's last wishes upon his death, and in the process learns about the life and people he left earth for. John Barnes' \"Swift as a Dream, Fleeting as a Sigh\" gives us a bit of a look at an AI psychotherapist, and what happens when that AI does some things that really shouldn't have been done. James S.A. Corey gives us \"Drive\", a prequel to the popular Expanse series that follows Solomon Epstein and his invention of the Epstein drive. Obelisk, by Stephen Baxter, explores how a man's vision to honor a legendary explorer can come at a huge cost.There are other stories here, and while not all of them were as terrific as the stories I've talked about, their all of above average quality. There really isn't a bad story in the bunch. This is why I've moved REACH FOR INFINITY up my to-read list, and I'm looking forward to reading it and MEETING INFINITY."}, {"userName": "Cathy ", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/1526945-cathy", "userReview": "I started this book a year ago when The Girl-Thing Who Went Out for Sushi was nominated for the 2013 Hugo Award for Best Novelette, and a whole bunch of other awards. I never got back to it after reading that story before it was due back to the library, but this year I got into reading short stories and I'm going back through a lot of the award lists for the last few years. I saw that Elizabeth Bear's story was nominated for a Locus Award in 2013 as well so I reserved the book again. Unfortunately I still didn't get to it quickly enough so it's back to the library again, but this time I really will get back to it before another year is out! The entire book was nominated for best anthology by the Locus Awards and it does look like one that I'd enjoy. Soon.Pat Cadigan - The Girl-Thing Who Went Out for Sushi - I really enjoyed the story. I actually kind of remember reading it, which is unusual. I liked the characters and the set-up, and I could see why it was nominated. Much less depressing than most nominated stories, sort of. Really. It definitely fit the theme of the book too, it was a great way to start it off.Elizabeth Bear - The Deeps of the Sky - A very good story, rich in detail about the setting and a fascinating glimpse of who these other people might be. A brief first contact story. On her site Bear described it as, \"a fable of the perils and pitfalls of sky-mining gas giants… but not only that.\" io9 still has the story online if you'd like to read just it.-- I liked Bear's story much more than Mantis Wives by Kij Johnson, nominated for both the Hugo and Lotus Awards, I just didn't get that one. I did like I like Mono no Aware by Ken Liu a lot, that's the one that won the Hugo. I also liked Immersion by Aliette de Bodard quite well, which won the Lotus Award (they seem to get it right a lot). Between that story and The Waiting Stars I discovered that she's written more than a dozen stories in her Xuya universe so I'm going to try to read all of them, many are posted online for free. She has a bibliography with a timeline and many links on her website. Ursula K. Le Guin's story Elementals , also nominated for the Lotus Award, was cute. It was nice to read a story that was clever and charming without being so damn serious, though you could get deep with it if you were trying, I'm sure. Maybe that's what Kij Johnson's was supposed to be too, they're kind of similar in structure actually, but it wasn't for me. All of these stories are available online.OK, enough off topic rambling and notes that are really for myself. I'll get back to the actual book review eventually."}, {"userName": "Michael Smith", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/36354969-michael-smith", "userReview": "Only to experienced science fiction readers who are used to thinking in terms of galaxy-spanning distances would our own planetary system seem “local,” but that’s the theme of this anthology of original short pieces by an array of authors both well-known and not so much. In his introduction, Strahan makes the point that SF has long been obsessed with its own death as a genre, but this is because science fiction is constantly being “killed by science.” Mars is the perfect example; no one has tried to write an old-style Martian adventure story since the Mariner missions told us what the place is really like. But one response to our first tiny steps into space has been the arrival of SF’s “Fourth Generation,” focused not on FTL drives but on settling the nearby planets, mining the asteroids, and building frontier settlements on the moons of Saturn and Neptune.Of the fifteen stories in this volume, most are decent reading. And there are several that are quite good. “The Girl Thing Who Went Out for Sushi,” by Pat Cadigan, may remind you a bit of John Varley’s post-humans living and working in Saturn’s rings. James S. A. Corey’s “Drive” is set very early in their “Expanse” universe, at a time when Earth and Mars are still trying to figure out how not to go to war and the asteroids are still waiting. “Safety Tests,” by Kristine Kathryn Rusch, is a take on the outer-planet version of the DMV, with a good deal of sly humor. And while I’m not especially a Stephen Baxter fan, his “Obelisk,” about the development of Mars by the Chinese is quite good. Alastair Reynolds’s “Vainglory” explores the place of art on the far frontier of the system and is also very original. On the other hand, there were a couple of stories that I just couldn’t be bothered to finish -- par for the course, I guess -- and one of those was Bruce Sterling’s “The Peak of Eternal Light,” the theme of which (I think) is gender politics on Mercury. Unfortunately, it was rather self-indulgent and cutesy. Bruce is an interesting guy to talk to at WorldCons, but I think his non-fictional screeds are generally better than his fiction."}, {"userName": "Alex Sarll", "userReviewDate": "Feb 23, 2015", "userURL": "http://www.goodreads.com/user/show/5866774-alex-sarll", "userReview": "The last Strahan-edited anthology I read was a fairly terrible selection of fantasy, but there were enough promising names here to make me give him another chance – a decision with which I'm very happy. Obviously I was more impressed by some stories here than others (it'd take more than a relocation to Europa to make me particularly interested in Ice Road Truckers), but there's not one outright dud in sight. Obviously the book's concept (near future settings within our solar system, science at least semi-hard) ensures a certain number of shared settings and themes, but it never feels repetitive in the way the fantasy book did, not even when we encounter our second set of problematic robot ants. There are stories here set in the worlds of novels I know (the prehistory of James Corey's Expanse supplies a particularly haunting one; Stephen Baxter prefaces Proxima, and Paul McAuley returns to the aftermath of the Quiet War), though oddly no explicit mention is made of this; readers are left to draw the connections themselves, which seems a missed promotional opportunity. But there are also writers I don't know particularly well, most notably Pat Cadigan and John Barnes, who provide fascinating self-contained pieces which convince me their work deserves further attention (the latter supplies one of those robot ant stories, and it's a sneaky wee bastard of a piece, all about love and manipulation, which asks exactly the sort of unsettling questions literature should ask and which, in this case as so many, only science fiction really can).My one major concern is with the author bios at the back. Some, joky, give the impression authors supplied their own. But what then of Kristine Kathryn Rusch's, twice the length of anyone else's, or Stephen Baxter, \"one of the most important science fiction writers to emerge from Britain in the past thirty years\"?"}, {"userName": "Carl V. ", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/2973774-carl-v", "userReview": "In the introduction to his previous original SF anthology, Engineering Infinity, Jonathan Strahan coined the term “fourth generation science fiction” to describe where he feels science fiction is and will go in the second decade of the twenty-first century. I feel obliged to note here that Strahan’s introduction is a perfect example of what an introduction should be. It does nothing to spoil any of the joy of reading that is to follow and instead references the purpose of the anthology and posits many interesting things about the future of science fiction. It is a must-read.Jonathan Strahan references the idea that science itself brings about the “science fiction is dying (or already dead)” wail that is heard with alarming regularity within the SF community. Jonathan Strahan is not decrying science or the wonders revealed by scientific study, but he posits that “this constant barrage of fact can be the enemy of romance, and science fiction needs romance to survive”. Fourth generation science fiction then is fiction that is meant to merge the “romance of science and the romance of fiction” into stories that move SF away from the realm of Earth-bound dystopian futures and inspire both readers and scientists to embrace our love affair with tomorrow, to look to our own Solar System as the next great frontier of exploration. For the most part the choices Jonathan Strahan made for this anthology reflect this dream beautifully. Edge of Infinity is one of the best anthologies of science fiction short stories that I have ever read. The stories infuse an air of optimism into the heart of those who long to see humanity explore the wonders in our immediate universe.For non-spoiler overviews of each individual story, please visit my blog entry:http://www.stainlesssteeldroppings.co..."}, {"userName": "Angie Boyter", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/3093693-angie-boyter", "userReview": "All of these stories are set in the solar system, but they are all over the map otherwise! Some were not too bad; others I finished gritting my teeth; I gave up on three of them.Several of the stories set up interesting characters in interesting situations and settings but then came to no real ending. Whether this was because the author had no idea what the conclusion really was or whether there was just not enough space in the short-story format makes no real difference---it still leaves the reader with an unsatisfactory experience. A couple of times I got the feeling the author might be suggesting something subtly at the end, but, if so, I was not perceptive enough to pick it up. Several times I thought, \"That COULD have been good\" but never \"That was GOOD\".A minor quibble I would have omitted had I liked the book more was the editing. I like it when the editor tells a bit about why he selected the books or authors in the anthology, either in the introduction or as a preface to each story. Strahan tells the genesis of the idea for the anthology in the three-page introduction but nothing about why these authors or stories were selected. There are short bios of the authors at the end of the book (not mentioned in the Table of Contents)that were obviously provided by the authors themselves."}, {"userName": "Mark", "userReviewDate": "Nov 03, 2013", "userURL": "http://www.goodreads.com/user/show/3365540-mark", "userReview": "Probably one of the weirdest and yet most satisfying short stories I've ever read. I knew this was going to be a hard sci-fi tale going in and this tale needs a new genre. Something like Hardest Sci-fi maybe? I didn't rate it high, mainly because it feels like it was written for teens when teens barely ever read this style of sci-fi, but I encourage anyone who likes hard sci-fi to read this. It's strange and unique and for some reason it makes sense... in the future anyway.Merged review:The Girl-Thing Who Went Out for Sushi by Pat Cadigan (7/10)The Deeps of the Sky by Elizabeth Bear (6/10)Drive by James S.A. Corey (8/10)The Road to NPS by Sandra McDonald and Stephen D. Covey (7/10)Swift as a Dream and Fleeting as a Sigh by John Barnes (7/10)Macy Minnot’s Last Christmas on Dione, Ring Racing, Fiddler’s Green, the Potter’s Garden by Paul McAuley (6.5/10)Safety Tests by Kristine Kathryn Rusch (8/10)Bricks, Sticks, Straw by Gwyneth Jones (6/10)Tyche and the Ants by Hannu Rajaniemi (4/10)Obelisk by Stephen Baxter (8/10)Vainglory by Alastair Reynolds (10/10)Water Rights by An Owomoyela (6/10)The Peak of Eternal Light by Bruce Sterling (7/10)Average: 6.96/10"}, {"userName": "William", "userReviewDate": "Nov 12, 2014", "userURL": "http://www.goodreads.com/user/show/36549125-william", "userReview": "1. The Girl-Thing Who Went Out for Sushi - clever, fun, unusual.2. The Deeps of the Sky - not to my taste3. Drive - James S A Corey's short story about the creation of the Epstein star drive. Wonderful, magical. The ending is exquisite and left me in tears. •• This story alone is worth the price of the book.4. The Road to NPS - abruptly ends just as it's getting started. Too bad.5. Swift as a Dream, Fleeting as a Sigh - human, wonderful and sad, tragic.6. Macy Minnot's Last Christmas on Dione.... The author Paul McAuley is an amazing, extraordinary talent. This story is a gem, perfectly rendered and filled with wonder and love. A perfect example of why science fiction is the King of all fictions. •• Alone, this story is worth the price of the book.7. Safety Tests - A \"day in the life\" of a driving (spaceships) instructor/tester. Quite a bit of fun, just the right amount of sarcasm, with a delightfully surprise ending!Unfortunately, the remaining stories in this anthology were very poor :(8. \"Bricks, Sticks, Straw\" by Gwyneth Jones9. \"Tyche and the Ants\" by Hannu Rajaniemi10. \"Obelisk\" by Stephen Baxter11. \"Vainglory\" by Alastair Reynolds12. \"Water Rights\" by An Owomoyela13. \"The Peak of Eternal Light\" by Bruce Sterling"}, {"userName": "Willy Eckerslike", "userReviewDate": "May 23, 2014", "userURL": "http://www.goodreads.com/user/show/31661814-willy-eckerslike", "userReview": "Short stories are a great way to encounter new authors and make the perfect vehicle for science fiction; there’s no room for padding or tedious info-dumps, just taut craftsman-like storytelling. In this carefully compiled collection of stories there are works from, to me, both familiar and unfamiliar authors, all on the theme of man’s tentative steps in the colonisation and exploitation of the system. There are no pan-galactic civilisations and no FTL drives, just pioneers doing their thing. As with any anthology, not every story will appeal equally to every reader but that is the beauty of science fiction; it is such a vast and varied genre both in terms of content and readership that I’d hope that any sci-fi reader, either novice or old hand would thoroughly enjoy this volume.My particular favourites in my new author category were Pat Cadigan and John Barns’ offerings; all the stories from my familiar authors were a joy, Reynolds and Corey in particular; while Hannu Rajaniemi’s tale re-confirmed my view following reading The Quantum Thief. There are a few proofing errors (is it me or are there more of those than there used to be?) but otherwise a thoroughly enjoyable and swiftly read collection."}], "description": "Contains \"The Girl-Thing Who Went Out for Sushi\" by Pat Cadigan, which won the Hugo Award for Best Novelette (2013) and the Locus Award for SF Best Novelette (2013).\"One giant leap for mankind\". Those were Neil Armstrong's immortal words when he became the first human being to step onto another world. All at once, the horizon expanded; the human race was no longer Earthbound.Our destiny would now be to reach out to eternity. Brought to you by the creators of Engineering Infinity, Edge of Infinity is an exhilarating new SF anthology that looks at the next giant leap for humankind: the leap from our home world out into the Solar System. From the eerie transformations in Pat Cadigan's The Girl-Thing Who Went Out for Sushi to the frontier spirit of Sandra McDonald and Stephen D. Covey's The Road to NPS, and from the grandiose vision of Alastair Reynolds' Vainglory to the workaday familiarity of Kristine Kathryn Rusch's Safety Tests, the thirteen stories in this anthology span the whole of the human condition in their race to colonise Earth's nearest neighbours.CONTENT \"The Girl-Thing Who Went Out for Sushi\" by Pat Cadigan \"The Deeps of the Sky\" by Elizabeth Bear \"Drive\" by James S. A. Corey \"The Road to NPS\" by Sandra McDonald and Stephen D. Covey \"Swift as a Dream and Fleeting as a Sigh\" by John Barnes \"Macy Minnot’s Last Christmas on Dione, Ring Racing, Fiddler’s Green, the Potter’s Garden\" by Paul McAuley \"Safety Tests\" by Kristine Kathryn Rusch \"Bricks, Sticks, Straw\" by Gwyneth Jones \"Tyche and the Ants\" by Hannu Rajaniemi \"Obelisk\" by Stephen Baxter \"Vainglory\" by Alastair Reynolds \"Water Rights\" by An Owomoyela \"The Peak of Eternal Light\" by Bruce Sterling", "title": "Edge of Infinity\n      \n          (Infinity Project #2)", "url": "http://www.goodreads.com/book/show/13547291-edge-of-infinity", "average": 3.7, "cover": "https://images.gr-assets.com/books/1350927167l/13547291.jpg", "reviews": 86, "authors": [{"url": "https://www.goodreads.com/author/show/56352.Jonathan_Strahan", "name": "Jonathan Strahan"}, {"url": "https://www.goodreads.com/author/show/27841.Pat_Cadigan", "name": "Pat Cadigan"}, {"url": "https://www.goodreads.com/author/show/108173.Elizabeth_Bear", "name": "Elizabeth Bear"}, {"url": "https://www.goodreads.com/author/show/4192148.James_S_A_Corey", "name": "James S.A. Corey"}, {"url": "https://www.goodreads.com/author/show/265279.Sandra_McDonald", "name": "Sandra McDonald"}, {"url": "https://www.goodreads.com/author/show/6470566.Stephen_D_Covey", "name": "Stephen D. Covey"}, {"url": "https://www.goodreads.com/author/show/45596.John_Barnes", "name": "John Barnes"}, {"url": "https://www.goodreads.com/author/show/20433.Paul_McAuley", "name": "Paul McAuley"}, {"url": "https://www.goodreads.com/author/show/43989.Kristine_Kathryn_Rusch", "name": "Kristine Kathryn Rusch"}, {"url": "https://www.goodreads.com/author/show/7272.Gwyneth_Jones", "name": "Gwyneth Jones"}, {"url": "https://www.goodreads.com/author/show/2768002.Hannu_Rajaniemi", "name": "Hannu Rajaniemi"}, {"url": "https://www.goodreads.com/author/show/20295.Stephen_Baxter", "name": "Stephen Baxter"}, {"url": "https://www.goodreads.com/author/show/51204.Alastair_Reynolds", "name": "Alastair Reynolds"}, {"url": "https://www.goodreads.com/author/show/4356849.An_Owomoyela", "name": "An Owomoyela"}, {"url": "https://www.goodreads.com/author/show/34429.Bruce_Sterling", "name": "Bruce Sterling"}], "type": ["Science Fiction", "Anthologies", "Short Stories"], "outlinks": ["http://www.goodreads.com/book/show/13547291-edge-of-infinity", "http://www.goodreads.com/book/show/17059142-edge-of-infinity", "http://www.goodreads.com/book/show/17253000-edge-of-infinity", "http://www.goodreads.com/book/show/13262782-under-my-hat", "http://www.goodreads.com/book/show/7022843-swords-dark-magic", "http://www.goodreads.com/book/show/8483622-engineering-infinity", "http://www.goodreads.com/book/show/2509832.The_Starry_Rift", "http://www.goodreads.com/book/show/7416873-wings-of-fire"]}