{"ratings": 13335, "userreviews": [{"userName": "Michelle Thieme", "userReviewDate": "Aug 11, 2013", "userURL": "http://www.goodreads.com/user/show/11592664-michelle-thieme", "userReview": "I loved, loved, loved, loved, L.O.V.E.D., this book! I was powerfully moved by Giovanna, the main character, and her sheer strength of will. Based on true events from the author's family history, I felt the book opened a whole new world for me as I'm not really a fan of turn of the 20th century American history. But, the author's grandmother lives in the retirement community where I work and I told her that I'd read it. Loved it!When I told my resident (author's grandmother), how much I enjoyed the book, how much I admired the main character, I then got a delightful sidebar of more stories of Giovanna and the family after they left NYC. My resident is the daughter of Giovanna's daughter, Angelina, the one who played a significant role in the latter part of the book, and so in turn, my resident is the granddaughter of Giovanna.It was nice to learn that Giovanna's indomitable spirit and \"modern\" heroine nature was indeed genuine and not just a device of the book to make readers relate to her better. I also learned that the author did painstaking research into many of the events depicted in her book such as the earthquake and tsunami as well as the Black Hand. But, despite all that, I really did enjoy the book. It was well researched, well written and for someone who doesn't truly enjoy reading this genre, a pleasurable experience. It paved the way for me to be more open to reading more of the same such as \"The Virgin Cure.\"Enjoy!"}, {"userName": "Debbie", "userReviewDate": "Jun 24, 2011", "userURL": "http://www.goodreads.com/user/show/4044140-debbie", "userReview": "Elizabeth Street is the remarkable story of Italian immigrants living in New York City at the turn of the 20th century. This book is both educational and enjoyable. Within its pages you will learn what it was like to cross the ocean and pass through Ellis Island as an immigrant. You will learn what it’s like to become a widow in a foreign country. You will learn about the 1908 Messina earthquake which killed more than 100,000 people in southern Italy. You will learn about the Black Hand, a form of extortion popular among criminals in New York's Italian community. And you will learn about love and tragedy and family.Fabiano's attention to historical detail is evident throughout the book. And readers should not forget that this story is based on Fabiano’s own family history. I recommend this book to those interested in Italian immigration at the turn of the 20th century, those interested in organized crime, and those interested in books in which the protagonist is a strong, clever, persistent woman."}, {"userName": "Rachel", "userReviewDate": "Jul 24, 2010", "userURL": "http://www.goodreads.com/user/show/3364520-rachel", "userReview": "This book was not what I expected. I thought it was going to be a story about several characters all living in the same street over many years. I was pleasantly surprised to learn that this book, instead, focused on one amazingly strong female character. Of course there were other players in the story(ies) but our interest in their stories was always to support our understanding of the main character.And the book did jump around in time but the later time period was directly related to the earlier time in a way that becomes more clear as the book progresses.There are too few book (and hard to search for) that act as a vehicle for a strong female character. This woman lived in hard times but was not brought down by hard times. She was always just a little bit more than everyone around her. She wasn't a superhero and she wasn't impervious but she was a little stronger, a little smarter, a little more educated, and mostly, a little more sure of herself and willing to break rules or bend social mores to get her way or to improve her situation."}, {"userName": "Jeannie Mancini", "userReviewDate": "Oct 01, 2010", "userURL": "http://www.goodreads.com/user/show/2608576-jeannie-mancini", "userReview": "From the Old Country to the Land of LibertyLaurie Fabiano’s new historical novel Elizabeth Street is a fictionalized account of the life of her Grandmother, Giovanna Costa, who crossed the Atlantic in 1902 from Calabria Italy to investigate the death of her husband Nunzio who had made the journey the previous year to find a job and earn enough money for his wife’s passage. Sailing into New York harbor beneath Lady Liberty’s torch, Giovanna soon steps on American shores and is met by her brother-in-law Lorenzo, who will take her to live with his family. Giovanna is then told the shocking and brutal details of how Nunzio was killed on the job at the local Gas company, and together her and Lorenzo hire a lawyer to sue the company for her husbands horrifying death due to their negligence. As Giovanna tries to settle in and learns to navigate the filthy streets of the Italian quarter of New York, struggles with the language barrier, the legal system, and grieves over her loss, she slowly builds a life for herself and remarries another Calabrian who is a produce merchant. Both widows start anew building a family and grocery business, but as life has a tendency to never give people a break in life, troubles and tragedy hit Giovanna hard when the Black Hand, the old name for the Mafia, reeks havoc in their lives by bombing their store and kidnapping their baby girl. What Giovanna does to overcome the threat of extortion, murder, and the concept that she may never see her baby Angelina again, will shock and astound readers as they silently read and cheer her bravery and determination on as she turns the table around and gives the Black Hand a good dose of their own medicine as she learns to play hardball and the hunted becomes the hunter. The author’s retelling of her grandmother’s life is a gripping and fascinating up-close-and-personal view into the world of New York’s turn-of-the-century immigrant life. She offers the reader an honest and realistic picture depicting a life of total hardship, poverty, and chaos amidst the Italian people trying hard to make a new life. This was at a time when the early Mafia gangs were growing and raking in the dough through extortion and terrorizing innocent people. Fabiano’s writing is amazingly poignant and emotional, you will feel for Giovanna and her family as their new life brings only pain, and will immediately be pulled into her story that is so evocative of the time and place you will not be able to put the book down until you finish it. As an Italian-American with Calabrian roots from my father’s parents who came over from Italy in the mid 1800’s, Elizabeth Street helped me greatly to understand the early immigrant culture and life that my own grandparents would have experienced. Thank you Laurie Fabiano for a sensational book! I truly loved this story and believe all Italian Americans today would too."}, {"userName": "Felice", "userReviewDate": "Nov 02, 2011", "userURL": "http://www.goodreads.com/user/show/2507841-felice", "userReview": "It's been a while since I have read an American immigrant story. For years they were a staple of my reading then I got out of the habit. I wasn't sure why but after reading Elizabeth Street by Laurie Fabiano I may have the answer. Cliches. Elizabeth Street is the story of one woman's immigrant experience. In the early days of the twentieth century Giovanna Costa leaves her home in Italy with all of it's ties and tragedies to find out what has happened to her husband and make a new life in New York. With this new life comes new happiness and new problems. Giovanna's struggles to push her family out of poverty and into prosperity are a mish mash of every Taylor Caldwall, Belva Plain, Howard Fast and John Jakes novel you ever read. Fabiano hits all the high points including tragic love, crushing poverty, unimaginably horrible tenements, the Black Hand, kidnapping, extortion, tested loyalties, etc. Not to worry though because Giovanna is that most common of all historical novel's elements--Ta Da-- The Woman Ahead Of Her Time. Sigh.Elizabeth Street does have interesting history and credible settings. Carving out a life for yourself as an immigrant in New York City at the turn of the century would have taken extraordinary courage and perserverance and Fabiano pays believable hommage to all those difficulties. Fabiano also does a good job alternating the narrative between Giovanna's story and the present day but by the end of the book it's just another story you have read before"}, {"userName": "Jess", "userReviewDate": "Jan 16, 2011", "userURL": "http://www.goodreads.com/user/show/1505098-jess", "userReview": "This book was alright. It had some interesting ideas and I liked some of the history. I was however fairly disappointed in the ending. You knew for half of the book what was going to happen in the end so all of what I assume was supposed to be the climactic part of the story was pretty boring. I found out about the book through the amazon kindle daily post. They were highlighting upcoming authors and this book was pretty cheap. It was kind of fun to read something that I hadn't heard anything about beforehand and just found on my own.I pretty much agree with this review from amazon, \"The book appeared to be a compendium of broad events in Italy and the US, then suddenly, at about 60% of the way through, it switched to a kidnapping thriller. This disjointedness left me puzzled until I got to the end and discovered that the story was based on the kidnapping of the author's grandmother. So, it seems that the author had a nugget of a family story and fleshed it out with extensive research on Italian immigration at the turn of the century. Even knowing this, it didn't change my impression of the book. It didn't flow and was a fairly superficial treatment of the time. The writing was simply not done very well, and I can't recommend this book.\""}, {"userName": "Sjcapanna", "userReviewDate": "Jan 17, 2011", "userURL": "http://www.goodreads.com/user/show/2682382-sjcapanna", "userReview": "What a disappointing way to start my 2011 reading list. I got this book because it was $4 on the Kindle, and I thought I might have stumbled on some hidden gem. Hidden? Yes. Gem? No.This is a book about immigrants living in tenements in the 1900s, so I thought it might be like A Tree Grows in Brooklyn. It was not, in that Tree was good. Also it's about Italian immigrants, so I thought it might give me some insight into what it was like for my ancestors. And maybe it did. It was very Mafia-heavy, which was probably realistic. The problem was somehow in the pacing of the story. Like, first of all, it seemed to be three separate short stories that happened to be about the same people. (Which, in the author's defense, it was a true-life novel based on events that happened to her grandparents, and people's lives are kind of more of a series of phases than one coherent story.) Second, the author gave away the big drama way too early (in the form of \"Oh now it's 1966 and I'm just talking to my grandma about her life in 1909\"), and gave away about how long it was going to take to resolve this drama. So, it's like I'm going along thinking, I know this attempt to solve the problem won't be successful, because the grandma said they didn't solve the problem until such-and-such a point. That took a lot of suspense out of the book and made it kind of a major chore to read."}, {"userName": "Peggy", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/3941502-peggy", "userReview": "Why did I not read this sooner?! I bought this as an ebook deal exactly 3 years ago and then lost interest and never felt like picking it up. Until now, when a reading challenge sort of forced me. I wasn't hooked from the beginning, but it didn't take long. The setting was very interesting, and I haven't read many immigrant books yet. I loved Giovanna, what a fantastic woman! I also loved that the book was so well-researched and that both the characters and the events were real. I spent a lot of time on google looking for more information on what I read. I'm so glad I finally read this. Definitely recommended!"}, {"userName": "Yoonmee", "userReviewDate": "Jan 14, 2012", "userURL": "http://www.goodreads.com/user/show/265156-yoonmee", "userReview": "I'm surprised this got so many good reviews. Well, maybe not surprised. Who knows. I wasn't impressed at all by this story. Let me back up and note that this was the very first book I read on my Kindle, so that may have influenced how I felt about the book. Although, I don't think reading it on the Kindle influenced my opinion, you never know. I'm certainly not against technology nor am I against reading online, reading on e-readers, cell phones, etc. In fact, I embrace all those things and would have gotten a Kindle sooner if it had been within my meager budget.Moving along with the book review: I just wasn't impressed. While the story is certainly interesting, the writing just wasn't all that great. (It could also be said that the writing in this review is not that great... heh.) Sure, we get to get a glimpse into the lives of Italian immigrants to the US at the turn of the century, but it just felt like Fabiano either isn't a great writer and/or she was writing for a rather slow, dull audience. I certainly hope the latter is not the case. When she finally got to the point where there were images of the letters the Black Hands wrote to Giovanna, I just had to laugh at how ridiculous they were. Sometimes images like that work in books, but this was not one of those times. While I liked the idea behind a strong, independent, plucky, immigrant female protaganist, I just can't give this book anything more than 2 stars. If you must read it, save it for the beach or those times when you want to read something amusing that doesn't force you to think at all -- nothing wrong with those times, of course!"}, {"userName": "Jaclyn Day", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/1373260-jaclyn-day", "userReview": "This book has been getting a lot of buzz and once I learned a little more about it (that it was based on Fabiano’s actual family history, for one), I downloaded it on my Kindle right away.It is a fascinating story of her family and their experiences as Italian immigrants in America. There’s a touch of danger (early precursors of the New York City Italian mob presence that became more prevalent later in the 20th century make regular appearances) and plenty of heartbreak, but Fabiano manages to control the swirling story in the anchor of her great-grandmother Giovanna Costa.Giovanna was a woman far ahead of her time: she was highly educated and strong-willed and was unafraid to go up against men much stronger and more dangerous than she for the sake of her family and her children. Fabiano did an incredible amount of research in order to put you squarely in Giovanna’s shoes. Her descriptive writing allows you to fully envision what New York City looked like, sounded like and even smelled like at the time.I have to admit: the beginning of the book almost deterred me from continuing. Fabiano jumps between time periods and it’s unclear initially how various characters are related, but that confusion was short-lived.Elizabeth Street was a fascinating, satisfying book on so many levels and I highly recommend it to you—especially if you have a ancestral connection to Italian immigrants who came to America in the early 20th century!"}, {"userName": "Elizabeth", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/4843760-elizabeth", "userReview": "I got this book either for free or for 99 cents on amazon and never really thought about it again. Then, as I was trying to a) limit the weight of the books I was carrying on the metro and b) clear out some unread stuff on my kindle I thought I'd check it out. It started out a little slow but I gave it the benefit of the doubt just based on my interest with NYC at the turn of the century, especially for immigrants living in the tenements. As it went on, however, I got hooked. Giovanna grows so much throughout the book and really see her come into her own. I enjoyed the switches between Giovanna's point of view, as well as that of the Black Hand members, and other members of her family. Then, when I found out most of it had been true, it just sealed the deal for me. A nice, quick read that feels much more satisfying at the end than any other throw away crime novel or beach read."}, {"userName": "George", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/1021218-george", "userReview": "AMAZING. AUTHENTIC. “To their minds, the Statue of Liberty was not lifting her lamp, but her skirts.”—page 20[Tired of your sixty-minute commute, in an air-conditioned behemoth, to your air-conditioned office? How’d you like to try walking three hours each way, to work as a bottom-rung common laborer; like Italian immigrant Nunzio Pontillo was wont to do, in 1901 New York City? Me neither.]Almost without regard to ethnicity, many of our immigrant ancestors, probably most, lived incredibly hard lives. None more so, perhaps, than those from the south of Italy—where deep-rooted cultural suspicions and superstitions were often a cause of additional grief. So distrusting of almost everyone not of their immediate family, southern Italians in America often shouldered the extra burden of suffering horrendous tragedy silently and alone.Despite some technical annoyances, ELIZABETH STREET: A Novel Based on True Events, by Laurie Fabiano is an amazing story. Just run a character or two through Ellis Island, then settle them on New York’s Lower East Side; and I’m putty in your hands. I usually enjoy stories about the American immigrant experience, and ELIZABETH STREET is one of the better, one of the most authentic feeling, I’ve read in a while. It effectively bares the fact that the Mafia’s forerunner, i.e. The Black Hand, was neither glamorous nor organized; but it was frightening. Terror and superstition were the main sources of power for those schifosi—lowlifes and thugs.Recommendation: Anyone with even an inkling of an affinity for the Italian-American immigrant experience should experience this novel. It offers historical fiction at its best.“CROTON RESERVOIR DAILY WAGE:  Common laborer, white $1.30–$1.50  Common laborer, colored $1.25–$1.40  Common laborer, Italian $1.15–$1.25”—page 25Kindle edition, 388 pages"}, {"userName": "Lorma", "userReviewDate": "Mar 05, 2013", "userURL": "http://www.goodreads.com/user/show/1571563-lorma", "userReview": "Found this book through a friends recommendation...part of the story takes place in Scilla,Calabria,Italy... My parents hometown, so I was so excited to read it and I was not disappointed!This true story revolves around Giovanna Costa a woman with a commanding presence and fierce determination. Taking place in the late 1800's, Giovanna was not only educated but also an aspiring mid-wife in town. After their marriage her husband Nunzio set forth to America following Giovanna's brother Lorenzo,in order to earn enough money and return to his beloved Scilla so that Giovanna could study to become a Doctor.Unfortunately an accident unfolds a new life plan for Giovanna. She too comes to America and settles down on Elizabeth Street in NY. Through her great granddaughter author Laurie Fabiano, Giovanna's pain, heartaches, joys, and family secrets are brought forth in amazing details full of history of both the old country and the harrowing life Italian immigrants led in the new country, including the infamous Black Hand which callously extorted and terrorized their own people.I loved this book and related to the riveting story right from the start. My own great grandparents came to America around the same exact time and also settled on Elizabeth Street. My great grandfather too was killed while working for an electric company leaving my great grandmother alone in a strange land with a young toddler and my grandmother who was only two months old. Finally,my grandmother witnessed a murder in her apartment building by the Black Hand, and this was her last straw... She returned to Scilla. I so enjoyed reading about all the Italian ways and traditions which were and are so much part of my own life.Elizabeth Street, was such a great read and made me not only appreciate my family's heritage but also the plight of all immigrants old and new."}, {"userName": "Lauren", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/1045491-lauren", "userReview": "Elizabeth Street was a quick read. It tells the story of Francesca, woman from Calabria, Italy and her journey to turn of the century Little Italy in New York. It starts with her life in the \"Old Country\" and her marriage to Nunzio, her childhood sweetheart. The story then shifts to Nunzio and discusses his attempts to make a better life in La America. It describes the tenemants in Little Italy and the horrible working conditions of the Italian immigrants building modern New York. Eventually Francesca finds her way to New York too. The novel describes her journey on the ship, her passage through Ellis Island, her growing family, and the growth of La Mano Nera - organized crime - in the immigrant community. The novel also cuts at random times to Francesca's Great Granddaughter who seeks to understand the story of Angelina, Francesca's daughter. I thought the novel was a bit cliched. I remember some of the descriptions of immigrant life from my own visits to Ellis Island and Little Italy as a kid - right down to the button hook eye checks. Unfortunately the novel was predictable. I really did not like the shifts in the narrative to Angelina's granddaughter/Francesca's Great Granddaughter. They spoiled key plot elements but were not long enough for the reader to develop any attachment to the granddaughter. Based on the author's note, I think Angelina's granddaughter is the author and she is telling the story of how she learned about her family's arrival to America and adventures in Little Italy. While I appreciate the fact that the story was based on true events, I think the novel would have worked better focusing only on Francesca's perspective."}, {"userName": "Suzanne", "userReviewDate": "Aug 24, 2013", "userURL": "http://www.goodreads.com/user/show/3739451-suzanne", "userReview": "All I can say after reading this book is \"Wow!\" With Elizabeth Street, Laurie Fabiano creates a work of historical fiction out of the true story of her Italian immigrant great grandmother, Giovanna, who settled in New York City's lower east side during the early 20th century. Giovanna's story is heartbreaking and inspiring at the same time. During this time period, Italian immigrants were treated poorly by their new country. They were given the worst jobs at the worst pay. They were so poor, tenements were teeming with more people than would be legal to occupy such a small space today. And if this wasn't bad enough, they were victimized by their own kind - gangs of Italian thugs, called the Black Hand, used extortion and violence to threaten these hard-working people, who were just trying to make a decent life for themselves. I don't want to give anything away, but there are so many amazing events that happen in this book - I was mesmerized the entire time. And in addition, Fabiano clearly took the time to research the world her ancestors lived in. It was a wonderful glimpse into the past, and I learned things about both New York and Italy that were new to me. I highly recommend this book!"}, {"userName": "Nenette", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/2156661-nenette", "userReview": "What's so wonderful about this story is the fact that it was not lost through the generations. The tale of the Costa-Siena family is really one for the books, with all that happened to them. It is a testament to the early generation's desires and dreams to provide for a better future. It is for the younger generations to appreciate how they have it far easier now; and how they too, must have the resilience and strength of their forefathers to weather any storm."}, {"userName": "Carrie", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/7388316-carrie", "userReview": "This is an interesting book. Written about the author's actual family and family events, it tells the story of an Italian family's immigration to the United States during the early 1900's and the struggles they faced here as they carved a space for themselves in their new country. It also touches on the struggles their family in Italy faced, which were arguably worse than those of the immigrants, because they were left without the promise of the American dream. Had the book been a work of fiction entirely, I would have had some issues with it. The coverage of the kidnapping seemed to take over the last third of the book, and seemed to change the direction of the story. But, that's what really happened, so it's hard to argue with her retelling of it. I would read other books by Fabiano, especially if they were about her great-grandmother Giovanna, who was a particularly interesting and inspiring character. If my great-grandmother were that interesting, I probably would have written a book about her too."}, {"userName": "Cindy", "userReviewDate": "Aug 28, 2011", "userURL": "http://www.goodreads.com/user/show/70176-cindy", "userReview": "I absolutely loved this book. What an amazing story and what an amazing way to share it! As she explains throughout the book, she becomes fascinated with her family's history when her great grandmother becomes visibly upset with a mob documentary and she realizes that, despite her family's and the italian way of keeping things private, there is a story here to learn and to share. She weaves this tale so that you are attached to each character, real life people, to each story. You're heartbroken by deaths and kidnappings and destruction, hoping the story was different, heartened by the \"forca\" of these people, in particular Giovanna. And it's all within a well researched historical setting. You're not drowning in history but you FEEL it with every page. LOVED IT!!! And I would love to hear more about other family member's tales. Please share more!"}, {"userName": "Tera", "userReviewDate": "Jun 18, 2010", "userURL": "http://www.goodreads.com/user/show/767086-tera", "userReview": "This was a great story and I learned some new Italian swear words and insults so that's kind of a bonus. I didn't find anything formulaic about this book maybe because it was based on her family stories. I had never heard of the Black Hand before and found that fascinating. I thought the relationships were well developed between the main characters. I wish I knew more why Nonna had such problems with her daughter but maybe that's for another book?"}, {"userName": "Eric Klee", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/2581594-eric-klee", "userReview": "The story of Ann Hood's An Italian Wife was separated into three generations. Coming from Italian ancestry, the first story involving the Italian immigrants was the one that really grabbed me, but I wanted much more than that novel provided. Enter: Laurie Fabiano's ELIZABETH STREET. Fabiano's historical fiction novel traces the main character, Giovanna, from her childhood in Italy to her adulthood in New York City. The author put a lot of research into this book, and it shows. I felt like I was stepping into the shoes of my ancestors, seeing the world (both Italy, the Old Country, and America, the New World) through their eyes. The novel centers around Giovanna, a woman who, in true Italian style, marries her cousin, Nunzio, the love of her life. As was common for many Italians at the turn of the century, with opportunities limited in Italy, he leaves to go to America to make enough money to either come home and provide her with a good life, or bring her to America, too, once he has saved enough. He faced many prejudices upon coming to America. Employment ads around that time offered the best pay to white men, 2nd best to black men, and 3rd to Italians. Giovanna eventually comes to America, and we watch her go through the immigration experience upon the ship from Italy, and then through Ellis Island. Having studied my ancestry on Ancestry.com, it was all very fascinating to be \"in the moment.\" America was seen as the \"Land of Opportunity,\" but it was also seen as a dirty place full of corruption and crime, as seen in Giovanna's experiences. There's also mystery and intrigue in the novel, although nothing upsettingly violent. I don't want to spoil the story (all based on true events from the author's family history), but I will say that I was engaged throughout the entire novel. I took in the descriptions of Italy, New York City, Italian customs, etc. with fervor. I kept wondering what life was like for my Italian ancestors who came through Ellis Island, and now I had visuals, thanks to the author's descriptive text. The novel also came with an extremely helpful family tree (at the beginning) and glossary that translated Italian words and phrases (at the end). I referred to both often. I once took an historical fiction/memoirs class in college, where we studied different modern writers and their varied international background and cultures. ELIZABETH STREET would fit in perfectly as a novel to be read, taught, and discussed as the Italian immigrant experience."}, {"userName": "Laurie • The Baking Bookworm", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/5289134-laurie-the-baking-bookworm", "userReview": "2.5 STARS - This is an e-book that I've had on my Kindle for over two years and finally cracked it open while I was on vacation in Croatia last month. The book is a familial saga set in the heart of an Italian family in early 1900's New York City, loosely based on the author's own family. At the time, NYC was experiencing an influx of immigrants and the prejudice against Italian immigrants was blatant as was the power and terror that the Black Hand held over its countrymen. These tidbits of history are woven into the plot throughout the book but, at times, it felt like the plot came second to her opportunity to add in a unique historical setting, for example, an impromptu trip to Coney Island.Fabiano uses multiple timelines to tell her story but it often came off as awkward and distracting as the plot jumped back and forth. I also didn't enjoy being told about a major plot point early in the book which made for a lackluster second half of the book since I knew how things would pan out. The subject and era was interesting but for a book with such high ratings I found the writing to be clunky and mediocre at best with the letters that Giovanna received from the Black Hand coming off as silly and juvenile (and hard to read on my Kindle). For a story that is loosely based on her own family, Fabiano's storytelling felt detached and many of her characters' actions felt improbable. Add in that there was too much 'telling, not enough showing' in regards to the plot and writing style and you can see why this book didn't live up to my expectations.There was potential for a great, sweeping saga of a read but I don't think that Fabiano's writing was up to the task. Overall, a light read set in an interesting era but there are other books with similar plots that do a better job of showcasing the subject and early 20th century New York immigrant experience."}, {"userName": "Stefanie", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/2107620-stefanie", "userReview": "Almost 5 stars. The first half of this novel was mesmerizing, but the second half moved oddly at such a fast pace that it shifted the feel entirely. Still a really fantastic story about Giovanna and Nunzio, who fall in love and marry in their idyllic Italian seaside home, then immigrate to New York during the first decade of the 1900's to escape starvation. Their story is interwoven with the stories of hundreds of other Italian immigrants to the United States, all of whom were seeking a better life. Tragedy strikes many times over, with much of the action in the second half focusing on the family's resistance to the Black Hand. The resilience and determination of the characters, especially Giovanna, and of course, their faith and devotion to family all help to see the family through."}, {"userName": "Ally", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/53308-ally", "userReview": "I forget which of my many book sources (Vulture, perhaps?) recommended this book, but regardless, it was great. I was very surprised to see that this was Ms. Fabiano's first book - the writing was compelling and the story kept me engaged the whole time. And the cherry on the sundae was it was a totally true story, and I wished I could have met Giovanna (Big Nanny) myself as well. Not to get all \"blame the patriarchy\", but this book was a great reminder that strong women in history, especially those who had to leave their entire lives to move to a foreign country, were the real MVPs."}, {"userName": "Pam Seaman", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/7987948-pam-seaman", "userReview": "Sure enjoyed this book!This book was a great read with a bit of history mixed in. I really recommend it. An easy read."}, {"userName": "QNPoohBear", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/22177907-qnpoohbear", "userReview": "Life in southern Italy post-unification is supposed to be filled with promise but unfortunately that turns out not to be the case for Giovanna and Nunzio. The two are cousins and sweethearts and are finally able to marry after Nunzio finishes college in the north. However, there are no jobs for an engineer in the south so Nunzio must go to America, the land of dreams. The women of Scilla see the Statue of Liberty as a puttana (whore), stealing their men from them. Giovanna waits and waits for Nunzio to return as she learns to become a midwife and help women in their village. When tragedy strikes, Giovanna heads to New York. Life in New York isn't any better and is sometimes worse with extreme prejudice against Italians and wicked extortionists from their own 'hood threatening anyone who doesn't obey. When one of her own flesh and blood is threatened, Giovanna will risk her own life and hard-earned success to rescue her loved one. I really liked some of the details in the story, especially Scilla and Coney Island. I thought the strongest sections of the book were Anna's memories. The writing really shines in those sections. It seems like the author wanted to write a memoir but couldn't without more information. I didn't care for the writing style. It seemed very detached and matter of fact for most of the book and I couldn't connect emotionally to the characters. I finally found myself interested in the story when the action started. It seemed so improbable and I thought for sure it was fiction after I looked up The Black Hand, but the author claims it's true. I learned a lot about crime and all the gritty details of life in New York in the early 1900s but I just didn't really enjoy the story. It was too depressing. I'm colored by my own family's experience which was very positive. The characters in the story are a generation or two older (closer to my great-great grandparents) than my grandmother and my family settled in central Massachusetts. My grandmother's family went from farmers to restaurant owners and much loved and respected members of the community. My grandfather's parents and grandparents probably would relate to Giovanna and her struggles a bit more. My family became almost fully Americanized but maintained allegiance to their traditional Neapolitan foods and went to Mass every Sunday. I had a hard time relating to Giovanna and Angelina at first. I come from a long line of strong Italian women who did what they had to do to survive and held their heads up. I don't see my great-grandmother or her mother collapsing like Giovanna. They got along without their husbands OK but I know my great-grandparents didn't marry for love and I doubt my great-great grandmother did either, so perhaps they would have reacted like Giovanna. I liked Giovanna much better towards the end of the book when she pretended to be a strega (witch). THAT I can see my ancestors doing. My great-grandmother's mother looks very formidable in the one and only picture we have of her. I liked Nunzio much more and felt bad for him that he was so looked down on because of where he was from. I didn't care for Rocco much at all. Like his wife, I thought he was a bit stupid, but I also thought they were both stupid for letting it go so long. She should have at least told the lawyer. He would know which cops were crooked and if anything could be done. I didn't like Angelina in Anna's memories at first. Anna had the opposite relationship with her Nanny that I had with my Nonnie, I just couldn't believe her. She didn't seem like any of the Italian Nonni I know. Once I found out what happened to her, I understood why she was like that.This book was just too dark and depressing for me. I'd like to see an uplifting story about an Italian immigrant family! I'll start...Follow along in the comments section."}, {"userName": "Laurie ", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/4919530-laurie", "userReview": "I loved this book when I read it.I read it because of my genealogy research for my Sicilian side of the family.The family in this book is from Southern Italy,so it was close. I loved the story of the immigrant ancestors and their struggle in the new world.The was a well researched fictional story based on the real lives of the authors ancestors.It was heart warming and bittersweet.Highly recommended if you have any Italian or Sicilian ancestors.Well written,loved it!"}, {"userName": "Marisa", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/1229039-marisa", "userReview": "What a wonderful book!!!"}, {"userName": "Christy B", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/1204629-christy-b", "userReview": "This book struck a chord with me. Elizabeth Street immediately caught my attention while reading the summary. A book about Italian immigrants and the challenges they faced when they got here? Yes, please. I'm half Italian American, so that means that half of my immigrant ancestors came from Italy – all of them on my mom's side. And they all came during the time of the so-called Great Italian Migration.Unfortunately, none of my living Italian American relatives know much about my great-great grandparents generation, not even what parts of Italy they came from! Through my own research, I've been able to track one great-great grandfather to a town in Southern Italy. My point is this: I have no idea what my great-great grandparents went though when they got here, but this book gave me an insight, and it was a horrible realization. When my people left Italy they didn't go to New York like the ones in the book, instead they settled in the Little Italy section of Northern Boston. Still, I have a feeling their experiences weren't much different than the immigrants in Elizabeth Street.The characters and story of Elizabeth Street are based on the author's own Italian ancestors. The book brought to light how Italian immigrants were targeted and treated poorly, discriminated against – being called dagoes and wops. It showed how their lives were dispensable to the employers of large companies – if an Italian died on the job, another one was brought in to take their place, like a revolving door. The families weren't taken care of, and there certainly was no suing for their relative's untimely death. Who would take their side? This also struck a chord because there's a story in my family that my great-great grandfather Marciano was killed on the job while working on the railroad.Another interesting subject was how honest Italian immigrants with their own businesses were terrorized by the Black Hand (Italian criminals), who would try to extort money from these people. I suggest reading up on the Black Hand. They didn't play around.The main character of Giovanna was impressive. She was based on the author's own great grandmother, who came to America from a town in Southern Italy called Scilla. She herself took on the shifty Black Hand head on, not relying on anyone else's help. It was dangerous, but she was not afraid. What a heroine!Elizabeth Street was an engrossing read and the pages just flew by. I just absorbed every page, because I wanted to know, I needed to know what these people went through. I need to have some idea what my ancestors went through, and at this moment, this book was as close as I was gonna get.Did I mention this book struck a chord with me? Anyway, there's an extensive bibliography located at the end of the book which I expect to take full advantage of."}, {"userName": "Sara", "userReviewDate": "Nov 20, 2012", "userURL": "http://www.goodreads.com/user/show/3600828-sara", "userReview": "This story drew me in emotionally from the beginning, despite or maybe because of Laurie's very direct, simple voice and the dignity with which she tells her great-grandmother Giovanna's story. It's an unusual voice, a bit old-fashioned, Italian insults and deeper reflections side by side. Giovanna and Nunzio's love for each other is made real from the beginning, the foundation for the whole story of this Italian family. Laurie's Big Nanny Giovanna died in 1963, the same day as President Kennedy, when Laurie was only six years old. \"My mother and grandmother took me to the wake. I overheard them say, 'It will be fine, she barely knew her.' They didn't realize how well I remembered brushing my Big Nanny's long gray hair, how holding her enormous silky hands always made me feel safe, and how I had memorized her face as she said words to me in Italian that I didn't understand.\"It's not easy to stick to the facts of a story and at the same time bring them to fictional life. This story falls into three chunks, first of Giovanna and Nunzio and their move to L'America; the second of Giovanna and Rocco and their struggle to stay alive in New York; and third, of Giovanna's heroic persistence in saving Angelina. My interest flagged a bit during the second story, but first and third were pageturners. Giovanna's strong, determined, passionate personality drives the book and one cannot help but love her...but Nunzio also is unforgettable. Many have heard of Mafia cruelty and maybe even of the Black Hand that preceded it, but I knew little of how Italian workers' lives were endangered as they worked to build the turn-of-the-century landmark buildings of Manhattan. What a tragic waste that immigrant expertise in engineering was neither perceived nor valued...an old story but one that is made heartbreakingly vivid here. Here is Nunzio on the Flatiron Building: \"They were building the most marvelous building in the entire world. They had shaped it like a triangle...it had poetry. Its shape mimicked the crossing of Fifth Avenue and Broadway, and it played with your eye...And the way it was being built! This building was not held up by its walls, but by the steel of its interior. Nunzio marveled that the exterior of the building was like skin; it merely served to cover the interior structure.\" With this passage and the later description of the family's trip to Coney Island, Fabiano brings to life the newness and the wonder of the Italians' discovery of New York, as effectively as she portrays the class conflict, the crowds, the grit, the grinding pain of their struggle to win justice for their families at any cost to themselves. A fine book."}, {"userName": "RETRODOLL", "userReviewDate": "Apr 04, 2011", "userURL": "http://www.goodreads.com/user/show/5220584-retrodoll", "userReview": "NO spoilers, I promise -- I just finished this book today. The basics of the story centers around Giovanna Costa, a strong, whip smart, Italian immigrant. She's a great heroine and her supporting cast are just as developed. The story is set at the turn of the century and goes from the destruction and chaos of southern Italy, to the immigrants unfamiliar new homes in NYC. It is loosely based on \"true events\" of the author's family. I rated it 3 out of 5 stars because I didn't absolutely love it but I certainly didn't hate the book either. I would describe it as \"enjoyable\" and \"readable.\" I couldn't help comparing the aforementioned details to my favorite book \"Middlesex\" by Jeffery Eugenides. There are some similarities in the whole \"immigrating from Italy in early 1900's story\" but the premise is certainly different. IMO, Eugenides did it better but Laurie Fabiano's storytelling skills are nothing to sneeze about as she recreates the hustle and bustle of NYC vs. the immigrants struggles to adjust. Also, I appreciated that when the character's threw in bits of Italian in the dialogue, author provided short glossary of terms in the beginning of the book.I thought the first few opening chapters were entertaining, really draws you into the story quickly. I had 2 major issues with this book though: the first is that it's hard to keep some of the characters straightened out; for example who married who and whose children belong to who (I hope that wasn't a grammatical nightmare, just now). That was the small issue and this is the BIG one -- Fabiano foreshadows the main storyline in the book, by telling the reader about the outcome of a child's kidnapping. She tells the reader this very early on via characters' dialogue before the plot actually plays out!! WTF! I don't know any reader (not this one anyway) that wants to know about a kidnapping AND read about the outcome before it plays out in the book. This book was potentially 4 or 5 stars because when the main plot does finally unfold, Fabiano does it brilliantly with lots of suspense and insight....but it's a shame the reader already knows the outcome of the little girl's fate! I do understand that because the way the story is narrated it's difficult to NOT talk about the outcome of the kidnapping, BUT it's not impossible IMHO. I know it could have been done had this writer tapped deeper into the well of creativity. Would I recommend this book? Yes, but with the notion of what could've been and a sigh."}], "description": "Based on true events, Elizabeth Street is a multigenerational saga that opens in an Italian village in the 1900's, and crosses the ocean to New York's Lower East Side. At the heart of the novel is Giovanna, whose family is targeted by the notorious Black Hand--the precursor to the Mafia. Elizabeth Street brings to light a period in history when Italian immigrant neighborhoods lived in fear of Black Hand extortion and violence--a reality that defies the romanticized depiction of the Mafia. Here, the author reveals the merciless terror of the Black Hand-and the impact their crimes had on her family. Giovanna is based on Fabiano's great-grandmother, and the book's heroes and villains - such as Lieutenant Petrosino, the crusading cop and \"Lupo the Wolf,\" a cold-blooded criminal - are drawn from real life in this thrilling tale. While set in a dynamic historical context, Elizabeth Street is, above all, the dramatic story of the heroine, Giovanna, and how she triumphed over tragedy.", "title": "Elizabeth Street", "url": "https://www.goodreads.com/book/show/6589074-elizabeth-street", "average": 3.9, "cover": "https://images.gr-assets.com/books/1328420628l/6589074.jpg", "reviews": 1295, "authors": [{"url": "https://www.goodreads.com/author/show/2976501.Laurie_Fabiano", "name": "Laurie Fabiano"}], "type": ["Historical", "Fiction", "Cultural", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/6589074-elizabeth-street", "http://www.goodreads.com/book/show/8200391-elizabeth-street", "http://www.goodreads.com/book/show/7767972-elizabeth-street", "http://www.goodreads.com/book/show/37796916-elizabeth-street---da-scilla-a-new-york", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}