{"ratings": 4479, "userreviews": [{"userName": "Hailey (HaileyinBookland)", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "2.5*? I’m undecided"}, {"userName": "Lola  Reviewer", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "There is a difference between being flawed and being unlikable. My brother is flawed. He always forgets to turn off the lights, close the window in the winter, and only cleans after himself at the last minute, right before he heads back to his apartment. But my brother is still extremely likable.Now. I don’t know how old the author is, but certainly old enough to forget what it’s like to be a teen. I also wonder how many YA novels she has read in her life, because that is a really weird writing style.I figured out why. The thing is, this author writes to impress. It’s obvious she put ten times more effort in the writing than in the story and the characters themselves.BIG MISTAKE.Especially since teenagers are not stupid. They can see right through you. They are able to differentiate between a genuine YA story from an author who truly understands young adults, and a fake-it-till-you-make it one. But let’s go back to how unlikable Penny is. She judges relentlessly. She has an opinion on everything, from her own mother to the freaking lipstick she wears.I don’t think that’s necessarily a bad thing, but when you say stuff like that (see below), be prepared to have people frown at you and question whether you comprehend certain important concepts, like feminism and stereotypes. EXIBIT AThe girl inspected Penny’s lipstick again. “Wait. I’m obsessed with how matte that is. What is it?’’‘‘Isn’t it fabulous?’’ Penny enthused, reaching for the tube in her bag. ‘‘Too Thot to Trot?’’ she read off the sticker on the bottom. Christ, she felt as if saying makeup names out loud set women’s rights back several decades.*Right. Because powerful women do not wear makeup. Because makeup is what is keeping women from achieving gender equality. It all boils down to that, I see, I see.EXIBIT B\nSam’s armchair was set slightly higher than them on the sofa and he crossed his legs elegantly. His right knee brushed Penny’s left and she almost passed out. With the comically small espresso cup in his thin hands, Penny wondered for a second if he was gay.\nYou just met the guy, and you’re telling me you’re so attracted to him – which you haven’t really mentioned before – that a simple brushing of knees has you almost over the edge? Oh, come on. Also, the only reason you think ‘‘for a second’’ he might be gay is because you believe blindly stereotypes about gay people, while actively criticizing people for reducing you (an Asian girl) to a stereotype. I simply cannot stand this book. Do as you wish – read it or don’t read it – but please do think critically about some of the offensive or questionable things the characters say. Oh, I have a final example, since I already wrote the passage down on Word a couple of days ago:\nHe swivelled to see Mallory leaning toward him, elbows hooked on the bar. Her not-insignificant boobs were hoisted to where they almost hit her chin. She lowered her sunglasses with a silver-painted talon. Clearly, too much time had elapsed since Mallory was paid attention to.\nAs in, you can’t have cleavage unless you’re desperate for people to look at you? It couldn’t possibly be that you own your own sexiness and just enjoy flirting? Nothing wrong with that. Plus you wouldn’t tell a guy whose buttons are down that he’s vying for attention. You wouldn’t say that about a guy, period. Let’s all stop with the double standards right now. Those were Sam’s thoughts… the one character I was hoping to love. Sigh.*Apparently, this particular passage refers to the names of beauty products for women as being offensive and ridiculous, so I admit Penny may be right this time around. But that should have been made clear by the author from the start. Thank you to those who enlightened me in the comments section. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Sabaa Tahir", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/26226276-sabaa-tahir", "userReview": "My absolute favorite feel-good romantic contemp of the year, I'm calling it now. JUST GO READ IT OK"}, {"userName": "jasmine", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/73003007-jasmine", "userReview": "boi this guy's hair kinda looks like Kaz Brekker's hairi've been reading too much Six of Crows omgjk you can never read too much Six of Crows :)how did we somehow get from the topic of this book to Six of Crowsi don't even know"}, {"userName": "❄️Nani❄️", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/68538597-nani", "userReview": "If ever there was a book that truly epitomises the term ‘don’t judge a book by its cover’ it is this one.I feel so cheated. And exhausted with anger. Finishing this book was a struggle. I won’t lie. I had somewhat of a sneaking suspicion that it was going to piss me off but ever the hopeful, I went for it anyway. I hold no one but myself responsible. Let it be known that I tried. I finished the whole damn book. I deserve a fucking medal. There is SO MUCH wrong with this book. So so so much wrong that I don’t even know where to begin. I am also beyond angry that a book with these many problematic things passed through the editing stage. I annotated everything that I felt was a giant red flag and problematic so much so that I actually ran out of index tabs. This book was offensive on so many levels and the characters had zero redeeming qualities. ZERO.If I get into it (the characters in particular) I’ll be here all night. I am truly restraining myself here and saying only what I need to say because I sincerely don’t have the mental capacity to revisit all my notes and write everything that SHOULD NOT HAVE BEEN WRITTEN. I want to forget I ever read it. Finishing it was a miracle alone."}, {"userName": "Sana", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/26402455-sana", "userReview": "if you see some crazy bitch screaming, \"WHAT A DISSAPOINTMENT\" while she bangs two pots together, walking down your street, it's PROBABLY ME. akdgajhds i'm so mad because the cover of this book is SO gorgeous. if i was ever to marry a book cover, hands down, it's THIS ONE!!! like, it's just so beautiful??? sadly, the pretty cover is the only good thing about this book. what's it about??Penny Lee wants a fresh start at her University and have a decent life, away from her MILF and embarrassing!! mom!! Sam lives in an empty storage room on the second floor of the cafe he works in. he wants to be a movie director once day, but doesn't have enough money to graduate college and pursue that dream. these two meet one day, exchange numbers and become text buddies!!i'm going to dive right into it: i really didn't like Penny's character. she's such a judgmental and unlikable character. she constantly judges people and reduces them down to stereotypes and then gets mad when people reduce her (being Asian) down to a stereotype?? well, i do understand why she'd get mad and i love how she spoke against the stereotypes, but that doesn't give her the right to do the same to other people!! she assumes for a second that Sam is gay because he has an espresso cup in his hand. W H Yshe's also constantly embarrassed because her mom's a MILF and doesn't wear clothes a \"regular mom\" should (it was something along the lines of that, i'm not exactly sure because i forgot, it's been a few days!) she also looks down upon her mother for flirting with men. a woman can do and wear whatever she wants?? why are we still fucking judging?? can a woman not flirt and enjoy her life?? one of the characters Mallory also showed some cleavage and Sam thought it was a cry for attention!!! because clearly, you want attention if you're showing your cleavage!!! disgusting. and this is just seen as okay in this book, yikes.moving on to the \"romance\" which is so bleh. their texts had no chemistry and i didn't care at all for their relationship because it was so underdeveloped. their romance felt so forced and unwanted. also, this was so boring!!! it's slow-paced and was really uninteresting for me and i lowkey skimmed the last 40% of this book. i didn't even bother reading the last few chapters, that's how irrelevant this book is.THE ONLY good thing about this book is the diversity! Penny is (i think) half Korean and I think Sam was a POC as well.2.5 stars."}, {"userName": "Nat", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "Angst, Love, Texts, and TattoosWhen I read through the excerpt for \n  Emergency Contact\n back in February, I had a slight inkling indicating it would be well worth the wait. I was hooked, in particular, when I highlighted the opening line that really gets those of us living in the more warmer areas: When it came to perspiration, Penny had a problem. Not that she stank of BO or anything. It’s that from March to around October she was invariably damp. I do have to say, though, that upon starting the full book and realizing the aforementioned excerpt wasn't from the first chapter was quite disappointing for me... I definitely had to rearrange my expectations for the following, as the shared excerpt is set way down the road from the opening storyline.While readjusting, I also became agonizingly aware of how much time we spent on the many, many arbitrary scenes before Penny finally heads off to college: buying a new iPhone, arguing with her mother for flirting at the Apple store, packing up and heading on her drive to the University of Texas at Austin, actually arriving on campus, entering her shared dorm room, going into the bathroom, rearranging her toiletry bag... SO MANY DETAILS that I shouldn't have to know; pages upon pages of description make my mind wander. In my eyes, all the aforementioned could have been summarized in a couple of pages, instead of dedicating four whole chapters to it.There's literally a scene at House Coffee that starts from Sam's viewpoint, where Penny enters with her roommate and her roommate's best friend, and then follows up exactly where we left off in Penny's following chapter... Like, *silent-scream* having time jumps of over an hour is allowed...But I'm glad I pushed through the longish introduction (low-key because I had already prepared the header image for my review out of excitement and wasn't gonna let it go to waste) because what unfolds is a coming-of-age tale that chronicles the intersecting lives of Penny Lee and Sam Becker, both not to be trifled with.When Sam and Penny cross paths it’s less meet-cute and more a collision of unbearable awkwardness. Still, they swap numbers and stay in touch—via text—and soon become digitally inseparable, sharing their deepest anxieties and secret dreams without the humiliating weirdness of having to see each other.But it's the precise commentary invoked in this book that made me want to stick around. Penny's character had the best lines, as well.• Sam is the essence of the tweet that goes \"when i see a skinny white boy that looks like he hasn’t slept in years,\" courtesy of Penny's many favorable descriptions for his looks:“Sam could have been in a band. A dreamy, brooding band. Penny thought cigarettes were pointless and smelled awful, but she imagined that Sam smoked and that he looked cool doing it.”And this priceless line: “Sam had resting bitch face until he laughed.” Also, her appreciation for his many tattoos (sixteen in all) was beyond infectious: “Sam had somehow found the Perfect Shirt with the Perfect Collar, which was stretched out just enough to create this enticing peekaboo effect.” I was practically craning my neck to get a better look.• Things only went up from here when Penny gets some much-needed characterization by introducing her love of writing. Similar to Fangirl, we get to sit in on her Fiction-Writing course, and it was fascinating through the various topics discussed. Her professor, J.A., really channeled in this quote:“Penny had been writing all the time, for years now. She’d never stopped even if she showed no one. Stories, lists of ideas, and strange chunks of amusing dialogue that came to her while she ignored whatever else was going on in her actual life. She knew she was decent. Only she wanted more.”• The impeccable humor in here takes it to a whole other level. The messages exchanged between Sam and Penny that had me stifling a laugh more than once. Including the most memorable from Sam's POV after he shoots Penny a mirror selfie, debating if he's overdressed:(His responses are on the right)\"Yah\"This is that more comical when you know the insider's scoop on Penny's stance with nudes (*shudders @Mark*) and her spot-on \"Calm down,\" poking fun at Sam's earlier use of it, and him lightening the air by making a jab at his earlier panic attack. They're catching feelings as they text, and I'm nothing if not here for it.“It wasn’t a romance; it was too perfect for that. With texts there were only the words and none of the awkwardness. They could get to know each other completely and get comfortable before they had to do anything unnecessarily overwhelming like look at each other’s eyeballs with their eyeballs.”And I nearly CHOKED on this conversation between Uncle Sam and Jude:“The thing is,” she continued, “I’m also very perceptive. And I get now why you guys did what you did. Speaking of which, you’re both so lucky you have unlimited texting. You know she couldn’t even pee without taking her phone into the bathroom? I could hear her laughing in there.”Jude smiled then.“News flash,” she said. “At some point, your girlfriend might have been taking a dump while you were flirting with her.”This book is TOO REAL.• On another note: Sam and Penny getting caught up in one another was entrancing and intoxicating to witness.“Sam wanted to tell Penny everything. He wanted a record of his thoughts and feelings and stories to exist with her. Like a time capsule for this strange period of his life. With her, he felt less lonely. He hadn’t even realized he was lonely. He hadn’t let himself.”• More notable observations:<“Penny never looked the way she thought she did in her head, like how your recorded voice sounds positively vile when you hear it out loud.”“Wow,” he said. “Sometimes talking to you is like accidentally clicking on a pop-up with autoplay video.”Celeste's (aka Penny's mom) take on the signs of love:“I know I love someone when I can’t remember what they look like in any real way. I can never seem to recall whether they’re handsome or ugly or if other people think they’re cute. All I know is that when I’m not with them and I think about them, where their face should be is this big cloud of good feelings and affection.”Although I did have minor hindrances to my reading experience, overall I'd conclude by saying that \n  Emergency Contact\n features a realistic story that has emotional depth and ends on a hopeful note. (But I'm mad at myself for thinking the last chapter wasn't the last and being once again shocked at seeing Acknowledgments at the head of the page...)Lastly, I couldn't have listened to a more fitting song than this one, since Penny and Sam coincidentally share the same pair of beat-up black sneakers.\nIf you're not sleepin' with me, then I'll get no sleep at all.\nNote: I’m an Amazon Affiliate. If you’re interested in buying\nEmergency Contact\n, just click on the image below to go through my link. I’ll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Larry H", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I totally agree, soon-to-be Princess Meghan! (Yes, I know she won't actually be called that, but I don't care.) I loved loved loved this book, and it reminded me of how good an amazing YA book (or any book for that matter) makes me feel.Penny can't wait to go to college and escape her high-maintenance mother, Celeste. Celeste seems to forget she's the mother and Penny's her daughter, and having to keep avoiding your mother's attempts to be your best friend and dress like you and talk about cute boys is utterly exhausting. All Penny wants to do is become a writer and leave her old life behind, and even if it's just a little more than an hour away from home.Sam is a mess. His family life is a shambles, he lives in a storage room above the coffeehouse where he works, and he had to drop out of school because he couldn't afford it. He's trying to get over his cheating ex-girlfriend (who can't seem to stay away completely), and he wishes he had more money so he could take a film class and start making documentaries.Although Penny and Sam meet once when she visits his coffeehouse with her roommate, Jude, who is sort-of Sam's ex-niece, their meet-not-so-cute occurs when she spots Sam having a panic attack on the street and she rescues him. Their shared quirky sense of humor quickly bonds them in friendship, and the two become each other's emergency contact, and a sounding board for the things they're feeling about life around them.Their relationship is purely textual, but they can't get enough of each other. They can say anything they want to each other, and it's amazing how dependent each becomes on the other. Both feel the desire, the pull to take a further step, but what if the other doesn't reciprocate those feelings? What if they don't work as more than friends? How can they jeopardize this incredible relationship they've built? \"It wasn't a romance; it was too perfect for that. With texts there were only the words and none of the awkwardness. They could get to know each other completely and get comfortable before they had to do anything unnecessarily overwhelming like look at each other's eyeballs with their eyeballs. With Sam in her pocket, she wasn't ever alone. But sometimes it wasn't enough. Penny knew she should be grateful, yet there was this niggling hope, this aggravating notion running constantly in the background of her operating system, that one day Sam would think about her and decide, 'To hell with all these other chicks I meet every day who are hot, not scared of sex, and are rocket scientists when it comes to flirting, I choose you, Penelope Lee. You have an inventive, not-at-all-gross way with snacks, and your spelling is top-notch.'\"How do you know when to take a leap of faith and risk it all? How can you protect yourself from the possibility everything could go amazingly wrong? And how can you let other people in when you've spent so much of your life insulating yourself from everyone to be sure you don't get hurt? Emergency Contact tries to answer those questions, and does so with such memorable, amazing, quirky, awkward characters I absolutely loved.This is one of those books where the main characters talk at a sophistication level above where most people their age do, but for Sam and Penny, that absolutely worked. Even though you've probably seen this story before, maybe countless times, in Mary H.K. Choi's hands, it's so fresh and appealing, and I just couldn't get enough.I never trust when blurbs compare one book to another, yet the comparison to Rainbow Rowell's Eleanor & Park (one of my all-time faves) isn't way off the mark. There's a quirkiness to Choi's writing that is utterly endearing, much like Rowell's, and both authors have so much heart.Loved it. Loved it. Loved it.See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"userName": "emma", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "this author is so cool that this book is extremely cool by default, and i think also i am incrementally cooler for having read it. like it's so cool that i a) felt not cool enough, at several points, to be reading it and b) am significantly more cool for doing so.SO. COOL.this book was not perfect, but also it's good enough to get a straight-to-best-contemporaries-shelf-do-not-pass-go-do-not-collect-$200 card, and also now the author is on my auto buy authors shelf. after just one book! i'm like, blushing, writing this. i have a crush on Mary H.K. Choi and i have a crush on Emergency Contact and on penny and sam and on naming characters so well (penny! sam! jude! mallory! celeste! lorraine! andy! okay scratch that last one kinda). okay i have to cut down on the stream-of-consciousness vibe, at least slightly, so i can tell you guys why this book is so rad.wait i didn't think i was going to write a full review of this book but clearly i'm going to?? okay. be back with one later i guessreview to come (this is the me-est thing ever what is happening)"}, {"userName": "Ashley Nuckles", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/55308610-ashley-nuckles", "userReview": "Basically started this at 1pm today and finished 9 hours later hahahaThis story was fricken adorable & I loved it so much! The writing was so fun and relatable and I adored Penny and Sam. The only fault I have it that I wanted mooooooore!"}, {"userName": "Cesar", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/34467577-cesar", "userReview": "2 stars.Strap in, folks, because I am not happy with this book. I'd much rather chuck it across the room. It failed on so many levels. I'd figured this would be a nice, decent story of two lost people connecting while trying to navigate through life. Sadly, none of that happened. Which made me salty. Saltier than the ocean.I really wanted to like this, I really did. Even after I knew this wouldn't be a good book, my dumbass kept looking for signs of redemption. Surprise surprise, there wasn't. My experience was not a positive one and I have a list of grievances of why I didn't like Emergency Contact.Penny Lee wants to leave her life behind her and have a somewhat fresh new start at University. Learn a few things, think about her life before university, and maybe have a decent life. Sam doesn't have the best of luck as he lives at a cafe shop in an empty storage room upstairs. He wants to be a movie director someday, but it doesn't seem like it'll happen. The two meet up eventually and form a friendship through text messages. Their meeting is awkward at first, but they're more comfortable with texts. Now, you might think this is a cute love story with text messages. Except it isn't. Rather, the \"relationship\" wasn't fleshed out enough to even be a friendship, let alone a romantic relationship. Combine that with an insufferable MC, a plot that doesn't go anywhere, and crappy writing, you get a crappy book.This book is blurbed as \"smart and funny.\" Except it isn't smart or funny. It's blah and meh. I have so many issues with this book, I honestly don't know how I was able to finish it. But I did and I deserve a medal for it.\nThe Bad\nThe writingThe one thing you will notice about this book is the writing. Penny has a no-nonsense attitude about certain things and I figured she would be that snarky character that is fun. Except the writing didn't fit Penny at all. Instead, it made her more insufferable. I get that she's 18 and going to college, but the things she says and thinks aren't that of an 18-year-old person. Plus Mary's writing didn't help at all.Examples:Having a MILF for a mom was garbage.Penny never had a cigarette in her life, and if they did smoke together Penny would probably have a coughing fit that lasted forever and ended on an audible fart.She was smitten mitten kittens.Plus you'd enjoy it. Sam was a dynamite maker-outer. <=== Is this even a real word??Knowing that your only computer was about to crap out on you despite not having nearly enough money to replace it can only be described as horror. Horror and terror. Torror.Who thinks this?!?!?! Seriously, what kind of teenager thinks this?!?!?!I'm 22 and even though it's been 4 years since I graduated from high school, I know that many kids who are around Penny's age don't think or say things like that. It's painfully obvious that this is a book written by an adult who has no idea what goes through the minds of teenagers/young adults.Penny tries to be this sassy sauce character but her dialogue comes off as forced.The main characterI did not like Penny at all whatsoever. She's insufferable, selfish, annoying, has a holier than thou attitude, and constantly judges people way too quickly. I get that her life growing up wasn't peachy, and I do like characters who are snarky. But Penny's attitude was neither funny or snarky. She came off as unlikable after about 20 pages. She does get a backstory about why she's like this, but I still don't like her. I wanted to shake her so many times for being just plain judgemental. She irritated me so fucking much.Sam... I have no feelings. I don't hate him but I don't like him. He does have his own story, but I didn't connect with him at all. If I had to choose, I would pick Sam as a decent character because he does have dreams and given his backstory, I did sympathize with him more. But do I love him? No.The only good character is Jude. She had the guts to stand up to Penny and straight up tells her how much of a dick she is. Jude > Penny any day.PlotThe plot for this one was quite disjointed. The main plot is of how Penny and Sam form a friendship through texts along with their personal lives. That's dandy and all, but at times I didn't know which took more space and which took a backseat.RomanceI'm gonna be honest, the romance here is basically non-existent. There is lust (mainly from Penny) but that doesn't mean there is genuine love. It's tip-toed around that you could forget that this is a love story. There wasn't that spark that ignited between them.Little side note here: The gold foil on the cover was coming off and got on my hands. Not a glaring issue with the book, just wish most of the foil was more permanent on books and doesn't come off especially when I'm holding it.\nThe good\nHonestly, there weren't that many good things about this book. The one saving grace that prevented me from giving this a 1-star would have to be the decent moments there were in this book. Even though 90% of the book was complete garbage, the 10% of it was decent. With talk about family, money issues, these conversations were done well.\nVerdict\nI was promised a smart and funny book only to find out it was complete crap. Penny was bad, the plot was convoluted, the writing was awful, and the romance was just non-existant.Thanks for reading my review!-Cesar"}, {"userName": "destiny ☠ howling libraries", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/15335689-destiny-howling-libraries", "userReview": "This was one of my most anticipated contemporary releases of the year, and while it definitely was not without its flaws, I thought it was all in all a tremendously cute, sweet story. I get so accustomed to reading heavy contemporaries—and don’t get me wrong, this one tackles some really rough topics—but Mary managed to write it in a way that, at risk of sounding really odd by saying this, felt like a geeky, goth twist on the stereotypical “fluffy YA contemporary” novel.\n Penny thought of this Korean saying for when you really, really liked something. You’d say it “fit your heart exactly.” Sam fit her heart exactly.\n→ Penelope Lee ←The book alternates perspectives, and the first character we meet—the one who feels more like the primary protagonist—is Penelope Lee, or Penny, a Korean-American girl who’s beginning her first year at college. She’s not a particularly likeable character for the first half or so of the book: her anxiety is relatable and I saw a lot of myself in the ways it manifests for her, but she’s also a bit coldhearted and downright mean to the other women in her life. I always struggle with books that feature girl-on-girl hate because it’s hard to predict if it’s a poor trope or the beginning of a great character progression, but thankfully, it’s the latter in this case. Penny is kind of weird and hilarious, and I absolutely would have been best friends with her as a teen (and by that I mean we would’ve just blown each other’s phones up with awkward questions and stupid, geeky jokes).\n People were odd. Sam loved and loathed that about them. Fiction was fine, but real life was the true freak show.\n→ Sam Becker ←Sam, our other protagonist, is a 21-year-old who runs the local coffee shop (and lives above it), and he’s kind of the definition of the “starving artist” trope, but in a good way. There’s a lot of validity in his narrative when it comes to his representation of what being poor is like for kids, and that’s not a side of the story that we see often in YA books. That said, he’s a good egg through and through, even if I just spent most of the book feeling sorry for him and simultaneously kind of wanting someone to shake a little bit of sense into him. It’s hard not to root for him, but I do wish that we’d gotten to see a little bit more of his inner monologue regarding his friendship/relationship with Penny, instead of spending so much time focusing on his ex-girlfriend or his past.\n “I think I get to miss you. I feel like I’ve earned it.”\nThat said, watching these two interact with each other is the best part of the book, by far; their text conversations cracked me up, and their flirting is so awkward and nerdy at times that it reminded me WAY too much of myself and my fiancé. They’re also just so candid and open with one another, and it’s absolutely precious to watch how instantly they trust one another. It doesn’t feel like insta-love by any stretch, but it does portray how blissfully disarming it can feel to meet someone you immediately feel like you can be yourself around.\n He wanted to hug her. In fact, he wanted to hug her and then build an electrified fence around her. A fence that was encircled by a moat filled with rabid, starving alligators.\nDon’t get me wrong, though, there are some very heavy topics in this book, and between that and the characters’ ages, I actually hesitate to call this YA, as it felt more like a “mild” NA read to me. We see multiple instances of abusive and/or neglectful parenting, plus we watch Sam deal with life as a recovering alcoholic (and he does relapse at one point, so if that’s a trigger for you, beware). We also watch Sam deal with his ex-girlfriend’s pregnancy and there’s a lot of chatter about becoming a parent and what that entails. At one point, a character accidentally overdoes it with drugs and ends up hospitalized. A character explains a rape from her past in fairly heavy details, and there are a handful of racist comments thrown at Penny throughout the story. As far as the dialogue itself goes, there are some unchallenged remarks that I could’ve done without, such as one slightly acephobic comment, and several uses of the word “slut”. \n “Don’t drag the entire me folder into the desktop trash can so you hear the paper-rustling sound.”“You can’t ask me that. The paper-rustling sound is too satisfying.”\nAltogether, Emergency Contact isn’t a perfect read; it’s got some awkward comments and uncomfortable moments, and to be frank, the first quarter or so of the book is slow and a little bit boring. That said, it really picked up for me and I absolutely loved the second half. By the end of the story, I was rooting so hard for Penny and Sam to just be happy and healthy and have a beautiful little life together. ♥ If you enjoy YA/NA contemporaries, especially ones with a bit of geek humor and cute boys with lots of tattoos, definitely pick this one up and give it a try.Buddy read with Reg!You can find this review and more on my blog, or you can follow me on twitter, bookstagram, or facebook!"}, {"userName": "TS", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/8143165-ts", "userReview": "4 stars !!! I can see why people hated this, or found aspects of it frustrating or annoying or subtlely problematic or whatever (which is why I couldn't five star this because I didn't absolutely and faultlessly love it), but for once in my life im on the infrared side of the controversial spectrum and everything is good and positive and fucking dandy. this makes no sense I think it's the aftereffects of my month-long sleep deprivation. whatever tho. rtc because I know y'all who read this are gonna drag me for liking a book where the mc calls their own mother a milf.(in which case ill reply to you that SOME RARE FEW TIMES BEING A PERSON WHO CANT DNF FOR SHIT COMES IN HANDY AND IS TOTALLY WORTH IT)------this better be good because I just suffered through what was possibly the hardest 3 academic weeks of my life and didn't have time to pick up a single book for the longest time and I really need a cute contemp right now okay"}, {"userName": "kat", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/25760543-kat", "userReview": "1.5 starsI don't actually know how to put gifs in reviews, but if I did know how this would be the place in which I would just place something that was disappointment.one star for the generally healthy nature of sam and penny's relationship and a half star for jude. she's the real mvp.otherwise, the fragile, awkward friendship/more between penny and sam was enough to keep me reading for 391 pages, but I'm saltier than a dang french fry about the missed potential here and all the borderline offensive little tidbits that were just casually thrown around. (think that metaphor was bad? try reading this book.)anywho I'm probably most definitely going to film a video review on this one and I'll post a link when it's done. please standby while I sort myself out :)"}, {"userName": "Elyse", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I liked it.I didn’t like it.I liked it. I didn’t did..didn’t didn’t mostly didn’t. Really didn’t!!!! Overall this was a drain on my brain. From the start I thought it was pretty stupid to be honest ...Milf mom? and her daughter bitching? What’s funny? Or even interesting? The whole thing....What’s the purpose?Why did I care?And what was this book ultimately about and trying to achieve? Others LOVED LOVED LOVED this book....I tried ...( because I love many of those people who love this book)...but I’m a turd... It made me feel critical. ....A few good moments - ....I was held captive from beginning to end... but shaking my head often. ....Too many things in this book - from the characters, the dialogue, and their personal focus on life, just make me feel pretty sad that if our college age kids are anything like the characters in “Emergency Contact”....we have much to worry about. Others really like this book. Please - read the positive reviews. I wouldn’t recommend it myself ....Thought it was kinda a waste of my time."}, {"userName": "Jessica", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "You know, for a while there I actually thought I might end up liking this story somewhat but now I’m just like, NO. Majorly underwhelmed. 2 stars and I’m being generous.So Penny wants to be a writer, yeah? And she has this professor who critiques her work and gives her advice, talking about the importance of character motivation etc. so I think it’s kinda sad that the author wasn’t able to bring that to paper herself. At the end of the book I’m sitting here with a gazillion questions left unanswered and wondering what exactly it was that I’ve just read. We have this potpourri of fucking serious issues and they’re all just mentioned in this off-hand manner, none of them were addressed properly and maybe half of them were somewhat resolved by the end of the book. It’s like having a character - who was abused as a child, has a horrible relationship with the parents, is anorexic and a drug addict - saying at the end of the book, oh yeah, I should probably eat more and maybe get some therapy. Like, whut? That’s all you (=the author) are going to say? For the amount of issues these characters had I would’ve expected more, idk, closure I guess? And the closure we did get just felt rushed and half-baked.Now, about those horrible characters. Penny was such a selfish, judgmental, mean bitch who looked down on everyone. Some of the things we learned about her past throughout the book put her behavior a bit more into perspective but it doesn’t change the fact that she was not a good person.Sam, with his truckload of issues was alright and the only character I actually liked.Jude and Mallory...one was nice but kinda flat and boring and Mallory was a racist bitch whose 180 towards the end felt completely forced and unnatural. The romance itself, once Penny and Sam started texting, was kinda cute and led to my temporary belief that this might actually end up being somewhat decent but even that was weighed down by Penny’s nasty attitude and all the other issues I had with this. I also don’t get why race and skin color was constantly brought up by the author and a lot of comments made by various characters were either extremely judgmental and prejudiced, or just downright racist. Other than making me dislike the characters even more, the author accomplished absolutely nothing with it.I could try to explain more but frankly, I don’t want to waste anymore time on this.This was not what I expected I would get when I picked this up. Bummer.*********************FINALLY an official buddy read with my book bestie Kim, the Xander to my Willow, my twin in all things bookish, my sister from another mister...told you I’d make it awkward 😉Let’s hope this doesn’t suck! 🤞*********************Well. It did suck :("}, {"userName": "alexandra", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/6784858-alexandra", "userReview": "this book is so beautifully awkward and eccentric i love it"}, {"userName": "Mari", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/18999155-mari", "userReview": "DNF 59%I could have spent the entire month reading only this book to have it on my 2018 reading challenge since I’ve surpassed the halfway point, but I just don’t care anymore. I am worried that if I push myself I’ll end up in a reading slump. I’m so bored and I can’t connect with the characters. I thought I liked Sam but now I’m tired of his negativity. Penny is just plain egocentric and I didn’t like her at all. She wants to appear like an introverted girl but she’s actually really mean and considers herself to be above everyone else.There was no chemistry between the two, the texting wasn’t even a big part of the book. We are told that they text a lot but we don’t actually see it, so it was impossible for me to fall for the romance. As no texting graphic was employed I was also often confused when reading the texts.Nothing much happened and it was so painful to read this. The writing style just didn’t suit me, it was really descriptive and used many words to say something that could have been told in one short sentence.Penny and Sam don’t even meet awkward, I feel like I was lied to by the synopsis. Penny sees Sam for the first time and falls for him right away so this isn’t even a well constructed slow burn romance.So much wasted potential.I got an interesting hair idea from this book tho: light pink hair with aquamarine tips, how cool is that? 👌In fact I guess the only interesting character was Lorraine, she knows what she wants. The others are just there complaining."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "I'm leaving a rating off and calling this a DNF because it just wasn't for me, BUT I still want to share that it's well written, the diversity is awesome, and the characters are in college! I think a lot of people will really resonate with the main character's outlook, but it was just waaaay too negative/bitter for me... eventually I decided all of the petty & cynical judgement in the story (from a lot of different characters) wasn't remotely enjoyable to endure or try to adjust my mindset to, so I stopped reading. But that's 100% my own personality and taste. No judgement on the book itself.I did appreciate how everyone's personality really came through, the setting felt real, and the story was easy to read!Thank you to the publisher for sending me a finished copy."}, {"userName": "Monica", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/748566-monica", "userReview": "4.5 stars 💕 wow wow wow i adored this! i fell so in love with these weird, messy characters. they felt real and complicated. i loved the way digital communication was treated in this book - it’s so rare to find a books that are not super condescending about that. and i LOVE that penny is “unlikable.” i hate how there’s this expectation that girls in books can’t mess up or sometimes fail in order to be a good main character. i also thought the way choi handled the casual racism penny faced, even from friends, was exceptional. that’s not what the book is about, but penny is korean, so it’s still part of her life. same with girl-on-girl hate. i thought that that was tackled both deftly and very well by the novel's end. lastly, there is a tw in this book for sexual assault. and without getting too much into it...i really appreciate how choi handled the affects of that. and while i so appreciate books that tackle sexual assault head-on, that's not this book, so also don't go into it expecting that."}, {"userName": "Stacee", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "I loved this book so much and I don’t think I can properly review it... I will apologize for what will likely be a hot mess.Penny and Sam are both great characters who were easy to root for. They're both struggling and they find a lifeline of sorts in each other. I loved how we just got the surface of the secondary characters. For me, it really helped show how Penny and Sam felt: separate and alienated. Plot wise, it's the slowest and most delicious burn that ever existed. I loved the texting and the calls and the email {OH MY GOD THE EMAIL} and that they barely ever met up in person, but both knew that the other was always always always there for them. There is a bit of conflict and it fits so perfectly in the story. There is a discussion about a rape that took place, so be prepared for that.Overall, it was everything I could have wanted. This is officially one of my top ten of 2018 and I can’t wait to read it again. **Huge thanks to Simon & Schuster for sending me a finished copy**"}, {"userName": "Trina (Between Chapters)", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/9323164-trina-between-chapters", "userReview": "DNF at page 154.I was excited about this but 150+ pages is too far in to feel like I don't yet know one of the main characters at all, and still be waiting to get interested in the story. For a book pitched for its cute text element, the texts took quite a while to be incorporated and are showing ZERO connection between these characters so far. I just grew bored waiting for things to get going.*I received an unsolicited free copy of this book from the publisher but my opinions are my own.*"}, {"userName": "Chloe", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/65613938-chloe", "userReview": "[having a panic attack (hide spoiler)]"}, {"userName": "Amy Leigh", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/68872651-amy-leigh", "userReview": "2.25 stars. This is one of those books you will either love or hate and I found myself wanting to DNF this book but I couldn't. When I first saw this book and read the blurb I got really excited and expected a fun and fluffy contemporary romance. I fell in love with the gorgeous cover and couldn't wait til I could finally get my hands on this book. I'm so glad I got it from the library and didn't buy it. I really didn't like Penny. She was very shallow and complained about people judging her for being Asian American but was quickly to stereotype and judge everyone around her, except Sam bc he was hot...She is outright awful to her mom and calls her a MILF (who calls their own mom a MILF knowing what it means?). Sam was dealing with so much real life stuff I think he should have maybe been the MC? I hated almost the whole first half of the book. I kept expecting the book to pick up and I kept reading but it never did for me because this book was outright depressing. When Penny rescues Sam from a panic attack I think they saw an excuse to have someone to talk to so they exchanged numbers but most of their conversations seemed to cover up loneliness and the ending didn't correlate to me. I didn't see the beginning of a healthy relationship at all.My favorite part is when Penny's roommate Jude calls her out on being an awful friend. Because it's true. Yes, Penny made friends in the book but you can have tons of friends and still be lonely. I think it is good to have someone to talk to when you are going through hard times but I don't think the codependency that formed between Sam and Penny via texting was good for them romantically. Especially with the ex girlfriend drama Sam had combined with everything else in his life. I fully understand that just because I didn't like this book doesn't mean you won't so I say check it out at the library before you buy. I was so sure I would love this book and so sad that the inside didn't match the cover or blurb."}, {"userName": "- ̗̀ cinnamon apple ̖́-", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/68941034---cinnamon-apple--", "userReview": "[he finally believed himself and visited his mom!! i was so proud :') (hide spoiler)]"}, {"userName": "Mlpmom (Book Reviewer)", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/3829694-mlpmom-book-reviewer", "userReview": "Top Five Reasons You Should Buy and Read Emergency Contact Besides the Stunning Cover Art1. A poignant tale about two people who come together in the most unexpected way. 2. Relatable characters that feel real and solid.3. Situations that are all too familiar and again relatable in this digital age.4. An accurate portrayal on what going to college and becoming an adult is really like.5. A connection between characters that was every bit as sweet and it was raw and sometimes harsh. The author spares no ones feelings or emotions in this one. *ARC provided by the publisher in exchange for an honest review.*"}, {"userName": "BookLover", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/12285159-booklover", "userReview": "ARC requested through Netgalley, and kindly provided by Simon & Schuster Canada in exchange for an honest review.\n“Jude nudged her. “Can you do me a favor? Can you tell me this story the opposite of the way you’d tell it normally? Start at the beginning and don’t leave anything out.”\nI set myself up for high expectations on this one after reading rave review from Rainbow Rowell, one of my all-time favourite authors Trying to set that aside and think about how this story made me feel, expectations aside, I would rate this book at about 3.75, rounding up to 4.Penny was off to college and hoping to both kick-start her life and re-invent herself. Sam, a little older, was going through some stressful and traumatic events, though, truth be told, that could be said about his entire life. The situation which causes both to become each other’s emergency contacts was very heartwarming and, for me, the catalyst that put the story into “enjoy” mode for me.I quite enjoyed the story at times and found myself less engaged at others. If I had to put my finger on why, I think it boiled down to me really liking the parts of the story where Penny and Sam were interacting versus the times when their stories did not connect.I really liked how the author executed Penny and Sam getting to know one another as their feelings deepened, all within the safety of their devices. Each needed that safety, though for different reasons. When each character was interacting with the “real” world, I often found myself wishing we could get back to the thoughts and feeling shared between the two while texting one another.All in all, an enjoyable read!!"}, {"userName": "Jasmine", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/21803154-jasmine", "userReview": "INTERNATIONAL GIVEAWAY ON MY TWITTER PAGE! Head over there to retweet my pinned tweet and comment with your latest 5-star read to enter! Ends June 10. :)\n\n***Actual rating: 4/5 Stars***\nEmergency Contact indeed gives me a unique perspective of a romance story, featuring the most ordinary characters I’ve ever seen in fictional novels. The female main character, Penny is a Korean-American girl whose mother is a MILF, has a zit on her chin and always brings an entire first aid kit with her as if every day would be the end of the world. Similarly, Sam is a German-Polish guy who’s an aspiring documentary filmmaker but can’t focus on pursuing his dream due to financial issues. He works in a bakery and bakes some of the most delicious pastries in town. He’s skinny, covered with tattoos and doesn’t get along well with his mother, all of which represent a perfect example of a not-so-typical love interest. Thanks to Penny’s roommates and her popular friend, she gets to know Sam…however reluctantly. Although they don’t seem to click at first sight, they dress exactly the same from head to toe and I’m down for their further romantic development. I love how they become each other’s “emergency contact” when Sam’s trying to cope with a serious break-up with his ex-superficially-snobbish-girlfriend. The timing of such essential roles in both of their lives is impeccable and the whole situation makes everything look so natural. As more and more secrets Sam shares with Penny and vice versa, they become inseparable…online. Interestingly, just like the millennials nowadays, talking face-to-face is a serious challenge to them and it’s also a barrier between Sam and Penny’s relationship since they feel more comfortable messaging.\n\nHe (Sam) couldn’t imagine the space Penny would take up in his life if she sprang out of his phone. He couldn’t envision her from across the room laughing with people he knew. Or scooping peas into her mouth at a table. In fact, sometimes he could barely make out her likeness in his head since it had been so long since he’d seen her and there were so few images of her online.\n\nHonestly, I think this book sort of reflects on our daily life and subtly addresses some potential problems of social media addictions/smartphone overuse among teenagers/young adults. Much to my surprise, I end up liking these aspects of Sam and Penny’s story because their chemistry feels so right to me; hence, I really enjoy witnessing their slowly brewing relationship. Besides, the carefree feeling of watching this pair of lovebirds cross their paths eventually is truly memorable. However, I would definitely appreciate more if the characters, particularly Penny, could be less cynical about their milieu. I understand that being a part of the diverse culture is hard for Penny to blend into the world around her, but I personally think she doesn’t have to put a label on literally everything/everyone she encounters along the way. Most of her thoughts are extremely judgmental and totally stereotype-driven, in my opinion, which leads to my initial dislike about her personality. (But I do change my mind about Penny’s character in general by the end of the book!)Despite the misleading character development in the beginning, I still have a wonderful time getting along with Penny and Sam. Both protagonists are far from perfect but I guess that’s what makes this book outstanding. Readers can easily relate to them (and their flaws as well) so I highly recommend Emergency Contact to everyone. The story is pretty realistic and the characters are being rational/pragmatic, all of which successfully enhance the credibility of a fictional YA novel. Anyway, please don’t hesitate to pick this book up if you’d like to see how Sam and Penny’s online-to-real-life romance work out eventually…and many other turning points!***Thanks to the publisher for sending me an e-ARC in exchange for an honest review.***"}, {"userName": "Devin", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/68565552-devin", "userReview": "I’m super disappointed I didn’t like this book. I thought it would be a five star read, as I ordered it as soon as I heard about it. The synopsis seemed so interesting, but the book itself was the biggest let down this far in 2018.I can’t believe I actually finished reading this. Definitely not my cup of tea. The characters were not easily related to due to the extreme amount of negativity they had throughout the entire book. I didn’t see a lot of character development. I kept waiting for the plot to get more... I don’t know, better? There was a lack of depth for the secondary characters as well, many of them seeming like tropes from other contemporary books I have read before. I also didn’t like the way the characters spoke about certain issues. There are a lot of comments that seemed borderline racist and it really made this an even worse read for me.I know others have really enjoyed this book, and I’m hoping more people enjoy this book. However, for me, it was a let down."}, {"userName": "Romie", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/33510193-romie", "userReview": "“I want to be with someone I can talk to. I wat to be with someone who automatically has a fast folder on me. Someone who feels lucky when I tell them the most unflattering, scary stuff.”I don’t know what it is with 2018, but damn, we’ve been getting incredible contemporary books. I’m in shock. I can’t process this book. My mind is a huge blank right now. I’m just so … overwhelmed? Like is this book real? Or am I making it up? I think we all misjudged this book. It’s not just a cute romance. It’s so much more than that. It has so much depth, it talks about many important subjects and I’m mind blown.This book is about Penny, a 18-year-old Korean-American girl, moving to College in Austin, Texas. It’s also the story of Sam, a 21-year-old tattooed guy living above the coffee shop he works out even though his dream is to be a documentary’s director. They meet for the first time when Penny’s roommate, Jude, introduces him as her uncle. Nothing too awkward you’re thinking, just you wait. They meet for the second time when Penny decides to help Sam when he’s suffering from a panic attack. How’s that for way more dramatic? They end up exchanging numbers, and that’s where their story as a unit begins.I’m also down for dual perspective books, that’s what I live for when it comes to Contemporaries, especially when there is a love story. I don’t like getting only one perspective, I always feel like I’m missing out on something, a part of the story, so points for the dual perspective. It’s even more interesting when it comes to this book because Sam and Penny have their own distinct stories. Penny has to deal with her mom being a social butterfly and acting like the teenager instead of the mother. Sam is struggling with the feelings he still has for his ex-girlfriend and the anxiety that comes with this situation, the relationship he has with his mother, and his wish to pursue his studies even though he doesn’t have much money.Sam and Penny communicate pretty much exclusively via text messages, it’s their things, they can talk about anything with each other and they don’t feel like they have to hide some parts of themselves. They discover so many things about the other, tiny things, scary things, they’re there for the best and the worst. They struggle at deciding if being more than just ‘online’ friends is a good idea, if this is what they want, if it won’t mess up their friendship. They both find it hard to express themselves when face to face. I honestly related so much to this? Like I think it’s both an introvert and millennial thing. Nowadays, we are used to be so open on the world, we’re used to talk to complete strangers at first who live across the world. Reading about Penny and Sam texting each others even though they live ten minutes apart was relatable because this is what I do as well. Sometimes my friends and I text each others even though we’re in the same room. And to the people who say you cannot create something strong through text messages …. are you for real? Like a lot of introverted people, I find it hard to express myself in front of people, it gets my anxiety level so high it shouldn’t even be possible. Texting is one of the most wonderful things in the world. So yes, I get Penny and Sam. I get why they built their relationship through texting, it’s relatable. Their relationship is healthy: they freaking communicate! They talk about their feelings, what they’re the most ashamed of, what troubles them, what scares them, what makes them happy … they communicate, they respect the other … what do you want more? Their relationship makes me happy, this is one I can relate to. A 21-year-old talking to their 18-year-old crush via text? Painfully relatable.This book is truly one of the most relatable I’ve ever read. Yes, it took me some chapters to get into, because it was so different from what I had expected, but then it turned out even better than I had hoped it would be. I’m so grateful this book exists.Trigger warnings: a rape scene being mentioned — panic attacks described"}], "description": "For Penny Lee high school was a total nonevent. Her friends were okay, her grades were fine, and while she somehow managed to land a boyfriend, he doesn’t actually know anything about her. When Penny heads to college in Austin, Texas, to learn how to become a writer, it’s seventy-nine miles and a zillion light years away from everything she can’t wait to leave behind.Sam’s stuck. Literally, figuratively, emotionally, financially. He works at a café and sleeps there too, on a mattress on the floor of an empty storage room upstairs. He knows that this is the god-awful chapter of his life that will serve as inspiration for when he’s a famous movie director but right this second the seventeen bucks in his checking account and his dying laptop are really testing him. When Sam and Penny cross paths it’s less meet-cute and more a collision of unbearable awkwardness. Still, they swap numbers and stay in touch—via text—and soon become digitally inseparable, sharing their deepest anxieties and secret dreams without the humiliating weirdness of having to see each other.", "title": "Emergency Contact", "url": "https://www.goodreads.com/book/show/35297272", "average": 3.87, "cover": "https://images.gr-assets.com/books/1519613921l/35297272.jpg", "reviews": 1190, "authors": [{"url": "https://www.goodreads.com/author/show/7389689.Mary_H_K_Choi", "name": "Mary H.K. Choi"}], "type": ["Contemporary", "Young Adult", "Romance", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/35297272-emergency-contact", "http://www.goodreads.com/book/show/36371056-emergency-contact", "http://www.goodreads.com/book/show/36101070-emergency-contact", "http://www.goodreads.com/book/show/36631763-emergency-contact", "http://www.goodreads.com/book/show/23161714-oh-never-mind", "http://www.goodreads.com/book/show/15727743-lady-deadpool", "http://www.goodreads.com/book/show/9095076-women-of-marvel", "http://www.goodreads.com/book/show/29805858-eat-pray-roll", "http://www.goodreads.com/book/show/29805857-dick-pic"]}