{"ratings": 511, "userreviews": [{"userName": "Wendy Higgins", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/9225614-wendy-higgins", "userReview": "This is a tale of the modern descendants of The Little Mermaid from Hans Christian Andersen's version. It's the most fun I've had reading in a long time. There were several times when I was out-loud giggling like crazy. It's got romance, adventure, and fantastical lore. I definitely recommend this one."}, {"userName": "Sabrina", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/41916465-sabrina", "userReview": "Check out my full review on my blog!! http://omgbooksandmorebooks.blogspot....I absolutely loved this book. It is magical and captivating and everything I wanted in a book about mermaids. I can't tell you how long I've been searching for a mermaid book and this was the perfect book to start my love for ya books about mermaids.I have always adored The Little Mermaid since I was young. But I thought the Disney fairy tell was too sweet to be true. I'm so thrilled that Tobie Easton took Hans Christian Andersen's version of the Little Mermaid. She brought one of my favorite childhood fantasies to life and I'm forever grateful. Emerge is a wonderful and captivating retelling of the Little Mermaid. I love the fresh aspect of mermaid mythology throughout the book. Lia is a determined yet lost trying to navigate her way through the human world. Her family has to take refuge on land because of the war brewing in the sea. Lia must adapt and become \"human.\" Lia is willing to follow mermaid norms but when she believes that Clay is in danger, she is willing to break the rules and become a *insert thing here* in order to save him.Lia is a wonderful narrator and protagonist. She doesn't have everything figured out. She is exploring what it means to be human. She is curious and thoughtful and wants to see the world through her own eyes. Her love and determination drives her throughout the book.Okay so the top of the book it says \"Mer Chronicles 1\" WHAT DOES THAT MEAN!?! IS THERE MORE!?!?! Please let their be more. I would highly recommend this book for those who love fairy tell retellings and mermaids."}, {"userName": "Stacee", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "2.5 stars? I'm not sure how I feel about this. I liked Lia well enough. Her inner monologue comes off as much younger than the age she's supposed to be. She has good intentions, but doesn't make the best decisions and I struggled with some of her choices. I loved her moments with Amy the best; those seemed to be the most authentic. There are a lot of other characters, but we all know I need to mention the boys. I saw more of a connection between Lia and fellow Mer, Caspian, but it was Clay {the human} that she wanted. Sadly, I didn't get the chemistry or sense of history between them. There is a great set up to the story. I loved the twist on the Little Mermaid and all of the consequences that went with it. I think there was a lot of potential here, but for me, it didn't work as well as I was expecting it to. Perhaps I would have enjoyed it more if I hadn't just finished two epic books of epicness and been in a wicked hangover. **Huge thanks to Month9 for providing the arc in exchange for an honest review**"}, {"userName": "Rachael", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/44634038-rachael", "userReview": "I have to admit I went into this book extremely skeptical but still optimistic. I've read (or attempted to, at least) other novels about mermaids. I love mermaids; I mean, come on, perfect hair all the time, no shaving, no periods???! But every single one I've read falls so dang short of expectations that I was weary to even want to read anything about mermaids. This one, however, it's so well done. Full review to come later!*edit as of June 20, 2017*Reading this book in June made me not only long for the ocean again, but really, really wish I were a mermaid. I want to cry and me tears turn into pearls!!! The second read through I caught a lot more of Tobie's genius foreshadowing. When Clay says he's a prince in disguise??? I got that this run through! I hated Mel the first time, but this second time I hate her even more. I wish she'd choke on some kelp or something. The nerve of her and her father!!!!!!The things Lia did and the rules she broke are still crazy (she SIRENED CLAY, for crying out loud!!), but I knew they were necessary, so they weren't as mind boggling as they were for me last year. I find it kind of ironic—although it was probably completely intentional—that Lia, a distant cousin of the Little Mermaid falls in love with a human. She pines for him from a distance but knows it could never work. At least this go round she already had her legs and didn't have to strike a deal with any sea witch!! This book was just as cute the second time as it was the first, and I am so excited to start Submerge!!!!!!"}, {"userName": "Lori Goldstein", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/237358-lori-goldstein", "userReview": "You can't choose your relatives as much as you want to (say, for example, when they doom your entire race). Such is the lot of the Merpeople in Tobie Easton's delightful debut EMERGE. In this twist on The Little Mermaid (a la Hans Christian Anderson not the big mouse), Lia and her family live among the humans, hiding their true selves and forming a new Mer society Above because of a war that's been raging Below. This is truly a fish out of water story and Lia's struggles to fit into high school echo those of every teenage girl. Instantly relatable and likable, Lia is a strong character who gets sucked into something she doesn't understand for all the right reasons. With an intriguing romance, rich world building, and a good dose of humor, I can't recommend this enough for those who love contemporary fantasy (a genre I happen to be quiet fond of myself!)."}, {"userName": "Jacqueline Smith", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/23774843-jacqueline-smith", "userReview": "Okay y'all, this is one of my new favorite books. Once I started it, I could not put it down. I love mermaids. I love mermaid stories. I especially love mermaid stories that tie other mermaid stories together... much like this one! Lia is a teenager with older sisters, a crush on the cute boy who plays guitar, and a keen desire to get out of gym class. She also happens to be a Mermaid. Not just any Mermaid. Lia and her family are distant cousins to The Little Mermaid herself... the Princess who cursed Mer all the world over with short, human lives in place of immortality. Now the Mer world has descended into war, chaos, and anarchy with a few refugees making a life for themselves on land, including Lia's family. When new girl Mel shows up and sets her sights on Lia's crush, Clay, Lia tries to remind herself that she and Clay could never have been together anyway. But is it possible that Mel is even worse for Clay than a relationship with a little Mermaid? Like I said, I loved this book. Every moment. Every turn of every page. I can't wait for the sequel. And now, I'm wishing more than ever that I was a Mermaid."}, {"userName": "Jennifer", "userReviewDate": "Jul 15, 2015", "userURL": "http://www.goodreads.com/user/show/7725952-jennifer", "userReview": "When given the opportunity to read an ARC of Emerge, I jumped at the chance. I really enjoyed the fresh take on mermaid mythology sprinkled throughout the story. Lia was in many ways your typical high school junior, but she also struggled to keep her mermaid side a secret. She's also fighting her attraction to an off-limits human boy, Clay. When a new girl shows up and captures Clay's attention, Lia feels the urge to protect him, although she doesn't know why. I especially loved the interaction between Lia, her sisters, and her cousin, Amy, who along with Lia's best friend Caspian, made up a supportive mermaid network of friends. The story was action-packed and kept me guessing right to the very end. I can't wait for Book 2!"}, {"userName": "Danielle", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/37286206-danielle", "userReview": "I want to be a mermaid too! Emerge is the fantastic start of the Mer Chronicles, and I'm totally addicted. Submerge Book 2 is due out 12th September, and it's just as good. I love the added touches like sea talk and the legends.Lia is a mermaid trying to fit in a human world. Her legs don't work the way she wants, and she has to watch she doesn't slip up with her mermaid ways. Clay is a human boy at school she has a crush on but try's to keep her distance from. A new girl starts at school and starts dating Clay. Lia is jealous but also concerned. The new girl may not have Clays best interest at heart, and Lia just can't leave it alone. Lia and Clay spend time working on a class project together and they can't help becoming closer. Lia is supposed to marry a merman, and a romance with Clay is classed as taboo, but she struggles to stay away from him. Can she keep him safe as well as her heart?Lia's family live on land. They are involved in the community and help Mer people. The sea has become unsafe waters since the mermaids lost their immortality. Her family want peace, and try to help others adjust.This book had me hooked I was interested in all aspects of the story. I loved all the characters. This series is definitely one to watch and I can't wait for more!!5 out there 5. ARC received as part of the submerge blog tour."}, {"userName": "Pete Tarsi", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/36916536-pete-tarsi", "userReview": "As a YA author whose debut book is a story about mermaids, I assigned myself a mission to read similar books in the genre, and I’ve enjoyed them to varying degrees. Well, there’s a new fish in the ocean: Emerge by Tobie Easton. This is her first novel, and the blurb sounded interesting, so I decided to give her a chance—one debut YA mermaid author to another.You know what? I’m overjoyed she emerged on the YA mermaid scene. Our narrating protagonist is Aurelia Nautilus (Lia for short). She and her family live in a sprawling mansion on a private beach in Malibu, complete with underwater grottos. Lia and her family (dad, mom, three sisters, and a younger cousin) are all mermaids living on land to escape the ravages of war under the waves. Ever since the infamous “little mermaid” incident, mermaids have lost their immortality. This has caused power struggles as different factions try to break the curse. Easton weaves Hans Christian Andersen’s fairy tale so deftly into her unique mermaid world that the two complement each other perfectly.Lia has had some difficulty adjusting to a human high school. When mermaids reach puberty (awesome detail), they can start switching their tails for legs. Maintaining those legs requires much concentration, which is particularly challenging for Lia in gym class. She’s got a huge crush on a boy in her classes named Clay, but he’s human, and it’s forbidden for mermaids to enter into long-term relationships with humans. There’s a young merman named Caspian, who has been Lia’s closest friend since childhood, and there’s a hint that her family would like them to couple up.This has all the set-up for one of those typical YA love triangles, but it never feels like one because the narration is so freshly in Lia’s voice. She insists Caspian is devoted to her as a dear friend, and it’s clear he has her best interests at heart. She doesn’t have a clue about how Clay feels about her, so she stresses about that. She’s a teenage girl trying to find her identity, her place in the world, even though she lives somewhere between two worlds. More on that later.However, a love triangle does develop when new girl Mel appears at school and works her magic on Clay. To avoid spoiling anything, even this doesn’t feel like a typical love triangle. Sure, Lia’s jealous that Clay is enchanted by Mel, but there are deeper motives at play. Clay may be in danger, and Lia cares about him too much. That’s all I’m saying, and I haven’t said anything you can’t learn from the book description, but this conflict really develops.The stakes are excitingly raised, not only by Mel’s actions, but by Lia’s counteractions. One of many strengths of the book is the complexity of Lia’s character. As I said, she’s caught between the two worlds, trying to do what her parents and mermaid community expect of her but also trying to do what she thinks is best for Clay. She’s not a passive character by any means. She takes action; she makes choices. Some of those choices aren’t the best choices, but her rich narration made me the reader fully understand why she made them, even when she knows they’re wrong. Her inner conflicts—human vs. mermaid, parental expectations vs. personal desires, and right vs. wrong—drive this story deeper. In many YA books, protagonists get away too easily with breaking the rules. It’s much more compelling and believable to acknowledge the consequences of one’s actions, whether it’s broken trust or other punishments. Lia’s story, straight through its gripping climax to its well-earned resolution, is greater for addressing such consequences. I don’t want to give the impression that this is a heavy tale (or tail?) because there’s also a lot of lightness and heart to it. The supporting cast, particularly her sisters, is fun. There’s great humor (sea puns are obligatory in these kind of books—I’ve written a few myself—but there were some new and funny ones here). There are sweetly developed relationships between the characters. And Lia’s internal monologue about the ups and downs of trying to fit in and keep her tail hidden sparkle on the page and in the imagination.If you love mermaids, you need to own this book. If you love YA fantasy or romance, you need to read this book. Heck, if you just love well-written stories, you need to read this book. It’s billed as book one of the Mer Chronicles, so there’s a sequel (or is it sea-quel?) coming, for which I’ll wait with bated (or is it bait-ed?) breath. Till then, Emerge emerges with FIVE STARS."}, {"userName": "Jennifer Bardsley", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/7163159-jennifer-bardsley", "userReview": "I’m not a huge YA fantasy fan, so I wasn’t sure how I would like Emerge by Tobie Easton—until she hooked me from the very first chapter! This book is much deeper than a modern take on the Hans Christian Anderson fable; it explores control, manipulation, and teen-dating violence. Plus there’s fun mermaid stuff!Easton centers her plot on a teenage girl named Lia Nautilus growing up in Malibu, California. Lia has a big secret to hide. She and her family are Mer, passing as human due to a devastating ocean war. When Lia’s longtime crush, a human named Clay Ericson, falls under the spell of the new girl in school, Lia learns what lengths she will go to in order to get what she wants.I absolutely adored the world-building Easton stirred into her plot. This is a story that would be perfect for fan fiction, because teen readers will want to dive right in. I also felt Lia was character I could root for.I received a free, early review copy of Emerge, but have already preordered a copy for my nieces because they will love this book."}, {"userName": "Amber Carroll", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/25583157-amber-carroll", "userReview": "I loved this book, I can't wait to see how their lives will be changed and follow Lia and clay and see their love progress. I would love a book from Caspains point of view!!!"}, {"userName": "Jennifer Hummer", "userReviewDate": "Dec 07, 2015", "userURL": "http://www.goodreads.com/user/show/5411006-jennifer-hummer", "userReview": "I was lucky enough to get an advanced copy of EMERGE. It's clever, funny and magical. Who knew there could be so much drama under the sea?"}, {"userName": "Jasmine Lee", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/49935171-jasmine-lee", "userReview": "This book is amazing! Read it and you will not be disappointed."}, {"userName": "Anna", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/49618098-anna", "userReview": "LOVELIEST BOOK! Absolutely cannot wait until April & for the world to see it!"}, {"userName": "Jen ♥Star-Crossed Book Blog♥", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/28353412-jen-star-crossed-book-blog", "userReview": "Have you ever stepped into a series and was left wondering if you missed something?  Maybe you somehow skipped a few chapters beforehand?  Because that's exactly how I felt when I started Emerge.  By the time I got my footing, it was a little too late.  Which was such a disappointment, because I was so excited for this book!  A curse on the mermaids because of what The Little Mermaid did, and we get to hear the story from one of her descendants?  YES please!  But as I read through the pages of Emerge, that yes sadly turned into a no.Confusion & No Connection\n\nAm I really off the fishhook?\nThe first chapter was unfortunately where the confusion started for me.  Here is the situation that made me say what,what, what......Aurelia, who was the descendant of The Little Mermaid, was at a high school with humans and their PE coach was trying to make her swim.  A little fyi....if she got in that pool she would have transformed into a mermaid.  Luckily a human boy, named Clay, got her out of that situation.  In that first chapter we then got to watch Aurelia and Clay have an awkward conversation, Clay date a new girl in school, and then Aurelia see the new couple kiss in a store where she was shopping.  Upon seeing them kissing, she wanted to leave the store because she could not handle watching them kiss.I was SO lost towards Aurelia's strong feelings towards Clay and his new girlfriend kissing.  Was this someone she had crushed on forever?  Did they have a history?  I had that small amount of interaction, no backstory, and I was confused.  How was I supposed to be compassionate, let alone feel her emotions, if I couldn't understand the why behind it.  I finally got the why and backstory at 16%.  Which left me a little confused until that point. Timeline?\n\nMy father claps his hands once, breaking the somber mood. “I thought the party last night went just swimmingly. Pun intended!”\nI am 99.9% positive that I have never complained about a books timeline before in a review.  It's usually an aspect of the book that never affects me.  But I guess that is why they say never say never, because Emerge's timeline drove me a little crazy.  It vacillated from slow to fast, such as their party went by in the blink of an eye, yet a conversation that took place in minutes would go on for pages.  I never could get a good grasp on whether something was going to take place in a matter of minutes, days or weeks. Easy Peasy Plot Twists\n\nI was probably gaping at him like a codfish.\nI love when I have to work hard to figure out plot twists before the characters do.  But this time, they were so easy to figure out.  Maybe that was the point?  But if it was, I wish that I would have at least gotten farther than a quarter of the way into the book before saying aha again and again.  Because then I kept finding myself frustrated with Aurelia as she she completely oblivious to clue after clue. An Infuriating Heroine\n\nI shouldn’t do what I’m about to do. It’s wrong. It’s so wrong. But what other choice do I have?\nYou know what?  All those issues above can't even hold a candle to my frustration to the heroine.  Aurelia's decision making abilities was beyond horrid.  She made that statement above at not even the halfway point, and just so you know I loathe when people say that.  A lot of times, there are PLENTY of other options available. And this was definitely one of those times.  She could have asked for help, confided in her best male friend, Caspian, or her older sister.  Yet she took the worst possible of way out again and again and again.  And I never fully grasped her interest towards Clay, because there was Caspian.  Caspian was her friend and a male mer.  And when the two of them were together, I could see the sparks flying.  But with Clay, I felt absolutely nothing. I did contemplate not finishing Emerge a few times.  But I'm one of those people who always holds out hope.  Hope that something, anything will pull me back in.  Unfortunately, nothing ever did.  But I do have to say that the premise was fascinating.  I just wish it would have been executed differently.  And Emerge did end nicely with lots of options for the next book, but sadly I have no desire to continue this series.  But here's hoping that if you pick up this book, that you are able to find enjoyment where I could not.*ARC kindly provided by Month9Books in exchange for an honest review*This review was originally posted on Star-Crossed Book BlogFor more of my reviews, please visit:"}, {"userName": "Cassie C", "userReviewDate": "Aug 11, 2015", "userURL": "http://www.goodreads.com/user/show/4479550-cassie-c", "userReview": "See more reviews on my blog Novels and NecklacesThis book is a little difficult to review because I'm honestly not sure how I feel about it. It definitely didn't live up to my expectations (or the pretty cover), but it wasn't a bad book at all. It was a cute, short mermaid story that will appeal to a lot of YA readers. However, it is kind of hard to tell you exactly what I didn't like about this book (which is also why I debated on whether or not I wanted to review this story at all). Tobie Easton created a unique world and I liked the approach she took with the story. The plot offers a creative spin on the Little Mermaid tale and had likable characters. However, these two things are also where I had a little bit of a problem. You are thrown into this magical and exciting world with very little backstory. The writing was a little too excitable at times (if you read this novel, you'll see what I mean), but overall was very well done. By this I mean that Tobie Easton seamlessly incorporated the \"mermaid\" terms into the story and you really weren't confused. I really liked the idea of how mermaids \"got their legs,\" and it was these little tid-bits that made the book really fun to read. There was always something new you were discovering throughout the novel. Unfortunately, these were spaced out and only small parts of the book. I just wish there was more backstory so that I could fully immerse myself in Lia's (our MC) world. Also, even though the characters were all teenagers, Lia sometimes came off sounding a little younger than her age. This in turn made the story feel geared toward a younger audience at times.Lia was an interesting character, but I never truly connected with her. Perhaps it was because this was a short book, or maybe it was just how she spoke in parts of this book where she came off extremely immature. However, there were a lot of times (like her interactions with her cousin Amy) that made me love her character. She was extremely relatable and the absolute sweetest. You could tell that she wanted the best for her cousin (and her sisters). They were all very supportive of each other, and exactly what each other needed. I didn't completely buy the \"romance\" she had with Clay either. I actually felt that she had more of a connection with one of her best friends, Caspian, than with Clay. Nevertheless, I didn't mind the relationship that blossomed between Lia and Clay. I would be interested to see where their romance would go in a second book. Overall, this is a quick read that will appeal to fans of cute YA mermaid books. Is it the best I have ever read? No, but there is a lot of action and excitement towards the end of the book that makes it worth checking out. I'm not sure if I want to read the second book, but I guess I'll see what it's about and then consider giving it a shot. This series has a lot of potential, and Tobie Easton obviously has a gift with words. I will certainly be checking out more from her in the future! Happy reading :)"}, {"userName": "Robert", "userReviewDate": "Sep 01, 2015", "userURL": "http://www.goodreads.com/user/show/46535784-robert", "userReview": "I just got this book and finished it in two days - talk about binge-reading :) In all honesty, it's a LOT of fun and a really smart story that keeps getting more intriguing and deep as you go. I can only think of two other books that pulled me in this much, which is a big compliment. Here are my thoughts so far, I will update this review again in a few days with more thoughts.Story:The story revolves around Lia Nautilus, a mermaid living on land in California. In her magical world all Mer have lost their immortality because of a curse caused by the Little Mermaid herself. But Lia has bigger fish to fry, including dealing with High School trouble and her feelings for the handsome Clay Ericson. When a new girl appears at Lia's school, she isn't just bringing her jealousy-inducing good looks but also a very dark secret with her.. That's all I want to give away to not spoil the story, but it's really just the beginning. From the first chapter this story felt, for lack of a better word, magical. The shiny world of mermaids living in Malibu that the author has created is incredibly fun and the book's story gets better and better with every chapter. I especially liked the incredibly entertaining cliffhangers and many excellent characters that appear in Emerge - they're a joy to experience. Writing:I have to say that I really liked the writing style in this book. It's fresh, often surprising, and wasn't boring even for a second. The book kind of takes you by the hand and along for a fun and romantic story. I loved how the author played with the Mer culture and included so many thoughtful and playful references to it throughout the story. It's excellent and very believable world building and the clever mix of modern teen culture and timeless mermaid magic is a total win. Well done.Summary and Final Thoughts:Overall, I had an amazing time reading Emerge and have recommended it to three of my friends, which I only do on rare occasions. I usually am critical about books and have mostly given three or four stars on my Amazon reviews, but this book is REALLY GOOD. Can't wait for the next book in this trilogy! Give it a try (Amazon is already shipping it early!), you'll love the magical world that's hidden behind the secret mermaid grottos."}, {"userName": "A.J.", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/46362775-a-j", "userReview": "I LOVE THIS BOOK SO MUCH.Characters: Lia is a fantastic protagonist. She's someone who is easy to root for, and she makes enough tough decisions to give her a lot of nuance. Her family members all have distinct personalities, and it was interesting to see how she interacted with each of them. (I love love love Amy!) Clay is very swoon-worthy, and Caspian is perfect beyond words. The villains are also great, because they're not just evil for the sake of being evil.World-building: Fantastic! So many things are covered, from clothing to terminology to history. It was fun immersing myself in that world. And all the information was delivered at the right times. It never felt like the world-building bogged down the story. Instead, it enhanced it.Pacing: Great. It never felt like it lagged or went too fast.Plot: I don't want to give anything away, but oh man, prepare yourself. There were some awesome plot turns I didn't see coming.This is without a doubt the best mermaid book I've ever read. Even if mermaids aren't usually your thing, I urge you to pick this one up. There's action on land, there's action in the ocean...it's just so cool.Highly recommend this book. I can't wait for the sequel!!! I didn't want this story to end. I don't know how I'm going to be able to wait for the next one.(Also, how gorgeous is that cover?)"}, {"userName": "Shannon Thompson", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/16318884-shannon-thompson", "userReview": "This is, by far, the cutest, loveliest mermaid story I have ever read for teens. If you love mermaids—especially The Little Mermaid—you will love to see how The Little Mermaid affected modern mermaids with the additional curse and a war of the Seven Seas. In the midst of all this is a descendent of The Little Mermaid, a girl named Lia, and she’s just trying to figure out how to use her legs and live life like a normal teen. But she’s not normal, and her life gets even more unusual when she falls for a boy named Clay—a forbidden love, thanks to the fact that he’s human—and another mermaid chases him, too. What unravels is a deadly fight of fins (and other hilarious fish puns). You’ll love the humor, you’ll revel in the madness, and I think you’ll fangirl over the romance just as much as I did. Between Lia, Clay, Caspian, and other cast members, Emerge is fresh yet evocative, and highly recommended. I could barely put it down. On a side note, Caspian—the best friend—provides an awesome pronunciation guide for Mermese in the back, so be sure to check that out. (I loved Clay, but I'm totally #TeamCaspian.) ~SATRecommended to: Mermaid lovers and readers of young adult fantasy, fairy tale retellings, and swoon-worthy (but clean) romance. Favorite quote: “Sometimes,” he continued, “you learn the most about a person from what they don’t say.”"}, {"userName": "Elsa Munoz", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/34586240-elsa-munoz", "userReview": "I got an ARC in exchange for an honest review:This book was AWESOME to say the least. Easton takes the Little Mermaid tale and adds a completely new, intriguing and totally believable twist to it! Lia (the main character) is just your average mermaid living among humans. As is normal for any teenager, she falls in love. Yet to get close to him would be dangerous, because there's no way she can reveal her secret! The fact that the merpeople live among normal humans was such a great hook! But I have to be completely honest and say that the true reasons why I love this book has nothing to do with the main character....the characters who really caught my attention were Clay Ericson and the \"villain\" of the story, Mel Havelock. If you guys are looking for a new book boyfriend, let me just say that Clay is TOTALLY crushworthy! As for Mel, she's just the type of villain that people will love to hate ;) Over all this book definitely gives you the feels of broken hearts, tears, joy, excitement, and teenage love!Congrats to the author on such an awesome book!!! Can't wait for this to become a movie someday and of course I'm looking forward to book 2!!!"}, {"userName": "Kathy Osborn", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/17249820-kathy-osborn", "userReview": "What a sweet YA romance!!! I enjoyed reading this book from Tobie Easton, it had mystery, sweet romance and magic all wrapped up in one. Lia is a mermaid who lives with her family on land, however under her house is tunnels of salt water that they reside also. All of the mer people are under a curse from Little Mermaid time as they are no longer immoral. We are taken on a journey through Lia's first time in a human school and her struggles to fit in the human world. She is not allowed to get romantic with a human, but can have human friends. First Love is everlasting though as she has a crush on Clay, she can't act on those feelings.Until, Mel, another mermaid shows up at the school. Mel is downright evil and puts her clutches into Clay by Sirening him. What is Lia to do to save Clay from becoming Mel's slave? Can she save him or will she lose him forever if he finds out that she is a mermaid?I was happy to see how Lia's character grew throughout the story as she became stronger and determined to succeed in saving Clay. If you love Mermaid's this book is for you and I would recommend this book as a wonderful read."}, {"userName": "Sara Ella", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/37484156-sara-ella", "userReview": "This is an epic story. Every detail is beautifully described. Tobie Easton creates a magical mer world within the unbelieving human one. I really enjoyed her playful mer-isms and her refreshing, water-based views! She is very inventive in creating the mer home and culture. It was easy to immerse myself; her mer world is so different from reality and unique to the sea--very fun and fascinating. Like all Disney stories with a happy ending, Lia succeeds in providing a blooming romance and all the angst that comes with it. And there is an equal amount of adventure too with layers of mer politics and intrigue as the land-based mer community struggles to survive within the human world in peace. The only regret I had with this story is that I wish there was more! I highly recommend Emerge by Tobie Easton for all lovers of the sea! - See more at: https://www.yainsider.com/b/emerge#st..."}, {"userName": "Savannah Dooley", "userReviewDate": "May 25, 2016", "userURL": "http://www.goodreads.com/user/show/56203583-savannah-dooley", "userReview": "I think the only way I could have enjoyed this book more is if I'd read it as a pre-teen, when my imagination was at its peak. Let's be real, even at 30 I didn't want to put it down. The characters are well drawn and the plot kept me guessing, but what really hooked me (heh) was the richness of the world Easton builds, with delightful details that immerse the reader in a secret Mer-culture with its own history, language, customs, and physiology. You get the sense that this first book just scratches the tip of the iceberg-- that behind this story is a much deeper world to explore-- and I can't wait."}, {"userName": "Rebecca", "userReviewDate": "Apr 29, 2016", "userURL": "http://www.goodreads.com/user/show/1302446-rebecca", "userReview": "#TeamMermaid! It will come as no surprise that I love mermaid books, but I'm also very picky about them (I've started several that I just couldn't finish). EMERGE was so good that I read it in five days! I loved that it was based on the original version of The Little Mermaid, instead of the Disney version. I loved the curse, and Lia's guilt over what she was doing, and the large cast of characters, and the way they fit into the tapestry of the story. There were a couple of sciencey bits that bugged me (lack of \"the bends\", for one, although I supposed it *could* be explained and I wish it had been), but overall I thought this was a wonderful twist on a regular mermaid story :)"}, {"userName": "Adriana Mather", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/35226043-adriana-mather", "userReview": "This is a well-crafted and beautifully articulated adventure story! Easton has created an enchanting subculture complete with language and unique customs. Aurelia, Lia for short, is a 17-year-old mermaid struggling to fit in in a human high school in Malibu, CA, where she and her family relocated when the Mer-wars made living under the sea too dangerous. Her struggles are exacerbated by her crush on her classmate Clay. Human-Mer pairings are forbidden. I loved this story from beginning to end. Dare I hope for a sequel?"}, {"userName": "Claire Fayers", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/14843959-claire-fayers", "userReview": "This book has romance, it's got mystery, it's got magic, and most of all it's got mermaids. A wonderful, original twist on The Little Mermaid, Lia Nautilus has all the pressures of high school, plus the fact that her legs may turn back into a tail if she loses concentration. I like heroines who make mistakes, and Lia makes plenty as she fights her attraction to classmate Clay whilst trying to keep him away from the unpleasant new girl. The story is told with humour and a good sprinkling of mermaid lore, mermaid history and mermaid fashion. Recommended to all lovers of the sea."}, {"userName": "Emily France", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/7895062-emily-france", "userReview": "I was lucky enough to receive an ARC of EMERGE, Tobie Easton's fantastic debut novel. I was instantly hooked by the premise... a community of Mer people who are hiding out among the residents of Malibu?!? YES, PLEASE. This story is richly imagined and wildly creative. And on top of a great tale, Lia has such a witty voice; I'd follow her narration anywhere. I can't wait for book two. Bravo!"}, {"userName": "Jessica", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/5011755-jessica", "userReview": "If you love retellings of fairytales this one is about The Little Mermaid. I absolutely adore this series and I highly recommend you read the lovely writing Tobie Easton has to offer! 💙"}, {"userName": "Aneesa", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/11366968-aneesa", "userReview": "I received an eARC from the publisher in an exchange for an honest reviewA direct descendent from Little Mermaid has cursed the Mer folk, war has ensued to find a political leader who is not corrupted. The Mer folk are enraged they want their immortality back but thanks to the Little Mermaid they are trapped and age like humans. Lia and her family live in Malibu, her parents oversee and run the foundation they have started on land to ensure they are protected and are blended in with the way human lives.I was really surprised that the Little Mermaid was the ancestor for Lia and her family, I am not sure what I had envisioned really; I was under the impression this book would be like all the other Mer books I have read, but with this added little twist I was relieved. Phew! *wipes brow*. Mel and her father made the plot very interesting with the added knots that were added with each turn, it made me think how Lia will ever get this situation under control. Then BAM! comes another twist which I was totally not expecting,  can Mer folk even do that? I haven't read much retellings so I am not completely sure . For a short while, it seemed everything was too easy and perfect which made the story line a little tedious and boring, I wanted more action, more romance. Although there was some towards the end, for me it wasn't enough for what it seemed like would be a epic story. It makes me wonder though, is that the end of the plot? Or is there another book in the series?Lia is shown to develop at some point throughout the book especially when she is forced to take matters in to her hands and save Clay, it was fun to see her be a little decisive and confident in her own choices. I would be lying if I said a small part of me seeing her rebel against her parents a little did not enjoy it, I found her more likeable and relatable as a character then. Caspian is a true gentlemen. There is not other way to describe him.Without Caspian, I wouldbe lost. He is so sweet and adorable, and a true friend. Someone you can rely on in your bad times if that isn't a good enough reason to read the book then how handsome him and Clay is? I mean even Lia admits to that and even I would not turn a blind eye.Me: Right Lia? ;DLia: Right ;)Clay is very innocent in all of this, being pulled in one direction and then another I really felt sorry for him. To him, both girls were interested but only one was working out whereas the other was true but fake :(. I like that his character was confident and sure of himself but was never afraid to show vulnerability. Most male characters have their ego or pride which does not allow them to 'talk about their feelings' but thankfully that was not the case with Clay.True love is worth everything. The theme of the book, the book illustrated this perfectly even if their was a few parts in the book where I had no idea where this was going. I thought there was some parts in the book where it was unnecessarily prolonged, I just wanted it to be over and done with. This was increasingly frustrating as a reader when you simply want to enjoy the book.Blog |Twitter| Facebook | Instagram | G+ | Pinterest"}, {"userName": "Vanessa ♛Queen Alchemy ϟ Novel Nerd Faction♛", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/1939326-vanessa-queen-alchemy-novel-nerd-faction", "userReview": "3.5/5 starsI received this book for free from the publisher in exchange for an honest review.This was such a great read! This story has everything that a good story needs- awesome world building, intriguing characters, magic, and mystery. Everything is put together magnificently to form a unique story. While I thought that some things could have been added to the story to give it more appeal, the story is quite enjoyable. What I likedI loved the story. I was enchanted by it. The plot was well thought through and the story came together nicely. I enjoyed hearing the tale of The Little Mermaid and how it applied in this story. I also loved how the tale of The Little Mermaid was more along the lines of the Hans Christian Andersen version, instead of the cartoon version that we all know so well. I loved seeing the diversity regarding same sex relationships. One of the mermaid characters is falling in love for the first time, and she is falling for another female. I loved seeing that in this book. It just made me adore it that much more. We could certainly use more diversity in young adult books, so I applaud Tobie Easton for including it in this book.The story is very creative. I loved reading about how the mermaids live on land and why they even have legs to begin with. It is such a unique take on mermaids. All of the backstory about mermaids and how they live on a day to day basis is so very interesting.The main character, Lia, is so likable! I thoroughly enjoyed getting to know her in this book. She is such a darling, and I really felt what she felt while reading this. I identified with her struggles and relished in her happiness. What I didn't likeMuch of the book was fairly predictable. Even from the first chapter I read things that I instantly found revealed the way the story was going. The book was a pleasant read, but the sense of surprise and mystery was not there for me. Spoilers in this paragraph. Ye be warned. I would have liked to see Lia and Clay come together more when he was not under the sireny magic. At the beginning of the book they really started to develop something, and then it waned off while she was trying to keep her secret safe. And then Mel comes along and he is put under her spell. We get to see glimpses of how he really feels about her when Mel's spells wear off, but in general he was under the sireny spell for most of the book. The main characters names a little too closely resembled the names of the Disney characters for my liking. Aurelia Nautilus....Ariel. Clay Ericson...Eric. I would have loved something more original.While I enjoyed this book very much, it felt like it was missing that little bit of \"oomph\" that could have made it outstanding. I truly think that adding a little something to the story could blow readers out of the water. It has the makings to become something epic.Would I Recommend ItYes. This was such a lovely story. I enjoyed every moment of it! I am longingly anticipating the next book in this series! It is perfect for fans of Fantasy that have a soft spot for fairy tales."}], "description": "Lia Nautilus may be a Mermaid but she’s never lived in the ocean. Ever since the infamous Little Mermaid unleashed a curse that stripped Mer of their immortality, war has ravaged the Seven Seas. Now Lia lives in a secret community of land-dwelling Mer hidden among Malibu’s seaside mansions and attends high school with humans. To protect everyone around her, she must limit her contact with non-Mer. No exceptions. But when the new girl sets her sights on Lia's crush, she will risk exposing her deadly secret to stop Clay from falling in love with the wrong girl.", "title": "Emerge\n      \n          (Mer Chronicles #1)", "url": "http://www.goodreads.com/book/show/27882492-emerge", "average": 3.86, "cover": "https://images.gr-assets.com/books/1450042203l/27882492.jpg", "reviews": 154, "authors": [{"url": "https://www.goodreads.com/author/show/14097819.Tobie_Easton", "name": "Tobie Easton"}], "type": ["Fantasy", "Young Adult", "Mythology", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/27882492-emerge", "http://www.goodreads.com/book/show/33299927-submerge"]}