{"ratings": 3249, "userreviews": [{"userName": "Foad", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "زنى از اشراف پاريس از ژان ژاك روسو راجع به راه درست تربيت كودك پرسيد. روسو نخست قرار بوده نامه اى كوتاه در پاسخ بنويسد، اما هر چه بيشتر به نوشتن ادامه داد به اهميت موضوع بيشتر پى برد، تا بالاخره كتاب درخشان چهارصد صفحه اى \"اميل\" را نگاشت، كه مبناى برخى تحولات اساسى در نظام آموزش و پرورش فرانسه و ديگر كشورها گشت.ساختار كتابروسو خود را در نقش يك مربى سر خانه تصور مى كند كه دعوت شده تا \"اميل\"، كودك يكى از خانواده ها متمول را بزرگ كند. او در پنج فصل به مراحل مختلف رشد اميل مى پردازد و در ضمن آن مطالعات و نظريات خود را پى مى گيرد.فصل نخست، آغاز طفوليت-مراقبت هايى كه نوزاد لازم دارد،فصل دوم، تربيت اخلاقى كودك،فصل سوم، پسرك ١٢ تا ١٥ ساله،فصل چهارم، دوران شباب،فصل پنجم، ازدواج.وحشى نجيب، متمدن فاسد«خداوند همه چیز را نیکو آفریده است؛ انسان است که با دخالت خود آن ها را فاسد می کند.»اين نخستين جمله و مرام نامه ى كتاب اميل است. از نظريات اجتماعى پايه اى ژان ژاك روسو \"وحشى نجيب\" است، يعنى انسان بر اثر پيچيدگى هاى تمدن است كه دچار فساد اخلاقى مى شود، وگرنه به شكل طبيعى و آزاد، هيچ انسانى فاسد نيست.بر همين اساس، در اين كتاب هم مى كوشد راه تعليم و تربيتى را بيابد كه هر چه بيشتر به رشد طبيعى كودك نزديك باشد؛ چرا كه معتقد است شيوه ى تربيتى بورژوازى است كه كودكان ثروتمندان را از همان روز نخست فاسد بار مى آورد.او با تأمل در رفتارهاى كودكان از نوزادى تا نوجوانى، سعى مى كند بيابد كه طبيعت آن ها چه اقتضائاتى دارد، و با طبيعى ترين شيوه همان را برآورده سازد، و مى گويد: اشكال بزرگ در شيوه هاى تربيتى رايج آن است كه نيازهاى طبيعى كودك را ناديده مى گيرند، و مى خواهند به قهر و اجبار او را به شكلى كه خود و جامعه ى بورژوا انتظار دارد در بياورند.اشكالات ١.روسو مى خواهد شيوه اى پيشنهاد كند كه تربيت كودك متناسب با رشد طبيعى و نيازهاى طبيعى او باشد. اما در عمل گاهى از اين مقصود دور مى شود، و هم در تشخيص نياز طبيعى بچه، و هم در پيشنهاد شيوه ى تربيتى متناسب با آن، مطالبى بى اندازه پيچيده و تصنّعى (غير طبيعى) و دور از واقع بيان مى كند، مخصوصاً در فصل آخر كه به صفات \"طبيعى\" زن مى پردازد. درست همانند جمهور افلاطون (كه اتفاقاً مورد ستايش روسو هم هست) كه به بهانه ى تربيت درست مردم در مدينه ى فاضله، مستبدانه ترين سانسورها و سخت گيرى ها را مجاز مى شمارد.٢.اشكال ديگر آن كه كتاب در زمانى نوشته شده كه هنوز روش علمى در ابتداى راه خود بوده است، از اين جهت هر چند بسيارى مشاهدات روسو دقيق و ريزبينانه است، اما مى توان در صحت علمى آن ها خدشه كرد. ٣.از طرفى، اين مشهور است كه روسو يك كتاب درخشان چهارصد صفحه اى در خصوص تربيت مهرآميز كودك نوشت، اما خود هرگز كمترين عنايتى به چهار كودك نامشروع خود نداشت، بلكه آن ها را با بی رحمی تمام به یتیم خانه سپرد و کودکان در آن جا جان دادند.آيا بايد كتاب را خواند؟بسيارى از راه هاى نادرست و ظالمانه ى تربيتى كه روسو از آن ها انتقاد مى كند، هنوز در ميان ما به قوت خود باقى است. كسانى كه مى خواهند بچه دار شوند، اما هنوز روحيات كودك را نمى شناسند، بايد اين كتاب را پيش از هر چيز بخوانند تا از تكرار شيوه هاى ظالمانه ى سنتى بپرهيزند.اما آيا اميل تنها گزينه است؟ اين كتاب از نظر قدرت نثر و ديد انسانى كتاب بسيار خوبى است، اما امروزه كتاب هاى علمى تر و قابل اعتمادترى در روانشناسى كودك نوشته شده، كه مى توانند جايگزين هاى بهترى براى اميل باشند. در نتيجه، هر چند بايد كتابى در زمينه ى تربيت كودك خواند، اما ضرورت ندارد حتماً اميل خوانده شود."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 20, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "966.\tÉmile; or, On Education, Jean-Jacques RousseauEmile, or On Education or Émile, or Treatise on Education is a treatise on the nature of education and on the nature of man written by Jean-Jacques Rousseau, who considered it to be the \"best and most important\" of all his writings.تاریخ نخستین خوانش با ترجمه منوچهر کیا: دوم ماه مارس سال 1972 میلادیعنوان: امیل: رساله‌ ای در باب آموزش و پرورش؛ عنوان دیگر: آموزش و پرورش؛ نویسنده: ژان ژاک روسو؛ مترجم: غلامحسین زیرک زاده؛ تهران، دانشگاه تهران، 1328، در 299 ص، چاپ دیگر: تهران، چهر، چاپ سوم 1337، 1348، در 295 ص؛ چاپ بعدی 1360، چاپ دیگر: تهران، ناهید، 1380، در 408 ص؛ شابک: 9646205208؛ چاپ دوم 1382؛ چاپ چهارم 1386؛ در 408 ص، شابک: 9789646205208؛ چاپ هفتم 1393؛ چاپ دیگر: تهران، قاصدک صبا؛ 1389، در 351 ص؛ شابک: 9786005675047؛ موضوع: رساله ای در آموزش و پرورش از نویسندگان فرانسوی قرن 18 معنوان: امیل، یا آموزش و پرورش؛ نویسنده: ژان ژاک روسو؛ مترجم: منوچهر کیا؛ تهران، دریا، معراجی، 1349، در 568 ص؛ چاپ دیگر: تهران، گنجینه، 1349؛ چاپ دیگر: تهران، نشر محمد، گنجینه، 1371، در 568 ص، عنوان: امیل، یا آموزش و پرورش؛ نویسنده: ژان ژاک روسو؛ مترجم: ع. سبحانی؛ تهران، موسسه مطبوعاتی فرخی، چاپ دوم 1348، در 656 ص؛ عنوان: امیل؛ نویسنده: ژان ژاک روسو؛ مترجم: سعید مولوی؛ تهران، ابر سفید، 1392؛ در 632 ص؛ شابک: 9786006988016؛ روسو میگوید: هر فرد می‌تواند اراده‌ ای ویژه، مخالف یا متفاوت از اراده ی عمومی که به عنوان شهروند دارد داشته باشد. ایشان میگویند: «بهتر است برای نوجوان از واژه‌ هایی که بزرگسالان درباره ی اخلاق به کار می‌برند خودداری شود». سودی ندارد که به نوجوان لغات و علامت‌هایی که هیچ‌گونه مفهومی برایش ندارند را بیاموزیم. ایشان مینویسند: «در صورتی که ایده‌ ای از اشیاء نداشته باشیم، چگونه لغات می‌توانند خودشان ایده‌ های ذهنی به وجود آورند؟ لغات در واقع علاماتی هستند که به اشیاء و یا ایده‌ ها مربوط می‌شوند. برای یک نوجوان واژه‌ ها می‌توانند جهت طرح اشیاء در غیابشان به کار روند، در حالیکه اگر این واژه‌ ها صرفاً ایده‌ ها را نشان دهند، همانند مفاهیم اخلاقی، به دنیای واقعیت مربوط نخواهند بود، بلکه دنیایی ذهنی را مجسم می‌کنند، که هنور دنیای نوجوان نیست». نتیجه‌ ای که روسو می‌گیرد این ست که برای تغییر ندادن ماهیت ذهنیت‌هایی که نوجوان درباره ی اخلاق دارد، ایده‌ آل آن است که شناخت او را به تجربیات حسی محدود کنیم. با توجه به این اصل که تربیت باید ریتم طبیعی نوجوان را حفظ کند، روسو پیشنهاد می‌کند که جریان یادگیری نوجوان را نباید شتاب داد. پس از نشان دادن خطراتی که در تربیت نوجوان در به کارگیری لغات اخلاقی پیش از آنکه او قادر به درک آنها باشد وجود دارد، نتیجه می‌گیرد که: «ذهنیت‌های نوجوان به داده‌ های حسی محدود می‌شود. عقل در فرایند گسترش روانی فرد به دو صورت شکل می‌گیرد: نخست: «عقل حسی»ست که ابتدایی‌ترین است و جوهره یا «عقل ذهنی» را شکل می‌دهد. عقل حسی از نظر زمان پیش از عقل ذهنی‌ ست. تربیت مناسب عقل حسی باید گسترش عقل ذهنی را ممکن کند». ... ا. شربیانی"}, {"userName": "Trevor", "userReviewDate": "Dec 12, 2012", "userURL": "http://www.goodreads.com/user/show/175635-trevor", "userReview": "I recently read Durant’s The Story of Philosophy. In that he said that it was a pity that philosophy had become quite so obsessed with epistemology (worrying about how we think) rather than ethics (worrying about how we can live a good life). Durant saw a time in the not too distant future when philosophy would get over epistemology and become once more a kind of thinking persons self-help club. In many ways this book is a version of ‘how to live a good life’ – no, better, how to educate people so that they are able to live a good life. A lot of it might have you hoping philosophy sticks with epistemology for a wee while yet.Just about every time Jean-Jacques mentions women in this expect either that your blood will boil or run cold. That the smartest of men could say and believe the dumbest things is a constant source of amazement to me. On the good side, like Plato he believes girls need to be educated and to play an active role in society, but he also believes that women are meant for quite other things than men and that these separate roles are decided by nature and are therefore impossible to change.Just about the only thing I knew about Rousseau prior to reading this was that he believed in the noble savage. That is, that it is society that is the cause of all corruption in the world and that humans in their natural state are pretty well wonderful to each other. So, it is reasonable to guess that he is going to also think that the proper way to educate people is to do so in accordance with natural principles of one kind or another. And this is his lasting influence, I think.I’ve recently read Dewey’s Democracy and Education, and I was surprised at how often Dewey referred to Rousseau and this book. I had also recently read The Social Animal, which is a bit of a homage to this book in many ways (expressly so). So, reading this was becoming increasingly important. To understand the ongoing importance of this book to education it might be best to start with what is the opposite view to Jean-Jacques. Remember how bored you were for so much of your time at school? Well, a lot of the reason for this was that you were being asked to remember stuff that you weren’t really all that interested in. If it ever occurred to you to say to your teacher, “Look, enough of this shit already, I’m bored out of my bloody mind – can’t you torture flies or something rather than torturing me?” Your teacher would just as likely say to you, “Now, listen you snotty-nosed little bastard, it is hard enough having to teach this crap to an empty-headed fool like you, but what you have got to realise is that although this stuff is as boring as bat-shit now, give it a couple of years and you’ve no idea just how important it will all turn out to be.”Education, in this model, is always something for some time in the future (a time that is always unspecified) and will help in ways that can’t really be put into words right now. That kids buckle under and keep on ‘learning’ in a kind of half-sleep says much, much more about power relationships within classrooms than it does about anything else. (The 'anything else' here being ‘what is important for kids to learn?’ ‘how is it best to teach them?’ and ‘what is it that they are actually learning when we force them to attend to this crap anyway?’)Rousseau makes this point beautifully when he is discussing what happens when you teach kids the catechism. When I was a child my family used to have a record of Brendan Grace doing a comedy routine about a priest asking a group of boys questions for their confirmation. Not being Catholic, there was always a sense of naughtiness in getting this insight into the happenings in that other world. One question was, “What is the mystery of the trinity?” And the boy who is asked replies, in an accent the priest cannot understand, “Three divine persons all in the one God.” The priest says he doesn’t understand and the boy says, “You’re not supposed to understand, it’s a mystery, isn’t it?”Rousseau says that if you want to see just how effective such teaching is, such rote learning despite the utter lack of understanding (or even a lack of an expectation of an understanding) on the part of the student – all one needs do is talk to the student about the subject outside of their learned (rehearsed) response. Once out of role not only do you see they have understood none of it at all, but also that their understanding is actually quite off from your intention. Why? Well, mostly because what they are being asked to ‘learn’ has no relevance or interest to them now. So, at best they remember disconnected pieces, rather than anything like a consistent whole.Now, think about what we are teaching kids by teaching them this. We are teaching them that it isn’t important for them to understand anything properly, but that they will get a pat on the back if they have been able to parrot back what appear to be meaningless jumbles of words in more or less the right order.What the child understands doesn’t really matter in the least, what matters is that they have their heads get filled with ‘knowledge’ that will make sense ‘sometime’.So, is there an alternative to this? Well, according to Rousseau there is – and that is to teach according to what the child is interested in learning and needs to know now. And if you want to teach the child something that they are currently not interested in learning, then it is up to you to find a way to make learning that thing essential for the child in the here and now. For example, he talks about getting his student lost in the woods so that he can teach the child the importance of knowing how to find directions from the position of the sun and therefore how the earth travels around the sun and how the sun shifts position in the sky according to the time of the year. The point is, as anyone with kids knows, kids live in the present. If that is the case, you really do need to teach them in the present too. When people see the point of something then learn is as easily as breathing. That is what we humans do – we are learning machines. But it is so easy to make it hard for kids to learn and to convince them they are not good learners. And the best way to achieve this is to try to force them to learn stuff they have no interest in or even any way of working out what possible interest they might have in it.Now, all that is the good bit of this book. You have to know that this book was written for a very small group of people – that is, ‘nice’ people who are able to afford servants. This is about how to go about the education of boys, but not any boys, only a very few well off boys. It wouldn’t take a lot to be turned off this book entirely. The long and rather boring discussion of religion, the sexism, the endless marriage preparations and the classism weren't really my cup of tea. All the same, the bits of this that are good are particularly good."}, {"userName": "Deborah Markus", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/954028-deborah-markus", "userReview": "I read this book as research for a writing project of my own. Once finished, I had no idea how I ought to rate it. There is some brilliant writing here, and I highlighted a lot of eminently quotable passages. Certainly I can understand why the French adore some of Rousseau's ideas about education. But even if one can get past the irony of Rousseau the child-abandoner writing (in very smug tones!) how the young ought to be raised and educated, there's the little fact that he was sexist above and beyond the call of duty. The thoughts on education that the French praise to the skies are all thoughts on the education of boys. When he does bother to mention girls, he stresses that their education ought to lie in teaching them how to be utterly submissive and obedient. Because if you're nice enough to that wife-beater your parents married you off to, he'll stop hitting you. And if he doesn't stop hitting you, well, I guess you weren't nice enough.The fact that I'm paraphrasing shouldn't lead you to conclude that I'm exaggerating. Yes, I know Rousseau lived and died in the eighteenth century. So did Mary Wollstonecraft. So: Read this if you're interested in French history, the history of education, or Rousseau's bizarre life. And don't be fooled by the many people who refer to this book as a novel. It isn't. It's a work in which Rousseau presents his ideas about education, and at a certain point, says, \"Let's pretend I was hired to be the tutor of a young man -- say his name is Emile. Here's what that might be like, and here are some conversations I can imagine having with this boy.\" Rousseau never claimed to be writing a novel. He simply alternates between the autobiographical and the hypothetical."}, {"userName": "Roy Lotz", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "If all the philosophers in the world should prove that I am wrong, and you feel that I am right, that is all I ask.\nMy reaction to Rousseau is very similar to my reaction to Thoreau, whose back-to-nature ethic owed much to Rousseau’s philosophy. Though constantly impressed with the breadth of their vision and the force of their rhetoric, I find the personalities of these two men—at least as manifested in their books—to be grating and unpleasant. When I am not underlining brilliant passages, I read Rousseau through gritted teeth and with frequent interruptions to roll my eyes.I see much in common between these two Romantic devotees of nature. While Thoreau’s dour and stern demeanor is not comparable to Rousseau’s sentimental imagination, the two of them are self-involved, prickly, and vain. Both praise wild isolation at the expense of society because neither seemed to fit into the latter. Though the two of them were brilliant in the extreme, neither of them seemed to have reached the level of intellectual maturity that allows feelings to be submitted to reasons and other perspectives to be considered. Both of them fire off opinions with wild abandon, saying what feels good, without taking the trouble to thoroughly argue their points, to consider competing ideas, or even to make their own thoughts consistent.To pick just one example of this last tendency in Rousseau, at one point he says: “Amid the uncertainty of human life, let us shun that false prudence which seeks to sacrifice the present to the future; what is, is too often sacrificed to what will never be. Let us make man happy at every age lest in spite of our care he should die without knowing the meaning of happiness.” And yet, almost immediately after this pronouncement, he insists that his titular pupil, after having fallen in love and proposed marriage, postpone the delight of union for two years—leaving his beloved to go travel—in order to learn to master his feelings. The book is rife with such inconsistency. And not only that but, as in Thoreau’s case, Rousseau’s manner of life was notoriously inconsistent with the principles he espoused, adding hypocrisy into the bargain. That a man who sent his own children to an orphanage should write a manifesto of education is rich indeed.But Rousseau must be read and praised, this book above all, since he—as well as his American disciple—contributed a great deal to our common stock of ideas and the expansion of our cultural faculties. Under the guise of a treatise on education, Rousseau has written a universal reflection on human life, comparable to Plato’s Republic or The Brothers Karamazov for its omnidirectional scope. The novelistic device of describing himself as a tutor educating a child allows Rousseau to illustrate his philosophy of society, ethics, government, love, history, travel, religion, literature, and much else along the way, besides to his groundbreaking views on education.Rousseau begins with his famous dictum that nature makes everything good, and it is human society corrupts our natural goodness into evil. His stated purpose is to illustrate how natural goodness can be preserved in a growing boy destined for life in society—that is, without Thoreau’s recourse of reverting to a state of nature. With this principle in mind, Rousseau blasts mothers for hiring wet nurses to breastfeed their children rather than doing it themselves. And though Rousseau’s reasons are fallacious, this advice probably did the world much good, since, in addition to the emotional bonding, breastfeeding allows important antibodies to be transferred from the mother to the infant.After infancy gives way to childhood, Rousseau’s real educational work begins. Here he made another important contribution to child-rearing, by insisting that children’s minds are not suited to adult ideas and methods. A child is a different creature altogether and education must be suited to a child’s capacities and predilections. Lectures, sermons, and catechisms must be avoided; and using punishment and reward only corrupt the child. Instead the tutor must find ways to motivate the child to learn without ever seeming to do so. Rousseau the tutor is constantly devising tricks and schemes to get his imaginary pupil, Emile, to learn valuable lessons in a “natural” way—that is, relying on the child’s intrinsic motivation and using no explicit instruction. Everything in Rousseau’s model must simulate life and the child must work on his own conclusions following his own curiosity. The tutor is much more a guide—and, behind the scenes, an impresario—than a real teacher.Following this procedure, lessons on magnetism and morality are woven into a magician’s act. Geography is taught by getting lost in the forest. Geometry is taught by attempting to draw and map. Botany and agriculture are taught through gardening. And so on, covering sciences, arts, and moral lessons. This way, Emile grows up into a competent, strong, and thoroughly honest boy with no social pretensions and no vanity whatsoever. At least, Rousseau assures us that this would be the result. By the time Rousseau takes Emile into Paris, as a young man, the student is disgusted at the foppery of the men, the arrogance of the philosophes, and the affected manners of the women. More contentiously, Rousseau would not teach his pupil anything about God or religion until the age of eighteen, considering such subjects too abstruse and profound for a child to understand. He would not even teach Emile to read until shortly before that. And this is not all that occasioned scandal. Rousseau famously interrupts the story of Emile’s education to include the Profession of Faith of a Savoyard Vicar, the most well-known, influential, and controversial section of the book. Though couched in the language of philosophy, the Profession is essentially an argument against both organized religion and atheism in favor of deism, based on feeling alone. Voltaire, a deist himself, considered this the book’s only worthwhile section, only lamenting that it has been written by “such a rascal.” It was largely this trenchant criticism of organized religion that led to the book getting banned and burned in Paris and Geneva. And yet, ironically enough, the idea that inner conviction is a surer basis for faith than logic was to become a pillar of religious thought in the coming centuries.The last section of the book consists in finding a mate for Emile. This is by far the most unpleasant part of the book. Rousseau’s view on women and their upbringing is reactionary and sexist to the utmost, not to mention unpleasantly marred by Rousseau’s own sentimental (and sexual) fantasies regarding women. Rousseau’s ideal companion for his pupil is named Sophie, and her education differs markedly from Emile’s. Sophie is to be a kind of passive doll, a creature not fit for reason or art, whose job is to caress Emile and to make his life easier. Rousseau describes their courtship with the drama of a novelist and the passion of an onanist. Both the principles and the writing are revolting. Finally, after enduring a forced separation for his beloved—a very unnatural thing for Rousseau to recommend!—Emile settles down happily in blissful union with Sophie, and prepared to educate his own children along Rousseau’s lines.This summary does not exactly do justice to Emile, since it omits all of the manifold digressions that Rousseau yields to in the book’s wandering course. Some of these are among the best sections of the work; others are pointless rambling. Even when he is not off in the bushes, Rousseau can be very repetitive, giving us five sentences where one would do, spending three paragraphs harping on a minor point. The final result is a book much longer than it has to be. This is Rousseau's most conspicuous stylistic flaw, which he excuses in typical Rousseau fashion: “If this book is to be well written, I must enjoy writing it.” Unfortunately the author’s pleasure is often gotten at the expense of the reader’s. Yet the book’s best moments are masterful, rising to heights of power and lyricism that cannot be forgotten. Immanuel Kant famously had to read the book twice, the first time just for the style, the second for the content.The flaws in Rousseau’s ideas are many and grave. Most obviously, Rousseau’s educational program is impractical in the extreme, relying on a perfectly wise tutor to devote twenty years of his life to a perfectly malleable pupil. This may be excused, however, by treating the arrangement as an explanatory device and not a real proposal to be emulated. More seriously, Rousseau’s conviction that nature is intrinsically good is, I think, incorrect and even incoherent. Natural disasters, such as the Lisbon Earthquake in Rousseau’s own lifetime, demonstrate that nature can be cruel and merciless; and in any case, how can you know what nature is, or where nature ends and human culture begins? Besides, doesn’t Rousseau advocate many “unnatural” things? The level of control exercised by his tutor over his pupil’s reality is far greater than any real parent or teacher.Yet even when strictly viewed as an educational treatise, there is much to be praised in the book. Rousseau’s emphasis on experiential rather than theoretical learning was quite valuable. And his conviction that education must take into account the child’s development and maturity was a revolution. I also share his suspicion towards using external rewards and punishments to motivate children, since the bad is avoided and the good is sought for artificial, rather than instrinctic, reasons. Of course the book’s merits extend much further than education. Taken together, Rousseau’s philosophy touched on every aspect of society, from philosophy to fashion, from labor to love. For all his naïveté, Rousseau seemed to have correctly sensed that his society was artificial and could not last. Thirty years before the revolution, he says: “The crisis is approaching, and we are on the edge of a revolution.” And he then goes on in a footnote: “In my opinion, it is impossible that the great kingdoms of Europe should last much longer. Each of them has had its period of splendor, after which it must inevitably decline.” Like Thoreau, Rousseau was a prophet and a true original, embittered by being misunderstood, isolated, and ostracized, whose all-too-obvious faults concealed the revolutionary reach of his vision."}, {"userName": "John Warner", "userReviewDate": "Aug 26, 2007", "userURL": "http://www.goodreads.com/user/show/310852-john-warner", "userReview": "this book is difficult to understand and hence easy to dismiss. many of the other reviews bear witness to this in the most immediate way. emile is not an instructional manual on how to educate a child, nor is it a misogynistic tract that insists on the inferiority of women. these suggestions fail to engage this work precisely where it becomes interesting.Emile is, and was intended to be, the modern equivalent to Plato's Republic. It is a synoptic book, a sustained, comprehensive, and unified reflection on the human condition. All questions of perennial importance are not only treated, but treated with assiduous care and attention to detail. The devil, it turns out, is in the details of this elusive and allusive book, which gives beautiful expression to perhaps the most dubious principle in the history of philosophy--that of man's natural goodness.One reviewer advises us to skip directly to the beginning of the last Book, where Rousseau offers us his views on women. This strategy is more than adequate for all readers who do not care to understand Rousseau. For those who wish to come to grips with what he actually wrote, however, this peculiar advice will not do. If it is impossible to begin at the beginning, then begin at the very end. Read everything else in light of the work's conclusion, and see how--if--it hangs together."}, {"userName": "David Sarkies", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/5856247-david-sarkies", "userReview": "The Educated Human26 January 2016\tTo say that Rousseau has a low opinion of humanity is an understatement – he absolute despises the corrupting nature of humans and the effect upon the world around them. This is clearly summed up in his opening statement:God makes all things good; man meddles with them and they become evil.\tActually, Rousseau has an interesting view of reality: the world is initially good and people are free however from the moment of birth the corrupting influence of humanity comes to the fore and seeks to enslave the child - this book is a treatise on how to insulate the child from this corrupting influence and thus to create a new and evolved human through education. The problem with Rousseau is that he does not seem to recognise that human corruption is a part of their nature as opposed to something that comes about through interaction with society, and as such despite being isolated from society the child will still be corrupt. In a way it is sort of like a genetic disorder that is passed down through the parents, meaning that if the parents are corrupt then the child will inherit that corruption despite the parents attempting to insulate the child from the corrupting nature of society.\tAs you have probably guessed, this text (and it is a pretty long one mind you – Rousseau himself indicated in his foreword that he initially intended it to be quite short but unfortunately it blew out to beyond all proportions) is about the best way to educate a child, however it goes beyond that to theorise on how to craft and mould the child into becoming what Rousseau considered to be an enlightened human, and to do so he realises that one cannot simply isolate the child from society for there must come a time when the child will partake in society, particularly when it comes time for the child to marry. However the conclusion is the belief that if the child is educated properly, right up to and including marriage, then it will form the foundations of a new and enlightened culture as the educated child will then pass that knowledge and training onto his children.The Education System\tI'm going to have to say that I'm not hugely familiar with the system of education back in Rousseau's days, however it was certainly not the system that we are exposed to today. My understanding was that back in Rousseau's day children were educated through the use of private tutors and apprenticeships. If a child were highborn (that is a member of the aristocracy) then private tutors would be brought in to teach the children, and in many cases this education simply involved how one was to conduct oneself in such social circles. In fact I would go as far as to suggest that a lot of the aristocracy of these days probably weren't educated, or at least they weren't educated in the way we understand education. However they no doubt were literate, and would have been exposed not just to the teachings of the church, but also to the writings of the ancients (and in some cases contemporaries, unless their writings had been banned, which was not all that uncommon).\tThe lower classes tended to be apprenticed and their training would be similar to what we understand as on-the-job training. The idea of going to school and deciding on a career simply did not exist – one's career had been decided by birth and that career was either in the family business, or based upon when one was born as well as one's gender. Females generally would not be given the same education as where the men, and they certainly weren't taught to be literate. One of the problems I found with this book though was that this sexism does permeate quite deeply, despite the fact that Rousseau does state that with the exception of some physiological differences men and women are basically the same.\tHowever that does not necessarily mean that our modern system of education is better – in fact I would have to argue that in many cases it is worse. I suspect that if Rousseau were to be grabbed by Bill and Ted and taken to modern day San Dimas he would be absolutely appalled (isn't it interesting that when the people of historical significance explored modern day San Dimas they were all pretty impressed). The thing with our modern system of education is that it is a by product of industrialisation. Children are all seen as similar products and are put through a machine with the idea of them emerging identical at the end. In a sense it not only assumes that everybody is the same, it works on the principle that one can grade a student's performance on a standardised test. There is one big problem with that, as is exemplified by this cartoon:\tOkay, I went through school before they came out with this wonderful idea of standardised testing, however there were still elements of it during the time I was there. The idea of having an exam at the end of every year, or even tests throughout the year, worked on the principle that everybody could write a perfect essay, or everybody was good at maths. The problem is that this is simply not true. I remember when one teacher said to the class that when he handed out an essay assignment that all of the essays when submitted were to be identical to each other. In fact he even wrote the entire essay on the board to illustrate what he expected. Needless to say I dropped that class and went on to do maths and science.\tIt is not necessarily the teacher's fault though as the teacher can only work with the tools given to them (and the fact that teachers are severely underpaid is a problem in and of itself). I personally believe that they should be given a lot more credit than they are by society, but I suspect that modern society hates teachers because as children we hated our teachers. In a way this is what it has become:\tHowever, one thing that I will point out before I move on is that one of the ideas, especially for the later years of highschool and university, is that the student is supposed to become more specialised. That is the earlier years brings out the child's strengths and weaknesses, and in the later years the child then pursues subjects that play on the child's strengths. Of course I could also write about how the modern education system is also a form of mass indoctrination, but I will leave it at that for the time being.On Religion\tThe main focus of this book is about education, but Rousseau needed to touch upon a number of aspects of his society to be able to explain this philosophy on how to train somebody to become an enlightened individual, and one of these areas is religion. I have noticed that many seem to believe Rousseau to be, while not an atheist, at least a humanist, but this could not be further from the truth. The idea of humanism is that humanity is the peak of the evolutionary ladder and that which humanity creates is worth paying attention. In fact our understanding of society and how to progress should come out of the whole body of human knowledge.\tThe problem is that Rousseau considers humans to be thoroughly corrupt, meaning that anything that is written by a human simply cannot be trusted, and this is very much the case with religion. Rousseau believes in the existence of God, however he points out that the problem with knowing the characteristics of god simply comes down to referring to human knowledge, which he considers corrupt. While be points out that in Europe at the time (as well as across the globe) there were all these groups claiming that their understanding of religion was the 'one true way' it all boils down to one thing – human understanding, which is untrustworthy.\tRousseau is basically a natural theologian in that his understanding of any spiritual reality can only come through observing nature, however he the goes on to conclude his treatise on religion by referring back to Christianity, and in fact pointing to Christ. His belief is that the horrendousness of Christ's death, and the fact that he was mocked and brutalised, adds to the truth behind Christ's claims simply because it is so absurd. The idea of God becoming a human is ridiculous enough, but subjecting himself to arrest, mockery, an unjust trial, and probably one of the most barbaric forms of execution is outright bizarre. In fact his suggestion is that it is so bizarre that it simply has to be true.\tMind you, he does touch on the idea of fundamentalism, and he does provide a warning that one needs to be very circumspect when talking about religion and belief systems as a whole because there is a danger that the child, if not taught properly, or even not taught at all, would become a fanatic.The Social Sphere\tAnother idea that I picked up from this book was how decadent Rousseu's viewed the world of the French aristocrats. It was a world of high society, of debauchery, and of political machinations. No doubt this came about through their learning, particularly with the ancients. This is why Rousseau suggests one should be really circumspect on what they should be taught, and that there is only a handful of ancient texts that the student should be exposed to. In a way life in the upper crust of French society at the time was little different to that among the Roman patricians. While it has been a while since I have seen it, the film (which is based on a book) Dangerous Liaisons paints a very clear picture of what it was like.\tThis is probably why Rousseau, when he comes to the end of the book, suggests that his protegee (and his wife) should leave the city and live in a modest cottage in the country. In his mind the city is one massive cesspit of corrupting influence, and despite all of the work in training Emile, he knew that if Emile were to remain in the city, especially Paris (where much of the politics would be played out) then all of this hard work would be undone in short time. As mentioned, Rousseau believed humanity to be corrupt, and when humans got together in large numbers then this corruption would increase exponentially.Marriage\tI wish to finish off here, namely because I found that this was probably the most unrealistic aspect of the treatise. The idea is that there will come a time when Emile will need to marry, and as such for the experiment to work Rousseau will need to find what I considered to be the perfect woman. However there is one problem:\tSo, my big question is, did Rousseau (or even somebody later) actually put this into practice, and did the whole experiment crash and burn when it came time for Emile to marry?"}, {"userName": "لونا", "userReviewDate": "Dec 24, 2011", "userURL": "http://www.goodreads.com/user/show/6500234", "userReview": "في البدء أحب أن أذكر أن جان جاك روسو قد عمل مرة في حياته مربياً لطفل من طبقة النبلاء ولكن التجربة لم تستمر وباءت بالفشل، وأيضاً كان قد تخلى أن أبناءة الخمسة فور ولادتهم للملاجئ بدون أن يترك علامة أو دليل يُمَكِّنه من الرجوع لهم يوماً ما، فلم يستطع أحد معرفة مصيرهم ... فأغلب المتتبعين لحياته يعتقدون أن هذا الكتاب كان نوعاً من التكفير عن الذنب لتخليه عن دوره كأب أو محاولة لتدوين أفضل أسلوب للتربية بعد تحليله لفشل تجربته كمربي ... ولمن أراد أن يعرف أكثر عن حياته أنصحه بقراءة اعترافاته \"اعترافات جان جاك روسو\" بالنسبة للكتاب:-مُرَبي يتفرغ لتربية الطفل \"إميل\" من المهد إلى الرشد، ولكن أي طفل؟ خصَّ جان جاك روسو أطفال الأغنياء بذلك فأطفال الفقراء والقرى الطبيعة كفيلة بتربيتهم !! .. ركز في أسلوب تربيته على أهمية تعزيز التجربة لترسيخ المعلومة و استكشاف جدوى العلم بالتطبيق العملي للتجارب والبحث عن استخداماته في واقع الحياة، والإجابة على الأسئلة بإجابات تثير الفضول ولا تشبعه لاستثارة ملكة التفكير .. وهذه الطريقة تعتبر غريبة وثورية في عصره الذي يركز على اللغات، التاريخ والدين أي العلم النظريعدم قناعته بدراسة اللغات، العلم النظري والقراءة التي يعتبرها حشو الأدمغة بمعلومات ليست ضرورية لحياة الشخص، ويتضح ذلك في قوله \"لن أترك بيد إميل إلا كتاب روبنسون كروزو لأنه رجل عمل بمفرده على حفظ حياته\" ... (وبعيداً عن هذا الكتاب الغريب أن أغلب إبداعات جان جاك الأدبية جاءت كتحصيل حاصل لشغفه بالقراءة .. فمنذ الصغر كان والده يقرأ له الكثير من مكتبة الوالدة وكانت الكتب أكبر من سنه فغَّدت ملكه الخيال والإبداع عنده ) ونجد في هذا الكتاب دعوته للتأمل في الطبيعة والتفكير عوضاً عن القراءة تكلم الكتاب في أغلبة (أكثر من ثلاثة أرباع الكتاب) عن تربية الذكور أما الإناث فتكلم عليهن فقط عندما كبر \"أميل\" وأصبح بحاجه لزوجه، والزوجة المثالية بنظر روسو تكلم عن نشأتها وتربيتها في الجزء الخامس من الكتاب وأطلق عليها اسم \"صوفي\" وهذه الجملة تعطي فكره عن صوفي \"يجب أن تكون تربية النساء برمتها مرتبطة بالرجال. فإن واجبات النساء في جميع الأزمان هي إرضاء الرجال ونفعهم وتحري محبتهم وتكريمهم....إلخ\" !!! ... وأيضاً \"لا أحبذ أن تكون المرأة من صاحبات النبوغ فإن النبوغ سيخلق لها مجداً شخصياً يُغنيها عن التماس الفخر في انتسابها إلى زوجها وقيامها بواجب الأم والعقيلة وهذا السبب في أني أنادي بأن تبقى كل فتاة ذات نبوغ عانساً بغير زواج طول الحياة\" .. لن أنتقد هذا الجزء لأنه يحتوي على السلبي والإيجابي مثل الجزء الخاص ب\"إميل\" وإن غلبت سلبيتهجان جاك روسو عاش يتيماً، فقيراً، مشرداً، غير مُوفق في علاقاته مع البشر ومطارداً بسبب أفكاره إلى أن مات .. أغلب المبدعين عاشوا حياة صعبة وعُرفت قيمتهم بعد موتهم وهو ليس بالاستثناءلن أمنح الكتاب أي نجمه لأنه خارج نطاق التقييم بالنسبة لي لأنه كُتب في عصر غير عصرنا و يعتبر ثورياً بمحتواه وقتها، أما في عصرنا هذا قد استغرب ولا أتَّفق مع بعض مما جاء فيه و شدني وأعجبني بعضه، فالخطوط العريضة لأساليب التربية كتبت بطريقة جميلة جداً .. الكتاب أمتعني كثيراً .. الترجمة موفقة جداً .. ولو كان التقييم مستند عل المتعة فقط لمنحته النجمات الخمس"}, {"userName": "Jim", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "How is it that the same book can at one and the same time be so fascinating and so wrong-headed? The author of Emile indicates that to bring up a child, the parent must be a lifelong tutor -- to the exclusion of any schools or spouses or relatives or anyone else. Rousseau deals with a fictional son named Emile. During the course of the book, he shows his influence from infancy to early marriage.Perhaps such a controlling type of mentorship was possible only in a rural society; and Rousseau not only confines himself to rural society, but he attacks urban society. As I sit here in Los Angeles, surrounded by 10 million other Angelenos, I must admit that such an education as Rousseau describes is not only impracticable, but it would give rise to early rebellion and a broken family.Now, one asks is this the way that Rousseau raised his own children? Not at all: The sad fact is that the children that Rousseau fathered were all given up to orphanages, as described by the author in his Confessions.So what then is the attraction of this book? For perhaps the first time in Western Civilization, a man of penetrating intellect has bothered to systematize education that is separate from religious influences. Rousseau gives a nod to religion, but he prefers natural religion, the religion of common sense. He attacks the whole notion of catechisms and learning by any other means than by deduction from observable facts.Imagine to yourself Thomas Jefferson and Benjamin Franklin sitting thousands of miles away across the North Atlantic reading this book and dreaming of a new nation founded upon \"inalienable rights.\" We all came from Rousseau. He was perhaps only a way station to life as we know it, but he was powerfully influential. A man of intellect and feeling, he was at the same time prey in his life to persecution and jealousy to which he massively overreacted. I loved reading this book. It was a difficult read, but I feel a rewarding one. You see, I have always believed that one could learn as much from writers with whom one disagrees than from anyone else. Rousseau raises the right issues. It is just that he does not always provide the right solutions."}, {"userName": "Abdulla Awachi", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/37402967-abdulla-awachi", "userReview": "مراجعة كتاب: إيميل أو تربية الطفل من المهد إلى الرشدلــــ جان جاك روسوهذا الكتاب هو أثر خلّفهُ روسو في التربية بجانب آثاره الرئيسية الأخرى التي تركها ، نذكر منها كتاب: العقد الاجتماعي الذي يشكل نواة القوانين السياسية في المجتمعات الحديثة و كتاب الاعترافات الغني عن التعريف و رواية جولي الأدبية الرومانسية.في هذا الكتاب يتناول روسو قضية تنشأة الطفل الذي سيسميه *إيميل* من لحظة ولادته حتى يصبح أباً سيصاحبه في رحلاته و تنقلاته و يعلّمه مما لديه من الحكمة كمربٍ متخذاً من الطبيعة معلماً في كل شيء و يتخلل الكتاب قصة لقاء ايميل و *صوفي* – الفتاة التي ستمثل دور البنت التي تلقت تربية مثالية كما سيبين روسو من خلالها أسلوب تربية الفتيات بعد أن بين أسلوب تربية الشبان مع إيميل.لحظات الحب و الوصال في النهاية بين إيميل و صوفي التي تنتهي بالزواج و تكلل بالنجاح ، و ذلك بعد أن خبر ايميل الأمصار مع أستاذه و عاين البشر على اختلافهم. اختصرت المراجعة بهدف التشجيع على قراءة الكتاب.كتاب خمس نجوم و النصيحة بقراءته أكثر من ضرورية.Αωαςhι١٩ تموز/ يوليو ٢٠١٦"}, {"userName": "Kathryn Cantrell", "userReviewDate": "Jul 19, 2007", "userURL": "http://www.goodreads.com/user/show/184915-kathryn-cantrell", "userReview": "Please read the last chapter first. If you can accept Rousseau at his most offensive, then maybe you should continue with the rest of the book. Personally, I'm enough of a feminist that I cannot stand this work. I have heard too much praise for this work by so many who haven't finished it (i.e. read Rousseau's treatment of Sophie) that I will refuse to discuss it altogether.If you're of the \"but, gender issues aside\" persuasion, you should consider that at the time, there was enough feminist perspective, and we're not talking radical (think Austen), that apology is not appropriate."}, {"userName": "Owlseyes", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/6132231-owlseyes", "userReview": "\"All children are afraid of masks . I begin by showing Emile the mask of a pleasant face...\"\"Remember that, before you venture under taking to form a man, you must have made yourself a man; you must ﬁnd in yourself the example you ought to offer him.\"The Archbishop of Paris, Christophe de Beaumont, found this book \"dangerous\", and a \"mischievous work\": “it’s irreligion”; the book was burnt by the executioner; Rousseau had to leave Geneva."}, {"userName": "Dominic", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/2551271-dominic", "userReview": "Reading this tome was an equally delightful and discomforting one, as a lover of literature, great ideas, and feminist egalitarianism. On one hand, it is obvious that Rousseau was a true visionary (and a master of language). I am truly in awe of what he is trying to accomplish here. As a philosophical exercise of incredible scope, Emile is incredible. I couldn't help but ask myself, \"Where are the visionaries of today?\"In another sense, though, it is certainly difficult to swallow Rousseau's misogyny; his depiction of Sophie (despite her namesake) is sadly small and limited. He reduces her worth to that of an appendage of men. Yet I ultimately feel that Rousseau cannot be faulted for the sexism of his time. Rousseau did not have the pleasure of being born in a time when he could have been influenced by the feminist vision that would soon follow, yet he still ATTEMPTS to understand women (Emile, in fact, spurred Mary Wollstonecraft to write her seminal Vindication on the Rights of Women). For surely Rousseau's love of freedom and commitment to breaking the restricting chains of society would eventually inspire him to want to release all humans from the straightjacket of gender, as well.So while Rousseau surely fails in his reading of gender & \"female/male nature\" (and while this does blacken his argument immensely), I actually believe Rousseau's vision is more helpful than harmful to feminists and egalitarians. For the more I think about this book, the more my mind expands to fullness with the breadth of human possibility--exactly the thing Wollstonecraft demanded for all human beings."}, {"userName": "Marwa Assem Salama", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/11253958-marwa-assem-salama", "userReview": "أما الشئ اللآخذ باللُب بحق فهو أني نسيت بمرور السطور والوقت غايتي التي من أجلها قرأته.....فلقد سلب مني مجامع القلب صدق الطريقة التي استولد بها من رحم الخيال طفله، (إميل) !!..فدليل الحاجة عندي عين الخيال... وإلا فيم ياتُرى يرى الرحّال قريح الحلق بين الصحاري نبع السراب ؟؟....ولئن أخطئتم فحاسبتم (روسو) على هذا الكتاب مرةً كمفكرٍ، فيلسوفٍ، يقظ العقل ....فحاولوا أن تنصتوا إليه أخرى كرجلٍ وحيدٍ حالمٍ ...من فوق هذي السطور يئن : (وإني بهذه السن ..أحوج ما أكون إلى طفل) ...فبمثل ذلك فقط أصبت كبد الكتاب!!.... في يومٍ ما هجر( روسو) أطفاله كلهم.. بل وإليهم أبدا لم يعد !!... هكذا دوّن نادماً بثلاثة أجزاءٍ من الاعترافات...فإن لم تكن بعد لها قارئاً ، فهامش المترجم سيكون كافيا لتعرف....فلقد أجهز عليه بالطعان مرتين جاهرا بذاك الذنب....لذا قررت من حيث كوني بهذه الحياة لا أدري ما قد يُفعل بي ولا بكم ... وبالرغم من أني أتفق مع بعض ما كتب (روسو) هنا وعن بعضه أختلف...إلا أن حسبي منه أنه يوما بما اقترف من الإثم قد اعترف ...وبهذا الكتاب أعلنه أمامكم مربيا فاضلا بل وأبا عطوفا لإميل... ولو كان بالإمكان أن أُحيل خطايا الأيام بالاعتراف رزمةً من ورق ، لأبدلته تلك الآثام بصك غفران ...ثم فعلت مثله. إن أردت أن أختصرتحت عنوانٍ واحد ما أسهبه جان جاك روسو على مدار هذه الثلاثمئة وخمسون صفحة من تعاليم التربية ، لما اخترت غير (منهج الطبيعة) ..والطبيعة فقط!! سواء أكانت بنزعة الروح أم في فطرة الجسد ...فهاهو يرفض بشدة فرط الدلال وإفراط الحماية ...بدءا بتفاصيل دقيقة كاتخاذ المربيات والمرضعات عن أمه كبديل ...وكشد القماط والأردية على خاصرة الطفل في أيامه الأوّل ..وحتى أدق وأقصى قيود الحرص لآخر الآجل ..ولعل هذين المقطعين فيهما على منهجه ذاك الذي عييت في اختصاره بعض دليل: فعن عادات الجسد يقول روسو :\"إن المرء ينبغي أن يصون طفله وهذا لا يكفي ، بل ينبغي أن نعلمه كيف يصون نفسه حين يضحى رجلا ، وكيف يحتمل ضربات القدر وكيف يواجه البؤس والنعيم ، وكيف يعيش ان اقتضى الأمر في الزمهرير والقيظ ، وعبثا تحتاط حتى لا يهلك ، فما من الموت مفر ، إن واجبك أن تعلمه كيف يعيش لا كيف يتحاشى الموت\" أما عن طبائع الروح فقال: \" إن الناس في الحالة الطبيعية سواسية ، ومهمتهم المشتركة أن يكونوا رجالا ، وأنا لايعنيني أن يكون مصير تلميذي الانضمام إلى الجيش أو الكنيسة أو الاشتغال بالقانون ، فالطبيعة تندبه قبل كل شئ للحياة الإنسانية، والحياة هي المهنة التي أريد أن ألقنه إياها، وحين يتخرج من بين يدي لن يكون قاضيا أو جنديا أو قسيسا ، بل سيكون إنسانا قبل كل شئ، بكل ما ينبغي أن يكونه الإنسان ، وسيعرف كيف يكونه على الوجه الصحيح ومهما غيرت صروف الأيام من وضعه ، فسيكون دائما في موضعه الحق\" رغم انحيازه المعروف للإنسانية ، فلقد ُاتهم روسو بهذا الكتاب أيضا بشئ من الطبقية ..كونه أصر على اختيار تلميذه إميل بناء على صفات منتقاة ..من ضمنها أن يكون متوسط الذكاء و يشترط فيه حسن التكوين و صحة البدن وأن لا ينتمي إلى طبقة الفقراء ..وقد علل اختياراته تلك بتعليلات قد لا تعنيني في شئ ، قدر ما تعنيني حقيقة أن لو كان للمرء أن يهب للأطفاله أقدارهم لما اختار أبعد من ذلك ..فيقول روسو في مقاطع شتى على سبيل المثال: \" فإذا أتيح الي أن أختار ، فسوف أختار طفلا متوسط الذكاء ، وسأفترض أن تلميذي إميل هكذا فتعليم العاديين هو الذي يصلح مثلا يحتذى في تعليم نظرائهم ، أما من عداهم فقادرون على تربية أنفسهم مهما يكن من شئ \" ..ثم يستطرد بموضع آخر: \" ومادام الفقير يربي نفسه للرجولة التي تليق بطبقته من تلقاء نفسه ، فمن الأوفق إذن أن نختار تلميذي من الثراة، لنخلق رجلا لو فقد عناية المربي لما صار ذلك من تلقاء نفسه ، ولا يهمني أن يكون إميل ذا حسب ونسب ، فإني بذلك أكون قد أنقذت من براثن الأباطيل الموروثة فريسة بريئة!!\" أما عند هذا الشرط فستفهم وتتفهم غايته كلها ..يقول: \" وليكن إميل يتيما إذ ليس يعنيني أن يكون له أب أو أم ، وبما أني سأتحمل جميع أعبائهما وواجباتهما ، فسأرث إذن جميع حقوقهما ، إنه طبعا يجب أن يكرم أباه وأمه ، ولكن لا ينبغي أن تكون طاعته لأحد سواي من الناس !..فهذا هو شرطي الأول لقبول رعايته ، أو لعله شرطي الأوحد!\" وكان له في شأن التهذيب والآداب مقالات شتى فيها من الإفادة ما فيها ...غير أني سأنتقي منها هذه لكونها لامست في نفسي وترا ما ..يقول روسو: \" واحذر على الخصوص من تلقين الطفل صيغا شكلية فارغة للتهذيب ، فإنه سيستخدم ذلك عند الحاجة وكأنه رقية سحرية لإخضاع جميع من يحيطون به وللحصول فورا على كل ما يشتهيه ، إن التربية المتحذلقة التي درج عليها الأثرياء تجعل الأطفال محبين للتسلط وإن يكن ذلك في أدب ظاهري ، لأنهم يعلمونهم الألفاظ التي ينبغي أن يستخدموها حتى لا يجسر أحد على مقاومتهم ، ولكن الملاحظ أن هؤلاء الأطفال ينطقون تلك الألفاظ المهذبة بلهجة وسمت لا يدلان مطلقا على الترجي ، بل يكونون وهم ينطقونها مثلا للعجرفة ، بل إن عجرفتهم في ذلك الموقف أشد من عجرفتهم وهم يأمرون بصراحة ، وكأنهم وهم ينطقون بالرجاء واثقون من الطاعة سلفا ..ومن أول وهلة يشعر الإنسان وهم يقولون له (من فضلك) أنهم يقولون في الحقيقة : (من فضلي ) ..أما (أرجوك) فمعناها على لسانهم (آمرك) ..فيالها من تربية جميلة !! ويا له من أدب رائع !! ذلك الذي لا يحقق إلا قلب مدلولات الألفاظ على ألسنتهم ، وإني لأوثر ألف مرة أن يقول ببساطة وبرجاء قلبي: ( إفعل هذا) على أن يقول بأمر وغطرسة ( أتوسل إليك) ... فليس المهم في نظري هو لفظ الطلب ، بل الشعور اللذي يصاحب اللفظ وهناك دائما حد وسط بين التفريط والإفراط\" يرى روسو أن لا فائدة في مجادلة الطفل في أول عهده بالحياة حول الصواب والخطأ ، بل يرى أيضا أن حشو عقله الغر بشعارات الفضائل بذلك السن هو هراء لا نفع فيه بل قد يؤدي به إلى حفظ ألفاظها دونما وعي حقائق معانيها ...ويرى أن الفطرة جبلت الطفل على ملكة واحدة فقط هي (غريزة الملكية ) ومنها تستطيع أن تبث إليه الكثير من الفضائل ...راقني منها هذا المثال الذي يقترح فيه وهب الطفل قطعة صغيرة من بستان لزراعتها ..ثم يقول:\" وسأقاسمه هوايته وأعمل معه لا للذته هو بل للذتي أنا فأصبح معاونه في فلاحة البستان وأقلب معه الأرض بالفأس حين تعجز ذراعه عن ذلك ، ثم يزرع حبة فول ويتعلم معنى الملكية بهذا العمل ، ولا شك أن إحساسه بملكية هذه النبتة أقدس وأشد احتراما عنده من إحساس المكتشفين لدولهم لمجرد قيام المكتشفين بغرس أعلام تلك الدول في تربتها ، وطبعا سيعود الطفل لري الفول ، وكلما رآه يرتفع تملك السرور العظيم ، فأزيد على سروره بأن أقول له : (هذا ملكك) ، وأشرح له عندئذ لفظ الملكية وأنه ثمرة لما بذله من وقت ومن عمل ومن جهد ، أي أنه ثمرة لما بذله من نفسه في إنتاج ذلك الشئ \" ومن أهم ما كتب هنا بناظري قوله : \"إن غالبية قواعدنا اﻷخلاقية مبنية على تناقض، والوصية الوحيدة التي تناسب اﻷطفال من كل الوجوه هي ( ألا يسيؤا إلى أحد )...فإن جميع الناس يفعلون الخير أحيانا، ولكن القليلين منهم جدا هم من لا يسيؤن إلى أحد مطلقا. وهؤلاء وحدهم هم الفضلاء بمعنى الكلمة \" أما فيما يختص بالتعليم الدراسي فتعاليمه أصابتني بالإحباط ، خاصة في زمن كزماننا لا مناص فيه من تعليم التلقين الذي انتقده بل رفضه لإميل بشدة وحسم فالتاريخ لا يُفهم إلا بالتجربة والفكر ...والجغرفيا لا تعلّم إلا بالترحال والنظر.. والعلوم لا تدرك إلا بالحاجة والتأمل ...واللغات لا تعني شيئا إن لم يفطن مدلولات لغته الأم أولا ... وكذا بشتى العلوم ... ويقول في ذلك : \" قد تكون معلومات إميل العلمية بهذه الطريقة محدودة ، ولكنها على قلتها جيدة كلها وصائبة ، إنه قد يجهل الكثير ولكن ما من شئ مما يجهله سيعجز عن معرفته بهذا التكوين العقلي ، فذهنه متفتح ذكي ومستعد لمعرفة كل شئ ، فهو على حد تعبير مونتاني : إن لم يكن متعلما فهو قابل للتعلم ، وحسبي منه أنه يعرف كيف يكتشف المراد من كل ما يفعله ، والسبب في كل ما يعتقده\" لم يكتفِ روسو بتخيل حياة طفله (أميل) من المهد إلى الرشد فحسب ‘ بل قام أيضا بانتقاء عروسه (صوفي) والتي جعل منها بفصله الأخير الوجيز موضوعه في تربية الإناث، الأمر الذي اتخذه البعض ذريعة لانتقاد روسو مرة أخرى كونه راعى في تلك التربية التحفظ على الفروقات الفسيولوجية والأدبية والاجتماعية فيما بين الجنسين ، وهراء كانت انتقاداتهم برأيي ،.. فهو كما حافظ في توجيهاته تلك على أن تكون في المقام الأول أما فاضلة وزوجة مخلصة فلقد أعاد وكرر حرصه على أن تكون تقية في غير تشدد ومثقفة في غير تنطع ، ومن يقرأ تلك القصة القصيرة التي ذيّل بها كتابه والتي وإن احتوت على بعض السذاجة المحببة ، إلا أنها أظهرت من خلال الطريقة التي رسم بها (روسو) اللقاء المتخيل بين (إميل ) و(صوفي) بالإضافة إلى محاوراتهما ، أنه وهبها كأنثى كرامة ونبلا بالطباع هو أحق بالأثرة وأجدر بالاتباع. \"وأيما رجلٍ عجز عن النهوض بأعباء الأبوة حق النهوض، فما من خصاصة أو عمل أو جاه بشري يمكن أن تعفيه من واجب إعالة بنيه وتنشئتهم بنفسه ، قد لا تصدقني أيها القارئ ، ولكني نذير من بين يديّ ندم شديد لكل من به نسمة حياة ثم تخلى عن تلك الواجبات المقدسة ، ليذرفن الدمع السخين على ما فرط فيه ، ولن يجد له من حسرته سلوانا!!\" هكذا قال روسو بلسانه هو على ضفاف بداية الكتاب.\"هنئ تلميذك يا أستاذي ، فإني سأغدو أباً عما قريب وحاشا لله أن ألقي إليك بأعباء تربية الابن بعد عناء تربية الوالد ! حاشا لله أن ينهض بهذا الواجب المقدس أحد سواي!!\" ..وهكذا قال بلسان إميل على مشارف نهايته ..وأقول أنا للسائرين فيما بين العبارتين من درب:.. لا تنسوا أن ترفعوا أقلامكم عنه فلقد كفّر روسو عن الذنب."}, {"userName": "Tamar7", "userReviewDate": "Dec 18, 2012", "userURL": "http://www.goodreads.com/user/show/15571924-tamar7", "userReview": "A society is composed of citizens. If you want a strong and virtuous society, you must start at ground zero; with the citizen, with the child. This book by Rousseau is, in my mind, his epic masterpiece(notice I say  his  masterpiece, not necessarily a philosophic masterpiece, though that argument could be made, I think). This work is an amalgamation of all his best ideas, presented by way of a young boy named Emile. If you could raise a child the 'right way', Rousseau's way, you would have a nation of citizens that would form a society that was moral, valued self-expression and had pride in their community. This book can be viewed as a figurative allegory or a literal guidebook for how to raise a child, as I believe Rousseau wrote it with both in mind. It is also, and most importantly I think, a critique of modern society. Rousseau was a decidedly anti-enlightenment thinker and his harsh and stinging words about the state of modern society during that time cut to the bone. He thought courage, bravery, and love of community had been replaced with pseudo-intellectualism, office jobs and mothers who dropped their babies off to nannies and took no time to instill in them the values that would shape a strong and upstanding society. Of course, modernization of the world has its benefits and the argument could be made that Rousseau was a man caught up in a fantasy of romantic notions of warrior societies, reminiscent of Sparta or Rome. Societies such as those were dying and in their place new ways of thinking, scientific methods and distrust of religion were growing. Many at the time viewed him as a man fixated on a fantasy and his famous feud with Voltaire through public letters highlighted the struggle between the culture of old and new. Even so, Rousseau's words ring true to this day. One doesn't have to look far to see that with all the conveniences of modern society, there has also been a softening of our minds and bodies that seems a disappointing outcome to the millions of years of hard work, innovation and struggle our ancestors went through to develop new and better ways of living. Rousseau asks us not to let that spark of humanity die out in favor of comfort, convenience, fancy words and modern entertainments. This is my absolute favorite work by him and one that has inspired me in my personal life like few other philosophic texts have.  \"I do not draw my rules from the principles of high philosophy, but find them written by nature with ineffaceable characters in the depth of my heart\"  - Rousseau, Emile"}, {"userName": "Yazeed AlMogren", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/22168773-yazeed-almogren", "userReview": "أعتقد بأن هذا الكتاب بالرغم من الجدل الذي أثير ولا يزال مثار حوله وحول آراء روسو في بعض القضايا الا أنه يعتبر أحد الكتب الأساسية التي كتبت في علم التربية، يعطي روسو في هذا الكتاب نصائح وارشادات في تربية الطفل والتعامل معه من مولده حتى بلوغه ونضوجه وكيف يتعامل من الإبن والإبنه، بالرغم من قدم هذا الكتاب وتغير بعض الأفكار ووجهات نظر الناس حول بعض القضايا الا أنه يستحق القراءة ويعتبر من أهم كتب جان جاك روسو"}, {"userName": "Sandy", "userReviewDate": "Jan 27, 2009", "userURL": "http://www.goodreads.com/user/show/109148-sandy", "userReview": "If only there was room in his world for little girls to be educated..."}, {"userName": "Clif", "userReviewDate": "Oct 24, 2010", "userURL": "http://www.goodreads.com/user/show/1241339-clif", "userReview": "If we want to produce a good man, how would we go about it? That's the problem that Rousseau presents himself in Emile.In this lengthy work, no aspect of upbringing is overlooked. Starting with the health of the mother before she gives birth, we follow the course of a boy's life as he becomes a man and marries - all under the tutelage of Rousseau.The basis of the upbringing is refreshing: a child must be allowed to follow his natural inclinations and do so in a natural setting away from the society that would corrupt him. There is to be no lecturing because the child will not understand the reasoning of the adult who lectures. Instead, the child must find out for himself why a behavior might be good or bad. His curiosity must have free play for him to learn by doing and discovering.Practicality is paramount. There is to be no book learning, no second language study, no grammar, no moral parables beyond the understanding of the child. When nature is the teacher, the youngster will learn to accept necessities without complaint and his confidence will come from his own accomplishments, not from mimicking an instructor or following step by step instructions.The result, Rousseau says, is a person who understands who he is and his own capabilities without vanity or false pride.The book is filled with good advice that stands the test of time; much being similar to what would be advised today, though the possibility of such isolation from society and the city would be almost impossible in the modern urban world.Unfortunately, 3/4 of the way through the book, Rousseau begins a prescription that is almost unbearable to this reader - that of what an ideal woman should be. To be fair, he could not be other than a man of his times when patriarchy was all, but any modern reader, especially female, would find Rousseau's passive, subservient, shy, withdrawing, homebody, not-speak-unless-spoken-to girl outrageous. He doesn't hesitate to say a woman's husband is her master and that she must accept her lot with equanimity, or risk being rightfully rejected if she complains. Though there are many patronizing comments about the excellence of female intelligence, the female brain might as well be a grapefruit for all the limitations on what is acceptable for her to learn and do.The reader gets a lot of the pap that was historically dispensed about the woman being the real master, using her charms and wiles to make the man do her bidding. This falls flat in the 21st century in (most of) America.Most striking is Rousseau's claim that while a man should be indifferent to the opinions of others, a woman must go out of her way not only to be virtuous, but to appear to be virtuous as well. The good opinion of others is what she must live for or she will be ruined.The idea that sex could be fun, that one could serially have several partners without the utter destruction of character is beyond Rousseau, but he didn't live in a time when contraception was easily achieved. At least he admits that women can enjoy and want sex as much as men, something quite revolutionary for the time.Overall, Rousseau's grasp of what it is to be a child is a marvel. His understanding of the frivolities of society, of the emptiness of basing one's worth on money, things and appearances is impressive and persuasive. He is always eager to make himself clear to the reader and defends his views well. But he places little faith in the ability of a human being, once adulthood is reached, to learn from failure or discover truths that might not have been prepared for as a child. To Rousseau, there are many times when, if things are not done right, the price will be paid for the rest of a life.He is, after all, presenting an ideal that few could achieve, but there is nothing in what he suggests be done that could not be done, fitting perfectly with his high evaluation of practicality. Don't ape everything I suggest, he says, just pick and choose what you think is best. See what I accomplish with Emile, my model of a man, and see if you can do better.P.S.Not long ago I read Leo Tolstoy's Anna Karenina. Tolstoy must have read Emile because the similarity between Rousseau's title character and the male protagonist in Anna K. is remarkable. Not only that, but the female ideal Rousseau presents is present in the character of Kitty in Anna K. - right down to acting in exactly the same way in the same situation - that of caring for a sick man. Anna K. herself, who takes command of her life and steps out of the traditional female role - goes mad, of course."}, {"userName": "Sıla J.", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/28209499-s-la-j", "userReview": "Alright, I may be biased because I regard Rousseau as my chief inspiration (I could build a temple for him and be the high priestess of Rousseauism) but I think it's cruel to cut off everything else he had to say about very important issues such as what is good and what virtue is, politics and governance, and how we should educate children (well, male children) by saying that he was a narrow minded sexist. Being a bigot means that having problems with progress. One who is a bigot is the one who doesn't like the age he / she lives in and wants the progress to turn backwards. For example, in a society in which people mostly have no intolerance against newcomers and immigrants, a bigot would be the one who stands up and says \"But what about the good old times when we didn't have anyone coming in? We should stick to our traditions and let no one else bring theirs along with them! We are good on our own!\" Before saying that Rousseau was a bigot or a fanatic, we must examine the age he belongs to. 18th century Europe was certainly not a place where women were highly regarded as equal to men. Even the most open minded thinkers thought of them to be creatures of a lesser value. (Yes, I'm looking at you, Voltaire) And few women were brave enough to protest this injustice and ignorance. Women did not and could not speak out. All Rousseau did was to correspond with the state of mind which ruled over his age. We would be right if we blamed him on the basis of not being revolutionary enough when it comes to women, but we cannot blame him for being a bigoted sexist."}, {"userName": "May", "userReviewDate": "Jun 13, 2011", "userURL": "http://www.goodreads.com/user/show/1667021-may", "userReview": "I recognize that this is a classic of Rousseau literature and in many ways it's not bad for its time. But it is very hard for me to swallow, knowing how philosophy has advanced and having had the benefit of Plato's works, which Rousseau may not have had full liberty to, given when Plato was dug up. He is SO held within the structure of his time, which can be seen throughout in his biases and his assumptions on class, race, and gender. Painful to swallow if you are not in the majority on any of those. Secondarily, he has so many biases on what knowledge is and who it should come from. Frustrating when one considers that academia and that certain sort of knowledge has its own biases embedded within it. Aside from all of these premise, when one looks through to consider what Rousseau is trying to say about education and how one must tenderly care for how a child is raised so as to inspire a love of learning that does not require this outside praise, you can actually see the beauty of Emile. Indeed, today's idea of everyone gets a medal, no one looses, is very much the opposite of what Rousseau is saying and we shall see the types of personalities this produces in years to come."}, {"userName": "Lavender Libya", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/9909036-lavender-libya", "userReview": "ان من يضيق بفترة الطفولة لايدرك أن النوع البشري كان حرياً به أن يهلك لو لم يبدأ الانسان طفلاً.. فنحن نولد ضعافا في حاجة الي القوة ونولد مجردين من كل شئ في حاجة الي العون ونولد حمقي في حاجة الي التمييز وكل مايعوزنا حين مولدنا ونفتقر اليه في كبرنا تؤتينا اياه التربية.والتربية تأتينا أما من الطبيعة أو من الناس أو من الاشياء فتنمو وظائفنا وجوارحنا الداخلية ذلكم هو تربية الطبيعة وماتتعلم من الافادة من ذلك النمو ذلكم هو تربية الناس ومانكتسبه بخبرتنا عن الأشياء التي نتأثز بها فذلكم هو تربية الأشياء .#جان_جاك_روسو****************************************************كتاب تربوي اكثر من رائع ومفيد بدأت فيه شهر نوفمبر -2015 وانهيته. في 3-2016 اطول مدة قراءة واستجمام عقلي لانه رحلة تربوية تحتاج الي التمهل بالرغم من انه موجه لتوضيح افضل الوسائل التربوية للطفل لكن اثره الطيب والافادة تعم اي قارئ في اي مرحلة عمرية."}, {"userName": "Fleming", "userReviewDate": "Jul 20, 2009", "userURL": "http://www.goodreads.com/user/show/2543606-fleming", "userReview": "In a course I took, the professor once said that a man had written Rousseau 10 years after he wrote Emile and said that he raised his son identically to how Rousseau raised imaginary Emile. Rousseau wrote back \"I feel sorry for you, but more sorry for your son.\" This book knocked me on my ass... which is what books are supposed to do, yes? Yes. Five stars."}, {"userName": "Zohreh Samiei", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/35342749-zohreh-samiei", "userReview": "كتابي كه حدودا صد و نود سال پيش نگاشته شده و عجيب بر اساس فطرت بشري است، روسو تربيت طفلي را بر عهده مي گيرد، تا به ازدواجش؛ و در اين ميان از اصول و عقايد خود سخن به ميان مي آورد...در كل برايم جالب بود"}, {"userName": "Hedieh Madani", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/25169709-hedieh-madani", "userReview": "بخش پنجمش چرند محض بود.چهار بخش اول عالی بودند. فکر می کنم اگه یه روز بچه دار بشم از این بخش ها برای تربیتش می تونم کمک خوبی بگیرم."}, {"userName": "مناجاة فراشة ❤️كنزة بلفاسم", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/57915689", "userReview": "كانت البداية مشجعة فيها الكثير من الأفكار المقبولة أو بالأحرى الموافقة لفكرتي على التربية السليمة .....لكن ما إن بدأ أول فصل بدأت أعارضه الأفكارَ.. خصوصا أن هذا الـ إميل مجرد شخصية افتراضية لم يطبق عليها جون جاك هذه الطريقة التربوية إلا في عقله .... (كان بمقدوره تطبيق هذه الطريقة على أحد أولاده الخمسة .. لكنه فضل وضعهم في الملجأ لأنه يعرف أنه غير صالح للأبوة وهذا الكتاب خير دليل على هذا)الكتاب وقع في عدة تناقضات فيما يخص تربية الطفل إميل والطفلة صوفي ،فكيف لفتاة بصفات صوفي أن تنشئ دابة مثل إميـل مرة أخرى ...هذه الطريقة هي المعنى الحقيقي للتربية الخاطئة حقّا فلو طبقناها سنجد نفسنا نصنع طرزان أو ماوغلي القرن .. لكن هذه النسخة تحتاج أمّا عاشبة كالبقرة مثلا لأن حليب الذئبة يجعل الطفل يصاب بديدان المعدة ....الكتاب عبث في عبث اللهم إلا في بعض المواقف ...لكن ميزان العبث رجح ممّا جعلني أتبع معه طريقة القراءة التصويرية لانهائه ...عموما لا أنصح به فمجال علم التربية مليء بالكتب المفيدة والمستساغة الأفكار"}, {"userName": "Chris", "userReviewDate": "Feb 06, 2008", "userURL": "http://www.goodreads.com/user/show/78503-chris", "userReview": "Rousseau had some very strange ideas about how to raise children, and how to teach them things. Wrapping kids in swaddling, controlling every aspect of their environment for an age, and then allowing them to learn through failure. This last was my favorite philosophy, one in which, unlike the children of today, he promoted that children be allowed to hurt themselves when they were at the right age, in order that they should learn how not to do stupid things. When I look at the lame, short, plastic swingsets of today, I wonder how these kids will ever learn to deal with the pains of life."}, {"userName": "Kristen", "userReviewDate": "Jul 26, 2012", "userURL": "http://www.goodreads.com/user/show/10437664-kristen", "userReview": "Blegh. Just Blegh. Not a fan of Rousseau. When it comes to 17th-18th century philosophers, it's all about John Locke. He is a much more concise and interesting author in my opinion. I blame Rousseau's Frenchness. Lol. Also, the children who were raised according to Rousseau's mandates for Emile turned out horribly. Go figure."}, {"userName": "Lauren Albert", "userReviewDate": "Oct 12, 2009", "userURL": "http://www.goodreads.com/user/show/2828794-lauren-albert", "userReview": "I can't be fair to this book since I dislike Rousseau so intensely. Anyone who has read about him and his life will understand. But I don't agree with his educational philosophy and I don't like when fiction is used solely to hammer in someone's philosophy"}, {"userName": "Matthew Harms", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/70094043-matthew-harms", "userReview": "Reading this cover to cover was probably the biggest waste of time of my life."}, {"userName": "Nosherwan Yasin", "userReviewDate": "Apr 30, 2007", "userURL": "http://www.goodreads.com/user/show/72810-nosherwan-yasin", "userReview": "There are maybe 7 people in the world who understand this treatise on education, I don't think I am one of them yet."}], "description": "Alan Bloom's new translation of Emile, Rousseau's masterpiece on the education and training of the young, is the first in more than seventy years. In it, Bloom, whose magnificent translation of Plato's Republic has been universally hailed as a virtual rediscovery of that timeless text, again brings together the translator's gift for journeying between two languages and cultures and the philosopher's perception of the true meaning and significance of the issues being examined in the work. The result is a clear, readable, and highly engrossing text that at the same time offers a wholly new sense of the importance and relevance of Rousseau's thought to us.In addition to his translation, Bloom provides a brilliant introduction that relates the structure and themes of the book to the vital preoccupation's of our own age, particularly in the field of education, but also more generally to the current concerns about the limits and possibilities of human nature. Thus in this translation Emile, long a classic in the history of Western thought and educational theory, becomes something more: a prescription, fresh and dazzling, for the bringing up of autonomous, responsible—that is, truly democratic—human beings.", "title": "Emile or On Education", "url": "http://www.goodreads.com/book/show/326679.Emile_or_On_Education", "average": 3.62, "cover": "https://images.gr-assets.com/books/1334836441l/326679.jpg", "reviews": 209, "authors": [{"url": "https://www.goodreads.com/author/show/7994.Jean_Jacques_Rousseau", "name": "Jean-Jacques Rousseau"}, {"url": "https://www.goodreads.com/author/show/43127.Allan_Bloom", "name": "Allan Bloom"}, {"url": "https://www.goodreads.com/author/show/454598.Michael_Wu", "name": "Michael Wu"}], "type": ["Philosophy", "Education", "Classics", "Nonfiction", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/326679.Emile_or_On_Education", "http://www.goodreads.com/book/show/174945._", "http://www.goodreads.com/book/show/19008455-emile", "http://www.goodreads.com/book/show/638611._mile", "http://www.goodreads.com/book/show/10067723", "http://www.goodreads.com/book/show/1989272.Emile_or_Education", "http://www.goodreads.com/book/show/999952._mile_ou_de_l_ducation", "http://www.goodreads.com/book/show/12651.The_Social_Contract", "http://www.goodreads.com/book/show/22472.Discourse_on_the_Origin_of_Inequality", "http://www.goodreads.com/book/show/27785.The_Basic_Political_Writings", "http://www.goodreads.com/book/show/12649.Confessions", "http://www.goodreads.com/book/show/722065.Reveries_of_the_Solitary_Walker"]}