{"ratings": 576, "userreviews": [{"userName": "Natalie Monroe", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "1.5 starsGather around, duckies. Natalie’s going to show you how to write your very own paranormal romance!You see that word there? You won’t need any of that as long as you follow this easy how-to guide.Step 1: Creating your heroine. Now, it is essentially important that she’s naturally pretty, but doesn’t acknowledge it. The best way to do this is by having her look in a mirror, describe her appearance, and then say how utterly ugly or plain she is.\n Jenny leaned in to examine herself in the mirror...She was still the Jenny with hazel eyes and prominent cheekbones under a mane of wavy brown hair. There was nothing remotely interesting about her face. In fact, the only notable thing about her appearance was the small starburst-shaped birthmark on her collarbone. She was always surprised that no one else seemed to notice it when she was so acutely aware of its presence. \nSomething like this.This self-denial will make your heroine seem modest and humble. It's like what One Direction says, the fact that you don't know you're beautiful, makes you beautiful!Because how dare girls think they're attractive. They must be sluts, flaunting their beauty and sexuality like that. And we certainly don't want your audience thinking your protagonist is the girl that puts on red lipstick and wears miniskirts. Oh no, that role is best left to the heroine's best friend or archenemy! Besides, your heroine's refusal to accept she's pretty will provide an excellent opportunity for others, or more specifically, the love interest(s) to shower her with reassurances instead!It's also a good idea to add a dash of Mary-Sueness, or else how will readers know how very special she is? You might consider a tragic past, being amazingly talented at something without training or any apparent reason, or a special birthmark. \nIn fact, the only notable thing about her appearance was the small starburst-shaped birthmark on her collarbone. She was always surprised that no one else seemed to notice it when she was so acutely aware of its presence. \nRemember, it has to be in a place the MC will display to the public. This will give her more reasons to fret over her appearance. And it has to be in a dignified spot too, so places like her armpit or elbow are no-nos.Special powers are optional. But if you do choose to include them in order to highlight your heroine's uniqueness even more, you have to make her the best of the best and no one else can perform what she can.\nYou're a daughter of the Order, Jenny. In fact, the only mortal child of a member we know of. It's quite possible that your power is every bit as strong and...unique as that of your mother. \nOne last aspect of your heroine's personality: She must be a loner, or feel otherwise separated from the rest of humankind. That's because she's meant for greater things, and those provincial losers and their shallow thoughts will only drag her down.Step 2: Creating secondary characters. Your MC has to have at least one friend. You don't want her to be a total freak, do you? A ditzy and/or provocative counterpart to your responsible and/or modest heroine will do. They'll highlight your MC's passiveness and provide the dual function of dragging your homebody MC to social events where she might meet the love interest(s). Slut-shaming is optional. You want everyone to know your heroine does not approve of such bellybutton-baring, but since she's her BFF, she'll let it go.Step 3: Creating the love interest(s)This step is the easiest of them all. Your love interest(s) only need two defining qualities: insanely hot and completely devoted to the heroine. Crazy possessiveness, secrets and stalking her dreams adds dreamy points!\nFinally, still out of breath, Nikolai looked down at his body, the white shirt now transparent and stuck to his muscled chest, his jeans conforming to his thighs like a second skin.She saw the love in his eyes. The resolve.\"You are mine.\" He spoke against her lips. \"You always have been. You always will be.\"\nIt's also okay if the love interest is older than the heroine. Like way, way older. We're talking centuries. Everyone knows that girls mature faster than boys anyway. But he can't have liver spots or wrinkles because that would be gross. So make him an immortal or provide him access to the Philosopher's Stone. Anything goes as long as that boy's tush is as firm as a cupcake.\n\"My mother saw to it that I didn't grow older while I was healing. I only started aging again when I came [to the present].\"\nStep 4: Insta-love. You have to establish the relationship between the MC and the love interest(s) as quickly as possible. \nBut seeing Nikolai had become necessary. She found that she could get through anything if she knew when they would next be together. He was a lifeline.\nNo one gives a crap about getting to know each other! It's love at first sight just like Romeo and Juliet, and as we all know, theirs is the ultimate love story. Similar to Romeo and Juliet, their love must be forbidden. Who wants to read about any old couple? Like, boring! Be creative with reasons. They can't be together because ___________.Examples: They can't be together because Nikolai is a time-traveler and he's not allowed to alter time by falling in love.They can't be together because he's a demon and she's an angel.They can't be together because the coffee maker will break.Their love must be as passionate as R&J's too. Not the icky boner kind, but the kind that transcends centuries. Bonus points for co-dependence! After all, isn't that the meaning of true love?\nShe had known him forever and ever. Had waited for him as he had waited for her.She forced herself to take a step away from him even though the idea of being separated for even a few hours made it hard to breathe.\nStep 5: Initiate a love triangle.What's better than one boy? Two, of course! Readers love all that angst and drama. Plus, it sells Team _____ T-shirts too! Two times the boy, two times the money.You don't even need to think of a separate personality for him. He's only there to create extra tension after all! But this one has to be the 'safe option' and be friend-zoned. Have the heroine constantly compare him to the main love interest as well. Don't want those readers to forget who the real star is!\nIn the bright sunlight of Ben's foyer, her conversation with Nikolai seemed like a dream. But Ben was real, and for a split second, she thought about telling him everything.Ben was...interesting. And attractive. But he wasn't Nikolai.\nStep 6: Absentee parents/guardianHow will your heroine engage in late night/broad daylight trysts with the love interest(s) if her parents are always there to bring her down? Have them work long hours, or just kill one or both of them off (remember, Mary Sueness!). It'll also give good reason for your MC to bitch at them for not telling her deep, dark secrets about her heritage. They were never there for her so her whining isn't unfilial. Have to cover those plot holes, you know.And that's it, you're done! Now just sit back and wait for the royalty checks to come in. Start writing the sequel(s) while you're at it. Wring that cow dry, baby!Warning: The accuracy of the above tips may be in negative figures depending on the phase of the moon, number of turtledoves in the sky, and the balance of the Force. Natalie Monroe is not responsible for any brain hemorrhages or violent head-desking they may cause. No refunds or exchanges.ARC provided by Netgalley."}, {"userName": "Rane", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/1987431-rane", "userReview": "This was something so beautifully whimsical about Endless by Amanda Gray. I enjoyed the shift between now and the end of innocence that was Romanov Russia.  Jenny Kramer has always had a gift of touch that brings forth the past life of the person she touches. Of late one dream has been haunting her of a young man named \"Nikolai\" who seems to be calling to her. When she meets and befriends Ben Daulton they come across a music box that triggers shared past lives and a clue to something more. Things only seem to become even more complicated when Nikolai walks into her life...  I'm not one for time travel romances as there's a type of formula to them. Endless gave the reader a different view with dire consequences for time traveling, a Order who upholds the law when someone travels. This wrapped up a quiet world where Endless takes place. It was a great contrast for the past jumps of Russia where there was much unrest but almost a foreshadowing to what it would bring to this time and the the unrest that would cloud the present.  Jenny was a level headed heroine who won me over with thinking things through and not jumping into danger and doing her research and picking up clues along the way. While the burden she carries is tough one, she doesn't buckle but this makes it hard to connect to others around her. As she befriends Ben it's clear these two have alot in common and it's great to see Ben growing from a cold quiet guy to someone who will stand beside Jenny now then someone who couldn't in the past... The romance was very sweet and somewhat quickly developed. Nikolai was dreamy and all that would make a perfect boyfriend making him a little bit of a mystery and for me a little shallow. Not being able to truly grasp more of what makes him who he is. Being that this is the first book in the series I can accept this for now... As the first book the foundation was strong the characters were a tad shallow in their history. This lays a building mystery in how everyone is connected to not only one another but how the keepers of time - The Order - is really pulling the strings. It does leave you with a cliffhanger with alot of loose ends that I can't wait to see what the duo writers of Amanda Gray have in store with this series."}, {"userName": "Cora ☕ Tea Party Princess", "userReviewDate": "Jan 08, 2014", "userURL": "http://www.goodreads.com/user/show/4166936-cora-tea-party-princess", "userReview": "[he didn't fit as the main love interest for me (hide spoiler)]"}, {"userName": "Rachmi", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/3047938-rachmi", "userReview": "[1. How can hypnosis be done by reading a letter? Does the sound of the reader /the mesmerist take part or the way he/she read it or anything else?2. How does the re-born work? Nikolai said people who have an unfinished business and traumatic experience can be re-born, but he didn't say how it works. Are there rules aside of unfinished business and traumatic experience? I believe there are a lot of people who have unfinished business and traumatic experience before they died, what makes Jenny and Ben so special they can reborn/reincarnated?3. How does the time travel work? When Nikolai search Maria and go to the future, does it mean there isn't Nikolai the past?4. Nikolai said time isn't linear, they can access any time any place as long as they have full moon. So it means there are many lives that run at the same time. As narrator said \"Jenny thought about it again, imagining past Jenny - or Maria - out there somewhere, racing through the halls of the Winter Palace with that Nikolai at the same time as present Jenny sped toward New York with this one\". When Nikolai said his mother help him came forward, I thought that he (the past) go forward to Jenny (present), that's why he is out of time. But then, it won't fit with the \"many lives at the same times\" theory since his past mostly won't exist anymore because of his jump forward to Jenny present.  (hide spoiler)]"}, {"userName": "K.", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/2327078-k", "userReview": "I read \"time travel\" and \"Romanov Russia\" in this novel's synopsis and thought this book must have been written for me...because let me tell you, I have quite the fascination with the last ruling royal family of Imperial Russia. A revolution, an assassination, an escaped princess whose body was never found? That is the stuff of my childself's imagination. (Also, this is one of my favorite movies of all time -- judge me.) In fact, I've immersed myself so much that I can recite the particular characteristics of each sister, so finding out that Gray centers on my personal favorite grand duchess just blew me out of the water.That is where it ends, however, because Endless is an occasionally effective mystery book, an at-best adequate suspense story and a sometimes cheese-inducing romance novel. I can't say that this novel is driven by its characters because I think they are quite lackluster. Jenny is an only child, she lives with her dad and has an aunt and one friend. She is lonely and always looking for someone to understand her. She's sad when she needs to be sad, smiles when she has to and fights when she's called to. There isn't anything remarkable or memorable in the way she is presented except for the fact that she has a special ability.The problem here is that a reader cannot just be told a character is a certain type, this must be supported by the environment; how people react to this character, etc. The development was simply lacking. And I felt this practice was current in most aspects of the story. For example, a lot of weight is placed on a relationship we never even truly witness. Yet this relationship is central not only to understanding Jenny's emotional state but to the plot itself. In fact, Jenny's relationships to those closest to her are showcased very minimally. Apart from Jenny, the secondary characters all seemed one dimensional. They wavered transparently without ever taking solid shape.Something else I had a problem with was dialogue. Endless dialogue (excuse the pun). Everyday, mundane conversations are not necessary. When having a phone conversation about a crucial clue to the mystery the characters are solving, we don't need the chit chat. I am (most of the time) a firm believer of less is more. Too many words, too much description tends to devalue the work, in my opinion. The point is, a lot of this is skimmable.Now the plot. About half-way through the book, I suffered a jerking bout of confusion...because initially, what with Jenny's ability to see visions and dream strange dreams, Endless seemed to follow the route of a paranormal. Enter time travel. After that, it seemed more sci-fi. Not that the two are exclusive but it was strange to start a character off by defining them by a single magical talent, then not using that talent for the rest of the book.The plot progression is also, at times, equally confusing. The subplots are obviously interconnected but it isn't done in a way that makes it easy to identify the connecting threads, nor is it engagingly ambiguous. (Though much of this might be me being not-smart). And when at last all the dots are connected, a lot of it still didn't make sense. And, as far as I know, this is a stand alone. No room for later explanations.Why, you wonder, did I give it 3 stars. Well, Gray really hit me with the Romanov family. And also, this is very readable. I point out my issues because I wanted it to work. And it does. I can see how many will have a good time with Endless. Unfortunately, it could have been more.One more thing: I did kind of love the ending. Such a tease.This review also appears in The Midnight Garden."}, {"userName": "Tandie", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/11494588-tandie", "userReview": "The pretty cover and the lure of Russia and Romanovs was promising. The writing wasn't perfect, but it was alright. I'll admit that I had misgivings reading the first few chapters. A bunch of high school (acted more like middle school) kids posturing and playing with a Ouija board? It wasn't well done and the characters fell flat.Things picked up and the writing improved. I got swept up into the plot, specifically the flashbacks about the Romanov family. There were fun mysterious parts I enjoyed. Jenny, an artist, wakes up from a vivid dream to discover a new addition to all her paintings. She's painted a shadowy figure into each picture. An ancient music box in an attic with instructions for mesmerization. Nice touches.The teenagers in this story were just way too unrealistic. Their actions, speech, & reasoning didn't make sense. The subplot was interesting enough for me too ignore the weirdo teens up until the last third of the book. It just went all over the place from that point. It kind of felt like a Nicholas Cage/National Treasure movie mixed with Somewhere in Time, but not in a good way. I was super turned off by the love interest. It felt so off that I actually thought a good plot twist was coming, that loverboy was actually a murderer or something. No such luck."}, {"userName": "Courtney Vasiliev", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/11129018-courtney-vasiliev", "userReview": "EndlessAmanda Gray★☆★☆The cover of this book is stunning! I was drawn in by the cover art alone. let me say, I believe YA novels have some of the BEST covers.This story is a beautiful one. There is love and tragedy it really moves you in a special way. I am A romance reader. usually contemporary romance. I have never read a romance novel that has moved me more. It is soul deep. I enjoyed the buildup of this novel. lots of details giving us a great introduction to chatacters without being overly descriptive. All the characters were well liked and well developed! Kudos on that.The mystery and build up of what is going on with Jenny is wonderful especially when everything comes together.. def not what I was expecting. and I had tons of theories. This novel really blew my mind. I told my husband I was so sad it was over. I just yearned for more from Nikolai and jenny. I really thought there was going to be a dumb love triangle, and I want to thank the Authors for not doing that to me! That would have been too much for me. I love the Russian period and would have liked to known more, but it wasn't what the bool was actually about so it wasn't too big of a disappointment. I cannot wait for the next book to come out. I know this is a novel I will read time and time again!"}, {"userName": "Annika", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/5053880-annika", "userReview": "This novel took me a long time to read because of my hectic schedule with school. However, today I finished Endless and it was absolutely beautiful.I loved the main character, Jenny. I felt like she was the right balance of strong yet submissive and never came off as whiny. I felt like Ben and her developed a strong relationship. I wasn't a fan of Nikolai however. He came into the story suddenly and it was almost insta-love between him and Jenny. However, I still thought he was a great character. The story captivated me pretty quickly. Jenny has the weirdest power in which she is able to see the past of someone by touching them. This gripped me, and the plot quickly expanded and grew. It seemed liked there were multiple subplots going on, and while this did throw me off, it tied in at the end, so it worked.Overall, I am glad I read Endless. The story was interesting, and the characters were unique. This was like nothing I have read before.Content: PG- moderate language, infrequent. Occasional violence/romance"}, {"userName": "Tanya (Girl Plus Books)", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/416997-tanya-girl-plus-books", "userReview": "The synopsis of Endless intrigued me right away. A contemporary YA novel with elements of time travel and Russian history, specifically the Romanov family. I was sold. Plus, that cover... beautiful!Jenny has always known there was something different about her. Touching others leads to strange visions that she cannot control. Wearing gloves helps but she still feels like an outsider. Her focus is on her painting, her father and her best (and only) friend Tiffany. An experience with a Ouija board prompts some strange and incredibly realistic dreams that leave her questioning what is real.When Jenny meets Ben and they come across an old music box with instructions for mesmerization things take an even stranger turn. Past and present start to merge as Jenny and Ben search for answers to their disturbing dreams and the music box, plus a mysterious new guy named Nikolai who is living next door to Jenny.There were instances where answers seemed to come very easily with little effort on the part of Jenny and her comrades. Great leaps were made when theorizing with little to back it up. Jenny's refusal to go to the most likely source for answers seemed irrational. And Jenny and those around her (Ben and Tiffany) seemed to accept the seemingly impossible with barely the bat of an eye. These all made for some believability issues that were difficult to overcome.There is definitely some insta-love happening but considering the story line and the background I was not as bothered by it as I would normally be and was able to go with it. The romance is on the sweet and chaste side and Nikolai is a true gentleman - protective and sweet and swoon worthy. Endless was an interesting read but I was left wishing for more. The premise offered such promise but overall I felt it was lacking in any real depth. I enjoyed the historical aspect and the time travel explanations were interesting and presented well but I was still left feeling no real connection with the characters or their journey.Endless wraps up with some unanswered questions and something of a cliffhanger so hopefully there is more to come in Jenny and Nikolai's story. With so much left up in the air it would be disappointing to not have a follow-up."}, {"userName": "Maud", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/5399473-maud", "userReview": "I apparently got this as an arc? I found it on my Netgalley list but I do not remember requesting this... Anyway, here we go! Check out my review here: https://www.youtube.com/watch?v=JX0l6...2.5 stars - I liked the idea of the book. I'm a sucker for previous life books and add in a touch of Russian history and I'm sold. So past-me-who-requested-this-book-for-review you did a good job. I only wish I remembered that we had.Now, as good as the synopsis sounds I'm afraid that the book itself doesn't life up to it. I liked the flashback parts to Russia, they were very interesting. Because you know (or at least I assume most people know) what happens in Russia when the tsar is kicked off the throne it makes it so tense. You kinda know how things will end but despite that I always kept that little spark of hope alive that maybe things would be okay. But what dragged the book down for me were some inconsistencies in the present day and the romance (also in the present day).If someone can explain these two inconsistencies to me I would love it because then I can finally let this go:- You get in the car in the morning, arrive late afternoon at a village that is supposed to be close to your hometown but you also manage to get back home at night.- You buy train tickets in Acton while you live in Stony Creek. You get on the train and then later tell us that people board the train when it stops at Stony Creek station yet you need that train to leave Stony Creek.Is it just me or is this just really weird and inconsistent? Because of this (and some more scenes like this) my feeling of time and how much time passes was totally screwed up. I know that it's not the most important thing in a novel but it did really annoy me. I like to be able to tell how much times passes between events, it helps me judge if things are going fast or not. With this book though I was unable to guess this at all.You have two different romances in this book though really it's all about the same characters so maybe not really different. The one in Russia I really liked. It feels dark and desperate because of the situation but that really made it shine. It justified some of the things said and choices made and overall it was just very interesting. The present day romance was not so great. In both times there is a love triangle and I really didn't like it in the present day because of Nikolai who is one of the love interests. He is all that Jenny can think and talk about despite some very weird and shady stuff. Ben on the other hand is incredibly moody in the beginning and then suddenly turns around and becomes friends with Jenny. It all just didn't really flow that well. Jenny also assumes that Ben loves her too partly because of the stuff that happened in the past and that just felt wrong. It made it seem like none of these characters can make their own choices, they have to relive their past lives or at least their feelings. My final complaint is that the ending was too open. I can accept an open ending but this one was the size of a crater. I have checked it a couple of times over the last couple of months and there isn't a sequel. The ending makes it feel like there is supposed to be one. A little bit of a less rushed ending with some more details would have fixed that."}, {"userName": "Melissa S Frederick", "userReviewDate": "Oct 07, 2013", "userURL": "http://www.goodreads.com/user/show/7129773-melissa-s-frederick", "userReview": "EndlessAmanda Gray4 of 5 Stars: What does this rating mean to me? I loved this book and enjoyed every moment of my reading experience!This novel had me lost in its pages from the moment I began reading! Jenny is a wonderful main character that is so easy to relate with. She is strong ,passionate and doesn't want to run away when things get weird.Endless has a little bit of everything in it.You start off with Jenny, she is a young woman in high school, who has the ability to see past lives by just placing her hand against someone's skin. Jenny has been pretty much alone her entire life, friendless and shy around people because they just don't understand her. She becomes friends with a boy named Ben that is new to town and they come across this music box, that leads them to having shared visions of the past. As if that isn't enough to make a great story, throw in another young man Nikolai, who Jenny see's in her dreams and then he shows up next door. Now wait, their is even more! You can't forget the amazing story of an endless love that seems to last through all of time and space.Amanda Gray has wonderful writing skills, she really knows how to make her story pop right off the pages and into your imagination. I can't give this book a 5 of 5 stars, because i did run across a few things that just didn't make sense to me. You are probably wondering what i mean, but I don't want to go into great detail and give some of the plot away, lets just say I felt like Amanda may have left a few things that were said just kind of hanging in the air. Let me try to explain, two of the characters had moments where it seemed as though they forgot who the other was....but then this was never mentioned again. It made me feel as though I was missing something important in the story. I actually stopped both times and re-read a page or two to see what was going on. See the two quotes below.This is a Quote from Ben toward the middle of the book:Nikolai? Ben's Face was blank, like the events of the past hour had erased his memory of everything that had transpired before.\"This is a Quote from Nikolai, that showed up toward the end of the book:\"Ben.? he seemed to search his memory for the name, then he walked over to Ben, Still on the floor and held out a hand. I'm sorry.\"With that said, I still loved this book and I hope that the story is continued with at least a sequel. I just can't resist a really good love story. It's good to see that maybe true love can really exist through all of time.~Please make sure you check out all my reviews here on Goodreads or On my Website, Reviews Unleashed Link ~"}, {"userName": "Shayna Varadeaux", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/5608388-shayna-varadeaux", "userReview": "Jenny is a girl who's generally misunderstood. She is different and she knows it. One night at a party she reluctantly takes part in some Ouija board action but what happens catches everyone off guard. I immediately am taken in by Jen and then Nikolai and of course Ben. I like the dynamic of the relationship build with each individual person in the story.This story is really good and it takes you on a mysterious journey that merges past and present in a unique way as far as books I have read. With great characters and a great plot it makes for a decidedly enjoyable read.Jenny has a lot to figure out and I loved being along for the crazy ride that was her life! Nikolai's input was awesome I must say. And him as a brooding love driven I will do anything for you type of guy was great.Nikolai was so elusive there really was no guessing what was going to happen concerning him. I like that it wasn't exactly predictable. Everything happened at a good pace.I love that Jen is an artist and the slightly creepy factor brought on by the occurrences. When the guy shows up in all her show pieces, that was eerily awesome. And well I can't talk too much about it without spoiling it and I just don't want to do that with this one. Ben, what can I say, at times his role in everything ripped my heart out. Everything he had to endure... dang.One thing this story has a lot of is intrigue. I love a great mystery and this book has it for sure. It reminds me of some of my favorite classic movies, spending the whole time trying to find out the truth while the characters try to as well. It kept me engaged and interested all along the way.It was an emotional read too, I felt happy sad, intrigued, bewildered, confused, and anxious. I was even choked up at times.I liked the romanticized Romanov and the Clock Maker's son. I like the relationship between Jen and her father too. And the Order, oh man a crazy bunch of \"greater good\" enforcers and it made for a well rounded dramatic plot.But here's the big question...Are you Team Ben or Team Nikolai?If it were a movie it would be a mind bender with a love story that spans the tests of time. Beautiful!This book was definitely a good YA read and I do recommend it!Quotes I love...\"There are all kinds of unexplainable things in the world - ghosts, psychics, those knives on the Home Shopping Network that can cut through anything. Why not time travel.\" - Tiffany\"I feel like everything before was a dream. Like I was missing a part of myself and didn't even know it.\" - Jenny"}, {"userName": "Cheyenne", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/7217821-cheyenne", "userReview": "I should have known as soon as the book started out with a ouija board that it was not my type of story.  Endless  by Amanda Gray is the kind of book that just doesn't work for so many reasons. First off it is sold to the consumer as  \"He has traveled across time and space to find her. But will she love him the way she once did? The main character Jenny is a reincarnated version of a Russian girl named Maria. After the aforementioned ouija board incident, Jenny starts having dreams about her past life as Maria. Suddenly the love interest from her dreams as Maria, shows up in Jenny's life. Their chemistry is 'undeniable'.While the premise of this story was intriguing, the application of it was just too disorganized and shallow. There is the beginning of a love triangle in this novel, and Jenny even says that 'in another lifetime' she could have fallen in love with the other main male character, Ben. Ben and Jenny have a real friendship not based off of looks alone. I could picture a romance developing there, but instead the author friendzones Ben and forces us to watch Jenny fall in love with her 'soulmate' who she met in this life for the first time four days ago. I didn't believe Jenny and Nikolai's relationship at all. The second big problem with this book is that its past is all based on Russian history but there is very little evidence of Russian culture in this book. By little I mean like, none, none at all. In fact the author is so limited in the use of real Russian culture that she even uses the same name for Maria's father as she uses for the love interest. Freud would have loved it. I am not Freud. Freud would also like this because he was good at being wrong about lots of things. This book just made no sense (just like most of Freudian psychology). The time travel was all really basic and convoluted, and I just did not buy it.Apparently this is a series, but I will not be picking up the next installment. Well, maybe I need a new fire-starter. We'll see."}, {"userName": "Alley Kat", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/5010782-alley-kat", "userReview": "I received a free copy of this book through netgalley in exchange for an honest review. I thank Netgalley, the publisher, and Amanda Gray.In Amanda Gray's novel, Endless, Jenny has always been different. A single touch of a person's skin to her hands can bring up visions of the darkest thoughts. Her mother is dead and her father is a bit too clingy. She has one friend and a bunch of people who play pretend. She has a talent in painting and art. What she didn't expect was for two boys, Ben and Nikolai to walk into her life, both with the same motive, both in different ways. Ben, son of Clare, the owner of the house Jenny's dad is remodeling, is hard to get to know, but soon grows warm to the main girl in this story. Nikolai seems to appear out of nowhere and is dark and mysterious, appearing in Jenny's dreams at night. Is there a reason Nikolai is here and what are the strange dreams she has been having? It all start with the Ouija board. It will end with a book.Parts of this book were a bit off. Jenny's and Nikolai's love felt fake. Ben was a much better character. Jenny's powers weren't elaborated enough. I expected this BIG AWESOME THING. I got two scenes and a painting. Big letdown. Parts of this book were good. Ben was a wonderful character. Jenny and Tiffany had a friendship that seemed real, something hard to do in books. The Romanov history was executed beautifully and the plot line with it was unique and unlike anything I have every read. Did I expect to find time traveling monks in this story. Nope. Was it good? It sure was. Could it have been better? Everything can. Some wording was odd, some parts didn't make sense, and the beginning threw me for a loop. All in all it is a wonderful book hat I enjoyed quite well and I will be eagerly awaiting the sequel."}, {"userName": "Gremlin", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/255393-gremlin", "userReview": "This book just didn't gel with me. It was a classic case of \"telling, not showing.\" Too many repeated conversations, too many unnecessary characters, too many stock phrases, a love story that felt completely forced, and a seriously convoluted plot.The main character is supposed to be a \"weird\" girl, but I didn't ever understand why. Because she's an artist? She's such a loner! And she has this secret ability to see the past if she touches someone. But then spends most of the book unwilling to believe half of what is happening. Really? If I had a supernatural power, I'm sure that I'd be pretty open to other supernatural ideas. (Oddly, the two friends she managed to make are both TOTALLY on board and willing to believe her crazy supernatural stories immediately. Totally realistic!).Also, OMG. THE BETRAYAL Jenny felt when she found out her mom's best friend hadn't been honest with her about her role in a supernatural order. LIE OF OMMISSION, Jenny thinks. She's just so burnt up and angry that she won't even listen to Morgan as she tries to tell her why. I'm sorry - but a girl who's been keeping a secret her whole life about being able to see the past can't understand why someone else might need to? It's just so much easier to immediately distrust the one adult that you felt you could trust?Honestly, I would put some writing samples in this review (like the one about her heart opening up like a dead flower? Something like that?) but when I finished this book, I promptly left it in the airport I was in so that I'd have less to carry around.This is something that I might have actually written when I was in middle school. You know - a few fun ideas, but extremely unpolished writing skills and a complete inability to edit/re-work."}, {"userName": "Aurélie (Exploring Pages)", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/14667009-aur-lie-exploring-pages", "userReview": "More reviews on my blog, Exploring Pages.\"We have time. Right?\" His expression was somber but he reached across the counter and took her hand, squeezing it and saying exactly the thing she needed him to say. \"Right.\"- Amanda Gray, EndlessFrom the day I watched 20th Century Fox's Anastasia, I slightly became obsessed with the Romanov family, their assassination, the mystery involving Anastasia, a girl who's also known as the lost princess because her body was never found upon a few years ago. Finding a book on Netgalley that not only involved time travelling, but also the Romanovs? I can easily compare it to a dream come true. Endless was a book that started out great for me, but the second half wasn't my cup of tea.The plot itself was fantastic. Now that you're aware of my Romanov obsession, I can't say I didn't love that aspect of the story, because I did. I loved that. The flashbacks to that particular time were so well done. I felt like I was really pulled into the scene. Every flashback was part of the big mystery this book handles, and they all built up to the climax at the end. I really liked the way this was done. One moment I was so intrigued I almost started flying through the pages. It didn't last long though, because after a short while I was able to figure out the rest of the book. There weren't plot twists left for me to gasp at, nor a will to keep reading because of the incredibly slow pace. Besides the research and discovering of secrets regarding the big mystery, there wasn't much left to hold my attention. After a while it started dragging, especially when the so-called romance came in.I have my reasons for calling the romance 'so-called'. Starting off with a typical problem with love triangles: when the girl starts a cute friendship with one guy and you start shipping them, but then, another one comes in and suddenly the girl is head over heals for that one. The reason why makes me want to roll my eyes over and over again. The mysterious guy who just came in happens to be the love of the girl's life. They are destined lovers and promise each other eternal love and joy. Not only is that just ridiculous, especially for a seventeen-year-old girl, but it also reminded me a bit too much of other books I really didn't enjoy. The romance itself didn't grab me. I can't mention a scene when sparks were flying, and because of the destined-to-be-lovers, it came across way too unbelievable for my taste.Despite the romance being a complete flop, the characters were an overall okay for me. Jenny was a good protagonist. Although her choices and actions regarding the romance aspect were just stupid, she had something special while still being an ordinary human. Her talent in painting was really something I appreciated, though I don't know why. I guess I have always fancied characters with an artistic touch to them. Jenny's passion for painting is special, without it being mentioned on every single page. What she wanted to do with her hobby in the future is portrayed realistically. She loves to paint, and the society we live in, even now, isn't that encouraging when it comes to a career in the fine arts. Another thing about Jenny is that she doesn't give up. She stands up for what she wants in life and who she cares about.I can't express enough how much I liked Ben, and how disappointment I am because he is the poor character who needs love. Everyone in his environment was too dumb to see it, while my love for him kept growing. His backstory was touching, his personality was lovable and he as a character was so unique. He is the hero of the story, certainly of what happened at the end. Nikolai, on the other hand, can leave for all I care. There was little to zero character development in his character, and even after so many pages I still don't know anything about him. Hopefully there will be a possible sequel to clear that up, because I am not that kind of girl who would fall for a mysterious guy who was suddenly a destined a lover because the universe was trying to tell something.In a nutshell, Endless was an okay read. A fantastic plot with lots of mystery, and aspects of time travelling. The romance ruined it but the characters I liked managed to keep me reading. I'm currently crossing my fingers in the hope of a better sequel."}, {"userName": "Hannah", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/8026056-hannah", "userReview": "I love it when a book takes me by surprise – in a good way of course. I was drawn to this on NetGalley by the cover firstly, and then the synopsis made me request it, but I had no idea what to expect. I’ve only read a small handful of time travel books before, and even though the notion intrigues me, I’ve just not picked that many up. I went into it thinking it would be OK, but only OK to be honest. Do other people often experience this too, or is it just me?!Anyway, I raced through this in just over one sitting – I was hunched over my mother’s kitchen island, my back and arm muscles were starting to burn but I couldn’t stop reading. I got up about once to feed my dog, and much to her dismay, my attention was devoted to my Kindle. And let’s be honest, there’s not many things better than that in the book world, is there? I don’t want to recap the book, I’m worried I’ll write something that will spoil it! The synopsis does the best job, so I’ll start out with the main characters, because for me they were brilliant. Jenny was a perfect lead – surrounded by mystery and a past she didn’t fully understand; she was headstrong, brave, fought for those she loved yet also incredibly sweet and vulnerable in just the right balance. Ben, a new friend Jenny makes during the book, was probably my favorite though. He’d had his fair share of pain to get through when he was younger yet the way he cared about his family and friends, and even strangers, felt so noble and strong. He went out of his way for everyone and risked a whole lot to ensure other people’s happiness and life. Then of course there’s Nikolai, a man who seems to appear out of nowhere in Jenny’s life, making himself known to her little by little. I don’t really want to give anything away regarding his storyline, because that was one of the biggest elements of the book, however I will say that he was a pleasure to read – a true hero who fights through everything to find his true love. As for the concept of time travel, I found that to be done very cleverly. There wasn’t too much information dumping at one time, and the unknowns surrounding it unraveled at just the right pace to keep my frantically turning the pages. I did have a few questions about some parts of it, but I didn’t feel like they detracted from the story. I especially loved the fact that part of the story was set in Russia and involved the Romanov family. I didn’t know too much about this piece of history before, but I found it so fascinating and heartbreaking all at the same time. Even though I knew what was going to happen, I was dying for it not to and it just made the relationship between Nikolai and Jenny all the more believable and beautiful. I also really liked the way these parts of their history were interwoven in the story through dreams or visions – this isn’t normally my thing, but I found myself dying to know the next part to their past.I also thought The Order was satisfyingly creepy and secretive – I liked that I couldn’t predict everything that would happen and I found the climax of the book gripping and full of suspense as the truth was revealed and the consequences ensued. This, however, leads me on to the disappointing bit. I cannot find news of a sequel ANYWHERE and I’m getting distressed! This story has to carry on – I need answers about what happens to Jenny and Nikolai. The ending is left fairly open, no major cliffhanger, but I still need closure. I refuse to use my imagination!! *stomps feet* So much so, that I would be forced to change my rating, because if it’s a standalone, then the ending is frustrating. So I’m warning you now, be careful before you start this! If it sucks you in as much as me, you will be left a whiny mess afterwards. Just saying. Having said that, I thought this book was pretty amazing – the characters, the setting and the adventure all came together to create this romantic yet ultimately dangerous story with a perfect time travel twist!I received this title from NetGalley in exchange for an honest review"}, {"userName": "Rebecca {Not reviewing at the moment}", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/14895890-rebecca-not-reviewing-at-the-moment", "userReview": "[PlotJenny Kramer knows that there's something different about her. After all, she can see people's past lives by touching them. She befriends Ben, a boy who's new to town, and together they stumble upon an old music box.The music box contains instructions for 'mesmerization' and by using it, they discover that they have more in common than they thought; they knew each other in a past life. Using the music box, Ben and Jenny share a dream that takes them to Romanov Russia, where they find that they've been here before. Jenny has been having similar dreams for a long time, dreams that involve a mysterious young man named Nikolai. When Nikolai appears in Jenny's life, she has to believe that he has traveled through time to find her. But there are those who don't approve of Nikolai breaking the rules of time and space, and they seek to capture him and send him back to his time. Refusal to do so could mean that Jenny loses Nikolai forever, and they race against the clock to try and keep Nikolai in Jenny's life.  (hide spoiler)]"}, {"userName": "Dianne", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/7395171-dianne", "userReview": "Time travel, reincarnation, soulmates reuniting in another time, but is this truly THEIR time? Endless by Amanda Gray is a lightly different twist in the “YA paranormal, soulmates meant for each other,” genre. Jenny has always been different, able to read others by touch, forcing her to wear fingerless gloves, often thought of as a quirky fashion statement, as part of her artistic ways. When working with her widowed father for the summer, she begins a journey into a dangerous world she never knew existed with an unlikely ally, the new boy in town, Ben. Together they find a family heirloom that unlocks a door into the past and a look into the last days of the Royal Russian Romanov family. Is the mysterious figure painted into Jenny’s artwork a key to the mystery of the Romanov princess, Anastasia? When Jenny meets Nikolai, the mystery deepens as they are drawn to each other as naturally as a hummingbird to nectar. Can Jenny believe Nikolai when he says they were lovers in a past life? That she is the reincarnated Anastasia? What of Ben, who has stood by Jenny through everything she has discovered? What do the monks hidden away in their secluded monastery have to do with Jenny? Why are they watching her?Amanda Gray writes with a touch of the mysterious, while tantalizing the reader with the mystery of the Romanovs and a secret love affair. She writes like a seasoned storyteller and her words flow along with ease as she paints wonderful backdrops, scenes and builds both romantic and action tension. The mystery of Nikolai is well-done, he is shrouded in a veil of the unknown. Ben has his own personal issues that he is dealing with as best he can, but never fails to be there for Jenny, loved his character, he was natural and realistic feeling. It was Jenny I had trouble with, she was, at times a cardboard character or puppet to the action and plot, but Ms. Gray brought in enough twists and a huge ending that still has me in a kind of shock and in awe of her ability to end on an unexpected note that felt right! I received a copy from Month9Books in exchange for my honest review.Publication Date: October 8 2013Publisher: Month9BooksISBN: 9780988340954Genre: YA/Teen RomanceAvailable from: Amazon | Barnes & Noble"}, {"userName": "Natalie", "userReviewDate": "Jan 25, 2014", "userURL": "http://www.goodreads.com/user/show/13987078-natalie", "userReview": "I received this book from netgalley in exchange for an honest review.This book is one big confusion I did rate this 3 stars now I'm thinking more 2.5.I know like many people who read the blurb for this book and saw that beautiful cover, thought that sounds so amazing what could go wrong. Obviously a lot come on this book could have been mind blowing amazing, but in the end was just such a let down. I will admit I have a weakness to books that have anything to do with Russia. As soon as I saw Romanov Russia, request request then that cover. I really should stop judging books by their cover's. For anybody out there who doesn't know who the Romanov family are, I'm sure everyone has seen the film Anastasia. Anyways the Romanov family didn't have a very good fate, and has really interesting history surrounding that family. So was already intrigued, then add in the fact there's time travel, past lives, psychic's I was so excited come on this had to be good. For the most part the writing is very good I had no faults there. This could have been really good, if there wasn't so much confusion. It was like the author didn't know where she wanted her story to go. This story had so many elements to it, that just kept being added in without really making a great deal of sense. It just left me in one big confusion with what this story was actually meant to be about. We start of with a story that's about psychic abilities then it goes into past lives and then we have the Romanov family and then time travel. Then to just top it all off an epic romance story. It was just too many different story elements, that aren't really explained or explored well. Just felt like there was several different stories going on at once. What I did like was the Russia Romanov chapter's and where that bit of the story was going. As for the rest it was very rushed and wasn't explored very well. As for the epic romance it fell short of epic, there was no chemistry or gradual relationship development. It was very insta love which I hate, Jenny doesn't know Nikolai why would she suddenly love him and trust him. Annoyed me quite a bit there was more chemistry with ben. As for the character's they were very one dimensional, didn't feel for any of these character's. As not a lot of development happened between them all. I don't know why I just didn't connect with any of the character's.Sounds like a lot of negative's I know I hate doing negative reviews, but I did like the writing and wasn't all bad I loved the bits in Russia. If the book hadn't been one big confusion and just focused on one aspect of the story. I think I would have rated higher, also the fact that this book has took me months to read the pace was very slow.Thank you again for sending me this book for me to review I just don't think it was for me."}, {"userName": "Karla", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/11456033-karla", "userReview": "*I was provided with an advanced electronic copy of this book from the author and Month9Books in return of an honest review. No monetary compensation was provided in this exchange.*FINAL RATING: 2/5Jenny's life was pretty normal. She worked, painted, had minimal social contact... But she was happy enough with what she had. One night, she is peer pressured by a couple of acquaintances to partake in the calling to any ghosts through the use of a Ouija board. And then everything changes.It starts with the dreams. During her sleep, Jenny dreams of a whole different life. Of a girl named Maria, a boy named Nikolai, and incredible danger for both the two of them and the rest of Maria's family. She brushes it off - all people have dreams, it wasn't something she really worried about. Then Jenny meets Ben, the closed off and angry son of one of her architect father's customers. In the dusty and cluttered room at is the attic in Ben's house, they discover a mysterious music box... And find that they are connected more ways than one.Nikolai appears and slowly, the truth begins to unravel in Jenny's eyes. And while it seems that they are all safe, Nikolai has made decisions that will risk not only his life, but a vow that he made so long ago. The vow that brings him to Jenny, and the one that is threatening to separate them for good.I admit, I was so in love with the cover of this book. It is absolutely gorgeous and was one of the main reasons that I picked it up on NetGalley. Sadly to say, my expectations were not met and I was left pretty disappointed in the story. I didn't really find myself able to attach to any of the characters, I felt that they lacked the relatability that so many YA heroes and heroines have. I wasn't at all convinced of the relationship between Nikolai and Jenny. It was rushed and there was minimal development. I didn't see genuine romance between the two. I thought there was a lot more development between Ben and Jenny, to be honest. I did like the time travel aspect. It was very unique and well-thought out, though a little bit confusing. I think it could have used more explaining, maybe through a well-informed character rather than from Nikolai, who really only knows the bare minimum about the topic. I wish we found out more about Jenny's mom and The Order, though I guess Gray left room for a sequel.I didn't like the ending, I thought it went against the whole point of the story which was to show how much one would go through to be with the person that they love the most. I thought it would go in a different direction than the one that it went in.Endless did have potential to be a very good story, but for me it just disappointed."}, {"userName": "Kim", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/21963472-kim", "userReview": "Endless is neither terrible nor good. It's a perfectly okay story that might even be a good, beloved story in the right hands. For me, however, it just didn't work.The writing was certainly competent and I can't complain about the style. I found the main character, Jenny, to be fleshed out and that I understood who she was as a person. I was even able to identify with her reluctant friend Ben. In fact, part of my trouble is that I liked and was able to connect with Ben in a way that was completely lacking with the love interest, Nikolai. And that was really the main problem for me.We are supposed to be swept up in this grand love affair that crosses space and time. Sadly, though, the romance falls completely flat. We first meet Nikolai in a flashback/memory to Jenny's former life as Maria, daughter of the last Russian czar(yes, really). He, a poor clockmaker's grandson, has the audacity to approach the czar's daughter to slip her a note asking to meet her at a secret location later that day. Seriously. Really?? This would never happen. Yes, I know this is a story about time travel/reincarnation but I like some believability in my time travel/reincarnation tales! We meet them next in another flashback where they are apparently already in love. There was absolutely no development of the romance whatsoever. It just was. And I don't feel like Nikolai ever had a personality beyond \"generically decent human being.\" I couldn't find a single reason why I was supposed to care about this love story. Even when the love story is taking place in present times...nope, no development there either. They find each other and are just automatically in love. For a story that centers on its romance it's just bizarre for that romance to be so thin. I couldn't understand why I was meant to care for these characters when it was about as interesting as caring about a random couple that you'd see walking by you on the street.I was much more interested in the relationship between Jenny and Ben which was far more real and had more depth of connection and emotion than anything that happened with Nikolai. Jenny reflects on how Ben helps her in the quest to save Nikolai:\"Even in the midst of his own loss, he'd been there for her. He'd come not just to protect her, but because he knew what it would mean for her to lose Nikolai. And whatever he said, he'd done it knowing that Nikolai was the reason Jenny couldn't return his feelings.\"See? What a good guy. I liked Ben so much more! *sigh*Anyway, the final verdict is that this one is just okay. The story has a lot of potential but ultimately fell flat with the weak, untenable romance anchoring the book.**My thanks to Netgalley for providing a copy in exchange for an honest review**"}, {"userName": "Rachel", "userReviewDate": "Apr 12, 2014", "userURL": "http://www.goodreads.com/user/show/16242197-rachel", "userReview": "An alright book. Nothing to make me want to recommend it to my friends but not not badly written or plotted. There is a whole lot going on in this story and I really wished the author (authors?) would have taken more time developing certain aspects. For example, I would have loved to see more flashbacks to the Romanov era. For one, I'm a totally fan girl when it comes to glitzy, historical royalty and no one did it better than the Romanovs. Give me more parties! Dresses! Tiaras! But secondly and perhaps most importantly, the foundation of Jenny/Maria's love for Nickolai comes from this time period. As it was I felt that Jenny and Nickolai's romance made insta-love look long and drawn out. He appeared in her dream, then bought her painting, then tells her they loved each other in the past (her previous life) and she is suddenly declaring \"I don't think I breathed before you.\" Tell you what... If I met a boy in an abandoned house in the middle of the woods who told me he was my soulmate from an earlier life I would PROBABLY CALL THE POLICE! I would not immediately think: yes, this boy deserves my eternal devotion and whatever he says is now the most important truth I have ever heard, even if it contradicts everything I have ever known.I don't know if that weird relationship could have been rectified. However, if there had been more flashbacks to Nickolai and Maria I think I would have better understood it. I needed to see the relationship develop instead of being told to accept it at face value. I guess I'm not as trusting as Jenny.Jenny's best friend is named Tiffany. I didn't think there were people under the age of forty named Tiffany anymore (sorry to you young Tiffanys out there...)I don't find myself intrigued enough by this premise or the characters to continue this series. Kudos to the Amanda Grays for sticking Ben squarely in the Friend Zone, thereby eliminating the possibility of a love-triangle (god, I hope). I will say this though... the most intriguing part of the book for me came in the About the Author section. Apparently Amanda Gray is two best-selling authors working together that live a few miles apart but have never met. They consider themselves the best of friends but only talk over the phone. Now THAT is a story I would like to hear about!"}, {"userName": "Mlpmom (Book Reviewer)", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/3829694-mlpmom-book-reviewer", "userReview": "The cover on this is what drew me in first. I know I have said that before in reviews but I have to admit it every now and then, mostly because I know it is shallow but also because sometimes I like to prove that a pretty cover does and can hold a pretty story too. This was a great story. I have always been a fan of stories about soulmates and reincarnation. There is just something so magical and romantic about them, something that appeals to my softer side and turns me to mush just thinking about two souls traveling through time over and over again until they meet and fall in love again. The fact that the Romanov's play a part in the reincarnation makes the story that much better because it appealed to my inner history nerd as well. Love, historic detail, reincarnation, and a secret Order destined to destroy it all, what more could I ask for?I could ask for great characters and a fun storyline as well and guess what? I got that too. Really this was a great read that I really loved and ended up devouring. Nikolai, Jenny, Maria, Tiffany, Ben, Morgan, all great characters. My only wish was that it would have gone more into Jenny's mom, her life and of course Jenny's gifts. I am only guessing but I would imagine that the next book (seriously hoping there is a next!!) will go into more detail about all of that as well as the the Order and anything else left unanswered. I, for one, know that I will be continuing with the series to find out what happens. I do, after all, have to have my happily ever after."}, {"userName": "Ayanami Faerudo", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/3881642-ayanami-faerudo", "userReview": "Predictable. Bears many similarities (too close?) with Time's Twisted Arrow.Instalove. Reincarnation/Soulmate love not done right. Just because you knew each other in a past life does not mean that you would fall immediately into his arms. He's basically a stranger to you in this life no matter how familiar you are with each other in past lives."}, {"userName": " Mummy Cat Claire", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/2648857-mummy-cat-claire", "userReview": "Ever since I first saw this cover, I wanted to read this book. The cover is fantastic and it really drew me in. That's the whole point, right? Well, it worked and boy was I disappointed in the story. The book starts out with Jenny and some friends sitting in a room with a Ouija board. Jenny didn't want to participate but her friend Amber begged her to come and Tiffany really guilt tripped her into using the thing. Jenny wore gloves and they made fun of her for it\"Not touching anyone was her safest bet, and she managed to do just that most of the time though the use of her gloves...\"But this time, Jenny took off her gloves to use the board. She couldn't explain why she didn't run. \"Darkness didn't scare her. It was the things she could see that did. The things she saw and felt when her hands came into contact with certain people. Sometimes, she could touch someone and feel nothing. Other times she would be transported to places that were oddly familiar or ones she didn't recognize at all.\"Jenny's dad is a single father and works as an architect in a small town called Stony Creek, Connecticut. Jenny uses a lot of her time to help him with his work. Her father is not an adventurous soul so she doesn't confide in her father for much. Jenny also uses her time for painting portraits. Jenny is described as hazel eyes, brown hair and \"nothing remotely interesting about her face.\" It turns out that during the Ouija board session, Jenny recited a poem or someone took notes and wrote down a poem. Then it comes out that Jenny has been having dreams for several years and recently, feelings and thoughts have gotten stronger. *I'm not really sure here.Through her father, Jenny is introduced to Ben Dalton whose mother has hired Jenny's father to remodel a house. In the attic, Ben and Jenny discover a box and this experience leads Jenny to more dreams.After some time, Jenny finally has a most powerful dream where she sees \"a man with green eyes that seemed to reach out to her, trying to find her across all time and space.\" \"It was Nikolai, the young man from her dream.\"Ben helps Jenny discover some answers and the music box reveals a lot more than she ever though it could.The book does take the reader into some of Jenny's dreams where she is in the castle of the Russian monarchy. She is very confused, clearly, by the dreams and doesn't understand their significance. I was sure lost as well. By chapter 5, the reader is introduced to Nikolai. His introduction to the story didn't offer as many answers and I hoped. He only offered more confusion. By chapter 9, things start to become clearer but the story isn't as interesting as I thought it should be. Nikolai came off a bit of a stalker and crazy, since he stubbornly called Jenny Maria and wouldn't stop. This didn't make sense to me. As the book goes on, the reader learns more about Nikolai and what he has been doing and why. But the author just sort of lets things fall away. Like Jenny's gloves become lost and Nikolai's past seems to not matter in this future. Jenny's mother is hardly mentioned in the first part of the book. But later on, her mother plays a large role to the plot. The story was just strange for me. Ben wasn't my favorite character. The reader doesn't learn too much about him but when Jenny started distrusting him, I really began to dislike his character. I started to feel like he was a very unnecessary character to the book. After chapter 10, I skimmed the book. Some monk comes into play and starts chasing Jenny but I didn't care. I can't exactly place why, but the book is boring. I'm not interested in any of the characters or the mystery. So many things seem to have run past me, that I didn't get, that I'm confused about what's going on. I don't have a desire to finish and I don't care. Overall, it's a shame. The cover is so intriguing and inviting. But it really doesn't speak of the story, its just pretty to look at. The book was a jumble of information and nonsense. It really felt like there was no flow, no organization so the reader could follow Jenny's path. The book felt like it was thrown together. The characters were boring. Even Nikolai was boring. Jenny was a hot mess. She was flaky, indecisive, strange. Tiffany's character was odd for me. She's in the first part of the book, then nothing, then she comes back in the later part. Well, I didn't know who the chick but Jenny sure trusted her. Strange. The writing isn't the best. The story is very slow to get started. The mystery was laid out in a boring way. Jenny was not likable. She came off as stupid, selfish and bland, but everything works for her. The ending was totally not worth it. It came off very flat. There is a cliffhanger but I would never want to come back to the story. My biggest frustration was every time the reader would think something significant was happening, Jenny would leave the scene. Ugh! This book was a complete bust for me. Skip it. Content: moderate language, make out sessionsI received a copy of this book from Netgalley in exchange for an honest review."}, {"userName": "Jennifer (The Nightly Book Owl)", "userReviewDate": "Jan 31, 2014", "userURL": "http://www.goodreads.com/user/show/16802491-jennifer-the-nightly-book-owl", "userReview": "I was given a free copy of this book in exchange for an honest review. This review can also be read at The Nightly Book Owl.Darkness didn’t scare her. It was the things she could see that did. The things she saw and felt when her hands came into contact with certain people.Jenny Kramer has a gift. Ever since she was a child, she has been seeing visions of what seems to be a past life. Everything in her visions feels too real to simply be a dream. Everything is relatively fine until Pandora’s Box is open at a party where they decide to bring out the Ouija board. When are kids going to realize not to play around with this stuff? Seriously, nothing ever good comes out of it especially when it’s done at a party, but I digress. New kid Ben comes, and it seems that they are connected somehow. Jenny begins to unravel the mystery that is her life and meets a man that has traveled through time to find her, Nikolai. Alright let’s get on with this review. Overall, I liked this book. I wouldn’t say it is a must read, but it is awfully cute and easy to get through. I am a sucker for time travel stories and am very much interested in the Romanov family, so I jumped at the chance to read this book. It isn’t groundbreaking in either aspects, but it is a nice enough read that I can see myself recommending it. Plot-wise, I thought the start was a bit slow. It definitely got better towards the end of the book where there was a lot more action. Something that bugged me about this book is the drastic change from one half of the book to the other. The first half is spent being paranormal with one guy as the pretty much the leading man while the other is more science fiction and includes a different main guy. I feel like it should have integrated the characters together as a whole as opposed to splitting up the book in order to focus on the different characters. I do, however, love the flashbacks/dreams Jenny has of a past life in Russia. Those were the chapters I looked forward to the most. The characters were likeable enough. They’re nothing too special and not as developed as I would have liked, but they were by no means annoying or unlikeable. Jenny was a bit too plain for my liking. Sometimes, I just didn’t feel connected to her, so I would have liked for her to have been developed a bit more. I liked the guys more in this book because I could feel and sympathize with their emotions more than I did Jenny’s. Overall, Endless has a nice set of characters that I enjoyed reading about.Nikolai bent to kiss her. “It doesn’t matter. Wherever they send you, whatever happens, I will find you. I will always find you.” That Nikolai had cheated death to find her again.Gosh, where can I get a Nikolai? Someone to defy time to be with me? I know most people would probably label Nikolai and Jenny’s relationship as bordering or being instalove, but I ended up liking it. I didn’t really think of it as instalove. To me, it felt more like destiny or fate – as if everything in the universe was pulling them towards each other. I mean, that’s the point of the book. They’re soul mates, so they gravitate towards each other. Therefore, I find nothing wrong with how it played out. It felt like instinct for them, and it made sense to me. I loved their past together. They were unbelievable cute. Another thing I liked about the romance aspect of the book is the love triangle. I am not a fan of love triangles, but done right, I tolerate them if not like them. I like the way it was done in Endless because I don’t believe a person can love two people at the same time, and it certainly isn’t the case here. Jenny admits being attracted somewhat to Ben, but that is forgotten when faced with a love that crosses the boundaries of time. This, to me, is what a love triangle is supposed to be. All in all, if you’re looking for something cute and easy to get through, pick up Endless. It’s not amazing, but it is enjoyable. There are a lot of problems, but nonetheless, I quite liked this one."}, {"userName": "Kerri (Book Hoarder)", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/3067217-kerri-book-hoarder", "userReview": "[The story centres around Jenny, a teenaged girl who has the power to see glimpses of the past when she touches someone - something that she has always tried to hide. The book starts with her power bringing her a message through a playful game with an Ouija board and the story builds from there.I really enjoyed the writing in this book. The description is beautiful - the imagery is intense, painting a picture in your mind's eye as you read. Most authors include description, but Amanda Gray shows that she has a talent for it, here - there was a point where the shade from trees was described as lace, and that is the sort of thing I love, the comparisons that make you look at nature and your surroundings in a new way.From the start I found that I could really empathise with Jenny - she's never known her mother, and she loves her father but feels that what he hopes or wants for her is different than what will make her happy. She wants to make him happy, though, so she tries her best. She doesn't have many friends, and we see her grow to a better understanding of the word throughout the book - what it means to be a friend to someone, and what they might want from her, what she can get from them. It adds to the emotional depth of the book, and I liked seeing it.Her friendship with Ben was especially well done, building up slowly - it's so rare that you get to see a slow buildup of relationships in books now, it seems, that it was really nice to read and see it building, so slowly that neither of them are aware of it until they come to the sudden realisation. The sad part is that in comparison, Jenny's relationship with Nikolai falls short - it seems to be based on the physical attraction that her counterpart Maria had for him, but beyond that I couldn't find a basis for it, if I was honest. I found myself rooting for Ben more than I did for Nikolai, because I can't see what they have going for them beyond the 'meant to be' trope.The mix of magic and time travel intrigued me, here - the idea of time travel being scrutinised and controlled made sense to me, and the idea that time travel would have consequences was a breath of fresh air in comparison to some of the other tropes out there right now.The one thing that bothered me was that the book ends rather abruptly, and I'm not sure whether it's meant to be continued, or meant to be a self contained story - if it's meant to be self contained, then it's not quite satisfactory enough for me, to be honest. Too abrupt for Jenny and Nikolai's story, and it makes me worry that in comparison, Ben's story seems to be tied up in a neat little package, and also that I don't know what a second book would be about, other than more of the same. But the potential is there, so I'd read it. (hide spoiler)]"}, {"userName": "Sibil", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/7679588-sibil", "userReview": "Letto grazie a Netgalley.Posso tranquillamente iniziare dicendo che il libro non è male, è scorrevole e abbastanza originale, o almeno nella media. Si lascia leggere e, una volta tanto, è ambientato nelle vacanze estive e non durante l'anno scolastico.Però ci sono un sacco di piccole cose che non vanno:1) i Romanov. No, davvero, i Romanov? La Russia ha avuto una serie di famiglie reali infinita, con un sacco di personaggi interessanti e con storie da far invidia a Beautiful e la gente continua a parlare sempre e solo degli ultimi Romanov. E che palle! Quando ho letto i nomi la prima volta, Maria e Anastasia, mi è venuto un piccolo dubbio, ma poi mi sono detta: \"Ma va! Maria e Anastasia sono comunissimi, saranno altre due\" ecco... però non lo erano, erano proprio quella Maria e quella Anastasia. Mancava solo più Rasputin.Noticina positiva: almeno una di loro riuscirà a conquistarsi il lieto fine o, almeno, un'altra possibilità. Poco realistico, ma almeno è carino.2) La protagonista ha un dono: può vedere il passato delle altre persone toccandole, quindi indossa perennemente dei guanti. Bene. Fin qua nessun problema. Peccato che la cosa non viene sviluppata, in realtà è buttata lì ed è abbastanza inutile. All'inizio funzionava ma poi si perde per strada. Andrebbe sistemato meglio perché sembra un di più, un qualcosa di messo lì tanto per, perché fa figo.3) I personaggi. Non ci siamo. Ben è ben caratterizzato, la protagonista ni, insomma, il fatto che ha un dono ma che la cosa sembra messa lì a casaccio non aiuta, Nikolai avrebbe meritato qualcosina di più perché così è parecchio piatto e Tif, Tif è un vero peccato. Sarebbe un personaggio splendido (sarebbe l'amica di Jenny) ma viene tirata fuori come il coniglio dal cilindro del mago, a sorpresa e solo perché serve alla narrazione. Ha il potenziale per diventare un personaggio memorabile e simpaticissimo, ha tutte le qualità giuste ma, anche lei, come il dono della protagonista, è un'appendice, un qualcosa di messo lì per ragioni tecniche e lasciato al caso. Peccato.4) e questo è un punto personale: quando la storia era ambientata nel presente la storia scorreva ed era interessante (non la storia del secolo, ma comunque coinvolgente) ma come si spostava nella Russia del passato il mio interesse calava di colpo, o meglio, crollava, letteralmente. Ci sarebbero altri difettucci, ma sono cose di secondaria importanza e in realtà il libro non è pessimo, diciamo che si lascia leggere, è anche piacevole a tratti, ma non è certo un capolavoro e un sacco di cose andrebbero rifinite, aggiustate. Insomma, sarebbe un'ottima bozza per un romanzo ma manca di passione, di completezza, di quella scintilla che trasforma una bozza in un romanzo da divorare. Voto: 2,5 su 5."}, {"userName": "Alex ", "userReviewDate": "May 04, 2014", "userURL": "http://www.goodreads.com/user/show/4850910-alex", "userReview": "*sigh* This book did not work for me. It felt like completely two different books. The first half was a creepy, paranormal story. The second half (which I skimmed) was a weird twist on reincarnation and time travel. It's saying something that I don't like it, because I LOVE reincarnation. The beginning of the story was so promising. It had an average start, but I could see potential. A girl with the power to see people's past lives and dreams about Russia? YES PLEASE! Then Jenny meets Ben. After the incident in the attic, the story went downhill. Her 'powers'? Yeah, only mentioned a couple times. It never actually adds anything to the story. Jenny was annoying. When she gets something in her head she doesn't let it go. It doesn't matter if it will hurt anybody else, as long as Jenny's happy that's all she cares about. During the whole mystery of the monastery thing, she would come up with solutions out of nowhere. She said it like it was perfectly obvious. But there was no evidence leading up to it. I like to try and crack the case too. It's no fun when there's nothing there. Jenny's attention span was very short. Frankly, I feel sorry for her father and Tiffany. She drops them as soon as Ben and Nikolai come into the picture. Then she only talks to Tiffany when she needs something from her. I had a friend like that once and it was not fun. She was only ever there when she needed a ride to school or was bored. The first half of the book is so much more different than the last half. As soon as Nikolai was introduced the story just went downhill. He shows up and tells Jenny they're long lost lovers. Then BOOM! She can't imagine life without him. She would die for him. He's her only comfort. What about her father? Tiffany? Or even Ben? Are they only there to give her things when she needs it? Jenny and Nikolai are selfish and inconsiderate. She barely knows him and she trusts him with her life. This guy could have been lying to her and she wouldn't have cared. He was her one 'true love'. Screw anyone else in her life. I skimmed the last thirty percent. There were mundane, useless conversations that added nothing to the plot. Those could have been cut out. It also would have worked more if the world building had been introduced in the beginning of the novel instead of a massive infodump in the middle. I know my thoughts on this book are scattered and confusing. Trust me, I could go on and on about this book. But I think this is the gist of my feelings. My suggestion is to steer clear unless you really love time travel."}], "description": "Jenny Kramer knows she isn't normal. After all, not everybody can see the past lives of people around them.When she befriends Ben Daulton, resident new boy, the pair stumble on an old music box with instructions for “mesmerization” and discover they may have more in common than they thought. Like a past life.Using the instructions in the music box, Ben and Jenny share a dream that transports them to Romanov Russia and leads them to believe they have been there together before. But they weren't alone. Nikolai, the mysterious young man Jenny has been seeing in her own dreams was there, too. When Nikolai appears next door, Jenny is forced to acknowledge that he has travelled through time and space to find her. Doing so means he has defied the laws of time, and the Order, an ominous organization tasked with keeping people in the correct time, is determined to send him back. While Ben, Jenny and Nikolai race against the clock - and the Order - Jenny and Nikolai discover a link that joins them in life - and beyond death.", "title": "Endless", "url": "http://www.goodreads.com/book/show/18157967-endless", "average": 3.51, "cover": "https://images.gr-assets.com/books/1372789470l/18157967.jpg", "reviews": 301, "authors": [{"url": "https://www.goodreads.com/author/show/6000436.Amanda_Gray", "name": "Amanda Gray"}], "type": ["Young Adult", "Science Fiction", "Fantasy", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/18157967-endless", "http://www.goodreads.com/book/show/18710829-endless", "http://www.goodreads.com/book/show/21342173-overtime", "http://www.goodreads.com/book/show/30975429-erotica", "http://www.goodreads.com/book/show/26871516-spelling-world", "http://www.goodreads.com/book/show/21390958-business-travel", "http://www.goodreads.com/book/show/19222893-specific-heat", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}