{"ratings": 47, "userreviews": [{"userName": "Krista", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "When I scrunched my body under the big roof, preparing myself to commit to pulling up and over the edge, I looked down at Doc, eighty feet below. It was a long way away. My two blond children danced in front of my eyes for a moment like fairies. Your children will be okay if their mother's okay, Sarah had said in Victoria. Did I want my kids to see their mom bake cookies all day and make lunch for a logger, or climb steep cracks and go to university? Which mother would they believe when she told them, “Follow your dream!” I was up and over the roof and cramming another piece of protection in the crack. With my feet stemming the wall on either side of the corner, hands sunk deep in the crack, I felt like a climber again.I like memoirs, like learning about how disparate people have put their lives together, and as a metaphor for the struggles of life, mountain climbing is a perfect fit. In End of the Rope, author and climber Jan Redford outlines a gripping life that mirrors her own frustrating “yoyo” style of climbing: two steps up, driven by desire, one step back, succumbing to fear. But just as Redford always finds a way to the top of those literal cliffs and peaks, she digs down deep and eventually forges her own path to the pinnacle of self-fulfillment. I liked Redford's gritty voice, was fascinated by stories from the world of mountain climbing, and was rooting for her to succeed; everything I like in a memoir. (Usual caveat: I read an Advance Reading Copy and quotes may not be in their final forms.)\nI'm sucking in little gerbil breaths. Hyperventilating. Fear makes my body instinctively hug the rock, which puts my weight in the wrong place. One foot starts to shake, up and down, up and down like a sewing machine. I grip tighter, and the tighter I grip the more I shake. Dan doesn't say anything. There's nothing to say. He can't swoop in and rescue me. This is my moment. The one I usually try to avoid. The one I came here looking for. \nI see that End of the Rope is being marketed as “in the tradition of Cheryl Strayed's Wild”, but to me, they differ in two significant ways: After I read Wild, I mentally flirted with the idea that I could do a months-long hike like that, whereas I know I couldn't face even the easiest rock wall climb that Redford describes; and while Strayed tested and proved herself with this one life-changing event, Redford has spent most of her life going on climbs; she's a rock warrior before anything else. And it's Redford's community of climbers that I found most fascinating: those people who work a few months in order to qualify for unemployment insurance and live out of tents for the rest of the year, travelling in rusted out beaters to North America's most fabled peaks; this “incestuous” community that eventually sees most people hooking up with each other at some point; these rock warriors who are itching to get back on the mountains, even as friend after friend of theirs fall to their deaths or disappear in avalanches. This level of drive and commitment to doing the impossible – forcing yourself to the limits of physical and mental exertion when the only payoff is personal satisfaction, under the constant threat of death – is so foreign to me that the details of this book had me constantly enthralled.Fake it till you make it; how you live your life is how you climb; if the head she fits, the body he will follow; she didn't die doing what she loved, she lived doing what she loved.As to Redford's personal journey: as the child of a frequently violent alcoholic father and a distant and enabling mother, Redford recognises herself as a Codependent-type personality; and despite years of self-help books, dream journals, and visualisation boards, she is as hesitant to demand what she wants in her personal life as she can be hesitant to take the lead on a climb. It's hard to reconcile the strength of mind and will that it takes for her to swing herself up and over rocky barriers to the portrait of a woman reduced to frequent bouts of sobbing and succumbing to the demands of the men in her life, but it all makes for fascinating reading; this is a the story of a big life, well told."}, {"userName": "Booksandchinooks (Laurie)", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/63468213-booksandchinooks-laurie", "userReview": "I received a copy of this book from PenguinRandomHouse Canada for an honest review. I’m attracted to memoirs like this and since it was written by a fellow Canadian and a lot of it takes place near where I live I was even more intrigued. I have a hiker and kayaker in my family so knew of many of the locations mentioned. I am also a camper so have been to a lot of the places talked about as well as I’m very familiar with the towns and cities. What I really have no knowledge of is climbing. In my travels in the Rockies and Joshua Tree I have watched climbers with fascination. I have spent time just sitting and marvelling at them. Jan tells her story from her dysfunctional childhood to how she became part of the climbing community. She references people such as Sharon Wood who is well known as the first North American woman to climb Everest. The book details Jan’s climbing and her personal life. I have to say I found her story very compelling although I questioned some of her personal choices. She details how her confidence in her climbing skills fluctuated at certain times in her life and how that influenced some of her decisions. Her personal life had ups and downs and had a lot of sorrow. Many of her climbing buddies have died in their pursuits. Her boyfriend Dan tragically died climbing and it was heartbreaking reading about this. Dan had been such a powerful influence and a loving positive person in her life. My heart broke along with her. She then went on to have a tumultuous relationship and marriage with another climber who was the father of her two children. Throughout all this Jan was still trying to find herself. It was so wonderful to see Jan become empowered and go on to pursue her goals and dreams in defiance of her controlling husband. This book is both an adventure story of Jan’s climbing and also a personal story of her relationships, her life as a mother, and as a confident woman. The one problem I had with the book is it felt rushed at the end. Her story jumps from her early thirties to fifties with little information as to what she did in those years. I would have liked to hear more about her starting her career as a teacher and then about her going back to further her education and a few more details leading up to her fifties. Overall this book completely captivated me and I couldn’t stop reading it. It’s one those books that you feel sad when it ends and that’s a sign of a good book!"}, {"userName": "Rebecca", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/7813957-rebecca", "userReview": "\"Sometimes I felt like the only cure for whatever I had was to live in a cabin in the bush, alone with myself, where no one could influence my decisions, my lifestyle, what I ate, said, did, or felt. I was a chameleon; if I sat down beside a blue person I’d turn blue, beside a green person I’d turn green. I didn’t have my own colour. The only thing that had seemed like my own was climbing.\"I wasn't sure what to expect with this one and I definitely didn't think I'd end up enjoying it as much as I did considering that I'm not at all the outdoorsy type. And yet, even though climbing is a big focus of Redford's memoir, she considers so many universal themes (love in all of its manifestations, grief, marriage, motherhood, self-discovery, etc.) that I ended up being fully engrossed in her story and really cheering her on, especially towards the end when she describes her pursuit of higher education.We're definitely conditioned to think that life should follow a certain progression and it was enjoyable to read about someone who forged their own path. I particularly enjoyed the honesty with which Redford addresses her fears and concerns about failure, a recurring theme to which most people can relate. Thank you to Random House Canada for sending along a review copy in exchange for an honest review"}, {"userName": "Elaine Corden", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/36688938-elaine-corden", "userReview": "A fresh, funny, engaging and relatable story that dares to hold the risks and challenges of mountaineering up against the risks and challenges of being a feminist while hopelessly romantic, or a mother while hungry for more than motherhood alone offers. This is a fantastically confident debut—I can’t wait for Jan Redford’s next book."}, {"userName": "Kristin", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/1045114-kristin", "userReview": "Bravery takes practice."}, {"userName": "Melissa T", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/3803789-melissa-t", "userReview": "*Please note, I won this book via Goodreads Giveaways*This was quite the story. It details Jan's life, highlighting her semi unstable childhood, growing up with a father who drinks too much, and a mother who followed him from place to place, because she didn't have another option. Unfortunately for Jan, she falls into the same cycle, after going through a bit of a wild phase.Climbing is the highlight of the book. It's not something I've ever read much about, so those were probably the parts of this I enjoyed most. I've rock climbed up a wall in a gym a time or too, and enjoyed it, but I don't think I'd ever climb an actual mountain.Though I understood Jan's hesitance about some aspects of climbing, I felt frustrated for her at times. She was powerful and kick ass when she climbed on her own, or with other women, or men who weren't her significant other, but when she climbed with men she was sleeping with, she turned soft, and let them do all the leading and deciding. And not just in climbing either, but in life.Her deepest relationship was likely with Dan, a boyfriend of hers who got killed in an avalanche. She was devastated by his death, and goes to his friend Grant for support. He's an emotionally abusive, manipulative person, who makes promises he can't, and simply won't keep, and holds her back. He promises her multiple times that after this or that accomplishment of his, she'll be able to go to university.Jan is very unhappy with him, and there are times that she tries to assert her independence, like when he wants to take inheritance money and buy a trailer. She doesn't want that, so while he's out of the country on a climb, she buys a townhouse all by herself. It's these moments of willpower and defiance that make me wonder why she bothered to stay with him so long.But, I know why. Sometimes, a crappy situation that you know is better than the unknown.Luckily for Jan, her situation eventually works out to where she is in a happier place with more of an equal footing in a relationship. She gets a second chance of sorts, which I won't spoil. This book is a solid read."}, {"userName": "Megschuurman", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/78044738-megschuurman", "userReview": "Found this book at my local library while trying to find memoirs of motherhood. I'm not a rock climber, so maybe that influenced my experience of the book, but I found it to be really lacklustre. The writing isn't at all poetic or insightful (I got excited when I saw the Annie Dillard quote at the beginning, but there was nothing reflective of her writing in the book), and could have been much more reflective, given the writer's life experience. The long descriptions of climbs and expeditions didn't do anything for me, and frankly, the tone came across as a bit whiney at times. It is a position of privilege to not have to work in order to pursue something like full time climbing/ice climbing/outdoorsing and the community she describes seems to eschew a lot of other responsibilities for that singular pursuit. I got half way through and skimmed, then put it down. Would not recommend-there are better ways to spend your reading time."}, {"userName": "Eva", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/25685960-eva", "userReview": "Jan has loved mountain climbing ever since she tried it for the first time. It was a way to escape her difficult home life. She realized she was good at this and got even better from climbing with others in the climbing community.When her boyfriend Dan is killed in an avalanche, she is devastated. Dan’s climbing partner Grant offers support and she marries him. She is busy raising her young family and almost abandons climbing. Grant is away from home a lot working as a logger and is unable to help with the children.He is emotionally abusive and offers little support when Jan plans to attend university. Luckily, her mother and sister are in regular contact with Jan, so they are able to offer support and serve as a sounding board.After years of struggling and remaining in the relationship, Jan is able to turn her life around. Thankyou GoodReads for the book."}, {"userName": "Evelyn", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/5383191-evelyn", "userReview": "I received this book free through Goodreads. Loved it! I was hooked right from the start! The beginning of the book seemed like it was the life I had when I was a kid and the life I wanted to have after I left home but didn't have the guts to pursue since I went to university right after high school and didn't do Katimavik or NOLS like I wanted to, like Jan did! After though, I did move to a mountain town and had some adventure but then my life took a completely different path than hers. So interesting to read what her adventurous life was like! She is awesome!"}, {"userName": "Anne", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/17817088-anne", "userReview": "Good Lord, this book is a roller coaster of emotions! I love how Redford opened up her whole heart for this one, how she invited us in and said \"look at this mess I made, now watch me fight my way out.\" In a way it's frustrating watching her struggle so hard, but in another way.... life is frustrating. it's a struggle. We make choices and sometimes they are terrible, but I love how Redford let's us peer into her life and be inspired, perhaps learn from her mistakes. A powerhouse book about climbing and so so much more!"}, {"userName": "Vera", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/24680150-vera", "userReview": "Won a copy of this. Always loved the mountains, but after reading this may never think of them the same. Mountain climbing a challenge many would never be up to.But with Jan Mountain Climbing not her only challenge. Sometimes not such great luck with the guys either. She was a very courageous and compassionate person. Pushed herself over the limit many of times. Would recommend to others."}, {"userName": "Luisa", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/57859361-luisa", "userReview": "I won a copy of this book on goodreads in exchange for an honest review. Memoirs are usually not my thing. This book had a nice flow and provided a insight to the lives of mountain climbers. Being from Toronto mountain climbing is not something I was exposed to. My only fault is the book seemed to come up short at the end, I would have liked her to have explored more of her journey through completing her masters and her teaching career. Overall a good read."}, {"userName": "Patricia Levack", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/30393622-patricia-levack", "userReview": "Mountains! This book is about the conquering of the mountains that you climb and the mountains that you face in your life. It was interesting to learn what is involved in living the life of people who only want to climb but it left me wanting more. This book was free from Goodreads."}, {"userName": "An", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/52127492-an", "userReview": "Disclaimer: I received an advance reader's copy of this book via Goodreads' Giveaways. End of the Rope by Jan Redford will be available in stores this May."}, {"userName": "Molly", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/7371697-molly", "userReview": "Beautifully written memoir. For me at this point in my life/climbing obsession, this was perfect."}, {"userName": "Noelle Walsh", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/24059091-noelle-walsh", "userReview": "This book was good. If one is interested in memoirs and mountain climbing, then this is a book to consider adding to one's bookshelf."}, {"userName": "Sarah Boon", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/16372813-sarah-boon", "userReview": "This is the second book I've read that came out of the Banff Centre's Mountain and Wilderness writing program, and I haven't been impressed with either of them. Redford's book is billed as a memoir but is probably more accurately an autobiography. It's in completely chronological order - no moving back and forth in time. The book is also completely self-referential - no mention of anything happening in the larger world around her during the time period she writes about, and Redford makes no attempt to place her experience into the context of others, whether that's other female writers, other female climbers, etc. To tell you the truth, I got tired of reading just about her life, with no attempts made to interpret events or link to larger themes. And the writing doesn't make up for this lack - it's pretty pedestrian, with no luminous or quotable passages. I think I marked one quote as interesting. The other book that came out of this Banff writing program was Aaron Williams' \"Chasing Smoke: A Wildfire Memoir.\" It had all of the same problems as Redford's book - with the added bonus that Williams' had a really whiny personality which shone far too brightly in the book. Disappointing, to say the least."}, {"userName": "M.", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/51618886-m", "userReview": "Interesting story of why we do things."}, {"userName": "camilla", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/19739-camilla", "userReview": "Beautiful and brutal. The struggle to be a female climber and a mother and a wife and a student is real, and incredibly hard. I found this read bittersweet, I was fascinated by the climbing but devastated by all the climbing tragedies. Reading about the author getting into relationships with men that didn't really see her was tough, I imagine it was so much tougher to have lived it though. My only complaint? I wish there was a picture of Grant somewhere in the book!"}], "description": "In the tradition of Cheryl Strayed’s Wild comes this funny and gritty debut memoir in which Jan Redford grows from a nomadic rock climber to a mother who fights to win back her future. \"Compassionate and courageous, End of the Rope shows us that there are many types of bravery required, not just in the wilderness, but in surviving day to day life.\" —Tanis Rideout, author of Above All Things  After the love of her life is killed in an avalanche, a grieving Jan finds comfort in the arms of his climbing buddy, an extreme alpinist. But their marriage soon falters. While her husband logs forests and dreams of distant peaks, Jan has children, and takes on a wife’s traditional role. Over the following years, however, she pursues her own dream, one that pits her against her husband—attending university, and ultimately, gaining independence.End of the Rope is Jan's telling of heart-stopping adventures, from a harrowing rescue off El Capitan to leading a group of bumbling cadets across a glacier. It is her laughter-filled memoir of learning to climb, and of friendships with women in that masculine world. Most moving, this is her story of claiming freedom from a crushing marriage, an act of bravery equal to climbing mountains.", "title": "End of the Rope: Mountains, Marriage, and Motherhood", "url": "http://www.goodreads.com/book/show/36572204-end-of-the-rope", "average": 4.06, "cover": "https://images.gr-assets.com/books/1510352262l/36572204.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/8125182.Jan_Redford", "name": "Jan Redford"}], "type": ["Autobiography", "Nonfiction", "Environment", "Sports and Games"], "outlinks": ["http://www.goodreads.com/book/show/36572204-end-of-the-rope", "http://www.goodreads.com/book/show/35861507-end-of-the-rope", "http://www.goodreads.com/book/show/17897421-rock-paper-fire"]}