{"ratings": 592, "userreviews": [{"userName": "Betty Jean", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/45502904-betty-jean", "userReview": "Fast read, mildly entertaining, not as compelling as the previous books in this series. I couldn't help feeling that the author didn't really grasp the organic foods concept.There is no way three people are gonna stand around discussing what they know about the bad guy when said bad guy has a lethal weapon out, ready to kill one of them. This is something Columbo would do and it's frankly stupid.If you were an active person and had hair down to your hips, wouldn't you put it in a bun or ponytail? Exactly. I think the author was trying to make Alena mysterious, but she comes across instead as unrealistic. And why do the women in his stories have to be so \"beautiful\"? Alena, Kathryn, Macy, even the autistic girl. I mean, come on. What's wrong with \"pretty\" or \"cute\"? And, anyway, what's the deal with equating beauty to goodness? Sounds like the author's fantasizing here.The whole combine/lost girl scene felt contrived and unnecessary.By the book's end I was indifferent as to which woman he ended up with, though I think it should be pretty clear who he proposes to. What's the most important thing in the world to Nick? Bugs. Kathryn hates them. Alena doesn't. Dilemma solved.All that said, yeah, it was a pleasant enough read."}, {"userName": "Tracey", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/7738222-tracey", "userReview": "I love the bug man novels. They make me laugh out loud and are full of intrigue and mystery. Fast read as well; I can't put it down. I am frustrated with the end of this book though because of the cliff hanger. I can't get the last book soon enough."}, {"userName": "Emily", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/11230561-emily", "userReview": "I gave the book two stars due to the terrible ending, a warning to anyone, it ends vaguely and then sends you to a website that does not exist anymore to choose the ending. I supose I need to read the next book to find out the ending. I book was good, don't get me wrong, but I feel ending a book this way is a bit lazy and it assumes that all readers will find the book when the website is up and running."}, {"userName": "Starr", "userReviewDate": "Jul 22, 2011", "userURL": "http://www.goodreads.com/user/show/5128047-starr", "userReview": "Ends of the Earth by Tim DownsBug Man NovelThomas Nelson – September 15, 2009www.timdowns.netFacebook: yesRating: Loved it! Couldn’t put it downRecommendation: Fans of save-the-world-at-last-minute action and fans of clueless and quirky heroesNick Polchak is back, and his love and knowledge of bugs comes with him. He is called to the site of a murder, recommended by the victim’s wife. Nick must use his knowledge and experience of bugs and murder to unravel the truth that surrounds the mystery of Michael’s death. Katherine remembers working with Nick before and some old feelings resurface. When the need of a dog team arises, Nick immediately calls on Alena and her pack of dogs. Alena has not forgotten how things ended between her and Nick the last time they worked together. Now the Bug Man is faced with the murder that points to threat of terrorism as well as two women who are vying for his attention. What can I say? I am a huge Tim Downs fan, and there is yet to be a book of his that I don’t like. I have to say that I read this one a little bit faster than the other ones. But that was because I accidentally started reading the next one, Nick of Time, and realized that there was a lot that I had missed in the previous book. And I have to say that I am not disappointed in going back to this one. Yes, there was the possibility of a terrorist attack that the victim unknowingly becomes a part of. But as more bodies come to light, and other weird occurrences are explained, the closer Nick comes to closer to solving the mystery. The terrorist whose plans Nick has yet to uncover are nothing compared to mystery of the two women who are obviously after Nick’s heart. He hates to admit it, but is forced to deal with the fact that he is no longer part of the insect species. Though he is not familiar with the swirl of emotions that are going on inside of him, he knows that it undoubtedly makes him part of the human race. Though it would really be cliché to say that every book is an adventure, it would always be the truth. One of the main reasons that I like the Bug Man novels is that you can get so wrapped up in his world, though it’s informative of all things insects, they are more of a side note than a central character. Nick, on the other hand is full of quirks and flaws. He is filled with sarcasm and able to toss out a snarky comment that flusters or upsets the other characters, but the reader can’t help but laugh. There are certain things that have become Nickisms, and are expected in all of the novels. But they are never overdone and always have a way to sneak in. If there is ever a time I am in need of an entomologist, I pray that I am lucky enough to encounter one like Nick. He’s got to be out there somewhere, right? If only the world was so lucky."}, {"userName": "Barbara", "userReviewDate": "Aug 27, 2011", "userURL": "http://www.goodreads.com/user/show/3450884-barbara", "userReview": "Tim Downs' Bug Man series, which features a sarcastic, eccentric forensic entomologist named Nick Polchak, is one of the best mystery series out there. In this fifth outing, Nick is called upon to investigate a murder at an organic farm in North Carolina, where he lives. He's surprised to find that the murder victim (named Michael Severenson) is the late husband of Kathleen Guilford, a woman whom Nick once had feelings for (see \"Shoofly Pie\"). A narcotics dog team is suggested by local police, and Nick asks for help from Alena, a dog trainer known as the Witch of Endor (readers remember her from \"Less than Dead\"). While Nick investigates the murder, both Alena and Kathleen subtly (and sometimes not-so-subtly) compete for Nick's affections, with Alena bonding with Kathleen's autistic daughter Callie, who loves Alena's dogs.The murder, far from being a simple case of a drug bust gone bad, soon has multiple suspects--including Kathleen herself. Downs weaves a scary tale of using bugs as part of an eco-terror attack on the United States, which sounds farfetched until Nick explains how this works as the story evolves. At stake are global food prices as Russia seeks to supplant the United States in corn production. Also noted is the fact that the United States uses corn for ethanol, a type of biofuel, while Africans who desperately need corn for food continue to starve. Downs' characters, while a bit off-the-wall, are all realistic. He also has a knack for writing snappy, amusing dialogue, most of which comes from one-liners that Polchak uses to deflect unwanted questions (such as which woman does he really want? And does he really want either of them?). There are also great scenes, such as Kathleen's giving Alena a makeover before her 'date' with Nick--they go to a university social as well as a look inside Nick's classroom where his students present projects such as maggot therapy and the life-cycles of resident Carolinian insects. This is a terrific standalone mystery and a welcome addition to the Bug Man series."}, {"userName": "Denise", "userReviewDate": "Jul 27, 2010", "userURL": "http://www.goodreads.com/user/show/1550566-denise", "userReview": "Excellent. This is a story of Nick, an entomologist, aka the \"Bug Man\" who helps law enforcement by using the life cycle of insects to determine time of death. Think \"Bones\" TV show where Hodges does a similar job. He is portrayed as an introspective geek of sorts. An old female friend, Kathryn, who owns an organic farm, calls for his help to discover who killed her husband. She has a young autistic daughter, Callie. The husband was unreliable and winds up getting into trouble with drugs. The plot draws in another old friend, Alena, who is like a \"dog whisperer\" and owns a cadaver dog among 36 others. The intrigue is timely given the current fear of terrorism, this time involving agriculture and Russia. I will definitely read more!Merged review:Excellent. This is a story of Nick, an entomologist, aka the \"Bug Man\" who helps law enforcement by using the life cycle of insects to determine time of death. Think \"Bones\" TV show where Hodges does a similar job. He is portrayed as an introspective geek of sorts. An old female friend, Kathryn, who owns an organic farm, calls for his help to discover who killed her husband. She has a young autistic daughter, Callie. The husband was unreliable and winds up getting into trouble with drugs.The plot draws in another old friend, Alena, who is like a \"dog whisperer\" and owns a cadaver dog among 36 others. The intrigue is timely given the current fear of terrorism, this time involving agriculture and Russia.I will definitely read more!"}, {"userName": "Mike Chapman", "userReviewDate": "Nov 02, 2009", "userURL": "http://www.goodreads.com/user/show/2903840-mike-chapman", "userReview": "Hooray, and pass the chunks of beef liver! Nick Polchak is back, and he is as delightfully brilliant and bone-headed as ever! If you’re not familiar with award-winning author Tim Downs’ unusual protagonist from any of the previous 4 mystery novels in the Bug Man series, you’re in for a treat. His blisteringly funny sarcastic wit with students and colleagues, his total and utter cluelessness regarding women, his fascination with insects to the point of identifying with them more than humans, and his stunningly brilliant ability to help solve crimes through the study of bugs makes him one of the quirkiest, most intriguing amateur detectives imaginable. \tAs in the previous novels, Nick is faced with the challenge of unraveling a murder mystery, but this one has international entanglements, and cataclysmic consequences of global proportions. If that weren’t enough, Nick also finds himself in not just one, but two potential romantic relationships with women from past cases. Watching Nick painstakingly put the pieces of the mystery together in his inimitable fashion is always worth the read, but watching him struggle to even understand both women, much less take his first halting steps towards his first romantic relationship in the midst of a case was vastly entertaining! Ends of the Earth is one of the most thoroughly enjoyable novels I’ve read in a long time, and I can’t recommend it highly enough!"}, {"userName": "Laura", "userReviewDate": "Oct 28, 2009", "userURL": "http://www.goodreads.com/user/show/1733268-laura", "userReview": "I know this is the 5th book in the Bug Man series, but it is the first one I have had the pleasure of reading. I immediately liked Nick and found his humor to be refreshing. He is too-smart and has zero social skills and knows it. He laughs at himself and just accepts himself for the way that he is. I loved his character! Maybe because I am an engineer and know plenty of people like him, I found him endearing.Even though I have never read any of the other books in the series, I did not feel lost. I am sure a number of the characters have been mentioned in other books, but past interactions with Nick were not necessary to make this story whole. It was excellent as a stand alone book.I enjoyed every bit of this book. There was plenty of humor and wit right along with a good suspense story. The story is well written and believable. I know very little about bugs and farming, but none of the story was too overwhelming and the premise of it was well-developed and timely. I finished this book in the best way possible--with a smile on my face and ready to read more from the characters.Okay, so the ending was a big of a hanger and it can be annoying, but I found it funny and was not bothered by it in the least. I am looking forward to more from the Bug Man series and plan on going back and reading the first four in the series. *I received this book from Amazon Vine*"}, {"userName": "Brad", "userReviewDate": "Aug 23, 2010", "userURL": "http://www.goodreads.com/user/show/1188312-brad", "userReview": "Arthur, you win. This is one of the cases where I'd like a little more granularity in my ratings, as I would probably call this one a 3.5. Polchak is still the enjoyable protagonist that we've come to love over the previous four books.The bad guys this time have agroterrorist plans to destroy a portion of the US food supply. The agro/bioterrorist angle was one that I liked a lot, as this (and obviously biodefense) is one of my favorite subjects in microbiology. My biggest complaints are that it felt like Downs sort of got on a soapbox about organic farming and that some of the exposition felt a little forced (some of the explanations that were given by characters talking to each other were pretty obvious info dumps and didn't seem like natural things that they would have said).Polchak also has to deal with women in this novel, as two of the ladies from his past have major roles and both want a major piece of him. Who will he choose? The book doesn't actually say--you find out when you read the synopsis of book 6. Either way, I had some mixed feelings about the whole romance situation in the book, and was trying to decide whether the women were behaving realistically. I still haven't reached a conclusion.Rating: PG-13, for some non-gory violence."}, {"userName": "Sharon", "userReviewDate": "Sep 30, 2009", "userURL": "http://www.goodreads.com/user/show/1757121-sharon", "userReview": "Tim Downs has created an entertaining protagonist in Nick Polchak, a forensic entomologist (also known as \"the bug man\"). Polchak is an academic who is pulled into a murder case to help establish the post-mortem interval on the victim -- who happens to be the estranged husband of Nick's former girlfriend. Another former girlfriend is pulled into the mix because she has a cadaver dog ... and there is one set of issues already, as I'm sure you can imagine.Now put agroterrorism into the mix, based on the true geopolitics of the corn farming industry. In other words, \"Ends of the Earth\" is not just another police procedural; it's an international espionage story as well. Polchak finds himself in over his head more than once.The characters are well-developed and interesting, and it's easy to find a soft spot in one's heart for just about all of them -- even the villains, who see themselves as ultimately helping the world economy with their actions.Downs has left a cliff-hanger for his readers, with alternate endings available for view on his website so that readers may vote on them. The winning ending will be published in the final edition of this very entertaining novel.(Review based on unedited advance reader copy.)"}, {"userName": "Annette", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/1426170-annette", "userReview": "Another excellent entry in the Bug Man novels. As is standard for this series, the reader is never in any doubt as to \"whodunnit;\" our enjoyment is in seeing Nick figure it out. Two of the strongest female characters from the previous novels make appearances here, which I enjoyed. I also appreciated the plot, which centered on agro-terrorism, although frankly it was fell into the \"all too plausible\" category. Willful destruction of the entire US corn crop... frightening stuff! I am giving this one a mere three stars because I was a little annoyed by the gimmicky ending, after which the author requests his readers vote on two alternates on his website. I would have preferred the character make his mind up on his own. I also could not help but notice two minor continuity errors surrounding the character of Kathryn Guilford: this book stated that the fatal car accident of \"Shoo Fly Pie\" occurred when she was four (that book said she was seven), and that Guilford was her maiden name (it was her first husband's.) I am sure I'd read the book in question more recently than both its author and most readers since I just picked up the series a month ago, but still - sloppy work!"}, {"userName": "Catherine Leggitt", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/8062525-catherine-leggitt", "userReview": "Another great Tim Downs' book! I have one tiny beef--but if I mention, I'd be guilty of revealing too much--it'd be a spoiler. Suffice to say, this novel has a terrific tightly written plot with all the wit and informational tidbits I've grown to love in previous Bug Man books. I feel well-acquainted with Dr. Nick Polchak, entomologist, by this fifth episode. His skill at deducing the significance of insect activity is phenomenal. But without his a quirky personality, he'd be a tad boring. (The guy thinks he's an insect, for pity's sake!) He's torn between two women this time, a new and baffling condition for a loner with such poor relational skills. Which one will he choose? That kept me guessing while Polchak raced against the clock to apprehend the murderer and save the US economy in the bargain. An impossible task, you say? Read and see."}, {"userName": "JC", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/2244665-jc", "userReview": "A lot more forensic entomology going on here - not near as much as the first one. By far the funniest book in the series in my opinion. Nick finds himself between two women, Kathryn and Alena, as he must track down an agroterrorist plot. I found myself laughing out loud at how clueless Nick is. Seriously, the ending of the book was total Nick. I haven't read the 4th book in the series which is apparently where Alena is introduced (they don't have the book at either of the libraries here - but I have it bought and on the way). With the cliffhanger ending of who he is going to marry I figured I should read Less than Dead to learn more about Alena before reading Nick of Time (I have no clue who he chooses so that's not a spoiler in any way of the next book). The terrorist plot was a bit far fetched but still interesting."}, {"userName": "Eric", "userReviewDate": "Feb 15, 2012", "userURL": "http://www.goodreads.com/user/show/1127451-eric", "userReview": "# 5 in the Bug Man Series. Great stuff! I still haven't been disappointed and the main character, Nick, continues to have me howling with laughter.Nick Polchak must stop a terrorist from causing a global ecological nightmare.Two beautiful women from Nick's past are competing for his heart.He's not sure which impending disaster makes him more nervous.When forensic entomologist Nick Polchak is called to the scene of a murder on a small organic farm in North Carolina he is astonished to find that the victim's estranged wife is an old friend, a woman he once worked with-a woman he once had feelings for. When she asks Nick to investigate her husband's drug-related murder, Nick seeks the assistance of Alena Savard, the reclusive dog trainer known to the people of northern Virginia as the Witch of Endor."}, {"userName": "Evelyn", "userReviewDate": "Aug 06, 2009", "userURL": "http://www.goodreads.com/user/show/628974-evelyn", "userReview": "When an organic tomato farmer is murdered in his field, Dr. Nick Polchak's old friend Kathryn Guilford calls him to help investigate. Nick, in turn, calls in his friend dog trainer Alena Savard. Nick finds insect evidence leading him to discover an intricate plot by three foreign nationals to cripple the US corn production for making ethanol.And,to make matters worse, he's torn between investigating the murder and two old flames, each vying for his attention. Bug Man series number 5. Downs brings back major characters from previous books in this story. An interesting read and highly recommend the series."}, {"userName": "Sharon", "userReviewDate": "May 25, 2013", "userURL": "http://www.goodreads.com/user/show/17926626-sharon", "userReview": "I just love Tim Downs Bug man mysteries. They're well written, no gratuitous vulgar language, plenty of conspiracy theory, sci-fi, mystery ACTION, and the quirky characters who seem so real. The only down side of this one is that **SPOILER ALERT** there's some cattiness between Nick's 2 \"love interests\" that, I feel, is a little intense to be followed by almost too easy, instant, denouement. I also didn't particularly like the ending having to be gotten from the website. (No, not the ending for the mystery, I would have REALLY hated that, but the ending for which lady Nick is in love with.)All in all, can't wait for the next one to come into the library!"}, {"userName": "Elaine", "userReviewDate": "Feb 28, 2009", "userURL": "http://www.goodreads.com/user/show/1742519-elaine", "userReview": "Nick is flummoxed upon discovery of a certain insect species found in the yard of a friend whose husband was just murdered. There is much believability in the plot having to do with agroterrorism, and one could certainly see something like this happening. What makes this a particularly good narrative is the sense of humor given to the main character. He's not a wonderful-looking man. In fact he sports such thick-lensed eyeglasses that to some, he resembles the insects he works with. He's also socially and relationally inept, making him a bit more likable."}, {"userName": "Susie", "userReviewDate": "Apr 30, 2013", "userURL": "http://www.goodreads.com/user/show/7583484-susie", "userReview": "The follow-up to Less Than Dead and although I liked the plot & story, I really, really disliked the way Downs ended the book. A what if - what if I did not have a computer or were computer illiterate? Tim Downs - never pull that kind of stunt again! It was low down and said to me as a reader - I don't want to decide, you decide. But you are the writer, do your job. I may be put off forever, haven't decided. Oh, and leave Alena's dogs alone."}, {"userName": "Catherine Richmond", "userReviewDate": "May 25, 2010", "userURL": "http://www.goodreads.com/user/show/275437-catherine-richmond", "userReview": "If you thought Patricia Cornwell's Body Farm was the last word on forensic entomology, you'd be wrong. Ends of the Earth shows there's a lot more to say. Agriterrorism, organic farming, autistic children, and dog training add to the complexity of this story. Two minor problems: how does this professor grade his students if he calls them all Smith or Jones? And USAir flight attendants don't work the gate - that's the gate agent's job."}, {"userName": "Judy", "userReviewDate": "Jun 15, 2010", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "Whoever thought the Bug Man would ever fall in love, let alone have two women fighting over him? Well, that's what happens in between saving the US from an agroterrorist. I loved the finish and the reader gets a chance to vote on the next chapter at tim Downs website.The only reason I didn't give it 5 star was the writing seemed more rushed like he was trying to meet a deadline rather than giving it his very best effort."}, {"userName": "Susan", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/775066-susan", "userReview": "I picked this up because it was on a rack labeled \"Clean Reads\" and I was looking for something besides just romance. What a neat surprise. A college professor and forensic entomologist, the epitomy of the short-sighted, social goofy professor, gets called in to help set time of death in a murder. Funny, fun and boy did I learn things about bugs. Interesting ending."}, {"userName": "Mich", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/1173346-mich", "userReview": "ok so maybe a 4.5 but i like the bugman series a LOT.. trying to figure the little 'preachy' bits but it wasnt over the top-maybe enough to get it classified as christian lit- the end totally threw me and if u dont have access to a computer when u finish it.. well make sure you do!and i'm glad to know i agree with the majority on it!anxious for the NEXT bugman book! he is SUCH a nerd!"}, {"userName": "Eric Wright", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/4025401-eric-wright", "userReview": "Downs has developed quirky characters facing a very possible terrorist threat. The bug man is an entomologist who thinks and sleeps bugs to such an extent that he is socially inept in dealing with two women who are attracted to him. The plot about bugs, eggs, threats to food crops etc. plays out against the backdrop of these characters. I found it too wordy, repititious and enjoy."}, {"userName": "Hannah", "userReviewDate": "Jan 16, 2012", "userURL": "http://www.goodreads.com/user/show/7449805-hannah", "userReview": "Nick Polchak and Alena Savard are two of the central characters, so what's not to like? Good pacing, great characters, meticulous plot, and incredibly well-researched. And, of course, Nick's humor. The storyline is very believeable--so much so that it's almost frightening when one starts to think \"What if?\" Very, very enjoyable read. Two thumbs up."}, {"userName": "Rusty Fulling", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/53411565-rusty-fulling", "userReview": "March 2012 - Enjoyable book from Tim Downs dealing with terrorism through the nations food supply. Drugs, murder, and of course the main character, forensic entomologist Nick Polchak make this an exciting read.The author presents 2 seperate endings to the story in which you can find on his website timdowns.net"}, {"userName": "Connie", "userReviewDate": "Sep 09, 2011", "userURL": "http://www.goodreads.com/user/show/4906043-connie", "userReview": "The least favorite of my beloved bugman series....but I am happy that Nick has found love, but really? Downs has done him a complete injustice on how he did it. If you wondering what happened, you'll just have to read the series!!!! bwwaahhhahahahaha"}, {"userName": "Kim", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/16770723-kim", "userReview": "It was good....good story line and kept me guessing....but the end I had to go to a website to read 2 variations and pick from the one I liked.....didn't happen. I made up in my head what I wanted to happen and was done with the book!"}, {"userName": "Michelle Griep", "userReviewDate": "Jul 23, 2010", "userURL": "http://www.goodreads.com/user/show/1872642-michelle-griep", "userReview": "I cannot get enough of the bugman. I LOVE THIS GUY! Hero Nick Polchak is as snarky as ever, and the ending is a killer in more ways than one. I borrowed these books from a friend but I am going to have to go buy the set for myself, it's that good."}, {"userName": "Shelli", "userReviewDate": "May 19, 2011", "userURL": "http://www.goodreads.com/user/show/4935843-shelli", "userReview": "This is my second Bugman novel and I enjoyed it more than Shoofly Pie (Bugman #1). I just really like this Nick Polchak character and Tim Downs writes some of the wittiest dialogue I've ever read. Great book and I'm running out to get #6..."}, {"userName": "Shadowrider", "userReviewDate": "Mar 28, 2009", "userURL": "http://www.goodreads.com/user/show/1806297-shadowrider", "userReview": "Another great \"Bug Man\" book. There is more to Nick than we think, he is actually starting pupate and turning into something more like our species. The end was difficult, I would rather of not had to choose. I can hardly wait for the next book to come out."}], "description": "Nick must face the realities of lost opportunities and the passing of time as he struggles to protect a mother and her child from agro-terrorists in this latest novel from award-winning author Tim Downs. Dr. Nick Polchak is called to a farm community in eastern North Carolina to investigate a murder. The victim is the owner of a failing organic farm who had developed a drug problem, and the police think his murder is drug-related. Nick finds the remains of a bale of marijuana scattered in the tomato fields--but the South American marijuana seems to be strangely infested with a common North Carolina insect: the tobacco hornworm. To further confound the mystery, the bugs are infected with a fungus from Asia. Nick suspects the man wasn't killed because of the marijuana, but because of the insects it contained.", "title": "Ends of the Earth\n      \n          (Bug Man #5)", "url": "https://www.goodreads.com/book/show/6162313-ends-of-the-earth", "average": 4.28, "cover": "https://images.gr-assets.com/books/1440880479l/6162313.jpg", "reviews": 58, "authors": [{"url": "https://www.goodreads.com/author/show/14103.Tim_Downs", "name": "Tim Downs"}], "type": ["Christian Fiction", "Mystery", "Fiction", "Suspense", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/6162313-ends-of-the-earth", "http://www.goodreads.com/book/show/27009.Shoofly_Pie", "http://www.goodreads.com/book/show/2241845.First_the_Dead", "http://www.goodreads.com/book/show/441854.Plague_Maker", "http://www.goodreads.com/book/show/27006.Chop_Shop", "http://www.goodreads.com/book/show/3746580-less-than-dead", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}