{"ratings": 293, "userreviews": [{"userName": "Margarida", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/15858613-margarida", "userReview": "É divertido, esboça caricaturas tão características do nosso país, o chico-esperto, o intelectual só porque lê o 'Público', a fundação de não sei o quê, o mamarracho na cidade, a jornalista fura-vidas e intrujona, os funcionários que não fazem nada, tirando leituras de tarot, a pequenez de pensamento, as frases feitas e o Partido e os seus rituais.O narrador omnipresente, saltando de situação em situação, apresenta os bonecos com um travo irónico. Uma leitura leve de um livro com 20 anos."}, {"userName": "Rosa Ramôa", "userReviewDate": "Sep 02, 2014", "userURL": "http://www.goodreads.com/user/show/30090933-rosa-ram-a", "userReview": "O mundo velho e o mundo novo..."}, {"userName": "L.C. Lavado", "userReviewDate": "May 04, 2010", "userURL": "http://www.goodreads.com/user/show/3521774-l-c-lavado", "userReview": "Primeiro livro que leio do autor e sem dúvida que se tornou num dos meus escritores Portugueses preferidos."}, {"userName": "Henrique Vogado", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/2457436-henrique-vogado", "userReview": "Um livro muito engraçado que se lê muito bem. Situações com muito humor e capacidade de rir com alguns detalhes do PCP e dos seus apoiantes. Acho que termina um pouco depressa, como se o autor já não tivesse mais ideias para colocar, como se quisesse passar a outro assunto e deixasse o livro como um devaneio no meio de outras obras.Gostei da habilidade com que joga com o texto, como se diverte com o uso de algumas palavras. Recomendo para leitura a seguir a uma obra mais \"pesada\". Descontrai."}, {"userName": "Pequete", "userReviewDate": "Jul 13, 2008", "userURL": "http://www.goodreads.com/user/show/1192324-pequete", "userReview": "A primeira meia dúzia de páginas, achei-as irritantes, como, aliás, já tinha sido prevenida na contra-capa: \"Advertência: Este livro contém particularidades irritantes para os mais acostumados. Ainda mais para os menos.\" Mas depois entrei na \"onda\" e passei a achar o livro muito divertido (e crítico e cáustico ao mesmo tempo). Muito bom. Tenho-o levado comigo para todo o lado, para aproveitar todos os minutos em que possa ler, nem que seja meia página, e terminei-o agora mesmo."}, {"userName": "Jota-p", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/1196222-jota-p", "userReview": "Este foi o segundo livro que li de Mário de Carvalho.Desengane-se aquele que acredita nas palavras do autor quando afirma que quer que este livro seja \"mui sisudo e composto\" (pág.88). Antes pelo contrário, de sisudo muito pouco tem. Dei comigo a dar valentes gargalhadas, comedidas, porém, porque me encontrava em locais públicos quando lia esta prosa bem-disposta. Algumas passagens são verdadeiramente cómicas. Destaco aquela em que Eduarda não sabe o que significa 'hediondo' e 'pejorativo' (pág.116 e seguinte) - mais hilariante é difícil.De resto, também me surpreendeu esta maneira inovadora de narrar uma história em que, o narrador, sabe tudo o que acontece e dá a entender que pode intervir a qualquer momento na narrativa, porém, abstám-se de o fazer. Só lendo o livro é que se percebe o que quero dizer... Além disso, está constantemente a fazer considerações engraçadas. Enfim, não sei o que mais dizer a não ser apenas que recomendo que leiam o livro para conseguirem perceber a que me refiro."}, {"userName": "Mady", "userReviewDate": "Oct 27, 2010", "userURL": "http://www.goodreads.com/user/show/1154662-mady", "userReview": "Another one from my project to read more in Portuguese and from Portuguese writers. This is turning out to be very successful! :)Here is a portrait of contemporary Lisbon and Portugal (well, almost contemporary... on this novel mobile phones aren't as indispensable as they are nowadays), where we can meet some public servants, listen to political discussions and above all, \"live in Lisbon\" (whatever this means :P).This is all possible as we get introduced to Jorge, who is getting bored with his life and wishful of the feeling of belonging. So he decides to become a member of the Communist Party, but it turns out not to be as easy as it seemed.Mário de Carvalho is a Portuguese writer that I'll surely read more from (some time ago I'd read another good one from him: \"Casos do Beco das Sardinheiras\")! He likes to digress, and I like to read his digressions! He takes care with his words and I like to expand my vocabulary! :)Another read-along with Flor and borrowed & suggested by Hirondelle :)"}, {"userName": "Florbela", "userReviewDate": "Jun 02, 2008", "userURL": "http://www.goodreads.com/user/show/1101917-florbela", "userReview": "O único livro que tinha lido deste autor era Os Casos do Beco das Sardinheiras, de que gostei muito. Agora, novamente recomendado pela minha amiga Hirondelle, leio este pequeno romance ficcional que é de chorar a rir.Confesso que no início não estava a achar grande piada, mas passadas umas dez páginas comecei a divertir-me imenso. É uma escrita muito bem-humorada e a história, apesar de ter sido publicada há mais de dez anos, aplica-se perfeitamente aos dias de hoje.A história central gira à volta de uma personagem cinquentona que é \"despromovida\" da sua função burocrata na empresa. Decide então mudar de vida e a forma que encontra de se rebelar é inscrevendo-se no Partido Comunista..."}, {"userName": "Sinesio", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/17523366-sinesio", "userReview": "Delicioso romance, que, com humor e simpáticos exercícios de estilo, trata de tema frequente na literatura: a mudança de valores e seus reflexos sobre aqueles que vêem suas crenças e utopias superadas pela história. Diante de um mundo novo, que as gerações mais velhas relutam em entender e em aceitar, restam-lhes poucas opções: consumir-se em dúvidas, aferrar-se a velhos comportamentos rituais que perderam seu conteúdo e sua própria razão de ser ou buscar novas/velhas alternativas na condução de suas vidas. Entre essas opções, transitam os personagens do romance, cujo estilo torna seu ambiente cinzento um universo cheio de graça e nostalgia."}, {"userName": "Carla Ramalho", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/42907030-carla-ramalho", "userReview": "É o primeiro livro que leio deste autor. E não correspondeu às expectativas. Claro que escreve bem, muitos recursos, domínio perfeito da linguagem, mas não me passou qualquer sentimento. Não estabeleci qualquer ligação com as personagens, com a trama e penso que a linguagem rebuscada (arrisco-me a dizer um pouco pretensiosa) não ajudou nada.:("}, {"userName": "Fernando César", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/30707093-fernando-c-sar", "userReview": "A história desiludiu, mas a escrita irónica e sarcástica, sempre diminuindo as próprias personagens, a interação do narrador com o leitor (já vamos na página 16, depois falo disto, etc.) tornam a leitura bastante interessante."}, {"userName": "Sandra Neves", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/15908900-sandra-neves", "userReview": "Fiquei francamente desiludida. Mas quando a expectativa é muito elevada, costuma ser assim. Não percebi a motivação subjacente à obra. A linguagem, essa, mantém-se rica e elaborada."}, {"userName": "José Machado", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/19256565-jos-machado", "userReview": "Um romance muito bem construído, um dos melhores em língua portuguesa acerca do período romano."}, {"userName": "Sofia", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/7335795-sofia", "userReview": "Gostei muito do estilo de escrita de Mário de Carvalho. Deu vontade de ler mais. Alguém aconselha?"}], "description": "", "title": "Era Bom Que Trocássemos Umas Ideias Sobre O Assunto", "url": "https://www.goodreads.com/book/show/1871903.Era_Bom_Que_Troc_ssemos_Umas_Ideias_Sobre_O_Assunto", "average": 3.78, "cover": "https://images.gr-assets.com/books/1212412266l/1871903.jpg", "reviews": 15, "authors": [{"url": "https://www.goodreads.com/author/show/546023.M_rio_de_Carvalho", "name": "Mário de Carvalho"}], "type": ["Fiction", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/1871903.Era_Bom_Que_Troc_ssemos_Umas_Ideias_Sobre_O_Assunto", "http://www.goodreads.com/book/show/3924935-era-bom-que-troc-ssemos-umas-ideias-sobre-o-assunto", "http://www.goodreads.com/book/show/3474612-a-inaudita-guerra-da-avenida-gago-coutinho", "http://www.goodreads.com/book/show/1106621.A_God_Strolling_in_the_Cool_of_the_Evening", "http://www.goodreads.com/book/show/23503149-quem-disser-o-contr-rio-porque-tem-raz-o", "http://www.goodreads.com/book/show/9484779-fantasia-para-dois-coron-is-e-uma-piscina", "http://www.goodreads.com/book/show/9554918-casos-do-beco-das-sardinheiras"]}