{"ratings": 1613, "userreviews": [{"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "I'm usually that person that wants every animal I see. I've finally found one that there is not enough cuteness in the world for me to want.She was cute...at first.\nfree photo web hostingBut then she started growing...\nfree photo web hostingAnd kept growing...\nfree photo web hostingAnd the messes. My OCD just couldn't allow me to enjoy reading about the massive pee and poop stories. Along with the huge oil spill..or eating the stove door. Nope. Nope. Nope.Then the preachy vegan stuff? More nope. Then to ice that big old stinky cake...the owner Steve Jenkins? I really didn't connect with him at all. I liked his partner Derek, but not enough to redeem this one. (I'm so sorry piggie lovers)Booksource: I received a copy of this book from the lovely Jen...I hate that I didn't like it more but she didn't really either so it's all good."}, {"userName": "Bark", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "This review and the rest of the crap I write can be seen @ my blog  Bark's Book Nonsense . Stop by and say hey.I received this book as an ARC from Netgalley after seeing it on Yodamom's shelf. Thanks Yodamom!Esther is a 600+ pound pig who is internet famous. She has more followers than most people. If you google “Esther the pig” you’ll find her everywhere. This is the story of how it all happened.Steve is a sweet young guy, living with his partner Derek, two dogs and two kitties in a 1,000 sf apartment. Pretty normal, right? He loves all creatures, always has, so when an old friend he hasn’t heard a peep from in 10 years gives him a ring, begging him to provide a home for her “micro-pig”, he agrees to meet her. He, of course, ends up going home with the cute little piggie - without consulting his partner. And my husband thought he had it bad when a kitten suddenly appeared in our bathroom one night. Being sneaky NEVER pays off because that evil cat loves him and only him and I guess it serves me right.\nAs Derek and Steve are adjusting to life with a pig in an apartment where livestock is not allowed, they both come to the realization that Steve’s long-lost “friend” is a big, lousy liar. The cute little piggie they name Esther grows and grows and grows. \nBut she has a name and a personality and she has become a part of the family. \n\nUh oh! Now, what are they going to do?!The book documents the quirks and events that happen when one lives with a full grown pig. Things are broken, food is snatched and rivers of pee are unleashed but somehow they stay strong and make it work. Derek and Steve’s eyes are opened to the horrors of factory farming and realize they can no longer eat bacon without seeing Esther’s face.\nIt’s sweet and warm and funny and never gets preachy. There are even a few vegan recipes at the end for anyone interested in trying it out. If you want a feel good, true story with a happy ending this is a good one. 4 1/2 StarsCome visit my blog and say \"hey\" at  Barks Book Nonsense."}, {"userName": "Yodamom", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/2905141-yodamom", "userReview": "4.5Rule: Never trust someone who tells you it is a Mini Pig.It was not a bad thing that Esther turned out to be a full size 600 pound pig. She was just about 550 pounds more than expected. She was a handful and they learned the hard way/hilarious many times. Their laughter, tears and frustrations during their growth and learning of how to be adopted pig parents was a beautiful and sometimes heartbreaking thing to watch. Derek and Steve are two amazing men, with huge open hearts, and they give it their all to make the world a little better.An excellent story about love, patience and adjusting to change. Animal rescue is a major issue for obvious reasons."}, {"userName": "Terri", "userReviewDate": "Apr 20, 2016", "userURL": "http://www.goodreads.com/user/show/8191611-terri", "userReview": "I have been quite a fan of Esther's so I was excited to read this book. This is a wonderfully uplifting book. I laughed and cried . Being a vegan myself I have been amazed at how Esther , Steve and Derek have been able to change people's minds about eating meat without being preachy or militant. From the start of the story as to how Esther was acquired and through her antics and adventures you will fall in love with Derek and Steve and especially Esther."}, {"userName": "Book Haunt", "userReviewDate": "Apr 11, 2016", "userURL": "http://www.goodreads.com/user/show/31740569-book-haunt", "userReview": "So one day, an ex-girlfriend of Steve’s calls up and offers him a pot-belly pig. He knows that his partner, Derek will freak out if he brings another animal home without talking about it first, but Steve just can’t resist. Come on, all you animal lovers out there does this sound even a little bit familiar? I know it does to me. My loved ones have just quit fighting it.Esther is no bigger than a teacup when Steve brings her home and she quickly wins Derek’s heart. What both Derek and Steve don’t anticipate is that little Esther grows up to be a 650 pound pig. In their little 1000 square foot home, this proves to be quite a trial of errors. Steve and Derek don’t give up easily though. The love they both have for Esther allows them to conquer each problem they face along the way. In the process, they even become vegans. Nowadays, Steve and Derek and Esther live on a farm. They have become the successful founders of Happily Ever Esther Farm Sanctuary for farm animals in need. They did so with a lot of faith and donations from fans and followers of Esther’s on Facebook. Steve and Derek are performing daily miracles for these animals and they are doing so with loads of love in their hearts. Esther truly is the “Wonder Pig.”Oh my, what a wonderful book this is! This book is a must-read for animal lovers everywhere! Esther, I would love to meet you some day!Once you have read about Esther, you’ll want to check out the website and Facebook links below:WebsitesEsther the Wonder PigHappily Ever Esther Farm SanctuaryFacebook LinksEsther the Wonder PigHappily Ever Esther Farm SanctuaryEsther’s ArmyEsther’s KitchenI want to thank the publisher (Grand Central Publishing) for providing me with the ARC through NetGalley for an honest review."}, {"userName": "Jen ", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/4983837-jen", "userReview": "My thanks to NetGalley and Grand Central Publishing for an eARC copy of this book to read and review.The danger with writing a memoir is that you have the opportunity to show the world what a huge, self-centered immature jerk you are. That's why I will NEVER write memoirs. I may come across as all of the above on occasion, but why confirm it?This book falls into that trap. I'm not saying that the author IS all of the above, just that he comes across that way in this book.He seemed to live by the motto, \"It's better to ask forgiveness than permission,\", because he was CONSTANTLY doing things behind his significant other's back that he KNEW he shouldn't be doing because they had discussed that thing not a few months prior!! That just shows a lack of respect for the other person and immaturity on his part that made me ragey. How can you claim to love someone if you don't respect them enough to tell them you want to adopt another pet? So that got me rather annoyed and angry. Add to that the fact that this was basically the \"soft sell\" to get meat eaters to turn into vegans, and the book lost me.If ALL animal lives matter, then I have to ask the vegans, before the fields were plowed, tilled, etc., were ALL of the small animals scared off of the land before the land was brutalized by machines? Dozens to hundreds of small mammals, reptiles, amphibians, birds and insects all die when plant matter is harvested. So how do those hundreds of lives balance with the life of one cow/pig/chicken? Don't even get me STARTED on the fact that agriculture is not sustainable, nor an eco-friendly way to grow calories for human consumption. Grass-fed, free-range food on the hoof and claw, when rotated properly, is actually better for the ecology of the area, the animals being raised and the humans who end up eating them. The animals raised in a non-factory farm environment have only one bad day, the last one. I agree, factory farms are HORRIBLE and need to be stopped, but it's not bad to eat animals, that's kind of how we developed for hundreds of thousands of years. We just need to care for and raise the animals we use for food better than we are now. Yes, I get the link, Esther is a pig and pigs are food and eating a pig is like eating Esther. It's a personal preference. I don't like bacon (shocker, I know) and I feel badly eating pigs, because they ARE very intelligent and are so closely biologically related to humans, that we can use their insulin for diabetes and their hearts for valve replacements and their bodies are used to test decomp in different environments to help CSI people train, so I don't like eating pig for those reasons, but I do eat other animals.I have to wonder, would this even be an issue if they were raising a cow as a pet? Maybe, maybe not. Pigs are a sight more intelligent, so not sure if that would have been turned into a book and a FaceBook page if a cow was the star. So this book was not for me. It hit a couple of my hot button issues, non-positive narrator and pushing veganism. I was a vegetarian for a good 10 years and a vegan for one of them. I was on that side of things for moral reasons and for health. Neither ended up standing up to scrutiny, at least when I got older. Not saying to not be a vegan, that's a personal choice. If you want to do that, more power to you. Just be mindful of sustainability and other animal lives too. Two stars, because I was expecting a cute book and got a vegan screed, and many non-funny stories of how Steve lied to Derek constantly and of Esther urinating everywhere indoors. Just my opinion, more people liked than disliked this book, so I probably read it wrong."}, {"userName": "Ann Marie (Lit·Wit·Wine·Dine)", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/7447086-ann-marie-lit-wit-wine-dine", "userReview": "Loved this book! Please check out my review on my blog . (I'm being lazy because I would have to do some reformatting for GR. I hope you'll humor me this one time.)"}, {"userName": "Leisha Ferguson", "userReviewDate": "May 26, 2016", "userURL": "http://www.goodreads.com/user/show/37552700-leisha-ferguson", "userReview": "Esther is such a beautiful soul. Her huge personality, innocent smile and obvious unconditional love are just a few things that make so many people fall for her. Reading about how the \"mini\" pig came to be adopted by Steve and Derek was incredibly cool, especially when I realized how many things fell into place once they decided to keep her. I was laughing one second, tearing up the next, and it definitely got me thinking about living an \"Esther Approved\" lifestyle. I will continue to follow Esther's journey and cannot wait to see the changes these lovely fellows bring to the animal world. ❤️"}, {"userName": "Samantha", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/21856003-samantha", "userReview": "this was written by someone else, so I'm not sure how much of the actual personality of steve jenkins she captured and how much was just her \"humor\" (\"we went straight to the farm. we did not pass go. we did not collect $200\"). it was amusing enough as a light read giving a little more background than you might have picked up on social media. basically, a guy with no impulse control or respect for his partner's wishes gets a \"mini\" pig that grows to be 650 pounds and causes them to go vegan, move to a farm, and start an animal sanctuary. so, yay. I found it interesting that much of the book discusses pig urine, but pig poop is never once mentioned. also, the pig is prone to making HUGE messes that steve then cleans up within an hour or two. I don't know how you get vegetable oil off every surface of your home in an hour. or actually ever clean up - to the point of being able to sell your house - a home so saturated in pig urine your eyes water when you walk in. there is a lot of time spent talking about how amazing esther is, but few anecdotes as to why. could have used a few more stories."}, {"userName": "Linda", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/21889692-linda", "userReview": "I started to follow Esther on Facebook, and dreamed about having my own Esther! I have been quite a fan of Esther's, so I was excited to buy and read this book. And I was not disappointed! I laughed out loud so many times while reading it! This is an important book because due to Esther's popularity and unscrupulous people selling \"mini\" or \"teacup\" pigs! NEVER believe someone who tells you it that you are buying a Mini Pig. That is what Esther's dads were told and led to believe that she wouldn't grow much over 70 pounds! Esther is now a 600+ pound porcine pink princess, who is now internet famous. She has more followers than most celebrities just on Facebook alone. She also has thousands more followers on Twitter and Instagram! After her dads fell in love with her, they discovered that she was a commercial farm pig and would eventually weigh 600 pounds or more. Derek and Steve are two amazing men, with huge open hearts, and they give it their all to make the world a little better for animals. Esther's dads do not sugarcoat any of Esther's stories. Steve gives the readers all the disgusting and hilarious details of raising Esther, while trying to outsmart her and \"Esther\" proofing their home. This is an excellent book about love, patience and adjusting to change. Through the Easter effect, animal rescue became part of their lives, bringing them to buy a farmhouse to give more rescue animals a forever home! Steve and Derek also write about their reasons for becoming Vegan without it being preachy or harsh sounding. Too them it was the right decision and one that they are happy to share in a positive way! Also in the book ‘Esther approved’ is a couple of recipes at the back!Thank you Steve and Derek for sharing Esther with us!"}, {"userName": "Jennifer", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "I love Esther the wonder pig. I've been following her facebook page for a long time. It was great to get further back story about how she came into her dads lives. I listened to the audio narrated by her dad Steve. He did a great job telling his story. I want a pig so bad. But as you learn from the book they are a ton of work and get into all kinds of trouble. Was dying laughing at some parts such as when Esther spills oil all over the house and then gets on their bed covered in it. I also got teary eyed as her dad explained falling in love with a pig and changing their diet and their whole lives to fit her in. Beautiful story. Be sure to follow her facebook page for adorable pictures and updates of Queen Esther. https://www.facebook.com/estherthewon..."}, {"userName": "Pamela", "userReviewDate": "Apr 20, 2016", "userURL": "http://www.goodreads.com/user/show/5927588-pamela", "userReview": "I've followed Esther the Wonder Pig on social media for a while now. It's amazing how quickly my partner Owen and I became invested in her life, and by extension, the lives of Steve and Derek, the men who adopted her.Reading about their journey raising Esther was an absolute joy. I also think it was an important book because due to Esther's popularity I think a lot of people have started to fantasize about the idea of owning their own pigs.  Esther The Wonder Pig doesn't glorify pig ownership. In fact, Steve as the narrator gives all the disgusting, grimy cringing little details of raising Esther mixed in with the stories of love and friendship. It was a great mix that I really felt captured Esther's unique personality and extreme intelligence, while also outlining the hard (but rewarding) work that owning a 400 pound pig truly is.My only criticism of Esther the Wonder Pig is that sometimes the prose felt a little forced. The voice of the narrative just didn't feel believable or convincing, and some of the humour was a little too on the nose. The bits that were truly funny and delightful were the straight up anecdotes about Esther, but when Steve and Derek's private lives entered in to it, the humour wasn't quite as natural. It didn't make the book bad, it just made it seem a little less polished than I would ordinarily have liked it to be. But the anecdotes managed to completely override that small criticism to ensure that this was still absolutely delightful to read.It was fantastic to read about how Esther, Steve and Derek got to where they are along with their extended menagerie of furry friends. I loved that they spoke about how Esther changed their lives completely for the better, as she's done for so many of us. I also really loved their refreshing approach to talking about the ethical reasons for Veganism without it being preachy and aggressive. I wish more people could talk about it that way. In this book Esther feels like a person, and it's hard not to relate to and fall in love with her delightful antics. Steve and Derek have done a wonderful thing with their farm sanctuary, and the more people who read this book and find sympathy for our fellow living creatures the better. It was an easy read, and one that I would recommend to absolutely everyone.http://iblamewizards.com/review-esthe..."}, {"userName": "Enchantress  debbicat ☮", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/12436728-enchantress-debbicat", "userReview": "Wow! Funny and So inspiring! Review to follow."}, {"userName": "Rachel V.", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/11832296-rachel-v", "userReview": "I've been a fan of Esther for a long time since I just accidentally found her one day on Facebook and fell in love with her beautiful face and the side eye look that she gives. Any Esther fan is going to love this book. If you're not a fan yet you will soon become one after reading it. It tells the story of partners Steve and Derrick taking in what they thought was a micro pig to an already over full house only to discover, after they fell in love with her, that she was a commercial farm pig and would eventually weigh 600 pounds or more. As more of a joke they start a Facebook page for Esther and in just a few days she has thousands of followers and getting more every day. They realize how popular Esther is and that she is loved around the world. Esther eventually inspires them to become vegan and open a santuary, Happily Ever Esther Farm Santuary in Canada so they can take care of more animals in need like Esther. If you're like me and you've been \"following\" Esther since before she moved to the farm you'll love getting a behind the scenes look at their lives, how they found the farm, and that nerve wracking journey in the back of that trailer when they moved her from the house to the farm. What they were thinking and feeling when the trailer doors opened and Esther walked down the ramp and then ran for joy along side of Shelby, her doggie best friend, in the open field. I cried tears of joy when I watched it on facebook and I cried tears of joy when I read about it in the book. Such a great story of a Wonder Pig who continues to inspire people all over the world to be kind, and about the two wonderful men who love her and continue to give her, and others like her love and a safe and happy sanctuary."}, {"userName": "Emily", "userReviewDate": "Jul 04, 2016", "userURL": "http://www.goodreads.com/user/show/2014643-emily", "userReview": "I found myself to be reading a book which ultimately rejects farming, and I became much less interested in it once that became clear. And the writing style was not my cup of tea. It didn't seem written, so much as transcripted gab sessions between the pet owners and their co-writer.What got me to pick this up was to learn about a farm sanctuary. Disappointingly for me, the narrative ended when they moved to the farmhouse; this was only the story of how they came to be there.As they describe their transition from meat-eating pet lovers to vegan animal advocates, they see veganism as the logical result of caring about animals. I can understand where they're coming from, but I don't agree with the inevitability of that conclusion. I believe it is possible to respect life, yet participate in agriculture as a farmer (of meat animals) or as a consumer (of meat). I do feel that current U.S. farming practices are frequently inhumane and should be improved, but I don't feel that humans must avoid all meat consumption and all use of all animal products to be humane."}, {"userName": "Alicia Maclean", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/16565126-alicia-maclean", "userReview": "Even though I already knew much of this story, I found myself both laughing and crying more than I ever have from a book. It's a quick read, and feels like you're reading a long email from a friend. At times the tone was a little too casual, but overall I very much enjoyed this and would recommend to anyone. It definitely parallels the thoughts/actions we all have through major life events, including the second-guessing of ourselves and throwing caution to the wind when you just know, in your gut, despite reason, you're doing the right thing. This is an amazing and inspiring (and beyond unconventional) family whom everyone will love."}, {"userName": "Mary Lou", "userReviewDate": "Jun 02, 2016", "userURL": "http://www.goodreads.com/user/show/7098587-mary-lou", "userReview": "The pig is entertaining. The guys are likable. The story is hard to believe. The book is okay. It's a quick read that gives fans of Esther's Facebook page her history with Steve and Derek. Some heartbreaking moments and, frankly, some gross moments. I give props to the guys for choosing to soft pedal their message which, in my experience, is a much more effective way to win people over than nagging and berating them. PS This book isn't really appropriate for kids, even though it's an easy book to read. Perhaps Steve and Derek's next projects should be juvenile and picture books featuring Esther for the kids."}, {"userName": "Vicky", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/7601385-vicky", "userReview": "As an animal lover and retired pet groomer, this book spoke directly to me. What a wonderful story. What amazing people. And Esther......the wonder pig. I loved reading their story and how they all became a family. I am enlightened, motivated and ready to do more to help animals. This is a must read!"}, {"userName": "Keep Calm Novel On", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/29575773-keep-calm-novel-on", "userReview": "An absolutely delightful read. A touching love story. Will be enjoyed by all. Thank you Steve, Derek and Esther for sharing."}, {"userName": "Cheryl", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "I am familiar with Esther. I have seen pictures of her on her Facebook page. Yet, I have not been a follower of her's since the beginning. So, it was a treat to get to see how it all began. I have raised chickens and turkeys; yet I can't imagine raising a full commercial size pig. I had to laugh when Steve accepted Esther and was thinking of ways to ease Derek into the idea. When I was younger, my mom, sister, and I were at a craft fair. As we left, there in the parking lot was a guy selling black Labrador puppies. The biggest one came wobbling over to us and of course we had to take the puppy home. When we got home, my mom told my sister and I to wait in the car with our new puppy while my mom went to tell my dad. My dad was not keen on the idea but in the end, he end we kept the puppy and he even named her. Pepper. They had a bit of a love/hate (more like battle of the minds) relationship but they were really close to each other. Instantly, I fell in love with Esther. She is a queen. Yet, Esther may be the star of this book but it would not have been if not for Steve and Derek. Additionally, I fell in love with them as well. They are like ying and yang. So happy that Esther has found her \"forever\" home. Animal lovers will be tickled pink with this book."}, {"userName": "Emmkay", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/7135572-emmkay", "userReview": "Just the (very) light read I needed at the moment. A short, chatty tale of how the author and his partner adopted what they thought would be a mini-pig but which turned out to be a (currently 650 pound) commercial pig, became vegans, and started a sanctuary. It's not especially well-written or deep - their animal rights research seems to have involved watching a few Netflix documentaries, but I suppose that's already more research than the author put in before coming home with a pig! But it seems heartfelt, I mostly enjoyed reading it after a rough day, and I'd certainly be interested in visiting the sanctuary. 2.5."}, {"userName": "Adam Pluszka", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/63414679-adam-pluszka", "userReview": "Bardzo miła, pozytywnie nastrajająca historia wielkiej miłości oraz tego, jak ta ponaddwustukilogramowa miłość zmieniła życie nie tylko autorów - dziś prowadzą azyl dla zwierząt źle potraktowanych przez los (w sensie przez człowieka): \"Do tej pory znalazły u nas schronienie czterdzieści dwa zwierzaki: cztery króliki, pięć kóz, dziewięć owiec, dziesięć świń (nie liczymy Esther), koń, osioł, trzy krowy, pięć kur, trzy koguty i paw\" - ale i innych ludzi, którzy przez wzgląd na Esther postanowili zmienić swoją dietę. Czyta się migusiem, nie zwraca się uwagi na częsty płacz i inne afekty, często się śmieje. I bardzo fajny przekład."}, {"userName": "Dawn Critchfield", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/2868502-dawn-critchfield", "userReview": "Such a sweet book!"}, {"userName": "Iris", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/69053090-iris", "userReview": "Dit boek vond ik echt fantastisch. Ultiem feel good verhaal, regelmatig hardop moeten lachen!"}, {"userName": "Cori", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/2845034-cori", "userReview": "I love this pig! And I love her story."}, {"userName": "Peacegal", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/3078602-peacegal", "userReview": "Like Esther the Wonder Pig’s social media accounts and Esther herself, this book is an absolute delight. It’s funny, sassy, emotional and gently educational, and should be read by everyone. Steve and Derek were already well-schooled in caring for pets of the traditional variety—they shared their small Canadian home with two dogs and two cats. However, when Steve impulsively takes up a Facebook friend’s offer to rescue a “mini pig,” their lives take a cataclysmic shift. As the tiny piglet grows—and GROWS—she gives her new dads a crash course in the challenges of living with a house hog. And it steadily becomes apparent that Esther is no mini-pig at all, but a commercial farm pig who would eventually tip the scales at 600 pounds!As Esther charms her way through life while simultaneously destroying many household objects, it isn’t long before she nudges her dads’ lives in a different direction. One night, Derek is frying bacon for dinner when both men are hit with their “road to Damascus” moment. They simultaneously agree that they just couldn’t do this anymore, not with their sweet Esther lolling innocently at their feet. I always thought I was a huge animal lover. But suddenly I felt very mislead. I was angry about what we’d been told, how we’d been made to believe “they’re just farm animals.” I guess the information had always been there if we’d wanted to go looking for it. But we hadn’t. …The more time we spent with Esther and watched her character come to life, the more we realized that this whole “they’re just farm animals” notion was bullshit. She had every ounce of character and personality you’d find in any dog. There was so much more to her than I could’ve imagined…If she’s this smart, we figured, every pig is.Derek and Steve were not vegetarian going into their Esther adventure, and the readers follow as they slowly make changes—pork is off the menu first, or course—until they are both vegan. (Or, as they prefer to say, eating an “Esther-approved” diet.) Steve writes,I was feeling like a proud papa watching her reach these milestones of using her litterbox and playing with toys, developing her larger-than-life personality, and then I’d be in the meat aisle in the grocery store, feeling physically ill because suddenly everything in there had a face. I couldn’t see a steak or a slab of bacon as nothing more than a product anymore.Indeed, as I read about this creature whose multi-step plots to steal food put the hungriest hounds to shame, I couldn’t help but think that she is the exact type of animal whom factory farmers tell us are “perfectly engineered for the commercial farm environment” and “don’t really want or need to be able to turn around anyway.” One is the same as the next, we’re told, and they’re just objects—production units. They certainly don’t feel emotions or have personal preferences. Indeed, Esther’s tail had already been chopped off in preparation for her intended life as one such production unit.Where would Esther be if not here with us? In a gestation crate. … How do I know that pack of bacon in the store isn’t a member of Esther’s family? As far as I know, that could be her sister’s litter. … Pigs with intelligence and personality and affection and love—just like Esther. And just as Esther changed her caretakers’ values, she’s changing the lives of thousands more on her wildly popular social media pages. Steve and Derek have struck just the right tone. Their Facebook and Twitter accounts, just like this book, are full of smiles and laughter, not doom and gloom. They don’t put down and shame people who aren’t vegetarian or vegan. Instead, they invite people into Esther’s world and gently nudge them into thinking differently. We were getting a bunch of emails from non-vegan people who were telling us how much we’d opened their eyes about pigs. … [W]e focused on kindness and humor and pulling heartstrings as opposed to harsh words and upsetting imagery, which I think is why the Esther movement is as successful as it is. The Esther movement appeals to non-vegans in that it’s all very approachable, nonconfrontational, and open, but it builds a connection to people. And we’re finding that non-vegans love it because it opens their eyes and makes them think about things. Yet it still appeals to animal activists because we are a bright spot in an otherwise very sad and upsetting movement. … Esther was the morale boost they really needed. Esther’s outsize personality and sassy expressions have won over the Internet, and her legions of fans have helped Steve and Derek realize their dream of buying property in the country and building a sanctuary to welcome other rescued farm animals. Every amazing and wonderful thing that happened to us was because of an animal that most people don’t think of as more than a barcode in a grocery store."}, {"userName": "Lola", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/5888365-lola", "userReview": "A few months or so ago my boyfriend and I had a conversation, I can't even remember what it was about or how we came to the topic of pigs, but I remembered seeing a story about two men who adopted a pig and we somehow landed on the facebook page of Esther the Wonder Pig. It quickly became one of my favourite facebook pages to follow and every day I am looking forward to seeing Esther her adorable pictures show up on my timeline. She is so adorable and has so much personality and it's fun to see the pictures and videos of her and her family.Eventually I heard about the book and my boyfriend bought a copy for me. This book is about Steve and Derek their journey and how their lives changes from the moment they met Esther. I really enjoyed reading this book. I don't read a lot of non-fiction books, but I am glad I read this one. Esther the Wonderpig is a heartwarming and uplifting story that shows the power of kindness and how a pig can change lives. It's inspiring to read about how Esther changed their lives and how many hearts she touched, simply by existing and by having given a chance to live by Steve and Derek.There are some difficult times they go through, some sad and more happy scenes. Chapters where Esther makes a mess of the house or something without intending too ofcourse and those type of stories always remind me of the pet rats we used to have and how sometimes they could cause trouble without intending to, like peeing on unfortunate places. Which Esther does as well, but Esther is a pig and a lot larger than most pets. It's interesting to read about how they deal with now having Esther in the house and how they have to adjust things, like placing things out of reach and taping things shut because Esther would be able to open them else.The book tells how they got Esther, but also their thought processes behind some things, the struggles they went through and how they eventually got the Happily Ever Esther farm. The book is humorously written, even though there are some sad scenes the overall tone is humorous and uplifting. There were some moments where I laughed out loud or had to stop reading and read a part aloud to my boyfriend. I think it's awesome how these two decided to take in a pig and fell in love with her and how she in turn changed their lives. It's quite impressive to see what an impact Esther has had on their lives. There are some mentions of how they became vegan and in the end of the book are some vegan recipes, but the tone is never preachy. It just tells their story and their experience. In the middle of the book are a few pages with pictures from Esther, which were fun to see. And every chapter starts with a small adorable pig under the chapter heading.I just had wished this book would've been even longer, I would've liked to read more about their daily lives, more funny stories and stories that gave us a feel for Esther their personality. But this book is quite linear and it tells the story of how they got Esther, some big hurdles they had to overcome, how the facebook page started, the fundraiser, how their lives changed till the moment they arrived at their new farm. I really enjoyed reading this story and I had a lot of fun reading the book. It was just as engaging as fiction books and I just wanted to keep reading. Even knowing how things would end it was still exciting to see it all play out. And I visualized how everything looked in my mind, just as I would do with fiction books. To summarize: Esther the Wonder Pig is a great heartwarming and uplifting story. It makes you believe in the power of kindness and shows how two people their lives changed because of the addition of a pet pig named Esther. I really enjoyed reading this book! It was humorously written and also had some scenes where I laughed out loud. Also some parts that were a bit sad or showed some trouble they had to go through, but overall it's a very uplifting book. There are some vegan recipes included at the back of the book and some pictures of Esther and her family in the middle. I just had wished it was even longer and showed even more of Esther and their daily lives. But that's just because I enjoyed reading this book so much! I would recommend this book to animal lovers or anyone who enjoys a good heartwarming story that makes you believe in the power of kindness!"}, {"userName": "Bobby", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/7983120-bobby", "userReview": "The pig known as \"Esther the Wonder Pig\" has over 600,00 followers on Facebook and this is her story. It is also, of course, the story of partners Steve and Derek who adopted her thinking that she was a micro pig, struggled to figure out how to house train a pig that was actually heading towards 600+ pounds, and all the other adventures she would bring to their lives. There are moments of triumph and surprise and there are moments of heartbreak, especially fairly early on when it occurred to Steve and Derek that they might have to let Esther go. (I may not have made it through this part if it weren't for knowing that the story would have a happy ending since I too am an Esther follower!). The book is a laid back and conversational read that I read in just a few hours. It can certainly be recommended to any and all of Esther's Facebook followers but is also recommended to any animal lovers who can appreciate the love and commitment that Steve and Derek have to their \"little girl\"!"}, {"userName": "Melissa", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/12090121-melissa", "userReview": "I really enjoyed this book - but I wanted more! Wish there were a couple more chapters written about life on Happily Ever Esther Farm, after the move there happened (I know, the authors haven't lived there long - but they've acquired 33 animals in that time, so surely they have some things to say about this, even though it's early days). Hopefully the writers will do a second book about their adventures running an animal sanctuary that offers comfort and love to more than just the usual cats and dogs."}, {"userName": "Melissa", "userReviewDate": "Jun 05, 2016", "userURL": "http://www.goodreads.com/user/show/10315316-melissa", "userReview": "I laughed and I cried. Tears of laughter at Esther's antics, tears of sadness for all the Esthers out there who aren't so lucky and tears of joy for all the people who are changed because of Esther's story. This is a sweet, funny book about a smart and sassy pig who (along with a little help from her human family) is changing the lives of countless people! Everyone should read this book!"}], "description": "In just two short years, Steve and Derek have cemented a place for themselves among the worlds most well-known and successful animal activists, accumulating hundreds of thousands of followers from all over the world. In 2014 Steve and Derek founded the Happily Ever Esther Farm Sanctuary in Campbellville, Ontario, where they continue to rescue and rehabilitate abandoned and abused farmed animals.", "title": "Esther the Wonder Pig: Changing the World One Heart at a Time", "url": "http://www.goodreads.com/book/show/27416033-esther-the-wonder-pig", "average": 4.17, "cover": "https://images.gr-assets.com/books/1452272748l/27416033.jpg", "reviews": 314, "authors": [{"url": "https://www.goodreads.com/author/show/16308245.Steve_Jenkins", "name": "Steve       Jenkins"}, {"url": "https://www.goodreads.com/author/show/4601385.Derek_Walter", "name": "Derek Walter"}, {"url": "https://www.goodreads.com/author/show/108850.Caprice_Crane", "name": "Caprice Crane"}], "type": ["Nonfiction", "Animals", "Autobiography", "Biography", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/27416033-esther-the-wonder-pig", "http://www.goodreads.com/book/show/30981127-esther-the-wonder-pig", "http://www.goodreads.com/book/show/28535191-esther-the-wonder-pig", "http://www.goodreads.com/book/show/30334928-esther-the-wonder-pig", "http://www.goodreads.com/book/show/39692395-esther-the-wonder-pig-czyli-jak-dw-ch-facet-w-pokocha-o-wini", "http://www.goodreads.com/book/show/27416515-esther-the-wonder-pig", "http://www.goodreads.com/book/show/31934388-esther-the-wonder-pig", "http://www.goodreads.com/book/show/35604735-the-true-adventures-of-esther-the-wonder-pig", "http://www.goodreads.com/book/show/36547129-happily-ever-esther"]}