{"ratings": 2174, "userreviews": [{"userName": "Ruth", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/335159-ruth", "userReview": "The first thing I noticed in this book was Wiggen’s use of poetic language. Beautiful. But in the beginning of the book at least, it was too much for me. Like too many plums in the pudding, too much sauce on the pasta. Tasty gems need a matrix to shine against. When it’s all chocolate chips and no cookie it can become cloying. The writing, lovely as it was, slowed me down because it kept bringing attention to itself. I love gorgeous writing, but when I’m reading a novel I don’t want to keep stopping to admire the view at every step of the path. But as I got into the book I either stopped noticing the pearls so much, or she used them more judiciously and it was smooth sailing from there on.It did, however, take a long time before I really cared about Fos and Opal. There were times when I was just slogging along without much emotional involvement. I wonder if that was because Fos and Opal were so inarticulate, so turned in upon themselves, that I felt as if they were unknowable.I kept stopping to ponder the world in which Fos and Opal lived. They were a little older than I am, a little younger than my parents, so many of the events in the book were things that happened in my lifetime. In a way it was like being a kid again, lying on my stomach in the living room in LA, reading about the TVA and the bomb in Life Magazine.I will say right here, since nobody else has mentioned it, that Wiggins’ use of dialect put me off. A cadence, a slight tinge here and there, would have been enough to make us aware of Opal’s and Fos’s speech patterns. Did she need to write things like “whatcha gonna do” phonetically like that? Listen to any bunch of American English speakers in an informal situation and they’ll talk like that, too. So I can’t see the necessity of writing their speech the way Wiggins did. I realize she wanted us to know how isolated and uneducated these two were, but just a touch would have done it. Overloading the dialect sounds condescending---Li’l Abner and Mammy Yokum.This is beginning to sound like I didn’t like the book. I did. But these are the reasons it didn’t get 5 stars from me. I loved the sense of wonder at the natural world, especially the theme of light carried through the book—stars, phosphorescence, x-rays, electricity, radiation, photography. Did you know that photographers are often referred to as “keepers of the light?”"}, {"userName": "Melody", "userReviewDate": "Jul 26, 2007", "userURL": "http://www.goodreads.com/user/show/186853-melody", "userReview": "In this world where bombs are dropped to end a war; where people living in clean, new, identical houses and whose sons spend dreamy summer evenings in tents in the back, build the atomic bomb and cheer when it explodes because it means more money for them and their town, how can you believe in love or other wonderful unseen things? Flash, Opal, Fos and Lighfoot are all searching for clues about the truth about who they are and what they want in life and what is real and good while, just like the white whale in Moby Dick, this same truth is hunting them down. They each learn that some of the things that are unseen in life can be beautiful, while some are ugly and can ultimately lead to your death. Light flickers through this whole novel, with glowing watch faces, lightning bugs, a phosphorous rock, x-rays, electricity, fish hearts, women’s names, and available light for photographs. But love is the ultimate light that can make the dark into your friend so that the things unseen do not destroy your soul. This book is stuffed full of events and moves and changes, yet it is written in simple, wistful language."}, {"userName": "Suzanne", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/3739451-suzanne", "userReview": "I’ve got to hand it to Goodreads. I never would have even heard of this book if it weren’t for the reading friends I’ve made there. And that would have been a shame, because Evidence of Things Unseen is going on my list of all-time favorite books and likely the best book I’ve read this year.The book opens with Fos (nicknamed for Ray Foster), a World War I vet, home from the trenches, with a newfound appreciation for science and technology. He meets Opal on a trip to see the Perseid meteor shower on the North Carolina coast, and immediately knows they are destined to marry. “That was Fos’ way with things, looking on the bright side. Seeing glowing haloes where others saw false paragons decaying into chalk inside abandoned churches. The difference between Fos and Opal was the difference between x and something absolute. Fos was light; and Opal, matter. Together they were two sides of the same page.”And yet in the midst of Fos’ hope for the future, the great depression bears heavy upon the country, and Opal’s hopes for a family become dimmer with each passing month.Marianne Wiggins paints a striking tale of a young couple looking eagerly at the future, and a country which also places its hopes in the promise of the Atomic Age. Like the couple, America finds that you should be careful what you wish for.With amazing prose, this author has presented a slice of history and dares you to look deeper. It is not surprising that Evidence of Things Unseen was a National Book Award finalist. It is the total package – a great story, beautiful writing, history and depth. I only wish I could find more books of this caliber."}, {"userName": "J.I.", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/310055-j-i", "userReview": "My distaste for this book can be understood by a sentence very early on in this novel:\"Blinking in the the rain he saw her bones smooth as horn beneath the fabric of her dress where it clung flat as oil on water to her form, he saw the flat spades of her scapulae and her ropy spine rising from the meager compass of her unspanned hips toward the frail width of her slender shoulders.\" Not only do we have a string of similes with nothing in common thrown together like a beginning writer in order to impress, but we have some ridiculous phrasing as well (unspanned hips? Really?). Further, this is very early in the book where the main character, Fos, is described as not being interested in girls, like his partner is, and yet the first woman we meet, a married woman (helping her husband to push out a stuck car) is gawked at like a 12 year old in front of their first breasts, and the second woman we meet he stares at likewise, and then is almost immediately having sex with.Wiggins is a powerful writer much of the time, but so much of this book felt like too much piling on, too beholden to its research (which, I must add, is great and super interesting) and not enough concerned with rendering the world through the eyes of its characters. If you like poetic sounding language, and don't mind when it spirals out of control completely, this is for you, but if you like poetic language that is used for a purpose, that enriches the text--maybe hit up Annie Proulx or Lee K Abbott."}, {"userName": "Whitaker", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "I’m not the kind of person to gush. I believe that the 80-20 ratio of great to mediocre applies to all things, including books. So when I do gush, I mean it. And I’m gushing. Evidence of Things Unseen covers the range of historical events from one great war to the next through the lives of Ray and Opal. More than an examination of America during the interwar years, this is a novel about death, love, and, above all, the search for a meaning to illuminate our lives. Wiggins's writing is luminous, covering everything from the hardscrabble quotidian to the prayerfully poetic.This has all the heart, mind and soul of a great novel, and like all such works, lights up the dark corners of all our oh-too-human hearts."}, {"userName": "Angie Palau", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/1103078-angie-palau", "userReview": "I thought this book was spectacularly well-written, with gorgeous language and very clever use of mathematical and scientific language to create romantic descriptions. There were several very obvious \"themes\" woven throughout, which I found enjoyable, but I acknowledge that other reviews thought they were overdone or contrived. I loved them and found the use of \"Light\" and \"Radiance\" throughout to be very interesting. I also thought hanging elements of the story on a \"Moby Dick\" frame was cool (and now realize I need to read THAT book, too). To me, the distinct themes and the semi-secret references to \"Moby Dick\" reinforced the idea of things unseen... an underlying structure or synchronicity (in life?) that you might not really be aware of.The characters were very interesting, if tragically flawed, and I have found myself thinking about the story constantly. That is a key indicator for me of a \"special\" book. If it feels forgettable, it is. This one, for me, is not.Also very compelling for me was the setting - Knoxville and Oak Ridge - places I know well and that the author clearly knows well. The depiction of life in East Tennessee from WWI through WWII felt very realistic, with the uniquely southern influences of TVA, the KKK, and Appalachian mindsets. This story was written from the inside and had the ring of truth. I've already recommended it to several family members and consider it a keeper..."}, {"userName": "Pamela", "userReviewDate": "Aug 22, 2011", "userURL": "http://www.goodreads.com/user/show/4894054-pamela", "userReview": "(Note: When my opinion is so absolutely opposite of the majority of the readers of a book, I feel a bit more than just the star-rating is necessary. In this case, it's not difficult to explain why I have the opinion I do.)I was very excited when I started this book. We live on Clinch Mountain near to Clinch River and not that far from Oak Ridge. Since I was born in the 50s, the development of The Bomb, has always interested me. That it's written by a National Book Award and Pulitzer Prize finalist seemed to be just icing on the cake. Imagine my surprise when the cake turned out to be a cow patty.In no particular order, here are a few of the things that irked me to no end.The Name GameEach time I read a character's name or another one was introduced, I found myself cringing. You know that annoying guy who talks too loud at parties, who laughs too loud while making moronic observations that he finds incredibly clever? Know how when you don't laugh, he announces that you just don't get him? Know the frustration that--because you were raised to be polite--you can't bring yourself to tell him that you do get him--that you get he's an idiot? That's something along the lines of how I feel about Wiggins' little name game. There's Fos - Get it? Like phosphorescence Huh? Huh? Do you get it?Ray Foster (real name of Fos) - Like a ray of light. Bet you didn't get that, did you?Flash - Again like light but this time also like photography! Are you sure you are getting the light motif?Opal - A semi-precious stone that's pale and seems to glow. See? More light!Lightfoot - Duh!Ramona de la Luz - And here's light in another language! Pearl - Very similar to Opal.The Main CharactersEven though I managed to grit my teeth and get past the heavy-handed naming, I could not get past the basic disgust I felt for the three main characters. They weren't too bad at first, a bit two dimensional and inane, but bearable. But then came the Flash and Lally affair. Here's a grown man messing around with a young girl--a girl who was at the most 13 or 14 years old. A grown man who got her pregnant. A grown man who didn't take her to the hospital but rather let her bleed out in his car because of a botched abortion. And what do Flash's two friends do? They support him as much as they can. Never mind about the girl. (She is never mentioned again.) Never mind that he's a worthless piece of crap. He's their friend, and the reader is supposed to buy into the premise that Flash's conviction was just brought about because the DA is Flash's brother and jealous. The reader is supposed to feel oh-so-sorry for Flash and Fos and Opal. Well, this reader didn't! One of the worst aspects of this part of the story is that I was so disgusted with Flash and the Fosters that I found myself coming down on the side of the KKK when they tore up the studio.As bad as that was, it got even worse when it came to the murder/suicide of Opal and Fos. What nice people they were, what good parents. So kind. So considerate. I mean Fos even went so far as to half-heartedly ask one of the neighbors if she would take care of Lightfoot should something happen. When she said she couldn't, Fos didn't press the issue or even bother to ask anyone else. No big deal. It's only his son. Nothing to worry about. Nothing to interrupt his plans. He overdoses himself and Opal with morphine on the night before Lightfoot's birthday. What a joy for a little boy to wake up on his birthday and find his parents dead. And since Fos had made no plans whatsoever for Lightfoot so the authorities have no choice but to cart him off to an orphanage. There's no need to go into the rest of the story as there's not all that much story there--and I'm pretty disgusted with even thinking about Flash. StyleAs if the characters and names weren't bad enough, there was Wiggins' style on top of it all. I never could figure out if it was because she flat out wanted to annoy her readers or if she was just being pretentious. Single paragraphs run over several pages. Sentences run on forever and ever and ever and ever. Quotation marks do not exist. Dialog is mixed in with thoughts so you have to puzzle out who said what, who thought what, and who didn't say anything at all. By the end, I didn't care who did/said/thought what. I didn't care for anything but getting through this mess. It had come down to me against Wiggins, and I wasn't going to let her win.I'm reminded of a restaurant in France my husband and some of his colleagues went to several years ago. The restaurant had the reputation for being one of the best in the world--and the Michelin stars to back it up. After all their anticipation, they were terribly disappointed. It was typical whole lot of nothing on big white plate cuisine, and if that weren't bad enough, the specialty of the house was raw pigeon. Marianne Wiggins' Evidence of Things Unseen is a whole lot of nothing, and what is there is as unappetizing as raw pigeon.P.S. Apparently Wiggins couldn't be bothered to do anything as mundane as glance at a map. The Norris Dam is on the Clinch River, not the Tennessee River. Fos and Opal lived on the Clinch River, not the Tennessee."}, {"userName": "Janna", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/5644445-janna", "userReview": "This is a touching story of the tender love between Fos and Opal. Fos is a man who has always been fascinated by things that glow...falling stars in the night sky; bioluminescence in the dark sea.He accidentally finds Opal when his truck breaks down while he is in NC to see the meteor showers. Opal is quite the repairman so she has him on the road again quickly...and she's with him.The author, Marianne Wiggins, deserves a Pulitzer Prize for this novel. It is a riveting story of America before and during the Atomic Age. Fos and Opal end up working in Oak Ridge, TN when the race for the Atomic bomb is at it's height.  But, before that they travel the country taking X-Ray pictures at County Fairs. They don't do this for medical reasons Everyone is thrilled to get to see the bones inside their skin! And, willing to pay money for this treat!!This book flows like poetry. The descriptions and feelings of the characters stayed with me long after I finished this book. One particular scene that showed love and tenderness at it's deepest level was the scene of Fos bathing Opal. It wasn't the sexuality of it that touched me. Indeed it wasn't really sexual...But the tender, gentle, amazing love portrayed 'blew me out of the water!'I highly recommend this book."}, {"userName": "Tracey", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/1720676-tracey", "userReview": "Absolutely beautiful book. I read it as slowly as I possibly could so as to savor it."}, {"userName": "Rrshively", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/1377295-rrshively", "userReview": "This book did not pass my \"40 page\" rule that I should really be into it after 40 pages. However, I was reading it for a face-to-face book club and was determined to finish. The further I got into it, the more I liked it. By the time I reached the last third of the book, I was reading it avidly. This book brings up many issues for thought and discussion. It has several themes running through it such as the theme of light. I appreciated the author's clever ways of putting things. I would agree that it is a poetic novel. One interesting tactic the author used was to use a homonym for the word that would usually make sense i.e. Fishin' and fission, tolled and told. However, the use of the homonym made everything make more sense. Very clever!Aside from this novel being a little difficult to get into, my main complaint is the lack of quotation marks. This seems to be a trend for several contemporary novelists. Quotation marks are not there to make like difficult for English students or to hinder the creativity of novelists. They are there to make reading clear and easy for the reader. Especially in a novel that has depth and needs ones wits to fully appreciate, quotation marks are almost necessary. One of the difficulties in getting into the novel in the first place was the backing up and re-reading to make sure I knew if words were spoken or just part of the description and deciding who was the speaker. I have always been a good reader and could understand difficult novels, so I think the lack of punctuation made me read as a slower, less intelligent reader. I would recommend this book to anyone who likes an interesting story (finally) and who likes difficult and profound things to think about. This is also great for someone who likes the clever use of words to express scenes and ideas."}, {"userName": "meg", "userReviewDate": "May 25, 2008", "userURL": "http://www.goodreads.com/user/show/90270-meg", "userReview": "a few weeks later and i still find myself thinking about this one. wiggins is just a beautiful writer. the paperback's blurb boasts about what an epic love story it is--which is certainly true--but i found it such an oddly limiting piece of praise to highlight because this book is so much more. science and poetry and history are woven together in kind of magical ways to make up this story that's so true it just feels like life. i think this passage says it best:\"Life doesn't progress the way a story does, each chapter leading neatly to the next. Life is a series of collisions, for fucksake. It's not a narrative experience. My advice to you is to stop trying to make it one.\"bam."}, {"userName": "Renee Klang", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/16191357-renee-klang", "userReview": "This was one of the most beautifully written books i have ever read. Wiggins mingles physics, chemistry, geology, and astronomy in this marvelous love story between two unique characters .  Couldn't decide between 4 or 5 stars because of the ending and something that Flash does that seemed hard to believe. However, because I couldn't stop reading it and enjoyed the prose so much I decided to give it five."}, {"userName": "Laurel", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/558745-laurel", "userReview": "Marianne Wiggins for vice president!!!! I love this book...I am completely enamored by Marianne Wiggins' writing. The story of Fos and Opal and Flash and Lightfoot is beautiful and tragic and fascinating. I think The ShadowCatcher is a great American novel and I think this one is an even greater American novel...READ IT!!!! I'm even contemplating going back to Moby Dick and actually reading it this time, as I failed to do so junior year of high school."}, {"userName": "Kathleen Nightingale", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/24862459-kathleen-nightingale", "userReview": "From the first page to the last page I forced myself through the experience. This book was a book club suggestion so I was bound bent and determined to finish the darn thing. I never did get a handle on the characters or feel invested in them. The language though was amazing. I don't believe I have ever felt so bored with a book."}, {"userName": "Valerie", "userReviewDate": "Jul 19, 2008", "userURL": "http://www.goodreads.com/user/show/602366-valerie", "userReview": "A wonderful book about love--of wife, husband, friend, child, life."}, {"userName": "Kate", "userReviewDate": "Jan 04, 2011", "userURL": "http://www.goodreads.com/user/show/4394938-kate", "userReview": "One of my all-time favorite books: a beautiful, epic story, beautifully written.Themes:"}, {"userName": "Annisa Anggiana", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/383883-annisa-anggiana", "userReview": "“I know that every atom of life in all this universe is bound up together. I know that pebble cannot be thrown into the ocean without distrubing every drop of water in the sea. I know that every life is inextricably mixed and woven with every other life. I know that every influence, conscious and unconscious, acts and reacts on every living organism, and that no one can fix the blame. I know that all life is a series of infinite chances, which sometimes result one way and sometimes another. I have not the infinite wisdom that can fathom it, neither has any other human brain. But I do know that in back of it is a power that made it, that power alone can tell, and if there is no power, then it is an infinite chance which man cannot solve.”\nTerakhir kali saya baca buku yang saya randomly beli tanpa tau apa2 tentang buku itu dan ternyata pada akhirnya saya kasih lima bintang itu The Thirteen Tale. Udah lama juga yah? Tapi setiap “menemukan” buku lima bintang secara ngga sengaja itu rasanya puas banget.Buku ini judulnya eye catching, waktu beli saya kira ada unsur2 misterinya gitu. Ternyata setelah dibaca meleset banget dugaan saya. ¼ bagian pertama buku, saya masih menyesuaikan dengan bahasanya Marianne Wiggins yang puitis banget. Dibaca pelan2 dan seksama baru mudeng. Lama-lama untungnya bahasanya me-ringan atau ntah ceritanya tambah rame karena muncul tokoh Opal.Eh dari awal ya. Mulanya buku ini bercerita tentang Ray Foster alias Fos, seorang pemuda yang sangat menaruh minat pada science. Khususnya cahaya2 yang secara natural terdapat di alam. Phosphorenscence, kunang-kunang, bintang jatuh, hati ikan yang dapat menjadi tinta yang menyala dalam gelap, cahaya dari unsur radioaktif, x-ray, you name it. Fos sangat tertarik pada hal tersebut.Selamat dari perang dunia pertama, Fos diajak teman seperjuangannya Flash untuk membuat sebuah studio foto. Fos menyambut baik ide itu karena dekat dengan minatnya pada cahaya alami. Dalam waktu-waktu tertentu Fos selalu bepergian untuk melihat peristiwa bintang jatuh. Dalam suatu kesempatan, nasib membawanya untuk terdampar di rumah seorang glassblower (ini kurang lebih artinya pengrajin kaca kali ya, orang yang bikin hiasan kayak vas atau yang cth lainnya dari bahan kaca).Dari bayangan terbalik yang ia lihat di kaca leleh yang sedang ditiup Fos pertama kali melihat Opal. Tidak seperti Flash yang bermental Don Juan. Fos ini bisa dibilang sangat polos dan sama sekali kurang berminat mencari pasangan. Namun di saat itu ada sesuatu dalam diri Opal yang membuatnya tertarik. Fos pun mengajak Opal ikut serta dalam acara berburu bintang jatuhnya. Di malam yang romantis itu Fos yakin bahwa ia dan Opal meant to be each other. Fos melamar Opal. Opal yang merasakan hal yang sama pun nekat menerima. Tanpa persiapan heboh2 mereka pun menikah dengan restu ayahnya Opal, sang glassblower. Fos lalu membawa serta Opal pulang ke Knoxville tempat ia hidup dari studio fotonya dan Flash.Opal boleh dibilang adalah nyawa dari cerita ini (menurut saya loh). Tipe perempuan yang ngga ribet, secara alami cerdas dan memang sepertinya diciptakan untuk memahami Fos yang kadang2 keterlaluan polosnya. Untuk beberapa waktu, mereka bertiga, Fos, Opal dan Flash menghabiskan berbagai pengalaman yang cukup menyenangkan bersama.\n“The sight of Fos and Opal coming down the street together absolutely tickled him. The idea of two such strangely unremarkable yet lovable people could have found and met each other reaffirmed his waning faith in anything remotely optimistic about mankind and seemed to be a more convincing proof than all the gospel shit flown from the pulpits of Knox County that life could, in fact, distribute happy endings.”\nSuatu keputusan yang diambil sepihak oleh Flash atas hidupnya sendiri membawa akibat kepada kehidupan Fos dan Opal. Mereka berdua harus tercerabut dari zona amannya dan terpaksa hidup di desa dengan bertani. Fos merasa hidup telah berbuat licik padanya. Kenyataan bahwa ia tidak mengira Flash akan melakukan yang ia lakukan membuat Fos merasa tertipu oleh sahabatnya tersebut.\n“It makes you wonder. How much you can know about a thing, a person. If you can know anything at all. Maybe no one’s who we think they are. No one. Makes you doubt yourself, wonder if you even know yourself orif you’ve been lyin, too, along with everybody else.”\nKehidupan keras di pedesaan tidak cocok untuk Fos yang bermental scientist. Semua menjadi salah. Sebagai akibatnya antara Fos dan Opal tercipta jarak yang ditandai dengan hening. Ditambah dengan Opal yang merasa kecewa kepada dirinya sendiri yang tidak kunjung mengandung.Roda nasib bergerak, ketika mereka mendengar berita bahwa Ayah Opal meninggal dunia, mereka pun segera kembali ke kampung halaman Opal. Disana mereka bertemu dengan keluarga pengelana yang memiliki banyak anak, sang istri tampak akan melahirkan. Mereka beristirahat sejenak di rumah Ayah Opal yang telah kosong. Pasangan itu pun mengizinkannya dan memutuskan menginap di hotel.Ketika kembali ke rumah itu mereka menemukan seorang bayi baru lahir yang memang dengan sengaja ditinggalkan disana. Fos dan Opal saling berpandangan, bayi itu adalah hadiah yang dibawakan nasib untuk mereka. Lightfoot mereka memanggilnya.Lalu sebuah proyek rahasia dari pemerintah membutuhkan keahlian Fos dalam bidang fotografi. Ia pun masuk ke dalam proyek itu, membawa serta Opal dan LightFoot ke sebuah perumahan khusus untuk para pekerja proyek. Dari sana cerita bergulir ke arah yang membuat kita bertanya-tanya apakah memang benar kita sebagai manusia tidak punya kendali sama sekali akan kemana hidup akan membawa kita. Apa yang penting dan apa yang tidak penting dalam hidup. Dan apa memang benar cinta sejati itu ada.Pada akhirnya saya menyukai bahasa Marianne Wiggins. Terbukti dari quotes2 di bawah yang ngga bisa ngga saya masukin dalam review ini. Hehe. Lima bintang untuk kisah cinta Fos dan Opal yang amat sangat bikin ngiri.\n“Wherever love comes from, whatever is its genesis, it isn’t like a quantity of gold or diamonds, even water in the earth-a fixed quantity, Fos thought. You can’t use up love, deplete it at its source. Love exists beyond fixed limits. Beyond what you can see or count.”“You build a tower then you also build the chance it will fall. To think of life as a foolproof is a fallacy of fools, he thought. Things happen, he believed, and there’s nothing you can do to keep them from occurring.”“I think what you can’t see is always what you should be frightened of.”“Because way back before you were even born there was this girl you see. And I fell in love with her. It was something that I wanted-love-not because it was expected of me, but because I found it out my self-that happiness of wanting to be with that other person.”“The future is the one thing you can count on not abandoning you, kid, he’d said. The future will always finds you. Stand still, and it will find you. The way the land just has run to sea.”"}, {"userName": "Barb", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/5085328-barb", "userReview": "Ray Foster is fascinated with light. During the war he helps light up the battlefield so that the soldiers can see what is in front of them. After the war he continues to follow his amateur chemist’s investigations. He is always trying to discover new “natural” lighting and a way to recreate it with science. When Flash, a former war buddy, asks Ray to start a photography business with him, Ray is in his glory. On one of his amateur investigations of light, Ray meets a girl names Opal. The name seems so appropriate to Ray’s life obsession with light since Opal reflects light so wondrously and Opal the girl seems the perfect match as Ray’s life partner. The three of them make the photography shop quite a success until Flash makes a decision that significantly impacts the lives of them all.Ray and Opal eventually end up working at Oak Ridge, Tennessee during the time the atomic bomb was being developed. Also, about this time, Lightfoot comes into their lives. Opal has waited so long for a child. The title of the book, “EVIDENCE OF THINGS UNSEEN” could apply to many things discussed in the book. It could be the origin of the various light sources Ray found. It could be the atomic bomb itself. It could be radiation. It could be hope. It could be love. It could be self-knowledge. It could even be the unity of all matter in the universe.EVIDENCE OF THINGS UNSEEN makes you think. It makes you wonder if there is more than just a story of three people living their day-to-day lives. It makes you wonder what the author is trying to tell you between the lines. After reading the book, I am still not sure I know what the author wanted to tell me. I do know that the book started slow and it was only during the final third that I began to “get” the fact that she is saying there is more to the story than just these people. She was trying to tell me something about life. Unfortunately, I still don’t know exactly what that “something” is that she wanted to convey. I guess she means that the atomic bomb is a bad thing and that love is a good thing. I hope so because that is about the only moral I got out of the story.The writing was good and I did enjoy reading about the characters after I got past the slow start. I kept waiting for more. But then it dawned on me that real life is much like this story. We live each day and not a lot of exciting things happen. Then one day it is all over, your life ends. What was the point? Does every life have a point – yours and mine? What is it that we truly get out of life? What do we leave behind? Perhaps this is what the author was trying to get across – just that we think about it."}, {"userName": "Ernie", "userReviewDate": "Nov 15, 2015", "userURL": "http://www.goodreads.com/user/show/7882493-ernie", "userReview": "Here is another consummate American writer that was previously unknown to me. Wiggins creates one oi the most difficult characters, an ordinary man, Ray Foster, trained as a candle maker. Gassed in World War I, 'Fos', frequently tearful as a result of the mustard gas and distinguished by that and his glasses becomes a photographer because of his disability but also because of his fascination with new gadgets and inventions such as radium. His other interest is in the stars. He seems to be fated to remain alone and virginal but Wiggins is interested in exploring that American drive to pick yourself up with your own bootstraps. The concepts of progress and success, individualism and the national good, are integral to her storyHe sets himself up as a 'phenomenologist' and drives a truck to perform at fairs and travels annually to Kitty Hawk to observe the meteor shower where, by chance he meets a younger woman, Opal, the daughter of a glass blower and another loner whose mother died and who seems fated to remain her father's housekeeper. She too, is imaginative and unusually for that time, one who, in their secluded workshop house in the Kitty Hawk sand dunes, drives a truck and is a skilled mechanic (unlike Fos).The omniscient narrator comments on their meeting and subsequent marriage: 'All life is a series of chance points, connecting in curves' like the meteor shower and their next meeting in Knoxville Tennessee with Flash, a fellow photographer who employs them in his studio. In contrast to this pair of characters, Flash who is a fellow veteran, known to Fos from France is a charmer but also a womaniser and a frequent drunk.Wiggins, having drawn me into the lives of these interesting characters, extends her range of social representation with the lives of the people of Knoxville and their love of their river, the Tennessee and its catfish including how to catch it and how to cook it. These bucolic scenes are shattered when Flash gets into trouble and his District Attorney brother takes revenge and Opal inherits a farm in the time of the terrible drought in Oklahoma and, childless after three years of marriage, she rescues a baby from a desperate Okie family and keeps it as her own. The writer brings her story into World War II with her ability to create skilful gaps in the text, linking all with her themes in a convincing amalgam of lyricism and realism. Despite this, she provides excellent surprises and her prose gathers pace towards a moving ending that made me admire the novel as a beautifully integrated work of the fictional arts."}, {"userName": "Cynthia", "userReviewDate": "Dec 03, 2008", "userURL": "http://www.goodreads.com/user/show/54076-cynthia", "userReview": "This book was chosen for my book club. We had a great discussion on it and like most of the books we choose 1/2 liked it and 1/2 disliked it. I belonged to the group that wasn't too impressed by it.Evidence of Things Unseen tells the story of Fos, his wife Opal, their son Lightfoot, and Fos's best friend and work partner Flash. Set in the 1920's to 1920's in Tennesse. At first I really enjoyed it, how Fos and Opal met, the sentences were beautiful and tender. My favorite part described the first time Fos saw Opal. But while the author's writing style was both lyrical and beautiful, it was also confusing at times. It was hard to figure out who was talking, or if anyone was talking outloud or just thinking in their head.I liked the plot for about 1/2 of the book, until Fos, Opal, and Lightfoot moved to the military base. I just couldn't get over what happened to Lightfoot on his birthday. I was actually MAD. Those in my book club think it was because Fos and Opal loved each other so much and back in those times things were not talked about. But I still felt like they could have prepared better, left Lightfoot with a more secure future.The last few chapters with Chance/Flash and Lightfoot were good and redeemed the book a little more with me. The end makes the story come full circle (look at the prelude). Evidence of things unseen was the theme throughout the book. The things unseen were both good and bad things--love, hidden prejudices, relationships, secrets, science, radiation, etc..."}, {"userName": "Rebecca", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/1302912-rebecca", "userReview": "I like fiction about people who talk about science.A passage I like (pages 12-13):But the truth was, for that first year after he was demobilized, that first year in Tennessee, Fos eschewed the company of the gentler sex and stayed almost entirely to himself, either in the darkroom of in his rented place above a bakery, studying about light and working on his theories how to capture it. Fos had several theories that first year. One thing that the War had taught him--and that working under Flash's tutelage added to--was how to make a framework for experiment. His experience in the Army had given him a confidence in his ability to adapt and improvise, to think sideways. Fos had no formal education beyond what was handed out to every child by the State of North Carolina in its local schools, but what being in the War and being in the Army had shown him was that people by and large tend naturally toward light, toward its source, as sunflowers do in a field. People lean, either in their dreams or in their actions, toward that place where they suspect their inner lights are coming from. Whether they call it God or conscience or the manual of Army protocol, people sublime toward where their inner fire burns, and given enough fuel for thought and a level playing field to dream on, anyone can leave a fingerprint on the blank of history. That's what Fos believed."}, {"userName": "Elizabeth K.", "userReviewDate": "Mar 20, 2010", "userURL": "http://www.goodreads.com/user/show/2467151-elizabeth-k", "userReview": "I kept encountering positive reviews of this book, but the description always left me unmoved -- according to the back of the book, it \"describes America at the brink of the Atomic Age. In the years between the two world wars, the future held more promise than peril, but there was evidence of things unseen that would transfigure our unquestioned trust in a safe future.\" That sounds tiresome, yes? Fortunately for me, we can completely disregard that explanation. This book was truly winsome. Okay, the story is bookended by the two world wars, but other than that ... a young couple meet and fall in love and have a fairly average life that is full of the expected long spells of routine, punctuated with both tragic and comic events that steer and shape their experiences. It's a love story (read: get lots of Kleenex) that goes hand in hand with the science of everyday life.Grade: ARecommended: To people who like plots that operate on both the micro and macro levels, you get both daily life and the machinations of the war machine. It does rely quite a bit on literary coincidence -- although the kind that's clever and crafted and paced, so if that sort of thing makes you bug out, you will notice it a lot."}, {"userName": "CynthiaA", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/1501865-cynthiaa", "userReview": "Marianne Wiggins knows how to weave magic from mere words. This book, so simple in its tale, becomes a layered, textured, bittersweet illumination of things we cannot see. Love, yes, but deep and enduring love, not the kind built upon physical desire. Faith, of course, but an active faith in the building blocks of our world,, our society, our families, even ourselves. Set against the backdrop of rural Tenessee during the 1920's to post-WWII, Ray Foster is a man obsessed with science, in an age when scientific discoveries are changing the world. Like I said, it is a simple tale. Fos meets Opal, they fall in love, get married, build a life, face a few challenges, raise a child. But in Wiggins hands, a simple tale becomes a thing of beauty, full of light and shadow, illuminated by hope, reflecting difficult truths about our world and our society. I fear I haven't done this wonderful book justice. The story was tender, the characters became my friends, the places they lived became my home. It is a beautiful book to read, and one that gives the reader much to think about without being didactic or preachy. It really was a joy to live with Fos and Opal these past few weeks, I shall miss them."}, {"userName": "JoAnne Pulcino", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/5096613-joanne-pulcino", "userReview": "EVIDENCE OF THINGS UNSEENMarianne WigginsA lyrical novel that takes place during the years between the two world wars, and at the brink of the atomic age following a couple through their lifetime and the fascination with light.Fos a veteran returning from the trenches of France is fascinated with science and technology especially x ray and light. He falls in love with Opal whose father is a glassblower who can spin color out of light. They move to Knoxville where Fos and his buddy, Flash open a photography studio. When Flash runs up against the law and the Ku Klux Klan, Fos and Opal move to Opal’s mothers farm on the Clinch River and welcome a son, Lightfoot. When the New Deal claims the farm for the TVA, Fos finds work at the Oak Ridge Laboratory with disastrous results that cause Fos to lose his interest in things that glow.This is a very interesting book that is a glowing look at the path a couple live through the twenth century while keeping their love alive. Although EVIDENCE OF THINGS UNSEEN might be the beginning of citizens questioning their trust in a safe future."}, {"userName": "Leslie Kay", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/956720-leslie-kay", "userReview": "Beautifully written engaging story about love, loss and life. I enjoyed all of the characters and the happiness and tragic-ness of their lives. The ending reminded me of Castaway with Tom Hanks, but hey, it could happen. Despite the desire to feel that the ending seems oversimplified,or too easily wrapped up, the journey is heartbreaking and breathtaking. I thoroughly enjoyed this story.Favorite quotes: \"Still, as much as she was headstrong, single-minded, and self-made, she could see a vision of herself taking shape in Fos's eyes that she liked better.\" Opal on being a wife, pg. 45\"The past doesn't hold the answers for you about who you are- the future does. Life doesn't progress the way a story does, each chapter leading neatly to the next. Life is a series of collisions,... I'ts a narrative experience. My advise to you is to stop trying to make it one.\" Life advice from Flash to Lightfoot, pg. 360."}, {"userName": "Jerry Landry", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/2556182-jerry-landry", "userReview": "A quaint tale. One of the best fiction reads of the year, though I have to admit that I wished she would have worked on the ending a little more. Though this novel never pretended to be realistic, the ending was tied up overly nicely at the end (the fish hearts, to me, was too much). However, I fell in love with Wiggins's prose and descriptions at the beginning, and the love story of Fos and Opal felt like a fun, rousing dance that you didn't want to ever end. The tone changes about sixty or so pages from the end, and it took me a couple of days to get through a forty page chunk because it got so depressing. However, the story does have a happy ending, luckily, though as I said, I think it could have been taken back a step and been perfect. Overall, I highly recommend this book for anyone looking for something, be it in plot or literary style, a little out of the ordinary."}, {"userName": "Gina", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/1185911-gina", "userReview": "I don't really know what this book was about. I followed everything ok, but not sure where it all went. It is a sprawling plot, arcing over decades and generations. There are some interesting locations and points in time - WWI, Outer Banks, TVA dams, Jim Crow, WWII and Oak Ridge. There is a love story that is lovely. But the book begins and ends with Lightfoot, and why? The writing was lovely and the story was interesting but I just didn't understand what was driving things and how it all hung together."}, {"userName": "Whitney Archibald", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/1034201-whitney-archibald", "userReview": "This ranks right up there with Crossing to Safety as one of the best novels about marriage. The quirky yet believable main characters were so curious, kind, and tragic. A very unique and satisfying story. I didn't even mind all of the unbelievable coincidences in the end, because it was so well crafted. Plus, the longer I live, the longer I realize that bizarre coincidences aren't really all that rare, or all that coincidental."}, {"userName": "Donald", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/4416026-donald", "userReview": "One of the most hauntingly gorgeous reads I have ever savoured. Phenomenal, epic sweep and unique poetry. Would like to start it all over again, fully aware that there are even deeper layers to this book that reveal their secrets slowly."}, {"userName": "Mary", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/1540848-mary", "userReview": "\"One of the most suggestively original love stories in our current fiction...\"-NYTBRLOVE this book."}], "description": "This poetic novel, by the acclaimed author of John Dollar, describes America at the brink of the Atomic Age. In the years between the two world wars, the future held more promise than peril, but there was evidence of things unseen that would transfigure our unquestioned trust in a safe future. Fos has returned to Tennessee from the trenches of France. Intrigued with electricity, bioluminescence, and especially x-rays, he believes in science and the future of technology. On a trip to the Outer Banks to study the Perseid meteor shower, he falls in love with Opal, whose father is a glassblower who can spin color out of light.Fos brings his new wife back to Knoxville where he runs a photography studio with his former Army buddy Flash. A witty rogue and a staunch disbeliever in Prohibition, Flash brings tragedy to the couple when his appetite for pleasure runs up against both the law and the Ku Klux Klan. Fos and Opal are forced to move to Opal's mother's farm on the Clinch River, and soon they have a son, Lightfoot. But when the New Deal claims their farm for the TVA, Fos seeks work at the Oak Ridge Laboratory -- Site X in the government's race to build the bomb. And it is there, when Opal falls ill with radiation poisoning, that Fos's great faith in science deserts him. Their lives have traveled with touching inevitability from their innocence and fascination with \"things that glow\" to the new world of manmade suns. Hypnotic and powerful, Evidence of Things Unseen constructs a heartbreaking arc through twentieth-century American life and belief.", "title": "Evidence of Things Unseen", "url": "https://www.goodreads.com/book/show/128109.Evidence_of_Things_Unseen", "average": 4.07, "cover": "https://images.gr-assets.com/books/1365327716l/128109.jpg", "reviews": 396, "authors": [{"url": "https://www.goodreads.com/author/show/69133.Marianne_Wiggins", "name": "Marianne Wiggins"}], "type": ["Fiction", "Historical", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/128109.Evidence_of_Things_Unseen", "http://www.goodreads.com/book/show/565719.Evidence_of_Things_Unseen", "http://www.goodreads.com/book/show/230221.The_Shadow_Catcher", "http://www.goodreads.com/book/show/119268.John_Dollar", "http://www.goodreads.com/book/show/230220.Almost_Heaven", "http://www.goodreads.com/book/show/230222.Eveless_Eden", "http://www.goodreads.com/book/show/230223.Separate_Checks"]}