{"ratings": 794, "userreviews": [{"userName": "Amanda Felix", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/17820136-amanda-felix", "userReview": "O.M.G. This was such a great book, it was hard to put down. So since I also got the audible at the same time, I switched back and forth when I had other things to do. No I didn't get lost because everything was so well synchronized with both the audible and the book that it was easy to go from one to the other. And Sean Runnette once again has done a great job narrating and capturing our favorite half-vamp. Due to the events of the last book, this one is a tad darker but still great. The one liners TALBOT fans are used to just keep coming. WOW! This is just the latest example why Mark Tufo is one of the best Indie horror writers out there. Mark Tufo has once again given his loyal fan base everything we asked for in this latest installment of LF series! Talbot's mood after having lost Tommy has changed and his reluctance to get involved in the Lycan/human war has taken a darker twist as vengeance fills his grieving heart. Only Oggie keeps him somewhat sane. Bailey stands by him but it is plain to see she is still somewhat confused by Talbot (slight spoiler) and a little worried as she watches Talbot's humanity begin to slowly slip away. But she has other things to worry about, foremost is the safety of her village. Unfortunately they become separated and she returns to her village believing in his demise. Azile is still trying to find a way to unite the people in the area to face the coming battle between Lycan and human. But Man has not changed and power, even in the face of impending doom, is still foremost in the other towns leadership mind and Talboton is in their crosshairs. You will not be disappointed as we follow Michael Talbot through adventures and misadventures that has kept us at the edge of our seat throughout the ZF series. Talbot is still Talbot, that will never change, no matter how out of time and place he is or how angry, morose, sad or depressed he becomes. He still cuts loose with his one liners that will leave the reader in stiches even as those around him have no idea what he is talking about. And he finds a new friend, Mathieu, who has just as tragic a past but during his own self imposed isolation has managed to find a way to brew beer, and this will play a very important part in the telling of this tale. Lana and Azile are still competing against each other for his affections and makes for interesting and in some cases hilarious situations. The battle scenes are intense and will leave you breathless as Michael unleashes his inner demon and is just as easily brought to tears by a simple reunion. He's as complicated a man as he is easy to understand. Mark Tufo has woven a tale that will keep you at the edge of your seat, lets you fall then has you clamoring for more as you pick yourself up at the mention of other characters hinted at briefly (don't blink or you will miss the references) and other more sinister enemies that can only add to the already intense tale"}, {"userName": "Shawn", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/7027982-shawn", "userReview": "Mark Tufo really never fails to put together a solid humaorous, action story. I loved this one and will eagerly jump into Number 3 as soon as I can."}, {"userName": "Vix", "userReviewDate": "Jan 06, 2015", "userURL": "http://www.goodreads.com/user/show/7521915-vix", "userReview": "We find MT, Baily and Oggie back on the hill where Tommy died, now buried, they are dealing with their grief when a visitor arrives and hands them more weapons and more hell; with a reluctant Bailey, MT sets off to hunt down the Lycan and destroy them.I really enjoyed all the little snide comments laced with the obvious love that MT can’t help but have for his fellow companions. His internal and usually external Talbotisms still reign supreme! Even amongst the gore (and there is a lot) and the heartache (again a lot) I still had moments where I literally snorted or laughed out loud at the one liners. Loved the little flash backs to the old life. Bear…..that is all.It is soon obvious that not all is well in the realm of the Lycans, Xavier’s plans are not liked by all; many have gone rogue. The werewolf change scenes are impressive and the fight scenes terrifying, I found myself holding my breath.Matheiu. There is an element of ZardOz to his home.Baily and Azile are still high profile but in the background.The watchers are also back as the Lycans mount their attack on the townships. Each town doing as man usually does though which is really rather sadAny old enemy rears its head but not for long….The finale is amazing, the last few paragraphs had me in both stitches and tears, glad to see Trip is his usual self; yes he makes an appearance but not how you think! Whilst fishing for beavers of the coast of Kansas could be fun, what I really want to know is do ants fart??"}, {"userName": "Kelly Rickard", "userReviewDate": "Jan 26, 2015", "userURL": "http://www.goodreads.com/user/show/15385541-kelly-rickard", "userReview": "Fall of manTufo is getting bleak, but still the great story telling is here. Talbot is still the same great character with the great one liners but no trip in any form well maybe but not in this universe hehe. Talbot is with Oggie, Bailey and Azile no Tommy (he didn't come back like I was hoping, damn you Tufo), they are fighting the Lycan and the werewolves but not before the human towns turn on Talbot town, the Lycan Xavier plans to destroy the humans in a huge epic battle which was harder than the human battle. Unfortunately it took a spell from Azile for everyone to except that Talbot was right and the humans were werewolves but not before Bailey shot him, why can't people just trust he is right, he has over 100 years of experience.Love the new man in Talbot's life Mathieu and his talent for beer.I wanted more of Oggie's story though, running with wolves and still fighting his way back to Talbot.All in all another great story and can't wait for the next part.Well done Tufo well done"}, {"userName": "Tim", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/14452764-tim", "userReview": "Tufo's best yetLycan Fallout is a fantastic continuation of the tales of Mr. Talbot. This is a great story with much action and humor. The pace is perfect and the writing is excellent as usual. As one beloved character was lost in the previous book, a new one was introduced. Mathieu is a great new addition and the interactions with Michael are very funny. There is a good abundance of violence in this book and the action propels the plot at a quick pace. Mark has always been a great writer but I believe this is his best work so far and I didn't want the book to end. This book is highly recommended."}, {"userName": "Annie", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/12534351-annie", "userReview": "Mikes journey in this story was probably my favorite out of all the books so far, it was well told and written and left me absolutely wanting more! I loved the snarky commentary and laugh out loud situations and also the sadder parts...all in all this kept my attention from beginning to end...I really loved it and highly recommend it!! I personally feel with Tufo's books audio is the best way to go....the narrator IS Michael Talbot!!!! 2 HUGE THUMBS UP!!!!!!!!!!JUST AS AWESOME A 2ND TIME...CANT WAIT FOR BOOK 3!!!LOVED IT...LOVED IT....ITS GREAT EVERY TIME I LISTEN TO IT!!!"}, {"userName": "Erika", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/5533680-erika", "userReview": "Wow! Just WOW!I always anticipate your ZF and LF books. Another amazing hit. I do love how you bring back our reminders to beloved previous characters and old Talbot memories. Michael is always jumping into stuff without a thought. But I don't think I'd have him any other way. Oggie! Now he is a social kickass companion and hit me worried a bit on the 2 Lycan situation, sweat I almost cried. Don't make me wait long for book 3! A must read series. But I'd recommend starting with zombie fallout"}, {"userName": "Ken", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/33610967-ken", "userReview": "Lycan FalloutI am really enjoying this addition to the stories of Michael Talbot. It hard to explain how a full length book can be short, but Mr Tufo seems to have a way with it. It is also good to see his writing style move back and forth from sarcasm to more dramatic and comical views of other characters. Keep up the good work. I am already waiting on his next book."}, {"userName": "Nicole Fabry", "userReviewDate": "Jan 07, 2015", "userURL": "http://www.goodreads.com/user/show/21222873-nicole-fabry", "userReview": "Very good follow up to the first book! I'm looking forward the #3."}, {"userName": "Dinese Millspaugh", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/11768142-dinese-millspaugh", "userReview": "love Tufo!This book is great. I honestly can't wait for the next one. Tufo writes a great story. Zombie Fallout is also a great series."}, {"userName": "Allison", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/14310425-allison", "userReview": "Another great story from Mark Tufo. Please keep them coming."}, {"userName": "Jennifer", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/11352197-jennifer", "userReview": "Better than the first!"}, {"userName": "Natalie Wortley", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/17128325-natalie-wortley", "userReview": "as always Mark Tufo delivers a fantastic story, couldnt put the book down. 10/10"}, {"userName": "Elaine Cantrell", "userReviewDate": "Aug 14, 2015", "userURL": "http://www.goodreads.com/user/show/4213683-elaine-cantrell", "userReview": "See review for Lycan Fallout 1."}, {"userName": "A. Hunt", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/14150982-a-hunt", "userReview": "As with every other novel, this one was huge for me. His books take you to future worlds and dimension that keep you either grossed out, feeling depressed or laughing till near puking. That's because those are just the tip of the emotional mountain range of Michael Talbot. In Fall of Man, Mike is pulled into his namesake of a town: Talboton. There, he comes across people who don't believe he is who he is, let alone can do what the books says he's done. Does it really matter though? Oh yes it most certainly does! The lycans are using humans in a way unimaginable, and it's an excellent tool- but this story is so much more than that. It's about humanity, and how even at the very end of things, there's still hope and a chance against all odds. This books also tells you, that even at the worst of times, family, friends and a good zap to the butt can make you smile. I think I enjoyed Lycan Fallout's Fall of Man because it gave me a healthy view of Mike's inner and outer being. Yes, he's part vamp, but there's so much more. And since we know there's a heaven or hell (in this series- don't fuss at me and my faith!), I'm thinking God is going to give him a spiritual break at some point. I don't know- I'll have to keep reading. I hope you do too!*Full review of this book and entire series to post 12/27/17 at www.areneehunt.comCheers!The Lycan Fallout Series:Rise of the WerewolfEnd of an AgeFall of Man & Immortality's TouchstoneWritten by Mark TufoPublished by CreateSpace Platform"}, {"userName": "mrs nicola cuckow", "userReviewDate": "Mar 05, 2017", "userURL": "http://www.goodreads.com/user/show/53037740-mrs-nicola-cuckow", "userReview": "Fantastic!! Once again an amazing and exciting story with no disappointments at all. My only criticism is that I would rather read the end of the story instead of having to buy two more books. That has no bearing whatsoever on this author's amazing ability to keep you engrossed and feeling like you're right there with all the characters fighting against the atrocities like werewolves and lycans. Love love loved it!!! Thank you Mark TiVo!!"}, {"userName": "jadiel", "userReviewDate": "Dec 06, 2016", "userURL": "http://www.goodreads.com/user/show/50043733-jadiel", "userReview": "An Awesome SequelFall of Man was an interesting sequel because like the previous book, Mr. Talbot is a hilarious character who is not only a badass, but he manages to continue to fight through all the pain of losing his family. It's actually pretty inspiring. As always with his books, Mark combines horrors and action with a touch of humor for an awesome ride."}, {"userName": "Hurdie Styles", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/68517531-hurdie-styles", "userReview": "I really enjoyed this book. I am a Michael Talbot fan. I am happy he found a real friend in the midst of the chaos. Great plot. Great characters. More fully realized than in the first novel. Now reading book three in the series."}, {"userName": "Chrystal Roe", "userReviewDate": "Nov 26, 2017", "userURL": "http://www.goodreads.com/user/show/26215058-chrystal-roe", "userReview": "ExcellentThere are more to fear than werewolves in this episode. Humans are just as dangerous especially when you don't expect them to be the enemy. Treachery puts our group at risk this time."}, {"userName": "Amy Sue", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/69120720-amy-sue", "userReview": "I don't know how Mr. Tufo keeps outdoing himself with each new book, yet he does. I love everything about this series and cannot wait to start book 3. I highly recommend this series to everyone."}, {"userName": "Karen Mccollin", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/9236004-karen-mccollin", "userReview": "This book was intense I like it"}, {"userName": "AudioBookReviewer", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "﻿ABR's full Fall of Man (Lycan Fallout Book 2) audiobook review and many others can be found at Audiobook Reviewer.Lycan 2 opens with Mike Talbot and Bailey mourning the loss of Tommy – Talbot’s one tether to his old world. Spinning out of control for a short bit – Talbot comes back full force with a vengeance – against Lycans! Although Talbot has concrete, steel and titanium barriers up around his heart a few people worm their way in and become more than friends – family. Of course what Matthew can brew up helps to break those barriers down big time! Azile, the Red Witch, makes her move as well, both in battle and out. Talbot doesn’t stand a chance – he will rejoin the human race if it kills him.Political intrigue which Talbot has very little patience for and against all odds, he is the man, the savior of Talbot town.Again, Michael Talbot is entertaining with his unique mannerisms and masterful delivery of one-liners that will have you snickering then full-out belly laughing. Talbot’s memories and ties to his family are poignant and heartfelt leaving the reader near tears and sometimes smiling.Lycan 2 is not for the weak at heart as it is violent and gory. The mannerisms of Michael Talbot and his relationships snag the reader and create a bond that is strong. Talbot is addictive!Mark Tufo maintains the personality of Michael Talbot and his other characters sometimes bringing them out in new friends but the integrity of Michael Talbot remains clear and ever present.Sean Runnette is Michael Talbot. He has embodied the Talbot mannerism and quirkiness excellently. Runnette is an excellent narrator for this series.Podium Publishing did an excellent job on the production as they provided a clear production without distracting noises or other issues.Audiobook provided for review by the author."}, {"userName": "Brian", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/55468224-brian", "userReview": "[I would say the best part of the book in my opinion was when Michael Talbot was going down the tunnel to see what was going on and to see how many people were behind the big hunk of metal they were moving forward and hiding behind. When he started to kill them, he realized that there were over a hundred of people packed in tight behind that metal / steel bullet shield they were moving forward, and he went into a full on vampiric blood rage, and killed mostly everyone there. Had me gritting my teeth the entire time. What does piss me off is when people know that a person is a werewolf but because the infected person isn't in werewolf form, the populace finds pity on them and wants to help them, and it comes full circle when it bites them in the ass (no pun intended), when they change over to werewolves and start slaying the populace. You know what the sad thing about that is? I can actually see that happening in real life. Sad but true. Then at the end, Michael Talbot gets his dog Oggie (A. Purpose) back, basically escorted back to Michael Talbot by a very LARGE pack of wolves (Who hate werewolves and lycan just as much as humans). So sad that Tommy is dead, going to miss the pop tarts and the \"Mr. T and/or Mr. Dad\" remarks! (hide spoiler)]"}, {"userName": "Alina", "userReviewDate": "Jan 25, 2015", "userURL": "http://www.goodreads.com/user/show/31927139-alina", "userReview": "I am a Mark Tufo fan, i have to admit it, i love his work, it is just so allive, each time when i read one of his books i have the feeling that i sit somewhere around a campfire and a friend tells a great funny Story that you just want to listen, no mather that it is already late and the mosquitos consider your blood a open all you can eat buffet. This is what happens each time a new Mark Tufo books lands on my kindle, i am so captured by it that i just can't put it away. What i like about Lycan Fallout at first was that Mark Tufo just pics Mike Talbots Story up, afther about 200 years. I know that this is not a zompoc book, but a few zombies are present, and the fact that he has the courage to pic up a story long afther the zompoc say much about the talent of this writher. If you are infected with the Zombie Fallout Virus you just cant pass out on Lycan Fallout 1 and 2 (and hopfully 3 soon !!!!)***Spoiller****200 years old and Mike is still the same guy that stepped in Henrys poo. He still does not have a plan, he acts first and thinks later, all the atributes that made him the lovable hero that he is ! The relationship btw Mike and Azile evolves, and oh, wonder Mike finds somebody that can make beer, so his world, that is far away from being ok is a litle bitt better. The book is written is the best Mark Tufo style, sarcastic, fun, human, well it is a awesome Mike Talbot Story !You just have to love Michael Talbot!"}, {"userName": "❤ArtfullySinful❤ ", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/37584317-artfullysinful", "userReview": "Literally a twisted tale that constantly kept you well on the edge of your seat. As Mike battled with his inner demons at the loss of Tommy, his heart is twisted beyond words. As Aliza confesses a love to him, he can't help but hide the betrayal he feels towards Tracy everytime they did something alone. As Bailey and Mike set out to try and defeat the lycan, Oggie runs off shortly after. As Mike comes across two small children, one boy and one girl, Bailey refuses to have their deaths, until the boy changes to a werewolf and threatens their very survival. As Mike stays gone for nearly a month, he comes across Mathiu, a man with the burden of murdering his family when he first shifted almost fifteen years earlier. As they enjoy beer together, the Lycan are never too far behind. As war breaks out over weapons between the Talbotons and several other groups, Mike's true colors are shown as he wipes an entire army down to nothing, causing Bailey to see him in a brand new and dangerous life. As Oggie saves the Alpha female, Sayra, the wolf pack and him team up, finally saving Mike and the fifteen odd survivors of Talboton left as the time before midnight end. Mathieu proves to be the allie as he chooses Mike's side over the werewolf. As Lana leads them back to Denarth, her home, they come across several other survivors, as they make a final stand for humanity's survival."}, {"userName": "Scott", "userReviewDate": "Feb 06, 2015", "userURL": "http://www.goodreads.com/user/show/6053609-scott", "userReview": "Just Finished Reading Lycan Fallout 2. Mark delivers again! I was a little nervous starting the Lycan Series because I read all of the Zombie Fallout books and knew most of the people I had spent hours listening to were gone. I started Lycan Fallout and it did not take long to get into the book, which I immediately followed up with 2. All the humor, gore, sarcasm and of course a new best friend who rivals Henry. I am going to order 3 this weekend!Keep em going Mark!"}, {"userName": "David", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/5369092-david", "userReview": "Fall of ManAnother great Instalment in the life of Michael Talbot, you can feel his humanity slowly oozing away. Even though he is a truly fractured hero, you cannot fail to love him and egg him on. His sense of humour is Infectious and his flaws numerous, but he is loyal to his friends and murderous to his enemies. Fab"}, {"userName": "Dominic", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/55648260-dominic", "userReview": "Another Great Mike T. adventure. I have NOT read his other series, but this book make me oh so curious. Lots of questions left unanswered at the end. Couldn't wait for book 2, now I'm dying to find out what will happen? Who will die? And how are the Wolves, Lycan, and Zombies going to help/hurt our survivors?!?!"}, {"userName": "Kelly Mccloskey", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/8819888-kelly-mccloskey", "userReview": "(Audiobook review)I don't think Tufo ever writes a bad story, but this one in particular was exceptional. Yes, it has werewolves and Lycan and even some new and old scariness I wasn't expecting.Runnette was perfect as usual & the story was everything I wanted and more. Action packed, thoughtful, funny and a few surprise guests from other Talbot-verses."}, {"userName": "Brigette", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/3209103-brigette", "userReview": "This book was not my favorite in the series. It was very dark, gloomy, depressing, and frankly hard to get through. Usually I can count on Mike for indomitable spirit in the face of great odds - but this one just never got there. I'm going to have to think about whether I'm going to continue with the LF brand."}], "description": "Mike is back. Devastated by his loss he strikes out on a doomed journey to wipe the earth of the Lycan scourge, with his faithful companion Oggie by his side. Bailey, a distant relative of Mike’s best friend BT, joins him but for different reasons. Azile struggles to reign him in, while a world already pushed to the edge begins its fall over the precipice. When all is lost, can anything ever be won? Join Mike on another epic adventure as he fights foes both new and old", "title": "Fall of Man\n      \n          (Lycan Fallout #2)", "url": "http://www.goodreads.com/book/show/24312449-fall-of-man", "average": 4.52, "cover": "https://images.gr-assets.com/books/1423652490l/24312449.jpg", "reviews": 49, "authors": [{"url": "https://www.goodreads.com/author/show/2990843.Mark_Tufo", "name": "Mark Tufo"}], "type": ["Horror", "Horror", "Apocalyptic", "Shapeshifters", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24312449-fall-of-man", "http://www.goodreads.com/book/show/24246747-fall-of-man", "http://www.goodreads.com/book/show/24482782-fall-of-man", "http://www.goodreads.com/book/show/8167001-zombie-fallout", "http://www.goodreads.com/book/show/15756383-a-plague-upon-your-family", "http://www.goodreads.com/book/show/10867262-the-end", "http://www.goodreads.com/book/show/12855784-the-end-has-come-and-gone", "http://www.goodreads.com/book/show/13506310-alive-in-a-dead-world"]}