{"ratings": 623, "userreviews": [{"userName": "Tea Jovanović", "userReviewDate": "May 09, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Kanadska, nagrađivana autorka... Već sam pisala o predivnoj kanadskoj književnosti... A Branini prevodi su izvrsni i pravo uživanje za svakog ljubitelja dobre knjige... :)"}, {"userName": "Howard", "userReviewDate": "Aug 31, 2009", "userURL": "http://www.goodreads.com/user/show/944528-howard", "userReview": "A fine example of seventies suburban grotesque, despite being set in the sixties and published in the eighties. Funny, stark, emotionally resonant, honest, sometimes surprising. Gowdy has a real grip on how kids/people do their best to normalize what isn't. Even if the kids feel like they're freaks and must keep the family secrets, it's all just the way things are to them, and they take bizarre behaviors in stride, because it's family. Sort of how we all are, of course.She's very good, I'll read more of her."}, {"userName": "Mary", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/4427991-mary", "userReview": "The year is 1969, and somewhere in an Ontario suburb, the Field family's fragile domestic peace is slowly coming to an end. The three Field sisters - Norma, Lou and Sandy - are each just trying to find their own place within their very eccentric, often miserable, sometimes hilarious family. However, the looming shadow over all of their lives is the tragically suspicious death of the family's first-born son - a secret which is never spoken of, but is nonetheless pervasive.The Field household is ruled by Jim Field - a philandering, heavy-drinking used car salesman - who is keen on the militaristic discipline of his children, and on keeping up appearances for the neighbors. Despite his poor treatment of his wife, he is still oddly protective of her, insisting that his daughters watch her all the time.His severely depressed wife Mary - a one-time dancer - has escaped into apathy and alcoholism a long time ago. Whenever her coffee cup is empty, her daughters rush to fill it with whiskey, for they realize she is living precariously in the wake of what happened to her baby son. Each of the teenage daughters has her own way of coping with her dysfunctional family. They try to make their own experiences while struggling with their family duties and concern for their mother. The eldest daughter Norma is the most responsible member of the family; quiet, subdued and selfless, she overburdens herself with domestic tasks and responsibilities, patiently putting up with her father's antics. She is also the only one intent on keeping the memory of her brother bright, determined to discover the secrets surrounding his death.The middle daughter Lou is the polar opposite of Norma. Lou fights for her autonomy within the family. She is the tough-talking, rebellious wild child; standing up to her father and loving her mother, even as she despises Mary's weaknesses.The youngest daughter Sandy is not as responsible as Norma, nor as rebellious as Lou. Sweet-looking Sandy devotes herself to becoming a perfect woman; with her own naive sense of femininity and sexuality. Each sister goes through her own rite of passage. They turn to drugs, sex, and schmaltzy fantasy - but repeatedly to one another. And, even after her death, the sisters still turn to their mother, and to the unusual love they discover their father still holds for her.I must say that while this book dealt with some seriously dark issues, I found that there was a thread of humor running throughout the story that I could totally appreciate. I thoroughly enjoyed reading this book - the story was well-written, easy to follow and the characters were sympathetically drawn. I give this book an A+! and look forward to perhaps reading more from Barbara Gowdy in the future."}, {"userName": "yexxo", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/2622581-yexxo", "userReview": "Kanada, Anfang der 60er Jahre: Die drei Schwestern Lou, Norma und Sandy wirken gemeinsam mit ihren Eltern wie eine normale Familie. Doch normal geht anders. Irgendein Geschehnis in der Vergangenheit führte dazu, dass die Mutter jetzt fast ausschließlich Whisky trinkt und ihre Tage schweigend im Bett oder auf der Couch vor dem Fernseher verbringt. Auch der Vater trinkt und je nach Stimmung schlägt er zu - lediglich seine Frau und Sandy verschont er, vermutlich weil letztere ein Ebenbild ihrer Mutter ist. In den Sommerferien sperrt er sich und die Familie im selbstgebauten Atombunker ein, den sie (selbst als sie kein Wasser mehr haben) nicht verlassen dürfen. Er ist ungerecht, gewalttätig und ein Despot, weshalb Lou ihn hasst, aber Norma ihn dennoch liebt. Die drei Mädchen sind so verschieden wie Schwestern nur sein können und jede reagiert auf ihre Art auf diese Form der Nicht-Erziehung. Lou ist rebellisch und kalt, Norma isst und isst und ist voller Liebe und Verständnis für alle, immer mit der Hoffnung etwas Liebe zu erhalten. Und Sandy, die Schöne, reagiert auf das stete Interesse an ihr mit sofortiger Zuwendung bzw. kann nicht 'Nein' sagen, was sie von Junge zu Junge und Mann zu Mann wandern lässt.Beginnend mit dem Ende, erzählt das Buch über einen Zeitraum von 10 Jahren aus dieser Familie, immer einzelne Episoden aus einem Jahr, sodass man die Entwicklung der drei Schwestern nachverfolgen kann. Obwohl sie altersmäßig nah beieinander liegen und somit alle die gleiche Ausgangsposition hatten, driften ihre Lebenswege immer weiter auseinander. Jede flüchtet angesichts der Familienproblematik in ihre ganz eigene Welt und geht diesen einmal eingeschlagenen Weg weiter - dennoch halten sie zusammen.Ich litt mit den Dreien und konnte ihr Verhalten gut nachvollziehen, wobei ich mich immer wieder fragte: Wieviele solcher Familien gibt es? An wievielen Häusern und Wohnungen bin ich schon vorbeigegangen, in denen das heile Familienbild nur Fassade ist? Der Autorin ist es sehr gut gelungen, nicht nur die Entwicklung der Schwestern zu beschreiben, sondern auch das Entsetzliche im ganz normalen Alltag darzustellen: Keine Monster, sondern 'lediglich' Menschen wie sie uns jeden Tag begegnen können."}, {"userName": "Perry Whitford", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/5485442-perry-whitford", "userReview": "Falling Angels begins in 1969 with a trio of sisters driving their drunken father to the funeral of their mother. Then, jumping back eight years to the time when the sisters first learnt about a family tragedy that pre-dates their own births but informs them all, Gowdy takes us for a short, spiky romp through the collective childhood of the three as they mature to various versions of womanhood under the neglectful eye of dysfunctional parents. Their mother had accidentally killed her first born, a son, by dropping (throwing?) him down Niagara Falls, and she spends all her time watching TV and getting slowly drunk on whiskey. Their father, a cars salesman and ex-military man, compensates for his wife's withdrawl by having various affairs and terrorizing his daughtersNorma is the eldest sister, overweight and serious by nature, taunted at school, she conjures up the spirit of her dead brother in order to hear a supportive voice inside her head; Lou is the middle sister, rebellious and profane, she \"walks a fine line between insolence and the showdown\" with her moody and abusive father; and Sandy is the youngest and prettiest, a \"living doll\" used to being indulged by all from an early age, later giving herself to various older men as a way to relive her childhood of being cradled in one male lap after another.It's an episodic narrative of both shared and solitary experiences, a flip book of prosperous uncles, predatory males and first sexual experiences. One stand-out chapter detailed how a trip to Disneyland was shelved during the Cuban missile crisis, their the father instead building a bomb shelter, forcing the whole family spend two weeks locked in together, living with limited resources and under a military regime of timetabled daily activities (exercise, toilet times etc). Despite the tragic elements, Gowdy doesn't linger on anything too long, but it's a no-less affecting read for the brevity."}, {"userName": "Serena", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/3524378-serena", "userReview": "Um well.. This book was really hard to read for me because some of the subject matter was really gross and mind you, I read Lolita without feeling this disturbed. I think it was because I wasn't really expecting all of the things this book contained and with Lolita, I was much more prepared for what was to come. Also, Lolita was more of a love story than this book will ever be. The tone of the book was quite dark throughout, with some sprinkling of humour here and there.I have to commend the author's writing. Although the present tense of the book did get annoying to read, Barbara Gowdy is probably one of the best authors when it comes to creating three-dimensional characters. Her characters are all fascinating and completely flawed. One thing I loved was the fact that she let us discover facts about the characters through showing rather than telling, which is so much better than spooning every last bit of information to a reader. Lou is smart, cynically so, but Gowdy didn't tell us that; she showed us through Lou's descriptions and thought process. The same goes for Lou's anger issues and for Norma being a lesbian. Sandy's characterization was a little weaker, in my opinion, simply because it seemed too stereotypical. This book also described childhood in a beautifully accurate way. Every family has its secrets, and as a child, you are often left in the dark about many of them because you apparently lack the maturity to handle it. Norma, Lou and Sandy discovering their family's big secret is key to the rest of the story as it chronicles how they handle it and how it affects them into their adulthood, and ultimately, what kind of people they become.This is definitely a heavy book to read, and I wouldn't recommend it unless you enjoy that kind of stuff. I never cried throughout the book but it definitely left an uncomfortable feeling in my chest."}, {"userName": "Daniel Kukwa", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/3885089-daniel-kukwa", "userReview": "One of the most epically depressing novels I've read in some time. This is a meticulously constructed tale of a depressed & damaged family, consumed by their frailties, pain & anger. There is nothing wrong with delving into a depressing novel; the great David Adams Richards is a past master of such work. But \"Falling Angels\" is akin to watching a car accident unfold -- you are desperate to look away, but you can't stop turning the pages. Compelling and chilling, but it isn't a novel I'm likely to re-visit...it's simply too soul destroying."}, {"userName": "Kim", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/7857097-kim", "userReview": "Lou is one of my favourite characters. Ever. She's like a foul-mouthed, teen-aged, cold-war era Anne of Green Gables. The chapter set in the bomb shelter is a stand-out, absolutely absurd and heartbreaking and hilarious. A lot of the chapters can stand on their own, outside of the greater context of the novel, but they come together to create a much more carefully drawn picture of this crackerjacks insane family, and I love it."}, {"userName": "Allana Shivshankar", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/5187802-allana-shivshankar", "userReview": "It’s been a few days since I’ve. finished reading this and I still find myself thinking about the Field sisters. It’s very rare for me to think about characters and their well being after I have finished reading a book but here I am. I connected with each sister on a deeply personal and human level. I hope that in some alternate book universe they are all living deeply fulfilling lives as adults."}, {"userName": "Ozlem", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/5050659-ozlem", "userReview": "Hâlâ hatırlıyorum."}, {"userName": "Linden", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/8911020-linden", "userReview": "Travmatik anne, baba ve cocuklarinin korkutucu gerceklikteki oykusu. Cevirmenin jargonlara uzak olmasi yazik olmus"}, {"userName": "Saad Serghini", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/70385311-saad-serghini", "userReview": "When I picked up the book I wasn't expecting to like it. I told myself I'd probably stop after a few pages. I was glad to find out I was wrong. The story is great."}, {"userName": "Laura", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/4771894-laura", "userReview": "I'm sort of at a loss to articulate why I disliked this book so much. I'm tempted to say something like \"It's not that I disliked it, it's that I didn't like it\" but that doesn't really cover it either.This book just didn't do anything for me, and was weird and gross and morbid and depressing on top of it.The story revolves around 3 sisters, Norma, Lou, and Sandy, who grow up in a majorly dysfunctional family. Their mother is a depressed alcoholic who literally does nothing all day, every day but sit on the couch watching TV and drinking. Their father is an abusive...nutcase, basically. When the girls are young, they find out that before they were born, their mother threw their baby brother over Niagara Falls.I hear what you're thinking. \"What? 1) Oh God, that's really awful and depressing. 2) I bet the book explores why she did that.\"1) Yes.2) Not really, no.Somehow this awful event plays basically no role in the story whatsoever, even though it is ostensibly what the story is about. (It's even in the book's blurb.) Occasionally one of the girls thinks of her dead baby brother while bringing their mother more whiskey on the couch, but that's about it.Meanwhile, Sandy, \"the pretty one,\" becomes sexually involved in a slew of older, married men. \"Gee,\" you might be thinking, \"1) That's a bit disconcerting, 2) I bet the book explores how she gets involved in these meaningless flings because of emotional void of her home life and how she feels about that.\"1) Yes.2) Not really, no.Norma, \"the fat one,\" struggles with self esteem issues. At one point she loses a bunch of weight. But then she semi-intentionally gains it all back. It's unclear why. At another point, her father tries to molest her (!!!!). 1) FUCK that's gross and awful. 2) That must radically change the way she feels about herself and her father and be a huge event in her life that is explored in depth.1) Yes.2) Nope. Pretty much glossed over and never mentioned again. (Yes, seriously. Glossed over. Ew. Just ew.)And so on.I'm not even really trying to criticize these plot points, gross and awful and disturbing things happen, and not all people/characters are introspective. So it's not that there's really anything objectively wrong with a book that does the things this book does....but to be frank, I just don't get it.I don't get it.Why did any of these things happen? Did the characters learn and grow? Is there some lesson or point to be derived from the fact that perhaps they didn't learn and grow? I really, truly don't know. Random, upsetting stuff happened and then the book was over.I just don't get it."}, {"userName": "逸农 石", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/35343033", "userReview": "In this tragic and comic novel, starting with a flashback, the famed Canadian author Barbara Gowdy tells a story, in an omniscient point of view, of a nuclear family of three sisters and a couple who lived in a suburban area. The storyline of this book stretches across a decade, flashing between our three protagonists(who were described in the title as “falling angels”): the Field sisters, Norma, Lou and Sandy. These girls grew up under the control of an arbitrary father, but it was their alcoholic mother who gave the girls the greatest influences of their lives. The girls stayed with each other at first, but paced down different ways later on. They were once naive and innocent at the beginning point of the timeline, but they matured, maybe even corrupted themselves through the events that took place in their lives.Gowdy’s novel featured in her description. Through her descriptions the characters were presented vividly and the surroundings served perfectly to uphold the characters’ personalities and emotional fluctuations. Gowdy has also set up suspenses well and the plot pushes the readers to keep on reading. The only weak point is that it has great time gaps between chapters; I got confused when turning a page, going into a new chapter, seeing the protagonists matured and realizing that two years have passed with no notification at all.This book would be recommended for youths aged 16 or higher. In conclusion, this is an interesting book to read, either for fun or for novel studies."}, {"userName": "Rob", "userReviewDate": "Jan 31, 2010", "userURL": "http://www.goodreads.com/user/show/3047405-rob", "userReview": "For all its promises of safety, suburbia sure seems to have created a number of warped, rebellious minds, Barbara Gowdy being among them. Falling Angels takes a seemingly innocuous suburban family and exposes all of the terrors hidden just beneath the surface. Of course, at this point this isn't exactly new material, but Gowdy pulls it off fairly well. It's a very readable novel, with likeable characters and more than one surprise.The main problem I had with Falling Angels is the gratuity of its horrific content. Gowdy seems to plot by constantly asking herself what the most traumatizing thing that could happen next is. So at one point the girls get a cat, but it runs away, and then ends up bloodily dead, so they run away from home, but they get lost, and get picked up by an old pedophile, but then he dies in front of them, and so on and so forth. After a while it just gets tedious. The second half of the novel, which deals with how the girls react to such a traumatic childhood, is more interesting.This is definitely not for the faint of heart, but it's a quick read and a solid novel."}, {"userName": "Louise", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "Another well-written story by Barbara Gowdy!! I'll be on the lookout for more of her work.Norma, Sandy and Louise (Lou) grow up with a demanding, cantankerous, military minded father in Toronto during the 60's. I'm not so sure I could have coped as well as they seemed to living with him. Their mother had her own set of problems brought on by dropping her 1st child, a son, over Niagara Falls to his death. She drinks herself into oblivion each and every day of her life but at the same time, has a profound affect on each of her daughters. Norma, Sandy and Lou are left to shop for groceries, clean house, cook meals, do laundry and be at the front door each day upon their father's arrival for inspection! Such a tragic life these girl's lead with an inattentive mother, a demanding, moody and at times absent father. Each of the 3 daughters cope with their dysfunctional situation in different ways.The story is full of surprises and unexpected happenings. The ending totally shocked me!I really would have liked the book to continue on a wee bit more so we could learn where Norma, Sandy and Lou went from the end."}, {"userName": "Carol", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/9253596-carol", "userReview": "This book was very well written. It's written from the perspective of 3 female siblings as they grow up from children-teenagers-adults in a household where parents have given up and behave badly. The siblings witness alcoholism, post-traumatic stress disorder and suffer mental and physical abuse. The perspective rings true as the book tells the story of Norma, Sandy and Lou as they cope with their parents' bad behaviour, making allowances and accommodations to get through their childhood relatively unscathed. It records the siblings as they find out about a older boy sibling who died in a very traumatic way that impacts the parents immediately and the three girls through out their lives.Sadly the tone of the book was so depressing, I stopped reading it half way. It's well-written but a tough subject to slog through without feeling horrible."}, {"userName": "Nutty", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/21239350-nutty", "userReview": "A good, flowing read, the different character stories were captivating, thrilling and depressing at the same time. It's been a long time since I read something as depressing as this, and still, the ending gave me a sort of feeling of \"everything will turn out just fine\". A sort of strength, like Norma's.The ending was bound to happen, I think I would have been amazed if it didn't. The road to it, however, was filled with wonder and dread and sadness for all the wrong turns taken.The scene with Norma tugged at my heart most, maybe because from the first paragraphs I identified with her - except, maybe, for the innate kindness that seems to flow so freely from her. In many other instances, I so identified with Lou that I wanted to cry. It's amazing how the author managed to capture the girls' essence without effort.The whole book was like free falling."}, {"userName": "Denis", "userReviewDate": "Nov 12, 2007", "userURL": "http://www.goodreads.com/user/show/166583-denis", "userReview": "Last year I read Barbara Gowdy's novel, Mr. Sandman, and it was my favourite read of the year. So, I've been anxious to try another one of her books.Falling Angels is a story of three sisters, Sandy, Lou and Norma, who grow up in a (highly) dysfunctional family, in Don Mills, Ontario, in the sixties. The story is an alternating 3rd person POV (from the three girls) that is pitiful, yet hopeful and funny. It's impossible not to feel for Gowdy's characters (but sometimes it's a feeling of hate and anger!) and I can't help but make comparisons here, with another novelist I like a lot, Anne Tyler. I loved this novel and am looking forward to her short story compilation, We So Seldom Look On Love. Cheerios!"}, {"userName": "Ann Douglas", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/4508160-ann-douglas", "userReview": "I discovered this book via the movie of the same name (adapted from the book), which I stumbled upon on TV a few years back. I was immediately captivated by this dysfunctional family. (Yes, I know every family is dysfunctional, but this family gives new meaning to the word dysfunctional.) I was worried that the book might be a disappointment, because I'd already seen the movie. I need not have worried. The characters in the book are even larger than life than their movie counterparts. If you're looking for a novel that features psychologically complex characters and an often hilarious (although dark, dark) plot line, this is the book for you."}, {"userName": "Magdelanye", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/5208681-magdelanye", "userReview": "It happens, and I had a faint echo when I picked this up at the library, but nothing concrete. As I read, bits came back to me until I realized that in fact the book had made a strong impression on me which conflated with some other reading from around that time. The Field family is the perfect archetypical disfunctional family. This is a chronicle not only of the survival strategies of 3 intrepid sisters but a wonderfully sly rendition of the 60's as it exploded in the lives of Canadians.  how fond I am of these 3 sisters, and of BG."}, {"userName": "Tianna", "userReviewDate": "Jul 23, 2009", "userURL": "http://www.goodreads.com/user/show/2434415-tianna", "userReview": "Story Progression/development: 4Characterization: 5Conflict: 3Conclusion: 4.5Additional Thoughts:The Field sisters really illustrate three very different personality types and their coping strategies. To hate, to selflessly forgive, and to deny the existence of a problem.Intense prose.It's an amazing book on triumph, survival, and failure.Quotes:"}, {"userName": "Shannon", "userReviewDate": "Mar 11, 2008", "userURL": "http://www.goodreads.com/user/show/964427-shannon", "userReview": "Gowdy has hit the head on dysfunctional family life at its worst—and keeps the reader interested and engaged throughout the entire book. Some of the scenes in this book rang almost far too true and I found myself taken aback to my own childhood, viewing scenes that really changed me into the person I am today. Must read more by this author."}, {"userName": "Susanne", "userReviewDate": "Oct 10, 2009", "userURL": "http://www.goodreads.com/user/show/2177807-susanne", "userReview": "Found this book at ValueVillage for $1.40 and had to buy it because B. Gowdy also wrote \"white Bone\" which had a huge impact on me. Falling Angels is ok....a bit sparse for my taste. The characters are dark and full of self-doubt, but she keeps them intertwined nicely so they don't feel isolated and meaningless."}, {"userName": "Elsje", "userReviewDate": "Nov 09, 2014", "userURL": "http://www.goodreads.com/user/show/4276614-elsje", "userReview": "Ook las ik Falling Angels van Barbara Gowdy. Een briljant verhaal over drie zusjes in het Canada van de jaren '60 van de vorige eeuw die elk een andere strategie ontwikkelen om met de gekte van hun dwingeland van een vader en de niet gediagnostiseerde klinische depressie en daaruit voortkomende alcoholverslaving van hun moeder om te gaan.Een dikke vijf sterren!"}, {"userName": "Jenya Yuss", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/17920068-jenya-yuss", "userReview": "Another wonderful book. It is scary how much I can relate to some of the things that happen to the three sisters. I honestly wish I had found this book 4 - 6 years ago, so that it would show me that I am not alone in my struggles. Very easy and fast to read. Only bad thing - extremely hard to put it down!"}, {"userName": "Linda", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/12243460-linda", "userReview": "This is the second book Ive read with this title. Strange... This one is better (so far) than the other book I've read by this title though.Really good book. Super dysfunctional family. Book jacket calls it a black humour/tragedy, but I saw no humour in it. Sad and pathetic. Compelling."}, {"userName": "Arielle", "userReviewDate": "Nov 18, 2008", "userURL": "http://www.goodreads.com/user/show/267488-arielle", "userReview": "Just saw the movie, from a Film Movement DVD release, and this movie rocked my world. Literally - I know this is a book review site, but I have to praise the soundtrack of this movie as one of the best I have ever heard!"}, {"userName": "Malcolm", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5860800-malcolm", "userReview": "1960's Cold War paranoia turns three teenaged girls lives to hell after their widowed father shifts them to an air-raid shelter. Someone once described Gowdy as Jane Austen on speed. It is a fair description of this novel (and that's something good!)."}, {"userName": "Viveca", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/14071981-viveca", "userReview": "A bizarro-world Little Women. Relentlessly ugly with every dysfunctional family trope included. Not recommended."}], "description": "Three sisters and their alcoholic father find their lives changed after the unexpected death of the girls' mother.", "title": "Falling Angels", "url": "https://www.goodreads.com/book/show/80973.Falling_Angels", "average": 3.82, "cover": "https://images.gr-assets.com/books/1312023523l/80973.jpg", "reviews": 42, "authors": [{"url": "https://www.goodreads.com/author/show/46105.Barbara_Gowdy", "name": "Barbara Gowdy"}], "type": ["Fiction", "Cultural", "Contemporary", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/80973.Falling_Angels", "http://www.goodreads.com/book/show/17904608-an-eli-tuge", "http://www.goodreads.com/book/show/27516795-fallende-engel", "http://www.goodreads.com/book/show/930643.Falling_Angels", "http://www.goodreads.com/book/show/930644.Falling_Angels", "http://www.goodreads.com/book/show/36141162-yaral-melekler", "http://www.goodreads.com/book/show/22921650-falling-angels", "http://www.goodreads.com/book/show/80966.The_White_Bone", "http://www.goodreads.com/book/show/80968.The_Romantic", "http://www.goodreads.com/book/show/818428.We_So_Seldom_Look_on_Love", "http://www.goodreads.com/book/show/80967.Helpless", "http://www.goodreads.com/book/show/80969.Mister_Sandman", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}