{"ratings": 56242, "userreviews": [{"userName": "Greg", "userReviewDate": "May 20, 2007", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "Stupid people read books because Oprah says so. Other stupid people won't read a book just because Oprah picked it to be part of her club. The second group of stupid people think they are very smart though, and they are usually pretentious windbags who say very stupid shit but with big words that people are supposed to be impressed with. The people in the second group will never read this awesome book, and I don't feel sorry for them because they don't deserve it. (A note: Of the second group they will also whine when a book from Oprah Book Club 2.1 (ie., the second incarnation of the book club which began with John Steinbeck's East of Eden, and was in it's 2.0 manifestation only going to be for dead authors, but then morphed into 2.1 to include such titles as The Road, and Measure of a Man) they want to buy is now affixed with the Oprah wrapper or sticker. They will now whine about the little blemish in the same way they whine when the book they now want to read has just been made into a movie and only comes with a movie cover. In both cases these people are bandwagon jumpers but don't want to seem like bandwagon jumpers and by buying the new edition of the book they will be seen as no different from the ignorant masses they so deeply despise. Again they deserve what they get, especially since everyone knows that you can goto a used bookstore and buy an old cover, and if you really need to lie to yourself and everyone around you, you can claim that the 1960's beat up mass-market copy of Steinbeck you bought was really bought by you in a much better condition when you were thirteen, and now you have worn the book down by your constant reading of it, and because of that you know the book soooooo much better than anyone else alive)."}, {"userName": "Wilma", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/45847087-wilma", "userReview": "Episch familiedrama gesitueerd in Cape Breton Island, Nova Scotia, rond 1900...pijnlijk, rauw...daardoor ook mooi...De jonge pianostemmer James wordt verliefd op de dertienjarige Materia...Haar ouders staan niet achter haar keuze en ze worden verbannen. Ze leven bewust geisoleerd...door het leeftijdsverschil en het verschil in karakter, voelt James weerzin voor Materia. Hij richt al zijn hoop en liefde op hun eerstgeboren dochter Kathleen. Zij heeft 'de stem', hij onderwijst haar en haar volledige onderricht is gericht op haar ontwikkeling en haar carrière. Dit vormt ook haar karakter. Alle gebeurtenissen die volgen vloeien hier uit voort...de gebeurtenissen (ik verklap niets...) zijn heftig, rauw...mooi...Een briljant debuut...een aanrader!!"}, {"userName": "Liberty Abbott-Sylvester", "userReviewDate": "Jul 04, 2009", "userURL": "http://www.goodreads.com/user/show/2457001-liberty-abbott-sylvester", "userReview": "OMG, I hated this book. It was painful to read. I spent a good 3 hours trying to read this book and ended up skimming the rest of it so I could be done with it. MacDonald covers just about every topic in her book: racial tension, isolation, domestic abuse, and forbidden love, which leads to incest, death, and even murder, but does it in a very complicated way that will turn many readers away. I consider myself a strong reader-one who has fantastic reading comprehension but this book tests even the strongest of readers. I felt that I had to read for days in order to get the jest of what she wrote about 30-50 pages back. It was ridiculous.I consider myself pretty open to reading just about anything but this one just was too much....I think I'll stick to my VC Andrews for my abuse and incest stories. She does them so much better than MacDonald did...and that's not saying much is it?I'll give it 1 star but to be honest I wish Zero stars was an option...maybe even negative ones. I will not be reading anymore of her books.updated shelves June 2011: zero stars due to skimming and not fully reading"}, {"userName": "K.D. Absolutely", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "For 15 years (1996-2010), Oprah Winfrey picked books for her book club. Out of the 69 titles that she chose only 13 (19%) have appeared in at least any of the three (2006, 2008, 2010) editions of Boxall’s 1001 Books You Must Read Before You Die:4 by TONI MORRISON (Beloved, The Bluest Eye, Sula and Song of Solomon)  2 by CHARLES DICKENS (A Tale of the Two Cities and Great Expectations)2 by GABRIEL GARCIA MARQUEZ (One Hundred Years of Solitude and Love in the Time of Cholera) 1 each by LEO TOLSTOY (Anna Karenina), ALAN PATTON (Cry, My Beloved Country), JONATHAN FRANZEN (The Corrections), BARBARA KINGSOLVER (The Poisonwood Bible), BERNARD SCHLINK (The Reader), and ANN-MARIE MACDONALD. Wait, Ann-Marie, who?You see, for me, her name does not really ring a bell. Similar to the names of others in the list like Pearl Cleage, Sheri Reynolds, Mary McGarry Morris, Edwidge Danticat, Billie Leats, Bret Lott, Melinda Haynes, Breena Clarke, Gwyn Hayman Rubio and Malika Oufkir. I think, they all became household names because their books were picked by Oprah. What was being included in the Most Influential People lists for so many years if she could not rally people to read her chosen books. I must admit that I read David Wroblewski’s The Story of Edgar Sawtelle and Ken Follett’s The Pillars of the Earth because of Oprah’s stamp. However, I have had no motivation to read right away her other choices including Fall on Your Knees because of what Jonathan Franzen said in the interview that Oprah’s picks catered more for readers who were women than men.On the superficial level, that still is my main comment for this book, Fall on Your Knees by Ann-Marie MacDonald. The story of 3 sisters: Kathleen the eldest. She is beautiful, a musical genius and an apple of the eye of his father; Mercedes, may not be as pretty as her siblings but she stood as the mother for her sisters when their mother died; Frances is as beautiful as Kathleen and she suffered in the hands of their father when the latter came back from the war. Joining them is Lily who is the daughter of Kathleen and a twin of the baby infant Ambrose who accidentally died in the hands of Frances when he and Lily were born. The 3 sisters’ mother, Materia completes the list of female characters. She is the only daughter of a wealthy Lebanese businessman. She defied her parents who wished that she would marry a dentist by eloping with her husband, James. So, the only male main character is the father James who may be good-intentioned and has big dreams for her children but he is weak to resist temptation and to overcome the psychological effects of war.So, there you go: 5 strong female characters versus 1 weak male character. So the mostly female adorers of Oprah cheer and clap their hands when Oprah raises the book and says “Hail, hail, read this book as I could not keep my hands from flipping over the pages while reading this!”However, for me, there are three saving graces for this book. And this maybe the reason why Oprah just flipped and flipped the pages till the wee hours of the morning:1. Brilliant first chapter that begins with “They are all dead now” then you follow the camera that zooms in to the things that the previous occupants of the house possessed and used.2. Character-driven plot. Mac-Donald’s characters are bigger than the old familiar themes (family love, sisterly love, incest, war, etc) that we have all seen in the movies and read in similar books. Jane Smiley’s A Thousand Acres easily came to my mind. For one, MacDonald was never melodramatic and you don’t close the book feeling emotionally cheated.3. Having said that, the denouement is well-handled. The use of the family tree not only wraps up the whole story but it provides the symbolism of the book’s main theme: family love, that no matter what we do, at the end of our lives, what matters most is our family. Then when you close the book, you know who the narrator of the first chapter should be. Well thought of novel. Well organized. Well written. For a first time writer, this is just amazing. Now, I no longer wonder why the Boxall’s 1001 editors chose this book over the more popular Oprah titles like The Story of Edgar Sawtelle, The Pillars of the Earth, The Road, The Heart is a Lonely Hunter, East of Eden, I Know This Much is True, She’s Come Undone or The Deep End of the Ocean."}, {"userName": "Tea Jovanović", "userReviewDate": "May 10, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Opet poetska kanadska autorka i opet veliko MUST READ... Ovakve knjige pamtite dugo nakon što ste ih pročitali i preporučujete je dalje... Nažalost, ne postoji srpski prevod..."}, {"userName": "Louise", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/1609164-louise", "userReview": "This book reminded me of a grown-up VC Andrews, except you can read it on the subway without feeling like a pervy 12 year-old. Very Gothic at times and the crazy family drama had me reading non-stop, despite all the main characters being unlikeable assholes in one way or another. One thing that bugged me was that some of the writing didn't seem historically accurate. Did people in the 1920s really say \"barf?\" Maybe they did, I don't know. Regardless, I couldn't put this down and I blew through it in a couple days."}, {"userName": "Carissa  Rogers", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/1519282-carissa-rogers", "userReview": "I was in a super geeky frame of mind when I read this book in early spring of 2012. I had been reading books about metaphors (see I told you... geeky). And as fate would have it I picked up this book suggested probably via the stream of books suggested on Amazon after you look at a book title there—right after my nerdy metaphor phase. I literally started writing down metaphors I came across in the prose of this book... AMAZING. Beautiful. I'm not talking about similes or simple comparisons people. I'm talking about brilliant metaphors,that blow my mind!!\"... the glass panes gloated...\"\"... the silvery sea flatters the moon.\"\"...cleanliness of steel born of soot.\"\"Shivering slightly at the unaccustomed breeze passing through the new spaces in her spine.\"\"She fell through a crack in time without spilling a drop. When she returned the tea was still piping hot.\"\"Teresa smiles at her. Frances collects the moment and puts in in a safe place, with 2 or 3 others.\" (other moments isn't that brilliant!?)\"The air (New York) is what the Gods live on.\"\"Sits down (in train station) serenaded by the (noisy) crowd.\"(Scared) \"It's autumn in her mouth and all her tongue can do is rustle.\" (Upon waking) \"Light in eyes: she buries her face in her pillow because the light is an eye operation... in the scalpel light.\"\"Kathleen is an abandoned mine.\" (after c-section/death)knocking) \"The door is thumping like a heart attack.\"(happy)\"He was Aladdin in an orchard dripping with diamonds.\"\"It was all boarded up, but he set to work, prying planks off windows, healing the blind.\"\"Her hair smells like the raw edge of spring.\"(he was a) Cucumber in a woollen suit.\" (vs cool as a cucumber).\"A bookish girl, plain as a rainy Tuesday.\"And possibly my very mostest favorite-est one of all: \"...enough merchandise to Mephistophelize a miner's wife.\"I didn't know that word could be a verb!! :)Oh the story? The Plot? Also fabulous. WORTH READING. Worth reading twice. Follows a young man in Nova Scotia and his life in a mining town. His young wife, their children and later the story of the children's lives... Epic. Amazing. Disgusting. Compelling. Sweet. Horrible. EVERYTHING a wonderful novel should be (and is). Okay just go read it already."}, {"userName": "Christine", "userReviewDate": "Sep 15, 2010", "userURL": "http://www.goodreads.com/user/show/4297124-christine", "userReview": "An amazingly harsh view of the hardships of life.This book is most definitely one of my favorites. It is absolutely amazing. It's scandalous, it's real, it's intriguing, it's just plain -good-! MacDonald's writing style creates an interactive world that pulls you in to first person view of the characters' lives. The story follows the Piper family, a unique little set up of father and four daughters. Mr. Piper's wife has passed, leaving him to fend for himself in a home bursting to the seams with the drama of being a young girl growing up with three other sisters. Kathleen, the eldest of the girls, has been sent away to live out her father's vision of fame and perfection with her glorious voice. Left behind are Frances (a fiesty middle child who lives by her own rules), Lily (the youngest of the four, living with a crippled leg and a strong desire to please and do good), and Mercedes (the second eldest, longing to take the place of their late mother and following her faith closely and fiercely). Each girl has their own story which is brimming with secrets that are both outrageous and real. Mystery is around every corner, and controversy hides behind each one. If I had to describe it in one word, it would be \"intense\". Every story is intertwined in surprising and unexpected ways. It's difficult to not fall in love with someone in the novel because there really is somebody for everyone to relate to. If you can stomach some harsh, dramatic reality with believable characters in a world covered with a dark veil of the unexpected, then this book may be the right way to go."}, {"userName": "BrokenTune", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "Lily stays sitting. “Frances. What if Ambrose is the Devil?” “He’s not the Devil. I know who the Devil is and it isn’t Ambrose.” “Who’s the Devil?” Frances crouches down as if she were talking to Trixie. “That’s something I’ll never tell you, Lily, no matter how old you get to be, because the Devil is shy. It makes him angry when someone recognizes him, so once they do the Devil gets after them. And I don’t want the Devil to get after you.” “Is the Devil after you?”“Yes.”This is Ann-Marie MacDonald's debut novel. I need to keep reminding myself about this fact that it's a debut novel because it is a polished work of complexity and beauty. Fall on Your Knees, set in Cape Breton at in the first half of the 20th century, tells the story of Materia, Kathleen, Mercedes, Frances, and Lily - i.e. all the women of the Piper family. Each woman has a voice, a distinct history, a distinct outlook on life - and a distinct fate. So, really this is a novel with five main characters - not to mention James, who dwells at the centre of all their lives.This book has so many layers that it was easy to be sucked into the world of the Pipers. But it is not a comfortable place. Far from it, it is a world full of harshness, brutality, and abuse, where each of the characters is trying to escape the confines of what holds them. Be it religion, loyalty, or something else - each character has their own form of imprisonment. \"God did not put me on this earth to stand by while my sister Frances is killed. Beaten is one thing. Wrongly touched is one thing. Stabbed with a bayonet is another. Push. Be strong enough to carry the burden of sin that goes with doing the right thing. There is only one saint in this family and I’m not it. God has made Mercedes a judge. No one loves you for that. Not like a crippled child who’s prone to visions. Whom Mercedes prizes. Not like a fallen woman who makes people laugh. Whom Mercedes loves.\"When reading some of the reviews, the aspect that I have picked up on most is that people have read this because it was an Oprah bookclub read. I am usually hesitant to follow up hyped up books, but sometimes, just sometimes, they are a exactly the type of book that will work their way into your soul.Fall on Your Knees is a perfectly constructed family saga, but it is also more than this. It is a beautifully sketched insight into the human condition. Mercedes is neither a saint nor a sinner. She is somewhere in between. She is why purgatory was invented."}, {"userName": "Shawna Williams", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/2706804-shawna-williams", "userReview": "Actually, I give this sort of a three b/c the author's style was oddly skillful, as a story though, it left a bitter taste in my mouth. Parts of the books were intriguing, other parts disturbing -- but given the subject matter I see no way around that; and yet, I can't quite get past it either.Frankly I'm just really conflicted. The writing style was definitely interesting. Choppy, metaphoric, sensational; the author was very effective in putting me inside the characters' heads. I admire her ability, but sometimes I wanted out b/c it was such a dreadful place to be.The father was a dispicable man, and there is no getting around that. The forgiveness between him and Frances at the end was somewhat redeeming -- sort of. The way Frances sent Lilly out into the world was weird. And the ending was unsatisfying regarding every character, except for Frances's son.Hmm...I think I'll be puzzling over this one for awhile, and maybe that was the author's goal. If so, then I give her 5 stars. I guess the best way to describe this book is mostly interesting, and extremely unsettling. Read at your own risk."}, {"userName": "Melissa Madrid", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/1009253-melissa-madrid", "userReview": "I discovered Ann-Marie MacDonald by accident, when I bought The Way the Crow Flies in a used bookstore during a biblioemergency. She hooked me instantly with her ability to get inside childhood, and her searingly real portraits of life in the 1960s, with the bonus of superb storytelling acumen and writing that is a pleasure to read. I read Fall on Your Knee second and had that wonderful enjoyment of a second shot of a writer who you liked so much the first time you didn't think you could have that pleasure again. Not only was Fall On Your Knees similarly satisfying, but it was uniquely satisfying for AMM's ability to create a nearly perfect gothic novel, along with all her other amazing traits. If I had to compare her to another writer, it would be Annie Proulx for her ability to give great reading plasure from the darkest of stories."}, {"userName": "Mimi", "userReviewDate": "Mar 05, 2010", "userURL": "http://www.goodreads.com/user/show/2690037-mimi", "userReview": "Okay - this is the second \"Oprah's Book Club\" book that I've read and, like DROWNING RUTH(Christina Schwartz), I disliked the story due to the disturbingly depressing plot. In DROWNING RUTH, the whole idea of a mentally-ill and controlling aunt (Amanda) ruining the life of her little niece (Ruth) after the girl's mother (Mathilda) mysteriously fell through the ice and drowned one cold winter eve was merely depressing; in FALL ON YOUR KNEES, however,the pervading theme of incest was more than distressing, it was just downright gross (and this is from an open-minded reader NOT easily shocked or bothered by sexual content!) Although I am always interested in reading books that deal with sensitive and even shocking topics (sometimes this makes a book more interesting!), I just don't find a need to experience incest in such poetic prose!There's one thing I don't get - in the description on the back cover, the story is called \"menacingly dark and hilariously funny\" and it is also called \"darkly humorous\". Maybe I'm missing something or perhaps I'm not sophisticated enough, but I just don't see any humor at all in this distressing tale - and, like I said, I'm a very open-minded reader!"}, {"userName": "Becky", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/2162877-becky", "userReview": "This book left me wanting to slash my wrists-- especially when I think about the time I spent reading it that I can never get back. Many people loved this book. I am not one of them. The characters are shallow,self-involved and just plain crazy and while I realize that this is just like the people you meet in your everyday I life, it doesn't necessarily mean I want to read about them unless they are delivered in a well-written story that makes them shine a little. This is not that kind of story.Reading this book (and I persisted because I am an open-minded reader) was like trudging through mud. And as open-minded as I am, I just could not take the rather graphic descriptions of molestation and incest. Ms. MacDonald, some times less is more. About 100 pages before the end I was ready to quit. I'd had all I could take of the simpering, whining, craziness and frequent spinelessness of the Piper family. I only kept reading because I was actually interested in the story of what happened to Kathleen in New York."}, {"userName": "jo", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/210397-jo", "userReview": "[the only thing i really do not understand is why frances wanted to have a kid, and to have it with ginger. i truly have no clue. (hide spoiler)]"}, {"userName": "EJ", "userReviewDate": "Jun 22, 2007", "userURL": "http://www.goodreads.com/user/show/103459-ej", "userReview": "MacDonald( the Canadian actress and playwrite)has truely shown the depth and beauty of her talent in her debut novel, Fall on Your Knees. Her words flow with ease, allowing the story to unfold as though real and not on a page. The historical detail, layers of generations and depth of the characters draw you in as you live their lives with them.Fall on Your Knees is a story of a family from Cape Breton, Nova Scotia. It is centered around four sisters and their relationships with each other and with their father. Set in coal-mining community of Nova Scotia, FYK follows the sisters as they come across the hardships and roles they must have in that particular culture. Set in the early 1900s, FYK also venturs from Canada and shines light on the Jazz scene in NYC during the 1920s as well as WW1.This is a book I am excited to read a second or third time.It took me longer than I had anticipated to finish this book. I savored her words as I cringed at the events. The hardships and lives her characters were born into broke my heart. I felt let down as every male character in the book was more than faulted. Each man had abandoned responsibility for a brief something....Sex, Money, alcohol. Family values and true love among the men were not present. A child's welfare did not matter. Perhaps MacDonald has been wronged by a number of men in her life....if that is so it shows in FYK.Not quite sure how to end this....it is an excellent book..but now as I am remembering all the events that occured and the hurt and pain I felt through mere words on a page perhaps once was enough."}, {"userName": "Jess The Bookworm", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/32042916-jess-the-bookworm", "userReview": "This is a novel set in a coal mining community in Canada and spans from before World War I, through the roaring 20s, and the great depression, as it follows the story of the Piper family. It follows the characters of James Piper as he marries his child bride Materia, who comes from a conservative Catholic Lebonese family, and due to the scandal of their marriage, is disinherited. They start to have children, and then everything starts to get twisted. It appears that Mr Piper has way too much of a liking for young girls, and especially one of his own daughters. The book covers many dark themes: statutory rape, rape, suicide, incest, depression, prostitution. But, even besides all of the above, I actually found myself to be bored while reading this. I really wanted to start skim reading at one point, and then really contemplated giving up on it altogether. But I did push through, and it was an intriguing story, just not something that really gripped me."}, {"userName": "Shane", "userReviewDate": "Mar 17, 2010", "userURL": "http://www.goodreads.com/user/show/1798222-shane", "userReview": "A novel full of dark secrets, revealed gradually over the course of its immense length. I had this book on my shelf for over three years before attempting to read it, wondering how the author would sustain my interest over its 560-plus pages. And, once making the bold attempt to finally pick-up the book, I had difficulty putting it down at times.The novel is visual, reminiscent of a screenplay. MacDonald uses a variety of techniques to hook the reader: the rapid mixing of tenses and point-of-view, anchoring the story along pivotal events and replaying those scenes from different vantage points like different camera angles applied for the same screen shot, hiding information in scenes and gradually revealing more clues in subsequent takes of the same scene, using combinations of journal, memory, snappy and irreverent dialogue and tight unconventional narrative that focuses on visual imagery rather than on syntactical propriety - yes, a masterful performance for a first novel, and great learning for emerging novelists.This story has a resemblance to the King Lear tale but is not as obvious as in recent re-takes such as Jane Smiley's \"A Thousand Acres\". The patriarch, James Piper, marries a Lebanese child-bride and begets daughters, some whose mothers are unclear until the end. There is Kathleen the budding opera singer, Frances the evil one, Mercedes the pious one, and the crippled Lilly the saint. Incest is at the core, which hobbles and fractures the family over a time horizon spanning the dawn of the twentieth century to the 1950'sPivotal events such as Kathleen's tragic birthing of twins and its series of catastrophic aftershocks, Frances' shooting and the events that precede and follow, the unravelling of what happened to Kathleen in New York - are all launching points to move the story forward and grip the reader in a non-stop read.The four sisters emerge gradually from their childhood as the indistinguishable offspring of James Piper, into fully flushed characters with different personalities and histories over the time span of this novel. Unfortunately, Momma, or Materia their Lebanese mother, gets no accolades for the girls' destiny, apart from a few Arabic words they banter around, and the occasional Middle Eastern dish they prepare for James. Daddy, in his twisted, well meaning way, gets all the credit for the disasters that befell their lives. A great read, I recommend it."}, {"userName": "Nicky Dierx", "userReviewDate": "May 11, 2012", "userURL": "http://www.goodreads.com/user/show/6942785-nicky-dierx", "userReview": "I read this book because my partner and I have an agreement. We both love wildly different styles of books, so we each choose one of our favourites and make the other person read it. This was her choice (I made her read A game of thrones in case you're wondering).I hated this book for it's subject matter and content. The damn thing ended just when it started getting interesting and glossed over anything that was actually worth finding out more about. (roughly the last third was fantastic, but she skipped over so many things that by the end I was more than a little disappointed.)I didn't give a damn about any of the characters, couldn't identify with the setting and felt like the last third of the book, with it's incredibly different tone, would have better stood as it's own book.That being said I love the author's turn of phrase. This for me is the literary equivalent of listening to someone with a beautiful voice read the phone book. The content is meaningless but damn it sounds good."}, {"userName": "salt", "userReviewDate": "Apr 25, 2007", "userURL": "http://www.goodreads.com/user/show/68801-salt", "userReview": "I kept picking it up and putting it down in frustration. I know so many people loved it, but when I saw it come up on Oprah's book list I just wanted to die. So much was happening, but being written about in the most boring way possible. It didn't hold my interest, which is rare since as a Canadian I was brought up on the typical Canadian novel diet. It amazes me how so many Canadian writers can write books where lots of big important things happen, yet do it in a way that just makes them so b.o.r.i.n.g. It also amazes me that this is what passes for a good Canadian novel. The content was interesting, but executed badly."}, {"userName": "Leslie", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/2195363-leslie", "userReview": "One of those cases that I wonder if I read a different book than everyone else. I’m not going to give this book anymore of my time by writing a detailed review. The only reason I’m giving it two stars is because I did actually finish it and the beginning was interesting. Then it just dragged on and on until my eyes glazed over. Nope."}, {"userName": "Lucrezia", "userReviewDate": "Nov 11, 2013", "userURL": "http://www.goodreads.com/user/show/9859921-lucrezia", "userReview": "Tanto alla fine muoiono tutti. E non lo faccio io lo spoiler ma bensì l' autrice stessa nell' incipit del romanzo:\"Ormai sono morti tutti.\"Da qui si deduce che faremo opera di ricostruzione, ma a chi non piacciono le ricostruzioni? A chi non piacciono i dettagli, mi potrebbe essere risposto, che pure vi è gente che non li gradisce, al che mi viene da pensare però che chi non apprezza i dettagli possa essere solo una persona enormemente superficiale una di quelle che urlano e non sanno ascoltare.C' è più della storia di una vita di una persona in quello che butta nel cestino, in come sistema le sue cose, o come accoppia i colori di quella che potrete mai trovare in qualsiasi altra cosa.I dettagli sono importanti perché distinguono una persona da un' altra, una storia da un' altra. Questo mi fa venire in mente quando da piccola dopo essermi cacciata sotto le coperte e aver lasciato solo fuori il naso (per pure esigenze respiratorie si intende) così da essere protetta da eventuali attacchi notturni da parte di agguerritissimi mostri (la cui visione di Monsters and Co. mi aveva confermato l' indubitabile presenza) pretendevo la mia brava storia della buonanotte come la più ordinaria delle bimbe.E quindi si ripartiva di nuovo con cappuccetto rosso o biancaneve o con l' evergreen Andersen i cui tragici finali ohimé mi hanno sempre ammaliata. Tuttavia per ogni storia,ogni volta, c' era qualcosa di diverso in me, o nella storia stessa, nei particolari della storia, se questa veniva narrata oralmente senza prenderla da alcun libro. Rose che ad un certo punto di questo libro, quasi alla fine, devo dire, conoscerete, dice una cosa che mi ha colpita ma con la quale posso solo parzialmente dichiararmi d' accordo:  \"Non sono una compositrice. Metto insieme delle note sul momento.\" Io le ho detto che questo si chiama comporre, ma lei ha ribattuto che non scrive mai la musica. Ogni volta è diversa. \"Allora la scriva\" e lei \"No\" \"Perché\" ho chiesto.\"Perché così uccidi l' uccello\" fa lei.Rose ha ragione, per un certo verso, non si può mai replicare la magia di un singolo momento in musica, per quanto tu possa riascoltare sempre e sempre la stessa canzone, ogni secondo che passa in ogni riascolto avrà una valenza diversa.Però, appunto per questo, anche se la musica è sempre quella, sempre la stessa successione di note, cambia la maniera in cui \"ci veste\". E cosa è questo se non un particolare?La stessa cosa dicasi per le storie, potrei dire che questa è una delle tante saghe familiari al mondo, da Marquez a Irving passando per la Ginzburg facendo una capatina anche per Eugenides. Potrei dirlo, ma quanti particolari trascurerei e quanta magia gli toglierei. Magia, che nelle saghe famigliari c'è sempre, perché cosa è che ci consente di stare ancora insieme senza farci fuori se non un pizzico di un particolare tipo di magia?Perdetevici dentro, nei vostri momenti scandalizzati, impietosi, pietosi, felici, simpatizzanti e non, e buona lettura.Sono proprio curiosa di sapere per chi simpatizzerete. Lei dice che la musica è già nell’ aria e sta a noi aprirle un accesso nel nostro mondo per poterla ascoltare . Come se il mondo fosse pieno di musica che non riusciamo a sentire “a orecchio nudo”. Così oggi a lezione ho pensato: d’ accordo, la canzone come andrebbe cantata sta scintillante intorno a me come aria nel deserto, io non devo fare altro che accoglierla. Allora ho chiuso gli occhi e mi sono aperta lasciando che la canzone mi attraversasse e ho pensato: “ nom cantarla, liberala”. Quando ho finito, il kaiser ha annuito. Ho guardato Rose, che ha rivolto un minuscolo sorriso ai tasti."}, {"userName": "Serena.. Sery-ously?", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/2926860-serena-sery-ously", "userReview": "Ormai sono morti tutti. [Resistete ad una frase del genere!!]Credo che il titolo originale sia molto più evocativo e crudele: Fall on your knees . Ma non c'è problema, perché il libro è abbastanza evocativo e crudele di per sè. Sfido chiunque a leggere questo libro e non venire assalito da una valanga di sentimenti contrastanti: pietà, odio, amore, tenerezza, disperazione, impotenza.E' un libro crudo e doloroso, eppure in grado di tenerti lì incollato alle pagine, con un desiderio quasi perverso di andare avanti e scoprire quali altre disgrazie aspettino la famiglia Piper: perchè ad ogni pagina c'è un elemento che ti fa piangere il cuore.Tutto inizia con la fuga d'amore di James, 18 anni, e Materia, 13, già promessa in sposa ad un altro uomo. La famiglia di Materia non li perdonerà tanto facilmente, anzi: il padre la maledice e la disereda.La maledizione ha effetto: Il marito si si pente di averla sposata, si vergogna a farsi vedere in giro con lei e quando nasce Kathleen, sua pupilla, non la tocca nemmeno più.I drammi della famiglia non finiscono: un parto difficile, la morte di Kathleen per parto, il suicidio di Materia perché ha peccato: ha salvato i due bambini e non Kathleen (Che in cuor suo, non è mai riuscita ad amare); il maldestro tentativo di una bimba di sei anni di battezzare i nipotini, la stessa bambina che, cresciuta, è incapace di farsi amare e con tutta probabilità, di amare a sua volta. (Però la stimo: le sue bambole hanno dei nomi assurdi: Scarlattina, Rose Difterite, i marinai gemelli Tifo e TBC Vedetta, Vaiolo, La Spagnola e Colera La France).Mercedes è una bambina stupenda: credo di non aver mai provato tanta tenerezza e amore per nessun personaggio letterario. L'adotterei, se fosse possibile.A 7 anni, quando la mamma si suicida, il padre le affida la cura della sorellina (6 anni) e della nipotina (appena nata), e si trova a crescere improvvisamente, senza l'aiuto di nessuno. Si fa carico delle sorelle, del padre (Che cerca sempre di soddisfare in un modo così commovente che ci sarebbe da piangere), della casa e dei veterani della guerra. Continuando ovviamente ad andare a scuola. Ha una pazienza e una bontà infinite, roba che Gandhi dovrebbe solo che prendere lezioni.Purtroppo lo stile della MacDonal non è quello che si dice perfetto: passa dal passato al presente, passando dalla terza alla prima persona in modo a volte confusionario.. A volte poi i dialoghi non sono nemmeno virgolettati.Ma per il grande impatto che dà la storia, ad Ann-Marie si perdona tutto.La V stellina è perché l'intera vicenda si svolge nel mio amato Canada, e più precisamente nella Nova Scotia, dove ho passato 6 mesi della mia vita.. Insomma, l'ho sentito super vicino. :)Ah, la V stellina è anche per il fatto che la famiglia di Materia ha origine arabe, dal Libano, più precisamente, e quindi nel testo sono frequenti frasi in arabo.. Ho molto apprezzato, anche se ne ho capite la metà!!"}, {"userName": "Leanne", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/5873788-leanne", "userReview": "Where do I even start with this one? This is heavy, heavy stuff, full to the brim with family secrets. And some of these are some pretty hardcore secrets. When asked by a co-worker what I was reading lately, I barely knew what to say - \"Well, this book about a family, and their gross father, and there's a lot of incest...\" But while there is definitely a very strong undercurrent of incesty feelings and behavior running through the entire novel, there is much more to it.It's hard to give a high level summary of the plot without diving into all of the intricacies. Basically, it's a family saga about 4 sisters and their father living in Cape Breton that spans maybe 30-40 years (I'm too lazy to officially work out the timeline in my head!) There are several main events that you learn about slowly, by jumping back and forth in time until all of the mysteries are finally revealed. This storytelling device works well here - it never feels disjointed, and makes it more exciting (as well as, admittedly, icky).None of the (main) characters are particularly likeable. They all have some redeeming qualities - Frances is bright and vivacious and fun before her rebellious behavior just becomes over the top, Mercedes really is just trying to take care of her family, even as she comes off as overly pious and condescending, and Lily is altogether innocent, but she does certain things that make you want to strangle her. Even Materia, who is for the most part a victim forced into a strange and vaguely sadistic marriage at the age of 12, didn't elicit full sympathy from me. Often, not connecting with any of the characters on a personal level ruins a book for me, but in this case I was completely fascinated. Having had a very normal childhood with very normal parents and a sister, reading about a family like this was compelling and satisfyingly twisted.To me, this book was dark and sad, but there was a beautiful quality to it too. It wasn't necessarily the best time for me to read it, as the weather is finally becoming sunny and gorgeous - I feel this type of sordid book is more suited for the dark depths of winter. The prose is hazy and wistful and sad, and it's just such a good story. I'm sorry that it took me so long to become aware of this book and to pick it up, and at 584 pages it was an effort, but it was well, well worth it."}, {"userName": "Scooping it Up", "userReviewDate": "Dec 23, 2009", "userURL": "http://www.goodreads.com/user/show/2726439-scooping-it-up", "userReview": "I cannot recommend this book. I actually threw it away after finishing it.This tells you a few things. 1) The writing was so good and compelling and addicting it made it difficult for me to stop reading, despite my issues with it. 2) I didn't want anyone else to read it, so I didn't give it away or sell it. How's that for hypocritical and childish?There were some sexual images, specifically incest, that I could not shake from my brain for several days. I kept replaying the scenes over and over and over again. It really bothered me.I don't like artsy descriptions of horrible perversion. One part of this book that I LOVED was in a marital-infidelity situation. The husband was systematically, purposefully seduced by a rather messed-up younger woman. He was a good man, a good father, and found himself in a very bad situation. Afterwards, he ran straight to his wife and told her. He was repentent, miserable. She instantly forgave him. She knew it would never happen again. And it didn't. It was a very cool concept that their marriage, their family was bigger than a moment of weakness. What he did was horrible. But to her, it wasn't horrible enough to lose what they had. I really admired this idea. It's not how we look at marriage very much today and it was refreshing. I enjoyed her writing style, obviously I was sucked in enough to read through it, but my heart was really dark and cloudy for a few days after reading it. Won't touch it again."}, {"userName": "Rowena", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/2990642-rowena", "userReview": "I loved this book! It was beautiful, witty, poignant, sad and educational.James was a sick,sick man. Families can really have so many dark secrets."}, {"userName": "Jennifer (aka EM)", "userReviewDate": "Aug 05, 2008", "userURL": "http://www.goodreads.com/user/show/1393336-jennifer-aka-em", "userReview": "This five-star rating is the one I gave Ann-Marie MacDonald's powerhouse first novel the first time around, but I confess I was remembering and rating it at a great distance. I'm going to think on my second rating a bit more, but I can tell you that this was a very different read this time. I don't know that I liked it as much - although I recognize the mastery of its writing and characterization, and the amazing imagination behind the story. And I love how Cape Breton it was. But it was also gruelling and painful; it was long and sloggy at the 2/3rds to 4/5ths mark. And of course, having read it, the big reveal at the end was not the shocker it was on first read. I think I'll land on a high 3, so let's say 4."}, {"userName": "Rachel", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/1361935-rachel", "userReview": "I stayed up until 3:30am last night to finish the last 60+ pages of Ann-Marie MacDonald's Fall on Your Knees. I'll admit that I am always a bit of a night owl but even I don't stay up that late often. However I just couldn't put this book down. As the book wraps up it just pulls you in like passing a bad car accident. You know it's going to be disturbing and hard to watch but you can't look away.Fall On Your Knees (Oprah #45)The book follows the Piper family from the late 1890's through several generations of increasingly disturbed individuals. In the beginning of the book James Piper is a piano tuner who ends up running away with Materia Mahmoud, the daughter of one of his clients. Oh, did I mention that Materia is a mere 12 going on 13 at the time? What comes from their union is the stuff that episodes of Maury Povich are made of. Incest, lies, deception, secrets, and more drama than you can shake a stick at. James is ambitious, self righteous and a bit of a pedophile. His wife Materia is simple, a little childish and resentful of the path her life has taken.They have three daughters as different as can be. Kathleen, the oldest and the apple of daddy's eye who has an operatic voice of an angel and she knows it. Frances, the wild child and Mercedes, who is very pious and good and who tries desperately to keep her family in line and together but she ends up being sucked into the depravity too, by the end of the book.I didn't think I would like this book at first. None of the main characters are like-able. In fact, most of the smaller characters are unlike-able as well. These are deeply flawed individuals, making horrible choice after horrible choice and yet I became invested in their story.Like a bad talk show, the book is filled with many OMG and WTF moments and even a few that left me asking \"Wait....WHAT?\" as I frantically read on to see what was going to happen next.Of course I don't get my answers till much later in the book. Ann-Marie MacDonald often reveals major events early but doesn't show the journey that led to those events until much later. The point of view shifts often and you may think you know the story as you read it from one POV, you find that you were very mistaken as the same events is retold through a different character. It kept me guessing and as I finished the book I realized that all was definitely not as it seemed.It was an extremely dark book, I disliked all the characters and there are very few happy moments but I ended up loving it."}, {"userName": "CaseyTheCanadianLesbrarian", "userReviewDate": "Jun 26, 2012", "userURL": "http://www.goodreads.com/user/show/10463035-caseythecanadianlesbrarian", "userReview": "What to say about this devastating masterpiece? It's the 2nd time I've read it, and while it was hard to read the 1st time, I think re-reading is perhaps worse, because I knew the horrible thing that was coming (incest/rape). I don't really know how Ann-Marie MacDonald writes beautifully about such dark things, telling the intergenerational story of this fucked up family. The voice actor does an incredible job with the audiobook. If you can stomach it, this is a masterpiece, as I said. But fuck is it ever dark.Full review / personal essay on my blog!"}, {"userName": "Bonnie", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/1424859-bonnie", "userReview": "A novel I remember reading, and having a difficult time to put down. And didn't, very often, despite the 500-plus pages..."}, {"userName": "Kimberly", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/7367875-kimberly", "userReview": "This book is one of those books that you either love it or hate it. I loved it. In fact its one of my favorite books of all time. Its dark and deep but beautiful. The book is actually based in the town I grew up in so it was interesting to read about the town I grew up in only during the setting of the book. It was wonderful to read about the church I grew up in, my grandmothers church and later, the church I married my husband in. The book being set in Cape Breton was what grabbed my attention but the story dragged me in and kept a death grip on me til I finished it. The first time I read it, I actually stayed up all night to finish it. This book is not for the light at heart. If you don't take any enjoyment from stories that talk about incest or other related but depressing topics, then this book is not for you. If you are looking for a happily ever after, go find something else. This isn't a fluffy and happy novel. This is a book that I will always turn to when I want to reread a favorite."}], "description": "They are the Pipers of Cape Breton Island — a family steeped in lies and unspoken truths that reach out from the past, forever mindful of the tragic secret that could shatter the family to its foundations. Chronicling five generations of this eccentric clan, Fall on Your Knees follows four remarkable sisters whose lives are filled with driving ambition, inescapable family bonds, and forbidden love. Their experiences will take them from their stormswept homeland, across the battlefields of World War I, to the freedom and independence of Jazz-era New York City.Compellingly written, running the literary gamut from menacingly dark to hilariously funny, this is an epic saga of one family’s trials and triumphs in a world of sin, guilt, and redemption.", "title": "Fall on Your Knees", "url": "https://www.goodreads.com/book/show/5174.Fall_on_Your_Knees", "average": 3.95, "cover": "https://images.gr-assets.com/books/1481449709l/5174.jpg", "reviews": 2758, "authors": [{"url": "https://www.goodreads.com/author/show/3515.Ann_Marie_MacDonald", "name": "Ann-Marie MacDonald"}], "type": ["Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/5174.Fall_on_Your_Knees", "http://www.goodreads.com/book/show/150471.Fall_on_Your_Knees", "http://www.goodreads.com/book/show/6333327-laten-wij-aanbidden", "http://www.goodreads.com/book/show/956393.Fall_on_Your_Knees", "http://www.goodreads.com/book/show/1024347.Fall_on_Your_Knees", "http://www.goodreads.com/book/show/10213569-fall-on-your-knees", "http://www.goodreads.com/book/show/3995948-chiedi-perdono", "http://www.goodreads.com/book/show/956398.Fall_on_Your_Knees", "http://www.goodreads.com/book/show/7199.The_Way_the_Crow_Flies", "http://www.goodreads.com/book/show/21494400-adult-onset", "http://www.goodreads.com/book/show/72439.Goodnight_Desdemona", "http://www.goodreads.com/book/show/2206728.Belle_Moral", "http://www.goodreads.com/book/show/775343.The_Arab_s_Mouth"]}