{"ratings": 32, "userreviews": [{"userName": "Amber", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/23016460-amber", "userReview": "This was a pretty good and funny Brian Keene story that I listened to that the author read online at this link:https://www.youtube.com/watch?v=b8aI1... . The story is about this guy who is obsessed with zombies and when he sees real zombies shambling down the street he goes nuts. Are they really zombies though? Listen and find out for yourself."}, {"userName": "Texv Velis", "userReviewDate": "Sep 05, 2012", "userURL": "http://www.goodreads.com/user/show/2088982-texv-velis", "userReview": "Really funny short story http://www.youtube.com/watch?v=b8aI1b... is a link to Brian Keene reading it out loud."}, {"userName": "Jonathan Echevarria", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/31868064-jonathan-echevarria", "userReview": "This novella was included in the amazing collection called Blood on the Page: The Complete Short Fiction of Brian Keene, Volume 1. It was a fast wild ride which had awesome commentary by Brian Keene at the end of it. If you were ever a fan of George Romero's zombies or if you still are a fan of the undead then I recommend checking out Brian Keene's work. Not only does he reinvent the zombie mythology into something incredibly refreshing and new in the The Rising series, but he also stays true to classic mythology in the fan favorite series called Dead Sea. Even if you aren't a fan of zombies Brian Keene offers something for everyone in the horror genre. Check out his short story collections and see which aspect of horror appeals to you the most!"}, {"userName": "Mike Kazmierczak", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/7313104-mike-kazmierczak", "userReview": "Camelot Books actually labeled this as a chapette instead of a chapbook. At four pages, I suppose that it qualifies as a bit short for a chapbook. No matter what you call it though, it was a good story. Without giving anything away, the story follows Ken, an avid zombie fan who is not quite connected to the real world. Like all of Keene's work, the characters ring true to reality and are easy to imagine. Most of the story is set up for the ending but considering the length, totally expected. I know the story has been included in a short story collection somewhere because I remember reading it elsewhere; I just don't know which one. When you do find it yourself though, I'm sure you will enjoy the story."}, {"userName": "Antonis", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/4749075-antonis", "userReview": "This was a very short story about a guy and his obsession about anything zombie related. I don't think it was anything special, even the twist at the end was nothing spectacular. It's funny, it's short and it's free. I won't advice against reading it but you won't really be missing anything if you don't."}, {"userName": "Kaisersoze", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/22517400-kaisersoze", "userReview": "A great short story that is both simple and brilliant in its execution. Besides, you have to love an author that gives himself a hard time within his own story.4 Zombie Aficionados for Fast Zombies Suck."}], "description": "", "title": "Fast Zombies Suck", "url": "http://www.goodreads.com/book/show/13360260-fast-zombies-suck", "average": 4.19, "cover": "https://images.gr-assets.com/books/1410801906l/13360260.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/52050.Brian_Keene", "name": "Brian Keene"}], "type": ["Horror", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/13360260-fast-zombies-suck", "http://www.goodreads.com/book/show/216213.The_Rising", "http://www.goodreads.com/book/show/90577.City_of_the_Dead", "http://www.goodreads.com/book/show/216215.Dead_Sea", "http://www.goodreads.com/book/show/155977.The_Conqueror_Worms", "http://www.goodreads.com/book/show/216211.Ghoul"]}