{"ratings": 1980, "userreviews": [{"userName": "Elisa", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/1333633-elisa", "userReview": "Cute, but lame. I didn't expect anything deeply brilliant or life-changing or anything from a kitschy humor book with a cute twist on an old theme, but the execution of it all was still weak. It felt like an unfinished draft that didn't take itself seriously--even (especially?) in the humor. The seeds are there for what could have been a sophsicatedly handled comedy based on moving meaningfulness, but they were left lazily unpolished. The prose in this book reminds me of the titular character's pet peeve--potential failed to be reached due to the hangups of weakness... meh.Okay, it's time to rant. Beware, below are where the spoilers start:Where the author attempts David Sedaris-style sardonic witticism telling Terry Pratchett-style jokes, he instead produces cliche snark that aims for the cheapest laugh at every possible occasion. And I'm not just talking about puns...I will readily admit I enjoy a good pun. I actually thought the line about \"Destiny waxes\" was funny. But the constant references to historical disasters as being the slapsticky goofs of cosmic deities gets old after the first eight times. The thing about this book is its running gag is its prose.I'm talking pot-shots at consumerism and brand name dropping in 83% of its chapters.I'm talking shallow cookie-cutter characters that play on every POSSIBLE stereotype. I'm talking cliche pop-culture references that were maybe funny the FIRST time I heard them on late night talk shows SEVEN YEARS AGO.I get that it takes a while from the start to end process of creating a novel. But seriously, this book has been in print less than three months and the comedy is already that dated??And back to the characters. The main character is a perfect stereotype of a dude's dude--at least in the NYC metro-sexual sense. His superficial concerns all have to do with gratifying his physical impulses, and HE complains about modern man's hangup on instant gratification? Easy for him to talk when he never has to WONDER about what the future brings in regards to any of his actions. This character should have been Id, not Fate. He has the perfect body, the perfect apartment, and the perfect girlfriend, the perfect down-to-earth tastes for the good old days, but he's soooo unhappy with his lot in existence. Is this supposed to blow the readers' mind with how similar this amazing immortal being is to normal humans? It just comes off as weak cliche. And then there are the women...the only two women in a cast of dozens that are of any consequence to the plot are the madonna and a whore. You think I'm being metaphorical? No, really.Sara exists as nothing more than man's perfect girlfriend. She has no motivations or wants other than to live happily and enjoy life. She loves her man just because she does, and when she's not perfectly content spending all her scenes pleasing him, she's frolicking in healthy ways and doing charitable works because she's just so happy and content in her life that she can spread that joy around. Her biggest flaw is that she asks her man too many questions because--oh horror--she wants to get to KNOW better the man she's in love with and finds no flaw in. Considering the fact that she's supposed to be the modern take on the immaculate conception and birth the next messiah, she's no saint in the bedroom and when it comes to indulging in harmless substance abuse--all the fun stuff. What more perfect creation could a man wish for?? She also doesn't even have any friends. Sure she's new to the neighborhood, but months pass. You think she'd make some friends! Her only friend is her boyfriend, but she's never lonely or wants for more. We meet and hear of more of her man's friends, acquaintances, and coworkers than can be counted on both hands! The only other \"friend\" Sara even mentions is when she gets deceived into being buddies with \"Delilah.\"And speaking of her... Destiny is a superslut that would make even secondwave feminists roll their eyes. If metaphysical concepts are going to be personified, can we at least make REAL people out of that list of adjectives that are used to describe them? She is \"cruel\" \"desirable\" \"base\" \"raw\" \"overglorified\" \"artificial\" \"selfish\" \"vain\" but what about the \"but also...\" portion of that list?? Why do we only see the bad qualities of this antagonist? What happened to that storyteller's rule of the best villains being those with something to love so that they have something to lose, reason to exist, reason for the audience to care, etc etc...?? And you can bet these two female characters don't pass the Bechdel test. The only conversations they share are off-screen(page) and only mentioned for the sake of making the male protagonist unsettled. They never have any direct effect on Sara or even direct consequence on the plot! Neither of these women have a character arc of any kind. For that matter, NONE of the characters in this book have an arc besides the main one--and his is resolved lamely! He spends the entire second half of the book trying to CHANGE and ends up dissolving into everything he hated... This could have worked out to a very dark, cautionary tale (especially for a humor book), but in the end?? He gets saved anyway!! Through NO work or real effort of his own. Its referenced earlier that through reincarnation, if you're good enough in your past life, you can get born onto a better path.... But what effort did he make?? He didn't earn it! He tried and failed and then GAVE UP. Sure, he meant well, but he GAVE UP. He did exactly what every failed human he despised always did--succumbed to the weakness. In the end, he came to understand their failures because he felt how hard it was for them, but that didn't make success IMPOSSIBLE. Never did he ever realize it was impossible. He did not transcend anything. He tried for three months, and then threw in the towel, and then POOF he wins anyway. Surprise! You were real worried for a minute there, weren't you? Yay for the glories of Chance! What does this say for everyone else in the world who MEANS well but doesn't put in that last little bit of gumption to actually get there on their own? ...meh."}, {"userName": "Kemper", "userReviewDate": "Jun 16, 2010", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "The problem with discovering a writer you like at the beginning of their career is that you have to wait for them to write more books since they don’t have a shelf full of their stuff at the library or bookstore. I bought and finished Fated the week it released, and now I realize that I gotta wait for S.G. Browne to write a new book. I almost wish that I hadn’t read him at all until about five years or so in the future when (hopefully) he’ll have several books out that I could read in a giant frenzy instead of having to wait for the next one.Immortal incarnations of various aspects of the universe and human nature walk around Earth disguised as people to carry out the jobs given to them by God, better known to his employees as Jerry. But Fate (a/k/a Fabio) is feeling disgruntled after two-hundred and fifty thousand years. He’s responsible for the 85% of the humans that aren’t on the path of Destiny, and he’s sick of watching them fail to live up to their best case scenarios through bad choices, laziness, greed, fear, etc. He’s also jealous that his co-worker Destiny gets to handle all the ‘special’ people who will do great things with their lives while he‘s stuck with the losers. Fate spends his time hanging out with his best friends Karma, Gluttony and Sloth, having non-contact sex with Destiny and regretting an argument with best friend Death (a/k/a Dennis) that has left them not speaking for the last 500 years. All that changes when Fate sees Sara. She’s a special person on the Path of Destiny, but when he keeps running into her, Fate finds himself falling for a human woman for the first time. But loving Sara might interfere with Jerry’s plans for her and leads to Fate breaking all the rules when it comes to his influence over humans.S.G. Browne is like a hybrid of Christopher Moore and Chuck Palahniuk. His first supernatural comedy, Breathers, was a terrific book that put a fresh and funny spin on zombies. With Fated, he shows that he was not a one-hit wonder.Browne’s already proved can come up with unique ideas and then use to deliver both humor and tragedy at the same time. He’s got a talent for getting laughs out of his sci-fi concepts, but still delivering touching drama at the same time. Write faster, Mr. Browne."}, {"userName": "Catherine", "userReviewDate": "Nov 06, 2010", "userURL": "http://www.goodreads.com/user/show/3282244-catherine", "userReview": "Review originally posted on Fiction Vixen.It takes a lot to get me to DNF a book. I have a compulsion to keep reading. I can’t help but think the book might redeem itself in the end. But, sometimes, I stumble across a book that is so incredibly irritating and frustrating that I just can’t keep reading. In my whole life, the number of books that I have DNF’ed can still be counted on one hand. So, needless to say, I’m not very pleased to add another to the list. Unfortunately, this book irritated me to the point that I couldn’t not be frustrated with everything.I chose this book on the assumption that it would be in the same line as Christopher Moore. I didn’t expect them to be exact copies, but I thought they’d have a similar style. I was wrong. They couldn’t be more different. For one, Christopher Moore is actually funny. I didn’t see a lot of humor here. Just a bunch of whiny people making grand pronouncements about how lame humanity is.The main character, Fate (or Fabio as he’s nicknamed), whines about how lame humans are constantly. They rarely live up to their potential, they have mindless existences, blah, blah, blah. By page 4 I was already getting the vibe that it was not my kind of story. It seemed way too preachy, and I cannot stand “message” books that bash ad nauseam. There’ll be multiple quoted examples so you know what I mean.Pg. 1:The mall is one of the best places to go to see human nature at its best. Or worst, depending on how you want to look at it. Men and women, teenagers and children, shopping, eating, gossiping, filling up the vacuum of their lives with retail therapy and empty calories.Pg. 2:In the United States, there are twice as many shopping centers as there are high schools, and the shopping mall has replaced the church as the temple of cultural worship. In a society that encourages its citizens to measure their worth by financial success and material possessions, American humans spend more of their income on shoes, watches, and jewelry than they do on higher educations.Sure, it keeps Greed and Envy busy, but it makes my existence a living hell.Back when humans were still in their hunter-gatherer phase, existence was all about survival, fulfilling the basic needs of food, clothing, and shelter, so it's not like there were a lot of options for better living. Food wasn't prepared by Martha Stewart. Clothing didn't come with a Calvin Klein logo. And shelters didn't require Ralph Lauren curtains with a matching duvet.The thing about humans is that they're addicted to products.Habitual consumers. Indulgence abusers. Gratification automatons.Programmed to need and want and buy.MP3 players. Xboxes. Playstation 3s.TiVo. Surround sound. High-definition flat-screen TVs.A thousand cable channels with movies and music and pay-per-view.Distracted by their desires, overwhelmed by their needs and wants, they'll never remain on their assigned paths. Their optimal futures. Their most beneficial fates.Pg. 4:Not every human being has some kind of sexual hang-up or disorder or desire waiting to be realized. But most Americans do. This probably has something to do with the fact that the United States demonizes sex and represses sexual energy. Personally, I prefer the Italian and French. To them, sex is just a part of their culture.Taken in small doses, these observations can be amusing. But there were no small doses here. All Fabio ever did was whine about how lame humans are and how much his job sucks. Beyond that he didn’t have much of a personality. And silly me, I actually like my characters to have some depth.A huge premise of the book centered around Fate being a bad thing for humans. People who were going to be somebody important or have something good happen to them had destinies, not fates. The author explains this by throwing in some common sayings like “a fate worse than death” or “his fate was sealed” and saying that negative things are the only thing associated with Fate and the positive things are all associated with Destiny. But that is not how I associate Fate and Destiny so I found the whole premise rather perplexing.But that wasn’t a big thing. It was really the whiny, self absorbed, hypocritical characters that I had to read about that really bugged me. I mean, really! How can you bash on people with Fates for making bad choices and screwing up their Fates when you don’t actually do anything with your life beyond bitching about said humans? Fabio’s head was just not a fun place for me to hang out in. Example:Pg. 67Some of the places are a little seedy and can occasionally get rowdy, like this one, but I understand why human men enjoy going to strips clubs.Beautiful women dressed in not much, walking up to you and sitting in your lap, smelling yummy. Not to mention the private rooms and pole dancing and naked flesh in Technicolor abundance. True, the strippers are being paid to be nice and flirtatious and desirous, but technically, when you go out on a date with a woman, you're paying for it, too. And unless you're Greed or Frugality or a tightfisted bastard who insists on going Dutch, you're going to spend about as much money on a date as you are at a strip club.Of course, if you and your date don't connect for whatever reason, you're stuck on the date for at least a couple of hours until it ends. You can't just walk out after paying the cover charge and say, \"Thanks a lot.\" And when the evening finally does come to an end, chances are your date won't rub up against you, give you a lap dance, and brush her breasts against your face and say, \"Oops.\"One last thing about the actual style of the writing. One, it’s written in First Person present tense. It was really hard for me to get into. Just a warning if you don’t enjoy that style! Two, the author had a compulsion to repeat patterns to his (or her?) writing again and again and again. The author constantly listed examples in three’s—and did this every few pages—and constantly said stuff like “the thing about so-and-so is that he’s such-and-such.” That happened every single time that a character was talked about. I was getting an eye twitch!!!I made it to page 111 and I was done. I just couldn’t last long after Fabio’s love interest was (honest to God) turned on when he admitted to out and out stalking her for weeks. Blech!"}, {"userName": "Jasmine", "userReviewDate": "Jan 31, 2011", "userURL": "http://www.goodreads.com/user/show/1122151-jasmine", "userReview": "okay so I picked this book up because it looked terrible. yeah no really that was my justification. I finished a book at work and didn't want to read the other book I had with me, so I went to the fiction section looked at the cart and picked up the stupidest looking book (well once you edit out the genre fiction on the cart. I mean it wasn't a nora roberts kind of moment.) The back of this book just terrible. the blurb sounds retarded and like the author had no idea what he was doing. the cover is stupid and cheesy (not unlike breathers in my personal opinion). After all that you won't be surprised to hear I was shocked when the book was actually good. I thought it was well written and witty and just all kinds of awesome. Now caris has a review of his other book that says that everything caris hates in his own writing was in the book. Now I'm bias cause I didn't hate caris' book, but I think there are some valid points that carry over to this book. He does get a little stuck on catch phrases. I mean about a hundred pages in I was ready to throw the book across the room if he wrote \"the thing about _______ is he's/she's a _______\" I mean they are stupid extra words and it was funny the first well 2 times, tolerable he next 30 or so, then torture the rest of the time, except the last one, I liked that one. And just like caris says in his review (probably in reference to other matters) this feels to me like a poor imitation of palahniuk. I know I know palahniuk only writes one character, whatever people I know you aren't into it. At one point when I was reading interviews by palahniuk there was one about how to write it talked about knowing your character. This included knowing the kinds of things that your character says. So for him in the book choke he talks about code red and code blue etc. and sex things. This is even as literal as if I was a character in a book there are phrases I use all the time \"Depressing.\" \"Not really no.\" \"I don't like points they're sharp.\" that I say, but here is the thing there are lots of characteristic phrases and different wordings of those phrasings I mean as a character I wouldn't say only \"depressing.\" sometimes I'd say \"Sad.\" or \"stupid.\" There is variety, unless you are retard with no vocabulary. This lack of meaningful variation it's annoying. I don't mind the characters awkwardness in this book. But I not having read the other book I would say it's still there. This is very much a book about a stupid guy and he's a stupid guy who knows he's a stupid guy. I don't mind this in my book some people do, if you are one of those people this is not the book for you. I also thought there was a chance the personification was going a bit far I mean I don't know that it is necessary to have a personification of every fucking adjective. I do like the fact that a lot of them went by other names, and you aren't actually told who josh is for a while, although you will guess before the actual moment, unless I missed an earlier revelation. I'm on the verge of talking myself down a star, so I'm just going to say this was one of the most enjoyable books I read all year and for a while I thought it was going to be the first 5 star book of the year. I fully intend to read breathers now even though I think he cover is stupid."}, {"userName": "Sarah", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/23841736-sarah", "userReview": "DNF at 89 pages. I've had it with irritating books today. And quit trying to make me laugh! If you have to try that hard it just isn't funny! #$@*¢€©#!"}, {"userName": "Ranting Dragon", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/4367400-ranting-dragon", "userReview": "http://www.rantingdragon.com/review-o...Written very much in the style of S.G. Browne’s debut novel Breathers, Fated is a light, comedic novel that follows Fate (yes, the literal incarnation of the abstract force). Growing bored of assigning fates to the majority of humans for thousands of years, he soon finds himself falling for a mortal girl—which, of course, is absolutely forbidden for an immortal entity like himself. It isn’t long before Fate realizes that his affections could have drastic implications for the entire human race.An intriguing premiseI love the concept at the heart of Fated. Nearly every character in the book is an immortal entity like Fate: Sloth, Gluttony, Love, Ego, Guilt, Wisdom, Temptation, Karma, and so on. It’s a massive cast of characters (although most of them have relatively minor roles), and every one of them has their own little quirks and idiosyncrasies that work to either complement or oppose the roles they fulfill—Death, for example, wears mortician’s gloves and a particle mask, and Truth is a kleptomaniac. With Fate himself the star of the book, this is a premise that drew me in right away.A snarky first person narrativeFated relies quite heavily upon the first person narrative of its protagonist, who has an incredibly cynical view of humanity; his job, after all, does require him to deal with the portion of humanity which never amounts to anything great (in the world of Fated, the ones who do amount to greatness belong in Destiny’s realm). As such, Fate spends most of the book delivering snarky criticisms of humanity, and this is where most of the book’s humor comes from. It’s amusing for the most part and is entertaining enough, but Browne tends to fall back on the same jokes over and over, few of which are particularly funny. Fated’s first person narrative works, but after a couple hundred pages, it becomes tiresome. Furthermore, Fated contains a near-overload of references to real restaurants, stores, and products. They work effectively in the context of the book, but even a few mere years after its release, Fated is already starting to feel slightly dated. This is an issue that will likely cause the book to become more and more alienating to readers as time goes on.Unfulfilled potentialWith such an intriguing cast of characters, it’s obvious that a story like Fated would have a lot of potential. Unfortunately, Browne fails to fulfill this potential. Most of the book’s immortal cast are relegated to their defining quirks, failing to become the fully-developed characters that they could’ve been, and end up being nothing more than one-note jokes. However, there was one aspect of Fated that bothered me even more: Sara, the mortal girl that Fate falls for. She exemplifies the “beautiful-mystery-girl-who-instantly-falls-in-love-with-the-protagonist” trope perfectly, and she’s never allotted an ounce of character development (considering she’s the only non-immortal major character in the novel, this is especially annoying). If Sara had been an actual character and not just a cardboard cutout pasted into the novel, I likely would’ve had a much higher opinion of Fated; this is the most significant issue with the novel.Fated also relies quite heavily on a few last-minute plot twists, and your overall opinion of the book will likely depend on whether these twists work for you. For me, they didn’t. It’s not that the twists in and of themselves are bad, it’s simply that after hundreds of pages of buildup, they didn’t quite deliver the punch that they needed to. I do think it would’ve worked much better in a shorter format; the story could’ve been told in less than a hundred pages with just as much, if not more, effectiveness. In fact, if Fated had been a short story rather than a novel, I believe it would’ve been quite good. This is just a matter of personal taste, however; Fated may work better for some readers than for others.Why should you read this book?Although Fated has some major problems, there are aspects of the book that I genuinely liked. The premise is fantastic, Fate’s first person narrative is entertaining and has some truly funny moments, and even though I didn’t particularly enjoy the final twists, their audacity and ingenuity were refreshing. If you’re looking for a light read with some interesting ideas, Fated is a fine choice."}, {"userName": "Pauline", "userReviewDate": "Nov 19, 2010", "userURL": "http://www.goodreads.com/user/show/4084791-pauline", "userReview": "I am typing this review mere minutes after finishing S.G. Browne's Fated - at past two in the morning, no less. I cannot contain myself, really, because a book hasn't made me laugh out loud as much as this one for the longest time, and this isn't something you can just sleep on and remember to write about in the morning. So here I am, way past midnight, gathering my thoughts, wondering where to begin.Let's start with Fabio.Ah, Fabio, more commonly known as Fate, the guy responsible for how our lives will turn out, our paths, if you will. Decades upon decades of looking out for the fates of more than three-quarters of the human race (the other quarter of the human population is on the path of Destiny, which is actually altogether different from Fate, but I don't want to spoil the book for you). He's bored (he has been doing this for the longest time), he's bitter (all the humans on his watch are predestined for mediocre futures, and even that they can't stick to) and he's pretty much fed up with his job, even going so far as asking Jerry the Almighty for a job transfer.Then he meets Sara Griffen - good-looking, outgoing, such a head-turner (in more ways than one). Sara's not on Fabio's list, but he's so smitten by her that he starts following her around, meeting her, getting to know her... well, you get the idea. But the thing is, when you're Fate, an immortal responsible for the lives of pretty much nine out of ten humans, getting involved with a mortal is a big no-no. Meddling with mortals tend to mess with the cosmic balance and ends up affecting everything else. Which is why Rule No. 1: Don't get involved.The thing about Fated is that it's so well-written, you won't notice the overwhelming complexity of the premise of the story. Fabio is such an engaging narrator, so casual and laid-back, and the way he talks about the universal laws and relationships of the immortals (would you believe he used to be best friends with Dennis a.k.a Death?) is so uncomplicated, like reciting the alphabet. He kind of reminds me of Rob from Nick Hornby's \nHigh Fidelity\n. I love Fabio's conversation ticks, the way he always describe things in threes, and the way he describes the other immortals with \"the thing about...\".A modern-day version of your classic god-falls-for-human love story, Fated is one of those books I would love to see on on the big screen (which hopefully does happen, since I heard Diablo Cody is already working on S.G. Browne's first novel, Breathers - which I am currently reading, too, by the way). Its characters - even the secondary characters such as Lady Luck, Sloth and Gluttony, even the only remaining Greek god, Hermes - aren't hollow and lacking in description. And lastly, it wasn't entirely what I was expecting. Halfway through the book and I was anticipating something different from how it ended. On second thought, I'm not even so sure what I was expecting anymore.That would be the lack of sleep talking.All in all, Fated paints a colorful picture of the complications of being human, of the decisions we make, and why we do what we do, regardless of consequences. Definitely a must-read, probably one of the best books I've read this year.Originally posted here."}, {"userName": "Cheryl", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/4162498-cheryl", "userReview": "Fated is about Fate, who’s been around for more than a quarter of a million years. A quarter of a million years of watching humans who are put on his path (over 80% of us) making the wrong choices and rarely living up to their potential. He doesn’t get the Pulitzer Prize winners or the people who discover cures for diseases. Those humans are on the path of Destiny, who, it turns out, wears all red all the time, is more than a little slutty, and not very nice. After all this time, Fate, a.k.a Fabio, has grown tired of his job and has been phoning it in for some time, even using a computer program to manage the explosion of humans on his path. That is, until he falls in love with and meets (in that order) Sara, a mortal woman who moves into his building on Manhattan’s east side. While immortals, and there are a lot of them: Sloth, Death, Truth, Chance, etc., are allowed to mingle with mortals, getting too involved, like, say, falling in love, is against the rules. The thing is, Sara makes Fabio want to be a better immortal, and that means caring more about his humans. So, despite a warning from the big guy himself, Fate begins to pay more attention to humans, understand them a bit better and tries to help them not screw up all the time. All the while, he’s trying to keep his love for Sara hidden from the other immortals and, especially, from God. But, since God’s kind of omniscient, that proves difficult. God’s been sending out e-mails that something big is on the horizon, though, so Fabio’s hoping that that keeps him too busy to notice his own transgressions.I wasn’t sure how I was going to rate this book. Aside from a couple writing quirks: three lines of lists of three items per line when talking about things, starting every description of an immortal with, “The thing about insert immortal’s name here is he’s/she’s a insert trait here” were funny at first but got to be a little predictable and annoying, this was a really good book. The whole story idea, the personalities of the immortals and the back story are all really original. The author’s writing style, from Fabio’s spot-on, often sarcastically funny, insight into human behavior was great. The thing about Fated is…I hated the ending.While I’d love to go into detail, I don’t want to give any spoilers which makes it hard to describe why I didn’t like it. Suffice it to say that, after all of the great, creative writing of the rest of the book, the ending was a real letdown. When Fabio and others were looking into the results of his interferences, something happened that I thought would send the book in one direction that I hadn’t really thought of, something that might help get him off the hook. However, the author didn’t play that up at all and, after all the complaining Fabio did about the ways humans acted, he was no better. In fact, he was worse, which was really disappointing. And the final results of his behavior…Ugh, simply ridiculous.So, I’d give the ending half a star, but the rest of the book about three to four stars. I know that what I said in the previous paragraph might lead you to believe I'd say run, don't walk away from Fated, but that’s actually not the case. If you think it sounds interesting, give it a try (Maybe the library will have it if you don't want to buy it.). Aside from the ending, the rest of the book was so good that it’s worth a read and, who knows, you might actually find the ending to be clever. As long as you go into it knowing that it might also make you roll your eyes so far into your head that you’ll actually see your retinas."}, {"userName": "Kaion", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/2670571-kaion", "userReview": "You know the little \"meanwhile\"s in Good Omens where the Four Hogmen of the Apopcalypse are on nigh, and it's amusing because motorcycles and Pollution has replaced Pestilence (due to the said invention of Penicillin)?Well, strip any of the wit from that, magnify it to screechy book length, wrap it in faux-Chuck Palaniuk* style and then dip the results in a saccharine-love-story glaze, and you've pretty much got Fated by S.G. Browne.Which is a little sad, because Browne isn't working with nothing here. If you're going to ape someone, Gaiman/Prachett/Palaniuk* isn't a terrible mishmash. And who doesn't love anthromorphized concepts? I mean, really, anyone not smile at those Mayhem commercials (and not just the one where Dean Winters jogs with a pink headband)?But Browne uses the anthromorphizations as a crutch, deities showing up by the bucketload as if their existence is a punchline itself, removing the responsibility of any actual humor or cleverness or characterization. Furthermore these excesses really underscore the lack of any thought-out mythology to Fated; there's simply no internal logic or consistency to use to add real tension to the proceedings. Not that the plot is particularly dedicated to itself as it is. Big plot elements often being doled out as an afterthought... though that actually a small favor, as it keeps the horrific lust-at-first-sight-masquerading-as-true-love from making much of an impression and the page count blissfully short. Rating: 1 star*As a side note: I spent much of the last three months absent 'cause my 'reading time' was occupied screening submissions to a college literary magazine, and Palaniuk was far and away the most copied stylist by the short story writers. Say what you will about the man and his adherance to his formula, but go figure, it's not as easy to replicate well as you'd think.**I won Fated from Goodreads First Reads."}, {"userName": "Lindsey Lang", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/3415750-lindsey-lang", "userReview": "i just basically have to say, READ THIS BOOK!!! i'm not usually a big humor type of reader but this book may just change my mind, that is if i could find other ones this good!! i absolutely loved the satire mixed throughout and actually found myself laughing out load several times. i don't want to give any of those moments away and since i know i definitely can't do this book the justice it deserves in my review i'll just say once again, everyone should read this book, seriously! even if you think it's not your type of book please just give it a try. i started this book sunday and finished it monday! it's just a quick, fun read that is different than anything else i've read, but in a good way! =) i'll try to remember to add another review after my husband reads it and i think we'll try the author's first book, breathers too. this is an author i'm going to keep my eye out for in the future!! woo hoo, won a book on my anniversary!! gotta love First Reads, what a great present!!! =) got the book in the mail today, nice! and it's another First Reads win that my hubby wants to read too so that's cool. this one is going to the top of my 'to-read' shelf at home!!"}, {"userName": "Amanda", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/5793497-amanda", "userReview": "[Sara, the manic pixie dream girl, shows up and Fabio falls in love with her. She falls in love with him too. Fabio reveals to her who he is. She loves him anyway. They’re very happy together. Fabio finds out that Sara is on the path of Destiny because she’s supposed to be the mother of the second Son of God. So God is going to show up and bang his girlfriend at some point. He is very upset about this. God finds out about Fabio both telling a human who he is and interfering with human fates and punishes him by both turning him mortal and wiping him from Sara’s memory. Sara believes that Fabio was a one-night stand. Fabio proceeds to stalk her, forcing her to get a restraining order, which he then violates. It’s unclear if this is supposed to be seen as romantic, exactly, but it is clear that the reader is supposed to empathize with Fabio. Sara wouldn’t really want him to stay away from her if she just understood, which is problematic because of how it mirrors the logic of many stalkers. It gets worse though. Fabio in despair throws himself off a bridge, committing suicide. He then comes to realizing that he has been reformed as the fetus inside Sara’s uterus–the result of the one-night stand between her and God. He is the second Son of God. And he’s ok with this because he at least gets to be close to Sara. So Sara doesn’t just exist purely as a prop for Fabio’s character development, she’s also the woman who is banged once and thrown away by God to be forced to bring his second Son into the world who also just so happens to be the same dude as her ex-lover she has the restraining order against. It’s just so many levels of denying women any agency or rights or treating women as anything but passive vessels to be used by men and male gods however they want that it just made my head explode with rage when I read it. Most of this what the fuckery occurs in the last couple of chapters. (hide spoiler)]"}, {"userName": "Kristina", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/41383754-kristina", "userReview": "Super kitschy and cute in the beginning. Fate is a little bitter, but who wouldn't be when all of humanity sorta hates you? ...and then you hit twenty pages and it's already getting super repetitive. Personal opinion: books shouldn't feel repetitive after twenty pages. It has the signature consumerist, nihilistic, selfish, not a single good human in all of the earth ever kind of \"original social commentary\", even though to be honest, he felt just as whiny and useless as every human he described. Of course, that's only until he meets a woman who everyone loves, she's beautiful, intelligent, social, kind, absolutely radiant, has only had two sexual partners but somehow is the best freak in the sheets. You know the type. Suddenly he tries to do his job after millennia of slacking and of course gives up as soon as he hits a wall (much like the humans he talks about! He's no different!). There wasn't a single developed character that had more than maybe 2 traits in the entire book. Truly he was the most annoying character I've ever read. He was boring, predictable, and just generally unpleasant. The ~twist~ at the end wasn't shocking or great. It was just. Uncomfortable. Finishing this book just felt like a chore.Basically, the entire book felt like a 60 year old trying to market to teenagers. And it's just as tedious. which was annoying because it has so much potential but the writing was so lazy and unoriginal. Not to mention the \"humor\" was just again, lazy unremarkable social commentary every 6-8 sentences."}, {"userName": "Theresa", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/1229058-theresa", "userReview": "I think I was fourteen when I discovered Piers Anthony. I don't know where he ranks among fantasy/sci-fi fans, but he had a lot to do with my adult taste in fiction. I loved his \"Incarnations of Immortality\" series, perhaps because of my earlier infatuation of Greek mythology, and the idea that there could be modern incarnations of Death, Time and Fate really resonated with me. So it's little wonder that Fated by S.G. Browne, which offers another take on the personification of Fate, absolutely tickled my fancy. Fate, also known as Fabio, has been around since God (known as Jerry to all the immortals) created him in the early days of the universe's inception to help manage mankind. Fate's job isn't as fun as Destiny's. Average people have their fate laid out for them, but only the truly special people are the personal responsibility of Destiny. Fabio has gotten bored of looking after the drug addicts, sex offenders and over-consumers who end up in his care. And with a success rate of less than thirty percent of people who actually live up to their potential, who can blame him? But when Fabio meets Sara, an exceptional human being on the path of Destiny, and falls in love, he begins to think he may have judged humanity a little harshly. So Fabio decides to take a more personal interest in his people (rather than just relying on the computer program he currently uses to assign fates) and goes from being a disinterested bystander to active participant in their lives. But Jerry reminds Fabio that he is forbidden to directly intervene in human affairs and Fabio learns the harsh lesson of unintended consequences.\"Fated\" is a loopy, funny story with the same sensibility of a book by Christopher Moore. If you like irreverent humor, and it doesn't get more irreverent than calling God \"Jerry\" (the \"oh my Jerry\" moments never fail to crack me up), then you should like \"Fated\" quite a bit. The story has a brisk, infectious pace that make this a really quick read. The constant introduction of \"new\" immortals to the mix gives the book a feeling of newness that never goes away. And as you get into the flow of Browne's writing style you can't wait to see how each character is personified-- and it's not what you'd expect. It might be strangely appropriate that Justice is a sociopath, but I can't say I expected Karma to be an alcoholic. Despite its subject matter, \"Fated\" isn't a deep book. If you're looking for insight into the idea of Fate, Destiny or Karma you might be disappointed as \"Fated\" is far too breezy to spend any time on anything too heavy. I like the way Fabio spells out the difference between Fate and Destiny, and how one might change their assigned fate, but it's not the stuff of religious epiphanies. \"Fated\" also isn't the kind of book that lends itself to intricate character development. Despite the fact that Fabio has been around, forever, and seen it all (literally) he's a simple immortal in a meat suit (made to order by Ingenuity). Humans largely baffle him and most of his existence has been spent entertaining himself with other immortals. Sara's character is also mostly one-dimensional. We know she's special because she's on the path of Destiny, but other specifics regarding her personality are limited to the fact that people smile when they see her and her fondness for take-out food.But as a light diversion, \"Fated\" absolutely works. The pace is so skillfully done that the story never bogs down and it's one of those books that'll make you lose a day on the couch because you continually want to know what happens next. I don't know if Browne intends to spend any more time with the immortals introduced in \"Fated,\" but if he does-- I'm in."}, {"userName": "Jennifer Melzer", "userReviewDate": "Oct 10, 2010", "userURL": "http://www.goodreads.com/user/show/3069137-jennifer-melzer", "userReview": "The thing about Fated is I was scared to read it.I loved S.G. Browne's debut novel, Breathers, so much I wanted to savor that love forever, and was actually a little worried his new novel Fated wouldn't live up to my ridiculously high expectations.Boy, was that stupid.From page one of Fated, I was completely sucked into the narrative voice of Fate, known to his friends as Fabio. The thing about Fate is he's confused and tired of the same ole, same ole. I mean what can you expect from an immortal who's been guiding the fates of mankind since Jerry created Earth.Yeah, I said Jerry. That's God's real name. I bet you didn't know that.Fabio's lackadaisical approach to his humans takes a turn when he finds himself intervening with a beautiful woman named Sara who's not on his path. The thing about Sara is she's on the path of Destiny, and Fabio can't see her future. Unfortunately, Jerry's rule number one says the Immortals aren't supposed to get involved with humans, but Sara is everywhere and before long it's impossible for Fabio not to involve himself. He stalks her, learns everything about her and breaks another immortal rule by falling in love with her.And breaking this rule when it comes to Sara triggers something inside Fabio that prompts him to interfere like he's never done before. Before he knows it, he's altering the future outcome of his fated charges, even sending some of them off his path and into Destiny's care.Imagine, if you will, all those things that make human life what it is... Humor, Laughter, Anger, Resentment, Honesty, Secrecy, Karma, Gluttony, Sloth, War, Luck, Chance, Aggression, Mediocrity, Justice, Death...now picture them all personified and walking around the world with quirks not unlike the humans they look after. Secrecy is paranoid. Sloth is a narcoleptic. Death a necrophobic. Irony is all over this book, and it's a beautiful thing.Fabio's compelling voice leads you into this every day world chock full of cynicism, sarcasm and truth, painting a modern portrait of self-absorbed mankind placating his mediocrity with materialism and rampant sexuality.While the narrative is similar in style to the main character in Breathers, it is unique in that the voice defines Fabio perfectly. He's both relative and intangible, and the characters he interacts with provide a great deal of food for thought.The thing about Fated is it's literature. It's a classic waiting to be assigned to the reading list in college courses like American Lit 101.And I can't believe I was afraid to read it. I'm actually a little bit ashamed because the amazing narrative of Breathers itself was indication that S.G. Browne is an author to be reckoned with, a voice from the void of humanity that begs to be heard. So listen, and read. You won't be disappointed.You can get a copy of Fated, published by the New American Library division of Penguin, for just $15 U.S. and $18.50 CAN."}, {"userName": "Carolyn  Storer", "userReviewDate": "May 13, 2011", "userURL": "http://www.goodreads.com/user/show/2449271-carolyn-storer", "userReview": "“Fated” is a very clever and imaginative story. It’s quite different from what I usually read, and although I enjoyed this authors previous book, ‘Breathers’, I thought “Fated” was much better in every respect.Fate is disillusioned with his five and a half billion humans. He’s fed up with watching them make mistake after mistake and waste their lives, diverting from the path he has set out for each of them.However, one day he meets Sara, a human and falls in love. Which means his broken rule #1 – never get involved with humans.The story takes us through his relationship with Sara, which is touching and funny. I really liked Fate, also known as Fabio when on Earth. He’s endearing even when he scorns his human herd.I thought the way the author integrated Destiny, Death, Gluttony, Sloth among others, and even God, (known as Jerry), into the story was brilliantly done. They all had personalities which went along with their name.I loved the whole idea of how Jerry made the universe and how all the planets including Earth came to be, although it isn’t an original idea, it was skilfully composed which had me smiling.“Fated” is a satirical novel, which did occasionally turn a bit preachy. Some passages where Fate was venting his anger about the stupidity of his billions of humans went on a bit too long. I was also saddened to see that all the humans were portrayed as pretty awful.There was one particular passage where Fate was in a church and he could see the futures of all the people that were there – he listed them: adulterers, pedophiles, school drop-outs, unhappy housewives. Not one was happy or good or kind. Humanity is bad but surely not that bad!However, because of what happens to him, which I won't go into as I don't want to give any spoilers, Fate does eventually realise that humans aren’t as bad as he first thought. He begins to understand what it is like to be human, he realises that by being immortal and able to transport at the speed of light didn’t really give him the empathy he needed to understand them. It was touching to see him grow and learn and ultimately see hope.The ending I didn’t see coming for a long time, but I did eventually begin to have my suspicions. I was really hoping to be wrong, but I wasn’t, the ending is slightly disconcerting and I can’t say I liked it. But as I found with ‘Breathers’, Browne doesn’t write nicely wrapped up happy endings, which actually makes his novels deliciously unpredictable.VERDICT:“Fated” is a unique and well written novel. It's also funny, quirky, warm-hearted and hugely entertaining, which made this book hard to put down. I would definitely recommend it!"}, {"userName": "Deborah", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/1704738-deborah", "userReview": "\"Fated\" starts out decently enough, the premise that all attributes, sins, emotions and life paths are personified is intriguing. The story starts to break down with the introduction of the Sara character. While it soon becomes obvious that she is \"destined\" for something great (by repeated mentioning from the main character), the reader can't help but wonder if there is a lot of the author in the Sara character. Or if she is meant for the reader to insert themselves in her place. She is that shallow, boring and one-dimensional. Once her future is revealed, the reader can't help but wonder why this woman was picked. Sure, the readers are told ad nauseum how amazing she is and how she does a few good deeds and how people are magically drawn to her, but not enough is shown to lead the reader to believe these things. Instead, the reader is left with the impression that she is a sex-starved maniac and that is all she craves from the main character. There is also the issue with how the novel ended. There is such a slow buildup to the denouement that when it happens, it happens too quickly. The reader has to sit through five pages of depressing dreck only to have three quick pages of resolution. And what a whammy the resolution is. Without giving it away, let this reader say that I groaned out loud in frustration when the major reveal was revealed. Unbelievable!Over all, \"Fated\" was an intriguing read with great potential of being a great book- yet the author fell down on the job with this one. The writing was interesting enough to keep me reading, but once I finished the novel I felt like I wasted valuable brain space on this novel. It was the same feeling I got after completing \"The Da Vinci Code.\" I would not recommend this novel unless you are seeking a vapid, repetitious read."}, {"userName": "Lauren", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/3548900-lauren", "userReview": "Fate – preferred moniker, Fabio – is an immortal in charge of the life paths for 83 percent of humans. Then he meets a mortal who happens to be on the path of Destiny and, despite it being against the rules, falls in love. This book is another entry into the currently popular trend of inserting gods and myths into modern times. This book is a wonderfully weird combination of humor and intellectual commentary on the nature of human existence – with an engaging plot to boot. I had trouble putting it down, because it was just such a fun, smart story. But I hated the ending (quasi-spoilers from here on out). It seemed like the author was building up to Point A but instead took a last-minute hard left to end up at Point B, which, while somewhat foreshadowed, mostly undermined all of the build up (and was, in my humble opinion, uncomfortably gross). Let me put it this way: if this book were a retelling of the tortoise and the hare, during the final sprint to the finish line, the hare would find a pair of rocket boots and win, so that the moral turns into dumb luck trumping hard work. It’s not that said moral does not have some truth to it – rather, it goes against the whole purpose of the story until that point. Up until the ending, this was one of my favorite books of the year. Now I’m pretty confident saying I wouldn’t recommend it."}, {"userName": "Jed L", "userReviewDate": "Dec 09, 2010", "userURL": "http://www.goodreads.com/user/show/3660669-jed-l", "userReview": "As I read this book I felt that it was originally a short story written at a writer's workshop. Everyone loved it and the author decided to expand it into a book. It has a fun premise: give a personality to all of the human emotions, feelings, sins and virtues, etc... and see how they interact with humans and with each other. But after 25 pages the uniqueness starts to wear thin and reveals a weak plot, shallow characters and an overemphasis on sitcom like jokes--not to mention the political incorrectness and irreverent religious references.I received this book by a Goodreads giveaway."}, {"userName": "Vanessa", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/975869-vanessa", "userReview": "Fascinating concept, but poorly executed. Interesting enough to finish, but the writing style was repetitive and the plot was predictable. Meh."}, {"userName": "Victoria  (Two Vloggers More) ", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/9819451-victoria-two-vloggers-more", "userReview": "While rummaging around in the sale section of my local Waterstones store , I picked up Fated by SG Browne as the cover looked interesting and it was from an author that I had previoulsy read. A few years ago, I read 'Breathers: A Zombies Lament' and really enjoyed the mixed of a horror concept with laugh-out-loud narrative and story. Breathers told the tale from the view of a recently turned zombie, who is an outcast from society and has to live in his parents basement, as he attends meetings for the recently undead, starts to crave human flesh and ends up on the national new. I had not heard of Fated and knew nothing about the story, except that which was written on the backcover, when I handed the book over to the cashier and parted with my £1, but I'm very glad that I did. Fated follows Fate, suprisingly, and how he, who prefers to be called Fabio, has to deal with a job he has been in for the past 250,000 years. Starting to hate his assigned role from God (to his friends Jerry) because he has to watch humans, practically 83 percent of them, on his 'Path of Fate' squander their pre-determined path and end up with worse fates than he had assigned at birth. Granted, those of the Path of Fate are unlikely to cure diseases or win a Noble Peace Prize, but he is sick of his humans ruining their mediocrity by laziness, greed or just bad choices. Making matters worse is his kinda-love-hate relationship with Destiny, and envy at those of her 'Path of Destiny'. Fabio finds his monotonous existence is changed by the new resident of his apartment building, Sara, and decides to go against the first rule laid down by Jerry: Never get involved.After seeing Sara, and her peaking his interest as he cannot see her life path (she's with Destiny and not him), he follows her, falls in love and then meets her. Yes, in that order. Fabio breaks the first rule by getting involved in a relationship with Sara and decides to break even more as Sara inspires Fabio to take an interest in his job again. Fabio starts to try and get people back on the path assigned to them at birth before they veered off towards unhappiness by getting involved and talking to the mortals in his charge, but this leads to more problems for him as their lives change drastically and Jerry starts to notice. Told to stop by his boss, Fabio disobeys and continues to try and help his humans, as well as getting more emotionally involved with Sara, which results in him getting fired, after most of the people he tried to help wind up dead, and having to live on earth as a mortal. I really enjoyed the writing style of Browne again in this book and found myself laughing-out-loud a few times which earned me stares as I rode the train to London. The concept of each sin, trait or life path being personified and having their own issues was interesting to me and I found myself wondering which Browne would include in his novel and how they would effect the story. Meeting characters like Destiny, who always dresses in red and is kinda slutty, or Death, aka Dennis, who really hates messy deaths and has a 500 year old feud with Fate, added little quirks to the story and seemed to point out that everyone has personality traits that may not be the best. The way in which all the immortal characters are introduced, along with their flaw, may annoy some people but I didn't find that and I liked the way this was repeated and followed the same structure for each one. Some of the humans that are encountered by our protagonist are down-right vile and it does seem like only the really horrific life-paths are mentioned, and this could put some people off, but as the story follows Fabio as he tries to stop these horrible fates from happening, I can see why the author chose as he did. Without the drastic changes, I don't think the story would have had the same effect, as would it really matter if someone changed from being a teacher to a nurse, but if someone is changing from a criminal to a monk then this is drastic and would likely be noticed by Jerry. The plot the book follows for most of its 300 plus pages is enjoyable and different than anything I have read before. I relished flitting from the relationship between Sara and Fabio and the scenes which follow Fabio in his job. The contrast was nice and there were some genuinely funny moments as an immortal tries to function in a daily relationship with someone who thinks his is a regular person. There is a change in pace towards the end of the book and everything seems to veer in a direction that was not previously visible. The path the tale took towards the end was not one that I though fit together neatly with the comedic nature of the rest of the book and I personally thought it could have been written slightly better. I do feel, however, that the turn Fabio's story took fit in with my perceived over-all theme of the book, that people's decisions effect the road we travel as well as the destination we end up in. Overall I really enjoyed this book. I liked the main character and the story as a whole, as well as the humorous writing style and meshing of real-world settings and the personified traits of the immortal concepts. I would recommend this book to those who like comedy authors, such as Christopher Moore, or those who want to read a funny novel with mystical elements but set in a real-world New York City. 4 Stars"}, {"userName": "Kristin", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/3600796-kristin", "userReview": "I am torn about how to rate this book. I settled on 3 stars because without the end, it would’ve been a 4.5 star book. The ending deserves negative stars.I purchased this book for my sister for Christmas on impulse after seeing it on the shelves at Borders (which won’t be happening again since they’re closing all of them. Thanks for sending me into the cold arms of Amazon!) and after she read it, she told me she thought the ending was so stupid, that she couldn’t believe how awful it was, but that I should still read it because the rest of the book was so amazing. This is something she’s never done before. Usually if she hates a book she’s ready to just turn on the stovetop and set it on fire (don’t worry, we donate them to the library). So I went into it knowing that I’d probably hate it, though she said I might find it clever.I didn’t.Fated is about Fabio, who, as Fate, is tasked with predetermining and ordering the course of 83% of the human population’s lives. The rest are on the path of Destiny, who, as described by Fate, quite accurately I might add, is a heartless whore who basically gets the cream of the crop of the human herd. After thousands of years of assigning fates to mostly miscreants and screw-ups, he’s pretty much had it and has taken a minimal interest in his job. Then he meets Sara, a human who is on the path of Destiny. That’s when things begin to change for Fabio. He actually starts to take an interest in his humans and after he interferes with the fates of a number of them, which is a no-no because of the idea of free will, he begins to think that he can rediscover why he used to like his job and actually starts to feel relevant once again. The remainder of the book follows him as he attempts to improve the lives of his humans and ultimately has to deal with the consequences of his actions.Along the way, we meet Jerry (God), Dennis (Death) and other immortals who are Intangibles and Emotives, among other beings, and who all live in “man and woman suits” so that they can move around the Earth without causing mass hysteria, as their real shapes vary from, as Fabio describes it, blinding balls of white energy to nasty-looking creatures with the faces and bodies of constantly aroused boars. While getting to see Fabio in action trying to be a better, more involved Fate, we watch him interact with a variety of with humans. While these scenes are funny, the ones with the other immortals are downright hilarious. Sloth and Gluttony cracked me up, Karma is absolutely hysterical and though he was only in it for about two sentences, Hostility was gut-bustingly funny and I wish he’d been in the book more.While I would love to complain about things that happened at the end and go off on one of the characters, who I would love to drop-kick into a black hole, I’m not going to go into any details about what happens to Fabio because I don’t want to give anything away.At one point Love tells Fabio that love is like a good book you can’t put down and you wish would never end. I really wish this book had never ended because as much as I loved the majority of it, I hated the ending even more. However, I would still recommend this book to anyone who asked about it, because I’m still glad I read it. Fabio’s insights into humans, daily life, the stupid things we do and what makes the majority of us tick are amazingly smart, funny and, unfortunately, spot-on. I’d just give them fair warning about the ending.And finally, normally I wouldn’t point something like this out, however, I’m so annoyed by the final chapters of the book that I’m going to. There are no steps outside the 13th Precinct, it just opens up at street level. Yes, I know I’m being petty.The thing about Pettiness is he thought the ending sucked too."}, {"userName": "Elizabeth", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/4299179-elizabeth", "userReview": "Fabio Delucci is Fate. He is entrusted with the task to stand by and watch as most of the population ruins their lives. Destiny has the much better job of guiding those in a more positive direction, but Fate has the child molesters, drunks, and general ne'er-do-wells. Not exactly a laugh fest. His life, after about 250,000 years, has become routine and dull. He hates his job; his no-contact affair with Destiny is empty and unsatisfying; and he doesn't really have much else going for him. Until he runs into his neighbor Sara Griffen by chance. He stalks her for a bit and comes to the realization that he's in love. They finally meet, hit it off famously, and fall head over heels for each other. He has to hide it from Jerry (AKA Jehovah) and all the other personifications, like Gluttony, Vanity, Hope, but especially Destiny because interfering and falling in love with humans is forbidden. This new found love inspires him to help the sad, pathetic people on the path of Fate to achieve happiness and sometimes put them on the path of Destiny. Everything starts to fall apart when the fated people he helped start dying. Was it really because of his interference or is someone trying to sabotage him? How long can he keep is relationship secret in the face of these deaths?I didn't really know what to expect before I read Fated, but I thought it would be something like Piers Anthony's Incarnations of Immortality series. Although there are some similarities, Fated is much more light hearted and ironic. Fate is an engaging and relatable narrator, despite being an ancient anthropomorphic concept. His voice is really what got me into the book because of its conversational and humorous quality. I think everyone can relate to someone with an unsatisfying job trying to make a few people's lives a little bit better. I laughed pretty much through the whole thing. I truly couldn't put it down in finished it in only a couple of days. Although the immortal falling in love with a mortal has been done throughout history just about to death, Browne has managed to breathe new life into this concept. The romance between Sara and Fabio is so adorable and quirky, they just complement each other very well. When things start to go badly for him, I sympathized with him and I was even moved to tears by the end. Even though most of the book is light and funny, there is still a core of true heart and prompts the reader to scrutinize their own lives to see which path we are on: Destiny or Fate.Fabio is backed by a cast of memorable personifications, including, Gluttony, Vanity, Dennis, Hope, Secrecy, Honesty, and Lady Luck. They all have their little personality quirks and aren't the perfect celestial beings that we may have imagined. I liked learning about the ins and outs of their daily lives, such as their man suits that contain their true selves and the quotas they have to fill. Most of their lives aren't much better than any given human's, except for the perks, like the spa in Eden, a universal credit card, and the ability to transport anywhere instantaneously.The thing about Fated is, it's a great novel. The ending is pretty unexpected and comes out of nowhere, but it's very satisfying. I would love to read another book starring Fabio and I look forward to what S.G. Browne will do next. I would recommend this to fans of Breathers, Browne's debut novel, and people who enjoy Christopher Moore's novels."}, {"userName": "Jessica", "userReviewDate": "Oct 20, 2010", "userURL": "http://www.goodreads.com/user/show/4295563-jessica", "userReview": "First, I am so grateful for winning this book on giveaways. How fun to be one of the first group of people to be able to read this!That being said, as much as I am telling myself to give it a stellar review because it might bolster my chances of winning another one, that's not really what this site is all about.So I give it 2.5 stars. It was a difficult book to enjoy reading in the beginning. It starts off sounding like he has a serious agenda against the human race. And I didn't like the writer's style. It was bland. And the moments he did try to spice it up or make it stylistically shocking or entertaining just fell awkwardly, unimportantly, short. \"Think awkward.Think unimportant.Think unnecessary.Think annoying.Think forced.Think, not again.\"\"The thing about his format is that it's repetitive.\" (Imagine \"sentences\" like these on what seems like every page of the book, with only 10% of them being actually funny, endearing, or witty)There were two redeeming qualities about this book. The underlying principles and philosophy of this book did get me thinking, and I was very curious to see how the \"rules\" of interaction played out for everyone, both the mortals and immortals. The author paints a pretty horrible and pathetic description of the human race and manages to bring some understanding and compassion to it by the end. The other redeeming quality was the romance between Sara and Fate (sans dialogue). I enjoyed his depictions of how Fabio felt when he abandoned the format above and actually wrote. The author did manage to create a situation where I got invested enough to finish it through to the end (which was clever-ish, but I didn't particularly like it and wished he had spent more than one measley chapter wrapping up).I was so excited about the premise of the book.. I mean how fun! What couldn't you do with characters like Destiny, Gluttony, Secrecy, Death, Pride, Passion, Lust, Honesty and on and on? For me, a lot more than what this book did. I did like it more towards the second half, but there were definitely a lot of deciding moments in the first half about whether or not to finish it (and if it wasn't a giveaway, I'm not sure I would have). Also, this book has very little to do with what it means to be human.. as is quoted on the cover."}, {"userName": "Angela", "userReviewDate": "Feb 22, 2011", "userURL": "http://www.goodreads.com/user/show/4044700-angela", "userReview": "Did you know that various immortals watch us at every moment? They do, and they report to God, who, by the way, prefers being called Jerry. But they're not supposed to interfere with us humans. In fact, Rule Number One is Don't Get Involved.Fate, however, has broken Rule Number One. He's fallen in love.Fate, who prefers being called Fabio, has grown tired of watching all of us screw up and wander off the paths he assigned us when we were born. This creates new work for him, assigning us each new fates, which we proceed to blithely ignore as well. Jerry damn that free will thing. But every now and then, Fabio runs into an individual whose path he cannot see. And when he runs into Sara repeatedly -- by Chance, at first, and then deliberately -- he knows she's on the Path of Destiny, and he can't see her future, but that doesn't matter. In fact, it makes her even more appealing....And so, there goes Rule Number One. Which subsequently leads to breaking other rules, such as Rule Number Five, Never Materialize In Front Of Humans, followed closely by Rule Number Six, Never Dematerialize In Front Of Humans. And so forth.But it's when Fabio breaks Rule Number Two, Don't Improve Anyone's Assigned Future, that things really start to get hairy.The thing about Destiny is she's a nymphomaniac.The thing about Lady Luck is she has ADD.The thing about Jerry is he's omnipotent. But busy. The thing about Gossip is...well, you know.And the thing about S.G. Browne is he's following in Christopher Moore's footsteps, and doing a bang-up job of it. Which is why I hadn't even finished this book before I went out and bought his other title, Breathers. Many thanks to LibraryThing's Early Reviewers Club for the opportunity to read this book."}, {"userName": "Christine", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/2756498-christine", "userReview": "I received this novel as a book giveaway and I am happy to say I loved it. I am afraid to write too much about this book because it is so clever and part of enjoyment of the book is what the author reveals about being human. Fate, or as he is known by his friends, Fabio, is not happy. He’s tired of seeing humans screw up the life they are given by making horrible choices. Fabio decides to give them a little help, hoping to steer them off their path of Fate and on to that of Destiny. Destiny is not crazy about that and the fact that Fabio is now in love with a human leads to some hilarious scenes in the book. Fabio name-drops his way through time and place. His list of lovers that include Nefertiti, Cleopatra, Helen of Troy, Marie Antoinette and Marilyn Monroe is impressive and his list of friends are the who’s who of human emotion, sloth, gluttony, love, lust and so on. Fabio shows us that life as an immortal is not as easy as it may seem. This book is laugh out loud funny and surprisingly insightful into the human condition."}, {"userName": "ஐ฿υκєτஐ", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/13711062", "userReview": "Kitabın tanıtımından ve kapağından çok etkilenmiş ve merak etmiştim.Beklentilerimde bayağı yüksekti ve kesinlikle bütün beklentilerimi karşılayan bir kitap oldu.Konusu çok farklı ve örijinal bir konu.Kitabımızın ana karakteri Fabio namıdiğer Kader.250.000 yıldır yeryüzünde olan Kader işinden hiç memnun değil.Çünkü insanlar doğduklarında Kader tarafından onlara belirlenen yolda asla kalmıyorlar.Buda kaderin sinirini bozuyor ama asla bu durumu sorgulamıyor.Taki bir insana aşık olana kadar.Sarayla beraber olmakla bozmaya başladığı kuralları insanların kaderini değiştirmeye başlamasıyla iyice bouyor ve başı Tanrıyla yani Jerry'le belaya giriyor.Kitabı çok beğendim ben.Sonu çok etkileyiciydi.Tavsiye ederim kitabı.Kitapta daha bir sürü karakter mevcut.Kısmet Yedi Ölümcül Günah Şans Meleği Ölüm Düşmanlık Gizlilik Başarısızlık Karma Dürüstlük Maharet Karasevda bu karakterlerden bazıları.Son olara kitap Fabio yani Kader'in ağzından anlatılmış:)"}, {"userName": "Rachel", "userReviewDate": "Feb 14, 2011", "userURL": "http://www.goodreads.com/user/show/1575697-rachel", "userReview": "This was a really creative twist on Fate (pun intended...maybe). It was laugh out loud funny and I think I may have enjoyed it more than Browne's other book, Breathers. That's a toss up. I love me some Zombies. But my other love is mythology. I love the embodiments Browne gives so many of the concepts that exist in mythology. The love story between Fabio and Sarah is really sweet and realistic. The book does get dark but I think it comes out very hopeful. A highly enjoyable read.Updated 2/1/2012: While I still believe that everything I wrote about this book a year ago, I did increase my rating from 4 to 5 stars. Mostly because of the ending. If an ending I didn't quite see coming still holds up when I know its coming, that's a 5 star book. This book just makes me happy. P.S. You should realize the ending is coming, it's not completely out of left field, there are plenty of clues. I believe there's razzle dazzle involved."}, {"userName": "Melora", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/1241548-melora", "userReview": "After \"Breathers,\" I wanted to read more by this author. And a story about a guy whose job is to be Fate, certainly had humorous potential.That being said, I felt that the author overreached with this novel. He tried too hard to explain all the world's events, emotions, and religions with the actions of a single (Christian) God and a large handful of His immortals.And throughout this story, I thought Christopher Moore could have (and did, \"Lamb\") done this topic better and with more laughs. There weren't a lot of actual laughs, and I didn't find the main character, Fate, particularly likable or sympathetic. He seemed like a judgmental, self-absorbed slacker, and I didn't buy his sudden epiphany and subsequent changes. The plot was, sadly, somewhat predictable and oddly preachy.Maybe Browne should just stick to zombies..."}, {"userName": "Fantasy Literature", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/8491232-fantasy-literature", "userReview": "“You like Christopher Moore,” the bookstore clerk said, pushing a book into my hand. “You’ll like this.” I do like Christopher Moore, and I think S.G. Browne does too, but Fated fell short of the wry Moore-like comedies it tries to emulate.Fate, who uses the name Fabio, is a world-weary immortal Personification. When the book opens, he is bored with his work and disdainful of the human race. Fabio is only one of many — dozens, scores, I don’t know, maybe hundreds — of anthropomorphized states. He has a rival, Destiny, who gets all the glamor assignments. He used to be best friends with Death, who goes by Dennis (wouldn’t you?), but they had a fight and now they don’t speak. The Personifications are ruled by God. He used to be called Jehovah, but now he goes by Jerry.... Read More: http://www.fantasyliterature.com/revi..."}, {"userName": "Chip", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/1622905-chip", "userReview": "4.5 stars. Very good book, in many different ways. For a while I was a little annoyed by what seemed to me a certain level of illogic and lack of consistency re how the whole immortal manifestation of Fate, Destiny, Death, Gluttony, Secrecy, etc etc worked as a concept - but as I read on I realized that really wasn't the point of the book at all - merely the backdrop of the (excellent) story. Unlike the one Christopher Moore book (The Gospel According to Biff, Jesus's Childhood Friend) I've read, which to me was a one-trick pony of which I wearied, Fated succeeds on a multitude of levels. Good story, interesting characters, plot twists, humor, insightfulness into the human condition, etc. etc."}], "description": "Over the past few thousand years, Fabio has come to hate his job as Fate. Frustrated with his endless parade of drug addicts & career politicians, it doesn't help watching Destiny guide her people to Nobel Peace Prizes. To make matters worse, he has a 500-year-old feud with Death, & he's just fallen in love with a human.", "title": "Fated", "url": "http://www.goodreads.com/book/show/11356800-fated", "average": 3.65, "cover": "https://images.gr-assets.com/books/1332125609l/11356800.jpg", "reviews": 321, "authors": [{"url": "https://www.goodreads.com/author/show/2129854.S_G_Browne", "name": "S.G. Browne"}], "type": ["Fiction", "Fantasy", "Humor", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/11356800-fated", "http://www.goodreads.com/book/show/8393104-fated", "http://www.goodreads.com/book/show/9594038-fated", "http://www.goodreads.com/book/show/16072334-kader-a-k-tad-nca", "http://www.goodreads.com/book/show/5149517-breathers", "http://www.goodreads.com/book/show/13259637-lucky-bastard", "http://www.goodreads.com/book/show/15801662-i-saw-zombies-eating-santa-claus", "http://www.goodreads.com/book/show/16130336-big-egos", "http://www.goodreads.com/book/show/22609480-less-than-hero"]}