{"ratings": 2105, "userreviews": [{"userName": "PirateSteve", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/46000051-piratesteve", "userReview": "Lot's of reviews going around comparing Larry Brown with William Faulkner. If you've never read any of William Faulkner's books then know that Larry Brown's writing is just like Faulkner's. If you have read some of Faulkner's books then let me just go ahead and say I lied in my first comment... but there are similarities in these two fellows.Both gentlemen were born in the same area of Mississippi, both died in Mississippi. Faulkner 1897 to 1962. Brown 1951 to 2004.Neither of these men obtained a college degree. Both men pursued descriptive writing.Both wrote about the southern people of the United States. Mostly the poor southern people, flawed, downtrodden, everyman protagonists. And they both knew these people incredibly well. They lived with them. Fay is a very good looking 17 year old runaway. She had good reason to run away but no plan other than to head south. Fay has two dollars. She learns that she likes the taste of beer and enjoys making love. She learns how to fry chicken and how to shoot a gun....... (((BANG)))"}, {"userName": "Lori", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/68050592-lori", "userReview": "She probably isn’t SINless, lacking a Single Identification Number (SIN), but Fay reminded me of William Gibson’s Mona. Of course, I believe this is Mississippi grit-lit.I think these quotes point out a lot of her trouble. Plus, being young, clueless, homeless, destitute and attractive.“All this trouble over a little blood rising up in an organ, and glance, and looks, and thoughts of the joining of flesh.”“For just a moment before she opened it she thought about what she was doing and wondered what was in the bags. Then she went ahead and put the key into the lock and turned it and turned the handle. The bags were close to her hand.”"}, {"userName": "Lawyer", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/3025547-lawyer", "userReview": "Fay:Larry Brown's Look at Love in All the Wrong PlacesFay was chosen by members of On the Southern Literary Trail as a group read for November, 2014.\n\nLarry Brown, July 9, 1951 – November 24, 2004, Oxford, Mississippi\n\n\nFay, First Ed., Algonquin Books, Chapel Hill, North Carolina, 2000\nI have one of those first editions of Fay. But it's not signed. I kept meaning to get over to Oxford, Mississippi, to meet Larry Brown. Actually, I had several first editions by the time Fay came out. I figured I had plenty of time. After all, Brown was a young man. So was I. I was stunned when he died of a heart attack at the age of fifty-three.It was a wake up call of sorts. I was one year behind Brown. I was fifty-two when he checked out. I was still walking the court room floors as if I owned them, trying the hard cases, burning the candle at both ends. While I noted as did Edna St. Vincent Millay that blazing candle indeed made a lovely light, I was also conscious of the fact that all candles eventually burn out.With Larry Brown's death I began to make an effort not to find an excuse to skip a book signing. And now I'm sixty-two. My health could be better. I joke about my key to immortality being a stack of unfinished books. Wouldn't it be pretty to think so.With Larry Brown, I'll have to be content with the writing he left us. The interviews he gave. A wonderful documentary, The Rough South of Larry Brown. I think I would have liked Larry Brown, sitting down and talking with him. He understood people, brought them alive on the page, the good ones and the bad ones. That is so evident in Fay.I got a feelin' called the blues, oh LordSince my baby said goodbyeLord I don't know what I'll doAll I do is sit and sigh, oh LordThat last long day she said goodbyeWell lord I thought I would cryShe'll do me, she'll do youShe's got that kind of lovin'Lord I love to hear her when she calls me sweet da-a-addySuch a beautiful dreamI hate to think it's all overI've lost my heart it seemsI've grown so used to you somehowWell I'm nobody's sugar daddy nowAnd I'm lo-o-onesomeI got the lovesick blues-- Cliff Friend and Irving Mills(1922)Fay came out of the hills north of Oxford, Mississippi, raised poor. She grew up hard, with a Daddy who led her mother and her other siblings from place to place. She's followed the migrant workers. Lost one brother to death. One was so sick Daddy traded him for a car. There's got to be a better life. Fay's heard there's a beach down on the coast. When Daddy expressed an interest in her no Daddy ought to have it's time to start walking. With two dollars stuffed in her bra, her pack of cigarettes in a purse slung over her shoulder, Fay is looking for that better life.She's a natural beauty with a body that makes men turn and stare. That first night trudging down the road, some boys in a pickup offer her a ride. They seem nice enough. They have beer and they're going to fry catfish. Well, of course, one or more of them's got designs on Fay, but with all the booze, the dope, and an obliging woman on the premises, Fay makes it through the night in a maidenly way, but gets an eyeful of the obliging older woman satisfying two young men at the same time. Fay feels a shudder somewhere deep inside, never knowing that something like that was possible.It's time to keep on walking. Fay meets Sam, a State Trooper, who takes her home with him. Sam lives in a cabin with his wife Amy. It's a loveless marriage. A lot of marriages don't survive the loss of a child. Sam and Amy lost their daughter Karen four years before, killed in a car wreck. Sam had the misfortune to be dispatched to work that wreck, found his daughter dead in a crumpled car, not a mark on her, but with a broken neck. That's hard on a man. It's hard on Amy who has become an alcoholic.Fay becomes their second daughter. She's seventeen. Amy buys her clothes. Fay lives in Karen's room. Sam loves to take her fishing. Fay's good at it. \"I wish I had a Daddy like you,\" Fay tells him.But this fairy tale can't last. Amy is killed in a wreck. Soon after the funeral Fay and Sam become lovers. Bottom line, Fay is a natural at sex. And she enjoys it. Sam is bothered at their age difference, but, DAMN, he can't stop. If only he had the presence of mind to have worn a rubber that first time. But no.Now, Sam and Fay being a couple upsets Alesandra, the beautiful woman Sam was having an affair with before Fay came into the picture. Alesandra has a temper. Alesandra also has a gun. While Sam is away, Alesandra is going to kill Fay. Fay kills Alesandra in self defense and leaves Sam's home, which leaves Sam in a lot of trouble with law enforcement.And Sam has a bad case of the lovesick blues.Hitching rides with truck drivers, Fay ends up in Biloxi, that beach at the coast. She finds herself at a dive called the Love Cage, a strip club where she meets Aaron Forrest the bouncer. She also meets Reena, a down on her luck stripper, who offers her a place to stay. Of course, Fay will end up with Aaron who starts out as a caring and protective man. The Love Cage covers up a lot of ugly secrets. Drugs. Prostitution. Pornography. Aaron is in the thick of all of it. He wants to keep Fay away from the business, out of Biloxi, over at his mother's place in Pass Christian.Fay is a natural at sex. Oh. Had I already mentioned that? Aaron has it bad. Aaron has a jealous streak. If Fay were to leave him, Aaron would have a bad case of the lovesick blues.Fay misses Sam. Things are going to get very complicated.Larry Brown puts the reader through the ringer. This is an outstanding read. The dialogue crackles. The sense of place is so strong you can smell the pines of Northern Mississippi, and the salty breeze of the Gulf. Brown's scenes of violence explode, leaving the reader shuddering and the victims whimpering. This is a country noir thriller with overtones of ironic black comedy. Why not five stars? At five hundred pages, as magic as some of the prose was, the story didn't merit quite the length of the telling. A SOLID 4 STAR READ. Highly recommended.EXTRAS!An excerpt from The Rough South of Larry BrownAnother excerpt from The Rough South of Larry BrownJust One More Visit With Larry Brown, Oxford American, June, 2013SOUNDTRACKLovesick Blues, Hank WilliamsCrazy, Patsy ClineWhat'd I Say?, Jerry Lee Lewis, Elvis PresleyWalking After Midnight, Patsy ClineIt's Only Make Believe, Conway Twitty"}, {"userName": "Steve", "userReviewDate": "Sep 27, 2008", "userURL": "http://www.goodreads.com/user/show/1254714-steve", "userReview": "It's a shame Brown died, because I felt this to be his best book, and one that screamed for a sequel. Given that Fay itself was a sequel of sorts, I think this was a very real possibility. Fay Jones comes from about as far down the social ladder as you can get (I hate the term \"white trash,\" so I'll just leave it at that), so when her \"family\" falls apart, she departs on her own, in a way that definitely reminds you of Lena Grove from Light in August. But Fay's a different kind of gal, and her departure, unlike Lena's, is a nighttime journey. Yeah, she's vulnerable, seemingly innocent -- but if pushed, she shows herself a survivor who can take care of herself. To my mind, Fay is (or evolves into) one of the great femme fatale characters in all of noir literature, but there's nothing darkly romantic here. These are real people living out hard lives. Fay is a part of that world, but she moves through it like a ship of doom. Many of these characters (a cheating cop, a bar bouncer, an alcoholic wife, a jealous lover, a rapist) are already damned, Fay just provides the final focus. I hope the Coen brothers pick this novel up as a future project, because it's a killer."}, {"userName": "Melanie", "userReviewDate": "Nov 07, 2012", "userURL": "http://www.goodreads.com/user/show/4093022-melanie", "userReview": "Well, damn. Larry Brown sure knows how to hunt a reader down when their eyes are trained on the fate of his characters. I couldn’t read this fast enough and I regretted my haste from top to bottom, thankful though when he took time to coax us in with the smoke and the whiskey, taking in the sun on the deck with Amy.I can see that other readers may be impatient with that settling-in thing he does, but he gears up quick enough and I began to run out of pages fast, chasing with Sam, trying to get ahead of it all somehow.  What I’m saying is: heart and hope get involved directly with these characters, all of them - Fay, Sam, Aaron and Reena. I lost count of all the black souls on that Larry Brown highway, but felt like they were carrying the good ones with them from Biloxi down to Pass Christian. and tell me if Tom Waits Hold On isn’t about Fay? If anyone has any ideas on how I can fall into a book next that is as good as this, please let me know, otherwise I might just get back to Dirty Work. If only the post man would hurry Joe along."}, {"userName": "Jamie", "userReviewDate": "Dec 28, 2011", "userURL": "http://www.goodreads.com/user/show/51089-jamie", "userReview": "Larry Brown looks at things square-on, drinks you under the table, kicks your ass and breaks your heart. Full of tenderness, without pity, he shows up a hard life for what it is: a little bit of good luck and a lot more bad luck, cold hard reality and largehearted hope, prayer for a miracle without a miracle in the end. What’s best though, even better than that, he gives you so much of the why and how of people, you can’t ever look at the what the same way again. “Don’t say what you would or wouldn’t do, honey. Cause one day you might have to.” I loved Sam most. And of course Fay, sweet Fay.First read December 2011- - -November 2012:I thought it was Jewel and Mary and Virgil of \nFather and Son\n who would stick with me so vividly this year, but no. It’s Sam and Fay. Brown wrote this himself when Fay wouldn’t let him alone, when he couldn’t stop thinking what happened to her after Joe. It shows. It bleeds right through the page, that affection-without-pity. Powerful and contagious. And the second time through it’s even more tremendous, how simply and fully Sam and Fay are brought to real life. I dare you to even try to judge people the same way after this one. It’s one of the several contributors, why I barely have any tolerance left for the people in books who only say and do and think the right things and think that makes them good. We sabotaged a whole factory of magic eight balls so they only tell the truth, was the Softer World strip the other day. We are all fucked, and we are all saved.And like a hundred other things in the course of a week I thought, Fay."}, {"userName": "Chrissie", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "All I know is that I couldn't put the book down. It's a good story, well written, exciting and suspenseful. Yeah the language is bad and there is lots of sex, but heck I really liked it A LOT. Fay, poor Fay!A word about Fay. I have been yelled at, in another review, for using the term \"white trash\". So tell me what other words can be used that so succinctly, so completely depict a group of people? OK, I will describe Fay as poor and uneducated, but that just brushes the surface of her ignorance. Her understanding of how the world works is at a completely other level than most people's. She doesn't know about tips or that liquor and cigarettes can only be bought if you are over 18. That is just two examples. I did wonder at times if such ignorance was possible. She went only through the fifth grade. This book shows you her world and it is worth reading just for that. To learn. To understand what such a life is like; not to accuse but to really understand. What are her alternatives? Does she even have any alternatives?Eventually she learns about the real world. All I will say is that she survives. That is the only hint I will give about this story that concerns a police officer, 17 year-old Fay and a strip club bouncer in Mississippi in 1985. Love and survival are the themes.Believe it or not, there is humor. Here is one example. She has learned one must tip. So she tips a taxi driver and he says, \"You are a very kind lady, and a most scrumptious one!\" I smiled. There is so much beer consumed in this book it ought to be made into a movie to sell beer. That the characters didn't simply float away is amazing.Beside the tension that builds, what hit me about the writing was the author's ability to describe body movements in such detail that you can read body language without seeing a picture. This is very effective. The emotions are there before your eyes through the body language described. It is like watching a movie rather than hearing a story. The audiobook narration by Tom Stechschutte was perfect. No complaints. Each character, when they spoke, sounded just as they should sound.*************************My thoughts half-way through: This is so sad. Do you hear me?And life is so complicated. It is actually possible to \"love\" a person so terribly f*/ked up as Fay....even given what she does. My heart bleeds for Fay."}, {"userName": "Diane Barnes", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "I knew I was going to love Fay right from the beginning when she's running away from her family and breaks into a church to escape from a menacing dog. She goes into the kitchen area, finds food in the refrigerator, has a nice meal, then puts everything back where she found it, washed her dishes, wiped off the table, and put a dollar in the collection plate. She's only 17, raised in the sticks, uneducated and naive, and very, very good-looking. But it would be a mistake to underestimate Fay; she can take care of herself, oh yes she can! It would also be a mistake to fall in love with Fay, as a couple of very tough men find out to their sorrow.Larry Brown is the kind of writer that lets you taste every good, ice cold beer, lets you savor every puff of a cigarette, whether you smoke or not, gets you into the heart and soul of poor wretched characters just trying to get through the day or night. It is an incredible novel for all these reasons, but Fay is an unforgettable character. I am still reeling from the ending, I never saw it coming, and it happened so quickly I had to read it 3 times to believe it. Right on, Fay, right on!"}, {"userName": "Larry Bassett", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "I have been having a little trouble recently with Grit Lit being too rough for my liking. So I was not sure I was ready to take on Fay from Larry Brown. But as I got into it, I initially found it very manageable in spite of some violence. I was reading it as a story of a girl whose story was a life of poverty. I found the glimpse into an impoverished life fascinating and reminiscent of some of my work with various social service (welfare) agencies in the south.I was also interested by the general presentation of the male of the species as routinely sons of bitches and bastards, to coin a phrase. Damn. Women have it rough so much of the time. Makes me angry. So to find a teenage girl who takes a tire iron to a rapist is somehow gratifying. He was already inside her when she woke up. A dim bulb was burning in the ceiling over his head so that she saw first the top of his head thrusting against the backdrop of the light. At first she was scared and then she got mad. She tried to push him off but he threw a hard forearm like a steel bar againsther throat and when she tried to push him again he rammed her head back against the armrest and told her to be still, but she could not. He started panting in her ear. And in just a moment it was over for him. He turned his face up and strained against her and she said, “Why you chickenshit.” He lay there for only a moment and then he was coming off her even as she was going for his eyes with her fingernails. He slapped her and knocked her back. He reached for his shorts and underwear. The jack handle was sticking out from under her front seat and she reached and got it and caught him half-turning, a look of surprise coming onto his face, and the lick she gave him slammed his head against the brown pile carpet that lined the walls. Blood came out of his mouth and he spit out a tooth and tried to say something but she hit him again and then he was still, lying there naked curled on his side with one foot almost into the leg hole of his underwear and his tiny dick shrinking as she watched it, glistening, leaking. And what does this teenage girl named Fay think about? Shit, she couldn’t sit here all day. She had to start thinking about looking for a job. She never had asked for a job, didn’t know how to go about it, didn’t know the first thing about it. And what if they asked her a bunch of questions? There might be those forms to fill out. You might have to tell them all kinds of things, like where you were from, how old you were, all that shit, who’s your mother and daddy? Well my daddy’s a drunk and my mama’s a frigging fruitcake and they live in a little rotten cabin up in the woods and the floor’s so dirty you can’t stand to walk on it barefooted. And you have to be careful inside because the wasps keep building nests. Anything else you want to know? I am drawn by the story of poverty, but that is probably a stretch to say that is the big message from the book. Because there is much about drinking and drugging and sex and, I think, that gives poverty a really bad reputation. I think a story about poverty can include more about overcoming and succeeding. About being an amazing person in spite of the poverty. This book really focuses on the downside. It makes you glad that you had the good fortune not to find yourself impoverished. You laugh. You cringe. Who, after all, chooses to live in poverty? In the final analysis, the book drags in too many places. There are some four star sections, for sure, but there is too much that is not essential to understanding the life and choices of Fay. I was distracted by the people (mostly men but some women too) she runs into. They are sad excuses for humanity for the most part. They pass their time doing little if anything of value. Fay spends her time realizing that fact but apparently unable to alter her course in relationship to them. We see both her potential and her failure to achieve that potential. It is frustrating to see Fay fall so short.This is a three star book for me because in spite of the four star segments scattered throughout, there are regrettably plenty of two star sections that are barely tolerable, that I would edit out. Crass writing with dollops of brutal men and brutalized women fills too many of the pages. The very short Epilogue suggests that Fay achieves what might be a higher level of sexualized life as an adult in New Orleans. But she has clearly not escaped her role as object and may not have even aspired beyond that status. Larry Brown does not display much concern for the people in his world or give much hope for their future."}, {"userName": "Rich", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/27477295-rich", "userReview": "4 Stars. Very good. Had good characters, a nice story pace that never stalled out, the writing quality was very good. The dialogue was often southern, rural sounding which seemed to take the setting back in time. It worked for me. The story starts out with a seventeen year girl running away from home in the rural south of Mississippi. It turns out she was under abuse from her Dad, very few details as it is not really a significant part of the overall story. The story is more of an adventure of this young girl on her own as she travels along. There are two major parts of her adventure; One she is staying with a highway patrolman and his wife. The other is she staying with a strip club bouncer.The highway patrolman seems to a have solid, well-off lifestyle. A respectable, well paying job. A beautiful wife. A house on the lake with a nice fishing boat that he takes out often. But all is not as it seems. They have lost a daughter and they are living a broken life. So when Fay arrives it is a welcomed addition to the dynamics inside the house. Tragic events happen and Fay is on the road again.Her next stop is a strip club bouncer named Aaron. He is strong, has money, and wants her to work with his mom at a bed and breakfast he owns. Aaron at first provides a safe and comfortable spot for Fay. They go out to eat, take mini vacations, and enjoy themselves together. But Aaron has some dark sides like being a bit of a playboy, drug running, and a violent streak.There was an adventurous feel to the story. A young person going out into the world with nothing and seeing what happens. I know she didn’t have much choice in the matter but she found herself in some interesting situations none the less. She found some people who were decent to her and she was decent to them (at times and not at other times). The writing style had a hint of Earnest Hemingway with detailed descriptions of enjoying food and drink. Struggles that test your internal fortitude and living under duress. For me, it was entertaining page turner."}, {"userName": "Zyra ", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/45664283-zyra", "userReview": "dnfway too descriptive for me."}, {"userName": "Still", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/6752847-still", "userReview": "WOWMaybe I'll review it later but if you're not inclined to look for a novel by the too soon gone Larry Brown there's nothing I can say about his writing that would change your mind.Stunning.I'd like to add:This is a Grit-Noir novel and a crime-suspense thriller but what makes it memorable is character development.Each of the characters has his/her own, distinctive \"voice\".The plot twists, the entanglements, the unexpected acts of violence that occur - all majestically rendered by a master novelist.Five Stars."}, {"userName": "Derrick", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/2414489-derrick", "userReview": "Last May I took a road trip from central Pa to Oxford as well as other cities in Mississippi. I've always admired Faulkner ..but Larry Brown blew me away a few years ago when I discovered his books . I wanted to see some of the bars he frequented and see Rowen Oak and Faulkner's grave . I've been slowly working my way through his work . Fay was the first I've read since I returned and it was so great to read it having been down there..breathing the same air those characters breathed..driving the same roads ..it's been a few weeks and I can't stop wondering how the characters in the novel are faring ..especially Fay . I love when a novel haunts me like that and Larry's books always do that ..I love his conflicted characters dealing with their hurts and dreams ..as in all of his work I love reading about the relationship with his characters and the land they live in ..the lakes to fish in ..the beautiful tall pines . I loved the rhythm of the writing in Fay especially towards the end of the book . Joe is still my fave of his stuff but all of his books are a pleasure to read ..highly recommended"}, {"userName": "Kirk Smith", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/15749169-kirk-smith", "userReview": "You could say about Fay that trouble followed her. You might note that above all else she is a survivor. She always has a good disposition and intends to do the right thing.* Most of the time I'm thinking about Fay, \"oh well god bless her\", and hoping all will go well. Finally as I near the very end I realize Larry Brown has written a damn good noire novel. All delivered in a nice slow southern pace, with so much lurking violence, sex, and brink of destruction tension that I felt inclined to greedily conclude it. It was the epilogue that I thought was the fitting and appropriate \"noire\" touch. Bravo Larry Brown! **No one can quite compare with Fay (the character),but there is a character very similar to Sam from this novel in Dirty White Boys by Stephen Hunter. State Trooper Bud Pewtie attempts to bring in three escaped convicts in a great fast paced thriller. Both are books I highly recommend."}, {"userName": "J.K. Grice", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/72137025-j-k-grice", "userReview": "I think Fay is one of the most intriguing characters that I've ever encountered in literature. This is a brilliant novel of love and hopes realized and then tragically lost. The ending still haunts me all these years later. I sure miss Larry Brown..."}, {"userName": "Brina", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/3339892-brina", "userReview": "Nachdem ich bereits einige Bewertungen zu \"Fay\" gelesen und gemerkt habe, dass die Meinungen sehr weit auseinandergehen, wurde ich neugierig und wollte dem Buch unbedingt eine Chance geben. Letztendlich gehöre ich zu den Menschen, die das Buch mochten, denn hier erlebt man komplexe Figuren, die man nicht unbedingt ins Herz schließt, ihren Weg aber dennoch gerne mitverfolgt.Zuerst einmal muss man sagen, dass das Buch trotz seines Alters recht frisch und modern wirkt, denn \"Fay\" ist bereits erstmals im Jahr 2000 im Original veröffentlicht worden. Dennoch liest sich die Geschichte zum Großteil sehr spannend und angenehm. Man muss zwar zugeben, dass die Geschichte hier und da nicht ohne Längen auskommt, allerdings fand ich die Geschichte insgesamt einfach gut ausgearbeitet. Die Figuren werden bestens beschrieben, man lernt besonders Fay gut kennen und auch die Dialoge wirken oftmals gut ausgearbeitet und nur selten holprig.Erzählt wird hier die Geschichte von der 17-jährigen Fay, der es in ihrem Zuhause nur noch schlecht geht und kurzerhand beschließt, ihre Familie, insbesondere ihren gewalttätigen Vater, zu verlassen. Mit gerade einmal zwei Dollar und ein paar Zigaretten in der Tasche zieht sie los und erhofft sich ein besseres Leben, in dem Gewalt und Missachtung keine Rolle mehr spielen. Auf ihrem Weg begegnet sie dabei vielen Menschen. Manche wollen ihr helfen, andere wollen sie ausnutzen, doch auch Fay lässt sich nicht alles gefallen und kann trotz ihres Alters gut für sich einstehen.Dennoch ist Fay nicht zwingend eine Figur, in die man sich schnell hineinversetzen kann. Ich kann zwar verstehen, wieso sie unbedingt weg wollte, allerdings wirkt sie stellenweise noch so unreif und naiv, dass man nur mit dem Kopf schütteln kann. Andererseits wirkt sie jedoch oftmals sehr abgeklärt und selbstbewusst, sodass man sie als deutlich älter einschätzt. Wenn man sich als Leser jedoch bemüht, mehr über das junge Mädchen zu erfahren und sich in sie hineinzuversetzen, wird hier eine interessante und vielseitige Figur erleben, mit der man es jedoch nicht immer leicht hat.Das Cover wirkt auf der einen Seite sehr idyllisch, gleichzeitig sieht man aber auch, wie einsam es rund um der Farm ist, sodass das Cover auch gut zur Geschichte passt. Die Kurzbeschreibung ist ebenfalls gelungen und hat direkt mein Interesse geweckt, sodass ich Fays Geschichte unbedingt lesen wollte.Kurz gesagt: Obwohl \"Fay\" sicherlich alles andere als leicht im Umgang ist, erlebt man hier eine spannende und interessante Geschichte mit komplexen Figuren, die nicht nur zum Nachdenken anrege, sondern einen auch das ein oder andere Mal mit dem Kopf schütteln lassen. Mir hat es gefallen und somit kann ich das Buch nur empfehlen."}, {"userName": "Shaun", "userReviewDate": "Aug 17, 2014", "userURL": "http://www.goodreads.com/user/show/9779623-shaun", "userReview": "4.5 starsSex, cigarettes, coffee, and beer on every page...what's not to love...right?But seriously, Brown's writing, eloquent in its simplicity, is top notch, and while this isn't as good as Father and Son, which has a more subtle tragic component, it had me hooked from the first page and kept me hooked through till the end.Coincidentally, I had just finished a true crime book that delved into the sex-for-sale industry, so it was especially interesting for me to see how well Brown captured many aspects of that life.It wasn't perfect. Too many deaths (five in all) that seemed too convenient. And of course, I could see many of the plot twists coming, though that never stopped me from hoping things would work out. Brown just has this way of writing that invests readers, at least readers like me, in his characters. I even found myself caring about minor characters, not because they were nice people, but because Brown brings them to life for better or for worse.In one of the reviews I read, a reader suggested that Fay really isn't the authentic heroine that some have credited her as being, but a mere device used as a means to reveal the true nature of other characters, and I think on some level I agree, and maybe that's why at the end I found myself caring as much about the costars as the star.Would definitely recommend to fans of Grit Lit. This isn't a book for everyone and if you're looking for something uplifting, you'd best look elsewhere. Yet if you enjoy writing that explores how our base and primal drives ultimately contribute to who we are and how we act, maybe even more than we would like to admit, then you might enjoy this as much as I did."}, {"userName": "Laura von Eden", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/51197670-laura-von-eden", "userReview": "‚Fay‘ erzählt die Geschichte des gleichnamigen Mädchens, die aufgrund schwerer Familienverhältnisse entscheidet, wegzulaufen. Die Geschichte ist eine Kombination aus ‚Coming-of-Age‘ und ‚Roadmovie‘, gespickt mit viel Leid, Perspektivlosigkeit und allgemein der dunklen Seite des Lebens.‚Fay‘ ist ein Roman aus der Feder des bereits 2004 verstorbenen Autors Larry Brown. Das Buch wurde bereits 2000 veröffentlich, jetzt endlich hat es den Weg auch in den deutschsprachigen Raum gefunden. Inhaltlich konnte ich einige Parallelen zu dem Film ‚Runaway Girl‘ finden, welcher auch auf einem Roman basiert – dem 2007 erschienen ‚Hick‘ von Andrea Portes. Die Ähnlichkeiten beruhen aber vor allem auf der Grundthematik und der gezeigten Gesellschaftsschicht. Sogenannte Bücher aus dem ‚Country Noir‘ Genre üben eine Faszination auf mich aus, die ich nicht mal in Worte packen kann. Mich interessieren die dunklen Flecken einer Gesellschaft. Da das Buch auch noch in einem meiner Lieblingsverlage, Heyne Hardcore, erschienen ist, brauchte ich nicht mehr viel Anreiz und war sofort interessiert.Bereits zu Beginn der Geschichte wird klar, dass uns hier eine soziale Randgruppe dargestellt wird. Armut, Arbeitslosigkeit, Perspektivlosigkeit, Drogen, sexuelle Gewalt – all dies scheint in Fays Welt an der Tagesordnung zu stehen. Fay möchte ausbrechen und beschließt, ihrer Familie den Rücken zu kehren. Auf ihrem Weg begegnet sie vielen Menschen, die es tatsächlich nicht immer gut mit ihr meinen. Fay wird als eine sehr gefasste, pragmatische, aber doch naive junge Frau dargestellt, die gerne an das Gute im Menschen glauben will. Doch auch bei ihr hat das verrohte Leben schon Spuren hinterlassen und sie wird zunehmend misstrauischer mit jeder schlechten Erfahrung. Trotz ihrer aufgeschlossenen und netten Art, weiß sich Fay zu helfen, wenn sie in Bedrängnis gerät und ist alles andere als eine leichte Beute.Doch Fay trifft leider nicht immer gute Entscheidungen, was wohl vor allem an ihrer Naivität liegt. Für mich als Leser nicht unbedingt nachvollziehbar, aber aus Fays Sicht durchaus. So ist es sogar vorgekommen, dass Fay aus meiner Sicht eine total dumme Entscheidung trifft, die ich überhaupt nicht mochte. Im Verlauf der Story verschlechtert sich aber alles so sehr, dass der vermeintliche Fehler vorher, eher einer Rettung gleichkommt. Die Geschichte selbst hat nicht unbedingt hervorstechende Highlights und fließt eher vor sich hin, jedoch war ich niemals gelangweilt, auch wenn das Buch durchaus ein paar Längen aufweist.Einzig das Ende konnte mich leider nicht ganz überzeugen, da es wohl einfach nicht mein Geschmack war. Ich habe nicht mit einem Happy End gerechnet, da das wohl kaum dem Buch gerecht werden würde, aber etwas weniger offen und ein wenig hoffnungsvoller hätte mir schon gefallen."}, {"userName": "Asghar Abbas", "userReviewDate": "Nov 29, 2014", "userURL": "http://www.goodreads.com/user/show/37421322-asghar-abbas", "userReview": "Brown, a modern day William Faulkner? Maybe, I wouldn’t know, I don’t know, maybe we’ll never know; Brown has been dead since 2004. Fay, one of those things, one of those examples, where the idea is better than the actual thing; a very good concept, just poor execution.The biggest flaw, well to me, was that the protagonist had no redeeming quality. Fay remained as dim-witted as a cow; literally. Well, not literally, but she didn’t learn anything over the course of the book. This exercise may have been a wasted potential, but must have had something going for itself, to end up on the dead tree list, not that means anything. And it cannot be denied that Brown's writing has a certain pull and lots and lots of charm. The high rating is for Brown's style, the strength of his writing, and pure unaltered talent. And for his southern charms. His words are and will always remain genius."}, {"userName": "LeAnne", "userReviewDate": "Aug 30, 2014", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "Despite excellent writing by Brown, I cannot go back & reread this, knowing what I know. The sodden alcoholism, hopelessness, cigarette smoke, death, and the horror in her bedsheets are too dark a trail for me. Fay will suck the joy out of you. No thanks."}, {"userName": "Tina *KillMonotony* Wagner", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/6467673-tina-killmonotony-wagner", "userReview": "WTF THIS ENDING I CANT EVEN„Sag nicht was du tun oder lassen würdest, Schätzchen. Weil du es eines Tages vielleicht musst.“„WAS?!“ – so sah meine Reaktion bei Beenden des Buchs aus, inklusive Einrollen in Embryonalstellung und leisem Wimmern. Doch spulen wir mal ein wenig zurück. Das bereits 2000 erschienene Werk „Fay“ von Larry Brown hat es zu uns nach Deutschland geschafft. Ich hatte noch nichts vom Autor gelesen, der Name sagte mir auch überhaupt nichts, und das Thema war etwas außerhalb meiner gemütlichen Lese-Komfortzone. Es geht um die 17-jährige Fay, die aus ihrem Leben bei ihrer Familie in einer Hütte im Wald, Arbeit seit Kindertagen und… nun ja, „unkompetenten“ Eltern, ausbrechen will und mit nichts außer zwei Dollar und einer halben Schachtel Kippen lostrampt. Richtung Biloxi, denn sie hat gehört da soll es schön sein.Doch leider hat die etwas hinterwäldlerische Fay noch nichts von dem Unheil gehört, das außerhalb ihres doch irgendwie geschützten Umfelds seinen Lauf nimmt. Männer meinen es leider nicht immer gut mit einem, vor allem wenn man so hübsch ist wie Fay. Nachdem sie zunächst bei drei Kerlen in einem Trailer landet, gabelt sie auf dem Highway der Polizist Sam auf. Sam lebt etwas abgeschieden mit seiner Frau Amy am See und verbringt seine Freizeit mit Angeln. Die beiden nehmen Fay auf, als wäre sie ihre eigene Tochter. Hier könnte die Geschichte enden, tut sie aber nicht. Dinge laufen schief, ein Mensch stirbt, Fay bekommt Angst und zieht, während Sam arbeiten ist, weiter. Immer weiter Richtung Biloxi. Dort lernt sie die junge Kellnerin und Stripperin Reena kennen, die für Geld auch noch andere Dinge tut, und den Bruder des Stripschuppen-Besitzers, Aaron. Anfangs ist sie noch ziemlich eingeschüchtert von diesem Koloss von Mann, doch nach einer Weile beginnt sie, ihm zu gefallen. Und er ihr.Währenddessen findet man eine Leiche, Sam sucht verzweifelt nach Fay, die sich in den Armen von Aaron immer noch liebevoll an ihn erinnert. Dinge nehmen ihren Lauf und leider kommt nicht jeder lebend aus dieser Geschichte heraus.Die vollständige Rezension findet ihr auf meinem Blog: http://killmonotony.wordpress.com"}, {"userName": "Elisabeth", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/51196647-elisabeth", "userReview": "Fay hat mich schlussendlich ziemlich beeindruckt. Es zeigt vor allem eine deprimierende, schmutzige Seite des Lebens, Abgründe, Schicksale und wie alles auch einfach mal den Bach runtergehen kann. Stellenweise hatte man ein paar nicht ganz passende, lange Monologe, die Längen hereingebracht haben und oft war man einfach nur schockiert. Es ist definitiv nichts, was man an einem Stück liest, weil man es erstmal verdauen muss. Aber je mehr man sich dem Ende nähert, desto mehr ergibt alles einen Sinn und das Finale war unheimlich gelungen. Besonders ist außerdem der Schreibstil und die Beschreibungen des Autors, alle Orte sind nämlich aus der Gegend um seine Heimat und es wirkt, als wäre man wirklich da, weil alles sehr lebhaft eingefangen wurde - wirklich bemerkenswert. Gute 4 Sterne von mir, ich würde definitiv wieder einen Brown lesen. Leider ist dies das erste Werk auf deutsch und der Autor früh gestorben, aber dann widme ich mich eventuell mal den Originalausgaben."}, {"userName": "Ken Oder", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/22944208-ken-oder", "userReview": "This story catches you up on Brown's easy flowing river of prose, smooth and fluid, and it takes you on a long enjoyable journey through gritty, real, southern-fried Mississippi. Chain-smoking, beer drinking, drunk driving, brawling, sleeping around (a lot), Fay's characters are a tough crew I wouldn't want to hang out with, except through fiction. Brown takes you inside their minds with a third person/first person point of view narrative. Fay, Sam, Amy, Aaron are all very different people, but he masters their voices to the point where you think they're sitting beside you telling you the story, which is not always comfortable, by the way. I was enthralled with this novel, but I finished it kind of surprised to find myself wondering what point Brown was trying to make. My answer is there probably was no point, no lesson to learn, and somehow that's okay because wallowing around in the lives of these fascinating people was so much fun."}, {"userName": "Mister Jones", "userReviewDate": "Jan 13, 2008", "userURL": "http://www.goodreads.com/user/show/688091-mister-jones", "userReview": "A friend of mine, knowing that I was a Larry Brown fan, gave me an autographed copy of  Fay when it was first published. The first time I read it, I couldn't put it down until I finished it two and half days later. This was the South I had grown up in, and maybe didn't want to talk about, but knew wasn't very far away, and closer than I was willing to admit. Fay's journey through the trailers and strip bars and the various characters she interacts with makes this book eerily real. Brown's capacity to draw the reader's interest from the first word of  Fay is one of the hallmarks that made him one of the great contemporary Southern writers."}, {"userName": "William", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/2042130-william", "userReview": "I THINK THIS COULD BE DEVELOPED INTO A MOVIE. MY SON KNOWS PHIL ROSENTHOLIN L.A. BUT DON'T KNOW IF THAT HELPS. PHIL HAS A WONDERFUL MOVIE ROOM IN HIS HOUSE WITH APP. 25 THEATER SEATS. SCREEN IS 15 FEET. THEY HAVE MOVIE NIGHTS EACH MONTH AND SERVE 10-15 DIFF. PIZZAS FROM THEIR WOOD-BURNING OVEN. IT WAS WRITTEN UP IN THE L.A. TIMES LAST YEAR. PHIL'S WIFE IS VERY NICE. SHE WAS IN EVERYBODY LOVES RAYMOND AND PHIL WAS THE PRODUCER. PHIL HAS ALSO WRITTEN A BOOK."}, {"userName": "Jürgen Zeller", "userReviewDate": "Jul 02, 2017", "userURL": "http://www.goodreads.com/user/show/27198733-j-rgen-zeller", "userReview": "Der Schriftsteller Larry Brown ist eine weitere starke Stimme aus dem Sub-Genre des amerikanischen Country Noir. Leider Gottes eine, die im Jahr 2004 für immer verstummt ist. Der Heyne Hardcore Verlag hat sich glücklicherweise entschieden, seinen Roman \"Fay\", der im englischen Original bereits im Jahre 2000 erschienen ist, auf Deutsch übersetzen zu lassen und in schöner Gestaltung als Hardcover zu publizieren. Brown erzählt eine fatale Geschichte aus der verarmten Gesellschaftsschicht in Amerika. Von Menschen, die durch alle sozialen Netze, die in diesem erzkapitalistischen Land eh kaum vorhanden sind, gefallen sind und denen anscheinend ein Grossteil an korrektem bürgerlichen Verhalten, so wie wir es kennen, abhanden gekommen ist. Alkohol, Drogen, und (sexuelle) Gewalt sind in diesem archaischen Fleckchen Erde fast an der Tagesordnung. Zumindest pickt der Autor genau diese Elendsgeschichten heraus und erzählt sie in diesem Buch und hält der amerikanischen Gesellschaft einen Spiegel vor. Er berichtet von Menschen die alles verloren haben und nach ihren eigenen teils verrohten Regeln leben.Inhalt: Fay Jones ist eine siebzehnjährige Ausreisserin die es in ihrem höllischen Zuhause irgendwo in der Einöde nicht mehr ausgehalten hat. Mit zwei lumpigen Dollar trampt sie gegen Süden mit Ziel Biloxi an der Küste des Golfstroms wo sie sich ein besseres Leben erhofft. Arm ist sie nicht nur an Geld sondern auch an Bildung (was nicht mit Intelligenz verwechselt werden sollte) da sie die Schule früh schmeissen musste weil sie zu Hause zur Arbeit gezwungen wurde. Dafür ist sie reich an Schönheit was den Männern die sie trifft nicht entgeht. Das unbedarfte Mädchen gerät an diverse Kerle und nicht jeder meint es gut mit Fay. Im hilfsbereiten Polizisten Sam und seiner Frau Amy findet die für ein paar Wochen Unterschlupf und fühlt sich zum ersten Mal in ihrem Leben geborgen und wohl. Schnell lernt sie ein paar grundlegende Sachen, die für uns selbstverständlich sind, bevor ein dramatischer Unglücksfall sie wieder auf die gefährliche Strasse zwingt …Es gibt in den amerikanischen Südstaaten eine grosse Tradition und eine währschafte Schar an grossen Literaten die sich mit den Abgehängten und Verlorenen des Gesellschaft beschäftigen und ohne falsche Scheu von ihren tristen Leben erzählen. Angefangen beim Übervater Faulkner über Dexter, Lansdale, McCarthy, Pollock, Thompson oder Woodrell, um nur einige zu nennen, erzählen sie mit universeller Symbolik von der Vergangenheit und der aktuellen Zeitepoche. Country Noir ist und bleibt aber ein Untergenre für ein kleines Grüppchen weil viele Leser lieber von verklärt-romantisierten Sujets lesen als von der sauren Realität. Ich fühle mich von diesen derb-klebrigen Geschichten angezogen und lese diese Art Literatur sehr gerne.Fays irritierendes Schicksal verwebt sich zu einem Netz falscher Entscheidungen und leitet sie zu einem Lebensweg, bei dem am Ende nur ein klitzekleines Stückchen Hoffnung übrig bleibt. Man könnte auch schreiben, sie ist gefangen im amerikanischen Albtraum. Ich hoffe, dass sie ihr Glück dereinst finden wird."}, {"userName": "Eric Smith", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/57120999-eric-smith", "userReview": "Oh Mr.Brown you had me on this from the first chapter, I had such high hopes for the characters I followed. The writing is great and the story is haunting. The anger I felt for Fay' s daddy, why do some people got to be so evil, He would make an excellent candidate for a real life crash dummy. Then there are all the folks that you run into on Fays journey, and I found myself getting more frustrated as this story went on. This will hold your attention all the way through but sadly the ending just was a big steaming pile of disappointment. I give this 4 stars because it was so well written but not 5 because it pissed me off in the end!"}, {"userName": "Dorle Kopetzky", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/38794899-dorle-kopetzky", "userReview": "a few cans of really cold beer too much but a very compelling read"}, {"userName": "sappho_reader", "userReviewDate": "Jul 13, 2013", "userURL": "http://www.goodreads.com/user/show/17068912-sappho-reader", "userReview": "“She kept walking. Same old shit.”Fay walked a lot. She walked in search of food and shelter. She walked away from the police. She ran from individuals who tried to harm her. She walked away from her family and her vile father. She walked and hitched rides from one end of Mississippi to the other. That’s a lot of walking.This book is a sequel to Joe. Although Fay can be read as a standalone it is best to read Joe first to understand what made Fay to run off in the first place. The exploits of her father Wade, who is the most disgusting character I have read in recent memory, are clearly outlined. It is no wonder Fay just got up and ran off from her family.Being young and pretty Fay is vulnerable walking on the side of the highway. Men tried to pick her up and take advantage. That is what made this book so suspenseful. You did not know what was going to happen. Larry Brown writes in a fashion that happy endings are not guaranteed. I always expected her to be found in a ditch with her throat slashed, or even worse. My main complaint was Larry Brown’s tendency to describe every single detail in each scene. Details that do not have any bearing on the plot at all. It was so difficult to establish a rhythm and flow while reading since I was constantly slogging through these endless details. This book is just about 500 pages but if the fat was trimmed by the editor it could have been a more manageable length. To be honest I probably would have given up if it were not for my love of the subject matter and my need to find out what happens to Fay. Now I’m glad I stuck it out to the end. The pace changed dramatically during the last hundred pages. I whizzed through them last night with great anticipation of the ending. And what a goddamn ending that was!! Did not see that coming at all. Larry Brown hit me with a brick and left me hanging with no answers to my questions. Rating: 3 Stars (“I Liked It”). It is sad that this was the last we will read about Fay due to the death of Larry Brown."}, {"userName": "Lydia Presley", "userReviewDate": "Nov 24, 2009", "userURL": "http://www.goodreads.com/user/show/50581-lydia-presley", "userReview": "Once again, I'm struck with how silly it is to have labels for the stars. I did not like this book, I didn't really like it. It's no slight against the author, because Fay was well written and interesting. It's just impossible to like this story.My sister handed me this book and asked me to read it because she wanted some insights from me for a paper she needs to write about it. If it had not been for this, I never would have read this book as I tend to steer clear of dismal stories. And make no mistake, this is a dismal, gritty story. Do not look here for redemption, you will come away sorely disappointed.This is the story of 17 year old Fay. She's a poor country girl, \"white trash\" by label, but her actions are sweetly innocent and endearing, in spite of the horrifying things she does. This book puts into perspective how uneducated the poor can be and how easy it is once you get to know them to feel sympathy and the urge to help them. I do congratulate the author on successfully portraying this girl as someone I ached to just whisk away from it all. She was polite and well-mannered (as well as she could be), but also a murderer and capable of doing horrifying deeds.If you are interested in reading about just what circumstances can cause a girl to turn to using herself as a means to earn money, then this is definitely the book for you. But please, don't expect any sort of good and happy feelings to come out of the experience."}], "description": "She's had no education, and you can't call what her father's been trying to give her \"love.\" So at seventeen, Fay Jones leaves home, carrying a purse with half a pack of cigarettes and two dollar bills. She's headed for the bright lights and big times of Biloxi, and even she knows she needs help getting there. But help's not hard to come by when you look like Fay.  There's a highway patrolman who gives her a lift, with a detour to his own place. There are truck drivers who pick her up, no questions asked. There's a crop duster with money for a night or two on the town. There's a strip-joint bouncer who deals on the side. And in the end, there are five dead bodies stacked in Fay's wake.  Fay is a novel that could only have been written by Larry Brown, whom the Boston Globe called \"one of our finest writers -- honest, courageous, unflinching.\"", "title": "Fay", "url": "http://www.goodreads.com/book/show/888492.Fay", "average": 4.0, "cover": "https://images.gr-assets.com/books/1432660683l/888492.jpg", "reviews": 231, "authors": [{"url": "https://www.goodreads.com/author/show/31125.Larry_Brown", "name": "Larry Brown"}], "type": ["Fiction", "American", "Gothic", "Novels", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/888492.Fay", "http://www.goodreads.com/book/show/2194397.Fay", "http://www.goodreads.com/book/show/16370140-fay", "http://www.goodreads.com/book/show/34656707-fay", "http://www.goodreads.com/book/show/377993.Joe", "http://www.goodreads.com/book/show/256109.Father_and_Son", "http://www.goodreads.com/book/show/539933.Big_Bad_Love", "http://www.goodreads.com/book/show/377994.Dirty_Work", "http://www.goodreads.com/book/show/377991.Facing_the_Music"]}