{"ratings": 9, "userreviews": [{"userName": "Kevin Ansbro", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/43579369-kevin-ansbro", "userReview": "“Don’t even pretend to yourself that you could fight me, because you can’t, or that you can come back when I’m not here and cause my friend unhappiness. You’d need to kill me first.”\nThis is a very short story, an amuse bouche in readiness for other works by this writer of hard-boiled noir.From the get-go, we have here the makings of a cracking thriller: the war-hardened state assassin, a MILFish Detective Chief Inspector (who I immediately imagined to look like Helen Mirren), and a condescending government official who wouldn’t know an Uzi from a Jacuzzi.The killer, a sergeant, describes himself as nothing more than a blunt instrument, a last resort. But DCI Jackie Hannah senses that the man sent to assist her is so much more than he professes to be.Their sexual chemistry is instantaneous and palpable, and astonishingly the story took a direction that I did not see coming!"}, {"userName": "Shervin Jamali", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/7869699-shervin-jamali", "userReview": "A romping, stomping fun read!It's hard for an author to pack a lot of what passes for trusted formulas into a novella or short story based on the length that they are working with. Protagonists need not have a great deal of depth and development, as long as they are interesting and likable. And the story has to progress at a fast pace. Westworth has covered these bases well. JJ Stoner is an interesting character, a no-nonsense straight shooter who has a job to do, no questions asked and no unnecessary information required. I enjoyed joining him on his latest mission and I did not see the twist in the latter part of the story coming. A welcome fast read indeed."}, {"userName": "Col", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/12761919-col", "userReview": "Synopsis/blurb.....An action-packed quick thriller featuring covert operative JJ Stoner, who uses sharp blades and blunt instruments to discreetly solve problems for the UK government. In Fifth Columnist, a bent copper is compromising national security but none of the evidence will stand up in court. That’s exactly why men like Stoner operate in the shadows, ready to terminate the target once an identity is confirmed… Fifth Columnist is a quick thriller, an hour’s intrigue and entertainment. It features characters from the JJ Stoner / Killing Sisters series. You don’t need to have read any of the other stories in the series: you can start right here if you like. As well as a complete, stand-alone short story, Fifth Columnist includes an excerpt from The Redemption Of Charm (to be published in March 2017). Please note that FIFTH COLUMNIST is intended for an adult audience and contains explicit scenes of a sexual and/or violent nature. --------------My take.......Well an hour's intrigue and entertainment was promised and that's what I got.Stoner has an associate out on an operation, he's just talking with the client - a senior police officer about attendance at a function in the evening to scope out the target.\"I'm a master of disguise ma'am. I could probably impersonate a human, given enough time to practice a little.\"When he arrives to collect her in the evening, a discussion ensues about reading habits.Him - \"Any good thrillers there?\" - a nod to the crowded shelves.Her - \"I prefer history. Why people do what they do and how they work together. Lots to learn.\"The sergeant sighed, a frighteningly, honest sound, profound and deep. \"Written history is almost always lies. Read it to understand what the lies are for, remembering who wrote the book and why. History's all good stories, but I prefer fiction. It's more honest.\"Those exchanges capture what I like best about Frank Westworth's Stoner stories (admittedly I've only read 2 of the 5 so far) - you get a bit of philosophy, laced with humour as well as your no frills action.In Fifth Columnist Westworth spoils us - with a two-fer, as we have another operation - more a favour for a friend, running in tandem with our main case. A message is delivered, amateur castration mentioned, a concise visual demonstration provided. Problem solved.Back to our main event - dinner and drinks, another meeting, more verbal jousting and interplay and a surprising conclusion to our case. Didn't see the twist in the tale coming.Tight, humourous, direct, logical, philosophical and a bit scary. How many Stoners are out there conducting their black arts? Are they a necessary, shadowy instrument of the state, working for the common good or available to the highest bidder? They say we don't have a \"legal\" death penalty in the UK, Westworth and Stoner might lead you to believe otherwise.4.5 stars from 5With the book comes an interesting bonus - the opening to his next full length novel - The Redemption of Charm - I would have carried straight on reading it if I could!First Contract was read and reviewed here.http://col2910.blogspot.co.uk/2015/11...Two Wrongs, Third Person and Four Cornered are on the wishlist!Fifth Columnist was supplied by the author for an honest review.Frank Westworth was on the blog yesterday answering a few questions - here.http://col2910.blogspot.co.uk/2016/09...Catch up with him at any of these locales...Facebook: www.facebook.com/killingsistersWebsite: www.murdermayhemandmore.net Blog: https://murdermayhemandmore.wordpress...Amazon: www.amazon.co.uk/Frank-Westworth/e/B0... Goodreads: www.goodreads.com/author/show/576653....Read in September, 2016http://col2910.blogspot.co.uk/2016/09..."}, {"userName": "David Baird", "userReviewDate": "Dec 22, 2016", "userURL": "http://www.goodreads.com/user/show/21696148-david-baird", "userReview": "I actually read Fifth Columnist last year not long after it was released but I've been waiting to review it until I had the time to read it again as part of The Stoner Stories collection. Look out for that review soon :).Fifth columnist is the fifth tale in the JJ Stoner short stories. The author has also wrote two full length novels that feature some of the characters but I’ve not had a chance to read them yet and can confirm it didn't affect how much I enjoyed or understood these short stories.Once again Frank Westworth has given us a super short, informative and intriguing tale.What Frank does well for me is that he gives you just enough information to follow the action but not enough so to give you the full picture. For me this works perfectly. As someone who is yet to read the full length novels it hooks me in.. makes me want to know more about the characters. I can quite imagine also that if I had read the longer novels then these shorts would build nicely onto the series.Focusing on Fifth columnist itself I have to say I enjoyed it..there’s quite a build up with this one then BANG.. twist..and I was left rereading the page so I could fully take in what had just happened..It was the wow moment I was looking for at just the right time.I enjoy short stories like this, it’s a great way to see how an author writes before committing to larger works.Overall this is another great short from Frank which builds nicely onto the foundations set in the previous shorts. I highly recommend you read the shorts as a collection as I feel you get more from it that way. I'll certainly be making time to fit more of Frank's work into my reading schedule this year."}, {"userName": "Wendy Cartmell", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/6673032-wendy-cartmell", "userReview": "In Fifth Columnist, a bent copper is compromising national security but none of the evidence will stand up in court. That’s exactly why men like Stoner operate in the shadows, ready to terminate the target once an identity is confirmed…Oh my, this book surely packs a punch. A covert operative determined to keep his distance from the British policewoman he’s working with. He’s a last resort. Mostly silent, definitely enigmatic, a man of few words yet always on hand. Known only as ‘Sarge’ DCI Hannah Jack Hannah doesn’t know what to make of him. Yet in his cold, still, silent way Sarge solves the mystery. He instructs her, and the reader, in the ways of covert operations, always giving a different ‘take’ on any situation.The writing is bold and blunt, with horrific things said in a matter of fact way. “I kill people. That’s what I’m paid to do.” It sends a shiver down your spine.Following the short story is the opening to the author’s new book Redemption of Charm to be published in 2017. This was gripping, thrilling and with lots of action. In a way the antithesis to the short story. Both good. Both gripping in their own way. This was my first foray into the writing of Frank Westworth and I’m sure it won’t be my last.I received a copy of the story from the publisher in exchange for an honest review."}, {"userName": "Breakaway Reviewers", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/22317001-breakaway-reviewers", "userReview": "Yet Another Barnstorming Short StoryAn action-packed quick thriller featuring covert operative JJ Stoner, who uses sharp blades and blunt instruments to discreetly solve problems for the UK government. In Fifth Columnist, a bent copper is compromising national security but none of the evidence will stand up in court. That’s exactly why men like Stoner operate in the shadows, ready to terminate the target once an identity is confirmed.Fifth Columnist is an excellent couple of hours' entertainment, as have been the previous four short stories from this exciting author. It can be read as a stand-alone but I think it would be better to have read one or more of the previous short stories. I love Stoner as a character and the author always seems to manage lots of violence without any of it being gratuitous.The e-book I was kindly sent by Breakaway Reviewers also includes an excerpt from The Redemption Of Charm, a full-length novel about Stoner which is to be published in March 2017. Quite frankly (pardon the pun), I can't wait to get my grubby hands on this latest installment, as Frank's full length novels are in no way dissipated by their length, in actual fact, they are probably more thrilling. JJ Stoner continues to be an interesting character, a no-nonsense straight shooter who has a job to do, no questions asked and no unnecessary information required. I enjoyed immensely joining him on his latest mission and this story had a very unsettling twist in the tale which I did not see coming. I cannot recommend this author highly enough and have even corresponded with him and he is a nice chap to boot!Digger 95Breakaway Reviewers received a copy of the book to review"}, {"userName": "Nik Morton", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/1548866-nik-morton", "userReview": "This is a crime short story by Frank Westworth. It also serves as an introduction to his novel The Redemption of Charm, as there’s an extract at the end of the story. These books are labelled as for an adult audience, as they contain explicit language and scenes of a sexual and violent nature.I was soon sucked into the story, which was about a British army sergeant being hired for a hit by, of all people, the police. The one-liners come thick and fast, there’s innuendo and some great enjoyable word-play, too. There’s not a lot of action until we get to the devastating end, when the tables are turned, and not only tables. The slick switcheroo worked well; I didn’t see it coming. The novel excerpt begins with Stoner on his Harley in the American north-east, enjoying the scenery. Unfortunately, a group of bikers take exception to him and a little friction results. Here, we get to see action, plenty of it, swift, brutal and bloody, laced with irony and wit. While this episode can stand alone, the excerpt nevertheless does what is intended, arm-twisting the reader in wanting to read more. Like a number of crime novelists, Westworth has latched onto a motif for his short story series titles:First ContractTwo WrongsThird PersonFour CorneredFifth ColumnistHe must be doing something right, because he has picked up reviews in double figures! And with endorsements from R.J. Ellory and Maxim Jakubowski, I suspect that he’s going places, doubtless on his beloved Harley-Davidson. Good old sex and violence – can’t beat it!"}], "description": "An action-packed quick thriller featuring covert operative JJ Stoner, who uses sharp blades and blunt instruments to discreetly solve problems for the UK government. In Fifth Columnist, a bent copper is compromising national security but none of the evidence will stand up in court. That’s exactly why men like Stoner operate in the shadows, ready to terminate the target once an identity is confirmed… Fifth Columnist is a quick thriller, an hour’s intrigue and entertainment. It features characters from the JJ Stoner / Killing Sisters series. You don’t need to have read any of the other stories in the series: you can start right here if you like. As well as a complete, stand-alone short story, Fifth Columnist includes an excerpt from The Redemption Of Charm (to be published in March 2017). Please note that FIFTH COLUMNIST is intended for an adult audience and contains explicit scenes of a sexual and/or violent nature.", "title": "Fifth Columnist (JJ Stoner #5)", "url": "http://www.goodreads.com/book/show/31699504-fifth-columnist", "average": 4.56, "cover": "https://images.gr-assets.com/books/1472470135l/31699504.jpg", "reviews": 7, "authors": [{"url": "https://www.goodreads.com/author/show/576653.Frank_Westworth", "name": "Frank Westworth"}], "type": ["Thriller", "Short Stories", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/31699504-fifth-columnist", "http://www.goodreads.com/book/show/22586675-first-contract", "http://www.goodreads.com/book/show/22602019-a-last-act-of-charity", "http://www.goodreads.com/book/show/23149796-two-wrongs", "http://www.goodreads.com/book/show/26218323-the-corruption-of-chastity", "http://www.goodreads.com/book/show/26083557-four-cornered"]}