{"ratings": 945, "userreviews": [{"userName": "karen", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "man, i'm so glad i didn't have to spend 40 bucks on this. not because i would have regretted the purchase if i still had disposable income to toss madly at things i love, but because the relationship between \"things i want\" and \"things i can afford to want\" is uneven and the more money i can allocate for cat chemo and rent, the fewer my panic attacks will be. so, all gratitude to the services of netgalley for people who wish they were high rollers, but are not. this is another win for mira grant.i can see this sci-fi/horror novella being adapted into a better-than-average episode of black mirror. in fact, it reads like a mash-up of the black mirror episode \"playtest,\" buffy, and the free tor short i just read by julianna baggott, The Virtual Swallows of Hog Island, which you can read here: http://www.tor.com/2017/01/25/the-vir....it's about the union of technology and therapy, where clients are shot through with pharmacological goodies and delivered into a virtual reality landscape designed by technicians with backgrounds in theater or haunted house design, intended to force patients to face their fears in a safe environment to overcome phobias, or to go through a fear-based experience with a rival or enemy in the expectation that a shared emotionally-charged scenario will diminish animosity and heal their relationship. however, every \"safe environment\" can be twisted into dangertown in the wrong hands. and mira grant loves to be the puppeteer manipulating those hands.it's too short to reveal too much, but know that it has all the things that make mira grant so damn good: science bits that seem plausible, characters facing horrifying adversaries, blood blood carnage, lines like any word can be an insult if it's thrown hard enough from the window of a moving sneer, and an ending that is satisfying, unexpected, and a little more emotionally complicated than most. financially untroubled folks can show your support and spend your $$$ here:http://subterraneanpress.com/final-girlsthe rest of you can get it from netgalley for free until may.either way, you should get on it.***********************************************THANK YOU NETGALLEY!! review to come!************************************************oooh, the cover is up now!! and there's an EXCERPT at that link! go read it!***********************************************i am too freaking poor right now to be spending 40 bucks on a novella, but maybe one of y'all can grab a copy and tell me all about it:http://subterraneanpress.com/store/pr...i will be waiting."}, {"userName": "Chelsea Humphrey", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "Recently Mr. Humphrey and I watched an episode of Black Mirror where a man volunteered to be a test subject for a video game that supposedly was a realistic way of being inside the game itself. The idea was to see how long each player lasted, as the game fed on your imagination and brought your worst nightmares to life. Final Girls was based on a similar premise that I felt was a better version of that show. I really enjoyed reading this novella, so much in fact that I wish it had been longer than 112 pages. The journalist POV was an excellent choice to add a realistic sense to the plot, and I think it gave the characters a bit of humanity as well. The ending was a little cheesy, but overall I was completely engrossed and basically held my breath as I raced through the story in one sitting. I easily could have read a full sized book on the subject and found myself simultaneously obsessed and disgusted. Highly recommended for fans of lighter horror and all kinds of deliciously weird writing.*Many thanks to the publisher for providing my copy via NetGalley. **You may also know Mira Grant from her writing as Seanan McGuire, author of the Wayward Children series."}, {"userName": "Bradley", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Another win for Mira Grant (Seanan Mcguire). :)This is a short psychological technothriller involving virtual reality, psychological therapy, and a bit of industrial espionage.... but if you're REALLY worried that you'll be missing out on a few nom-nom moments, don't be. This has everything we've ever wanted in a book from the horror/SF queen.The real joy comes from both the characters and the cool explanation of how to use dreams and virtual reality together to build helpful, if fake, memories and establish a better foundation for one's psyche. Were you scarred by something in your childhood? Missing fundamental connections with your loved ones? Perhaps just need to take care of a few phobias? No problem. Introducing scripted dreams/memories. :)Of course things go to hell. And that's what we love so much about these books, right?Most interestingly, however, is the focus on FRIENDSHIP in this novella. It's pretty damn awesome.I'd say go run out and buy a copy, but it's at a whopping $40 at the moment! Still, it's worth it. :) Assuming you're not using Netgalley! Hi, Netgalley!Thanks to Netgalley for a copy of this cool ARC! :)"}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestI haven't read a lot of Mira Grant's work, but what I have read, I've really liked. Grant writes good, compelling female heroines, and fuses science fiction and horror with an ease that I haven't really seen anyone master since Michael Crichton - and FINAL GIRLS is something out of a Michael Crichton nightmare.Dr. Jennifer Webb is the inventor of some controversial technology that \"treats\" clients by having them undergo and resolve psychic conflict in the form of fully immersive virtual reality horror scenarios paired with psychotropic drugs, all to manipulate the emotional centers of the brain. Esther Hoffman is a pop science reporter for a magazine called Science Digest. She's been sent to the VR clinic by her boss to experience the scenario firsthand and see if the claims of its healing magic have any merit. She's understandably skeptical, because she's been burned by regression therapy before.Esther agrees to go through the scenario, along with another patient - for SCIENCE - and immediately it's clear that...things are not right. Because when have things ever gone right in books or movies when done for SCIENCE? Science is always the villain in fiction.\n\nFINAL GIRLS explores the relationship between mind and body in a way that's straight out of The Matrix: that fear response is an electrochemical reaction to outside stimuli. It actually struck me as really interesting, because the \"conditioning\" done here kind of reminded me of the \"conditioning\" that's done in CLOCKWORK ORANGE. Both use traumatic events to manipulate emotional response and cognitive associations in order to change behavior. I was actually discussing this in a book club, recently, because my point was that superficial conditioning like this doesn't really work that well because of all the layers of thought processing that exist in the brain: behavior and emotional response are easier to change than core concepts making up identity and personality.I felt like we see that with Esther, who, at one point, understands that her altered reality isn't quite right, even though she gives into it (partially because of the drugs, because, you know, drugs).I'm not 100% sure I buy this concept. I studied psychology in school, and the premise of this \"therapy\" felt a lot like that \"day-care sex-abuse hysteria\" phenomenon that happened in the 80s and 90s, when repressed memories entered the mainstream vocabulary and suddenly everyone was claiming that their schools participated in Satan-worshiping and orgies. Webb's \"therapy\" felt like it was more about brain-washing and creating false memories than it was about repairing old ones. I wondered if perhaps that was the point. Grant drops several hints that suggest this book could go either way, which is brilliant, if that was truly her intention. I love it when things go all meta on me.FINAL GIRLS is a horror novel for the 21st century that will have you thinking twice the next time you say to yourself, \"I wish my video games were real.\" Still not convinced it's such a bad idea? I have two words for you, my friend: Silent Hill. Convincingly creepy as it was, I do wish FINAL GIRLS was longer. Reading it was like reading one of those Tor.com shorts. Interesting and frustrating all at once. There was an interesting concept here, and I would have liked to see it explored at length instead of being presented in this abbreviated form.Thanks to Netgalley/the publisher for the review copy!3 to 3.5 stars"}, {"userName": "Justine", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/18656418-justine", "userReview": "I don't read a lot of short fiction or novellas, which is something I am trying to remedy this year. I did read Every Heart a Doorway last year and loved it, so I was pretty excited to pick up Final Girls. Even though it is not officially scheduled for release until April, you can get it now, along with a bunch of other great stuff, as part of the current Humble Bundle book bundle. Yay:)It's a really smart and cool little horror story that even includes a reference to Buckaroo Banzai, science hero extraordinaire. Nice. I wanted a tiny bit more, but overall I felt it delivered what I was looking for."}, {"userName": "Steven", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/11855472-steven", "userReview": "Thanks to Netgalley and Subterranean Press for providing a copy of this in exchange for an honest review.For those who don't know, Mira Grant is a pseudonym for the genius and brilliant Seanan McGuire who, over the past two years, has weaseled her way up to my top favorites list of authors. She's absolutely fantastic, and this shorty is just another shining example of how she can throw you into any situation and make you care about the characters and what's happening to them AND make you feel like the world she's creating is bigger than just the words on the page.This one wasn't perfect by any means - the resolution seemed a little rushed, and the novella could have been another 20-30 pages long and felt more complete, but it was still a shiny little gem of a story.Read it. :)"}, {"userName": "Veronique", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/12371602-veronique", "userReview": "Horror is not my usual haunt but this novella sounded too interesting to miss.Esther Hoffman is a reporter determined to expose a new experimental therapy using virtual reality as a sham, while Dr. Jennifer Webb is fighting to validate the fruit of her efforts. Add to this a case of ruthless corporate espionage, and what should have been a trial session turns into a horrific nightmare where the two women have to partner up in order to have a chance to survive.I was impressed by Grant’s writing style and her characterisation. Esther and Jennifer are both strong-willed but in very different ways and I enjoyed their interactions. The whole notion of using traumatic events and fears to manipulate emotions is a mine field but the author uses this in a very entertaining fashion. I ended up reading this in one sitting. Might be tempted to try one of her novels..."}, {"userName": "Amanda", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "Well that was fun! I've only in the last year or two learned to appreciate novellas and this was a good one with some cool 80's references and just a solid techno-horror story."}, {"userName": "Lindsay", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/10326608-lindsay", "userReview": "Dr Jennifer Webb has created an immersive shared-world VR technique that with a combination of powerful psychotropic drugs, can be used as a psychological therapy to help damaged relationships. Esther Hoffman is a reporter determined to reveal Jennifer's work as dangerous and fraudulent. While demonstrating the technology by sharing a VR experience things go horribly wrong and the fake horror movie experience becomes a deadly one instead.Mira Grant is a fascinating creation, almost as much of a character created by Seanan McGuire as the characters of the books she writes. This is very much a quintessential Mira Grant book, with a scientific approach to horror and everyone being damaged. I actually think her books in this style work better at this length."}, {"userName": "Kara", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/284485-kara", "userReview": "Why yes, yes I did just spend $40 to buy a little novella. (But it's signed! And limited edition! And I <3 Mira Grant.) http://subterraneanpress.com/store/pr...-----Once again, Mira Grant (the pen name of Seanan McGuire) did not disappoint! I love this idea: a doctor using immersive virtual reality to deal with psychological issues. Esther, a journalist sent to investigate and report, is a skeptic."}, {"userName": "Izzy", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/31211197-izzy", "userReview": "If she couldn't save her father, she was going to save everyone else. It was redemption. It was obsession. It was the only thing she had.\nthank you Netgalley and publisher for providing me with this arc. all opinions stated are my own!esther hoffman is a skeptical journalist who's doing a piece on a new controversial, but so far proven effective, form of therapy. essentially, it's an adapted regression therapy, where patients face horror-movie scenarios in order to overcome a significant event, or to change something in their personalities. dr. webb, the creator of the method, invites her to try it out for herself so she can see it's really effective. and it does work, in a way. esther is definitely affected.i've read another piece by mira grant before,  rolling in the deep, and this one reminded me a lot of it: compelling characters, a plausible story that morphs into unimaginable horrors, and fantastic writing. there's a tale of female friendship woven into the science and the deaths in this one that definitely made it stand out. although it's very short, the conection shown between the characters was entirely believable and well-constructed.this one was particularly interesting to me because i'm a psych major, and i was surprised because the way dr. webb described her procedures was completely realistic, albeit it would not stand in a contemporary setting, because it completely disregards some notions that have become common even in the most behaviour-centric forms of therapy.and also this would just never happen because it's way too risky and the horror-story scenario formed here would definitely happen lolbut STILL. this was ridiculously entertaining and i read it in one sitting, which is definitely a rare occurrence to me now that i'm a working woman. definitely recommend that y'all check this one out, even if you're not usually into horror (like moi!), because it's super quick and interesting."}, {"userName": "Bentley ★ Bookbastion.net", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/7971097-bentley-bookbastion-net", "userReview": "Well, I'm split about this one. I love the futuristic, science fiction element of the premise: A virtual reality technology, developed to heal psychological wounds of the user in their dreams being turned against its inhabitants by a threat in the real world.It sounds really great on the surface because there's so many avenues a dream/nightmare can go. By their nature dreams are mysterious, shifty things that can change in an instant; the gentlest of dreams warped into vicious and frightening nightmare. It's a really cool idea Mira Grant is working with here, but I think I was a little let down the villains. This felt a bit like paint-by-numbers horror to me. You know those red-shirt characters that get killed off in horror movies before you ever get to know them, and thus care about them? This story is full of those. In horror, I want to care about those characters getting killed off. That's what makes it horrific after all. Esther and Dr. Webb are the two characters this tale revolves around and while they are well developed with interesting backstories, the remaining characters feel like little more than chess pieces waiting to be knocked down by the threat across the board. There are two threats here: the ones in the nightmare and the one in the real world, but because the threat is split neither one of them felt dangerous enough to me. Also I still can't figure out exactly why the real world threat was even interested in harming the people in the dream-pods in the first place. I think it's especially important to give human monsters a compelling reason for the evils they do, otherwise they become forgettable villains that feel underdeveloped.Finally, there's a shifting narrative here between the real world and the dream. The real world is written in the past tense, the dream in the present tense. I understand what Grant was going for, but given that the tenses would shift from paragraph to paragraph I often felt jarred between the two. It's a quick read and definitely entertained me though, so if you're a fan of Grant's other horror work, definitely check this one out. A Special thanks Netgalley and Subterranean Press for an ARC in exchange for an honest review."}, {"userName": "brittany", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/16023722-brittany", "userReview": "[Because of how the intruder messed with the scenario, Esther and Jennifer's minds are left broken. They go into the pods as adult women, but because they lived the scenario as teenage versions of themselves, when they return to their reality they still \"feel\" sixteen. Jennifer is functional, but Esther has completely lost herself. Her personality, her career, everything she used to be - gone. This didn't work for me because Esther is set up in the beginning as the protagonist, the one with the agency and the mission, the one who questions the ethics and safety of this virtual reality therapy. The one who's skeptical about the idea of changing people's personalities by implanting fake memories in their minds. But when she gets into the pod, she regresses into this demure, meek version of herself. She fights some zombies and saves her BFF, but she comes out of the ordeal a shadow of who she used to be and basically becomes a recluse. This was frustrating because I was counting on her to be the character who challenged everything that was wrong with the VRT. Instead, she becomes a victim to it, leaving nobody else to counter Jennifer's mad-scientist ambitions. It felt like a cop-out. Like Grant had unwittingly created a character who was TOO smart, too fierce, and then she didn't know how to make her fit into the story she wanted to write. So she threw her away rather than letting her fight the REAL monsters, the monsters Esther WANTED to fight - not zombies, but risky & borderline unethical science; the idea that rewriting your personality is better than learning to live with your flaws and burdens; the impulse to lie your problems away rather than face them. I don't know if I'm explaining myself right. But it ties back to my earlier point about being led by the narrative to expect a different sort of story than what I got. I expected Esther's mistrust and struggle with the ethics of the VRT to be central to the story. I expected her to butt heads with Jennifer on this point all the way through the main events of the plot. I thought she'd maybe become aware within the VRT scenario when it started going wrong. That she would be more her adult self while in the scenario, but would be trapped, and would need to work with a Jennifer she's super pissed off at to try and survive & get out. But that didn't happen. Instead, you introduce this driven character who asks hard questions and won't take anyone's PR nonsense. Then you strip away those qualities and make her into a meek teenage version of herself. And then you throw her whole character away in the name of a tragic ending that didn't really need to be there. (hide spoiler)]"}, {"userName": "Anelis", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/5134195-anelis", "userReview": "Final Girls is like the movie \"The Cell\" only without a serial killer, and with horror-movie inspired lucid dreams with zombies. It's very short, action-packed, with awesome female characters kicking butts. Loved the camp. A must for horror fans of any kind."}, {"userName": "Michael Hicks", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/6409681-michael-hicks", "userReview": "The horror genre can be a brilliant form of catharsis, both as a reader and a writer, and a basic way to engage our emotional centers. Horror scares us and it excites us, often while reflecting on societal fears, and can sometimes even make couples feel closer together (look up Dolf Zilmann's Snuggle Theory). But can it cure us? Can horror repair long-standing psychological issues, or fix broken inter-personal relationships? This latter scenario is the focus behind Mira Grant's latest novella, Final Girls.Dr. Jennifer Webb has developed a next-gen system of therapy, using a potent combination of virtual reality, psychotropics, horror scenarios, and lucid dreaming. Her patient, Esther, a reporter sent to debunk Webb's work, is traumatized by a childhood scandal that ended with her innocent father murdered in prison. In order to present a well-rounded report on Webb's work for the pop-sci mag she works for, Esther will have to undergo a scary bit of therapy.Mira Grant (pseudonym for Seanan McGuire) approaches horror much like Webb, delivering cutting-edge concepts coupled with scares (her Newsfeed series was a terrific and multi-layered combination of politics, science, and zombies). Final Girls is certainly a more cerebral dash of horror than an emotional one, and it's certainly a fun and easy enough read, but one that carries with it a sort of double-edged sword.This is a fun novella, and I enjoyed the few hours spent reading it. However, it's brevity doesn't do the characters any real favors. I liked the whipsmart concept at play here, but I never felt truly engaged on an emotional level. There weren't any true surprises for me to gush over, although the overall, long-lasting impact of Webb's treatment on its patients is certainly worth savoring. While there's a rich vein of darkness running throughout, there's nothing particularly potent or memorable action-wise, and the characters are pretty thin. There just wasn't enough for me to latch on to in the personalities of either Esther or Webb, or the malevolent third parties seeking to undo the both of them.Bottom line: this is a coolly executed bit of fun, but certainly one of Grant's more minor, shallower works.[Note: I received an advanced copy of this title from the publisher via NetGalley.]"}, {"userName": "Basia", "userReviewDate": "Apr 24, 2017", "userURL": "http://www.goodreads.com/user/show/41865563-basia", "userReview": "So this story started out SO good. It's my only Grant read to date. But I don't like that it shapeshifted into a story with zombies. I'd have loved it without that aspect. It seemed very incongruent to me. Still, I love the ideas herein, their execution, the flawless attention to detail, the tech--all of that!! And it was CREEPY!! But awesome resolution. So overall? A 3.5/5, but rounded UP, as the 1st 60% or so really did scare the crap out of me. And I can't resist a good horror tale. 😊Happy reading, everyone!"}, {"userName": "Noel", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/12581658-noel", "userReview": "I would say this novella is mildly interesting. It never really grabbed me, but it was never really dull either. I found the whole \"virtual reality as a therapeutic device\" concept intriguing, but it wasn't enough to build a story around. If the twists had been more surprising, it would have had more impact, but nothing that happened shocked me. Don't go out of your way to read this one, but if it looks interesting to you, it might be something you'd enjoy. Thanks to Netgalley and Subterranean Press for the chance to read this."}, {"userName": "Catherine", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/39504220-catherine", "userReview": "Pretty good horror novella. Interesting sci-fi concept. The writing was a bit clunky though, which keeps it at 3 stars for me. There was a lot of repetition in the action scenes that just made them a bit annoying to read."}, {"userName": "Taylor", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/67650443-taylor", "userReview": "I’m 95% sure this is a Black Mirror episode"}, {"userName": "Rebecca", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/2324650-rebecca", "userReview": "I really enjoyed this book. I recently read Rolling in the Deep by Mira Grant and my problem with it was that it seemed very rushed and lacked a lot of detail because it was so short. With Final Girls however, I found it to be the perfect length and nothing felt too rushed. The story itself was really interesting and I thought it was a really cool concept. It had a little bit of a horror element which I quite enjoyed. I'm definitely keen to read more by Mira Grant in the future."}, {"userName": "Lestat", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/37173442-lestat", "userReview": "So... I may have accidentally ordered the wrong book on Netgalley. Two books, same name, easy to get confused, I guess.This book was a disaster. It was terrible. The only good thing about it is that it was relatively short (too short, frankly, to be considered a novel), but the rest of it was an eye-sore. The worst, poorest writing I have come across. No sense of pacing, non-existent charaterisation; full of expository dialogue. This kind of book is the reason why sci-fi and other genre books get such a bad name. Everything wrong in the world of writing is in here - heck, it even has giant chunks of text within parentheses! *head-desk*The main protagonists are all women - there's a total of three of them and they're pretty cliched in themselves. The perfect, skinny protagonist Esther, with a haunted past and awkward social standing; the bossy, stocky Dr. Webb with a vivacious personality and genius intellect; and the shadowy assassin, Marline, who undertakes an attack on the facility Webb has built, and does serious damage to both Esther and Webb. I think Marline is supposed to be hot. I honestly don't remember.This was an incredible waste of time. I'm not sure what the publisher was thinking when they give this train-wreck the green light. It's substandard even by a child's standard. There's only telling, no showing. It would make any sane person want to gouge their eyes out. The pacing so atrocious - the book opens with a chase scene so bland it does nothing to coax you into reading the rest. The author is also far removed from reality. At one point, the super successful, genius scientist at the centre of things surmises that the people working for her are all 'true believers' (because isn't that the only way to do a job?) but either only in it for the fame and glory that is impending - one that only she will bask in - or they simply don't care. I take it the author has never had to get herself a regular job, working for people too up their own selves to care about the minions trampled beneath, because if she had, she wouldn't have painted the good doctor's staff as black and white as she does.I feel like the author gave up on internal logic and facts to get to the final twist. The twist is interesting but doesn't flow with all that went before. The bad guy, Marline, was greatly hyped and became an integral character in the scenario, but in the end her arc and storyline were not developed or concluded. I couldn't quite figure out how Esther became the main target of the 'attack' by Marline and her invisible bosses, because all signs and logic pointed to mad scientist Webb - it's just that Esther ends up suffering long term consequences from the attack. Webb and Esther were both trapped in their minds, so how did Esther break free? How did she even know to break free? She didn't know that Webb was in danger in reality, so where did the impetus to get out and save her come from? And who cares!Given the brevity of this book, I wonder if this is supposed to be part of series, in which case as a first book it simply doesn't flesh the world out enough for the reader to want to come back.The especially terrible writing and too many expository asides made for bland and halting scenes. I love that all the characters are women, but it doesn't help the fact that the text itself was too poor to enjoy. Don't bother with this book - it's not worth a read. Harsh, but true."}, {"userName": "Kristen", "userReviewDate": "Apr 08, 2017", "userURL": "http://www.goodreads.com/user/show/5816242-kristen", "userReview": "[corporate spy/assassin (hide spoiler)]"}, {"userName": "Sunil", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/7364359-sunil", "userReview": "In Final Girls, Mira Grant envisions a new kind of therapy: the horror movie. Dr. Jennifer Webb has developed a virtual reality environment where patients can safely live out horrific scenarios that are designed to address their trauma or other issues. The concept is clever and makes more sense than you might think at first. But reporter Esther Hoffman thinks it's bullshit, and she's come to learn all she can about it.Of course, no one can be...told what the Matrix is...After a suitable amount of exposition, Grant sends our heroine into a virtual world, but there are dangers in the real world too! I love the way Grant uses tenses, shifting between past for the real world and present for the more dreamlike virtual world. The narrative voice also changes so that when you're reading, you feel the contrast between the two realities.The meat of Final Girls lies in the relationship between Esther and Jennifer, and because it takes some time for Dr. Webb's scenario to introduce any supernatural elements, the middle sags a bit, and the tonal shifts between virtual and real world add tension but also make the virtual world seem less exciting. Eventually, however, things get cooking in both worlds, and the blood spills freely (this is Mira Grant, after all). The villain is nebulous and the resolution is a bit abrupt, but the ending is the sort that lingers. Final Girls is like a novella version of a Black Mirror episode."}, {"userName": "Tintaglia", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/6558964-tintaglia", "userReview": "E se la nuova frontiera della psicoterapia fosse l'horror?Se immergersi, con l'aiuto di un mix di farmaci e sotto rigoroso monitoraggio medico, in uno scenario accuratamente costruito utilizzando tutti i topoi del genere risanasse traumi, cancellasse fobie, ricucisse conflitti, cambiando attraverso l'esperienza (simulata, ma non per il corpo - e il corpo influenza la mente) quello che siamo, ma in modo sottile, senza modificare la nostra personalità?E se nel mezzo di una sessione l'orrore si scatenasse davvero nella clinica, e il sogno indotto diventasse davvero una corsa contro la morte per puro, semplice spavento?Una novella che è un brillante mix di fantascienza e horror, e che con uno stile coinvolgente e brillante, personaggi credibili e un utilizzo geniale dei topoi del genere costruisce una storia che toglie il fiato, chiusa da un finale sorprendente."}, {"userName": "Space Out With Sci Fi in June The Haunted Reading Room", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/7302570-space-out-with-sci-fi-in-june-the-haunted-reading-room", "userReview": ",Review: FINAL GIRLS by Mira GrantFINAL GIRLS is an absolutely amazing novella, extraordinarily conceived and tautly and intricately plotted. A tapestry of near future science, virtual reality, psychology, mind control, aversion therapy, friendship, intellectual genius, Victor Frankenstein, bullying, crowd behavior, supernatural experiences, industrial espionage, and so much more. The ending left me speechless. The first Mira Grant title I ever read was INTO THE DARKEST DEEP, just days ago, and (pun intentional) blew me out of the water. FINAL GIRLS rocketed me out of reality. Mira Grant is a genius."}, {"userName": "Odo", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/2354981-odo", "userReview": "3.5/5.0"}, {"userName": "Marjolein", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/5289598-marjolein", "userReview": "Full review to come!"}, {"userName": "Bonnie", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "3.5 of 5 stars\n‘Reality was a hard habit to quit sometimes, especially for someone who knew what lies could cost.’\nEsther Hoffman is a journalist seeking the underlying story of Dr. Jennifer Webb who has created a new virtual reality therapy program which uses horror movie style dream sequences in an attempt to change the long-term behavior of its patient. Esther is convinced that Dr. Webb is nothing but a con artist and during their interview, Webb suggests she personally experience the program and Esther agrees, hoping to get the inside scoop. While inside the sequence, Webb decides to join Esther in the zombie apocalypse simulation in an attempt to develop a relationship with her and possibly change her outlook towards her program. The problem is, while the two are locked inside a fabricated horror movie, there’s actual horror developing in the real world.\n‘Everything they were before they came here is behind them now, and soon they will be free, soon they will be able to start to heal, soon—’\nGrant is no doubt a skillful short story writer, able to develop characters and plot effectively, drawing in readers with her consistently original narratives. Final Girls is a fantastic blend of science fiction and horror with a Nightmare on Elm Street feel to it where dreams quickly become a reality. This novella manages to even touch on more serious topics regarding doctors and treatment and the dangers of such an effective program like this falling into the wrong hands. The creative blend of science fiction and horror in the beginning did, admittedly, morph into something less unique by the end, transitioning instead to a storyline more commonly seen, but Final Girls is still a worthy read if you’re looking for some thrilling psychological horror.I received this book free from Netgalley in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}, {"userName": "Steph", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/5428996-steph", "userReview": "This is my first Mira Grant novel, so I was blown away by how beautiful and brutal the language is. The story itself is those things, too.It's also a huge, exciting trip, condensed to just over 100 pages. A slow, expository introduction establishes the situation - a journalist with a strong bias against false memories is investigating the use of intense virtual reality simulations for therapy - but after this slow beginning, the story takes off and never slows. Much of it takes place within a thrilling and particularly dangerous simulation, while things go wildly out of control in the real world.There are some things I didn't like. The oddest is that there are a few moments of no-homo clarification on the close relationship between two female characters, which feels unnecessary. I get that they wanted to emphasize the power of their platonic friendship, but I think they could have done that while keeping their bond ambiguous. The book is also a bit too gory for me; I prefer implied blood and gore to actual descriptions of violence.And the book feels too short, too. I would have enjoyed spending more time with these characters. But I suppose its brevity works in its favor, speeding up the pace and condensing an extremely exciting and emotional story into so few words. I really liked the use of the simulation as a narrative device; the characters are placed into a virtual preadolescence and adolescence, which really fleshes them out, and also provides greater YA appeal in a story that is really about adults. In the simulation of high school, the typical angst of bullying is given a horror twist, which I thought was brilliantly done. And the ending is wonderfully emotionally charged; definitely a great read.Thank you to Netgalley and Subterranean Press for providing me with a copy of this book in return for an honest review."}, {"userName": "Matthew Galloway", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/1872314-matthew-galloway", "userReview": "Very interesting concept, though I found the choice of writing style a bit strange. It made everything feel so removed -- as if someone were describing watching a movie in detail, which I guess is kind of exactly what this was... But anyway, to feel the horror I need things to feel immediate and close. Maybe I was just coming at this story from the wrong perspective."}], "description": "What if you could fix the worst parts of yourself by confronting your worst fears? Dr. Jennifer Webb has invented proprietary virtual reality technology that purports to heal psychological wounds by running clients through scenarios straight out of horror movies and nightmares. In a carefully controlled environment, with a medical cocktail running through their veins, sisters might develop a bond they’ve been missing their whole lives—while running from the bogeyman through a simulated forest. But…can real change come so easily? Esther Hoffman doubts it. Esther has spent her entire journalism career debunking pseudoscience, after phony regression therapy ruined her father’s life. She’s determined to unearth the truth about Dr. Webb’s budding company. Dr. Webb’s willing to let her, of course, for reasons of her own. What better advertisement could she get than that of a convinced skeptic? But Esther’s not the only one curious about how this technology works. Enter real-world threats just as frightening as those created in the lab. Dr. Webb and Esther are at odds, but they may also be each other’s only hope of survival. With her new novella Final Girls, bestselling, award-winning author Mira Grant has conjured a heart-stopping, gut-wrenching story filled with as many twists as it is versions of reality. Grant offers a chilling exploration of how surviving horrors might define us all.", "title": "Final Girls", "url": "http://www.goodreads.com/book/show/34231796-final-girls", "average": 3.76, "cover": "https://images.gr-assets.com/books/1486876882l/34231796.jpg", "reviews": 200, "authors": [{"url": "https://www.goodreads.com/author/show/3153776.Mira_Grant", "name": "Mira Grant"}], "type": ["Horror", "Science Fiction", "Novella", "Short Stories", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/34231796-final-girls", "http://www.goodreads.com/book/show/32994321-final-girls", "http://www.goodreads.com/book/show/7094569-feed", "http://www.goodreads.com/book/show/8429687-deadline", "http://www.goodreads.com/book/show/11806716-blackout", "http://www.goodreads.com/book/show/13641105-parasite", "http://www.goodreads.com/book/show/11509894-countdown"]}