{"ratings": 808, "userreviews": [{"userName": "Victoria Coe", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/17780685-victoria-coe", "userReview": "I received an Advance Reader Copy of this book in exchange for an honest review.I was hooked on FINDING PERFECT from the opening scene. What a fresh character and what a fresh middle grade voice!On the outside, Molly is struggling to deal with a long-distance mom, a vulnerable younger brother, and a best friend in danger of moving away. But on the inside, she's struggling with something much more difficult. And scary.Because if she can't keep every single little thing in order, her whole world will devolve into chaos. And she'd better keep that struggle to herself or everyone will think she's weird. Or crazy.FINDING PERFECT is not only an engaging middle grade read, but also an important book that spotlights OCD and its painful effects. Highly recommend."}, {"userName": "Abby Cooper", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/39997246-abby-cooper", "userReview": "Ahh, this book! My heart! So many feelings!Main character Molly will tug at your heartstrings right off the bat. She's incredibly sweet and well-intentioned and I spent most of the book wanting to give her the biggest hug on the planet. I think so many people - kids and adults - will be able to relate to Molly and her struggles. Throughout the book, she feels 'crazy' for various reasons but isn't able to open up to close friends/family members because she's scared of what they'll think. Though not everyone can relate to having OCD, I think many people will be able to relate to that feeling, to that stress and fear of sharing something deeply personal for the first time, even if you're sharing with someone who will love you no matter what. Five enthusiastic stars for this wonderful, wonderful book!"}, {"userName": "Melanie", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/6483009-melanie", "userReview": "In FINDING PERFECT, twelve-year-old Molly is the kind of girl that I could be. She likes things neat. Neater than neat--PERFECT. This tendency is increasingly taking over Molly's life, causing her to struggle in friendships and with communication. She doesn't want these behaviors, but she doesn't know how to stop them.It's a harrowing situation, with Molly's family in flux due to her mother's long distance job and her father's struggle to manage their home. My heart went out to Molly. I wanted more for her, and I cheered when she began to open up to those around her. An important and touching read for kids and grownups alike!(I received an ARC in exchange for an honest review.)"}, {"userName": "Michele Knott", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/5915836-michele-knott", "userReview": "Reread 12.06.16It's been almost 8 months since I first read this book. In that time I've been lucky to have conversations with Elly Swartz. And knowing her and knowing the layers in this book and knowing what this book can do for a reader... I fell in love with it all over again and even harder. Make sure this book is in your possession and share widely. My heart was broken into pieces and slowly put back together.Elly Swartz has done her research and then perfectly captured the desperation of when an illness takes hold of your mind.You have, you will have, you have had students like this.Be looking for this book in October because it's one you will want.And if I were running a Mock Schneider, I'd have this one on my list. For sure."}, {"userName": "Rachel Harder", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/33008114-rachel-harder", "userReview": "This book! I will be sharing this with my students and friends as they all need to meet Molly! Elly Swartz has a way of creating real-life characters and a story that will tug at your heart. I highly recommend this book to anybody who enjoys MG lit. This will make an awesome book to discuss mental health with students. Thank you, Elly, for opening yet another door to discussing mental health. ❤️"}, {"userName": "Tarun Shanker", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/4323494-tarun-shanker", "userReview": "To me, one of the most important parts of growing up (and one of the most important themes of coming-of-age stories) is the acceptance that not everything can be perfect. That there isn’t always a “right answer.” That sometimes you’ll work towards that ideal solution that fixes all the problems, while knowing that it doesn’t really exist, and it’s all just a matter of perspective. In Finding Perfect, 12-year old Molly Nathans might seem like she’s perfect to her friends and classmates. She certainly strives for it in her grades, organization and appearance. But she’s also struggling with other problems that are out of her control: the prospect of her best friend moving away, her parents’ separation, her mother’s new out-of-the-country job, and her own brain’s increasingly frustrating tendencies that might be obsessive compulsive disorder.By linking that “illusion of perfection” theme with Molly’s OCD, author Elly Swartz manages the brilliant feat of finding the universal in the specific. Readers who haven’t experienced the feelings of uncertainty from separated or absent parents or the exhausting tension of daily life with OCD will certainly feel it here. From the very start, Molly is a vivid and incredibly relatable main character because we’re eased into her head with logical thought patterns and we’re shown the comfort that comes from planning, organization and stability. As we follow her journey and her problems grow, we feel every subtle change in her voice. The anxious places her mind goes during conversations with her friends. Her frequent tangents to wash her hands again and again. The impulse to count that slips into her thoughts (and narration), making us read faster with a rising panic in our gut as she tries to keep her problems a secret. Finding Perfect is both intense and intensely satisfying because of its authenticity. The details–in everything from Molly’s hyper-focused thoughts to her compelling relationships with her siblings, parents and friends–will suck you in. And the refusal to trivialize or magically solve these issues will have you avidly reading to that touching and well-earned ending and keep you thinking about it long after."}, {"userName": "Nicole Otting", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/5725499-nicole-otting", "userReview": "Elly Swartz has done a beautiful job with her debut novel. I'm so honored to have gotten to read it. All of the characters have their own unique story to tell and the way Molly grows over the course of the book is done so beautifully. This is by far a must read!"}, {"userName": "Scott Fillner", "userReviewDate": "Mar 11, 2016", "userURL": "http://www.goodreads.com/user/show/52395337-scott-fillner", "userReview": "Debut from Elly Swartz comes out in October. I believe we have an author we will be wanting more from. I love her character development and how she makes us feel raw emotion. Cannot wait for it to hit the shelves."}, {"userName": "Colby Sharp", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/5186758-colby-sharp", "userReview": "Wow. This book was amazing."}, {"userName": "Jenn Bishop", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/43980984-jenn-bishop", "userReview": "Twelve-year-old Molly Nathans is good at appearing perfect. Perfect grades, perfectly attired, top place in slam poetry competitions. And let's not forget her perfectly tidy room, with her glass animal figurine collection, each animal evenly spaced from the next. But beneath that perfect lies a secret: ever since Mom left (ostensibly for a job in Toronto, but it felt like leaving, period), Molly's been overcome by fear. She worries nonstop about terrible things happening to her little brother Ian. The only thing that helps is counting by fours and keeping everything in perfect order. But how long can she keep everything in perfect order, really?In this heartfelt debut novel, Swartz explores Molly's growing understanding of her own problems -- and the coping mechanism that doesn't keep them in line -- as all of it spins out of control. Molly isn't alone in any of this -- she's surrounded by well-intentioned friends and has a caring older sister -- but there's an isolation that comes from thinking you're crazy, one which Swartz deftly communicates. My heart broke for Molly, who tries so hard to be strong, but who cannot single-handedly solve this problem. OCD is a very misunderstood disorder, one that many refer to jokingly -- \"I'm a little OCD\", etc. -- in a way that minimizes its real harm, but one that thankfully can be treated.I loved getting to follow Molly's journey toward an understanding that \"perfect\" doesn't really exist; it's a myth. I think this story will speak to a lot of tween readers, especially in communities where this elusive \"perfect\" feels like the end goal."}, {"userName": "Mrs. Montjoy's Class", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/56010531-mrs-montjoy-s-class", "userReview": "Finding Perfect catches the perfect moment at the perfect time and makes it so real to the readers. In this book the main character, Molly has OCD and struggles with keeping the secret that she can't stop counting and organizing. Molly's friendship with Hannah is slowly falling apart as Hannah starts to figure out Molly's secret! This book really shows that just because you are a little different doesn't mean you have to hide it! I can't wait for your next book to come out!!! Charity"}, {"userName": "Jimmy", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/45390654-jimmy", "userReview": "So immersed in Molly's journey. Huge potential for important convo's w/Ss about OCD. Elly Swartz's writing enabled you as a reader to get a taste of what many experience with OCD. Molly's journey to the mythical \"perfection\" will help readers realize there is no such thing. Exceptional story!"}, {"userName": "Sarah Levy", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/43491811-sarah-levy", "userReview": "What's perfect mean to you? Elly Swartz's use of vivid words & figurative language makes this story come alive. I felt like I was experiencing many of the things the main character, Molly, was experiencing. This story is a journey with many ups and downs, and lots of feels."}, {"userName": "Lee Malone", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/85609-lee-malone", "userReview": "This is a fantastic middle grade book that deals with a difficult situation in a heart-warming and realistic way. I especially loved Molly's relationships with her siblings and her friends, they felt very true-to-life."}, {"userName": "Christina Hanson", "userReviewDate": "Apr 24, 2016", "userURL": "http://www.goodreads.com/user/show/45494441-christina-hanson", "userReview": "Lists. Counting. Organizing. In Elly Schwartz's debut novel, Finding Perfect, twelve-year-old Molly has to have things just so for things to work out. Her animal figurines have to be exactly one-inch apart; things have to be in multiples of four; and her colored pencils and socks have to be organized by color. Molly is also great at writing poetry, and participates in her school's poetry slam contest. Winning this contest is all part of her plan to bring her mother home who left for a job in Canada. As Molly advances to the next rounds of the contest, not only does writing the poems become harder, but new routines like repeatedly washing her hands and counting by 4s in her head start to take over her daily life. Can Molly keep these habits a secret from her family and friends? This was an amazing novel about the daily struggles of having OCD, the power of friendship, and the need to find that perfect balance. A definite must-read when this is released in October!"}, {"userName": "Stacey", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/42106822-stacey", "userReview": "The characters and lessons learned from Finding Perfect will surely stick with you long after this story is over. You will be rooting for and feeling all the feels for Molly the whole way through. Her growth as a character is monumental and relatable for so many of our kids as they are seeking perfect. For fans who loved Wonder, Rules and Counting by 7's."}, {"userName": "Patrick", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/5843194-patrick", "userReview": "Wow! This is a pretty special and incredible story. Kept me up very late last night. Look for it in October!"}, {"userName": "Jana", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/4051653-jana", "userReview": "I had the opportunity to read a digital ARC of this book from NetGalley in exchange for a review. I've heard so many wonderful things about Finding Perfect that I was really excited to read it. I was drawn into the story almost immediately. The main character, Molly, is a girl that we've all known in our lives. She's the kind of girl who seems to have it all together: good grades, good friends, good looks. At first, the neatness and insistence on organization and cleanliness seem kind of quirky, but not beyond what you would expect. As the story develops, you see the situation slide from somewhat eccentric to troubling and unhealthy. The plot really pulls the reader into Molly's downward spiral so that one can begin to understand what an anxiety condition like OCD (Obsessive Compulsive Disorder) feels like.I love that readers can learn so much from a book that is also very engaging and well written. You often hear people talk about OCD, and I had a vague notion about repetitive actions, like hand washing. But this book shows that this condition affects people from all walks of life and in all sorts of ways. I think it's great that this book is available to kids who might be experiencing some of the same worries as Molly, or know someone who does. And even if this condition hasn't affected you personally, this book will certainly help build empathy for people who need help. This is an awesome book, especially for kids in middle and high school."}, {"userName": "Dana", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/22720974-dana", "userReview": "My book club (#bookquest) received an ARC from the author to share. From the second page of this story, I was hooked. Molly's mother leaves for a job in Toronto, promising to return in one year. As Molly's family copes with this change, Molly feels more and more responsible for her little brother's well-being. With the added stress and fear that Mom is not coming back, Molly's develops an increasing number of OCD tendencies.What I found most powerful about this story was the internal conflict Molly had. Her tendencies and her fears kept isolating her from the rest of the world, but she also felt that the \"old Molly\" was slipping away. The author crafted this feeling in such a realistic and heartbreaking way, it was easy to put myself in Molly's place. However, this story isn't only about Molly. Each character, friends and family, has a different way of coping with losses or struggles. It brings to light the different ways people react to adverse situations.As a third grade teacher, I feel like it may be difficult for some to understand, but it would certainly open the door to conversations about OCD, coping, and empathy. The teacher's guide has excellent suggestions and ideas for classroom discussions. This would be a great book for upper grades."}, {"userName": "Margie", "userReviewDate": "Dec 15, 2016", "userURL": "http://www.goodreads.com/user/show/5281649-margie", "userReview": "When you look at the definition of perfect the one thing constant in all the synonyms is there is no room for error. To be perfect is to be flawless, the ideal, exemplary, the best and the ultimate. To be fair, depending on the individual, the interpretation of each of these may be measured differently based on that person's perceptions. What is perfect for one may not be perfect for another.Perfection in one particular area can be a life goal. Perfection can be a certain moment. For some perfection is a way at looking at everything on any given day, every single day. Finding Perfect (Farrar Straus Giroux, October 18, 2016), debut novel written by Elly Swartz, follows twelve-year-old Molly as her beliefs in what makes perfection and the results of striving for perfection shift dramatically.My full recommendation: http://librariansquest.blogspot.com/2..."}, {"userName": "Jill Diamond", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/53080969-jill-diamond", "userReview": "FINDING PERFECT is such a heartfelt and touching book! Debut author, Elly Swartz, does an amazing job creating characters who feel real and relatable. Readers will cry along with Molly as she struggles with family issues, tween issues, and OCD, and cheer Molly on in her triumphs. The book tackles tough issues without feeling didactic or heavy handed and the character driven story will definitely appeal to middle grade readers. A must read!"}, {"userName": "Rachel Yoder", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/34802940-rachel-yoder", "userReview": "So so good. Molly is a character so many will relate to, even if the diagnosis of OCD is not familiar. We all have parts of ourselves we feel like we can't share. Makes me think about the students I see every day and what they may be hiding. \"Hiding is tiring.\" I am confident this book will find a home with someone who will be encouraged to not hide anymore."}, {"userName": "Erin Downing", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/2285570-erin-downing", "userReview": "So powerful. Loved this one."}, {"userName": "Ann", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/10791805-ann", "userReview": "Beautiful and heartbreaking and funny and amazing. I adore this story, not only for its writing, but for the importance of its message. Read it."}, {"userName": "Lesley Burnap", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/8770643-lesley-burnap", "userReview": "Amazing story of young woman struggling w/ OCD. Your heart will break as you follow along on Molly's journey. Great story for getting inside the mind of a character!"}, {"userName": "Mary Thomas", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/34844444-mary-thomas", "userReview": "Fantastic and important- not to be left out in conversations about diverse books, it's so important for our students battling mental health issues to see themselves in literature. Thank you, Elly!"}, {"userName": "Aevery", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/70643829-aevery", "userReview": "Finding Perfect is a book that has a place in my heart. Molly's struggle to understand what is going on in her head and why she is so different from others. Molly's thoughts about her OCD and fear of her Mother not coming back from her work trip. Those feelings I can understand, I can feel her fear and abandonment. I can feel her curiosity and worry of why she thinks and behaves differently. I have gone through such phases with my parents fighting and ever knowing if one might come back. The curiosity why you're so different. I struggle with my anxiety and before I knew how to explain how I felt that's all I ever thought about. Elly Swartz really brings out the tough situations in life and show that through the hard times and break downs there will be a resolution. Regardless of the resolution there will be one. Molly got the help she needed and found the words she couldn't encounter on her own. I adored this book and it isn't so important to me because I can relate it's because of the message that was put throughout the book. The message of courage to not give up and regardless of the position you're put in there is a way out of it."}, {"userName": "Nancy", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/7965672-nancy", "userReview": "Realistic Middle Grade social issues story: my favorite kind! The thing that impressed me the most was how deftly the author increased the tension/stress/anxiety of the mc as the story of the onset and worsening of her OCD unfolded. This would be an extremely helpful read for anyone who is struggling to understand the behavior of OCD, and how 'out of control' one can feel...wrapped up with the hopeful message of what may lie on the other side of treatment."}, {"userName": "Linda ", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/5574951-linda", "userReview": "Twelve-year-old Molly Nathans seems to have a lot of good things in her life: friends and a nice family, and she's one of the slam poets that others believe might win the school championship. She's talented! Yet as we begin reading her story, there are a few hints that \"hidden\" Molly is not telling. She lines up a glass animal collection in her room with a ruler, ensures it \"feels\" right before she can leave. She almost purchases another animal, but realizes that would make 45 of them, a \"terrible\" odd number. She washes her hands four times and lines up her colored pencils per the Roy.G.Biv rainbow line-up. Her best friend Hannah and little brother Ian notice a few things, but Molly tries hard to keep all these needs to herself.  Molly's mother has recently left for a new job in Toronto, says it's only for a year. Things do not seem right, however, and Molly is certain if she manages to do the poetry slam perfectly, she can entice her mother back to the celebration banquet. Then all will be all right, really perfect. The progression of this illness through Molly's thoughts is shown to be frightening. To be perfect, certain criteria had to be met, then Molly could move on to the next task. But things, even best friends, get in the way, her mother doesn't always call, and her father is working hard to meet his own deadlines. I love that Elly Swartz showed how out of control OCD can become, and that there are professionals that help along with support groups for all ages. I also loved that it was shown that all the characters indeed were not perfect, had their own quirks, which made us readers sympathize. The challenges Molly had were that her illness worsened, and she was terrified that if she did not do some of the things, her little brother Ian would die of some illness. I hope that the story helps and supports some who are trying to understand what's happening to them, or to someone they love. Thanks to Net Galley for the ARC."}, {"userName": "Brittany", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/10854693-brittany", "userReview": "I found this novel to be incredibly moving. I found myself getting emotional on many occasions. Swartz does an incredible job of creating a protagonist that carries a magnificent impact.Molly's struggles will have you turning the pages with a heavy heart, rooting her on and wanting to leap through the pages and hug her and take away her pain. The themes of friendship, honesty, family trauma, mental illness, loyalty, art as therapy....make this a profound middle grades read. Fabulous."}], "description": "To Molly Nathans, perfect is:•\tThe number four•\tThe tip of a newly sharpened number two pencil•\tA crisp, white pad of paper •\tHer neatly aligned glass animal figurinesWhat’s not perfect is Molly’s mother leaving the family to take a faraway job with the promise to return in one year. Molly knows that promises are often broken, so she hatches a plan to bring her mother home: Win the Lakeville Middle School Slam Poetry Contest. The winner is honored at a fancy banquet with table cloths. Molly’s sure her mother would never miss that. Right…? But as time goes on, writing and reciting slam poetry become harder. Actually, everything becomes harder as new habits appear, and counting, cleaning, and organizing are not enough to keep Molly’s world from spinning out of control.", "title": "Finding Perfect", "url": "http://www.goodreads.com/book/show/27414408-finding-perfect", "average": 4.37, "cover": "https://images.gr-assets.com/books/1453393363l/27414408.jpg", "reviews": 217, "authors": [{"url": "https://www.goodreads.com/author/show/14590266.Elly_Swartz", "name": "Elly Swartz"}], "type": ["Childrens", "Realistic Fiction", "Family", "Health", "Mental Health"], "outlinks": ["http://www.goodreads.com/book/show/27414408-finding-perfect", "http://www.goodreads.com/book/show/34214668-smart-cookie", "http://www.goodreads.com/book/show/35209529-give-and-take"]}