{"ratings": 6712, "userreviews": [{"userName": "Cathrine ☯️ ", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "5★I have not written reviews of books I read prior to joining GR. In this case I wish to make an exception, although it's more of a homage.My husband and I read this one out loud together over morning coffee. It is still one of the best human-reinventing-his-life-with-his-dog books I have ever read. I continued to follow Tom and Atticus' adventures through their blog and Facebook page. Anyone who loves dogs (especially miniature schnauzers), hiking, or heartwarming, life affirming adventures would love this story. Not long ago just prior to setting out on another trip, Atticus, the dog, fell seriously ill with a stroke. While seeing to his care, Tom, the human, was unexpectedly hospitalized with a heart attack and complete loss of kidney function. Recently his kidneys, again unexpectedly, returned to full function and he was released and reunited with his beloved companion. A few days ago a picture of the two of them taking a gentle walk in the woods was posted.Today it was announced that Tom held Atticus for the last time this evening as his vet put an end to the suffering. Apparently he had a brain tumor. The doctor said it was clear he waited for Tom to return home so they could share one more week together and say goodbye.If I live long enough, I will have to go through this scenario myself at least three more times. Like Atticus, my dogs have had the best life possible. The problem is, it's just not long enough. Thank you Tom for sharing your love and adventures with us. I wish you physical and emotional healing.“If there are no dogs in Heaven, then when I die I want to go where they went.” Will Rogers"}, {"userName": "☮Karen", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "How can one help but love this 20 pound furbaby? This powerhouse known as Atticus M. Finch (love that), Little Buddha, or Little Giant in and around his home town of Newburyport, MA, led his best friend Tom Ryan hiking the White Mountains of New Hampshire, making history one winter summiting over 48 peaks in honor of a friend who had died of cancer. As Atticus and Tom reached each peak, they would pause at the summit and bond while gazing out at the beauty of the landscape. They grew famous and beloved through news of their treks, by the amazement at a small dog's ability to accomplish such feats and overcome adversities. Through the power of their friendship, light prevailed over darkness when tragedy struck.I first learned of this dynamic duo watching an Animal Planet special several years back. Then I read a heartbreaking review of the book following Atticus' passing last year. The audio book is narrated by Tom Ryan--New England accent and all. (Who knew that Newburyport was pronounced New Breport?) Atticus M. Finch changed Tom Ryan's life and that of all who knew him and who continue to learn of him. I loved how Tom trained him from a pup not with punishments or rewards, but with the respect deserving a Please and Thank you for each favor granted. Atticus taught Tom how to love and how to live, about kindness, and how to dream. Tom gave Atti selfless adoration and a good life mingled with beautiful nature.I checked out Tom's blog and learned that he is still writing (great news!) and has a new companion, Samwise, with whom he already hikes as he did with Atticus. Last month atop a summit they watched Mars, the moon, and Venus align. From Tom's blog:\n\"As Emerson would say in his Transcendental way..., Samwise and I were with our peers out in that snowy field, with stars so brilliant, so bewildering, and humbling, I couldn't help but feel I was part of all we saw. And that little line that divides man and beast vanished and what we shared was the sacrament of communion.Nature has a way of bringing us home...\"\nTwo more books are forthcoming!"}, {"userName": "Linda Martin", "userReviewDate": "May 16, 2012", "userURL": "http://www.goodreads.com/user/show/2182520-linda-martin", "userReview": "I don't usually read animal books and have no idea why this book got my attention---but I surely am glad it did. I don't have a dog and haven't wanted one, even though my friends say I need one for company. I always say, \"No, I would rather not have anything to be responsible for.\" My time away from work is my own. Well, Tom Ryan you have almost changed my mind. Tom Ryan took a chance on getting a dog and it changed his outlook. Then Tom went on a journey \"Following Atticus\" and it changed his whole life. This very amazing journey make me laugh and cry; sometimes at the same time. What is the book about? I'd say it is about friendship, love and making memories. If you are a dog-lover, hiker, mountain climber, adventurer...or none of the mentioned...you are bound to love this book. Atticus changed Tom's life and his story may have changed mine. We'll see if I get a dog. It'll be the fault of Tom Ryan and Atticus if I do. I don't think it would be a mistake after reading this book."}, {"userName": "Beth Maddaus", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/2020306-beth-maddaus", "userReview": "\"It's like looking into the face of God\" is Tom's response as to what he sees when he and his little dog Atticus climb the rugged peaks of New Hampshire's 4000 footers. For Tom, and for his readers, the climb is more than an exciting adventure filled with difficult terrain, wildlife, and fearsome weather; the climb is about discovering who we were meant to be and how to find and nurture the inner self that leads us there. I met Tom and Atticus on a trail one cool September morning in 2006. I had begun hiking the summer before as a way to heal my own wounds and to confront my own demons. The mountains had given me peace and self confidence and in Tom and Atticus I found fellows on the same journey. Through the years I followed Tom's mountain writing and it felt like windows into my soul. He saw the mountains--not as athletic pursuits or challenges to conquer but as stately, stalwart places where he could return over and over again in every possible condition and always feel as if he was looking into the face of God. I understood that, because I did the same.This book is about love, healing, growth and home. If you have ever loved or been loved or wish that you had been loved differently; if you are ready to confront sadness, fear and disappointment; if you wonder what makes a home--then let Tom and Atticus show you."}, {"userName": "Cara", "userReviewDate": "May 03, 2012", "userURL": "http://www.goodreads.com/user/show/7257887-cara", "userReview": "The author's strong MA accent may have hindered my enjoyment of the book, but for whatever reason, I thought the book would never end. It's a nice little story, I suppose, but it's inflated to the point of self-indulgence, melodrama and sentimentality. I'm happy to move on. That said, I did appreciate the quote he used from some excellent writers (Campbell, Wordsworth, other romantic poets.) The guy is clearly well-read, which always earns some respect from me."}, {"userName": "Mike", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/10601653-mike", "userReview": "I wanted to read something lighter and chose this book because of the high rating and good reviews on Goodreads. Have to say this book is not for me.Part autobiography (Tom) and part biography (Atticus the dog) the book tells the story of the author who gets hooked on hiking and hooked on having a dog, then forces the dog to go on what he himself admits are dangerous winter hikes. There is another reviewer on here who said this book would have made a good magazine article – and I agree with that. Story was long and repetitive. Here’s the spoiler part of why I stopped enjoying this story. I got tired of reading about views from mountains that “changed everything for me”. I “took a look and knew my life was changed forever”. Really? It was OK to hike because you enjoyed the time alone with your dog. But when his good friend dies (whose funeral you didn’t go to because they didn’t want you to speak at the ceremony) and (I think out of guilt) you decide to hike mountains in winter to raise money for a charity in her honor – that is kind of OK, but then to set a random challenging goal – and stop working to do it over the winter – seemed a little self indulgent and odd to me. Then to force a miniature schnauzer to do this, too? There were a few occasions the dog refused to go on the hikes – I think he was telling you something. I mean, really – did the dog have the option to opt out? The author keeps pointing out how dangerous the weather was, and how he kept checking for pending storms, etc. and complaining whenever it did snow and they couldn’t hike. I think he added how conscientious he was so that people like me wouldn’t say – what the heck were you thinking? My response – get a job, and if you can hike on weekends or days off – then go hike. The world isn’t going to end because you don’t successfully climb 49 mountains in the 40 days of winter, or whatever it was. Make some money, and donate it to the charity yourself.I eventually felt like I was watching one of those TV shows where the overweight moms force their young daughters to enter beauty pageants. The dog was getting all this recognition, and the owner was preparing to write a book and a blog about the dog getting all this attention."}, {"userName": "Bryan Flagg", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5876217-bryan-flagg", "userReview": "First off, I must say I was one of the very lucky people to receive an advanced copy of this book. Tom Ryan has one of those gifts not given to all writers. He has that gift of being able to play with your emotions within a short span of time. He'll have you concerned, crying, excited, tense, crying again, yet smiling, and all before the chapter's end. Tom has allowed us in to a world of what some might think make believe, but in the White Mountains of NH, there is no make believe - it's all true! It's dangerous, it's fascinating and to the right people, it's a very magical place. Notice I say \"right people.\" There are many who come to conqueor, but few who honestly find its true magic. Well, Tom found his magic in the Whites of NH, yet did it by following his little dog named Atticus.Whether it's the mountains you enjoy, the hiking, the torment of sore feet, the enjoyment of the outdoors, the thought of following a little dog up some pretty big mountains against some substantial obstacles along the way, or just plain want to take an amazing journey with an incredible person named Tom and one incredible little dog named Atticus, this book is simply a must read.Be ready for a fun filled roller coaster ride of emotions that will have you finding it difficult to put this book down until you are completely finished. Enjoy this one. It's a keeper for certain.Following Atticus: Forty-Eight High Peaks, One Little Dog, and an Extraordinary Friendship"}, {"userName": "Janice Nelson", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/5881846-janice-nelson", "userReview": "Received my book and could not put it down. So well written and moving, so honest without any nonsense that weighs it down. A book that goes beyond all other dog books and is a guide for life. Very well written, quite readable and soon to be a bestseller. We have a home in the White Mountains of New Hampshire. Tom's beautiful descriptions make me feel like I am there, even though I am stuck here in our boring Boston suburb instead. Cannot wait to get back to the mountains this weekend. He inspires me to get my out-of-shape 50-something body back on the move in the most beautiful place in New England that I, sadly, often neglect. The book is a page turner from beginning to end. A great book about hiking, a special dog, a change of direction in life, the breathtaking beauty of the mountains, an act of charity and a moving perspective on family relationships. Something for everyone to take hold of. Read it soon."}, {"userName": "Maria", "userReviewDate": "Sep 15, 2012", "userURL": "http://www.goodreads.com/user/show/10424692-maria", "userReview": "This book was on the reader's choice table at the library, so I picked it up. It's about the author and his little dog and how the dog impacted his life and how he came to get the dog. It's a pretty good story. At first, it's about how he got the dog and how they became a part of each other's lives and how Atticus taught him a lot about himself. He's the editor/reporter of his own newspaper in a small city. Then he gets into hiking the mountains of New Hampshire, setting records in hiking all of the peaks over 4,000 feet in a certain amount of time, and Atticus loves the hikes. I guess I need to go to New Hampshire, because there is no WAY you could climb 3 or 4 mountains HERE in one day, which he does. So I have no frame of reference to understand what it was like. Atticus develops health problems and the whole town and hiking community rallies together to help pay for his medical expenses. It's a pretty good story, but not compelling. The first 2/3 is good, and there are pictures. But the last part of the book was just more of the same, so I skimmed over it. More climbing, more snow, more walking, more blah blah blah, throw in an injury and dad dying, the end. I just got bored of the endless hiking up and down the same mountains over and over again with the The Most Remarkable and Wonderful Dog to Ever Walk the Face of the Earth. And if he's doing all this hiking and neglecting his newspaper (he's the only \"employee\"), how is he doing this with no income, I'd like to know? So I'm giving it three stars for being an okay story, but taking off points for dragging out the details."}, {"userName": "Karen", "userReviewDate": "Aug 20, 2011", "userURL": "http://www.goodreads.com/user/show/1397038-karen", "userReview": "Fortunate to have an ARC copy. Loving it so far! Great appeal here - not just for hikers. Animal lovers, those interested in family relationships, the small town newspaper business, and the ability and courage to make life style changes. Should appeal to fellow middle agers out there that anything is possible if you persevere and follow your dreams!Finished the book in october. A fantastic read for people of all ages, both male and female! A privilege to have Tom and Atticus at our library! A jam packed room."}, {"userName": "Louis", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/6413664-louis", "userReview": "Before reading 'Following Atticus' I would suggest watching the video trailer for it. I was lucky enough to be at a recent book signing event on their tour and Tom has a wonderful soft spoken articulate tone that is nice to hear over the narrative of the book as you read.I am a dog lover, my dogs are my best friends. I hike some of the White mountains with my dogs. This however, believe it or not, has nothing to do for how much I enjoyed Following Atticus. OK, maybe the dog part had an influence. Although I am quite exhausted of all the 'Marley & Me' blah and didn't even enjoy that read.I recently read a review where it mentioned the words 'a quiet triumph' upon Tom & Atticus climbing Mt. Washington. That is a key point to the book. Tom writes with a wonderful restraint. Never does the book embellish their achievements nor gives the impression that he is trying to say 'Look how great we are'. He did not set out to write the next Hollywood screenplay. He simply wanted to tell a story and a great story it is.I constantly ask myself while reading this \"How do Tom and Atticus do this?\". The answer is ... They just do. What makes the book so compelling is that although Atticus is a catalyst for almost everything Tom is and has become in the past decade, the book is not solely about Atticus. It is about so much more. It is about a man not happy who he is, about who he becomes, about his relationships, about his town, about nature, about his past, about working through things, about friends both human and animals."}, {"userName": "Diane ", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/143168-diane", "userReview": "[ maybe the attack wouldn't have happened if Atticus was on-leash? (hide spoiler)]"}, {"userName": "James Field", "userReviewDate": "May 21, 2012", "userURL": "http://www.goodreads.com/user/show/7474838-james-field", "userReview": "Have you ever wondered why some people drop out of conventional society and flee to a life of isolation in the wilderness? In this novel, Tom Ryan explains with fascinating detail how and why it happened to him. It wasn’t a sudden decision, but a gradual process inspired by his remarkable and tough little dog Atticus. Together, they headed for solitude in the mountains of New Hampshire, and the mountains seduced them in a way that changed their lives forever.Tom Ryan was a newspaper editor which is evident at times in his writing, something I found mildly tedious.Biographical books of spiritual rediscovery are not my usual style, but this book was presented to me for my birthday, otherwise I would never have chosen to buy and read it. Now, I am thankful to Tom Ryan for sharing his experience and thankful to my sister for bringing it to my attention.This is an exceptionally inspirational novel which found a place in my heart and left me feeling warm and snug. I recommend this book to all those who struggle with a nagging inner voice that questions what is missing in their lives."}, {"userName": "Cheryl", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "Tom Ryan is owner, writer, and editor of his own newspaper. Mr. Ryan’s paper is called “Undertoad”. Mr. Ryan was not really in the mark for a dog when he became the new owner of a dog. A member of the city’s zoning board had sent a mass email reaching out to everyone to see who could take a dog. Tom was going to just write back to he would be happy to advertise in his newspaper about the dog but the next thing Tom knows, he is responding that he will take the dog. Tom did not have Maxwell for very long before he passed away from seizures. It was at this time that Tom realized that he liked having a dog and the company that a dog brought. This is where Atticus Maxwell Finch enters Tom’s life. You would not know it at first glance that such a small dog like Atticus would have such a big heart and determination but he does. Tom and Atticus quickly formed a bond. Tom invited his brothers out to visit him. They had been estranged. That changed and the brothers were visiting each other. One of Tom’s brother’s David invited them to join him to hike all of the White Mountains of New Hampshire. There are forty eight of the mountains and they are over four thousand feet high. If you can accomplish such a great feat than you will be eligible to become a member of the Appalachian Mountain Club’s Four Thousand Footer Club. Where you will receive a patch and a scroll. Tom and Atticus took on this task and soon they were hiking every mountain. It was during these times that Tom and Atticus really grew close and became good companions. Reading this book reminded me of another great book about a man and the bond he shared with his dog, whom was a standard size black poodle named Charley. Yep, you guessed it. The book I am talking about is John Steinbeck’s Travels with Charley. Only in this book, Charley is a mini schnauzer named Atticus Maxwell Finch. Atticus is the star of this book. He won me over when he and Tom were testing each other with the great cage and bath room incident. I knew than that Atticus was smart. To be honest at first I would not picture author, Tom Ryan with such a small dog but as I got to know both Tom and Attics better, I realized that they were meant to be together and made a perfect fit. The best choice I made was Following Atticus!"}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Sep 16, 2011", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Middle-aged, and overweight, Tom Ryan and miniature schnauzer Atticus M. Finch are an unlikely pair of mountaineers, but after a close friend dies of cancer, the two pay tribute to her by attempting to climb all forty-eight of New Hampshire's four-thousand-foot peaks twice in one winter while raising money for charity.In a rare test of endurance, Tom and Atticus set out on an adventure of a lifetime that takes them across hundreds of miles and deep into an enchanting but dangerous winter wonderland. Little did, they know that their most difficult test would lie ahead, after they returned home...At the heart of this remarkable journey is an extraordinary relationship that blurs the line between man and dog, an indelible bond that began when Tom, following the advice on Atticus' breeder, carried the pup wherever he went for the first month of their life together.In his debut novel, Following Atticus, by Tom Ryan, is ultimately a story of transformation: how a five-pound puppy pierced the heart of a tough-as-nails newspaperman, opening his eyes to the world's beauty and it's possibilities. It was a change that led to a new life among the mountains; an unforgettable saga of adventure, friendship, and the unlikeliest of family; and an inspiring tale of finding love and discovering your true self.I received this novel compliments of Harper Collins Publishers for my honest review and for anyone who has a deep admiration for pets and the remarkable chemistry that comes out when you are with your pet, you will find nothing but pure, unconditional love between Tom and Atticus. This just goes to show us all that nothing is impossible, it just needs to be attempted. He shows us all the unique ability of communication we have with the pets we love goes well beyond words we can understand, they have to be felt! I would rate this book a 5 out of 5 stars."}, {"userName": "Holly Weiss", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/3455463-holly-weiss", "userReview": "Own. Re-read! What a touching, heartwarming story. Overweight, out-of-shape newspaper owner Tom Ryan adopts a rescue dog, a miniature Schnauzer named Atticus. From the beginning, he treats Atticus as a friend, saying “please” and “thank you.” They begin walking and Tom finds Atticus a great inspiration for his better health routine. Tom is estranged from his family, but finally his brother invites Tom and Atticus to join him on a hike up Mount Garfield. The family becomes closer. To raise money for cancer, Tom decides he and Atticus will climb all forty-eight of the four-thousand-foot peaks in the White Mountains. ”It was as if he were made for the mountains…Atticus walked purposefully, staying on the trail, and kept a slow but steady pace…Most noticeable was how he kept a constant eye on me,” says Tom. Atticus had an innate desire to take care of Tom no matter where they went. Atticus overcame his fears of bridges and water and proved to be an example that limitations are things we put on ourselves.Tom Ryan is a born storyteller, somewhat self-deprecating, but humorous. He is well read and adds quotations from major writers and philosophers where appropriate. Atticus has determination and courage enough to inspire us all. Much more than a “dog” book, this is a story about redemption. Atticus teaches not just his owner, but also those who read his inspiring story. I recommend the book highly.Reviewed by Holly Weiss, author of Crestmont"}, {"userName": "Lisa Litz-Neavear", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/5316505-lisa-litz-neavear", "userReview": "This book was a choice of the Dog Lovers' Book Club. I read more than half of it word-for-word, but skimmed the second half. This was tough for me to do, as I usually will finish a book I've already committed to! Perhaps because I have several novels waiting for me to read them, I just did not feel invested enough in Tom and Atticus to finish the journey. There was a sameness to the description of the mountains and their hikes. I'm wondering if I would have enjoyed this book more if I loved the mountains as much as I love dogs? I admire both the author and his little buddy for their efforts, but can't help but think this would have made a better magazine article than a 250-page book."}, {"userName": "Ryan", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/2510203-ryan", "userReview": "I'm the kind of guy who still cries when I watch Old Yeller. For that matter, Nestor, The Long Eared Christmas Donkey has me in tears every time I watch it. I even cried when they went deer hunting on Silver Spoons. Let's just say I'm a sucker for animals. So stick a cute dog on a cover, and I'm going to agree to anything you say, just so I can read the book. Because of the adorable Atticus M. Finch on the cover, it was almost a sure bet that I was going to enjoy the book. What wasn't a given, was whether or not I was going to enjoy the voice used to tell the story. As much as I love dogs, I tend to not enjoy books written by journalists that feature their own lives as the subject material. I understand that you have to have a bit of an ego to write a book about yourself, but for some reason, journalists seem to revel in their own self importance. In the case of one book I reviewed earlier this year, the journalist in question was so self involved, I actually lost respect for him after reading the book. So when I finally found the time to crack the book open and dive in, it was with a bit of trepidation.At the very beginning, I was almost convinced that I wasn't going to be pleasantly surprised. When the author talks about his paper and the roll he played in town, I was reading some of the same words as I did in the book I read earlier this year. It was a little too self congratulatory for my taste. So I hunkered down to delve into the world of Tom Ryan, hoping that I would get something out of what I was reading.As I kept on reading though, I started to enjoy the time I was spending with Tom as he meandered his way across town. The man I quickly judged, just a quickly started to surprise me. As Tom started to talk more about himself, my brain started to change what I read as ego, into pride. Pride for what he had built with his paper, and pride and gratitude for the story he was about to relate to his reader. He opened himself up in ways that few of us would be willing to do.It's when, first Max then Atticus come into his life, that Tom truly comes across on the page as a humble man who feels blessed to have had these two wonderful dogs in his life. To my fellow dog lovers out there, you know what a wonderful blessing it is to have a canine friend share your life, both the triumphs and the setbacks. What Tom shares with his readers as he recounts the time spent with Atticus up in the mountains isn't a travelogue or a manifesto on the joys of mountain hiking. What I found in the pages of Following Atticus, was a story of two friends who come together and help each other heal in ways that neither could have expected in the beginning."}, {"userName": "Joyce", "userReviewDate": "Aug 21, 2011", "userURL": "http://www.goodreads.com/user/show/6091358-joyce", "userReview": "If you love the mountains…If you’ve never seen a mountain…If you love the stillness of winter…If you’ve never seen a snowflake…If you love the sound of wind through the trees…If you’ve never seen a forest…If you are surrounded by loved ones…If you’ve never felt connected to your family…If you know exactly what you want in life…If you’ve never found your niche…If you cry at anything…If you’ve never shed a tear…If you love a dog or other creature…If you’ve never had a pet…If you have faith…If you’ve never found anything to believe in…If you...(fill in the blank)…then, you will want to read \"Following Atticus\". Tom Ryan could be any one of us whose childhood wasn’t storybook perfect. Fully committed to single-handedly running his newspaper and reporting on the wheeling and dealings common to small-town politics, he was content with the life he’d created for himself.\tReluctantly, he opened his home to a little dog, Maxwell, in his time of need. When Max passed on, Tom found that the emptiness he’d left behind wasn’t just physical but emotional. The search for another dog wasn’t easy but, Atticus M. Finch is perfect for Tom Ryan. The transformation of his life begins in earnest once this little puppy enters his home.\tIn every journey of the human spirit, there comes a point when the old life no longer fits and it’s time to move on. It’s ideal to share the journey with a good friend and Atticus is Tom’s faithful companion and teacher as they take on their new adventures. Like any good teacher, Atticus leads by example and shows Tom how to reconnect with himself and with nature.\tFollowing Atticus is a true story of a dog, a man, friendship, hiking, promises, forgiveness and faith. If it awakens your spirit of adventure and you decide to head to the White Mountains of New Hampshire, just be forewarned that Tom & Atticus will likely decline your offer to hike together. It’s nothing personal but, nature is the preferred companion on their hikes."}, {"userName": "Michelle", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/1196015-michelle", "userReview": "I really enjoyed this book. While there are oodles of dog-related memoirs out there, this is definitely one of the better ones I've read. Yes, the book is about the dog Atticus, but it's more about how Atticus spurs the growth and transformation of the author, Tom Ryan. I loved that the author tied in the concept of pantheism and included some of my favorite quotes from naturalists like Thoreau. From Amazon: \"Middle-aged, overweight, and acrophobic newspaperman Tom Ryan and miniature schnauzer Atticus M. Finch are an unlikely pair of mountaineers, but after a close friend dies of cancer, the two pay tribute to her by attempting to climb all forty-eight of New Hampshire’s four-thousand-foot peaks twice in one winter while raising money for charity. In a rare test of endurance, Tom and Atticus set out on an adventure of a lifetime that takes them across hundreds of miles and deep into an enchanting but dangerous winter wonderland. Little did they know that their most difficult test would lie ahead, after they returned home. . . .\"Read more about Tom and Atticus on their blog: http://www.tomandatticus.blogspot.com/"}, {"userName": "Donna", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "4.5 starsThis was such an unexpected surprise. I just needed a short audiobook, one that wasn't full of details and people to keep track of, to listen to while I finished laying the hardwood floors in our home office. I am so glad that I chose this one. It made the work go fast.The story is about the author and how his dog ownership changed and shaped his life for the better. He and his 2 dogs basically formed a partnership based on true devotion. The author was able to accomplish so much good when these animals came into his custody, both for himself, the dogs, his friends, and his community. This book was funny and heartwarming. It caused me to ponder what I can do for my own community."}, {"userName": "Noor G.", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/14822299-noor-g", "userReview": "This is the first review I have written for this site. This book was extraordinary. I read it in two days (I would have read it faster had I not had other stuff to do). The book seemed like it would be a typical \"animal book,\" but it was so much more than that: reconnecting with family, the wilderness, unconventional spirituality, finding one's self, classic literature, and love for animals. The writing was easy to read, filled with small excerpts from classic authors like Thoreau, Frost, etc. I think it's a book everyone should read - it made me laugh (out loud...on public transportation), and it made me cry. Now that's a darn good book."}, {"userName": "Trinia", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/14301071-trinia", "userReview": "Great story about a man and his dog. Truly well done, not too bogged down with details, just truly good writing and straight from the heart. A new favorite animal book for me!"}, {"userName": "Jluskin", "userReviewDate": "Feb 02, 2012", "userURL": "http://www.goodreads.com/user/show/7603675-jluskin", "userReview": "Following Atticus is about the extraordinary means by which one man searches for a clean slate. It is about the one, sumptuous breath drawn at the mountain top and about each labored breath taken to arrive there through arduous steps chosen, missteps forced, sidesteps required, back steps cursed, and every foot print followed — to clarity. Tom Ryan’s Following Atticus is a lovingly and well-crafted story that brings us along the often treacherous mountain trails of New Hampshire in winter to the silent, sacred places where the author learns to allow himself to gaze upon life’s journey with eyes truly open.A hardened former newspaperman, Ryan writes in his own inquisitive voice, sprinkled with the words of great writers, thinkers, and poets of the ages, for he seems to realize that as we ascend to the peaks we indeed stand on the shoulders of giants. Ironically, the clear view from the top is not really that of his beautifully described White Mountain panorama on a crisp winter’s day, but the view from deep within the heart. Ryan arrives in the Whites with his dog Atticus M. Finch, the sui generis schnauzer, having left his newspaperman’s life behind in colorful Newburyport, Massachusetts. There, he had told the stories of the local sinners and saints, the former seared by the light his publication cast upon them, while the latter’s decency was illuminated. One such saint was a close friend, whose loss to cancer inspired Ryan to embark on a quest to twice climb the White Mountains’ forty-eight four-thousand-foot peaks during one winter, raising money for cancer research in the process.In the freezing nights and days on the trails, he forges a deep bond with Atticus, meets his own demons, confronts the tragedies and disappointments of his past and, through it all, finds love and the clean slate on which he is able to write his inspiring tale. This book is about seeking and discovering, and just how it feels to be there in the moment when that slate, wiped clean, is at hand."}, {"userName": "Danny Choriki", "userReviewDate": "Sep 12, 2011", "userURL": "http://www.goodreads.com/user/show/6280400-danny-choriki", "userReview": "I enjoyed reading Following Atticus. Most importantly, it is a heart warming tale of about the redemptive nature of love, how it manifests itself in the mundane that sometimes comes from places that one would never expect, in this case, the casual reply to an email. I share with author Tom Ryan a love of mountains - including the White Mountains, journalism in a small town and small dogs with large personalities. As a narrative, the story telling isn't overly compelling. This is most likely due to the style of the book which is written as a serial. That isn't to say the story isn't compelling, but in my opinion, the style gets in the way of the story. Still, the story evolves as does the love between Tom and Atticus. Their adventures hiking through life and through the mountains of New Hampshire are a great memoir. To describe these adventures would be to tell their story and Tom does it better than I possibly can. If you are looking for a story to cuddle up to the fireplace that renews your faith in the redemptive nature of love, I highly recommend Following Atticus."}, {"userName": "Bob Connolly", "userReviewDate": "May 10, 2011", "userURL": "http://www.goodreads.com/user/show/2202300-bob-connolly", "userReview": "Following Atticus is the real life tale of middle-aged newspaper editor Tom Ryan and an extraordinary and lovable miniature schnauzer named Atticus M. Finch. Facing questions about his life and following the death of a beloved friend, Ryan and Atticus set out to climb all forty-eight of New Hampshire’s 4,000 foot peaks, twice, in the winter, to raise money for cancer. Can an overweight, tough-as-nails reporter and his twenty-five pound companion accomplish what most think to be an impossible quest? What follows is a series of remarkable adventures, covering the cannibalistic, mean streets of small-town politics to the treacherous, icy conditions of wintry mountain top terrain, which will test not only Tom and Atticus’s endurance but the bonds that tie them together. The adventures that Ryan and Atticus share together will delight, entertain, and inspire. Ryan writes with such passion and enthusiasm about his love for the mountains, the relationships between fathers and sons, the inner workings of small-town politics, the loyalty of friendships, and one man’s unique relationship with a dog known as \"the Little Giant\". Rising above the plethora of dog books on the market, the story told is ultimately about one man’s transformation as he seeks to understand his place in the world and the little dog who guides him on that journey. After getting to know Atticus, the reader will want to follow him as well."}, {"userName": "Christina Tracey", "userReviewDate": "Oct 03, 2011", "userURL": "http://www.goodreads.com/user/show/6534173-christina-tracey", "userReview": "This is definitely the best book I’ve read in a long, long time. Tom Ryan takes the reader on an achingly personal yet amazing journey with \"Following Atticus\". This is not just a typical dog memoir, and it’s not just a story about the adversities of hiking the White Mountains of New Hampshire. This book shares with us wonderful life lessons taught by a little dog… live in the moment, be close to nature, reflect, persevere when things get tough, give selflessly, love unconditionally. Atticus gently leads Tom to discover his true self, and as Tom shares this story, the reader experiences all emotions encountered along the way. You will laugh out loud, you will shed tears, you will feel the exhilaration of triumph, and cheer for this unlikely pair. Tom writes in such a way that the reader can’t help but feel a personal connection to his experiences. By the end of the book, Tom has changed... and the reader probably has too. This book couldn’t come to us at a better time – in a world where we are constantly barraged with bad news and negativity, this book will remind the reader of all that is good and right and possible. Tom Ryan and Atticus are an inspiration, and we would all do well to follow them."}, {"userName": "Christina Tracey", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/6534173-christina-tracey", "userReview": "This is definitely the best book I’ve read in a long, long time. Tom Ryan takes the reader on an achingly personal yet amazing journey with \"Following Atticus\". This is not just a typical dog memoir, and it’s not just a story about the adversities of hiking the White Mountains of New Hampshire. This book shares with us wonderful life lessons taught by a little dog… live in the moment, be close to nature, reflect, persevere when things get tough, give selflessly, love unconditionally. Atticus gently leads Tom to discover his true self, and as Tom shares this story, the reader experiences all emotions encountered along the way. You will laugh out loud, you will shed tears, you will feel the exhilaration of triumph, and cheer for this unlikely pair. Tom writes in such a way that the reader can’t help but feel a personal connection to his experiences. By the end of the book, Tom has changed... and the reader probably has too. This book couldn’t come to us at a better time – in a world where we are constantly barraged with bad news and negativity, this book will remind the reader of all that is good and right and possible. Tom Ryan and Atticus are an inspiration, and we would all do well to follow them."}, {"userName": "Doriana Bisegna", "userReviewDate": "Jul 06, 2013", "userURL": "http://www.goodreads.com/user/show/5069712-doriana-bisegna", "userReview": "Atticus, Atticus, Atticus...how do I love thee...let me count the ways!! This book totally surprised me because I was expecting a Marleyesque type of dog story. Atticus is nowhere near Marley or any other dog story that you have read! Tom Ryan does an exceptional job of writing about his life with Atticus, his experiences hiking the 4000ft mountains of New Hampshire with Atticus and his experiences along the way! The spiritual aspect of this adventure story also completely caught me off guard...I was not expecting to have it touch my soul as much as it did! The respect and admiration that Tom Ryan has for Atticus from the moment he arrived from Louisiana to Massachusetts taught me a few things as a dog owner. He always allowed Atticus to be who he is...he taught him enough to ensure that his safety was always a priority without all the other \"impressive dog tricks\"! There are so many soulful moments in this book and I am all the richer and wiser for having read it! There is a chapter at the very end of the book that convinced me that we are guided by angels here on earth...and that those angels may not always have wings...sometimes they have four paws and the cutest of mugs!!"}, {"userName": "Daniel Schrader", "userReviewDate": "Dec 12, 2012", "userURL": "http://www.goodreads.com/user/show/3000672-daniel-schrader", "userReview": "Following Atticus raises no social, moral or ethical questions, reading the book won't deepen your understanding of science or history, it won't even take away to a fantasy world better rendered in big budget 3D. What Following Atticus will do is introduce you to a delightful friendship between a man and his dog(s).It turns out that both man and dog are in need of a friend, and together they learn and grow in ways that make them both wiser, stronger and better than they would have been alone. Read this book, and read the authors blog at [...] They will warm in ways a latte never could and they will remind you of the healing power of friendship.Tom's prose is mostly workmanlike; occasionally sailing to the realm of poetic and equally often falling into the valley of mundane. His tales of climbing all 48 of the major peaks in the White Mountains at times drag. And sometime he reaches into his bag of emotional gotchas a bit too often. The book isn't perfect, but it is worth reading. Tom and Atticus are good company and well worth time to get to know them."}], "description": "After a close friend died of cancer, middle-aged, overweight, acrophobic newspaperman Tom Ryan decided to pay tribute to her in a most unorthodox manner. Ryan and his friend, miniature schnauzer Atticus M. Finch, would attempt to climb all forty-eight of New Hampshire’s four-thousand-foot peaks twice in one winter while raising money for charity. It was an adventure of a lifetime, leading them across hundreds of miles and deep into an enchanting but dangerous winter wonderland. At the heart of the amazing journey was the extraordinary relationship they shared, one that blurred the line between man and dog.Following Atticus is an unforgettable true saga of adventure, friendship, and the unlikeliest of family, as one remarkable animal opens the eyes and heart of a tough-as-nails newspaperman to the world’s beauty and its possibilities", "title": "Following Atticus: Forty-Eight High Peaks, One Little Dog, and an Extraordinary Friendship", "url": "http://www.goodreads.com/book/show/11100477-following-atticus", "average": 4.12, "cover": "https://images.gr-assets.com/books/1442725020l/11100477.jpg", "reviews": 1198, "authors": [{"url": "https://www.goodreads.com/author/show/5425019.Tom_Ryan", "name": "Tom Ryan"}], "type": ["Animals", "Nonfiction", "Animals", "Biography", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/11100477-following-atticus", "http://www.goodreads.com/book/show/13610679-following-atticus", "http://www.goodreads.com/book/show/11338740-following-atticus", "http://www.goodreads.com/book/show/20911936-following-atticus", "http://www.goodreads.com/book/show/12776303-following-atticus", "http://www.goodreads.com/book/show/28693723-will-s-red-coat", "http://www.goodreads.com/book/show/37173633-will-s-red-coat", "http://www.goodreads.com/book/show/23241204-peeve-my-parents-pet", "http://www.goodreads.com/book/show/2427402.A_Sword_For_Pizarro", "http://www.goodreads.com/book/show/34235575-con-te-in-cima-al-mondo"]}