{"ratings": 375, "userreviews": [{"userName": "Monty Milne", "userReviewDate": "May 31, 2017", "userURL": "http://www.goodreads.com/user/show/14797192-monty-milne", "userReview": "I wasn't really enthused by Effi Briest, and I can't say I was wildly excited by this either, but I thought it better than Effi. The Stechlin is, basically, a reactionary old fart, and so I had the pleasurable recognition of a kindred spirit. His not-quite-castle by the shores of a not-quite-placid lake is well done, and I enjoyed the portrayal of many of the minor characters. Portraying rural peasant dialect in translation is almost impossible: the translators here make a passable stab at it. It is a very leisurely paced novel, but it exerts a certain charm. It reminded me of something the late Lady Longford once said to me, when I asked her why she admired the 1st Duke of Wellington (she wrote a very good biography of him). She said, \"Like all great conservatives, he knew exactly how long to defend a position before it had to be abandoned.\" I did have a sense of poignancy and loss reading this - and this always gives me a melancholy pleasure - but there were times when I also had a sense of ennui. Three stars may be a bit harsh, but I did not enjoy it enough to give it four."}, {"userName": "sabisteb", "userReviewDate": "Mar 22, 2011", "userURL": "http://www.goodreads.com/user/show/5100042-sabisteb", "userReview": "Das alte Adelsgeschlecht von Stechlin, hat seinen Sitz das am Stechlinsee im Ruppiner Land. Es gibt derer nur noch zwei Stechlins, den verwitweten Vater (Dubslav) und den Sohn (Woldemar), Gardeoffizier in Berlin, 32 Jahre alt. Vater und Tante liegen Woldemar in den Ohren, doch endlich zu heiraten, damit die Stechlins nicht aussterben.Fontane selbst beschrieb die Handlung des Romans \"Zum Schluß stirbt ein Alter und zwei Junge heiraten sich; - das ist so ziemlich alles, was auf 500 Seiten geschieht.\"Leider muss ich dem Autor da voll und ganz zustimmen, mehr passiert wirklich nicht, außer gepflegter Konversation in trauter Runde und bei Festessen. Es ist wie in einem Familienalbum. Man schlägt die Bilder der Jubiläen und Feste auf und die Bilder gleichen sich: Leute beim essen und Spazieren gehen.Der Stechlin entstand 1895 bis 1897 und ist Fontanes letzter Roman und spielt in der Zeit seiner Entstehung. Er ist gepflegte, seichte Lektüre der Dame von Stand der Jahrhundertwende. Seicht, teils ein wenig pikant und vorhersehbar gespickt mit Referenzen und Querverweisen auf damalige B-Promis, die heute kaum noch einer kennt.So karikiert sich der Autor in Kapitel 34 sogar selbst\"Es gibt eine Normalnovelle. Etwa so: tiefverschuldeter adeliger Assessor und \"Sommerleutnant\" liebt Gouvernante von stupender Tugend, so stupende, daß sie, wenn geprüft, selbst auf diesem schwierigsten Gebiete bestehen würde. Plötzlich aber ist ein alter Onkel da, der den halb entgleisten Neffen an eine reiche Cousine standesgemäß zu verheiraten wünscht. Höhe der Situation! Drohendster Konflikt. Aber in diesem bedrängten Moment entsagt die Cousine nicht nur, sondern vermacht ihrer Rivalin auch ihr Gesamtvermögen. Und wenn sie nicht gestorben sind, so leben sie heute noch ...\"Nur leider, leider passiert nicht einmal so viel in diese Roman, auch wenn diese oben zitierte Wahrheit auch heute noch auf einen Großteil der Literatur zutrifft. Und falls noch jemand nicht aufgefallen sein sollte, dass Fontanes eigentliche Stärke in der Karikatur liegt und seine Personen durchweg überspitzt dargestellt sind in Kapitel 34 der Wink mit dem Zaunpfahl:\"Nur die scharfe Zeichnung, die schon die Karikatur streift, macht eine Wirkung.\"Ein wirklich uneleganter und platter Hinweis wie man das auch heute in den Massenromanen findet.Ich kann die zeitgenössische Kritik an Fontane absolut nachvollziehen. Zudem hat der Autor ein echtes Problem damit wie und als zu unterscheiden, z. Bsp. Kapitel 43 \"sowohl der alte Graf wie Melusine oder Kapitel 13 \"anders ist wie andere\". Highlight sind Woldemar Stechlins Freunde Rex und Czako, die mich mit ihrer gelungenen Lästerei an die beiden alten aus der Muppet Show erinnerten."}, {"userName": "Sandra", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "Non ci si aspetti un romanzo di azione, con una trama sviluppata e con colpi di scena. Nel romanzo di Theodor Fontane non accade praticamente nulla. “Alla fine muore un vecchio e due giovani si sposano”: ecco quanto accade in “Il signore di Stechlin”, secondo le parole dello stesso scrittore. E allora, ci si chiede, che cosa scrive Fontane in quelle oltre trecento pagine?Si tratta di un romanzo polifonico, che raccoglie amene conversazioni, sommessi dialoghi tra i personaggi, tutti incastonati nella Prussia di fin de siecle, e precisamente nella provincia brandeburghese che, pur essendo lontana dai luoghi in cui si fa la storia, è tuttavia in una relazione che si potrebbe definire cosmica con il mondo e la storia, simbolicamente rappresentata dalla leggenda del lago di Stechlin, secondo la quale esso si risveglia, ribolle e innalza un getto d’acqua o, nei casi più eclatanti, addirittura emergerebbe dalle sue acque un gallo rosso quando altrove, magari a Giava o in Islanda (questi vulcani islandesi hanno creato problemi anche in passato) la terra subisce un qualche stravolgimento. Il protagonista che dà il titolo al libro, Dubslav von Stechlin, è un anziano maggiore dell’esercito prussiano, espressione dell’aristocrazia terriera conservatrice detta Junkertum, “un vecchio signore del tempo che fu”, fautore di un conservatorismo legato alle vecchie tradizioni e alle virtù del passato ma con in più un profondo tratto di umanità, bontà ed onestà, unite ad ironia e sagacia. Espressione di una società in dissolvimento, destinata a scomparire dopo la sua morte.Ho dato tre stelle a questo libro perché la ripetitività delle conversazioni , così come il tono pacato delle vicende narrate, hanno rappresentato per me motivo di lentezza e pesantezza nella lettura, pur riconoscendone la validità, soprattutto nella caratterizzazione dei personaggi che circondano il signore di Stechlin. Su tutti spicca la figura di una donna, la bella e intelligente contessa Melusine Barby, una nobile cresciuta nell’Inghilterra vittoriana, ricca di brio e di verve, brillante, spiritosa e senza peli sulla lingua, una donna moderna e ricca di umanità, che precorre i tempi. In contrapposizione con lei vi è la zia Adelheid, la sorella di Dubslav, una vecchia badessa acida affetta da pregiudizi radicati e insuperabili, simbolo di un mondo chiuso al confronto con il tempo che passa."}, {"userName": "Rick", "userReviewDate": "Sep 20, 2007", "userURL": "http://www.goodreads.com/user/show/143932-rick", "userReview": "Fontane is my favorite German novelist after, perhaps, Thomas Mann, and all of his novels are worth reading. Der Stechlin is the testament he wrote at the end of his life, and the message is that, although Prussia and the Mark Brandenburg will always be the places he loves, political and social change are inevitable and, in this case, desirable. To demonstrate this, Fontane has written a Prussian comedy of manners that in places reads like a Prussian Henry James with a dash of Der Mann ohne Eigenschaften. All that nothwithstanding, the novel is highly engaging, and should be of particular interest to those who have read a fair amount of Fontane's earlier work."}, {"userName": "Virtuella", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/2333997-virtuella", "userReview": "I read this with much enjoyment and didn’t mind at all that it didn’t have much of a plot. There was much to laugh at and much to think about.)"}, {"userName": "Tarah Luke", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/31837430-tarah-luke", "userReview": "#1001books #693leftI think the translation left something to be desired because I was a little confused by what was going on. I am giving it 3 stars because I enjoyed the setting and some of the characters were interesting."}, {"userName": "Matthias", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/2894380-matthias", "userReview": "Eventhough nothing really happens in it (a man looses the elections, his son gets married, and he dies at the end) the book is about so many things. Most importantly it is a book about a changing world, about holding on to the past and belief in the future, about good and bad, happiness and matrimony. Theodor Fontane is a master in depicting East-Elbian landscapes and society and evoking a late 19th century and rural atmosphere. If you liked, for example, the novels written by Ivan Turgenev you should definitely read Fontane's novels."}, {"userName": "Joe", "userReviewDate": "Mar 02, 2011", "userURL": "http://www.goodreads.com/user/show/1918454-joe", "userReview": "I had some trouble with this one, which is a pity as I wanted to like it. In previous reviews it has been described as a sort of Prussian Henry James. Nothing much happens and the book is dominated by dialogue. That’s fine, but stylistically and perhaps philosophically it needs to give a lot in return. Unfortunately, this isn’t really delivered. That may be because Fontane isn’t all he’s cracked up to be, but I suspect the trouble may lie with the translation. Of course if I’d been more attentive in my German lessons as a schoolboy…"}, {"userName": "Deanne", "userReviewDate": "Mar 15, 2012", "userURL": "http://www.goodreads.com/user/show/370475-deanne", "userReview": "A german classic written before the wars and set in a rural area of Germany. Stechlin senior lives in a large house, referred to as a castle, on the edge of a forest near a lake. After the early death of his wife he brings up his son, who now grown is in the military and heading toward marriage. The story is slow, but that doesn't mean it's boring. Fontane looks at the relationships of the small family, their retainers and the neighbours."}, {"userName": "Peter Jakobs", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/5940363-peter-jakobs", "userReview": "A 19th century German classic: describing life in late stage Brandenburg, more precisely in the shire of Ruppin and one of its \"Junker\", von Stechlin, living in his manor at lake \"Stechlin\". Democracy and socialism are coming up but still people have a lot of respect for old noble families. Precise language and lots of little anecdotes make this book an enjoyable reading."}, {"userName": "Laura", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "I couldn't find any English version of this book. Perhaps someone may have a brilliant idea."}, {"userName": "Benjamin", "userReviewDate": "Dec 25, 2012", "userURL": "http://www.goodreads.com/user/show/5866525-benjamin", "userReview": "Fascinating look into late 19th century German society."}], "description": "Theodor Fontanes \"Der Stechlin\" (1899) gehört zu den wichtigsten Romanen des 19. Jahrhunderts, ja er ist ein Klassiker der Weltliteratur. Mit vorliegender Ausgabe können Sie Fontanes großen Altersroman neu entdecken. Sorgfältig nach der Originalquelle herausgegeben! Aktives Inhaltsverzeichnis: Alle Kapitel sind direkt auswählbar! Ideal auch für Schule und Studium! Illustrierte Ausgabe", "title": "Fontane: Der Stechlin (1899) - Illustrierte Ausgabe: (Klassische Romane und Erzählungen)", "url": "http://www.goodreads.com/book/show/24581011-fontane", "average": 3.78, "cover": "https://images.gr-assets.com/books/1421692789l/24581011.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/68613.Theodor_Fontane", "name": "Theodor Fontane"}, {"url": "https://www.goodreads.com/author/show/11214780.Juliane_Zeiler", "name": "Juliane Zeiler"}], "type": ["Classics", "European Literature", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24581011-fontane", "http://www.goodreads.com/book/show/1493972.The_Stechlin", "http://www.goodreads.com/book/show/2060980.Der_Stechlin", "http://www.goodreads.com/book/show/6371141-der-stechlin", "http://www.goodreads.com/book/show/1990104.Der_Stechlin", "http://www.goodreads.com/book/show/442296.Effi_Briest", "http://www.goodreads.com/book/show/1477414.Irrungen_Wirrungen", "http://www.goodreads.com/book/show/1532643.Frau_Jenny_Treibel", "http://www.goodreads.com/book/show/1740855.Unterm_Birnbaum", "http://www.goodreads.com/book/show/8642815-irretrievable"]}