{"ratings": 169, "userreviews": [{"userName": "Will Byrnes", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "By forcing the party, and particularly his fellow southerners to reckon with the country’s ongoing racial strife, [Lyndon] Johnson had thrown open the doors to a growing and increasingly liberal and African American base. But he had also driven scores of white Democrats into the arms of the Republican Party and a growing conservative movement that was quickly organizing around opposition to all that his administration had stood for.\nThe Democratic Party has struggled with issues of race for quite a long time. But the 1960s brought a sea change in the form of The Civil Rights Act of 1964 and the Voting Rights Act of 1965. The party that had stood up for racism, particularly in the South, had taken a turn toward decency. The political cost would be significant, particularly when Richard Nixon (and all subsequent Republican presidential candidates), applying his Southern Strategy, wooed white southern voters with dog-whistle appeals to racism. But the trend was clear. The party was shifting from a majority white institution to one that needed to cobble together a coalition of diverse elements. And most significant among this was a need to solidify the black voter base.Joy-Ann Reid MSNBC host Joy Reid looks at the racial strains within the Democratic Party from the 1960s to the present. While the book was originally published a few years back, the version I read was updated to include at least some of the 2016 presidential race. She looks at some of the players, with an emphasis on Jesse Jackson, Tavis Smiley, Cornell West, Al Sharpton and a few others. She examines the growth in black influence in the party, the tensions within the black political and civil rights community, and the conflict between supporters of the Clintons and black presidential aspirants. For those of us who attend to political goings on, this is fascinating stuff. Too much of this reads like middle-school, which is unfortunate. Not the text, which is crisp and professional, but the ego and turf battles. One particularly dark episode was in how Shirley Chisolm’s presidential candidacy was treated by the black power elite. We can see also the sort of purity fixation that other segments of the party have recently taken to espousing to the detriment of just about everyone but Republicans. It is pretty clear that when one takes an attitude of my way or the highway, no one gets to go anywhere. How far can one bend before breaking? Where does compromise leave off and capitulation begin? One of the real concerns portrayed in the book is the question of how far one can wander from Democratic principles without abandoning the core. Bill Clinton’s welfare reform legislation was a major tilt toward the Republicans, an attempt to inoculate himself against right-wing attacks on Dems as being soft on welfare fraud. There were plenty more of this sort, from DOMA to allowing Wall Streeters way too much leeway. But Reid points out that the eight years of the Clinton administration were very productive in terms of boosting black participation in the government, and making gains in fair housing. Was the tradeoff worth it? Would Clinton have lost those elections had he not triangulated the way he did?There are some pretty blatant political smacks in the face delivered here. Bill Clinton, in particular, was not exactly close with Jesse Jackson. During his first presidential run, Clinton took the opportunity, while attending a Rainbow Coalition meeting in DC, hosted by Jesse Jackson, to attack statements made by rap artist Sister Souljah. The choice of venue for that statement, rather than the statement itself, constituted a significant bit of political back-stabbing.Reid goes into some of the blow-by-blow behind-the-scenes battles that went on when Hillary and Obama were contending for the nomination in 2008. Loyalty and personal history banging up against identity. Interesting political sausage-making material. She offers some criticism of Obama for reacting way too fast to dishonest right-wing provocations in order to protect himself, comparing this to Bill Clinton doing the same thing. Some things do not seem to change much.Hillary comes across relatively well here. She actually does have a history of working for civil rights, and has nurtured her relationships in the black community. It was a real struggle for many when faced with the choice of sticking with Hillary or going with the new rising star. One interesting item was on the difficulty Bernie Sanders had wooing black voters.\n Sanders’s difficulty connecting with the mass of black voters was a sore point for his campaign, particularly since it was the key factor preventing him from gaining the nomination of the party he’d only formally joined several months after announcing his bid for president in April 2015.…the real explanation was simpler. Sanders had a fundamental discomfort addressing the immovable barrier of race, which loomed over his economic-based complaint like a giant pylon. He often struggled to incorporate Black Lives Matter into his message, even as many of its young leaders flocked to his banner.\nThe Democratic Party has plenty of challenges ahead, with or without Vladimir Putin, and treasonous administration officials tilting the scale against it. But there are reasons for optimism. Minority population gains will increase both the raw numbers of potential voters and the percentage of voters in the years ahead who are likely to register Blue. It remains a question whether Republican-controlled state governments will succeed in preventing those voters from being able to cast their ballots. They are certainly trying, and the current administration will do all it can to limit or eliminate voting rights for likely Democratic voters. It helps one understand what is up with the insistence on building a wall, and on transforming the ICE officers into a new Gestapo when one considers that Hispanic voters are likelier to vote Democratic. On the other hand, the resistance to Trump so far has been considerable and appears to have legs. Time will tell whether protests will translate into votes this time around. Reid’s look at a half-century of the Democratic Party is illuminating, both in negative and positive ways. Yeah, some people can be venal and maybe too willing to yield when they should hold firm. Others can be too rigid, to the detriment of all. But the overall trend within the party seems positive. Knowing where the party comes from, what it has gone through, and where it is headed should help us better understand the challenges it faces today and those that lie ahead. Reid has worked in TV and/or radio since 1997. She currently hosts AM Joy Saturday mornings on MSNBC. If you have not yet seen her show, I encourage you to give it a look. She is smart, charming, and very well informed. Review posted – March 3, 2017Publication date (this version) - 9/27/2016 – the original was published 8/8/2015=============================EXTRA STUFFLinks to the author’s personal, Twitter, and FB pages"}, {"userName": "John", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/290848-john", "userReview": "I've long admired the author from having seen her appearances on television, so I knew the writing quality would be high. Basically, the book can be seen as three parts: Black America from the Civil Rights Era up to the 2008 campaign; the campaign itself - both because of the first (major) black candidate and Black America's relationship with the Clintons; \"OK, we won ... what's next?\"At times, things become slightly \"in the weeds\" in terms of keeping track of the factions and personalities, but overall Ms. Reid succeeded in writing the book that needed to be out there. Highly recommended, although perhaps more so for political junkies than general readers (though the latter group should appreciate the book as well). Even folks who aren't particularly fond of the president might be interested to learn that neither are some African-Americans, despite his near-unanimous vote totals in those communities."}, {"userName": "Andre", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/5321728-andre", "userReview": "A journalistic walk down Democratic Party history. Joy Ann Reid does a fantastic job of chronicling the transformation of the party from white southern conservatives to what we know it as today, the party of liberal multi-ethnics seen by many as the party of big government. She starts with 1964 and the LBJ years and takes us right up to 2015 and President Obama. This book covers a lot of the same area as Dyson's \"The Black Presidency,\" often citing many of the same speeches and comments from Obama's time in office. The difference is Joy shows you how the democrats arrived at a point that the election of a Black president was possible. She is succinct in her plain prose making this a really approachable and breezy read. She refrains from injecting her own opinion and writes from the perspective of the reporter that she is. The book offers a keen insight into the game of politics, how an ally can quickly turn into a foe if the wrong words are said, or the need to appeal to a certain constituency is necessary.Joy Ann Reid makes quite a presentation in this book by delineating the need for not only shrewd advisors but courage, calculation and skill on the part of the political principals. Once you have read the book, you will possibly view politics in a different way, knowing full well that things are not always as they seem. There are some great moments in the book, most may be familiar as headlines, but her journalistic bona fides allows for more depth. An excellent production well worth the money."}, {"userName": "Steve", "userReviewDate": "Dec 01, 2015", "userURL": "http://www.goodreads.com/user/show/14521140-steve", "userReview": "Everything you need to know about “Fracture,” you can read in the five-page introduction. For example, author Jo-Ann Reid writes in her opening, “The Democratic Party . . . represented the vast majority of black Americans . . . (the) Republicans essentially took over as the party of southern conservatives.” The MSNBC national correspondent goes on to report, “The Democratic Party in its present form---racially mixed in the north and west and nearly all black ‘down south’---wasn’t completed before the ascent of the real first black president Barack Obama’s elevation to the White House in January 2009.”Reid’s 322-page documentary “traces the Democratic Party’s turbulent racial history and the rocky road Democratic candidates and elected presidents have trod on their way to reconciling their party and their country’s racist past with its increasingly diverse future.”Author Reid proves herself to be a consummate cheerleader for the Democratic Party. She makes no secret about her left-wing bias. Here’s the key to understanding Reid’s tone and loyalty to progressive-socialist politics. It’s this statement in Reid’s introduction: “The modern Republican Party represents the part of America that in fundamental ways is pulling backward toward a distant and irretrievable past.” You mean, Miss Reid, back to the days of our nation’s founders? Back to the Constitution? You mean that \"silly\" constitution? That outdated document nobody ever bothered to read let alone follow? Reid goes on to claim, “The current iteration of the Democratic Party represents the possibilities and challenges of a multiracial future.” Finally, Reid writes, “For the time being, and for the foreseeable future, particularly for African Americans, the Democrats are the only ball game.” Reid says she published “Fracture” because “if the Democrats can’t get it right,” (I assume she meant economic, health, and educational disparities and voting rights hanging in the balance)---“and they haven’t yet---it’s hard to see how the country can.” You have to give Reid credit for suggesting that the Democrats haven’t yet got it right on those divisive issues. That’s the only “balance” I detected in Reid’s writing.Speaking of her writing, most politically conservative thinkers wouldn’t read this book in the first place. However, if they did, they would find Jo-Ann Reid hates to place a period after any sentence. Consider this paragraph on page 19. It’s all one, wandering, breathless paragraph: “Robinson, Ali and King reflected the growing dichotomy between what was viewed as the ‘bourgeois’ goals of the integrationist civil rights movement proper, like university admissions and jobs in Woolworth’s management, and the urgent aims of a younger column of black activists like Carmichael: namely addressing the economic inequities of class and racial prejudice that blocked black Americans in urban ghettos, with few job prospects and often tense or even violent interactions with police, compounded by the invisible chains dragging spiraling numbers of already hopeless young men to Vietnam, often by way of all-white draft boards.” Huh? What'd she just say? That’s all one sentence. Period. In fact, where’s the period here? Or consider this one on pages 77 and 78: “But the Omnibus Crime Bill, which pledged to put a hundred thousand police officers on the streets and created a federal ‘three-strikes’ provision that opened the door to lengthy prison terms for repeat offenders, ignited fresh criticism from civil rights leaders, including Sharpton, who accused the administration of failing to address racial profiling or the dramatic racial disparities in drug sentencing; of ‘federalizing capital punishment’ by expanding the number of eligible crimes, and of unleashing what the National Action Network leader warned would be a new ground war between police and black and poor communities in cities like New York.” Whew! Exhausted yet?How about this run-on sentence on page 116? “Whether in downstate Illinois or at the Democratic National Convention, Barack Obama was speaking to the America that---as Tony P. Hall discovered with his slavery resolution in 1997, (and again when he introduced it in 2000), and which Howard Dean discovered during the primary, when he wandered into the racial and political thicket of ‘Confederate flags’ and ‘pickup trucks’ as shorthand for the white southerners he hoped to win back to the Democratic fold---wants very little to do with the past, other than to point to the glory of its progression and then move on to more productive things.” Had enough?Got time for one more? How about this one rudderless, marathon sentence on page 299: “Bernard Lafayette, who as a young SNCC organizer took charge of the Selma voter registration campaign after the national leadership declared Selma to be hopeless, was there, too, as was Jawana Jackson, who was just five years old in 1964 and 1965 when her parents, Dr. Sullivan ‘Sully’ Jackson, a black dentist, and his wife, Richie Jean, a teacher, housed ‘Uncle Martin’ Luther King Jr. and Ralph Bunche at their corner home in Selma, a house preserved as if in amber, down to the beds where the two Nobel laureates slept and the yellow throw-covered living room chairs where the Jacksons and Dr. King watched Lyndon Johnson’s televised address announcing the Voting Rights Act.”As the former managing editor of TheGrio.com, as well as a columnist for other major newspapers, Joy-Ann Reid is badly in need of an editor. Someone who can show her what a period looks like in a sentence. That’s all I got to say. Period."}, {"userName": "Mark Fallon", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/696679-mark-fallon", "userReview": "Reid covers more than just the Obama and the Clintons, but also the major racial-political events of the last 53 years impacting presidential races. She unveils the struggles of the Democratic party as it tries to move forward in a more diverse world, while not alienating the white base that it needs to regain seats in state and national offices.The need for open, honest conversations about race are critical to the future of our country. But when even President Obama is attacked - from the left and the right - when he tries to begin the conversation with sincere comments on the topic, we face a fractured path ahead."}, {"userName": "Darian Jones", "userReviewDate": "Mar 08, 2016", "userURL": "http://www.goodreads.com/user/show/33786403-darian-jones", "userReview": "MSNBC author Obama cheerleader and Hilary apologists, but she does a decent job at surface level highlighting the history of the presidency and the politics since Truman and the shift in the Republican and Democratic platform. She fails on any level to analysis or offer a critique of Obama or HRC for the evil that they do or the fracture between them. Blood Feud is a far better read, but I did enjoy the historical analysis as she walked through history, but I kept waiting for the aha - this is why you wrote this book and it never came. Her goal seem to be a fluff piece rather than a serious discourse about the two folks she choose to place on the cover."}, {"userName": "Kathy Dobronyi", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/37380415-kathy-dobronyi", "userReview": "Reading this gave me a great deal of insight concerning the Black vote since the Civil Rights Act in 1965. Well written and engaging. I learned that the Black vote is a two-edged sword for the Democratic party. Although the GOP has no trouble being the party of racists, the Democratic party must attain a balance between the white workers and the black vote. Reid points out the difficulties and successes in doing this."}, {"userName": "Michael Bennett", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/43589883-michael-bennett", "userReview": "This is a well-researched and informative look at politics and race. This book adds texture to the most divisive issue facing America today. The story is well-crafted and provides valuable insight on not only President Obama and the Clintons, but delves into the background of others who've shaped the lives of so many, and influenced both the Obamas and Clintons."}, {"userName": "Edwina \" I LoveBooks\" \"Deb\"", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/6255709-edwina-i-lovebooks-deb", "userReview": "Joy Reid always puts a unique prospective on unique situations and relationship. She shares her thoughts on why we Americans are so divided on Race!! I Highly Recommend Fracture to all; whatever your political position is."}, {"userName": "Alicia", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/2946139-alicia", "userReview": "I like this book a lot. But, Joy-Ann is at her best with political analysis. This book reads more like a very long news article. I prefer her thoughts and opinions on politicians and policy."}, {"userName": "Paul Frandano", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/5861132-paul-frandano", "userReview": "I enjoyed Joy-Ann Reid's lightning tour of American racial politics from the 1960s civil-rights revolution during the Johnson Administration into the midpoint of the second Obama term, to which Reid devotes, deservedly, just under two thirds of its 322 pages of text. The Obama story - from p. 107 to the conclusion, is more deeply researched, observed (often first-hand), and reported than the book's useful schematic first third and makes a genuine contribution to our understanding of the fracture lines of American politics. In my view, Reid's narrative validates the \"categorical\" statement of the eminent late historian John Hope Franklin, near the close of the George H.W. Bush administration, “that the problem of the twenty-first century will be the problem of the color line.\" For me, the most riveting sections of the book recounted the turmoil in the Democratic Party and African-American political establishments created by the Obama candidacy in 2008, which Reid brilliantly sets in the context of specific events and political forces within the Party. African-American Democrats were substantially committed to Hillary Clinton in the 2008 race. Bill Clinton, after all, had been christened \"the First Black President\" - an appellation that stuck - by none other than Toni Morrison. This was of course despite Bill's triangulated support for a welfare reform package \"that could easily have been presented by a Nixon or a Reagan administration,\" an Omnibus Crime Bill stripped of social spending, building more prisons, and resulting in a massive incarceration of black males, his throwing longtime friend and Yale classmate Lani Guinier under a bus in her confirmation fight to be Assistant Attorney General in charge of the Justice Departments Civil Rights Division, and other calculated political measures in which Clinton seemed to take his African American support for granted. In one memorable moment, in response to all the members of the African American political establishment who had already endorsed Hillary, believing her nomination to be a foregone conclusion, Obama mentor Emil Jones, then President of the Illinois State Senate, appealed to the DNC winter caucus on behalf of Obama. Speaking at the Black Caucus session and looking directly at Donna Brazile, Minyon Moore, and other Clinton supporters, Jones said, \"Each of us at one time has gone around to all these schools and talked to all these black youngsters and encouraged them to stay in school , and told them you can be anything you want to be...And now is the time...(Obama) is you, he's articulate, he knows the issues. We as a caucus should be behind Barack Obama.\" Then he dropped the hammer: \"We don't owe anybody anything. What Clinton did for the blacks he did because he was *supposed* to do it. He got our votes, so were were entitled to everything we got. He didn't do us any favors. We don't owe anybody anything.\" The Obama campaign went on without much Democratic and African American establishment support until he began to steamroll his way through the primaries and developed a groundswell of popular support. Throughout, he overcame the resistance of the regular Party, Black Clintonistas, and prominent critics like Jesse Jackson - who accused Obama of \"acting like he's white\" - Tavis Smiley and, later, Cornell West (who began as an Obama critic, then flipped to become a campaign surrogate, and finally became a vociferous opponent), while forging alliances with Al Sharpton and other black leaders, and finally winning the key endorsement on 27 February 2008 of Georgia congressman and Civil Rights icon John Lewis, who announced he was shifting his endorsement from Hillary Clinton to Barack Obama - he declared the switch to be among the hardest things he'd ever done.A stirring story, well told. Reid also does an admirable job detailing, from an unabashedly progressive point of view, the battles the Obama administration fought against persistent critics and entrenched Republican congressional opposition, which every newspaper reader will already be familiar with, although probably not at the granularity of Reid's narrative. I've docked the book a star for its uneven documentation. Although this isn't a scholarly work, it does have 20 pages of endnotes, and if Reid is going to document at all, she should at document every passage that might raise a sourcing question in the reader's mind. Two examples: I wanted Reid's source for her observation on p. 96 that Florida had \"permanently stripped the voting rights of those convicted of felony crimes ...a vestige of the Black Codes enacted at the end of Reconstruction...\" There was no citation (and her dating of the Black Codes was incorrect; the difference is historically significant: they were drawn up in 1865-67, during Andrew Johnson's catastrophic foray into presidentially-mandated Reconstruction, and well before the formal end of the more punitive, congressionally-directed Reconstruction in 1877). Another place I wished I had a citation was Reid's account of the 7 March 2015 commemoration at the Pettus Bridge in Selma. Jesse Jackson was there, but because of his estrangement from Obama and the White House, he watched the commemorative speeches from the crowd rather than from the stage. By the time Obama and luminaries of the civil rights era had ceremonially crossed the bridge, Jackson was already back in his hotel room. I was moved by this story - Jackson, an iconic figure, essentially sulking in his tent - and wanted more details. Again, no citation. Perhaps Reid was with Jackson and knew his story firsthand. She might have sourced herself. These are nits, however. Reid's book tells an important story, is a powerful summation of the trials, travails, and victories of the Obama administration, and deserves a broad readership."}, {"userName": "AI", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/20256620-ai", "userReview": "Joy Reid's Fracture is an accessible look at the history of race relations in the Democratic Party, starting with Lyndon Johnson in 1964 and the passing of the Civil Rights Act, then building up to the election of Barack Obama and his 8 years as president.LBJ is alleged to have said with the passing of the Civil Rights Act that the Dems \"have lost the South for a generation\". While this quote is apocryphal, it does capture the sort of identity crisis the Democratic Party entered post-LBJ, in which the Democratic Party lost the Dixiecrats, becoming more dependent on voters of color to win elections, while taking those voters for granted, kicking them to the curb after losses in order to appeal to conservative white voters. This is perhaps best exemplified by Bill Clinton, and his Third Way. Joy Reid, TV's best political commentator, details this history quite clearly in the first few chapters, and anybody interested in the history and future (if there is one) of the Democratic Party should look into this book.The latter half of the book deals largely with Barack Obama's election in 2008 and his presidency, and the fine line he often had to toe so as not to offend white people. Even so, the fact that so many were offended by his pastor Jeremiah Wright, or by the 'beer summit', or by Obama's slight comments about Trayvon Martin, just shows how fragile the ego of so many white people in the US are when their view of the US status quo is challenged. Support for Obama from white voters dropped 53% to 46% from the 'beer summit'. Do people even remember what that was? Obama said a cop acted stupidly when a white cop arrested a black Harvard professor, Henry Gates, while the professor was trying to enter his own house. And 7% of white voters resented Obama for saying that?As of this writing, the forces of white resentment in the US have just elected a fascist bigot to be POTUS, Birther-in-Chief Donald Trump. We now see the Dems performing their ritual self-destruction, in which some are arguing that 'identity politics' (aka civil rights) be abandoned in order to appeal to the 'working class' (by which they mean the white working class). How will the Democrats handle this situation, will history repeat itself? Who knows. It seems the whole country is now fractured."}, {"userName": "Neil Purcell", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/45970407-neil-purcell", "userReview": "Joy Reid is making quite a positive impression on MSNBC - one of the best and brightest voices in cable news. Her style is civil, cheerful, well-informed, and liberal. Her book, \"Fracture\", has the same positive, balanced, knowledgeable tone as she consistently brings to the discussion on MSNBC. I think most of her fans will like this book, which has its good moments, but didn't really do much for me.\"Fracture\" isn't the close examination of the surprisingly strong connection between the Clintons and America's African American voters that I had hoped it would be. Instead it is a broad but not deep survey of the history of the politics of race and the changing voting patterns of Black America. It was familiar territory and so I didn't learn much that was new to me. There is value to me in reading another person's view of that history, and Reid has some really good moments in telling the history from her perspective, but I am still left wondering how Hillary Clinton, champion of Wall Street, has won such strong support from Americans of color.This book's best section is the latter chapters dealing with the experience of our first black president, Barack Obama, in a polarized and not-at-all post-racial America. When this election season finally comes to an end in early November, perhaps we will begin to reflect seriously on the Obama presidency, what its successes have meant to us, and what its disappointments say about us in this new era. If I were not so concerned about where we seem to be heading, I might look forward to that period of reflection."}, {"userName": "Barry Martin Vass", "userReviewDate": "Dec 12, 2015", "userURL": "http://www.goodreads.com/user/show/24287988-barry-martin-vass", "userReview": "This is a very comprehensive study of the role of race and racism in American politics. Author Reid takes as her starting point the 1954 decision by the Supreme Court in Brown v. Board of Education to outlaw segregation in public schools, and of course the turmoil that followed. And then she moves on to 1956's The Southern Manifesto, in which a hundred Southern legislators got together to basically say: \"Hell no, we ain't going to do it, and the Supreme Court can't make us.\" Joy-Ann Reid does a good job of detailing the hatred, fear, and anger that took hold during this period when the Right just didn't want to budge on racial equality. The book then discusses the Civil Rights Act of 1964 and the Voting Rights Act of 1965 and the darkening mood of the country as legislated civil rights took hold and the Vietnam War devolved into an unwinnable war. And as the presidents come and go, Author Reid details the mood of the nation at large, and what their policies and philosophies did to the country and specifically to African Americans. The Obama-Clinton primary is covered in depth, as is the Obama Presidency, the growing trend of shootings by white police officers on unarmed black pedestrians, and the Supreme Court's vote to essentially gut the Voting Rights Act of 1965. This is must reading if you're going the polls in 2016."}, {"userName": "Tucker", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/308912-tucker", "userReview": "Reid illustrates the historical evolution of racial polarization in the United States beginning in the 1960s when conservatives correctly predicted that the Democrats would eventually become \"a party of ethnic minorities and liberal, northern whites, with almost no white presence south of the Mason-Dixon Line.\" Now, \"particularly for African Americans, the Democrats are the only ball game...failure is not an option.\"In 1964, when Barry Goldwater, who opposed the Civil Rights Act, won the Republican nomination for president, Massachusetts attorney general Edward Brooke said \"the Negro feels he was evicted from the Republican Party.” Democrats consequently \"claimed the near-total support of black voters at 94 percent\". That election had the highest nationwide turnout ever (69 percent of eligible voters), and the voters' choice of Johnson caused Martin Luther King Jr. to suggest that someday the nation might even elect a black president.Black voters' embrace of the Democratic Party was not uncomplicated, however. Johnson was, as president, initially known for his championship of the Civil Rights Act, the Voting Rights Act, and the War on Poverty, but later his reputation suffered from his escalation of the Vietnam War, and ultimately there wasn't a progressive to take his place. In the 1972 reelection of Nixon, fewer than half of black voters turned out. In 1976, campaigning against Nixon's heir Ford, Jimmy Carter chose to attempt to change the whites-only attendance policy at his Southern Baptist church rather than simply leave the church. In the 1992 campaign, Bill Clinton made some controversial efforts to appeal to white voters, such as (in his role as Arkansas governor) signing the death warrant for a mentally disabled black man, although the substance of his policy generally appealed to black voters.Whites without a college degree dramatically shifted from Democrats to Republicans (revealing \"a fierce anti-black and anti-immigrant undertone,\" according to a professor of history) in the 1994 midterm election, and black and Hispanic turnout was low. A New York Times article\"pointed to black voters declaring their frustration not just with Republicans, but with Democrats, who, while desiring black votes, rarely articulated a defense of black personhood in the face of conservative attacks. No longer was there a JFK willing to publicly challenge the country, or an LBJ to push his coregionalists on matters of civic fairness or even simple interracial civility. The Democrats had become the 'tough on crime' party, the 'hundred thousand cops' party, and the party that tossed Lani Guinier overboard.\"Racial polarization along political party lines became more absolute and crystallized surrounding Obama's presidency. In the middle of Obama's first term, the 2010 midterm election saw, in the South, 9 out of 10 white voters choosing Republicans and 9 out of 10 black voters choosing Democrats, demonstrating \"the 46-year transition from a multiracial Democratic political dominance to a white conservative Republican political dominance.” A January 2015 poll found that Republicans and Democrats were polarized on race questions that were not even political, such as whether the film 12 Years a Slave deserved an Academy Award or whether an NBA team owner who had made racist statements should have to sell the team. As the 2016 election approached, Republicans feared that Trump would permanently alienate Hispanic voters from the Republican Party the way that Goldwater had alienated black voters 52 years earlier. A March 2016 poll found that nearly three-quarters of Trump supporters\"stated they believed American culture had changed for the worse since the 1950s, and strong majorities resented hearing non-English speakers, exhibited strong degrees of racial resentment, and shared a belief that society had become too 'soft and feminine.' Studies and exit polls found Trump supporters highly suspicious of trade, resistant to immigration, and beset by feelings of powerlessness and national decline.\"In the 1950s, 60 percent of American voters were white and working-class, but now that race and education demographic is shrinking by two percentage points every four years (according to David Bositis of the Joint Center for Political and Economic Studies). It therefore remains to be seen in the long term how this polarization will endure and continue to manifest.This was a nuanced and illuminating history, originally published 2015 and with a 2016 afterword about the Clinton/Trump contest dated several months before the election.Although Reid wrote about President Johnson, her history begins in 1964 and did not mention the Johnson Amendment passed ten years before that when Johnson was still a senator. Stephen Mansfield's \nChoosing Donald Trump: God, Anger, Hope, and Why Christian Conservatives Supported Him\n finds roots of the current racial/political polarization (more specifically, of white evangelicals' support for Trump) in the chafing of some religious leaders at the IRS rule (originated by a Democratic politician) that prevents them from endorsing political candidates, which Trump has promised to repeal (though he has not yet succeeded). I previously blogged extended thoughts about Mansfield's book and have amended it slightly to mention Reid's book."}, {"userName": "Brook", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/51912460-brook", "userReview": "With overwhelming media preceeding the 2016 presidential elections, calm voices have been, at times, hard to locate, but this book seems to do just that: paint a mostly objective view of the delicate balance required to survive the American political storms, as depicted by a biographical telling of President Barack Obama and Secretary-of-State Hilary Clintons personal and public journeys and choices. I found the book helpful because I come from a very republican, very 'white' background, and am currently fascinated/learning more of some of the many streams of thought of those who have battled for civil rights for many years, and those of the democratic party. This book dispelled some of the 'Facebook' mythology I have personally found impossible to do research on by a truly objective source, and while I cannot say the author is completely and impersonally objective, I felt the book gave me a much clearer understanding on more than a few issues and enabled me to respect the intensely difficult journeys of many mentioned in these pages."}, {"userName": "Beverly", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/2527430-beverly", "userReview": "Great book that brings to light the group, personal and political issues that affected Obama's entering the national political realm through almost the end of his terms. I knew a lot of the information however the way it was presented in a timeline like manner of how things interacted to bring forth the decisions made and the competing interests helped me to better understand how things came to be as they became. I highly recommend this text to bring a more 3 dimensional look at political divides and understand how they occur."}, {"userName": "Gavin", "userReviewDate": "Aug 17, 2016", "userURL": "http://www.goodreads.com/user/show/10106098-gavin", "userReview": "This book is a really revealing historical account of the relationship between the two major American parties at black voters since the 1960's. It helped me understand many of the dynamics of this election more clearly, as well as giving much-needed insight into the last 8 years. I would certainly recommend this book to anyone who wants to more deeply understand the racial tensions in national electoral politics."}, {"userName": "Eric", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/2251846-eric", "userReview": "Inspiring read about the racial divide which was broken over the years in the political field. Speaks of the involvement of such activists as Jackson and Sharpton and how they pushed the barriers for all not just the few. Also included is the reactions of these activists toward the election of Barrack Obama."}, {"userName": "Sahar Dancer", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/13125450-sahar-dancer", "userReview": "Well ResearchedThe author did an excellent job of bringing this recent political history back to the forefront and making the connections to the climate today. A big plus was reading about the behind-the-scenes events that took place that the media didn't cover."}, {"userName": "Kenyon Callahan", "userReviewDate": "Dec 28, 2015", "userURL": "http://www.goodreads.com/user/show/47260562-kenyon-callahan", "userReview": "This book is an easy read and it gives you a perspective on Presidents Obama, Clinton and Secretary Clinton. I thoroughly enjoyed this read. Joy Reid did a fantastic job with book. I am looking forward to reading more from her as I am sure this is not her last book."}, {"userName": "David", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/1392853-david", "userReview": "a rather disturbing book about race and the Democratic Party...about the rather complicated relationship between the Clintons and African Americans"}, {"userName": "Karen", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/11895049-karen", "userReview": "Modern political history. Puts current election into context. Too bad it was completed right before Donald Trump announced his candidacy. Would like to read how she'd incorporate his campaign."}, {"userName": "Sarah Hildebrants", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/37008476-sarah-hildebrants", "userReview": "Very interesting (if ultimately depressing) dissection of the last 60 years of political discourse on race in American presidential politics"}, {"userName": "Cale", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/9288112-cale", "userReview": "I checked this out because I've been impressed with Joy-Ann Reid's Twitter feed, and was interested in getting her insights into the Democractic party in recent years. This book serves as a useful guide, going from Lyndon Johnson's Equal Rights Act through to the waning years of Obama's presidency, presenting the era through the eyes of the black populace. It is a very different view than I had on the era, and I appreciate how much Reid works to give multiple viewpoints their voices. Although there is definitely a specific viewpoint driving the narrative, it isn't in any way a myopic view; she presents the actions of different groups of black politics and shows how each group reacted to the different presidents and policies. I learned a lot about how the different organizations worked together (and in some cases worked against each other) to further their goals. The epilogue is the only piece that feels particularly dated - it was definitely expecting a different result for the 2016 election. But aside from that minor, unpredictable misstep, this is an eye-opening and informative documentation of the Democratic party's cultural and political movements from the perspective of one of its major groups, and definitely worth the read."}, {"userName": "Terry Chartier", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/1515217-terry-chartier", "userReview": "Understanding Racial History in the Democratic PartyI chose a 5 star rating for a few reasons:1--Joy-AnnReid's show AM JOY is one of the most informative and educational shows I watch, and the book is a great supplement.2--In it's entirety, Reid dives into the divisions that plague the nation as a whole and within the Democratic Party3--Voters, some, grapple with change and change is not easy, especially when America elected the first black President.4--President Obama fought challenges within the party, outside the party and within himselfIf you enjoy reading about party history and how complex issues really are--this book is for you.Good read before the Election."}, {"userName": "Marie desJardins", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/3892251-marie-desjardins", "userReview": "I saw Joy-Ann Reid speak, and was super inspired and excited to buy the book. Unfortunately, while the book does have some insights, it is mostly a dry and overly detailed recitation of dates, facts, and places. The amount of detail just overwhelmed me and I couldn't get a sense of a broader message, if there was one."}, {"userName": "Elaine", "userReviewDate": "Dec 11, 2017", "userURL": "http://www.goodreads.com/user/show/72659719-elaine", "userReview": "An insightful examination of the Democratic party’s relationship with race, Obama’s balancing act and the Clinton machine. Though it was written prior to the 2016 election, it may be even more relevant."}, {"userName": "Robin Case", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/43033920-robin-case", "userReview": "Better a writer than a tele journalist. Not a bad read. What I liked was that the writer has dropped the elitism, also the longer format seems to allow the author to expand on facts and make cogent points."}, {"userName": "Dawn", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/64909319-dawn", "userReview": "I wanted to love the audiobook but I found it a bit boring, lacking emotion; which surprised me since Joy Reid narrated it herself and I'm a big fan of hers. It took a lot of stopping and starting to finish this one."}], "description": "Barack Obama's speech on the Edmund Pettus Bridge to mark the fiftieth anniversary of the Selma to Montgomery marches should have represented the culmination of Martin Luther King Jr.'s dream of racial unity. Yet, in Fracture, MSNBC national correspondent Joy-Ann Reid shows that, despite the progress we have made, we are still a nation divided—as seen recently in headline-making tragedies such as the killing of Trayvon Martin and the uprisings in Ferguson and Baltimore.With President Obama's election, Americans expected an open dialogue about race but instead discovered the irony of an African American president who seemed hamstrung when addressing racial matters, leaving many of his supporters disillusioned and his political enemies sharpening their knives. To understand why that is so, Reid examines the complicated relationship between Barack Obama and Bill and Hillary Clinton, and how their varied approaches to the race issue parallel the challenges facing the Democratic party itself: the disparate parts of its base and the whirl of shifting allegiances among its power players—and how this shapes the party and its hopes of retaining the White House.Fracture traces the party's makeup and character regarding race from the civil rights days to the Obama presidency. Filled with key political players such as Shirley Chisholm, Jesse Jackson, John Lewis, and Al Sharpton, it provides historical context while addressing questions arising as we head into the next national election: Will Hillary Clinton's campaign represent an embrace of Obama's legacy or a repudiation of it? How is Hillary Clinton's stand on race both similar to and different from Obama's, or from her husband's? How do minorities view Mrs. Clinton, and will they line up in huge numbers to support her—and what will happen if they don't?Veteran reporter Joy-Ann Reid investigates these questions and more, offering breaking news, fresh insight, and experienced insider analysis, mixed with fascinating behind-the-scenes drama, to illuminate three of the most important figures in modern political history, and how race can affect the crucial 2016 election and the future of America itself.", "title": "Fracture: Barack Obama, the Clintons, and the Racial Divide", "url": "http://www.goodreads.com/book/show/28448152-fracture", "average": 4.05, "cover": "https://images.gr-assets.com/books/1465643037l/28448152.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/7273674.Joy_Ann_Reid", "name": "Joy-Ann Reid"}], "type": ["Politics", "Nonfiction", "History", "Race", "North American Hi..."], "outlinks": ["http://www.goodreads.com/book/show/28448152-fracture", "http://www.goodreads.com/book/show/18599818-fracture", "http://www.goodreads.com/book/show/25839765-fracture", "http://www.goodreads.com/book/show/18505824-fracture", "http://www.goodreads.com/book/show/22834123-fracture", "http://www.goodreads.com/book/show/40221514-surviving-trump-cd", "http://www.goodreads.com/book/show/39808797-surviving-trump", "http://www.goodreads.com/book/show/31848301-we-are-the-change-we-seek", "http://www.goodreads.com/book/show/35430117-he-never-came-home"]}