{"ratings": 6365, "userreviews": [{"userName": "Dan Schwent", "userReviewDate": "Jul 24, 2009", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "Arthur Bryant and John May are parters in the PCU and have been for over sixty years. That's Peculiar Crimes Division. At least they were, until a bomb goes off and ends their partnership. While May copes with his loss and tries to piece together what happened to Arthur, he thinks about their first case and how the two events may be related.I never thought I'd enjoy a book about the partnership of two crotchedy British detectives so much. The primary setting, a old theatre during the WWII bombing of London, was well done. Bryant and May are contrasting characters ala Mulder and Scully of the X-Files, except British and both male. Bryant tends to go off on tangents and the straight-laced May has to reign him in. The supporting PCU members are also well done. Forthright and Biddle are good characters in their own right.While the present day case was solveable, the WWII one wasn't, although I can't complain. The lead up to the reveal was strewn with red herrings.If you like crime stories and your sense of humor tingles with delight at the thought of two eighty year old men discussing their sex drives on page 10, give this one a chance. You could do a lot worse."}, {"userName": "Brenda", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "This book was a tedious read for me. The plot got too bogged down with descriptions in hope of building an atmosphere. London during the Blitz was interesting, but the interior of the theatre was not. The investigators Arthur Bryant and John May didn’t connect with me, whether it was in 1940 when they were aged 19 and 22 or in 2003 when they were in their 80's. The secondary characters, especially those in the theatre, just made me sad. I reviewed the first few pages of the second book in the series. The writer's style continues, so I won’t pursue the series any further."}, {"userName": "Susan", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/5837456-susan", "userReview": "This is the first of the series featuring Arthur Bryant and John May, of the Peculiar Crimes Unit in London. The book begins in the present, with an explosion in the offices, and Arthur Bryant inside. The Unit opened in 1939 and, recently, May was aware that Bryant had been writing his memoirs and writing up his first case. This leads him to try to track down who was responsible for the destruction of the office, as well as coming to terms with losing his partner.In this book, we are taken back to the blitz and Bryant and May’s first case; a series of strange deaths in a London theatre. Although the book switches from the present to the past, most of the book is set in 1940 London and the author obviously has a great deal of love for both London and an eye for detail. There is a lot of background information about the theatre, and a real sense of menace and danger in the darkened theatre, as well as the fact that London, and our heroes, are trying to do their jobs while London is being mercilessly bombed. This is a series that I have meant to try for a long time and I am pleased that I finally got around to trying it. I liked the wartime setting and, although I found the plot a little unrealistic (well, it is meant to be the ‘Peculiar Crimes Unit’ I suppose), I did really like the characters. I would certainly read the next in the series and suspect that the books will get better, once it has settled down. Rated 3.5 stars."}, {"userName": "Kemper", "userReviewDate": "Nov 04, 2009", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "A mysterious phantom haunts a creepy old theater in an apparent attempt to scare the performers and keep the latest production from starting. Does that sound like a Scooby Doo episode, or is it just me? “I’d have gotten away with it if it wasn’t for you meddling kids!” Or in this case, meddling English detectives instead of talking dogs and damn dirty hippies.Actually, this was a pretty dark and well done mystery with an intriguing concept and structure. Arthur Bryant and John May have been detectives for London’s Peculiar Crime Unit for over 60 years. However, when Bryant is killed in a bomb blast that destroys their offices, the clues May follows indicate that Bryant was looking into their first case together. In 1940, a string of grisly and bizarre murders are occurring in a theater getting ready to launch a controversial production. Since the rest of England is slightly busy dealing with the Blitz and the imminent invasion of the island by Germany, the case is pawned off onto the PCU and its understaffed group of under aged and inexperienced detectives. Brilliant but eccentric Bryant thinks that normal police methods won’t solve the crime while the more practical May tries to keep Bryant from venturing too far away from plausible explanations. In the present day, elderly John May tries to solve the murder of his friend.The parallel stories of Bryant and May in 1940, and May’s investigation in the present was a great idea. And setting a murder mystery against the London Blitz is another terrific concept. More than one person notes that it seems slightly ridiculous to worry about a couple of murders when hundreds are being killed every night. But the British government wants a sense of calm and normalcy so it still frowns on someone offing their citizens. Even if they are just actors…A good mystery with a dark sense of humor and an original setting, this was a fun read. My only real complaint is that as a native of Kansas City, the name Arthur Bryant is the name of a barbecue legend, restaurant and sauce here. So every time I read the name in this book, I instantly craved some beef brisket. And now I am HUNGRY!"}, {"userName": "Ellie", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/2908629-ellie", "userReview": "I think my love for this series was summed up in a phrase of one of the characters portrayed by author Christopher Fowler: \"Everyone wants the things that remind them of childhood. I just re-imagine them with the materials of the present.\" Full Dark House captures my favorite aspects of my \"childhood\" mysteries-Sherlock Holmes and Agatha Christie, especially come to mind, dressed up in very contemporary dark humor and time manipulation.Although not the first I've read, Full Dark House is the first in Fowler's Bryant and May detective series. Bryant and May are two elderly detectives-one charming, one not-who head London's \"Peculiar Crime Units\" and Full Dark House tells the story of their first case in flashback. The book begins with the bombing of the theater which was the site of their first case and the killing of Bryant. As his partner and friend tries to solve the mystery of the current day bombing, he is forced to relieve and rethink their first case.Although it dragged at some points, on the whole, Full Dark House (a reference to the theatrical production that is its setting) is a lovely and satisfying read."}, {"userName": "Nancy Oakes", "userReviewDate": "Dec 21, 2008", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "If I had to classify this novel in terms of genre, it would be somewhere along the lines of British police procedural meets the X-files. I was thinking while I was reading this that it would make a fun movie, but I countered that thought with the knowledge that some screenwriter would just screw it up, so better to leave it in book format. What a cool book! I originally bought this book in mass market paperback format eons ago, but never got around to reading it until I saw the same book in trade paper size (which I really prefer), and I pounced on it. I picked it up last night and didn't look back until I finished it this morning. If that's not a recommendation, I don't know what is.brief summary; no spoilers here: Arthur Bryant, a most eccentric partner in detection of John May, was revisiting the pair's first case together some 60 years later, and the lab he was working was blown to kingdom come, taking Bryant with it. John May, of course, whose friendship with Bryant has lasted throughout their career as detectives in the Peculiar Crimes Unit (started during the Blitz in London), is devastated, and realizes that to solve the case of Bryant's death, he has to go back in time to re-examine their first case, since that was what Bryant was working on. It turns out that this case involved a very bizarre production of Orpheus in the Underworld, complete with can-can and high French knickers by the dancers at the end. They were assigned to the case when a pair of feet were discovered on the charcoal brazier of a Turkish street vendor - leading them to the death of a dancer in the theater staging the production. After that, the show was plagued with problems that required special assistance from the Peculiar Crimes Unit -- for example, a medium whose cat channeled the spirit of a dead pilot, along with other, shall we say, more unorthodox methodologies of crime solving. But back to the future: May will not rest until he solves Bryant's death, so he tries to put the missing pieces together to do so. The book weaves both past and present together to get to the root of the modern-day tragedy, and does it well by examining the original case back at the time of the Blitz. The characters, however, make this novel what it is. Bryant and May are very well suited to each other, and the rest of the characters are not droll toadies relegated to the background, but have lives of their own here. I'm very big on the use of place & setting as a character of its own within a novel, and here Fowler has done that -- the darkness of blacked-out London during the bombings has its own personality. Fowler's descriptions of how people coped and how society worked during the Blitz was also very well done.I'd definitely recommend this book to anyone who likes British mysteries, and to people who like mystery spiced with a bit of the fantastic & paranormal, but done so in a way that doesn't turn silly and take you off on ridiculous tangents. I already know I'm going to really enjoy this series and can't wait to get to the others."}, {"userName": "Sara", "userReviewDate": "Dec 12, 2008", "userURL": "http://www.goodreads.com/user/show/1761558-sara", "userReview": "There were two quotes on the back of the paperback copy of Full Dark House  I picked up that caught my attention: \"A madcap mystery...\" and \"How many locked-room puzzles can the duo unlock...\" My kind of book; or so I thought.Not only is there no locked room (the detectives took another character's word for it on that one) it wasn't terribly madcap either. Nor was the plot original; yes, folks, it's another \"reinterpretation\" of that famous Gaston Leroux novel, The Phantom of the Opera. I do like the characters of Arthur Bryant and John May and found Fowler's style very readable and his prose well crafted but not enough to push my rating above two stars."}, {"userName": "Liz", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/1859191-liz", "userReview": "I hate to cheat, but I may just cut to the end. Have you ever felt annoyed with a book for wasting your time? This is one of those books. But don't take my word for it - lots of positive comments on mystery forum. Other readers enjoy the history (ww2 Britain) and humor. I enjoy history too, but it if it isn't delivered in a compelling style it doesn't make the book worthwhile. And the humor, well, if quirky, cranky & British make characters fun for you, read this book. I need a really good story myself."}, {"userName": "Andy", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/18810398-andy", "userReview": "It starts in modern day & left me with a Hmmmm as the text talks of a wartime mystery/crime to solve, there’s also a reveal which further unravels the series.....Then we’re back into the past & in London theatreland at the height of the blitz, a whole host of characters are thrown at the unsuspecting reader all with the tag of “potential murder” hanging over them leaving me totally flummoxed, situation normal then!Murders, missing people, suspects multiple, clairvoyants, spiritual “stuff”, introduction to the peculiar crimes unit to give you but a flavour all revolving around an opening show in the west end.A decent start to a series I’d say as it grew on me & a fair story which will leave you grasping at straws when it comes to guessing the murderer..... not a Scooby here.... nowhere near close....3.5 stars for me as it’s a bit of a bumpy ride at the start, rounded up to 4 as I always do for debut reads"}, {"userName": "Roger Brunyate", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/42294189-roger-brunyate", "userReview": "Feet on the ground… or not?\nIt really was a hell of a blast. The explosion occurred at daybreak on the second Tuesday morning of September, its shock waves rippling through the beer-stained streets of Mornington Crescent. It detonated car alarms, hurled house bricks across the street, blew a chimney stack forty feet into the sky, ruptured the eardrums of several tramps, denuded over two dozen pigeons, catapulted a surprised ginger tom through the window of a kebab shop and fired several roofing tiles into the forehead of the Pope, who was featured on a poster for condoms opposite the tube station.\nIt's certainly a brilliant opening. A bomb in modern London kills Arthur Bryant, the octogenarian senior partner in the detective team of Bryant and May (yes, like the English matches), bringing to an end their six-decade association in the Peculiar Crimes Unit. And this takes the surviving partner, John May, back to their first case together, a series of grisly murders in London’s Palace Theatre during the worst year of the Blitz. Unusually for the first book in a long series, author Christopher Fowler sets out to solve the first crime—and the last.The Goodreads friend who recommended this series praised Fowler for his uncanny knowledge of London then and now, and his ability to take the reader into strange corners and situations. And my friend is absolutely right; Fowler knows the city, and has his feet on its ground; he is at his best when he keeps them there. His descriptions of wartime London ring totally true, and I found myself trusting him, especially in the earlier period.I also had hopes for the setting. The Palace is a real theater, home to many of the big musicals such as Les Misérables, The Sound of Music when I was young, and many famous names before and since. In the novel, they are rehearsing an elaborate and somewhat risqué revival of Offenbach’s Orpheus in the Underworld. A light opera, certainly, but still opera, and thus in my professional world as an opera director; I should have been in my element. Fowler is excellent at describing the physical building, and he has fun with many of the personalities, such as the domineering director:\nHelena Parole had a handshake like a pair of mole grips and a smile so false she could have stood for Parliament. 'Thank you so much for taking the time to come down and see us,' she told May, as though she had requested his attendance for an audition. Her vocal cords had been gymnastically regraded to dramatize her speech, so that her every remark emerged as a declaration. May felt the hairs on the back of his neck bristle with resentment.\nHowever, I came to realize that my professional knowledge made me less, not more, suited as a reader. There was too much that was not quite right. Like so many detective writers, Fowler seems engaged in building up a cast of colorful characters, and treats the inbred nature of the theater world as license to take this even farther, creating types rather than working professionals, regular human beings. And when the story began to hint at elements of the supernatural, in the manner of Phantom of the Opera, or international conspiracies in the manner of Dan Brown, I felt Fowler was losing his best quality, the ability to keep his feet on solid ground. A little over halfway through, I suddenly asked myself, \"Do I care to know who has committed these murders, or what happens to all these people?\" And the answer was that I didn’t, so I stopped."}, {"userName": "Veronica ", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/7035111-veronica", "userReview": "There was too much that was vague about this story for me to rate it any higher. The chapters shift between the present (the book was published in 2003) when Arthur Bryant and John May are both in their eighties and 1940 when they're working their first case together as members of the Peculiar Crimes Unit. The problem is that, when it comes to the relationships and the investigation of multiple murders, there is too much telling and not enough showing. For the investigation things are suddenly announced as fact and we're told that the information was discovered and/or relayed to others off the page, thus denying the reader the chance to discover clues along with the characters. For the relationships, well the most important one is the 60+ year friendship between Bryant and May but when we first meet them in the 1940 flashback chapters we're never really given any solid foundation for why May inherently trusts Bryant's instincts or why Bryant feels so despondent that May doesn't have faith in him...after only three days of knowing each other (and if you're wondering about the seeming contradiction in that, there is plenty of stuff like that in the book too). It's not like we're shown them having deep, personal conversations or surviving a tragedy together. They felt more like the cliff notes to friendship. The cover was nice as was Bryant's sense of humor but, unfortunately, neither really translates into further reading of this series."}, {"userName": "Marwan", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/49765318-marwan", "userReview": "Well, this Crime Fiction was better than I thought it'd be, I'd give it 5 stars if it wasn't too long and too detailed. But it's to be expected since it's a historical fiction also. The novel is the first in the series that revolves around the adventures of Arthur Bryant and John May in the peculiar crime squad unit. It focus on the first case they worked on together during the world war 2. It's about a series of murders that occurs in the Palace theater, a murderer who moves swiftly and mange to get way easily like a phantom (Phantom of the Opera XD). They manged to solve the case and the murderer was assumed to be killed during the pursuit. However, 60 years later, when a bomb obliterates the peculiar crime unit building and Arthur Bryant was the only one in the building. John May suspects something is wrong, further digging reveals that Arthur was re-investigating their first case, and the killer might be still alive after all. It's up to John to find the truth and avenge his old friend and partner.The story keeps swapping between the past and present which what I like most about. Arthur Bryant is an interesting character, and \"as John May described him\" a fun person to be around."}, {"userName": "LJ", "userReviewDate": "Aug 27, 2007", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "FULL DARK HOUSE (Police Procedural-London-Cont/WWII) – G+Fowler, Christopher – 1st of seriesBantam Books, 2003- HardcoverWhen a present day bombing of the Peculiar Crimes Unit kills elderly detective Arthur Bryant, his partner, John May looks to their first case for clues as to why.*** What an interesting use of contrasts. Fowler brings to life 1940s London during the Blitz offset by the Millennium Eye; the chaos of the streets during the Blitz and the insularity of a theatre; traditional police procedure versus use of a medium; a difficult, quirky detective offset by a personable classic investigator. I felt the plot was overly complex and the story slow at times, but I was held in the story by the strong writing, humor, and the relationship between the two protagonists. I look forward to reading the next book in this series."}, {"userName": "Lois Bujold", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/7672661-lois-bujold", "userReview": "Well, hm.This book was recced to me for humor, which turns out not to be quite the case -- more irony and dark wit. Too dark for my current reading needs, which took it down a star subjectively, but well written, which added a star objectively. Quirky and eccentric without being cozy.Written in omniscient, with parallel tales taking place in two times -- Detectives Bryant and May's first case, occurring during the London Blitz, and their last, in the early 21st Century. The omniscient voice allows some interesting effects as the tale not only alternates eras q.s. by chapter units, but adds illuminating asides in lines and paragraphs jumping back and forth in time summing up assorted bits of intervening information which helps stitch the parts together. Which a writer can do in omniscient, but not in tight third. While I find omniscient more emotionally distancing than tight third, no question one can get good breadth out of it, properly handled.Someone is knocking off cast members of a lurid production of the operetta Orpheus while German bombs fall on London, and the newbie detectives must pursue justice for the few inside the labyrinthine building while thousands are dying outside; this part is a pretty good historical novel, among other things. 60 years later, something from that first case comes back to haunt the aged pair.For whatever reason, I seem to be running across a slew of recent British works that appear to want to recapture an older generation, or something from it that is now missed -- not only this, but the TV series New Tricks, and the character of Detective Inspector Nightingale from Ben Aaronovitch's Rivers of London series. Is this a Thing in Britain at the moment? Or just an artifact of my own selections?The tale starts dark and gets darker, but lightens up toward the end, rewarding the persistent reader. The grimdark almost lost me about a third through, but I peeked at the end for reassurance that I was not to be perpetually punished for my reading efforts, and slogged on. Destroyed the puzzle aspect of the tale, a disservice I suppose, but I don't read mysteries for the puzzles, but rather, for the characters and sometimes settings, which here held my interest fairly well. I might follow up sometime just to see what the writer does with this setup.Ta, L."}, {"userName": "Andrew", "userReviewDate": "May 15, 2016", "userURL": "http://www.goodreads.com/user/show/800291-andrew", "userReview": "Ah I have finally finished it - I will have to hold my hand up and apologise this book took far too long to read and that should in no way reflect on the quality of the story or abilities of Christopher Fowler - nope this one sits with me. A mixture of bad timing (I was reading it as I was preparing to head to the US on business) and the fact I am shallow and was easily distracted by other books to read at the same time.But what of the book! Well this if I remember correctly (go on correct me) was the start of the official series of Bryant and May of the Peculiar Crime squad. Now this is not to say the first time we have seen them in print (or in fact I have read them in print) they have appeared in earlier works but they never quite satisfied Mr Fowler. So to correct this he decided to start again - re-writing and tidying up their history and in the case of the book The Darkest Day totally rewriting the book itself. So here we have their first case - and without giving away spoilers it does an excellent job of telling us of their first case together and what appears to be their last. It introduces us to London during the blitz and to London in general. Now I have said many times that I do love an authentic London based story and Christopher Fowler cannot get more authentic (its not about snobbery I just hate seeing locations I have visited and wander around poorly represented). It also prepares us for the relationship that comes from working together for so long together, the banter the thought processes and the camaraderie that has developed because of it.The series is as far as I can see still going strong with new titles being added to it all the time. And for me there is still the hint of the fantastical (the White Witch of London?) as well as sheer detective work and drama. Christopher Fowler has the ability of turning his hand to many genres and I have still to find one he has failed at. I look forward to reading the next in the series although I will make sure its a little more stable in my reading times."}, {"userName": "Jan C", "userReviewDate": "May 21, 2011", "userURL": "http://www.goodreads.com/user/show/1855321-jan-c", "userReview": "Excellent. I can't wait for #2 - once I find out what it is.I was stumped.It was kind of confusing though - always jumping backwards and forwards through time. One place we are in the '40s and then the next thing you know, we are back in the present day. Admittedly both cases did tie together but it took me a little bit grasping that we were no longer in the same time zone.Sorry time traveler lovers - this is not \"time travel\" but just two stories in two different decades taking place within the confines of one book."}, {"userName": "Kathy Davie", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/4222001-kathy-davie", "userReview": "First in the Bryant and May Peculiar Crimes Unit historical mystery series and revolving around a pair of detectives who, thankfully, balance each other, and which flips between 1940 and 2000 in London.In 2004, Full Dark House won the British Fantasy Award for Best Novel and was nominated for the Barry Award for Best British Crime Novel.My TakeIt’s a peculiar start with the death of one of the main characters. In between, there are some flamboyant theatrical deaths…shades of Phantom of the Opera(!)…and a contradictory partnership of the offputting Bryant and the more level, realistic, and diplomatic May.It’s that theatre case in 1940 that finds Arthur going off the deep end and is connected to the event of Arthur’s death which allows May to reminisce about past cases — a brilliant way of dumping information on us. It’s also a great way to introduce Bryant’s fascination with the occult and his fantastic imagination.The “time travel” can be a touch confusing as Fowler flips back and forth between today’s investigation into Bryant’s death to May’s introspection about their first case together at the Palace Theatre, the progression of which causes Bryant to compare the PCU to Orpheus, “rushing headlong into the light of a terrible new world”.You’ll learn some interesting tidbits about how Londoners coped with the blitz, such as leaving your white shirttail hanging out when on a bike, so motorists can see you during a blackout, sandbag substitutes, the concern for morale, and the food shortage problems. For the prurient, Fowler explains the “excitement” of the cancan, lol. What he calls “a real trouser rouser”…*laughing*… Fowler also has a lovely explanation of what’s behind the thinking on Offenbach’s Orpheus. Makes me want to the original tale and the opera myself.Fowler helps create a more fearful atmosphere with the terrible situation for the theatrical people: the fear of the bombings combined with the fear of who is killing them off.It’s complex and twisting and found me re-reading sections to get the gist, but very well worth reading. You will CRACK up when you get to the end. It’s so Bryant, ROFL. To call Bryant eccentric is to lowball the guy. He’s a danger to technology and stuffed shirts.Hmm, Fowler never does explain that flute note.I’m eager to see how Fowler continues in \nThe Water Room\n since we’ve had the beginning and the (possible) end already.The StoryA bomb rips through present-day London, tragically ending the crime-fighting partnership of Arthur Bryant and John May begun more than a half-century ago during another infamous bombing: the Blitz of World War II.Desperately searching for clues to the saboteur’s identity, May finds the notes his old friend kept of their very first case and a past that may have returned…with murderous vengeance.It was an investigation that began with the grisly murder of a pretty young dancer. In a city shaken by war, a faceless killer stalked London’s theatre row, creating his own sinister drama. And it would take Bryant’s unorthodox techniques and May’s dogged police work to catch a fiend whose ability to escape detection seemed almost supernatural — a murderer who decades later may have returned to kill one of them…and won’t stop until he kills the other.The CharactersBryant and May can be found in both times.\nSeptember 2000 London\nDetective Arthur Bryant died in a bomb blast that took out the office. Just as he and May were about to retire. His partner, Detective John May, is the level-headed one. Detective Sergeant Janice Longbright has just retired. Liberty DuCaine is part of the forensic unit. (His brother’s name is Fraternity.) Sam Biddle is Sidney’s grandson and is the new liaison officer between the Peculiar Unit and the Home Office. Dr. Oswald Finch is the now-retired forensic pathologist. Raymond Land is the new unforgiving head of the Unit.April is May’s agoraphobic granddaughter; Daphne is May's current girlfriend. Hmm, a granddaughter means the player got married at some point… Alma Sorrowbridge is Bryant’s West Indian landlady.Dr. Leigh is at the Wetherby, a clinic for patients suffering from senile dementia. R. and Maurice Mamoulian have a dog, Beaumont, and they’re May’s neighbors. Stanhope Beaufort has a practical, ahem, perspective on architecture. I loved his explanation of architecture versus his own comfort. Maggie Armitrage is a spiritualist and one of a very few left in the Coven of St. James the Elder along with Neema; Olive can’t handle the stairs anymore. Do pay attention to Maggie’s predictions. You’ll be surprised.\nNovember 11, 1940 London\nThe North London Peculiar Crimes Unit is……a new organization intended to handle controversial cases that could affect the country’s morale, but more especially the cases the regular force can’t handle — the embarrassing ones. Sidney Biddle is the officious, by-the-book spy planted on Bryant by their boss, Superintendent Farley Davenport, who is completely against the Peculiar Crimes Unit. Arthur Bryant (he has a dicky heart) and firmly believes in outside-the-box thinking, an iconoclast, with a true belief in the paranormal. I suspect it’s partly why he has such a difficult time with the opposite sex. Not a problem that May has. The eighteen-year-old Nathalie was the love of Bryant’s life.”A Holborn judge … refused to hear any more from the unit’s witnesses until Bryant could assure him that they were all technically alive and in human form.”John May had codebreaking training and this is his first day on the job; he’s the diplomat who keeps a rein on Bryant’s more excessive imaginings. Detective Sergeant Gladys Forthright (one of the first female ones thanks to the war) is engaged to Sergeant Harris Longbright; she’s also part time with the WVS. Dr. Runcorn is their ancient forensics pathologist; Dr. Finch is the new guy. Police Constables Crowhurst and Atherton are the rest of the staff. “Nasty-Basket” Carfax is the disapproving desk sergeant who’s married to Davenport’s sister.The Palace Theatre, Cambridge Circus ……is one of the great theatres and makes a rabbit warren seem organized. Elspeth Wynter is the front-of-house manager. Her father “died … during a trouser-dropping farce in which he had already been dying nightly\". Todd is her son. Mr. Cruickshank is the archivist. Helena Parole is the artistic director; Benjamin Woolf is an agent and Helena’s former husband. Harry Cowper is Helena’s assistant and keeps the peace. Nijinsky is the house tortoise. Stan Lowe is the stage doorkeeper; Mouse is his assistant. Geoffrey Whittaker is the stage manager. Madeline Penn is on loan from RADA and the assistant stage manager. Anton Varisich is the conductor. Olivia Thwaite is the costume designer. Mr. Mack is the head carpenter. Raymond Carrington is the lighting chief.Tanya Capistrania is an upstaging dancer, and she’s been gettin’ busy with Whittaker and Cumberland. Her father, Albert Friedrich Capistrania, will be at the Austrian ambassador’s house. Eve Noriac is playing the title role of Eurydice, and the much-loved Charles Senechal is an Anglo-French baritone playing Jupiter; both are on loan from the Lyon Opera House. Corinne Betts is the comedienne playing Mercury. Miles Stone is the star playing Orpheus. I love that bit about Miles’ agent referring to him as “the Millstone”, lol. Betty Trammel, Jan Petrovic  (Phyllis is her worried roommate), and Sally-Ann are some of the chorus girls. The high-strung Valerie Marchmont plays Public Opinion. David Cumberland plays John Styx. Barbara Darvell plays Jupiter’s wife; her son, Zachary, and his friend Larry are in the balcony watching the rehearsal.”Real stars make you believe in them because they believe in themselves.”The Three Hundred International Banks is……a financial group backing the production with Andreas Renalda, a Greek shipping magnate, who is the chairman. Sirius was his father; Diana his mother; and, Minos was his five-years-older brother who was passed over to inherit the business. Elissa was Andreas’ wife. Euterpe is the Muse of lyric poetry.The more, ahem, spiritual side includes……Edna Wagstaff is a medium who uses stuffed cats but only Rothschild is left. Her spirit guide was Squadron Leader Smethwick. She lost her son, Billy, at Dunkirk and her daughter is in the WRNS. Bryant has friends in the Camden Town Coven, the Southwark Supernaturals, the Prometheus League, the Mystic Savoyards, the Insomnia Squad, and a large assortment of paranormalists, idiot savants, primitives, mind-readers, and madmen. The ghosts include “Man in Grey”, John Buckstone…and Arthur?Rachel Saperstein is Miles’ mother, and not too happy about his name change nor his divorce from the “lovely” Becky. Seamus is the milkman. Peregrine Summerfield is a journalist friend of Bryant’s who wrote an exposé on the Renaldas that got squashed. The Band of Hope is a temperance group. The Archbishop of Canterbury “says they’re all going to Hell” while Bryant claims he only says that when he finds out people are enjoying something. Gilbert Riley is a snoopy critic.The Cover and TitleThe cover is quite peculiar with its pale yellow background rough edged in a scribble of a darker orangey yellow. The title and author’s name are in a deep chocolate brown. But it’s the graphic in the lower center that really grabs the eye with its old-fashioned green steamer trunk with drawers on one side and a curtained-off space on the other. Circling around it are icons representing events in the story from guns to grenades, a British flag waving as bombs drop, a tragedy mask for the theatrical shenanigans, and one swirling plant…that Bryant…!The title encapsulates the murders at the theatre, as it results in a Full Dark House."}, {"userName": "Melissa", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/287912-melissa", "userReview": "\"'I hope violence won't be necessary. We're the police, we don't thump people.'\" Ah yes, those were the days. It's an interesting choice for Fowler to begin his book about a partnership of detectives at the tail ends of their lives and possibly their said partnership. All of the bits set in the present day never really clicked for me, suffering in comparison to Bryant and May's investigation of a series of murders in a theater before and during the staging of a play against the backdrop of the horrors of the Blitz. There's just so much potential in this, but the funny bits concur very uneasily with all of the murdering in a way that reminds me a lot of the first Maggie Hope mystery, where people where bantering & bickering humorously in one scene & then someone was getting tortured with a hot poker in the next. Also, the killer reveal is flat out ridiculous. Color me a total sucker for detectives + magic, so I am making an even more curious choice to continue with this series even though I mostly disliked this book, so here's to the realization of potential."}, {"userName": "Chris", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/99747-chris", "userReview": "You're either going to love or loathe this book about a British detective in his 80s who finds himself revisiting the first case he worked on (60 years ago) with his partner in the Peculiar Crimes Unit. Be warned that this is not a fast-paced book and it is, unsurprisingly, filled with flashbacks. Flashbacks usually drive me crazy, but I was ok with them in this book."}, {"userName": "Chuck", "userReviewDate": "Aug 13, 2008", "userURL": "http://www.goodreads.com/user/show/1425395-chuck", "userReview": "Christopher Fowler introduces you to Arthur Bryant and John May, lead detectives of London's Peculiar Crimes Unit in this first of a great series! While the PCU specializes in using unusual methods to solve their anything but routine cases, to simply call Bryant and May off-beat would be unfair. Fowler uses clever plots, dark humor, and a memorable supporting cast to tell his stories. The fact that Bthe main characters have been at their jobs since the early 1940s, putting both comfortably in their 80s, only adds to the charm. The author is clearly very fond of London and the City is as much a character as the detectives themselves. My wife and I recently traveled to the UK and we were able to visit many of the settings used in the series, including a memorable sunset at Waterloo Bridge. If you go, you'll get an understanding why it's such a frequent location in the books."}, {"userName": "Josen", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/3660423-josen", "userReview": "3.5...........This was a fun mystery that took place during WWII in London. The investigation was headed by two detectives, Bryant and May, of the Peculiar Crimes Unit. \"They meant peculiar in the sense of particular, but the damage is done.....\". What I liked most about this story was the camaraderie and humor between the partners. There were quite a few places that gave me a good laugh. I could totally picture these two playing off each other like a good buddy movie. This is the first in a series of Bryant and May stories so I think I'd like to see how their friendship grows amidst their peculiar cases."}, {"userName": "James", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/3301814-james", "userReview": "Has just that little bit of cleverness, humour, and originality that goes such a long way in a crime series. Also a genuinely skin crawling moment to cherish."}, {"userName": "Mark", "userReviewDate": "Aug 18, 2012", "userURL": "http://www.goodreads.com/user/show/554401-mark", "userReview": "It takes a lot of skill, if not a lot of nerve, for an author to set up a book seemingly about the exploits of a crime detective duo and apparently kill one of them off on the first page.But that’s what happens here. In present day London, an incendiary device is set off in the office of London Metropolitan Police’s Peculiar Crimes Unit, which not only destroys their police files but kills Arthur Bryant, one half of a detective double, Bryant and May. The surviving detective John May is now on the hunt for a cop killer. Whilst investigating, May becomes convinced that the killer is connected to the two’s first case together, one that began in London’s Blitz of the 1940’s.Much of the book then goes back to that time to give details of the case: a strange one, involving a footless dancer’s body, a death by globe and a faceless man running around a theatre in a Blitz-damaged London, before May can deduce any connection between the past and the present.Though I’ve seen this series around for a while now (and as I type we’re about to get Book 10 in the series) I must admit that, frankly, it’s passed me by.Really, I should have known better. It’s a witty, clever little book, written with panache and humour, whilst using Christopher’s horror origins to throw in the odd little shock as we veer slightly into Twilight Zone or X-Files territory. The characters are great (although a little rude in places, so they might shock your typical crime fan) and the setting, both in the past and the present, wholly immersive. The suspects all appear as identifiable as in a game of Cluedo or an Agatha Christie novel, and it’s great fun trying to work out whodunnit. The details of their first case together for the Peculiar Crimes Squad, set in 1940’s Blitz-hit London are wonderfully well written. As richly detailed as Connie Willis’s recent Blackout/All Clear, there’s a palpable sense of being in the city whilst there’s rationing and a war on. With none of the technical gubbins of today’s detectives, Bryant and May have to use good, old-fashioned deduction to make their conclusions work. A knowledge of Ancient Greek mythology is quite useful here. That, and a little understanding of the occult that wouldn’t go amiss from a pulp-fiction 1930’s tale. The overall feeling at the end of this one is that it is a combination of a traditional British crime thriller with a touch of the Phantom of the Opera about it. As the deaths continue at the London theatre, the cause seems almost supernatural. Christopher, showing his Horror origins, can’t resist some quite gory deaths along the way.I’m sure some readers will be struck by how such tales have recently struck a popular chord. Treading similar ground (or is that a policeman’s beat?) to Ben Aaronovitch’s recent Rivers of London/Peter Grant novels, I must say that as much as I enjoyed Ben’s first novel, I enjoyed this one much, much more. Full Dark House is a more subtle tale, cleverer in its plot twists, sexier and more stylish, although less genre related, perhaps. Full Dark House is not a book that tries to repeatedly show the reader explicitly how clever it is: it just is, and it is up to the reader to find the clues out. As ‘whodunnits’ go, this is a classy effort. The little touches, as literary Easter Eggs, kept me amused throughout: Bryant and May are the brand name for a British box of matches, for example.For people wanting to read something in my opinion as good, if not better (and written nearly a decade before) than Ben’s books, this comes very much recommended. Why didn’t readers (including me) notice this one before? This would make a wonderful BBC Television series.I struggled to put this one down. Guess that means I’m a newly converted fan and can’t wait to read more.Nine more to go and find. Bring on the next!"}, {"userName": "Claude", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/4490527-claude", "userReview": "Three and a half stars really. I liked the background (a London theatre during the Blitz), I had a bit of trouble making sure who was who, though! Maybe it was me, or maybe it was the fact that the book constantly shifted between the past and the present. But it was certainly an interesting read, often humorous, and although I tended to mix up Bryant and May, I might get used to them better in a second episode."}, {"userName": "Antonomasia", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/6249204-antonomasia", "userReview": "Starting this series after reading three of Ben Aaronovitch's Peter Grant stories, they're a glaringly obvious comparison: same city, same occupation, same surname shared by main characters - though slightly different occult to police from a shoestring, maverick unit of the Met. Basically, Fowler is a bit more serious - the same recognisably British comic tone hovers under the surface, but never becomes cheeky or flippant, befitting protagonists about sixty years Grant's senior. And as a friend advised, not as much magic: this is something closer to a straight historical procedural. It's also considerably more 'literary' in its writing than the Scandinavian series I've been reading recently.I found Full Dark House deeply atmospheric at the start. Whilst they're young enough to be my oldest grandfather's sons, B&M seem part of, imbued with, ancient strata of London history. Nothing especially mystical is evoked in references, it's something more mysterious in the tone of the writing as it's quite clear that their first case started here, 1940, in a theatre. An evocative world of its own that calls up the spirits of The Red Shoes, An Awfully Big Adventure, Tony Richardson's The Entertainer and every other 50s and 60s film that was unfashionably nostalgic for the lost world of variety. (Phantom of the Opera is the most obvious reference, but due to a childhood dislike of Michael Crawford, I never wanted anything to do with that story in any medium.) Flipping between then and now in short chapters gives a spine tingling, stomach-churning sense of a favourite subject, the passing of time and all of its... What a long way it is from those to a present where B&M's colleagues and successors have the more immediate priority of confiscating Chinese-made assault rifles from the hands of drug addled teenage yardie wannabes.And Fowler understands how even a place as large as London can become fused in one's mind with a personality: \"'I have to get out of London.'Finch understood. Arthur Bryant was virtually a symbol of the city. There were memories of the man and his cases almost everywhere you looked.\"Somehow, gradually, the story doesn't quite live up to the mystique of the setup. Perhaps it's a bit too long and detailed. Perhaps the structure of short chapters - ideal for public transport reading - is disjointed used with a story that's only engrossing when you spend at least half an hour at a time on it. Perhaps it was the disorientating mixture of immersive historical attitude and ill-suited modernity in the Forties' characters. Perhaps it's the 'show don't tell' chestnut as far as character traits are concerned. It plodded at times, people weren't as vivid as they could be. There's unnecessary detail at times; nonetheless I was glad this included a term I've needed for years but didn't know existed: \"the maieutic process ... Socratic midwifery...You know, the easing out of ideas. You help things out of my head, things that were already there but unformed.\" Also learnt that 'Murder in the Red Barn', which I'd always taken to be an entirely original Tom Waits song, must have been inspired by a 1930s British film, in its turn based on a real crime a century earlier.Full Dark House was 100-150 pages too long and sometimes silly in not a very good way. But it could be a whole lot worse. The regular cast-to-be are likeable, despite being drawn a bit clumsily in this first installment."}, {"userName": "Bandit", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "I really thought I would like this more. The premise is great and I'm a fan of Fowler, he does terrific short fiction. But eventually seems like every author falls into a trap of serialized fiction. Fowler did so with Bryant and May, a pair of grumpy old men, formerly slightly less grumpy young men, who work for Peculiar Crime Unit...a british police force for the crimes that are somewhat off the beaten path. The book alternates narratives from present time(semi present, the book came out 2003) and octogenarian versions of the team to the 1940s and young twenty something year old Bryant and May, just starting to work together. Their first case is a version of the phantom of the opera, set in a London theatre, just like Bryant and May themselves are really just a version of Holmes and Watson. Fowler puts a bunch of customized finishes in to make this less of a pastiche or homage and more of the original story, so it makes for a fairly entertaining (if not wholly original) book. There is also a lot of very enjoyable very british humor that really livens up the book. As an audio book for me the narration didn't quite do the trick, which sucks because it seems like they have the same narrator for the entire series. Tim Goodman seems to do a perfectly good job reading the older Bryant and May, but just sounds entirely wrong for the half of the book set in the past, like an old man reading for a 21 year old part. Ideally, there should have maybe been two readers or a more age flexible reader. His women and accents were kinda off too. It remained noticeable and distracting throughout the book. Neat decently executed idea, nothing great, passed the time."}, {"userName": "The Flooze", "userReviewDate": "Feb 18, 2009", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "In a delightfully British mystery, we meet Bryant and May, detectives in the Peculiar Crimes Unit. The story flits back and forth between the Blitz and the present, as May tries to find a correlation between a modern day bombing and the first crime he and Arthur Bryant tackled. Pitching back and forth between two time periods, we learn much of the Unit's beginnings in a war torn climate. A series of murders in a theater contrasts with the numerous deaths surrounding London. While dodging bombs from above, our detectives rely upon each other's strengths and form a balance between the believer and the skeptic, the fanciful and the logical. As much a murder mystery as a tale of friendship, Full Dark House brings to life two very distinct personalities and their journey through the secrets of the dark recesses of the theater. Bryant and May's camaraderie is supported by a cast of amusing characters: the confident female DS, the hard-nosed rules-loving newbie, the humourless forensic tech, some white witches and of course a fierce landlady who happens to be handy with a sword when the need arises. They serve to both bring attention to and validate the mad antics of Arthur Bryant as he solves his case in unorthodox ways. Flashes to the present show how much London (a character unto itself) has changed, as well as the degree to which May's perception of the city has been forever coloured by his partner's influence. All together, Fowler has created a likable cast of characters, as well as an interesting and twisted mystery. An interesting debut to this mystery series that leaves the reader wondering what the next Peculiar crime will bring."}, {"userName": "Lea", "userReviewDate": "Jan 13, 2011", "userURL": "http://www.goodreads.com/user/show/3397530-lea", "userReview": "The first of Christopher Fowler's Bryant & May mysteries (& the first of his books I've read), Full Dark House is one of those wonderful mysteries that lays out all of the clues for you straight from the beginning of the book. It's amusing (& irritating) to look back over the story, putting the pieces all together, realizing that if you'd only been a bit smarter you could have figured the whole thing out yourself.Sadly, I'm NOT that smart. The person I pegged as the murderer . . . wasn't. Damn!I'm not big on recapping stories & plot lines, so I won't bother -- I do recommend this book, though, especially for mystery lovers.I've already bought the entire series currently available in the U.S., & I anticipate many more encounters with Bryant & May."}, {"userName": "Sandy Lenahan", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/26236011-sandy-lenahan", "userReview": "Holy Moses this was a tough one to get through, not a bad one just slow moving and for the first few chapters a little confusing. Told from two different London time lines; the first, November 1940 during the blitz and present day (2003ish) detailing both the beginning and unfortunate end of the 6 decade long working & friendship of Arthur Bryant and John May principle investigators of the London Police forces Peculiar Crimes unit. Fowler's story is as cumbersome as my previous sentence. Vampires, mediums, stuffed cats and a Greek business man walking on steel calipers (in 1940 no less) were some of the strange things tossed into the story for no real apparent reason. The mystery was solid and the writing okay. I just thought it went on to long to slowly."}, {"userName": "Ryan Mishap", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/1058994-ryan-mishap", "userReview": "I simply became bored. Decent characters, intriguing storyline covering two crimes--one during the Blitz and one in modern times--, and not a small measure of witty dialogue. The thing just plods like a, well, Thing from a B-horror movie, never really getting on with it, as they say. Some writers can make the seemingly mundane snap and sparkle, while others can make murderous action seem like an hour in the dentist's office waiting room."}], "description": "Edgy, suspenseful, and darkly comic, here is the first novel in a riveting new mystery series starring two cranky but brilliant old detectives whose lifelong friendship was forged solving crimes for the London Police Department's Peculiar Crimes Unit. In Full Dark House, Christopher Fowler tells the story of both their first and last case—and how along the way the unlikely pair of crime fighters changed the face of detection.A present-day bombing rips through London and claims the life of eighty-year-old detective Arthur Bryant. For his partner John May, it means the end of a partnership that lasted over half-a-century and an eerie echo back to the Blitz of World War II when they first met. Desperately searching for clues to the killer's identity, May finds his old friend's notes of their very first case and becomes convinced that the past has returned...with a killing vengeance.It begins when a dancer in a risque new production of Orpheus in Hell is found without her feet. Suddenly, the young detectives are plunged in a bizarre gothic mystery that will push them to their limits—and beyond. For in a city shaken by war, a faceless killer is stalking London's theaters, creating his own kind of sinister drama. And it will take Arthur Bryant's unorthodox techniques and John May's dogged police work to catch a criminal whose ability to escape detection seems almost supernatural--a murderer who even decades later seems to have claimed the life of one of them...and is ready to claim the other.Filled with startling twists, unforgettable characters, and a mystery that will keep you guessing, Full Dark House is a witty, heartbreaking, and all-too-human thriller about the hunt for an inhuman killer.From the Hardcover edition.", "title": "Full Dark House\n      \n          (Bryant and May #1)", "url": "http://www.goodreads.com/book/show/5057659-full-dark-house", "average": 3.69, "cover": "https://images.gr-assets.com/books/1328301909l/5057659.jpg", "reviews": 877, "authors": [{"url": "https://www.goodreads.com/author/show/3912.Christopher_Fowler", "name": "Christopher Fowler"}], "type": ["Mystery", "Fiction", "Mystery", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/5057659-full-dark-house", "http://www.goodreads.com/book/show/3960300-full-dark-house", "http://www.goodreads.com/book/show/474064.Full_Dark_House", "http://www.goodreads.com/book/show/11804798-full-dark-house", "http://www.goodreads.com/book/show/108531.Full_Dark_House", "http://www.goodreads.com/book/show/965374.Full_Dark_House", "http://www.goodreads.com/book/show/3960298-full-dark-house", "http://www.goodreads.com/book/show/7047925-full-dark-house", "http://www.goodreads.com/book/show/15700110-full-dark-house", "http://www.goodreads.com/book/show/455821.The_Water_Room", "http://www.goodreads.com/book/show/5743.Seventy_Seven_Clocks", "http://www.goodreads.com/book/show/2574912-the-victoria-vanishes", "http://www.goodreads.com/book/show/275810.Ten_Second_Staircase", "http://www.goodreads.com/book/show/602698.White_Corridor"]}