{"ratings": 4246, "userreviews": [{"userName": "Heidi The Hippie Reader", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "Galore is all over the place. And I didn't like it.I like epic historical fiction. (The Far Pavilions) But, this one wasn't epic. It was more a collection of pointless stories strung together than a rich tapestry with unifying threads.I don't necessarily mind plot lines about priests who act in un-priestly ways. (The Thorn Birds) But there was nothing redeeming about this priest.In fact, I can't think of a single character that I cared for much. That's a shame because there were so many to choose from.On to the next book. :) I recommend giving this one a pass."}, {"userName": "Alex", "userReviewDate": "Nov 18, 2014", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "\"100 Years of Solitude in Newfoundland\" is probably how everyone describes this book, because that's what it is. Same magical realism; same complex, circling family trees. Same mythic feel; same epic, frustrating refusal to commit to one story. It's a little bit easier to read - when it zooms in on one story or another it zooms with a vengeance, gaining a sense of immediacy that Marquez's book almost never hits. And it's like half as long.Here is Newfoundland:There's a Yeats thing happening here too, I think. Doctor Newman, feeling \"like he'd been transported to a medieval world that was still half fairy-tale,\" reminded me of Yeats' Ireland: \"We exchange civilities with the world beyond.\" In both cases it's basically irrelevant whether fairies or mermaids literally exist or not; what matters is that one is exchanging the civilities. Irish people are like this, and there are a lot of Irish in this story.It picks up steam in the second half. It's a brilliantly planned book; every event has significance. Crummey doesn't drop a stitch, and when he chooses to wave away his Marquezian mythic fog to dawdle with the story, you'll find yourself staying up late to read. My favorite bit is the side story of Mr. and Mrs. Gallery and Father Phelan. \"Choose your hell!\" someone says, and you're like oh snap, this book just brung it."}, {"userName": "Jeff", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/9075522-jeff", "userReview": "This is my Amazon review:There are those who enjoy books with undeveloped characters, major plot threads picked up and dropped, hypocritical religionists with no contrasting genuine heroism and morality, bleak setting, and ultimately pointless story, but I am not one of these people. If the book itself doesn't take its own story seriously (did Judah really come from a whale? Did they really harvest all that squid?), then why on earth should we readers? When I read the reviews of this book, I thought it was going to be something like a sumptuous Thanksgiving dinner spread, but I have been cheated. Imagine a spread like that, but after your Golden Retriever has had his way with it. That is more this book. Sure, there is plenty of everything, and a highly varied selection, but none of it is really very appetizing, let alone satisfying. It certainly doesn't hold a candle to Marquez (One Hundred Years of Solitude), but even there I am in the minority, as I much preferred Allende's The House of the Spirits to Marquez. Galore isn't even in the same league; the former two have a theme and a flow, Crummey's book just has everything thrown in it with no apparent point.I haven't really read much fiction set in Newfoundland, but I would steer readers away from this book and towards Anne Proulx's The Shipping News, which is very evocative of the region, has gripping characters, and a moving story that doesn't leave you wondering what the !#$@$ you just read."}, {"userName": "Callie", "userReviewDate": "Apr 20, 2011", "userURL": "http://www.goodreads.com/user/show/3709317-callie", "userReview": "Two parts history and one part fairy tale, Galore takes place on the isolated island of Newfoundland, where the lines between reality and fantasy, and between superstition and happenstance all get a bit blurry. While at the beginning, I would find myself questioning how any of this could actually happen, by the end I freely accepted the idea that the reason a girl would be born with webbed fingers could be traced to an affair her great-grandfather had had with a mermaid decades earlier.The quality of the narrator is also brilliant- his accent fits in beautifully with the story. I will definitely listen to more of his work! On audio, loving it so far!Update- I found out after reading some reviews that the print version comes with family trees, which I wish could be incorporated into the digital audiobook somehow. I ended up cheating- I dl'd the sample ebook onto my nook, which includes the first few pages... including the family trees! Very handy. I'm still loving the story, btw. I want it to be adapted to stage or screen somehow."}, {"userName": "Kathy Chumley", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/7131863-kathy-chumley", "userReview": "Every so often I finish a book, and can't start another one because I'm still thinking about the book I just finished. Galore is one of those books.Galore pulled me in from the start. Part historical fiction, part magical realism, and part multi-generational family saga. Witchcraft and modern (for its time) medicine. Two feuding families. The haves vs. the have-nots. Religion. Ghosts. Galore has it all. Stories Galore. There is abundance every so often, and there are hard times more often. The people of this fictional town in long ago Newfoundland feel so real you would recognize any of them if you saw them on the street.The story begins with an infant's birth and a fully grown, nearly albino, mute man, being pulled out of the belly of a whale that washed ashore. The townspeople see nothing weird about this, and neither does the reader. The author's wonderful storytelling style weaves the lives of the characters together in an unforgettable manner that will have you thinking about this book long after you've finished it.The comparisons to One Hundred Years of Solitude are inevitable, and I started making them early in the book (and before I read reviews that make such a comparison). However, in many ways Galore is more readable than 100 years and the characters are more human."}, {"userName": "Suanne Laqueur", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/10273177-suanne-laqueur", "userReview": "Ho. Lee. Crap. Wow. This was amazing. And I know everyone won’t think so. This is the kind of book that has a select audience. It spans centuries and generations with families interacting and intermarrying. I live for this kind of book and there were times when it was an effort to keep all the characters straight. But I loved it. I must be a sucker for a novel about a fishing village and life on the sea, because I loved Carsten Jensen’s We, the Drowned the same way. I would put that book, Galore and One Hundred Years of Solitude together on the shelf. They will all be read again in the future. Wow. WOW!"}, {"userName": "Felice", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/2507841-felice", "userReview": "Galore is a swallow you whole kind of novel. Speaking of which when the story begins the townspeople of Paradise Deep pull a man out of a whale. I have to suspect that even in the great whaling times of the early 19th century you just didn't see that every day. The whale has beached itself on the shore of this remote village in Newfoundland. When it dies the citizens come together to butcher the whale and gather the blubber for lamp oil. Then just like Uncle Jed's bubblin' crude out from the whale comes an all white dude. True story or so the folklore of Paradise Deep goes. The next hundred years in Paradise Deep are filled with the flux of public opinion, the curse of Judah (The whale man who unsurprisingly never loses his fish smell.) and the savior Judah, blood feuds, ill-fated love affairs, the moneyed of the town verses the hand to mouth, opera singers, paternity questions, alcoholics, scrimshaw, a witch/healer and the kind of legends and characters that come from a very creative writer building a larger than life history. Galore is a perfect name for this novel by Michael Crummey. It's a word I associate with the word lavish and Galore is a lavish novel. There is a lavish amount of characters, story lines, fish and Newfoundland brought to you in 100% lavish writing. Many writers strive to create a entire community with it's own natural folklore, but who succeeds? In recent memory I'd have to say We The Drowned and Galore both do and...no one else. If your favorite novels are slim studies of the interior life of characters who have a crisis the level of a hangnail then by all means skip Galore. Only read Galore if you adore terrific writing, invention, unique characters and lots of storytelling. --Oh yeah and historical fiction that doesn't mention a single Tudor, Borgia or Kennedy.Some others have liked Galore as well: Winner of the Commonwealth Writers’ Prize for Best Book, Caribbean & Canada and the Canadian Authors Association Literary Award; Finalist for the Governor General’s Literary Award for Fiction, the Thomas Head Raddall Atlantic Book Award, and the Winterset Award."}, {"userName": "Rachel Ford", "userReviewDate": "Jun 06, 2011", "userURL": "http://www.goodreads.com/user/show/1917078-rachel-ford", "userReview": "I started reading Galore and I was carried off my own feet in my small apartment in Nepal, carried to a cold and difficult island off the east coast of Canada. Carried so effectively that it didn't matter whether or not I previously thought of Newfoundland as such a barren, unwelcoming place, what mattered was that I believed it. I believed that a man could be cut from a whale and smell of fish ever after, that he could pass the trait to his son, that he could be mute and white and magical. I believed that the people worked terrifically hard, that the people had superstitions sewn into them from birth, that passing through the branches of a tree could save people's lives.Galore was tough, unrelenting in character introduction and pace, epic in its portrayal of four generations, harsh in description. It was never soft, barely hopeful. But it brought me to a place I had never been before, a place where a young girl might choose to have all her teeth removed, just because they might rot one day, a place where love and food and procreation and religion are salty and difficult, harsh as the coldest sea. I could barely keep up at times, I flipped through pages looking again for character names, and at times I winced at events I found repulsive or offensive, but I never, ever lost my awe at the quality of Crummey's writing. Galore is terrific and terrifying, an incredible read."}, {"userName": "Friederike Knabe", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/1746401-friederike-knabe", "userReview": "Michael Crummey opens his new novel with Judah, \"wilderness on two legs, mute and unknowable, a blankness that could drown a man\", sitting in a \"makeshift asylum cell, shut away with the profligate stink of fish that clung to him all his days.\" Only Mary Tryphena Devine comes near him these days, urging him to take a little food... Judah's story is the primary, yet not the only otherworldly theme that glides through this multigenerational chronicle, set in one of Newfoundland's wild and rough eastern coastal regions, and, more specifically, in two remote fishing villages, Paradise Deep and The Gut. Crummey, himself a Newfoundlander and an award-winning Canadian author, has written this highly imaginative, superbly crafted folkloric tale that blends with great ease strands of supernatural magic of old fairy tales and beliefs with a cultural and social history of Newfoundland's Outports. Spanning over some one hundred years, starting with the early eighteen hundreds, the author delves deep into personal relationships between members of the early settler communities, shaped by the strife between the Irish and West-country English, and the political and the religious influences.After a brief glimpse into a later period, Crummey moves quickly back in time to Mary Tryphena's childhood when a whale beached itself on the shore of Paradise Deep. The villagers, desperate for food after another meager fishing season and an icy-cold winter of scarcity, can hardly wait to cut up the animal's flesh. Just then, as Mary Tryphena's grandmother, Devine's Widow, pulls the body from the whale's belly, the figure starts coughing up water, blood and small fishes...! He is fully grown and cuts an unusual figure among the locals: he is completely white from head to toe, and his smell of rotten fish is so overpowering that nobody wants to be near him...The locals, God-fearing yet illiterate, and with the itinerant priest not due for a visit for some time, cannot agree which biblical name belongs to the \"story with the whale\" and, as a compromise, decide on \"Judah\". Suspicion follows the strange figure from the outset - not just physically is he an oddity, he also appears to be mute. The villagers easily blame him for all the mishaps that are befalling them. Until, one day, Judah one leads them to the most amazing catch...Much of Crumney's narrative is focused on the ongoing strife between the Devine family, the most important clan in The Gut, who have \"adopted\" Judah, and the Sellers clan who control Paradise Deep, wealthy merchants who exert their power over the communities by any means,legal or not. The clans' dispute has a long history, going back to Devine's Widow and King-me Sellers, yet, over the generations it has turned into a constant, often violent, rivalry between the Irish and West-Country English, between the poor fisher folks and the merchants/land owners. The different church representatives also compete for the souls of the villagers. Much influence rests with some of the local women; they play an important role in both contributing to and smoothing the generational conflicts. Not only do they have a central role here, they are, very convincingly, depicted as the carriers of tradition and, sometimes, magical powers... The local dialect of the time is prominent throughout the frequent dialogs and takes some getting used to. It adds, however, a special flair to the narrative.Crummey weaves an intricate six-generation tapestry of the two clans and the people around them that it is sometimes difficult not to get lost in the interrelationships between characters, despite thme being fully developed. For his factual backdrop, the author touches on various political developments in Newfoundland and introduces historical figures into the fictional world he has created. While the author never loses his interest in the local communities, some of the (historical and other) side developments take away some of the magic of the narrative's central drive and focus. To help the reader through the myriad of names that come to life in the story, a genealogical chart is displayed upfront. While such a chart is useful, given the wealth of characters, it does reveal some linkages that are better discovered only in due course. All in all this is a rich tale that will attract those readers in particular who have an interest in the history of the island of Newfoundland."}, {"userName": "Sarah", "userReviewDate": "May 30, 2011", "userURL": "http://www.goodreads.com/user/show/866318-sarah", "userReview": "My Maternal Grandmother was born and raised on Bonne Bay in Woody Point. This is a very special place, extremely dear to my heart, which should be a testament to this beautiful and wild island's powers since I've only been privileged enough to visit there twice. Hence, my interest in this book, and I hate to say it, but it just wasn't for me.I'm very glad to see that so many have enjoyed a Newfie writer. Truly. However, if this had been my one and only exposure to the island and it's people, I might come away with a VERY unfavorable impression. Many people in fact don't take the time to dig harder and not let one sole source, experience, or person guide them.For myself, there were few likeable characters, but to be fair each character was extremely human. They had their own desires, temperaments, and a fair share of dirty laundry. I think the crudeness and outright vulgarity of the dialogue was a bit overdone sometimes (dialogue is a pet peeve of mine, I hate reading a story based in Scotland with the \"brogue\" written in, I would much rather imagine it, thanks). I think otherwise, it was very easy to find myself with the Mummers in so and so's house, or be trying to walk along with said character through a snowbank on a full moon night. So very well done there. Also, how the book was edited and presented (without quotations for each piece of dialogue) was a slight turn off.There were quite a few people to keep straight, and a few family trees to try to keep in mind. The story seemed to bounce around quite a lot, back and forth through time, or from person to person or family to family, which made it slightly confusing, quite frankly. I'm very sad to say that whatever point Mr. Crummey was trying to put out there completely eluded me. Was it perhaps the sad end of the Divine family? The crude, harsh, insanity of island life? Happiness for the characters seemed like such a fleeting thing, no one ever seemed to get it, or hold it for long if they did.Still, putting a book out into the world is a very special thing. An effort to be applauded, and I'm glad so many have enjoyed this book. And I hope you DO try it if you want to read something a bit different. It wasn't quite my cuppa, but I'm sure it could be enjoyable for many others."}, {"userName": "Bandit", "userReviewDate": "Apr 09, 2014", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "This is the book the seemed impossible not to like. The sheer amount of awards and accolades it had gathered, the Best of 2009 lists it was on. And yet the main reason I read it all the way through was my OCD style commitment to finishing books and I was happy to have it over and done with. What makes this particular experience odd is that it was such a well written book, Crummey really has a way with language and some turns of phrase were simply stunning, but it simply wasn't enough to carry the book and so the weighty saga (made heaviest by its contents and not so much size) collapsed into a laborious read. The story follows generations upon generations of the cruelly ironically named Paradise Deep in Newfoundland, a place where lives are bleak, depressing and exhausting, something to be endured more so than enjoyed...and all the same things hold accurate for the reading experience as well. This was more of an exercise in patience and much too much wasted time."}, {"userName": "Linda Robinson", "userReviewDate": "Jan 22, 2011", "userURL": "http://www.goodreads.com/user/show/2613351-linda-robinson", "userReview": "This is a book of such potency, it feels alive in your hands, fills your head with its characters, the names whispering in dreams in the middle of the night. Devine's Widow. Jabez Trim. Mary Tryphena. Judah Devine. Doubting Thomas Trass. Reverend Dodge. King-me Sellers. Obediah and Azariah. The triplets who are so identical, even they all think they're Alphonse. And the places they live! Paradise Deep. The Gut. Selina's House. The story is intricate, like a labyrinth but one the reader can walk into and out of with ease and comfort, eager for the next step. Such majesty and skill here, the storytelling is stunning. Keep the classics. I'm a Crummey devotee. 10 stars for him and all of those shining."}, {"userName": "Stacia", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/3917029-stacia", "userReview": "A glorious read even though it loses a little bit of its steam in the second half of the book. Still, it is a wonderful read, a mix of generational family tales, folklore, & history. Loved the way Crummey also showcased the cyclical nature of life & of the generations of the families.(If you read & enjoy this book, I think you'd also really enjoy Mink River by Brian Doyle.)"}, {"userName": "Debbie", "userReviewDate": "Sep 17, 2009", "userURL": "http://www.goodreads.com/user/show/2734623-debbie", "userReview": "Michael Crummey was born & raised in Newfoundland, lives there still, and has set all of his meticulously researched novels & collections of short stories thus far in this beautiful, windswept, and harshly-demanding Canadian province.is set in the outport villages of Paradise Deep and The Gut, joined by the Tolt Road over the headland between them, in an undefined period that covers most of the nineteenth century and the first few years of the twentieth. The novel chronicles the lives of two rival families (the Sellers and the Devines) for six generations, and I often referred to the genealogy chart at the front of the book, especially during my first reading.Inspired by the works of Gabriel García Márquez, Crummey has combined the starkly difficult conditions of pioneer outporters with a touch of magical realism. According to Wikipedia, magical realism is “an artistic genre in which magical elements or illogical scenarios appear in an otherwise realistic or even ‘normal’ setting.” This is Crummey’s first use of the method in his novels.Part 1 of Galore more or less moves around the life of Mary Tryphena Devine who is nine years old the winter day that a whale beaches itself in the bay. From the whale’s belly emerges, half-dead, the man who becomes known as Judah, the Big White, whose presence will affect the lives of all in the port, and none more so than Mary Tryphena’s.As Mary Tryphena matures, marries, has sons (one illegitimate), and then grandchildren, the story goes back and forth between the history of Mary T.’s grandmother (Devine’s Widow) and her parents, and the interconnection with King-Me Sellers and his grandson Absalom. The boy Absalom has fallen in love Mary T., who unbeknownst to him, is his first cousin. For this, he is banished to England for half a decade. While he is gone, Mary Tryphena is married to someone else and is lost to him.Nearly four decades pass in the intermission between Parts 1 and 2, and we pick up the story with Mary Tryphena an old woman with the community role that her grandmother, Devine’s Widow, had. We learn of the events of the intervening years through the eyes of two grown brothers we last knew as boys who ferry the young newly-arrived Dr. Harold Newman to patients by boat, by dog-sled and on foot.As they tell the stories that the reader already knows, it becomes clear that a large number of the people in the community do not believe the stories that have been passed on. It’s here that magical realism that has been interwoven into Part 1 is brought into question.Did Judah really come out of the belly of the whale? Did he indeed bring the squid, and then fish galore? Did Callum really see the mermaid that the Woundy brothers nearly went overboard for? Was Jabez Trim’s bible really found in the gullet of a cod? How do we explain Mr. Gallagher?I’m not a fan of magical realism, but I think that part of the reason that the author could use the technique so readily and successfully in the first half of the saga is the vacuum of any other explanation of other-worldly phenomena. The itinerant priest who served the marrying, baptizing, and burying needs of the Catholic population was an agent of superstition. (Not that the population was any better served in later times with the Protestant Reverend Dodge and the Catholic priest of the season. Both applied scriptures harshly and the Catholic church especially meddled in the political affairs of the people, threatening ex-communication for anyone who joined the Fishermen’s Protective Union in the early years of the twentieth century.)Perhaps I just relate more easily to the starkness of early Newfoundland life than to the heat of Central America, but I found that, although I could not stomach Márquez, I loved the effect in Crummey’s Galore.One of the effects that I felt played a huge part in this novel is the indeterminate passage of time. Crummey might pick up the next paragraph, page or chapter with the following week, but just as often with thirty years in the past or ten years hence, with no explanation or placement. At first, I found this disconcerting but as the story developed, I found it to be one of its greatest strengths. Dates were not important, particularly in Part 1.Time passed from one generation to the next, affected strongly by the last, and life went on unchanged. World events had little, if any, impact on the people’s lives. There was no change in circumstances, no accumulation of material goods, no inheritances. There was simply the unending drudgery, cold, hunger, fishing, the cycles of plenty and want, the love, and the hate that remained the same for generation after generation. Hopeless circumstances and a futile existence.Galore is not a happy book, but an amazingly powerful read. I highly recommend that you do just that. ( )"}, {"userName": "Bonnie", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/2749139-bonnie", "userReview": "I don’t know what just happened to me. I was minding my own business, my February reads already planned and stacked up on a shelf, when suddenly I was overcome by the desire for a spontaneous read, something that has been sitting on my shelves for a long time, something I haven’t given a second thought to since I placed it on my shelf. Hello Galore! Nice to meet you. And just like that I was sucked into a fantastical world like none I’ve been in before. Part fable, part myth, part old fashioned family saga, an epic novel like no other, a charming romp through two centuries on the New Foundland coast, I could hardly stand coming up for air as I consumed the narrative in hungry gulps.A whale beaches itself on the shores of the isolated town of Paradise Deep, just in time for the famished residents to finally feel hope of being sated. As they hack away at the carcass they are shocked to find a man inside, alive, mute and reeking of fish. They soon name him Judah (although he calls himself God’s nephew) and he is absorbed into a community that is already full to over-flowing with odd, eccentric, strangely endearing characters. And as we learn their stories, and watch those complex stories fold in on themselves and into the next generation, it’s the continuing saga of this fantastical community that tears at the sensibilities which the author renders with grace and aplomb. These hardscrabble characters fight each other, the land, the sea and the elements. The harsh New Foundland weather with its extremes in temperature and precipitation and the rolling sea provide tremendous obstacles to any shred of happiness these characters might grasp. Between poor fish hauls and total or partial crop failure, life in Paradise Deep makes it seem hardly like, er, paradise. But Judah, the albino found within the beached whale, seems to be some kind of talisman for the people. Their luck seems to change. The fish are plentiful and they’re harvesting bumper crops.If you’re looking for intricate plotting, you’re looking at the wrong book. This book is about deeply flawed and complex characters and Crummey is a genius in his skill at character portrayal and, thereby, telling the fascinating tales that make up the narrative. King-me Sellers, the self-proclaimed patriarch is at constant odds with the enigmatic Devine’s Widow, who some claim is a witch and who practices some unexplainable medical procedures. They dominate their respective families who are at war with each other throughout the course of the book. There’s a jealous husband who dies and yet comes crashing through the ceiling and becomes a permanent fixture in the frightened community; a priest who doesn’t exactly play by the rules:”’You’d be a half-decent priest if you gave up the drinking and whoring,’ Devine’s Widow told him. ‘Half-decent,’ he said, ‘wouldn’t be worth the sacrifice.’ He was mean and mercurial and abrupt, the sort of man you could imagine slipping through an outhouse hole when circumstances required it. He was fond of quoting the most outrageous or scandalous confessions from his recent travels, he named names and locations, adulteries and sexual proclivities and blasphemies. He had no sense of shame and it was this quality that marked him as a man of God in the eyes of his parishioners.” (Page 18)And when a new doctor finally comes ashore and the patients line up he treats a beautiful young woman in just the way she asks to be treated. She may only have two teeth that need to be extracted but he acquiesces when she asks that he pull them all, ‘they’re only going to cause her grief later on and she’ll as like be somewhere she got no one to pull them.”As one generation dies off and we meet up with the next generation we find the years are flying by and, coincidentally, the pages seem to be turning themselves until we come to the end and find we’re right back where we started. But oh my, what a time we had getting the. Very highly recommended."}, {"userName": "Chris", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/1605591-chris", "userReview": "So there is this albino who gets swallowed by a fish and then . . . Well, the then is a bit complicted, kinda like life. You have religious battles, you have a sex addicted priest, you got witch women, you have ghosts, you have adultry.There is even fish!Galore is one of those fantasy novels that people who say they don't read fantasy, read and don't know it's fantasy. It makes me want to visit Newfoundland.While not the deep structue of say A.S. Byatt, this book is one of those family sagas, an almost circular tale. It's rich, deep. It's like the work of Michael Chabon, but more of milky dark chocolate, with nuts and raisins. It's a latte."}, {"userName": "Shellie (Layers of Thought)", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/1987170-shellie-layers-of-thought", "userReview": "Original review posted at Layers of Thought.Historical fiction and a multi-generational tale, set in the freezing Newfoundland seaside town of Paradise Deep. Layered with snippets of the resident’s lives containing a touch of myth and small tastes of paranormal.About: Galore is a complex and page-turning book, set in an area and time where living is bleak – a frigid seaside town in the mid 1800’s. Sadly the locals are starving, so when a dying whale swims into the harbor the town folk eagerly wait for the animal to take its last breath. All are lurking on the beach, with their knives and buckets and plans to use every part of its body for sustenance; to their surprise when removing its stomach they discover the body of a man. Thinking it’s a corpse they plan to bury it, but are shocked to find that he is still alive. Judah, as they name him, is at first feared due to the nature of his arrival, his unusual appearance, a lack of apparent ability to speak, and a very strong odor. However, in time he is thought to be the reason for an increase in the fish being pulled in by their once empty nets and other improvements in the relative comfort of the remote community.My Thoughts: The above is only a short description of the very first part of the book; the rest contains interwoven stories around the numerous characters developed within the text. The author skillfully and incredibly weaves together the complex personalities of the resident’s lives in an earthy, heartbreaking, and at times starkly hilarious way. It includes some interesting twists, a full circle and an appropriate ending. The story is a take on a universal theme of a man being swallowed by a whale - this is a myth which is found in various cultures, religious text, and folk stories. Although Galore does not have an ancient setting and it is also not religious, it does contain a strong thread containing two Christian factions and several colorful local clergymen.Michael Crummey is an exceptional writer with an unusual style that is at once page-turning and complex. With so many tangled threads it’s a good thing there are two genealogy trees located at the beginning of the book; it is needed. Highly recommended for historical fiction lovers, those who enjoy a mythic theme, and those who love complex colorful characters in their reads. I rate Galore at 4 stars; I loved it and now know why this author has won so many awards."}, {"userName": "Dana Stabenow", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/1608124-dana-stabenow", "userReview": "I come from a small coastal fishing community, so a lot of the themes in this novel resonated pretty strongly. Isolation, insulation, privation, these are memes shared by all remote communities who sell what they catch, wind up eating it if they can't sell it, and starve if they don't catch anything. And they always yearn after the plenty of fishing seasons past:They spoke of the days of plenty with a wistful exaggeration, as if it was an ancient time they knew only through stories generations old. My Jesus, the cod, the cod, the cod, that Crusade army of the North Atlantic, that irresistible undersea current of flesh, there was fish in galore one time. Boats run aground on a school swarming so thick beneath them a man could walk upon the very water but for fear of losing his shoes to the indiscriminate appetite of the fish.The cod has largely moved on at the beginning of this story, and then myth moves in in the person of Judah called the Great White, a man cast up from the belly of a whale. Mute, the mark of the devil on him in the paleness of his skin and the rank fish smell of his person, he has nevertheless the gift for finding the fish, and does so, bringing prosperity and plenty, at least for a while. There are mermaids and ghosts, too, and I would argue that the very landscape itself is at least in part very nearly fantastical in its appearance and its sense of self. Further, you don't really know what decade or even what century it is until halfway through the book. This is a place existing out of time, and in every time. Of course, as time passes in the lives of the characters, bit by bit the magic goes away. I was at first put off by the novel's ending because it seemed just too neat. But I've been thinking it over since, and really, don't all myths end where they begin? Doesn't the snake always eat its own tail?Some grad student should write his or her master's thesis on a comparison of Michael Crummey's Galore and Isabel Allende's The House of the Spirits. And then let me read it."}, {"userName": "Jerry Auld", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/7862767-jerry-auld", "userReview": "Hmmmm. Well, started this after wanting to for so long, and really amazed by Crummy's writing - his evocation of the people and the coves and the ghost, oh, especially the ghosts, is really something. I could read for chapter after chapter. And watch the town of people (never really defined by census, just that there were lots more when needed, and many more than the one who starved to death), just pass the time in exquisite detail.But.And this \"but\" stopped me cold at the half-way point, between Part I and Part II. The book just lay there on my table. I couldn't pick it up. Why? The characters were so clear and distinct and unique, but I had absolutely no curiosity about what would happen next. That was it. After reading 150 pages of these lives, I realized that although people had scraped a dismal living from those shores, and starved to death, or froze, multiple times, during those interminable winters, the problem was....nothing had really happened.I mean, things, many things, had happened. To individuals. But as the narrative voice was 3rd-person, all these things were details. And since the psychic-distance was looking down over two towns in the cove of Paradise Deep, those individual details never resolved themselves into any grand narrative, that would make care about an individual or the town.Hey, guess what? Next winter someone will freeze. Some family will starve to death. OK, Got it.Just never found the desire to keep reading. After all those awards and citations, it was just well-written, but boring. Maybe someone who loves multi-generational soap-operas will love this book. But not me. If it had been advertised as a multi-generational soap-opera, I would have passed. If you wouldn't, then I would say this will be a great book for you, because you simply can't beat the writing here."}, {"userName": "Bill", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/2420980-bill", "userReview": "This is an old fashioned multi-generational novel with a bit of fantasy thoughtfully thrown in. It won numerous Canadian and Commonwealth literary prizes.The setting begins with a whale stranded on a Newfoundland beach in the late 1700 or early 1800s. As the villagers are stripping the whale for blubber and oil they pull a man from the whale’s stomach. He is barely alive, very white and stinks. They are somewhat religious but there only source of instruction is a Bible recovered from a shipwreck. It is very difficult to read. The story of Jonah is known but the reading difficulty results in the survivor’s being named Judah.There are four themes. Generations of village families, their actions, quarrels, marriages, adulteries, bastards, births and deaths are the central theme. Newfoundland is another. It is a harsh country with long winters and poor soil. Villagers are almost totally dependent on fishing for their existence and during some years the catch is almost non-existent. Their poverty and provincialism is another theme. At times some families die from starvation. Many are illiterate or semi-literate and their remote location makes them out of touch with the rest of the world. Unionism and co-opts appear late in the 19th and 20th centuries. Galore answers their affect on poverty. Finally, there is long religious struggle between various forms of home grown religion, Protestantism and Catholicism. Father Phelan is a favorite. Judah’s life is very much in the background.Galore is highly recommended and is an extremely good read."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Aug 04, 2011", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This novel has a lot of elements that pretty much guarantee an enjoyable read for me - a bleak, cold-weather island setting; embedded superstitions and magical realism; religious conflict; quirky characters... this is my \"type.\" Readers who enjoyed The Shipping News or Ahab's Wife: Or, The Star-gazer would probably enjoy this.I did get a bit bogged down in the discussion of the fisherman's union, although surely that was timely in the period this is set. That and a frustration with how the second half jumped around in time keeps this from being five stars. \"She had enough Irish to discipline her youngsters and make love to her husband.\"\"Hunger is the best sauce.\"\"Newfoundland seemed too severe and formidable, too provocative, too extravagant and singular and harrowing to be real. He half expected never to lay eyes on the place again, as if it didn't exist outside the stories in his head.\""}, {"userName": "Saleh MoonWalker", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : Galore - Nevisande : Michael Crummey - ISBN : 385663145 - ISBN13 : 9780385663144 - Dar 336 Safhe - Saal e Chap : 2009"}, {"userName": "Krista", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "They spoke of the days of plenty with a wistful exaggeration, as if it was an ancient time they knew only through stories generations old. My Jesus, the cod, the cod, the cod, that Crusade army of the North Atlantic, that irresistible undersea current of flesh, there was fish in galore one time. Boats run aground on a school swarming so thick beneath them a man could walk upon the very water but for fear of losing his shoes to the indiscriminate appetite of the fish.ga•lore[guh-lawr, -lohr] adverb in abundance; in plentiful amounts: food and drink galore. Origin: 1660–70; < Irish go leor enough, plenty>If the wistful nostalgia for the days of plenty, of fish galore, speaks of a real time, it's no wonder that the poor fishermen and their families, as well as the shrewd and shifty businessmen who would build whole communities from their labour, would have been lured from Europe to settle the barren and inhospitable coasts of Newfoundland. The novel Galore follows the intertwining of two such families, the Sellers and the Devines, the one rich and the other barely surviving, over six generations and two hundred years. When Devine's Widow (her actual name seems to have been lost to history) rejected the marriage proposal of King-me Sellers, they went on to found the two families that would make up the majority of the characters in this book. Portentously, Devine's Widow left King-me with a curse: May the sea take you and all the issue of your loins. If ashes to ashes and dust to dust is the biblical way of the world, it follows naturally that in Newfoundland that which comes from the water will be returned to the water. The Widow is accused of being a witch, a perfectly reasonable assumption to the people of Paradise Deep, and takes her place alongside other fantastical creatures, such as mermaids, the Little People of the woods, a mute albino delivered live from the belly of a whale, and more than one tangible ghost. A doctor who joins the community on a two year contract, and ends up staying forever, seems equally intrigued and repulsed by what he initially finds: He felt at times he'd been transported to a medieval world that was still half fairy tale.  In many ways, the day to day lives of the locals was medieval, little changed from a subsistence life from centuries before.Michael Crummey shows great affection for the inhabitants of this lost world, and if I have a complaint, it might be that he's a bit too gentle with them. Certainly there are unlikeable characters in this book, murderers and philanderers and misers and fools, but none of them really came off the page for me. A true story: I have a friend who married a Newfoundlander, whose own father was a fisherman in a coastal community of less than two hundred people, fifty and more years after Galore concludes. This man was away on the fishing boats most of the time but when he was home, he was a mean and abusive drunk who forced himself on his long-suffering wife, eventually siring fourteen children by her. The woman was so overwhelmed, barely able to care for and feed the ever growing brood, essentially all alone, and she went to the parish priest for advice. The priest called down all the wrath of God upon her head for daring to complain about her lot in life and impressed on her that her only duty as a wife was to submit to her husband. And this was in the mid to late twentieth century. Yet, in Galore, not one character seems as real to me as my friend's father-in-law, whom she never met, and about whom she has only broadly sketched. Even the clergy in Galore, while gently ridiculed, are presented as benign-- they may behave unclergylike, especially the Catholic priest, but all of them are ultimately interested in the salvation of their parishioners.I did like this bit about the doctor's experiences, and what it says about the Newfies:The patients he saw were virtually incapable of articulating their troubles, offering only the broadest, most childish descriptions of what ailed them. I finds me sides, they told him. I finds me legs. I got a pain up tru me, they said. Bad head, bad back. Bad stomach, which sometimes meant trouble breathing. Even under questioning they had difficulty presenting specific symptoms, which made them sound like a crowd of hypochondriacs, but it was rare to root out a malingerer. People on the shore were unable to distinguish illness or injury from the ordinary strain and torment of their days until they were crippled and it was only the desperate who braved the clinic, and only after they'd exhausted every quack potion and home remedy available. After the bleakness and hard labour of generations of fishermen, Crummey offers rescue in the form of a union organizer:He had the rhythm and demeanor of a preacher, the same bluff assurance. He began with an overview of the sad facts of a fisherman's life, the deplorable conditions they lived and worked in, the parasites in St. John's who bled them dry. A sycophantic tone to the presentation that made the men restless, the grievances so familiar they could have rhymed them off in their sleep. But Croaker paused at the end of the list, breeding anticipation with his silence, and they all leaned slightly forward in their pews. --You people, he said finally. He pointed with his sausage fingers. Grovellers, he called them. They were living the same miserable lives their fathers lived and their fathers' fathers before them. The wealth of the nation made on their backs and every one of them content to beg at Levi Sellers' door. They were backward and illiterate and happy to leave their children no hope of a better life. What I found most illuminating about this speech is how it contrasts with the experience that Susanna Moodie describes in Roughing It In The Bush. To Moodie, emigrating and homesteading in Upper Canada was a very hard and rough life, but after years of work, one could survey the cleared land, the improved soil, the comfortable living one has eked out and then pass it all on to one's children, who would not have to labour as hard themselves. There seems a point to the sacrifices. But in coastal Newfoundland, the point for generations was to merely survive.And the bit that seems to summarise the whole plot, when the doctor hints at euthanasia to his wife who lies dying of cancer:Bride offering the slightest nod. --Now the once, she said.It was the oddest expression he'd learned on the shore. Now the once. The present twined with the past to mean soon, a bit later, some unspecified point in the future. As if it was all the same finally, as if time was a single moment endlessly circling on itself. Bride forever absent and always with him. And so the generations were come to an end: those descendants of Devine's Widow and King-me Sellers who are not dead by the end of the book are never heard from again after leaving for the States, taken by the sea as surely as if they had drowned in it.I didn't love this book, and for a poet, Michael Crummey rarely wowed me with poetical language, so it's a solid three stars for me. I have a thing for Newfie stories, and a preference for those told by Newfies themselves (*cough* sorry Annie Proulx *cough*) and will happily continue to mine the genre."}, {"userName": "S.B. Wright", "userReviewDate": "Sep 24, 2015", "userURL": "http://www.goodreads.com/user/show/4054906-s-b-wright", "userReview": "I have friends who are enamoured of this book, I bought it at the Adelaide Writers Festival after hearing Crummey read an excerpt during an interview with Margo Lanagan.If authors want to sell books, develop some public reading skills and choose your passages wisely. Crummey reeled me in hook, line and sinker.He read (in a faint Newfoundland accent if I recall) a selection of pages from near the beginning of the novel; a dying whale washes up on the shore and the townsfolk set about harvesting it. Cutting it open they discover the body of a naked man, determined to give him a Christian burial…Mary Tryphena’s father lifted the corpse by the armpits while James Woundy took the legs and the sorry little funeral train began its slow march up off the landwash. There were three stone steps at the head of the beach, the dead man’s torso folding awkwardly on itself as they negotiated the rise and a foul rainbow sprayed from the bowels. James Woundy jumped away from the mess, dropping the body against the rocks. —Jesus, jesus, jesus, he said, his face gone nearly as white as the corpse. Callum tried to talk him into grabbing hold again but he refused. —If he’s alive enough to shit, James Woundy said, he’s alive enough to walk.It has taken me about two years to get around to reading it though, plenty of time hopefully to let the praise settle, to let the initial excitement fade. It’s a prize winning book but I wanted to approach it as cleanly as possible.So what is Galore?It’s a story of people and place, the families Devine & Sellers chiefly and the community and locale of Paradise Deep, Newfoundland.So it has elements of a family saga set in a remote and bleak locale, in a time of changing attitudes and mores. Not perhaps a book that you want to read if you are searching for an uplifting experience. In terms of narrative fulfilment I was left feeling a little unsatisfied at the end of what seemed like a long tale. The nature of the book, its focus on family members over the period of a couple of generations made it hard to really form strong attachments to characters. That and a lot of the characters were not particularly likeable. They live a bleak and oppressed existence on the edge of starvation for much of the book.Still that being said, it was an immersive experience, the characters were tangible, the place and tone bleak and depressing in a thoroughly enjoyable way. I was absorbed.There are elements of magical realism, ghosts and shades that are interacted which I found no objection to, having come largely from a fantasy/science fiction background, there’s also an echo of biblical allusion – a family member cut from the belly of a whale and called Jonah.You may note too from the excerpt above that Crummey eschews the use of quotation/speech marks using a dash instead. It was an interesting choice, but didn’t really cause any issues once I got used to it.It’s been compared by some to The Shipping News and tonally I’d say they were similar, neither perhaps an advertisement for Newfoundland but they are both very distinct in their representation of people and place.I enjoyed Crummey’s writing enough that I’d pick up another work of his."}, {"userName": "Ben", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/1336647-ben", "userReview": "On a sentence by sentence level, Galore is very well written, the plot is full of interesting twists, strange and uncanny moments that somehow feel both plausible and magical - a spin on Jonah, a sex-obsessed ghost, a magical tree, a mechanical dolphin - good stuff. The characters are solid, but at times they are also intentionally flatten - as though they do exist but on a Sunday school felt-board or within a rather droll Biblical/steam punk role playing game. Setting-wise, Galore is a regional novel, firmly anchored in Newfoundland with Newfoundlandish things to say; it is also a sort of dynastic big picture take on all the branches of a family tree.That being said, as the narrative progresses it trends toward self-obsession and reporting... telling about huge chunks of time rather than giving it in scene. When the action is in scene, it's great, but there's a good 1/3 or more of the story that's set down like an encyclopedia entry. This becomes particularly distracting toward the end - a difficulty that's compounded by a heavy borrowing from the plot of 100 Years of Solitude. Granted Galore goes some new places and says stuff in a new way, but we're still talking incestuous liaisons, genetic defects, bad priests, etc. The ending drags and then rushes and then gets to a place where it’s suddenly quite interesting again. I read the final few pages three times; they were that good. All in all, I’d say read Galore if you’re really into Jonah or Newfoundland or maybe your cousin, which… yeah, I liked it."}, {"userName": "Sarah (Workaday Reads)", "userReviewDate": "Mar 13, 2011", "userURL": "http://www.goodreads.com/user/show/4695627-sarah-workaday-reads", "userReview": "Judah arrives in Paradise Deep, Newfoundland in the belly of a whale. He is cut out of the whale and joins a community full of unique characters. The story follows the families through multi-generations and many changes.This book screamed literature. It seemed like the type of book taught in advanced high school English classes. It had a dreamy mist about it that kept me from becoming immersed in the story. I felt a step removed the entire time I was reading it.The characters were definitely unique. And yet they seemed quintessionally Newfoundlander. Full of love and loyalty for the sea, and their special rock.The story reminded me of The Old Man and The Sea. I'm not sure how accurate the comparison is since I haven't read it since high school over 10 years ago, but within the first 20 pages, this is what I immediately thought. If anyone has read both stories more recently, perhaps you could tell me if my comparison makes sense.Overall, this was a very interesting read. It was a vast overview of life starting from the 1800s and progressing through several generations. The characters and families intertwine so complexly, and yet still make sense. I just wish I could have felt closer to the story."}, {"userName": "Ann", "userReviewDate": "Jun 20, 2016", "userURL": "http://www.goodreads.com/user/show/6199930-ann", "userReview": "4.5 A novel about Newfoundland by a Canadian author from Newfoundland (an island province off the easternmost coast of Canada). Situated in an isolated coastal settlement, centers around two families and their descendants, and encompasses about 200 years. This book captivated me: the characters, the setting, and the folkloric tales/stories. I was born in a small coastal town in Cape Breton that evolved from a fishing village - as a small child I remember hearing many similar folkloric tales told by older residents who declared them as actual events - oral history. Stories of early living were very similar to those recounted in this book. Having gone to school with many \"Newfies\", I could well visualize the early way of life described. Won the Commonwealth Award in 2009. Recommend for anyone with an interest or curiosity about the early coastal fishing villages, the hardships and resiliency of early settlers. A lovely book."}, {"userName": "Evi", "userReviewDate": "Sep 22, 2015", "userURL": "http://www.goodreads.com/user/show/2011943-evi", "userReview": "I can't say it any better than Linda Robinson: \"This is a book of such potency, it feels alive in your hands, fills your head with its characters, the names whispering in dreams in the middle of the night. Devine's Widow. Jabez Trim. Mary Tryphena. Judah Devine. Doubting Thomas Trass. Reverend Dodge. King-me Sellers. Obediah and Azariah. The triplets who are so identical, even they all think they're Alphonse. And the places they live! Paradise Deep. The Gut. Selina's House. The story is intricate, like a labyrinth but one the reader can walk into and out of with ease and comfort, eager for the next step. Such majesty and skill here, the storytelling is stunning. Keep the classics. I'm a Crummey devotee.\""}, {"userName": "Tuck", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/565487-tuck", "userReview": "Winner of the Canadian best novel award. This novel compared to garcia marquez \"100 years of solitude\", takes place on the mean shores of newfoundland, where abject poverty and hard ass work are the norm. The starving fisher folk get a prize when a whale beaches itself at their town. While they are cutting it open they find a man inside, alive. He marries into the \"tribe\" and moer intrigue and backbiting ensue. Lots of local color, good research into lifestyle back then, dirt floors, starving conditions, mean capitalists, much fussing and fighting between protestants and catholics, dead babies and beriberi etc. Good novel, but lugubrious."}, {"userName": "Jane", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/7177008-jane", "userReview": "I'm a dissenting voice among all these positive reviews, but I found this book to be completely pointless and a waste of my time. The only thing I did like was the evocation of Newfoundland and of the small fishing village, but I'm sure other novels have done this better. I didn't like the bawdiness, and the lives of the villagers seemed senseless. I didn't like how the fantastical and tall tale elements were worked into the story; it didn't know what it wanted to be. How the novel ever got awards is beyond me."}], "description": "Sprawling and intimate, stark and fantastical, Galore is a novel about the power of stories to shape and sustain us.Winner of the Commonwealth Writers’ Prize for Best Book, Caribbean & Canada and the Canadian Authors Association Literary Award; Finalist for the Governor General’s Literary Award for Fiction, the Thomas Head Raddall Atlantic Book Award, and the Winterset Award. When a whale beaches itself on the shore of the remote coastal town of Paradise Deep, the last thing any of the townspeople expect to find inside it is a man, silent and reeking of fish, but remarkably alive. The discovery of this mysterious person, soon christened Judah, sets the town scrambling for answers as its most prominent citizens weigh in on whether he is man or beast, blessing or curse, miracle or demon. Though Judah is a shocking addition, the town of Paradise Deep is already full of unusual characters. King-me Sellers, self-appointed patriarch, has it in for an inscrutable woman known only as Devine’s Widow, with whom he has a decades-old feud. Her granddaughter, Mary Tryphena, is just a child when Judah washes ashore, but finds herself tied to him all her life in ways she never expects. Galore is the story of the saga that develops between these families, full of bitterness and love, spanning two centuries. With Paradise Deep, award-winning novelist Michael Crummey imagines a realm where the line between the everyday and the otherworldly is impossible to discern. Sprawling and intimate, stark and fantastical, Galore is a novel about the power of stories to shape and sustain us.", "title": "Galore", "url": "http://www.goodreads.com/book/show/6276276-galore", "average": 3.74, "cover": "https://images.gr-assets.com/books/1327879454l/6276276.jpg", "reviews": 669, "authors": [{"url": "https://www.goodreads.com/author/show/171079.Michael_Crummey", "name": "Michael Crummey"}], "type": ["Fiction", "Historical", "Cultural", "Magical Realism"], "outlinks": ["http://www.goodreads.com/book/show/6276276-galore", "http://www.goodreads.com/book/show/10974848-galore", "http://www.goodreads.com/book/show/11034060-galore", "http://www.goodreads.com/book/show/8891439-galore", "http://www.goodreads.com/book/show/7014833-galore", "http://www.goodreads.com/book/show/10769183-galore", "http://www.goodreads.com/book/show/24778574-sweetland", "http://www.goodreads.com/book/show/296371.River_Thieves", "http://www.goodreads.com/book/show/296365.The_Wreckage", "http://www.goodreads.com/book/show/296366.Hard_Light", "http://www.goodreads.com/book/show/296367.Flesh_Blood", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}