{"ratings": 55, "userreviews": [{"userName": "Lori", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/7950608-lori", "userReview": "I was a lucky giveaway winner of this sweet book about friendship. Gertrude the goat and Toby the tortoise are pals. They live on a farm together. On Fridays when the farmer goes to town on errands, Gertrude and Toby go out on an adventure. Today it is fishing at a nearby pond. On their way a boy is shouting about a wolf. Soon they have to figure out what to do about the wolf themselves. I like this story about friends and trying to find a solution to a problem. A good children's book about friends and problem solving."}, {"userName": "Carla Johnson-Hicks", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/17074498-carla-johnson-hicks", "userReview": "This is the 3rd in the Gertrude and Toby Fairy-Tale Adventure Series. Every Friday, Gertrude the goat and Toby the tortoise head off on an adventure, when farmer Sam goes to market. In this story they decide to go fishing at Trout Lake. They have had a debate on the best bait to use (worms vs beetles) and decide that the one who catches the most fish will get to choose the adventure next Friday. On the way to the lake, they see a boy who cries wolf. When seeing him get dragged off by a wolf, they decide to help rescue him. Of course the three little pigs also make an appearance in this cute story.Once again, we meet fairytale characters in a different story and setting which is actually fun. It would be more entertaining for children, if they are familiar with the original fairytales so they can compare them. It is great to see Gertrude and Toby again. They will become the favourites of children who read this series. Their mannerisms and speech patterns are part of the humour in the stories. I also enjoy the illustrations in these books, they are large, colourful and fun to look at. I recommend this book to schools and classrooms (primary/junior) as well as to family libraries.I received a copy of this book from the publisher via Netgalley in exchange for an honest review."}, {"userName": "Patricia", "userReviewDate": "Sep 14, 2016", "userURL": "http://www.goodreads.com/user/show/36095389-patricia", "userReview": "Thank you Netgalley, Shari Tharp and Atlas for the chance to review this book.This is the 3rd in the Gertrude and Toby Fairy-Tale Adventure Series, a planned series of 4. As in the other books we follow Gertrude the goat and Toby the tortoise on there escapades away from the farm when the farmer is away. In this story they decide to go fishing having had a debate on the best bait to use (as you do) and on their way encounter the boy who cries wolf, three little pigs and naturally the wolf himself.This follows the familiar pattern of the previous books and in this case familiarity is a good thing. In three relatively short books they have established two really cute and funny characters that will appeal easily to the age range it is aimed at (6-8) and younger. The only problem I have now is finding when the next edition will be out for an impatient 5 year old!"}, {"userName": "Geneviève", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/49534674-genevi-ve", "userReview": "Gertrude and Toby Meet the Wolf is the first of this series that I have read. I read it to my niece and she loved it. The plot of the story is so cute - Gertrude and Toby going on a fishing adventure together and they meet a young boy, afraid of a big wolf. They then try to rescue the boy.The illustrations were great too !Thanks to Atlas Publishing for the free copy of this book. G-"}, {"userName": "Pammycats", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/39659978-pammycats", "userReview": "Gertrude and Toby Meet the WolfWritten by: Shari TharpIllustrated by: Jim HeathI received an e-ARC of this book from NetGalley and Atlas Publishing in exchange for my honest review.This is book 3 in the Gertrude and Toby books. I reviewed and loved each of the previous books in this series. Plot:Gertrude (the goat) and Toby (the tortoise) go fishing. Along the way, they see and hear a little boy running from a scary wolf - twice. However, they never actually see the wolf either time, After fishing for a bit, they do see the wolf (this is their third encounter with the boy) dragging the boy off to his cave to turn him into boy stew (a sad alternative to pork apparently). Gertrude and Toby rush off to save the boy. After escaping from the wolf, the three end up in the house of the three little pigs. The wolf, after assuming an adorable woodland disguise which fools no one, arrives at the pigs home demanding food, namely boy or pork. Everyone is terrified until Gertrude remembers that they have fish. The wolf is mollified for the day and the three pigs, the boy, and Gertrude/ Toby part friends. The story ends with our heroes lounging on a grassy bank at home on the farm dreaming of their next adventure.This is a charming story full of adventure and action. The only annoying part was the boy exclaiming in surprise, near the end that, \"There really was a wolf! Who knew?\" Wait, what? The boy has been pursued and tied up by the wolf and still he seemed surprised? It didn't really make sense. I understand that maybe at the beginning he is the \"boy who cried wolf\" when there was no wolf. But at the end, he is captured, almost turned into boy stew, and then really pursued by a wolf. It seems to me that the time for surprise has passed. Perhaps that sentence would have more literary impact if he said it earlier in the book? Maybe when he is tied up? Gertrude and Toby could look surprised and the reader is then in on the joke that this is the \"boy who cried wolf\".Illustrations:Since this is an early reviewers copy, the illustrations are not complete. However, I do have beautiful line drawings in my copy. They are incredibly expressive. I especially loved the fabulous wolf. He has such intense emotions and they are all conveyed by the artist. He is drawn scarily (his paw wrapped around the boys arm, his claws and teeth prominently displayed) but in a comical way (a scary wolf in homemade woodland clothes). I also love Gertrude and Toby. This is our third outing with these characters and the illustrator seems to be feeling very comfortable with them - even unto them showing angry irritation with each other. His portrayal of each is true to their character and really adds depth to their stories. I just cannot say enough good things about these pictures!Overall:I hope you love these books as much as I do! They are not perfect but they are full of fun and charm."}, {"userName": "Amie's Book Reviews", "userReviewDate": "Oct 01, 2016", "userURL": "http://www.goodreads.com/user/show/11232185-amie-s-book-reviews", "userReview": "\"Gertrude and Toby are best friends and live at McFarland Farms. Every Friday when Farmer Sam goes shopping in town, Gertrude and Toby sneak off the farm for a fun adventure.\" This is the third book in the Gertrude and Toby Fairy-Tale Adventure Series and the first book that I have read. It is NOT necessary to have read the first book to enjoy the third. Each title works as a stand-alone story.Gertrude is a goat and Toby is a tortoise. They seem to make an unlikely pair, but they work perfectly in the story. In each book the pair go on an adventure and they run into characters from other fairy tales.At first I was skeptical that this concept would come across as fresh and unique, but it definitely does. I loved the fact that the pair head out to go fishing at Trout Lake and they decide that whoever catches the most fish will be the one to choose what adventure they will embark upon. As they are walking a boy runs by on a few separate occasions yelling that a wolf is close by (from the fairy tale \"The Boy Who Cried Wolf) and later in the story when a wolf actually does appear, readers meet the pigs from the fairy tale \"The Three Little Pigs.\"The illustrations are simply gorgeous and a treat for the eye. Parents (or Grandparents) will enjoy reading this story to their children just as much as the children will enjoy listening to the tale of the two best friends. I highly recommend this truly wonderful book and I believe that it will make a terrific Christmas gift. Since this book is due to be released in hardcover ten days before Christmas, the timing is perfect. I rate this book as 5 out of 5 Stars and I look forward to reading the first two books in the series as well.I received a free copy of this book from the Publisher through NetGalley in exchange for an honest review."}, {"userName": "Donna Maguire", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/7997643-donna-maguire", "userReview": "I really enjoyed this book, the images are lovely and the layout is great it keeps attention too. The whole concept is good overall and its been put together well. I have read three books starring Gertrude and Toby and all have been very good and thoroughly enjoyable"}, {"userName": "Julie Carpenter", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/33202384-julie-carpenter", "userReview": "Super fun!!!! I've read the previous books in the series and loved them! I think this might be my favorite of the three, although the other two were really in all honesty just as fun! I just liked the way the author and illustrator portrayed the story of the three little pigs in this one.I love how Gertrude and Toby play together and plan their adventures. I loved their fishing and competition to see who could catch the most fish. I had my children and several nieces around while I read this aloud and they all loved it. We had just finished reading book #2 in this series and laughed and they all instantly asked for another one. After we finished reading this one, once again they all asked for another one. I told them there are only 3 so we'll have to wait for another adventure from this fun friend duo.Definitely a children's story I'm going to be recommending to friends and family for fun books to read to kids or fun books for gifts. Loved this series! The illustrations and the story itself are both a lot of fun. They author probably has a lot of fun coming up with these stories(and if not it definitely comes across as that to the readers). The 3 pigs and the wolf were just fun! I know I keep saying fun but honestly it's true. This is one of those children's stories that I could read over and over again and would encourage my children to want to pick this book. If you've read stories to little ones, your own or not, and they beg you to read the same book over and over and over and over and over and over and over....(you get the idea) and it's a book that they love but for you, you just can't quite get into it or love it and you want to hide it or get rid of it or something, anything to save you from reading it again and again. (No I never did hide a favorite book, although I was tempted a time or two, but I was a good mom and kept reading the books that brought joy to my kids and some patience to me - LOL).I would recommend this book to anyone of any age as a fun snuggle up and read and read and read again with one or many little ones!Content: Squeaky Clean!I received a review copy from ebooks. All thoughts and opinions in the review are my own.Happy Reading!!!"}, {"userName": "Robert Fiore", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/75258816-robert-fiore", "userReview": "Author: Shari TharpIllustrator: Jim HeathEveryone loves Fridays. It's the last day of the work week and school week before the weekend. Well, now we have another reason to love Fridays. Yes, it's another adventure for Gertrude and Toby, our friends from McFarland Farms. This Friday, the two decide to go fishing at the lake. Now you think that wouldn't be a problem. Well, you guessed wrong. It turns out fish are not the only things on the menu. You'll meet 3 little pigs and a little boy who likes to cry wolf but to the little boy's surprise, there really is a wolf. As always, the story and the illustrations are great. If you haven't read any of the books in this series, stop what you're doing and buy them all now! Parents and children will love them. I for one can't wait for the next adventure."}, {"userName": "Loralee", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/1303882-loralee", "userReview": "Gertrude and Toby meet the wolf was a fun story, and I liked how the authors brought in several different fairy tales into the mix. I thought there were a few places that felt a little abrupt and confusing, but overall, it was a fun tale. I think kids who enjoy fairy tales will enjoy reading Gertrude and Toby's adventures, finding the different fairy tales along the way. The illustrations are great, and really enhance the narrative!"}, {"userName": "Daryl Moad", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/13649505-daryl-moad", "userReview": "I'm going to be using it as a Christmas gift for the six-year-old son of my Best Friend. Is that a problem?"}, {"userName": "Maggie", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/3187237-maggie", "userReview": "This is the third book in the the Gertrude and Toby series. Classroom teachers will be able to share this book with young readers for story time or for lessons on comparing and contrasting and writing. This series is rich in imagination and readers familiar with fairy tales will enjoy how Gertrude and Toby meet the wolf and the three pigs. This series is a winner. I hope Tharp continues to write about Gertrude and Toby.I received ARC from NetGalley"}, {"userName": "Carol", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/5483589-carol", "userReview": "This book was so cute I love reading children's books I missed the first two books but I didn't feel as though I was missing anything by not reading the other books the illustrations in this book were so adorable. I liked this book a lot . I received this book from a giveaway on the site Librarything.comall thoughts and opinions expressed are my own"}, {"userName": "Kel", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/11193799-kel", "userReview": "These two are such cute characters! Smart and unique with humor thrown in. Can't wait for more in the series. My two elementary age kids love to read them on their own."}, {"userName": "Cindy", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/50398829-cindy", "userReview": "This is the third book in this series and I think it is our favorite. It's full of action, humor and great pictures. Thank your for the advance review copy. We loved it."}, {"userName": "Penny", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/6897701-penny", "userReview": "I won Book 3 in the Gertrude and Toby Adventures – Gertrude and Toby Meet the Wolf written by Shari Tharp and illustrated by Jim Heath from a contest on GoodreadsIt’s Friday and after Farmer Sam heads to town, Gertrude and Toby set off for another fun adventure.They’ve decided to go fishing and each has their favourite bait they are going to use. They decide whoever catches the most fish using their preferred bait, gets to pick the following Friday’s adventure. During the fishing trip, a boy runs past them a couple of times yelling “A Wolf, A Wolf is coming” Gertrude and Toby investigate but there is no wolf and they resume fishing. However the 3rd time, there is indeed a wolf who has captured the boy and plans on making him in next meal. Of course Gertrude and Toby are there to help and are able to free the boy and the 3 take off with the Wolf in pursuit. They come across a Brick House and who lives there but the 3 pigs.I love the way Shari Tharp weaves different fairy tales into a new story. Kids will love these books.The illustrations are just great – simple for kids to understand but captivating."}, {"userName": "Laura (Book Scrounger)", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/33792597-laura-book-scrounger", "userReview": "This book interested me because my son's name is Toby, so I thought he'd enjoy reading about a character with his own name.I think at 4 he's a bit young for this, but it is still a cute story. He was a bit scared of the picture of the wolf grinning evilly in his cave, about to cook a boy in a stew. At one point he didn't even want to finish reading, but he did, and I think he'll enjoy it more as he gets older. It also helps to be familiar with the story of the \"Boy who cried wolf\" as well as \"The three little pigs,\" because this is basically a cartoonish mash-up of both of those, with Gertrude and Toby along for the ride.It was nice that Gertrude (a goat) and Toby (a tortoise) had distinct personalities and things they said, and there was some humorous banter and situations too. Definitely fun for older kids.(In compliance with FTC guidelines, I disclose that I received this book for free through LibraryThing Early Reviewers. I was not required to write a positive review.)"}, {"userName": "Jessica Bronder", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/5781282-jessica-bronder", "userReview": "It’s Friday once again and Gertrude and Toby plan on going fishing while Farmer Sam is in town. They decide to have a contest to see if worms or beetles will catch more fish. They happen to come across a boy yelling about a wolf. They decide to just fish when sure enough the boy is being drug by a wolf into a cave. Gertrude and Toby go help him but end up leading him to the pigs house. I love the combination of traditional stories for the adventures that Gertrude and Toby find themselves in. The little boy who cried wolf is surprised to find himself in the wolf’s cave about to be cooked. But thankfully our heroes are there to help him and the pigs. This is a wonderful children’s story, lots of adventure, and some beautiful artwork. This book will appeal to both kids and adults alike.I received Gertrude and Toby Meet the Wolf from eBook for Review for free. This has in no way influenced my opinion of this book."}, {"userName": "Stephanie", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/21498502-stephanie", "userReview": "Gertrude and Toby are off for another Friday Adventure! This time they are going fishing at Trout Lake. However, they are constantly being interrupted by a young boy shouting that a wolf is coming. Finally, the young boy is caught by the wolf. Gertrude and Toby decide to help the boy, but end up leading the wolf straight to his favorite meal, the three pigs!One more amusing adventure for Gertrude and Toby, this time combining the fairy tales of The Boy Who Cried Wolf and The Three Little Pigs. I loved that Gertrude and Toby continue to show that friends can have differences and that teamwork is best. This unlikely pair also shows ingenuity for the silly problems that they tend to get into. My little one loved the colorful but simple pictures of the comical animals.​This book was received for free in return for an honest review."}, {"userName": "Amy Koster", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/9958869-amy-koster", "userReview": "Gertrude and Toby are the best of friends who live on McFarland Farms. They are always on the lookout for a great adventure. Then one day they run into a wolf that is up to no good. How will they outrun the wolf and still manage a great adventure?My first grader and I read this book together. He read it to me and we both loved it. It was easy enough he could read it and entertaining enough to keep him engaged. We loved their problem solving skills and how the characters work together. A great read for all ages. We loved it and so will you!*Please note I received a copy in exchange for an honest review. All opinions are my own."}, {"userName": "Shannon", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/17352639-shannon", "userReview": "This is the third Gertrude and Toby tale. Gertrude and Toby are a goat and Tortoise duo who go on adventures while Farmer Sam is off on his errands. The author uses fairytale characters in his stories. This book combined the boy who cried wolf with the three little pigs. The drawings are simple and pleasant. The story is easy to follow and is entertaining. I won this book in Goodreads' giveaway, but the opinions are all my own."}, {"userName": "Beth McGuire", "userReviewDate": "May 08, 2017", "userURL": "http://www.goodreads.com/user/show/52097714-beth-mcguire", "userReview": "GERTRUDE AND TOBY ARE DELIGHTFUL ANIMALS THAT EVERYONE WILL LOVE. THIS BOOK IS A GREAT READ FOR ANY AGE. THE ILLUSTRATIONS ARE GREAT AND LITTLE ONES WILL LOVE TO JUST LOOK AT THE PICTURES. THIS IS THE THIRD BOOK IN THE SERIES AND WAS AS GOOD AS THE FIRST TWO. IT IS FUN AND LOTS OF CHARACTERS FROM OTHER BOOKS KIDS LOVE. GERTRUDE AND TOBY ARE ALWAYS ANXIOUS FOR ADVENTURE AND THEY FIND IT. THEY MEET THE BIG BAD WOLF, THE LITTLE BOY THAT CALLED WOLF AND THE TREE LITTLE PIGS."}, {"userName": "Linda Cain", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/32619202-linda-cain", "userReview": "Excellent book with wonderful illustrations. Thank you to Goodreads for the chance to read this. My 3 1/2 yr. grandson loved it ( we read it 3 times at once). It was exciting, even a little scary and led to much discussion . The choice of helping out or simply running away if there is trouble and the concept of negotiating in a difficult situation was presented."}, {"userName": "Amber Jones", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/35771154-amber-jones", "userReview": "Such a cute lil childrens book. Gertrude and Toby are just amazing characters and I love how they balence eachother out.This one is great for a flair from the fairy tale sides. Love love love this author and how she creates each story.5 stars"}, {"userName": "Jenn", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/57912843-jenn", "userReview": "I won a copy of this book.Cute story about two friends (a tortoise and a goat ) who live on a farm and have an adventure. This was book 3, but my first introduction to the series. Little kids will like the story."}, {"userName": "Lynne Moody", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/32853015-lynne-moody", "userReview": "I loved this story and the kids loved it too. It shows that no matter what help people and teachs kids to know how to do this by reading this book. I loved all the illustrations in the book . I won this book on a giveaway on Goodreads."}, {"userName": "Jennifer Hicks", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/61133738-jennifer-hicks", "userReview": "Won this book and gifted series to my niece and also nefew they loved it"}, {"userName": "Teresa", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/8759612-teresa", "userReview": "My grandson will love this book. Thanks for the contest. I received my copy in a giveaway here on Goodreads. Thank You!"}, {"userName": "Rubina", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/64392552-rubina", "userReview": "Lovely and beautifully illustrations with engaging characters and a great story. A must read for children. I loved it and would recommend it to everyone. The book was awesome and perfect"}, {"userName": "Janet", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/7242665-janet", "userReview": "This is a delightful book. I love the adventure and the characters. This was a Goodreads giveaway winner."}], "description": "Gertrude the goat and Toby the tortoise are going fishing at Trout Lake for their Friday adventure. While at the lake, they see a little boy being dragged off by a hungry wolf! They follow the wolf and rescue the little boy, but the wolf doesn't give up. He goes after them, determined to get his lunch back!Book 3 in the Gertrude and Toby fairy tale adventure book series", "title": "Gertrude and Toby Meet the Wolf\n      \n          (Gertrude and Toby #3)", "url": "http://www.goodreads.com/book/show/30823274-gertrude-and-toby-meet-the-wolf", "average": 4.44, "cover": "https://images.gr-assets.com/books/1473781550l/30823274.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/14784914.Shari_Tharp", "name": "Shari Tharp"}], "type": ["Childrens"], "outlinks": ["http://www.goodreads.com/book/show/30823274-gertrude-and-toby-meet-the-wolf", "http://www.goodreads.com/book/show/28269196-gertrude-and-toby-s-friday-adventure", "http://www.goodreads.com/book/show/30752315-gertrude-and-toby-save-the-gingerbread-man"]}