{"ratings": 30, "userreviews": [{"userName": "Donna Hokanson", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/11102806-donna-hokanson", "userReview": "Predestined or Pre-known Gideon was once human turned Vampire, turned Guardian, then choose to fall from grace and turned Dark Angel. He’s got a bit of resentment going on. Persephone changed Gideon when she seen him “save a woman” from getting hit by a car, or that’s how she saw it. Thinking he was dying from the wounds from getting hit by the car, not knowing he was an immortal vampire, she made him into a guardian. 50 or so, years later, Father sends Persephone down to Gideon, to try to help him, after he turns dark. It’s the first time she finds out he wasn’t human to start. A lot happens and trying to keep Persephone safe become Gideon’s mission, because he knows she won’t give up on him and he’s destined himself to end up in the underworld. Or so he thinks. This book is unlike any I’ve ever read. You got action and adventure and a bit of humor throughout it. It’s unlike anything you’ve ever read before and so worth your time in reading. Well written self-contained story that’s very entertaining to read."}, {"userName": "Eniko", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/8492498-eniko", "userReview": "AUDIOBOOK editionAn interesting and unexpected take on supernatural. A hybrid? YUPHuman to vampire to Angel to Fallen Angel, Gideon's tale is interesting and unique. In Ms. Hamilton's style, the story grips the listener from the beginning. Looking forward to see where is this series going in the future.4 starsLoved Mr. Hart's voices, as usual he excels in bringing the story to vivid life.5-stars"}, {"userName": "Heather", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/11157899-heather", "userReview": "This was the start of a new paranormal series by Sharon Hamilton. It was an interesting twist on the typical paranormal romance. What happens when one of the good guys gets bored with being a good guy and wants to let his inner bad boy out. While the book didn't grab me immediately as some of Sharon Hamilton's books often do, I'm glad I stuck it out."}, {"userName": "Debbie  Victorino", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/60387645-debbie-victorino", "userReview": "AmazingI fell in love with this book. I couldn't imagine a guardian angle, vampire. But wow her story was great. Her writing style is spot on. This has love, hate, struggle, immortal beings, and a HEA. This was just a great book I couldn't put down."}, {"userName": "Audio Audits", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/9382087-audio-audits", "userReview": "Sharon Hamilton does paranormal? I was intrigued, I love Ms. Hamilton’s military romance series and was excited to see her take on a completely different genre. Gideon is a darker, violent and more sexually explicit book than the SEAL’s series in my opinion.I think fans who enjoy PNR are going to enjoy Sharon Hamilton’s unique spin on this genre. Gideon is suspenseful and definitely keeps you on the edge of your seat and there’s no cliffhanger! I can’t wait to see where the series goes from here.JD Hart narrates all Sharon Hamilton’s books and it’s no wonder, his fully voiced productions are a marvel and this one is no different. The sound and audio production are done to perfection.This audiobook was gifted to me exchange for an unbiased review!"}, {"userName": "Karin", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/5272374-karin", "userReview": "Fall From Grace Book One.Gideon is the only one of his kind - a vampire turned angel. After being relegated to Watcher status for years, he decides to let his vampiric nature override his angelic side. In a spectacularly public display, Gideon drives a blood mobile over the side of the Golden Gate Bridge, destroying the bridge in the process. Persephone is sent by her Father to guard Gideon and keep him from fully turning dark. When she sees a dark shape whisk away Gideon's chosen lover, she wakes him and warns him of the peril. Joined by Gideon's only angelic friend, Francis, Persephone and Gideon set out to eliminate the threat to Gideon and the humans surrounding him.If you're looking for a new take on the Vampire/Angel hybrid, this is the book for you!*I received this book from the publisher in exchange for an honest review."}, {"userName": "Beth Tilley", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/5493820-beth-tilley", "userReview": "Super Fantastic!! Gideon is bored, he's been \"watching\" the world go by on his perch from the Golden Gate Bridge. As an angel, it was task given to him by the Supreme Being. He goes off the rails, steals a blood bank bus and destroys the bridge. He becomes a fallen angel, as a direct result, and his protector angel, Persephone, is worried that she cannot keep him safe. Gideon quickly becomes the focus of the Underworld and the Red Queen, everyone is out to get him. Tables turn and now Gideon must keep his love, Persephone, out of danger. With the help of a few friends, Gideon takes on the Underworld in the name of love."}, {"userName": "Meredith", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/27592669-meredith", "userReview": "Gideon the handsome fallen angel. Your heart breaks when you hear how miserable and lonely he is. I loved his tales of mischief. He has you laughing out loud. The detail of the scenery is amazing, I felt like I was at the vineyard. When he found his true love and lost her it broke me again. So glad he got his happy ending."}, {"userName": "Niki Driscoll", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/25918776-niki-driscoll", "userReview": "An interesting storyline with unique characters starts us on our journey in Ms. Hamilton's new series. I have to say it was not what I expected but I was pleasantly surprised as the story continued. The concept that even angles can make mistakes made the characters more real and made it easier to relate to the human feelings they displayed during the course of the tale. I really wanted to dislike Gideon as a character, but found I did understand his anger and resentment. I did not agree with how he showed his displeasure but could relate to his acting out. Persephone seemed like an odd match to our much more worldly Gideon, she was sweet and naïve and I felt like the Father was setting her up to fail when he sent her to find Gideon. Theirs is not the usually love story, boy meets girl and falls in love, it is definitely going to be a work in progress but it was worth the read. I volunteered to review this story for my honest opinion."}, {"userName": "Karlee", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/37837136-karlee", "userReview": "Gideon is a once human turned vampire then saved by a guardian angel. Being a hybrid vampire angel, the Supreme Being wasn't sure what do to with him so he placed him as a watcher. After many years of this, Gideon became bored and decides to fall from grace. The Supreme Being sends Persephone, the angel that saved him before to try and save him again. After the two fall in love, they have many hoops to go through wether it be fighting the underworld or Gideon's maker herself before they can live peacefully together. But will they ever get that chance? Loved this story and really thought it was neat with what the author did with Gideon's character. You don't see that type of a paranormal being ever, well you do as separates by not as hybrids. Can't wait to read the next book in this series!"}, {"userName": "Karen", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/7031628-karen", "userReview": "It a decent read but lacked the spark I normally get when reading this author's books. Interesting story concept but I would have like a little more character building to make it flow smoother for me. I was given an arc for my honest review"}, {"userName": "Julie Beasley", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/7835444-julie-beasley", "userReview": "I really enjoyed this new series by Sharon Hamilton. It was an interesting mix of different characters and weird inventions which interacted well into the story. It had some nice hot, sensual love scenes . Gideon is a hybrid hero, whom I really liked. His heroine was an interesting one too. I liked her secondary characters, especially Francis."}, {"userName": "April", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/26987933-april", "userReview": "I am not normally fan of the paranormal genre. I was given the opportunity to read and voluntarily review Hamilton's first in a new paranormal series.I was blown away by the creativity in the creation of the characters and how they drew me into the story. The novel is well imagined and unfolds like an epic love story. The age old battle of good vs. evil was well recorded in the love story of Gideon and Persephone. I highly recommend this book to fans of the genre."}, {"userName": "Rhonda Ziglar", "userReviewDate": "Jan 18, 2017", "userURL": "http://www.goodreads.com/user/show/43707574-rhonda-ziglar", "userReview": "Gideon by Sharon Hamilton......What a fantastic start to this new series. This is a new genre for me and it was flipping amazing, I could not put it down until I finished it. There are Vampires, Guardians, Dark Angels, Angels, lots of action, romance, Love and drama. I loved watching the story unfold for Gideon and Persephone, it hit all my emotion buttons. I would highly recommend this book, it was amazing. I voluntarily reviewed an advance reader copy of this book."}, {"userName": "Brittany", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/21816980-brittany", "userReview": "Gideon was a great read. The first chapter jumped around a lot but once the story got going, it was great. I have never read a story when a vampire turns angle/watcher but still wants his bad side. This make for a very interesting story. There was a lot of action, romance, and drama that kept me reading. Very good book and I cannot wait until the next one comes out."}, {"userName": "Sandy", "userReviewDate": "Jan 23, 2017", "userURL": "http://www.goodreads.com/user/show/10697814-sandy", "userReview": "DifferentWhile this was definitely not my favorite book from Sharon Hamilton, it still had all the good qualities of her other books. It was very well written and keeps you reading to see what will happen next. The subject matter is my least favorite, but that is personal taste."}, {"userName": "Ella", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/32300254-ella", "userReview": "This is not my usual choice of books, the story was a good story but for me it was not sucking me in as much as I'd have liked. With that being said, once i finished with the book it was a nice love story."}, {"userName": "KimberlyDawn", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/26025826-kimberlydawn", "userReview": "This book has a lot going on, action, romance, suspense. Loved it, and can't wait for the next one!"}, {"userName": "Barb Shuler", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/28167387-barb-shuler", "userReview": "*audio review copy received from author*Well.... this just goes to show you not all \"dark\" angels are bad and not all good, are good. I liked this story. It was a tiny bit slow in the beginning, took a little to get into it but boy howdy, when it did start rolling... it was off to the races. HahaI'm a huge fan of Sharon Hamilton, and I love meeting new characters. I love Angel stories and with the mix of craziness she brings into these characters lives, you just get wrapped up in the story. Or I do anyway. Gideon is an angel but not just any angel, he's a vampire/angel hybrid who happens to be a guardian. Tasked with keeping the suicidal humans from jumping to their deaths on the Golden Gate Bridge. But, after 60 years atop the cables, he's bored, hungry and he needs to get laid. Like, seriously, he's a typical man there. When he causes mayhem, kidnaps a woman and then turns her into his willing bed buddy.... well things go topsy turvy. He's assigned a guardian, and not just any guardian... no, he gets to look into he eyes of the woman that \"saved\" him and made him an angel. To say he's not pleased to see her is to put it lightly. If not for the supreme being's protection, she'd be so meat. But.... as with anything in life (real of not) things happen. Now, Gideon and his guardian are on a mission. One that will lead them to the Latrell's of their lives, and back again. Darkness falls upon them and the only way to survive is to fight. Together they have to make a difference, thing is, they have to be able to stay alive, not lose faith and... believe what's before them is real. Escape means freedom, that freedom will lead them to an eternal love."}], "description": "Gideon's Fall From Grace comes after one too many boring days atop the Golden Gate Bridge as a Watcher. Tethered by celestial restraints and feeling abandoned by the very beings who \"enhanced\" him, he rebels in a very public fashion, forever altering the San Francisco skyline. At first he just wants to escape. But later, he wants revenge from a heartless Supreme Being and his angelic minions for having ruined his immortal life. Can a freak who dwells somewhere between Heaven and Hell find love and happiness in a typical Wine Country small town?", "title": "Gideon: Heavenly Fall\n      \n          (Fall From Grace  #1)", "url": "http://www.goodreads.com/book/show/32705523-gideon", "average": 4.1, "cover": "https://images.gr-assets.com/books/1476879127l/32705523.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/5752621.Sharon_Hamilton", "name": "Sharon Hamilton"}], "type": ["Romance", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/32705523-gideon", "http://www.goodreads.com/book/show/34521014-gideon", "http://www.goodreads.com/book/show/34146908-gideon", "http://www.goodreads.com/book/show/15715864-accidental-seal", "http://www.goodreads.com/book/show/16299267-fallen-seal-legacy", "http://www.goodreads.com/book/show/18634933-seal-under-covers", "http://www.goodreads.com/book/show/21533800-seals-of-summer", "http://www.goodreads.com/book/show/15715869-seal-encounter"]}