{"ratings": 53616, "userreviews": [{"userName": "Kimiko", "userReviewDate": "May 22, 2014", "userURL": "http://www.goodreads.com/user/show/7374931-kimiko", "userReview": "I had such high hopes for this book, but it turns out that now I’ll be writing one of my only truly negative reviews on Goodreads…Sophia Amoruso has surely accomplished a lot with Nasty Gal, and I respect her work ethic and ability to achieve success with rough beginnings and little formal education. However, I expected this book to relate more to those in her generation – instead, she turns out to be yet another naysayer of the Millennial generation, writing them off as lazy and spoiled. For someone in her early thirties with a lot of life left to live, she often puts herself up on a pedestal and talks down to readers, taking herself more seriously than necessary. Also, she seems frustratingly lacking in self-awareness and empathy – she often writes as though everything she has earned is wholly “deserved” and that the universe provided what she was “owed”, without honestly acknowledging that many out there who have likely worked harder and longer than her haven’t gotten nearly as much success. For example, at one point she writes about how bringing children to a job interview is an immediate turn-off for her; does she not realize how many single parents in poverty cannot afford childcare? How else are they supposed to make money to provide for their family? This is only one instance out of many where she lacks the ability to relate to those less fortunate than herself. In fact, she spends a whole chapter refuting the idea of luck, and claiming that her “positive thinking” brought opportunities to her… nice thought, but it comes across as entitled and naïve.While there are moments of amusing anecdotes and inspiring stories, in general it seems that Amoruso has little more than tired old clichés to offer in terms of business advice."}, {"userName": "Sophie", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/2400462-sophie", "userReview": "I put off reading this book for a long time because \n#GIRLBOSS\n is the most vomit-inducing book title I can think of and now I have read it I wish I hadn't bothered. \n#GIRLBOSS\n is peculiar mix; it's a book that doesn't know whether it wants to be a memoir or if it wants to give business advice. Most of Sophia Amoruso's memories are irrelevant and self-absorbed, with humble brags littering the pages. Sophia constantly reminds readers of the \"meteoric rise of Nasty Girl\" and how her \"own profile has risen with it\" not to mention all that money she is making and how she gets \"congratulated on a daily basis,\" and then she reels off a list of achievements just in case we didn't already realise how successful she is. I don't doubt Sophia probably has some wise words to share about running a business, it's the way she goes about sharing it that I have a problem with. You would do well to heed your own advice, Sophia: \"It’s not cool to get drunk on your own success.\""}, {"userName": "Renee", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/33376011-renee", "userReview": "Having been Nasty Gal's first intern during the early days in Berkeley when it was just Sophia and Christina (the first full-time employee who is now Buying Director), my rating may be a little biased so feel free to take everything from this point forward with a grain of salt.I won't bother with a short summary as this book has gotten enough press and reviews from readers alike that that just seems redundant. What I will say is that having worked with Sophia firsthand and having accompanied her on what was Nasty Gal's second buying trip ever, her work ethic is a cut above the rest; she eats, sleeps and breathes Nasty Gal (always has and probably always will). There are parts in the book where she may come across a bit lofty, but she's just telling it like it is and not making any excuses. She briefly touches on the subject of extroverts and introverts, mentioning \"psychologists now believe that social media is a really valuable tool for introverts, because it allows them to communicate and even network on their own terms.\" Being an introvert herself, #Girlboss is the creative outlet through which Sophia speaks, on her own terms.What makes Sophia such an icon to girls around the world (partly) is her relatability. Her story is one with a \"Cinderella-esque\" theme in a male-run tech start-up world, and it's easy to think / feel like something similar could happen to any of us so long as you just follow Sophia's magic formula. But she is one in 400 trillion (if you read the book, you'll get what I mean). And what she doesn't reveal directly in #Girlboss - though hints of it are given along the way - is that she is a voracious learner, an avid reader and a (hyper)critical thinker with killer business gumption. Not all of us innately are or possess these qualities, though this is something that is absolutely within our power to change, adopt and/or improve upon. In my opinion, these are just some of the most common characteristics I've seen across-the-board of successful entrepreneurs, and just above-average humans in general.All in all, the book is a quick and entertaining read with snippets of slightly outrageous (and hilarious) stories from Sophia's past, wisdoms imparted by many other #Girlbosses (including fashion designer Norma Kamali, Christene Barberich, editor of Refinery 29 and Leandra Medine of Manrepeller.com), and learnings from Sophia's arsenal of books (including of course, the Harvard Business Review)."}, {"userName": "Jenny", "userReviewDate": "Jun 28, 2014", "userURL": "http://www.goodreads.com/user/show/327785-jenny", "userReview": "I had never even heard of Nasty Gal when I picked this e-book from the library. But the title seemed fun and I always enjoy reading business books - especially ones that tackle the unique issues that face women.But this? This is not that book.I'll say this - Sophia has done a great job of getting where she is now. She's obviously creative and obviously hard working. But I don't know who this book is written for. It is mainly biographical which is fine - but then has these #girlboss lessons that made me cringe. One page will assume you've never put together a decent resume and then a few pages later it's giving you advice about how you can't be friends with your direct reports. It seems to assume that I have no business experience and am in charge of people - mainly because that's what Sophia dealt with - absolutely no business experience or formalized business education and was in charge of her own business. Which is awesome for her but rare that others will go on that sort of #girlboss trajectory. Also, it's extremely difficult to read the book and she's mentioning that in meetings she gets annoyed when people don't talk to her directly because they assume she doesn't know what she's talking about but then says she often makes people repeat themselves a number of times until she understands the business concepts because she has no training but she's the CEO so she has to understand. I know she got where she is by not going to business school but maybe she could look into a little bit of formal training? It's not an employees job to give you a crash course in topics they learned in their MBA.I think I would have enjoyed this more if it was just a straight biography and gave up the pretense of telling people how to be #girlbosses.I also googled Nasty Gal after reading the book and came upon a Glass Door page where the company is rated VERY low in employee satisfaction and a trustpilot page where it also is rated very low in shopper satisfaction. It made it seem as if the author lacks awareness about her company. This is not Lean In for a younger generation."}, {"userName": "Jessica", "userReviewDate": "Nov 06, 2014", "userURL": "http://www.goodreads.com/user/show/7861723-jessica", "userReview": "I so wanted this to be good, but after reading the introduction, I knew that I was probably not going to enjoy it. After she addressed the issue of whether or not her book was a feminist manifesto by saying that she believes in \"showing up and owning it\" not \"whining\" for equality, I was pretty much soured on everything else she had to say. But I persevered. And while there were some good parts of the book - she does have some interesting things to say about venture capitalism and hiring and firing - there were so many other things that made me want to throw the book against the wall in abject frustration. For a book that purports to be about women who don't take themselves too seriously, I don't think I have ever read a book by a person who took themselves MORE seriously. The most frustrating part for me was when she said that she didn't believe in luck. Like this multimillion dollar company that she built up from nothing, which experienced unprecedented levels of growth such that industry professionals were all agog, exists simply because Sophia Amoruso was the first person in the world to discover working hard, and there were no outside forces outside of her control that influenced the situation and helped her to get there. And then, after those few paragraphs, she goes on to talk about chaos magic and positive thinking (not like The Secret but basically if you think positively, things will happen for you) and says, \"If you let yourself meander a bit, the right things and the right people will fall into place.\" Which sounds a hell of a lot like luck to me. Contradictory, self-indulgent, tone deaf and frustrating. Pretty disappointing."}, {"userName": "Nat", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "In #GIRLBOSS, Sophia Amoruso recounts her life from stumbling upon her passion of selling vintage clothes online and becoming an unlikely businesswoman to building her retail fashion empire. Along the way, she realizes the value and the difficulty of being the #GIRLBOSS of her own life.“The energy you’ll expend focusing on someone else’s life is better spent working on your own. Just be your own idol.”This book started out interesting enough, but it gradually lost its steam in the second half when Amoruso began sounding like a broken record. Also, the author's bragging and over-the-top tone was a little off-putting at times, so I ended up skimming the last 50-100 pages.I did, however, really look forward to the illustrations featured throughout:\n\n\n\n\n\n\nAnd I would like to pay homage to that first half by quoting some of my favorite phrases:“I, along with countless other #GIRLBOSSes who are profiled in this book, girls who are reading this book, and the girls who are yet to become a #GIRLBOSS will do it not by whining—but by fighting. You don’t get taken seriously by asking someone to take you seriously. You’ve got to show up and own it. If this is a man’s world, who cares? I’m still really glad to be a girl in it.”I also loved the chapter about her school experience:“So, #GIRLBOSS, if you suck at school, don’t let it kill your spirit. It does not mean that you are stupid or worthless, or that you are never going to succeed at anything. It just means that your talents lie elsewhere, so take the opportunity to seek out what you are good at, and find a place where you can flourish. Once you do, you’re going to kill it.”I didn't know I needed this, but I did.“You have to kick people out of your head as forcefully as you’d kick someone out of your house if you didn’t want them to be there.”“I have a friend who told me something recently that really resonated. He said that he felt like he’d “gotten off at the wrong stop,” as if there’s a bus traveling through space and time that randomly opens its doors and drops souls off to live through whatever time they’re assigned. I don’t believe we’re all fit for the time we’re assigned. It’s a weird world we live in, and until time travel exists we’ve all got to make the most of where we land.”“No matter where you are in life, you’ll save a lot of time by not worrying too much about what other people think about you. The earlier in your life that you can learn that, the easier the rest of it will be. You is who you is, so get used to it.”\nOverall, #GIRLBOSS had a nice starting point, but ended up lacking that special something that I love in memoirs such as Buffering or Born a Crime.2.5/5 stars*Note: I'm an Amazon Affiliate. If you're interested in buying #GIRLBOSS, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Ami", "userReviewDate": "Jun 06, 2014", "userURL": "http://www.goodreads.com/user/show/127893-ami", "userReview": "It's overwhelmingly clear from the book that Sophia Amoruso is a hard worker. She's dedicated to her business, she's extremely talented at what she does, and I suspect she'd be pretty fun to attend a party with even thought she would probably make you wear silver leather pants. That being said, this book just didn't do it for me. Amoruso neglects the more fascinating elements of her story, like the fact that she went from being the \"youngest person at a San Francisco Marxist book club\" and eating dumpster bagels to being a CEO with a brand-new Porsche. I don't mean to slam her for changing her mind on capitalism, but it would have been very interesting and pretty informative to see exactly how that transition happened and whether she thinks that is appropriate for everyone. Instead we get vague pieces of advice like, don't bad talk your boss on social media after you're fired. There's a chapter that outlines the importance of using sigil magic to ensure your progress through ranks that felt totally off the wall. The off-the-wall-ness does work for her sometimes, especially within the context of a business book. Sheryl Sandberg certainly isn't telling you about the Halloween she dressed as a 70s Blaxploitation character and tried to beat up her boyfriend's ex. Those stories, and how they helped her become a better person, are silly and illuminating. I just wish there were more of them."}, {"userName": "Heidi The Hippie Reader", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/7986781-heidi-the-hippie-reader", "userReview": "#GIRLBOSS is Sophia Amoruso's story about her wild childhood, unlikely and extraordinarily successful business venture and her treatise on how to be yourself and bring what is unique to you to your professional life.I googled Sophia after I finished this book and was dismayed to discover she has declared bankruptcy.It seems she still has a successful motivational speaker program going on, but, for whatever reason, her business hasn't worked out.I suspect, she will land on her feet and start again. That is a large part of the philosophy contained in #GIRLBOSS.\"In about eight years, I went from a broke, anarchist 'freegan' dead set on smashing the system to a millionaire businesswoman who today is as at home in the boardroom as she is in the dressing room. I never intended to be a role model, but there are parts of my story, and the lessons I've learned from it, that I want to share.\" pg 23, ebook. Sophia believes in being yourself. Let your freak flag fly. Embrace your weirdness- because that is what ultimately makes you great.\"#GIRLBOSS is a feminist book, and Nasty Gal is a feminist brand in the sense that I encourage you, as a girl, to be who you are and do what you want. Being a Girlboss is as much about being the boss of your career as it is of your home.\" pg 29, ebook.Between Sophia's business tips and memoir, she includes quotations. Such as: \"It was the straying that found the path direct - Austin Osman Spare.\" pg 56In her case, that was absolutely true. Sophia wanted a job where she didn't have to work and could get paid for doing, essentially, nothing.She found that job and surfed the internet most of the time. In doing so, she studied online communities like MySpace and eBay and concluded that she could network and sell items with the best of them.And she did.Sophia is a believer in creating your own reality: \"... there's also the everyday kind of magic that we make for ourselves. And that's really not magic at all. It's just recognizing the fact that we control our thoughts and our thoughts control our lives. This is an extremely simple, totally straightforward concept, but for a lot of people, it's so alien that it might as well be magic.\" ebook, pg 109.Sophia, like Obi Wan Kenobi, does not believe in luck. She believes in hard work, action and selective focus.\"Focus on the positive things in your life and you'll be shocked at how many more positive things start happening. But before you start to think you just got lucky, remember that it's magic, and you made it yourself.\" ebook, pg 115.Come bankruptcies and whatever else, I believe Sophia Amoruso will be just fine. Don't you? :)"}, {"userName": "Karina", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/8933844-karina", "userReview": "Funny, entertaining, sassy, sarcastic, and incredibly smart. Amoruso manages to bring her funny/sarcastic personality onto these pages while seriously teaching about what it means/takes to be a girlboss. I took so much from this book and I have a strong feeling I'll be rereading it once I'm done with university. The balance between the casual narration style and spot on intelligent business/life advice is fantastic. It makes reading it so easy and 100% struck a nerve with me. Pick this up if you feel like you need a motivational push in your life no matter what area of your life you need said push for. This book is all about kicking ass and being your personal best against all odds. Highly recommend!"}, {"userName": "Kelsey Searles", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/30780078-kelsey-searles", "userReview": "From the first page I knew I wasn't going to like this book. (\"don't let the man get you! #girlboss!\"... gag...) Beyond it being poorly written (sounds like a teenager's rambling life story), it doesn't have any true focus or offer any innovative or interesting advice. Most of the advice (work hard, don't have typos in your resume, attention to detail) are well known, common, and repeated in countless books, television shows, etc... (and honestly something you'd learn in high school or college, had she completed those efforts...) She also comes off as an un-relateable and unbelievable character. She worked hard in all her jobs? And yet most lasted no longer than 2-weeks? She does an incredible amount of bragging about her successes and everyone loving her, and rambles her way through her story at a very high level. I found myself constantly irritated with her. Good for you for starting a successful company, that's awesome. Your story just isn't interesting or well written enough to tell. Nice thing: its short and has pictures. So I finished it in a day and moved onto something far better."}, {"userName": "☘Misericordia☘  ⚡ϟ⚡ϟ⚡⛈   ❂❤❣", "userReviewDate": "May 29, 2018", "userURL": "http://www.goodreads.com/user/show/6603759-misericordia", "userReview": "Ahem... This book was overly flippant on a lot of things. A lot of stuff sounded controversional. Some of it plain stupid. The approach to business felt as in the 'wring-them-and-kick-them-out' attitude. The 'I recognise the crazies during job interviews' approach is, well, irritating. I don't think this gal is a professional psychologist any more than she is a professional businessman or a writer.The general originality might merit this book 1,5 star. The rest is a very successful exercise in irritating me."}, {"userName": "Jenna ", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/24806763-jenna", "userReview": "I thought that perhaps I was a freak of nature until I read this book and realized that there is someone out there so much like me! Therefore, I found this read quite inspirational. Sophia Amoruso started her own business, now worth $100M, from scratch and pocket change. She never knew what she really wanted to do until she found herself caught in the middle of a prospering company, while feeding a hobby that she hoped would keep her from having a job where she had to talk with people. She never went to college and I believe she didn't finish high school but she's extremely intuitive and street smart. She's not afraid to speak her mind. She also doesn't allow others to intimidate her and although this book isn't a literary masterpiece, she has a way of showing the reader that in order to get ahead that you have to keep pushing and never back down. I am a bit confused, however, about how she exclaims that traditional education isn't for everyone and some of the smartest #girlbosses started organically or from experience yet I noticed on her career opportunities page that she lists her job's qualifications and requires that they all have the traditional education that she says isn't needed for everyone to succeed. In the end, I found this book to be thought provoking and hopeful. I am in a similar situation as she was as far as having surgery and then feeling stuck and wanting to work on my own terms and peacefully and I could see how someone can use this book to inspire them when life gets a bit tough. So, I definitely credit Sophia for giving me that extra pick-me-up when I so desperately needed it during a very difficult transition in my life."}, {"userName": "Elizabeth Schlatter", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/398304-elizabeth-schlatter", "userReview": "So I mistakenly thought this was going to be about being a boss. It's really about the author, her life, her mistakes, what she's learned from them, and the meteoric success of her online company, Nasty Gal, which sells clothes. Certainly it's impressive that Amoruso became such a successful entrepreneur, at so young an age (I think she's now 30), and by utilizing social media to not just shape a distinct brand but also to identify, target, and respond to her customers. But the book is mainly ALL about her, with, quite frankly, many cheesy cliches and quotes that aren't much better than those inspirational sort of posters with text and sunsets in them. To quote from the back flap of the book, \"I have three pieces of advice I want you to remember: Don't ever grow up. Don't become a bore. Don't let the Man get to you, Okay? Cool. Then let's do this.\" ...... sigh.... really? Is this advice useful to people, to anyone??? Amoruso's savvy approach to details, customers, and being a good job applicant and entry level employee are sound, but they're certainly not novel nor are they applicable to being a #Girlboss, or any type of boss. I can't remember how many times I read something along the lines of \"fly your freak flag.\" Oy. I'm probably also frustrated because it's so, GRRRRRRRLLL Power-y and because Amoruso works in the field of fashion. Makes me wonder if there are books about women shaking the trees in more male dominated fields, like math or science. Speaking of the tech world though, this book is not \"Lean In\" and it never pretends to be, so that's not a valid criticism. But I still would've appreciate more depth in Amoruso's writings. I mean, if she's going to just talk about herself, going beyond \"here's where I screwed up and here's how I changed\" would help make the narrative more compelling and ultimately more applicable. I will say that I greatly appreciated how Amoruso recognized the irony of her outrageously fast financial success contrasted with her teenage years and early 20s spent amongst avowed anti-establishment, anarchist peers. Clearly she has embraced the fruits of capitalism and is using them to her advantage. She is unashamed of this about face, which is kind of fun. As opposed to some people who try to couch their entrepreneurial enterprises in social or political responsibilities to suggest they are still true to their anarchist roots."}, {"userName": "Janelle Zhao", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/15813486-janelle-zhao", "userReview": "I have tremendous respect for her, for what she stands for, and for what she has built. But this book fell short on delivering something substantial. I realize that this was geared towards teens and adolescence so for them, I highly recommend it. But if you are close to Sophia's age, you might find it a little too preachy...at times, like she refuses to take off her public persona to show a real glimpse of herself. I almost stopped reading the book immediately after the first chapter because of its eerie similarly to cheesy self-help books, but gave the second chapter a try. Much better. My biggest take away from the book is the chapter on money. Not spending outside of her means until she had 1 million in her bank is impressive. Especially with today's youths maxing out their credit cards the second they get it. At times I had a sneaky suspicion that she was writing this book to instil discipline to her employees..."}, {"userName": "alexandra", "userReviewDate": "Nov 13, 2015", "userURL": "http://www.goodreads.com/user/show/6784858-alexandra", "userReview": "4.5/5#GIRLBOSS was just as fantastic as i expected it'd be. (and in a really teeny-tiny way, that disappointed me but, for the most part, i loved this novel.)this is a book that i would recommend to every human. never read non-fiction novels? great, go read this. don't care for fashion? mmmm, still go read this. not a girl? who cares, go read this. it's a book that i found very honest, quick, and empowering. sophia amoruso shares her journey on how she went from dead broke to $100 million in eight years, and in the process, touches ideas on creativity, business, and personal morals/ideals. after finishing this novel, i feel motivated to go out and DO SOMETHING. the only issue i had was that the pacing got a bit slow in the middle. there'd be chapters that i adore adore adore that really stuck with me, and there'd be ones that i felt i was slugging through. (although that might've been because i was already quite tired while reading those parts..) i also found it a bit difficult to picture her timeline since the chapters are mostly told in topics and mini anecdotes. but other than that, i truly loved this novel. my favorite aspect is probably amoruso's honest voice. when asked about their success, most people would respond with a shrug and probably saying something like \"hard work, timing, and luck.\" but our author KNOWS her success is all hard-earned and didn't come with luck. she did some fairly awful stuff, which i don't completely agree with, but ultimately find admirable. there's no sugarcoating, and instead of finding it disheartening and overwhelming, it's inspiring. if you're relatively interested in business or need a motivational read, PICK THIS UP NOW."}, {"userName": "Jen ", "userReviewDate": "Jan 09, 2015", "userURL": "http://www.goodreads.com/user/show/7144402-jen", "userReview": "4.5 stars\t1. #GIRLBOSS is written by someone who didn't go to college. Before you back away from this book, hear me out with my nine other reasons.\t2. #GIRLBOSS is bad-ass, and inspires me to be a bad-ass myself. One who can conquer ANYTHING.\t3. Sophia Amoruso is so hilarious. I ACTUALLY laughed out loud on pretty much every page. In public. \t4. #GIRLBOSS gives really great advice on, sure, business and getting jobs, but STREET SMARTS too.\t5. #GIRLBOSS really resonated with me in that it makes me want to be productive ALL THE TIME. DO ALL THE THINGS.\t6. The book is pink. How can you not??\t7. #GIRLBOSS taught me that no, you don't have to go to college if you don't have to, and that you can still be a #GirlBoss without a college degree.\t8. #GIRLBOSS taught me how to appreciate what you have and use it. Don't waste it.\t9. #GIRLBOSS taught me that #GirlBosses aren't superhuman. They're just like you and me.\t10. #GIRLBOSS inspired a confidence in me for my future.Check out this review and more atBooks and Other Happy Ever Afters"}, {"userName": "Korrina  (OwlCrate)", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/37437502-korrina-owlcrate", "userReview": "For me, this book was perfect. It had so much to do with confidence, which is what I need right now, so it spoke to me. I know I'll read passages from it many times in the future and I'm so grateful it was given to me. I'd encourage all women to read it!"}, {"userName": "Ashley Reid", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/27613955-ashley-reid", "userReview": "This was a mostly amazing book, I would recommend it to anyone, even if you are not a female entrepreneur.The author has a great outlook on life and the book inspires you to have more confidence in yourself, even if you feel like you are failing at what you think you should be doing."}, {"userName": "Alaina Meserole", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/50620706-alaina-meserole", "userReview": "Now I know this is a series on Netflix but before I dove into that.. well, I wanted to read the book way beforehand. After reading it I'm kind of hesitant going into to watch it.. but as long as I have wine and snacks.. I'll be good.#GIRLBOSS is about Sophia Amoruso. IT's her story about how she went from a little ebay store to a real life business woman. Not that I'm hating on ebay workers or anything.. because I don't!! Just mentioning that she created a business from that little ebay job. Sophia was freaking awesome. She's a hard worker and she knew what she wanted in her life. So, of course, she worked even harder to get there. She wasn't just one of those people who sat, did nothing, and constantly complained. Nope, she went out into the world and tried to make it her bitch. Just the overall message throughout her book, and some quotes, just made me happier. Yeah, I'm not where I want to be in business world right now.. but I'm just starting. I know I'll get to where I want to be later in my life..but I'll just have to work even harder to get there a lot sooner.Overall, I really liked this book. Nah, I loved it. If Sophia ever needs a new bestie she can call me."}, {"userName": "Sad Sunday", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/22985424-sad-sunday", "userReview": "Patronizing.\nSummary:\"Look how awesome I am! GIRLBOSS. GIRLBOSS. I reached everything by myself! You can do it too! I am so amazing! I learn everything! I hate capitalism! GIRLBOSS. Ohhh, I am so like you! You can do it! I am so original and creative! There is no bad job! I even believe in magic and sigils! I had nothing and now I have so much! And I did it! You can do it! Go for it! We are an awesome company! GIRLBOSS.\"Uhhhh... I know Sofia is awesome, she did so much (I never heard about Nasty Gal before thou, and even if their prices are fine, I didn't find anything I liked - I guess I am not that nasty...), but the book feels like she just wrote it in one sitting, without anything really useful for young girls. It lack continuity - Sofia starts with her younger years (the beginning) and the mixes everything - job interview advices, business success secrets, her life, more advice and even more information about her. As a person, who doesn't need constant \"You can do it!\" attitude shoved in my face, I couldn't help, but to roll my eyes. I somehow imagined that a boss of her caliber had a more mature attitude and had more to say."}, {"userName": "Elizabeth", "userReviewDate": "Feb 01, 2014", "userURL": "http://www.goodreads.com/user/show/1762033-elizabeth", "userReview": "While it was truly interesting to read about the creation of Nasty Gal and Sophia's atypical rise to success, and while I respect and admire anyone who makes something from nothing, gosh I wish she would have been a little bit more humble. And not so in your face with the WORK WORK WORK YOUR ASS OF GIRLBOSS TAKING NO SHIT EAT SLEEP BREATHE WORK HARD WORK. It turns me off and I doubt it's as fun to work with her as she says it is. I found her \"bad girl\" years a little too celebrated. She was a pretty serious shop lifter, a lot more than a couple of nail polish bottles here and there, and I find it weird that it's all laugh laugh wasn't that a hilarious time now I'm a respectable CEO. Also a lot of the \"business advice\" was pretty straight forward and repetitive. I didn't need a book to tell me not to talk shit about my employers on social media. It was hip and fun and cool to read about someone who stuck it to the man. But now she kind of is the man. And for someone who hates words like \"edgy\" and \"twerk,\" she sure has a lot of annoying phrases to share. Let your freak flag fly. Oi vey."}, {"userName": "Karatepop", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/2501347-karatepop", "userReview": "Sigh. This is written like a really long blog post. I completely disagree with her attitude about money and hard work and reward. I think putting something out to the universe and making it so is bullshit. I think different people have different ideas of success. I think people who choose to be poor because it's cool and \"screw the man, man!\" are naive and belong in a Pulp song. I think if you grow out of that phase and just shift to the other end of the spectrum, you aren't any less naive.. just different.I have to organise my notes. I'll either tumblr or try to do a quick video."}, {"userName": "Katie", "userReviewDate": "Oct 31, 2014", "userURL": "http://www.goodreads.com/user/show/5306694-katie", "userReview": "NO! NO NO NO! This book does not deserve any sort of award! Unless you are in 6th grade and have never spoken to anyone about your future, do not waste your time, money, brain power. This book is one of the most mindless, judgmental, condescending, self-inflating, poorly written book on business. Sophia Amoruso may have a successful business but the way she talks about her achievements makes her seem like the first ever CEO. The advice is trite and she doesn't actually indicate what you can do to succeed. I know I need to work hard to get a promotion and that doesn't mean look at Facebook all day. I didn't need to buy a book to tell me that. She also was very judgmental towards certain types of people which came off as someone with know life experience or self-awareness.Furthermore, the book was written terribly! Aside from the 16 point font and thick pages, the writing was atrocious. There's no way she had a ghost writer because at least the ghost writer wouldn't have written it like a 14 year old angsty teen. And her editor must think she's a joke. In one of the featured #GIRLBOSS stories, the writer said she \"put the pedal to the medal.\" PEDAL TO THE MEDAL?!And the use of #GIRLBOSS throughout the entire book? It's print media...why is there a freaking hashtag?This was so incredibly disappointing and the worst book I read all year. Please do not waste your time."}, {"userName": "charlie ⚖☭❣", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/55369514-charlie", "userReview": "This was the most self involved piece of writing I have ever read. EVER. I only skim read it because, for the most part, I didn't care about this random woman's anecdotes about her life. Why was this written? Why?Let me discuss my main problem. Multiple times throughout the book, Amoruso says the thing she's good at is free marketing. Free PR. HELLOOOOOOOOOOO THIS IS EXACTLY WHAT THIS BOOK IS. THERE IS NO #GIRLBOSS, AMORUSO DOESN'T GIVE A SHIT ABOUT US, SHE IS JUST GETTING FREE PRESS FOR NASTY GAL. WHY ARE PEOPLE MISSING THIS?!That is the whole idea behind the book! That's why there's no actual business advice, it's just Amoruso catering towards a wide audience so people buy it, lap it up, and then want to shop at Nasty Gal. The whole title being a hashtag = PROMO. It's all just fucking promo and it's fucking bullshit.I don't care about the memoirs of some woman who I don't know. Her advice is lackluster. It's all just crap. 300 pages of fucking crap. There was some nice stuff about fashion that made me go and buy a vintage Victoria's Secret robe at the charity store I'd previously written off, but for the most part, this book was bullshit.B U L L S H I T.I'm not wasting anymore words on it."}, {"userName": "Jennifer Jacobs", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/26492706-jennifer-jacobs", "userReview": "Perfect book!Funny and sharp!Bad girl attitude at it's best!This seems my kinda book!Just got it on kindle 5 mins ago and couldn't put it down!!Will update my review as I read :)25% update!Wow!I was able to read 25% within 2 hours!The book is superb easy to read!Very fun,inspiring too:)Another woman who did even shiitier things in her days of struggle is none other than Madonna:) (I highly recommend J.Randi Taraborelli's biography of Madonna!One of my favorite books ever!)I am very impressed with Sophia's story and life!Wow,she's a hero and an inspiration!To all mums out there,make your 17yo daughters read this book!This will inspire her(much more than nagging!!)Fun aside,I am very happy I got the book!Soo looking forward to read it 100%(which will be very soon lol)"}, {"userName": "Rachel", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/1070103-rachel", "userReview": "Full disclosure: I kind of view audiobooks as cheating, and this was my first audio book. When Goodreads emailed me saying I could have a free audible version of #Girlboss because I had marked it as \"to read\" I jumped on it. I read Tina Fey's \"Bossypants,\" and still regret not having gotten the audible version so that I could HEAR Tina Fey reading me her book.This book was not read by Sophia Amoruso, and I cannot imagine what it would take to flawlessly read a book, chapter by chapter, and intone what the author wants to intone into every word and anecdote. That said, while I appreciate the effort, this particular reader mispronounced \"ennui,\" making me question the very fabric of the English language and whether or not I knew how to speak it. I mean, was I wrong all this time and no one corrected me? Where else had I heard it? Could I somehow make someone say it for me? Then she mispronounced Roald Dahl and I realized, no, no. I have a handle on this. SHE doesn't.All of that is to say, please take my review with the grain of salt that is my resistance to audio books. The content of the book is a little bit like listening to Britney Spear's \"Work B*tch* on loop for the 4 or 5 hours that it takes to listen to this book. At times inspiring, often irritating (sidenote: why does Britney adopt a British accent for just 1/4th of the song?), and, in the end, too much. Honestly, I felt like she told her story in the first two chapters and hooked you, but then filled in stupid details (OMG you once wore Abercrombie and believe in magic?) without real content for the next 10 chapters. She quotes a lot of really pithy, overused cliches like Steve Jobs and Leonardo DiVinchi and seems to mock everyone who does things differently than she does. \"When I was in high school, I always submitted a real resume for retail jobs...\" which is great, because it's obviously worked for her. But it's also just not the only way to do things (when I was in high school and worked retail and some toolbag came in with a printed resume, we laughed at them and thought maybe they weren't prepared for the real world of retail service, and made them fill in our paper application.) For example, after explaining how Nasty Gal grew out of her own feelings of ennui and anarchy, the author preaches positivity as, \"your thoughts become your actions.\" So...#hypocrisy? Often contradictory (do as I say, not as I do) and often condescending (although, again, maybe that was just the audio version coming across that way to me) I felt all my initial inspiration wane and grow into irritation. It was with great difficulty (and a long plane ride) that I finished this book. My recommendation? Read the first three chapters, watch the Britney video twice, and call it a day."}, {"userName": "Banny Carstairs", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/19835637-banny-carstairs", "userReview": "Actual rate 2.5 I liked it overall, I'll even apply some of the advices in my professional life. Also, the \"Portrait of a #GIRLBOSS\" sections, very empowering; thumbs up.But there were too many paragraphs and chapters that felt kinda out of place, repetitive and that contributed nothing."}, {"userName": "Betsy Step", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/23124509-betsy-step", "userReview": "More realistic and inspiring than Lean In."}, {"userName": "Nicole ☼", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/22639791-nicole", "userReview": "This won the Goodreads Choice Awards for Best Business Book? Wow. There must have not been any other business books released this year. Pink cover, hashtag title, cutesy, sophomoric, unprofessional writing that, if personified, would resemble the inside of a Bath & Body Works (for the record, I love Bath & Body Works. I go there every Christmas to get candles and delicious-smelling gifts for loved ones). But when it comes to passing on professional wisdom with the goal of being taken seriously, this is not the book. At least it wasnt for me. In fact, this book is the perfect example of why female professionals have a hard time being taken seriously in a male-dominated world. It's the perfect example of why I've always preferred to work under the tutelage of male bosses (Note: Obviously not all men are brilliant or demand respect, but generally speaking, I find their business acumen to be on the practical side versus an emotional one.)I'm not saying Ms. Amoruso isn't smart or that her business has \nno\n business being successful. But to have this particular book receiving such praise just seems questionable. It basically reads like a woman sitting at home, in loungewear, casually blogging or having coffee with her girlfriends. Again, not that there's anything wrong with that, but when it comes to business, be professional, act professional. If a woman can \"get it done\" in a professional manner, without bringing gender, a giant chip on her shoulder, and a Glass Ceiling speech to the party, then I'm her biggest advocate. When I read business books, I'm always on the lookout for valuable, substantial knowledge that can (actually) help me get ahead - or at least maintain a consistent level of success - and earn respect from bosses, clients, customers, and peers. And as someone who hopes to be heading my own company one day, I also look to inspired bosses and company owners for ideas on how to stand out from a crowd, be different, while filling needs in Consumer Town. Anecdotes are fine, but fine-tune your experiences and break them down for me. Give me the whys and hows, the pros and cons, the ins and outs of your business model, management style, and daily operations; how you mustered up contingency plans, etc. But I don't expect much from a company that has a rich history of knocking off high-end designs and selling them at huge markdowns. Their rip-offs are so good that you can barely tell the difference between the designer brand and Nasty Gal's. They even post celebrity photos on their Instagrams with a link to the item in their shop. If that isn't huge cajones, I don't know what is. I should have known better, though. Nasty Gal isn't exactly Ivanka Trump.★ Just a quick sidebar to clear up any misconceptions that I am a feminist because I'm 100% not. I do, however, believe in equal work, equal effort, and equal \"bang-for-buck\" results before equal pay. Lt. Beth Davis from \"Stalker\". Now here's a woman I would kill to work under. Too bad she isn't real."}, {"userName": "Hannah", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/6172424-hannah", "userReview": "Very inspiring!!! I'm a #GIRLBOSS"}], "description": "Da ragazzina, Sophia Amoruso girava in autostop, rubacchiava nei grandi magazzini e rovistava nei cassonetti della spazzatura. A ventidue anni, per campare, sembrava ormai rassegnata a un mediocre lavoro impiegatizio con tutta la frustrazione e la mancanza di stimoli che questo comportava. Fu a quel punto che un giorno decise di vendere vestiti vintage su eBay. Otto anni dopo, Sophia crea la Nasty Gal, un’impresa on-line da 100 milioni di dollari, con 350 dipendenti, un autentico impero della moda. Una storia vera come quella di Steve Jobs e di Mark Zuckerberg alla quale Sophia ha dato una definitiva, forte e frizzante impronta femminile. Sophia non è mai stata un tipico imprenditore né un tipico alcunché: viene dalla strada. Ha scritto #GirlBoss per raccontare la propria ricetta per il successo: una storia molto personale che può valere per tutti.", "title": "#GIRLBOSS", "url": "http://www.goodreads.com/book/show/24468795-girlboss", "average": 3.7, "cover": "https://images.gr-assets.com/books/1421091867l/24468795.jpg", "reviews": 3442, "authors": [{"url": "https://www.goodreads.com/author/show/7341059.Sophia_Amoruso", "name": "Sophia Amoruso"}], "type": ["Nonfiction", "Autobiography", "Feminism", "Business", "Self Help"], "outlinks": ["http://www.goodreads.com/book/show/24468795-girlboss", "http://www.goodreads.com/book/show/18667945-girlboss", "http://www.goodreads.com/book/show/22442670-girlboss", "http://www.goodreads.com/book/show/23281742-girlboss", "http://www.goodreads.com/book/show/22857958-girlboss", "http://www.goodreads.com/book/show/29093237-nasty-galaxy", "http://www.goodreads.com/book/show/34419229-the-girlboss-workbook", "http://www.goodreads.com/book/show/26877420-the-small-business-guide-to-growth-hacking"]}