{"ratings": 43, "userreviews": [{"userName": "Dianne", "userReviewDate": "Jun 11, 2013", "userURL": "http://www.goodreads.com/user/show/7395171-dianne", "userReview": "Richard Clayborne is a super ambitious young marketing exec on the fast track to success with a large firm, AlphaBanc. He is offered an intriguing assignment, to set a trap to catch an evil and twisted computer geek, the Gnome, the main suspect in the murders of three women on the streets of Chicago. But as Richard fumbles his way along, he discovers that just maybe, there is other evil afoot and is shocked to find it might be in his own backyard. Is AlphaBanc overstepping their boundaries regarding the data they hold about each and every person? Have they crossed the boundaries of propriety in order to have total control over the population? How does one stop this insidious behavior?With a huge cast of characters woven into this frighteningly realistic sci-fi plot, there is always something going on , the pace is near frantic at times and a scorecard may be needed! Is this a hint at OUR near future? Will the computer age and information highway become our own worst nightmare?Glass House 51 by John Hampel could be viewed as a warning or wake up call to all of us, because, face it, this could be happening as we speak! That said, Mr. Hampel has created an intriguing thriller that will keep you on the edge of your seat, away from windows, your computer, and possibly wearing a foil hat over your head! If you like the thrill of a near-future read, entwined with the limitless possibilities of a small data chip, the human brain and some nefarious villains hiding behind possible government involvement, grab your e-reader and hang on while you watch a cyber apocalypse unfold!A review copy was provided by NetGalley and Bzff Books, Inc. in exchange for my honest review.Publication Date: February 28, 2013Publisher: Bzff Books, Inc.ISBN: 9780962799228Number of Pages: 432Genre: Science Fiction, Futuristic Sci-fi, Techno ThrillerRecommended Age: AdultsMy Rating: 4 StarsAmazon / Barnes & NobleFor more reviews check out Tome Tender's Book Blog or find us on Facebook."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "May 26, 2013", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "The author himself states that he was going for 1984 and Brave New World in Glass House 51, but I couldn't honestly say it was as nuanced or creative as either of those well-loved novels. It is a thin story stretched over a warning of what can happen when we give up privacy, only instead of the government being at fault, it is a mega-corporation that has been consolidating data for years. The government wasn't able to keep up (not too far off base). It reminds me of some of Cory Doctorow's work in the way that it is more about the information the author is trying to communicate than the story itself. The evil corporation is too obviously evil, even self-stating it at times through various higher-ups. Control of information is much scarier when it can't be stopped."}, {"userName": "Becca Twitchell", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/20230112-becca-twitchell", "userReview": "This was a Goodreads giveaway! But I wasn't sure how many stars to give it. I was not impressed with the choppy dialogue. It was hard for me to focus on the story because I was so preoccupied with every character's penchant for stuttering. Along with the awkward dialogue, and another reason I wasn't sure what to rate the book, was that much of the technical stuff went straight over my head; however, in the end, I really did like the book. At first I thought I wasn't going to get the story at all because of my limited knowledge concerning computers, but I was pleased to find that Hampel made the plot relatively easy to follow. (Easy enough to make me absolutely paranoid about being on the grid - I had thoughts of moving out to the woods, John Malovich in Red style, with my secret underground house and tinfoil hat). Hampel did a good job portraying all aspects of a \"slow subtle techno-death\" that is altogether frighteningly real."}, {"userName": "Angela", "userReviewDate": "Jan 16, 2017", "userURL": "http://www.goodreads.com/user/show/4878068-angela", "userReview": "Quite often I'm a fairly quick reader, but sometimes I pick up a book and it takes me a few weeks or even more than a month to get through it. Not because I find it dull, but because I'm enjoying it so much and am reluctant to finish it.This is an excellent dystopian novel. Hampel clearly understands what it takes to create an honestly terrifying and possible society, and this one is scary for the very fact that it could well be a possibility, if not already in the making. Digital data is vast and who really knows who is controlling it, and whether they are creating a digital footpath of each individual (some in order to target advertisements and the like, others a lot more devious and disturbing). This book takes that notion one step further and explores what could potentially happen if we, as a society, put all our digital trust into one repository (and obviously owned by a massive and evil empire), as well as exploring the steps said evil empire and its employees would do in order to further their gains. For me, what makes this a successful dystopian novel is that it clearly could come to pass, and what with it being set in modern day makes it all the more apt.The novel itself starts off a bit choppy, what with the to-ing and fro-ing to various characters, however, once you get used to this, it really does just flow and all the separate storylines come together. Despite not really seeing the comparisons to Brave New World and 1984 initially, there are nice little nods to these superb novels throughout, often with names (Huxley, O'Brien, and even a Room 101, although not used in the Orwell way.) I particularly enjoyed the nod to the drug Deludamil and the comparison to the drug-induced society of BNW.After a slightly shaky start, I have thoroughly enjoyed this. An advance reader copy was kindly given by the publishers via Netgalley"}, {"userName": "Rusty Dalferes", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/20196999-rusty-dalferes", "userReview": "I was fortunate enough to win this through a Goodreads First Reads giveaway, so I thank the author, the publisher, and Goodreads for the opportunity to read it.This was an OK story, but I wasn't either under- or over-whelmed by it. It sort of runs in the middle between good and terrible, and never really grabs the reader into excitement or forces the reader to throw the book across the room in disgust. It just sort of is, and I'm sorry to say that it wasn't terribly memorable either in a positive or a negative way.Just because my editorial brain kicks in early, I'll start with the mechanics. The book definitely could have benefited from a revision by a skilled editor. There were typesetting issues (misplaced paragraph breaks, missing quotation marks, etc.) that might be attributed to the printer, but the proliferation of other niggling mistakes makes me think that many of these were the author's issues that could have been cured by a pass-through with another set of editorial eyes: overuse of ellipses (seriously, he uses them HUNDREDS of time in this book), misplaced apostrophes, certain spelling errors, choice of syntax (\"compliable\" as opposed to \"compliant\"). The totality of these little mistakes sometimes made the book difficult to read.As to the plot, it's not technical enough (or, quite frankly, thrilling enough) to be labeled a \"techno-thriller,\" even if the subject matter has to do with corporate data mining of personal information and biochemical means of influencing consumers. It's a story about high-level computer hacking and information gathering that never really gives the reader a good technical idea of HOW those activities are conducted. This is complicated by the fact that through approximately the first half of the book, no main protagonist or antagonist is identified, so each chapter switches to a different set of characters ranging from techno-geeks to mid-level marketing workers to high-level execs to security officers to neo-Luddite blackhat hackers, and none of these different characters really gets an in-depth treatment of his or her job or personality. It's not funny enough to be a comedy, or serious enough to be a hard-boiled thriller. It's a book that's hard to pigeon-hole into a proper genre, mostly because it doesn't quite meet all the requirements for any of the standard genre novels.Also -- and this may be personal to me -- a lot of the peripheral characters (who turn out to be part of the underlying conspiracy) all have names that begin with the same letter, but appear in the story so rarely that it becomes confusing as to who is whom. The character who emerges (after 2/3 of the book) as the main protagonist is a bit of a milquetoast sort, kind of wishy-washy, to the extent that it's hard for the reader to get completely compelled by what happens to that character -- he doesn't need to be a superman, but he needs to be compelling enough for the reader to identify with him. And it bothers me that EVERY SINGLE female character in this book (including the main love interest) is either a vamp or a victim (sometimes both), with very little personal strength and no real effect on the outcome of the story.That said, it did have some bright spots in its effort to educate about the \"evils inherent in the multiple indexing of databased personal information.\" It also had some flashes of brilliant writing that, unfortunately, were too sparse to call the entire novel well written, but with phrases like \"central time, Midwest time, farmer time, sublime time, everything a sweet hour earlier than our East where they stay up too late, get up too early, work too hard, die too young...,\" you can tell that the author has some skill in him. I only wish he had put more of that skillful writing on the pages in this book.In sum, I'm not sorry that I read this book, but I can't say that I'm all that grateful for having read the story, either. As I said above, it just is."}, {"userName": "Laurel Bartlett", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/9859936-laurel-bartlett", "userReview": "When I started reading Glass House 51, stories of IRS targeting and massive NSA complexes devoted to large scale surveillance of American citizens had not yet appeared in the news.At that point, the book was nothing more than a modern adaptation of 1984 and Brave New World - two books I'd read in high school. Back then I cared more about how much AquaNet I needed to achieve maximum bang height than about whether the government was keeping track of or trying to manipulate my every move. My perspective has changed, obviously, in the last 25 years and I had high hopes for this modern amalgamation of Orwell and Huxley's dystopian classics.On its own, Hampel's story is ...ok.It took me a long time to get through the first half, which was mostly slow-moving set-up with quite a bit of character development. Still, after all that set up, the motivations of the main characters were unclear, personal relationships between characters just happened without pretense, and several subplots were dropped with little resolution. Just when Hampel gets into the meat of something... he seems to drop it in favor of moving on to something else.The second half does move more quickly and satisfies a few of the mysteries presented in the first half, but not in a particularly creative way.What makes this book relevant, I suppose, are the recent headlines, the stories about government surveillance and privacy invasion. Glass House 51 is a chilling example of what the wrong people can do with the kind of power that comes with massive amounts of information gathered and used in secret. The technology and capacity for its use represented in this book are all readily available today. Cast in light of current events, the book is a disturbing realistic cautionary tale and becomes much easier to take seriously.I do wish Hampel had followed through with some of the potential plot twists he hinted at throughout the book. The philosophical questions that spring to mind while reading this book end up being far more interesting than the plot itself.Are we really in control of our election process?Is the lure of absolute power and unlimited resources so irresistible that we'd stop at nothing to achieve it? Is genuine artificial sentience possible, given enough processing power?Could enough data and enough processing power lead to an artificial intelligence that reached a level of omniscience?These are questions that Hampel hints at or at least inspired me to consider while reading this book, but ultimately he fails to address in any meaningful way. I suppose that's understandable, considering his job here was not to develop deep philosophical theory, but a story plot.But if he had used the potential answers to these questions, I think the book would have been far more interesting.In the end, he hasn't recreated the futuristic worlds as Orwell and Huxley saw them, but used the setting we already find ourselves in to spin a disturbingly realistic tale corruption, greed, and ambition in their worst forms.\nReview for NetGalley"}, {"userName": "Lyn (Readinghearts)", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/2124637-lyn-readinghearts", "userReview": "Recently I stumbled across John Hampel's book Glass House 51. The premise for this story centers around Alphabank, the largest financial institution in the U.S. The powers that be at Alphabank have picked two of their employees, Richard (no last name) and Cristin Darrow to be bait in their quest to draw out Norman Dunne, a reclusive computer genius who is a former employee, and a suspect in a series of murders of young women. What unfolds is a captivating story about power, greed, and control in the same vent as the classics dystopian novels like 1984 and Brave New World. In fact, the publishing blurb for the book states, \"Glass House 51 is humbly dedicated to George Orwell and Aldous Huxley,,,,,,They saw it coming; they saw it first; they warned us. We learned nothing.\" In fact, the story that John Hampel weaves in this book is a first rate story that combines all of the best elements of the classic Big Brother stories of the past. Reading the book was like reading 1984, Brave New World, Animal House, and Fahrenheit 451 all rolled into one, with the addition of an exciting thriller threading through the story. I loved the way that the author referred to these books throughout the story, but I also loved the way that he updated the themes presented in the classics to make this book relevant to the current times. The addition of a thriller story line only added to the suspense in the book and really kept me turning the pages. The main characters in the story were also masterfully done. I love books where the characters continually surprise me, and that happened in this books in many ways. At times I would think that I had a character figured out, only to have them do an about-face. This propensity to change and challenge my thinking of the characters really kept me interested to see what was going to happen next. I loved the way it also blurred the lines between the good and bad guys, and kept me on my toes trying to figure out who were going to be the eventual heroes. Unfortunately, this book has not gotten a lot of either press or exposure, which is really sad. It is a top-notch story with well developed characters that deal with important issues for our times. Is the story entirely plausible....probably not, but it has a lot to say to us about the information intensive age that we live in and lessons that it would be better to learn through fiction than through real life. Since neither of my sons were required to read 1984 OR Brave New World, I am going to direct them towards this book and hope that is sparks some great discussions among us."}, {"userName": "Lori L (She Treads Softly) ", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/4592109-lori-l-she-treads-softly", "userReview": "When John Hampel wrote Glass House 51 his goal was an updated version of 1984. What makes his take on the future so chilling now, is the current controversy on exactly how much personal information the government is collecting on all of us. In Glass House 51 the giant banking corporation AlphaBanc is collecting, storing, and using all kinds of information about their employees - and many other citizens. Richard Clayborne is an employee on the fast track to the inner echelon of AlphaBanc. But what exactly are the plans these power-hungry men (and woman) have and does Richard really want to be a part of these plans? And have they revealed their true reasons for wanting to catch the Gnome, a coding genius?I had to chuckle at Hampel's description of the programmers AlphaBanc seeks:“But seriously, it is the ones who fail to show up for the interviews, those who favor long hair down to their shoulders—or are shaved completely bald—and wear the same wretched plaid lumberjack shirt for weeks on end because they are positively glued to their workstations, those are the ones we seek out.” (Location 1277-1279)Take note of the following quote:“Well then the world we live in now is totally crazy—and really frightening,” said Clayborne. “Is that the trade-off today? Personal freedom, the right to privacy, sacrificed for our fight against terrorism?” “Right now it is. I have to admit that even I was kind of freaked out about the, uh, incredible surveillance technology out there, but now,” the Epenguin yawned, “I guess I’m just resigned to it...\" (Location 1708-1711)The absolute most chilling thing about Glass House 51 and AlphaBanc is the news while reading it. The collection of information on average citizens, the targeting of certain citizens, the complicity of technology companies in granting access to collect information, the new game system requiring a camera which is potentially always watching and listening ... Good golly! It is well on it's way to the new 1984 in John Hampel's Glass House 51. That's maybe all I want to say because this book review is probably already being flagged for my mention of this surveillance.highly recommendedDisclosure: My Kindle edition was courtesy of Bzff Books via Netgalley for review purposes."}, {"userName": "Cheryl M-M", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/5950050-cheryl-m-m", "userReview": "The concept is one that our society needs to be aware of.At the moment most of us spend our time on the periphery of technology and its true capacity for Big Brother like surveillance.The majority choose to ignore it or accept it as part of our era and the unstoppable advancement of science and technology. Then there are the others that are paranoid to the point of delusion about what exactly the upper echelons are doing with it. Then in the middle we have the people who do know and are at the heart of the wave of development.If you just take a step back for a moment and think about what it would mean or does mean that the powers that be have the right to look into, listen to and watch every aspect of your life if they choose to do so. In this book the author looks at what happens when someone abuses that surveillance system for their own nefarious purposes.Concept is interesting, but I found the actual presentation in regards to flow of the story lacking.When it came to the villains the author was evasive to the point of not enough info to follow the clue. It needed more clarity and structure. The sub-plot of the murders became stronger than the main one, which then begs the question is this a book about someone getting their rocks off by killing or about the subversive dangers of surveillance in the wrong hands.I received a free copy of this book via NetGalley."}, {"userName": "Teresa", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/4462737-teresa", "userReview": "GLASS HOUSE 51 is modern Big Brother, apocalyptic science fiction thriller. Not only can the reader see todays technology thriving throughout the story, but also a few things that are around the bend, just not publicly seen at this time. It offers us a different take on apocalyptic times foretold in the Bible with the mark, by integrating modern barcodes and an implant which allows for mind control by the Alphabanc executives. Best of all, the glass house is a twist the reader doesn't see coming.In the story, Alphabanc is the huge corporation attempting to control the world with plans for a grand unification in todays world. The people running Alphabanc have created a computerised system, nicnamed \"the Beast\", which has access to everything a person does via his computer trail and what they can't find on the computerised highway, they can dig up via cameras posted throughout society, as well as in the persons home. From the information gathered, the executives running Alphabanc have plans to control the world and keep themselves at the top. Although the story was a little slow in the beginning, it picks up and before you know it you're at the epiloge wondering where the time went. It leaves the reader thinking that maybe, just maybe all this technology in our daily lives does more harm than good, especially when it is in the hands of the wrong people."}, {"userName": "Emma", "userReviewDate": "Sep 14, 2013", "userURL": "http://www.goodreads.com/user/show/4248915-emma", "userReview": "I really, really wanted to like this book. It sounded good and just like the sort of thing I'd like. But there was just something I can't quite pin down about it and I couldn't get into it. I read the first few chapters and gave up on it. I hate giving up on books but I've more books than I know what to do with so I figured life's too short to read a book you aren't enjoying. The premise of this book worked for me but in the reading I kept finding a few bits that didnt work for me and in one or two places the phrasing struck me as off. The final nail in the coffin however was when something happened which I can only assume is going to be crucial to the plot but which seemed beyond unrealistic. Some books can do unrealistic very well. This might be one of them if you can get into it but I just couldn't."}, {"userName": "Nick Turner", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/11097748-nick-turner", "userReview": "What appears to be a battle-of-the-sexes plot develops into a secret conspiracy thriller. Tapping into anxiety about big data and how it could be misused by a few powerful corporations to silence dissenters, throw elections and exert malign control over everyday life.\tBrand names (including cigarettes) decorate the proceedings. There is well-observed dialogue, especially senior fat cats in the board room. One woman character is an executive but women are mostly depicted in passive roles. Sometimes the writing was verbose e.g. describing conventional technology (and the history of technology) at length - reading like a technical manual. One or two $10 words seemed out of place \"innominate\" - what's wrong with 'nameless', dude?I read a review copy from the publisher."}, {"userName": "Nick", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/301548-nick", "userReview": "I don't really know what to make of this book; it kind of reads like a boring fever dream, if such a thing is even possible. I'll freely admit I didn't make it very far, giving up after the author introduced 15 characters in 10 pages over the span of a confusing, painful exposition dump about a company called AlphaBanc that's getting ready to become the world's most powerful E-bank, but this serial killer nerd called the Gnome and I'm sorry, I seem to have slam-dunked this book into the donation pile and picked up something else to read. Might be worth seeking out if you want to read something bonkers, but not for me, I'm afraid.Grade: D-"}, {"userName": "Peg Schrader", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/4276398-peg-schrader", "userReview": "I love, love, love this book. I couldn't put it down. It is a fast paced well written story of banking and financial intrigue. It has a tempo that reminds me of John Grisham's work. You can't wait to find out what happens to the the hapless main character, Clayborne and if the evil corporate leaders will get what is due them. But more importantly, you are on edge during the entire book wondering what mega corporations really know about you and how they control your decisions. It is a great book and I strongly recommend it."}, {"userName": "Carrie", "userReviewDate": "Apr 10, 2013", "userURL": "http://www.goodreads.com/user/show/1886957-carrie", "userReview": "Many thanks to NetGalley for the chance to read this one...This story had a lot going on, which sort of got in the way a couple of times, and the characters didn't always speak or act in ways that made sense given the storylines (especially the women, which was really irritating), but the ideas presented were compelling. If you are at all inclined to believe in conspiracies, this book might send you over the edge- it certainly had me thinking about how much personal privacy we are giving away as a society/culture in the name of convenience and/or security."}, {"userName": "Daniale", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/26358921-daniale", "userReview": "I received this book for free through Goodreads First Reads. Mind...blown. Booom! Incredible. To walk around in the mind of John Hampel, I can't even imagine how exciting that would be. The volume of characters and depths thereof, this story was just riveting, start to finish. Once you get into it, there is no getting out until it's over. One of the craziest roller coasters I have ever been on."}, {"userName": "Julie", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/19479705-julie", "userReview": "Wonderfully written, full of suspense and drama. The story is laced with poignancy as well as many literary references that are fun to discover. It's a story embedded within a story. It also makes you realize how much data is collected on all of us everyday, and what happens with that data is chilling. This was a great read, I couldn't put it down, and I would absolutely recommend it to anyone who loves a good literary read, actually, I would just reommend it to anyone who loves a great story!"}, {"userName": "Nicole", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/23124089-nicole", "userReview": "Loved this book - very rich, got my attention and kept it to the end. A friend recommended it , and it doesn't disappoint! Lots of story lines, well written - really enjoyed it!"}, {"userName": "Jeff", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/18380468-jeff", "userReview": "It had a lot of things I didn't really understand about computers and stuff, the was confusing sometimes and I was lost a little bit, but all in all a pretty good book."}, {"userName": "Melissa Hutchins", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/19361704-melissa-hutchins", "userReview": "Amazing!"}, {"userName": "Mike Ward", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/9027419-mike-ward", "userReview": "I really enjoyed this dystopian tale set in the world of data and global finance - full review herehttp://0651frombrighton.blogspot.co.u..."}, {"userName": "Theresa", "userReviewDate": "Apr 11, 2013", "userURL": "http://www.goodreads.com/user/show/5860019-theresa", "userReview": "Glass House 51Hampel, John *A conspiracy theory in progress, and a list of traces only found through brilliant detective work, despite all the pit falls"}, {"userName": "shutterbug2009", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/16630500-shutterbug2009", "userReview": "Thank you so much for my copy!!! But I have to agree with some of the othr revews...I'm not sure why, but the story just didn't grab me..."}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Interesting book, but its techno-corporate setting was one that I just couldn't relate to (thank god for that!) and I didn't really connect with the characters, either."}, {"userName": "Suzy Wilson", "userReviewDate": "Sep 14, 2013", "userURL": "http://www.goodreads.com/user/show/17324595-suzy-wilson", "userReview": "Needs a good edit!"}, {"userName": "Marielle", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/14822353-marielle", "userReview": "This was a really good book With different out looks"}], "description": "Glass House 51 is the insanely amazing adventure—or misadventure—of a lifetime, of one Richard Clayborne, a hard-charging young marketing maverick at gigantic AlphaBanc’s San Francisco branch.Hyper-ambitious Richard has been offered an intriguing assignment: Get online via NEXSX and make e-time with the lovely, brilliant (and doomed) Chicagoan Christin Darrow. All to set a trap for the reclusive—and very deadly—computer genius, Norman Dunne, aka the Gnome.Why? Three lovely young women dead in the streets of Chicago. And the Gnome, a former AlphaBanc employee, is the main suspect. But there just might be another AlphaBanc agenda in the works. . . .Little does clueless Richard know what is in store: a tangled, twisted—and very treacherous—journey through the AlphaBanc underground, but by the time he realizes it, he’s in too deep to get out.From the author: For Glass House 51, I set out to write an updated recombinant version of 1984 and Brave New World. Well, I don't aim low. The result is a long look into a primordial dystopia, future present — what's happening now with a techno / human layer gone bad — or actually going bad, as the world slouches along to oblivion. This is where it all begins, ground zero, the beginning of the end — of privacy, freedom, dignity, perhaps civilization as we know it. The Dystopia Primeval.", "title": "Glass House 51", "url": "http://www.goodreads.com/book/show/17616844-glass-house-51", "average": 3.7, "cover": "https://images.gr-assets.com/books/1363543922l/17616844.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/133770.John_Hampel", "name": "John Hampel"}], "type": ["Science Fiction", "Mystery", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17616844-glass-house-51", "http://www.goodreads.com/book/show/19236256-glass-house-51", "http://www.goodreads.com/book/show/228749.Wherever_You_Go_There_You_Are", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}