{"ratings": 349, "userreviews": [{"userName": "Paul", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/36511432-paul", "userReview": "I'm not a huge \"Western\" novel genre man, but I get this book at Barnes and Nobel (hard cover) for $3.99 It started out ok, a little dull but ok. It grew into more dullness and tedium but it was ok. The characters were undefined (I was at page 200 and I could not remember any of the characters names). But still it was ok. After half way through I started reading just the beginnings of paragraphs (did not lose any elements of the plot or story). The characters were all very shallow and morally lost. There never was a climax in the story. And even though I'm almost finished I still was going to give it a 2.5 rating which I generally mark as a 3. but the ending was so utterly ridiculous and completely unrealistic (might as well been an alien martian man or woman coming down to save the day) I came away feeling 'What a Waste of Time!' 2 stars is freaking generous! Now I know why this hard cover book was under 4 bucks!"}, {"userName": "Cheryl", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/1179650-cheryl", "userReview": "I have mentioned many times before how much of a fan of Westerns that I am. Thus the reason that I was excited to get a copy of this book back when it was released. However when I started reading it, I was not feeling it as much as I had hopes for. So I stopped reading the book and forgot about it until recently. Thus I picked the book up again to start reading it. I only read a few more chapters before I put the book down but this time for good. There was nothing exciting about it or the people in it. The story seemed to move along slowly and the old world of Arizona was not given much details. Which I was most looking forward to."}, {"userName": "Anne", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/10927265-anne", "userReview": "Total disclosure: I am not a fan of Old West stuff. I jumped at the chance to interview Jeff Guinn because I loved \"Manson\" so much. But I read \"Glorious\" so I could at least say I read it and not insult him.Boy, am I ever glad I read it. I love it! Cash McLendon is now one of my favorite protagonists -- an heroic but flawed fellow. The women in the book are some of the strongest you'll ever meet -- especially Chinese immigrant Sydney \"Doc\" Chau. What a gutsy broad she is!!I can honestly say that, although the ending was totally satisfying, I didn't want it to be over. I could have read about these people and the little town of Glorious for a whole lot longer. Luckily for me, at least Cash McLendon will be back.You can hear my interview with Jeff Guinn here: http://annehollidaysbookblog.blogspot..."}, {"userName": "Lori", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/7950608-lori", "userReview": "I was a goodreads firstreads winner of the book \"Glorious:A Novel of the American West\" This turned out to be a pretty good book. It takes place mostly in the 1870s. the main character is Cash McLendon. He grew up poor always having to find a way to survive. some of the choices he made for survival while growing up involved betraying those who trusted him. When He meets Rupert Douglas a wealthy Industrialist, he is taken in eventually forced to marry Mr.Douglases daughter. a tragedy happens and McLendon must leave. He ends up in Glorious a small town in Arizona territory. He wants to find Gabrielle a young woman he knew and cared about in St. Louis where he grew up. He had heard that Gabrielle, his former girlfriend has moved to Glorious with her father. Most of the book takes place in Glorious a tiny town in the middle of nowhere. McLendon quickly makes friends with the town people, also hoping to rekindle a romance with Gabrielle. A lot more goes on in this book. many prospectors arrive to try and find silver that is rumored to be in the area. A wealthy man by the name of MacPherson, a greedy wealthy man who intends on taking over the tiny town of Glorious. add to this some colorful characters from the town.the rumor of apache Indians being nearby. this makes for a good story. I like Historical books that take place in different eras. Jeff Guinn gives a good description of what the town of Glorious may have been like during the 1870s. A interesting read with good characters."}, {"userName": "Karyn Niedert", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/11768919-karyn-niedert", "userReview": "I was provided the opportunity to read \"Glorious\" by Jeff Guinn by Goodreads, and wish to thank them and the author/publisher for this book.Genre: Western/Historical FictionSeries: Standalone (as of May 2014)Summary: Cash McLendon is a self-serving gent, having grown up poor and neglected by an alcoholic father in 1870’s St. Louis. His love for beautiful and smart Gabrielle is abandoned when he is offered the chance to marry into a wealthy family. A tragic accident befalls the newlyweds, and Cash flees St. Louis before he’s forced into an early grave.\t Cash drifts west, hoping to reconnect with Gabrielle. He finds her in a dusty little bump in the road called Glorious in Arizona Territory. Cash attempts to win her back, making good friends and dangerous enemies which threaten Cash’s chance at happiness and the livelihood of all the good folks in Glorious. In trying to be a better man, Cash finds that doing the right thing might be the end of him yet.Review and Opinion: “Glorious” swept me right into the story from the first page. Guinn set an ominous tone early on, and it was easy to envision 1870’s St. Louis and the dusty Western frontier. His character development of Cash McLendon continued throughout the book, making him an unlikely hero but a likeable character nonetheless. Readers will enjoy the banter between McLendon and the supporting characters. Guinn did a very good job in creating McLendon as a flawed human being who learned from his mistakes.Glorious is described beautifully as a harsh outpost in the American West. The townspeople and prospectors are drawn out in vivid words, and by the time the story ends, readers will feel as if they have made some good friends in this frightening but exciting town. Although I’m not a huge fan of Westerns, I really did enjoy this book and plan to read Jeff Guinn’s other novels.FYI: Other books by Jeff GuinnManson: The Life and Times of Charles MansonGo Down Together: The True, Untold Story of Bonnie and ClydeThe Last Gunfight: The Real Story of the Shootout at the O.K. Corral-And How It Changed the American WestThe Autobiography of Santa ClausHow Mrs. Claus Saved ChristmasOur Land Before We Die"}, {"userName": "Kay", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/9479685-kay", "userReview": "Very disappointing book. This book had interesting characters and decent plot but it didn't come together for me. It was predictable and slow paced. I did finish reading the book, but my heart wasn't in it. Recently I had read Larry McMurtry's book The Last Stand Saloon, which was sooooo much better."}, {"userName": "David", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/83785-david", "userReview": "A traditional western with a solid focus on the characters and their relationships as they build a new community on the frontier."}, {"userName": "Alex Weirich", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/74886544-alex-weirich", "userReview": "The book Glorious is a good book about the Wild West. Cash McLendon is the main character of the book. He is the son of an alcoholic and he had a difficult life. He grew up on the streets in St. Louis, Missouri. When he got older he made himself a success and met and married the daughter of an important and very rich man named Rupert Douglass. Something very bad happens and Cash runs away to the West after finding out an old girlfriend and her father have a store in a small mining town. He tries to hide out there, but Rupert Douglass and his men go searching for him.  I think this is a good book for young adults to read as it has action, drama, and adventure. If you like stories that involve the Wild West and suspense, this is the book for you. It has great locations and paints a good picture of what the mining towns and the settlement of the Old West was really like. The characters are very interesting and played a great role in the story and bringing the West to life."}, {"userName": "Shawna", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/1451913-shawna", "userReview": "I eagerly sought this out because I enjoyed Guinn's masterful nonfiction, unfortunately his talents did not translate to this novel. This book was slow to start, and plodded along without much of note happening. First I was a hundred pages into it, and thinking the villain he had fled from in St. Louis would should surely show up soon, then I was two hundred pages into it, thinking the same. Then I get to the climax and it seemed constructed solely to set up a sequel, so I felt cheated, and I am certainly not going to spend another 300+ pages churning the same ground like a luckless prospector hoping for a pay out, I'm going to cut my losses right here."}, {"userName": "Brooke", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/487581-brooke", "userReview": "It's hard for me to choose a star rating for this western. It has a pretty typical plot: small town in a territory has trouble with big businessman who wants to take over; outsider shows up and finds himself helping out. The writing is a little clunky at times. It's full of misogyny and casual racism, and there is a charactery with a learning disability who is misused. That's all typical for the 1880s, which is when this novel takes place, but it was still icky to read. However, I did enjoy it. I thought of it as an easy fluff read for when my brain needed a break. I really like westerns, and this is a decent one. I'm going to check out the next one in the series."}, {"userName": "Mal Kelly", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/37047604-mal-kelly", "userReview": "Though I did like the story as a whole, this book left me wanting to find a Louis L'Amour title that I've not yet read. Given the time period, and his previous history, one would think that the main character would be more adaptable to western living. Also, the trap that was sprung at the end didn't seem totally plausible when you take into account all that had gone before. Down the road I may wish to dive into the sequel and see what happens next to Cash McClendon. We shall see."}, {"userName": "William Howle", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/25859194-william-howle", "userReview": "This is a tiresome book and if I was not so stubborn, would have stopped halfway through. The book drags on and the ending leaves you hanging. I am a fan of western books and this is a sad excuse. I understand a sequel has been written, the cover praise falls into the category of \"fool me once, shame on you, fool me twice, shame on me\" therefore no sequel for me."}, {"userName": "Joel Lantz", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/11749683-joel-lantz", "userReview": "It was such a great book right up to the last page. Nothing like finishing a book and having absolutely no idea what becomes of most of the characters."}, {"userName": "Ivy", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/7476534-ivy", "userReview": "5 starsA very good book. Hope McLendon will be cleared of the charges.Can't wait to read Buffalo Trail!!!!"}, {"userName": "Christina Farr-Thompson", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/63196139-christina-farr-thompson", "userReview": "horribly boring. very slow."}, {"userName": "Michael Marcela", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/40204414-michael-marcela", "userReview": "Well written. A bit slow at the start but engaging nonetheless. Enjoyed it!"}, {"userName": "Art", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/786819-art", "userReview": "Cash McLendon flees his past and his dead wife by trying to revive another part of his past with his previous love.His quest takes him to Glorious, a small town in Arizona territory in the 1870s. But Cash is a flawed and not always likable character.Some parts of the Old West ring true in this first book in the series. But some ring a bit hollow. And it is taking a bit of time to figure out if I really like Cash or not. Even so, I will probably read the second book just to find out."}, {"userName": "C Baker", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/25295401-c-baker", "userReview": "I have read Jeff Guinn’s non-fiction and found them quite well done and rewarding. Here Guinn tries his hand at telling a true tale of the American West without the trappings of the dime novel exaggerations and gun smoke.The protagonist, Cash McLendon, grew up with an alcoholic father in St. Louis who didn’t really provide for him. McLendon survives by earning the trust of his employer by being a spy on employees and other business entities and quickly becomes his eyes and ears across city. His employer is a rich but viscous man whose main goal is to take over other people’s businesses through questionable business means, or by intimidation and violence if necessary.McLendon is not a bad person himself but he falls right into step with his employer and patron because he is intent on surviving and his ability to make friends, listen, and cajole people to do what his boss wants, or get information that can allow his boss to squash them, is how he’s made his way in the world.McClendon eventually falls in love with Gabrielle, whose father owns a dry goods store. Garbrielle also does good deeds across the community, including teaching people how to read. Over time, McLendon’s boss tries to muscle Gabrielle and her father out of business, and basically forces McLendon to marry his psychotic daughter. In the meantime, Gabrielle and her father flee West to a hardscrabble mining camp called Glorious.Unfortunately for McLendon, one night when his in-laws are out of town a serious issue comes up with one of his patron’s factories, and while he was told under no circumstances to leave his wife alone, he goes off any way to deal with the issue.Not to give too much away but some bad things happen and McLendon flees and eventually, because he knows his patron’s deadly enforcer is right on his heels, he decides to head to the town of Glorious to find his lost love Gabrielle. He soon finds himself in a very similar circumstance as before and must eventually take sides.The set up and unfolding of this novel is extremely well done and the characters and conflict that develops in Glorious are well thought out. The townspeople really come to life, to the key town founders to the gritty miners out to strike it rich. This is a superbly done Western that is quite realistic. It also sets up for the reader to follow Cash McLendon in future novels.Highly recommended."}, {"userName": "Brett Thomasson", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/19658976-brett-thomasson", "userReview": "It might be tempting to dismiss Jeff Guinn's Glorious when you read this cover blurb by \"Longmire\" series author Craig Johnson: \"If, like me, you've been waiting for the next Louis L'Amour or Zane Grey, the good news is his name is Jeff Guinn.\" But Guinn's not responsible for what other people say about him or for Penguin Putnam's decision to put silliness like that on his cover.And just because Jeff Guinn ain't Zane or Louis doesn't mean either he or Glorious is somehow substandard. A longtime reporter and author of several non-fiction books, Guinn manages to make his first outing with protagonist Cash McLendon a mostly enjoyable romp through the Arizona Territory in the first decade after the Civil War.McLendon had been married into a wealthy family in St. Louis, but tragedy sends him out West in search of an old flame whom he knows to be living in the prospecting town of Glorious, Arizona. Things don't proceed as he wishes with his reunion, so he resolves to leave the town on the next stage. Only he finds himself more and more caught up with the people of this tiny town, who are hoping and praying for the silver strike that will keep their town alive and maybe bring in enough people to stave off raids from nearby Apaches.Guinn gives Glorious a dry, wry semi-comic tone that echoes the voices of Charles Portis or Larry McMurtry. He is patient in drawing out his plotline, giving us time to learn the characters and their situations as McLendon does. McLendon is not a typical gunslinging hero, but he proves worth the time to watch grow.Some interviews and other reviews suggest that Guinn plans Glorious as part of a trilogy or even a series, and that's where the book's problem arises. Its resolution is really not much of one and chops off short. There is little organic or natural reason for Glorious to end where it does, and the transparently artificial \"Bridge to Sequelbithia\" that Guinn employs dampens enthusiasm about subsequent travels with Mr. McLendon and his erstwhile neighbors.Original available here."}, {"userName": "Larry", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/2728477-larry", "userReview": "Cash McClendon grew uo hard and poor, and it led to a life marked by opportunistic choices. And then one of those choices, marrying the spoiled daughter of a ruthless rich man for whom he was a trouble-shooter and spy, ruined his life. He had chosen the rich man's daughter over smeone he had cared for, and when the marriage went tragically wrong due to the wife's mental illness, he ran, fearing that he'd be blamed for the death. He also took some of the rich man's money, and went off in search of the woman he had loved and spurned. As it happened, the spurned woman was running a millinery shop and general store in a not-quite boom town in Arizona—a town with a population of a several dozen silver miners, three or four failed entrepreneurs, and a saloon. The trouble was, McClendon's declaration that he was a changed man cut no ice with his former love, so he planned to leave town on the next stage, which was in a week. One thing led to another, though, and McClendon got caught up in the life of the boomtown-in-waiting, almost against his will. And then things got ugly as the local cattle baron revealed his plans to seize control of the town once silver was found, even if it required murder. At that point, it becomes evident that McClendon is changing into a better man. But will the change keep him alive or save his new friends?The details of town building and of the threats to it are interesting, as are the dreamers and drifters who make up the town (including the arrival of the Clantons, later of Tombstone fame). If, as I suspect, there's another novel about McClendon on the way, the truncated ending of this novel won't be a big mark against it. If there's not another novel, then the ending is quick and incomplete (and it deserves three stars)."}, {"userName": "Jo Butler", "userReviewDate": "Dec 10, 2014", "userURL": "http://www.goodreads.com/user/show/4995584-jo-butler", "userReview": "You can’t get any more remote than Glorious, Arizona in 1860. That’s where Cash McLendon winds up, simultaneously fleeing a vengeful father-in-law, and following an old flame from St. Louis. She is not interested, but McLendon likes the hardscrabble town anyway. Then he is summoned out to Culloden Ranch.Mr. McPherson is the region’s major employer, since the silver prospectors aren’t having much luck. He wants to extend his holdings in Glorious, and tells McLendon that he could earn some cash by persuading his friends to sell their stores, and passing along useful information. McLendon had his fill of informing on his friends as his father-in-law’s spy back in St. Louis, and refuses. Then the livery stable owner is called out to Culloden Ranch with an offer for his business, but is killed on his way home. His corpse is found riddled with Apache arrows, but McLendon isn’t the only person in Glorious to turn suspicious eyes toward Culloden Ranch and its sinister hired hands.Glorious is the first novel by Jeff Guinn, an award-winning author of non-fiction works about such legends as Bonnie and Clyde. The first in a trilogy, Glorious portends the OK Corral shootout when the bully Ike Clanton is hired as the Culloden Ranch’s spy. Mr. Guinn’s reporting background is put to good use with his meticulous history and his lovely eye for detail, all wrapped in fluid storytelling. If you like an Old West tale overflowing with atmosphere, give Glorious a try."}, {"userName": "Gail Ofterdinger-Ledgister", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/6538610-gail-ofterdinger-ledgister", "userReview": "It took me more than one evening to complete this read, but it was not a disappointment. Cash McLendon is a man's man. He endures a loveless marriage in St. Louis that ends with the death of his wife and a contract on his life issued by his gangster father-in-law. Escaping south and then to the wild, untamed west, one step ahead of the hitman, he finds himself in Glorious, Arizona, potential boom town and current residence of his former girl friend. I sure thought they would eventually get together, just as I expected the hitman to turn up. Who knew said hoodlum would save the day, at least for some. I wanted a different ending, but we can tell that there will be more of Cash. It was not difficult to close one's eyes and see the dusty camp sites of the prospectors, and the conniving smirk of the greedy, rich, ranch owner who wants to take the town out from under it's founders. I was a little unnerved by the un-PC language used to identify the ethnic groups in the book, but my consultant on all things literary (my academic husband) assures me it is ok if used in a period piece as language that would have been the norm for the historical time.As a kid of the 1950's, westerns were all over TV, and I was in front of it, doing my homework, as the boobtube took me back to the 1870's. This will take you there too. My thanks to the Penguin First-to-Read program for a complimentary copy."}, {"userName": "Mike", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/8208586-mike", "userReview": "It's a bit disconcerting to read a western novel whose protagonist is not only something of a blackguard, but also a bit of a wimp - and a complete greenhorn to boot. He can't ride, can't fight, can't shoot has virtually no survival skills... and yet, in his heart, he's really just a lovesick puppy trying to win his gal. Gawd. Talk about your anti-hero. He's not even (not really) trying to improve himself in any of the areas considered important in the average western. So why, I keep asking myself, do I find myself waiting for the next book? Like the characters in \"Little Big Man\" (Dustin Hoffman) or even \"Dead Man\" (Johnny Depp) I find myself anticipating some sort of transformation process that just isn't taking place (yet) and, dammit, I'm not leaving until I get it or one of us is dead. The historical characters and situations McClendon is tossed in with are the saving grace. I neither like nor dislike C.M. at this point (after two books!) but I can't wait to see him grow a pair and man-up. This is entirely opposite to what I usually require in a novel and the fact that Guinn manages to string me along speaks volumes for his ability to construct an engaging plot and hold my attention with obvious walk-on characters."}, {"userName": "Diane", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/875-diane", "userReview": "Picked this up at the Pte Reyes Rescue Boat House when I was there for a class in September. Couldn't resist, since someone who had also visited there had left it behind. The dust between the pages smelled like Point Reyes! Pretty good. Mostly just a fun read."}, {"userName": "Laura", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/9777337-laura", "userReview": "The plot of a good western: Bad guy, good guy, girl, guns, and gold (okay, silver in this case). This was an okay western. If it had been about 100 pages shorter it would have been a good western. Here's what I liked/disliked about the book: 1) Cash is not your typical western hero. He's not a rough-tough, frontiersman slinging his 6-shooters around to solve problems. Unfortunately, I wouldn't actually like him in real life because he's kind of a jerk. His \"character growth\" wasn't really convincing. One minute he's ridiculing the people of Glorious and the next page he decides they're really good people and he'll stick around for a while even if what's her name continues to reject him. 2)Slightly different premise than other westerns: guy doesn't really get the girl...on the other hand, nor is there conflict resolute. (I smell a sequel!) 3) Did I mention it was about 100 pages too long? I'll probably check out other books by this author, but anticipate this particular book ending up in the \"sell to used bookstore\" pile. At least it was a free ARC (thanks library summer reading program)!"}, {"userName": "Randy", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/1344551-randy", "userReview": "Cash McLendon comes to the small Arizona town of Glorious on the run from his father-in-law in St. Louis. He'd made the mistake of leaving his wife alone while her parents were away because of business, only to return and find that the high strung young woman had committed suicide. A survivor since he was a small boy, Cash knew his rich in-laws would sick their enforcer, Brautigan, and his steel toed boots on him. So he cleaned out the safe, two grand, and fled.Glorious was where his previous lady friend, Gabrielle, and her father had moved their dry goods store. His intention was to correct the mistake of picking the rich girl for a wife. Of course she didn't see it that way.Glorious was being built up in anticipation of silver strikes. Stuck in the middle of Apache territory, the town was guarded by a rich rancher and his Mexican vaqueros, armed with double-action Colts and the latest Winchesters.The rich man has other plans as well and Cash recognizes him for what he is. After all, he'd worked for such a man in St. Louis. Convincing his new friends is another matter entirely.A fine western."}, {"userName": "Nancy", "userReviewDate": "Jun 15, 2014", "userURL": "http://www.goodreads.com/user/show/5653833-nancy", "userReview": "I won this book in exchange for an honest review.Glorious by Jeff Guinn is a novel set in the old west. This is not a traditional western with desperadoes, gun slingers and shoot outs. The West is more of a setting for the book.The main protagonist, Cash McClendon, is on the run and heads out to the town of Glorious to rekindle his romance with an old flame. It is while in Glorious that Cash inherits a whole new host of problems.Mr. Guinn gives the reader a believable plot because of the flawed character of Cash McClendon. The author's prose keeps the story moving along at a good, easy reading pace and the story itself, although about Cash's quest to regain his true love, is not heavy on the romance.I enjoyed this book very much. The main character of Cash is a likable character although a bit of a schmuck in his past. He is certainly flawed; giving his character a human quality. The surrounding minor characters provide support for the story and keep the plot real. I hope there is a book 2 coming as the ending of the book definitely left room for an ongoing series.A good read."}, {"userName": "Chris", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/2222340-chris", "userReview": "I enjoyed this but it was 100 pages too long and the pace was slow at times. A man fleeing his past in St Louis seeks his one true love whom he has spurned. He follows her to Arizona Territory in the 1870's. Cash McLendon is a guy who has burned his bridges and been a corporate spy so to speak. He married the boss's daughter rather than go with his true love whose business was coveted by his boss. So after his wife dies ( his father-in-law thinks he murdered her) he follows his true love to Glorious, AZ while a goon from this old boss is on his trail. He finds he likes Glorious, a silver mining town with not much to offer. However his former love wants nothing to do with him as she has found another. He decides to stay and see what happens. We have alleged Indians, mining, lots of manipulation, and greedy autocrats. What more could a Western want? The ending though was over the top and a bit too unbelievable but still it was a good yarn and I hope to see more books by Guinn about this character."}, {"userName": "Kim McGee", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/5057126-kim-mcgee", "userReview": "There are lessons you learn early in life and mistakes you make that will haunt you for the rest of your life. The lure of a rich wife over true love is one of those mistakes that the main character makes and then he must spend the rest of the book trying to redeem himself. The reader is taken from the sophistication of the East Coast to the hot, dusty silver mining town of Glorious Arizona. From there we see if the girl can be won back, a tarnished past can be shined up and one man and his friends can save a hard scrapping town from a power hungry rancher. The characters will bring to mind \"Lonesome Dove\" as the author does his best to show us the good and bad side of this brutal life. Your fate and future was held in a handful of shiny rocks or dependent upon those who were lucky enough to find those shiny riches. Anyone looking for not only a great western but also a historical piece on the American West will enjoy this."}, {"userName": "Alecia", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/2979949-alecia", "userReview": "I was interested in reading this book as the writer, Jeff Guinn, had written the non-fiction book Manson last year. I liked that book very much, thought it was very well done, and I found it interesting that he also writes fiction. Glorious is set in 1872, and is a tiny mining town in Arizona Territory. Our hero, Cash McLendon, travels there to attempt a reconciliation with an old flame who has started a business there. Cash is also fleeing a tragic situation that he was in in St. Louis, and has an enforcer on his heels. This story starts off quite well, and the telling of the carriage ride to Glorious is vividly told, with all the discomforts of such a ride felt by the reader. I found that as the novel progressed, the story lagged a bit. Although it was always a pleasant read, the writing was never elevated to a point where I felt it deserved 4 stars. There is apparently going to be a sequel, as the ending is designed for one."}], "description": "New York Times-bestselling author of The Last Gunfight, Jeff Guinn turns his eye for evocative detail and history to a sweeping novel of the Old West, weaving a compelling tale of life in the Arizona Territory in 1872.We’ve all got mistakes in our past we’d rather forget.Cash McLendon has always had an instinct for self-preservation, one that was honed by an impoverished childhood and life with an alcoholic father barely scraping by on the streets of Saint Louis in 1872. He’s always had a knack for finding and capitalizing on the slightest opportunities, choosing the path of financial security over happiness or real friends. He eventually builds himself up from a Saint Louis street urchin to the son-in-law and heir apparent to industrial mogul Rupert Douglass. Though it lacks passion, his life seems securely set: a wife, a career, property, standing.But when tragedy strikes, all of his plans and his entire future dissolve in an instant. McLendon’s instinct for survival kicks in; he flees Saint Louis, and Douglas assigns his enforcer, an ominous skull-cracker with steel-toed boots, to track him down.With nothing to lose, McLendon attempts to reconcile with an old flame—a woman he was nearly engaged to but put aside in exchange for the life now in shambles. He heard through the grapevine that she and her father moved their dry-goods store out west, to a speck-on-the-map mining town named Glorious, in the Arizona Territory. There, McLendon tries to win her back, and in the process discovers a new way of life at the edge of the final American frontier. But he can’t outrun his past forever. . . .", "title": "Glorious: A Novel of the American West\n      \n          (Cash McLendon #1)", "url": "http://www.goodreads.com/book/show/18693619-glorious", "average": 3.45, "cover": "https://images.gr-assets.com/books/1394411282l/18693619.jpg", "reviews": 83, "authors": [{"url": "https://www.goodreads.com/author/show/149171.Jeff_Guinn", "name": "Jeff Guinn"}], "type": ["Westerns", "Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18693619-glorious", "http://www.goodreads.com/book/show/23281706-glorious", "http://www.goodreads.com/book/show/21424776-glorious", "http://www.goodreads.com/book/show/16130503-manson", "http://www.goodreads.com/book/show/30753828-the-road-to-jonestown", "http://www.goodreads.com/book/show/255303.The_Autobiography_of_Santa_Claus", "http://www.goodreads.com/book/show/4858915-go-down-together", "http://www.goodreads.com/book/show/9587101-the-last-gunfight", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}