{"ratings": 263136, "userreviews": [{"userName": "Rosieface", "userReviewDate": "Mar 21, 2008", "userURL": "http://www.goodreads.com/user/show/996039-rosieface", "userReview": "Goodnight, Moon is the chilling portrayal of a small child (represented, oddly enough, by a rabbit), listing the things in their bedroom and then saying goonight to them, one by one.At best, this is obvious stalling behavior by a willful child, remaining undealt with by a \"programmed parent.\" At worst, it may be a symptom of what could turn into a crippling obsessive compulsive disorder, compelling the unnamed child to wish inanimate objects good night well past the threshold of exhaustion and madness.A number of unanswered questions remain: Why do we only see the child in bed? Where are his or her parents? Who is the mysterious old woman who says \"hush,\" and why are her preliminary attempts to quell the destructive behavior of the child not heeded? All in all, a good read. Not quite the heart-stopping thrill ride of Runaway Bunny, by the same author, but with a subtle horror all its own. Two thumbs up, I say!"}, {"userName": "Melki", "userReviewDate": "Mar 14, 2012", "userURL": "http://www.goodreads.com/user/show/5293536-melki", "userReview": "I was stunned to see this appear on a list of banned books . . . I mean, seriously? What could be more innocent than this book? What within these brightly-colored pages could possibly be considered objectionable? A Google search revealed nothing. Even Wiki let me down this time.Luckily, while I was having this discussion with a library patron, the director happened to walk by, and she knew the answer.You see the doll on the shelf behind the old lady rabbit's head?It's not wearing any clothes.The horror, the horror! Anyway, here's LeVar Burton reading this risqué book to Neil deGrasse Tyson:https://www.youtube.com/watch?v=0s8oY..."}, {"userName": "Alex", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "Margaret Wise Brown's nihilistic classic is a howling renunciation of God, here depicted as a \"quiet old lady whispering 'hush'.\" There is no afterlife here, no reward, no release from the crushing mundanity of life. There is only the bowl of pathetic mush, the forlorn mittens, the abandoned balloon, the telephone that never rings. We live our lives in a \"great green room\", but at the end we accumulate nothing but the discarded trappings of our childhoods. Even love cannot offer solace: where are our families when the end comes? \"Goodnight nobody,\" we call into the blackness.There is no hope in the world without us. We know what will happen, when we close our eyes, to the young mouse left alone with two kittens. They will toy with him; they will torture him and leave his decapitated body on our pillow. But we will never awake to see its guts splayed out near our heads. \"Goodnight air,\" the poem ends. \"Goodnight noises everywhere.\" We fall, silently, into the void."}, {"userName": "Kirk", "userReviewDate": "Jan 04, 2012", "userURL": "http://www.goodreads.com/user/show/4558389-kirk", "userReview": "“A great man in his pride . . .\u2028 Casts derision upon\u2028Supersession of breath;\u2028He knows death to the bone\u2028Man has created death.”\t~William Butler Yeats“Goodnight Moon . . . Goodnight Air. Goodnight noises everywhere”\t~Margaret Wise BrownThere’s only one time in your life that you say goodbye to everything you’ve come to know and love . . . and even dedicate a little time saying goodbye to the things you’ve come to hate: the shitty bowl of mush growing cold on the night stand that your “old lady” tries to pass off as food, the filthy rodent that’ll probably leave droppings in said mush as you rest comfortably ETERNALLY. Because when you’re about to kick off, even the fecal matter your little brother leaves on the toilet after he forgets to wipe his butt is endearing, and the tasteless, formless garbage your nation has sold to you as “food” reminds you that's it's better to have the faculties to hate and loathe than to have nothing at all. Most classic poets painted death with a palette of the morose and depressing. There was no room for cliché rhymes and red balloons in the classic written rendering of death, until Margaret Wise Brown came into the picture. In 1947, Brown threw out all the conventions established by previous poets writing about death, bidding folks like Yeats and Donne to say “goodnight air” as she peppered her death poetry with balloons, bears, and cows jumping over the moon.Her work reminds us that death does not have to be a subject of woe. Death is best reminisced about with a cocktail of kittens and mittens, chairs and bears. The proverbial spoonful of sugar Brown gives to us with her stylistic rendering helps the medicine go down, as it were, continuing the discourse established by her predecessors and taking it in a direction desperately needed by people today. This is not just a book about a stubborn rabbit with OCD who will not go to bed until he lists everything in his room. This is a story about the human condition, and a celebration of our greatest collective vulnerability. Read. This. Shit."}, {"userName": "Jessica", "userReviewDate": "Nov 13, 2008", "userURL": "http://www.goodreads.com/user/show/1712354-jessica", "userReview": "why do people like this book? finding the little mouse on each page is fun, but other than that it's just a dumb book. there is a lame attempt to rhyme...sometimes. there's no rhythm. i don't get it."}, {"userName": "Jon(athan) Nakapalau", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/58774673-jon-athan-nakapalau", "userReview": "Wonderful book that makes you feel that everything will be fresh and new in the morning."}, {"userName": "Jean", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "“In the great green roomThere was a telephoneAnd a red balloonAnd a picture of – ”Goodnight Moon is a classic and well-loved American children’s picture book from 1947. It was written by Margaret Wise Brown and illustrated by Clement Hurd. Many American adults remember it as their favourite bedtime story, and it continues to lull young children to sleep to this very day.The book describes a bedtime ritual, more than telling an actual story. A young anthropomorphic bunny is in bed saying “good night” to everything she can see around her: “Goodnight room Goodnight moon Goodnight cow jumping over the moon Goodnight light, and the red balloon ...”There are three books in the series, all by the same author and illustrator, the others being “The Runaway Bunny” and “My World”. These three books have been published together as a collection, with the overall title “Over the Moon”.In this rhyming poem, the bunny works her way through seemingly random but personally significant objects, such as a red balloon, the bunny’s doll’s house, two kittens, a brush and comb and so on. The book has slowly become a bestseller. It has currently sold an estimated 48 million copies, and been translated into over a dozen different languages. It is hard to see the attraction, save that a bedtime ritual is helpful and reassuring, little children love rhymes, and a familiar short book often becomes a favourite. The illustrations are simply drawn, and coloured in flat areas with no shading. There is a spacious feel about the room, however, and the light cast on the bunny seems benevolent; the moon outside friendly, the twinkly stars restful and familiar. To an adult it may seem surreal, but there is an appeal for young children. It seems to be the case with several great writers of children’s classics, that they never leave their childhood behind in the conventional way. They never really become settled domestically, in happy relationships, or as normally functioning members of society. Perhaps the most inspired children’s writers never grow up. Margaret Wise Brown was a restless and unsettled person. She never had children of her own, and her affairs were often chaotic and unstable. She had periods of despair and loneliness, and there are many reports of her provocative or obstructive comments. Her books may seem delightfully whimsical, but under the surface seemingly lies isolation and turmoil. She called one longstanding lesbian lover, “Rabbit”, but even their relationship was by all accounts rocky and tormented. In desperation her lover once took an illustrator aside and said, “Why don’t you marry Margaret and take her off my hands?” Perhaps it is the author’s brittle and alienated personality which enabled her to empathise with how little children would feel reassured. Margaret Wise Brown once said that she considered the purpose of children’s books to be: “to jog him with the unexpected and comfort him with the familiar.”Quite prolific in her work, Margaret Wise Brown originally worked as a teacher, and also studied art. It was while working at the “Bank Street Experimental School” in New York City, that she started writing books for children. The school believed in a new approach to children’s education and literature, one which was rooted in the real world, and the here and now. Margaret Wise Brown embraced both this philosophy, and also was influenced by the poet Gertrude Stein.She once referred to the:“painful shy animal dignity with which a child stretches to conform to a strange, adult social politeness.”Margaret Wise Brown’s first children’s book was published in 1937 and entitled “When the Wind Blew”. She went on to develop her “Here and Now” stories, and later the “Noisy Book” series. Between 1944 and 1946, she wrote three picture books under the pseudonym “Golden MacDonald”. Even in her personal life the author went by various nicknames, perhaps seeking an identity. To some she was “Tim”, as her hair was the colour of timothy hay. To others she was “Brownie”. To those who were familiar with the use of the pseudonym “Golden MacDonald”, she was “Goldie”. Early in the 1950s she wrote several books for the “Little Golden Books” series, including “The Color Kittens”, “Mister Dog”, and “Scuppers The Sailor Dog”.Margaret Wise Brown was a lifelong beagler, very keen on hunting hares and rabbits. A beagle pack of ten or more hounds, following the animals by scent, would usually be followed on foot. The author's enthusiasm and ability to keep pace with the hounds was well known at the time. In one interview for “Life” magazine, the reporter expressed surprise that such affectionate portrayals of so many rabbits in her books could be created by one who had such a zest for hunting and shooting rabbits. The author replied: “Well, I don’t especially like children, either. At least not as a group. I won’t let anybody get away with anything just because he is little.”Even her last moments seem akin to something from a black farce. Margaret Wise Brown was in a hospital in France, with appendicitis. The operation seemed to be routine, and she was clearly in one of her ebullient social moods. Earlier the same year she had met James Stillman “Pebble” Rockefeller Junior at a party, and they became engaged. One morning, she jokily kicked her leg in a can-can style, to prove to one of the medics how well she was recovering. An embolism killed her instantly. Perhaps she would have appreciated this grotesquerie.Margaret Wise Brown left behind over 70 unpublished manuscripts. Her sister tried to sell them without success, so kept them instead, in a cedar trunk for decades. Comprising more than 500 typewritten pages in all, they were rediscovered in 1991, and most have now been published. Many of them have new illustrations, but most, like this edition of Goodnight Moon are still in print with the original illustrations.The book is compact and sturdy. In this case “board” book describes the pages as well as the cover. It is very substantial and can withstand overly affectionate treatment by the smallest people. However, neither the text nor the illustrations of the book especially appeal to me. I do understand that it has had a classic appeal to several generations. I see that no less than fifteen of my friends have rated it 5 stars, and several more rate it above average. I have to assume then, that in this case I am out of step with the target audience, and let this book stay at my personal default of 3 stars."}, {"userName": "John Beeler", "userReviewDate": "Jun 30, 2007", "userURL": "http://www.goodreads.com/user/show/158456-john-beeler", "userReview": "What is about this book that haunts me? Is it the deep sense of emptiness? That the room stays the same, but objects move and light slowly fades into dark? That the narrator has no connection at all with the only other \"human,\" the old lady whispering hush? Or is that that the narrator says goodnight to \"nobody,\" that as we go outside her room, we see only stars - no people, no cities. It's as if this little bunny is the last one on earth, and is being watched by some robotic nanny bunny. I get the chills reading it, and I wonder if Cosette will pick up on it. She loves it too, but probably because of the red balloon and two kittens.Mmmm. Mush."}, {"userName": "Benjamingibbs", "userReviewDate": "Mar 15, 2008", "userURL": "http://www.goodreads.com/user/show/249109-benjamingibbs", "userReview": "The baby bunny is oddly unengaged with a temperamental grandma bunny as he (or she) watches the room grow darker (even though the moon rises). Despite these inconsistencies and occasional strange reading cadences (goodnight nobody? what does that mean), I would recommend book to anyone interested in going to bed at night and suffers from separation anxiety with inanimate objects."}, {"userName": "Luann", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/651844-luann", "userReview": "I think this is a book you have to have read first when you were very young in order to LOVE it. At least for me, when I first read it as an adult, I just didn't get why it is such a classic and why so many people count it as their all-time favorite first book from their childhood. I can see that this is a nice book for reading at bedtime. But the list of things on the \"goodnight\" list just seems really random to me. I wonder if some kids love it because they can soon \"read\" it themselves, long before they can read any other book? Anyhow, I wish I could love this one as much as many other people do, but I just don't. My all-time favorite first book from my childhood is Scuffy the Tugboat. That's the book I first read all the way through independently when I was learning to read. That's the book that brings back fond memories from my childhood. Sorry, Goodnight Moon."}, {"userName": "Rich", "userReviewDate": "Dec 10, 2008", "userURL": "http://www.goodreads.com/user/show/1793538-rich", "userReview": "I first read this book in August of 2007, and I liked it so much that I've read it every evening for nearly 500 consecutive days now. I was initially attracted to the simple sweetness of the story, but with each reading another complex layer is revealed, and more questions arise.A close inspection of the room's artwork gives you your first clue that not all is right with this world. The cow jumping over the moon? Standard nursery wall fare. The three bears? More storybook silliness, but wait... there's no Goldilocks in the picture, or overturned chairs/porridge bowls. There are just three naked bears in an empty room, sitting quietly in low chairs with their arms crossed. Madness, but nothing compared to the depraved picture on the opposite wall, in which a grown rabbit wearing wading pants is using a carrot on a line to fish for bunnies.Then there's the full bowl of mush carelessly left next to the bed. The mouse will certainly eat the mush once everyone is asleep, provided that the kittens don't eat the mouse first. And I do not know much about 1940's culture, but I think it's legitimate to ask whether a family of rabbits in a single-room-occupancy could afford such treasures as helium baloons and leopard-skin rugs.Who exactly is living in this room? There is an adult, but the bunny never says \"Mommy\" or \"Nana\" but instead only refers to \"the old lady whispering 'hush'.\" I don't want to believe that the protagonist was kidnapped down by the river by the Evil Fisherman Rabbit, but it becomes increasingly difficult to believe otherwise.As the bunny goes through his nightly routine, the story leaves Fairyland and enters the Theatere of the Absurd. \"Goodnight comb and goodnight brush,\" the bunny whispers, lest the old lady hush him again. \"Goodnight nobody, goodnight mush.\" Whoa. That's some existential stuff right there. \"Goodnight nobody\"... the silly playfulness of a child, or the stark realization of life's essential emptiness? And \"goodnight mush\" may be the saddest two words in the English language.The final page brings with it more mysteries. (Spoiler alert!) The old lady has suddenly disappeared, presumably eaten by the kittens who now occupy her rocking chair. Meanwhile, the bunny babbles \"goodnight noises everywhere,\" desparately tring to silence the clamor in his head.All in all, \"Goodnight Moon\" is a complex tome that my son (literally) and I (figuratively) can really sink our teeth into."}, {"userName": "Ronyell", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "“Goodnight Moon” is a classic bedtime story by Margaret Wise Brown along with illustrations by Clement Hurd and it is basically about a small rabbit is saying goodnight to all the objects and pets in his room. “Goodnight Moon” is a true cult hit for children of all ages.Margaret Wise Brown’s story is extremely cute and heartwarming as the little rabbit not only says goodnight to everything he spots in his room, but also states to the audience about the various things that he spots, similar to how the child has to find certain objects or people in the “Where’s Waldo” and “I Spy” books. Clement Hurd’s illustrations are beautiful and creative as he makes the small rabbit’s room brightly colored as the walls are green and the carpet is red, giving the room a Christmas feel to it. Also, Clement Hurd’s illustrations are highly creative as he makes some images such as the image of the three bears in a painting, colored in black and white while the images of the rabbit in his room are full of color. Also, towards the end of the book, Clement Hurd makes the room look darker as the small rabbit is saying goodnight to all the objects in his room and is about to go to sleep.“Goodnight Moon” is a true classic for children who love bedtime stories and spotting various objects in a picture. I would recommend this book to children ages two and up since the book is extremely easy to read through and there is nothing inappropriate about the content in this book.Review is also on: Rabbit Ears Book Blog"}, {"userName": "Michael", "userReviewDate": "Apr 02, 2009", "userURL": "http://www.goodreads.com/user/show/356012-michael", "userReview": "I came across this “classic” today and…well…where do I begin? The back cover advises that this “is the perfect first book to share with a child.” My family agreed so I had to read this inane “story” every night to my son until I was able to locate significantly better board books. That is, until I made it to the local bookshop and grabbed any and everything that wasn’t Goodnight Moon. Ten years later, my son disdains books and, upon rediscovering this, I now know why. Now I understand why the cover doesn’t specify that you should share this with your child. My son finally slept through the night once I switched to NOT-Goodnight Moon.Unlike one of the other reviews here, I won’t force a “spoiler alert” by giving away the ending. Of course, I ask you, what freaking ending? The annoying infant/rabbit/thing finally shuts up? Whoops! Did I give it away? No, no, this book doesn’t really ever end. The garish graphics and rhythmic incompetence ring in your head for months after finally tossing it into a box in the basement (use triple layers of packing tape).Let me just pinpoint one aspect that’s bothered me for years. You cannot rhyme “moon” with “moon” and be granted “Classic” status. I’m sorry – no dice. No third-rate, illiterate rapper would get away with this, why does Brown? All I can guess is that, written shortly after the Second World War, the author (and illustrator) composed this under the duress of shell shock. Is that the explanation? Any other logic eludes me.Perhaps it is telling that the one object the baby bunny neglects to acknowledge is the copy of Goodnight Moon sitting on the night stand."}, {"userName": "Donovan", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/27218681-donovan", "userReview": "Mantric. Ethereal. Hypnotic. Goodnight Moon is pretty brilliant for a board book. Well done, Margaret Wise Brown. It rhymes. It repeats. And the pages alternate between color and black and white, perhaps suggesting that the little bunny is falling asleep and sees these objects in his mind or half-sleep. But it makes you wonder if any of this is real or if he's just imagining the clearly arbitrary colored bedroom in his dreams. It's like Inception but for kids and with bunnies. And much like that spinning top in Inception, the cow just keeps jumping over the moon. Clement Hurd's colors are intense. Green. Yellow. Orange red. I'm no art student or interior decorator, but damn, that's some serious clashing. Yet it really is visually striking, much like the graphic novel I just reread, Watchmen. Yes, I just compared Goodnight Moon to Watchmen. Clement Hurd is basically the Dave Gibbons of children's literature. Because of the abritrary, unrealistic and dreamlike use of color. It's psychedelic and crazy. But somehow my daughter likes to look at it. And at the root of it all, it helps her go to sleep. My wife and I have read this book pretty much every night (and some afternoons) since before my daughter was walking. It's comforting. And maybe it's just parental exhaustion, or I've been conditioned like my daughter, but it makes me sleepy just reading it."}, {"userName": "Matt", "userReviewDate": "Nov 30, 2008", "userURL": "http://www.goodreads.com/user/show/1232789-matt", "userReview": "I have read this to my daughter since she was two months old. She is now 20 months old going on 21 months and I have to say that I grown to appreciate this book. This is not only due to the enjoyment she gets or because the little rabbit procrastinates going to bed like my little one does. No, like all great children's literature, this book has a couple of layers. I enjoy this book because I think it's about a child's version of death. I'm not crazy - promise! Maybe it's the perplexing Old Lady whispering hush or maybe it's the \"Goodnight Nobody\" page but I think there is something else going on here with this book. Or maybe it's because I've read it so often I need to think on a different level as I read this."}, {"userName": "Janni", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/1292720-janni", "userReview": "A heartbreakingly spare story about the heat death of the universe. One by one the things of the world are bid adieu. Beginning with small losses--clocks, socks, a young mouse who will never reach adulthood, the stakes rise relentlessly until the loss of the atmosphere, stars, and sound itself. In the end the illustrated moon shines on, a reminder of things lost, but the protagonist--and the reader--are left sleeping in the dark."}, {"userName": "Michelle Johnston", "userReviewDate": "Apr 17, 2008", "userURL": "http://www.goodreads.com/user/show/926812-michelle-johnston", "userReview": "This post modernist take on nocturnal rabbit activity has been widely acclaimed by pundits and neophytes alike. Although the end is itself anticlimactic, the book throughout alternates between a Jeffersonian systematic formulation of an intuitively quixotic plot and a reductive encapsulation of the bed-time ritual that is practically, in its essence, Elizabethan. A revisionist reading unearths the Orwellian presence of the hushing lady, which is countermanded by the ideological shift introduced to the reader by the omnipresent burgeois mouse. Although the rabbit does, in the end, succumb to the hushing lady, the reader is left with a sense of vague dissatisfaction with regards to the character development."}, {"userName": "Stephen", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "2.0 stars. This is one I did not read as a child and first read to my younger daughter when she was three. Not one of my favorites...bring on Dr. Seuss."}, {"userName": "Sam", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/6216541-sam", "userReview": "I choose this book as it's widely regarded as a classic children's book. Although it is considered to be a bedtime story- a rhyme about a childs bedtime ritual of saying goodnight to everything they can see from their bed- I believe that the short rhyming couplets about subjects that most children would be familiar with make it an ideal book for building literacy skills. Although the edition I read was a board book, it is also availbe in paperback and hardback formats which would probably be more suitable for a school setting (as children tend to think that board books are for babies and will avoid them on that basis). I've offered to read this book to my nieces and nephews at bedtime on a number of occaisions and it never gets refused!Although the illustrations are maybe not as sophiscated as in more modern books, I think they are probably just as enchanting for a child today as they were for a child over 60 years ago when it was first published. In each of the 'wide-angle' illustrations of the bedroom, everything mentioned in the text is visable even though it may take a little searching for! This is a great way to encourage a child to relate the illustrations to the text. The colour scheme of the illustrations is also very unusual but interesting and sets the style of the book apart from it's more modern counterparts.All in all, I think that this book is a charming, timeless and classic childrens book that should be a staple of any child's library!"}, {"userName": "Anastasia Riebs", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/25022912-anastasia-riebs", "userReview": "Can anything truly be said to speak with less than lavish, rhapsodic adoration of Margaret Wise Brown’s classic children’s book?Just as mothers and their babes in arms have the uncanny ability to synchronize their heartbeats by a single loving glance, the lyrical cadence and soothing, repetitive text makes reading Goodnight Moon a compulsive act of gentle rocking motion, lulling the reader into an involuntary ebb and flow. The words of the bedtime story fall from the lips as a lullaby; it is impossible to keep a harsh edge from one’s voice from dissolving into the tender rhythm. Of the nearly one hundred books written by Margaret Wise Brown, Goodnight Moon is notably one of her most beloved. The late Clement Hurd was best known for his work illustrating Goodnight Moon; his charming collaboration launched his career as an illustrator of children’s books. The bold orange and green that blankets each page coupled with simple, recurring stripes disappear slowly into darkness as the charming little bunny fights sleep. The true miracle of Goodnight Moon is in its uncanny ability to conjure sleepiness in children. He’ll find himself rubbing his eyes and allowing you to roll him into his bed and under a warm quilt by the last page."}, {"userName": "Laura Thomas", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/7491783-laura-thomas", "userReview": "I bet most households have a copy of this book. My mother read it to me when I was very young. The pictures are so vivid and the rhyming is such fun.I don’t have my original copy but I do have two that I picked up when I came across them in book stores. And I still smile as I look at the pictures and read the rhymes aloud.Such a lovely bedtime story. A classic that never gets old and all ages will enjoy.I own a copy of this book. My review is voluntarily given."}, {"userName": "Sultan * Baby Mama Smut-a-teer*", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/1360634-sultan-baby-mama-smut-a-teer", "userReview": "Omg I still love this book! I read it to baby carmine last night during reading time and he didn't understand much if anything, but as he gets older I think we will say goodnight to everything!! Love it"}, {"userName": "Mariah", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/22371819-mariah", "userReview": "Read this a super long time ago and really liked it :)"}, {"userName": "Meredith Trotter", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/10977473-meredith-trotter", "userReview": "Publication: 1947Grade/Age: PreK-2nd gradeAnnotation: The classic story of a bunny's going-to-bed ritual as he bids goodnight to different objects in his room. Themes: Bedtime, stories in rhyme, rabbitsWays to use the book:Language Arts - \"Goodnight to Your Room\" - Have children make lists of all the items in their own rooms that they could say goodnight to before going to sleep. If they want, they can draw pictures of their rooms, labeling each item they would bid goodnight.Math - \"Telling Time\" - Have children look at the clock in the first picture. They can draw the clock and label the time it shows. Then have them look for the clock in other pictures in the book. Ask them to draw the clock and label the time it shows each time it is pictured. Then have them figure out how much time passes in the story.Art - \"Noticing Details\" - The bunny says goodnight to most of the items in the room, but there are some that he misses. Encourage children to look closely at the pictures in the book and list the items that the bunny misses when he says goodnight.Science - \"Phases of the Moon\" - The moon in the story is full. Point out to children that most newspapers will list the phase the moon is in on the weather page. Have them look in their local newspaper to find out what phase the moon is in. Help them to predict when the next full moon will occur."}, {"userName": "Maicie", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/2512140-maicie", "userReview": "For shame! My grandson doesn't care for this book. I ranted and raved for a good ten minutes when he refused to let me read it to him. He found this (the ranting) hysterical which only made me angrier. \"You will read this!\"Toothy grin.\"Look! There's a little mouse on every page that you can find.\"Toothy shrug.\"Logan, this is a classic!\"Toothy, wet sneeze.Logan toddles over with  . Give me strength."}, {"userName": "Asha", "userReviewDate": "Apr 01, 2016", "userURL": "http://www.goodreads.com/user/show/11792174-asha", "userReview": "This book holds a special place in my heart. My mother used to read it to my brother and me allthe time when we were younger, until she grew so tired of it that she bought it for us on cassette and we played it enough times that the tape became messed up. The illustrations are phenomenal, the wording light and simple. It's something we can all relate to, saying no goodnight to anything and everyone, just to prolong our bedtime. I'm glad that, at the ripe old age of 22, I bought my own copy and shared it with someone dear to me."}, {"userName": "Mohammed Al-Garawi", "userReviewDate": "May 27, 2013", "userURL": "http://www.goodreads.com/user/show/4650824-mohammed-al-garawi", "userReview": "There's something deep about this bedtime story and I can't put my finger on it.Is it the emptiness? The way everything goes to sleep?Here's a narrated version of the story: http://youtu.be/9yu_g5x3ZoQGoodnight stars, goodnight air..Goodnight noises, everywhere.."}, {"userName": "Amber", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/9105766-amber", "userReview": "My girls used to love me to read this one to them at bedtime. :)"}, {"userName": "Kimberly", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/17371689-kimberly", "userReview": "Children's classic. Since my youngest has been home sick for over a week, I got the \"joy\" of rediscovering this one hundreds of times more! (Seriously, all of my kids were obsessed with this one at one point or another)."}, {"userName": "Stephanie", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/3043110-stephanie", "userReview": "^My boy\"Goodnight moon.Goodnight Caleb jumping over the moon.\"I've read this one to Caleb multiple times because we love it! He seems to enjoy it (as much as a 6 month old can), and looks at the pages (for the most part). I like to read this one because it has good rhythm, fun rhymes, and it flows well. I find it easy and enjoyable to read aloud. This is quickly becoming a favorite and one I'd be happy to read to him every day! Trying to expand our horizons a bit though, and read other ones too. ;)First read: 8/2015"}], "description": "In a great green room, tucked away in bed, is a little bunny. \"Goodnight room, goodnight moon.\" And to all the familiar things in the softly lit room -- to the picture of the three little bears sitting on chairs, to the clocks and his socks, to the mittens and the kittens, to everything one by one -- the little bunny says goodnight.In this classic of children's literature, beloved by generations of readers and listeners, the quiet poetry of the words and the gentle, lulling illustrations combine to make a perfect book for the end of the day.", "title": "Goodnight Moon\n      \n          (Over the Moon #2)", "url": "http://www.goodreads.com/book/show/32929.Goodnight_Moon", "average": 4.27, "cover": "https://images.gr-assets.com/books/1439223893l/32929.jpg", "reviews": 4997, "authors": [{"url": "https://www.goodreads.com/author/show/18479.Margaret_Wise_Brown", "name": "Margaret Wise Brown"}, {"url": "https://www.goodreads.com/author/show/18480.Clement_Hurd", "name": "Clement Hurd"}], "type": ["Childrens", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/32929.Goodnight_Moon", "http://www.goodreads.com/book/show/15925971-goodnight-moon", "http://www.goodreads.com/book/show/232381.Goodnight_Moon", "http://www.goodreads.com/book/show/1099989.Goodnight_Moon", "http://www.goodreads.com/book/show/32935.Goodnight_Moon_Room", "http://www.goodreads.com/book/show/7934445-goodnight-moon", "http://www.goodreads.com/book/show/58922.The_Runaway_Bunny", "http://www.goodreads.com/book/show/401730.Big_Red_Barn", "http://www.goodreads.com/book/show/616197.Home_for_a_Bunny", "http://www.goodreads.com/book/show/237346.The_Color_Kittens", "http://www.goodreads.com/book/show/216330.The_Important_Book"]}