{"ratings": 25750, "userreviews": [{"userName": "Pickles", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/169842-pickles", "userReview": "I've seen mention that there are supposed to be more books in this series, but Mrs. Harris has confirmed on her website that this book is the last Harper Connelly book. She says \"never say never,\" but she currently doesn't intend to write any more books in this series. Just wanted to clarify that for the people who are assuming there are more books to come. As for the book itself, I think it was a weak conclusion to the series. Other people have said it, but there really is too much repitition in this book and in this series overall. We're constantly reminded of their horrible upbringing, the lightning strike and how it gave her this power and weakened her leg, about her relationship with Tolliver, about how their younger sisters wound up with Hank and Iona, etc. On top of that, the conclusion to this book felt convoluted and rushed. I'm a fan of Harris's work and I enjoyed this series, but I was definitely disappointed with the ending. I think there was just too much going on in this book for its length and then it was all wrapped up quickly and a little too neatly. Personally, I think that out of all of the characters in this series, I think the only one I was left wanting to see more of was Manfred Bernardo. I think it would be awesome if Mrs. Harris did a spin-off series with him as the lead, though probably unlikely. Still, I think he was a great character and I'm glad he had a part to play in this last book."}, {"userName": "Jilly", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Someone is trying to kill Harper, and it's not because she is now introducing Tolliver as her step-brother and lover, which would be a reasonable excuse. \nThough we weren't blood relations at all, there is a certain ick factor to our sexual relationship, from an outsider's point of view. We'd be fools not to recognize that.\nYou know what would help, Harper? If you stop referring to him as your brother. He's not your brother, so you are the one making it weird by calling him that.In this last book of the series, Harper and Tolliver travel back to Texas where they grew up. Since we have heard the story of their horrible up-bringing throughout the books, we can expect this story to get messy. And, it did. Tolliver's father gets out of jail and is determined to meddle in their lives, and they finally get a lead on their sister, Cameron's disappearance so many years ago.The bright spot in this book is Manfred's appearance again. I kinda wish she had gotten together with him because he's so adorable. But, then I remember that she was using the word \"phallus\" in the last book and I feel like Manfred can do better. It was a decent ending to the series, in my eyes. It was a huge step-up from Sookie Stackhouse's ending. That was a travesty. The last couple of books in that series should be burned and the ashes donated to a fertilizer factory."}, {"userName": "Robin", "userReviewDate": "Jun 16, 2009", "userURL": "http://www.goodreads.com/user/show/1496564-robin", "userReview": "Love this series with Harper Connelly but understand this will be her last book.Update: I have followed this author for years, reading the Aurora Teagarden mysteries until I tired of them, followed by the Lily Bard series, which was ended by the author. I was excited when she started the Harper Connelly series and enjoyed the first three and was disappointed when I heard this would be her last, but after reading it, decided it's best that she put Harper out to pasture.Harper travels around the country finding dead people and helping to solve the mystery of how they died and who did it. She travels with her stepbrother who helps run the business and takes care of her as seeing such trauma can have its down side. I have found these creepy and compelling yet this last one was a little too \"icky\" even for me (and that's saying a lot!). I hate to say anymore except the relationship between the stepbrother and Harper has gotten increasingly stranger. I thought their behavior was a little over the top and didn't quite fit the earlier drawn personality of Harper. The mystery was also pretty benign. So, my recommendation is try the first book and if you like it, by all means continue the series; just be forewarned that the last book might be best left unread or skimmed."}, {"userName": "Angie", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/50378-angie", "userReview": "So ever since my decadent little re-read of Fire I've been in a reading slump. One foul doozy of a slump. I restlessly picked up and put down a handful of books, all of them full of potential, none of them able to hold my attention. Fortunately I'm still thinking clearly enough at this point to know it's me with the problem, not them. And I carefully set them aside on the nightstand to be picked up in a later, more amenable mood. But desperation was setting in and my family was starting to feel the effects. And then a friend saved the day by reminding me the new Harper Connelly book was out! The fourth installment in Charlaine Harris' \"other\" series, I'd been looking forward to the release of GRAVE SECRET ever since finishing the excellent An Ice Cold Grave two years ago. Entirely different from her Sookie Stackhouse series, the Harper books are gritty mysteries with just a hint of the paranormal. I absolutely love them.Harper and her stepbrother (and manager) Tolliver are on the road again. Having left the horrors of North Carolina behind them once and for all, they're headed to Texas to check in with their little sisters. With the disappearance of her sister Cameron eight years ago, their family dissolved. Harper went into foster care, Tolliver to live with his older brother Mark, and the little girls went to their Aunt Iona and Uncle Hank's in Texas. Over the years Harper and Tolliver made it a point to stay in touch with their siblings, despite their aunt and uncle's deep disapproval of their lifestyle and Harper's way of earning a living. This particular visit is unexpectedly prolonged when Tolliver's jailbird father is released from prison and shows up full of remorse and wanting to reconnect with his children. At the same time, Harper finds a few more dead people than she bargained for on her latest case, sending shock waves through the family of the deceased. As old memories threaten to overtake the careful peace these two have constructed, Harper and Tolliver find themselves caught between family, clients, and the law.I sank back into this world as if no time at all had passed since my last visit. There's something about these two characters and the mature way they've gone about reclaiming their lives after the horror of their childhoods that just fills my empty spaces. Harper and Tolliver accept that they are all each other has in such a matter-of-fact way, with such stoic integrity, it pulls at my heartstrings. I read each book hoping nothing happens to them they won't be able to recover from, looking forward to each interaction, enjoying that tense, dark reality with which Harris surrounds her characters. GRAVE SECRET lived up to expectations on more than one level. Harper and Tolliver's relationship never falters even as they find the truth about their past is even more heinous than they believed it to be. I found myself chanting, \"Don't trust him, don't trust him\" over and over throughout the book, on the edge of my seat worrying about them. I liked how Harper was forced to deal with some things alone in this one. I liked that Harris didn't ease up at all when it came to what actually went down in that trailer in Texarkana. This series has remained refreshingly consistent over the course of four books. And, despite the fact that several overarching plot threads are wrapped up in this volume, I would happily read as many books as she'd like to write about Harper and Tolliver. Harris' Sookie Stackhouse series is by far the more famous of the two, and I love it, but I find myself gravitating toward these more serious, quietly compelling mysteries. Highly recommended.Reading order: Grave Sight, Grave Surprise, An Ice Cold Grave, and GRAVE SECRET"}, {"userName": "Cornerofmadness", "userReviewDate": "Dec 17, 2009", "userURL": "http://www.goodreads.com/user/show/2832635-cornerofmadness", "userReview": "Let me preface this review with stating I  like  Harris’ work. I’ve read all of her series and a few short stories in addition. The Harper/Tolliver series was a decent one (I preferred Sookie a bit but I’m a sucker for vampires, pun intended). That said, this was the worst thing I’ve ever read by her. I mean, nearly tossing the book across the room bad. It felt like she realized her deadline was in 3 weeks and cranked out anything (except the ridiculous ending had to have been planned and that makes it worse).The hardest part about doing a review for this is I can’t give you examples of why I think it’s so awful without ‘ruining the surprises.’ Before anyone thinks this is just another reviewer cheerily bashing some book, it’s honestly not that. I put up excerpts for my blog’s friend’s list and asked for their opinions (blind, I didn’t say where the quotes came from until afterward just to be sure that there wasn’t a Harris-hater in the bunch). It was unanimous; no one could believe these plot twists.The basic plot is Harper has been asked to find out how Rich Joyce, wealthy rancher died, nearly a decade after his death. No problem until Harper also uncovers that his home nurse died in child birth (obviously setting us up to think this baby is his). Then that story gets shunted aside as we get into Harper and Tolliver’s personal lives. They were raised as brother and sister even though they’re step siblings and last book they became lovers. Obviously all their relatives are shocked at this, friends too and instead of trying to help people past it, Harper’s reactions is to be the most abrasive witch she can be. Tolliver is much more tolerable. In fact, Harper is nothing but obnoxious and rude through this whole book.Mathew, Tolliver’s real dad, shows up, fresh from jail, supposedly rehabbed and wants back in his kids’ lives. Tolliver and Harper want none of this but Mark, the oldest does. This goes on for about 150 pages before the other subplot comes back into it. At least the flying bullets make it vaguely interesting but people had to act totally unprofessionally and stupidly to make this plot work and the Jerry Springer ending was telegraphed at least 70 pages before the end which lame as the justifications were, still strained credibility. I mean, it all starts with one random phone call to a stranger and ends here? Shakes head. Harsh review I know. And in all honesty I was left wondering at the people reviewing this for my book club who were raving about it. This was so bad I’m not sure I’d even get the next in the series from the library, let a lone buy it. Okay, I can’t help myself. spoiler here:What cop would come to deliver a death threat to someone and instead, let’s Harper talk him into jogging, changes in his car and leads her away from the hotel where the person threatening her knows she’s staying? No one would do this. No detective would let someone under a death threat go running around in public without at least giving her the warning first. And this isn’t the most preposterous thing that happens."}, {"userName": "vylit", "userReviewDate": "Mar 18, 2010", "userURL": "http://www.goodreads.com/user/show/23773-vylit", "userReview": "I loved the first two books in this series so much that it pains me to write this review. First, I find that the way in the relationship between Tolliver and Harper has developed to be completely unbelievable. Within the span of less than two months, they've gone from being brother and sister to being married, and they didn't seem to give any of that a seconds pause. Harper, who I have spent most of the previous books loving, has become so self-centered between the end of last book and this one, that my feelings for her are bordering on dislike. Tolliver's irrational jealousy of Manfred, which Harper wasn't even interested in when she was single, let alone swept away by Manfred now that she has Tolliver, makes him look like an asshole given the help that Manfred offers to the both of them. I get if Tolliver was pissed at Manfred for hitting on Harper when him and Harper are obviously together, but he seems jealous and behaves badly, which given how strong his relationship with Harper is reads as he's a possessive ass.I feel like the writing was choppier this time than in the previous books. Not necessarily bad, but I feel like there should have been a draft or two after this to polish a lot of the writing and make it flow better. But when I'm pulled out of the story because of an abrupt scene change or choppy writing, it needs a little more work.Lastly, the fact that her father kidnapped her sister and replaced her with another baby and then her stepbrother, which was helping support them while their parents were drunk, strangled their sister was just kind of crazy. Mark up to this point has been incredibly solid and friendly to the characters (at least from their impressions of him) and in this novel was essentially turned into a psycho -- a psycho who hates Harper, which was never the impression that I got before. I feel like this was slapped together without enough attention paid to details."}, {"userName": "M—", "userReviewDate": "May 09, 2009", "userURL": "http://www.goodreads.com/user/show/1353617-m", "userReview": "This book reads like a series conclusion, and I find that very disappointing. Harris has ramped up Harper and Tolliver's relationship. They only just got together in last book... now they're married? And, I'm all yay for concluding the Cameron mystery, but wow was the resolution awkward. The two plot lines just kinda crash together, with none of the finesse that Harris usually shows in her endings. Despite the two year time period between this and the previous book in the series, I think more time could have been spent polishing this.Rumor has it that the Harper books were originally to be a trilogy, but Harris wanted to write a fourth book to complete the Cameron mystery, and now she's contracted to write two more books as well. If that's the case, I would rather she'd've stretched the Cameron mystery out through Books 4-6 to allow more space for everything to build.ETA: Or, well, maybe not...92 \tduckpond100 \t \t2008-11-29 09:07(...) I'm writing the fourth Harper, and I'm undecided as to whether or not it'll be the last. (...)Charlaine Harris96 \tduckpond100 \t \t2008-12-05 10:14(...)I am having an increasing conviction that this will be my last Harper.Charlaine Harris269 \tduckpond100 \t \t2010-01-17 14:40(...)I didn't quit writing the Harper books because they weren't selling as well, but because I was tired of writing them.Charlaine Harris"}, {"userName": "Tali", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/4780458-tali", "userReview": "[Each time Harper and Tolliver are about to leave when they get a phone call from the client. They both agree that the client sounds weird and that nothing seems right only to toddle along anyway and end up getting shot at. After a while, you'd hope they'd be intelligent enough to avoid these situations in the first place. (hide spoiler)]"}, {"userName": "The Flooze", "userReviewDate": "Apr 05, 2009", "userURL": "http://www.goodreads.com/user/show/355739-the-flooze", "userReview": "I‘m not as attached to Harper Connelly as I am to some of Harris’ other characters. She lacks the quirky humor of Sookie Stackhouse and the stubborn determination of Aurora Teagarden. Instead, she’s a terse, self-conscious woman whom I couldn’t immediately warm up to. Still, these books have covered intriguing mysteries, incorporating a good deal of suspense and many false leads, so that there’s always been a surprise or two to keep me guessing. It’s that aspect that’s kept me reading.Grave Secret proves to be a compelling conclusion to the series. Threads introduced in the three previous installments are tied up neatly, without seeming forced or overly convenient. Harris finally solves the disappearance of Harper’s sister, Cameron, while at the same time giving us a fuller picture of the hardships the siblings endured under their parents' neglect. In addition, Harris further addresses the relationship between the protagonists. I appreciated glimpsing Harper’s periodic confusion and concern, since it upped the realism of the unusual pairing. The pacing is on par with the previous books. Tensions run high throughout and once again there are several possible suspects to examine. The inclusion of Manfred is always entertaining, though I do feel he might have been used to better effect. (On a side note, I think the character of Manfred is golden. I would certainly love to see a series based on his exploits.) The final chapters allow for a steady unveiling of answers, and while I might have liked to delve deeper into the emotional backlash, less is sometimes more. I’m not necessarily sad to see Harper go - the series could be draining at times and, as I said, I’d never fully warmed up to the character. I think four books was the perfect length for exploring her gift, her relationships, and the mysteries both professional and personal. Despite it not being a favorite, the Harper Connelly series is still well worth reading. I’d recommend it to any mystery-lover looking for something a little darker and more brisk than a cozy, but more focused on investigation than your average supernatural read. After four installments, I’m left satisfied!"}, {"userName": "Barb Walker", "userReviewDate": "Nov 03, 2009", "userURL": "http://www.goodreads.com/user/show/2884155-barb-walker", "userReview": "Excellent. I loved it as much as I loved the first three. Though, I hate to see it go, I guess I understand. For some reason, I was never \"eaked\" or \"grossed out\" over the entire Harper/Tolliver situation. Never. I saw it from book 1, and I waited for emotions and feelings to surface between the 2 of them, which, finally occured in book 3. It made sense. They are all they have. As proven in nearly all the books, who can they really trust? Each other. The experiences they have shared from their dark days as step-siblings, the roller coaster of being let down by nearly all their family members, and the dark days they still have to deal with as adults - it makes perfect sense that they would have a love for one another that goes so much deeper than being shacked up in a trailer for a few years acting the parts of the actual adults. I have to admit there were times that I literally laughed out loud over some of Harper's thoughts. I re-read those lines and laughed again. I came close to crying on a few occasions. As with all of Charlaine's characters, I get so involved and engrossed in them that I spend an entire week after completing the novel moving on. I'm sure that will be me this next week. Yeah, I felt slightly shorted with the ending. I guess I was expecting a tad bit more emotion,communication and discussion after being fed so much un-forseeable events in the last pages. Sure, Harper summed it up, but i guess I would have preferred to hear her's and Tolliver's feelings about the tragedies that hit them head on. But, at least we were left with a smile knowing they were going to be ok, though I never doubted that. Another award winner in my book! Bring on Sookie # 10 SOON!"}, {"userName": "Anna", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/8668007-anna", "userReview": "[that she'd stayed siblings with Tolliver though, and I think she would have had a much healthier relationship with Manfred. Maybe it's growing up in a stepfamily that has me reacting to this so strongly but stepsib incest is still incest to me, no matter what the law says... And I can't help viewing her feelings for Tolliver as being a pathological outcome of her truly miserable childhood.  (hide spoiler)]"}, {"userName": "Terri ♥ (aka Mrs. Christian Grey)", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/6014919-terri-aka-mrs-christian-grey", "userReview": "Wow. I did not see that coming. What an amazing series. Review to come.Quick review:Cover: Interesting Rating:  NC-17 Steaminess:  HOT Thumbs Up:  5Overall: What a way to end a seriesCharacters: Well WrittenPlot: All the loose ends tie up in a twist I didn’t see comingPage Turner: Yes Series Cont.? Series Ender Recommend:  YesBook Boyfriend: TolliverSUMMARY (60 words or less)I have to say all the little snippets of information we get from book one until now about the back story that is brought to life in this book finally resolve. I have to say, I never saw Tolliver and Harper as brother and sister. They aren’t blood and only met as teenagers. Anyway, read full review for deets.For a full review and yummy pic, see my blog post at:http://mybookboyfriend.blogspot.com/2... Audio ReviewAlyssa Bresnahan did a really good job with this series. She really brought this series to life for me."}, {"userName": "LJ", "userReviewDate": "Dec 02, 2009", "userURL": "http://www.goodreads.com/user/show/250195-lj", "userReview": "First Sentence: “All right,” said the straw-haired woman in the denim jacket.Harper Connelly can see the dead and experience their death. She and her step-brother (no blood relation)/lover, Tolliver, come to Texas at the request of a member of the wealthy Joyce family. Not only was dad’s death as innocent as they thought, but his caretaker died, not of a burst appendix, but from childbirth. The question is raised as to who was the baby’s father and where it the child now? What started out as a fascinating series has degraded into a sexual soap opera filled with redundant information. We are repeatedly told about Harper being struck by lightning and how it affected her leg. We are repeatedly told how Harper and Tolliver were raised together but are not related and now are lovers. We are told MUCH more about their sex lives than I really want to know. We are told every time they order room service. I don’t care!!! Once for each of those items is quite enough, thank you. What I enjoyed about the first three books was that it was an original slant on a paranormal mystery. In this fourth outing, the paranormal aspect was pretty much secondary to the story of highly dysfunctional families. I got through it but only because there was so much I could skip over, and I’m not normally one to so do. I may buy the Kindle version of Book 6 in hope this was an aberration, but I definitely shan’t be buying the hardcover. However, I also read where someone said this is the last book in the series. If so, it’s a shame Ms. Harris didn’t make it a crescendo rather than an off-key note.GRAVE SECRET (Para Mys-Harper Connelly-Texas-Cont) - PoorHarris, Charlaine – 4th in Harper Connelly seriesBerkley Hardcover, 2009, US Hardcover – ISBN: 9780425230152"}, {"userName": "Wealhtheow", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/76129-wealhtheow", "userReview": "At age 15, Harper Connelly was struck by lightning. She survived, but it left her with a bad leg--and the ability to sense the dead. Since then, she and her step-brother Tolliver have traveled the country, solving murders and finding bodies. The closely observed details of their odd life and relationship are the strongest part of the series. Harper and Tolliver are each other's best friends and (as of the third book in the series) lovers. Harris neither ignores nor glamorizes their codependence. Over the years they've worked out systems to keep them sane and healthy (crates of secondhand books in the trunk, daily runs, which chain restaurants are the cheapest and healthiest), but if separated, each is at a loss. And although they just want to make a living, Harper has a strong sense of morality to go with her supernatural power, and so she keeps getting sucked into solving the murders she discovers. The mysteries themselves are always interesting, but also sordid and grim. This is the fourth book in the series, and it mostly deals with Harper and Tolliver's twisted family. This book made me realize that Harris is a much more skillful writer than I realized; she'd laid hints throughout the series, and one extra clue is all it takes to make them go off like a chain reaction. Finally, Harper recieves answers--some to questions she didn't even realize she needed to ask."}, {"userName": "Grace", "userReviewDate": "Oct 31, 2009", "userURL": "http://www.goodreads.com/user/show/2895577-grace", "userReview": "There are two main mysteries going in the concluding volume of the Harper series. One of them's pretty well-done, and the other seems like an afterthought. But by the end of the book, there aren't any lingering questions that would merit another book in the series, so there's that.The story moves along at a fair clip, and unfortunately relies on contrivance a lot to either prolong suspense or force resolution. At times, Harper and her brother/lover/whatever (and it's pretty weird that they haven't settled THAT bit of vocabulary) make mindblowingly stupid choices to further the plot. There's a lot of peppering description with \"she saw someone suspicious out of the corner of her eye, but didn't bother to look closer\" and a couple of instances when you wonder if Harper and her brother/lover/whatever have learned anything about caution from their previous run-ins with people who want them dead. These protagonists are not particularly smart, is what I'm saying.The previous book in the series was far creepier and more suspenseful, and actually had me reading late into the night. This one takes a more Dan Brown route, building up a confrontation only to blow it within a few paragraphs. Read it to wrap up the series, there's nothing wrong with most of the story elements. But it's not as smoothly crafted as I think it could have been, with more time and editing."}, {"userName": "CJ - It's only a Paper Moon", "userReviewDate": "Jun 06, 2009", "userURL": "http://www.goodreads.com/user/show/1357098-cj---it-s-only-a-paper-moon", "userReview": "This is the last Harper Connelly book and it ends perfectly.All I could think as I finished it last night was Wow.Harper has grown, Tolliver has grown and they've grown together. The mystery this time hits real close to home and the twist at the end blindsides and breaks your heart.I wish there had been a little more reflection on the baby but other than that...this book ended the series on the appropriate note - making it a perfect conclusion to one of Charlaine Harris' darker series."}, {"userName": "Jim", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "3.5 stars & the best of this series I've read yet. I dislike Harper. She whines about her past too much. This time, that works out well, though. Lots of twists & turns. Unfortunately, some of the motivations weren't as logical as I would have liked."}, {"userName": "Dee", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/959396-dee", "userReview": "3.75 stars rounded upSadly the conclusion was the weakest part of this quartet. Up until here I'd had no issue with Harper and Tolliver becoming a couple despite being step-siblings. Their respective parents didn't wed until they were both teenagers so the formative years were apart anyway. However the numerous times Harper referred to Tolliver as her brother, while I'm sure were purposely emphasised for the plot conflict, merely made me question it. The three prior books felt as if Harper always knew she had underlying feelings - the over stressing of it by her in this book felt either out of character or as if she'd now discovered her love to be infatuation. Not what you want in a series finale. There was also a bit of over use of the word Latina. (Is that even an actual word?) It made me feel a bit uncomfortable, particularly since the context was always as a domestic or similiar. I've no idea of the protocol in the US, but as a UK reader it gave me an uneasy \"why do you keep mentioning this?\" feeling. The major quibble I had was the stupid-ass reason the murderer killed Cameron. Please. I'd have been more comfortable with a sexual reason than that. Especially since there's no other signs of psychosis to account for it. However I did enjoy the way it was pulled together depite being a rather ridiculous set-up to begin with and I certainly never could have guessed such a scenario! Where books 1-3 were more gritty mysteries, this was like an episode of Dynasty or Dallas. Not quite what I expected. On the other hand it gave a satisfying and definite conclusion to the series which is always good."}, {"userName": "Tatiana", "userReviewDate": "Apr 30, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "As if the third book in the series wasn't bad enough, this fourth book is even worse. The pseudo-incestuous \"thing\" goes on (Tolliver and Harper have sex and then call each other brother and sister just a few moments later!!!). Apparently Harris thinks herself to be a courageous writer a la V.C. Andrews or something, but she is highly mistaken in that assessment. The relationship is portrayed in the books in a creepy and sick way. The story itself is simply a hasty wrap-up of Harper's personal problems done most bizarrely. Suddenly every member of Harper's family has some kind of sick secret (that should have come out years earlier). New vital evidence in the case of Cameron's disappearance comes out of nowhere. Characters act in the most stupid and unreasonable way. There are suicides, senseless murder attempts, people suddenly confessing crimes they are never asked about. God, this book is a huge mess!Charlaine Harris proves once again to be an extremely unreliable writer. She has such a great skill for characterization and weaving a great small-town mystery, but each and every series of hers she ends up taking in a ridiculous direction before killing it completely. I am scared to think what she is going to do next with her Sookie books. The last two are bad as it is. Two stars only because I finished it and it was a moderately fast (although ridiculous) read."}, {"userName": "Regina", "userReviewDate": "Feb 14, 2010", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "ETA (3/2015): It is interesting for me to go back and read this review from 5 years ago. The only thing I liked about this book was Manfred - explains why I am enjoying Harris's new series focusing on Manfred. Enjoying right now anyway. Please Harris keep it consistent. Harris has such a great talent for writing characters and daily life in a small town. Her weakness comes in keeping a series consistent and ending it.Review from 2010:I was very dissapointed by this book. I love Harris and her characters. I really liked the first 3 books in this series, but nothing new happens with the characters. It is the same stuff, they run, they eat salad, they get shot at...... a character in the story was even endangered and murdered for a similar discovery and using the same method as happened in book #1!!! It was a relief to have a resolution of the Cameron issue. She is now at peace. But this book dragged on and I got to a point that I was so thankful for Manfred (a side character) for showing up. I will not be reading #5 if she writes one. I recommend reading the last 25% if you are really curious about finding out what happened to Cameron. That is the only reason to skim this book."}, {"userName": "Sharon", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/4563664-sharon", "userReview": "I picked up the audiobook from the library to listen to during my commute without realizing that I had, indeed, skimmed through the book before. I now know why I skimmed! This series finale is a bit of a mess, I think. I remember really enjoying the first couple of novels in the series but the resolution is somewhat of a disappointment. I found that I didn't much like Harper very much which is a big problem because of the first person narration. Her continual references to Tolliver as her brother when they are engaged to be married is deeply weird, especially since she has no trouble referring to Tolliver's brother and father as her stepbrother and stepfather. It began to anger me that she wasn't able to keep it straight in her own head, much less than when she was talking to people about their relationship. Also, she doesn't have much empathy for other characters or, at least, doesn't seem to feel things very deeply. The Mystery of Missing Cameron solution is really lame, too, even though that story's been a through line of the series."}, {"userName": "Scribblegirl", "userReviewDate": "May 11, 2013", "userURL": "http://www.goodreads.com/user/show/1039260-scribblegirl", "userReview": "Just can't get past the incest. (read half of it) The protagonist (Harper) says several times that her love-interest, who is also her step-brother, is someone she does not have a true familial relationship with, as they were both older when their parents married each other. But then she almost immediately starts to constantly refer to him in the narrative as her brother. With whom she has sex. I'm okay with step-siblings who did not grow up together having other types of relationships, but I am not down with siblings having sex. It's skeezy and gross, and I can't for the life of me figure out why Harris not only went that route but then feels the need to constantly remind the reader that she's done so. If Harper did not constantly call Tolliver her brother, I'd be fine. But she does, and frankly, it so overpowers everything else in the book, that it's just not worth it for me to keep reading. I think it takes a better writer than Ms. Harris to carry off whatever it is she's going for."}, {"userName": "Barbara ★", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/1968285-barbara", "userReview": "I liked the mystery (well mysteries really). I liked that Harper and Tolliver finally had closure on the whole Cameron thing. Both shocks at the end were really a surprise. Honestly I didn't see either one coming.The only issue I had with this book was the whole brother/sister incestuous relationship between Harper and Tolliver. Sure they aren't actually blood related but they were raised together and for years and years Harper introduced Tolliver as her brother and still does. I just find it creepy that they have a sexual relationship and CH made it very visual in this book. I think everyone's reaction to the news that they were getting married validates my reaction."}, {"userName": "Dominika", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/3114403-dominika", "userReview": "I would say 3,5 stars... The book did keep me in suspense, but at the same time, when the mysteries were unraveled I was kind of disappointed... Too rapid, with a very empty feeling to it. Meh. Not my favorite and far from what I was used to when reading the Sookie Stackhouse novels.. Not a good ending to a series. (And why did she keep on calling him her brother?!?!)"}, {"userName": "Natascha", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/7388146-natascha", "userReview": "Das war doch ein recht enttäuschender Abschluss einer bis dahin wirklich guten Reihe. Ständige Wiederholungen, wenig Handlung und Charaktere die sich unendlich dumm verhalten zeichnen diese Geschichte von Anfang bis Ende aus und haben mich fast schon wütend gemacht, denn es fühlt sich an als hätte Charlaine Harris keine Lust mehr auf die Reihe gehabt und wollte sie einfach nur noch schnell beenden. Das Ende fand ich von der Idee her richtig gut, doch wurde hier alles auf so wenigen Seiten und so lieblos aufgeklärt, dass es eigentlich schon fast wieder ein Witz ist, wenn man bedenkt, dass man als Leser seit dem ersten Teil auf die Auflösung wartet und auch hinfiebert. Ich will nicht sagen, dass der letzte Teil mir die komplette Reihe kaputt gemacht hat, aber es ärgert mich, denn ich fühle mich von Charlaine Harris um ein anständig geschriebenes Finale betrogen."}, {"userName": "Kah Cherub", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/5232858-kah-cherub", "userReview": "I wasn't expecting to enjoy this serias as much as I did. I happened upon the first volume and decided to give it a try after SO many Sookie books. I have always been attracted to the paranormal, i.e., mediums, ghosts, the whole thing. I don't necessarily BELIEVE in the people that say they have the power to talk/see/help the dead, but I DO like to read about it and ponder over the possibility.I quickly warmed up to Harper and to Harris' no-nonsense narration. She's very to-the-point (no wonder how short her books are), and that is always refreshing to me. Sometimes too much description takes over the real plot and makes the reader lose some of the focus that should be on the story, not the surroundings. Not that Harris doesn't manage to make us aware of the places where the story takes place, she does, but she ALSO makes it all much more easy to digest. The same goes for secondary characters' descriptions. I like it very much, but some may not.Like I said, Harper was a delight. Even when people kept pestering her to do her corpse-searching job right, and then acting in disbelief about the 'legitimacy' of her very accurate results, she would always find the beast way to deal with the complainer. In this last book Harper FINALLY had the chance to prove she is capable of taking care of herself, and I was happy to see it happening, as she always came off quite dependant upon her brother-turned-lover, not to mention almost weak. And not just physically weak, but mentally as well, sometimes.The book managed to close every mystery that was still open (what happened to Harper's sister, what was the deal with her and Tolliver's other siblings, etc) AND still surprised us some things we didn't quite see coming (at least not in MY case. I could not have been more surprised. LOL). I was also suprised with the romance between them, but I quickly got over it.The series isn't perfect, sure, but there is SOMEthing about it.... I enjoyed it so much that after I was done with the first book, I instantly grabbed the second, and then so on. I ignored my immense TBR list and found time to read the four books, one right after the other, as quickly as possible. And if THAT doesn't tell you something, then I don't know what else to say. ;)"}, {"userName": "Sarah", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "(Source: I own a copy of this book.)This is book 4 in the ‘Harper Connelly’ series.When Harper is called to find out the cause of a woman’s grandfather’s death, she doesn’t expect the strange happenings that follow, and she doesn’t expect for this to ultimately lead her to some discoveries surrounding her sister Cameron’s disappearance.Did the grandfather father a child before he died? What became of the child? And what happened to Cameron?This was an okay end to the series, and I liked the twists at the end, but I did get a bit bored.Harper and Tolliver continued their weird-incest-esque relationship in this book, and it really bugged me how Harper kept calling him her brother still! One minute she would point out that they weren’t blood relations, and that it was okay for them to have a relationship, and the next she would refer to him as her brother! She was also seemingly surprised when her aunt and uncle had a problem with the relationship as they had been brought up as brother and sister, and they almost revelled in the fact that they were ruffling feathers. At the end of the day, if you want to have sex with your step-brother, expect people to not approve, and at least stop referring to him as your brother! Oh, and stop describing his penis! I really don’t want to know!The storyline was otherwise eventful, but not exactly riveting. There were surprise occurrences, there were secrets revealed, and there were twists that I wasn’t expecting, but for the most part I found this book pretty dull, and was fairly bored for most of the book.The ending was a little strange, and I wasn’t 100% happy to be honest. It felt like we had some answers, but that otherwise very little had changed.Overall; an okay story, but I was bored, and the romance was weird.6.5 out of 10."}, {"userName": "Gail", "userReviewDate": "Jan 31, 2010", "userURL": "http://www.goodreads.com/user/show/821301-gail", "userReview": "The perfect book for a long wait at the hospital with interesting story and characters, not too simple and not too complex. A perfect mark.Harper Connelly was struck by lightening as a teenager and now is able to find corpses and tap into their feelings at the last moment of their death. Her stepbrother Tolliver -- who is really not related to her and is now her lover --manages her career and takes care of her. They are hired by a rich Texan family to find out how their rich grandfather really died -- he was found dead by the side of the road. As Harper reveals the answer, she reveals yet another mystery about the death of their grandfather's care giver. After they finish their job with the family, Harper and Tolliver go to visit their half-sisters who were adopted by an aunt. Their terrifying childhoods are never far from the surface. Further complicating matters is that her stepfather and Tolliver's father is now out of jail, drug free and honest at last. Or is he?These two mysteries intertwine and reveal more that anyone could have imagined. Harper finds out at last what happened to her older sister who disappeared at age sixteen. The happy ending is in the knowing not in what the truth reveals. This book has a feel for an ending of the series because it reveals the thread that binds all four books together. A wonderful series with characters whose sad pasts do not stop them from creating a good, solid, and happy present."}, {"userName": "Melanie", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/84502-melanie", "userReview": "I am never disappointed with Charlain Harris's story telling abilities, I obviously enjoy her books when I give them 4 stars...but I have to say that I get incredibly frustrated with her confusion of her own details. I've read her Sookie Stackhouse series and I really enjoyed it; now I'm reading Harper Connely, and it's good fun. But from one book to another, Harper's sisters' ages change, their birth order changes, the NAME of her Uncle changes, along with who her aunt is related to. It's so frustrating that I almost have to call it quits, and not for lack of enjoying the stories or the characters, but because I feel like an author should have enough respect for her own writing that she bothers to pay attention to it--these discrepancies aren't just from one book to another, either. Within one book the details might change drastically, and I just find it ridiculous. If I read a book, I want to feel like I'm there, like this is someone's real story (yes, I understand the difference between fiction and non fiction, but I also think the element of imagination is infinitely important to enjoying any book, and so I imagine that all of this is true). But in real life, my uncle's name won't change from Will to Hank, and my psychic's child won't change from a male to a female, my aunt won't be related to my stepbrother one day and my mother the next...it takes away the magic of a good story for me, I guess is the short of it..."}, {"userName": "Emmie", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/4921869-emmie", "userReview": "I'm really surprised that this series doesn't have a higher cumulative rating. These are much better than her Sookie Stackhouse series, and I thought the characters were more level and well rounded. Hm...I guess I just dug them. I recommend them for a pleasant surprise, they were a lot better than I had expected.After thought- after reading some of the other reviewers I think the issues that cause a lower rating are the very things I liked about this book. It's more serious, a bit darker than the Sookie series. It's a bit less fun really. There's a dark past and then she does fall for her stepbrother. It's a pretty distorted childhood, difficult, drug addiction and neglect. They aren't ever really portrayed as a \"leave it to beaver\" type of sibling relationship so I had no issues. I never felt like it was a brother and sister getting together. It was strange, but she stands on graves and sees death --there's going to be some strange. Also- I think the \"ick\" factor that a lot of people felt is addressed by the similar response of their Aunt, who is pretty aggressively conservative and only wants them to be \"normal\". See my grave/strange comment. It serves to highlight there own issues with it, I mean, it did take four books for them to get to that level. I think if you are wanting books similar to the author's other offerings, this one is less \"chick lit\" than her others. I'll hide this review due to my above spoiler comments."}], "description": "Lightning-struck sleuth Harper Connelly and her stepbrother Tolliver must face their family's troubled past in this gripping mystery from #1 New York Times bestselling author Charlaine Harris.Taking a break from looking for the dead, Harper and Tolliver decide to visit the two little girls they both think of as sisters. But as they travel to Texas, memories of their horrible childhood resurface...To make matters worse, Tolliver learns his father is out of jail and trying to reestablish contact with other family members. Tolliver wants no part of the man--but he may not have a choice in the matter. Soon, family secrets ensnare them both, as Harper finally discovers what happened to her missing sister, Cameron, so many years before. And what she finds out will change her world forever.", "title": "Grave Secret\n      \n          (Harper Connelly #4)", "url": "http://www.goodreads.com/book/show/7932568-grave-secret", "average": 3.95, "cover": "https://images.gr-assets.com/books/1388222960l/7932568.jpg", "reviews": 1464, "authors": [{"url": "https://www.goodreads.com/author/show/17061.Charlaine_Harris", "name": "Charlaine Harris"}], "type": ["Mystery", "Fantasy", "Fantasy", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7932568-grave-secret", "http://www.goodreads.com/book/show/6344832-grave-secret", "http://www.goodreads.com/book/show/7058408-grave-secret", "http://www.goodreads.com/book/show/8583676-grave-secret", "http://www.goodreads.com/book/show/7450931-grave-secret", "http://www.goodreads.com/book/show/301082.Dead_Until_Dark", "http://www.goodreads.com/book/show/140077.Dead_to_the_World", "http://www.goodreads.com/book/show/110494.Living_Dead_in_Dallas", "http://www.goodreads.com/book/show/140082.Club_Dead", "http://www.goodreads.com/book/show/170210.Dead_as_a_Doornail"]}