{"ratings": 65876, "userreviews": [{"userName": "John Grisham", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/8723181-john-grisham", "userReview": "I enjoyed writing this book very much in spite of knowing how it would end."}, {"userName": "Tori", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/971625-tori", "userReview": "Samantha (Grisham's new heroine) was a complete bore. She was a fence sitter in every aspect of her personal life-- friendships, career, love and family. Even if she were a young impetuous lawyer who grew and matured during the book, that would be fine, but she wasn't.I think her personality took any fun out of any suspense that was being created. She didn't really care, so I didn't care. I did enjoy reading about coal mining, flat top mining and black lung disease."}, {"userName": "Lisa", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/4992107-lisa", "userReview": "I think John Grisham forgot to write a story. The entire book was simply a way to preach about the injustice of strip mining and poor old down home mountainfolk in Appalachia. Interesting stuff. Worthy of investigation. Boring presentation. The whole book felt sketchy - nothing had any depth to it: shallow characters, quickly resolved legal issues, shady bad guys, annoying protagonist. The only true observation: working in Big Law can be mind-numbingly exhausting and cutthroat. Skip this one."}, {"userName": "Tucker Elliot", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/7429283-tucker-elliot", "userReview": "This is by far the least enjoyable John Grisham book I’ve read. The book starts fine with “heroine” Samantha Kofer being furloughed in New York – but when she relocates to Virginia to work for a legal aid clinic the story is at turns silly, boring and contrived, but definitely not exciting. Samantha is a “real lawyer” for the first time and the problems she solves for her clients are certainly emotional, but the first half of the book felt like a collection of random short stories about impoverished families getting shafted by big coal companies.The second half of the book is supposed to be tense with Samantha and Jeff Gray behaving like spies as people are eavesdropping on their conversations and following them around … Jeff is hiding a cache of documents that will blow the lid off a case against a coal company and a big law firm … eco-terrorists are shooting out tires at coal mining companies … an evil company might have committed murder … Samantha is weighing her future … go back to New York and get back on the career track or stay in rural Virginia and help impoverished people who can’t afford lawyers … And all of it felt silly. I don’t understand the book description promoting Samantha Kofer as “a new hero” – at least not in any legal/thriller/mystery genres because this book isn’t any of those things. GRAY MOUNTAIN is really about a city lawyer realizing that rich real estate developers aren’t the only people in the world that need lawyers. The fact she didn’t know that already makes her heroic once she figures it out? Uh, no. I just don’t get it at all."}, {"userName": "Angela", "userReviewDate": "Oct 28, 2014", "userURL": "http://www.goodreads.com/user/show/7923905-angela", "userReview": "I started out with the Audible version of this book but the narrator was so awful that I had to stop. Being a longtime Grisham fan, I was not ready to give up and blamed my dislike of the book solely on the horrible choice of the narrator. I purchased the print version and I am sad to say that even though the narration was easily one of the top five worst I have ever encountered, the book was a total disappointment. I kept hoping for improvement as the story progressed, but sadly it was not there. This is not the John Grisham that I has made me a fan of his work. It is almost impossible to believe that he actually wrote this book. The subject had such potential and could have turned out so much better than it did. The main character was so shallow and self-absorbed that I could not care about what happened to her. She seemed to think she was so much better than everyone else she came in contact with. They were so lucky to have the beautiful and talented young New York lawyer to give them her attention. I really disliked her and could have cared less about what she thought or what happened to her. The best character in the book was Donavan and he was killed early in the story. Better to have killed her and based the story on him. At least he had some passion and cared about something besides whining about how she missed the sophistication of the big city. I was very disappointed with this book. The ending was even terrible. It seemed like he just got tired of writing and ended it. But I don not blame him for that. It was probably to painful to keep going. But it would have been nice to at least tie up some of the loose ends created. I would recommend John Grisham fans to skip this one."}, {"userName": "Susan", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/9365612-susan", "userReview": "Disappointing...didn't read like Grisham. Characters, dialogue, plot, all were not up to even the worst Grisham novel. Seemed like someone else wrote this, or he just phoned it in. Hope the next one gets him back on track."}, {"userName": "Sarah Darwin", "userReviewDate": "Nov 11, 2014", "userURL": "http://www.goodreads.com/user/show/24845831-sarah-darwin", "userReview": "I have to write a review of Gray Mountain to balance the ones on GoodReads which persuaded me to spend money on this book. It's terrible. In fact, I managed about a quarter of it and had to stop. It's a long time since I've given up on a book like that but ... The prose is amateurish, the characters barely make it to 'wooden'; the dialogue is embarrassing — consistently implausible, with non sequiturs everywhere; there are interminable passages of exposition where a conversation turns into a local history lecture ... honestly, I used to teach adolescents and got better writing from plenty of them.And as for the \"issue\" ... well, if you're going to tackle something as important as corporations using financial muscle to sidestep the law and wreak havoc on delicate ecosystems, you really have a duty to do it with intelligence. I read enough of this to feel like I was being harangued by one of those adolescents I used to teach, just around the time they'd just discovered their social conscience. You encourage it in a twelve-year-old, but you hope it'll one day grow into something a bit more considered.John Grisham may have been born a country boy but his world view now feels like off-the-shelf affluent metropolitan sentimentality. If you want a book about man's complex, sometimes destructive relationship with the natural world, maybe try some CJ Box, especially his first Joe Pickett novel Open Season. Box actually gets the country, understands the conflicts which arise from mankind's need to exploit the natural world.I feel a bit guilty rubbishing a book this extent, and if it was by some first-time, unknown author I would just say nothing and move on. But I really do have a bee in my bonnet now about publishers churning out junk under the banner of big-name writers, knowing that the brand alone will guarantee big returns. We deserve better. And yes, I know I could just shun all big new releases, that there's plenty of great work out there still to be read. But for those of us who love books a new novel from an author who has delivered in the past is an event. It's something we look forward to, picking up our copy like a child lifting a present from under the Christmas tree. And that makes the disappointment all the greater when it turns out to be something that would never have seen the light of day without the big name on the manuscript. Big Pharma, Big Coal, Big Oil ... yeah, we know all about them. But maybe we ought to talk a little more about Big Publishing.Every author has his not-so-great books, the ones that didn't quite work out, and readers understand that. But Gray Mountain is so shoddily done it just doesn't deserve anyone's forgiveness. Report card on all concerned: must try harder. F-"}, {"userName": "Sandy", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/5745950-sandy", "userReview": "This is one of Gresham's best. I grew up in the area this book is about and saw what he is talking about first hand. It is very accurate and though he does talk about some of the stereotypes of uneducated people in the area, he does not belabor the issue and he does show there are also educated people and that the general personality of the area is one of love and caring about each other. He also shows how absentee owners are raping the land to get and sell coal for the biggest profits for them but at the expense of the health of the people and environment of the region. So sad that many of the people need the coal jobs to live but to do that they are being forced to destroy their own health and their environment--neither of which will ever recover. Great book"}, {"userName": "Karen", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/18674257-karen", "userReview": "I am unable to finish this book. I guess Grisham has decided to follow the lead of most best selling authors today and write a book that will ensure him high praise from the wacko left wing media. He certainly didn't write the book to tell a good story that would pull in his readers and keep them hooked for 400 pages. If you want to read boring page after boring page about the coal industry then this is the book for you. I read because to enjoy a good story and escape for a little while. There is no story here just an author wanting to seem like he really, really cares about those poor, poor people in Appalachia that those big bad coal companies take advantage. We get it Grisham....you really care."}, {"userName": "Jacki Hall", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/20852671-jacki-hall", "userReview": "I don't know if I can come up with the words to describe how much I disliked this book. While described by other characters as a \"brilliant lawyer,\" the lead character Samantha was a cowardly idiot. Or at least all the dialog attributed to her made her seem like she should never have graduated from high school. I think the premise of the story gave us the idea this would be similar to \"The Pelican Brief,\" but in reality it was just a jumble of unrealistic characters and evil employees of large coal companies. Do yourself a favor and re-read \"The Pelican Brief\" and throw this drivel into a fire somewhere. Then you won't be contributing to the profits of big coal and maybe Grisham can leave this whole part of the country behind."}, {"userName": "Tea Jovanović", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Well, it is Grisham, and I adore his style and plots, and as his Serbian translator and editor for years, I must be honnest and say this is not his usual masterpiece... But he is only human after all... :) But worth reading for sure! :)"}, {"userName": "Frances", "userReviewDate": "Dec 02, 2014", "userURL": "http://www.goodreads.com/user/show/37439004-frances", "userReview": "John Grisham has written several fine novels but unfortunately this is not one of them. If you are interested in reading this author take a look at his earlier books and give this one a miss."}, {"userName": "Sara", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/7792453-sara", "userReview": "One of Grisham's weakest books, in my opinion. I was interested in the female lawyer as the main protagonist and the focus on coal mining and its human toll. However, I was at first convinced that there must be a secret female co-writer, as much of the dialogue and romantic situations read like a YA novel. Then, I thought maybe Grisham is just so talented he can summon the voice of a shallow young woman! Either way I was disappointed and will probably not follow any upcoming sequels featuring Samantha Kofer."}, {"userName": "Brenda", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "I'm disappointed in this book. The first half is mostly about the evils of coal mining. The action picks up in the second half, but when I got to the end, I said \"That's it?\" No bad guys got their comeuppance.I didn't really like any of the characters. There were various kinds of lawyers: rich corporate lawyers, high power lawyers, legal aid do-gooders, corrupt lawyers, disbarred lawyers, government lawyers. The clients were mostly poor, uneducated, drug addicts, wife beaters, greedy relatives none of whom could stand up for themselves. All stereotypical. Even the \"good\" guys did illegal things, and there were no police to be seen.This book basically boils down to what kind of lawyer did Samantha want to be. She comes from a posh NYC law firm working a hundred hours a week to the backwoods where she flies an airplane, rides a 4-wheeler, floats in a boat, paddles a kayak, and camps out in an unheated cabin during the winter. She wins her first courtroom case and voilà. A very predictable and unsatisfying ending."}, {"userName": "☮Karen", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "If you had no opinion on coal mining, strip mining, or mountaintop removal before, or if you are in favor of it all because it means jobs and cheap fuel for America, John Grisham will surely turn you around to his opinion, or die trying. But since I already agree with him on practically everything he says and don't need convincing, after a while it does get repetitive and soapbox-like (soapboxie?). This tale of rich vs poor, and big business vs the common man went on a bit too long IMO. The narrator on the audiobook was OK but she sounded really young and gave every character, male or female, the exact same voice. The protagonist Samantha was a whiner and not very likeable yet everyone in the book fell in love with her right and left, which I just didn't get. I'm glad I read it; but on this same topic,  The Secret Wisdom of the Earth  is better by far.I think I just talked myself into lowering my rating from 3 stars to 2.5 but since half stars aren't possible, will leave it at 3."}, {"userName": "Susan Johnson", "userReviewDate": "Feb 21, 2015", "userURL": "http://www.goodreads.com/user/show/5172713-susan-johnson", "userReview": "I did a little happy dance when I finished this book. Was it that good? No, it was opposite. I was so happy that I had finished this piece of drivel that I was jumping for joy. John Grisham has always been a mediocre writer but a good storyteller. He was neither in this book. His writing was appalling bad and the \"plot\" (I use that word loosely) was so hackneyed as to be almost unreadable. It's a shame because the issues dealt with in the book are important. The strip coal mining in Appalachia is horrific and why this is allowed to continue is beyond me. The loss of American jobs is an important story as more and more communities turn to drugs to support themselves. Sometime we might elected a politician who actually cares about these important issues. This book will never galvanize anyone to take needed action and it should. Grisham has let us down in more than one way. I would never ever recommend this book to anyone. Go find something good to read and avoid this drivel like the plague."}, {"userName": "Mike French", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/6761276-mike-french", "userReview": "John Grishsam is a great story teller and Gray Mountain is among his best! Grisham tells a story of a NEW YORK lawyer that ends up in Appalachia as an intern to a legal aid non-profit. In kept me hooked from start to finish!"}, {"userName": "Lynne Spreen", "userReviewDate": "Nov 23, 2014", "userURL": "http://www.goodreads.com/user/show/3448260-lynne-spreen", "userReview": "When I was about 75% through the book, I realized that if the main character, Samantha, died in a fiery plane crash at that point, leaving one of the other female attorneys to rise up and take on the mantle of hero, I wouldn't have felt any emotions. Somehow, most of the characters in this book were flat. The two brothers who were love interests (one potential, one actual) weren't compelling. The bad guys were cartoons. The ending was foreshortened. There were some editing deficiencies. It's too bad, because there was so much potential here. Although I have long enjoyed John Grisham's novels, his last couple of books have felt like he's bored with writing. I used to open up a Grisham and feel like, \"Yeah, I'm home, baby.\" Just his opening descriptions of place and people would elicit that happy feeling of settling in, knowing every chapter would be enjoyable. No longer. Now, it feels as if he's shoveling it out the door. It's like watching Tiger Woods play golf the past few years; kind of sad. If JG doesn't want to write anymore, he should stop. He's made his mark. We'll think highly of him anyway."}, {"userName": "Colleen", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/29229902-colleen", "userReview": "Once again John Grisham educates us about a shocking and compelling subject matter: coal mining and the companies who so blatantly disregard both human life and nature. While I enjoyed the book I thought it fell flat in the suspense factor and character development. So much more could have been done with this book. It is told from the perspective of Samantha who is touted as John Grisham's new hero in the book description. While she did go through some personal growth and development I would hardly call her a hero. Any role she did play was reluctant in uncovering any wrong doing against the coal companies. She never fully committed to any one or anything which I believe is why this novel fell flat of Grisham's usual powerful stories. This certainly was no Pelican Brief and Samantha is no Darby Shaw, which I believe was Grisham's last strong female character."}, {"userName": "Wendy", "userReviewDate": "Nov 22, 2014", "userURL": "http://www.goodreads.com/user/show/19889444-wendy", "userReview": "Gray MountainJohn Grisham has done it again! This was an amazing novel. I can easily say that I think this is the best novel he has written in a very long time and it may be the best novel he has ever written. I would love to see him write a sequel to Gray Mountain. John Grisham is another one of the first authors that I started reading as a teenager and as the years have gone by and I have gotten older his novels have just gotten better and better. Don't pass up on reading this you will definitely be missing out on a great read."}, {"userName": "Doubleday  Books", "userReviewDate": "Jul 17, 2014", "userURL": "http://www.goodreads.com/user/show/1273894-doubleday-books", "userReview": "John Grisham returns with an \"issue-driven\" legal thriller that is sure to rekindle the debate about Mountain Top Removal, especially in Appalachia. He weaves this politically/economically/environmentally loaded matter into the thrilling story of a young attorney—his first female protagonist in some time—who loses her soul-crushing corporate job only to encounter the law head-on in rural Appalachia, where she finally learns what it means to be a lawyer. A wonderful and riveting read, old-school Grisham at his best."}, {"userName": "Thomas Edmund", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/2976142-thomas-edmund", "userReview": "Gray Mountain pulled me in with the first few beats. Samantha a youngish lawyer with prospects is put out on her butt during the 2008 financial crisis. She has the option of keeping her health-care if she signs up to pro-bono work, the only available option legal-aid near Gray Mountain.Then the story started to get a bit too preach. by a bit too preachy I mean almost 50% of the book was spent information dumping all the problems with the coal mining industry. Heck, I don't like strip mining, I don't like coal and I'm concerned about environmental issues. Nonetheless i don't need to read a fiction novel about the perils of the process. There was some attempt to build tension with descriptions of the bully-boy nature of the small town, and in the second half there was more goings on. Unfortunately after slogging through the preaching it was hard to connect to the characters.It turns out the story hinged more on Samantha's decisions and whether she wanted to pursue the more lucrative possibilities of practices law or stick with Gray Mountain. Potentially interesting but underdeveloped, it looks like Grisham is building a whole series but did not bother to keep the first chapter entertaining."}, {"userName": "Alessandra Torre", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/11162852-alessandra-torre", "userReview": "Sloppy workWho was this editor? At any point, did he or she look at John Grisham and tell him how terrible this was? The plot wanders about, and at 75% in, I still didn't know in what general direction the book was going in. The main character is unlikeable, and not intentionally so but most importantly, it just isn't well written. I don't know if I've just grown up as a reader or JG has gotten lazy with time."}, {"userName": "Una Tiers", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/7810515-una-tiers", "userReview": "About the first third of the book, I liked the characters, and enjoyed the drama. The story line quickly became tedious with a narcissistic protagonist and childish figures who play cloak and dagger roles. It reminded me of the old silent movies where the music portrays the emotions along with exaggerated facial/hand gestures.The book was too long and had poor pace."}, {"userName": "Cindy Leighton", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/8801579-cindy-leighton", "userReview": "John Grisham has been my guilty pleasure candy go-to writer for ages, so of course I had pre-ordered Gray Mountain before he made his inexcuseable, unforgiveable defense of \"-old white men in prison who’ve never harmed anybody, would never touch a child. But they got online one night and started surfing around, probably had too much to drink or whatever, and pushed the wrong buttons, went too far and got into child porn.” You would think a lawyer would understand that if there were no market for child pornography there would be no child pornography; that this is not a victimless crime, that creepy old men who like to look at child pornography do INDEED HARM SOMEONE - children. So on this alone I am done with John Grisham.But I had already paid for the book . . . so of course I had to read it. I love his preachy, \"one-issue\" books and never get tired of sticking it to the big corporations. I enjoyed the anti-coal company line, but the book itself was tiresome. What disappointed most was his promotion of this book as having his second \"female protagonist.\" Samantha is hardly a protagonist - She is surrounded by and overshadowed by three male characters, one of whom is dead most of the book and still manages to be stronger, more likeable, and more active than she is. She is the most passive, pathetic, wishy washy character who just rides along and lets other push her and make decisions for her. Her dialogue is totally unrealistic - perhaps every male's fantasy of what a woman is like? Ick Goodbye John Grisham."}, {"userName": "Kristy", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/126296-kristy", "userReview": "It's a little unfair to John Grisham, but I probably would have rated this book 4 stars if he didn't write it. It was a pretty good book, but I kept waiting for the typical Grisham-flair to pop up - a huge courtroom battle, an epic good versus evil duel, etc. Instead, the battle and storyline I would have really wanted to read about goes on in the background as a secondary storyline. The main plot follows Samantha Kofer, a young law associate at a powerful firm in New York City. However, when the recession hits in '08, Samantha finds herself furloughed and in order to keep her health insurance, and to potentially get her old job back, must intern at a rural legal aid clinic in Brady, Virginia. There Samantha meets a cast of characters, including Mattie, who runs the clinic; her nephew, Donovan, also a lawyer; Donovan's shady brother, Jeff; and a host of other rural townsfolk. She also gets her first taste of real law. We, the reader, learn about the atrocities of Big Coal and strip mining, including Black Lung Disease, which the book goes into in great detail (and which personally, makes me want to become a lawyer or social worker, as it's all awful). It's interesting to have Grisham write in the voice of a young female. It takes me back to Darby Shaw (of \"The Pelican Brief\" - one of my all-time favorite Grisham novels), though Samantha is *no* Darby Shaw, by any stretch of the imagination. She's a bit spineless, though, really, she's not given much story to work with. The first 3/4 of the book I mostly enjoyed and then the last 1/4 just sort of tapers off. It almost seems as if a sequel is in order, but who knows. Again, I think I might have liked Samantha and her story a bit more if it wasn't Grisham, as I might have expected a bit less. It's a good read, but leaves you wanting more."}, {"userName": "Darcy", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/2225246-darcy", "userReview": "For so much of this one I found myself bored. I almost quit reading when I was about 40% of the way through, as that is a good portion of the book to be in, yet bored with it. But there was something that kept me reading. It wasn't until the last bit that things started to pick up. I did like how Samantha changed over the course of the book. That she went from seeing the people of Brady as pathetic as to living a hard life the best that they could. I wasn't always happy with who Samantha surrounded herself with, mostly because it seemed like their morals were at odds with hers. She would let them know and they would still push her for more.I'm torn with the ending of this one. I feel like it left off in the middle of the story, that there is more to come, but am happy with the final choice that Samantha made."}, {"userName": "Judy Collins", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "John Grisham’s   GRAY MOUNTAIN, a suspenseful and powerful legal thriller of a young city girl, heading south; lands in rural Virginia, in the middle of Big Coal evil corruption, and a community left defenseless under their control. Samantha Kofer (29 yr. old) loses her Wall Street job in commercial real estate law with a top firm, after the collapse, during the 2008 recession. Washington native, graduate of Georgetown and Columbia Law, she was a third-year associate at a huge New York law firm, working around the clock, making the big bucks; however, she finds herself unsatisfied, her lifestyle eating up her income, and no savings to tide her over for the next year. In order to retain her status for a year at the firm, and maintain her health insurance, she needs to take on a year legal aid internship for a non-profit. She finds herself getting one reject after another, and just as she is about to give up, she accepts a position with Mountain Legal Aid Clinic in Brady, VA, population 2,200 in the middle of a poor Appalachian coal mining town.Definitely a culture shock; however, she quickly finds there are some deep problems and a great need for legal assistance, in this community. Many lives have been destroyed by the coal mining business - every kind of cancer and contamination, and sickness you can list. However, no one seems to be able to win as they try and fight the Goliath giant. Samantha is no stranger  to the law business, as her father is still a high-profile consultant, having served time with playing on the fence—a fine line between good and evil. However, he knows the players and may be able to help pull together some financing of some of these cases which take a lot of money to prepare before the payout, that the smaller firms are not able to withstand. Mattie, is her new boss at the legal aid clinic and has worked diligently for over 25 years to offer help to those who cannot afford legal assistance. Samantha is helping with her first case, and quickly moves on to a case of black lung problems. No one seems  to protect the interest of the miners, ones who have breathed in the chemicals and are entitled to disability payments. Of course, as most big corporate giants, they have the funds to tie up legal cases for years in court and the system; thereby delaying funds until they die or give up the fight, or wear them down, not having the funds to continue.Of course, the doctors, prosecutors, judges, politicians, and regulators are all in the back pocket of these big players, furthermore making it difficult to fight for their rights. One of the big cases involved two little boy which died in a trailer from the fault of the Big Coal, and there is much suspense as to holding out for more money for this family for a settlement, as they go up against the big boys, or go to trial (like playing the stock market with many risks). Sam soon finds she has much to learn and is subjected to sensitive and confidential information. She now has to prepare a lawsuit and handle things she has never done, with high stakes, obstacles, and challenges which threaten lives. In the process she finds there are secrets, threats, and people who will kill in order to keep them buried.Mattie’s nephew a good-looking young lawyer named Donovan, a one-man trailblazer; and driven attorney in pursuit of taking down Big Coal, for strip mining/mountaintop removal, which is cheaper and more cost efficient for them to remove the tops of mountains than to dig for it underground, which in turn does damage to the environment, streams, valleys and humans. To further complicate, Donovan is also holding some secret documents, which have been stolen (brilliantly); which prove the mining company knew that chemicals it used in mountaintop removal have for a decade been polluting the wells of a small town nearby, giving it one of the highest cancer rates in America. Samantha finds herself drawn to the fight, and to the people, as she gets personally involved with assisting the team in a legal capacity, as they fight for their rights against the powerful and evil Big Coal business. In the process, she learns more about herself, and finds her purpose in life, without the frills of the big city.GRAY MOUNTAIN  is much more than a legal thriller, as offers a human interest side and dynamics with the victims, the families, the community, the beauty of the area, the poverty, and the lives of the attorneys and families fighting to protect them.Wow, was excited to get back to Grisham!  I was an avid reader of Grisham before 2010 and read every book by this talented author (as one of my favorite genres)  and enjoyed the movies; however, noticed have none of these books marked as “read” on Goodreads, as it was \"pre-Goodreads' time; so I see I have a lot of reviews to catch up. I enjoy this type of legal thriller; bringing down the big boys, with justice for the victims in a David versus Goliath story. I have recently read some great books regarding law and justice.  Just Mercy by Bryan Stevenson 10/21/14 (non-fiction), a powerful true story about the potential for mercy to redeem us, and a clarion call to fix our broken system of justice—from one of the most brilliant and influential lawyers of our time. GRAY MOUNTAIN  is a captivating and engaging read; highly recommend. I listened to the audiobook and the performer, Catherine Taber was an excellent voice for Sam. Welcome back, John, you have been missed!  JDCMustReadBooks \nTOP 30 BOOKS OF 2014"}, {"userName": "Labijose", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/17739204-labijose", "userReview": "Empieza bastante bien, tiene un trasfondo medioambiental y de denuncia muy interesante, y además la protagonista es una mujer, lo que supone un interesante cambio en los habituales protagonistas masculinos de Grisham. Pero lo que podría haber sido una gran novela termina dejándote casi indiferente, debido a la debilidad del personaje principal (Samantha), que, simplificando, ni come ni deja comer, sacándome de quicio en más de una ocasión.Es una de las novelas más “lentas” del autor. Tampoco pasa mucho en ella: Abogada pija norteamericana, que sufre los efectos de la crisis y es despedida. Le ofrecen en un puesto en una consultoría para gente sin recursos allá en los Apalaches, … y allí descubre un mundo que cambiará radicalmente su filosofía de vida.Como ya he dicho, podría haber sido una gran novela, pues tiene potencial, pero la fragilidad de Samantha en todos los aspectos me ha dejado bastante frío. No invita a leer futuras secuelas, caso de haberlas."}, {"userName": "Barbara", "userReviewDate": "Jan 01, 2015", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "3.5 starsSamantha Kofer is a third-year-associate at the Scully & Pershing law firm in New York when she's 'furloughed' because of the economy. Advised that she might be rehired after a stint as an unpaid intern Samantha takes a position with Mountain Aid Legal Clinic in Brady, Virginia, an all-women firm. Brady is in coal country, where coal mining provides numerous jobs as well as plenty of work for the free legal clinic. Within days Samantha - a real estate attorney who never litigated a case - is dealing with spousal abuse, check garnishment, and black lung disease - a horrible affliction associated with coal mining. Samantha becomes friendly with a local attorney, Donovan Gray, whose family owns 'Gray Mountain', a site that's been destroyed by strip mining. As Samantha learns, strip mining - besides devastating the environment - produces cancer-causing sludge and leads to additional deaths from careless practices and reckless driving of coal trucks. One of Donovan's current cases concerns the death of two children when a boulder, pushed off the mountain by miners, rolled down and destroyed their trailer home. It's almost impossible to win lawsuits against the mining companies because they employ powerful law firms that fight dirty. They also have politicians and judges in their pockets. Donovan does manage to win sometimes, though, because he's willing to fight as dirty as the coal companies. As the story proceeds Donovan plans to file a couple of huge lawsuits against mining companies that would embarass them and potentially net millions of dollars in damages - and he wants Samantha to help him. The coal companies fight back hard, even pulling in the FBI to assist them. But, as it turns out, Samantha has some useful contacts of her own. The book has a large array of interesting and entertaining characters, including Samantha's parents (both lawyers), her co-workers, and her clients. There's even a spot of romance. The book makes it clear that the author is appalled by coal company practices. I enjoyed the story and learned a lot about corporate dirty tricks. My biggest criticism is that the book leaves a couple of story lines unresolved and seems unfinished. Still, it's a good story as far as it goes. Grisham fans would probably enjoy the book.You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}], "description": "John Grisham has a new hero . . . and she’s full of surprises\n The year is 2008 and Samantha Kofer’s career at a huge Wall Street law firm is on the fast track—until the recession hits and she gets downsized, furloughed, escorted out of the building. Samantha, though, is one of the “lucky” associates. She’s offered an opportunity to work at a legal aid clinic for one year without pay, after which there would be a slim chance that she’d get her old job back.In a matter of days Samantha moves from Manhattan to Brady, Virginia, population 2,200, in the heart of Appalachia, a part of the world she has only read about. Mattie Wyatt, lifelong Brady resident and head of the town’s legal aid clinic, is there to teach her how to “help real people with real problems.” For the first time in her career, Samantha prepares a lawsuit, sees the inside of an actual courtroom, gets scolded by a judge, and receives threats from locals who aren’t so thrilled to have a big-city lawyer in town. And she learns that Brady, like most small towns, harbors some big secrets.Her new job takes Samantha into the murky and dangerous world of coal mining, where laws are often broken, rules are ignored, regulations are flouted, communities are divided, and the land itself is under attack from Big Coal. Violence is always just around the corner, and within weeks Samantha finds herself engulfed in litigation that turns deadly.", "title": "Gray Mountain", "url": "http://www.goodreads.com/book/show/20707959-gray-mountain", "average": 3.54, "cover": "https://images.gr-assets.com/books/1403704671l/20707959.jpg", "reviews": 7489, "authors": [{"url": "https://www.goodreads.com/author/show/721.John_Grisham", "name": "John Grisham"}], "type": ["Fiction", "Mystery", "Thriller", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/20707959-gray-mountain", "http://www.goodreads.com/book/show/22067311-gray-mountain", "http://www.goodreads.com/book/show/22124663-gray-mountain", "http://www.goodreads.com/book/show/22926734-gray-mountain", "http://www.goodreads.com/book/show/22124666-gray-mountain", "http://www.goodreads.com/book/show/22877125-gray-mountain", "http://www.goodreads.com/book/show/32542.A_Time_to_Kill", "http://www.goodreads.com/book/show/5358.The_Firm", "http://www.goodreads.com/book/show/5359.The_Client", "http://www.goodreads.com/book/show/32499.The_Pelican_Brief", "http://www.goodreads.com/book/show/24192.The_Runaway_Jury"]}