{"ratings": 7928, "userreviews": [{"userName": "Jason Koivu", "userReviewDate": "Sep 23, 2012", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "The machismo is thick and pungent in Green Hills of Africa, Hemingway's autobiographical account of a hunting trip in Africa. At times it felt like the verbalization of this...It is one part self-glorifying portrayal of a man's man and one part vilification of the same man for the same reason. If alpha-dog Hemingway had lived into his 80s, he would've lived into the 1980s, and if he had I feel certain he would've been a contestant on American Gladiators. Afterwards he would've admitted he was acting like a damn fool. That's just how he was, ALL MAN! GRRR! But too introspective to believe his own bullshit. Aside from that, there are some interesting details on big game hunting, African tribesmen and guides, and the occasional difficulty or ease of language exchange. When not hunting, Hemingway talks books and writers with the few intellectuals he brought with him on the trip or came across along the way. We hear his opinion on the quality of the writer's of his day and just prior. Readers of A Movable Feast or those who know his personal history will catch the thinly veiled criticism of his once mentor Gertrude Stein. Green Hills of Africa has lyrical turns and can be engrossing, especially if you have read some of his previous work. An interest in hunting might help, too. But of all his output, I could not suggest reading this first as it is not \"Hemingway,\" as in \"Have you read Hemingway?\" This is more like a supplement for his fans who want to learn more about the man and/or the myth."}, {"userName": "Darwin8u", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "Where a man feels at home, outside of where he's born, is where he's meant to go.\"- Ernest HemingwayOnce, when I was 11 or 12, I begged my father to take me Mule deer hunting in Utah. Growing up in the West, among a certain strata of boy, the October deer hunt was a sort of blood ritual. We would take off from school for a couple days, go into the mountains with our fathers, shoot at things, and come home. At this time in my life, I had tremendous blood lust. I wanted to bring something down. To be at the top of the pyramid for a second. To conquer something. I wasn't at the stage where I could explore where these impulses came from. The desire to carry and shoot. The desire to kill and show off my trophy. It really was a deep thing. I think as a child, I can best explain it as some way of coming to grips with the discovery that you are no longer the center of the Universe. You have recently discovered you aren't a god. So, you act like a god. You seek to become Shiva the destroyer, the killer of groundhogs, of robins, the boy who pulls the stinger out of bees in the window. Lucky for me, I discovered (much later in life) that my father, a veterinarian, used to steer me away from the deer. He was happy to hike, camp, and shoot with me. He understood better than I, the stage I was in. Perhaps, at 11 or 12, disappointment with not finding something to kill might serve me better than blood. Even now as I've grown, as I read Hemingway's 'Green Hills of Africa' and I feel all of those early impulses again. After finishing this story, I did a Google search to see how much a Safari in South Africa and Zimbabwe costs now days. I know this is absurd. It is one of those things I mock and despise among the rich. Photos of the Trump boys displaying their trophies or the owner of Jimmy Johns standing under an Elephant he has recently killed makes me both angry and sad at the same time. But I STILL, emotionally, deep down find myself thinking about Hemingway and Roosevelt. Thinking about the big tests, the pursuit, the hunt, the blood. It sickens and attracts. It is visceral. I really think C. G. Poore captured it perfectly when he said this story was \"about people in unacknowledged conflict and about the pleasures of travel and the pleasures of drinking and war and peace and writing.\""}, {"userName": "Ellen", "userReviewDate": "Nov 14, 2009", "userURL": "http://www.goodreads.com/user/show/2927182-ellen", "userReview": "The subject of the pursuit is the elusive kudu, an animal you must hunt alone, like writers must write alone...In Hemingway’s experimental work, the Green Hills of Africa, he produces possibly one of the earliest works of creative nonfiction, reveals how the search for good land parallels a writer’s search for good material, and most of all, reveals himself—warts and all. * * *“Fitting in,” being recognized as an aficionado, or knowing how to be an insider (rather than a tourist) surfaces as a dominant theme in Hemingway’s fiction and non-fiction. Hemingway prides himself on knowing how to handle his liquor, how to appreciate bullfighting, how to fish and hunt, and, most importantly, how to become accepted in any country he visits. Hemingway’s self-image, however, may be at odds with reality. In Africa, for example, the paid trackers that accompany Hemingway on his safari may or may not respect him. Further, whether Hemingway achieves insider status is moot since his view of Africa remains hopelessly distorted due to his position of privilege and his cultural baggage. In The Green Hills of Africa, Hemingway’s project to write an “absolutely true book” tends to deconstruct. Often, Hemingway achieves truth in ways he may not have intended and fails to achieve truth in ways he may not have foreseen.Throughout his book, Hemingway uses Africa: as a hunting resource, as an extended metaphor, and as material for his next book. Despite Hemingway’s goal to present an “absolutely true book,” his rearrangement of events and extensive use of metaphor lend a fictional resonance to his purported non-fiction. The landscape, or “shape of a country,” operates on several levels in Green Hills. During Hemingway and Kandisky’s literary discussion, a metaphor is set up that extends throughout the book. Hemingway makes an implicit comparison between hunting and writing. The writer’s material becomes the landscape while his subject is the quest or “pursuit” itself. In Green Hills the subject of the pursuit is the elusive kudu, an animal you must hunt alone, like writers must write alone or else—contaminated by their contact with other writers—they all will become “angleworms in a bottle, trying to derive knowledge and nourishment from their own contact and from the bottle” (21). In addition to the criteria Hemingway cites to become a great writer, namely talent, discipline, sincerity, intelligence, detachment, and time (27), it becomes apparent that the writer’s material, metaphorically the landscape, is also essential for success. Writers who do not experience life honestly and empirically will not have the material to be great but will instead present their “knowledge . . . wrapped in the rhetoric like plums in a pudding” (20), or write second-hand, dead prose. Kandisky, a watcher, exemplifies the sort of sterile, second-hand lifestyle Hemingway views as unproductive. Commenting on their conversation, Kandisky remarks, “This is what I enjoy. This is the best part of life. The life of the mind. This is not killing kudu” (19). What Kandisky omits in his version of the good life is the process of pursuit.In Green Hills, Hemingway’s quest for suitable terrain dramatizes the writer’s creative process. His search for good land—the material—consumes much of the book’s action. Not surprisingly, the kudu embodies the writer’s aim, a goal Kandisky (a non-writer, non-hunter, non-taker-of-risks) can no more understand than the pursuit of the kudu. Kandisky, in fact, skeptically interrogates Hemingway’s motivation in both pursuits: as hunter and as writer.By setting up this comparison between writing and hunting, material and land, early in the book, the narrative takes on the resonance of allegory, a literary device again crossing the boundaries of Hemingway’s ostensibly non-fictional project. As allegory, all the descriptions of landscape and pursuit may be read in terms of the writer’s craft and vice-versa. The repeated literary discussions and comments throughout the book—seemingly digressive non-sequiturs—reinforce this parallel construction; they are all as much about hunting as writing.Hemingway thus imbues the African landscape with value: there is good land and bad land. In keeping with the patterns Carlos Baker has noted, the low lands are bad while the highlands (hills) are good. Consequently, Hemingway experiences mostly frustration and disappointment on the Serengeti plains and the Rift Valley. Both areas emerge as wastelands. Clearly, these barren lands are as incapable of generating superior game as poor material is of generating superior prose. Predictably, the kudu are found in the lush highlands, a land that emerges unexpectedly and wonderfully at the edge of the plain.Under scrutiny, however, Hemingway’s allegorized landscape of good land/bad land, good material/bad material deteriorates. Even with talent or good land or good material, corruption lurks at the fringes. Similarly, the writer’s ability to truly represent reality—Hemingway’s standard for writing excellence—faces constant erosion due to the pressures of time as well as the exploitative forces of civilization.In the metafictional world of Green Hills, then, what Hemingway sees happening to the land relates back directly to what he sees happening to writers. The land itself—particularly good land—will ultimately fall prey to corruption and exploitation. Throughout the book, Hemingway refers to Tanganyika’s similarities to more familiar landscapes such as that of Michigan, Wyoming, Spain, France, and so forth, to universalize his experience. Tanganyika becomes synecdochical for the physical world as well as the textual world of the writer. Accordingly, Hemingway looks at Africa through the optics of his homelands, weaving several countries into the East African terrain until Tanganyika serves as geographical microcosm. Hemingway’s nostalgic references to other civilizations serve to reinforce the idea that the old frontiers—American, Spain, France, etc.—have been exploited, only isolated pockets of wilderness remain, and that even the relatively “virgin” terrain of East Africa demonstrates signs of infiltration. Interestingly, Hemingway does not comment on how his own big game hunting contributes to this exploitation.East Africa, though, is like a young, talented writer: fertile, valuable, and only showing faint traces of corruption. Hemingway can still find in the Masai’s terrain “a virgin country, an un-hunted pocket in the million miles of bloody Africa” (218). The Masai who live in this Eden are, appropriately, young and healthy. Conversely, association with civilization has already begun to mar the other areas of East Africa. The two trackers that lead him to the more idyllic Masai are, as Hemingway depicts them, a “disreputable” old man and his younger companion, a “skinny, dirty, Waterboo” (207). Hemingway’s inability to recognize himself as the “other” in Africa, as someone who stands out rather than blending into the landscape, blinds him to his role in marring Africa’s \"virginity.\" Instead, Hemingway continues his “use” of Africa as both a big-game resource and as a metaphor for writing. Even with the best land and best material, Hemingway posits, the hunter/writer may still fail. In Hemingway’s view, a writer who “cheats” can only turn out a corrupt product. In similar terms, a hunter who does not shoot cleanly will leave an animal “gut-shot,” to die uncleanly and horribly. The hyena represents the dirty death of integrity and talent. Ultimately, there is only death, dirty or clean. Whether by the forces of time or corruption, the hunter and/or writer’s talents will erode.As Hemingway’s text suggests, to write well the author must experience the world and then be able to translate it. Hemingway provides us with an example. He takes the experience of his two-month safari, and omits, re-arranges, and condenses the action. In his reconstruction of events, the narrative begins near the end and then flashes back into the time just after Hemingway’s return from the hospital in Nairobi. The third section continues the action begun in section one, and the final section covers the last two days of the safari as well as a brief section a month later in Haifa, where they reminisce about the trip.Hemingway’s manipulation of time serves a number of purposes. In his narrative unraveling, time folds back upon itself to form a circle. The “end” of the story—the final three days of the safari—receives double emphasis by its placement at the end and beginning of the book. Of the book’s nearly three hundred pages, over half are devoted to the last three days of the safari. Hemingway’s refusal to present events chronologically is analogous to Roman Ingarden’s assertion that, once read, a book “exists simultaneously” and nothing is really later or earlier in a “temporal sense.”Our memory of real time operates similarly. Once experienced, an event exists in our consciousness in no particular order, and we may order the action and magnify it as we see fit. That Hemingway’s manipulation of time and action takes place in an autobiography—a form of non-fiction—rather than in a novel, highlights the artifice of chronological, so-called “realistic” fiction. Allegory, implicitly used through Green Hills, similarly fragments and spatializes time. As explained by Paul de Man, allegory exposes the slippage between sign and signifier rather than presuming the innate connection between sign and signifier symbolism implies. There is, for example, no logical or innate reason for Hemingway to overlay the process of hunting onto the process of writing except as the arbitrary—but artistic—conflation of events in his mind.Hemingway’s separation of good land/bad land also leads to manipulation of time and action. Recognizing the redemptive powers of language, Hemingway hastens his narration of time spent in the dried-up plains but shifts into narrative slow motion when they are in the highlands. The cluster of associations that Hemingway uses to instill an “emotional atmosphere” into the landscape describes the “fourth dimension” of writing he refers in his earlier literary conversation with Kandisky. The good lands (the highlands) contain the good animals (kudu, sable) and good people (Masai). Hemingway’s oft-discussed “fifth dimension” involves another step. The earth, contrary to the passage from Ecclesiastes Hemingway quotes in The Sun Also Rises, may abide forever but not as it was. Crumbling and eroding under the effects of time and exploitation, the earth moves toward entropy. The hyena may ravage the beauty of the kudu; ego may dissolve the talent of writers; and, though it is not mentioned, people very much like Hemingway may destroy Africa’s virgin splendor. Nothing lasts; all things lose their innocence. However, if done perfectly, writing may preserve an experience, a landscape—as it was—forever. Against the corrosive effects of time, a “perfect” representation of reality—the emotions, the sensations, not just the facts—may allow someone to experience what we experienced, over and over again: the fifth dimension. Although he does not use that term, in the beginning of Death in the Afternoon, Hemingway writes what is perhaps his clearest articulation of the fifth dimension: \"[it is:] the real thing, the sequence of motion and fact which made the emotion and which would be as valid in a year or in ten years or, with luck and if you stated it purely enough, always” (2). When Hemingway states, then, that he will try to present the facts of the safari truly, he does not mean that there will be no artistic intervention. Clearly, a true representation can only occur with mediation, with the devices we generally associate with fiction. Hemingway’s assertion that none of the characters in the book is “imaginary” also warrants qualification. In Green Hills, Hemingway dominates the textual horizon; the other characters, thinly drawn, emerge as shadows in comparison. In contrast to the way he has represented Africa’s landscape, enhanced by full fictional apparatus, Hemingway’s representation of himself seems inescapably concrete; he juts into the narrative line, often acting un-heroically, but always complex . . . multivalent. Hemingway’s centeredness, his omnipresence, parallels the way we see ourselves. In this sense, then, the tendency for the Hemingway-persona to remain center-stage is a form of realism; we all enact this myth, Hemingway merely underscores it.Like the landscape and the events of the safari that Hemingway so carefully shapes and crafts, his own persona, in order to appear “real” has undergone considerable construction. The construction of an autobiographical subject, to use Paul de Man’s terms, is always a process of “blindness and insight.” An autobiographer looking at his life, like a critic surveying a literary work, can only see parts of it, and selects from these parts the moments that will comprise his or her autobiography. But what of Hemingway’s project to present characters—including himself—truly? If autobiography involves omission, selection, reconstruction and, finally, our erasure by writing itself, the ability to create a “true” representation becomes impossible. True representation, seen as an attempt to mirror reality, can be only a nostalgic dream. Certainly, the overtly fictional techniques in Green Hills do not reflect an attempt to make reality equal imitation. Instead, Hemingway would probably concur with Virginia Woolf’s reputed remark: “Art is not a copy of the real world. One the damn things is enough.”In the sense that Green Hills is a representation that totalizes or expresses everything in Hemingway’s safari, it is a failure. No one representation can ever be adequate. At best, the book is a fragment of how Hemingway remembered his experience, further distanced by the alienating powers of language. Hemingway, then, uses the word true to mean an artistic, rather than merely factual representation. Further, the Africa Hemingway constructs is blurred by the optics of privilege. Hemingway’s Africa would bear little resemblance to the Africa experienced by its own people. Consciously or unconsciously, Hemingway uses Africa. Throughout Green Hills, Africa is romanticized, allegorized, reduced to metaphor, and plundered. While Hemingway does construct a work of art, the truth of Green Hills, on any level, remains questionable. For all his efforts to present himself as an insider, as someone who understood Africa, Hemingway remains an outsider. Hemingway, at one point in the book, expresses his distaste for “safari books” written with a “bwana-mentality.” Yet, for all its artistry, Hemingway’s position as a tourist and the book’s biased construction of Africa, may relegate Green Hills to being just another safari book, though one better written than most."}, {"userName": "Chrissie", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "This is non-fiction. It is about a big-game hunting safari taken by Ernest Hemingway and his second wife Pauline Marie Pfeiffer in December 1933. They traveled to East Africa. Aided by native trackers, they hunted buffalo, rhinoceros, kudu and sable antelope. These were the big attractions of the hunt. More important still was who of the hunters would achieve the biggest kill. In my eyes, the competition between the men was extremely childish, the hunt itself gruesome and revolting. The book is composed of four parts: \"Pursuit and Conversation\", \"Pursuit Remembered\", \"Pursuit and Failure\", and \"Pursuit as Happiness\".In the first and second parts, Hemingway expresses his personal views on a number of American and European authors. He refers to Mark Twain, Stephen Crane, Sinclair Lewis, James Joyce, Rainer Maria Rilke, Leo Tolstoy, Gustave Flaubert and Fyodor Dostoevsky for example. He speaks of which of their works HE admires most, but there is not deep analysis of any of the writers. This did add a speck of interest, but I do not see why it is found here in this book on African hunting!The second part has a flashback to earlier hunting in the Rift Valley of Tanzania. The third part—look at its title: “Pursuit and Failure”. It is full of grumbling, complaining and whining. Men behaving as small boys.The fourth part gets a bit better. The “little boy”s became less sour when they manage to kill more animals. Hemingway waxes lyrical when with a possibility of success, he describes virgin forests and lands of pristine beauty. He has the eyes to see the nobility, the beauty and the intelligence of the Maasai people. Unfortunately then he reverts to the hunt, to the tracking of blood trails and gruesome slaughter and skinning of his prey…..and again his fixation on who got the biggest and the best kill.I am generous when I give this two stars; most of it I did not like at all. Parts not disgusting or childish were instead boring. This could have been so much better had Hemingway stopped pouting and observed with open eyes the landscape around him and its people.The audiobook is narrated by Josh Lucas. It was OK. At times, particularly in the beginning, he speaks so softly, mumbling, making it difficult to properly hear what is said. It does improve. I have no idea if the African words were properly pronounced, but clearly, he loved the swearing in Hemingway’s text. Hemingway speaks to us in the first person. The intonation used is not how I imagine Hemingway sounded.I usually enjoy Hemingway’s prose style, but there are only a few such lines here."}, {"userName": "Nikos Tsentemeidis", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/27325053-nikos-tsentemeidis", "userReview": "Η βαθμολογία αποκλειστικά λόγω θεματολογίας. Οι προσωπικές στιγμές του συγγραφέα στην Αφρική κυνηγώντας άγρια ζώα. Οι περιγραφές αφορούν την \"γοητεία του κυνηγιού\" και τη θανάτωση των ζώων. Κάποιες στιγμές ενδιάμεσα, συζητήσεων σχετικά με την λογοτεχνία, τη ζωή κτλ. δεν ήταν αρκετές, για την τελική εντύπωση που μου άφησε το βιβλίο αυτό."}, {"userName": "Santiago Dotta", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/7129309-santiago-dotta", "userReview": "Hemingway makes me realize I'm a pussy. He makes me realize every male human around me is a pussy. After reading this book I tried to find Hemingway's masculinity and spirit in every men I know (personally and famous ones), and of course the results where dissapointing. Then I realized, that EH couldn't live in our era. That there exists a symbiotic relationship between EH and the first half of 20th century. If you read breifly about Hemingway's life in Wikipedia, you realized his own life is a harsh novel itself. And that his personality was shaped by all the events that occurred in this period of Human History. Wars, financial depressions, male chauvinism and huge rascists concepts accepted in society...and this events reached every men alive in occidental countries. Nowadays, we are taught that all these \"events\" were terrible for humanity, and, though they still exist, we must make our efforts to avoid them. In an effort to put a 21st century man in \"Green Hills of Africa\" scenes, I cannot imagine a high class, white wealthy adult travelling alone with 5 masai through the unknown, describing their body odor as a tasty fragance, without being able to communicate except by hand signals and an old dictionary, and leaving behind their blackberrys and Ipads, guiding themselves by following tracks and wind changes, without Garmin or TomTom guidances. Today the meaning of masculinity has drastically changed. And reading over EH books feels like a rearviewmirror to a more simple life...Hemingway has a way to disguise testosterone in words, and for me reading this book was a huge blow of it.After I finished it, I had the fool idea of searching web pages about hunting safaris in Africa, and prices on Springfield rifles. But after seeing some videos on youtube about major african hunt, I once again realized I'm not made of Hermingway's wood. It's kind of dissapointing and a relief at the same time, hehe. Now, sitting in a coffee shop, drinking a gellatto, and tiping in my netbook, make me feel ashamed that if Ernest sees me, he would call me a single phrase: \"you really ARE a pussy\"."}, {"userName": "Conor", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/2252106-conor", "userReview": "I do have positive things to say about this book but they are so tragically overshadowed by the negative.Frankly, I found this book boring. Perhaps I'm not the target audience but Hemingway made an East African hunting safari in 1935 seem unappealing. Book Summary: Hemingway goes up a hill, looks for kudu, shoots something, his Africans skin it, and he returns to camp and drinks whiskey. Repeat this about 35 times and you have the book. (Ok, sometimes the beast he kills is bigger and sometimes smaller, and sometimes it takes him three shots to kill it but sometimes just one. So yes, a lot of variation.)Where are the passages on human nature? Where is the commentary on colonialism? Did Hemingway really take his white privilege/supremacy for granted, or did he omit this interesting and crucial element from the book on purpose? This book is a tragedy, even more so because it comes from the man who had an absolute masterpiece in For Whom the Bell Tolls."}, {"userName": "Roy Lotz", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/14046996-roy-lotz", "userReview": "I have a good life but I must write because if I do not write a certain amount I do not enjoy the rest of my life.\nI came across The Green Hills of Africa selling for cheap at a used bookstore; and since I vaguely remembered that Hemingway’s famous quote about Huckleberry Finn came from this book (Hemingway thinks it’s the alpha and omega of American fiction), I snatched it up. Well, that quote is certainly in here. It is part of a conversation Hemingway has with an Austrian about literature, which for me was the highlight of the book. In just a few pages, Hemingway weighs the merits and demerits of various writers, and then gives his own philosophy of writing. It's quite fascinating. But this conversation takes place in the first few pages of this travel memoir; the rest of the book is dominated by his hunt for kudu.I suspect that many will find the story of Hemingway’s hunts distasteful. I, for one, am not at all interested in hunting. I have seen, and loved seeing, many of the animals in this book when I was in East Africa; so the many descriptions of shooting and skinning gave me the creeps. To me, it’s as if somebody walked into an art museum, took out a pen knife, and cut a famous painting out of its frame to take home. Can’t you just look and appreciate?Well, this perspective—that hunting is distasteful and crass—is expressed by the Austrian in the opening conversation about literature, and serves to set up the essential metaphor of this memoir. For Hemingway, art is very much akin to hunting: chasing a fleeting moment, through the brush and wilderness, under the heavy hot sun, following wherever it goes, in order to pin it down and capture it in words. The Austrian is, perhaps like myself, a critic: he wants only to look and appreciate. Hemingway differentiates himself as an artist by being a hunter: he stalks and kills.So this little memoir can be read, in part, as an extended allegory of Hemingway’s artistic ideals: the artist as disciplined, solitary hunter. But, of course, it is also a memoir of his time in Africa. And in this respect, I think the book was the most disappointing. Hemingway is away in his own little world, measuring the horns of his prizes, tracking wounded animals, peevishly complaining any time somebody kills a beast bigger than his. The drama of the hunt wasn’t dramatic; and Hemingway’s deadpan writing wasn’t evocative of the landscape. He seems uninterested in the political situation in East Africa—which was under the domination of the British—and he generally comes across as a boorish colonialist, only interested in his own pleasure. Certainly not his best work; but insightful for Hemingway enthusiasts, and possibly interesting for big game hunters."}, {"userName": "Jay", "userReviewDate": "Jan 21, 2012", "userURL": "http://www.goodreads.com/user/show/3538579-jay", "userReview": "I was ready to not like this book. I have had a long-term fascination with Spain and had some deeper appreciation of bullfighting so Hemingway’s earlier experiment with non-fiction, Death in the Afternoon, which reflected so perfectly what Miguel de Unamuno had identified as the Spaniards' “tragic sense of life,” was a strong and intriguing read. It certainly prepared me for a Hemingway who could do non-fiction creatively. But a non-fiction book on big game hunting in Africa seemed not my cup. I understood bullfighting as art but big game hunting was wanton destruction.I should have known that Hemingway could weave strength in the flaccid. Much like Death in the Afternoon, The Green Hills of Africa was about more than hunting animals in the sub-continent. There was hunting, of course. The book was an account of a month-long safari that Ernest and Pauline Hemingway took during their longer trip to East Africa between November 1933 and March 1934. Hemingway was an avid hunter and his descriptions of his stalkings and kills absorb most of the pages.Much of that description is some of his best writing, particularly in the last chapters. Yet literary critics at the time did not view the book as much more than a curiosity. They focused on the book’s theme and seemed to dismiss the writing itself. But for Hemingway, the book was an experiment. As he wrote in the foreword: “The writer has attempted to write an absolutely true book to see whether the shape of a country and the pattern of a month’s action can, if truly presented, compete with a work of imagination.” The Green Hills of Africa was, in addition to an account of a safari, part of an experimental period with non-fiction. In that regard, I have come to see it perhaps as a precursor to Truman Capote’s In Cold Blood. It was also a work in which he continued to explore new elements of style, experimenting with more complex sentences with subordinate clauses—with longer, more complex phrasings that dominated some of his later fiction. As an extreme example think of that remarkable sentence on the Gulf Stream that starts on page 148 and ends on page 150. The incidents and the people chronicled in the book were real, or at least as real as Hemingway could make them. And Hemingway himself is a major actor in all of his strengths and in some of his weaknesses. He was in a constant twit that one of his hunting companions, Charles Thompson (named Karl in the book), was consistently more successful than he in bagging the really big animals. And more than envy, he either did not see or chose to not describe the African people. The Africans were there but only as shadows, in service to Papa and his friends. The account reflected Hemingway’s own times and world view that was insensitive to peoples outside of the Western European tradition. The 1930s were still the epoch of the White Man’s burden.Although Hemingway did not give his readers an intimate view of Africa and her peoples, he did comment on writers and on the art of writing. Peppered throughout the book are Hemingway’s more personal thoughts about those topics. It is here were he recorded his thoughts about American letters: “The good writers are Henry James, Stephen Crane, and Mark Twain.” It is also in this book where he talks about the Gulf Stream for the first time, something that will become central to him in so many ways in both his life and some of his future writings.If for no other reason, the book has emerged as more than a mere curiosity in the Hemingway corpus for what followed its publication. The Green Hills of Africa had not been well received by all of the critics and Hemingway was depressed by the quite stinging critiques. In the midst of that depression, he pulled out of the safari experience recounted in The Green Hills of Africa two stories that are arguably his best: “The Snows of Kilimanjaro” and “The Short Life of Francis Macomber”. The Green Hills of Africa provided the stage for new heights in Hemingway’s creative artistry."}, {"userName": "Craig Werner", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/5567347-craig-werner", "userReview": "Hemingway can be an irritating son of a bitch and this book is near the top of the \"here's why\" list. A memoir of Hemingway's hunting expedition to East Africa--an area I spent two weeks in recently--, Green Hills shows absolutely no awareness of the colonial history that structures the relations between the hunter and the numerous Africans who make his pleasure possible. There are a few moments when Hemingway realizes that the men who accompany him are every bit as skilled and courageous as he is, but those are surrounded by countless scenes where the white supremacy is simply embedded in the reporting. What makes that doubly irritating is Hemingway's belief in his own honesty. Yeah, well. Part of my response is no doubt tied to the fact that I'm not a hunter. My own experience of the wildlife of Tanzania was simple awe; I didn't feel the slightest inclination to kill it. I do understand that for Hemingway, hunting involves an aesthetic of attention and care that parallels his approach to writing. And it's clear that there's a good bit of irony in his portrait of himself as Great White Hunter--he screws up roughly as many shots as he makes and he describes his feelings of shame, but ultimately it all comes out as celebration. Stylistically, there are far too many moments when you can't tell the difference between Hemingway and Hemingway parodied. Far from his best writing.I was surprised to come across the famous passage--often excerpted out of context--in which Hemingway mediates on Huck Finn as the source of American literature. It's a great set piece, oddly situated.I'm moving on to the short story collection The Snows of Kilimanjaro, written after the experiences described in this book had some time to marinate."}, {"userName": "Mr.", "userReviewDate": "Oct 07, 2008", "userURL": "http://www.goodreads.com/user/show/1596746-mr", "userReview": "Green Hills of Africa is set (surprise) in Africa, and it primarily concerns hunting for Kudu and Rhino. Hemingway draws you into the realm of the physical; he draws in precise detail the machinery of the rifles, the approach of the rhino, the canvas of Africa's deep and beauteous terrain. There are passages in here of remarkable grit and beauty: \"It was a hot place to camp, under trees that had been girdled to kill them so that the se-se fly would leave, and there was hard hunting in the hills, which were steep, brushy, and very broken, with a hard climb before you got up into them, and easy hunting on the wooded flats where you wandered as though through a deer park\" (136). This book was published in 1935, and Hemingway's prose had (sadly), already begun to degenerate from the peak of cold and simple beauty that made his early short-fiction classic literature. However, unlike his latest writing, his obvious exuberant happiness and excitement about life and nature seeps onto the page. He employs the ice-berg technique; we get little information about the characters and their lives and situations. Hemingway entices the reader with a miniature portrait of place, and time. It is about man and nature and redemption through physical activity and danger."}, {"userName": "Ingrid", "userReviewDate": "Apr 12, 2016", "userURL": "http://www.goodreads.com/user/show/38698167-ingrid", "userReview": "In generale non è come me lo aspettavo. Mi aspettavo di \"vedere\" l'Africa, mi aspettavo delle dettagliate e suggestive descrizioni dei safari, degli animali, del rapporto uomo/natura, sì pure della caccia perché chiaramente sapevo che era l'oggetto del libro, ma non credevo che la lista degli animali uccisi fosse così cospicua e, dato che odio profondamente caccia e cacciatori, mi ha decisamente schifato tutta quella parte. Inoltre Hemingway stesso sottolinea più e più volte la ricerca spasmodica dei migliori esemplari possibili di animali non tanto per l'esposizione in casa o in foto, ma difronte ai suoi stessi amici e conoscenti che lo accompagnano nel viaggio (ad esempio l'uccisione dei rinoceronti avviene giusto per avere un corno più lungo del compagno di viaggio). C’è questo smanioso desiderio di essere sempre il migliore, in qualsiasi cosa, sotto qualsiasi aspetto. Così quello che importa, lì in quei giorni come nelle pagine del libro, non sono i paesaggi attraversati o gli stati d’animo dei vari protagonisti, o i loro pensieri. Ecco questo l'ho profondamente disprezzato e mi ha dato davvero fastidio. Sicuramente anche il fatto di essere in forma di diario rende il romanzo privo di plot e quasi esclusivamente un bollettino di caccia con colpi più o meno riusciti.La parte più interessante è, a mio avviso, la prima metà quando tratta del parallelismo fra caccia e scrittura e del ruolo dei critici, definiti come \"pidocchi\" (ma che strano, non l'ha detto nessuno!!), che non apprezzano le opere d'arte (che, caro Hemingway, se sono \"Verdi colline d'Africa\" fanno bene a stroncarti!).Insomma un libro onestamente dimenticabile dove emerge un lato davvero borioso e insopportabile di Hemingway."}, {"userName": "Claire ", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/7973311-claire", "userReview": "A rather boring read, as it is all the time about hunting. However, Hemingway is such a talented writer, he makes up for the shortcomings just by his style."}, {"userName": "Filipe Miguel", "userReviewDate": "Jul 07, 2012", "userURL": "http://www.goodreads.com/user/show/5855795-filipe-miguel", "userReview": "Em 1933, Ernest Hemingway e a sua mulher Pauline, viajaram até ao continente africano e aventuraram-se num grandioso safari de dez semanas. O material dessa experiência serviu de inspiração para, entre outras obras, este As Verdes Colinas de África.\nPara muitos de nós: esta leitura será o mais próximo que conseguiremos estar de viver o ambiente de uma caçada\nA maioria da área coberta durante o safari, as montanhas, colinas íngremes, vales e savanas, pertence ao Lago Manyara, na Tanzânia, e às suas imediações. A grande riqueza do livro reside na forma como o safari foi descrito. É um resumo da beleza do Leste de África no seu estado puro, com os seus sons, as suas cores, a sua vida. Hemingway conduz-nos, juntamente com os seus guias, alguns familiares e amigos, em várias caçadas. Acompanhamos perseguições a manadas de cudus, antílopes pretos, elefantes, leões, todos devidamente enquadrados no seu ambiente e seguidos com as técnicas respectivas.\nPara muitos de nós (quiçá a maioria): a caçada não será o hobbie de eleição.\nTodo o livro relata a experiência vivida durante as dez semanas do safari, com os excessos e privações dessa actividade. Tem momentos memoráveis, descrições belíssimas, momentos em que sustemos a respiração para conseguir o melhor tiro, mas, na sua grande maioria, seguir o rasto de um cudu macho durante cinco páginas ou dissertar sobre os desejos de caçar um grande antílope preto, porque pela carta que possuem, ainda têm direito a caçar mais dois, não será assunto que nos faça virar páginas com sofreguidão ou seguir a leitura sem algum sofrimento.No fundo, Hemingway guia-nos brilhantemente num hobbie que faria sentido à época e que nos leva (e bem!), para um tempo que se espera não existir mais. Seja como for, assumo e compreendo perfeitamente que este livro seja um clássico, principalmente para caçadores e aficionados (seja de caçadas ou de África). Contudo, para leitores que tropecem ocasionalmente no tema, apesar dos bons momentos lidos, dificilmente encontrarão neste livro algo mais que não seja a excelente escrita de Ernest Hemingway, alguma tensão proveniente do jogo do gato e do rato e as maravilhosas fauna e flora africanas.Agora não havia estrada - um simples caminho de cabras -, mas estávamos a chegar à orla da planície. Depois a planície ficou para trás e à nossa frente havia grandes árvores e entrámos na mais linda região que vi em África. A erva era verde e igual, curta como um prado regado que estivesse a começar a crescer, as árvores eram grandes, com ramos altos e velhos, sem vegetação por baixo. (...) Não me lembro de me ter deitado nem levantado, mas apenas de estar à fogueira na penumbra, antes de amanhecer, com um púcaro de chá quente na mão e o meu pequeno almoço no espeto, não parecendo já tão apetitoso coberto de cinzas. (...) Ficámos à sombra das árvores e mandámos Wanderoboo- Masai abaixo, ao vale, procurar pegadas. Voltou dizendo que não havia pegadas pelo vale abaixo de nós ou a oeste e assim ficámos a saber que eles tinham ido pastar pelo vale acima. Agora o problema era utilizar o terreno por forma a descobri-los e chegar-lhes ao alcance sem sermos vistos.Nota: 3.0/5.0"}, {"userName": "Arminion", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/10664177-arminion", "userReview": "If somebody would ask me to describe this book in one sentence, I would say \"Ernest Hemingway and his friends are hunting wild animals in Africa.\" That's it. That's all it ever happens. There is no convoluted plot here, no drama, no love story, no backstabbing, no heroes and villains, just hunting. And by God, is it boring!For starters, Hemingway is good in describing scenery and landscapes, although he goes into too much detail. He is also good at describing animals. In everything else however, he fails miserably.First of all, he never describes the people he is hunting with. How does Pop looks? Or his wife? Or million other black native hunters with him? I don't know. It's as if Hemingway just decided that whoever reads his book, he or she would already be familiar with Hemingway's life and his close friends. It's almost as if Hemingway wrote this for himself, as some sort of diary (he probably did) and then later just said \"Oh you know what? I could publish this.\"And then he just send it to the printers, without much care about editing.I also hated how he called his wife \"P.O.M\" like it's some kind of secret or disgrace if he writes her real name down.Another bad thing about this book is his wooden dialogs and the abundant use of foreign words of the natives which he rarely translates, which further slows down the reading.Then there is constant cheering and bragging about how great shot he is. Yes, because it takes a real effort to pull a trigger at an unarmed and helpless animal.And the constant repetition of the story! \"We went in the shrubs and high grass. We saw something move. I saw the animal. How great it was! I shot it down. The natives are jumping out of joy and congratulating me. They skin the animal. We go back to camp. We sit by the fire, drink alcohol and read books. We go to bed.\"And then the whole thing just repeat itself. Over and over again. And there you have it - Green Hills of Africa."}, {"userName": "Elsa Butler", "userReviewDate": "Dec 28, 2009", "userURL": "http://www.goodreads.com/user/show/1119338-elsa-butler", "userReview": "Read this book because I was in the Chulu Hills in Kenya -- the very place about which Hemingway was writing -- and could barely finish. I've always appreciated the skill with which Hemingway wrote fiction but this is a piece of memoir/reportage in which the writer inserted himself solidly into the story, revealing himself (with the rawest of perspectives) to be a mean, self-absorbed, destructive embarrassment of a person at that point in his life. to be fair, I have read the biography of Martha Gelhorn and remember the passages that describe her marriage to and subsequent divorce from Hemingway, who by that point was chasing imagined submarines off Cuba a \"hunting\" fantasy. At the end, he wrote in a letter to her, \"are you a journalist or a wife in my bed?\" What an insult! As if being a (his) wife could outweigh -- or even measure up to -- the reward and excitement of reporting, writing, living as an independent woman. Pshaw! Despised Hemingway in this book, it gets the only star for no more than 3 insightful passages."}, {"userName": "David", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/6971227-david", "userReview": "Because I fly off to Kenya and Tanzania tomorrow.Auf Wierdersehen daily routine. Bonjour adventure."}, {"userName": "Simona", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/6222130-simona", "userReview": "Se \"leggere è viaggiare pur stando fermi\" devo dire che con questo libro di Hemingway ho viaggiato. Con Hemingway ho viaggiato nell'Africa dei kudù, nell'Africa nera, nell'Africa nera e rigogliosa delle sue colline verdi e della sua natura intatta, nell'Africa dei Masai, una tribù autoctona che vive allo stato brado basandosi su ciò che la madre terra offre loro. Un viaggio che Hemingway ha compiuto in Africa nel 1933 con la moglie, un viaggio in cui non si parla solo di caccia, la grande passione di Hemingway, ma anche di letteratura e di tre scrittori che sono considerati il top: Mark Twain, Stephen Crane e Henry James. Un viaggio per il quale ringrazio Hemingway per avermi accompagnato nell'Africa più vera e intimista."}, {"userName": "Emily", "userReviewDate": "Aug 08, 2016", "userURL": "http://www.goodreads.com/user/show/21724974-emily", "userReview": "That was beautiful. Love Hemingway, love him."}, {"userName": "Amante Libri", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/51338605-amante-libri", "userReview": "Odio profondamente la caccia quindi questo non è certo il libro per me. Mi aspettavo però più Africa, più natura, più rapporto uomo/natura selvaggia e meno scene, anche esplicite, di uccisione di animali. La mia repulsione è comunque stemperata dal fatto che il racconto è datato (1935) e che è scritto bene, ma avrei dato 1stella per il fatto della caccia. Verdi colline d'Africa Ernest HemingwayTraduzione: Attilio Bertolucci - Alberto RossiEditore: MondadoriPag: 279Voto: 3/5"}, {"userName": "Dmitry Yakovenko", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/6093295-dmitry-yakovenko", "userReview": "\"Зеленые холмы Африки\" являются произведением того рода, что даже без захватывающей и оригинальной истории умудряется втянуть с первой и до последней страницы, благодаря всепоглощающей атмосфере и яркому тексту. В этой автобиографической повести Эрнест Хемингуэй описывает своё удивительное сафари в Африке, когда он вместе с женой отправился охотиться на носорогов, львов, антилоп и многих других.Форматом автобиографии автор сам загнал себя в определённые рамки, в какой-то степени погубив интригу, и вынуждая самого себя писать только то, что с ним реально происходило. А в том-то и дело, что помимо сафари, иногда удачного, иногда не очень, с автором больше особо ничего и не происходило. Он то ездил на охоту, охотился, а потом ехал с охоты, то ел и пил в компании других охотников, беседуя о чем ему только захочется, то спал. Вот и выходит, что не ради действия читаешь эту книгу, не для того, чтобы узнать, что же там дальше ещё произойдёт, а чтобы получше окунуться в обволакивающую атмосферу жизни и охоты в Африке, что Хемингуэю так прекрасно удалось передать. Ну и чтобы ещё лучше залезть в голову этого славного автора и узнать как он жил.Как и в других работах, изумительным выходит у автора и текст, наполненный красивыми описаниями, интересными размышлениями и великолепными диалогами. Описывает он в этот раз красоты Африканской природы, а также тонкости и особенности сафари, некоторые из которых будут не особо приятны женщинам и детям, что делает эту повесть больше мужской, очень уж жестоким и подробным в этом произведении бывает всё то, что связано с охотой. Размышления всегда были у Хемингуэя что надо, диалоги тоже удались, при этом какое-то время их было так много, что все это напоминало сценарий фильма Тарантино, когда просто часами разговаривают. Вот и тут постоянно рассуждали то про разные страны, то про писателей, то про их произведения, прошлись по Марку Твену, Эдгару По и Герману Мелвиллу с его монументальным Моби Диком, а также вспомнили многих других.В итоге несмотря на отсутствие большого количества каких-либо эмоций от истории, что не удивляет сюжетными поворотами и не балует событиями, а просто монотонно идёт вперёд, повесть определенно стоит читать, особенно поклонникам творчества автора. Но да, больше порекомендую мужчинам, которым нравится охота и рыбалка, а так же книги про это."}, {"userName": "Naomi", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/6486487-naomi", "userReview": "On the back of copy of \"Green Hills of Africa\" I have is this quote from the Times Literary Supplement: \"This book is an expression of a deep enjoyment and appreciation of being alive - in Africa. There is more to it than [hunting]; it is the feeling of the dew on the grass in the morning, the shape and colour and smell of the country, the companionship of friends... and the feeling that time has ceased to matter.\"I agree with the quote somewhat, but not entirely. Yes, there are beautiful passages and descriptions of Africa, the individuals Hemingway meets such as the Masai tribesmen towards the end, and interesting musings covering a variety of topics related and unrelated to Africa and hunting. However, most of this particular memoir has to do with hunting, as I knew ahead of time, and despite knowing what I would encounter, I still did not find it to be particularly engaging and relevant to me.I am not interested in hunting, especially when it comes to hunting big game, so I had a hard time stomaching some of the scenes describing the specifics of killing, or attempting to kill, various majestic animals. I do realize this is a different time when hunting big game was not as controversial as it is today, since there probably weren't in place rules, or at least not as many, protecting endangered animals as there are today. However, I had a hard time coming to terms with that. This is well-written, I will grant you that, but it is not something I am likely to read again. I do need to reread and read for the first time his other works, so I am not left with this as my most recent read by Hemingway."}, {"userName": "Daniel", "userReviewDate": "Mar 18, 2008", "userURL": "http://www.goodreads.com/user/show/4695-daniel", "userReview": "Of the two nonfiction Hemingway books I've read, \"Green Hills of Africa\" and \"A Moveable Feast,\" this is the superior of the two. Even the portions of this book about writers and writing, a subject \"A Moveable Feast\" is far more focused on, are fresher and livelier, probably because they were written contemporaneously rather than in hindsight, as was \"A Moveable Feast.\"While much of \"Green Hills of Africa\" reinforces the popular image of Hemingway as a manly, swaggering hunter and drinker, it also helps to undercut that image. In the course of the book, he gives the reader glimpses of his own self-doubt, particularly the shame he feels when pride overtakes him. He also gives plenty of space over to others' mockery of him. It's those conversations, perhaps because they go against the image of Hemingway so cemented in popular culture, that are among the most endearing in the book.Even if you are not particularly interested in big-game hunting -- I certainly am not -- this book holds many other rewards, and remains worth reading."}, {"userName": "Victoria Kellaway", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/37575737-victoria-kellaway", "userReview": "Reading Hemingway is always a pleasure but there's something about reading a book on a topic you don't expect to care about (big game hunting, bullfighting) and finding you do care, very much. It's fascinating and inspiring. I loved the interplay between Hemingway and Pop, Hemingway and Karl, Hemingway and M'Cola, Hemingway and the dramatic one. I loved being able to see exactly where I was, all the time. I loved Hemingway on writing but most of all I loved Hemingway on Africa, Hemingway on America. That's his secret, the reason we love him. His truths are so true, before you read them you're foolish enough to think you're the only one who felt them."}, {"userName": "Tessa", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/10716259-tessa", "userReview": "Apart from a few compelling descriptions of hunting and scenery, this book did not hold my attention. I could never really figure out the time jumps; the whole thing came across as one big sweaty alcoholic trek through the African wilderness, interspersed here and there with Hemingway's rambling about the writing process. I suppose there's something to be said for the book's clever layering--the hunt for big game translating into the hunt for good literature and Hemingway's own identity. But the story itself was long-winded and the characters flat. I would only recommend this book to true Hemingway fans looking to learn a little more about their hero and his passions in life."}, {"userName": "Laura", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Free download available at Faded Page.An account of Hemingway's 1933 visit to what is now Tanzania. It includes both safari lore and literary criticism."}, {"userName": "Rand", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/9866532-rand", "userReview": "Oftentimes an artist is most deeply revealed by their least known works."}, {"userName": "Lyn", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "Very entertaining and told with a greater depth than at first noticeable, subtle and disturbing under the surface."}, {"userName": "Steve", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/51602729-steve", "userReview": "Near the end of this novel, the narrator (named Hemingway - there is no disguise at all in the first person narration of the story) asserts that 'A country was made to be as we found it.' Africa was that country for Hemingway, and this 'novel' - it is really more of an extended journal of entries on how much he enjoyed his time hunting there - is his extended rhapsody of love for its simple pleasures. Especially hunting. The rules for a good hunter are many and of critical importance. One must never shoot a cow, but only the bull of a species. This rule is amplified exponentially should the cow be with calf. One must try to shoot to kill, never to wound - aim high for the head, the heart or the lungs; never low, where one may 'gut shoot' a beast and end up tracking the poor dying creature for hours on end, and not always successfully. Should the shooting be easy - as it was of ducks in a swampy piece of land, one should go for the 'fine shots' - those of exceptional difficulty. One should try to kill with the first shot, but if this fails, it is doubly incumbent upon one to kill with subsequent shots. When stalking a prey, it is always better to go on foot rather by motor vehicle. One must be conscious of the need for patience, or one's heart rate and respiration will rise, making one's shooting less sure than it needs to be. One should try - although no one in this novel avoids it, feeling jealousy of other hunters who are more successful than you have been. Should such feeling overcome one, wait until the next day - the feeling may be gone. Kudus are the game with which the novel opens and generally closes, while rhinos, sables, buffalo and ducks are also hunted. There is also a spine tingling encounter with an unseen but ofttimes heard lion in some high grass that Hemingway wisely backs away from. Secondarily, the novel touches on a lot of literature, with direct reference and analysis made of Poe, Melville, Emerson, Hawthorne, Whittier, Thoreau, James, Crane, Twain, Kipling, Flaubert, Dostoevsky and Tolstoy. The native peoples who act as guides and bearers for Hemingway, Karl, Pop and P.O.M. (presumably Hemingway's wife) are also well described and engaging. The steadfast resolve of M'Cola, the off-putting antics of Garrick, the graceful strut of Droopy and the final pathetic attachment of the old man all are written with an eye both critical and ultimately sympathetic. No real narrative development occurs - they hunt one day, they hunt the next; they hunt together, they hunt separately; they are successful hunting, they are not successful hunting. It is all part of the tableau of the title's topographical image: a paean of love for this continent. Or, as Hemingway put it in one passage that matches the enthusiastic passion of his best writing from For Whom the Bell Tolls: 'I loved the country so that I was happy as you are after you have been with a woman you really love, when, empty, you feel it welling up again and there it is and you can never have it all and yet what there is, now, you can have, and you want more and more, to have, to be, and live in the possession again, for always, for that long, sudden ending always, making time stand still, sometimes so very still that afterwards you wait to hear it move and it is slow in starting.' When Hemingway writes like that, he gets as close as James Joyce or D.H. Lawrence ever got to getting to the heart of one's love of life. Few writers ever even imagine that such a feeling is possible: Hemingway not only felt it, but came as close as anyone I've read to describing it in palpable terms. That this feeling arose for him through the - to me - barbaric sport of killing animals is irrelevant - as the narrator puts it, his impact on the total numbers of each species he hunted was statistically insignificant, they always ate the meat and kept the horns. That he realizes the importance of that feeling, and savors it to its fullest so that he was able to write about it in such a compelling manner makes him one of literature's true giants.Absolutely first rate."}, {"userName": "Robert Cox", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/55881076-robert-cox", "userReview": "This is an easy review. If you hunt, this book will consume your senses and stir some urge you never had to see and experience the dark continent. If you don’t hunt, it’ll all be mindless wandering and senseless shooting.“Now it is pleasant to hunt something that you want very much over a long period of time, being outwitted, out-maneuvered, and failing at the end of each day, but having the hunt and knowing every time you are out that, sooner or later, your luck will change and that you will get the chance that you are seeking. But it is not pleasant to have a time limit by which you must get your kudu or perhaps never get it, nor even see one. It is not the way hunting should be.”"}], "description": "The most intimate and elaborately enhanced addition to the Hemingway Library series: Hemingway's memoir of his safari across the Serengeti; presented with archival material from the Hemingway Collection at the John F. Kennedy Library, and with the never-before-published safari journal of Hemingway's second wife, Pauline Pfeiffer.First published in 1935, Green Hills of Africa is Ernest Hemingway's lyrical account of his safari in the great game country of East Africa with his wife Pauline. Hemingway's fascination with big-game hunting is magnificently captured in this evocative narrative of his trip. In examining the poetic grace of the chase, and the ferocity of the kill, Hemingway looks inward, seeking to explain the lure of the hunt and the primal undercurrent that comes alive on the plains of Africa. Green Hills of Africa is also an impassioned portrait of the glory of the African landscape, and of the beauty of a wilderness that was, even then, being threatened by the incursions of man. Hemingway's rich description of the land and his passion for hunting combine to give Green Hills of Africa the immediacy of a deeply felt individual experience that is the hallmark of the greatest travel writing.This new Hemingway Library Edition offers a fresh perspective on Hemingway's classic travelogue with a personal foreword by Patrick Hemingway, the author's sole surviving son, who, himself, spent many years as a professional hunter in East Africa; a new introduction by Sean Hemingway, grandson of the author; and published for the first time in its entirety the African journal of Hemingway's wife, Pauline Pfeiffer, which provides new insight into the experiences that shaped her husband's craft.", "title": "Green Hills of Africa: The Hemingway Library Edition", "url": "http://www.goodreads.com/book/show/23492616-green-hills-of-africa", "average": 3.56, "cover": "https://images.gr-assets.com/books/1437370194l/23492616.jpg", "reviews": 492, "authors": [{"url": "https://www.goodreads.com/author/show/1455.Ernest_Hemingway", "name": "Ernest Hemingway"}, {"url": "https://www.goodreads.com/author/show/917817.Patrick_Hemingway", "name": "Patrick Hemingway"}, {"url": "https://www.goodreads.com/author/show/410173.Se_n_Hemingway", "name": "Seán Hemingway"}, {"url": "https://www.goodreads.com/author/show/14176909.Pauline_Pfeiffer_Hemingway", "name": "Pauline Pfeiffer Hemingway"}, {"url": "https://www.goodreads.com/author/show/415141.Edward_Shenton", "name": "Edward Shenton"}], "type": ["Fiction", "Classics", "Cultural", "Travel", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/23492616-green-hills-of-africa", "http://www.goodreads.com/book/show/10776.Green_Hills_of_Africa", "http://www.goodreads.com/book/show/30965810", "http://www.goodreads.com/book/show/90386.Green_Hills_of_Africa", "http://www.goodreads.com/book/show/15772789-verdi-colline-d-africa", "http://www.goodreads.com/book/show/6572006-green-hills-of-africa", "http://www.goodreads.com/book/show/13633644-as-verdes-colinas-de-frica", "http://www.goodreads.com/book/show/977033.Green_Hills_Of_Africa", "http://www.goodreads.com/book/show/9697073-verdi-colline-d-africa", "http://www.goodreads.com/book/show/2165.The_Old_Man_and_the_Sea", "http://www.goodreads.com/book/show/3876.The_Sun_Also_Rises", "http://www.goodreads.com/book/show/46170.For_Whom_the_Bell_Tolls", "http://www.goodreads.com/book/show/10799.A_Farewell_to_Arms", "http://www.goodreads.com/book/show/4631.A_Moveable_Feast"]}