{"ratings": 336, "userreviews": [{"userName": "Meike", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/59050228-meike", "userReview": "Winner of the Goldsmiths Prize 2017What would happen if we lived in a world of total moderation and mindfulness, where any excess of emotion - both good and bad - was considered undesirable, and our ability or willingness to oblige to these standards was monitored 24/7? Nicola Barker's \"H(a)ppy\" is definitely a fun read for anyone who does yoga and tracks his/her lifestyle on a fitbit (i.e., me)! :-)Barker's protagonist Mira A lives in a dystopian future, a totalitarian world governed by a mental and technological system established by The Young. Imperfection has become an anachronism, as the system has managed to eliminate most curses under which The Old have suffered: Hate, anger, sadness, pain, war, death, etc. The success of The Young has dehumanizing consequences. The control mechanism tracks every person's thoughts and actions, its access is public (hello, social media). The pressure on the individual is intensified by the fact that people are also judged as parts of groups, meaning that if an individual thinks or acts in a way that is considered wrong by the system, it affects how the whole group is judged, thus institutionalizing peer pressure. Now Mira A, a musician, quite suddenly experiences difficulties trying to oblige to the sytem, although she aims to: Her mind keeps thinking and feeling things that are deemed unacceptable as they reveal deep emotions and attachment. Is it a \"kink\" indicating that there is something wrong with her, is it a chemical imbalance, can it be rectified with an operation? Will Kite, who is sent as an official agent to eliminate the kink, help her or does he intend to send her to the few remaining humans living outside the system, which is considered a horrible punishment?It would certainly be possible to write a dissertation trying to find all the ideas, hints, and concepts Barker has planted in her book, and taking her baits while reading the text is great fun. What fascinated me most though is how Barker celebrates ambiguity and how it renders language and music beautiful: Because there is more than one way to understand language and hear music, because art communicates with our indvidual character, because it makes random connections depending on who we are, language and music represent our humanity: \"The meaning is contained in the ...the gap.\" - \"Blackness and whiteness collapsing into each other.\" - In the world outside the system \"(...) words are fluid. (...) freedom kills certainty. (...) narrative pervades every tiny chink and crack and orifice and poisons everything.\"Narratives are dangerous because controlling your own life means writing your own story, and whoever does that becomes uncontrollable and thus an enemy of the system. Barker makes letters and words oscillate, until Mira A herself is oscillating between desire and restraint. This is also where Paraguyan guitarist Augustín Barrios comes into play, a musician who was a wanderer between his South American heritage and European classical music, between the languages of Guaraní and Spanish, between traditional ways of appearance and conforming to Western standards. Barker lets Mira A connect with Barrios in fantastical ways.There are also some interesting thoughts on religion in this book: The Young are their own Gods, so faith, which again refers to something beyond our grasp and cannot unambiguously be pinned down, is forbidden. A cathedral becomes a symbol for human desire - and Barker showers us with related images. This can as well be seen in the context of music (Bach is mentioned, who was very religious, and Barrios, whose major work is named \"The Cathedral\"), totalitarianism (which generally also opposes religion, as every totalitarian ideology wants to see its own belief system as absolute), and human fallibility.Plus: There is also a lot of humor in the book: \"The Banal is a warm blanket.\" - sentences like these give the text partly an ironic turn, which I really enjoyed. In a twisted way, Barker makes you appreciate everything that is wrong with our society: Perfection suddenly seems way worse, or at least this kind of perfection.Thanks to the good people at the Mookse & the Gripes reading group who inspired me to read this as part of the Goldsmiths readalong!"}, {"userName": "Dannii Elle", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "This is my fourth book read in the Women's Prize for Fiction longlist.H(a)ppy is set in a future, Utopian world where the concept of unhappiness is obsolete. But so, to, is creativity. the art of story-telling - through song, or picture, or the written word- has ceased to exist, but somehow Mira A can not seem to stop herself from the internal narration of her everyday life. This inner-monologue is starting to have a detrimental effect on the community she resides in, but instead of discontinuing this new act it pushes Mira A to further question the world she lives in, and the emotion of happiness she is supposed to eternally feel.I really appreciated the experimental layout of this novel. Some sections were written in a differing format from the rest. Some words were highlighted in a variety of colours, or altered in text style or size. And other parts used imagery to, instead, convey its meaning. This constantly kept me excited to turn the page and feast my eyes on the visionary wonders this book continually delivered.Mira A, herself, was another intriguing element of this book. At first, her robotic transmission and austere thought-process were a little disconcerting for one who usually appreciates a more prosaic and ocular style of delivery. This was, instead, stark and direct, but I soon found it an impeccable fit with its surroundings and helped the reader to better understand the character this style of delivery was continually and systematically creating.This was a story-line full of intriguing concepts that both Mira A and the dystopian landscape could only hint at. Much is left for the reader to decipher and I found this added yet another layer, to this the archaeological puzzle of a novel, that I adored discovering. Whilst unsettling in nature, everything about this prompted me to move out of the passive mode usually reserved for reading and become an active participant in this novel's clever and elegant design."}, {"userName": "Gumble's Yard", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/35482263-gumble-s-yard", "userReview": "The 2017 Goldsmith Prize winner - ahead of a strong shortlist and now longlisted for the 2018 Women's Prize.\nWe [The Young] were given just enough choices to make us feel as though we were free, but not so many that our minds (our still-fragile intellects) became overloaded. Doubt ended. The information stream was purified ……….. We live Now. We live in Light. And when darkness threatens (darkness? Can there ever truly be darkness again?) they simply adjust the chemicals. Sometimes – while we sleep, as we gently dream – they remind us of how it used to be so that we appreciate how good things are now. Now that we are Free From Desire. And we are H(A)PPY to be reminded of this because it reinforces our sense of peacefulness, of calm, of conformity, of equilibrium. They tell us about the lies of The Past. Of how The Young were told that the needed to rebel against the norm in order to feel Whole. That creativity is dependent on struggle and suffering.\nH(A)PPY, in a way similar to Brave New World is set in what seems to its inhabitants a utopia but to us potentially a dystopia.The core inhabitants of this post-apocalypse world, The Young, live in a largely asexualized society which has rejected emotion (particularly an Excess of Emotion). Instead The Young strive to stay In Balance, both individually, as small communities and as a broader society, this Balance being measured on The Graph. Their thoughts and actions are recorded and visible to all on their Information Stream, with dangerous concepts highlighted in different colours and a pinkening of their graph. Any inadvertent deviation is controlled by chemicals or if required by recalibration of physical Oracular Devices. Their access to information (particularly information which may disturb The Balance) is controlled by the Sensor. \nIn the past, The Old were completely awash with facts and non-facts. They asked a question and it was properly answered. A fountainhead of information was released. But was the water clear. Did it quench, revive or simply deluge?.\nClearly some of this initial set up can be regarded as a satire of Generation-Snowflake, of safe-spaces, of the increasing self-censorship of the internet, and of the increasing trend for public figures to have to issue a public apology if they ever give rise to comments which reflect their unguarded thoughts and which deviate from now socially-established liberal values. In the hands of Dave Eggers his book would have remained there. The main plot development comes when the narrator Mira A, a musician, starts researching into a guitar player who she knows as 91.51.9.81.81.1.2, but who is the (real life) Paraguayan guitarist Agustin Barrios (whose works Barker recommends the reader to listen to while reading the novel). While viewing a picture she spots a small girl in the margins of the picture. Further information on Barrios, his music, his country and the language of that country (part Spanish, part Guarani) is dotted throughout the book. In the hands of Ali Smith– the book would then alternate between the narrative and reflections on the artist.However Barker is neither Eggers or Smith and instead of remaining where she is and following through on these early directions, the book very deliberately spirals off (and largely out of control) in two different ways.Firstly in its story. Shortly after the book starts she notes that the word Happy is coming out as H(A)PPY in her stream and tries to understand why the word is “Disambiguating, parenthesising” – something which seems to be linked to her enquiries into the past and which appears to threaten the entire edifice of the new order. From there we have a hardline faction within The Young, The Banal, a shadow twin Mira B (at times we are unclear which of the two is our narrator), a word or text Cathedral and much else even harder to explain.Secondly typographically – the book is already unusual in mimicing the colouring of the words monitored by the Information Stream but we start to have blank pages, pages of repeated coloured text, different typefaces (including mirror writing), symbols (including some which we are lead to believe are written directly into the stream and therefore onto the pages we read by Mira’s hands in a dream like state).Early on Mira A is examined by Kite, a Full Neuter who describes himself as a Mechanic to The System. He says to her\nOf course you will be familiar with the narrative form ….. those curious narrative structures employed so often and so successfully in the past. The narratives of family and romance and adventure, the masculine and the feminine narratives, the narratives of class, of nationalism, of capitalism, of socialism, of faith and myth and mystery, historical narratives, science fiction narratives, experimental narratives, horror narratives, literary narratives, ‘reality’ narratives, crime narratives. The Sensor automatically deconstructs those stories for us, so that we may fully comprehend their full meaning, their immense reach and their invidious power, their ultimately deeply conservative urge to comfort and pander and bolster and reassure.\nThis passage seems to strike at Barker’s main motivation here (and in most of her writing), a rejection of conventional novels and stories. Instead in this book, she systematically seeks to undermine and deconstruct the very concept of narrative and story. Kite says just before this to Mira A\nI have inspected [your] narrative …. Its flow is, well its plodding – pedestrian – fluctuating - halting – occasional. It’s intermittent, at best. Narratives are not your speciality …… The real danger with your narrative … is that it is lazy. …. You are idly playing with random details. You are forcing things together. You are making strange connections. And you are struggling to make a kind of sense out of them\nBarker clearly herself does not even seek to specialise in narrative. Her work though is far from lazy or idle-play, and the opposite of plodding or pedestrian. Instead it sparkles with ideas and invention. However, at times she (or at least I as reader) did struggle to make sense out of what seemed random details and strange connections. Ultimately once something is undermined and deconstructed what is left lacks real form. Nevertheless this was a stimulating read and one which seems entirely designed to be shortlisted for the Goldsmith prize."}, {"userName": "Jennifer", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/32647049-jennifer", "userReview": "No more Women's Prize books! I AM DONE. HOLY SHIT AM I DONE.Anyway, this is a strange intellectual romp set in a post-post apocalyptic world (whatever that means). I had a lot of fun with it, but there's a key structural/philosophical issue that leaves the whole experience feeling more gimmicky than sincere. Video review coming soon."}, {"userName": "Paul Fulcher", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/3250759-paul-fulcher", "userReview": "'I told her to be careful,' The Stranger said, 'not to be seduced by language. It can often be beguiling - seductive - beautiful, yet it is also unpredictable, dangerous, even lethal.'Update: Now winner of the 2017 Goldsmiths PrizeNicola Barker’s H(A)PPY is the final of the 6 books for me on the 2017 Goldsmiths Prize, a Prize intended to \"celebrate the qualities of creative daring associated with the University and to reward fiction that breaks the mould or extends the possibilities of the novel form.\" The Goldsmiths Prize was launched in 2013 the tercentary year, specifically chosen as the tercentenary year of the births of Diderot and Laurence Sterne, and Barker’s novel is a fitting heir to Sterne in her use of typographical innovation, as well as very different (indeed similar only in its difference from other more convention works) to Barker's previous novels.H(A)PPY is set in a future, post-apocalyptic, world of The Young:We are Innocent. We are Clean and Unemcumbered. Every new day, every new dawn, every new minute, we are released from the right bonds of History (the Manacles of The Past). We are constantly starting over and over from scratch. Right here! Right now! A new beginning. A New World. Everything is possible. We are reborn. Our narrator is Mira A, named after the pulsating red giant star (https://en.m.wikipedia.org/wiki/Mira), with its white dwarf companion Mira B. But it is difficult not to also see an authorial nod to Shakespeare's Miranda and hence to Huxley's Brave New World.The world in which she lives has The Young, looked over by the benign Altruistic Powers, living a seemingly idyllic existence, free of stress, worry, disease and jealousy, their lives regulated by The System, their mental well-being monitored by The Sensor, and recorded in real-time for all to see on The Graph, and where necessary adjusted by neuro-chemical intervention by Neuro-Mechanicals. Their access to information is controlled by The Information Stream a type of fire-walled system (reminded me a touch of aol.com in the early days of the internet!) where information isn't banned but rather drip-fed so as not to disrupt The System: all information is available, but not all is healthy:The Young do not believe (as The Old once did) that they have a natural right to information. Information - like all the other old vices (money, lust, possessions) - can be stored up - amassed - and exploited, or used to manipulate and undermine others.As genre dystopian fiction, the novel wouldn't be entirely successful – the New World isn’t really explained in coherent detail (who are The Altruistic Powers, what exactly was the trigger leading this world to be created and how did it evolve?) and Mira A's, almost accidental, rebellion against the system isn’t followed through in terms of its wider implications (e.g. she comes across a sub-group called The Banal – possibly rebels or possibly more hard-line on the preservation of The System, but the story line rather peters out). But that isn’t Barker’s aim.Mira A is a guitarist, and her dissonance results when she comes across the early 20th Century Paraguayan guitarist Agustín_Barrios [whose music Barker recommends listening to when reading the novel] and also a picture of the guitarist with a young-girl in the corner. She notices her graph 'pinking and purpling' – the colours are re-produced in the text - as she starts to get emotionally involved in his story (an Excess of Emotion being a thing to be avoided at all costs by The Young) and his story starts to intrude, literally, on her own thoughts.Even the word happy literally starts to separate and oscillate (like Mira A and its twin star) - H(A)PPY, hence the novel’s title - as in this visual excerpt (http://i68.tinypic.com/33nbvoh.jpg):A Neuro-Mechanical is sent to fix her, Kite, a character who plays an ambiguous role in the novel as he seems to both try to bring Mira A back to the calm and happy world of The Young, but also to provoke her to further investigation of The Cathedral she has constructed in her own mind (itself based on Barrios’s most famous composition - La Catedral: see e.g. this John Williams performanc https://www.youtube.com/watch?v=wYJ6f...).In a pivotal passage he warns her of the dangers of constructing a narrative, such as those of The Old:The narratives of family and romance and adventure, the masculine and the feminine narratives, the narratives of class, of nationalism, of capitalism, of socialism, of faith and myth and mystery, historical narratives, science fiction narratives, experimental narratives, horror narratives, literary narratives, ‘reality’ narratives, crime narratives. The Sensor automatically deconstructs those stories for us, so that we may fully comprehend their full meaning, their immense reach and their invidious power, their ultimately deeply conservative urge to comfort and pander and bolster and reassure. …Narrative is not really your speciality, Mira A. Your story is only half a story. Occasional. Trite. Partial. Meandering. And, strange as this may seem, this is actually a very good thing. Barker herself has pinpointed the desire to deconstruct narrative, but also the fear of doing so, as key to the novel:I’m not destroying narrative for everyone, I’m destroying it for myself. Which is disastrous for me, because obviously I understand the world through narrative. When you destroy the thing that explains everything to you, then what is that process? What have I done? So the last year has been trying to understand why I did that, what it means for me. But also what it means in terms of the novel, because I’ve sort of deconstructed the novel to such an extent – what is left of it?https://www.theguardian.com/books/201...This destruction is most evident in the novel in the 2nd half. The relatively simple typographical variation in the first half – occasional words in blue, pinks, red and purples, reflecting the way The Graph behaves - becomes something far more spectacular (and much more ambitious on Barker and the typesetter’s behalf).I have seen others refer to House of Leaves as a precedent for the different fonts, while I was reminded of the beautiful Gould's Book of Fish: A Novel in Twelve Fish, which was produced at much the same time. But Barker goes well beyond either, and in any case, as noted above, and as discussed in Reading the Graphic Surface: The Presence of the Book in Prose Fiction, typographical innovation dates back much much further than this, at least 250 years to The Life and Opinions of Tristram Shandy, Gentleman.As extracts from Barrios's story, taken from The Paraguay Reader: History, Culture, Politics intrude, as well of that of the indigenous population of Paraguay, with extracts from Chronicle of the Guayaki Indians (slight echoes of the Savage Reservation in New Mexico in Brave New World), Barker also brings in the classic novel I, the Supreme and intriguingly the Guarani language, alongside Spanish still an official language in Paraguay and which (per Wikipedia) 'is one of the most-widely spoken indigenous languages of the Americas and the only one whose speakers include a large proportion of non-indigenous people'. Mira is introduced by Kite to the Stranger, ostensibly to persuade her to return to the tranquility of The Young, but he also speaks to her direct in Guarani, to suggest an alternative.We generally like to use it because your Sensors find it difficult to interpret. Many of the words have dual meanings. It is incoherent - contradictory. Your System will not allow for variation. And at the novel’s end, Mira finds herself out of the system, joining The Stranger outside of The System in The Unknown:How might I describe this place?How might I describe this feeling?This strangeness?This fearfulness?This filth?This confusion?This mystery?This hopefulness?'Do not try.' He smiles, as if reading my thoughts. 'There is no need.'I smile back at him. I inhale. I exhale.Of course. But of course. I softly embrace silence."}, {"userName": "Jessica", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/11277865-jessica", "userReview": "Am I too dumb for this, or, is it in fact, shit?"}, {"userName": "Neil", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/33119635-neil", "userReview": "\"…the Old were completely awash with facts and non-facts. They asked a question and it was promptly answered. A fountainhead of information was released. But was the water clean? Did it quench, revive or simply deluge? Did it not often threaten to saturate and drown?\"So says a character in H(A)PPY, looking back from a future time to, we are undoubtedly meant to assume, our information rich age. The quote above is a thinly disguised criticism of the Google-age. The world our protagonist, Mira A, lives in has managed to go beyond this to create a utopian world where it seems the aim is to level everything out, avoid all extremes. Perfected citizens in this utopian world (known as “The Young”) live with The Information Stream which makes everyone’s thoughts, dreams and actions visible and where every thought and action is measured against The Graph: the aim is to not disturb The Graph. Words that disturb the graph appear on The Information Stream in pink or purple so you can see if a person is straying from The Graph by the colour of their Stream.Clearly, from our current perspective, this control, this avoidance of emotion is far from utopian and we would probably describe such a world rather as dystopian.It will come as no surprise to learn that this is story of someone who begins to worry about the utopian world she lives in, begins to rebel against it, discovers rumours of a rebel band that lives outside the boundaries.The basic story in H(A)PPY is not original. If I was judging the book purely on story, I would probably give it a fairly low rating.However, the story in this book is really just a vehicle for Barker to use. The thing you notice most about the book as you read it is the very creative use of typography. Early on, words are coloured (see above for colours in The Information Stream). Then you come across a page set out with white space such the words leave gaps that form the shape of a guitar. Later on, there are all kinds of weird and wonderful page layouts. Do not attempt to read this book on a black and white Kindle (fortunately, I knew this and bought a paper copy).The guitar is a motif that continues through the book. It is worth noting that Barker puts a note at the start of the book suggesting that readers listen to Augustin Barrios playing guitar as they read the book. This is because Barrios and his guitar feature heavily and several pieces of his are discussed during the story. I did as Barker suggests and played the music in the background as I read. Obviously, I can’t compare it with the experience of not playing the music because I didn’t do that. But I can say that music did, I think, add something. The recordings are poor quality because they are very old, but somehow that emphasises the fact that the book is set sometime in the future: we as readers end up sat in the middle between the recordings and the “brave new world” in which Mira A lives. I like the idea of an author providing a sound track for their book! And, as you discover things about Barrios, the music playing in the background starts to take on more significance.All this means that I am slightly conflicted when thinking how to rate this book. The story does not have anything particularly interesting to say: anyone who has read Brave New World, 1984 or any of a large number of other dystopian novels will recognise the story and know roughly where it is heading (although the end does get kind of interesting!). But the layout and the ideas about narrative mean that it is a book with a lot to say for itself. I’m settling on 3 stars which is a average of 2 for story and 4 for creativity. I would not be surprised to see this on The Goldsmiths list when that is announced next week - it seems to tick all the boxes for that award."}, {"userName": "MJ Nicholls", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/2386804-mj-nicholls", "userReview": "Having milked the frenetic oddball comedy until the teats were scabbed and bleeding (The Yips & In the Approaches), Barker is back at her inventive best in this striking dystopian novel that introduces a tone of unease and mild hysteria to her wide repertoire. Mira A, a diluted Barker heroine (frequent exclamation marks still in evidence), is finding her increasing thought crimes against The System—where no thought or negative emotion is tolerated—to cause her to lose her brackets and colours. Her slow tumbling from The System (and her own narrative) is entwined somehow with Paraguayan guitar maestro Agustín Barrios, in a warp of illogic native to Barkerland, and as Mira A loses her handle on h(a)ppiness, the novel unleashes a series of beautiful typographical images of tuning forks superimposed over kaleidoscopic text, and cryptic swirls of spooky prose. Barker’s abstract approach to the dystopic, replete with metafictive flourishes, a unique use of coloured text, and a subtle parodic edge, places H(A)PPY in a league of its own as far as novels about the fear-filled future are concerned."}, {"userName": "Jonathan Pool", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/27950748-jonathan-pool", "userReview": "On page 265 Mira B says:\" I can't really comprehend this, at first. I start to re-read it \"Mira B speaks for me!!!I haven't read Nicola Barker previously and so I don't know the extent to which H(A)PPY is a departure from her previous style. This is experimental writing. It's difficult to analyse formally and interpretation is likely to be even more subjective than is the case for other difficult books.The easy bits:* the delivery of words on the page is unusual. Colour text is used to highlight mood and sensation. Blank pages convey silence; repetitive blocks of words appear, with shapes and different typefaces making the story multi dimensional. Mark Danielewski is an exponent of this format in his  House of Leaves and  Familiar  series. I think there's something rather striking about this layout, but I don't dispute that to some readers it will just seem gimmicky.* the critique of \"primitive\" societies is conventionally written, and shocking in its own very different way. In Paraguay the Guarani and Ayoreo peoples have their own traditional customs. These are physical societies as distinct from the futuristic main body of H(A)PPY which is thought and mind based.* expression of freedom through music (a theme explored among others by Madeleine Thien and William Vollmann). Barker cites the true life guitar player Augustin Barrios as her inspiration for H(A)PPYThe harder bits of H(A)PPY concern the interpretation of the dystopian future.As ever, Orwell casts his 1984 shadow as we are in a world of thought control; of The Graph, The Sensor, The Stream, EOE (excess of emotion), The Banal.People are happy as there is an absence of awful things happening to them, and of sadness; but the happiness that arises from the absence or suppression of bad things doesn't compensate for the removal of improvised joy and freedom that comes from some individualism, expressed in our passions (e.g. music).Barker is singularly unimpressed by the Big Brothers of the Internet age, the corporations\"information is dangerous, it is a weapon.\"(39) Putting this all together I struggle to make a satisfactorily coherent meaning of H(A)PPYMy middle ground rating of three stars masks the fact that I enjoyed elements of the book while also remaining largely bemused by large swathes of it.A strong contender for the forthcoming 2017 Goldsmiths Prize for creative writing."}, {"userName": "Jill", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/3386994-jill", "userReview": "I didn’t see anything special in this book other than some colored font. While parts were clever, I didn’t find much meaning or pleasure in it. It may be that I’m not clever enough, but it is not a book for me."}, {"userName": "Eric Anderson", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/28819314-eric-anderson", "userReview": "Nicola Barker’s novels consistently surprise and puzzle me with their wide-ranging subject matter, discursive style and wondrously mind-bending sensibility. She’s a writer frequently in tune with what’s happening now whether it’s memorialising a magician’s 2003 performance art in her novel “Clear” or investigating the contemporary cultural and ethnic landscape of England through the life of a boorish pro-golfer in her novel “The Yips.” So it feels like another creative feat that she sets her new novel “H(A)PPY” not just in a dystopian future, but in a post-post apocalyptic time. Here she charts the journey of a musician named Mira A as some inner rebellion forces her to question the meaning of freedom, creativity, individuality and, yes, happiness itself. The result is a fascinating tale which speaks strongly about our modern times and demonstrates impressively daring narrative ingenuity.Read my full review of H(A)PPY by Nicola Barker on LonesomeReader"}, {"userName": "Tim", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/21122595-tim", "userReview": "I cannot put what this novel is about into my own words, and others here and in the The Mookse & The Gripes group have done so much more eloquently than I ever could.Suffice it to say that H(A)PPY is a lot of fun to read, try to decipher, and think about. A real treat if you're in the mood for it."}, {"userName": "Stephen", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/4412069-stephen", "userReview": "this book was a mixture of brave new world, 1984 and alice in wonderland all mixed together, where there is no pain, war but at what price though. enjoyed it myself as you followed the journey of mira A and her guitar experiences."}, {"userName": "Robert", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/2744544-robert", "userReview": "Here's my review, Ludwig Wittgenstein and all:https://deucekindred.wordpress.com/20..."}, {"userName": "Nick", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/1254616-nick", "userReview": "Zinger. Strange, challenging, increasingly experimental. A short read which stays in your head and does things to it. The overlaps of concept with GNOMON are positively alarming, but the style and form are very different. I loved it."}, {"userName": "Jay", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/4186397-jay", "userReview": "Well, I’ve finished reading H(A)PPY, and although I appreciate and enjoy experimental writing, and feel that she’s been reasonably successful in her approach (it was clear I was reading an author with talent), I’m still a bit dissatisified with this book. It functioned more as an intellectual exercise, something to puzzle out, and it’s smart enough and clever with it’s typeface and color, but sadly that’s about all I was left with when I finished. There’s not much surprisingly insightful or emotionally engaging in this novel. I wanted the stakes to be higher and I wanted to gain some fresh perspectives on reality due to the virtual/electronic culture that exists in this post dystopian world, but I didn’t really come away with any of that. Like many books, it could possibly reveal more with a second reading, but there was nothing compelling enough about this one to make me read it again. I suppose I’d give this book a 3 out of 5 for the skill involved and the creativity displayed. But I ended the book simply saying, “well, okay”. (On a side note, I did learn about the Paraguayan guitarist, Agustin Barrios, and I’m glad of that.)"}, {"userName": "David Barnard", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/60751046-david-barnard", "userReview": "Have I missed something about this book? I didn't enjoy it. The typography was good and after a few chapters I thought this book could be amazing. It was not."}, {"userName": "Jaclyn Crupi", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/13323030-jaclyn-crupi", "userReview": "I don’t usually do dystopian but I’m glad I made an exception for this weird and clever book."}, {"userName": "Sabrina", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/8940553-sabrina", "userReview": "3.5 starsThere were a lot of things I liked about this, but I also don't know if I 100% understood it."}, {"userName": "Jennifer", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/2438005-jennifer", "userReview": "This is experimental fiction. I found it to be a cold and impersonal dystopian story set in the future where 'The Youngs', the people of means, maintain their happy, solitary existences on a grid where all their needs are met. I would describe their state as being in a hyper-sleep state while they still see themselves living and interacting normally with other grid dwellers kind of like The Matrix environment. Outside of the grid, there is the reality of war, destruction, hunger, and pain among the poor and disenfranchised, those who live in reality.So, maybe what H(A)PPY is really trying to tell us is that as we become more and more disconnected via technology and the internet from those around us, and we can only communicate via an online presence, we disassociate ourselves to the world around us, not seeing how the other majority of the planet is living and the hardships they are enduring. We in our happy bubbles of existence while the rest of the population is just trying to stay alive any way they can. It can also be hinting at a future controlled by robotic technology and depending on human status and means, one can either be living happily on the grid in a controlled state of existence or be fighting for survival on the outside.At the beginning of the story, Mira A (named after a star - Mercury?) is researching a story of an Indian kora (guitar) player from Paraguay circa the late 1800s. Her Sensor and Graph begin noting an oscillation of pattern. Kite comes out to take a look. She goes to her Kora (guitar) class and Tuesday notices her, recommending her to her Banal group. Mira A is suspicious of Kite and Tuesday's intentions. Mira A's pinks and purples are turning to blues and greens. She collapses and has surgery with clamps inserted into her brain to balance her thoughts for her peaceful grid life. This has little effect on Mira A and soon Mira A discovers her shadow Mira B. She spies on the streams of Tuesday and Kite and keeps returning to her dreams of the Indian guitar player and a small Indian child with a doll. Kite warns her she is creating problems on the grid with her destructive thinking and will soon end up on the outside. She makes her best effort to conform to the grid but ends up falling off the rails again. Using the tuning wand at different Hertz levels, the two hemispheres of her brain make a connection and she's finally able to open her eyes. Mira A flees into blank space with her tuning wand and creates a cathedral from sound and imagination to escape into with Kite close behind her. He follows her up to the bell tower to kick her out of the Perfect existence of the grid, as she is endangering everyone on the grid. Somehow, she ends up on the outside with the Paraguay Indian man, living in the world of dread. However, only now she can finally be free. Everything has its price."}, {"userName": "But_i_thought_", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/67012059-but-i-thought", "userReview": "How can I possibly capture this trippy, eccentric adventure of a novel? 🤔In this Women's Prize longlisted book, Nicola Barker essentially describes a post-post-apocalyptic world where everyone is \"happy\" and people love in \"perfect balance\", free of poverty, strife and pain. Citizens exercise a committed form of non-attachment (to ego, people and things), and avoid an EOE (excess of emotion) at all costs. This progress is charged via an openly accessible \"graph\" on each person that indicates how \"in balance\" they are. The narrator, a young woman called Mira A, works as a musician and lives in perfect contentment until she starts experiencing a \"glitch\" of sorts, prompted by research into a 20th century Paraguayan virtuoso guitarist. Despite her best efforts to return to equilibrium, this \"kink\" threatens to spread out like a bruise, infecting others in the system, unbalancing their graphs and effectively declaring \"war\" on the establishment. While there are nods to Huxley's Brave New World and Zamyatin's We here, this is not a typical dystopian novel with extensive world-building. Instead, it's a much more introspective, cerebral novel, exploring the psychology of thought control, social conditioning, surveillance, and ultimately the power of ideology and our search for truth ('What is real? What is truth?'). As Mira A wanders further down the \"rabbit hole\", the narrative starts to unravel, becoming more abstract, restless, disjointed, hallucinatory – a state increasingly mirrored by the book's typography and design (via alternating fonts, colours and layout). There are also historical clippings of Paraguayan history and Guarani culture inserted into the story, which act as \"cookie crumbs\" for the reader to follow up on and piece together in their own time.In short, I would describe this as a \"heady jungle of words\", trippy and thoroughly engrossing, while also equally enigmatic and elusive!Mood: Cerebral, restless, psychedelic Rating: Impossible to rateAlso on Instagram:https://www.instagram.com/p/BhyYVOhFd..."}, {"userName": "Eleanor", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/5810442-eleanor", "userReview": "H(A)PPY, by Nicola Barker, is the second book I’ve read as part of the Women’s Prize Shadow Jury this year. It’s different in almost every conceivable way from most of the other Women’s Prize longlisted titles that I’ve read so far; primarily, as readers should by now expect from Barker, it’s much more formally challenging. Which is to say, H(A)PPY looks weird. Right from the start—as certain words are highlighted in blue, or red, or pink, or a slightly darker shade of pink—all the way through to the end, by which point the text is in a state of permanent breakdown, riddled with images and figures. (There is a magnificent page of a cathedral, of sorts, composed of typographical symbols; on another page, words appear to be literally floating in bubbles. Barker won the Goldsmiths Prize, which is awarded for the most formally inventive book of the year, but I reckon whoever did her typesetting ought to win some sort of award too.) The plot is minimal, but revolves around Mira A, an inhabitant of a utopian future Earth where The Young are cared for, and relentlessly surveilled, via The Information Stream and The Graph. (There are a Lot of Capitals. I am pretty sure they are Satirical.) Mira A’s brain, however, seems not to work seamlessly in conjunction with the Graph, and H(A)PPY is a story, ultimately, about what constitutes happiness, and what freedom. Into this fairly standard speculative plot is woven information about Augustín Barrios, a famed Paraguayan guitarist, to whose story Mira A—also a guitarist, of a sort, since she plays a perfected version of the instrument—is drawn.I think I understand, in a general sense, what Barker is going for: an interrogation of the relationship between perfection and art, best represented by Mira A’s relationship with her instrument, as she tunes and untunes it, makes it imperfect and then perfects it again. (It’s this sort of behaviour that brings her to the attention of the authorities.) What I don’t quite understand is the evident disconnect between the formal inventiveness and the underlying ordinariness of the plot. It’s not a particularly interesting or unusual story: Helpless Rebel Cast Out Of Deceptive Utopia powers plots from Nineteen Eighty-Four through to The Matrix. (Candide might even qualify. Dicuss.) There are two questions a book has to answer to justify its existence: why this story, and why this way? Barker seems much more interested in the second question than in the first, and although her focus as an author is entirely her own prerogative, it gives the impression of there being a missing step, somewhere."}, {"userName": "Mary", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/6979067-mary", "userReview": "Started off with a wonderful self mocking tone towards health and wellness enthusiasts (of which I am one) with strange changes in font type and color that were intriguing. The story transitioned into many technical musical references that I just don't have the background knowledge to appreciate or understand where the author was going with the story. As a side note Barker recommends listening to Paraguayan guitarist Agustín Barrios whn reading the novel - which I really enjoyed. Fantastic music."}, {"userName": "MisterHobgoblin", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/11223001-misterhobgoblin", "userReview": "Nicola Barker does sci-fi. Barker has made her name with quirky stories set in the less glamorous suburbs of southern England, mixing zany people with everyday situations. So when we meet Mira A in a future utopia it is a real departure.And Utopia it is. The world is run by and for The Young. People are hooked up to Sensors that turn pink or purple when a person starts to display an Excess Of Emotion, and it will be recorded on The Graph for others to read. This will encourage The Young to return their thoughts to neutral matters as soon as possible, perhaps using chemical assistance.But all is not well. Mira A’s Graph often turns pink or the purple. She discovers forbidden guitar music by Agustin Barrios that veers dangerously in the direction of free expression. So dangerous is music that musicians can only be referred to in code (numbers that, when read backwards, give each letter’s position in the alphabet). Her alter ego, Mira B seems to be determined to knock her off course.Through subversion, Mira A experiences sensory overload and accesses a world where her Graph shows shades of green and blue, words forming patterns and blank space. This is a masterpiece of fun and games, beautifully set in coloured text and graphics. It is a novelty item, yes, but it is also a highly lyrical story which should make us question how far social media is forcing us in a direction of increased social compliance and false emoting. I loved H(A)PPY and read it in a day."}, {"userName": "The Twins", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/5437661-the-twins", "userReview": "Not sure what to say about the book - \"if you haven't anything nice to say, don't say anything at all\". Ok - I liked how Nicola Barker played with the quirky fonts and the various colours. I've never taken drugs in my life, not medicine, drugs, but this is how I would imagine it. Mira A - all her senses totally overwhelmed, her brain in overdrive and she's trying to make sense of it, but nothing in her world and surroundings is real.I h(a)ppily (and obviously) admit I don't get the book, I persevered throughout the book but I'm just not clever enough...and that is ok, I'm still h(a)ppy!"}, {"userName": "Julia", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/20974086-julia", "userReview": "This went over my head, I'm afraid. I certainly took my time with 'H(A)PPY' (thanks so much for your patience, Meike!) so I wouldn't read it at times when I would be too impatient for a book like this, but could still at no point develop any relation with the book. It felt too constructed, experimental and meta for me to bond with either the story, characters or message.I loved the idea of the different fonts, colours of the text, symbols, images etc. but also didn't find the designs or fonts very appealing."}, {"userName": "Isobel", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/37246051-isobel", "userReview": "Mira A is h(a)ppy. She is a musician in the world of The Young, where everything is open and part of a system of filtered information: there is technology to survey all members of the community, from their actions right to their thoughts. Each member has a graph which colours when they are becoming out of balance, warning them when they might be about to experience an EoE (Excess of Emotion). Any emotive words therefore appear in different colours in the text. Mira A has started to narrate her life and finds that she can't stop, despite being warned against it. The utopia unravels to a distopia as she struggles to distinguish between dreams and reality and is overloaded with information that it is difficult to make sense of. The story of a musician from Paraguay becomes intertwined with her own narrative; their lives become mixed up in dream encounters. She is threatened with the old world of death and pain if she can't rebalance herself, and it is this she spirals towards, staring in to the light which is the only way she can think without being recorded. That summary was particularly hard to write as this novel is difficult to summarise. It's maybe not even appropriate to call it a novel -- Barker has pulled the form apart and done what she likes with it in a critique both of individual narrative and the attempts to restrict it. At all points it's not entirely clear what is actually going on. It's a very liminal book which feels like an act of lucid dreaming to read, the characters never quite clear, the different stories becoming mixed up. Some parts are beautifully poetic, others simply sentences repeated over and over, the text getting larger or changing colour as it goes along. It's striking in the images it creates and the voids it leaves between them, sometimes with gaps in the story and other times with blank pages you find yourself frantically turning to find out where the narrative has disappeared to. It's a performance of a book; Barker recommends at the start to listen to the music of Paraguayan guitarist Agustin Barrios, and doing so means the book really shuts you off in to its world, demanding all of your attention. I read Darkmans years ago but still think of it now; her latest novel is equally as mad and beautiful and I enjoyed it."}, {"userName": "Tundra Morscheck", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/43990165-tundra-morscheck", "userReview": "I don’t generally read science fiction so this novel was always going to be a challenge for me. I was on board for the first half of the novel and would give this 4 stars. The concept of a perfect society where people choose not to choose so as to maintain a H(A)PPY equilibrium for all was an interesting concept. The second half of the novel really confused me. I could have coped with the fragmented writing or the narrative switch to a disjointed glimpse at the history of Paraguay but I couldn’t do both and I was lost as to the connection with Mira A, (apart from the fact that her society did not embrace people having personal narrative and she was trying to create one). I know nothing about Paraguay but after a bit of googling I understand it has had an extremely tumultuous political history but I still don’t get the link."}, {"userName": "Bart Van Overmeire", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/15910165-bart-van-overmeire", "userReview": "H(A)PPY, or: All bow for the divine Nicola Barker.No novel from Barker's wonderfully extravagant mind is ever the same and she H(A)PPily outdoes herself in her last one. The future belongs to The Young. They are Innocent. They are Clean and Unencumbered. They work (but never struggle) to stay Perfect, thanks to The Graph, The Information Stream and The Sensor. Mira A, however, is merely H(A)PPY, with the A struggling in parenthesis. Despite the administration of chemicals and the readjustment of her Oracular Devices, the music of 91.51.9.81.81.1.2 (or Agustin Barrios as the Paraguayan guitarist was known in the Manacles of The Past) keeps leading her astray.Prepare for a book unlike anything you have read before."}, {"userName": "Jamie Klingler", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/23336937-jamie-klingler", "userReview": "Profoundly different than anything I’ve read previously. Wonder what the book would be like read in different formats—- if you are colour blind? Or listened to it on Audible? How would your experience differ as a reader.At times I found the changes in font and colour distracting, but enjoyed the premise of the novel and think I will keep coming back to the story for months to come."}], "description": "Imagine a perfect world where everything is known, where everything is open, where there can be no doubt, no hatred, no poverty, no greed. Imagine a System which both nurtures and protects. A Community which nourishes and sustains. An infinite world. A world without sickness, without death. A world without God. A world without fear.Could you...might you be happy there?H(A)PPY is a post-post apocalyptic Alice in Wonderland, a story which tells itself and then consumes itself. It's a place where language glows, where words buzz and sparkle and finally implode. It's a novel which twists and writhes with all the terrifying precision of a tiny fish in an Escher lithograph - a book where the mere telling of a story is the end of certainty.", "title": "H(A)PPY", "url": "http://www.goodreads.com/book/show/32603497-h-a-ppy", "average": 3.25, "cover": "https://images.gr-assets.com/books/1490689323l/32603497.jpg", "reviews": 83, "authors": [{"url": "https://www.goodreads.com/author/show/7374.Nicola_Barker", "name": "Nicola Barker"}], "type": ["Fiction", "Science Fiction", "Science Fiction", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/32603497-h-a-ppy", "http://www.goodreads.com/book/show/32603519-h-a-ppy", "http://www.goodreads.com/book/show/1139452.Darkmans", "http://www.goodreads.com/book/show/779580.Wide_Open", "http://www.goodreads.com/book/show/13395627-the-yips", "http://www.goodreads.com/book/show/590634.Clear", "http://www.goodreads.com/book/show/7421414-burley-cross-postbox-theft"]}