{"ratings": 486468, "userreviews": [{"userName": "Cait • A Page with a View", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "[DRACO: I always envied them, you know - Weasley and Granger. I had -GINNY: Crabbe and Goyle.DRACO: Two lunks who wouldn't know one one end of a broomstick from another. You - the three of you - you shone, you know? You liked each other. You had fun. I envied you those friendships more than anything else.GINNY: I envied them too.HARRY: I need to protect [Albus]-DRACO: My father thought he was protecting me. Most of the time. I think you have to make a choice - at a certain point - of the man you want to be. And I tell you that at that time you need a parent or a friend. And if you've learnt to hate your parent by then and you have no friends... then you're all alone. And being alone - that's so hard. I was alone. And it sent me to a truly dark place. For a long time. Tom Riddle was also a lonely child. You may not understand that, Harry, but I do - and I think Ginny does too.GINNY: He's right.DRACO: Tom Riddle didn't emerge from his dark place. And so Tom Riddle became Lord Voldemort.\n(hide spoiler)]"}, {"userName": "Emily May", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "3 1/2 stars. I completely get why many HP fans will be disappointed with this, but I have to admit: I really enjoyed it. I'd love to see this story play out on stage.So yeah, I understand the sad feelings. Harry Potter and the Cursed Child has a completely different vibe. Aside from being a play, it's also a more mature, character-driven, less magical story. It does not feel like an eighth Harry Potter book at all; there's a real disconnect between this play and the other seven novels. And you know what? I'm so glad. I guess it's just what you're hoping for. To be honest, I never wanted another Harry Potter book. The thought of extending a series I loved so much actually made me NOT want to read this. I got to the end of Harry Potter and the Deathly Hallows and thought it was magical perfection - the story had completed its arc in full and I put it aside feeling a slight melancholy, but a whole lot of satisfaction. I didn't want more.However, if you went crazy needing more from the HP series, you'll probably be disappointed by this. If you feel there's a gap where something HP is missing, then I don't think this will fill it. Separate the two in your mind, and you have a better chance of liking it. Because this is something different - and I'm happy about it.First, of course, it's a play. Right away it's going to be something unlike what we've seen before. I don't usually love to read plays, especially modern ones, but this one is very readable because the dialogue is wonderful. I don't know why people are saying \"it's so obvious JKR didn't write most of this\" because I think her style is all over it - the very fact that this play (which is meant to be viewed on stage) can be just as easily read like a book tells me JKR had a lot of input.Also, it's funny. Much more consistently comical than the books, but with the same style of humour - i.e. lots of Ron being a buffoon. \nHermione: If some part of Voldemort survived, in whatever form, we need to be prepared. And I’m scared.Ginny: I’m scared too.Ron: Nothing scares me. Apart from Mum.\nThe plot leaves a little something to be desired. Again, it feels different from the main series. It's not so much about the world and magic, but more about relationships, conflicts (particularly between Harry and Albus) and the dialogue between characters. I suppose this makes more sense in a play, where the story unravels through dialogue and not through an omniscient narrator.And, as I touched upon earlier, it feels... older. I don't know how well kids will appreciate the jokes about growing old and how Ron now says \"oof\" every time he sits down. Or the family drama between Harry and his son, Albus. But I liked it. I'm happy with this addition. I truly am. If it had been too similar to the seven novels, I feel it would have risked reopening a series that had been closed in a great place. Instead, we have something very unique and, for me, very entertaining. Some of the staging directions also leave me excited about seeing the play (when I win the lottery or acquire a magic wand, maybe).One thing I have to say that I said in another comment thread: NOW, it's time to stop. This was a risky experiment and it turned out to be fun, but JKR needs to leave this world alone now. I really do not want to read about old-age Harry, Ron and Hermione rolling around in magical wheelchairs. So, just stop.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "It was alright. It was just alright.I know I gave this 4 stars, but to be honest, J.K. Rowling can write a dictionary with Harry Potter illustrations and I'd probably give it 4 stars, so my rating is almost irrelevant here, given my extreme bias.The thing is, it was cute, it was sweet, it was entirely nostalgic to see the old crew again, but I hated the play format. As a person who grew up with Harry Potter, and who is in her early 30s now, I feel like I grew up with Harry Potter and the crew, and with the advent of this book, I have, in fact, grown old with them. It was lovely to see them again. It was like meeting old friends.I don't feel old. I'm a more responsible person, for sure, but I feel young at heart. When we're young, adulthood, responsibilities, just the prospect of adulting seem so daunting...then one gets there and it's like, well, I'm as immature as I ever was. I love fun as much as I ever did. Growing old isn't that bad. And seeing the old crew being as much as they ever were brings joy into my not-yet-old-and-grizzled-heart.I could do without the kids, to be honest. Oh, sure, they're little Potter and Granger-Weasley spawns, but come on, nobody ever has and nobody ever will win me over as much as their parents, whom I have loved the instant we met them on the Hogwarts Express.(Ok, maybe not Ron...)But I digress. The kids aren't all bad. I rather like little Scorpius, actually.\nSCORPIUS: And it’s just like my father’s! I got his nose, his hair, and his name. Not that that’s a great thing either. I mean — father-son issues, I have them. But, on the whole, I’d rather be a Malfoy than, you know, the son of the Dark Lord.\nThe adults have grown, they've changed. Some have changed so much that I hardly recognize them, Draco, for instance. I like that he's, well, nicer now, but he doesn't feel like Draco, you know? I've been so used to Harry and Draco doing this...That it's rather discombobulating to see anything otherwise.But yeah, characters are great, but the format. THE FORMAT. I don't even know it's fair of me to judge this based on the fact that I don't like that it's a play, because for fuck's sakes, IT'S A PLAY. Like, what did I expect? This may be the most confusing review I've ever written. I just don't like the play format. It's meant for the stage. That means it's up to the skill of the actors to portray what is implied. It's up to the audience to interpret nuances. It is almost entirely based on dialogue, and I hate that. I miss Rowling's writing. I love Rowling's writing, and I wanted more of it. The play brings up so many things that could have been written so much more, had it been expanded into a book format. The children's growing pains, particular that of young Albus. Harry's feelings as a parent. Draco's struggles with who he was and who he is. Furthermore, Ron is relegated to little more than comic relief. Let's be honest, I never liked the guy, but for him to be much of the same character that he ever was conjures up the image of the try-hard middle-aged dude, and I know that Ron is more than that.I like it? I don't like it? I don't know. But I would certainly relish watching it on the stage if I ever had the chance. It's bound to be better than on paper."}, {"userName": "Lola  Reviewer", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "You know, I really hadn’t foreseen the publication of something to lengthen Harry Potter’s story after the conclusion that was Harry Potter and the Deathly Hallows. So, the way I see it, Harry Potter and the Cursed Child is a lovely gift to every Harry Potter fan out there who has hoped and waited a long time to see their wizard friends again.Though the plot holes are very visible and spread throughout the story, they make for charming and heartfelt conversations between characters, so I didn’t mind them all that much.The best thing about this #8 Harry Potter is how nostalgic it makes the reader feel. There are plenty of familiar faces – Harry, Ginny, Draco, Hermione, Ron, Dumbledore, etc – as well as some interesting new ones – Albus, Rose, Scorpius, Lily, James…Admittedly, it was strange to read this supposedly 8th story in Harry Potter’s world in play format but the truth is, it was extremely easy to imagine everything play out like in a movie, so it all felt alive to me.This isn’t a book you have to read but, if you’re a diehard Harry Potter fan, I am going to look at you quite incredulously if you decide not to. I’m sadly not going to be able to tell you that you're making the right choice, because this is so, so charming and fun, but I can understand people wanting to have their own vision of the Harry Potter cast as adults and their children. Yes, it's a bit silly but… I loved it still.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Riley", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/23179211-riley", "userReview": "[-So many of the characters said and did things that didn't feel genuine to them-Ron was pretty much a joke (and I never really cared for him before) but he was basically just there to add comical background noise-VOLDEMORT HAS A DAUGHTER???? ARE.YOU.SERIOUS? -Thinking about Voldemort procreating makes me want to vomit-The timer turner plot was RIDICULOUS-And also so convenient. Everything got wrapped up in a neat little bow -Scorpius has a crush on Rose. Ok suuuuure whatever you say-Albus and Scorpius are gay and in love. I will fight you on that -Harry being a horrible father. And saying it was because he didn't have a father figure to learn from. WHAT! UMMMMM HAGIRD? SIRIUS? LUPIN? Why don't you just spit on their graves while you're at it Harry (hide spoiler)]"}, {"userName": "Maxwell", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "[the Time Turner inconsistencies, no Teddy Lupin, the fact that we are supposed to believe Bellatrix & Voldemort had a freakin' daughter, and every other aspect of this play that basically disregards fans' investment in one of the most influential series of books ever... (hide spoiler)]"}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "I'm not going to rate this. I didn't hate it. I didn't love it. It's just a thing that exists and I'm accepting it for what it is. *edit: I didn't mean for this review to come off as shady as it did. I'm going to make a video discussing my feelings further. I'm happy that we got to visit this world again, but it just wasn't what I was expecting it to be. If you LOVED this book, that's okay! I'm happy that you enjoyed it."}, {"userName": "Mercedes", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/5124500-mercedes", "userReview": "Let's be honest - this read like badly written fan fiction"}, {"userName": "Bookdragon Sean ", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Now this was a real shame. It read like some juvenile fan fiction. The characters were utterly lifeless. Perhaps seeing this would be better. The stage actor’s performances would carry the emotion and drama the dialogue completely failed to convey.The stage directions were also minimalistic. I mean we have a basic location set for us, but that’s about all. There’s no real expression or sense of urgency. All in all, it’s just a little flat. The plot is feasible, even if it felt a little forced, but the characters were just poor. The new ones aren’t so bad, but the old characters, Harry, Ron and Hermione, were barely themselves. They just had no depth to them; they’re like reflections of their surface level. Ron felt like a piece of furniture that seemed to enjoy inserting several badly times jokes. Hermione seemed cold. And Harry, Harry simply isn’t Harry. How can he identify himself as a bad farther? How can he believe that he had no farther figure in his own life? He had many. He had inspiration from many great men. They taught him a great deal about life and himself in the process. So why would a man who has defeated the face of evil be so daunted by giving his son some simple advice? It doesn’t add up. Harry Potter would make an excellent farther. This didn’t even feel like the same world."}, {"userName": "Nat", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "This review contains *mild spoilers*.I've waited for this particular story for what feels like ages, and words cannot even describe for how grateful I am that it finally exists in my hands. Harry Potter and the Cursed Child continues the wondrous magical world that we all know and love.The story starts out at King's Cross with the original trio preparing their school-age children to board the train to start their first year at Hogwarts School of Witchcraft and Wizardry.It's at this time that Harry and his son, Albus, share a nice father-son moment:“Albus: Dad . . .Do you think — what if I am — what if I’m put in Slytherin . . .Harry: And what would be wrong with that?Albus: Slytherin is the House of the snake, of Dark Magic . . . It’s not a House of brave wizards.Harry: Albus Severus, you were named after two headmasters of Hogwarts. One of them was a Slytherin and he was probably the bravest man I ever knew.”(I dislike Snape, but the overall conversation made me tear up a bit.)I also really appreciated that they talked about Slytherin in a positive light.We have a few time jumps here and there, and then complications arise because Harry - Head of the Department of Magical Law Enforcement - seized an illegal Time-Turner from Theodore Nott and has kept it.“The once-great Harry Potter, now a stone-cold Ministry man.”Meanwhile, Albus gets sorted into Slytherin and struggles with the weight of a family legacy he never wanted.Harry tries to reach out to Albus but finds that he has diffuclity understanding someone different. And their connection wobbles from year to year because of it.“Harry: Do you want a hand? Packing. I always loved packing. It meant I was leaving Privet Drive and going back to Hogwarts. Which was . . . well, I know you don’t love it but . . .Albus: For you, it’s the greatest place on earth. I know. The poor orphan, bullied by his uncle and aunt Dursley . . .Harry: Albus, please — can we just —Albus: . . . traumatized by his cousin, Dudley, saved by Hogwarts. I know it all, Dad. Blah, blah, blah.Harry: I’m not going to rise to your bait, Albus Potter.Albus: The poor orphan who went on to save us all. So may I say — on behalf of wizarding kind — how grateful we are for your heroism. Should we bow now or will a curtsy do?Harry: Albus, please — you know, I’ve never wanted gratitude.Albus: But right now I’m overflowing with it — it must be the kind gift of this moldy blanket that did it . . .Harry: Moldy blanket?Albus: What did you think would happen? We’d hug. I’d tell you I always loved you. What? What?Harry (finally losing his temper): You know what? I’m done with being made responsible for your unhappiness. At least you’ve got a dad. Because I didn’t, okay?Albus: And you think that was unlucky? I don’t.Harry: You wish me dead?Albus: No! I just wish you weren’t my dad.”Harry and Albus are trying to reach each other here, both are failing.As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes darkness comes from unexpected places.The Cursed Child answered a lot of topics that had been left unanswered in my mind, and it makes my heart tighten just thinking about everything.“Harry: And I’ve locked away the map. You won’t see it again. Your mum left your room exactly as it was when you ran away — you know that? Wouldn’t let me go in — wouldn’t let anyone go in — you really scared her . . . And me.Albus: Really scared you?Harry: Yes.Albus: I thought Harry Potter wasn’t afraid of anything?Harry: Is that how I make you feel?Albus looks at his dad, trying to figure him out.ALBUS: I don’t think Scorpius said, but when we returned after failing to fix the first task, I was suddenly in Gryffindor House. Nothing was better between us then either — so — the fact that I’m in Slytherin — that’s not the reason for our problems. It’s not just about that.”I really appreciated that their relationship was developed in a very honest and raw way.And not only theirs, but the development of Draco and his son, Scorpius, was truly melting my everything.“Draco: Astoria always knew that she was not destined for old age. She wanted me to have somebody when she left, because . . . it is exceptionally lonely, being Draco Malfoy. I never realized, though, that by hiding him away from this gossiping, judgmental world, I ensured that my son would emerge shrouded in worse suspicion than I ever endured.Harry: Love blinds. We have both tried to give our sons, not what they needed, but what we needed. We’ve been so busy trying to rewrite our own pasts, we’ve blighted their present.”Watching Draco care deeply and fiercely for his child made me open up my heart.Oh, and I wanted to mention how ecstatic I was when Albus befriended a Malfoy. Their friendship was inspiring until the very last heartbreaking page.“Scorpius: Your dad thinks the rumors are true — I am the son of Voldemort?Albus (nods): His department are currently investigating it.Scorpius: Good. Let them. Sometimes — sometimes I find myself thinking — maybe they’re true too.Albus: No. They’re not true. And I’ll tell you why. Because I don’t think Voldemort is capable of having a kind son — and you’re kind, Scorpius. To the depths of your belly, to the tips of your fingers. I truly believe Voldemort — Voldemort couldn’t have a child like you.Scorpius: That’s nice — that’s a nice thing to say.Albus: And it’s something I should have said a long time ago. In fact, you’re probably the best person I know. And you don’t — you couldn’t — hold me back. You make me stronger — and when Dad forced us apart — without you —Scorpius: I didn’t much like my life without you in it either.\"We also had a lot of unexpected returns from the people that ended up sacrificing themselves in previous books, which truly broke me— I kept looking for Fred Weasley to show up and crack a joke... but, alas, you can't always get what you want.But to end this review on a more positive note, I want to mention my favorites: Hermione and Ron.“Ron: I mean, we’ve been together so long — and married for so long — I mean, so long —Hermione: If this is your way of saying you want a marital break, Ron, then, to be clear, I will skewer you with this quill.Ron: Shut up. Will you shut up for once? I want to do one of those marriage renewal things I’ve read about. Marriage renewal. What do you think?Hermione (melting slightly): You want to marry me again?Ron: Well, we were only young when we did it the first time and I got very drunk and — well, to be honest, I can’t remember much of it and . . . The truth is — I love you, Hermione Granger, and whatever time says — I’d like the opportunity to say so in front of lots of other people. Again. Sober.She looks at him, she smiles, she pulls him to her, she kisses him.Hermione: You’re sweet.Ron: And you taste of toffee . . .”I'm always up for more canon Romione.To sum up, I thought at first that the format of the story would interfere with getting completely pulled in, but I needn't have worried— this book was the definition of unputdownable. It truly didn't take long for me to realize how much I missed reading about Harry Potter and his magical surroundings. Hogwarts will always be like home. And now... I'm getting tearful just thinking about what an impact it made on me, as both the reader and person I am today.Also, it was pretty nice getting to know that both Harry Potter and I are afraid of pigeons:“Harry: You told me you don’t think I’m scared of anything, and that — I mean, I’m scared of everything. I mean, I’m afraid of the dark, did you know that?Albus: Harry Potter is afraid of the dark?Harry: I don’t like small spaces and — I’ve never told anyone this, but I don’t much like — (he hesitates before saying it) pigeons.Albus: You don’t like pigeons?Harry (he scrunches up his face): Nasty, pecky, dirty things. They give me the creeps.”Yes, Harry!!Oh, and my favorite acts were acts 2 & 4— because family dynamics and mystery!!Just... I'm so glad this book exists, I truly missed my favorite trio.5/5 stars (of course)*Note: I'm an Amazon Affiliate. If you're interested in buying Harry Potter and the Cursed Child, just click on the image below to go through my link. I'll make a small commission!*\nThis review and more can be found on my blog."}, {"userName": "Kai", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/41788524-kai", "userReview": "[Scorpius and Albus are just perfect. The two of them are the cutest friends ever. Overall we have an amazing cast.But then you get a whole theatre covered in magical ink and runes, you get freakishly scary Dementors flying over your head and transporting people through the air. Actually, there is a lot of flying. Then you get wand fights and flames and a beautiful fiery Patronus moving through the darkness. Scenes from under the lake with Albus and Scorpius \"swimming\" through the air, a moving maze and the famous moving stairs in Hogwarts. So many special and visual effects. You'll gasp and shiver and won't find words that describe what you feel.  (hide spoiler)]"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "[Hermione wouldn't similarly ward the office of the MINISTER OF MAGIC? (hide spoiler)]"}, {"userName": "Beth Hudspeth", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/18107143-beth-hudspeth", "userReview": "It's finally HERE!!! HP FOR LIFE!!My post on Hello Beautiful Book BlogWHO'S EXCITED?!?OMGGGGGGGIt's going to be published on HARRY'S BIRTHDAY!!!! OH HAPPY DAYYYYFROM TIME MAGAZINE ONLINE:\n\"There’s good news for Harry Potter fans who won’t be able to make it to London to see the theatrical production of Harry Potter and the Cursed Child: the play will be published in book form immediately after its debut.The script, written by Jack Thorne and based on a story by J.K. Rowling, Thorne and John Tiffany, will be published as an eBook by Pottermore, Rowling’s digital publishing platform, and in hardcover by Scholastic in the U.S. The first printing will be a “Special Rehearsal Edition,” reflecting the script from the early part of the preview period, and a later “Definitive Collector’s Edition” will present the finalized version (as many plays make small changes during previews).The story picks up 19 years after the end of the original series, with Potter working at the Ministry of Magic, now a father of three. As Pottermore describes, “While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted.”The play premieres on July 30, and the book will be released July 31, which just so happens to be The Chosen One’s birthday.\""}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "CONGRATS TO HARRY POTTER AND THE CURSED CHILD FOR WINNING THE 2016 GOODREADS CHOICE AWARDS FOR BEST FANTASY!!!\nBloody Hell!I freaking cried. I was afraid I wasn't going to like this book but I did and I damn cried. This is a SPOILER FREE review so I can't tell you what made me cry. Even though this is about the kids and all of our loves are older, they wrote the book in a way that we get to have some memories of certain things. And my favorite character made me cry again! I really hope they put this play out on dvd sometime and make it available to everyone. Although, it might be weird seeing other people playing the parts. Anyway, I loved reading about the children. I loved the friendship between Albus, Harry's son and Scorpius, Draco's son. Scorpius was the sweetest one of all, who would have thunk. I didn't like some of the parts Ron played, he seemed like an idiot but he's Ron and I love Ron. Of course most of you already know it's written in a play format. This was weird at first and then I got into it. I don't think I have ever read a play before, it seems like I would remember. This was a nice little trip down Hogwarts Lane and the little mystery/hijinks the kids get up to that brings on all kinds of issues was a cool edition. Well, not really, but you know what I mean. I loved it. I can't say that I loved everything about it and I might not have loved it if that one part didn't come into play, but who cares. I am so happy with it for what it is. I hope you all love it as much as I did and if you don't then that's okay too. \nThank you for being my light in the darkness\nMY BLOG: Melissa Martin's Reading List"}, {"userName": "Samantha", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/30749549-samantha", "userReview": "After years of wishing and waiting........AT LAST! My precious!! *said in Gollum voice*UPDATED after reading: NO NO NO NO. Terrible writing I can let slide (it's a play so I would expect the acting to salvage that) but the plot was pointless, the characters were, well, out of character, and it feltHorrible like bad fan fiction....no"}, {"userName": "Mohammed Arabey", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "They're back..One More time..19 years later.In a different style..Harry Potter & The Cursed 8th Book\nDRACO: \nI don’t care what you did or who you saved, you are a constant curse on my family, Harry Potter.\nA 'Play', of friendship, courage & anti-prejudice as before..ANDMarital relations, Father/Son issues.A new Story goes farther than ever..travelling back & forth in time..Then back to where it all began..To close the circle.Once & for all.\nHARRY: \nThe Boy Who Lived. How many people have to die for the Boy Who Lived?\nA Bittersweet ending to The Saga of The Boy Who Lived.Our Friends are different a little bit here than we knew them?YES, I mean who isn't? It's 19 years later.. Are you now as you'd expected would be 10 years ago? Are your real life friends still the same 12, 15 years later?The Story is in Different form & atmosphere? YES., It's a Play..screen play - and not to mention that there's a ‘Definitive Edition’ of the play as it is just the Rehearsal Edition.. Not the Trio story rather the children's? YES. It's story of 19 years later...of the new generation..So STOP Moaning like Myrtle,It's still very faithful to the magical series..A perfect conclusion to the Symmetry* of the Epic series in the History.~~~~~~~~~~Since the Ending of Harry Potter and the Deathly Hallows we wanted more...One more time.Many asking too many \"What If\"..What if Harry's son end up in Slytherin?What if Ron and Hermione didn't work out as the author herself suspects?What if there's a Time Turner left?What if we use it to save someone of Death?What if we use it to save Voldemort? or to make more Horcrux ? Or worst? What if we had One More Book? Nineteenth Years Later?**The Play**--------First of all, Please do a Worldwide tour...Please include Egypt.It's easy to read, and to get into the story..Alas, I have to admit that being in form of ‘play’ and not a novel made it even a bit “dry” like most Fan Fictions., I even thought, after spending a direct 6 hours reading 3 Acts that it may be one and not the real deal -since I read it first in ebook format till my hard copy arrive to Egypt- Anyway, You have to use your imagination to get the scenes...recall your past experience, life in Hogwarts and you'll be easily in...Reliving the MagicAdd to being a play, it's not all by J.K. Rowling, the story is by her, Jack Thorne and John Tiffany together..And the Playwright is by Jack Thorne...not Rowling.Yet the lines are really fun, smart..just amazing.And you have to let go once you start ‘Act Two’ cause everything starts to heat up much..in a very fast packed adventure, and theatrical dramatic ones…The Story--------“Can you Keep the Secret?”Will try my best.~~~~~~~~~~~~~~~It's different... more mature...real wild and dangerous cause it deals with the most dangerous Instruments...TIME..This time you'd feel that Rowling is really cruel to the characters..It may be about the Test of Life....To Choose between what's good and what's easy..BUT it was real hard test to us all..I will merely summing up only Act One..It starts right with the “Harry Potter and the Deathly Hallows” Epilogue scene..Albus Severus Potter is worried sick he'd end up in SlythrineYet.. as soon as he started his year, this was the least of his troubles.Surprisingly befriended with Scorpius Malfoy, surprisingly hates Hogwarts…Surprisingly hates being the child of The Boy Who Lived, while many died in his cause.The Father/Son issue in its worst..And before his fourth year starts..Everything happens fast…Harry as Ministry official and Hermione as Minister for Magic seize an illegal last Time Turner..that even more dangerous..Amos Diggory wants his son back...who had been killed by Voldmort in the Triwizard Tournament more than 20 years ago..Albus feels his father's responsible for this death..An attempt to change a minor misfortune of the past leads into a massive , colossal damage to the present and the future..And even turns into a horrible Dystopia.It's like The Butterfly Effect… Days of Future PastAgain it's a story of the value of Friendship… The wrong of Prejudice... But it's also about Father/Son relation very well written..I loved how it goes, from wrong to kinda right.Between Harry and Albus, Between Dumbledore and Harry…And even between Draco and Scorpius..Also the Marital relation is really good here…I loved Ron and Hermione their opposite character yet their strong bond.And the love that lived...between Harry and Ginny.Oh and Draco and his wife…Okay, time for,The Characters-----------Again... Rowling is really cruel to her characters here..Harry's being a \"Hot Head\" is clearly deepening the problem with his son.. he's always has been a hot head by the way..yet Ginny is a good mother, and better wife than I expected.Hermone was good , not excellent but I LOVED how she turned into two different characters .. one was really awesome in the Dystopia, the second was really bad...but that may match what happened.I just may be didn't like Ron much that I didn't feel angry enough for him being a bit shallow in this play but that still a bit sad.And I have to admit that I really LOVE how Draco is...with his still being have the trace of what he was before...BUT don't forget it's not about Harry Potter anymore...it's more about the Kids...Though I wished to see more of Rose who's been shallow but I just loved Albus and Scorpios..You'll be surprised with who you're gonna meet here.. truly.Some of the Characters we all love makes appearance, some of them even you may never expect to see again!!!! I have to say that I felt goosebumps everytime an old character appears...not just flashbacks, some was in The Future Past, or a real dystopia, some in dreams, even in portraits and some are just mentioned.I really loved it. And wished for even more.I was so sad for the death of some, and the re-death of some..And just remember ... when you're 40.. you don't live the adventures much as your children..And this last story is about them after all....The Children..Who's The Cursed Child-------------------As if I'm gonna tell, ha!Till the mid of the third act you'll have many suspicious.In Harry Potter’s dreams here he can be The Cursed Child...-one of the best haunting scenes in every early novels was always Harry’s dreams, I bet it's purely written by Rowling here-oh and looking from The Dursleys perspective, he is..even worse, he's so in his Son's eyes as well…And that's what triggers everything here.Many surprises, many twists…I loved it… I loved the ending as well…Playing in time is dangerous and as every one since the last book asked about Why Not Using the Time Turner….here's the answer..in the last book of the Series that changed the History forever..Letting Go.------------By the end of this book you'll realize why J.K. Rowling announced that that's it for Harry Potter stories… it is the the full circle… the Beginning meets the End..the time has answered every What-if we can think of.What if we use the time Turner to...It's all here.19 Years for most of us, since the release of Harry Potter and the Philosopher’s Stone in 1997...Reading the story of Harry and his friends in 7 Volumes..Reading as many lines about the back story of them and the rest of characters in the Pottermore and social media by Rowling. Craving for one more time with them...after the Epilogue that passed 19 years.Get excited with the very short article 2 years ago on Dumbledore Army reunited in the Qudditch World Cup.Now here it is, a full story, one last story full of love and nostalgia.We can't go back in time. We shan't dwell in the past..And when I finish it, 2 times, I really admit This is EVERYTHING I've ever wanted in a Harry Potter sequels but I just wish a Time Turner, back to 1997 and start reading Harry Potter all over again.... :)It's not good to dwell in past anyway, so I'm just Happy I lived this series..grown up with it..I, and many of Potterheads and fans, were worried sick it may let us down but I'm so glad that many liked it.And it's bittersweet to know that's it.BUT We must have THE ‘Definitive Edition’ of the play that promised.The series of Harry Potter, the boy who lived,is now complete…And we still have a Wizarding World so vast to explore.With J.K. Rowling, our Queen of Magic.Mohammed ArabeyFrom 31 July 2016To 1 Aug. 2016**“ The Symmetry in case you didn't notice it yet.”And you can really add more similarities to that .This time it's so related to the Heart of the Series,Harry Potter and the Goblet of Fire which is heavily echoes here..If you agree about the symmetrical relation specially between this one and Goblet of Fire, let's discuss it at the comments :)"}, {"userName": "Giuls", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/30513103-giuls", "userReview": "After Reading:1,5 starsNope, that's definitely not what I hoped this book'd have been.Recensione in Italiano:La prima parte della storia non è nemmeno male, poi però tutto inizia ad essere confusonario e, diciamocelo, praticamente senza senso.Nel complesso comunque sarebbe una storia nella media, una storia da 3 stelline, diciamo.Poi uno si rende conto che è di Harry Potter che stiamo parlando e allora mani nei capelli: ma cos’è sta roba?!?Questo libro non ha decisamente nulla a che fare con Harry Potter!L’unica cosa che, più o meno, questa storia ha in comune con i libri è l’inizio: infatti si inizia esattamente dove l’epilogo dell’ultimo libro ci aveva lasciati, ovvero quando Albus Severus Potter arriva al binario 9 e ¾ per prendere per la prima volta il treno per Hogwarts.E lì finiscono le somiglianze con i libri precedenti.E anche con quello che la Rowling ha sempre affermato sui social, ma questo non importa…Per quel che riguarda i personaggi… si salvi chi può!L’unico che si salva è Scorpius: lui è di una specie rara e dev’essere protetto.Albus, il protagonista… Mamma mia che nervoso! Seriamente, qualcuno avrebbe dovuto prenderlo a calci, un sacco di calci in culo un sacco di volte, magari si sarebbe fatto più furbo.Per quel che riguarda Harry… No, io mi rifiuto di anche solo pensare che questo sia Harry. Quest’uomo non ha nulla a che fare con il ragazzo di cui tutti, diciamocelo, ci siamo innamorati ad un certo punto. E non si può nemmeno giustificare con “è diventato un uomo adulto” perché qua si passa dal giorno alla notte, davvero.Nel complesso, comunque, un libro molto deludente, un libro che avremmo proprio potuto evitare di leggere.Spero davvero che la Rowling abbia solo messo il nome, senza nemmeno leggere il libro (anche se pure in quel caso ammetto mi dispiacerebbe sapere come ha venduto la sua creazione), perché non voglio crederci che lei abbia letto e accettato questa “roba”.Before Reading:I've been waiting for this book for something like 10 years.or even better: for my whole life."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "SPOILER FREE VIDEO REVIEW: https://youtu.be/WUFTFkyDHlY2.5* (I think)So here's the deal. I went into this being apprehensive. My expectations were low and I was right. I just felt like Harry Potter's story ended where it had to end. The questions that were left unanswered kept the story alive as I would imagine what might be going on in their lives as adults. This answers all those questions and then some. I wanted to rate this higher but I think 2.5 is as high as I can go. These characters didn't feel like the characters I fell in love with. The story had cringe worthy moments and honestly felt like fan fiction. I think seeing this actually performed would be incredible, but reading it was just, average. Might do a video review so I can go more into depth because I definitely have more to say."}, {"userName": "Emma Giordano", "userReviewDate": "Jun 11, 2016", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "[ When Draco visits Harry at work and they talk about their sons, Astoria's death, and Draco's life, I was a mess. \"It is exceptionally lonely being Draco Malfoy\" hit me SOOO hard. I also love how much Draco loves Astoria and Scorpius. I just thought this scene was so deep and true and I'm forever grateful we got to see it.  (hide spoiler)]"}, {"userName": "Dana Kenedy (Dana and the Books)", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/372001-dana-kenedy-dana-and-the-books", "userReview": "Spoiler free review!This review can also be found on my blog, Dana and the Books.I never thought I'd get to count down the days to another Harry Potter release.I was understandably hesitant about a sequel, but I'm relieved after having read it. It was everything I could have hoped for and not at all what I was expecting - seriously, not at all - but it was perfect.  It was the type of story I play within my head when I have too much time on my hands. I was super lucky to be able to go into the story completely spoiler free and it definitely enhanced the twists and just everything.I'm not going to comment on the plot or characters. I want others who wish to go in blind like I did to have that chance, and I don't want to be the one who spoils it for them.Instead, I'm going to talk about feelings.I remember the sinking sensation I had right after finishing Deathly Hallows for the first time - though that was enhanced by a combination of no sleep (midnight release party) and also being an eighteen-year-old-girl who just had her emotions ripped out and then torn apart by the lovely Ms Rowling. It lasted for days. It was a unique experience to have grown up with Harry and be just a year older than him during the Battle of Hogwarts. The end of Deathly Hallows essentially marked the end of my childhood.Now, I'm a twenty-seven-year-old and those feelings have been ripped to shreds yet again.Post Potter Depression.But it's worth it.Harry Potter has always been the most important book series to me since I first read them in 1999 - I reread the books every year, sometimes more because of reasons - so I'll gladly take the punches Rowling continues to throw at me.Worth it.(Book Depository / Amazon US / Amazon Canada / Amazon UK)"}, {"userName": "Darth J ", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/18974711-darth-j", "userReview": "I need to accio! this book immediately.Sidenote: can time turners go forward into the future?"}, {"userName": "Raeleen Lemay", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "[TIME TRAVEL (hide spoiler)]"}, {"userName": "Ben Alderson", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "Wow! What an experience this was. I loved going back and visiting Hogwarts again.Very enjoyable read. Thank you JK!"}, {"userName": "Brian Yahn", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/22849115-brian-yahn", "userReview": "J.K. Rowling could punch me in the face, and I'd still like it. The truth is, this isn't one of her stories, and it shows. For one, it's not even a book.Regardless, the magic is here, and I like it just the same. The plot might be convoluted and crazy, but the world is magical enough for it to somehow work. It makes for all the thrills and mystery you come to expect from the Harry Potter universe.Coming back to this series felt like returning to school after a long summer break. Although it takes place 19 years later, it seems to pick up right where the originals left off. Dumbledore returns as a moving painting, there's time-turners and polyjuice potion and sneaking around in invisibility cloaks and raids on the Ministry of Magic. It's silly yet serious, and filled with thrills and intrigue, and most of all fun.But more than any of that, the Harry Potter universe is known for its characters, and in this installment, a couple more can now be mentioned with the best. Harry's son, Albus, is an outcast--everything Harry isn't, in a bad way, and the two struggle to relate until Albus becomes so isolated he starts falling down the same path that Voldemort did. And then there's Draco's son, always around, leading Albus down the wrong path, bringing up bad-blood from the past, and helping Albus make monstrous mistakes--all while having a personality that's sure to win you over."}, {"userName": "Natalie Monroe", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "[Harry chooses to stay behind to witness his parents' death and Ron says, \"We'll watch with you.\" That's him; that's the youngest male Weasley to the letter. (hide spoiler)]"}, {"userName": "Beatrice Masaluñga", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/4590441-beatrice-masalu-ga", "userReview": "[having a daughter.....with Bellatrix Lestrange?! (hide spoiler)]"}, {"userName": "Chelsea", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/33481873-chelsea", "userReview": "• review also posted on Wordpress! • Warning: This review contains major spoilers! Don’t read this if you haven’t read the Harry Potter series and Harry Potter and the Cursed Child yet!-------------------------------------If you loved Harry Potter and the Cursed Child, I wouldn’t recommend reading my review. This is going to be a rant! You’ve been warned!-------------------------------------This is the very first time I have rated a book one stars! Believe me, I don’t want to do this, but I really didn’t enjoy reading Cursed Child. Before I get started, I want you to know the following: 1. A couple of weeks ago, I read some spoilers from people who had watched the play. Those immediately lowered my expectations. I knew going into this I wasn’t going to like it. 2. I knew this was not written by J.K. Rowling. 3. I knew this wasn’t the eight book, but the script for the play.I love the Harry Potter series so much. And I always will. It means a lot to me and when I heard about this, I immediately pre-ordered it. I’ve seen some people say ‘it’s Harry Potter so obviously I love this’, but I can’t say the same. Call me critical but I spent money on this. People spend money on tickets to go see the play. I expect something decent in return then.To call this fanfiction is an insult to all the people who try to bring more joy to a fandom. The Cursed Child was just plain bad writing. I will get into detail later, but I refuse to accept what happened as canon. I don’t care what J.K. Rowling says. This is a disgrace to the characters and the people who loved the original book series. You might think that I’m taking this too seriously, but they shouldn’t ask money for this if it were ‘just for fun’. This is literally being promoted as ‘the eight story’ in the Harry Potter series. I knew before I started it that it wasn’t, but the marketing team pretends it is.So no, I won’t apologise for being critical. Just because this isn’t a book, but a play, doesn’t mean that the story shouldn’t be as good. In fact, that is such an insult to plays! It’s just another form of media. I’ve seen some people say: “You can’t judge this if you haven’t seen the play”. Well, if that’s the case, they shouldn’t have published it as a book. I can’t afford going to London and paying a lot of money in order for some people to validate my opinion.Let’s start of with the things I did like:This felt as if I was reading a book. It didn’t take time to adjust to the format. I’m also curious to see what everything is going to look like in the actual play. But, since I really don’t like the actual story and what they did to the characters, I’m not sure yet whether I’d be willing to pay money for that.Out of all the characters, Hermione was the only one who still resembled who she used to be. I’m proud that she has become Minister for Magic! I also really liked Minerva! And Draco proved he was a good parent (much better than Harry…).I enjoyed the interactions between Albus and Scorpius! They’re such good ‘friends’ (A.K.A. boyfriends).That was it. Those were the only thing I like. My list of dislikes is much longer! I had six full pages of notes. When I read a book that’s over a thousand pages long, I don’t even have that many notes! Let’s get started:The plot is basically 90% about trying to bring back Cedric Diggory. I don’t understand why Albus is so obsessed with Cedric. So many people died for Harry, why does it have to be Cedric? Obviously because Amos asked, but to have almost the entire plot of this play resolve around that…I’d rather read every single second of a class taught at Hogwarts! Because this wasn’t magical enough. Sure, it features the characters we know and love and Hogwarts, but we rarely get to see actual magic. When Albus, Delphi and Scorpius are searching for the Time Turner in Hermione’s office, they don’t even try ‘accio’! Instead, they search the entire bookcase! Whenever we do get some magic, it isn’t explained enough. Why couldn’t Delphi use ‘imperio’ on Albus? She said: “to fulfil the prophecy […] Imperio just won’t do”. Why not? Or when Harry transfigured into Voldemort… Is that even possible? Why would wizards go through the trouble of brewing polyjuice potion then? All of this is just very convenient, but didn’t make enough sense.One of the things that bothered me most, was Ron Weasley’s characterisation. He has become a caricature of the person he used to be. The only reason he’s there, is for comic relief. All he does is eat and make stupid jokes. They act as if he’s so dumb and doesn’t take anything serious. Did Thorne actually read the original series before he wrote this? Because this is not the Ron I know! I refuse to believe that he was so drunk at his own wedding he doesn’t remember anything. And why would Ron give someone love potion? He had a terrible experience with it when he was a teenager, why in the world would he do that? It doesn’t make any sense!Another character who was completely butchered was Cedric Diggory. In the alternate universe where he lost the Triwizard Tournament, he becomes a death-eater and kills Neville. Cedric was one of the kindest characters. It’s absurd to assume that he would become a racist murderer just because he got humiliated!Scorpius said: “Cedric was a different person entirely – dark, dangerous”. We only found out that he killed Neville, but Scorpius didn’t interact with him. I don’t understand where this observation comes from. And I had that feeling quite a few times while reading this; as if I had skipped a couple of pages without realising it.Harry Potter is a terrible father. I didn’t like him once in this ‘book’. Granted, Albus is a whiny teenager: he has no idea how privileged he is. Don’t tell me he doesn’t get special treatment because he’s a Potter. A lot of people have it worse than him. Still, Harry had no right to say the things he did. And his excuse? He didn’t have a father figure growing up. He had plenty! What about Arthur, Sirius, Remus, Hagrid and even Dumbledore, Harry?! Harry had no right to attack Minerva either. Just because a woman doesn’t have children, doesn’t mean she isn’t able to take care of them. She’d be a much better parent than he ever was.And when did he become a psychic? His scar hurts, he actually hears Voldemort’s voice and can speak Parseltongue again, but Delphi hadn’t even saved Voldemort yet (actually, she never does). How is he able to do that if nothing has changed? Voldemort wasn’t back, yet he acted as if he was? Once again, I just don’t understand…Also, what is up with Lily’s blanket? I don’t remember him ever talking about it in the books, yet now Harry pretends as if it’s his most precious possession in the entire world. I know he didn’t possess it in the other books, but it’s still strange that he’s so obsessed with it now.Oh, and the special privileges? Harry is at Hogwarts all the damn time! I don’t remember parents being allowed there. I guess being a Potter does mean you’re allowed to do more than others.A lot of people hate Severus Snape and don’t see him as a brave person. While I don’t feel as strongly about that as them, I completely understand why they feel that was. He was horrible to his pupils, particularly Hermione, Harry and Neville. But, in the alternative universe, Hermione and Ron secretly work together with him. He used to be so mean to them, it seems highly unlikely to me they would forgive him! Just because he didn’t turn out to be a death-eater, doesn’t mean it justifies his behaviour. Snape’s interactions with Scorpius were so cringe-worthy. He isn’t a nice guy who makes one or two jokes and he’d never talk that openly about Lily.Because so many characters felt differently, I didn’t care about them anymore. When Hermione and Ron sacrificed themselves and received the dementor’s kiss, I felt nothing. On the one hand, I’m sad we didn’t get to see Sirius, Remus, Tonks an Teddy. But on the other hand, I’m very glad, since their characters would have been butchered as well!This book almost pretends as if the other Potter and Granger-Weasley kids don’t exist. Ever heard of Hugo???The timeline is so strange. Page 22 and a year has past. Page 27 and they’re already starting their third year at Hogwarts. Seven pages later, another year has past! Surely, they could have given us a glimpse at their lives at Hogwarts without having to do it like this. Later on, Scorpius and Albus are in Scotland, without any brooms or wands. Yet the very next page, they’re already in Godric’s Hollow! How is that even possible? Again, this is not explained.And how did Albus and Scorpius know every single detail from what went down over twenty years ago at the Triwizard Tournament and Battle of Hogwarts? Did their parents tell them literally everything? Were very detailed books written? I need to know this!In the alternate universe, they kept mentioning an ‘Augurey’ and I had no idea what it meant. It’s only explained many scenes later. I cannot stress enough how underdeveloped some plots were. Sometimes, I had no idea what was going on because things weren’t explained well enough. And that causes plot holes.I’m so thankful they didn’t use the Time Turner often in the Harry Potter series. I can already imagine how how things would have ended otherwise: Harry would have gone back in time and kill Voldemort and save James and Lily. Whenever a universe has the ability to time travel, that’s the kind of things that happen. It’s predictable. Yet that’s exactly what Harry Potter and the Cursed Child is about. They go back in time over FOUR TIMES just to go back to how things were at the beginning of the play. It’s such a waste of time. I can think of so many plots that would have been more interesting. Imagine there’s ever going to be a F.R.I.E.N.D.S movie and it turns out Monica has left Chandler and never wants to see her children again. That wouldn’t make any sense at all. But that is how Cursed Child feels like to me.Prisoner of Azkaban is one of my favourite books an films, so I obviously have no problems with time travelling. But this was just too much.As I’ve mentioned before, I really missed the magic. And of course the characters, because Cursed Child completely butchered them. Think of how much better this would be if it was about one school year at Hogwarts, without Voldemort trying to kill everyone. Just one year of the adventures Scorpius and Albus encounter. There didn’t need to be this much family drama. Honestly, I’m pretty sure this was the script of a Days of Our Lives or The Bold and the Beautiful episode instead! Just think how they could have explored the other houses, besides Gryffindor! But no, in Cursed Child, everyone is still prejudiced towards Slytherins and they pretend Ravenclaw and Hufflepuff don’t even exist!This is only about three hundred pages long, yet it was so repetitive. Scorpius and Albus do something stupid; Draco, Harry and Ginny run after them and need Hermione because “their children are missing!” AGAIN!I also had some problems with the writing itself: Voldemort Day? ‘Oh Potter’ instead of ‘Oh Shit’? Mudbloods in the dungeons? The Blood Ball? WE GET IT, VOLDEMORT IS BACK! “A Malfoy who may be a Voldemort” Euhm, that’s just awful writing. ‘Voldemort’ isn’t a last name; it’s not as if ‘Lord’ was his first name. It should have been ‘Riddle’ instead. ‘Thank Dumbledore’ instead of ‘Thank God’ is not only cheesy, it is also incredibly arrogant. I’m not the most religious person but to say that Dumbledore is a God… It’s so sexist that at the Triwizard Tournament, every school got a lot of cheers besides Beauxbatons! I know boys also attend it, but it’s still more ‘feminine’ than Durmstrang or Hogwarts.Almost everyone who has read this, can’t deny there is something going on between Albus and Scorpius. They are so gay! But of course, this book is heteronormative to the max! I can already hear J.K. Rowling in a couple of years: “Actually, they were dating, but it wasn’t important to the story”. Please don’t give this woman any praise when it comes to diversity, she doesn’t deserve it. The Cursed Child could have meant a great deal more if they weren’t so afraid to include characters who aren’t straight for a change. And don’t even get me started on Albus’ crush on Delphi. He’s like fourteen and she was twenty? That’s disgusting.Which brings me to Delphi, the daughter of Voldemort and Bellatrix. Do you really expect me to believe that Voldemort was capable of love and lust? Why do they feel the need to establish that every character is ‘oh so straight’?! Supposedly, Bellatrix gave birth to Delphi before the Battle of Hogwarts in Malfoy Manor. WHAT?! In Harry Potter and the Deadly Hallows, we actually see her there! Don’t you think anyone would have noticed? DRACO ACTUALLY LIVED THERE! How oblivious is he supposed to be then? This doesn’t make any sense!I could go on, but I think I’ve made my point. There were so many things that bothered me and I don’t ever want to read this again. I regret paying this much money for it. I refuse to accept this as canon. I will pretend this doesn’t exist."}, {"userName": "Jen Campbell", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/6492118-jen-campbell", "userReview": "Lol."}, {"userName": "Taneika", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/5591031-taneika", "userReview": "Just going to keep my original pre-review here BC MY FEELINGS ARE THE SAME Although I do have some negative thoughts about it which I'll go into more detail with later, REGARDLESS, I finished this in one sitting and thought it was like, 95% fab"}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "I HAVE A LOT OF FEELINGS.Here's my vlog of the launch party and my initial thoughts after reading! https://www.youtube.com/watch?v=sqwyq..."}], "description": "Based on an original new story by J.K. Rowling, Jack Thorne and John Tiffany, a new play by Jack Thorne, Harry Potter and the Cursed Child is the eighth story in the Harry Potter series and the first official Harry Potter story to be presented on stage. The play will receive its world premiere in London’s West End on July 30, 2016.It was always difficult being Harry Potter and it isn’t much easier now that he is an overworked employee of the Ministry of Magic, a husband and father of three school-age children.While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places.", "title": "Harry Potter and the Cursed Child, Parts 1 & 2\n      \n          (Harry Potter #8)", "url": "http://www.goodreads.com/book/show/29069989-harry-potter-and-the-cursed-child-parts-1-2", "average": 3.71, "cover": "https://images.gr-assets.com/books/1470734340l/29069989.jpg", "reviews": 57802, "authors": [{"url": "https://www.goodreads.com/author/show/5042201.John_Tiffany", "name": "John Tiffany"}, {"url": "https://www.goodreads.com/author/show/1077326.J_K_Rowling", "name": "J.K. Rowling"}, {"url": "https://www.goodreads.com/author/show/3439408.Jack_Thorne", "name": "Jack Thorne"}], "type": ["Fantasy", "Fiction", "Young Adult", "Plays"], "outlinks": ["http://www.goodreads.com/book/show/29069989-harry-potter-and-the-cursed-child-parts-1-2", "http://www.goodreads.com/book/show/29056083-harry-potter-and-the-cursed-child---parts-one-and-two", "http://www.goodreads.com/book/show/29058155-harry-potter-and-the-cursed-child", "http://www.goodreads.com/book/show/31314242-harry-potter-and-the-cursed-child---parts-i-ii", "http://www.goodreads.com/book/show/12039980-eleanor-lambert", "http://www.goodreads.com/book/show/21033928-a-short-history-of-the-balfour-declaration", "http://www.goodreads.com/book/show/20994420-fountain-of-fairytales", "http://www.goodreads.com/book/show/33361579-the-devil-s-handiwork", "http://www.goodreads.com/book/show/29508409-dishonesty", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}