{"ratings": 64382, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "I picked up this book in the library and one of the things I noticed first about the book was that the edges of the pages have become soft from the hands and fingers of hundreds of readers. The book has been rebound in one of those lovely flat blue library covers. In the back Marsha left her phone number on a yellow sticky note which I have suspicions might be for a support group for those that have started and failed to finish reading Hawaii. 937 pages later I can say that this book is a two star book, a three star book and a four star book. I'm always generous so I decided to bump to three star because there were sections that were really fascinating to read. The book is broken up into 6 sections with each section dealing with a new generation or a new half generation with cross over characters from the previous books. I'm sure a good editor today could slice and cut this book down to 600 pages without losing too much of the intent of the writer.I read somewhere that this book has done more for Hawaiian tourism than any other book published about Hawaii. Published in 1959 and read by my mother, and most of my aunts, and some uncles I would say it probably did contribute to a lifelong longing for my mother to vacation in Hawaii. The power of the pen. \nThe part that I enjoyed the most was the hard work and entrepreneurship that Michener explored with the white missionaries, the influx of Chinese workers, and later the arrival of the Japanese. Each group contributed to major changes in how affairs are conducted on the island. Really Hawaii was a microcosm of capitalism working the way it is suppose to. \nMichener is best described as a storyteller. Sometimes I felt he might be trying too hard to be a modern day Dickens. His writing doesn't have the snap and pop of what I consider to be a great writer. I try to always include a few passages from a book I read to share with goodreads readers so they can get a feel for the writer's writing style, but in this case the notes I made to check back on passages were too bland to get me excited about building a review around them.I might have given Michener four stars except for the fact that checking with a travel writer, that I respect, I was told that there are simply too many inaccuracies with the historic data of Michener's books. I understand that it is fiction, but I do expect historical writers to adhere to some rules. I love historic novels because I feel they can put flesh on the bones of real people and produce conversations and dialogue that could legitimately have happened. What I don't like is if they take a historical event and manipulate aspects so much that the reader is left with a totally unrealistic view of history. An exception of course is alternative history where I expect the writer to completely change the outcome of history, a good example is Fatherland by Robert Harris.I have put a Shoal of Time: a History of the Hawaiian Islands by Gavan Dawes in my queue to read so that I can hopefully be exposed to a more historical accurate version of Hawaii. I may find that I can live with whatever changes to history that Michener wrote into his book. Do I recommend this book? I can't say that I would. If I'm looking for a monster of a book that I can spend some real time with again I'm pulling Moby-Dick off the shelves. A story that never gets old, and a book that new things are discovered with each reading."}, {"userName": "Beth", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/10556904-beth", "userReview": "My 10th grade reading teacher \"Mrs. Fine\" introduced me to this very large book. I only took her class \"Hooked on Books\" because I thought it was and easy A. Read several books, do book reports, get a grade. Hawaii was the first book she chose for me. I read the 1st 50 pages... no dialouge, just info about how the island was formed by volcanos. I went back to complain that it was boring, she encouraged me to keep reading... next 50 pages, just as boring, natives from other lands discovering Hawaii and coming it... still very little dialogue. Again I complained to the teacher... she encouraged me to read just a little bit more. I did... then BAM!!! The story exploded! People came to life, exciting interaction. Easily became one of my favorite books of all time. So very thankful for Ms. Fine that taught HOOKED ON BOOKS at East Brunswick High School, in East Bruns., NJ in 1973. She introduced me to several other great books during that semester - The Great Gatsby, A Tree Grows in Brooklyn, and others... and made me a reader, but more than that a LOVER of books. I wish I could thank her face to face.You changed my life Ms. Fine. I'm forever grateful!Beth Holtz McKinney"}, {"userName": "Duane", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Hawaii was the first Michener novel I read, more because of my interest in Hawaii the place than in the novel or writer. Having been lucky enough to travel there several times in my life, I've been fascinated in the history and culture. Michener, for those of you not familiar with his writing, was fanatical about detail. His histories start with the dawn of man, or in this case the rising of lava out of the depths of the ocean, and proceed on to present day, with interesting fictional stories laced in to entertain you. He was a master of the historical novel and accurate to the point that they are excellent for reading enjoyment as well as learning."}, {"userName": "Mohsin Maqbool", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/3332742-mohsin-maqbool", "userReview": "\"Hawaii\" book cover best suited for \"West Wind to Hawaii\".ON April 1 and 2 I read James A. Michener’s West Wind to Hawaii and loved it immensely. Actually, I read it in a volume of Reader's Digest Condensed Books whose editors have taken the liberty of describing the story of only the first generation of a Polynesian tribe that leaves the island of Bora Bora heading off for the North on a canoe named \"West Wind to Hawaii\" in search of Havaiki -- which probably became Hawaii with the passage of time.James Michener and his wife, Mari, at home with their formidable art collection. By the way, Hawaii for Mr Michener was just not a literary interest, it was also his home. He and his Japanese wife lived in a house given to them by a group of Hawaiians -- in the hope that he would write the story of their people. With his epic Hawaii he did exactly that, writing about the stories of five or six generations of the island's original settlers. Of course, he mixed it with spicy tit-bits of fiction.\"The author did much through his writing, through his travels, and in his personal life to foster sympathetic understanding between the West and the people of the Orient.\"The beautiful Jocelyne LaGarde was a Tahitian who became famous for her one acting role in the 1966 motion picture, Hawaii. Sixty Bora Bora islanders, including their King Tamatoa, his younger brother Teroro and their sister Natabu, set off on their perilous journey via sea with food, supplies and a house for their rock gods. Constellations help them in finding their way. Once they almost run out of food and water, so a storm with heavy rain helps them in quenching their thirst. Thus, they are provided a new life. “On the long voyage spirited Teroro put together the rough chant that would be remembered in the islands for generations after his death and which served to guide subsequent canoes from Tahiti to the new Havaiki:Wait for the west wind, wait for the west wind!Then sail to Nuku Hiva of the dark baysTo find the constant star.Hold to it, hold to itTill wild Ta’aroa sends the winds.Then speed to the clouds where Pere waits.Watch for her flames, the flames of Pere,Till great Tane brings the land, Brings Havaiki-of-the-NorthSleeping beneath the Little Eyes.” Ta’aroa and Tane are the names of two rock gods while Pere is the name of a volcano rock goddess. Little Eyes is the name of a constellation of three stars which help in locating Havaiki.James Michener, with a painting of himself, at his home in Pennsylvania in 1962. At the time he was running for the United States Congress. Tamatoa and Teroro's aunt Teura can predict the future with the help of omens. Mano, the great blue shark, also comes to her aid. She can converse with it and find the right course to their destination. The islanders surely had some strange customs which with the coming of the missionaries a century or more later became taboo. \"The woman with whom the king lay was his sister. It had been believed since ancient times in the islands that for a king to breed an heir who would combine the finest lineage and utmost sanctity he must mate only with his full-blood sister; although both Tamatoa and Natabu might also take other spouses, their principal obligation was the production of royal descendants.\" On May 12, 2008 a 59 definitive stamp was issued to honour James Michener as part of the Distinguished Americans series...printed in small panes of 20.One film equals one Oscar nomination for the French (Tahitian) Jocelyne LaGarde."}, {"userName": "Michael Finocchiaro", "userReviewDate": "Jul 16, 2016", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "As in all of Michener's books, this is a sweeping story of the history of Hawai'i from the precolonial period until today. The characters are a bit two-dimensional but the story is still fascinating and it makes you want to fly to Honolulu, sweep away the hordes of Japanese tourists and try to imagine it without all the horrid hotels littering the littoral towards Diamond Head."}, {"userName": "Rhiannon Lawrence", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/898736-rhiannon-lawrence", "userReview": "I needed a bottle of wine and some stimulants to get through this one, and I'm Hawaiian! The opening is enthralling but skip the entire middle section. I couldn't get past the missionary section and had to keep a barf bucket close by... I loved the rest."}, {"userName": "John", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/184521-john", "userReview": "This was a great book, but it had my eternal problem with Michener. The modern stuff is just so much more boring than the older stuff, and it goes off on ridiculous tangents that go nowhere. It is especially frustrating here, because the core story is wonderful. Each chapter, of the first four, is great, the first deals with the Polynesians, then the Missionaries, then the Chinese, then Japanese. Each focuses primarily on one family, with other characters woven in, and he has such a knack for creating people. It's easy to get caught up in these people and their lives. And it's admirable how fair he is with each ethnic group, he treats each one equally, doesn't claim that anyone is perfect, everyone has their faults, and their skills, and each is a vital part of the big picture. But once he gets to the end, and people have to start representing things, he loses it. All of a sudden characters appear out of nowhere to illuminate something supposedly profound, and then, whoops, there was a tidal wave and that one dies. No harm, no foul, the important character got to have some soul searching and then he and the readers conveniently don't have to deal with this extra character. The worst is an extended digression in which an old patrician white character learns valuable lessons (about something...sex? women? cooking with coconuts?) by sleeping with a 15 year old Polynesian girl. She's happy about it all though, because he's a good dancer and because he needs to learn...things. And then Michener waits until the very end of the book to spring this incredible groaner of a surprise, where we learn that this book has been narrarated by one of the main characters, even though this was never even hinted at before, and even though this ruins the attitude that each primary family is to be taken as equal to the others. Bah! I'm sure he was delighted with his little literary trick and excited by the equally crummy fake nararration that he gave to \"Centennial\" later. Boy, I wish this guy hadn't won a pulitzer for his first book, because I'll bet he never had to listen to an editor again, and it would have helped. However, I stand by the four stars. 90% of the time, the book is terrific."}, {"userName": "Tony61", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/5410681-tony61", "userReview": "I had never read any Michener before but having just returned from a vacation to Kona I was interested in how the islands first got populated. Several articles I read referred to James Michener as a careful historian of Hawaii and since this book is considered one of his best, I borrowed it from the library. The book is beastly long-- 1000 pages-- but is actually a collection of four separate stories that stretch from the geological formation of Hawaii up through the attainment of statehood in 1959. The first chapters describe the geological birth of the Hawaiian Islands from oceanic volcanoes and the subsequent introduction of flora and fauna over millennia via migratory frigate birds and ocean currents. His account is fascinating, well-written and consistent with bio geographic works such as David Quammen's Song of the Dodo. Michener then fictionalizes the immigration of a band of outcasts from Bora Bora near Tahiti who travel the thousands of miles along the Trade Winds around 800 CE in order to escape political turmoil. The story hews to accepted anthropological dicta about aboriginal settlers to the islands and has earned Michener accolades from scholars.The book jumps ahead to the 1800's and the introduction of Christian missionaries as well as whalers and other merchants plying the Pacific rim. The interaction of these groups with the island natives has been memorialized in movies based on this novel, which was in turn based on an actual missionary. The fictionalized history is well-done, showing the complex relationships of the indigenous people with the foreigners, the mutual respect and conflicts are believable and entertaining.Michener is a top notch writer and this book is worth reading even 30 years after its original publication."}, {"userName": "Aloke", "userReviewDate": "Aug 16, 2014", "userURL": "http://www.goodreads.com/user/show/23857545-aloke", "userReview": "This is the first Michener book I've read and I found it to be quite unique. It's a pretty huge book but reads quickly. Despite being fictional it feels like non-fiction and sent me to Wikipedia countless times looking for real life equivalents of the characters and events. The author's ideas and world view come through pretty strongly especially since large chunks of the story are told by an omniscient narrator. It was also a bit jarring, but probably accurate, to see how racist many of the characters were. I found the first three sections to be quite riveting. But I bogged down a bit in the fourth section and from then on felt a sense of déjà vu as endless missionary descendants took advantage of successive waves of immigrants. It's probably a good book to read if you are interested in Hawaiian history if not for accuracy but more to give a broad brush idea of the players and to send you on to more authoritative sources. Also reading it after leaving Hawaii (you might be hard pressed to finish it during your visit) is a cheap and effective way of virtually extending your vacation."}, {"userName": "Pamela", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/1094650-pamela", "userReview": "They should put a photo of this book in the dictionary beside the definition of epic because epic it is. Covering the history of hawaii and even the prehistory, Michener covers every aspect of what shaped the tropical islands from volcanoes to war to the myriad people who lived there. Michener humanizes his history by telling the stories of individuals and their families, their ambitions, and their reactions to the changing world. While it is a very long book, I would highly recommend it. Think of it as a series and dive in!"}, {"userName": "Michael", "userReviewDate": "Aug 31, 2008", "userURL": "http://www.goodreads.com/user/show/1095647-michael", "userReview": "Reading this was a monumental task: I started it on the plane to Hawaii in mid August and finished it on October 1st!!I nearly didn't make it through the first chapter about the formation of the islands, but I'm glad I persevered. Michener takes us from Tahiti (Bora Bora) to the arrival of the missionaries, the Chinese, and the Japanese. There are a number of marvelous characters (Char Nyuk Tsin is my favorite) and set pieces. Michener is especially good at moments of high tension, which are amplified by his rather laconic, understated style. I was particularly moved by his descriptions of the four Sakagawa brothers at war. There are many scenes and relationships between characters that will remain with me: the throwing of the \"god\" into the sea by the Bora Borans, the voyage of the missionaries round the Cape, the death of Malama, Abner Hale's relationship with Jerusha, and Kee Mun Ki's with Char Nyuk Tsin; the leper colony at Molokai, \"Wild Whip\" Hoxworth and the growing of pineapples on Kauai, the picture brides from Japan and the \"swap\" between Kamejiro and Ishii... So much good stuff. His commentary on the coexistence/rivalry between the ethnic groups in Hawaii was also profound. I was a little disappointed in the ending, when the identity of the narrator was revealed... but all in all it was a great (though long) read and well worth the 6-plus weeks of my life"}, {"userName": "Elizabeth", "userReviewDate": "Nov 21, 2009", "userURL": "http://www.goodreads.com/user/show/2967048-elizabeth", "userReview": "I've never read any of Michener's work and now, at the end of this 1130 page, ultra-fine print book, I feel as if I just run a marathon, but, my feet don't hurt. I've invested 3 weeks of my life with this book and I'm so glad I did. I enjoyed it and I'm so glad I read it after visiting Hawaii. What I kept thinking while reading it, though, was this man wrote dozens of books this long, with this much research. How in the heck did he do it? This book got right to the heart of many of the questions I had about the islands and the people that lived there. It explained so much about the history of the island and finally got me to understand why the people are so unique. When we were there, I didn't feel like I was part of the United States at all. I felt like I was in a foreign country with just a hint of America thrown in. This was a great read, but it's an endurance read, not a vacation book. I definitely have to read something relatively fluffy next.On a side note, I bought about a dozen Michener books at the request of my mom at a library sale. You can't go wrong paying $3 for a huge shopping bag of books, but perhaps there was a reason that the Michener books were all still there!"}, {"userName": "David (דוד) ", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/5431286-david", "userReview": "An intensely lonnn.....ng but beautiful read, this one ! :) :)Six chapters, that have their own throughput.From the Boundless Deep, is such a well-put story of the process of how the geological forces through their temporally long ages brought forth into being the beautiful islands that would be later called as 'Hawaii'. :)From the Sun-Swept Lagoon, is the story of the people of the Polynesian Islands, their fights, their gods, their ideas, and how they (from the island of Bora Bora) eventually became the first to inhabit the Hawaiian islands.From the Farm of Bitterness, speaks about the intrusive oncomings of the Christian missionaries in the early 1800s, and how they later play their part in transforming the Hawaiian's 'old' ideas into 'new'. The sea-voyage of the ten missionaries to Hawaii from Boston, around Cape Horn (the southern tip of South America) was a very interesting part indeed.From the Starving Village, describes the continuing transformation of the Hawaiian society, but now with the influx of immigrating Chinese from their starving villages of their homeland, to work on the pineapple and sugar plantations. Contains quiet a few pages dedicated to the effect on the society after leprosy reached the islands, and its related happenings on the island leper colony of Molokai. This was scary, sad, and extremely touching. But so much worth reading and knowing, and understanding what people have gone through. That is the best part of a historical-fiction over typical history non-fiction.From the Inland Sea, covers the Japanese immigrants on the Hawaii Islands, and how they are set to replace the Chinese Workers. Also contains the bombing of the Pearl Harbour, and how the Japanese on the islands fight for America in the Second World War in Europe.The Golden Men, deals with how the commingling of various peoples in Hawaii in the past, have produced something called as 'The Golden Man', someone who now has a different way of thinking than his progenitors. Four such Golden Men have been described in this chapter, narrated from a POV of one of them. This chapter also covers the changes that are brought about in the culture, economics, and politics of the society of Hawaii, mainly brought about by intermarriages between groups.Overall, I loved the book, but certain places became slightly boring. However this was due to monotony and my personal interest of matters laid within the scope of the book. Michener's writing style, is no doubt, smooth, rich, vivid, sweeping, and terrific! Covers several areas: Geological, Sea-Voyages, Shamanism, Christianity, Migrations, Feudalism, Democracy, Poverty, Disease, Suffering, Progressiveness, Economics, Politics, War, Marital Bondings and Familial Lives, etc. Based upon all of this, 5-stars to the first four chapters (the first 2/3 of the book) and 4-stars to the final two chapters (the final 1/3rd of the book).If compared, although I am a hundred percent satisfied with \"Hawaii\", as far as enjoyment goes, Alaska and The Source are the titles which I enjoyed quite more than this one. :)\"Hawaii\" was Michener's first epic writing of extravagant length, and for a start at that time, I would say it deserves a Big Thumbs-Up !! :D"}, {"userName": "Jan", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/8507674-jan", "userReview": "This was my second Michener. I read \"Alaska\" last spring in preparation for traveling through that state. That book provided me with not facts but with a sort of historical frame of reference--from early pre-history to state-hood--through which to view the place and the people. I wanted the same for my trip to Hawaii. While I feel reluctant to dedicate myself to 1,000 pages because it precludes dipping into other books for the duration, this book provided quite compelling reading. (I needed to read it in ten days to get it back to the library by due date, and I was able to do that without too much struggle.) I like crossing decades and centuries and finding the offspring of the original protagonists and antagonists in new circumstances, situations, and dilemmas. Above all, I am amazed at Michener's ability to tell many great tales virtually in summary form in order to fit it all in to \"only\" 1,000 pages. I highly recommend this book which is, in the end, primarily about the sociology of economics. (Who knew?)"}, {"userName": "Blaine DeSantis", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/2994598-blaine-desantis", "userReview": "Probably a 4.5**** for me. Written back in 1954, Hawaii is Michener's 2nd novel but his historical fiction formula is already set. We take thousands of years of natural history to set the scene, and then we move through the years with a cast of characters and their families. It is there book after book and it never gets old, it never gets dull and it is always both entertaining and educational as I learn a lot about aspects of history and society in each of his books.Here his style is still the same, but he segments every chapter (there are only 6), and in this way even though we focus on the different peoples who have come to help develop Hawaii they are always blended with the older characters or their families we read about earlier. We have the Tahitians arriving to settle Hawaii, then the Missionaries, the Chinese, Japanese and then the Golden Children (the blending of all races and nationalities). His research is impeccable and his story is both true and what makes him, for me, the best historical fiction author is that his observations and intimations of where the characters and societies are heading are almost always accurate even 60+ years after he wrote this novel. It is seen over and over again in all his works.James Michener is just a marvelous author, and you know that when you start one of his epic novels you are looking at 900+ pages of reading. But none are wasted or throwaway pages, none are surplus pages written to hit a page requirement. Each and every word and observation is structured in such a way that we truly get the flavor of the islands or any other area he writes about.Yes, all these years after his death he still is The Godfather of Historical Fiction!"}, {"userName": "Alice", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/7752067-alice", "userReview": "James A. Michener is a master storyteller if I've ever come across one; he is truly in a league of his own. (But then again, I don't normally read from cover to cover books longer than 500 pages, let alone 900, so who am I to say?) My God, what a book!He began his story with the volcanic activity that formed the landmass that became Hawaii, and three pages in, it was already becoming obvious why this book was so damn long. But then again, who's ever described the formation of islands as a consummated marriage between two great underwater volcanoes?! It typifies the marathon-like experience that is this book; the narrator is kind of like a fellow I'd just want to have a quick chat with, only to find that this dude can talk for hours, but is redeemably rather interesting. The book is about the land of Hawaii, spanning from its beginning as an austere volcanic landmass to being the lush tropical islands cultivated by the ancient Polynesian voyagers, upon which the first Boston missionaries lived and died and for better and for worse forever interrupted their society (and, of course, the land), and upon which the modern-day ethnically diverse society takes shape. The story is thus divided into those three periods: the start of the ancient Hawaiian civilization, the first missionaries and their attempts to cultivate an Americanized Christian society, and the story of the Asian/Pacific Islander immigrants that are brought in to work the businesses of the established children of missionaries.The emotional heart of the story seems accurate (at least, from my vantage point as a malihini), but make no mistake, this is NOT a history book. (Or, it is as much of a history book as is the book \"Roots\" by Alex Haley.) And really, it is narrated from the viewpoint of one of the characters (which one might not realize until the end... unless one peeked at the last page as I did), thereby making more forgiveable whatever flawed third-party opinion might have gotten written into it. The author speaks to you as an adult, masterfully traveling through the pages of history to get at the heart of why things might be the way they are.Perhaps I personally felt drawn to the characters, the society, and the sad turns of history because as a student of hula (haumana o' na hula, as it were), one cannot learn the dances and chants without also learning about the struggles and beauty of past and present-day Hawaii and its people. And this is what I appreciated most about the book: it was a flesh-and-blood depiction of how people can stumble into good and bad decisions that affect society and progeny in a way they might never understand. This explains how a native people could find themselves stuck with the short end of the stick, how newcomers with good intentions can irrevocably harm a nation (and help, to be fair), and how the Asian-Americans (of which I am one) came to navigate their new society and grow into the dual cultures. Even in the 21st century, I still find so much that is apt to current events (culturally, economically, politically, socially); it truly is the case that there is nothing new under the sun. And yet it is all so interesting, because that is the human story.Bravo, bravo!!"}, {"userName": "Sian Jones", "userReviewDate": "Jan 13, 2016", "userURL": "http://www.goodreads.com/user/show/63264-sian-jones", "userReview": "If someone had handed me this book and said, Here's a weird cult novel from the 1950s, I would have believed them. But instead this one comes to me with the full recommendation of long-lived American best seller. A best seller for years! Structurally alone, the book is an anomaly, divided into three-hundred page \"chapters\" -- each of which changes dramatically in tone and focus. The first chapter reads like a scifi novella about the formation of the Hawaiian islands; I kept waiting for a space ship to land. The second chapter is about the first Hawaiians landing on the island, and whether it embodies the mythology of the native Hawaiians themselves or the mythology non-native Hawaiians have about native Hawaiians I cannot say. Both probably? The next chapter reads like literary fiction, describing the American missionaries' arrival in both celebratory and condemnatory terms. It is violent and spikey and devout and wistful and really quite moving. The next chapters read like mid-century popular reporting chock full of racist, Orientalist distortions that it might or might not be trying to undercut. Then there's a World War II interlude, straight from hell, with the Japanese Hawaiian troops dying in the European crucible to prove they're American enough. Then the final chapter paints the declining haoles of the 1950s as bluff, machinating, inbred idiots who revere figures from the past that the earlier chapters have shown were monsters. And then in its final moments, the book reveals that it's being written in the first-person by one of those very damned haoles. The narrator gets revealed on the LAST LINE. I'm saying it's odd and misshapen and intermittently deeply effective and other times ludicrous and infuriating. The only people who don't come out, in Michener's estimation, as horrifyingly hopeless bigots are the native Hawaiians, who for that very reason are dying out in a brutal world. On top of everything, all of it is deeply, deeply fictional -- characters live in completely different centuries than the historical figures on which they were allegedly based, for example -- but it is marketed and discussed as if it were *nonfiction*. I'm saying it's a challenging, complicated book, and I was expecting straightforward historical drama; I was expecting dull. It's both better and worse for being its eccentric, problematic self. Better because if you're going to challenge the way people read popular history, it's not half-bad, but worse because I'm not sure most folks reading it, based on its reputation and packaging, would respond with explication rather than just acceptance. I don't even know. But I'm glad I read it. Fiction with a capital F."}, {"userName": "Joy H.", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/1259216-joy-h", "userReview": "Added 2/17/17. (first published 1959) 2/17/17 - I read this a long time ago. I remember liking it very much. It really drew me in and, after all these years, I still remember it as a good book. So I'm giving it 5 stars."}, {"userName": "Renata", "userReviewDate": "Jun 19, 2014", "userURL": "http://www.goodreads.com/user/show/697616-renata", "userReview": "Read this decades ago and yet recall the book like it was yesterday. What a masterful storyteller Michener is. I used to joke about each book starting at the beginning of time, but he has an amazing way of making the reader care and then developing interesting characters to relate fascinating histories. I'll reread them all when I retire."}, {"userName": "Chris ", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/1956959-chris", "userReview": "[God (hide spoiler)]"}, {"userName": "Darlene", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/3121375-darlene", "userReview": "I cannot believe I've just got around to reading my first Michener! After I get done kicking myself,I'm going to pick out another one. He's a fabulous storyteller!"}, {"userName": "Nicole D.", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/18822136-nicole-d", "userReview": "Join me in my victory lap! 51 hours of audio, of which about 25% was focused on Abner Hale, a horrible prejudiced missionary. I took a break for several months, and it's good that I did because I might not have been able to finish.This book is a very comprehensive history of Hawaii from the first Polynesian settlers through to the mid-1950's. As with many places in the world, the Christians decided that everybody needs to be Christian so they sent their people to Hawaii and proceeded to take all the land, alienate the indigenous people and find a way to make all the money. (Good old colonialism.) It was interesting to learn how the Chinese and Japanese were brought to Hawaii to work in the fields, and there were a number of different story lines branching off from those people. My favorite was the story of Char Nyuk Tsin - a Chinese woman who built a legacy of land and family in Hawaii and did quite well for herself. Though I can find her name and the name of her husband online, I can't tell if her story was true. Seems not, which is sad because she was bad ass. Many other characters appeared to be based on real people i.e. Hale.After we got through the Abner Hale part, the story was really fascinating. Up to and including all the politics surrounding Hawaii's bid for statehood. As I notice with every book I read which has anything political in it, the core of politics seems to be ... a bunch of rich people who don't want the the poor people to cut into their profits. Same stuff, different era.I wish I had read/heard Michener's Poland before I went there. Didn't even think of it. I will definitely be reading more of his books. I just hope others aren't so heavy on the religion, which is ultimately what knocked this down a notch for me."}, {"userName": "Natasha", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/1195067-natasha", "userReview": "There's history and then there's H-I - S - T - O - R - Y that spans the geologic and sociological timelines. This book covers both. I liked it well enough that it launched me into an enjoyable journey around the world, reading as many of Michener's historical-fiction novels as I could find on audio. Michener lays the groundwork of giving you the significance of place and how the setting impacts the settlers. His stories span generations, from the both the perspective of native cultures (sometimes including the animals) and \"transplants.\" Some market their wares or beliefs, some exploit resources. Nearly all of Michener's characters are genuine enough to gain our sympathies. It is instructive in the best sort of way because the reader gains a better understanding of varied cultures in the broad spectrum and of him/herself in the \"what's universal is personal\" analysis."}, {"userName": "Mary Sue", "userReviewDate": "Aug 11, 2008", "userURL": "http://www.goodreads.com/user/show/220116-mary-sue", "userReview": "I first read this novel in the 1970's. I became very interested in our 50th state and have traveled there several times since. If you have seen the movie, trust me you need to read the book. Michner likes to take the way-back machine all the way to the formation of the islands, then the arrival of flora and fauna and eventually to the arrival of the original Hawaiian's from Bora Bora. The strong parts of the book are the conflict of cultures as new groups arrive. Melting pot is a lovely concept, but it didn't come about easily and I suspect it never will.I reread this giant of a book in preperation of our seventh trip to the islands and enjoyed it as much as the first time. I have heard islanders say Michner didn't get it right, but this is a novel, not a history and the reader should be aware of that. Mahalo to a great author."}, {"userName": "Crystal", "userReviewDate": "May 10, 2015", "userURL": "http://www.goodreads.com/user/show/544254-crystal", "userReview": "“But have you heard what I said about land reform?” he pressed. “That’s what we’re talking about,” Noelani said in her precise Bostonian accent. “You would hurt your father very much if you were active in my campaign,” Shigeo warned. “As a matter of fact, you would probably hurt me, too.” “I studied politics at Wellesley,” she replied firmly. “Were you at Wellesley?” he asked. “While you were at Harvard,” she said.A lot of the characters were annoying, but in the way that a lot of people in real life are annoying. No one's perfect, not even in paradise. But I have to forgive any book with smart young women from Wellesley. And to my 'Buela's credit, the elegant heiress to the Hawaiian throne is a Vassar alumna."}, {"userName": "Diane", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/10231788-diane", "userReview": "I read this epic many years ago, and it is one of the few that I hope to read again in the near future. As with many of Micheners books, I felt that it was tedious getting through the earlier chapters, and probably one of the longest books I've ever read, but very well worth the effort!"}, {"userName": "Laura", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "The huge description of the epic saga of Hawaii since its discovery by some natives coming from Bora Bora up to the birth of an American state."}, {"userName": "Lea", "userReviewDate": "Jul 15, 2017", "userURL": "http://www.goodreads.com/user/show/66928450-lea", "userReview": "It took me about 150 pages until i was completly hooked. Easily became one of my favorite books. I love how Michener focuses more on the history and less on fiction."}, {"userName": "Anthony", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/10781840-anthony", "userReview": "August 7, 2014A Review by Anthony T. Riggio of Hawaii: A Novel by James A. MichenerA couple of years ago, I began reading Chesapeake by Michener and got so bored with the geological formation of the Chesapeake Bay and its surroundings, that I put the book down. Concluding in my mind “well, maybe someday I’ll read this book”. After completing the reading of Hawaii, I looked through all my books trying to find Chesapeake, to no avail, especially after several moves. I learned that I have to finish the book that I put down too quickly. I will do so soon.Hawaii was a Kindle purchase from Amazon, and as such there was no way I could be intimidated by its weight and scary thickness dimensions. Though, I have to say, that when the Kindle measured chapters in the number of hours to compete the chapter, it was almost as intimidating. Chapter one was 10+ hours; chapter two was 22+ hours and they kept getting longer. I am not sure how many hours it took me to read this tome but I read it in a two week period of time, where I took every free moment I had available to read. The book was completely captivating for me, so it was more a burden of love and pure enjoyment.Hawaii begins with “million upon millions of years ago”….wherein Michener describes the geological formation of the islands of Hawaii. I must have greatly matured in my reading efforts since my aborted reading of Chesapeake where this geological formation bored me to no end. I truly did enjoy in Hawaii, the way the islands were formed and how primitive life was transported to these islands far off from everything.Sometime around 800AD, man still did not appear on the islands but about 2,500 miles away on the islands of Bora Bora, man, later described as Polynesians, had thrived there for many centuries and had developed a culture with mores and beliefs and for all intents and purposes the life there was a kind of Paradise with a freedom and a nakedness that was almost poetic. However like all cultures that have existed there were differences of a political/religious nature which required human sacrifices, sometimes on a regular or as needed basis to appease angry Gods. It was during these times that individuals sought out “a better place” to live. Because the people of these islands were sea farers, though limited. That some headed out to the East in search of legendary locations. They initially set out on this great Odyssey with only men and finally reached the islands of Hawaii thousands of miles east of Bora Bora. Because they discovered the wonderful location some of them reversed their journey to transport women to the Hawaiian Islands. This journey was both arduous and dangerous so it was not something the people took lightly. Because of the experiences of the first trip the people developed the necessary skills to fine the islands of their future generations. One of the things the people tried to do was eliminate human sacrificing but when confronted by angry “Gods” the priests fell back into this practice but in a lesser degree than the priests in Bora Bora.For many centuries the people thrived on the Hawaiian Islands living a peaceful and bountiful life. However as European man began to circumnavigate the world and traveled to far off locations the islands of Hawaii were discovered and provided shipping or commerce ports until the early 1800’s when American missionaries were called to “save the souls” of these native peoples. The missionaries struggled and did change, to a degree, the ways of the natives. However, when the European men found the islands, they transported diseases and practice that he natives could not survive due to not having the immunological defenses that were built up with the European and ultimately the American missionaries.With the Protestant American value system, the missionaries began to cultivate the land and agriculture to the point that labor sources were needed over the course of several decades, Chinese labor was transported to Hawaii followed quickly by Japanese peasants to work the lands. Both groups of labor were more ambitious than the native Hawaiians and quickly deleted the native strains so that by modern times there were fewer and fewer native Polynesians left.The book was so enrapturing to me, especially because I am a lover of history, that it became an almost obsession for me. Michener’s writing style was superb and comfortable to me as a reader. I have to say reading this work on the Kindle was a delight especially since the built in dictionary was right there and I had to have added several dozen words to my vocabulary list. The book was worthy of high praise and as such, I gave it five stars."}, {"userName": "Suzanne", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/3739451-suzanne", "userReview": "I am a huge fan of historical fiction. And would you believe it – this is my first Michener novel! It didn’t take me long to realize that I had been missing out. Hawaii gripped me from the first pages and despite being over 900 pages long, I was sad to see it end.Hawaii is composed of large chapters – even novellas, if you will, that connect to form the history of the islands. From the lyrical prose of the first chapter, From the Boundless Deep, which describes the geological formation of the islands themselves, to subsequent chapters telling the story of the island’s earliest inhabitants, missionaries and immigrants, Michener is a master story-teller and impressive historian.Michener presents his history with fictional characters that are based on real people. For instance, in the chapter From the Farm of Bitterness, a lecture given by the character Keoki Kanakoa inspires Abner Hale and John Whipple to become missionaries working in Hawaii. In real life, the lecturer was Henry Obookiah and he did inspire the missionaries named Hiram Bingham and Asa Thurston.In addition to writing a riveting novel, Michener has succeeded in sparking my curiosity about those real-life persons who had such a huge impact on our 50th state. It’s no surprise then, to learn that Michener inspired one of my favorite historical fiction authors, Edward Rutherfurd, to pursue his literary career.Sadly, there will be no more Michener novels – this great author died in 1997. However, he did write over 40 books, so happily I have many more to enjoy!"}], "description": "Pulitzer Prize–winning author James A. Michener brings Hawaii’s epic history vividly to life in a classic saga that has captivated readers since its initial publication in 1959. As the volcanic Hawaiian Islands sprout from the ocean floor, the land remains untouched for centuries—until, little more than a thousand years ago, Polynesian seafarers make the perilous journey across the Pacific, flourishing in this tropical paradise according to their ancient traditions. Then, in the early nineteenth century, American missionaries arrive, bringing with them a new creed and a new way of life. Based on exhaustive research and told in Michener’s immersive prose, Hawaii is the story of disparate peoples struggling to keep their identity, live in harmony, and, ultimately, join together.", "title": "Havaí", "url": "http://www.goodreads.com/book/show/10693995-hava", "average": 4.19, "cover": "https://images.gr-assets.com/books/1360430232l/10693995.jpg", "reviews": 1397, "authors": [{"url": "https://www.goodreads.com/author/show/7995.James_A_Michener", "name": "James A. Michener"}, {"url": "https://www.goodreads.com/author/show/2747411.A_B_Pinheiro_de_Lemos", "name": "A.B. Pinheiro de Lemos"}], "type": ["Historical", "Fiction", "Historical", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/10693995-hava", "http://www.goodreads.com/book/show/850369.Hawaii", "http://www.goodreads.com/book/show/12658.Hawaii", "http://www.goodreads.com/book/show/2751228-hawaii", "http://www.goodreads.com/book/show/36145702-hawaii", "http://www.goodreads.com/book/show/18955412-hawaii", "http://www.goodreads.com/book/show/12657.The_Source", "http://www.goodreads.com/book/show/133430.Centennial", "http://www.goodreads.com/book/show/12661.Chesapeake", "http://www.goodreads.com/book/show/12663.The_Covenant", "http://www.goodreads.com/book/show/12659.Texas"]}