{"ratings": 609, "userreviews": [{"userName": "Bryan Brown", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/17539226-bryan-brown", "userReview": "I have put off reading this book for years waiting to see if there would ever be a paperback version. I blame my childhood. That was when all I could afford to buy were paperbacks, and my local library ONLY bought paperbacks for the fantasy and sci-fi section. In any case, I love reading paperbacks. He Drank, and Saw the Spider was published in 2013. I waited until the very end of 2018 before I saw the truth of the situation and caved in to buy a hardback book. I am so glad I did. I have always loved the Eddie Lacrosse stories by Alex Bledsoe since they day I read the title of the first book, The Sword-Edged Blond. I mean, really, what kind of noir loving fantasy nerd would not go for that on title alone. Well I, for one, couldn't resist and so became enthralled with the world of Eddie Lacrosse. This latest (is it a final one?) entry in the collection is filled to the brim with all the things I liked about Eddie. He continues to show the growth he has experienced through all the series. His irreverent sense of humor, and his keen understanding of others, and most of all his incredible curiosity about things he just doesn't understand yet all combine to thrust him into the middle of the most amazing and poignant stories. The poignant description is important. There isn't a one of these stories that doesn't deal with the real experiences and feelings of being human and of course, like most of us, we all experience tragedy and sorrow along with victory and love. Bledsoe blends all these aspects of humanity expertly in the person of Eddie Lacrosse. He Drank, and Saw the Spider begins with Eddie rescuing a baby from a bear attack and then deals with the repercussions of that simple act of humanity through the next sixteen years. It finally culminates in an, unsurprising, but satisfying ending where the characters have, if not grown, at least been changed by the events of the story. Each of the characters reacts believably and they stay consistently true to their personalities. Eddie of course, is Eddie, but Liz is constantly supportive and understanding and providing the bedrock of love that Eddie has needed his whole life. Opulura shows a constant world worn weariness perfectly explained by her story. Crazy King Jerry reacts believably to the grief and guilt he's spent years under, and comes to a satisfying .... not resolution... but place in his emotional life. Even Tatterhead ends up being a likeable character, and I won't say any more than that because of spoilers.I wish I knew there was another story to look forward to. Alex? Anyone? Does anyone know? In any case this is one of the very best Eddie Lacrosse books and I can heartily recommend it, and the rest of the collection to anyone fond of fantasy stories, or noir stories, or like me huge fans of fantasy-noir."}, {"userName": "Sharon L", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/15591068-sharon-l", "userReview": "For more reviews visit my blog The Accidental ReaderThe book starts in the past with Eddie saving a baby girl. Sixteen years later that assignment comes back into his life- with a teenaged girl, A king, some problems and magic birth. The ending, of course, is a HEA in an Eddie kind of way- meaning no cliffhanger. Also, the writing level and style are kept throughout the series- which is a good thing, I recall not so long ago one of my friends complaining on a deteriorating writing style in a series she used to love. Not here.Moreover, the characters are charming and amazing as usual. However, I still felt a problem with this book, I might even be bold for a moment and call it a weird problem. I shall explain. While each book in Eddie's series has its own adventure (as well as some overall development) and none of those adventures are recycled.  He drank, and Saw the Spider  was still less interesting than the books that preceded it. Why?It took me some time to understand, but I now have this theory.  The author had grown comfortable in the world he created . Yes, the world building is great, solid with definite rules- there are magic and technology. But there was nothing new. There was nothing new to discover in this book. Eddie and his girlfriend are great characters they are deep, they have conflicts in them, they are likeable. Hell, you can say Eddie is a PI in a world where magic exists, he solves magic mysteries and he doesn't believe in magic!While Eddie's character has much left to be discovered, he hasn't yet reached his full potential the world he lives in need something new in it. If this problem won't be solved, I'm afraid the next book will be great but not interesting all the same, a MEH . In such s case, IMO, Eddie's series should come to an end and I wouldn't want that. I would LOVE to see Eddie go back to his home kingdom, I think that could be interesting. It's just that there's a need to find something new in Eddie's world, something that would challenge him. On a more private note-there was a new aspect to Eddie's and his Girlfriend relationship. An aspect that felt forced and a little Out of Characters for them (sexual bondage and BDSM). So, to summarize while old fans will enjoy it, perhaps it's time for something new, some change, or and ending (which will be sad as there's still so much to explore with the characters) A review copy was provided by Tor in exchange for an honest review"}, {"userName": "Olga Godim", "userReviewDate": "Jan 11, 2014", "userURL": "http://www.goodreads.com/user/show/7438487-olga-godim", "userReview": "I received the uncorrected ARC copy from NetGalley as a Kindle file. 3.5 starsThe protagonist of this novel, a sword jokey Eddie LaCrosse, stands out from the pages – a living man, with all his merits and faults. It’s the fifth book in the series about him, and by now, he feels like an old, grumpy friend, a guy I could entrust with my problems. Of course, he is a bit cynical and a habitual drunk, but who wouldn’t be, doing what he does. He is PI in a fantasy world, and his investigations often take him into the middle of some dirty conspiracies. Despite repeatedly coming up against the worst in people, he still retains his compassion and tolerance for the human beings. For Eddie, almost everyone has something good, and even a monster deserves a second chance. Like any good PI, Eddie can’t resist a mystery. Secrets fascinate him, but his compulsion to discover the truth frequently leads him into danger. He also has a penchant for saving people – from bandits or dragons or wild beasts. He does it in every book. This book is no exception. It starts with a bang from the past – the young Eddie saves a baby girl from a bear (why am I not surprised?) – but then it slows down. Being a mercenary, he doesn’t have a place in his vagabond life for a child, so he finds her a home among sheep farmers and goes on his way with a clear conscience. Sixteen years later, on a leisurely vacation with his girlfriend, Eddie stumbles upon the same community of sheep farmers and meets his foundling again, now a pretty young girl. His curiosity stirs. He feels compelled to solve her mystery, to find out who she is and why fate dropped her in his path all those years ago. To the readers’ delight, Eddie’s quest for answers sets off a chain of calamities, and only Eddie could prevent the looming disaster. Besides Eddie, the novel boasts several requisite character types of the fantasy genre, including an orphan, a shady sorceress, a king or two, and a scary monster, but the roles they play are frequently controversial. Is this monster evil or simply ignorant? Is that sorceress ruthless or has she just run out of choices? The unorthodox functionalities of the common types are among the best aspects of this novel. The tale, a blend of mystery and epic fantasy, like the rest of the series, follows Eddie’s probing mind from a shepherds’ village to a king’s palace, from the throne room to the dungeons. Quietly and unobtrusively, the author raises the stakes for his hero and winds the tension in his narrative, until it thrums like a tight string by the middle of the book. The reader avidly turns the pages and wonders: what next?Unfortunately, in the second part of the novel, the story goes downhill, and the denouement is disappointing. As if to simplify the finale, the author arbitrary cuts off most of the subplots by killing a score of characters and sending others into obscurity, as if they’re not important for the main storyline. Maybe they are not. But then, why were they introduced in the first place? The conclusion to the single plotline the author did choose to explore feels artificial and predictable, no match to the original and explosive beginning of the tale. The other characters in the book are significantly less defined than Eddie, perhaps a bit cartoonish, with single traits of their personalities exaggerated for the sake of an archetype. Most of them, with rare exceptions, could be described with one modifier. A mad king. A scheming rogue. A no-nonsense girlfriend. A loyal guard. A cruel killer. There are some extremely extraneous details in the story – like Eddie going to pee in the bushes. I don’t need to know that. Nobody does. The novel is uneven, but on the whole, I enjoyed reading it. Definitely recommended for the fans of the series."}, {"userName": "Fantasy Literature", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/8491232-fantasy-literature", "userReview": "http://www.fantasyliterature.com/revi..."}, {"userName": "Tim Hicks", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/111076-tim-hicks", "userReview": "OK way to pass the time. Not as good as the others; felt a bit lazy. Too much slap-and-tickle with Liz. I don't mind that, there was just too much of it. Felt like padding. Bledsoe admits that he can't be bothered creating character names, but this time maybe he goes too far. Guards named Ajax and Hector. A young woman named Cassandra who complains that no one ever listens to her. A young girl named Viola pretending to be a boy. Owen Glendower as a character. A guy named Billy Cudgel (sounds like a good name for a club [sorry, couldn't resist]). And, most over the top of all, a foul-mouthed and abusive chef named Gordon. What will we see in the next book? Mr. Darcy? Fezziwig? A vampire named Lestat? Also lazy is having the scribe reappear to do a long info dump. The plot is decent. The motivations of the leading characters are OK. Tatterhead is interesting. The whole thing with the, ahem, person with supernatural powers falls apart as soon as we see some details. She can do this huge thing and that one, but she can't do this little thing or that one. And her motivations are either unclear or missing. Fifth best book in the series, but still OK."}, {"userName": "Frank Jarome", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/1849069-frank-jarome", "userReview": "For the first 2/3, this was an INCREDIBLY strong read. Good mystery, interesting characters and development. Then as the curtain began to be pulled back on what was happening, it became a bit less interesting. This is one case where the resolution was much less interesting than the mystery itself.I continue to enjoy the evolution of Eddie and his world, however, as each book gives him new depth and adds more interesting facets to the world. This series remains among my top 5 in Urban Fantasy (for those curious, the others are Harry Dresden, Felix Castor, Iron Druid, and the Leandros Brothers. Order TBD, although Dresden sits at the top of the heap for sure.)Anyways, I digress. This is a very good book, and I recommend checking it out upon its release. Thanks to Netgalley for the advanced copy."}, {"userName": "Sarah", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/3620323-sarah", "userReview": "He Drank, and Saw the Spider is a strong installment to the Eddie LaCrosse series, in fact, it is probably one of my favorite Eddie LaCrosse books. Bledsoe’s skill really shows here. Despite the fact that the ending might be a little weak, the rest of the book feels so effortless, so enjoyable, and so perfectly balanced that I know I’ll go back to it again and again.Read my full review here:http://www.bookwormblues.net/2014/01/..."}, {"userName": "Beth", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/5169357-beth", "userReview": "Very captivating book a bit of a mystery a bit of a romance. Some sword fights, a troll, and a damsel in distress. I had no idea this is part of a series I'll look for more to see what other adventures Eddie the Sword for Hire has."}, {"userName": "Jennifer", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/22757106-jennifer", "userReview": "I didn't realize this was part of a series until I had started reading (the interesting name and cover drew me in). It was ok and a quick read, but ultimately I wasn't impressed at all by Eddie LaCrosse. He didn't seem to be that smart, a particularly great fighter, or even all that competent - all action scenes are him reacting (usually late) to one thing or another. The story referred often to his sexual escapades with Liz (and the advances of others, since it's a fertility festival and apparently everyone is ready and willing), but that didn't really add to the story. Rather than building on the plot, I felt a lot of the scenes were just random things the author thought were cool to add. King Jerry was unbelievable, as was the story of Opulora and Tatterhead. Billy Cudgel was a pointless character, as was Gordon (hm, an a**hole chef named Gordon), Cassandra (who gets \"feelings\" no one ever heeds), and many others. There are just too many bits tossed in without meaning - Opulora was a great friend of Queen Sylvia, King Jerry investigating Opulora's past (which made zero sense), Ellis and Jerry being boyhood friends, Jerry being a nutcase, the glowing blue orbs...I could go on. Based on this book, I wouldn't recommend the series to anyone."}, {"userName": "Caleb Hill", "userReviewDate": "Dec 03, 2013", "userURL": "http://www.goodreads.com/user/show/13639167-caleb-hill", "userReview": "“If you pick up a viper and it bites you, it's not the viper's fault, is it?”Novels are a bit like jokes. There's some good ones. There's some bad ones. Every now and then, one comes along that makes your stomach hurt because you can't stop laughing. Then there are the groaners. Alex Bledsoe's He Drank, And Saw The Spider, is a good humored laugh that kinda trails off into awkward silence. Yeah.Before I start, I'd like to note that this is my first Eddie LaCrosse novel. There are some problems that might be fixed by reading the rest of the series beforehand. I'm of the thought that every book, especially stories that feel self-contained, (as this book does) should be able to stand on its own. I'll leave that reminder up here for fans of the previous four books.Anyway, Alex Bledsoe's fifth Eddie LaCrosse book starts off strong. The narrator of which the series is named is out in the woods, minding his own business, relieving himself. Out of nowhere, a man runs for his life, pursued by a giant bear. Being the righteous hero and mystery-whore, LaCrosse decides to chase after them and kill the monster. He succeeds with just a sword, but doesn't save the man's life. Surprisingly, the man repays LaCrosse with a baby girl. The soldier doesn't want an infant; doesn't know how to take care of an infant. So...he travels to the closest town, gets in a few scrapes, has a fling with a country girl, and somehow manages to give her the child. Almost two decades pass, and LaCrosse is on vacation, traveling with his fiance. (Or wife. Or girlfriend. I was never quite sure.) Because of his love for adventure and mysteries, the man shambles back into the small village to see what happened to the squirt. He doesn't find the easy road he was hoping for.“'You can't understand life, Miss Dumont,' Opulora said, 'until you know death. Would you appreciate the light without the dark?'”The highest compliment I can give Bledsoe is toward his narrator. Eddie LaCrosse is a well-realised person whose motives are complex and show a maturity that only age, experience, and a damn good writer can create. Not to be outdone, the remainder of the cast is well rounded and magnificent. In fact, the characters are Bledsoe's strong point. I've yet to read the other four books, but Liz, the heroine of this tale, has just as much depth as Beatrice and Jack. That tells me that Bledsoe can make strong characters in not just many books, but in standalones as well. On that thought of characterization, the dialogue was strange. It teetered on jarring, to okay, to gut-wrenching brilliant. I think it may be the modern slang in a Middle Ages-esque novel. I'm not sure.That brings me to my next point: the setting felt tacked on there. That's not to say the swords, dragons, and magical woodlands felt out of place; it's just the landscape was never elaborated on. I love me some verisimilitude. Bledsoe gave us little to none, aside from the fertility festivals and exploration of sheep villages. I would have loved more. More talk of the outlying neighborhoods would've been great. Or a sub-plot about the two kings that didn't relate to the mystery. Anything that wasn't just meat. (The fat does give flavor, right?)Moving on, the plot is nothing really. A slow moving detective case that's not assigned to LaCrosse. There's intrigue, betrayal, and chases. At times, it can be a tale of convenience and incompetence, especially towards the end. The ending tapers off. The climax is resolved with a bit of hazy magic, or deus ex machina, if you will. There are a few sub-plots and questions that are discarded. I don't need everything told, but in this instance, it felt cheap and lazy. Nevertheless, it's all extremely fun, but like the setting, it doesn't really do much besides stand there.“'A man who's come so far in the world might do a lot of bad things to stay there.'”However, my biggest complaint is with the prose. Simple prose is different from simplistic prose. The latter, if done well, is universally praised, most of the time. No word is wasted. No description is too little. Simple prose is the bare bones of what the story takes, but written in layman’s terms. There's no pop. There's no clever turn of phrase, no poignant brushstroke or simile to delight the mind. It's just there, lifeless but necessary for the medium.Unfortunately, Bledsoe's falls into simple prose. The narrator does, at times, make up for this with his good cheer and genuine humor. But I need some brilliant writing, seeing as this is a book. There's glimmers here and there at opposite sides of the canyon, but nothing more. It disappointed me, considering this is a 1st person novel; they usually always excel in that department for me.Worse than that, Bledsoe falls into the trap of telling, not showing, and then repeating the information a paragraph later. It happened quite a bit, which annoyed me.“The plethora of freshly cut stems and carefully shaped branches told me it had been recently spruced up, no doubt for the festival.”Now, contrary to all my negativity, I actually enjoyed this novel, up until the end, at least. Then it nosedived into ridiculousness. Hopefully Bledsoe improves this in his latter installments, or maybe this was just a dip in quality. Doesn't matter. I'll be reading a few more to see. But if he could inject a little flavor into the overall quality, I'd be happy. Because He Drank, And Saw The Spider is an amusing ride through the woods, but at the end, it is just an above average Urban Fantasy set in the Middle Ages. If anything, it's a bland piece of literature that has more potential than most of the aforementioned genre.“'You can waste a lot of your life watching the horizon for bad things, you know.'”*I was given this ARC for my honest review.*"}, {"userName": "Amy", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "It's no secret that Alex Bledsoe is one of my favorite living authors. My problem with this book is that I've pretty much read all the other Eddie LaCrosse books and I'm really sad that there probably aren't more in my future. The good thing is that Mr Bledsoe has written other series, one of which I haven't read, but one that I really adore. So, I'll trade my sword jockey for more Tufa, and maybe explore his other series that I have yet to read."}, {"userName": "Splrf", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/41843628-splrf", "userReview": "Although I'd normally reserve 5* for the great epic tomes with lots of storylines and large sprawling empires, but He Drank, and Saw the Spider is just so thoroughly entertaining. Well written, funny surprising, great characters. Loved it."}, {"userName": "Rayb24", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/8844617-rayb24", "userReview": "These stories are lots of fun mystery, comedy with swords and sorcery in something that feels like a western mood.. perfect for light fun reads"}, {"userName": "M.", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/11285492-m", "userReview": "A fun light fantasy romp that's good, but ultimately forgettable."}, {"userName": "Ryan", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/57175740-ryan", "userReview": "An excellent entry into the series. I really enjoy the series as a whole, and this outing is no different. I recommend!"}, {"userName": "Phil", "userReviewDate": "Jan 09, 2014", "userURL": "http://www.goodreads.com/user/show/4109264-phil", "userReview": "Here's a extract from my review, full link: http://afantasyreader.blogspot.ca/2014/06/he-drank-and-saw-spider-review.htmlI have grown very fond of good old sword-jockey Eddie LaCrosse. It's the kind of character you can't feel indifferent about. He's a genuine honest bad ass with many flaws but much experience and a knack to find himself in front of a punching fist for the sake of his job or of those in need for whom he can't refuse some help. Add to this a tendency toward witty remarks and a girlfriend who's probably the only person in the world who can really get the best out of him and you get closer and closer to Eddie. To top it all, Mr. Bledsoe chose to write his books in the first person perspective, the best choice to make us enjoy the man's adventures, investigations and ruminations to its fullest. This novel is testament enough.The story starts with one of the tales of Eddie's past life as a mercenary. He stumbles upon a baby in the arms of a dying man and gets her to the nearest small town. He meets a woman would could have been the love of his life (even after his previous tragic lost love) and leaves the little girl, who bears a strange tattoo on her back.... anything strange or foreboding here? Indeed. When the story jumps back to the present, what do you think will happen? Will the little girl reappear in Eddie's life? Don't worry, I'm not trying to subtly say that the story is predictable. It may seem so at first but the author won't leave it at that save for a few hiccups.Eddie is then following his beloved Liz in one of her deliveries. After stumbling upon a presumably mad king and his sorceress, they decide to roam the countryside for a little vacation. Most of the tale of He Drank, and Saw the Spider actually happens in a backwater country town and scenery. Even if it's less spectacular or grandiose, what matters is the interaction of the protagonists and the mystery behind Isadora. A couple of secondary characters are thrown into the mix, a young incognito prince and his father, a Frankenstein monster-like experiment, a whole family of peculiar farmers turned rich, you name it. With fertility festival just around the corner, the right mix for an intrigue mixing the mighty and the commoners is created.Sadly, the whole resolution of the secret of Isadora's true identity and past isn't handled has deftly as the author has accustomed us to. It's a denouement for the not so complex plot with some action involved and some surprises but it's not what I will remember the most from the tales of Eddie.Another element nicely woven into each of Eddie's stories is magic. There's no \"magic systems\" to speak of but there's always some witchcraft involved that may look like tricks from charlatan or become incredible supernatural representations. It's often just a touch and the characters are usually oblivious of it but for the most part, Bledsoe isn't getting out of tricky situation with a twist of unexplained magic. In the book, it's the sorceress who plays that role and even if at first I thought that this tale in particular wouldn't be based upon some common trope, it still is, in part. Still, Eddie has to save the day even if it's not really his life who's in danger.Eddie's true to himself for the whole endeavor. He's as funny as usual (cynical and sarcastic), has the right amount of brawling, shows his wits and gets emotional. He takes it very personal to find out what happened to Isadora and even if in retrospect I think that the story may be less breathtaking. However, it has all the charms to make it a nice page-turner, with Bledsoe usual straightforward prose and nimble pace. So, not the best LaCrosse novel but a nice addition to the list.If you haven't read any LaCrosse books... shame on you!!! :)... you should pick up The Sword-Edge Blonde first. Here's my favorite LaCrosse books so far:The Sword-Edge BlondeWake of the Bloody AngelHe Drank, and Saw the SpiderBurn Me DeadlyDark Jenny"}, {"userName": "Abhinav", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/7450763-abhinav", "userReview": "You can read the whole review over at The Founding Fields:http://thefoundingfields.com/2014/01/...Shadowhawk takes a look at the latest Eddie LaCrosse novel from Alex Bledsoe, the fifth in the series.“Downright fun, entertaining and very light-hearted.” ~Shadowhawk, The Founding FieldsI read my first novel featuring sword jockey, i.e. fantasy-style detective for hire, Eddie LaCrosse in 2012, The Wake of The Bloody Angel (review). It was a really good book, filled with lots of humour, lots of action, a great sea-monster, and some really creepy characters too. Most of all, it had a really, really fun female character in the form of Jane Argo, a former pirate and a friend of Eddie’s who is a fellow sword jockey as well. I’d been meaning to read the previous three books in the series ever since, but never really got around to doing it, more than a year and a half on. Then I heard a few months ago that Alex was going to have another novel out soon, and I got really excited. I read the eARC of the book last month and I had as much fun with it as I did with its predecessor.He Drank, And Saw The Spider does something much different than I expected. I hadn’t read the blurb for it, so I was quite surprised to see where the story went. It starts off with a sort of a prequel, that revisits an old adventure of Eddie’s from years back. It sets up the entire story to follow, laying down the seeds and building the rough framework. It seems that years ago, just before he became a sword jockey, Eddie helped save a relatively new-born girl from a rampaging bear and even some swarthy-looking soldiers who were apparently out to kill her, for reasons unknown. Eddie leaves the girl in the care of a farm-girl in a nearby village, and then leaves, having transferred any responsibilities for her. And now, when the story gets going, he returns to the village quite incidentally, going around the countryside and partaking in the multiple harvest festivals in each village with his girlfriend Liz Dumont. The girl he left behind is now all grown-up and has a life of her own, which his accidental arrival somewhat overturns and now they all must deal with the fall-out, particularly given how the past comes back to haunt them all.Right off, what I loved about the book was its consistency in tone to The Wake of The Bloody Angel. This is the same Eddie that I remember from that novel, and the humour tone of the book is the same as well. It is quite incredible how seamless the transition is between the two novels, though the stories are quite different from each other. And since Eddie’s adventures are written as standalone stories, it is even more significant since Alex is under no strictures to maintain that consistency.I had some issues with Eddie’s easy attitude towards women in this novel, something that was quite missing from the previous novel. It can get a little irritating, but I suppose that it is also somewhat fitting since such is the provenance of noir-thriller detectives/heroes and the Eddie LaCrosse novels in part are the (heroic) fantasy version of such stories. I wish it was different, but I won’t complain about it since Beatrice, the object of his affections, is a pretty damn strong woman in her own right. She always flips the tables on Eddie and constantly wrong-foots hi, which I found to be amazingly well-handled. I think it was the perfect approach to go for, and her scenes definitely brightened up the story every time. She just might be the new Jane Argo, I think."}, {"userName": "Hobart", "userReviewDate": "Aug 06, 2014", "userURL": "http://www.goodreads.com/user/show/4084033-hobart", "userReview": "After a couple of adventures which aren't quite typical in their nature, Eddie La Crosse gets back to basics with a fairly straightforward case. Well, that's not exactly true -- it 's just that the last two were more outlandish, more grand-adventure-y, less LaCrosse-as-sword-jokey. This is Eddie doing what he does best. Yes, there's magic, and monsters, and all the other trappings that keep this from being something that Sue Grafton or Dennis Lehane would've written.Sixteen years ago, Eddie promised a dying man on the run that he'd take care of the baby that the other man was running to protect. He found a seemingly-trustworthy family willing to take the infant in, and went on his merry way, and actually forgot all about the incidents surrounding that. Until years later, when Eddie and his girlfriend, Liz, are on vacation in that area, when suddenly it all comes back to him and he decides to try and track down the (now) young woman and see how she's doing. Naturally, things start to go poorly about there. He does find her -- pretty easily, too -- it is a small community, with an economy largely-based on sheep-herding and farming, so it's not really a bustling metropolis where no one knows anyone else. But there's a whole lot of interesting things happening around the young woman -- royalty in disguise, a meddling sorceress, an untrustworthy mercenary-type, an over-protective mother, a dose of sibling rivalry, and some sort of articulate and super-strong inhuman creature with a healthy interest in the girl. Even though he was just supposed to check on her and not interfere with her life -- he had no intention of even introducing himself to her. Eddie can't help himself, and before you know it, he's neck-deep in intrigue, and danger. On the whole, this is a fun, brisk novel -- a lot of humor, some good action, nice banter and interaction between the characters (especially Eddie and Liz). A good change of pace over Dark Jenny and Wake of the Bloody Angel, which tended to be more on the serious, emotionally-charged side. Yet, even as the answers to the questions surrounding the girl's mysterious origins become obvious, and some of the characters get to the point where they seemed a irredeemable, Bledsoe (as he can every so well) keeps you completely drawn in and even tugs the heart strings a bit as the truth is revealed to the characters. Just really, really well done.There's a lot of nice little touches along the way. For example, towards the end of the book, Eddie and those he's traveling with encounter a preteen who joins their little band for a while. She's pretty new to swearing and tries to get in as much practice as she can while with them. At first, I thought she was an odd (but entertaining) and pointless distraction. It didn't take too long to see she was a perfect tension-breaker, just what that part of the novel needed to keep from being too tense and so much more serious than what had come before.Eddie's narration has never been better -- humor-tinged and hard-boiled, a medieval Philip Marlowe or Elvis Cole. I liked all of these characters, and really wanted to spend more time with each of them -- I don't know how Bledsoe could've pulled that off without getting the whole thing to slow and ponderous (which would've sucked the fun out of 60-70% of these characters). This is really such a well-done and fully realized series. I can't wait to see what happens next."}, {"userName": "Melanie", "userReviewDate": "May 16, 2014", "userURL": "http://www.goodreads.com/user/show/4610118-melanie", "userReview": "He Drank, and Saw the Spider is another adventure of the sword jockey Eddie LaCrosse. The story starts sixteen years in the past and we find Eddie starting out in his new profession and still raw from the death of his fiance and own near demise. He is travelling on his way to war where he comes across a man being attacked by a bear. He kills the bear but fails to save the man. In his dying breaths the nameless man hands over the precious cargo he was protecting - a baby. Really a softie at heart Eddie takes the baby and looks for a caring family to leave her with. He finds a large, loving family and leaves the baby not to think of her again until...... Yes, until a vacation with his girlfriend Liz takes him back to the very town where he left that same baby sixteen years before. Who was she? Who did she belong to? What happened to her? Is there magic involved? All questions that Eddie wants answers for. The longer he stays the bigger the mystery gets but Isadore, now a lovely young woman, needs his help and the former sword jockey is just too nice to say no. Queue the adventure!I have always enjoyed this series and think Eddie is a great and conflicted character. I had thought that Bledsoe had decided to leave Eddie after the last book Wake of the Bloody Angel so was a bit surprised when Qwill said she had this book for me. The plots of the previous books have been fairly convoluted but always ended up with something I wasn't expecting to happen. This book is much more straight forward and the plot almost linear. There aren't any big surprises in this installment which I think was a bit disappointing.This was the first novel that featured Liz as a secondary character for a large part of the novel. As much as I like Eddie and Liz's relationship she didn't really add that much to the plot in this case. Eddie is the true hero and is such a great character. I think I prefer the start and the end of the book as the scenes with Eddie and the baby Isadore were very cute and the ending where Eddie comes to terms with his past is quite touching.Overall, He Drank, and Saw the Spider didn't engage me in the same way as the other books in the series. It is a quite short and an easy read so I don't feel like I had made a big investment in time. It feels a bit like Bledsoe was forcing out one more book and I kind of wish he hadn't. Having said that the Eddie LaCrosse series is an excellent one and if you like sword and sorcery fantasy then it needs to be on your TBR."}, {"userName": "Daniel", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/638550-daniel", "userReview": "This review originally published in Looking For a Good Book. Rated 2.75 of 5When I received a digital ARC (Advance Reading Copy) of a book, I don't usually know much about the book or the author unless I am previously familiar with them. With this particular book, I came in completely blind. I have only later learned that this is the fifth book in a series about the main character, Eddie LaCrosse. I can not comment on how this fits within the series.I was definitely and immediately engaged in the story and we begin with a rather exciting moment. Eddie encounters a man who is being mauled by a bear. Eddie arrives too late and is not able to save the man, but before he dies, he entrusts Eddie with his valuable cargo ... a baby girl. He asks that Eddie look after his safety.Eddie is not a family-type man and he brings the baby to a nearby shepherd and begs that the family raise the poor girl whose guardian died trying to protect her. The family agrees and Eddie goes off to his mercenary ways. Now...sixteen years later, Eddie returns to the little village where he left the baby, wanting to check up to see how things are with the little girl. But of course the girl is now a beautiful teen and she's at the center of a fight between two rival kings and a prince and a variety of monsters and sorcerers.Though my interest was captured early, I quickly lost interest in the book. It seemed as though there was a history to Eddie, but I never understood how this story tied in to his history. I also felt that other characters came and went rather randomly. When it served a purpose for the moment, a character would appear, but if I expected to get more or see a character again, it wasn't guaranteed.When reading fantasy, or more specifically, sword and sorcery, there are some expectations or at least things readers are willing to accept -- typically some good sword fights and some magic that threatens the equilibrium. These things are present in the book, but it's almost stereotypical, with little to set it apart from similar work in the field. I wouldn't be opposed to reading another Eddie LaCrosse novel, but I'm in no hurry to seek one out.Looking for a good book? He Drank and Saw the Spider is average fantasy/sword-and-sorcery fare which may appeal more to fans of the Eddie LaCrosse series.I received an electronic copy of this book from the publisher, through Netgalley, in exchange for an honest review."}, {"userName": "Wing Kee", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/25567578-wing-kee", "userReview": "I've never given an Eddie LaCrosse novel 5 stars. Sure, it's good, but not that good. This time it's a bit different. Do I think it's a 5 star novel, no. Then why this rating? Because this book spoke to me personally through it's title and the story. It's not a 5 star book, but for me, the stars aligned and it became one for me.As with my other review, I'll try not to spoil anything for readers, but honestly, this is book 5 in a series and if you've reached here, my reviews are meaningless:World: Same wonderful effortless Bledsoe world building. Still not really Noir (only minor hints of it) but rather just a fantasy novel told in first person. This time we get a more intimate look at Eddie's past. The world is not really expanded, but rather it mainly takes place in one small town and that's fine, cause the story is good.Story: This is where the book turned from a 4 star book to a 5 star book. I will spare you the details but this book's main theme, villian and message was great. Not only does it tie into the overall legend of LaCrosse very well, but as I said it hits home for me. It deals with madness and obsession and this topic at this point in my life, it hit the mark. That's why I think this story is wonderful. For other readers, I'd say that this is one of the better of the LaCrosse novels, but it is not something to write home about. For me, it's more.Character: By book 5, not a lot can be said about Eddie, but Bledsoe manages to give him some development. However, I'm really happy that Liz is finally on a quest with her. This relationship had been going on for 4 books and so far there has been little or no character development for Liz, now there is. The rest of the cast especially Crazy Gerry are solid. Gerry's story is wonderful and hits home for me, hense I connected with the characters in this book.This is good stuff. I liked the tale, it was a strong book 5 and I found it to move along at a wonderful pace. Add to that the emotional connection I had with this book, I'll say it's the best LaCrosse book so far!Onward to the next book!"}, {"userName": "Thomas", "userReviewDate": "Jul 14, 2014", "userURL": "http://www.goodreads.com/user/show/291872-thomas", "userReview": "For all the issues I've had with the Eddie LaCrosse series, I think it's safe to say that I'm a fan, both of the series and of the author. The stories are well-told, gripping, and engrossing, and even if they aren't perfect stories, they're fun reads, and that's enough for these kinds of stories. I can tear through them in a day or two, and I'm looking forward to reading the rest of the series (and the Tufa series, and whatever else he writes).The structure of this book is a little strange, as it starts out with a flashback from sixteen years before, and then jumps forward to Eddie's current time. This wouldn't be problematic in and of itself, but when we pick the story back up in the current time, part of the mystery is answered by the details we just read about, and Eddie even makes some parenthetical asides about how he should have clued in on some of the answers based on what he had already told us. Those parts were jarring, and removed the tension of that part of the mystery. I felt like the story would have had a more dramatic punch if he had somehow woven the first part of the book in with the main narrative. Luckily, that wasn't the only mystery, as the question of who Isidore really was still carried the rest of the book.Part of the story wrapped up too neatly, without much explanation. It worked well enough, but it felt a little too much like a deus ex machina ending. There was a hint early on at how that part of the story might end, but then it was pretty much ignored until it was needed at the very end of the story, so it wasn't entirely unexpected, though it did seem too easy.I'm not sure if this is my favorite Eddie LaCrosse book (that honor goes to either Burn Me Deadly or Wake of the Bloody Angel), but it's still a solid read, and right in line with the previous volumes in the series. It's a given that anyone who liked the first four should read this one, too."}, {"userName": "Judy Lesley", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/4814399-judy-lesley", "userReview": "Once upon a time a king drank from a cup and he saw the spider. For an explanation of what that means you will have to read this book. If you like fantasy mixed in with your mysteries, and you like some wry humor stirred into the whole mix, you will like this one. In fact you will like this whole series. Crazy King Jerry is the one who saw the spider, but you need to keep in mind that Jerry isn't called \"crazy\" for nothing. Eddie Lacrosse and Liz Dumont are on vacation. So what does a sword jockey like Eddie do when he's on vacation? He finds a mystery, of course. This one had its beginnings sixteen years before when he saved a baby girl from being killed by a bear and then found a perfect family to leave her with. But the thoughts of that little girl came back to prey on Eddie's mind when he found himself in that same little town again. So, of course, Eddie discovers himself in a whole mess of trouble when he finds Isidore again.I like this fifth book in this series. Author Alex Bledsoe has the knack of blending just the right touches of humor with fantasy imagination to make for interesting characters and plots. Another point in his favor from me is his ability to write about genuinely strong women without taking away their feminine qualities. Not nearly as easy to do as it sounds. Plus he came up with a fantasy concept here utilized by the sorceress Opulora which totally took me by surprise, and I like to think I'm pretty good at figuring out the answer to mysteries. But.....because the unusual idea came from a professional imaginer my guesses got left behind in the dust. My only quibble is that this book didn't have quite as much action in it as previous stories. It took quite a while to develop. I didn't mind, it was still a darn good book and Eddie's character underwent a lot of good development in the process.I received this ARC through NetGalley. The opinions expressed are my own."}, {"userName": "D. Alan", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/6554354-d-alan", "userReview": "He Drank, and Saw the Spider is the 5th book in the Alex Bledsoe’s Eddie LaCrosse series. And like the previous books, this one is a winner.Bledsoe starts this tale off, many years before Eddie’s present. A young Eddie comes across a badly injured man in the forest and saves him long enough for the man to give him a most important package, an infant girl.Fast forward to the present. Eddie and his lady friend, Liz are finishing up a job and planning on a much needed vacation. But as in all good fiction, the word vacation is code for ‘Grand Adventure’. Traveling in the area that he’d been in years earlier, Eddie decided to ‘check-in’ on the baby, now a 16 year old girl and see what had become of her. And it doesn’t go well for him.Like the other books, Bledsoe tells the tale in a first person narrative and pulls this off so well, the reader can easily imagine Eddie sitting next to you, telling the story over a frothy beverage. Full of action and suspense, He Drank, and Saw the Spider is a great adventure and fun mystery. Although some elements were easily predicted, Bledsoe adds enough twists to turn any predicted event on its ear.This volume, like the others is stand-alone stories. Although brief passages harken back to the previous books, some one new to the Eddie LaCrosse stories could read this one first and not be lost. Personally, I’d read the 3rd book in the series first, before going back and catching up on the first 2. I highly recommend this one, along with all of the Eddie LaCrosse series."}, {"userName": "Tracy", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/5332917-tracy", "userReview": "I received this book for free from NetGalley in exchange for an honest review. This does not affect my opinion of the book or the content of my review.This is the 2nd book I read with Alex Bledsoes' Eddie LaCrosse, and I liked this one as much as the first. In this story we see more of  Eddies' past and what has made him the man he is. The interaction between Eddie and his girl Liz are often humorous, they really seem to be perfect for each other. The rest of the characters in this story are also very colorful, from the prince and the king who are there and pretending to be normal every day people. To the big huge spy who is pretending to be the princes' companion. For the most part I think that almost all of the main characters, besides Eddie and Liz, are actually pretending to be something they aren't even if they don't realize it. The story is fast moving, with romance, adventure sword fights and fist fights thrown in for good measure. I liked the fact that even when Eddie didn't have to do anything, he stuck around and tried to do his best to help the little baby he found many years ago and gave to a shepherd family to raise as their own. Now that Isadora is a grown teen and needs his help again he is there to solve the mystery to save this young girls life. That says something about the character I think, and this is one of those characters that I look forward to reading his next adventure."}, {"userName": "Travis", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/17881570-travis", "userReview": "This was one of those books I really wanted to like, but just couldn't. I found it in the library one day, had never heard of the book or the author before, but the title was intriguingly odd and the inside cover blurb sounded promising, so I gave it a shot. It started out quite well; Eddie LaCrosse is the kind of hero I love in a book: fearless, irreverent, never at a loss for a one-liner- the kind of guy I like to picture myself as in my more self-delusional moments. He's a little one-dimensional and stereotypical, but he elicited enough chuckles out of me that I really didn't care. Unfortunately, chuckles only go so far, and when the entire supporting cast proved to be just as cardboard, I found myself wondering why exactly I cared about these people. The plot also featured some odd twists involving magic and fantastical creatures that felt out of the place in the otherwise very real world, non-magical setting. It was still an entertaining enough page turner thanks to an abundance of wisecracking that almost made it worth it, but throw in quite a bit of salty language, a ton of raunchy double entendres, and frequent allusions to the main characters vigorous sex life, and it all just started feeling too much like something written for 9th grade boys to giggle over. I don't plan on checking out any other entries on the series."}, {"userName": "Edwin", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/14961953-edwin", "userReview": "Book Review: He Drank and Saw the Spider by Alex BledsoeI saw this book on the new books shelves at the local library and decided to check it out mainly because of the title but also because it was set in a medieval period. It turned out to be a fantasy series with a protagonist named Eddie Lacrosse who is a dispossessed noble earning his living as a detective sword jockey. The medieval setting includes some magic but Eddie is a swordsman without magical powers but remarkable intuition. This volume is Bledsoe's ninth and Eddie is featured in several. There were no other books in the library by Alex Bledsoe.The novel begins as Eddie kills a bear that has attacked a traveler on a forested trail. The traveler is protecting a newborn baby girl who has a mysterious past. He leaves the child in a nearby town and The novel jumps sixteen years into the future. Eddie is traveling with his girlfriend Liz and he is wondering what happened to the little girl. The rest of the book is devoted to the adventures of the pair as they seek to solve the mystery of who the girl is.Along the way they mix swordplay with kinky sex.The book is entertaining and offers a number of surprises and plot twists but the ending is predictable and encumbered with too many last minute crises. I found myself skimming at this point. I could have made better use of my time."}, {"userName": "Stuart Nager", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/4177883-stuart-nager", "userReview": "There is humor, adventure, and some things that just don't really connect (I'm looking at you, ending of the book). I picked this up because of Booklist's quote of suggesting this to fans of the Harry Dresden books. Character wise, I agree. I liked Eddie and Liz, and felt they belonged right beside Dresden and his cohort. There is depth in them that seems above the lightness of this book. This is my first Eddie LaCrosse book (which seems to be my forte: starting a series of books volumes in). I'm not sure if the other volumes are deeper in plot and more involving. What took me out of this book, time and again, was some of the modern terminology (\"No Way\" \"Way\", as an example). Yes, I understand the intent. It just kept moving me outside the book's flow. I also got a bit bored with the whole thing at a point. I put it down and read three other books and wound up with nothing to read (libraries closed) so I finished it. There are a few deaths that just \"happened\" and were tossed away, and a character who served his/its purpose just happens to \"wander away\" with another character that was introduced and then discarded: kinda lazy, even if the author is intending for them to be used in another book. So...it was ok. I didn't hate the book. I just can't get too excited over it."}, {"userName": "Craig", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/83180-craig", "userReview": "This is another fine entry in the Eddie Lacrosse, sword-jockey-for-hire, series of private-eye-noir/sword & sorcery mash-ups. Eddie once more revisits an event from his past that needs to be investigated and resolved. I thought the title was a little off-putting; something simpler would have been better suited. Each of the Eddie books has a theme, or perhaps tone, such as pirates or dragons, and this time it seems to me that the plot is very Shakespearian-comedic. I didn't enjoy it quite as much as Dark Jenny; the ending didn't satisfy me, I was annoyed that a rather major character made a late appearance, etc., but when little details bother you about a book it does serve to illustrate the fact that the author has succeeded in engaging you in the story and characters. For example in this Liz is at one point struck speechless at meeting a king, and I don't think Liz would ever be overwhelmed like that. The supporting characters all reminded me of Shakespeare's in one form or another, and I thought he did an excellent job of portraying the crazy king and the witch as both protagonist and antagonist. Here's hoping that Eddie rides again soon!"}, {"userName": "Teri-K", "userReviewDate": "Nov 20, 2014", "userURL": "http://www.goodreads.com/user/show/2524448-teri-k", "userReview": "These books shouldn't appeal to me. They're about a man - a tough guy, in fact - and have some violence and crudity in them. But I enjoy them anyway. For one thing, I listen to the audio books narrated by Stefan Rudnicki, and he's wonderful. But these books have some other things going for them, too.First, there's the humor. Not only does Eddie LaCrosse have a keen sense of irony and fun that keep him from taking himself too seriously, but the books also skewer the reader's expectations in little, amusing ways. For instance, most fantasty epics give the upper classes noble sounding names and the simple people are \"Maggs\" or \"Ralf\". Here we have Bonnie Prince Jack and a shepherd's daughter named Isadora Glendower. Just the kind of little twist that makes the books more fun.Then there's Eddie's personal development. He starts out the series as a real tough guy, hiding from himself and the world, but as time goes on he softens and becomes more self-aware. But mostly the stories are really good - that odd mix of detective noir, sword-and-sorcery fantasy and fairy tale probably shouldn't work. But Bledsoe is a great writer, and so far they've all been hits for me."}], "description": "After he fails to save a stranger from being mauled to death by a bear, a young mercenary is saddled with the baby girl the man died to protect. He leaves her with a kindly shepherd family and goes on with his violent life.Now, sixteen years later, that young mercenary has grown up to become cynical sword jockey Eddie LaCrosse. When his vacation travels bring him back to that same part of the world, he can’t resist trying to discover what has become of the mysterious infant.He finds that the child, now a lovely young teenager named Isadora, is at the center of complicated web of intrigue involving two feuding kings, a smitten prince, a powerful sorceress, an inhuman monster, and long-buried secrets too shocking to imagine. And once again she needs his help.They say a spider in your cup will poison you, but only if you see it. Eddie, helped by his smart, resourceful girlfriend Liz, must look through the dregs of the past to find the truth about the present—and risk what might happen if he, too, sees the spider.", "title": "He Drank, and Saw the Spider\n      \n          (Eddie LaCrosse #5)", "url": "http://www.goodreads.com/book/show/17910103-he-drank-and-saw-the-spider", "average": 3.99, "cover": "https://images.gr-assets.com/books/1374204265l/17910103.jpg", "reviews": 78, "authors": [{"url": "https://www.goodreads.com/author/show/644349.Alex_Bledsoe", "name": "Alex Bledsoe"}], "type": ["Fantasy", "Mystery", "Adventure", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/17910103-he-drank-and-saw-the-spider", "http://www.goodreads.com/book/show/18603095-he-drank-and-saw-the-spider", "http://www.goodreads.com/book/show/10942400-the-hum-and-the-shiver", "http://www.goodreads.com/book/show/1354323.The_Sword_Edged_Blonde", "http://www.goodreads.com/book/show/16059433-wisp-of-a-thing", "http://www.goodreads.com/book/show/6624577-burn-me-deadly", "http://www.goodreads.com/book/show/8684873-dark-jenny", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}