{"ratings": 174259, "userreviews": [{"userName": "Andreea Pop", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/4858513-andreea-pop", "userReview": "\"Enemy. Lover.Queen.\"\nHeir of Fire is undoubtedly one of the best books I've ever read. It certainly will be my favorite book of the year. It is gloriously long and kept me occupied for an entire day (night hours included) making me crave to find out more, but also stop reading so that the book won't end just yet.You think you know Celaena from reading the first two books, right? Oh, but you're so so wrong. In this book we see her more than broken, relentlessly blaming herself for the fates and deaths of her beloved ones. She takes down her every shield, leaving nothing behind to shed her emptiness threatening to shatter her from the inside out. I believe this was her turning point, the true crossroad in her life, making her see, accept and embrace all that pain, regret and self-loathing she carefully kept hidden inside her soul, etched into her dire and gruesome memories.\n“You collect scars because you want proof that you are paying for whatever sins you've committed. And I know this because I've been doing the same damn thing for two hundred years. Tell me, do you think you will go to some blessed Afterworld, or do you expect a burning hell? You're hoping for hell--because how could you face them in the Afterworld?”\n\nAnd gods, what memories and past. We are able to witness how she became Celaena Sardothien, how her life changed forever on that fateful night ten years ago. But by facing all that sorrow and darkness, she's making a stand. She's slowly becoming a queen, one more powerful and deadlier that you could ever imagine.Her character development is phenomenal, because through her new experiences she is stronger, wiser and more determined. Her fierceness was awe-inspiring and I loved that she's still the same stubborn, snarky and brave young woman, maybe with her ego a little bruised. She's not proud of who she's become, abandoning her kingdom and not fighting for rebuilding it for the past ten years, but she's ready to throw herself into battle to win back her land. To say that she's badass would be an understatement.\nCelaena makes the transition from assassin to queen with the help of Rowan, a Fae Prince and my favorite new addition to the series. Not that he is so eager to help, but in order to find answers about the Wyrdkeys and how to destroy them, she has to be worthy of entering Doranelle, the land where Queen Maeve awaits her to answer her questions. May I shout something? I LOVE ROWAN WHITETHORN. In the beginning, he's infuriatingly patient and stubborn, brooding and secretive. But when he opens up? And when he actually smiles?!? Laughs?? Scrap me off the floor cause I am hyperventilating.\n\n“Gods, he was brilliant. Cunning and wicked and brilliant.Even when he beat the hell out of her. Every. Damn. Day.”\nHe's an alpha-male in all his glory, with the kickass moves that would bring Celaena's to shame. He's scary and intense, protective and defying, caring, but lethal when it comes to his enemies. Rowan is the no-nonsense type and I was glad there is finally someone who doesn't put up with Celaena's bullshit. She throws a verbal punch? He throws one that will leave her with a black eye for the entire week. But they develop a friendship and something so important on the intimate level (not talking about romance) that it will warm your heart to realize that our girl finally has someone to fully rely on. No secrets, no barriers, no judging left between them. They would die for each other, kill for each other, fight for each other. And when they work together, as a pair, as a team, they're astounding and terrifying.\n\n“I claim you, Rowan Whitethorn. I don't care what you say and how much you protest. I claim you as my friend.”\nDorian Havilliard is the same swoon-worthy, sentimental, humble (yet a bit arrogant as well) young prince. He will win your heart regardless of the \"team\" you're in, because in the end he stands up to his father in a glorious way that had me cheering for him. He is way more mature, weary of everyone and everything and you can see him becoming a true worthy king right before your eyes. A lot of heartbreak and despair was in store for him and I guarantee it will all leave you in a pile of overwhelming feels.\nIn addition to his wonderful character development, Dorian is moving on from Celaena. And I'm not sure I like who he's moving on with. Heck, I don't like that he's actually moving on. Makes the whole Dorian/Celaena shipping a bit harder. But truth be told now, as much as I was against his new lady Sorscha, I was glad he got a little happiness and support to fight his growing loneliness, worries and magic. And you want to know why? Because freaking Chaol Westfall pretty much abandoned his friend when he needed him the most.Yeah, you read that right. Dedicated, loyal, selfless Chaol was so unable to make up his damn mind that I was uncounsciously pulling my hair. I was very much irritated with him until the very end when he came to his senses. In the aftermath of Crown of Midnight, his friendship with Dorian is left in shambles and things don't get prettier in this book. They grow estranged, but I'll give it to the captain that he has only the prince's safety and freedom in interest. But keeping secrets, judging, not being able to accept Celaena's and Dorian's powers -- all these things make me wonder if he has any shot left at our heroine's heart, because whereas Celaena would always pick him, Aelin would not.\n“As for Celaena,” he said again, “ you do not have the right to wish she were not what she is. The only thing you have a right to do is decide whether you are her enemy or her friend.”\n\nWe meet awesome warrior Aedion Ashryver, Celaena's cousin and childhood best friend. He's all deadly smiles, muscles and wild behavior. Aedion is daring, clever and doesn't give a rat's ass about anyone but himself. Or so they say. But he's dead set on taking down the King of Adarlan from the inside. When he finds out Aelin is alive, he makes it clear that he would move mountains in order to see his true queen back in Terrasen. He's loyal, determined, skilled and I hope he reunites with Celaena sooner rather than later, because he is in a pretty bad place at the end of the book.\n\"A cry went up from the witches, save for the Thirteen—¬who stayed cool and quiet. They did not need to cheer, for they ¬were immortal and infinite and gloriously, wonderfully deadly.”\n\nAnother addition to the newbie characters is Manon Blackbeak, heir of the Blackbeak coven of the Ironteeth witches and leader of the Thirteen. The witches play a big role in the King's newest and darkest plans by being the riders of the wyverns he has created and Manon wants nothing more than to lead them into battle as Wing Leader. She wants to prove herself and although she is a bloodthirsty, wicked creature, I completely loved her. She's by no means a villain, just a different kind of heroine, firm and unyielding, with great ambition. Her encounters and silent dialogues with Abraxos cracked me up, because in that moments you could glimpse (besides the wyvern's total awesomeness) how Manon starts believing there's a chance she has a heart and soul and that her grandmother's rules might not be the best to follow.\n\n“Witches didn't need blood to survive, but humans didn't need wine, either.”\nThe King of Adarlan is still the biggest bastard I've had the (dis)pleasure of reading. I loathe the guy with every fiber of my being. He is wicked to the core, manipulative and selfish to no end. No, not just selfish, but greedy. Greedy for everything and anything, exactly like a monster. And what he did at the end, to my poor baby Dorian, made me wish that once Celaena comes back -- because she will come back -- she won't kill him. Oh no, I want her to keep him locked in a basement, to visit him everyday and torture him until he breaks, only to do it all over again the next day, because killing him would be too much of a mercy for the deeds he has done.\nThe other secondary characters were very well developed: the Ironteeth witches, Ren Allsbrook, Emrys, Luca and Maeve -- they were a testimony to SJM's awesome writing skills. And I might add that for me the writing style was slightly different. Improved. Better. More realistic, if you wish. There was a certain ease with which she used words that enchanted you completely. Plus, the swearing. I don't mind it one bit, but am I the only one that noticed it appeared more often than in the first two books? Matured characters, matured world, matured language, I guess.\nThe atmosphere is darker and the pace is thrilling, allowing you to breath for a bit before another near-death encounter or epic battle starts. The world-building was another winner, as we were able to see Wendlyn, Doranelle, the Ferien Gap and Adarlan again. We learn about the past, we meet Queen Maeve (who's quite a manipulative bitch), we run from terrifying creatures and we accompany Celaena as she masters her powers.\nThere isn't so much romance in the air, besides Dorian's plotline, because it's the last thing in our character's mind. And honestly, I don't really know who Celaena is going to end up with. Chaol still has issues with her and Dorian is currently viewing her as his friend, but things could still drastically change since there are 3 more books. It seems that even Aedion, her cousin, might have a shot since he wouldn't deny anything his queen would ask of him. And then there's Rowan who I'm not sure will actually have a romantic involvement with Aelin, but it's worth hoping for -- they would be unstoppable.\n“He would not apologize for today, or yesterday, or for any of it. And she would not ask him to, not now that she understood that in the weeks she had been looking at him it had been like gazing at a reflection. No wonder she had loathed him.”\nIn terms of plot, you could say it's action-driven, but I beg to differ: the character development plays a part as big as the twists and turns and fights. It sure keeps you at the edge of your seat, courtesy of Sarah J. Mass' amazing writing, and makes you shudder at some new evil creatures or at the violence, but I basically view Heir of Fire as Celaena's healing journey, one necessary to fully accept her legacy.\n\n“So you’d save another land, but not yours. Why can’t your friend save her own kingdom?”“Because she is dead!” She screamed the last word so loudly it burned in her throat. “Because she is dead, and I am left with my worthless life!”\n\nThe Throne of Glass series slowly becomes a younger version of Game of Thrones (with less deaths, but keep in mind that there are worse fates than death...) and I couldn't be happier. With the same complexity, a gut-wrenching intensity and an amazing world, Heir of Fire brings out the big guns: twists, emotional punches, tearjerkers and amazing characters, not to mention the wonderfully built world. It's definitely the best one from the series yet and a total game-changer, so don't be surprised if it will keep you enthralled from start to finish. Fantasy to its finest, a story with heroes and monsters, Fae and humans, life and death. Read it the second it hits shelves, cause you won't be disappointed (unless you're the type that can't stomach the idea of enduring another year for the next book and to whom I recommend waiting a bit longer, because there is one hell of a cliff-hanger).If you're looking for anything ToG related then check out this Throne of Glass fansite.ENJOY!<3"}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "This is going to be a book that I will constantly be thinking about until I'm able to get my hands on the next book. It was incredible and I'm so happy with the way this story is evolving. NOW GIVE ME QUEEN OF SHADOWS. (full video review coming soooooon)"}, {"userName": "Emily May", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I'm not sure what to say about Heir of Fire. Perhaps I don't need to say anything beyond: it took me months to read it. And I am the kind of crazy passionate reader that finishes good books in a day or two. It's been a while since a book took me longer than a week to read.So basically:I liked but had issues with Throne of Glass.I absolutely LOVED Crown of Midnight.But this book... this book was so... bloody... sloooooowwwwwww.I wanted to DNF it so bad. I kept moving it between my \"currently reading\" and \"on hold\" shelves. I kept wondering if I could possibly just skip the last two thirds of this book and somehow pick the story up in next installment (I was informed that I could not). I have invested so much time and love in this series and these characters that I simply had to make myself finish... but holy shit, it was such a struggle.The majority of this book?So Maas tries to experiment with a bit of something different here and it neither a) works, nor b) fills me with much confidence for the state of the rest of the series. I'm seeing the way this whole thing is going...Book one was fantasy-lite with a simplistic plot, filled with characters lacking in any real development to distinguish them from others in the genre, but it was fast-paced, sugary entertainment. Book two cranked it up several notches; here the characters became more fleshed out and nuanced, the plot was equally engaging but more complex and clever, and there was way more badassery. No complaints at all. And then we arrive at book three. Heir of Fire feels like an attempt to be more sophisticated. It is well-written, contains several stories told through constantly changing POVs, and it is more than a hundred pages longer. And it is far far slower. Maas sacrifices everything deliciously fast-paced and compelling about her series in the first half so we can be introduced to a whole new cast of characters we don't care about, be taken through different (all boring) perspectives, and emerge feeling like we've read an extremely long filler book.Dorian's new romance only served to remind me why I found him unbearably boring in the first book. Celaena - now in Wendlyn - meets a whole set of new people who failed to make any kind of impression on me. Even Chaol - whom I absolutely loved in both other books - lost his charm somewhere amid his own boring plot line. And just when I thought I might be starting to get invested in one of the stories, the chapter would end and I would leave the story of interest for at least fifty pages, guaranteeing that I would no longer care when we finally returned.The most annoying thing about this book is how it wasn't even consistently slow. We'd get tiny little tidbits of awesome that would last a mere two or three pages and I would sit up a bit straighter and think \"This is it. Finally we're getting to the good stuff...\" until I realised it was just a false alarm and the story was still boring. If I'm to give credit where it's due, I will say that I like the way Maas portrays friendships and makes them as important - if not more important - than the romantic relationships. It's an area of YA so often neglected and I find it especially refreshing to see a platonic relationship between young male and female characters crafted so well.I will be reading the next book just because I have to give it a shot, but my expectations have been significantly lowered.Blog | Leafmarks | Facebook | Twitter | Instagram | Tumblr"}, {"userName": "Rachel  (APCB Reviews)", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/12502667-rachel-apcb-reviews", "userReview": "[ Oh Captain... I'm waiting ;) 6/21I am getting a physical ARC copy of HEIR OF FIRE. I AM SO EXCITED.4/24 SJMaas has confirmed that her book is 565 MAGNIFICENT PAGES!! Look at this beautiful cover!!My reaction to seeing this cover:To the designers of this cover I must say:  2/5   THE PAGE LENGTH HAS BEEN CHANGED.  Heir of Fire  is 530 GLORIOUS PAGES LONG  1/24 There is a release date:  September 2nd, 2014 There is a page length:  384 pages  My reaction to these two new details ^^:  1/17  THERE IS A TITLE!!!!!!! \"HEIR OF FIRE\"  My reaction to the ending of Crown of Midnight:  MY HOPES/REQUIREMENTS/NEEDS FOR \"HEIR OF FIRE\":  Chaolaena <3   Romance and Action:  Overall book:  Ending remarks:   (hide spoiler)]"}, {"userName": "Christine Riccio", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "SO GOOD. THIS SERIES. I LOVE IT SO MUCH. Here's my full blown booktalk discusison with all the theories and thoughts: http://youtu.be/yRCCFlvBeu8"}, {"userName": "Lyanna (I need a Herondale in life)", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/25237867-lyanna-i-need-a-herondale-in-life", "userReview": "Oh god.OH GODI just finished this and I cannot -- my thoughts are -- no I can't think straight.There are so many hot guys in this book that it should be illegal.My over-hormonal body cannot take reading about these characters while knowing that I cannot have ANY OF THEM.There's Dorian charming the ever-loving hell out of me:There's Aedion walking into our lives like:Then there's \nRowan:\nlike\nhot damn\n[inhales]small note: Who else was reminded of Prince Ash from the Iron Fey series when reading about Rowan?!?!?!?!?!Did you notice something? Yeah? No? I didn't mention Chaol. Well that's because he was such an annoying, indecisive, self-righteous prick!I just wanted to:Dear Chaol,Full review to come.For updates and news on everything Throne of Glass,Visit the Throne of Glass fansite!"}, {"userName": "Virginia Ronan ♥ Herondale ♥", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/69106439-virginia-ronan-herondale", "userReview": "”She has no hope, Prince. She has no hope left in her heart. Help her. If not for her sake, then at least for what she represents – what she could offer all of us, you included.”“And what is that?” he dared ask.Emrys met his gaze unflinchingly as he whispered, “A better world.”First of all: YES, the rumour is true! This series really gets better and better with each and every single book! ;-)Just thought I’d let you know! *lol*To be honest, after “Crown of Midnight” all I hoped for was that “Heir of Fire” would be able to keep the pace. And tell you what? It actually exceeded my, admittedly, already high expectations! Yes, Sarah! You did an amazing job with this one! I was hooked right from the beginning and I didn’t want to stop to read this damn book!!!I loved this book, I loved it so freaking much! It was so, so, so, so, SOOO, good!!! And I was happy with it, I was SO happy with it!UNTIL… UNTIL the last 20 pages hit me!! ARGH!!! T_TI thought I’d be able to write about “Heir of Fire” without getting all too emotional but as it seems all my plans and good intentions just went out of the window. I can’t write about this book without getting emotional! I just can’t! It was too much!! That ending was too much!!! WHY? \nWHY THE FREAKIDY FREAKING HELL, SARAH!!!!????\nHow could you do this to me??!!HOW?!I LOVE THIS BOOK!BUT I HATE THIS ENDING SO MUCH!I hate it,I love it, I hate that I love it, I love that I hate it! ADSFJKLMNÖ ADKFASLDFJASDKFASDK!*throws book against the wall* *a second time* *for good measure*Okay, I think I’m ready to continue now. *takes deep breath and collects herself*All right! Let’s do this!Just like with “Crown of Midnight” I won’t waste your time by writing about the plot. It’s way too complex to explain it without any spoilers and because of that, I guess it might be best if I just go for another round of “Keyword Boggle”! It was so much fun the last time around, wasn’t it? ;-PSo here I go: Celaena, Dorian, Chaol, Rowan, Aelin, Manon, Abraxos, Sorscha, The King, magic, faeries, witches, darkness, fire, ice, wind, a kitchen, a healer, an apartment, blood, murder, and let’s not forget about the black stones. XDI guess by now you could write your own book! *lol*We’re still speaking about Sarah’s book though, so I’ll head directly into the characters section and won’t keep you in suspense any longer. The characters:\nDo I still have to say it? Yes? Okay! Beware of my characters section because it’s known as the spoilery spoiler section of my reviews! Don’t read on, close your eyes, eat an ice, please think twice, I’m not nice, my reviews have spice. And spoilers, lots of spoilers, but you already know that or you wouldn’t have continued to read that bad rhyme! ;-P\nCelaena:”So you’d save another land, but not yours. Why can’t your friend save her own kingdom?”“Because she is dead!” She screamed the last word so loudly it burned in her throat. “Because she is dead, and I am left with my worthless life!”*sighs deeply* Oh, Celaena! How much pain does this poor girl have to endure? It hurt to read about her feelings after Nehemia’s death, it hurt to read how much she ached and wished she could have been someone else. That she could have saved her friend. That Nehemia would live instead of her. That Chaol would have trusted her. That he would have told her… Oh boy, Celaena’s heart was a black void of desperation and pain that only seemed to get worse before it even got a chance to get better. In the end it did get better though and I’m so happy about that! She finally found her inner strength and she accepted her heritage! Which is awesome, because I really can’t wait for her to kick some ass! *lol* Heaven knows the King’s behind is already a formidable target and please Sarah if there is any justice in your world you’ll let him burn for what he did!!! You’ll let him suffer for all the pain he caused!!! I can’t wait to see Celaena’s power unleashed! Guess the palace is going to be “hot stuff” soon! ;-P”He had chosen the king. Even though he’d claimed he loved her, he still loyally served that monster. Maybe she had been a fool for letting him in, for dreaming of a world where she could ignore the fact that he was captain to the man who had shattered her life again and again.””No, all she could see were the slaves she’d left behind, the ashy mountains and those mass graves they dug every day, the faces of her people, who had worked beside her – her people whom she had left behind. Whom she had let herself forget, had let suffer; who had prayed for salvation, holding out hope that someone, anyone would remember them.She had abandoned them – and she had been too late.””She would not let that light go out. She would fill the world with it, with her light – her gift. She would light up the darkness, so brightly that all who were lost or wounded or broken would find their way to it, a beacon for those who still dwelled in that abyss. It would not take a monster to destroy a monster – but light, light to drive out darkness.She was not afraid.”Chaol:”He was afraid of what they would do to his kingdom. Because this was still his kingdom. He was working for Dorian, not Aelin – not Aedion. And he didn’t know where all of this put him.”YESH! I know it was a long and hard way for Chaol but as it seems he’s finally on the right track! I loved that he began to question everything. He was so insecure and hurt that he had no other choice than to face his outlook on things and in the end this eventually forced him to see behind the kings carefully kept façade. Which is awesome, because I know deep down within him Chaol is a very good man!!! He was just completely oblivious to the fact that the served a monster! Still, I’m glad he decided for Dorian and I swear if Celaena and Chaol don’t do anything about this damn ending, I’m going to riot!!!! CHAOL you gotta help your Prince and rightful king!!!! ”I will not turn my back on my kingdom or my prince,” Chaol snapped. “I will not fight in your army and slaughter my people. And I will not break my vow to my father.” His honor might very well be all he would have left after the end of this.Aedion was quiet long enough that Chaol got up to leave. But then the general said, “What would you have given – just to see her again?”Chaol couldn’t turn around as he said, “It doesn’t matter now.”Chaol kept his sword drawn. “I will not go to Anielle,” he growled. “And I will not serve you a moment longer. There is one true king in this room – there always has been. And he is not sitting on that throne.”Dorian:”Once Dorian might have already said something about it. But having magic, getting drawn into whatever mess Celaena was in, seeing that other world in the secret tunnels … all of that had changed everything. The best he could do these days was maintain a low profile – to keep his father or anyone else from looking too long in his direction.”WHY SARAH??!! WHYYYYY? *breaks down and sobs* Why do you have to use him as a human punching bag? Dorian is so decent and compassionate; he doesn’t deserve to be broken!!! First you hurt him by finding out about Chaol’s and Celaena’s secret, then you kill off his girlfriend and in the end you even let him be forced into the Kings slavery!!?? \nLIKE SERIOUSLY!!?? WTFH!!?? WTF!!?? I CAN’T WITH THIS ENDING!!! I JUST CAN’T!!! HE SUFFERED ENOUGH!!!\n I don’t even want to know what is going to happen now that he’s wearing this freaking collar! He saved Chaol’s life! GODDAMNIT!!! GIVE MY BOY A BREAK!!! Sarah, I swear it here and now if Dorian isn’t saved by the end of book 4 I won’t continue to read this series. I just won’t! I know it’s the author’s right and decision to kill off characters or to make them suffer as they please, but I just can’t take it anymore. Dorian is my cutiepie and cinnamon roll and I think my heart hurts enough! I survived 3 books of ACOTAR watching how my precious Lucien went through hell and I just can’t take this anymore. Lucien never got his happily ever after and it still hurts!!! So no, sorry but no! If Dorian isn’t at least halfway alright after “Queen of Shadows” then I’m quitting this series! Period! I made up my mind! There was so much potential to give Dorian’s character a chance to evolve and to be awesome and interesting! So much raw magic that could have been used, but all that happened was that Sorscha died and Dorian sacrificed himself for Chaol. I’m pissed, I’m majorly pissed! And coming from me that means a lot! So yeah, this wrong is better set right or I’m quitting! I’m serious and I mean it! This said: #TeamDorian forever and for always!!! <333”He’d been a fool once, swearing he would tear the world apart for Celaena. A boy in love with a wildfire – or believing he was in love with one.””Because you’re not really scared of those things, are you? No – it’s what they represent. The change. But let me tell you,” Dorian breathed, his magic flickering and then subsiding in a flash of pain, “things have already changed. And changed because of you. I have magic – there is no undoing that, not getting rid of it. And as for Celaena …” He clamped down on the power that surged as he imagined – for the first time, he realized – what it was to be her. “As for Celaena,” he said again, “you do not have the right to wish she were not what she is. The only thing you have a right to do is decide whether you are her enemy or her friend.””We’re all risking something.” There was so little of the friend he’d grown up with. The prince glanced at his pocket watch. “I need to go.” Dorian stalked to the stairs, and there was no fear in his face, no doubt, as he said, “You gave me the truth today, so I’ll share mine: even if it meant us being friends again, I don’t think I would want to go back to how it was before – who I was before. And this …” He jerked his chin towards the scattered crystals and the bowl of water. “I think this is a good change, too. Don’t fear it.”Aedion Ashryver:”Handsome was a light way of describing what Aedion was. Overwhelming was more like it. Towering and heavily muscled, Aedion was every inch the warrior rumor claimed him to be.”I like Aedion! I like him a lot!!! He’s such a tortured soul and he tried everything possible in order to protect his people! He was an intriguing new character and I can’t wait to see more of him. I really liked his interactions with Dorian because they were so much fun! *lol* Those two have a lot of potential to become close friends, but I guess the ending of this book kind of nullified that possibility. Still, I want Aedion’s noble and brave soul to be rescued as well and I don’t even want to know what the king is going to do with him. T_T I hope Aelin returns soon because her boys definitely need her right now! Poor Aedion, he waited for so long!!! And if I’m already at it! He saved Chaol’s ass too, so Chaol better get his groove on! He needs to make plans to save him as well! XD”Cousin – that had been his most beloved title. Cousin, kin, protector. Those were the secret names he harboured deep within, the names he whispered to himself when the northern wind was shrieking through the Staghorns.””Aelin would come back from Wendlyn, no matter what the captain believed. Aelin would come back, and when she did … With every breath, Aedion felt that lingering scent wrapping tighter around his heart and soul. When she came back, he was never letting her go.””All you monsters can burn in hell. Because my queen is coming – and she will spike you to the walls of your godsdamned castle. And I can’t wait to help her gut you like the pig you are.” He spat at the king’s feet, right on top of the fake ring that had stopped bouncing.Rowan:”She noticed then that his arms were bandaged, and more bandages across his broad chest peeked up from beneath his shirt. She’d burned him again. And yet he had held on to her – had run all the way here and not let go once.”The fierce, broody and intense warrior! I like him even though I have to admit that his abilities as a teacher kind of lack experience. *lol* Still, he’s a decent fae and despite the way he acted at the beginning of the book his heart actually seems to be in the right place. I loved that he took care of Celaena once he realised why she’s so broken and I suppose their fight at the beginning was kind of necessary. They both needed to let off some steam. XD I genuinely hope we’ll see more of him in the next book, because I feel like there is so much more to tell! ;-)”How – how did you come back from that kind of loss?”“I didn’t. For a long while I couldn’t. I think I’m still … not back. I might never be.”She nodded, lips pressed tight, and glanced toward the window. “But maybe,” he said, quietly enough that she looked at him again. He didn’t smile, but his eyes were inquisitive. “Maybe we could find the way back together.”Manon:Silent as death, Manon slid up behind him. The fool didn’t even know she was there until she brought her mouth close to his ear and whispered, “Wrong kind of witch.”I’M IN LOVE WITH MANON BLACKBEAK!!! This woman is so savage and fierce! I love it! *lol* As it seems for once my prayers were answered! I got more of the iron teeth witches and I loved every single chapter! XD Manon is so damn amazing! I just couldn’t get enough of her and followed her storyline closely. Truth be told, I just want to lean back and watch how her and Abraxos change the world. Haha! I disliked Manon’s grandmother a lot though and even though she became Wing Leader I’m pretty sure there will be some major estrangement in the future. Still, I loved Manon’s connection with Asterin and her Thirteen and I really hope they’ll always be at her side. Maybe Petrah will join them one day? Idk! I truly hope she’ll be fine some day because I really liked her too. >_<”You’re mine,” Manon said to him.The wyvern blinked at her, Titus’s blood still dripping from his cracked and broken teeth, and Manon had the feeling that he had come to the same decision. Perhaps he had known long before tonight, and his fight with Titus hadn’t been so much about survival as it had been a challenge to claim her. As his rider. As his mistress. As his.””And Manon, because no one was watching, because she did not care, flung out her arms as well and savoured the freefall, the wind now a song in her ears, in her shriveled heart.””You touch him again,” Manon said, “and I’ll drink the marrow from your bones.”The friendships & ships:Chaol & Dorian:He met Dorian’s gaze. There was nothing kind in it. But Dorian said, “I’m trying, Chaol.”Trying, because Chaol’s not consulting him on the plan to get Celaena out of Adarlan had been a breach of trust, and one that shamed him, though Dorian could never know that, either. “I know.”Oh, those two broke my heart! I really wanted them to solve their problems and then this damn ending came along!!! ARGH! They need a chance to fix all this! Sarah give them a chance, please!? They deserve it! And OMG Chaol told Dorian that he loves him!!! Way too late but he did it!!! <33 I just want my two boys to be happy and friends again. *sobs* They both suffered enough in those last two books, they really deserve some peace!!! And to take away their chance to make amends!! So mean, Sarah! So, so mean!!! >_<”You think I’d run to my father?” The words were barely more than a strangled whisper as the temperature plummeted.Chaol stepped forward, putting himself between Aedion and Dorian, his palms exposed. Placating. “I can’t afford to guess – to hope. Even with you.””You cannot pick and choose what parts of her to love.” He pitied Chaol, he realized. His heart hurt for his friend, for all that Chaol had surely been realizing these past few months. “Just as you cannot pick which parts of me you accept.””He looked at his friend, perhaps for the last time, and said what he had always known, from the moment they’d met, when he’d understood that the prince was his brother in soul. “I love you.” Dorian merely nodded, eyes still blazing, and lifted his hands again towards his father. Brother. Friend. King.Sorscha & Dorian:”She usually talked like this when she was nervous. Which, Dorian had noticed with some satisfaction, was when he came near. And not in a bad way – if he’d sensed that she was truly uncomfortable, he’d have kept his distance. This was more … flustered. He liked flustered.”I suppose their relationship was doomed right from the beginning but I still would have liked it to work out. They were so sweet together, but I can’t shake the feeling that I missed some major parts of their plot. I really wish Sarah would have given us more of them because to me their entire storyline felt kinda rushed. Still, I was glad Sorscha helped Dorian to hide his magic and her being a spy was such an unexpected plot twist. >_< It really killed me when the King ordered her death and I can’t even describe how much Dorian’s pain hurt me! T_T I’m still not over this… probably I’ll never be!”Yes,” he breathed, and kissed her. It was fast – but her face was flushed, and her eyes wide as he pulled back. His own eyes were wide, gods be damned, and he was still rubbing his thumb against her soft cheek. Still contemplating going back for more, because that hadn’t been nearly enough.”Celaena & Rowan:”Why don’t you just bite me again?”“Why don’t I give you the lashing you deserve?”He looked so dead set on it that she blinked. “If you ever take a whip to me, I will skin you alive.”Oh, ho ho! Those two!! So much passion, so much pain! They were quite a sight to behold! *lol* I loved how their initial animosity turned into a solid friendship and I was so glad Celaena finally told someone about her past! This was so damn necessary and I’m glad Rowan was there to listen to her troubles and fears! <3 I’m sure they’ll become lovers in the future, but as it seems Sarah just wants to torture us a little bit more. ;-P After all she’s good at that, torture seems to be her middle name! XD Bet the J. is just a fib! Haha!”It was a selfish wish, and a fool’s hope.” She read the rest of it in his eyes. But it came true. “Dangerous, for a prince of ice and wind to pray to the Fire-Bringer,” she managed to say.Rowan shrugged, a secret smile on his face as he wiped away the tear that escaped down her cheek. “For some reason, Mala likes me, and agreed that you and I make a formidable pair.”Okay, I think I ranted enough now. *lol* So yeah, I hope I’ll get my hands on “Queen of Shadows” soon and that my precious Gem will continue this journey with me! I even wrote nice things about Chaol!! That’s got to count! ;-P"}, {"userName": "Zoë", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "BEAUTIFUL. JUST SO DANG BEAUTIFUL.I loved the new characters (except Sorscha) and it was just a wonderful book. ESPECIALLY BECAUSE OF MANON. AND ROWAN. AND CELAENA (duh).Now where's my copy of Queen of Shadows?"}, {"userName": "Steph Sinclair", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "Reasons why I didn't like this book:- It was dull as dirt- It was waaaaaaaay too long- I was so tired of the angst, no matter how justified it was- Rowan is overrated. There, I said it.- I fell asleep listening to the audiobook over 15 times. 7 alone for the last 10%.- The chapters with the witches felt SO POINTLESS. (BTW, the king outlawed magic, but witches are okay? dafuq? Oh well, I don't care.)- I feel like each book follows the same plot: Celena trains. Celena fights with cute guy. Mysterious monster is killing people. Celena kills monster. Fin.UGH. I CAN'T."}, {"userName": "Ben Alderson", "userReviewDate": "Aug 14, 2016", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "THERE IS LITERALLY NOTHING BETTER THEN THE PROGRESSION OF THIS SERIES.. THIS MIGHT BE MY FAVOURITE ONE SO FAR!"}, {"userName": "Wendy Darling", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "4.5 bloody, beautiful starsThe adrenaline, the heartbreak, and the sweeping epicness of this story just slay me. What the hell am I supposed to do now? *weeps piteously*Also, I imagine Manon smiling calmly as she rips out your heart. :D"}, {"userName": "Miranda Reads", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "Ohmygosh. The Maas-ter has done it again\nShe was the heir of ash and fire, and she would bow to no one.\nThis one was so freaking good. Honestly, when was the last time that the third book in a series was just as good as the first?Celaena -  deadly, battered and broken  - is sent to a neighboring kingdom. She must find a way to destroy the wyrdkeys to save the kingdom (and possibly the world) from the rule of a corrupt kingdom. \nAnd then I am going to rattle the stars.\n Manon - ruthless, disciplined and wicked  - is of the blackbeak witches. She's sent to join the corrupt king's army as a wyvern rider and manages to raise hell while doing it. \nThere were few sounds she enjoyed more than the groans of dying men, but the wind was one of them.\n Chaol and Dorian - prim, proper and honestly bit boring - must deal with their ever-collapsing kingdom. From mass murder to magic mayhem, this year is going to the ultimate make-or-break for them. \nHe would see that world reborn, even if it took his last breath. Even if he had no name now, no position or title save Oath-Breaker, Traitor, Liar.\nSarah J Maas manages to weave these three unique storylines  together in such an unforgettable way. I could hardly read this one fast enough. I cannot wait to get my hands on the next!P.s. Young Celaena is possibly my fave character ever. \nHer dearest friends are characters in books."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "*Reread January 2016*Reread to refresh my memory because wow I forgot everything. This is my least favourite of the series so far, but I still loved it. I just found it to be a very informational, plot advancing book with not a lot actually happening, but I will be doing a video review for it soon so stay tuned for that!*Originally read May 2015*I need Queen of Shadows now please"}, {"userName": "Khurram", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/25493797-khurram", "userReview": "Brilliant. Sarah J Maas is becoming my favourite author. Her writing style is engaging, engrossing, intelligent, and easy to follow. Her imagination and storytelling are amazing. This story is a lot slower than the Crown of Midnight; it concentrates more on the character development.At the end of the last book we learned not only who Celaena Sardothien really is but also what she really is. Her relationship with Chaol is in tatters. Having \"suggested\" to the king to send her on a mission for her own protection, and cutting Prince Dorian out of the loop, Chaol is in no man’s land. Distancing himself from Dorian, for Dorian own protection, he starts to do his job notices some irregularities with a certain high ranking general. This forces Chaol to make some decisions of his own, how long can a good honourable man serve a tyrant like the King of Aldarlan and his many atrocities.Dorian is more alone then he has ever been, but he does manage to find solace. Finding company is not really difficult for a handsome prince, but who can he trust. This is triply difficult as he has to not only keep his own actives which his father will not approve of secret, his friends secrets, and most of all his magic.We are also introduced the Iron Teeth Witch Clans and especially Manon Blackbeak. Meanwhile Celaena detours from her mission and pursues her own agenda. Meeting forgotten and powerful relatives. Before she is allowed to get the answers she wants she must claim her heritage (her powers). She must learn to control them and master them all the while putting he shattered life and her past. I really like the way she has to train and relearn everything. Just because you are in a stronger body does not mean you can control it especially in a fight situation.Great story, very character driven and impossible to put down. I kept thinking I will just read one more chapter, and flicked a few pages and thought ok I will stop at the next section break, or that's a short chapter might as well finish it. Suddenly half quarter of the book was gone. Despite being 550+ pages the book just flies by. It sets up the next book excellently including a confrontation I have been begging for since the first e-novel."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jun 04, 2014", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Re-Read on Audio! I'm loving these re-reads on audio, they make the world come to life. That is if you have a great narrator and Elizabeth Evans rocks it out on these books. It took me forever to listen to this one. I walked the room, colored, looked at pictures. Lol, now I have to move on to the next book after I listen to It, which will take six months! But, still loving it! It was awesome to hear Manon in action action and everyone else! Holy crow! www.melissa413readsalot.blogspot.comI AM IN LOVE WITH ROWAN WHITETHORNRowan is the absolute best hero I have read in a long time. He's Fae and he's hot and he takes no prisoners. He is bad to the bone and then some! He can shift into a beautiful hawk. He has a lot more magic than that though. Celaena Sardothien...Aelin Ashryver Galathynius..Fireheart... Heir of two mighty bloodlines, protector of a once-glorious people, and Queen of Terrasen! Celaena is being trained by Rowan, they have a hate-hate relationship...in the beginning. Then when Rowan finds out more about Celaena and her life he starts to like her, feels protective of her. It's is awesome, they are awesome and I'm hoping they are going to be mates!! Rowan trains Celaena in her magic, she has fun magic, she's not called fireheart for nothing. She can burn everything! I have to be truthful and say I didn't care anything about what was going on with Chaol or Dorian. And I definitely didn't care about Manon. Their stories were nothing compared to Rowan and Celaena. I just wanted to read about them. I loved learning all about Celaena's back story. I mean she has a lot going on now. She so much more than what people think. She's still bad to the bone, just even more so. The full five stars I'm giving this book is for Rowan and Celaena, nothing else. They just rocked my world and that's all their is too it. I have no idea what everyone else was doing, to a certain extent anyway. There are some evil things going on in the world of the Fae and other places and it's up to Rowan and Celaena to put a stop to it. I Love them! I think I said that a few times :) On to the next!! They better get together in the next book. They were born to be mates. I'm going to throw something if they don't! Just know it!"}, {"userName": "Emma Giordano", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "I definitely enjoyed this book more the second time around! It still is not my favorite in the series, but I'm SUPER glad I gave it another shot. What's funny is, the first time I read Heir of Fire, I skipped over many of Manon's chapters because I just wanted to read about Celaena, but this time, I was more bored with her chapters and was WAYYY more invested in Manon's!As Heir of Fire is what stopped me from continuing the series back in 2014, I am definitely more motivated now! I think I'm going to take a short break because this book was a LOT to listen to, but I am 100% planning on finishing this series in the near future."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Apr 12, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "Fireheart – why do you cry? “Because I am lost,” she whispered onto the earth. “And I do not know the way.”This is seriously one of the most emotional books I've ever read. I'm going through this series for the fourth time and need to rewrite this whole fangirling review in some attempt to explain how amazing Maas is… (There might be a minor spoiler with how I refer to Celaena in the next sentence, buuuut I'm not sure how anyone's avoided that by this point): this is the book where it’s kind of confusing whether I should call her Celaena or Aelin because she’s both, yet neither.The series has always been about Celaena’s journey for me, so this is definitely my favorite Throne of Glass book. This is the point where she faces her past, tries to forgive herself, and finally accepts herself as Aelin. She completely breaks apart, finds herself at rock bottom, and rebuilds herself into a new person. Her character growth is brutally raw and just incredibly & painfully realistic. My personality is COMPLETELY different from hers, yet I have never connected with a character this much. You can actually feel her despair, isolation, grief, and guilt. The whole story is an emotional rollercoaster and is still one of the few books that can make me legitimately tear up (that whole \"get up\" scene towards the end... omg). Celaena spends most of the book training with Rowan, who’s also trying to heal in his own way. (The way that Feyre & Rhys helped each other recover from Under the Mountain kind of parallels Aelin & Rowan’s journey). They're both broken but figure it out together: \n”Someone who might – who did understand what it was like to be crippled at your very core, someone who was still climbing inch by inch out of that abyss. Perhaps they would never get out of it, perhaps they would never be whole again, but…“Together she said, and took his outstretched hand. And somewhere far and deep inside her, an ember began to glow.\nAll of her character growth in this book is beyond impressive and SO well executed. The last 20% of this book is intense, but the rest of it moves at a slightly slower pace (which still totally works). So the second and fourth books are a lot more action-packed, but I think this third book REALLY gives the series the character growth and substance it needs in order to be so powerful.Side note: I feel like characters usually need to break and seriously remake themselves in order to be as strong as Aelin ends up being. Otherwise it's just some hollow facade. (And \"badass assassin\" is not Celaena's whole identity or personality... it's a persona she adopted in order to survive. She is more than that front. Complex characters are possible).Manon is my favorite character in this series, so I might also love this book because she's finally introduced. But the characters I initially thought I wanted to see more of, like Chaol and Dorian, weren’t terribly interesting in this book. Dorian mostly tried to find ways to hide his magic and wound up in increasingly worse situations. Chaol sat in a lot of different chairs in different locations. Aedion walked a lot… they pondered stuff. Their stories were fine but mostly a lot of preparing for the next book.I really don't understand how people say Chaol's out of character in this book, though. He's in a confusing place and his entire identity is in question since he can no longer stand by everything he swore to defend. I actually don't think anyone's out of character here because people grow & change with life’s events and Maas does a great job of showing that. Especially with Aelin:\n\"She didn't know what she needed... If she felt like admitting it, she actually didn't have the faintest clue who the hell she was anymore. All she knew was that whatever and whoever climbed out of that abyss of despair and grief would not be the same person who had plummeted in. And maybe that was a good thing.\"\nOh, and my favorite part of this book is actually the setting of Mistward. Is it horrible that I'm a tiny bit hopeful that the last book will go back there..."}, {"userName": "Regan", "userReviewDate": "Apr 24, 2014", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "This was everything."}, {"userName": "Elisabeth Wheatley", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/8016233-elisabeth-wheatley", "userReview": "A year? I have to wait another year? I can only hope that I live that long and don't die of anguish first.And Celanea and Chaol had BETTER get back together in this one or There. Will. Be. BLOOD."}, {"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "3 - 3.5 StarsMaybe I will review this later, maybe I won’t...Regardless. The most important thing you need to know about my totally non important thoughts on this book is this: Helloooooooo Rowan.Hubba hubba.Other than that, some parts moved like a ship through mud; but in the end, I really loved seeing our protagonist come into her own here. I live for special powers, yo. But really...Hubba hubba, ROWAN."}, {"userName": "Chelsea Humphrey", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "\"She was the heir of ash and fire, and she would bow to no one.\"I know that this seems to be everyone's least favorite ToG installment, but I personally thought it was the strongest I've read (so far). Going into this series at such a late date meant I was aware of all the major spoilers before reading them, and I was truly ok with this; I like being prepared and knowing when my heart can finally focus on a coupling that may last for awhile. But seriously, I was thinking she would have a new love interest in every single book there for awhile. I tried picking this one up months ago and set it aside after 130 pages because I was stressed with other stuff and a bit overwhelmed by the 90 different POVs that were ever-changing. I still stand by my original thoughts that the first 150 pages of this book are pretty slow and dull, but after the action started kicking in I was hooked. \"...Her beloved dead. No longer would they be locked away in her heart. No longer would she be ashamed.\"I enjoyed HoF more than the previous two books for many reasons; we finally get out of that drafty castle, we start to receive some answers to a good deal of the vague plot details involving the rebel causes, and we see some major growth in Celaena fulfilling her destiny. I love how messy the dialogue and interactions were at times; once we got past the initial repetitive sparring between Rowan and Celaena, the narrative fell into a more natural flow and I was able to get lost in the story. I've seen a lot of talk about how the series changes at this point because it's about when SJM began writing ACOTAR, and we do see a lot of similarities in the personalities and actions of the characters of both worlds, so I guess it makes sense that this was the first book that really feels like the start of the series. I keep feeling like everything up until this book was just \"prologue\" and \"backstory\"; this novel is where we buckle down and take off and stop chasing our tail in circles. Also, many more BA fight scenes here. Can we just talk about the real reason we read this book-Manon Blackbeak? Sister stole the show; she is quite possibly my favorite character of the series and I could read entire books just about her and from her perspective. I was completely engrossed in the sections featuring The Thirteen and everything revolving around such. Again, while I know where the major plot sections are going, I can't wait to see how the little details unfold along the way. I would say I highly recommend this for those who have been struggling with the series up until now, but 1) I'm pretty much the last person to read this and 2) I'm in the minority so I'm just weird I guess. Hoping to pick up the next one soon now that my ToG momentum is back!"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "[\n\n(hide spoiler)]"}, {"userName": "Mitchii", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/4808951-mitchii", "userReview": "Heir of Fire left me a bit conflicted. I’m a big fan of the first two books even though I admitted how fussy I am with this genre. But this series proved me wrong—twice. Now, in the mood to read it, I braced myself with expectation based on my previous experiences. But it came to a point where all these development stirred clear from what I know of the series.If anything else, this third installment was without a shadow of doubt a set-up. Sure, there are tons of things that needed to develop did develop. Revelations were deemed to unfold, unfolded; but all those things changed my entire perspective of the story. Like the first two books were nothing but an introduction albeit a long one and we were now in this place where it actually started. In which is not entirely terrible. But I came to love all the things that happened in the first two and to see them changed didn’t sit well too much with me. At least at the beginning.Now that I have let the nit-pick parts admitted, let me emphasized on this new journey. Celeana might have great bloodline(s) running through her veins and looks like from there things are getting harder and harder for her. But not without new companions. I didn’t embrace them fully at first. There are quite few additions to the story and one that standout for me (all thanks to Celeana at one point did appreciate what a fine specimen her new companion is) was Rowan. Ok, as a big Chaol fanatic that I am I saw him at the beginning a threat. No, not in ship war kind of thing but of my own opinion. He made me feel like treading on tightrope whether he’ll win me or not. But he did. I’m inclined to love character that has loyalty (which at first had me questioning why) to the female MC (ala Hak from 暁のヨナ or Obi from 赤髪の白雪姫).So where were the two main men before? This is not solely Celeana’s journey for sure, those two have problems of their own. Chaol was little…confusing for most parts (which was why I’m bit disappointed) but if it means for his character growth then I’m all for it. But my man Dorian is fighting back. I love the attitude, keep that up! And well, I smell potential romance for him? Well, I’m glad for him (was there really something solid happened more than flirting? I beg to differ.).Going back to what I mentioned earlier, it was a set-up. After reeling everything in, pounded it in my head plenty of times; it actually made sense. And if I were honest that last line about Celeana’s true identity is bound to leave a big tremor! Hopefully something I can fully comprehend and like this time (optimism FTW).3.5/5Originally published at The Aeropapers.Pre-reading comment:Update: 01/18/14: We have a title, people. HEIR OF FIRE! Sounds really bad-ass!!! Still here for the Captain of the Guard, Chaol Westfall."}, {"userName": "jessica", "userReviewDate": "May 19, 2018", "userURL": "http://www.goodreads.com/user/show/10171516-jessica", "userReview": "im running out of ways to praise the masterpiece that is SJM storytelling. she tends to be simple in her writing, but a rawness and vibrancy comes through in that simplicity, which makes the story easy to devour. and this third instalment is no exception; if anything, its even better! i loved learning more about celaenas past (which i have been desperate for since book one) and i enjoyed seeing chaol develop as a character. if i could change anything about this book, however, it would have been to not separate the main characters. i hate it when the plot of a book allows for a separation because i spend the entire book waiting forever for everyone to be reunited again. so i am very much looking forward to that reunion in the next book! \n4 stars"}, {"userName": "Cece ❀Rants, Raves &Reviews❀", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/66199133-cece-rants-raves-reviews", "userReview": "I dont think you fuckers realize how fecking amazing this book is \n“So she steeled herself. “I have never told anyone this story. No one in the world knows it. But it’s mine,” she said, blinking past the burning in her eyes, “and it’s time for me to tell it.”\nThis series is either a love or hate for most but either way you have to admit how \nbrilliant\n the writing is. Celaena/Aelin our heroine, broken and exhausted by life\n“You cannot pick and choose what parts of her to love. You do not have the right to wish she were not what she is.” \n But she learns to embrace her powers and contol them. Sometimes it takes a monster to fight a monster.\n“Perhaps they would never get out of it, perhaps they would never be whole again, but … “Together,” she said, and took his outstretched hand.And somewhere far and deep inside her, an ember began to glow.”\nAnd in general Aelin’s story is just fucking amazing and complex and intricate and everything has meaning and comes together and this world is just awesome\n“She told him of the years in Rifthold, of stealing Asterion horses and racing across the desert, of dancing until dawn with courtesans and thieves and all the beautiful, wicked creatures in the world. “\nAelin is so much more developed and with her every move you lover her more. Her story has become so much more than a simple assassin trying to buy her freedom, but a powerful queen willing to fight for everyone’s freedom....once she masters her powers \n“She was not its slave. She was no one’s slave anymore. And if Rowan threw one more damned dagger at her face— He did.”\nThat firebreathing bitch. And of course I fell in love with Rowan\n“Wipe that smarmy, lying smile off your face.” His voice was as dead as his eyes, but it had a razor-sharp bite behind it.She kept her smarmy, lying smile. “I don’t know what you’re talking about.”\nAnd even Rowan found out that she is so much more than the deadly insane assassin persona she showed to the world for so many years. And really how could he judge, the fucking fey assassin for fucking queen Maeve\n“At least if you’re going to hell,” he said, the vibrations in his chest rumbling against her, “then we’ll be there together.”“I feel bad for the dark god already.”\nAnd the training scenes were hilarious. She didnt just suddenly master the epic power of fire but had to learn to control it and fucked up quite a bit to be honest\n“But each morning brought something new, something harder and different and miserable. Gods, he was brilliant. Cunning and wicked and brilliant.Even when he beat the hell out of her. Every. Damn. Day.”\nShe began the story as Celaena: assassin of Adarlan beytrayed by loved Chaol, manipulated by Nehemia and scared of her own power and destiny. She ended the story as Aelin Ashryver Galathynius\n“She was as much a queen as Maeve. She was the sovereign of a strong people and a mighty kingdom. She was the heir of ash and fire, and she would bow to no one.”\nAnd it all comes together with my favorite quote from the first book\n“I will call in every favor, every debt owed to Celaena Sardothien, to my parents, to my bloodline. And then…” She looked toward the sea, toward home. “And then I am going to rattle the stars.”"}, {"userName": "☆♥☆Kotyonok♥☆♥ ", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/6713906-kotyonok", "userReview": "[and of course the only nice character, Sorscha, had to die!  (hide spoiler)]"}, {"userName": "Yonaily ", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/22496761-yonaily", "userReview": "“Once upon a time,” she said to him, to the world, to herself, “in a land long since burned to ash, there lived a young princess who loved her kingdom.... very much.”\nSo, we're back to book one. Throne of Glass was good, but it was obvious that the book was the first in a series, because you all noticed the inconsistensies and flaws. Now we're talking about a third installment and, after how awesomely flawless Crown of Midnight was, I was expecting Heir of Fire to be just as good. I'm gonna start with Dorian. In book one his relationship with Celaena ended for the sake of character development. Then, in Crown of Midnight his character does more than just be around his father's castle, and it's all to find himself a purpuse: magic. So, I thought that in this installment Dorian would try to learn how to control magic so his father wouldn't find out that little secret about his heir. But that didn't happen. Why? Sorscha. She was obviously a plot device reserved for the shocking ending of the book, but the way Sarah J. Maas ignored all that happened to Dorian in Crown of Midnight KILLED ME. He went back to the same yound bored prince who's tired of council meetings we met in the first book, and all because of a romantic subplot. Strike one.Sorscha is a servant--healer--of the castle and has been conveniently hidden with a cape of invisibility until now. I would have bought that had SJM added at least one POV of her in the past books. She is mentioned near the end of book two, but it isn't until this one that we get to know her. One small detail that doesn't make sense is how she reacts when finding out Dorian can summon magic. It all happens as an accident, but she doesn't get surprised or shocked as you would expect. Instead she so eagerly proposes to help the Prince find a way to control and hid his power from others. Another thing is that Sorscha is secretly in love with the Prince (who knew!), and he ends up falling for her. Their relationship was cliché. Tedious. Their chapters made me want to go to sleep, to be honest. A new romance at this point didn't make sense since Dorian should have been focused on magic. \nDorian was heir to the mightiest empire in the world, and Sorscha was the daughter of two dead immigrants from a village in Fenharrow that had been burned to ash—a village that no one would ever remember.But that didn’t stop her from loving him, as she still did, invisible and secret, ever since she’d first laid eyes on him six years ago.\nSeriously, Sarah? Chaol, oh Chaol. My precious cinnamon roll (yes, I just said that) has proved, once again, why he's my ultimate favorite character in this series. I just adore his character development and how much he's changed and learned since I met him in book one. But if there's something that bothers me is how much hate he gets. Chaol can't even breathe without getting blamed for Nehemia's death. I wish SJMAAS would stop using that argument on him because 1) that wasn't under his control, and 2) Nehemia practically killed herself. \nIt was not his fault that Nehemia died, not when the princess had orchestrated everything. Yet he had kept information from her. He had chosen the king. Even though he’d claimed he loved her, he still loyally served that monster. Maybe she had been a fool for letting him in, for dreaming of a world where she could ignore the fact that he was captain to the man who had shattered her life again and again.\nCHAOL DIDN'T KILL NEHEMIA 2k15\n“I have magic—there is no undoing that, no getting rid of it. And as for Celaena....” He clamped down on the power that surged as he imagined—for the first time, he realized—what it was to be her. “As for Celaena,” he said again, “you do not have the right to wish she were not what she is. The only thing you have a right to do is decide whether you are her enemy or her friend.”\nAnyway, his character arc has a very significant role in Heir of Fire. I liked how he started questioning everything he had been taught to believe about the King and his Kingdom. Chaol's somehow still loyal to Adarlan, but now his friends are much more important to him. That is why he sent Celaena away to Wendlyn and doesn't want to know anything about Dorian's powers. He wants them to be protected, but some people mistake that as if he doesn't accept them, which doesn't make any sense. Everything he has done is because he cares about them. Chaol has nothing left. He literally threw everything away by sending Celaena to where her relatives were. And trust me, if he didn't accept them as some say, he would have gone straight to the King to tell him about Celaena's true nature and Dorian's powers. And they would be dead already. But in this book he becomes a traitor to the King by working with Aedion Ashryver BECAUSE HE CARES. He has always cared about Celaena and Dorian and he never, ever, gets the credit he deserves. So I'm here to defend him no matter what.#CHAOLWESTFALLDEFENSESQUADCelaena's chapters were definitely the most interesting aspect of this book. She arrived to Wendlyn full of hopelessness given the death of her best friend, and we get to explore her past more deeply. But it was hard to see her this way, because the assassin we all grew to love was showing a different and vulnerable side we are not used to. And I have to say that I have a love-hate relationship with this new Celaena. To become who she really is--embrace her real identity--she needed to reach bottom. And hell if she doesn't. So, Heir of Fire was more like a healing process for her. Celaena went back to her roots, faced her demons, found herself a new alley and now she is stronger than ever. Now, Rowan. Once in a while I come across a very strong and capable and sexy as hell male character who looks insanely handsome and gets the attention of all the readers. He's precious and beautiful and badass and blah blah blah, but lacks of personality. That is Rowan Whitethorn. I get it--I get why everybody adores him. However, he's more like that poster of your favorite guy from your favorite boyband that you put on your wall (never been there, actually). You wake up every morning and see him right there, looking at you, looking sexy af. But he's not real--he's just a poster. Empty piece of paper. (Yes, I just called Rowan empty.) And can we talk about how problematic Rowan actually is? He treated Celaena like sh**. He punched her and make her believe it was all her fault. He told her she was a coward who whould be better off dead. And worse...\nLashing out at Rowan like that, saying the things she did, trying to fight with him... She’d deserved that punch. More than deserved it. If she was being honest with herself, she was barely passable as a human being these days. She fingered her split lip and winced.\nNO. FUCKING. WAY.But after all that, when he watches the scars Celaena will forever carry on her back as a reminder of her year in Endovier, he has te audacity to feel guilty. \nSorry but you're already doomed to the \"never in this life\" list, boy.\n Rowan saves her and, by the end of the book, he kind of sort of belongs to her. I don't want to believe something will happen between those two. I hope not because they both insisted on that everything about them was platonic. But just in case.\n“I claim you, Rowan Whitethorn. I don’t care what you say and how much you protest. I claim you as my friend.”\nfriend. Friend. FRIEND.\nIt was a damn good thing Rowan had no interest in her, either, because she knew she was stupid and reckless enough to consider whether moving on in the physical sense might solve the problem of Chaol.\n\n\nThere was nothing romantic about sharing a bed with Rowan, and they kept to their own sides.\n\n#NEVERFORGETRowan is not the only new character in this book. Manon Blackbeak is one of the Blackbeak Witches, heir and leader of The Thirteen. I loved reading her chapters, although they could get tedious sometimes. She's fearless and cold-blooded and I like that about a character. I can see a infinity of escenarios for her, particularly now that she has Abraxos. What a lovely and highly-lethal pair. Reading about them was like watching How to Train you Dragon. Manon herself reminded me of Daenerys Targaryen from Game of Thrones because of her pale hair and her dragon companion. So I wish SJM were a little more careful with those details. But I adore Manon anyway.\n “You are one of the Thirteen,” she said to him. “From now until the Darkness cleaves us apart. You are mine, and I am yours. Let’s show them why.”\n Let's talk about this shocking finale. SJM's has a very compelling and captivating writing, which helps out a lot given the fact that I'm a sucker for YA High Fantasy (I've said this like a million times). And it worked perfectly in those last hundred pages of the book. Those moments were action-packed and got me chewing my nails. And the feels--oh the feels. \nHe looked at his friend, perhaps for the last time, and said what he had always known, from the moment they’d met, when he’d understood that the prince was his brother in soul. “I love you.”\n\nHe’d known, since the moment he figured out who she was, that while Celaena would always pick him, Aelin would not.\nI AM NOT CRYING. I AM PERFECTLY FINE. I. AM. FINE. OK. Now what I didn't like.1) Aedion, who's creepy and boring and too possessive over Aelin. I don't like him. At all.Strike two.2) Some plot-holes here and there. The most obvious one was Celaena spending several months training in Wendlyn with Rowan. She could have easily escaped for all the watch the King of Adarlan put on her. It doesn't add up since she's his fucking employee. You would think The King would like to keep an eye on his Assassin. But no one cared about bringing that up. Along with Dorian's awful character arc and the huge romance subplot, those were my issues with this novel, which kept me from rating it more that three stars."}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Jan 29, 2016", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "Updated** 8/17... after rereading - I am STILL floored but I have so much more to say this time around. (Also check out Cait's review because it says everything I was trying to say and more.)Wow this was a difficult review to write because this book was 100% emotional for me.I'm gonna get a little opinionated first, then I *promise* to get more lighthearted ;) ;) AND I promise to spare you of my SJM speech but you can read it in my other reviews.One of the biggest complaints that I've seen about this book is the fact that Celaena, our resident heroine and badass extraordinaire, is no longer herself. (Literally, I've read like 10 reviews today alone complaining about this.) So here it is... here is why I agree and disagree, and why I love this series so much. YES. Celaena is BROKEN for a good chunk of this book. Why is this so unacceptable? Is it supposedly because she is supposed to be all strong and mighty and a perfect heroine? Guess what. You can be strong and still end up broken. And you know what? Maybe you are brought back to a place of power and healing... only to be brought back to a state of shambles... before you become whole again. This is realistic... and it was realistic in my own life. So I'll say this.. anyone who knows what it is like to be strong, passionate, full of hope, and then has found themselves in a position of pain to where it hurts to get back up again... I think you'll relate to this story. \n\n“Because she is dead!\" She screamed the last word so loudly it burned in her throat. \"Because she is dead, and I am left with my worthless life!”\n\nYes, it is hard to swallow watching a beloved character to be in a state of complete wreckage. I'm so thankful that SJM decided to share this part of Aelin's journey. I honestly did not connect with her that much until this book. Sure she was fun to read about before- but this book hit it home for me. We get so much insight to her past... why she was running - everything. It is completely and utterly heart breaking.This is probably the line where I really lost it emotionally.. because she lost it emotionally.\n\n\"Fireheart, why do you cry?\" \"Because I am lost and I do not know the way.\"\n\nBut- this is also a story of beautiful hope, and of finding the willpower to get back up. A story of choosing the hope of a future instead of remaining in the guilt and defeat of your past. AAAND not to mention.. how much true friends can help you back on your feet. \n\n“It was a long story, and sometimes she grew quiet and cried - and during those times he leaned over to wipe away her tears.”\n\nSo while I totally agree that this is entertainment and not to be taken too seriously- I can't help but nod to Sarah for showing a realistic character arc in a character we love so deeply. And you know what? Celaena has now moved on from being a broken, hurting, cowardly assassin who ultimately looks out for herself - to Aelin; a woman dedicated to her people - willing to sacrifice everything about herself to give them a home again. Someone willing to fight for something other than herself. OOOOOK ok ok... now onto some fun....ENTER ROWAN. Oh ladies, we love to hate him, and then love to love him. This guy is a serious piece of work... but I can't help but adore him. He is every bit as broken as Celaena is, though he shows it in a different way. But how freaking beautiful is it when they connect to each other... understand each other? Bloody brilliant. He was EXACTLY what she needed... and did anyone take notice that he was the first one to call her Aelin (aside from Maeve) and Fireheart? Also- HOW are people comparing him to Tamlin?? That kinda enrages me because it couldn't be farther from the truth. I'm not going to argue this in this review-but you can read a nice long detailed comparison HERE  - I highly recommend it. Oh, hi... MANON...So I gotta be honest. I kinda skimmed her parts. I know, I know. Terrible of me. I just got so hooked on Aelin's story.... so I promise to go back and reread these. So I can't write an accurate review or even any feelings towards this storyline because I just wasn't into it. I did end up loving her in the fourth book though! I'm just not into the whole witches thing. Though I gotta say- freaking Abraxos is the best- so much personality.. I LOVE HIM. CHAOL... Our dearest and most adorbs (albiet ever scowling) Captian of the Guard -- who deserves a serious hug...My heart just breaks for him. I adore Chaol. Sarah has done something that she does best with him too.. she's ripped him up a bit. He made bad decisions in the past (LIKE WE HUMANS DO...). But if I can give you any bit of hope... his story is not a lost cause. He's just trying to sort everything out- everything he believed in was shattered. DORIAN...Puh lease.. Like I could ever forget about you.Oh sweet Dorian. The poor guy gets the crap end of the stick EVERY TIME but still chooses to be his good and honorable self. That being said, his story isn't *quite* as interesting in this book... but just you wait and see what SJM is building for him. He's SO freaking cool in book 4.... you guys... I can't even. \nTHE LAST 30% OF THIS BOOK\nOh hell yes. How freaking clever and awesome was that?!? Want a hint at what the 4th book, \"Queen of Shadows\" is like? It's 10000% like this. Action packed, clever. Totally badass.  So get excited.My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"userName": "Serena (The Book Comedian)", "userReviewDate": "Sep 03, 2013", "userURL": "http://www.goodreads.com/user/show/12242598-serena-the-book-comedian", "userReview": "[since she you know, got her head chopped off and everything lol (hide spoiler)]"}, {"userName": "Angela", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/30035966-angela", "userReview": "Read originally 9/14Re read 8/15Re read 3/17First off does anyone else think that the covers for book two and three should have been switch? Maybe it’s just me.Either way I’m really loving the covers for this whole series so far. but to the point... I will say that I didn’t like this book as much as book two, mainly because this book had so much “setting up” to it that will be important later on and I was really hoping for some more badassassin like there was in the second novel, but there really wasn’t a lot of that going on. The one big thing this book had going for it was its ending…(  OMG WHOOSH!!!! THAT ENDING!!!! BOOK FOUR IS GOING TO BE CRAZY!!! )I read so many reviews where people were saying  “oh the first half of this book is like a 2 compared to the second half which is like a 5 star” , and I think people were right. The first half of this book was like pulling teeth. It was brutally slow!!! The main thing it had going for it was there were some really amazing new characters introduced (Rowan has me thinking Chaol who? <33333). The second half of this book is amazing. Sarah Maas finally starts unleashing a ton of Celeana’s back story and you are really starting to understand why she is the way she is. There is even someone from her family introduced which I really enjoyed (not really a spoiler because it’s really obvious). There are a lot of twist towards the end of the book which totally made suffering through the first half worth it.  (AGAIN THE ENDING OMG!!!!)Add: There were so many moments in this book that I forgot. So many amazing, gut wrenching, heart warming, stunning moments that I just simply forgot. How did I not remember how much I loved this book. So glad I’m re reading this series."}], "description": "Celaena has survived deadly contests and shattering heartbreak―but at an unspeakable cost. Now, she must travel to a new land to confront her darkest truth . . . a truth about her heritage that could change her life―and her future―forever. Meanwhile, brutal and monstrous forces are gathering on the horizon, intent on enslaving her world. Will Celaena find the strength to not only fight her inner demons, but to take on the evil that is about to be unleashed?The bestselling series that has captured readers all over the world reaches new heights in this sequel to the New York Times best-selling Crown of Midnight. Packed with heart-pounding action, fierce new characters, and swoon-worthy romance, this third book will enthrall readers from start to finish.", "title": "Heir of Fire\n      \n          (Throne of Glass #3)", "url": "http://www.goodreads.com/book/show/20613470-heir-of-fire", "average": 4.52, "cover": "https://images.gr-assets.com/books/1460846511l/20613470.jpg", "reviews": 18365, "authors": [{"url": "https://www.goodreads.com/author/show/3433047.Sarah_J_Maas", "name": "Sarah J. Maas"}], "type": ["Fantasy", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/20613470-heir-of-fire", "http://www.goodreads.com/book/show/20617636-heir-of-fire", "http://www.goodreads.com/book/show/22914781-heir-of-fire", "http://www.goodreads.com/book/show/23847976-heir-of-fire", "http://www.goodreads.com/book/show/20658347-heir-of-fire", "http://www.goodreads.com/book/show/7896527-throne-of-glass", "http://www.goodreads.com/book/show/16096824-a-court-of-thorns-and-roses", "http://www.goodreads.com/book/show/17167166-crown-of-midnight", "http://www.goodreads.com/book/show/17927395-a-court-of-mist-and-fury", "http://www.goodreads.com/book/show/18006496-queen-of-shadows"]}