{"ratings": 4414, "userreviews": [{"userName": "Paromjit", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Gregg Hurwitz gives us another adrenaline fuelled thrill ride of an adventure in the third of the Orphan X thriller series with a wide and diverse collection of characters. The resourceful Evan Smoak finds himself on an emotional search for vengeance aided by others and still finds time to be the Nowhere Man, helping a man by taking on a ruthless LA gang. Orphan Y, Charles Van Sciver, is now the Head of the Orphan programme, he and other shadowy government forces are determined to get to and eliminate Evan, and all the other orphans no longer in the fold of the official programme. Evan gets a call from Jack Johns, his beloved father figure, mentor and handler, who helped to raise him as more than a mindless assassin, asking him to collect a package. Sciver has targeted Johns as a means to get to Evan, Evan is horrified at the killing of Jack, feeling desperate guilt and a sense of a responsibility. The package turns out to be ex-orphan, 16 year old girl, rootless and problematic Joey, who has him scrambling to cope but he is determined to protect and guide her. Joey is a fearsome and gifted computer hacker whose talents complement Evan and help him on the path to gaining revenge. She is the trigger for Evan to reflect on himself and what he has become, adding more emotional depth to his character. Hurwitz is on great form in this action packed thriller, with great characterisation, wonderful and compelling plotting, in a complex story with non stop tension and suspense. An entertaining series that I have loved reading. Many thanks to Penguin Michael Joseph for an ARC."}, {"userName": "Phrynne", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Book three and Evan has returned home to his specialist vodka and his living wall of herbs, both of which I find hilarious in a man who does what this one does for a living. Anyway I am accustomed to it now and it does not detract from the rest of this fantastic book!In Hellbent the action starts on page one and continues pretty solidly throughout the book. A new character called Joey is introduced who turns out to have some very useful skills and ends up partnering Evan in a quest for revenge. Of course a lot of it is very far fetched but it is fun and it is exciting and it is exactly what you want from a book like this.Highly recommended for fans of the genre and I can't wait for the next one!"}, {"userName": "Barbara", "userReviewDate": "Jan 20, 2018", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "3.5 starsIn this addition to the \"Orphan X\" series, Evan Smoak - also known as Orphan X - is out to avenge the death of his mentor Jack Johns. When Evan was twelve, Jack took him from an orphanage and put him in a super-secret Department of Defense black-ops program - a scheme designed to turn orphans into highly skilled assassins. The children were stripped of their names and designated alphabetically: Orphan A, Orphan B, Orphan C....and so on. Jack was like a father to Evan, and made sure the boy kept his humanity while he learned to kill. Orphan X got his first mission at nineteen, and eliminated many targets after that. Finally, burnt out, Evan left the program and set himself up as 'The Nowhere Man' - a good samaritan who helps people in desperate trouble.However, no one is allowed to leave the Orphan Program. If a member opts out, the program director - Charles Van Sciver, also known as Orphan Y - sends a hitman (or hitteam) after the deserter. Thus, killers have been after Evan for years, but his secret apartment is a fortress and he's taken elaborate measures to protect himself. (These measures are fully described in the first book, Orphan X.) Van Sciver, who's been continually frustrated by Evan, has even more incentive to murder him now - reasons that extend high in government circles. So Orphan Y decides to get to Evan through Jack Johns. Van Sciver, who has phenomenal data-mining capabilities, locates Jack and kidnaps him. This leads to Jack's death - and the terrible scene is shown to Evan via phone. Of course Orphan X now has to go after the director, which will (presumably) bring Evan out into the open. As events unfold Evan becomes the reluctant guardian of a feisty sixteen-year-old girl named Joey. Joey flunked out of the Orphan Program and is in Van Sciver's sights. So Evan has to protect the girl while he goes after the director. Van Sciver and his team take a two-pronged approach to finding Orphan X: they locate and torture people who might have information about Evan; and they kidnap a youngster that left the Orphan Program - hoping Evan will try to rescue him. Orphan X is a very resourceful guy though, and Van Sciver's crew suffers loss after loss. Moreover, Joey is a talented computer hacker and programmer, and she sets up a sophisticated data mining system of her own.....one that helps Evan trace his enemies. Joey is an interesting character. She's a lonely, troubled girl with fierce fighting skills, but no idea what to do outside the Orphan Program. Evan tries to be supportive, but he doesn't know how to deal with teenage girls. Still - as long as Joey has her special shoebox, a case of Red Bull, and plenty of Twizzlers - she's willing to help Evan. As the story proceeds, Van Sciver pursues his mission to kill Evan and all other fugitive Orphans; Evan goes after Van Sciver; there's plenty of death and destruction. You get the idea. As all this is happening, Orphan X gets a call on the RoamZone phone used to contact 'The Nowhere Man.' A Los Angeles resident named Benito Orellana needs help. His son Xavier is about to be initiated into the Mara Salvatrucha gang and Benito begs Evan to get the young man out of the gang's clutches. Evan agrees to help, and engages with the gang's vicious thugs. All this frenetic activity leads to a violent and dramatic climax; a satisfying finale; and (I think) a lead-in to book four. Additional characters that add interest to the story include: Prosecutor Mia Hall - Evan's downstairs neighbor who'd probably like to be more than friends; Peter Hall - Mia's young son, who sends messages to Evan via kite; Candy McClure - an Orphan who uses her sex appeal for deadly purposes; David Smith - an Orphan boy who's being hidden; Freeway - leader of the Mara Salavatrucha who's had his eyeballs tattooed black; Tommy - a fantastic gunsmith; Jonathan Bennett - a powerful government official; and more. Hellbent is a good book, full of action and excitement. It can be read as a standalone but I'd strongly advise reading Orphan X first. Thanks to Netgalley, the author (Gregg Hurwitz), and the publisher (Minotaur Books) for a copy of the book. You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"userName": "Maureen Carden", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/54932249-maureen-carden", "userReview": "It is scorched earth time for Evan Smoak. He was originally known as Orphan X from his time as a deep black government assassin trained from childhood in the Orphan program. Later Smoak became known as The Nowhere Man, helping people who have nowhere else to turn. But now Smoak is out for revenge on his own account, in scorched earth revenge seeking the death of the twenty-five men who were involved in the death of Smoak’s beloved mentor, Jack Johns. A sort of perverse 47 Ronin. Johns has contacted Smoak minutes before his death by the hand of Charles Van Scriver who has taken over the Orphan program for his own aims. Orphan X has played the great white whale to Van Scriver’s Ahab, but this time Van Scriver has the highest backing and he can’t let Orphan X outsmart him again.To add to Smoak’s grief and anger, Jacks has left Evan a present in the form of a sixteen year old runaway from Van Scriver’s personally run Orphan program. To add to Smoak’s revenge he must keep the runaway, Joey Morales, alive with the goal of saving her from the Orphan program.The excitement starts from page one and just keeps on building. Evan is used to flying solo, this time he has to accept the aid of a friend and from his temporary ward.Hurwitz’s usual smooth writing is in evidence along with his intricate plotting and fascinating characterizations. This book is not all action; there are themes of redemption, sacrifice, and forgiveness.Thanks to NetGalley for an ARC in exchange of a fair and honest review."}, {"userName": "Wendy", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/1418580-wendy", "userReview": "Gregg Hurwitz is one of my all-time favourite authors and a go to author if I need little sleep as a result of not being able to put his book down. Hellbent is the third book in his \"Orphan X\" series and it is definitely one of those books. Tons of fun and a page-turning, exciting thriller!In Hellbent we learn more about Evan Smoak (Orphan X) and what makes him tick. We see a side of him that is vulnerable and uncertain. This novel picks up after \"The Nowhere Man\" left off with Van Sciver still on the hunt for X. His next move is to kidnap and kill X's mentor, Jack Jones. Jack leaves a cryptic note for X instructing him to pick up a package which happens to be a teenage girl named Joey who was discharged from Orphan training and is now in danger of being eliminated by Van Sciver as well. Gregg Hurwitz has created a masterful and memorable character in Evan Smoak. I enjoyed his interaction with Joey and the other fascinating characters he came in contact with. An exceptional ending that leaves us wanting more.The author fails to disappoint and I can hardly wait to read his next thriller starring Evan Smoak.I truly loved this novel!Thank you to NetGalley and Minotaur for an arc of this novel in exchange for my honest review."}, {"userName": "Gary", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "This is the 3rd book in the 'Orphan X' series by author Gregg Hurwitz. Evan Smoak was Orphan X, taken from a group home at twelve, he was raised and trained as part of the Orphan Program, an off-the-books operation designed to create deniable intelligence assets, assassins. He left the program, disappearing using the skills he had learnt to reinvent himself as the Nowhere Man. This book is full of action and suspense and the excitement builds and builds to the very end of the book. I enjoyed this one even more than the 1st and that is no easy feat. Looking forward to more in this series as well as catching up on other books by this author.I would like to thank Net Galley and Penguin UK for supplying a copy of this novel in exchange for an honest review."}, {"userName": "Glen", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/20069595-glen", "userReview": "Super Secret Agent Orphan X is free from the agency, but someone is trying to kill him. He picks up another orphan, and tries to start a relationship with his neighbor.Not bad, never seems real, though."}, {"userName": "Eric", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/10855593-eric", "userReview": "Hellbent is the third installment of the Evan Smoak Orphan series and again, for modern thrillers, Gregg Hurwitz does not disappoint. Hellbent begins right after the ending of The Nowhere Man and to be fair to other readers, to offer too many details will only provide spoilers. Hurwitz brings back other familiar characters and introduces a new one which adds to the layers of the novel. Hurwitz again puts his main character into situations where the reader will wonder how Smoak will safely emerge. Of the thriller series this reader has read, the Orphan series is one of the most enjoyable series to read. Highly recommended."}, {"userName": "katwiththehat", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/54835325-katwiththehat", "userReview": "Thank you so much to NetGalley and St. Martin’s Press for getting me into this awesome series by Greg Hurwitz. “Hellbent” continues Evan Smoak’s amazing and increasingly destructive life after he receives a call from his mentor and father figure, asking for help. But is it too late for Jack to be saved? Swirling at the middle of all the madness as usual is Orphan Y, Evan’s nemesis from the boy’s home, who just can’t seem to let go of his bone to pick with Evan, no matter how many people are killed along the way. Evan Smoak has been taught to repress emotion his entire life and Hurwitz shines in the moments where feeling forces itself to the surface, in that oh so painful phone call saying goodbye, when he’s forced to question what he’s doing and whether he should continue on his path. Complicating things is the mission Jack sends him on, who, let’s just say is a handful in her on right. Joey’s intrusion into his life forces Evan to question his rigid boundaries, as well as how life could have diverged for him if he had been able to stop at sixteen. It’s the really cool emotional meat of Evan Smoak that I love reading, so this was an especially cool development. And of course, the further along we go, the deeper the rabbit hole goes. There were some tantalizing peeks at what is to come, how far the conspiracy leads, and what may be in store for Orphan X in the future. I know I can’t wait for the next book! Please excuse typos/name misspellings. Entered on screen reader."}, {"userName": "The Real Book Spy", "userReviewDate": "Oct 04, 2017", "userURL": "http://www.goodreads.com/user/show/27296687-the-real-book-spy", "userReview": "Read this review and more at www.TheRealBookSpy.com “Do you need my help?\"That’s how former government assassin turned vigilante Evan Smoak answers his special RoamZone each time it rings. As a rogue, highly-trained former member of the Orphan Program, a top-secret government project designed to turn children into killers, Evan has left that life behind. Now he’s known only as the Nowhere Man, the last hope for many people in desperate need. This time, however, Evan recognizes the voice on the other end of the phone. The person in desperate need of help is Jack Johns, Evan’s mentor and former handler. Charles Van Sciver, the head of the Orphan Program, is shutting things down. That means scrubbing everyone still linked to the program, including Evan Smoak, one of the original recruits, who was designated Orphan X. After many failed attempts (shown in past books) Van Sciver finally decides that the best way to get to Orphan X is to go after his handler.Unable to get to Jack in time to save him, Evan listens in horror as the only father figure he’s ever known is apprehended by a team of operators sent by Van Sciver. Moments later, Jack’s body falls from a helicopter hovering at sixteen thousand feet above ground. For the first time in his life since meeting Jack, Evan Smoak feels lost. Too stunned to do anything, Orphan X considers his options, all the while thinking about the message Van Sciver sent to him as the painful truth eats at him. He’s the reason Jack Johns is dead.At the young age of twelve, Evan was plucked from a Baltimore orphanage and placed in Jack’s care. Like the other handlers, Jack raised Evan to be a killer, teaching him all the necessary tradecraft and skills he’d need to succeed. And succeed, Evan did. But Jack did one thing differently that none of the other handlers even considered with their recruits–he raised Evan like a son and taught him to remain human by ensuring he held onto his conscience. So while Evan is a killer, he’s not a mindless killer, which is what ultimately led to him breaking from the Orphan Program years prior and taking up the mantle as the Nowhere Man. Ready to move, Evan begins by retracing Jack’s footsteps. While the message from Van Sciver is painfully clear, there’s another message for Evan to focus on. Before falling from the helicopter, Jack left a coded message of his own–a final mission, and one that Evan must complete at all costs. Evan quickly learns that, with the Orphan Program being shut down, Jack had taken in another cast-off and began training them according to the same commandments instilled in Evan. His dying wish is for Evan to find the last Orphan and make sure Van Sciver doesn’t get his hands on them. Fueled by his intense thirst for revenge, Evan accepts his mentor’s final mission but also sets his sights on finally burning the Orphan Program to the ground. To do that, he’ll need to stay one step ahead of Van Sciver, the coldest killer the program’s ever produced, and his loyal assassins. All of this is made more difficult when Evan’s RoamZone rings yet again. In the midst of trying to find the young Orphan and avenging Jack’s death, there’s now another person in need of the Nowhere Man’s help. Plus, to top it off, Evan is about to learn that the Orphan Program stretches far above Van Sciver, a twist that he didn’t see coming but something that must be dealt with. So far, three books in, Gregg Hurwitz is pitching a perfect game. One of the things that makes this series so good is that Hurwitz keeps finding legitimate reasons to continue telling Evan’s story. Unlike other series where authors keep sending their heroes on new world-saving missions, Hurwitz continues to think up compelling scenarios to drop his protagonist into.The first book (Orphan X) saw Evan helping someone who accidentally got caught up in danger caused by his former life, and the second book (The Nowhere Man) followed Evan who, coincidentally, found himself in the very type of situation someone would typically call him for help with. And while the first two installments are terrific, Hellbent, which features the most personal mission for Evan yet, is something special. Well-written and engaging, Hurwitz’s pacing is quick and relentless as Orphan X soars to new heights in Hellbent, a serious contender for best thriller of the year. Someone tell Jack Reacher and Jason Bourne to move over–Evan Smoak is the new king of the genre. Book Details Author: Gregg HurwitzSeries: Evan Smoak #3Pages: 403 (Hardcover)ISBN: 1250119170Publisher: Minotaur BooksRelease Date: January 30, 2018Book Spy Rating: 9.5/10Order Now: http://amzn.to/2vZ9xeO"}, {"userName": "Tim", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/17042835-tim", "userReview": "After a fair start, the story wanders too much. Should have been edited shorter. Narrator Scott Brick adds little more than his tiresome inflections. 4 of 10 stars"}, {"userName": "Cindy Burnett", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "3.5 starsHellbent is the third book in the Orphan X series. I loved the first book, Orphan X, struggled a lot with the second one, The Nowhere Man, and felt Hellbent fell somewhere in the middle. In this installment, the plot and ancillary characters are strong. I enjoyed both the project he takes on as the Nowhere Man and the assignment Jack gives Evan as Jack dies. However, I felt the dialogue and conversations Evan kept having in his head with Jack were forced and unrealistic. I found it very distracting and would probably have given the book 4.5 stars had it not been for that aspect. Evan was raised in an orphanage until 12 and then trained to be a killer – it seemed so unlikely that he then would be so sappy. The mystery is solid, and the book kept me entertained. If you like thrillers, this is certainly an entertaining one. I received this book to read and review. All opinions are my own."}, {"userName": "ChopinFC", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/51633786-chopinfc", "userReview": "5 StarsI've been shook!! What a fantastic, fast pace, espionage/thriller novel! 'Hellbent' is hands down the most entertaining CIA/thriller I've read in a long time! A amazing plot line, an affable but royally screwed up protagonist, and some nasty deviant foes, makes this a must read! RTC."}, {"userName": "Carla Johnson-Hicks", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/17074498-carla-johnson-hicks", "userReview": "Evan Smoak has gone through many transitions in his life. He was an orphan in a boys' home, he was taken from there at the age of 12 and trained to become a government assassin known as Orphan X. When he left the program, he became, The Nowhere Man, helping people who have nowhere else to turn. But now Smoak is out for revenge. When the last book ended, Evan gets a call from his mentor, Jack Johns, who he thought was dead. He was very much alive, but before the call ended, he was captured and ended up dead. The man responsible was Charles Van Sciver or Orphan Y. It is all a plot to get Evan and kill Orphan X once and for all. The same characters once again make an appearance, Mia and her son Peter, the locals in the apartment building, Tommy his go to guy for firearms and equipment as well as the addition of Joey, a sixteen year old girl who ran away from Van Scriver when he was training her to become an orphan operative. She is now on his radar and Evan has to protect her as well. The story grabbed me right from the beginning. The suspense and excitement keeps building throughout the story until you know Van Sciver and Evan Smoak will meet face to face. The story's plot is detailed and the characters are extremely interesting. I thought this was the end of the trilogy, but the ending leaves it open for another possible book in the series. Only time will tell. Once again there is a lot of violence in the story, so if that bothers you, then this book is not for you. The addition of Joey to this story makes it a little softer and we get to see another side of Evan. I recommend it to thriller/action/suspense lovers. The publisher generously provided me with a copy of this book via Netgalley."}, {"userName": "Judy Collins", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "Evan Smoak, an unstoppable government assassin gone rogue returns in Gregg Hurwitz #1 international bestselling Orphan X series, HELLBENT – from revenge, bullets, and vodka his most emotional and personal yet; a riveting non-stop action thriller. Picking up from   The Nowhere Man #2.0 Smoak is more than a legend. He is a man with skills, resources, and a personal mission to help those with nowhere else to turn. A dangerous past.  Well-equipped and trained. Taken from a group home at twelve, Evan was raised and prepared as part of the Orphan Program. Evan was Orphan X. An expendable assassin who went where the U.S. Government would not and did what they could not.Jack had fought  for Evan to stay human even while teaching him to be a killer. He broke with the program, using everything he learned to disappear and reinvent himself as the Nowhere Man. Eight years ago he had gone rogue. He helped the desperate with no place to turn. People suffering at the hands of unrepentant and vicious abusers. Now every incoming call comes to 1.855.2-Nowhere. Then it emerged through the receiver of the RoamZone. He always answers: “Do you need my help?”This time,  the voice on the other end was familiar. Jack Johns. Jack was the one who had plucked Evan from foster home to the inside the Department of Defense. He was the only father he had ever know. If he was calling this line, he must be in mortal danger. Indicating he must be up against what other might consider world-destroying trouble. An emotional call. Hurwitz cranks up the intensity,  with Van Sciver, using all the assets to take out both Evan (Orphan X) and the target he is trying to protect. His top priority is to stamp out wayward Orphans. Anyone who has retired. Anyone who had not made the cut. Anyone who had tested questionable for compliance. The only Orphan who had ever gone rogue. The best way is to go after his handler. Jack gives Evan a final mission. Would a long-buried secret from Jack’s past lead him to Van Sciver? Hurting Jack Johns would hurt Orphan X. The Commandments. A girl. Joey. The package. Can she help? A sixteen- year-old?Evan is determined  to put a bullet through Van Sciver’s skull after his beloved father figure dies. Their history stretched back to three decades to a boys’ home in East Baltimore. Van Sciver held the keys to the kingdom and Evan was the fugitive. “Jack had taught Evan that the hard part wasn’t being a killer. It was staying human. He was superb at the former. And growing proficient at the latter. “A superbly created series.  Highly entertaining! Fans will delight. Will there be another upcoming book in the series? We can only hope. Read My Reviews: Orphan X #1  Buy a Bullet #1.5 Nowhere Man #2.0A special thank you to St. Martins Press and #NetGalley for an early reading copy.  JDCMustReadBooks"}, {"userName": "Karin Schott", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/25636597-karin-schott", "userReview": "I have a new ritual these days. These days are so hectic that attention to ritual becomes important. At the end of the day, after the child is in bed and order has been restored to the force, I break a small bite of chocolate and let it melt in my mouth. I buy a good dark chocolate bar, I hide it behind the frozen spinach in the freezer. Alas, I can not afford a good bottle of vodka, but the ritual is the same. Evan Smoak would understand.Some books are dark chocolate, broad themes that are teased over dense, exquisite prose. These are books that require a quiet moment, the languor of a Sunday afternoon. There are some books that are more of a Hersey Chocolate, something you buy on the fly and stuff yourself with in a moment. It is always in your bag in case you have just a few minutes to read. The details may escape you but that book will at least give you something to do when you are waiting for your child to finish up soccer practice. The Orphan X novels are a yummy something in between. They may be the Hersey bar from the check out aisle but you sit in your car letting it melt on your tongue while the radio plays a favorite oldie. You want to take the moment.Now on to Hellbent. I loved book one. I thought book two was stellar. Book three is simply awesome. As a bookseller there is hardly time to stay with a series. I read a couple and have to move on. The reading is all about front list and some of the episodes simply slip by. But each of these novels does such a fine job of letting the character evolve. They do not feel formulaic. They inevitably keep me up way past my bedtime...with chocolate."}, {"userName": "Linda", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/407712-linda", "userReview": "I can think of three words for this book.....I loved it! Evan Smoak is Orphan X, he is the Nowhere Man and when someone who means the world to him is killed he is Hellbent on revenge. It’s hard to say too much about the plot without ruining the storyline, but needless to say it’s action packed with a lot going on and a real page turner."}, {"userName": "Jim", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/10453048-jim", "userReview": "Ze blijven even goed uitgedokterd en fantastisch geschreven. De ‘Orphan-reeks’ blijft een topreeks!"}, {"userName": "Timothy", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/1526379-timothy", "userReview": "Hellbent is the 3rd book in the Orphan X series by Gregg Hurwitz. Now, I have seen a few reviews from readers that have been lukewarm on this book. I must be the exception because I think this 3rd entry in the series is the best to date. Why? Well, in Hellbent we see much more of what makes Evan Smoak tick. We also see an Evan Smoak that is vulnerable and a little unsure of himself and his situation at times. I found this Orphan X more complex and more human. For once I didn't see his penthouse fortress as cool, but I saw it as cold and impersonal. The only conversation Evan has is with a cactus right?Hellbent picks up after The Nowhere Man with Van Sciver still on the hunt for X. But this time Van Sciver Hasan ace up his sleeve in the form of X's mentor, Jack Johns. Johns is kidnapped and X is forced to watch his mentors tragic death. Which means only one thing. X must get revenge. Through a cryptic note left for X by Johns, Evan makes his way to a location to retrieve a package left for him by Jack. But the package turns out to be not an it but a she. A teenage girl named Joey who washed out of Orphan training and us now in danger of being eliminated by Van Sciver as well. The interplay between Evan and Joey is classic with each gradually learning from the other.Twists and turns as well as some surprises await, but this third entry is well worth the read. Long live Evan Smoak!"}, {"userName": "Katherine Clark", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/5115292-katherine-clark", "userReview": "Oh I enjoyed this one. I loved the first, was made nervous by the second (thinking Hurwitz was going to change what he had done before and emulate Jack Reacher) and I loved the third. He brought back what worked so well in the first by showing the importance of protecting the innocent. He also nicely moved the storylines of several subplots along. I can't wait till the next one--but I have year to wait. Sigh. But I love this series."}, {"userName": "Laura Rash", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/34779639-laura-rash", "userReview": "I truly enjoy this whole series & I think this was the best one yet! Evan Smoak is evolving into an epic character who I might just like more than Jack Reacher! This was a fast paced read that really needs no bookmark! Thanks to Minotaur for this early copy!"}, {"userName": "Karen", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/41376337-karen", "userReview": "I received this from netgalley.com in exchange for a review. Holy Smokes, Evan Smoak! What a thrilling ride, great continuation of the 'Orphan' series. 4☆"}, {"userName": "Kwoomac", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/2076898-kwoomac", "userReview": "Yes! After The Nowhere Man, which for me was a disappointing read with its over-the-top cartoonish villain(s), this third book in the Orphan X series was back on solid ground. While the villains were villainous, they were believable adversaries. I also enjoyed the addition of Evan Smoak/ Orphan X’s sidekick Joey. The story was certainly fast paced. Much like Van Sciver giving his victims a few minutes to regroup between bouts of torture, author Hurwitz allows the reader a little downtime to process all the violence. We get glimpses of Smoak’s daily routines, we get interesting computer hacking details, we meet the other tenants in Smoak’s apartment building. There’s even some humor. These slower moments give the reader a reprieve from all the blood and brain splattering of the high intensity scenes. A cleansing of the palate, if you will. Looking forward to the next book in this series. I also really enjoyed Orphan Candy McClure’s story arc. More to come?"}, {"userName": "Kathleen", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/13954899-kathleen", "userReview": "Recommended for action thriller readers! (But I'd skip the torture scenes.) Anyway, I really like this series. This is a fun and fast read and/or listen. I loved the mix of protective yet socially awkward Orphan X / Evan Smoak, a roughly 38-year-old batman-type, spending days on end with 16-year-old Joey, a techno-whiz orphan girl running for her life. What a hoot! Good tension and suspense, varied vivid scenes. Heartwarming. Poignant. Uplifting. (If you skim the gross torture scenes).Lifting a glass to Jack Johns and his ten commandments for humane black ops.Good narration. I read and listened."}, {"userName": "Mark Baker", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/4545420-mark-baker", "userReview": "The phone call that Evan Smoak receives on his special phone comes from a voice he knows – Jack Johns, the main who trained him and the closest thing Evan has ever had to a father. The phone call changes Evan’s world, and Evan find himself setting out to pick up a package for Jack in addition to working on a very personal mission. Will Evan succeed?This third book featuring Evan is fantastic. The pace is fast with plenty of twists and setbacks, yet I love how things came together at the end. You really have to read this series in order, not only to appreciate the background on the story told here but also to appreciate the character growth in Evan. He’s a complex character, and I love watching him change. The rest of the cast is fantastic, too, and the writing paints his world without slowing down the story. Truly a wonderful book.Read my full review at Carstairs Considers."}, {"userName": "Linda", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/14833895-linda", "userReview": "4.5 starsIn this third book of the series, Evan’s quest is very personal, and it becomes even more revealing of him as a character. Unlike in many series where the protagonist stays pretty much the same throughout, Evan’s character evolves as a result of his experiences, and this is particularly so for this book. Frankly, it makes him more interesting and the series more appealing.Bravo."}, {"userName": "Robert Scragg", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/41007397-robert-scragg", "userReview": "Evan Smoak a.k.a Orphan X, is a former government assassin, now reborn as the Nowhere Man, helping those who have nowhere else to turn. His untraceable number is passed only to the select few; people who are out of options, beyond the help of the authorities. When his next caller turns out to be his mentor, Jack Johns, it’s not only Jack whose life is in danger. There are those who want to erase the Orphan program, and those who graduated through it. Jack tasks Evan with protecting the last Orphan he took under his wing, a young girl named Joey. But Evan isn’t the only person looking for them. Charles van Sciver, head of the Orphan program, has a score to settle with Evan, and will do whatever it takes to bury both him, and the recruit Jack has trusted him to protect. If Bond and Bourne had a lovechild, Evan would be that end product. We’re treated to a superb combination of suspense, action, and plot twists from cover to cover. It's not all about explosions and bullets though. There's a real human side to Evan, one he's trying to connect with after having his childhood drilled out of him by the Orphan program. The relationship that develops between him and Joey is both touching, and humorous, as he does his level best to help her get away from the kind of life he’s resigned himself to. Gregg Hurwitz has created a fabulous character, and isn't afraid to put him in some horrendous situations, all in the name of entertaining his readers. The series has been extended for several more books, optioned by Bradley Cooper, and I for one can't wait to see where Evan ends up next."}, {"userName": "Darcia Helle", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/2439410-darcia-helle", "userReview": "Evan Smoak is part man, part machine, and 100% badass. This book gives you no breathing room. It's not a book you relax into or meander through. The content is intense and the pace quick. Evan doesn't tread lightly. His world is dark and dangerous, and Gregg Hurwitz doesn't spare details. We see the violence play out as Evan leaves destruction behind in his quest for vengeance. But this violence isn't at all gratuitous or needlessly graphic. We are placed in Evan's world, and it's not for the feint of heart. While this book could probably be read as a stand-alone, I highly suggest reading books 1 and 2 first. Evan's character has a unique and fascinating background. Hurwitz does weave some of the backstory into this book, so new readers wouldn't be totally lost, but you'd miss the intricacies of his character and his relationships. I love how Evan's character is evolving through this series. In this third book, we see him struggle with his newfound desire for what he views as a normal life. But someone always needs the unique kind of help only he can offer. And, this time, his mission is a lot more personal. This is definitely the kind of story that you live while reading, so you forget everything else and experience an adrenaline rush for a few hours.*The publisher provided me with a review copy, via Amazon Vine, in exchange for my honest review.*"}, {"userName": "Jane Stewart", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Good but the torture scene was too much for me. I wish the author had used fewer torture details. Too much of it stayed in my mind after the book. The rest of the story was good: the characters, the plot. And it had some good action.The narrator Scott Brick was excellent.DATA:Narrative mode: 3rd person. I don’t recall any sexual content. Book copyright: 2018. Genre: current day various places in the U.S."}, {"userName": "Anne", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/57161856-anne", "userReview": "I have loved other Gregg Hurwitz's books but this is the first I've read in the Orphan X series. Now, I wish I'd read the other two first just to have some prior knowledge about protagonist, Evan. Of course it's not necessary as the book can clearly stand on its own as we see Evan and new \"partner,\" Joey, a sixteen-year-old girl who is also schooled in the fine art of subterfuge and technology. Not a killer herself, she is a valuable asset to Evan as he searches for his \"adopted\" father who has been violently assassinated. Evan is a beautifully flawed character who is clever and ruthless, but he has the proverbial heart of gold when it comes to people for whom he cares. Breakneck pacing and non-stop action keep this thriller going from page one until the end. A very satisfying read!"}], "description": "Evan Smoak—government assassin gone rogue—returns in Hellbent, an engrossing, unputdownable thriller from Gregg Hurwitz, the latest in his #1 international bestselling Orphan X series.Taken from a group home at age twelve, Evan Smoak was raised and trained as an off-the-books government assassin: Orphan X. After he broke with the Orphan Program, Evan disappeared and reinvented himself as the Nowhere Man, a man spoken about only in whispers and dedicated to helping the truly desperate.But this time, the voice on the other end is Jack Johns, the man who raised and trained him, the only father Evan has ever known. Secret government forces are busy trying to scrub the remaining assets and traces of the Orphan Program and they have finally tracked down Jack. With little time remaining, Jack gives Evan his last assignment: find and protect his last protégé and recruit for the program. But Evan isn’t the only one after this last Orphan—the new head of the Orphan Program, Van Sciver, is mustering all the assets at his disposal to take out both Evan (Orphan X) and the target he is trying to protect.", "title": "Hellbent\n      \n          (Orphan X #3)", "url": "http://www.goodreads.com/book/show/34953104-hellbent", "average": 4.48, "cover": "https://images.gr-assets.com/books/1516867205l/34953104.jpg", "reviews": 611, "authors": [{"url": "https://www.goodreads.com/author/show/82570.Gregg_Hurwitz", "name": "Gregg Hurwitz"}], "type": ["Thriller", "Fiction", "Suspense", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/34953104-hellbent", "http://www.goodreads.com/book/show/35684840-hellbent", "http://www.goodreads.com/book/show/38466944-de-rekruut", "http://www.goodreads.com/book/show/38323227-hellbent", "http://www.goodreads.com/book/show/25663888-orphan-x", "http://www.goodreads.com/book/show/10148340-you-re-next", "http://www.goodreads.com/book/show/29939343-the-nowhere-man", "http://www.goodreads.com/book/show/12999144-the-survivor", "http://www.goodreads.com/book/show/7243435-they-re-watching", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/35005051-the-forgotten-girls", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}