{"ratings": 457, "userreviews": [{"userName": "Thomas", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "If you like Hemingway, check this one out; if you do not, skip it. Michael Reynolds delves into excruciating, repetitive detail about Hemingway's formative writing years in Paris. He discusses Hemingway's marriage with Hadley Richardson, as well as his interactions with other writers/artists like Gertrude Stein, Alice B. Toklas, and F. Scott Fitzgerald. I appreciated Reynolds' honesty in his portrayal of Hemingway. But I kept asking myself: why do people even care about this man?Thanks for putting up with my many Hemingway reviews, Goodreads friends. Even though Hemingway acted mean in many ways, I see that he suffered and I feel sorry about that. Still, I do not like him nor his writing at this point."}, {"userName": "Chrissie", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "2 starsMY REVIEW HAS BEEN REVISED AFTER COMPLETING THE BOOKReynolds' biography of Hemingway is more an analysis of what Hemingway has written than an examination of his inner soul. This book, the second in Reynold's series on Hemingway, covers only four years 1922-1926, predominantly set in Paris but also Spain, Italy,Turkey and Austria. In 1924 Hemingway began to receive acclaim. It covers his marriage to Hadley and his growing infatuation with Pauline, who will be his next wife. It covers the birth of his son. It covers his years as a reporter; he wrote both for The Toronto Star and for Hearst. He was in Turkey when the fire and catastrophe in Smyrna took place. As usual, he missed the real action but heard what others related. He observed and he listened. He was, as always, an observant listener. I found this coverage of historical event s more interesting than any other part of the book. Hemingway wanted to be a fiction writer, so that must be the main focus. The book covers primarily his friendship with those of the Lost Generation, those living in Paris in the 20s. The main focus is what Hemingway wrote during this period. You have to be well aware of what he has written. A chapter can begin relating what one of his fictional characters is thinking or doing. This can be confusing; the reader must immediately recognize Hemingway’s fictional characters. This is further confused because the fictional characters are drawn from real ones. Just as Hemingway so often takes real events and fictionalizes them, so does this biography blend the two. Being a literary analysis of his writing and his steps toward recognition, the book details the ins and outs of his writing and publishing contracts. Perhaps the book is best for those readers who are themselves budding authors, who are looking for guidelines on writing techniques. It shows what Hemingway learned from others. The book is more a presentation of what Hemingway does than what he thinks. The reader observes his actions and the choices he makes. I still like Hemingway's writing but I do not admire him as a person. And none of this has to do with his despicable love of bullfighting. At least in the first book (The Young Hemingway) you are given an idea of why he was drawn to this barbaric practice. In the first book there is more discussion of what factors shaped Hemingway into the man he was. This second book focuses on how he became a writer. I like how Hemingway writes, but dissecting every paragraph, every line, every word in his books makes the Hemingway magic disappear. I found neither Hemingway’s conversion to the Catholic faith or his changed feeling for Hadley well presented. I don’t understand how he was thinking, so neither can I empathize with him.There is an awful lot of repetition within this second book AND from the previous book. The repetition is excessive. It quite simply drove me nuts.You do learn a bit about Gertrude Stein and Alice B. Toklas and Ezra Pound and F. Scott Fitzgerald and Sylvia Beach, known for her Paris bookstore/library Shakespeare and Company. I will not be continuing this series. I do not like Reynold's focus or how he presents the facts. I get the impression he is trying to write with a style similar to Hemingway, only it fails. And the exceedingly rapid narration of the audiobook by Allen O'Reilly makes the reading experience even more unpleasant. I have learned about Hemingway......I like him less. This is who he was. These are the things he did. These are the things he said. You can like an author's work but not the author himself! I am glad I know him better. With my increased awareness and dislike I remind myself that this book only covers four years of his entire life, but for now I have had enough of Hemingway!My view on the first book of the series may be found here: https://www.goodreads.com/review/show..."}, {"userName": "Brian Willis", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/23672960-brian-willis", "userReview": "Volume 2 tells the story of how Hemingway became Hemingway. Arriving in Paris, Ernest was a newlywed in search of literary connections. By the end of the book, Hemingway returns to Paris after signing his fateful contract with Scribner's to publish The Sun Also Rises and about to leave his first wife for his second. He made literary friendships with Ezra Pound, Gertrude Stein, Ford Madox Ford, and F. Scott Fitzgerald, all of whom contributed in significant ways to his growth as a writer. I found Reynolds's observations and speculations about Hemingway's thoughts and motivations to be utterly convincing and revelatory, and I also found the book very difficult to put down. My favorite sections include the moments when Hemingway shrugged off depression to take flight as he found inspiration to compose the short stories of In Our Time and the legendary summer of 1925 in Spain when he converted real life experiences, arguments, and romantic obsessions into the material that became The Sun Also Rises. That legendary novel was written in just over a month in the weeks following the events in Spain! Incredible to see inspiration and to be carried away in its tide. A mandatory read for readers and writers who are curious about how Hemingway wrote his earliest and perhaps best known works in the 1920s."}, {"userName": "Kim", "userReviewDate": "Feb 23, 2009", "userURL": "http://www.goodreads.com/user/show/1900042-kim", "userReview": "A fabulous piece of biography. I strongly recommend it to anyone who has enjoyed Hemingway or travel writing, or just plain good writing. A sympathetic, but clear eyed portrayal of Hemingway, thoroughly researched."}, {"userName": "John Eliade", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/27226563-john-eliade", "userReview": "I love Ernest Hemingway, and I look forward to reading the rest of Reynolds' biographical series on Hemingway's early life and his later life, this one, regarding his 1920s \"apprenticeship\" learning how to perfect short stories, write a novel, and navigate life, is really telling as an aspiring novelist and current expatriate. What struck me about this was it portrays Hemingway as a very real human being, not an idealized \"great American novelist,\" writing in private, soldiering in secret, fucking loudly and indiscriminately. Hemingway was very much a man of intense passions, but also very real fears, very acute demons, and very strong delusions. There is a great sense of this in his very VERY excellent semi-autobiographical \"A Moveable Feast,\" but you get the sense of being a fly on the wall in 1920s Europe with all the impending doom of war hanging over your head that Hemingway, who survived a very real attack in Italy as well as the Spanish flu a decade earlier, could always feel enveloping him. This is a powerful book to both better understand one of America's great literary heroes... and bring him off the pedestal. Or at least just lower it."}, {"userName": "Lauren Albert", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/2828794-lauren-albert", "userReview": "Reynolds does an excellent job of showing Hemingway developing as a writer while also showing his flaws. Reynolds clearly thinks Hemingway is a genius yet can still see honestly his rewriting of his past, his jealousy, his antisemitism, etc. He shows how Hemingway learned from other writers--what he took away and what he dropped by the wayside."}, {"userName": "Bradley", "userReviewDate": "Apr 29, 2011", "userURL": "http://www.goodreads.com/user/show/529237-bradley", "userReview": "I really enjoyed this book. I especially enjoyed reading this book after reading \"A Moveable Feast\". Michael Reynolds dives into Hemingway and what he was up to during his years living and writing in Paris. Consider it a companion book to Hemingway's \"A Moveable Feast\"."}, {"userName": "Karen", "userReviewDate": "Nov 19, 2009", "userURL": "http://www.goodreads.com/user/show/1440735-karen", "userReview": "I just adore him and after visiting Key West I find I want to read more about his life interacting with the other great artists of the early 20th century in Europe at the time."}, {"userName": "Alison Hardtmann", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/28105228-alison-hardtmann", "userReview": "This is the perfect companion volume to A Moveable Feast. It takes Hemingway's memoir and puts it in chronological order, explains Hemingway's many jabs and offhand comments and corrects where Hemingway either embellished the story or made things up. What emerges is the story of a developing writer, a man desperate to both escape his upbringing and to impress the folks back home, a man quick to toss out an insult, but even quicker to take offense. Arriving in Paris, Hemingway was a mediocre writer of sentimental stories, but in just a few, intense years, he had made himself into one of the best writers of a very fertile time in American writing. Of course, he had help along the way, in the form of friendship and support from the likes of Gertrude Stein, Ezra Pound and even Ford Madox Ford, who supported Hemingway despite of Hemingway's scorn and his own preference for traditional 19th century writing. Hemingway needed help, even as he wanted to be a self-made man, leading him to form intense friendships that never lasted long -- Hemingway was not given to gratitude and preferred to burn his bridges once he had walked over them.Reynolds discusses Hemingway's writing during that time in detail. I was interested to find that my favorites of Hemingway's many short stories were written during his years in Paris. He worked tirelessly at his craft, and when he was doing well, he wrote quickly. He was also able to edit his stories down; removing everything that didn't need to be said, leaving no unnecessary scenes or even words. A disastrous trip to Pamplona to watch the running of the bulls was the inspiration for The Sun Also Rises.Reynolds' also puts Hemingway within his time and place, explaining the events of the time as well as providing a vivid picture of Paris in the 1920s.It was a thrill to read that when Hemingway went to New York to negotiate the publishing contract for The Sun Also Rises he hung out at the Algonquin, spending time with Robert Benchley and Dorothy Parker, both of whom would accompany him on the ship back to Paris. I would have liked to have been on that boat."}, {"userName": "Ietrio", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/40137479-ietrio", "userReview": "A tedious text, written a little bit more literary than a cop presenting the facts in his report. It's about what the man did and not much else. And because the text would be so short, it is filled with context data, which surely helps clarify the actions, but also takes a lot of space. I did enjoy finding out that Hemingway did go to the St. Bernard Pass with the materials and logistics of the 1930s, but I also do not care much about this sort of trivia."}, {"userName": "Michael D.  Alligood", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/19016011-michael-d-alligood", "userReview": "Thorough and captivating. While no one can completely (or accurately) write biographical material, Reynolds does an excellent job at ‘connecting the dots’. Having studied Hemingway in the manner of an expert, I have no arguments with Reynolds’ inferences on Hemingway’s (et al) mood or demeanor. I have two more books in the series of five to finish."}, {"userName": "Richard Anderson", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/7249676-richard-anderson", "userReview": "Enjoyable continuation of this very detailed biography."}, {"userName": "Maegan White", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/32780115-maegan-white", "userReview": "Michael Reynolds does a wonderful job filling in the missing links of Hemingway's Paris Years! I felt like I was living, 7 years alongside Hadley and Hemingway! I look forward to reading more works by him!"}, {"userName": "Mike", "userReviewDate": "Feb 04, 2016", "userURL": "http://www.goodreads.com/user/show/11734218-mike", "userReview": "Hemingway in Paris is more than a companion to Shakespeare and Company and A Moveable Feast, it is almost the essential Hemingway book. Reynold's amazed me with the details and the understanding that cover these years of writing that could be called the apprenticeship. It details the difficulty of the writer in getting his voice and getting it published.It is insightful in diagnosing writing and also the writer. Hemingway is a mix of a good-time companion and a vicious antagonist. He goes through friends with abandon and seldom recognizes the aid that the Lost Generation Parisians gave him. Or rather, he used their help, and then because of his own strained sense of who he was, he turned on them. He did not end friendships easily, he burnt them.His wife was tremendously supportive, but the new life, like the new book will demand a new wife - lover. It was appalling to see how Hemingway's psychosis could turn him to a brute. It is hard to like him, but at the same time it was apparent that there was a mental condition that he could not control. Like a contemporary - Edith Piaf - he was self destructive, but it was the people around him that would be harmed. Like Edith, he rose from the ashes, but neither of them could really grasp what was true and worth thanking as they gave themselves to their art.The love of war, bullfights, boxing, and drinking are all here. As is his writing and rewriting, the help of Fitztgerald on two primary works, and the bitterness he had towards Ford Madox Ford for reasons no one could understand. He was a prime player in the Lost Generation - Pound, Stein, Joyce, Dos Passos, Fitzgerald, MacLeish, Eliot and all the characters of the Paris scene move through the chapters. They appear and disappear as they have been used up.Insights into writing are liberally sprinkled in the text and a person wanting to write will do well to see what they are and how they were applied to Hemingway's work. The text displays his short stories and then transitions to his novels which is the turning point in his career. But through events that should have been happy, there is the demon that stalks his mind and mood and threatens to eventually overtaken Ernest - something that will take decades, but it will happen."}, {"userName": "Quiet", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/18797832-quiet", "userReview": "Excellent biography of Hemingway's years in Paris. Reynolds really digs into all of the information available, and when possible even covers Hem's life from a daily perspective.Absolutely loved reading this, and anyone else who enjoys Lost Generation fiction and life-style will be as impressed as I was, I'm sure. I don't think this biography conquers Hemingway's own \"A Movable Feast\" in terms of covering/describing Paris, but it does provide additional details and insights into those covered by Hem's own memoirs (and, undoubtedly, much more honestly here!).Either way; if you love the 20's you'll love this book. There's much more here than the life of Hem alone; Ford Madox, Gertrude Stein, and plenty of other iconic writers of the 20's are significantly detailed in regards to Hemingway's involvement with them, and many more celebrities of art make their way into this biography as well. The final year, where Fitzgerald enters Paris, is excellently covered and described by Reynolds, and was very fun reading.Now that I've finished this, I'm going to be doing a lot of re-reading. And not just \"The Sun Also Rises,\" but \"The Great Gatsby,\" \"Portrait of an Artist as a Young Man,\" and plenty more. Absolutely love the Lost Generation, and this biography served not only to delightfully enhance the visual and facts of those time, but to revitalize my own thirst for that period of unfettered artistic pursuit, and good, dangerous, and exciting living."}, {"userName": "Zardoz", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/22995214-zardoz", "userReview": "First and let's get this out of the way. Yes, Hemingway was a complete bastard to a lot of people. I'm not talking about being politically correct by today's SJW standards. He was a bully and like most bullies this was brought on by his own insecurities.I've read most everything he wrote and loved most of it. If you're a Hemingway fanboy you will love this book. If not prepare to discover that one of the 20th centuries greatest writer's was a deeply flawed vindictive ass.Now that that's settled I really liked how this book showed how Heminway developed as a writer. Who his major influences were and how his writing process worked. His personal relationships with the members of the Parisian left bank are all laid out here to be enjoyed by his admirers."}, {"userName": "David Carr", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/3932473-david-carr", "userReview": "Reynolds' form of biography is different - there appears to be a lot of speculation as to what Hemingway is thinking. How could Reynolds know this? One of the very interesting things about this series is that it tells exactly what Hemingway was working on, where he was, and what else was going on in his life. This provides insight into the symbolism and meaning of his books and stories. I recommend that you read or reread what he is writing as you read about him writing it. This is particularly easy with the Paris Years because so much of what he was working on were short stories."}, {"userName": "Manfred", "userReviewDate": "Aug 24, 2012", "userURL": "http://www.goodreads.com/user/show/8145053-manfred", "userReview": "A good insight into young Hemingway, from his growing depression to finding his own voice to his petty resentments and jealousies. Also useful as a glimpse into the Left Bank of the 20s, where by 1924 the golden age was already fading under the pressure of tourists from Peoria.Hemingway was definitely not an overnight success (his first book took a year to sell around 20 copies), and Reynolds does a nice job of guiding us through Hemingway's most important years. Highly recommended for anyone who enjoys Hemingway and the Lost Generation."}, {"userName": "justjotter", "userReviewDate": "Aug 09, 2014", "userURL": "http://www.goodreads.com/user/show/15912379-justjotter", "userReview": "For those who love Hemingway or are fans of \"Midnight In Paris\" or both, this book is a must read. Provides informative background to the years Hemingway spent in Paris between 1922 - 25. Descriptive prose paint a realistic picture of the times with harming detail. You will feel as you've traveled back in time, much like Gil Pender."}, {"userName": "Janice", "userReviewDate": "Jan 01, 2016", "userURL": "http://www.goodreads.com/user/show/3857783-janice", "userReview": "After reading several well-researched biographies marred by clunky prose, it was a pleasure to read this one that has the pace and flow of a novel. If I had more time, I would read more in this sequence, but this was the volume that overlaps the most with the current Hemingway exhibit at the Morgan Library (fall 2015-winter 2016)."}, {"userName": "Michael de Percy", "userReviewDate": "Feb 02, 2013", "userURL": "http://www.goodreads.com/user/show/4870960-michael-de-percy", "userReview": "Having read Reynolds' Hemingway in the 30s, I found The Paris Years to be less dull and more like a Hemingway novel. This may well be a result of more information being available about this time period (from A Moveable Feast and so forth) but otherwise, by the second half of the book, this volume had me hooked."}, {"userName": "Sharon", "userReviewDate": "Aug 07, 2015", "userURL": "http://www.goodreads.com/user/show/920159-sharon", "userReview": "Surprisingly satisfying as a biography. A lot of insight offered, especially into Hemingway's mindset in a particular moment or situation. Talks as much about his craft as his love life, which is always interesting. I found it really enjoyable to read along with the short stories in chronological order."}, {"userName": "Nicole G.", "userReviewDate": "Jul 22, 2008", "userURL": "http://www.goodreads.com/user/show/743954-nicole-g", "userReview": "I'm reading these biographies out of order, but that's alright. Here we find Hemingway in the 1920s, still married to his first wife, Hadley, and father to Bumby, and one wonders if he ever really wanted a child. This is where Hem really buckles down in his literary life, to produce The Sun Also Rises and begin to make a name for himself."}, {"userName": "Tammy Cornachia", "userReviewDate": "Oct 26, 2014", "userURL": "http://www.goodreads.com/user/show/5718757-tammy-cornachia", "userReview": "InsightfulA solid, informative look into the burgeoning genius, pre The Sun Also Rises. Any one interested in the creative development of both his short stories and The Sun Also Rises will find this more than entertaining. Great read."}, {"userName": "Morcivert Sapkali", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/6440874-morcivert-sapkali", "userReview": "good"}, {"userName": "Janice", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/23354682-janice", "userReview": "What a time to have lived in Paris. So many interesting and eccentric folks with which to mingle."}, {"userName": "Graham Tennyson", "userReviewDate": "Sep 10, 2013", "userURL": "http://www.goodreads.com/user/show/12910466-graham-tennyson", "userReview": "This is what Hem was about. This book goes to the heart of it."}, {"userName": "Peggy Donahue", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/42595119-peggy-donahue", "userReview": "RivetingThis book added context and emotional detail to a story I thought I already knew well. I can't wait to start the next chapter."}, {"userName": "Nicholas", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/4935120-nicholas", "userReview": "The roaring 20's, Paris, great artists, and the bastard Hemingway."}, {"userName": "Brian", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/21359962-brian", "userReview": "good"}], "description": "These are the heady times of the Nick Adams short stories, Fitzgerald's The Great Gatsby, and the writing of The Sun Also Rises. These are also the years of Hemingway's first marriage to Hadley Richardson, the birth of his first son, and his discovery of the bullfights at Pamplona.", "title": "Hemingway: The Paris Years\n      \n          (Reynolds' Hemingway #2)", "url": "http://www.goodreads.com/book/show/10780.Hemingway", "average": 4.16, "cover": "https://images.gr-assets.com/books/1388177604l/10780.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/7050.Michael_S_Reynolds", "name": "Michael S. Reynolds"}], "type": ["Biography", "Nonfiction", "History", "Cultural", "Biography Memoir"], "outlinks": ["http://www.goodreads.com/book/show/10780.Hemingway", "http://www.goodreads.com/book/show/19442568-hemingway", "http://www.goodreads.com/book/show/1314929.Hemingway_The_Paris_Years", "http://www.goodreads.com/book/show/108215.The_Young_Hemingway", "http://www.goodreads.com/book/show/42686.Hemingway", "http://www.goodreads.com/book/show/147794.Hemingway", "http://www.goodreads.com/book/show/357778.Hemingway", "http://www.goodreads.com/book/show/13628950-hemingway"]}