{"ratings": 7792, "userreviews": [{"userName": "Amantha", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/4939550-amantha", "userReview": "I asked for an ARC because I'd heard Bitter is the New Black was outrageously funny, and I'm pretty sure we're going to be carrying this book at work. Plus all the reviews on GoodReads were positive, so I thought I'd give it a go. I made it through forty pages on the first day. Second day, I struggled a bit more. By page forty-five, I pulled out a pen and started editing as I read, and marking all the cliches, exclamation points, and parts where characters seemed less-than-believable if not downright like cardboard cutouts. By page sixty I gave up.This book could have been amazing if it had gone either extreme direction: either more exaggerated and thereby more ironic, or toned down into less of a stereotyping hodgepodge of two-dimensional characters. Mean Girls meets Romy and Michele meets 17 Again...if that sounds like your kind of thing, then this book is for you."}, {"userName": "Jennifer", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "You know what I'm going to give it the full 5! It was fun, hilarious, cute, emotional and ended perfectly. It was exactly what I needed right now!I love books and movies where people go back to high school to learn a lesson or change their lives. I've seen Peggy Sue Got Married a million times. LOL I mostly only read Chick Lit from Sophie Kinsella but I'm so glad I accidentally requested this because it was so much fun. Seriously made my day. Similar to Kinsella it was laugh out loud hilarious, but also emotional and real at times where I could connect to the main characters thoughts, feelings, and actions.Lissy thinks her life is perfect. She was popular in high school and married her high school boyfriend. Super job and super marriage until she is fired and her husband leaves her. Moving back into her parents house in her 30s she has hit rock bottom. Lissy decides to start her own company and that the perfect place to get new clients would be her high school reunion where everyone loves her. Except they don't and never did.At first I liked Lissy. She may be a bit shallow but nothing wrong with wanting pretty things, a great career, and not wanting a family. Everyone has something that makes them happy and that is great. But then at the reunion we see what a horrible bully she was back in high school. Everyone says the only way they would give her business is if she had never done those things. So one of her hippy classmates lets her go back in time. Lissy takes a close look at how she acted in high school and works hard to make everything right. Then when she comes back, everyone from her high school is no longer successful. Turns out while she was horrible it made everyone else stronger and work harder. So here we go again and she heads back to high school to fix things.Back and forth she goes a couple times! LOL It was really great that Lissy would work so hard to make sure things worked out for everyone else. While I never found her to be purposefully mean she was self-centered. As I saw Lissy with her mom I realized where a lot of her pressure and problems came from. Her mom put so much pressure on her to be skinny, popular, and marry some wonderful guy. Going back in time with all her knowledge allows Lissy to see things in a new light. Lissy wanted to be a better friend, wife, and daughter.One of Lissy's big regrets was the way she treated her nerdy neighbor, Brian, who I loved! Lissy is realizing that maybe she shouldn't end up with her husband. She wishes she had been strong enough to date the less popular guy. Brian was so understanding with Lissy and sweet. But can she change it all without destroying all their futures? I was really getting worried about how this could all possibly work out for everyone but it actually ends perfectly! I'll definitely be checking out more books from this author! If you love to laugh and visit your high school days then this is the perfect ride!---\"But how could they not be in perfect shape? These bitches have no responsibilities save for workouts and waxing. I mean SOME of us aren't a size two anymore because SOME of us have day jobs.\"\"But do you know how expensive it is to keep up this face and body after you hit the down side of thirty-five? Placenta-based wrinkle creams and eyelash extensions and personal training aren't free, you know.\"\"Your dress is in the bathroom. When we got here, you cried that your underwear was 'murdering' you and you stripped down.\"\"Ah, yes. Spanx are a hard mistress.\"\"Oh, Lissy, yes, baby. 'Course you can eat whatever you want.\" Before I could even sigh in relief, she added, \"Soon as you're married.\"---*I received a free copy from Edelweiss in exchange for an honest review*"}, {"userName": "Bonnie", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "My rating: 4 of 5 starsA copy of Here I Go Again was provided to me by NAL/Edelweiss for review purposes.Lissy Ryder is that kind of girl in school that is super popular and you can't help but love/hate her. I know we all went to school with at least one Lissy-type. Her 20-year high school reunion is coming up and shortly before, everything about her life seems to falling apart at the seams. She's kicked out of her swanky gym for not paying the fees, she gets fired from her job and her husband just asked her for a divorce. Choosing not to wallow and instead pick herself up and go to her reunion she discovers that the people from high school don't love her as much as they used. Actually? They pretty much hate everything about her. But what can she do? It's not like she can change the past or anything... right?I can't help but love Jen Lancaster. I've followed her on Twitter and on her blog for years, I've read all of her memoirs, and she's one seriously hilarious lady. But in 'Here I Go Again' I felt that her sense of humor really shined through in a whole new refreshing kind of way.I loved pretty much everything about the book. 80's references were strewn throughout (mainly regarding the big hair bands) and being a personal lover of the 80's (and big hair bands) this was incredibly fun. I loved the cast of characters that were so completely hilarious, although Deva and her quirkiness was my favorite. But what made this most enjoyable was the fact that Lissy's 'change' into a better person after realizing how wrong she was in the past was truly genuine. The time travel bit was goofy but completely intentional. Did it make a whole lot of sense? No. Was it supposed to? No. But was it entertaining? Absolutely.Jen managed to write an extremely multi-layered story that was hilarious and incredibly enjoyable. Normally with these stories there's always the picture perfect happy ending, but in 'Here I Go Again', well, as Lissy would say: 'Karma really is a bitch.'"}, {"userName": "Holly", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/914353-holly", "userReview": "I think I have read all of Jen Lancaster's books. I started with Bitter is the New Black, and laughed so hard I hurt myself. I loved this book....BUT: I really think if you haven't read her, this is not the book to start with. Go read Bitter, and maybe two or three of the others she has written, more semi-biographical/snarky bloggish....THEN graduate to this one. I say that because this is the first novel of hers I have read, and if I hadn't already fallen in love with her wit and self depricatingly simple style, I might not have enjoyed this book as much. Having said that, this is a really sweet book. It is about second chances, and really, who couldn't use a few of those? It is also about the delicate relationships of friends and family, and how easily we (sometimes)unwittingly, sometimes purposely, hurt each other. It is funny, and clever, and interesting, with a good message. But it is also witty and lighthearted, and a quick, easy read. I laughed. Out loud. Just not as often, nor nearly as much as I have with her other books. But I am still thinking about the characters, and the ending, days after I closed the back cover. Read some Jen, you will like her."}, {"userName": "Kassandra", "userReviewDate": "Jul 04, 2013", "userURL": "http://www.goodreads.com/user/show/17860040-kassandra", "userReview": "Let me preface this review by saying that I have been a huge fan of Ms. Lancaster throughout her entire career. I have made it a point to buy each new book the day it is released and have usually consumed the contents within 24 hours. However, I've found that over the past three books, my excitement has been wanting. In her early works, Ms. Lancaster was witty, charming, sarcastic and always presented a viewpoint that was unique and genuine. In my opinion, as her fame and fortune has grown, her perspective has become less genuine and the content of her material has become very materialistic indeed. For me, this has robbed her books of what made her such an enjoyable author. I had hoped that her second work of fiction would prove me wrong but there is very little that I can say about this book that is positive. The material seemed flighty and recycled; a bad combination of movie content already made popular by other writers. Her characters were difficult to like and the writing was so full of cliches that it made it difficult to digest. A part of what used to make her writing so great was the way that she treated her readers as intelligent, thoughtful and full of a similar type of humour. Now, it feels like she is pandering to what she feels would make her more popular. Please Ms. Lancaster, go back to your writing roots; reclaim what made you my favourite author for so long. This fan is quickly losing interest in hoping the next book will be better."}, {"userName": "Anna Bez", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/4978562-anna-bez", "userReview": "Full disclosure -- I quit reading this book. I tried to make it through, and even talked myself into continuing reading when I wanted to quit 20 pages in. But when I reached the halfway point and still disliked the main character and did not care one iota what happened to her, I decided it was time to call it quits. Reading should not be a chore, am I right? So what was the problem? Basically poor character development. The main character is the cliche \"mean girl\" who is usually cast as the villian in any chick lit or flick. Putting the mean girl as main character could have been an interesting way to see into the psyche of the girl we only ever see the surface of, but Lancaster wrote her as shallow and spiteful as she is usually portrayed as a suporting cast member. On top of that, Lancaster tried to make \"Lissy\" Southern by having her ...wait for it...eat grits, and call her mother \"mama,\" and other little dabs of as-seen-on-tv-style-Southernness. It reads as so fake and insulting. Please note that having watched a few seasons of \"Newlyweds\" does not make you an expert on what it means or looks like to be Southern. Even I know this and I'm technically a yankee."}, {"userName": "LaurieH118", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/4009800-laurieh118", "userReview": "Make no mistake -- Jen Lancaster writes well. She has a way with narrative and many passages of this book made me smile. (For example, I loved both takes on \"Duke of Hurl.\") She also does a wonderful job expressing the schadenfreude of high school social life, how so much \"mean girl\" behavior is tolerated because fragile teens are just so grateful they aren't the targets of scorn. But there's something lazy and formulaic about this effort. \"Self absorbed heroine gets kicked in the pants by life and undergoes a transformation.\" It's as though the Jen we met at the beginning of her first memoir, Bitter is the New Black gets into a time machine. There are many references to Back to the Future and The Matrix, a nudge-nudge/wink-wink way of acknowledging that this isn't the most innovative plot device, and reminding us of how often it's been done before makes it harder for the audience to suspend disbelief. I see from Jen's blog (\"Jennsylvania\") that her next book is about living life according to Martha Stewart's magazine. Sounds a lot like Up For Renewal: What Magazines Taught Me About Love, Sex, and Starting Over. Since Jen Lancaster is such a good writer, I hope she finds a project that's truly original for her to sink her teeth into. In the meantime, this is a fun, breezy read."}, {"userName": "Ninette Swann", "userReviewDate": "Jan 31, 2013", "userURL": "http://www.goodreads.com/user/show/10635417-ninette-swann", "userReview": "As a story, Here I Go Again sucked. Wait! Keep reading! (Even you, Jen, if you do things like read Goodread Reviews.)It was a smarmy, unrealistic mishmash of It's a Wonderful Life and Mean Girls.I know, you're thinking, um, it's about a time-travelling jerkface, it's obviously not meant to be realistic.And I know. I know. But, for me, even my unrealistic stories need to tie up their loose ends, and make sense in the alternate reality they've forced into existence. And Here I Go Again doesn't do that.There are a lot of inconsistencies, and plot points that weren't thought out, weren't followed through. (Okay, here's where the review gets good, I promise.)But Here I Go Again ISN'T a story. It's a parable. And as a parable, it's fantastic. Right up there with the New Testament, and much more relevant to me at my current place in life.The point of the book is pretty much exactly what the book SHOUTS at you (not exactly subtle, really, this book). Small motions create huge results.And this is a truth. Even those of us without little vials of magic potion know that. But sometimes we forget.The sub-theme is that kindness, true kindness--not the kind with any self-serving purpose--wins out in the end. That karma (even though it's NOT karma, but that's a semantics argument for another day) will get you. That you reap what you plant.These lessons are some that I really needed to remember right now. Not that I'm being cruel to anyone, or experiencing anything near as extreme as the protagonist here, but that I could stand to be a little kinder, a little gentler, a little more loving as I go through my day-to-day life. I do a fairly good job, but I can get so caught up in what I need to succeed, and what I need to do physically for others to make them happy, that I forget, sometimes, to sit back and love and appreciate.I was already making amends in this way, and Here I Go Again was excellent supplement reading for my journey.So, yeah, the story? Not so much. The parable?Aces."}, {"userName": "Lauren", "userReviewDate": "Aug 18, 2012", "userURL": "http://www.goodreads.com/user/show/802066-lauren", "userReview": "I LOVE Jen Lancaster: as soon as I see she has a new book out, I pounce on it! I loved her memoirs (she's my deliciously snarky soulmate!) and now that she writes fiction, it's like there's a whole new world of amusing books to explore! Her newest, featuring the Queen Bee we all loved to hate and her comeuppance, is hilarious and sweet. Now I just have to wait for her next book!"}, {"userName": "Sandra", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/3633627-sandra", "userReview": "."}, {"userName": "Kelly Hager", "userReviewDate": "Dec 17, 2012", "userURL": "http://www.goodreads.com/user/show/1436215-kelly-hager", "userReview": "Lissy Ryder may or may not have peaked in high school. Back then, she was the Heather Duke (or Regina George, as you prefer) of her school. Everyone feared her, even her boyfriend and best friends. Now, though? Her husband wants a divorce and her boss just fired her. She's back with her parents and, as an added bonus, her class reunion is coming up. And it turns out that all the people she bullied are all crazy successful (as opposed to recently fired, newly single and living in their childhood bedrooms). Then she gets a chance to turn it around and go back to high school. But can you really change everything in two weeks? Lissy's about to find out.LOVED THIS BOOK. :) It's my first Jen Lancaster book (but so not my last). It was incredibly funny and there were a ton of great references (including its very own Heathers reference. Want me to love something? Throw in a Heathers reference).It also reminded me a little bit of an adult version of Before I Fall by Lauren Oliver. (Book club note: read both and have the best discussion ever.)It was also a pretty accurate portrayal of high school (except for the fact that their graduating class had a very high number of successful graduates, which seemed a little unrealistic...although my high school didn't have very many bullies, so maybe that's why none of us have exactly set the world on fire). Lissy Ryder in high school was a very scary person. And it was very sad to see her as a grownup, because she hadn't gotten any better since high school. She was very sarcastic---and yes, so am I, but she was very mean about it. And it was like she never really understood that other people had feelings or were even really people/worth anything besides the way they could serve her.But the transformation was great. I always enjoy seeing people become the best versions of themselves and that's what happened with Lissy.Recommended."}, {"userName": "Jessica Woodbury", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/4271946-jessica-woodbury", "userReview": "I opened and closed at least five different books before I settled in with this one, so I was feeling pretty picky. I'm not a \"chick lit\" reader, but I like stuff that's snappy and funny and smart. The thing about HERE I GO AGAIN is it doesn't ask for serious brain power. I have classified it as \"fluff\" and it definitely falls in that category. But just because it's fluff doesn't mean it can't be funny and satisfying and better than a lot of other serious books you'll read.The setup (MEAN GIRLS meets BACK TO THE FUTURE) is crazy and funny and Lancaster's obnoxious heroine may remind you of recent non-adult characters like Cameron Diaz in BAD TEACHER or Charlize Theron in YOUNG ADULT. Lancaster is going for more of the traditional romcom route than either of these, but she's also more successful. She manages to make you love and hate the obnoxious Lissy Ryder, queen bee turned PR failure. Her prose sparkles and shines like Lissy's bright pink BMW convertible. Even if you consider yourself above such things, give it a read. It's astonishingly rewarding.And if they don't make a movie out of this, they are CRAZY. I'd see it in a heartbeat."}, {"userName": "Katie Hanrahan", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/3579491-katie-hanrahan", "userReview": "There are days when you need something entertaining that won't make you think and would be spoiled if you thought about the premise too closely.This is one of those books.Jen Lancaster has a unique voice and a sense of humour that comes through no matter what genre she's writing. In this piece of fiction, she takes on the secondary school queen bee and delves into a little time travel. For all those times you might have thought, if only I could go back and not do X or Y, Ms. Lancaster takes her obnoxious character through a growing process that makes absolutely no sense if you try to figure it out.Just run with it and be amused.No heady prose here, no deep thoughts. The novel is not outstanding in a literary sense. It exists to lift you, the reader, out of your world of deep thoughts and stress. Sure the time travel business has been done by others and there isn't anything particularly new about the story. But when you want to escape from your worries, you need something comfortable and familiar like a favorite chair."}, {"userName": "Pcox", "userReviewDate": "Jan 12, 2013", "userURL": "http://www.goodreads.com/user/show/12813775-pcox", "userReview": "Don't know how she is a NYT best selling author unless mainstream is getting really shallow."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "You know....other than, \"Read\" I don't really have any other shelves on which this book belongs. I picked it up because it sounded light and with an odd little twist. I suppose I could put it on \"Science-Fantasy\" though that's really just the stage on which the action of the book takes place.We've all heard that \"Karma's a bitch\". Well, Lissy Ryder is about to find that out first hand, in Spades. See Lissy was THE pace setter in her high school. She was the girl who...if you weren't her or the male equivalent (who would probably have dated her) most people remember with, well hate. Of course not all \"Head Cheerleaders\" or Student Council officers, or whatever were the tyrants Lissy was. But see Lissy doesn't remember it all the way most everyone else does. So when Lissy loses her job, her house, her credit cards...and her husband...all on the same day she thinks that the one thing she can look forward to is the \"adoration\" of all her \"followers\" when they meet again at the high school twenty year reunion.....Of course things don't exactly go Lissy's way. As person after person unloads on her about the hell she put them through in high school Lissy begins what will one long and sometimes painful wake-up call.Do any of us ever really get completely over high school? I don't know. I was the \"outlier\" in high school. As such Kissy would have probably found reason to insult me...or at least make sure I got a public, \"snub and flounce\". There are the nerds, the \"in clique\", the jocks and so on. I think most everyone who's gone to high school or secondary school.Look, I thought my liking this book was a long shot. I like urban fantasy, epic fantasy, science fiction, action thrillers, techno thrillers, but now and then there are also books that are \"outliers\" and turn out to be very readable.I enjoyed this one, give it a shot even it doesn't look like one you might ordinarily pick up. It was a sur4prise for me and I can recommend it."}, {"userName": "Mary (BookHounds)", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/1378745-mary-bookhounds", "userReview": "My ThoughtsLoved ITLissy Ryder is a sharp tongued viper and rules her high school with her quick cuts and it doesn't hurt that she is cheer captain, homecoming queen and the best dresser. Of course, everyone knew a Lissy in high school. That b*tch that really made your life miserable. You really hope that karma comes back to bite them on the butt. Well, karma does come back to get her and it isn't pretty. Twenty years later, Lissy is a PR hack, her marriage to the high school prom king is faltering and her three hour \"meetings\" where she tans and trains finally all catch up to her. She is fired, her husband leaves her and she finds herself back in her childhood room. As she hatches a plan to launch her own PR firm and is angling to get the boy-next-door's mega online business as a client, she heads to her high school reunion. Instead, she ends up drunk and her long enduring BFF, Nicole, dumps her at the hotel. One of her schoolmates takes pity on her even though she was abused by Lissy. Now a successful tranquility coach and alternative therapist, Deva gives her a potion that lets her travel back to her high school days for a re-do. Part Mean Girls and Back to the Future, Lissy time trips three times until she gets it right and gets to have a kind of pick your own adventure where she gets to try out different endings until just like Goldilocks, she gets it just right! Oh, if you have ever read any of Lancaster's earlier books, a few of these situations look like they are ripped right out of reality. I really wanted to psychoanalyze and match up Lissy to Lancaster's memoirs. This is a fun read with many memorable lines but parts of it really drove me up the wall. I did have to put it down a few times since it was so over the top. Over all, this is a perfect beach book."}, {"userName": "Julie", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/17747186-julie", "userReview": "While nothing beats Jen Lancaster's memoirs, this one surprised me (mainly because, having read all of her memoirs, I was afraid that she would put too much of herself into the protagonist - a fair concern.However, the novel had quite a few unexpected twists and turns (read: time travel!), and while I expected to be more than a little disappointed, I was more than a little pleased with it (read: I'll most likely read it at least 2-3 more times as I purchased it on my nook).I think that the main elements that make it so recommendable (besides the gold seal of Jen Lancaster's name on the cover) are: Lissy Ryder, the protagonist (at first, you can't help rooting against her, but by the middle of the novel, you're not sure if you want to root for her or against her - it's a constant up and down struggle in which you become entangled - and this is a very, very good thing - hello, page-turner!)!The time-travel element - and believe me, I am not a big fan of books with time travel or elements of fantasy. In fact, realistic fiction is my favorite genre, and there are few books I've read and re-read and adored that fall under fantasy or even science fiction. But in this book, Jen did it fantastically, and it was 85% realistic fiction and 15% fantasy (in my opinion). It was a total plot enhancer.The setting - who hasn't endured high school? Who hasn't been at the mercy of a Lissy Ryder? Come on. It's great.Bottom line - it's not a pee-your-pants Jen Lancaster memoir, but it's an enjoyable page turner that won't let you down."}, {"userName": "Courtney", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/127972-courtney", "userReview": "It is super evident that Jen wants to write YA fiction and this story would have been perfect as just that. Her voice is unique and I need to accept that it is going to come through in her fiction more than it should. This held my attention - but again - is the same variation of brand-name dropping narcissism that has put Jen on the map. It is WAY better than \"If You Were Here\", but still not as good as her memoirs. When I was reading the parts in high-school, I was recalling \"Bitter is the New Black\" and how proud she was of her high-school self. It seemed to me like she was channeling that part of her life in this book. Also, the people who ended up needing to \"change\" was a bit of a copout. Jen is starting to remind me of a funny Mary Higgins Clark. MHC has the same elements in every single book. You can guarantee that a woman will be hunted and she will be impeccably dressed with a turtleneck on of some sort. Same with Jen. John Hughes mention - check. Set in Chicago - (southwest of the city instead of north this time, but..) - check. \"Note to self\" instead of footnotes - check. Insane brand name insertions - check. Name drop of a Big Ten University - check. Flouncing - check.Keep the memoirs going and just go to YA fiction. It is where she wants to be and where she could do some fantastic work in helping young girls understand the world. Footnote: Darn straight Lissy's life was awesome after she went to Indiana University."}, {"userName": "Lisa", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/3932781-lisa", "userReview": "I am bummed. I usually love everything Jen Lancaster writes, to the point I avoid reading them in public as her writing has always had me quite literally laughing out loud. Like, tears rolling down my face, can't catch my breath laughing. More so with her memoirs than her first novel, but even that novel was really very funny and clever.Slight spoiler below......Here I Go Again, about the high school mean girl and her attempts to right wrongs and improve lives (her own and others) through a series of time travel episodes where she tried to be nicer, then meaner, then hitting the right tone to arrive at her 'perfect life' was boring, not a bit funny, and honestly - quite odd. This was not done in a clever enough manner to provide a suspension of disbelief that would have the reader saying - yeah, a magic potion could TOTALLY do that. And, remembering the mean girls of my past, could changing how one behaved in a period of a few weeks really undo all the cruelty that came before?Usually a Jen Lancaster read provides a welcome reading vacation - making you laugh along and nod your head. This one just misses the mark. While I highly recommend reading all her great memoirs, this one I would sadly give a pass on."}, {"userName": "Dina", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/4878787-dina", "userReview": "This book has my era and sense of humor written all over...and in it. Not too mention my affection for Whitesnake. It was obnoxiously funny and a damn good laugh. It's the tale of a mean girl who grows a conscience after she realizes everyone she used to mock in high school has grown up to be much more successful than she is. The story takes a fun trip on the time travel train and lands in the town of Karma is a Bitch. Two of my fave lines:\"God, Tammy, do you ever read anything other than the instructions on a pregnancy test?\"\"And by the way? Jaclyn Smith for Kmart called and she wants her sweater back.\"Enjoy! :)"}, {"userName": "Mich", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/1173346-mich", "userReview": "Fluff. Total fluff which is what I expected. I LOVED her views on children- reminded me of a friend who shares those sentiments. Also Thot bout Rommy and Michele's high school reunion movie too. Read it poolside in one sunning and laugh while u bask"}, {"userName": "Joy", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/1694004-joy", "userReview": "I enjoyed this; it's a fun, entertaining story."}, {"userName": "Ashley FL", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/750344-ashley-fl", "userReview": "I thought this was funny and touching. An easy read that made me happy. Definitely Chick-Lit-Lite, so don't expect Great Literature."}, {"userName": "Gaylene", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/12679774-gaylene", "userReview": "Pretty Much \"13 Going on 30\" with a LOT of pop culture references. Too many for my taste. Not a likeable main character until the very end."}, {"userName": "Meg", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/3423663-meg", "userReview": "Erstwhile bully Lissy Ryder realizes the error of her ways after her now-successful fellow students voice how much they all despise her at her 20th high school reunion. A former classmate-turned-mystic offers her a chance to go back in time and make different choices, and she takes it -- with amusing, occasionally disastrous, ultimately positive results.Lighthearted, fun and a joy to hear on audio (with Jen Lancaster narrating, but of course!), I really enjoyed this tale of a sasspot getting her comeuppance. Have we seen it before? Sure. This trope -- righting the wrongs of our youth; making amends in the past to change the future -- is a tale as old as time . . . but Lancaster doesn't disappoint, and it was a very pleasant way to pass my commute."}, {"userName": "Denise", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/23104442-denise", "userReview": "Lissy Rider was a horrible human being, someone you just want to slap! She gets a chance to redo her high school years and not do some of the horrible things she did back in the day. But it seems doing the right thing has its own repercussions. This book is set in Chicago, (it seems that most of Jen Lancaster's books are) which I really love. She is known for her humor and rampant narcissism (again works for me). I listened to the audio and did not enjoy the narration (narrated by the author) but,in spite of the lackluster reading, I found myself really enjoying the book. It was a fun, light, silly beach read and if that's what your looking for, I don't think you'll be disappointed."}, {"userName": "Chelsea", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/4888071-chelsea", "userReview": "This was a \"blind date\" read from the library. I honestly don't think I would have ever picked it up otherwise and it wasn't life-changing, but it was fun. This is perfect to read if you're stressed and want something totally chill and easy. It's kinda like Freaky Friday but with time travel instead of switching places."}, {"userName": "Simon", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/614704-simon", "userReview": "Better than expected. I really like the time travel aspect."}, {"userName": "Ali Cherek", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/46228944-ali-cherek", "userReview": "This was solidly on its way to being between a 2 or 3 star book until she went all Butterfly Effect. I’m a sucker for time travel."}, {"userName": "Ciara", "userReviewDate": "Mar 04, 2013", "userURL": "http://www.goodreads.com/user/show/1333177-ciara", "userReview": "i don't know how the hell this happened, but i am pretty into jen lancaster's books now. when i heard she had a new novel out, i raced to add it to my library queue. when i was notified that it was on the hold shelf for me, i dropped everything & ran over to pick it up (one of the joys of living right across the street from the library). & then i read the whole thing in one day, even though i have a baby to take care of & a million other things that i am (or ought to be) reading. i used to hate-read her memoirs because she seemed so blithely evil. i mean, she's all about the tanning & the expensive handbags & the tiny yappy dogs & just kind of reveling in awfulness. but she gradually started displaying these little nuggets of self-awareness, & she can be really funny in this cutting, sarcastic way that is right up my alley &...i don't know! now i like her books! it's crazy! as i wrote in another review, she is a gun-owning republican former sorority girl! this is like the opposite of \"my people\"! but let's just go with it. the heart wants what it wants, you know?also amazing is the way she can take a patently unlikeable protagonist (such as herself, in her memoirs) & kind of have you pulling for them by the end of the book. the protagonist of this book is lissy ryder, who was the queen bee in high school. not only was she homecoming queen & head cheerleader, she was almost the biggest bully around, making everyone's lives miserable. fast forward 21 years & lissy has just been fired from her PR job & served with divorce papers. she's living in her old teenage bedroom again & hoping to start her own PR firm by drumming up business at her high school reunion. several of her former classmates have become quite successful in their fields & lissy expects them all to worship her the way they seemed to in high school.so she is shocked when one former classmate throws a drink on her, another burns her business card, & her husband shows up with a hot date. when presented with the opportunity to go back in time & right the wrongs of her high school self, she leaps at the chance & learns that sometimes doing the kind thing is even more of a thrill than being feared.when she returns to the present, she discovers that being nice in high schools paid big dividends...for her. but her formerly successful classmates are now stagnating in dead end jobs & miserable relationships--or worse. she has a choice to make: does she accept her awesome new life in which everyone else is kind of unhappy, or does she go back in time again & be a jerk so everyone else can be successful? there are annoying things about this book, of course, like the very idea that someone would actually need to be tormented in high school in order to realize their fullest potential. that's a weird message that i don't really have time to unpack, you know? particularly annoying is the story of the gay kid, robert, who dressed up as madonna for \"dress as your favorite rock star\" during spirit week in high school & was attacked by members of the football team who initially thought he was a hot new girl & were enraged by being take in by a dude. it was awfully \"crying game\" & lancaster kind of treats it like, \"eh, maybe it's not cool to break someone nose, but, like, of course a gay kid is going to get his ass handed to him if he tricks beefy jocks into thinking he's a hot girl.\" i know lancaster is probably not super familiar with the rates of violence against trans women, but...her blase attitude here really bothered me, even though she has robert go on to be very successful in adulthood (though not in the alternate reality where lissy makes him change out of his madonna costume & into a more gender-appropriate kurt cobain costume).is the writing great? of course not. lancaster has a kind of irritating habit of interjecting what are clearly her own personal philosophies about things (like advising eccentric kids to save their eccenetricities for college, or the whole \"nirvana sucks\" thing). but it's fun. & ironically, this was just what i needed to read while having my brain fried by baby care. i say \"ironically\" because lancaster is so clearly not into kids."}], "description": "Hilarious new fiction from the New York Times bestselling author of Bitter Is the New Black and If You Were Here .Twenty years after ruling the halls of her suburban Chicago high school, Lissy Ryder doesn't understand why her glory days ended. Back then, she was worshipped...beloved...feared. Present day, not so much. She's been pink-slipped from her high-paying job, dumped by her husband, and kicked out of her condo. Now, at thirty-seven, she's struggling to start a business out of her parents' garage and sleeping under the hair-band posters in her old bedroom.Lissy finally realizes karma is the only bitch bigger than she was. Her present is miserable because of her past. But it's not like she can go back in time and change who she was...or can she?", "title": "Here I Go Again", "url": "http://www.goodreads.com/book/show/13585792-here-i-go-again", "average": 3.53, "cover": "https://images.gr-assets.com/books/1353006699l/13585792.jpg", "reviews": 1104, "authors": [{"url": "https://www.goodreads.com/author/show/14577.Jen_Lancaster", "name": "Jen Lancaster"}], "type": ["Womens Fiction", "Fiction", "Humor", "Science Fiction", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/13585792-here-i-go-again", "http://www.goodreads.com/book/show/16207711-here-i-go-again", "http://www.goodreads.com/book/show/17689541-here-i-go-again", "http://www.goodreads.com/book/show/27126.Bitter_Is_the_New_Black", "http://www.goodreads.com/book/show/26023.Bright_Lights_Big_Ass", "http://www.goodreads.com/book/show/2202049.Such_a_Pretty_Fat", "http://www.goodreads.com/book/show/5093760-pretty-in-plaid", "http://www.goodreads.com/book/show/7090290-my-fair-lazy", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}