{"ratings": 63, "userreviews": [{"userName": "Lola  Reviewer", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "3.5 stars.One of my favourite things is reading about experiences I’m not familiar with so I can participate in them vicariously through the characters. For example, I never attended a Catholic private school. And even if my middle school had a ‘‘Religion’’ class, I was placed in the ‘‘Moral’’ one with the other students who weren’t Catholic. I liked it. We talked about what it means to have morals and be a decent human being. But Michael is now attending such a school, because his father uprooted their family to a new city for his job and enrolled him at a prestigious school that happens to be thoroughly Catholic. I say ‘‘thoroughly Catholic’’ because St. Clare’s has a ‘‘Father’’ as principal and ‘‘Sisters’’ as teachers.And guess what? Michael is atheist. His classmates are… not. They pray in class and go to mess and discuss saints and such. Things that Michael is not interesting in. Not at all. However, the moment he thinks he will never fit in and make friends, he meets a group of people who call themselves the ‘‘Heretics Anonymous’’ and bonds with them like he never did with anyone else. This story reminded me of the book Moxie by Jennifer Mathieu. While Moxie and Heretics Anonymous focus on different topics, they both feature a high school whose rules are questionable and strict and whose student body deserves to know the hypocrisy of the institution that is supposed to educate the future leaders of the world. So the goal of the Heretics Anonymous is to push students to think critically about issues quickly covered up by authority figures, the different regulations enforced that students are expected to follow blindly as well as the wrong information given by the school, especially when it comes to sex education. FYI, that specific part is hilarious. It seems like such a serious story with heavy themes and a cast of characters that wish to revolutionize the way their school functions in general. All of that is true and the characters’ intentions certainly are noble, but they also make mistakes before realizing that nothing is either black or white; there are shades of gray everywhere, and although we all want to be right and for our opinion to be the one that matters most, we have to consider other people when we plan to change how things work in a community, and a school is a community of a sort.Surprisingly, their mistakes are very entertaining and the ideas they come up with to influence the student body to think differently quite interesting, though not particularly original since some are similar to those featured in Moxie. I found myself smiling while reading about the friendship dynamics between Michael and his crew, the Heretics Anonymous, seeing that they discuss not only the school and Catholicism, but also their own particular beliefs that shape who they are as a person. Lucy especially is a wise, if not a little stubborn, young woman who’s not going to try to convert you, but will show you how important it is to believe in something, anything, and not necessarily God. It can be love. It can be friendship. It can be family. In sum, this is light-hearted enough to make you smile and laugh during certain parts, but undeniably realistic, meaning that other scenes will hit you hard with their raw emotions. I would have given it more, and certainly wanted to, but except for dear Lucy, we as readers are not particularly connected to the Heretics Anonymous members. We get a sense of their personalities and what matters to them most, but they seemed to exist for the purpose of this group alone, whereas Lucy is still Lucy whether she’s part of the group or not, and because she becomes very important to Michael. Still, quite enjoyable. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Tatiana", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "3.5 stars A very rare YA novel that dares to talk about religion. It challenges Catholic dogma, while being understanding and respectful of faith in general - not a small fit.I found the YA part much less compelling, the main characters felt like carriers of traits rather than full personalities, especially the narrator - a 16-year boy of a very bland, self-insert kind who eventually is involved in an equally bland romance, although with a significantly more interesting girl. Which made me question why he was the narrator at all."}, {"userName": "Matt Carton", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/21531137-matt-carton", "userReview": "I will preorder this book from a local bookseller when the time comes. Amazon will not get my money for this. I will pay full price, dammit!"}, {"userName": "Samm | Sassenach the Book Wizard", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/43825251-samm-sassenach-the-book-wizard", "userReview": "~I received an eARC~I cannot think of another book that I have associated with as much as Heretics Anonymous. The cast is so wonderfully diverse--and made a particular effort to give representation and/or mention to every group I can think of when it comes to religion and spirituality.The comedy! I laughed out loud at least once a page. Michael has absolutely identical level and style of sarcasm. As someone who was an atheist and went to Catholic high school, I vividly remember noticing, thinking, and saying things he does. He also has a habit of putting his foot in his mouth for the first half of the book which was just...so incredibly hilarious (and oh so relateable)While I most related to Michael, I found Lucy so incredibly interesting. I know so many people in their 20s and 30s who are not atheists or agnostics but they struggle identifying with official religious institutions because they have not modernized or refuse to acknowledge history.The ragtag group in Heretics Anonymous was so well done and I loved all the debates and conflicts they have. It's realistic with all their different perspectives and personal priorities.I cannot find a single thing about this book I didn't like. It did such a good job of presenting conflicts and a diverse cast without villainizing anyone. This is absolutely going to be a book that I reread (which shocked me since I am not a big fan of contemporaries). I read this in a single seating and can see myself doing that again in the future. Even higher praise: it's my second favourite stand alone of all time."}, {"userName": "⚔ Silvia ⚓", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/13306676-silvia", "userReview": "Will someone please give this humble atheist an ARC of this book where the word atheist is actually mentioned on page instead of glossed over just like in every YA book"}, {"userName": "Adrienne Young", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/66409888-adrienne-young", "userReview": "An absolutely hilarious and honest look at faith and identity. Loved this book!"}, {"userName": "Jenni Frencham", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/6906412-jenni-frencham", "userReview": "Michael, an atheist, has been sent to a private Catholic school. His dad keeps getting promoted within his company, which has sent Michael and his family traveling across the country, and Michael has been promised that this is the last move. Michael ends up making friends with other \"heretics\" at his school: people who, for various reasons, do not fit the mold of a Catholic school student. They meet together as a sort of unofficial support group, until Michael challenges them to begin changing the system. Thus the group of heretics start fighting back against what they see as injustice at their school. While Michael himself and his friend Lucy are both well-developed characters, we learn much less about the other members of HA, which is unfortunate. Watching them plan and fight back against their school with mixed results reminds me of Jennifer Mathieu's Moxie. The story is about the group of characters, but mostly it's about Michael and his relationship with his friends and also with his family. Michael's frustrations at being moved across country on the whims of his parents will ring true to teens who have had to move in the middle of a school year. I was impressed by the inclusion of an atheist character, as this is a rare occurrence in teen contemporary literature. Recommended for: teensRed Flags: language; underage drinking; Overall Rating: 4/5 starsI received a complimentary copy of this book through Edelweiss for the purposes of review."}, {"userName": "Christy", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/4794494-christy", "userReview": "3.5 Stars What happens when you throw an atheist in a catholic school?Michael, having been moved around to several schools due to his dads job is not happy with the latest school he ended up in. You see, Michael is an atheist and his latest school? It’s a catholic school. If you think that means there’s all kinds of crazy that goes down, you’d be right. My favorite aspect of this book was the rebellious group, Heretics Anonymous. I loved that even though they were all different in their own way that they still fit. It showed that it’s possible for people to have different views and different beliefs and still be able to not only get along, but to legitimately care for one another and that was so heartwarming. This is the way it should be. Heretics Anonymous is a book that I feel will be loved by many."}, {"userName": "Dana Mele", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/22243359-dana-mele", "userReview": "This book was absolutely delightful- at turns hilarious, poignant, and heartfelt. The characters are so distinct and lovable and sharp witted and strange, and the dialogue is cut with a razor edge. Start getting excited for Heretics Anonymous now. It’s a refreshingly comedic coming of age story of faith, (and what it means to believe in something other than God), family, friendship, and first love."}, {"userName": "Meera Nair", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/5221844-meera-nair", "userReview": "Ratings - 3.5 out of 5 stars Just when Michael thought that they were done with the whole packing up and leaving, his parents announce otherwise. Now, he has to attend St. Clare's Catholic School, which isn't exactly the best place to be for an atheist like him. His presumptions of everyone being uptight and religious are flung out the window, when he gets initiated into a secret club called Heretics Anonymous. Even within the austere boundaries of this school, there exists a group of students who choose to have differing beliefs and aren't ready to get brainwashed by the system. But when Michael takes it all a step too far, he jeopardizes everything he has worked to build.10 points for that cover!What started out as a hilarious book soon turns into a bit of a serious read and rightly so. Michael's wit and sarcasm will surely make you crack up at times. There's such honesty in his thoughts. But underlying all that bravado you get the sense of boy flailing at his inability to stay rooted to a place, and therefore distraught by the constant disruption in his life. This is Katie Henry's debut novel and I must admit that she has crafted a remarkable storyline. With everything that's going on in our world, religious intolerance is something that has been cause for concern for a long time now. But do we ever stop to think how children perceive themselves through a religious angle, how do they fit into all this?In this novel, it is very refreshing to see teenagers who are not only well informed about their choices but also standing up for their beliefs, however different they may be. When Michael joins Heretics Anonymous, he is met with a broad range of thought processes; those belonging to a Celtic Reconstructionist Pagan, a Catholic Christian and others that I hadn't even heard about. The author's writing complements the story, in that, you feel like you've been taken back to your school days. It's not wordy or hard to digest. It has everything a high-school fiction usually does - drama, betrayal, romance (puppy love?), rebelling. But on top of all that, it has some mature viewpoints too!Michael's relation with his father is strained but I couldn't help feeling bad for them both. In my opinion, they are both right on their part. I just wish that they'd talked it out sooner, because it would've prevented a lot of negativity. I didn't personally connect with any of the characters, but that didn't deter me from being invested in their story. In conclusion, I did enjoy reading this book, even though I couldn't understand the hype. If you are the kind of person who gets easily offended by religious and spiritual diversity, maybe this book is not for you. But I hope that's not true. I hope you can pick up a book like this in good faith and just have fun reading it.What do you get out of it? New perspective on religious identities and all the excitement of attending high-school.Thank you HarperCollins for this eARC via Edelweiss in exchange for an honest review."}, {"userName": "Derek Milman", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/29267899-derek-milman", "userReview": "Katie Henry has a biting wit, a sharp sense of humor, and a real big heart. All that comes into play wonderfully, and sensitively, in Heretics Anonymous, a great, forceful debut, and a totally unique coming-of-age story. Atheist Michael--constantly getting moved around, courtesy of his dad's corporate job--finds a whole other set of challenges once he lands at a Catholic School. However, things get even more interesting after he falls in with a group of fellow outcasts, all colorful characters in their own right, and together they form a secret club to challenge the absurdities of the world (and their school). But the innocent purity of their hope, and their pulsing ambitions, can only take them so far.A story about love, friendship, family, and faith, Katie Henry is that rare author who can balance voice, comedy, and conflict to dazzling effect."}, {"userName": "Joss", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/3481116-joss", "userReview": "4.5. Hilarious. Heartwarming. This story really hit close to home. I loved it."}, {"userName": "Kristy", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/117693-kristy", "userReview": "I was raised Catholic and lost my faith as a teenager. Never went back, never plan to go back. This story of a group of unconventional teens who band together at a Catholic School against injustices and hypocrisies really got me. I was delighted to see an atheist main character who (MINOR SPOILER ALERT) doesn't get converted in the end. His friends also represent a refreshing mix of personalities and beliefs: A gay jewish kid, a celtic re constructionist pagan who casts spells, a quirky cape wearing kid, and a very pious but staunchly feminist overachiever. I really loved this and consider it an exemplary example of a sweet, sensitive and funny YA novel that still manages to bring up some big questions. And it's totally adorable and romantic too. Perfect for fans of Simon vs the Homosapiens Agenda."}, {"userName": "Emily A. Duncan", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/66603963-emily-a-duncan", "userReview": "Charming, witty, and deeply heartfelt, this really got to me and my weird, complication religion feelings."}, {"userName": "Mckinlay", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/4569919-mckinlay", "userReview": "*I received a DRC from edelweiss and the publisher. This does not affect my review.*I know this book is being compared to the movie Saved, and yes, i guess the vibe is similar, and i do think if you like that movie, you'll like this. but it's also so much more! Even though this book is told through the eyes of an atheist at a Catholic school, i thought it was incredibly respectful of the religion, and also what it's like to believe a religion is the right place for you, but still wanting it to evolve and change, to be better. Because you know it could be. Unlike the movie Saved, this book features a diverse cast of characters: a Jewish gay boy, Avi. A Korean kid, named Max, who I also think is on the spectrum though it is not disclosed on the page. And a Latina girl, Lucy, who is the Catholic feminist badass that i didn't know i needed. I'd like to note that I am not Catholic, but I hope to loan my ARC to my Catholic BFFF and get her opinion. Will edit my review, if necessary."}, {"userName": "Just Reading Everything", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/61672023-just-reading-everything", "userReview": "In this YA contemporary pitched The Breakfast Club meets Saved!, Michael, an atheist, finds himself enrolled at a Catholic school by his parents after spending much of his life being shuffled around from city to city because of his father's job. There Micheal unexpectedly finds friendship in Lucy. Although she finds comfort in her religion, she invites him to join Heretics Anonymous: a group of outcast students who accept each other as they are and challenge certain school rules (like dress code) that have been defined. But when Michael pushes the boundaries of the group too far, he has to decide what's truly important to him. This wonderful story dives into the importance of friendship, family, and faith and is equal parts humorous and heartfelt."}, {"userName": "Abby Rauscher", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/51874427-abby-rauscher", "userReview": "shout-out to Mabel for making me read this because it was funny and charming and thoughtful and i loved it"}, {"userName": "Sarah {Literary Meanderings}", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/4379747-sarah-literary-meanderings", "userReview": "I am on a roll with 5-star reads this week! YES! Review coming soon!"}, {"userName": "Jake", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/71224495-jake", "userReview": "This book was fantastic from start to finish. From the start of the novel we see Michael as relatable and someone to relate with. The most relatable aspect of the character is how he constantly messes everything up. Michael has a talent for making a mess of everything he does and it is a huge refresher from the usual perfect main character seen in some YA books.Other than Michael, each and every character is lovable in their own way. Within the small society of Heretics Anonymous you cannot help but find one of the characters who you see yourself in. The equivalent of the antagonists are not painted as evil characters either. Every single main character has redeeming factors. They have aspects of themselves which you are forced to deal with and grudgingly accept them for (Even if Theresa is still my least favorite). The overall message of this book encourages understanding, acceptance, and social reform which is very admirable and the message is put together well. The different aspects of comedy and philosophy draw you in and keep you wanting more. I loved this book and it is a must read for anyone with an open mind and maybe working tear ducts."}, {"userName": "Ms. Yingling", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "E ARC from Edelweiss PlusMichael is angry enough at his parents that they have moved him and his sister yet again for his father's job as he goes into his junior year, but to enroll him in a Catholic school, no matter how good, makes him even angrier. He's an agnostic, and prepared to have a miserable time. Luckily, on the very first day he hears Lucy arguing with the teacher about religious points and thinks he has a soul mate. He does, in a way-- Lucy identifies herself as a heretic, in that her beliefs aren't quite sanctioned by the church, but she is very much a believer. She has a small group of other students who don't necessarily toe the line in plain black shoes, and they all decide that it's time to make their opinions known. They manage to do some underhanded but well thought out pranks, like changing the sex ed/abstinence video, but things get serious when the Latin teacher loses her job when her same-sex marriage comes to the attention of the school. Michael and Lucy start to date, and Michael's issues with his family situation also reach a tipping point. Personal note: Ms. Henry is clearly a far, far better human being than I am! I have been an atheist since confirmation class, and of all the people who have been flat-out mean to me in my life, religious people have been the absolute meanest. Ms. Henry gets ENORMOUS bonus points for not only really understanding and describing Michael's beliefs, but for describing and being kind about ALL of the different beliefs she portrays. It's an incredibly difficult thing to do, and she pulls it off with a great deal of good humor as well!Also, not really a middle grade book. Definitely read before purchasing for readers younger than high school. Strengths: This is funny, timely, and explores a very little covered area of teen life. I spent a LOT of time involved with my church group in middle school and high school, and even more time thinking about what I believed and what I didn't. This comes up very rarely in literature, and this book covers not only Catholicism and agnosticism, but a couple of other, more exotic beliefs as well. The romance with Lucy is great, and the issues with Michael's family are realistically poignant. The cover is absolutely fantastic!Weaknesses: Drinking and allusions to sexual behavior, while mild, make this more of a YA title. What I really think: I would definitely buy this for high school but will hope for something else similar but more in tune with middle school students."}, {"userName": "Sydney Huff", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/54186641-sydney-huff", "userReview": "Thanks to an eARC I got to read this book early.I really loved reading this book and it captured my attention right away. I love the premise of it how it is a couple of students in this Catholic school that just don't fit in this narrow box the school wants to place them in. It is okay to question things and they are kids who don't just follow blindly and have their own beliefs. Michael is an atheist but he meets Lucy on his first day of school in class she is questioning a nun and reiterating with facts about those women who were made Saints but in their time of life they were seen as devil women or horrible because they didn't conform. Michael thinks that she is like him and an atheist too but then Lucy tells him she is a devout Catholic but wants to change the way things are especially the fact that women can't become priests. She then invites him into her group of others who don't conform, there is Avi who is gay and Jewish, Eden who can practice her pagan beliefs, and Max who can wear what he wants (cloaks). This group begins to go public to the school in different ways. There first form of action is stealing the dvd they show as their sexEd which contain all scientific inaccuracies. They edit this video with a voiceover of actual facts and it is shown to the school. This causes talk to stir among the school and students starting to think. I just really enjoyed reading this book and would highly recommend it to anyone!"}, {"userName": "Susan Mesler-Evans", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/3195697-susan-mesler-evans", "userReview": "NOTE: This book has not yet been released. I was given a free Advance Reading Copy by HarperCollins and Edelweiss in exchange for an honest review. This book will be released on August 7, 2018. If you would like to send me an ARC, please see this page.This is one of those books that I knew I had to read, just based on the title. Fortunately, it didn't disappoint; in fact, it exceeded my expectations. Having had an extremely mixed experience with religion myself, I found many parts of this novel to be extremely relateable. This reminds me a lot of the works of Adam Selzer, an author I've mentioned my love for elsewhere on this website. While I went in expecting this to be more of an ensemble piece than it was, this is an incredibly enjoyable comedy, with a great cast of characters to back it up. I can very easily see this becoming a young adult mainstay in the future. Regardless of your religion or lack thereof, give this book a try. I think you'll enjoy it.Read the full review here."}, {"userName": "Milly Hammett", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/79041179-milly-hammett", "userReview": "Note: I received a free ARC from the publisher in exchange for an honest review.Heretics Anonymous is a hellish good time.Michael is an atheist forced to attend a Catholic school when his father moves them for his job for the umpeteenth time. He quickly looks for other non-believers like himself and finds Heretics Anonymous, a group of students with varying religious beliefs. Even though Michael technically has no religious beliefs and therefore is not a heretic, he meshes with the secretive group--crushing on Lucy, the Catholic girl who wants to become a priest--and helps them start a small rebellion at their school.Michael is a great protagonist and incredibly relatable. The entire cast of characters is perfectly diverse, and the school's policies that they take on are timely and important. While Michael fits in at school for the first time, he deals with his disappointing father, his prodigious little sister, and a mother who won't stand up for their family.Katie Henry's debut is full of sharp wit, heart, and humor that will hit-home for many readers. Highly recommend!"}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "Heretics Anonymous reminds me of the way John Green writes his books. If you would slap on his name on this book I wouldn't be the wiser, except one thing. Katie Henry accomplished what John Green never could- her books offer smartass characters, interesting setting and fun times with the gang. JG books often forget to include a joke or two because they're trying to be clever all the time. Now, don't come for me Green Army. I know there are a lot of you out there. I just hope Katie Henry comes out with a new book soon because I would LOVE to read it."}, {"userName": "Books and Guacamole ", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/8869595-books-and-guacamole", "userReview": "Hilarious and moving, Heretics Anonymous is one not to be missed. Michael, an atheist, moves to a new town and starts at Catholic school where he meets Lucy, a girl who wants to be a Catholic priest. She brings Michael into an underground club to revolutionize the school. The humor, especially all the saints jokes, will definitely make you laugh out loud. And you won’t be prepared for how powerfully the ending will hit you. A thoroughly beautiful debut from Katie Henry."}, {"userName": "Taylor Tetreau", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/71307941-taylor-tetreau", "userReview": "“Father Peter said this was an ‘opportunity to heal,’” Max says. “Like we cut everyone open, or something.”In some way, I think we did. What I did — what Heretics Anonymous did, ever since the video — opened people up. It wasn’t a clean cut, but we saw what was inside everyone. I get why Father Peter thinks that was bad, but there was good there, too. Just like Jenny said.”"}, {"userName": "Joy McCullough", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/66069570-joy-mccullough", "userReview": "I LOVED THIS BOOK LIKE WHOA.It is a) SUPER hilarious. But also b) super thoughtful and nuanced and respectful to a wide array of religious beliefs (or non-beliefs). One of my favorite 2018 debuts!"}, {"userName": "Jen Petro-Roy", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/2404990-jen-petro-roy", "userReview": "This was so good! Such. Nuanced, sensitive, and nonjudgmental look at differences in faith."}, {"userName": "V", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/2578458-v", "userReview": "[The ending was very abrupt, which colored what was otherwise a complex and engaging read. (hide spoiler)]"}, {"userName": "Cindy", "userReviewDate": "May 16, 2017", "userURL": "http://www.goodreads.com/user/show/1102569-cindy", "userReview": "Yesterday I pretty much devoured HERETICS ANONYMOUS by Katie Henry. You know how sometimes you see a book description and you're SO excited, but also SO nervous that it won't hold up? I'm happy to say that HERETICS ANONYMOUS was every bit as hilarious, insightful, and surprisingly tender as I had hoped. It's rare for a book to do a good job grappling with both strong religious conviction AND atheism, without condemning or needing to convert either character. Henry pulls this off beautifully; all her characters, even minor ones, are nuanced and fully realized, with no cardboard cutouts or easy answers. Katie Henry is a ridiculously witty human, and that wit is fully present in HERETICS, which had me laughing out loud constantly—but she deftly blends depth and insight along with the humor, creating a book that is equal parts hysterical and touching. When this releases in August, run, don't walk, to your nearest bookstore!"}], "description": "Michael is an atheist. So as he walks through the doors at St. Clare’s—a strict Catholic school—sporting a plaid tie, things can’t get much worse. His dad has just made the family move again, and Michael needs a friend. When a girl challenges their teacher in class, Michael thinks he might have found one, and a fellow nonbeliever at that. Only this girl, Lucy, is not just Catholic . . . she wants to be a priest.But Lucy introduces Michael to other St. Clare’s outcasts, and he officially joins Heretics Anonymous, where he can be an atheist, Lucy can be an outspoken feminist, Avi can be Jewish and gay, Max can wear whatever he wants, and Eden can practice paganism. After an incident in theology class, Michael encourages the Heretics to go from secret society to rebels intent on exposing the school’s hypocrisies. When Michael takes one mission too far—putting the other Heretics at risk—he must decide whether to fight for his own freedom, or rely on faith, whatever that means, in God, his friends, or himself.", "title": "Heretics Anonymous", "url": "http://www.goodreads.com/book/show/34659293-heretics-anonymous", "average": 4.32, "cover": "https://images.gr-assets.com/books/1507339506l/34659293.jpg", "reviews": 34, "authors": [{"url": "https://www.goodreads.com/author/show/13756005.Katie_Henry", "name": "Katie Henry"}, {"url": "https://www.goodreads.com/author/show/13756005.Katie_Henry", "name": "Katie Henry"}], "type": ["Contemporary", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/34659293-heretics-anonymous", "http://www.goodreads.com/book/show/35820020-heretics-anonymous", "http://www.goodreads.com/book/show/34368356-perfect-score", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}