{"ratings": 4194, "userreviews": [{"userName": "Jennifer", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/5331885-jennifer", "userReview": "You know, sometimes I am very embarrassed by the quantity of teen fiction I still enjoy, but I'm not by this one. I really do think this is Blume's most underappreciated, if not because it strikes a real chord with me. When I first read this book, I wanted to be Rachel Robinson. I wanted to be in super advanced math, to make out with a Jeremy Dragon, to have a lending library on my bookshelf that my friends could come and go when they pleased (I definitely tried this, too - didn't work). And when I read it again recently, it struck me how much I still aspire to be like Rachel Robinson. Though now, I totally get that the book is supposed to be about how overachieving is kinda difficult and sometimes you just want to be a normal kid absent of parental and peer expectations, and nobody in their right mind would want to be like Rachel Robinson. (In a oh-she's-so-perfect-but-not-really kind of way, it's like the bitchy cheerleader story all over again.) But this doesn't entirely address the question. I think what Judy Blume hints at is that Rachel doesn't necessarily want to be in the same situation as her less-intelligent friends - she still wants to retain her brilliance and be the self she's always dreamed of being. Yeah, she's struggling with expectations of her teachers and parents to do super well but it's not like she doesn't want that either. But at the same time she doesn't want to be singled out for it, she doesn't want to lose friends or be labeled \"the smart one\" - she just wants to be and do. And that's where the conflict with her brother comes in. It seems that he has all the freedom in the world to assert his own personality, sans any consequences or judgment. He's like spoiled, hippie, middle-class Dr. Spock kid x 1000. And Rachel is so, so jealous of it. There's an implicit tension between their relationship because Charles embodies Rachel's secret desires, while her mother embodies all that she ought to be."}, {"userName": "Manybooks", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/2970379-manybooks", "userReview": "Judy Blume's Here's to You, Rachel Robinson is the sequel to her Just as Long as We're Together and does, in fact and of course feature many of the same characters, except that while in Just as Long as We're Together, it is Stephanie Hirsch who narrates and whose story is for the most part being told, Here's to You, Rachel Robinson is narrated by Stephanie's best friend Rachel (or rather by one of Stephanie's best friends, as Alison Monceau is also part of the team now). And therefore, Here's to You, Rachel Robinson first and foremost shows the Robinson family, their dynamics, but especially and in particular the multitude of serious issues Rachel and her family are continuously experiencing with wayward and troubled son Charles, which indeed, certainly does make for an interesting storyline with regard to Here's to You, Rachel Robinson, with Judy Blume presenting and in a way also analysing themes and scenarios that feel not only much frustrating and often rather irritating but also and appreciatively also very true to life, very painfully realistic (and while I love Rachel's voice, her narration and how close she is to her older sister Jessica, when I read about Charles and how ineffectively especially Rachel's parents deal with his outbursts, his verbally abusive nastiness towards his two sisters and so on and so on, it really does make me cringe and want to shake some common sense into both the father and the mother, as in many ways, thirteen year old Rachel seems both more mature and more thoughtful than her parents and certainly seemingly more willing to actually tackle Charles and be critical of him to his face, something that is NOT her job though, something that her teacher father and lawyer/judge mother should be the ones to handle and engage in).However and the above all having all been said, and while I certainly have much enjoyed reading Here's to You, Rachel Robinson (even with my frustrations regarding Charles, for let's face it, these types of family scenarios are not all that uncommon and I do applaud Judy Blume for portraying such a painful yet realistic picture of a family that clearly needs help and is obviously being both ruined by and run by their troubled and in need of serious help and perhaps even therapy teenaged son) I cannot say that I have in any way liked Here's to You, Rachel Robinson nearly as much as Just as Long as We're Together. For in my opinion, although Rachel and her family are strongly depicted and represented, especially Rachel's two best friends Stephanie and Alison are totally and utterly one dimensional and basically just cardboard like add-ons (and thus not at all like in Just as Long as We're Together, where although it is Stephanie's story to tell, both Rachel and Allison are equally nuanced and interesting, and we find out, we discover almost as much about Alison Monceau's family and her being adopted from Vietnam and Rachel Robinson's nearest and dearest, including the fact that Charles is considered a major family problem, as we do about the Hirsch family and that Stephanie's parents' marriage is on the rocks, is in serious trouble). And thus, and because after reading about not only Stephanie Hirsch but also quite substantially about both Rachel Robinson and Alison Monceau in Just as Long as We're Together, I do indeed find that both Stephanie and Alison are at best rather one line minor and cardboardy characters throughout Here's to You, Rachel Robinson, I can and will only consider a two star rating for Here's to You, Rachel Robinson, as in my opinion, there is more than a bit missing, and that in a novel that supposedly deals with three best friends, all three should be adequately and interestingly enough depicted and shown (even if, even when, the main focus is clearly on one of the three)."}, {"userName": "Stephanie", "userReviewDate": "Jun 30, 2007", "userURL": "http://www.goodreads.com/user/show/139341-stephanie", "userReview": "The sequel to my all time favorite Judy Blume book  Just as Long as Were Together . Jeremy Dragon returns and Rachel says the F*word. Yep, I was totally shocked and could not believe it. I think it made me love it more. :)"}, {"userName": "jacky", "userReviewDate": "Mar 29, 2007", "userURL": "http://www.goodreads.com/user/show/42679-jacky", "userReview": "This is the sequel to Just as Long as We're Together. I read it when I was a little older than when I read the first one. I didn't like it anywhere near as much. This one follows the character of Rachel and doesn't deal with the friend issues as much as family."}, {"userName": "Logan Hughes", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/15052079-logan-hughes", "userReview": "tl;dr Extremely lackluster sequel to Just as Long as We're Together has none of its charm.Ack, I need to stop writing these reviews in Goodreads!! I keep losing them when my browser does something weird. I wrote a really long and good one, but you'll have to reconstruct it in your mind from these notes:* Nothing like Just as Long as We're Together (hitherto JLWT). More conventional structure, central storyline & longer chapters, not slice of life vignettes.* Rachel much worse POV character than Stephanie. Liked her in JLWT but much less fun from the inside. Passive where Stephanie is active; introverted where Stephanie is bubbly; tense where Stephanie is easygoing. It's more draining to be Rachel, less fun. True-to-life but irritating high-achieving eighth-grader inner monologue: pedantic, pretentious.* Central storyline isn't even good. Emotional draining, no ups and downs, just long slog; no payoff. Just sort of ends. * Main character is really Charles, Rachel's brother; character study through Rachel's eyes. Feel this is a disservice to Rachel, and also, Charles is horribly written. Speaks like villain from sensationalist pulp crime novel. So dumb.* Characters less developed all around. Hardly any Stephanie and Alison. If we didn't know them from JLWT, we'd think they were cardboard sketched-in \"best friend\" placeholders, like in most JB books. Scenes with Jeremy Dragon should be exciting payoff to buildup in JLWT, but since there is absolutely zip in this book in terms of character development, sexual tension, or even detail in the scene, it falls completely flat. So it's bad. But it's hard to keep yourself from reading after JLWT, because they are often bound in the same volume."}, {"userName": "Diana Welsch", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/1539516-diana-welsch", "userReview": "I don't know how she does it, but Judy Blume really nails what it's like to be a kid/teen. I recently reread Just as Long as We're Together, which really stuck with me from my childhood even though I only read it once, and when I found out about this sequel, I knew I had to read it.Here's to You, Rachel Robinson was just as good as Just as Long as We're Together. It's from Rachel's perspective instead of Stephanie's. Rachel is the super-achiever who is pushed by her parents, friends, and school to participate in all these programs and activities to the point where she's so stressed she grinds her teeth. To make things harder, her attention-seeking older brother got expelled from his boarding school and is home making life hard for the whole family. There's also drama with Stephanie's mom dating a younger man, Rachel's sister looking for a job, sexy classmate Jeremy Dragon, Rachel's college-age cousin Tarren getting involved with her professor, and Rachel's crush on her brother's tutor. This book is incredibly realistic. It doesn't bludgeon you with morals and values. Not every detail mentioned gets worked into its own thread, which is nice: sometimes things just happen and that's that. For instance, Rachel's sister sneaks her mom's too-sexy black dress to wear to prom and doesn't get caught. Even though this book is pretty old, I could see young people today wanting to read it. The voices ring true, it's not riddled with cliches or dated references, and the plot makes you want to keep reading. I was only disappointed how quickly it was over."}, {"userName": "HeavyReader", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/142816-heavyreader", "userReview": "Judy Blume must have written this book after I quit reading young adult fiction, because I had never heard of it until I started looking for books to read for this \"challenge\" I am participating in.In many Judy Blume books, there seems to be some physical condition that is an obstacle. In this one, the main character is not the one with the physical condition, it's the older sister, and she has cystic acne.Don't worry, the protagonist has plenty of problems of her own. She is an overachieving child prodigy who worries incessantly and grinds her teeth. The big family problem is her older brother, a mean 15 year old with a bad attitude.Are all of Judy Blume's characters so poorly developed? These characters are like paper dolls...cardboard and flat! I do not care about these people and probably won't remember them by the end of the week.Also, this book is written to the Judy Blume formula, which may have thrilled me in 1981, but now it's just boring."}, {"userName": "Carina", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/1198406-carina", "userReview": "A good reminder of how real anxieties are at age 13. I also love how Judy Blume's books capture the concerns and flaws of both kids and the adults in their lives. Unfortunately, this book didn't feel like a complete story."}, {"userName": "Morgan", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/2803571-morgan", "userReview": "First off, the sibling dynamic in this book was PERFECT. Especially between Charles, Jess, and Rachel. Judy Blume completely nailed just how siblings get under your skin (in a way only siblings can). I couldn't help laughing at how mad Rachel would get at her friends for not sharing her hate for her big brother. I also felt slightly bad for Charles, he was just trying to find himself in a family that paid little attention to him. I hope they get things figured out, I did like that towards the end Rachel and Charles seemed to understand each other slightly better. He just likes picking on her (like all big brothers). Can I just say THANK THE LORD Paul did not make a move on Rachel? I loved that she had this major crush on the cute college tutor, but there were too many times where I truly thought he was going to make a move...all I could think was SHE IS IN SEVENTH GRADE. PHEW. Close call, but we made it to the end! This is another win from Miss Judy Blume!"}, {"userName": "Ian Wood", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/19929095-ian-wood", "userReview": "This is the complete review as it appears at my blog dedicated to reading, writing (no 'rithmatic!), movies, & TV. Blog reviews often contain links which are not reproduced here, nor will updates or modifications to the blog review be replicated here. Graphic and children's reviews on the blog typically feature two or three images from the book's interior, which are not reproduced here.Note that I don't really do stars. To me a book is either worth reading or it isn't. I can't rate it three-fifths worth reading! The only reason I've relented and started putting stars up there is to credit the good ones, which were being unfairly uncredited. So, all you'll ever see from me is a five-star or a one-star (since no stars isn't a rating, unfortunately).Move along now there's no story here! That's how this book which lacks not only an ending but also a middle and a beginning (the beginning is in a different volume), felt to me.This is another classic example of how thoroughly stupid and inept Big Publishing&Trade; truly is. Once again we have proof that the cover designer is utterly clueless as to the content of the book they're supposedly designing for. The model on the cover of the copy I read was supposed to be twelve and have curly auburn air. Shah, right! She looks like she's in her early twenties. Her hair is very dark, not auburn, and completely straight.I know that when you sell out to Big Publishing&Trade; you give up your rights to the cover, but you'd think a quarter century into her career, an author like Judy Blume would have some clout, or at least be competent enough to point out to the publisher that they got it so wrong that it's more of an abuse than a joke.The story here is part of an unfinished trilogy, and it sounded interesting from the blurb, which means nothing more than that the blurb did its job in tricking a reader into picking up the book. I haven't read the other book in the series. By all accounts it's far better than this one, but after this, I have no desire to read any more of this stuffy nonsense.Rachel Robinson is a wreck. She's supposedly very smart and something of a prodigy, but she's also highly strung and tends to fret and worry over everything. She's a neatness freak who feels compelled to volunteer for anything and everything at school because her mother - a lawyer, of course - pressures her to excel. She's also the babysitter of choice (not that she has any choice) for babysitting Tarren's infant son Roddy. Yes, he's named Roddy. I don't think any of that excuses her pronounced superiority complex and thoroughly self-centered view of life.Rachel's dad got his life right: he gave up his lawyer job and changed his profession to teaching history - at Rachel's school. Rachel's older sister Jess has a really bad acne problem which extends beyond the mere condition of her skin, of course, but the real problem with this family is Charles - the oldest brother who was just kicked out of boarding school, and who is in such a constant state of acting-out that you want to seriously kick him in the balls pretty much every time he opens his mouth. The saddest thing is that his parents let him get away with it, and so his sisters suffer. This book is about him. It's not about his sister at all. She's merely the narrator.Rachel's entire extended family and friends are all having issues. Her cousin Tarren, a single mom who is trying to finish college, is having an affair with one of her professors, who happens to be married. Her friend Steph's single mom is starting to date a guy who Steph dislikes on sight. Rachel's mom is the only one who seems to have it all, since she's just been recommended for a judgeship (which will mean a cut in pay), and she's on the verge of losing it.The writing overall isn't bad. It's a very fast and simple read. One issue I noticed is that on page 102, there's a conversation between Rachel and cousin Tarren which makes no sense. Rachel comes up with the word 'obstacle' which wasn't in anything Tarren had said, so what this felt like to me was that some lines of the exchange between them went missing during the editing stage and no one noticed! It's not unimportant, either, since the word 'obstacle' is employed as a euphemism a lot in conversations pertaining to Tarren's love life afterwards.That said, the book is utter nonsense and the ending (so-called) is quite honestly nothing more than a deus ex rectum wherein all these snapping vicious, angry, spitting family members are magically hunky dory. It's complete crap!"}, {"userName": "Isabel", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/3224477-isabel", "userReview": "This novel offers an nteresting inside story to overachieving kids and families in the 80's. Again, the secrets and silence of families place a huge burden on the kids. To some extent, I think American culture is letting a lot more hang out than it did then.The brother, Charles, really bothered me. At times he seemed like a psychopath. Blume seems to say that his problems stemmed from being in a compulsively perfect family and once he connects with his father on a field trip, things will start to get better. He just as easily could have been a troubled kid who was just born that way. Just as Rachel is born \"gifted,\" he could have been born angry. It seemed as though Blume dodged a bullet by fixing him at the end. Another reviewer pointed out that Charles is basically Rachel's foil. I think he was, in a sense. I went with his more obvious function, which was to be a truth-teller not just to Rachel's secrets, but to the whole family's. They tried to sweep him under the rug by sending him away, but ultimately had to deal with him and (I guess) everything else when they started going to family therapy. (But I still think he's a straight up psychopath.) ;-)And how weird was it that Rachel went to a concert with her Dad's student teacher?? That would not fly for that guy professionally these days, and I suspect it might not pass muster with parents, either. Conveniently, he ended up hooking up with Rachel's cousin, Tarren, but that was a close one!Blume has a habit of skimming over some pretty big issues by addressing them directly and briefly. Tarren's relationship with her college professor comes to mind. Kids' urge to replace their parents with other adult figures was a theme that kept popping up as well. The brother's underage drinking and drug use was right out there, too. It's like, she could have written a sentence about the brother torturing and killing a dog, and it would just come and go like a description of the furniture. I find this technique disorienting.Maybe we're supposed to think that because it doesn't register with the middle school age protagonist, it shouldn't be emphasized? Yet there are other topics that the reader cares about from overheard conversations of the parents, or body language that the protagonist describes, but fails to interpret. I dunno…I preferred this one to the previous one in which Stephanie was the central character."}, {"userName": "Elizabeth", "userReviewDate": "Aug 25, 2009", "userURL": "http://www.goodreads.com/user/show/717971-elizabeth", "userReview": "Sara is currently going thru a Judy Blume phase (she's 12) and I am picking up the ones I missed when I was her age. This one was perfectly enjoyable, an easy read in a way that I think modern writers for kids and teens seem to have lost... Nowadays \"voice\" is sacrificed to non-stop action, and I find that contemporary writers have a very false, self-conscious and wooden ring to their carefully constructed narrative voices. Anyway, Judy Blume has got the opposite--her prose is natural, unselfconscious, and vibrant.Having said that... nothing much happens in this book! I kept WAITING for the problem character to do something seriously problematic, but all he ever did was insult his family at the dinner table. And I thought his insults were pretty laid-back, too. And I kept waiting for the borderline obsessive-compulsive viewpoint character to have a breakdown, or be diagnosed with some kind of weird syndrome, but she also managed to hold it together and just naturally relax a little at the end. There's no crisis and no showdown. So basically this is without any particular focus (unlike many of Blume's books), just a slice of suburban life. The family is in some ways unusual, in some ways messed up, and in some ways pretty neat. Like most families.If there's a message, it's one I really dig, and keep hammering into my own characters in their whiny moments: \"You are responsible for your own actions.\" (Mom, p. 83)"}, {"userName": "Iris", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/324933-iris", "userReview": "Read the whole book review here: http://paperbookworm.blogspot.com/200...Rachel Robinson is a straight-A student and is often referred to by other people especially her friends as 'genius' or 'perfect'. But ever since her brother Charles came back from his school because he was expelled, she's now referred to by him as 'the child prodigy'.I admired Rachel's straight-A personality. Since I am an obedient student like her I know how it feels, although she's an almost perfect student while I'm a desperate-math-moron. I also saw myself in her shoes when it comes to dealing with family problems. Although this book wasn't focused on the three girls unlike in Just As Long As We're Together, this was a good story you cannot pass up.When I have read this book it made me think of the true value of family. Charles' character struck me the most because it was his who made a big impact on me. We were alike in some ways that I am being considered as a pain in the neck of the family (okay, so much for the drama). I could truly say I fell in love with this book and it was wonderful! Judy Blume has made it very comfortable for me to read and by the end of the book, I craved for more of it. I recommend this book to you if you're wondering how life turns around with someone almost as perfect as Rachel."}, {"userName": "Natsuki Nakazawa", "userReviewDate": "Sep 20, 2010", "userURL": "http://www.goodreads.com/user/show/4317889-natsuki-nakazawa", "userReview": "This book, called \"Here's to You, Rachel Robinson\" is story about family, friends and love. The main character, Rachel is good student who always get A grades. However, her brother Charles is totally opposite from her: he was just expelled from school. Rachel is always bothered by Charles and she does not like him very much. Even though she has problems with her brother, she truly enjoys her school life with her best friends and she secretly begins to love Paul, who is a tutor of Charles'.  Eventually, in the end of story, Charles decides to get the job and work, so they need to separate each other. Although Rachel was annoyed with Charles, she begins to miss him and they promise to see each other again soon. It was really fun to read this book because all the characters are original and strong. I like the conversations between main character Rachel and her older brother Charles. Also I sympathized with Rachel about annoyance of her brother. The story isn't that hard to understand so I recommend especially ESL students to read this."}, {"userName": "Shana", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/2682650-shana", "userReview": "I wanted to love this book (especially as a kid) but it's problematic. It doesn't even seem very Judy-like, in that it feels unfinished and spotty. The setup and premise are great, but so many holes and a really abrupt ending. I was interested in where this huge issue with Rachel's brother ended up, but felt let down by where that went (being vague to avoid spoilers). This book just feels like a decent first draft that needed more work. Which is a bummer because so many of us loved Just As Long As We're Together."}, {"userName": "Laurie", "userReviewDate": "Aug 03, 2014", "userURL": "http://www.goodreads.com/user/show/856043-laurie", "userReview": "The follow-up to \"Just As Long As We're Together\" and told from the perspective another of the friends in the little trio. JALAWT will always have a special place in my heart because I read it so much as a tween/teen (and I read this book just once), but as an adult, I think I like this story a little better. The character of Rachel has a lot going on beneath the surface, and I like how Judy Blume presents the Rachel's rebellious brother in a really multi-faceted three-dimensional way despite the narrator's perception of him through the limited lens of thinking he is \"bad\"."}, {"userName": "McKinley", "userReviewDate": "Mar 10, 2009", "userURL": "http://www.goodreads.com/user/show/1538702-mckinley", "userReview": "I did't love this book. It is my least favourite Judy Blume book ever, and I have always been a big fan. In fact, Just As Long As We're Together, the companion book to this one, was always one of my favourites. This book was quite boring, plotless, and meandering--sort of watered down Judy Blume. Disappointing. But hey, you can't win 'em all, right? Even if you are Judy Blume. Starring Sally J. Freedman As Herself can't happen every time."}, {"userName": "Lisa", "userReviewDate": "May 08, 2015", "userURL": "http://www.goodreads.com/user/show/4847123-lisa", "userReview": "I wasn't as big a fan of this when i was younger. My heart belonged to Steph in Just as Long as We're Together. But now, as a neutotic 27 year old perfectionist, I realise Rachel is my spirit animal. So here's to you, Rachel Robinson. I wish I had identified with you sooner."}, {"userName": "Iris", "userReviewDate": "Aug 30, 2007", "userURL": "http://www.goodreads.com/user/show/324933-iris", "userReview": "I learned thru this book the value of family ties."}, {"userName": "Sofia Fitzpatrick", "userReviewDate": "May 29, 2016", "userURL": "http://www.goodreads.com/user/show/56258077-sofia-fitzpatrick", "userReview": "This was an amazing, inspiring book. I absolutely LOVED it!"}, {"userName": "Hannah", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/52365720-hannah", "userReview": "loved it!!"}, {"userName": "Melinda", "userReviewDate": "Sep 24, 2007", "userURL": "http://www.goodreads.com/user/show/357213-melinda", "userReview": "I read this in fifth grade and absolutely hated the inclusion of the f-word."}, {"userName": "Helen", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/156067-helen", "userReview": "This book had a little more meat to it than Stephanie's book (Just as Long as We're Together) but was quite short. Rachel is more mature (and her mind seems to ramble less than Stephanie's). I feel like Stephanie's book was more wholesome and covered the everyday challenges and thrills of growing up...her parents' split, her weight gain, and negotiating her changing friendships and school relationships. Rachel's book gave us a really different perspective. Rachel is a neurotic perfectionist and all-star student achiever whose family life becomes trickier to navigate when her troubled older brother is expelled from boarding school. (Aside: Do people just get sent off to boarding school when they're troubled? Why does this always seem to be the case?) Rachel's brother Charles is a puzzle -- he alternates between being a model brother/son and being a nasty delinquent brat. There's never any type of diagnosis or explanation given for his behavior, which I find unsatisfying.I also don't understand what happened on the Ellis Island trip. Rachel, Charles, her father, and many of his students look up their great-grandparents' names on the computer. Having never been to Ellis Island, I'm not sure what looking up the names does -- does it show a photo of the immigrants? Some place where their info was logged? REALLY confused here. They see that their father was the donor of something (what?), and Charles becomes extremely emotional at that point and has some kind of epiphany or change of heart toward his family. Was the reason he was acting up at school and after his expulsion related to his family for denying their origins or something? If so, this was not made clear at all. I still don't understand what they saw when they looked up the immigrant names and what Rachel and Charles' father donated.In fact, the lack of detail is one of the stranger aspects of this book. It covers a timespan of about 7 weeks, but we really only get a peek into Rachel's life. I didn't feel like there was a discernible story arc, where as Stephanie's book had more of one. Was anything ever really resolved?I do wish Blume had been able to write a third book about Alison. Now we'll never know what Alison's POV is like! Plus, we'd have an idea of how some of Rachel's problems get resolved...it's really the strangest thing how her story feels incomplete.I also wish we'd continued to have more insight into Stephanie's and Alison's lives. We know that Stephanie's mom appears to have moved on from the separation (no divorce yet), and we know that Alison's mom is still pregnant with her new little brother. Other than that...it's weird how much the story focuses only on Rachel and still fails to resolve her story. She makes small changes, but doesn't really cope with the Paul situation, Tarren's actions, or her own avoidance of the responsibilities people are heaping on her. Then randomly, it seems like she announces her decision of what to do about Natural Helpers and Challenge (did she actually sign up for them?) without any deliberation or actual decision-making.I'm going to take back what I said about how these books should be modernized, and dated references should be removed. In this book, we had more discussion of landline phones and when Charles' headmaster calls, Rachel's mother runs upstairs so she can listen in from a different phone. I'd completely forgotten that this was a benefit (or disadvantage) of landline phones! You can't easily listen in on cellphone calls nowadays. I think it's kind of cool to have these books as sort of a time capsule of what it was like to live in the '80s and early '90s, and maybe it's overall a good way for kids to see what life was like before they were born.Slut-shaming! Both books about Stephanie and Rachel refer to a particular girl, Marcella (an 8th grader), as a slut. We don't really know specifically how she got that reputation -- the girls probably all believe false rumors about this girl. It's so startling to see slut-shaming nowadays, considering how against it society has become...especially if it involves bullying or is untrue in any way. Most of the time YA books are more sex-positive about a girl who has casual sex, or the slut-shamed girl is the protagonist, and we see that her exploits are more rumor than reality. YA attitudes are generally more female-positive now, too. Authors who write protagonists that are \"not like the other girls\" or that promote/favor a \"type of girl\" are quickly criticized. It was a shock to see Stephanie and Rachel quickly and easily belittling a fellow middle-schooler (particularly one they don't know well) and labeling her as a slut (what qualifies as a \"slut\" in middle school, anyway?)."}, {"userName": "Julie Morales", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/51159207-julie-morales", "userReview": "Judy Blume writes about the obstacles faced while growing up in such a way that, no matter how old you are, you can picture yourself going through some of the things she writes about. Her characters come alive and are definitely realistic.Rachel is finishing the seventh grade with her friends, Allison and Stephanie. She's just like any other 13-year-old on the outside, but all she can focus on is how she's different, because that's what everyone is always pointing out to her. She loves music and plays the flute. She's a gifted straight-A student who has trouble fitting in with anyone besides the two friends who live in her neighborhood. And she has a brother who always seems to draw all of the attention in the room to himself. He went to a private boarding school until he was expelled. His moods change even more than the weather and he's always finding ways to hurt everyone in the family, even her parents. Surely he'll be going somewhere else instead of coming home when he's expelled.But he does come home, and that creates even more problems for Rachel. Stephanie and Allison think he's cute and are always telling Rachel to lighten up. They begin spending more time together but separate from Rachel, and she feels like she's losing both of them as friends.I don't really feel like this book really had an ending that accomplishes anything, although Rachel does seem to be worrying less and Charles doesn't seem to be getting to her as much in the end. Maybe she's learning to lighten up after all."}, {"userName": "Amy", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/1849094-amy", "userReview": "Was inspired to pick up a Judy Blume novel after watching the video for Amanda Palmer's song \"Judy Blume,\" which is such a cool tribute to her body of work!!The beauty of Judy Blume books is that her characters accurately represent the young adult experience. And readers will connect with some characters more than others, based on if the characters' life experiences intersect with readers’ life experiences. This book didn’t really strike a chord with me -- maybe because I never had a delinquent sibling who made my life miserable. Makes me think of my recent reading of Anastasia Krupnik and how I loved that book because I saw so much of myself in the main character.Even though it wasn’t quite my thing, I’m sure there are YA readers out there who need this book and will find it useful bibliotherapy. In fact, I’d venture that Judy Blume is one of the most prolific (and effective) bibliotherapists out there.And now I know what I want to be when I grow up: a bibliotherapist. I just made up the best career ever. :)"}, {"userName": "C.A.", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/69393909-c-a", "userReview": "5 stars. I loved this book, but I think I'm just biased. I was so pleased to find out that there was a sequel to  Just as Long as We're Together that Judy Blume probably could've just smashed her hands on keyboard and printed that out and I would've been satisfied.But biased or not, I felt this book was just as good as the one in the series. That means it was pretty dang good. Like the last one, it felt real, and well paced, and well written, and convincing and it got you emotionally invested. After having finished the book I still felt hurt in my heart, but I guess that's just how life is. I also just felt that everything could be okay, would be okay. Just like life. These books are really good and beautiful coming of age stories that I recommend to all.But I did find it disappointing that after all of the drama of the first book, poor Rachel was still dealing with being the third wheel to Stephanie and Alison. But c'est la vie I suppose."}, {"userName": "Rebecca", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/58174987-rebecca", "userReview": "I can't remember why I was looking up Judy Blume on my overdrive account (looking for one of her adult novels? Trying to find something for my kid to read while we were on a trip?) but I came across this one in a double-edition with \"Just as long as we're together\" which I vaguely remembered reading as preteen. But I was fairly certain I had never read the companion book from Rachel's point of view. In just over a day while on spring break I zoomed through both of the novels, one from each friends' perspective. I love how details from books I read as a kid come right back to me in kind of not-at-all-mysterious deja vu. I also enjoyed Rachel's story, and reminded me all over again that for this genre, there is just no better author. My 7 year old and I just plowed through all of the Ramona books together, and I just introduced her to Paula Danziger.... can't wait for her to start reading Judy Blume next."}, {"userName": "Amy Holiday", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/4580179-amy-holiday", "userReview": "Considering that JUST AS LONG AS WE'RE TOGETHER was one of my all-time favorite books as a middle schooler, I didn't think I'd like this as much, as it was about Rachel and Stephanie was totally my girl. (Also, the cover of my copy wasn't this cute; it was a photo of a snooty-looking girl giving the reader side-eye. Which is exactly how I pictured Rachel, of course.)And I didn't. But still, I definitely empathized more than I expected to with the overachieving, perfectionist Rachel. Stephanie and Alison were hardly a blip in this story, which I guess makes sense since Rachel has a lot more going on. Her family life was pretty interesting too, which I hadn't expected. Liked the almost-simultaneous setting as in JALAWT. Would LOVE to read from Alison's perspective too, although sadly I haven't found her version of events in book form yet."}, {"userName": "Kara Aislinn", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/7549450-kara-aislinn", "userReview": "I admit, I only picked this up because I was back home in my bedroom at my dad's house and looking for short, easy reads to breeze through so I could make my 2017 reading goal! This was one of my faves when I was 11 or 12, and rereading it as an adult, I was blown away. Judy Blume is fabulous at creating characters. From today's perspective, all I wanted was to get Rachel into therapy (and maybe give her some anxiety meds). What a great portrayal of the good old seventh grade experience. Loved reading it."}], "description": "Rachel is the youngest in a family of high-achievers. She’s also the cleverest. But it’s not easy being super-intelligent – especially when her errant older brother insists on disturbing the peace and undermining everything she ever says or does. And her best friends seem to be falling for his charming veneer . . .  A powerful sequel to JUST AS LONG AS WE’RE TOGETHER.", "title": "Here's to you, Rachel Robinson\n      \n          (Best Friends)", "url": "http://www.goodreads.com/book/show/25765541-here-s-to-you-rachel-robinson", "average": 3.81, "cover": "https://images.gr-assets.com/books/1434863410l/25765541.jpg", "reviews": 241, "authors": [{"url": "https://www.goodreads.com/author/show/12942.Judy_Blume", "name": "Judy Blume"}], "type": ["Young Adult", "Fiction", "Childrens", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25765541-here-s-to-you-rachel-robinson", "http://www.goodreads.com/book/show/37761.Here_s_to_You_Rachel_Robinson", "http://www.goodreads.com/book/show/1064250.Here_s_to_You_Rachel_Robinson", "http://www.goodreads.com/book/show/1318396.Here_s_to_You_Rachel_Robinson", "http://www.goodreads.com/book/show/480347.Here_s_to_You_Rachel_Robinson", "http://www.goodreads.com/book/show/760424.Here_s_to_You_Rachel_Robinson", "http://www.goodreads.com/book/show/3039219-here-s-to-you-rachel-robinson", "http://www.goodreads.com/book/show/7284060-here-s-to-you-rachel-robinson", "http://www.goodreads.com/book/show/19007899-here-s-to-you-rachel-robinson", "http://www.goodreads.com/book/show/37732.Are_You_There_God_It_s_Me_Margaret", "http://www.goodreads.com/book/show/37741.Tales_of_a_Fourth_Grade_Nothing", "http://www.goodreads.com/book/show/22695.Summer_Sisters", "http://www.goodreads.com/book/show/80674.Superfudge", "http://www.goodreads.com/book/show/37743.Forever_"]}