{"ratings": 4553, "userreviews": [{"userName": "Justin", "userReviewDate": "Dec 05, 2016", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "This story takes place Across the Universe in Jamaica, and the beautiful, bright, happy cover may lead you to think \"Ob-La-Di, Ob-La-Da! This must be a very sunny, dreamy, Strawberry Fields Forever kind of book!\" But Let it Be known that there is nothing at all happy about this book, unless your idea of Happiness is a Warm Gun. The characters are written so well, and all of their stories are so tragic. I couldn't imagine spending A Day in the Life of any of them. Oh! Darling, first you have Margot who wants nothing more than to create a better life for her sister, Thandi. All the Help! she gives her and the money she saves comes from Golden Slumbers with men on the side while she also works at a local hotel. Because of this, Something happens that just takes thing to a new level. She can make money, but you Can't Buy Me Love, she thinks. Thandi would rather live in an Octopus's Garden than become a doctor like her family wants. She has to Carry That Weight a long time as she knows how hard her family is working to give her a better life, although she doesn't know what her sister has been up to. She's So Heavy and feels like she could carve her own path by going to art school and being more white so people might like her more. She thinks she can do it on her own, or she thinks \"Maybe I could With a Little Help from My Friends.\" She's Leaving Home! She's Getting Better! She's Fixing a Hole in her life of feeling stuck and confined to what herfamily wants. Not Being for the Benefit of Mr. Kite, but for herself! Her sister Margot also finds herself drawn to another woman which is very, very evil in the town. Verdene loves Margot anyway and is viewed as a witch by her neighbors, but she still thinks to herself she's \"Got to Get You into My Life. For No One will have to know. There is so much I Want to Tell You, so much I would Love You To... Something... And Your Bird Can Sing!\" She Says She Says. She loved her ever since she Saw Her Standing There. Where? I'm not sure. Could be Penny Lane. The last section of the book is called \"Here Comes the Sun\" and I really thought that meant things would be brighter. I was wrong, but I did love how all the different storylines started to Come Together in The End. Things really went Helter Skelter, too! I wanted to finish it last night, but I was all like \"I'm So Tired!\" I wish I could have finished it Yesterday. didn't need any Help! finishing this one after A Hard Day's Night though. In fact, I read almost half of the book in one sitting this morning under the light of the Good Day Sunshine. I'll probably still remember this book When I'm Sixty-Four. Usually, if I'm not reading or working, I'm Only Sleeping. I mean, I wish I had Eight Days a Week to read! I've looked Here, There, and Everywhere for great books to read this year, and I think this one was an excellent choice. Tomorrow Never Knows what I will read next, but I hope it's as good as this one. I've really gotta Get Back to reading awesome books again. Now I'm gonna go think about the different layers of this book and the emotion within its pages While My Guitar Slowly Weeps. Hello, Goodbye."}, {"userName": "karen", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "“Can’t wait to leave dis godforsaken place.” “Is it dat bad? We live by di sea. How much people can say dat? Give t’anks.”“Maxi, shut up wid yuh blessings nonsense. This is no paradise. At least, not for us.”so, i wasn’t over the moon about this one, and i’m not sure why. sure, it is absolutely, unremittingly bleak, but that’s never bothered me in a book. this is thomas hardy in jamaica; characters caught up in vicious cycles - suffering from the aftereffects of bad choices made because of narrow options and causing suffering in others as they struggle to stay afloat, thereby narrowing their options and on and on in this interconnected web of exploitation, abuse, ambition, violence, poverty, and a deep self-loathing that causes characters to feel shame for their most elemental traits - skin color, sexuality, gender.this is the book in a nutshell:”’Membah dis, nobody love a black girl. Not even harself. Now get up an’ guh get yuh pay.”i was impressed with so much of this - there were some really delicate mechanisms at work in the plot’s undercarriage, building the impenetrable wall of cause-and-effect/coincidence/irony which - again - is the very thing i love so much in thomas hardy. but i’m also frustrated by hardy’s characters - their decisions, their motivations, and i felt the same thing here: characters who jeopardize their own happiness, who betray loved ones, who bait their own traps. i appreciate these moves as necessary for driving a tragic narrative, but there were just too many specific instances here where the motivation wasn’t clear apart from the author wanting to achieve the end result. i don’t understand the relationship between thandi and charles, which goes from zero to maximum intensity in no time, and there are other more spoilery things where a very intelligent and strategically-minded character with an eye on the long game will make decisions whose consequences go against self-interest & etc.maybe i read this at a bad time - exhaustion and pain and assorted life-garbage have been cluttering my brain, so i probably glossed over some of the subtleties in my scatter. she’s an excellent writer, and there were painfully good images, turns of phrase, revelations. there was just some absence i can’t quite articulate, which seems douchey of me to even say. but i’m feeling a very high three for this one, and as a debut, it shows she’s got incredible potential, and i promise to read all future books by her with the proper amount of rest beforehand."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "When Lauren W. came on the Reading Envy Podcast as a guest for Episode 097, she brought this book to talk about. It wasn't long before I had to try it, and I'm so glad I did. How did this book pass me by? It is a novel about three women, all related, trying to make their way in a small community in Jamaica. Delores is the mother and matriarch, working hard to make what money she can, completely dependent on the waves of tourists coming through. Margot, her older daughter, appears to work in the service industry for one of the top hotels, but as the story unveils the truth, you learn that she has been selling herself for money, and has been doing so within the context of her employment. She is saving her money for her younger sister, so Thandi can go to school, become a doctor, and escape this very hard life. But Thandi is more focused on a skin-lightening regimen and working on her art. Because she goes to private Catholic school with students who are above her neighborhood's income level, she walks a confusing line between poverty and privilege. There are other things going on. The sex worker industry seems to be part of the hidden world of the most successful hotels and resorts, and Margot may not be able to work her way out of that the way she thinks. Not only that, a new resort is poised to move in on the land where her entire community lives, and she may play a role in displacing them. Margot is also in love, and with a woman who has already been shunned by the community, since being gay in Jamaica is still very much against the law and a punishable offense. Her neighbors call her a witch and children are afraid of her. The character of Delores ends up having more secrets than anyone, and I was so impressed by how that story was told, and also how she is pretty much unapologetic for what she has done. What choices do the women in this story have?It is a very well written story, and asks the reader to confront their own role in these issues. I have visited some of these places mentioned in the book, and feel like I have met a Delores and not bought any of her goods. It raises the need for conscious travel, understanding whether your hotel pays local workers ethically, and whether they turn a blind eye to (or profit from) the trafficking of women and sex. I listened to the audio based on Lauren's recommendation and was quite pleased at the nuance and performance of the narrator, Bahni Turpin. I will be looking for more of her performances for sure."}, {"userName": "Dorie", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "I was provided with an ARC by the publisher and NetGalley in exchange for an honest review.Despite the cover and the title “Here Comes the Sun”, there is nothing sunny, or even happy about this novel. To the Jamaican tourists this seaside village and new resort are almost “paradise” as the beautiful beaches and never ending sun combine with the lure of the azure ocean to create a perfect place for a vacation or retreat. The native Jamaicans however have suffered greatly.The novel is written in third person narrative and in many instances the native accent is incorporated into the accounts. The dialect takes a bit of getting used to but adds to the feeling of authenticity.The men of Montego Bay had made their living by fishing or farming. During the period covered in this book, however, they had suffered from drought for several years and many of the people had fled or just continued to try and survive, many by selling trinkets to the tourists. The water which had once held abundant lobster and fish are now just providing enough to sustain the fishermen’s families.This story is about several women and how their lives have been shaped by the upheaval in their village. Margot is the older sister of Thandi, a young girl still in school. Margot has done whatever she had to, including marketing her sexuality, to make money to keep Thandi in the private school. She was the one that was supposed to use her intelligence and schooling to continue on and perhaps become a doctor, or at any rate a success in life who could then repay her sister and mother for the hardships they endured to send her to school.Thandi however is struggling with what she wants in life. Though she is an excellent student her real passion is art. Though her teacher encourages her art work, her family wants her to concentrate on obtaining a scholarship. She is also just discovering her first feelings of womanhood including her attraction to a local boy.Verdene had been in London for some years but returned to help provide for her family. She is ostracized by the community for they know of her attraction to women which at this time was considered forbidden, they even labeled her a “witch” and wouldn’t recognize her even when she went to the market.This novel is beautifully written with passionate, very well described characters, I could feel the emotion in their words and actions. At times the book is very tense and distressing, a glimpse at the darker side of tourism and what happens to the people who are displaced from their former land and homes. I feel as though the title is an oxymoron, a paradox of what the book is really about. The author has certainly done her research about her homeland which is was also the home of her grandmother and great-grandmother, Addy, of whom she states “gave me the courage and freedom to write and live freely”.This is a novel I will highly recommend and one whose characters will stay with me for a long time."}, {"userName": "Book Riot Community", "userReviewDate": "Apr 14, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "I’m so grateful that I was one of the judges for the National Book Critic Circle’s Leonard Prize, because it gave me an excuse to read six excellent books. But among them, I couldn’t help but loving this book differently than the rest. Written with an intimate knowledge of and understanding of Jamaica, Dennis-Benn also explores queerness and race and religion and education – it is an intersectional novel if there ever was one. It’s also dramatic, sad, and had me crying in the end. I can’t wait to see what else this brilliant debut novelist writes.–Ilana Masadfrom The Best Books We Read In January 2017: http://bookriot.com/2017/02/01/riot-r... ____________________Don’t be fooled by the sunny title and cover of this novel, set in the resorts and ghettos of Jamaica. Here Comes the Sun is a novel about three women in one family who make desperate decisions to save themselves and each other. Mostly it is about Margot, who landed a prestigious job at a resort despite coming from a poor village. Betrayed by her mother when she was young, she is determined that her younger sister Thandi won’t suffer the same fate. Margot does whatever she must to afford private school for Thandi, with the promise of college and financial deliverance for the family. She keeps unspeakable secrets, but she doesn’t realize her mother and sister have secrets of their own. This book is a dark exploration of the sacrifices we make in the name of family and how sometimes we destroy the very thing we’re trying to save. I had to brace myself every time I sat down to read this book and dived into the tumult of Margot’s life. I read it the way I read a thriller, holding my breath, waiting for the next new revelation. It’s Shakespearean-level drama and compulsively readable.— Jessica Woodburyfrom The Best Books We Read In March: http://bookriot.com/2016/04/04/riot-r..."}, {"userName": "Joce (squibblesreads)", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/48087215-joce-squibblesreads", "userReview": "Full non-spoiler video review starts at 2:25 at this link!This book was phenomenal. I learned so much about Jamaica and the tourism industry, and it remarked on homophobia, racism, sexism, and ageism. So many talking points regarding being a woman in this society and around escort services in a respectful and layered manner. 4.25 stars for now, but I have a feeling I'll be bumping it up to 4.5-5 in the future :)"}, {"userName": "Taryn Pierson", "userReviewDate": "Jan 06, 2016", "userURL": "http://www.goodreads.com/user/show/13977687-taryn-pierson", "userReview": "I almost abandoned this book in the early going, and now it’s one of my favorites of the year. I can’t believe how close I came to missing out.For whatever reason, Here Comes the Sun was a really slow starter for me. The characters all clearly have secrets, but they are slow to reveal them—so slow, I wondered if we’d ever find out for sure what happened in each of their pasts. But then all the proverbial other shoes start dropping, and from that point on, it’s an all-consuming storm of resentment, greed, and betrayal. It’s a family tragedy Shakespeare could have written. Delores has two daughters, Margot and Thandi, born over ten years apart. Delores and Margot have major baggage between them, but one thing they can agree on is that they want better for Thandi, and they throw all their energy into providing for her. Margot works the front desk in a fancy Montego Bay hotel, a job which positions her perfectly for her other job as a prostitute. Margot is pragmatic; she tells herself it’s all worth it so that Thandi can go to a good school and become a doctor. But Thandi might have other ideas about her future—and trust me, that brewing conflict is just the tip of the iceberg with these women.Early on, this book felt like another deep character study—which it is—but it also turned out to be absolutely pitch-perfect, plot-wise. This summer I have been craving good plot development like chocolate. If something isn’t happening to advance the story, I’m tapping my foot and sighing loudly. Once the scene-setting and character-introducing is over and the shocking revelations start rolling in one after another, you’ll be hooked until the bitter end. (And I use the word “bitter” VERY deliberately. I have a feeling those last couple chapters will haunt me for some time.)My one regret is that I went with the ebook version instead of the audio. I would love to hear what a talented voice actor could do with the musical patois the dialogue is written in. Nicole Dennis-Benn is at the top of her form, even as a debut novelist. Highest possible recommendation.With regards to Liveright and NetGalley for the review copy. On sale now!More book recommendations by me at www.readingwithhippos.com"}, {"userName": "Aerion", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/6949814-aerion", "userReview": "What an amazing book! This book captured so many different themes that can be problematic to all people, but especially people of color is desperate and dire situations. The problems of intergenerational damage, the cycle of hurting those around you as a result of you being hurt, the cycle of poverty, environmental racism, modern day colonialism, colorism, homophobia stigmas against women in Jamaica. This book was just everything. Like others have said, do not let the cover of this book make you think this book is some fun island adventure because it is not. But it is a true and realistic story of the types of real life experiences you would find in families and black people all over the world. READ THIS BOOK"}, {"userName": "Jessica Woodbury", "userReviewDate": "Feb 19, 2016", "userURL": "http://www.goodreads.com/user/show/4271946-jessica-woodbury", "userReview": "The cover and title of this book may be going for light and sunny Jamaica, but this is not a light and sunny book, and I mean that as a great compliment. Margot, who lives with her mother Delores and her sister Thandi, is not the happy islander who doesn't worry about making ends meet. Margot cares about only one thing: saving her sister. Even though Margot has a desirable job in a luxury hotel, her life is anything but beautiful. She carries deep secrets as she puts on a strong face for Thandi, making sure she gets her to the critical exams she needs to get into a university and a real career. But Margot is not the only one with secrets. Delores has made horrible choices to get by, choices Margot is determined not to repeat. Thandi is becoming more interested in art and a boy than getting the life her sister wants her to have. And there is also Margot's secret relationship with a woman which she must keep hidden at all costs.It's rare that a book packs this heavy of an emotional punch. These women make desperate choices in terrible situations that they justify as best they can. Margot's journey from being her sister's savior to destroying her sister the same way her mother destroyed her is seriously Shakespearean levels of drama. Dennis-Benn slowly reveals the things these women don't say to one another, their secrets and betrayals. Margot, in particular, starts out as so sympathetic, a woman forced to sell herself to save her sister, and gradually becomes the thing she fears most without even realizing it.All dialogue is in Jamaican patois, which I'm sure will turn off some readers. It does break up your reading, since you must slow down to hear the dialogue in your head, but it's not at all difficult to translate, just an adjustment in reading speed. And it's worth the trouble, this is a book with a lot to say about tourism in poor countries, about the horrifying treatment of LGBTQ people in cultures that don't accept them, and much more. Highly recommended."}, {"userName": "Didi", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/2682140-didi", "userReview": "Nicole Dennis-Benn’s debut novel explores living on the island of Jamaica. Masquerading behind a jovial gay cover in bright orange, yellow, and green, Here Comes the Sun, starts gently and insidiously goes places we aren’t prepared for. The novel revolves around three unlikable main characters – Delores, Margot, and Thandi, who form an unforgettable trio. Delores is a mother preoccupied with money and not enough to the real well-being of her daughters. To continue reading... https://browngirlreading.com/2016/10/..."}, {"userName": "Tori (InToriLex)", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/10584748-tori-intorilex", "userReview": "Find this and other Reviews at In Tori LexActual rating 3.5This was an emotionally wrenching read, that explores the lives of very poor and marginalized women. I was immediately drawn to the cover of this book at a local library book sale, because of its brightly colored cover. But this book describes some dark topics. I wasn't expecting. Margot is a broken women who works to give her sister Thandi a better future, but loses herself in the process. Thandi is a very talented young women who wants to fit in and to decide her own future, but feels the weight of her family's hope. Delores is Margot and Thandie's mom, who made hard choices to survive, but who walks under the weight of her sins. All three of them have to navigate survival as tourism wrecks the community around them. The accounts of sexual abuse, betrayal, violence and sadness were portrayed in a genuine way peppered with dialogue written in the Jamaican dialect patois.\n\n\"Her imagination began to produce walls behind which she crouched in silence, closed off from the pain of the memory. She didn't have to leave this hiding place, for her imagination also produced its own food, water supply and oxygen.\"\n\nThe character development was great,the book slowly peels back the actions of these characters to describe the twisted reasons why. Jamaica was described as beautiful, but included descriptions of the poverty and helplessness left on its shores when tourists leave. There is a lot of sexual abuse described, but little justice given to the victims it leaves behind. Margot's sexuality is harbored as a badge of shame and dangerous in the small River Bank village, where people have no tolerance for same sex relationships. The writing was great and there was enough description of side characters to feel immersed in the community.\n\n\nThe main issue I had with this book, is a lack of resolution in the ending. Not every story should or has to have a happy ending, but I feel this book just abruptly stopped and I wanted more. Especially considering the sad reality of the characters, I wanted to see a future for these characters. Despite the ending I was engaged the entire time reading. This is an important book because it doesn't allow you too look away from the consequences of racism, sexism, and exploitation. If we aren't reminded by the stark reality of most of the people in the world, how else will we be inspired to change it. I would recommend this to adult readers who can handle looking at the consequences of heartbreak, through three women's eyes."}, {"userName": "BookOfCinz", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/9750143-bookofcinz", "userReview": "Nicole Y. Dennis-Benn you may have just wrote one of my favorite books for 2016, hands down my favorite debut book for this year (so far). \"Here Comes The Sun\" captures Jamaica and Jamaicans in a truly authentic way. After reading  \"A Brief History of Seven Killings\"  I felt no one would be able to capture Jamaica like that but Dennis-Benn proved me wrong! Being a Jamaican whose lived in a tourism capital and worked in Tourism, this book is truly on point. Working in Tourism was one of the hardest jobs I've had, because every day you knowingly or unknowingly feed into this facade of \"Jamaica Mi Irie\" because a lot of Tourist cannot deal with the \"Real Jamaica\". I liked that Dennis-Benn really captured what is is like living on a tourist capital for locals. Everyone aspires to work at one of the big hotels and once they do, they hardly ever leave. These locals who work in these big hotels are often the ones who have to vacate their homes for newer and bigger hotel developments to take place.... the irony! The characters in this book all have their demons to fight and I feel like I have met each and everyone of them in passing while living in Jamaica. There is the mother who works tirelessly to ensure her kids gets the best education, things she wasn't exposed to. The Mother who places so much pressure on her kids because those kids are her \"Retirement/Insurance Policy\". I cannot begin to tell you how often I have heard of parents who sacrifice everything for their child be it genuine or not, to ensure their kids look after them in the future. There is the Sister who didnt get to reach her full potential because of different circumstances but still see her younger sister as the one who \"will make it\".... All her dreams and aspirations rest in her sister. Then there is the younger sister who has to handle all these pressures to live up to everyones' expectation- including the community. Trust me, it is not a nice feeling. Needless to say, Dennis-Benn did an amazing job of capturing the Jamaican spirit. I might have missed which year this book was set in, but it felt a little late 1980s where Homosexuality was very frowned up on -still is, which is sad. The bleaching of skin however- with the technique of the saran wrap did not get popular until the 2000s... but thats just a small thing. I loved how authentic this book is, I felt so much at home reading it. I loved the added Patois and how thoroughly executed the conversations were. I am so proud of Dennis-Benn, a Jamaican at heart, what an amazing debut novel, I am looking forward to your next publication!!!!A MUST READ!!!!!!!"}, {"userName": "Trudie", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/4617856-trudie", "userReview": "I have to admit to struggling with this book and I think some of that is down to me picking it up directly after all the fun I had reading  The Nix . Part of my problem might also have been unrealistic expectations of this containing some element of, if not exactly levity, then a brief respite from relentless misery. It doesn't. This is an unflinching look at marginalised communities in Jamaica and particularly the tough decisions made by woman in order to survive. While not exactly a gratuitous exposé of the Jamaican sex industry, it does little to soften your landing into this world. This industry, driven by demand from white male tourists and the lack of viable economic opportunities for women is the \"invisible hand\" that drives this narrative. My chief enjoyment while reading this was admiring the three extraordinary female characters that Dennis-Benn has crafted in this book - Margot, her sister Thandi and their mother Dolores. But I was disappointed when the plot, for my own personal reading taste at least, veered melodramatic and too expository. I also struggled with the relationship between Margot and Verdene, it just made no intuitive sense on the page, it was, much like the entire book - cold and abrasive and hard to warm to. However, all faults and questions of actual \"enjoyment\" aside - I am so pleased this book is doing well and is finding an audience. It is important to have authors that unflinchingly take readers into worlds that make them uncomfortable.  Here Comes the Sun  certainly achieves that."}, {"userName": "Sarah", "userReviewDate": "Nov 19, 2016", "userURL": "http://www.goodreads.com/user/show/7477266-sarah", "userReview": "3.5 Stars.This was a very complex book with a lot of interesting themes like sexism, racism, dysfunctional families, resentment, betrayal, homophobia, capitalism, sexual abuse, violence etc. The book also had very good character development, good writing, a very authentic Jamaican feel to it and diverse characters who are not quite what they originally seem to be. With everything I just listed, it's hard to not feel for these characters and story. At times it is absolutely heartwrenching to read. I enjoyed this book overall but it's not perfect. It was quite slow in places, almost to the point where I was losing interest in the entire thing and for me, it was missing that wow factor. The best things about this book are definitely the authenticity and the character development/ the reveal during the book where you find out what the characters are actually like. The authenticity is really flawless. Granted, I don't know much about Jamaica but I felt like this was a very good representation. The description of the areas, the dialect (which was at times hard to understand but appropriate), the food, the culture- just everything really came to life. The characters and what they were really like and why was my favourite thing. At the start, different characters will tell you things about themselves so you think you know them pretty well but then as the book progresses, secrets are revealed and things happen and you realise that the characters are actually quite different from what you originally perceived them to be. I would recommend this to people who think it sounds interesting but just be aware that this book is quite dark and there is sexual abuse and a bit of animal abuse too. I would read another book by Nicole Y. Dennis-Benn."}, {"userName": "Leslie Reese", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/6584206-leslie-reese", "userReview": "Rough and dramatic; yet, enthralling, and often poetic."}, {"userName": "Monica ", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/4739465-monica", "userReview": "[Delores - the matriarch. This woman is filled with self-loathing from early childhood. Branded as ugly due to her size, she was raped at a young age which begat her oldest child Margo. The family is very poor. Unfortunately her youngest daughter Thandi's father, wants Margo (10 years older that Thandi) rather than Delores. Delores resents Margot more because of this. When Margot reaches a certain age, opportunities present themselves and Delores choses to prostitute Margot to lift the family out of poverty. Her hopes for Thandi are that she will become a doctor. She is cultivating Thandi to save herself from poverty. Delores is an unrepentant user and a bit self-obsessed.Margot - the main character of the story. Margot is beautiful and uses her beauty to climb the corporate ladder. The novel starts she works at a resort in Montego Bay. During the day as an office manager at night she is a high priced call girl. She uses her income to put her younger sister through a private school. She hopes her sister will never have to go through what she does to survive. Margot hates her mother. Margot is also a closeted lesbian. She is filled with resentment for who she is, what she has to do to earn a living, never experiencing parental love, and viewing the \"brass ring\" daily without ever having the opportunity to grab it. Opportunities at the \"brass ring\" present themselves and Margot finds herself willing to take those opportunities at the expense of becoming all the things that she abhors. Her evolution is the most chilling in the book.Thandi - the youngest daughter. The future that everyone has draped their hopes and dreams around...without much consideration at all for what she wants. Thandi is coming age, just now starting to think about her future. Mother and sister have put undue stress on her without explanation. She has lived a very sheltered life and does not understand the tremendous sacrifices made on her behalf. She too is self loathing but doesn't have a full understanding as to why. She is trying desperately to lighten her skin tone in an effort to attract the right type of man. She too has horrible secrets. She has fallen for Charles, ostensibly a good person but from the wrong pedigree. Minor but important characters include:Alphonso - Margot's boss. Family owns the resort and wields it's wealth like a cudgel throughout the island. He is symbolic of colonialism, corporate greed and the patriarchy. Entitled and essentially without conscience, he provides opportunity and motivation for Margot.Verdene - Margot's lesbian love interest. Verdene is an outcast within the community because she is an out lesbian. She is Jamaican but has some wealth. She was educated in London. Her character is the closest to kind of any character in the book.Charles - Thandi's love interest. Charles is young, poor and long suffering . His economic status makes him an outcast in the community. Charles is the closest to a good soul of any character in this book.Sweetness/Gillete - Charles sister. Former classmate of Thandi. Margot's most useful tool. Sweetness is looked down upon by many people because she is a prostitute who will do anything for money. A huge contrast to Thandi who is sheltered and doesn't understand sacrifices to survive. (hide spoiler)]"}, {"userName": "Latanya (CraftyScribbles)", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/24192262-latanya-craftyscribbles", "userReview": "Nicole Y. Dennis-Benn chronicles racism, colorism, sexism, classism, colonialism, elder abuse, and homophobia in this lush tale of one woman struggling to make a life for herself and her sister as problem-free as possible.Margot hustles to make her sister, Thandi, never experience her struggle. She wants the best for her sister, but working in Jamaica's tourism industry makes her second-guess who she is as she manages to keep her head above water (pun intended). Outside of her professional hustle, she tries to make her personal life work amid a society that's homophobic. For example, living life as a bisexual/queer woman on the island's difficult. She adores her childhood friend, Verdine, who's Lesbian dealing with the overt hatred towards her sexuality. This book's raw, crisp, and honest. Dennis-Benn rips your heart, but you welcome the truth at your front door. I recommend this story, printed or in audiobook (The narrator's fantastic). 4/5"}, {"userName": "Cindy Burnett", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "4.5 starsHere Comes the Sun is both beautiful and heartbreaking. While the story was much sadder than I expected it to be, I truly loved the book and will be thinking about the story and the characters for quite some time. Nicole Dennis-Benn weaves a tale of greed, longing, and betrayal on the island of Jamaica. She deftly portrays the paradox Jamaica has become where extreme poverty exists side-by-side with untold wealth and the trouble that results. Using Jamaican patois and highly descriptive prose, Dennis-Benn dispatches the reader to the coasts and seas that make up the island. Two sisters, Margot and Thandi, share a mother (Delores) but that is where the similarity ends. Margot works several jobs, including engaging in prostitution, at a nearby extravagant resort to pay for her younger sister Thandi’s education at a local elite private high school. Delores and Margot believe Thandi is the family’s key to breaking free from the world in which they live – stolen electricity, no indoor plumbing, and a shack for a house. As Thandi gets close to the end of her school career, she feels the pressure from her family while wanting to pursue her own interests.The story is a deep and desperately sad tale which I could not put down. While telling the tales of the various characters, Dennis-Benn also vividly depicts the way tourism runs roughshod over the residents in poor countries. Entire towns are evicted from their homes with little if any recompense and no where to go in order to build more and more colossal resorts. The author also addresses the mindset of certain cultures regarding same sex relationships and the pain and shame that results. I highly recommend this book. Thank you to NetGalley and the publisher for the chance to read this novel in exchange for an honest review."}, {"userName": "Patty", "userReviewDate": "Mar 31, 2016", "userURL": "http://www.goodreads.com/user/show/301240-patty", "userReview": "I was so excited for this book, but alas, it did not live up to my expectations. Despite the cheery yellow cover and the seemingly-hopeful title, this is absolutely one of the darkest books I've read in quite some time.The main character is Margot, a young Jamaican woman who works at a tourist resort. She is ferociously ambitious, and dreams of escaping from the shack where she lives with her family. Margot is a sex worker on the side, supplementing her income and trading sex for promotions and other social benefits. She's focused on her much younger sister, Thandi, who attends an expensive private school. All of the family expects Thandi to become a doctor or lawyer and rescue the rest of them. Thandi, however, is mostly concerned with a cute neighborhood boy, buying skin lightening creams, and becoming an artist. Their mother Delores violently resents her daughters for their beauty and intelligence, and has spent most of their lives driving them away and then blaming them for not loving her the way she wants them to. The final important character is Verdene, a slightly richer woman with whom Margot is in love (sort of, kind of; Margot can't quite bring herself to commit to a same-sex relationship) and who has been ostracized by the community for being a lesbian.All of these characters are suffering from the trauma of poverty, globalism, racism, colorism, homophobia, sexism, and rape, and as a result are all deeply self-loathing. And not the kind of self-loathing that's fun to read about, where it's just some angst to be healed with a kiss before the end of the story, but the more realistic kind, where it becomes a self-fulfilling prophecy, making the person pull away from others, making them hard to spend time with and extremely hard to like. Margot in particular makes some absolutely terrible choices, and as much as I can see where she's coming from, I don't have any sympathy for the negative consequences that result.The writing is lovely and the characters are complex and realistic, but it's simply not a book that I wanted to spend any time with. It lacks a single ray of hope, or spark of goodness, or anything at all other than pure undiluted bleakness. And I know that not every book has to be fun or even enjoyable, and I'm sure that this is objectively a 'good' book, but by God, I would have liked anything to entice me to return to these pages and not simply flee in glad desperation that at least I had the option of escaping, unlike the characters. I read this as an ARC via NetGalley."}, {"userName": "Ace", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/23405868-ace", "userReview": "I've been reading a lot of books about 'mothers' of late, a run of them that wasn't intentional but just the way my TBR was rolling. Of all of these, I dare say that Delores takes the cake in the super bitch category. She is mean, cruel to her children and others and opportunistic. These traits have rubbed off onto Margot and whilst I felt much empathy for her, she too is a bitch. This book is dark, its about a bad time in Jamaica circa '94 with property developing into big resorts catering to tourists and pushing the poor further and further into poverty and out of their villages and homes and separating social and family circles apart. The characters are abused and desperate. It was a difficult read, but I kept going until 5am this morning to see where the dice would fall.As a tourist myself, currently sailing through the Caribbean (no plans to visit Jamaica this time around), I feel so bad for some of the poverty I have seen on the outskirts of the ports where I've anchored. The very resorts such as the \"Palm Star Resort\" in Here Comes the Sun that sit in prime seaside locations and hill-tops probably have pushed minor communities out and destroyed families and their livelihood on these magnificent Islands. I am conflicted.The distance that separates me from this story is so wide that I also feel bad to mention that I thought that this layering and heaping on of traumatic events upon an already bad situation was a bit dramatic and could easily be turned into a tv drama and I started to get the feeling about half way through that it may well have been written with this in mind. I could be wrong here, its just the skeptic in me rearing its ugly head."}, {"userName": "Brooke", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/13662036-brooke", "userReview": "I am very impressed with this debut. I wouldn't hesitate to read her future works. I believe it's worth noting the irony of the lovely, unassuming cover- this is truly a heartwrenching tale, one that will stay with me for a long time. Taking place in Jamaica, HERE COMES THE SUN focuses on the lives of Margot, Thandi, Delores & Vande. With themes of racism, classism, homosexuality, prostitution/trafficking, abuse (both human & animal), etc. this is a very heavy book to take in, but well worth the energy invested.Just the iceberg of the premise: Delores sells her daughter, Margot, into the trafficking world for $600 when Margot is 14. Delores claims that it is to get rid of the \"devil\" inside Margot & believes this is the way to go about it. (She is harboring feelings for Vande & women loving women are known to be \"witches\" on the island. The homophobic hatred is strong but necessary to shed a light on.) Fast forward to the present when Margot is 30, still secretly in love with Vande & still working her escort job to help pay for her little sister Thandi's schooling. Margot gets offered a job proposition that sets the whole thing in motion- ruining her live & taking everyone down with her. Dennis-Benn's prose is so intoxicating, you can't bear to endure the pain of seeing how Margot's actions create permanent ripple effects, but you can't tear yourself away from the page either.Definitely worth checking out when you're in the right frame of mind. Everything about this from the character development to the scenery worked for me & you never really know the true nature of one's intentions, rather Dennis-Benn peels off each layer at a time, which I really appreciated. The glumness is unwavering but is a worthy read indeed."}, {"userName": "Demi", "userReviewDate": "Jun 01, 2016", "userURL": "http://www.goodreads.com/user/show/1403616-demi", "userReview": "Oh, man. I met Nicole at BEA this year and pretty definitely fell in love with her. HERE COMES THE SUN is gorgeous and lyrical, as difficult as it was to read. I cried A LOT at the end, but it was totally worth it. Nicole is one to watch out for."}, {"userName": "Erika", "userReviewDate": "May 12, 2016", "userURL": "http://www.goodreads.com/user/show/31394894-erika", "userReview": "It reminded me of \"Bastard out of Carolina,\" in other words really intense but good. The cover (of the ARC) made me think it would be more of a vacation book--lighter. But it was Jamaica from the perspective of a dysfunctional family who rarely get to enjoy the beaches. It doesn't leave this point of view: the dirt yards with a goat on a rope, the walk through town with grown men catcalling adolescences, and the mother saying the most hideous thing to her children. It is a narrative of the behind-the-scenes Jamaica, and it's chilling."}, {"userName": "Rebecca Foster", "userReviewDate": "Mar 10, 2017", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "(3.5) Don’t think Beatles pop; think of the sun as coming to expose secrets, crimes and prejudice. The focus is on a trio of black women: mother Delores and her two daughters by different fathers, 30-year-old Margot and 15-year-old Thandi. There is a strong sense throughout of reality not matching up with the characters’ goals. You might think of this as a cautionary tale: be careful what you wish for, as going after what you can’t have – or going after the right things in the wrong ways – may well end in disaster. Dennis-Benn paints her native Jamaica in loving detail, but it can be a challenge to traverse whole pages of dialogue in patois. Ultimately, though, this is a powerful evocation of a country in transition, one where race and sexuality are still forces of division in families as well as in society at large.See my full review at Shiny New Books."}, {"userName": "Elaine", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/2352900-elaine", "userReview": "3.5 with a bump up for setting. Anyone who goes to a tourist resort in the Caribbean should know where they really are, and what their resort costs in human terms, and this book can help with that. And this book dramatically illustrates a deep Jamaican cultural homophobia that I have heard about professionally from asylum candidates but not seen developed from the \"inside\" in a novel setting. That said, the pacing and timeline is very uneven, and the character development is bumpy as well. The three main female characters are all very unlikable in different but persistent ways, even as you long for them to show something that will let you root for them. The fourth lead female character, Verdene, the victim of much village homophobia is the most likable but the book drops her in the middle, and her story doesn't really end up playing out except as an incident to the other characters' stories.It's a long book to read when you don't care for any of the characters as people, and when character growth and development never happens. I do feel like the author tired halfway through, as it seems like the architecture of an intricate and tragic multi-character plot is being constructed, but then is never finished. That said, I mostly turned pages quite quickly and there were the seeds of a Shakespearean tragedy inside the rather didactic illustrations of the miseries inflicted by cultural homophobia, skin color bias, racism, misogyny and poverty."}, {"userName": "B", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/14873408-b", "userReview": "“Secrets have a way of making themselves felt, even before you know there’s a secret.”– Jean FerrisSo many hidden agendas…Here Comes The Sun by by Nicole Y. Dennis-Benn, is the story of the true (gritty) life behind the postcard perfect images you often see of resort destinations in Jamaica. The novel centers around Margot, her younger sister Thandi, and their mother, Delores. It’s the story of their day to day struggles and desperations, the turmoil within their family, and the threatening effects that a future hotel development has on their village. The book hit the ground running for me and never let up. Behind the beautiful and cheery cover art lines very dark struggles, so don’t let the pretty picture fool you.Read my complete review here."}, {"userName": "Lauren ", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/1291915-lauren", "userReview": "There are countless consequences to choices we make in life. This book drives that point home with the story of four Jamaican women. Delores and her two daughters, Margot and Thandi, with the lone fourth being Margot's lover, Verdene. Through these women, we see cycles of abuse, poverty, and the weight of systemic racism and misogyny in modern Jamaica. It is not a light-hearted book (as the title and even the cover art may suggest), but one full of heart, truth, and pain. I am glad I read it.Longer spoken review and discussion of this book on Jenny's Reading Envy Podcast 097: Blank Spaces (guest: me!)"}, {"userName": "Marlene England", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/30806745-marlene-england", "userReview": "Dennis-Benn writes beautifully about strong women, so many secrets, forbidden loves, abandoned dreams...there is plenty to love about this book, including the authentic dialect and the notion we all know to be true: \"paradise\" is often not all that it appears to be."}, {"userName": "Jessica", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/14736392-jessica", "userReview": "Here Comes the Sun is an intense and intriguing look at 3 Jamaican women's lives and how they navigate their circumstances on the island. Highly recommend."}, {"userName": "Missy J", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/7406091-missy-j", "userReview": "[the Lignum Vitae! (hide spoiler)]"}], "description": "Capturing the distinct rhythms of Jamaican life and dialect, Nicole Dennis-Benn pens a tender hymn to a world hidden among pristine beaches and the wide expanse of turquoise seas. At an opulent resort in Montego Bay, Margot hustles to send her younger sister, Thandi, to school. Taught as a girl to trade her sexuality for survival, Margot is ruthlessly determined to shield Thandi from the same fate. When plans for a new hotel threaten their village, Margot sees not only an opportunity for her own financial independence but also perhaps a chance to admit a shocking secret: her forbidden love for another woman. As they face the impending destruction of their community, each woman fighting to balance the burdens she shoulders with the freedom she craves must confront long-hidden scars. From a much-heralded new writer, Here Comes the Sun offers a dramatic glimpse into a vibrant, passionate world most outsiders see simply as paradise.", "title": "Here Comes the Sun", "url": "http://www.goodreads.com/book/show/26530351-here-comes-the-sun", "average": 3.82, "cover": "https://images.gr-assets.com/books/1463185922l/26530351.jpg", "reviews": 729, "authors": [{"url": "https://www.goodreads.com/author/show/14343402.Nicole_Y_Dennis_Benn", "name": "Nicole Y. Dennis-Benn"}], "type": ["Fiction", "Lgbt", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/26530351-here-comes-the-sun", "http://www.goodreads.com/book/show/25671463-here-comes-the-sun", "http://www.goodreads.com/book/show/36089871-here-comes-the-sun", "http://www.goodreads.com/book/show/33614883-here-comes-the-sun", "http://www.goodreads.com/book/show/34447603-here-comes-the-sun", "http://www.goodreads.com/book/show/39927444-patsy"]}