{"ratings": 1464, "userreviews": [{"userName": "Amy", "userReviewDate": "Oct 08, 2015", "userURL": "http://www.goodreads.com/user/show/31057593-amy", "userReview": "I must admit, it took me a long, LONG time to like hero Gray Fowler, but once he won me over... yowza!!! Gray and Dru fought tooth and nail -- often literally -- for their happily-ever-after! Wade delivers a sizzling romance and a bittersweet farewell to the Porter siblings and their extended families -- fans of Undeniably Yours will particularly love the subplot featuring Meg and Bo. Heck, even the racehorse gets a victory lap! A beautiful story of forgiveness, trust, the futility of human striving and the freedom to love that can only come from embracing God's love first... Time to re-read this series from the beginning!!!"}, {"userName": "Beth", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Her One and Only takes the top spot for the books of Becky’s that I’ve read so far. The chemistry, the suspense and the spiritual aspect were all perfectly proportioned to make one stellar read. The pacing of the story is on point – there weren’t any lulls, nor was there ever a point that I wasn’t eager to pick it back up and continue reading. At first, Dru Porter didn’t seem like she would be all that relatable of a character. She has a tough exterior, and frankly, didn’t seem like someone that I would fall for as a lead character. What a silly thought! I just loved her. She is tough, yes, but not unrealistically so. She’s confident as a body guard because she works hard to be good at it. She been through quite a bit and intends to do her job and do it well. However, she has a vulnerable side that helps to even out her tough exterior. Gray didn’t seem like an appealing lead to me, but once I got to know him as the story progressed, there was so much more to him than hot-shot football star. Part of my delight while reading this story was how much I ended up loving both of these characters and rooting for them.Their banter and discussion always feels realistic, and I loved how they were both serious and teasing with one another. I really appreciate how Becky doesn’t shy away from the fact that people have feelings and attractions – don’t get me wrong, nothing was inappropriate, but it is so refreshing when characters act like real people, with real emotions and awareness of both emotional and physical temptations that can arise in relationship if you’re not careful. The chemistry between the two was through the roof, passionate, tender and endearing (but never inappropriate).The faith element is organically present throughout. I don’t want to say too much so as to give nothing away, but I thought their personal journeys were very well-done, particularly Gray’s. This story is full of emotion, and I loved the aspect of what’s perceived and what’s true. Gray appears to have everything, but despite his success, real happiness is illusive for him. Seeing him move from superficial faith to earnest yearning for something deeper was a beautiful part of the story for me.The Porter family is one that I’m glad I’m not quite done with – I have read Ty and Celia’s story yet, so I don’t have to say goodbye until then, and I’ll be sad when I do! Not having read one of the books didn’t lessen my enjoyment of Her One and Only one bit, although I will say, I’m glad to have read the first book since Becky includes a bit more focus on them in this story – it adds a true-to-life aspect that breaks up the suspense a bit in Dru and Gray’s story and also brings a nice feeling of completion to Meg and Bo’s story from the first book. In any case, I think that if someone picked this book up first, they would not be disappointed at all – perhaps just eager to go back and read the other books, too!"}, {"userName": "Carrie Schmidt (Reading is My SuperPower)", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/6084197-carrie-schmidt-reading-is-my-superpower", "userReview": "If Becky Wade ever decides she wants to write romantic suspense long-term, I’m all for it! What a great book!! The intrigue and suspense surrounding the plot point of Gray’s stalker added to the romantic tension that sizzled between Dru and Gray. The action scenes were full of energy and played out in my mind like something from tv’s Castle as I read them on the page. And the kisses. WHEW! Goodness gracious.The relationship between Dru and Gray is full of delicious chemistry, entertaining banter, and genuine affection. They made me laugh and grin and swoon and even get a bit tearful at times. Both are coming from less than stellar pasts – some of their own making, some (especially in Gray’s case) out of their control. Dru has already found her footing with God and is living out the reality of being a new creation. Gray has to get to that point during the course of the novel, and it’s one of my very favorite parts of his story.Because Becky Wade is at the helm, you are also in for a high dose of delightful humor. This is mostly courtesy of two things in Her One and Only – Becky’s lovely & witty writing voice and a cast of supporting characters that prove to be subtly hilarious.If you couldn’t tell, I loved Her One and Only. I adore Dru and Gray together, and the depth to their story is still stirring in my heart. I don’t love saying goodbye to the Porter family, but if we must… this is the perfect farewell. All my favorite peeps made more than an appearance, and my favorite conversation (the one that shows up in every book, thanks to Mrs. Porter) slipped in there too. The suspense, the action, the KISSES – all stellar, along with Becky Wade’s witty style and engaging characters. One of my favorites so far of 2016!(I received a copy of this book in exchange for only my honest review.)Read my full review at Reading Is My SuperPower"}, {"userName": "Kathy", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/1143268-kathy", "userReview": "Nice to see Dru get her happy ending. I would recommend reading the other books about Dru's brothers first before reading this one. Meg & Bo play prominent roles in this story. Becky Wade is one of my favorite Christian fiction authors. I have loved this series.Christian Fiction where God plays a role but not really preachyContent: Clean"}, {"userName": "Caitlyn Santi", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/6980753-caitlyn-santi", "userReview": "What an amazingly perfect, yet very bittersweet (For all us fans!) ending to the Porter family series! I have been so looking forward to Dru's story ever since book one and I was not disappointed in the slightest! I loved both Dru and Gray (Becky Wade has crafted yet another utterly swoon-worthy hero!) I liked how God used Dru to help strengthen His relationship with Gray, and vice versa, always such a wonderful thing to see in a romance novel! I loved the banter between Dru and Gray, as well as between Dru and her family so much, that has been one of my favorite things about this family since book one. I love that I can always count on Becky Wade to tug at my heart strings, make me smile and keep me chuckling from beginning to end and this book was no different! Words truly cannot express my depth of love for this book as well for the entire series! It was so awesome that this book provided closure in several different areas, I especially loved the conclusion of Meg and Bo's story! It's funny but I guess I felt about the Porter family similar to the way Mrs. Bennet (From Pride and Prejudice) felt about her children, that I wouldn't be truly happy until each sibling had found the love of their life. LOL! :DAs that is now the case, then, while I am sad to say goodbye to this fictional family that I love so much, I am completely and perfectly and incandescently happy that they are each living their happily ever after's and I can revisit them and their adventures any time I want to! I highly recommend Her One and Only to fans of contemporary romance with a suspense element (oh yes, how could I have forgotten about the suspense, it was sooo good! I absolutely loved that part of the story, and let me just say that I am usually able to figure out the identity of the villain(s) pretty early on but with this one there were so many possible suspects that my guess kept changing and until the ID was made I had no clue for sure who the guilty party was!)While I think the books can definitely stand alone I would recommend reading them in order! Fans of the Porter family series are not going to want to miss this final installment! I cannot wait to see what else Becky Wade has in store for us!"}, {"userName": "Heidi Robbins (Heidi Reads...)", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/966933-heidi-robbins-heidi-reads", "userReview": "The Porter Family series is one of my favorites in the contemporary genre! The characters are realistically flawed, yet their strengths help them overcome the trials they face. In the beginning of this book, I didn't relate to Dru and Gray at all, didn't even like them much... so it's a real indicator of the author's skill that I began to care about them and for them, and was emotionally involved enough by the end to shed a few tears. Details of Dru and Gray's pasts and personalities were revealed slowly throughout the story, layer by layer, and I followed right along and connected with them as they connected with each other and appreciated the deeper aspects of their characters as they discovered them within each other. Not to mention their amazing chemistry!I loved the attention to detail when describing the procedures of the security team. It was realistic and reassuring, and made Dru believable as a \"executive protection agent\". The author didn't leave gaping holes that have bothered me when reading other books. The element of suspense balanced the pacing of the book with the development of their feelings for each other. The secondary plot of Meg and Bo's struggles add another dimension without derailing the main plot. Those scenes will be most enjoyed by those who have read the whole series, but this book also does well as a stand alone. It made me want to go back and read the whole series all over again :) Highly recommend!(Thank you to Litfuse Publicity and Bethany House Publishing for a copy of the book in exchange for my honest review)"}, {"userName": "Tima", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/5300365-tima", "userReview": "Dru Porter is the youngest in her family. She's also the only girl. As the late in life child, it's been a fight to keep up with her older brothers. Her mother tried desperately to get her interested in princess activities or dance, to no avail. After a stint in the military, Dru is now working for a security firm as a protection agent. Her next client is a football player named Gray Fowler. Gray has a stalker that has taken a turn towards dangerous. And until the police can figure out who is sending the letters, Gray must suffer with round the clock body guards. Neither party is happy with the arrangement. Dru is protecting a womanizing guy who plays for the wrong football team, Gray is sure that a tiny woman like Dru can't protect him and will ruin his reputation as a tough guy. I've enjoyed all of the books in this series. But I think this one is a favorite. The author mixed suspense with the romantic elements which gave it just the right amount of drama and intrigue. The reader is able to catch a glimpse at the couples from the previous books. I think this book would work as a stand-alone since the references to the previous characters fit with the book and don't leave the author guessing. I really liked how the author wove the theme of faith and trust into the character's lives. I loved how the book started off with a bang and then went back to tell how the characters arrived at the dramatic ending. Dru is a dynamic character that jumps out at the reader from the page. She's strong, but has a gentle side. She's a super hero. My favorite secondary character is Augustine. This woman is hilarious and really rounds out the story. This family was a joy to read about and I'm sad that there aren't any more in the series. But I'm sure the author has something even better coming out next.I received this book free of charge from NetGalley in exchange for my honest review."}, {"userName": "Rachel", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/24104675-rachel", "userReview": "I really enjoyed this last book in the Porter series. The author does a great job of tying up the stories of all four of the Porter siblings. You get a glimpse into the lives of each of them and get a feel for how things are going for them since you last \"saw\" them when you read their stories. :)Ha! I loved Dru's spunkiness! She is fierce and doesn't let her size or the fact that she's a lady keep her from knowing that she can bodyguard this huge NFL guy! :D Gray, on the other hand has a LOT of doubt as to how a female half his size could protect him. There is lots of fun sparring between these two as they adjust to being together and fight their growing attraction and affection for each other. The fact that Gray plays for a football team that her brothers do not like also makes for some laugh out loud moments.I can't say I was that enamored of Gray at first. He's a stereotypical football player in that he drinks and dates a lot of woman and makes that bet with his best friend about Dru (eye-roll). But he falls pretty quickly under Dru's spell and once you find out about his childhood you can actually admire that he has achieved as much as he has. Through his growing feelings for Dru and her bluntness about his relationship, or lack thereof, with God, Gray finds his way to a place of humbleness, peace, & forgiveness for himself and towards his parents.I appreciated Dru's story in that Dru didn't come from a bad childhood or a broken family but she made choices in life that led her down the wrong paths and far away from the faith of her childhood. She's facing the consequences of her past and is in a good place now but she's still somewhat haunted by past mistakes. She has to learn to really let God have it all before she can learn to trust and allow herself to love.The thread of suspense of an unknown stalker was woven through the story and played out with some intense moments. I can't say I really guessed for sure who the stalker was. There were plenty of candidates but in the end I was a little surprised at who it was.I also have to mention that from a Christian standpoint, in my opinion anyways, Dru gave in to her physical attraction too quickly. Gray was not a Christian and therefore their physical relationship (clean - kissing and hugging) and Dru going out on dates with him should not have happened according to the biblical standard of being unequally yoked. Dru finds herself going against her conscience in this (she realizes she's rationalizing having a relationship) and they both suffer some hurt when things go bad after a while.All in all, this is a great romance with plenty of spark and a background of suspense to keep you riveted to the end!*Thanks to Litfuse and the publisher for a complimentary copy of this book for review purposes. I was not required to write a positive review and all opinions stated are my own.*"}, {"userName": "Emilee", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/11072558-emilee", "userReview": "Becky Wade has done it again! Her One and Only is another 5 star read. I really appreciated the fresh story line. It's not like any of the others. Yet it fits perfectly in The Porter family series. Dru's character has the perfect mix of an independence and fun-loving personality. The action throughout the story is believable. There is a little mystery and a lot of romance. I enjoyed the Porter family dynamics. Ty is still my favorite Porter sibling although I do not have a favorite book because they're all 5 stars to me. I loved how Becky gave us updates on the rest of the family. Jake and Meg's story was also sweet and fun to read. I highly recommend The Porter Family Novels to all readers of contemporary romance."}, {"userName": "Laura", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/29789832-laura", "userReview": "It's been several days, since I finished reading this book, and I still have Dru and Gray on my mind. I miss reading about my literary friends. This entire series was great. I love that Becky Wade's stories are funny, real, faith filled, and always leave me with a longing for more, because they are so enjoyable. This is definitely a series I will reread."}, {"userName": "Toni Shiloh", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/22153625-toni-shiloh", "userReview": "This book is filled with all things AWESOMENESS!!! Seriously, I haven't finished a book in a while (or more like 20 books or so) that left me with that warm glow, cheesy grin, and chattery lips to talk about every favorite scene in this book feeling. And since the book is over 300 pages, that's a lot of talking.​But seriously!! This book reminded me why I will always read a novel by Becky Wade...*You can read full review at: http://tonishiloh.weebly.com/blog/rev..."}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "[Dru begins to wonder 70pages till the end if having that sin (s*x) with Gray would be worth it (they don’t)  (hide spoiler)]"}, {"userName": "Carole Jarvis", "userReviewDate": "May 26, 2016", "userURL": "http://www.goodreads.com/user/show/2054668-carole-jarvis", "userReview": "Reviewed at The Power of Words: http://bit.ly/1UrVd6bHer One and Only concludes the Porter Family series in a moving way and is an outstanding story on every level. Becky Wade is one of my favorite authors in the contemporary romance genre, such that I almost tend to go against type and get a little giddy when holding one of her new releases in my hand. I’ve read enough of Becky’s novels to have certain expectations when I begin a new one, and I am never disappointed. The writing is tight, not one single word is wasted, and it moves at a fast pace.Becky’s stories are multi-dimensional, both from really rich character depth, to a mixture of emotion, humor, spirituality, sizzling romance – and in this case, suspense. I think the term transformational fits her books, because Becky doesn’t shy away from difficult social issues, such as PTSD, alcoholism, child abuse, infertility and miscarriage – and it’s all about the transforming power of God and how He works through His children. It was also wonderful to see Bo and Meg’s story brought full circle.Executive protection agent Dru and sports superstar Gray both have difficult personal histories and are portrayed very realistically. Dru is always trying to prove herself and Gray finds his self-worth in his sport. They have a lot of together time in the story and it’s so much fun to watch their initial negative assessment of each other gradually change. Spiritual themes are never lacking in Becky’s books. I loved Dru’s faith and how she takes her elderly neighbor to a bikers’ church, showing that church is not a “one size fits all” institution. There’s a couple of gems that I could totally relate to and I think readers will also. First, the question of where we find fulfillment, for Dru questioned if Gray was “looking for fulfillment in stuff like achievement and wealth, only to find it empty.” Secondly, whether from our own making or from circumstances beyond our control, who of us doesn’t have a flawed past?Thank you for writing this series, Becky, for in the Porters, you have created a family that not only entertains and inspires us, but one that we care about and will never forget. Highly recommended.Thank you to Bethany House and Litfuse Publicity for providing a copy of this book in exchange for my honest review."}, {"userName": "Noela", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/8103324-noela", "userReview": "Ingenious, intriguing, and absolutely irresistible! Becky Wade, surely the Queen of Contemporary romance, delivers a tale that generates sparks on every page within ‘Her One and Only!’ A romance that sizzles, a foreboding mystery that baffles, and a powerful and emotive theme of trusting God—all barely even begin to reveal what an enjoyable tale that the ‘one and only’ author Becky Wade has created.When the Mustang’s popular football star Gray Fowler continues to receive escalating threats from an unknown source, he is assigned an around the clock security team. The brawny, macho, chauvinistic player scoffs at one of his protection agents—a lithe, attractive woman named Dru. But the former marine who’s also a black belt, surprises him by her determination and persistent immunity to his charms. Gray is drawn to this leather-clad ‘super-hero’ but because of his tormented childhood and his parent’s dismal example, he’s sworn off love and commitment. On the other side of things, feisty and confident Dru has a career-tarnished reputation and is fiercely determined to prove herself on the job. And that means no matter how alluring this big football guy is, she will keep everything strictly business. Plus, she has a client she needs to keep alive from a deadly stalker. Can she achieve both?The electrifying chemistry between Gray and Dru is testimony to the strength of their personalities. Author Becky Wade has nailed it by creating two intricate and flawed characters that connected perfectly—even while irritating each other! It was pure delight watching Dru and Gray’s resistance to each other crack, and witnessing how they bounced off one another with their combined wit. Behind my smiles, however, hovered an edgy uncertainty surrounding the identity of the stalker. The mystery of the anonymous assailant kept me guessing and in suspense constantly. Complimenting the romance and suspense is a touching, inspirational thread on the heartbreaking struggle and anguish of infertility and miscarriage. And of the very real difficulties to trust God fully for life, for love, and for courage. Highly recommended!*Thanks to NetGalley and the publishers for providing a copy of this book in exchange for my honest opinion which I have given.*"}, {"userName": "Amy", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/28286656-amy", "userReview": "I very rarely give 5 stars to a book. I save them for the best of the best. 'Her One & Only' by Becky Wade is the final book in the Porter Family series. It grabs you from the very first page, I've read this book so fast, because I just couldn't put it down. I'm pretty sure it's my favourite of this series, which I never expected! Dru, the youngest child & only daughter of the Porter Family, is 10 years younger than Jake (the next oldest brother). She's been living her life in competition with her 'big' brothers, and wanting to find her fit, to be equal to them. She's served in the Marines, and now works Personal Security as a protection agent. She's had a difficult couple of years as one client was lost, and recovering from injuries, physically & emotionally. She finally has a chance to prove herself again to her colleagues when she is assigned protection detail to a famous NFL player. Arrogant & sure of himself 'ladies man' Gray, thinks his pride is hurt to have a woman as a bodyguard. He's being stalked and receiving death threats, which he doesn't take seriously. The set up for these two is wonderful, and what you get is a story full of wit, sass, stubborn pride mixed in with a tale of longing for love & forgiveness - though Gray would never admit it. You will fall in love with Gray & Dru, from the very beginning. You will smile, giggle & feel deeply as you turn the pages of this beautifully written novel. The chemistry is written with such talent, that there's proof you can have a clean Christian romance and get all the wonderful heartfelt 'zings' as you read. Dru the 'Revengeress'!!! Love!!! As a extra special addition, there's weaved between this story a little extra for Bo & Meg, which is where this series began, and I found it very touching that they got to have a part in the final story. I will miss these Porters!! Thank you Becky Wade for a fabulous read. I received this ARC from Bethany House Publishers & Netgalley in return for my honest review."}, {"userName": "Brittany", "userReviewDate": "Jan 14, 2016", "userURL": "http://www.goodreads.com/user/show/18727044-brittany", "userReview": "I enjoyed reading Her One and Only so much! Dru and Gray were deep, complex characters who both had things from their past that they were trying to rise above. It was impressive to see how Dru had overcome bad choices and was now trying to live her life in a way that honored God. She was a great character. I actually really liked both Dru and Gray, even though Gray was caught up in much of the trappings of fame and fortune. He had a fascinating back story and I absolutely loved watching him grow into a man who could truly love Dru.The Porter Family series has been a favorite of mine since reading Undeniably Yours, so I have been excited as each subsequent book has released. The author did a great job of creating stories for each of the Porter siblings that kept me coming back for more. I love when a book series is built around family members and I get to catch up with what is going on with the characters that I have come to care about. Her One and Only did a great job of fulfilling my need to know how the couples from the first three books were doing. Even better than that, Meg and Bo from book one had a wonderful side story flowing through this book. Throw in a very well-written suspense thread and Her One and Only was the perfect ending to this series! I loved it from start to finish!I received a complimentary copy of this book in exchange for an honest review.You can read this review on my blog at:https://brittreadsfiction.wordpress.c..."}, {"userName": "Anna Hurtt", "userReviewDate": "Oct 24, 2015", "userURL": "http://www.goodreads.com/user/show/3538995-anna-hurtt", "userReview": "Guys, I loved this book! That's all there is to it. The romance is sweet and the tension is steady throughout the course of the book. I loved Dru... It's hard to create a tough female character without her becoming annoying or overbearing, but Becky did an amazing job with making her likable, spunky, and easy to sympathize with. Gray is also a great character and his journey of overcoming his past to becoming the man he needed to be was touching and real. It was easy for me to see that they are perfect for each other from the very beginning. The romance scenes were swoon-worthy and it was great to see them together after everything they have to overcome from both inside and out.This book was a pretty even mix of suspense and the mystery of finding Gray's stalker and alternating sweet and snarky moments between Dru and Gray. And what Porter novel would be complete without the quirky and hilarious Porter family butting into Dru's life?Something else that I really enjoyed is hearing Meg's story and point of view during some of the down moments of the book. Her struggle with fear and worry over her pregnancy was especially poignant to me and it was very easy to sympathize with her. It's a great change of pace and I loved revisiting her character and her and Bo's relationship. Also, the baby scenes are absolutely heartwarming and adorable.All in all, this was a great conclusion to the Porter series and I can't wait to read what Becky has for us next.Disclosure: I received a copy of this book in exchange for an honest review, which I have given."}, {"userName": "Melanie", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "Her One and Only was a great conclusion to the Porter Family series. While it didn't surpass book two (Meant To Be Mine) as my favorite, I did still love it. The first half was good, but it was the second portion that made this a five star read. I absolutely loved the pace and ending.I liked that there were scenes with Meg and Bo (from book one), but I do wish that we would have gotten some insider scenes with Ty and his wife. ;) One of the things that I really liked was the suspense...oh, and I loved the way the book started off with a cliffhanger that left you eager to find out what happened next (it was a scene from later in the book and then the story jumped back in time). All in all, a great story and ending! If you like contemporary romance, I think you'll enjoy Her One and Only. I recommend this series!!*Disclosure of Material Connection: I received one or more of the products or services mentioned above for free in the hope that I would mention/review it on my blog. I was not required to give a positive review, only my honest opinion - which I've done. All thoughts and opinions expressed are my own and I only recommend products or services I use personally and believe will be good for my readers. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255: \"Guides Concerning the Use of Endorsements and Testimonials in Advertising.*"}, {"userName": "Alyssa", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/1586516-alyssa", "userReview": "Her One and Only is the fourth and final book in Beck Wade's Porter Family series featuring every Porter siblings story. My favourite book in this series is definitely Undeniably Yours, but Her One and Only gave it an run for their money. Her One and Only tells the story of Gray Fowler, an NFL tight end who is being stalked by an unknown person. For protection a bodyguard is hired to keep watch of Gray at all times. That bodyguard just happens to be Dru Porter, the youngest Porter sibling and the only sister. Dru is a former Marine who is highly skilled and as Dru and Gray come closer to solving the mystery of who is stalking Gray the closer Dru and Gray get to each other.Her One and Only is yet another fantastic Contemporary Romance from Becky Wade. This novel is sure to satisfy readers and fans of Becky Wade's previous works. Her One and Only is a book to pack in your beach bag."}, {"userName": "Madison", "userReviewDate": "Nov 10, 2015", "userURL": "http://www.goodreads.com/user/show/6951127-madison", "userReview": "Her One and Only concludes the Porter Family series. This is the perfect book and the perfect end to a perfect series. Her One and Only is fun, romantic, nostalgic and breaks all the old romance novel cliches. As the last book in this series it is nice to reconnect with all the past characters, see how Bo and Meg are doing, check in with Ty, Celia and their brood of kids and catch up with Jake and Lyndie. Meg and Bo play a substantial part in the book, but ultimately it is Dru and Gray's story that, rightly so, grabbed my heart. Dru Porter is one tough heroine. She's smart and not afraid to let everyone around her know it. Youngest Porter sibling, former Marine, and now executive protection agent, she can more than hold her own. And she's going to need to when she takes the post as Gray Fowler's bodyguard. Gray is a star NFL player, rich, determined and very used to getting his own way. Well, he hasn't met Dru yet. The prologue lets the reader know that they should expect plenty of suspense and action in this book along with the regular romance. And what a fabulous love story it is. Dru and Gray don't get off to the best start. That might have something to do with Gray's comments about female bodyguards. Gray isn't perfect. He has had a rough childhood, followed by an unchecked adult life. In no way would he tick every box on someone's Perfect Guy list. He is flawed. He is human. And Dru can't help falling for him. I love the verbal sparring that passes between Dru and Gray. They excel at giving the other a hard time and making it extremely cute to read. I love how Dru calls him big football player. I love how Gray teases Dru about her role as a woman. I loved watching the changes in Gray and Dru, both as individuals and as a couple. They both have complicated pasts but work through this through God's forgiveness and their honesty with each other. As a result, their faith plays a subtle but consistent understory in this book, underpinning their meeting of hearts, undeniable attraction and shared good humour.It's been eight years (in the series' time) since we first met Bo and Meg and it's been a wonderful journey sharing in the Porters' story of family, love and life. It's been a pleasure to read this series and I can't wait to read what Becky Wade has in store for us next. The publishers provided a complimentary copy of this book in exchange for an honest review. Find more reviews on my blog Madison's Library."}, {"userName": "Katie W", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/988087-katie-w", "userReview": "This story is the finale of a series about a family and I would recommend reading the others first, as the brothers make appearances throughout this book and things will make more sense.Hot, hot, sizzling hot chemistry! I love a book with a spunky heroine and a hunky leading man. Dru is a determined woman, one who has definitely sowed her wild oats and is now fierce, loyal, and tough. As an executive protection agent, she takes her job seriously and is committed to find out who is stalking and threatening NFL superstar, Gray. Gray has risen up from a tumultuous background and has worked his way into being one of the best football players around. He doesn't seem to have a care in the world and isn't serious about anything--especially woman. As time goes by, the sparks and undeniable attraction leaps off of the pages and leaves the reader thoroughly engrossed in the suspense, the danger, the mystery, and the romance.Dru is definitely intimidating, but I admire her. I like her solid front--what you see is what you get with her. Gray is a womanizer who seems to have it all. His past has absolutely shaped who he is and how he reacts to life and once I was able to see a few layers peeled off, I couldn't help but to adore him. I love characters with depth. I love the ebb and flow of the story line. There are tender moments mixed with heart pounding suspense and the pacing is great! Her One and Only is full of heart, forgiveness, emotion, and love. Ms. Wade has outdone herself with this one!Content: mild romance (kissing, implications of former intimate relationships); moderate religious elements, as God plays a role in the characters' lives, but nothing is preachy; mild violence and moments of peril. Clean!*I received a copy from Bethany House through Netgalley in exchange for an honest review*"}, {"userName": "Kay Defreese", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/3050019-kay-defreese", "userReview": "Her One and Only is the last book in the Porter family series and focuses on Dru, the youngest and only girl of the Porter siblings. Dru has a job typically held by men. She is a body guard and to a football player. The fact that he doesn't play for the Dallas Cowboys does not win him any points among the Porter brothers. I had a hard time liking Gray Fowler. He was cocky, chauvinistic, a womanizer and liked the liquor a little too much. At 60 percent into the book you could understand some why he acted the way he did and my attitude started softening toward him.In this last book of the series there is a mystery going on. He has a stalker and of course Dru is is body guard. Is is an obsessed fan, someone from his past, a rejected girlfriend? I was completely surprised at who the stalker was. Meg and Bo Porter have a secondary story that is interesting to follow. You won't want to miss the secondary story that Bo and Meg Porter have. And on Thanksgiving Day you will get caught up on all the Porter family with their extended family and friends. Some of the conversation they had on Thanksgiving will make you laugh. I'm going to miss the Porter family but can't wait to see what Becky Wade will be writing next."}, {"userName": "June", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/9873203-june", "userReview": "Dru's story ties up the Porter series nicely. This is the perfect ending to a perfect series!!! I came away from the story feeling that the Porter family is safely wrapped up and just waiting for their fans to revisit, which I'm sure I will do often. This is one of those series with real life issues and characters that feel like someone you truly know. Becky Wade is an amazing author! I loved the banter between Dru and Gray. But they also had some serious conversations that were intense and I came away from the story feeling like I knew both of them pretty well. The little competition between Gray and his teammate Corbin was fun to watch too.I think my favorite part of the book was the Doritos example to explain Dru's brothers. It was awesome and so well put. The Porter brothers in a nut shell. I highly recommend not only this book, but the entire series! I received a copy from the publisher in return for an honest review."}, {"userName": "Shannah Mauney", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/21794737-shannah-mauney", "userReview": "Talk about a book hangover!! I finished Her One and Only last night and sat there after putting it down thinking...WOW. I am pretty sure this is my favorite out of all of the Porter family novels. I loved the flow and feel of this novel. Becky Wade has a knack for creating life-like characters with genuine emotions and reactions. She pulls you into a story and leaves you wanting more at the end (in the best possible way, of course). Overall, I'm sad that the Porter Family series has come to an end, but I couldn't have asked for a better conclusion to one of the best family series I've ever read! Read my full review: http://faithlovebooks.blogspot.com/20..."}, {"userName": "Staci", "userReviewDate": "Oct 09, 2015", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "Ahh...what a satisfying conclusion to the Porter Family Series. Her One and Only and Meant to Be Mine were equally my favorites.Her One and Only is Dru's story. I loved her spunk and confidence. She and Gray were a perfect match.I highly recommend the Porter Family Series that enjoy Contemporary Romance with a dash of humor."}, {"userName": "Kara", "userReviewDate": "Feb 12, 2016", "userURL": "http://www.goodreads.com/user/show/6137018-kara", "userReview": "I fell in love with Wade’s writing starting with My Stubborn Heart (I was sure they meant me in that title) and have been keeping up with her and her writing since. Her One and Only is another great title and this one kept me up way past bedtime. The Porter family is definitely one of my fave fictional peeps and this is Dru’s story :) She has three older brothers that she competed against and tried so hard to keep up with growing up (I have two brothers so I deeply appreciate authors who write series with siblings----Wade has done this and so has Dani Pettrey and Rachelle McCalla and they are brilliant for doing so) and now she is trying to prove herself as an executive protective agent within Sutton Security after something went terribly wrong on her last assignment. Little does she know that there’s no one like Dru and she was my favorite part of the story.Gray Fowler has come a long way since his dysfunctional childhood and has become a hero to football fans everywhere. I am not a sports fan, but really enjoyed reading about his routines and life as an athlete. Despite the ego he portrays, he really is a decent guy and he immediately gets under Dru’s skin with his attitude towards having a woman protector. The constant banter between them was such a hoot!I really disliked that Gray and his best friend and fellow football player, Corbin, make an agreement involving Dru. I knew right away that was going to cause trouble, it did make for a more interesting twist.I thought for sure I knew who the stalker was, missed it be a mile! However, the case was well written and enjoyed how good Dru was at her job.“She’d been hired to protect him, but he’d come to a place where he’d do anything, give anything, risk anything to protect her.”There is also plenty of the Porter family in this story, but even if you haven’t read the previous books there won’t be any confusion because Her One and Only is a standalone. The book also describes something Meg and Bo are going through and it was a delight reading about their love.Are you kidding me with that near ending part? The author had my heart gasping and all I could think was, “I know it’s a happy ending, or it better be, but REALLY?!” Wade continues to bless me with her writing and even though Her One and Only was not my favorite read, I really did enjoy it. I so look forward to more of her stories!I received the Kindle copy via NetGalley for the purpose of reviewing. I also received the paper copy from the author to help promote the book. My thoughts and opinions are my own."}, {"userName": "Chantel", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/5822088-chantel", "userReview": "What a wonderful end to the Porter Family series! It's been a year since I read the last book so I really felt like I was reuniting with old friends, I just loved this family so much! The town of Holly and the beautiful horse ranch. (Sigh)  Drew's story really was full of love and suspense. Lol! Don't let the lovey dovey cover fool you this book had action and a little mystery to keep you on your toes. Dru really became one of my favorites. She was tough and straightforward but she also had a kind heart and really loved deeply took care of the people in her life. Plus the fact that she's a bodygaurd taking down bad dudes in heels, no less! All I have to say is...get it girl! Gray Fowler... at first I didn't really care for him, but as the story moved forward and really finding out more about him and the past struggles he overcame... I was like, this dude is like the macaroni to her cheese. I just adored the chemistry between Dru and Gray! They both were such strong personalities they would butt heads in that page-turning-I'm-secretly-attracted-to-you type of dialoge, that grew into more. Becky did a great job developing both Dru and Gray's spiritual walk as well. They both had to learn to overcome the past fears about love and trust by turning to God. But I love how Becky we didn't try to rush that process, that their development happen more organically and realistically.I thought it was great that Becky put more about Beau and Meg and their journey is a couple, it really just brought everything full circle. I laughed I cried, the whole nine! I will definitely miss reading about this fam. I would highly recommend this series!"}, {"userName": "Brooke (i blog 4 books)", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/4669345-brooke-i-blog-4-books", "userReview": "I've loved every single one of Becky Wade's books. It seems that each one is better than the last, and Her One and Only is no exception!After spending so much time with the Porter family over the past few books, I was definitely looking forward to *finally* reading Dru's story. Of course, getting to catch up with the rest of the family was also a plus.Dru is all grown up now, and after a stint in the Marines, she is now working for a private security firm. This assignment is her first since a major fiasco occurred on her watch, so she has a lot to work through on a personal level. Not to mention her feelings about Gray! They are a perfect match for each other. The each have plenty of personal issues to work through, as well as their thoughts about romantic relationships. But the story progresses at a nice pace and allows them to work through their drama over time. And there's a decent amount of romance!The suspense was fast-paced and intriguing. Just one more layer to an already great story. The focus on God, family, forgiveness, and redemption made this more than just a \"fun read,\" which I appreciate!The one downside (to me) was that there seemed to be some tension (on Dru's part) between Dru and her brothers. She feels as though she doesn't quite measure up and wants to fully fit into the family. I didn't feel like that was truly resolved (between Dru and the brothers) even though there was a lot of discussion about it.I'm sad that the Porter Family series is over! BUT ... Becky Wade did a stellar job giving us a fantastic conclusion to a series I've loved from the beginning. Highly recommend!"}, {"userName": "Cynthia Marcano", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/17621357-cynthia-marcano", "userReview": "What I Loved...I have waited a long time to read Dru's story. It was absolutely worth the wait. She comes a very close second to being my favorite Porter sibling. Ty Porter still reigns supreme, but I absolutely loved Dru. Spunky, funny, tough and loving.Gray Fowler is a great hero. He is a mix of what makes a hero so swoon worthy. Wounded, flirty, tough, smart and funny.I don't often love both the hero and the heroine but this is one of the rare times I do.They were a fun couple to read.And Ty Porter makes several appearances...Swoon!What I Liked...The Porters were in full force for Dru's story and I loved reading how their stories have continued. Meg and Bo have a secondary storyline. It was nice reading about them.Her One and Only isn't your typical romance. Wade added a little mystery that kept me guessing until the end.Not to worry however, there are plenty of swoon-worthy and juicy bits for the romantics.Other...The cover is playfully cute. I sort of pictured Dru that way. It ties in nicely with the story.Her One and Only is standalone and doesn't require you to read the others in the series. However, I recommend reading Undeniably Yours before reading this one. It will add to the experience.I definitely recommend this book for anyone who loves, Romance, Contemporary Christian Fiction, or even a little intrigue.Disclaimer: This book was provided by the publisher through Netgalley. The opinion of this book is my own and I was not paid or compensated for my review."}, {"userName": "Gretchen", "userReviewDate": "Sep 25, 2016", "userURL": "http://www.goodreads.com/user/show/28467449-gretchen", "userReview": "It's so sad to see the end of this series!! One of my favorite series of all times! This book was super super intense and I was on the edge of my seat the whole time!! I really loved the Dru, I loved how strong her character was. Highly recommended read!"}], "description": "Romance Fans Eagerly Anticipate Every New Release from Becky Wade Gray Fowler, star NFL tight end, is being pursued by a stalker, so his team hires a protection agency to keep Gray under the watch of a bodyguard at all times. When Gray meets Dru Porter, an agent assigned to him, he's indignant. How can an attractive young female half his size possibly protect him? But Dru's a former Marine, an expert markswoman, and a black belt. She's also ferociously determined to uncover the identity of Gray's stalker. And she's just as determined to avoid any kind of romantic attachment between herself and the rugged football player with the mysterious past. But the closer they get to finding the stalker, the closer they grow to each other. As the danger rises, can Dru and Gray entrust their hearts--and their lives--to one another?", "title": "Her One and Only\n      \n          (Porter Family #4)", "url": "https://www.goodreads.com/book/show/26974629-her-one-and-only", "average": 4.32, "cover": "https://images.gr-assets.com/books/1445659561l/26974629.jpg", "reviews": 331, "authors": [{"url": "https://www.goodreads.com/author/show/5298259.Becky_Wade", "name": "Becky Wade"}], "type": ["Christian Fiction", "Romance", "Contemporary", "Christian", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/26974629-her-one-and-only", "http://www.goodreads.com/book/show/28604831-her-one-and-only", "http://www.goodreads.com/book/show/12963141-my-stubborn-heart", "http://www.goodreads.com/book/show/16110337-undeniably-yours", "http://www.goodreads.com/book/show/18144692-meant-to-be-mine", "http://www.goodreads.com/book/show/23411527-a-love-like-ours", "http://www.goodreads.com/book/show/32497077-true-to-you"]}