{"ratings": 13577, "userreviews": [{"userName": "Flannery", "userReviewDate": "Feb 16, 2011", "userURL": "http://www.goodreads.com/user/show/652877-flannery", "userReview": "I guarantee you, if you read this book: (1) You will laugh; and (2) You will want to eat some waffles. I have eaten three waffles in the past two days just because of this book. (Fine, it was also because someone else made waffle batter and it takes a minute to make once all that work is done:)) But in all seriousness, this book is buckets of awesome. Samhain Corvus LaCroix (Sam) is a Seattle college dropout working at a fast food restaurant with a few of his friends and generally slacking it up in his off-time. After an unfortunate potato hockey accident behind the restaurant, Sam comes into contact with an intimidating man who recognizes Sam for what he is—a necromancer. Clueless, Sam is faced with an ultimatum before he even comes to terms with his dead-controlling ways. Craziness ensues.Author Lish McBride uses short song snippets as the titles for the chapters and they are fabulous. I think my heart just about exploded when I got to the one entitled “Make A Little Birdhouse in Your Soul.” (My first concert besides Raffi and the parentally-enforced-you-must-love-being-Irish Chieftains concerts I went to with the family was They Might Be Giants, which I think is a totally respectable first concert, no?) Anyway, I loved every single one of them. It might be a little annoying to some people but I thought it went well with the overall campiness. Crowinator got there before me but she is dead-on that this book reminded me of a mixture of Buffy’s fun and the snarkiness of Dead Like Me. Sam very much reminded me of George from Dead Like Me—a sarcastic yet compassionate slacker working at a just-for-the-money job, only Sam is far nicer than George ever was. And he has his kickass friends, one of whom is a head in a bag. Yeah, you read that right. A head. In a bowling bag. The sense of humor is dead-on and the story was fun in the same way that Paranormalcy was. It felt fresh in a genre where originality can be hard to come by. This book has it all, and I almost feel like Stefon from SNL could do a wonderful recap of what this book has to offer: Crazy garden gnomes that want to kill you, a talking cat that is really a dragon, sexy werewolves, a head in a bowling bag, medicine bags that make people invisible to supernatural radar, a Catholic schoolgirl harbringer that loves waffles, sex in a cage, and ZOMBIES. You get the idea. The pacing is quick but unhurried and the story arc is complete at the end yet leaves itself open to future books that I really hope will exist despite a lack of parenthetical series markers on Goodreads. It would be a huge shame if this was a standalone. This is actually more like 4.5 stars but I'm gonna leave it at 4 instead of 5 for differentiation purposes."}, {"userName": "Wendy Darling", "userReviewDate": "May 01, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "Never judge a book by its title. I have to confess it took me awhile to get to this one because I think the title is a little cheesy (and it's now obviously impossible to get Elton John out of my head), but this turned out to be a hilarious book that had me laughing out loud numerous times--not a bad feat when a big part of the book is about raising the dead. All the characters are engaging and likable, especially smart-mouthed Sam, strong and beautiful Brid, Sam's little sisters, the...incapacitated Brooke, and the gleefully bizarre Ashley.Favorite quote: \"So, you're telling me the zoo commissioned you to make a zombie panda in order to avoid a potential international incident.\" Hah!This is probably a 3.5 star book for me, though, since:* I would have liked to have seen more of Sam's necromancy powers appear earlier on* Douglas would have been more interesting if his character was a little more developed* it would have been fun to see more of the critters that appear later in the book* the flashbacks slowed down the momentum a little too much* the book would have been more pulled together if Sam's narration was in the third person. With focus shifting between him, Douglas, Brid, and then later Ramon and Tia, having Sam's POV in the first person was confusing when it would have been just as good written in the third.Still, these are minor ticks considering this is a super funny, fast-paced and entertaining book. I enjoyed the big battle scene at the end, am mightily intrigued by the idea of a were-bear, and I love the way the author writes. Can't wait for the next installment in the series! Though now I want waffles. Badly."}, {"userName": "Vinaya", "userReviewDate": "Apr 19, 2011", "userURL": "http://www.goodreads.com/user/show/4687823-vinaya", "userReview": "Confession: I am ridiculously addicted to 80s high school movies. In a I've-watched-them-40-million-times kind of way. In a I-own-hideously-expensive-collector's-editions kind of way. In a I-would-love-to-be-Lloyd-Dobler's-honey kind of way. I mean, seriously, who could resist this face?Not me!If someone had plucked Llyod Dobler off the sets of Say Anything, and stuck him in paranormal YA book, he would probably be called Sam LaCroix. Now this is Point 1 in Lish McBride's favour. You can keep your Michael Schoefflings and Rob Lowes. My heart will, forever and always, belong to John Cusack. Sam LaCroix is the 21st century version of Llyod Dobler. He's a college dropout who works at a fast food restaurant. He's a drifter, with no particular aims or ambitions, until one day, he captures the attention of a creepy guy who tells him the truth about himself - he's a necromancer. Now Sam (short for Samhain Corvus LaCroix) isn't exactly excited to find out that he has paranormal powers. He is even less pleased to have come to the attention of Douglas, the top necromancer in Seattle and head of the Council, especially since Douglas has an uncomfortable tendency to make threats, resort physical violence, and send hapless baby-necromancers talking heads of their best friends. As Sam tries desperately to navigate through this new world, he is helped by his friend and fellow fry cook, Ramon, the hapless food service newbie Frank and the gorgeous-and-often-naked werewolf Brid. Truth be told, I'm a little in love with Sam. He's self-deprecating, so very normal, but in an oh-so-adorable kind of way, and he really stands out in the crowded mass of paranormal alpha super heroes. But even more, I love the dynamic between Sam, Ramon, Frank and Brooke. First brought together by food service-induced misery, this quartet forge strong bonds of friendship and humor that warmed the cockles of my heart (what the hell are cockles, anyway?*) throughout the book. I also liked Sam's relationships with his mother and sister, with a special nod to his awesome-funny relationship with Mrs. W, his neighbour down the hall. The relationship between Brid and Sam was not a high point for me, but I'm glad he found someone, and they turned out to like each other without falling in twu wuvv 4 eva!Much to my surprise, I found myself recognising most of the songs used as chapter titles, although I can't say I appreciate the soundtrack of 'Tiny Dancer' running in my head every time I read the title. A fan of Elton John, I'm not!Lish McBride does a fabulous job writing a male voice, making Sam gentle and non-aggressive without being effeminate. The other thing I really appreciated about her writing was the way in which she switched tenses and POVs without making the transitions jarring. I know some people disagree with me on this, but I really appreciated the opportunity to see the story from several angles. The characters also became more fully fleshed-out and multi-dimensional that way. All in all, this was a truly worthwhile read, and if you haven't read it yet, well, what are you waiting for?! Go now, or I'm gonna sick Michelle and her !!!!!s onto you! ;-) Thank you, Maja and Michelle, for hounding me until I read this book! I can't wait for the next book, especially because I am dying to see what happens to Ramon! May 2012 *cries* why, why, why?!!!* Wikipedia tells me that \"Cockle is the common name for a group of (mostly) small, edible, saltwater clams, marine bivalve molluscs in the family Cardiidae.\" Huh, who knew?!"}, {"userName": "Emily May", "userReviewDate": "Oct 18, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I'd just like to make a point of saying that three stars for me can mean indifference or \"liked but had issues with\" or just anything else in between the two. This book I liked, let's be clear on that, I don't want to be the hosepipe at the bonfire on this one. It's taken me a long time to get around to reading this because funny is a harder sell for me than dark, sad, disturbing... take your pick. Obviously, humour is far more subjective than those I just mentioned. However, I can say that as far as I'm concerned, this book really is funny. Some parts are even hilarious.The humour wasn't an issue, but the over-crammed zig-zagging all over the place plot was. The story starts in 1st person POV with Sam (Samhain) as narrator, he finds out that he is actually a necromancer and his mother has been hiding it from him. In this crazy town of Sam's, there is some kind of supernatural council headed by Douglas - also a necromancer - and after our first encounter with Sam, we are taken on a history trip into Douglas's life and then into his present (now in 3rd person). After this, we find ourselves being introduced to a group of werewolves - who we also get a mixture of past and present info on - because the daughter of the pack leader has been kidnapped.I appreciate that this is not intended as a serious book, so I did try my hardest not to read it as one. However, the comedy factor combined with the skipping from subplot to subplot made me feel like I was in a sketchshow. Not to mention the whiplash I got from being dragged here and there and desperately trying to keep up. There was so much going on that I quickly became detached from it all and I lost track of what was happening and who was who.If you are after a quick laugh, I'd place money on this book giving it to you. I just think I wanted something a bit more from the story. Nothing spectacular, but just enough to really make me want to read on. I will come back to other books that always make me laugh like Angus, Thongs and Full-Frontal Snogging, The Boyfriend List: 15 Guys, 11 Shrink Appointments, 4 Ceramic Frogs and Me, Ruby Oliver and Dairy Queen, the characters in these series are so vibrant and hilariously lovable that I always need to find the next installment. McBride's characters, on the other hand, were good for a few laughs but I will almost certainly forget them in a few days."}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Jan 30, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "Updated- I heard from the author, next book is due in Jan/Feb May 2012! Yeah!Review below!Poor Sam. You thought you were going to be your average, college dropout, unmotivated, 20-something, fast food working, movie watching, girl craving, young male. Little did you know that you actually are a far from average, mysterious, potentially powerful necromancer.What is a boy to do?Well for Sam, first you figure out what the hell you are? Second, you flip out when everything you know is twisted and disorientated to the point that life, as you’ve known it is no longer the case.McBride is twisted. She is twisted because she takes necromancers, shape shifters, witches, and other creatures and makes their existence in this novel not only fresh, and original but also damn funny. The humor and outrageousness is what grabs the reader. The story is what keeps you.You don’t believe me? There is a talking head in this book. It is not a spoiler. I’m not telling you whose head gets wacked off. Nevertheless, yes, there is a goddamn talking head. Here is the real surprise for all you reading this review, in this book, it didn’t seem weird or out of place. I’m not someone who likes weird and twisted books that I don’t understand but everyone else gets the hidden meaning. I don’t want to think that hard with my books (I went to Graduate school for that). Here, the story is zany, twisted, weird, and interesting but it makes sense.I’m not doing this book justice with my review. Just read the book. There!BTW, Becca, you rock. Thank you for thinking of me when you read this book (maybe that isn't a good thing since this book is twisted) and sending it my way!"}, {"userName": "Shannon", "userReviewDate": "Oct 03, 2010", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "This review is mostly a lot of negatives, but I still liked this book. I wanted to give this 4 stars, I really did, but the more I thought about it the more I realized it had a lot of problems. You know that feeling you get when you're rooting for the characters and you're immersed in the world and you're frantically turning pages because you can't wait to see what happens next? You get to a certain level of emotional investment where you feel like an active participant and not just a spectator on the sidelines. Well, that didn't happen for me in this one. The characters didn't feel real enough to me, the world wasn't as well-formed as I would've liked, and there were a couple of plot points I thought only existed to artificially move along the story without actually being plausible. First off, if point-of-view jumping bothers you, definitely steer clear of this one. Not only do we get multiple POVs (I think I counted five in total, with a brand new one showing up just a few chapters before the end,) the story shifts from first person to third person as well. Sam, the main character, is the only one we get first person POV from, and the rest of the time the chapters are told in third person subjective. Normally I'm the last one to notice POV or tense, and that could be because I'm so used to reading YA novels, but I know certain things like first person present tense POV drive people nuts (this isn't in present tense though, if that helps.) I really only noticed when the story switched from third person to first person, and I admit that was a bit jarring, but it ultimately didn't ruin the book for me. I do think this contributed to me not connecting with the characters as much as I should have though. There was too much head-hopping for me to really latch on to any one person.A lot of the additions to the world on top of Sam's necromancy were included that I thought should have been saved for the next book. There were too many supernatural beasts, types of magic, and revelations thrown all into one novel. I thought Sam's initial story was compelling enough to hold its own and the multiple plotlines and side characters only weakened the core idea. I also found it annoying that there was so much going on and so much tossed in at once but so little was resolved in the end. I understand this is a series, but I wanted at least a little more closure than what I got. Two things that I thought only existed to move the plot along in an implausible way: certain characters keeping important information to themselves and the villain deciding he's going to train Sam to be his apprentice. The first thing is a commonality in a lot of genre fiction but that doesn't mean I'm not sick of it. \"She didn't need to know now, there was already too much going on.\" UGH. No, tell her. So much could be solved with simple communication. The second part is included in the description of the book so it's not a big surprise, but still, it doesn't make sense. Douglas thinks Sam isn't a threat, but I don't see at any point where Sam makes it seem like he's on Douglas's side. Sure, let's train the kid who we've threatened and terrorized to use his special powers. Or, I know, just kill him and find some hired muscle to do your dirty work instead.I don't know how many people watched the show, \nReaper\n, but it was a short-lived series on the CW that I thought was highly underrated and didn't deserve to be canceled. It's about (a different) Sam who finds out his parents sold his soul to the devil so he has to work for him as a bounty hunter capturing escaped souls. Sam works a crappy job at a Home Depot-like store and has a group of sidekick friends (a Latino, a chubby funny guy, and a pretty girl) and they get into mischief with all sorts of supernatural beings. Sam has special powers, an important side character gets irreparably ... damaged, and there's a certain level of slapstick comedy mixed with the macabre. (Sound familiar?) I really doubt many people watched this show, but I can't help thinking how much it compares to this book and how the show was funnier, smarter, and better. I suppose it's not fair to compare two completely different mediums like this, but it was in the back of my head the entire time. And it really made me miss Reaper. Good lord, this is getting long and I haven't said anything about what I actually liked. I do think the series has potential. While I didn't connect with Sam, I still liked him, though I think my favorite character was Brid. Douglas was certainly an evil and malicious guy and I liked that he had an incredibly dark side to him. I'm especially curious about James though, as he seemed possibly grey-ish. Some of the other side characters towards the end intrigued me as well and I'm looking forward to what awaits them in the next book.The end wasn't completely fulfilling though it's not a true cliffhanger so that won't annoy people who hate those with a passion. The story held my attention, I didn't actively hate anything, and I want to know what happens next. It wasn't a perfect book by any means, but I liked it enough to want to continue the series.I also have reviews for the two short stories that McBride wrote: Heads Will Roll (Necromancer, #0.1) and Necromancer: A Novella (Necromancer, #0.5)."}, {"userName": "Catie", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/1886642-catie", "userReview": "[image error]"}, {"userName": "Tadiana ✩Night Owl☽", "userReviewDate": "Dec 22, 2014", "userURL": "http://www.goodreads.com/user/show/8734459-tadiana-night-owl", "userReview": "2.5 stars. I think, for me, Lish McBride's brand of humor works better in small short-story-sized doses than in a full-length novel. We start out this story with an aimless young man, Sam, aimlessly working at a dead-end job in a fast-food restaurant, horsing around with his friends and hating his job and cracking jokes to the reader about his job and life in general. This goes on for two or three chapters, and by then I'm starting to mentally check out because aimless young guys are not even close to my thing any more, if they ever were. Things start to pick up a bit when a dangerous guy shows up in the fast-food place and immediately and inexplicably takes issue with Sam living in the same town as him. But then--other than a murder of one of Sam's co-workers, which results in a smart-mouthed talking head--the excitement level subsides again, as we spend the next several chapters going from place to place and person to person, as Sam tries to figure out who the evil guy is and why he hates Sam and what is it anyway about Sam that makes him such a problem for this nasty guy? This was a rather lengthy exposition and by now I'm seriously skimming because, frankly, I still don't really much care about Sam or his problems. Things get more exciting and interesting as the book moves along, but by then it was all just too little, too late for me. So, not really my cup of tea, but if you like broad humor mixed with urban fantasy, it might be yours."}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "I think I'm done with books starring contemporary male adolescent characters and the paranormal. The past 3 series I can recall have not been good:1. Lies Beneath: Calder, DUMBEST MERMAN EVER, I don't know how he manages to stay alive, much less breathe by himself on land2. Chronicles of Nick: smart-aleck mama's boy who's in way over his head3. Beautiful Creatures: 40-year old Southern spinster disguised as a teenaged boyHold Me Closer, Necromancer follows the terrible trend. Half the book so far involves random characters and not even Sam himself. You see, I have a quirk. When I read a book, I like knowing the bones first. Suddenly immersing me into 1000000 other characters, whom honestly aren't so likeable, is more likely to throw me off the book. Chronicles of Nick has the same problems. Too many supporting characters about whom I do not give a shit. This book has even more of the same problem, within the first 100 pages, probably 1/3 were about Sam and his life, then we get introduced to a random \"Douglas\" (yes, I know he's a major character) but he needs a better introduction, and some random people who are so forgettable I don't even want or care if they're in the rest of the book.I'm not fond of the titular character either. Smart-aleck boys who think they're too cool for school and going against the establishment are a dime a dozen in real life, and I don't really want to read about a similar douche in a book I want to enjoy.Not touching the rest of the series with a 15-foot pole."}, {"userName": "~Tina~", "userReviewDate": "Jan 02, 2011", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "TBR Reduce Challenge #17- 2011 (Stefanie) Do you know when you look at a book, stalk the reviews and then decide to take a chance and figure, why not? I'll give it a shot. Well, I figure I'd give this book a chance, but what I didn't expect was that awesomeness actually lives in these pages!First off, I just gotta mention page 49! The head, butter knife and shampoo bottle? Best.Scene.Evah!!!! I laughed my F'N ass off so hard that it took twenty-five minutes to get through the rest of the five and half pages. So so so unexpected that it was freaken genius!!Hold Me Closer, Necromancer is a brilliant dark paranormal comedy.It's told by alternate pov's, starting with clueless-college-drop-out, Samhain Corvus LaCroix, a sassy were-hound named Brid and our evil villain, Douglas Montgomery, who has some serious power-hunger issues.This book has the most wicked scene of dark humor and while it does contain dark themes, I wouldn't classify this as a horror, or at least, my wuss-self was able to handle it just fine. I simply adore the way Lish McBride writes! Not only does she deliver a creepy mixed blend of paranormal-punks, but each and every single one of them are very defined with very solid roles. I loved how unique this book felt amongst the other paranorm's, it was creepy, sure, bizarre, definitely, but dame was it ever funny.This book flows. Not a single dull moment from the very first page till the very last. Oh, and I got a huge kick out of the song-title chapter names. Very cute, very creative!I loved each and every single one of these character, even the evil ones. Lots of wicked fun with these guys!You guys are gonna love Sam! He has the best personality, funny, quick wit that drips with sarcasm and a big genuine heart. The poor thing really gets his ass beat through out this entire book not to mention being lied to his whole life and completely clueless to what he really is, but he just keeps on pushing through to the very end. I just love that.I adore adore Brooke (giggles) a lot! She provided much entertainment and comic relief. Frank and Ramon were also very cool, and I'm dying to see what becomes of Ramon, that looks to be very interesting. Brid, Tia, Hailey and Ashely, love them all!But what I loved about each of them is that they took everything so nonchalantly, you would think it strange, but it just added to the madness of it all. So much fun!Bottom line, this book has it all my friends. It's fantastically creepy, has the most twistedly fun characters and the writing is pitch perfect.This book rocked and I simply can't wait to see more from this wickedly awesome world!A Brilliant escape!!"}, {"userName": "Robin (Bridge Four)", "userReviewDate": "May 03, 2013", "userURL": "http://www.goodreads.com/user/show/14105531-robin-bridge-four", "userReview": "If Sam hasn’t had a tough week I don’t know who else has. He had been attacked in an alley by someone/something, there is a talking head that he now has to tote around, someone claims he can raise the dead, there is a naked girl in a cage (well I guess that part isn’t all bad) and everyone seems to know more about him and his past than he does.Sam hasn’t ever really felt like he fit in. He is a college drop who works at a fast food restaurant, but at least he has his own place and doesn’t live in his mom’s basement. Through an odd meeting caused by a rogue potato he finds out that he is a necromancer and has the ability to see and summon spirits. That is when Sam begins to have the worst week of his life, now he has to figure out who he really is and how to control the power that he has. With the help of his fast food friends, a were-girl, and Ashley a harbinger of death the looks like a 10 year old catholic school girl he must solve the mystery before he ends up dead or worse.\n“Are we going where I think we are?” he asked.“Hell, yeah,” I told him, turning the key in the ignition. I steered the car toward the highway that would take us to my mother’s house. “And I hope she’s got a few good answers.”“I hope,” Ramon said, “that she’s made cookies.”I glared at him.“Don’t look at me like that. If we were going to interrogate my poor mother for whatever, you’d be secretly hoping she’d made you tamales. I’m just honest enough to admit it.”\nThis is a dark comedy but that said it was remarkably light and airy at times. I full out belly laughed more than once. I enjoyed the writing style and how quick the story progressed. Sam is quick witted and snarky which makes for some very fun dialog between him and his friends, even better dialog between him and his enemies. \n“Can you just tell them we don’t need Jesus, Girl Scout cookies, or whatever the Mormons worship, and let me lie here in peace?”\nEach character is different and add in a world full of werewolves, fey, witches, necromancers and evil lawn gnomes and it spells out nothing but fun fun fun. There is action, mystery and romance, not the I just met you but you are my soul mate I love you romance, but hey your cute I like you maybe we could make the best of this situation romance. I really can’t wait to see what is in store next for our hero Sam and see this world built up even bigger and better."}, {"userName": "Janina", "userReviewDate": "Jan 04, 2011", "userURL": "http://www.goodreads.com/user/show/3455554-janina", "userReview": "You are looking for a YA urban fantasy that is a bit outside the norm? You are tired of stories only revolving around a lukewarm love interest? You like it a bit macabre? You’re not looking for anything too serious, but simply want to have a good time? I think I’ve found the book for you …Simply put, this book was lots of fun! Talking heads, waffle-addicted spirits, double-agent next-door neighbours, were-bears, family secrets, powerful necromancers, resurrected Chinese pandas, talking cats, out-of-control werewolves, a tiny bit of romance, friends you can rely on – you name it, we have it. I loved the humour: slightly macabre and sarcastic, laugh-out-loud funny, but never overbearing, over-the-top hilarious. The most refreshing thing: this book does not take itself too seriously.Also liked the chapter headings inspired by song titles (and how they fit with the plot). The story itself it not necessarily the most original ever written, but the way it is written makes it special. It loses a little bit of its drive around the two-third mark, but I’m not entirely sure if that was the book or my Fever series induced exhaustion …The male voice was well done and believable in my opinion, and I couldn’t help but like Sam, our unlikely hero. A college dropout working at a fast food restaurant, fiercely loyal to his family and friends, he can’t help but feel overwhelmed by the situation he has manoeuvred himself into. He accidentally awakens his necromantic powers, only to be threatened and beat up by the local necromancer who wants to secure his district. The story is told in alternating points of view, but a majority focuses on Sam and how he handles his newfound and strangely dormant powers …Definitely recommended!"}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "4.5 stars. Being that Hold Me Closer, Necromancer is about a young man practicing the dark art of Necromancy, you'd think the book would be dark. Can I answer yes and no to this one? I'd almost call it a dark comedy of sorts. For a book about such an offbeat and bizarre subject, dare I say this was an enjoyably easy read? Because it really was. Something that I liked about this book was that it felt very gender neutral and could appeal to a multitude of ages. Even though the book is a YA, the main character is out of high school and absorbed in the working world, so it felt like an adult read without being heavy or overly descriptive like some adult reads are.If you've read Holly Black's \n and enjoyed it, then I'm pretty sure you'll vibe on HMCN. Here are some comparisons : Both stories have a male lead character. Both involve a taboo type of magic, and the characters are surrounded by people who are set out to use their abilities. Neither book is romance heavy, but there is a love interest. Both books have a decent amount of snarky humor. Both books were win. HMCN felt a touch older than WC since the main character was in high school for WC, but I think fans of one book would like the other, regardless."}, {"userName": "Crystal Starr Light", "userReviewDate": "Mar 03, 2013", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "Bullet Review:DNF at 24%.Sometimes books just CLICK. Humor, plot, characters, writing, whatever. And other times they don't.This doesn't click with me. Not a fan of the humor, characters are unappealing, plot seems to be your standard \"Special Snowflake finds out he's important\" type. The writing isn't terrible; it's more tolerable than 90% of Young Adult novels. But despite that \"glowing endorsement\", the plot lurches to a stop to dump flashbacks and character background that I wasn't even partially curious about (seriously, why should I care about Brand New Character Douglas's discovery of his necromancy powers at age umpty-scratch?). Oh, and one of the worse offenses about the writing: First Person POV interspersed with multiple Third Person POVs. First Person POV and I already have a love-hate relationship, but the only way to make First Person worse is to couple it with jumping to Third Person POVs for other characters. (Absolute worst? Do First Person PRESENT AND the Third Person POVs.)Certainly not the worst out there, but it's doing nothing for me. I tried reading the physical copy; DNF at 10%. Tried listening to the audiobook; bored out of my mind at 24% (and I skipped multiple times - a practice I hate to do on audio). I think I've given this more than a fighting chance.But hey, you may like. At the very least, there was ABSOLUTELY NO romantic plot in the 24% I read, which is a definite plus."}, {"userName": "Kogiopsis", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/1462364-kogiopsis", "userReview": "There isn't much that I want to say about this book which hasn't already been said by Vinaya, Flannery, Jillian, or Wendy. Actually, all I can think of is:- it was a great audiobook, and those who have trouble with the switches from first to third person narration might benefit from listening to the audio, since there are two different narrators.- Seattle FTW.- I would have given it four stars, but the ending was very sweet and poignant and I couldn't do anything but bump it up.- This would probably make a great movie, except for the flashbacks."}, {"userName": "Brittany (The Book Addict's Guide/Novelly Yours)", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/4471081-brittany-the-book-addict-s-guide-novelly-yours", "userReview": "Initial Impressions 10/26/15: So much fun! Loved the horror with comedy ... Or comedy with horror. That's exactly how I like my horror! The paranormal aspects were a blast, the characters were great, and it was a super quick & fun read!Full review as originally posted HERE on 12/21/15: When I first received FIREBUG as a review copy from Macmillan, I hadn’t realized it was tied into Lish McBride’s previous two Necromancer books. Once I did, I quickly purchased them and put FIREBUG on hold… and like many books I purchase, there they sat for a long time. When we designated HOLD ME CLOSER, NECROMANCER as an On the Same Page read, I was excited to finally dive in and it proved to be a really fun read just like I had hoped!NECROMANCER was the perfect read for around Halloween (which was when we read it for On the Same Page)! It was such a fun combination of paranormal, horror, and comedy (which is really how I like my horror… I’m such a chicken) and I instantly picked up on the humor. The levity of the tone made it a quick and easy read and if I didn’t have a reading schedule planned for the rest of the year at that point, I probably would have sailed right on through NECROMANCING THE STONE and FIREBUG too!NECROMANCER was a totally addictive read. The characters were so much fun and I adored Sam and his friends. They had a great report and always kept me laughing but at the same time, you could easily see strong their friendship was and how much they cared for each other. We also get to see some of Sam’s family when he goes to his mom and sister for help later on in the book and I really loved their bond as well. Each character really brightened the book and pulled me further into the story!I don’t really read a lot of paranormal and/or urban fantasy any more but when I do, this is totally my type. Usually it gets a bit silly when there are so many “supes” (supernatural beings, you know) but since NECROMANCER was already designed to be humorous, Lish McBride does a great job at combining all of these supernatural aspects into one book and is able to poke fun at some of the characters and how they come together. It actually came together really well for me and since I was already enjoying the comedy, I really had more of an “anything goes” attitude instead of trying to take the book more seriously and analyze why or why not something might work.This book was really so much fun and I love snarky and hilarious leads. Sam really carried the book and each character just made the book that much more enjoyable. I’m definitely a new fan of Lish McBride and I can’t wait to read more from her!"}, {"userName": "Crowinator", "userReviewDate": "Oct 17, 2010", "userURL": "http://www.goodreads.com/user/show/283407-crowinator", "userReview": "I had the hardest time writing this review, and I just decided to go ahead and post it knowing that I would never do the awesomeness of this book justice. This hysterical, scary, offbeat story about a slacker discovering his necromancer powers feels tailor-made for my tastes. For weird elements, it is a veritable cornucopia. It contains: a talking head, a (benign) zombie panda, a talking cat (who is actually a mini-dragon), homicidal lawn ornaments, sassy ghosts who love waffles, witches, weres, and an evil necromancer who makes his revenants do calisthenics just to prove a point. The book could have been a disaster, with too many quirky elements to succeed, but it has such heart that it works. I know this is terrible, but I often think of books in relation to television and movies. Probably because the only thing I do more than read is watch stuff. I think this is a mix of other witty but frightening and surprisingly touching horror-comedies, like Buffy the Vampire Slayer, Reaper, and Dead Like Me. I’m sure I could come up with more, but you get the point.One minute Sam is deep-frying inappropriate things at Plumpy’s, the fast food joint where he works, and playing potato hockey with his co-workers and friends Ramon, Brooke, and Frank; the next, he’s being called out by a necromancer (Douglas, who Sam calls a “madman in pressed jeans”) and forced to deal with the fact that his mother has lied to him for years about his powers as a “death wrangler”. Right from the outset, Sam was my kind of guy, when he wondered at how humankind spent thousands of years developing complex language systems only to create a cash register with pictures on it, “just in case the cashier didn’t finish second grade”. My feelings of love were cemented during the zoo scene, when he mentions that he never watches the news because “they just don’t make very good episodes of it anymore”. (Also, he doesn’t know what’s wrong with China, except maybe for some lead paint.) His deadpan, smart ass humor and pop culture references is what makes him so fun to read, but his underlying sweetness – his love for his friends and family – and his “why me?” plaintiveness is what makes him relatable. Also the fact that he gets the hell beat out of him countless times – that really makes you feel for the guy, too. The other characters are equally awesome and likable, even when they’re not in the story much (like hand-wringing Frank and nosy Mrs. W). A couple of them have their own viewpoint chapters (in the third-person; Sam’s are always first), and while it’s a way for McBride to tell more of the story than we can see from Sam’s perspective, it doesn’t feel like a cop-out. Sam’s relationships matter the most to him, so it stands to reason that the other characters have presence. I found myself really worrying about a couple of them during the story, which has its scary, gory moments in spades. Brid’s chapters, the were-hybrid captured by Douglas, are the most compelling outside of Sam’s, and I love the casual but caring turn their relationship takes (yes, I am talking about the sex). The only exception is Douglas, who is not supposed to be likable at all; it might have been more interesting if he had even one redeeming feature. The initial chapter from his viewpoint, where we learn his backstory, felt awkward, but none of the other third-person chapters from his viewpoint bothered me. The ending makes it clear that there will be (or at least, should be) sequels, which fills my heart with glee. I’m hoping for more Sam/Brid, for Uncle Nick to appear, for Sam to learn more about his powers (especially as they appear to cause him some mental anguish), for Ramon to be okay after his “transition”, and for Sam’s half-sisters to make an appearance. I can't wait for more!"}, {"userName": "Isamlq", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/4016030-isamlq", "userReview": "Every paranormal novel (romance or otherwise) that I’ve read in the recent past should have a star taken away because this book deserves five stars and then some. This book is how paranormal should read. I’m in love. I’m in love with Sam. I’m in love with this book. I’d even go as far as saying I’m in love with the author. Second, if this is the way Lish McBride writes, give me more! I love the certainty in Sam’s voice. He totally knows his life is going nowhere and with absolutely no pretense says as much. With a title like ‘HOLD ME CLOSER, NECROMANCER,’ I thought I knew what I was getting, but I was so surprised by it's humor, it’s darker feel, it's humor, it's edginess then by it's humor again! Said title was a bit off putting at first, but am I glad I got to read this! To reiterate: funny, dark and edgy. Remember Sophie from Hex Hall and Demonglass? Well, I love Sam for all the same reasons that I love her! Except Sam is so much more… He gets his ass handed to him time and time again but still picks himself up. And I think I love the author for creating a protagonist who talks and acts real. If he’s scared, he doesn’t pretend otherwise. If he is confused, he says so! Then his friends, each of them added something special. Brooke has a biting sort of humor, Ramon and Frank are always there. Then there’s Brid! I even love the bad guy in this one. Can I say ‘authentic,’ because that is what he was. He didn’t mess about but was simply bad! Is there a next one? Does she have other books? (Yes, I am becoming aware of the need to STOP GUSHING But I can’t!) I am definitely keeping my eyes open for this author's stuff. I LOVE this book! A must read!"}, {"userName": "Rachel", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/2805400-rachel", "userReview": "This book was so fun! don't listen to the reviews which say it's hard to follow. if you understand how flashbacks work, then you should be okay. and yeah there are a few characters. but this is a fantasy-horror book, the first in a series, so there has to be world building and character building. the story read smoothly and was full of twists and turns. loved it!!!"}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "This was a breath of fresh air book. I've read some disappointing books lately, and I needed a good one. Plus I was pining for a good UF read. I loved the easy writing flow, the funny dialogue, and the wonderful, self-deprecating hero, Sam. Although this was released as a YA book, I think it easily could have been marketed as an adult UF novel. I believe the older readers will enjoy it as much as teen readers because there is a lot to like in this book.McBride keeps her world-building simple, but simple doesn't mean lacking. She has an interesting reality here, with people born with magical abilities, specifically necromancers. Sam is one, but he doesn't know it, because being one is quite dangerous for him. His normal, rather boring, letdown life explodes into one of extreme danger and dread as he becomes exposed to a very dangerous, cruel, and evil enemy. Along the way, he becomes aware of a supernatural world with its own rules. He finds out that there are a lot of creatures out there that he didn't even know existed. That is one thing I love about UF--the normal is really far from normal when you take a close look around you. Sam is the everyman that you like and feel protective of. He has a rough journey in this book, but he weathers it all with grace and takes a lot of crazy stuff in stride. I respected him for that. I also liked his friends, specifically Ramon and Brooke. I liked Brid too. She is pretty darn kickbutt. Sam's mom is a sweet lady, and I would like to learn more about Sam's longlost uncle. He seems cool.I think McBride has all the right ingredients in this story, but it doesn't add up to 'formula', but instead a fun, enthralling, sometimes scary and thrilling, and very enjoyable read. The quote on the cover by Sherman Alexie is so true. This book is both scary and funny, and a good balance of both. I am a big fan of snarky dialogue in books, and she does it well. I loved all the pop culture jokes. They were hilarious! I was quite impressed with how McBride reveals the menace of the villain and his heinous acts without going overboard. Poor Sam and his friends are truly in jeopardy, but you manage to catch your breath with some good laughs along the way. I was very satisfied with this book, and even if it's a one-shot, I am still happy. If she continues the series, I'd be even happier, because I do see some threads that I would love to be explored further. Although McBride does a good job of making this a self-contained read that stands on its own (cliffhangers are a freaking enormous pet peeve of mine), I could easily see her going back and writing more in this world.I do recommend Hold Me Closer, Necromancer to UF fans of all ages. I think they'll enjoy it.Overall rating: 4.5/5.0 stars."}, {"userName": "Bonnie", "userReviewDate": "Jul 01, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "This book was great, highly enjoyable, and extremely funny. And it had EVERYTHING! Usually when an author throws in an odd assortment of paranormal creatures it tends to get a little messy and slightly corny; however, Lish McBride totally made it work. I mean we’ve got some necromancers, werewolves, zombie pandas, lawn gnomes came to life and poked people with tiny shovels, there was a tiny flying dragon, and even a talking severed head. As Sam states so eloquently, “Once a severed head talks, life’s possibilities seem endless.”This was a thrill ride and highly addictive read... it may have taken me forever and a day to finish this but only because of my current schedule so don’t let that deter you. The best part about this book were the characters… these were people that you totally wanted to personally befriend. Brooke was my favorite because she was a total smart ass and full of spirit. The main character, Sam, was awesome and very realistic as far as paranormal stories go. This story was really about him finding himself and who he is (after feeling lost for so long). His is a great story.This book doesn’t have any cliffhanger or anything even though this is the first book in a planned series. The next book comes out May 2012 so mark your calendars! (And get this one read ahead of time). :)"}, {"userName": "Mitticus", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/4765800-mitticus", "userReview": "[ en serio que eso de seguir siendo pareja despues del sexo en la jaula más parece una medida de Brid y su padre para tenerle cerca porque es un idiota poderoso, y más que nada una bala al aire porque no tiene idea de lo que esta haciendo) (hide spoiler)]"}, {"userName": "Jessica", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "Awesome, awesome, awesome!Man, I loved this book so much that I'm facing the usual problem. What to say about it? I think what I liked best about this was the humor. I was killing myself laughing several times while reading.Though the story is told from multiple POVs, or well, there are some chapters told from a POV other than Sam, our 23-year old college dropout is still our main protagonist. We mostly spend our time in his head and let me tell you, it's awesome there! Sam is great, he's a good, honest guy with a dry sense of humor and he calls things as he sees them and I don't know how to say this any better but he just felt real. What I also loved were the secondary characters. McBride managed to let them all grow on me almost as much as Sam.I'm definitely expecting a sequel here. Don't worry, there's no cliffhanger ending but I feel like Hold Me Closer Necromancer was just the introduction to this great world McBride has created and there are so many plot strings left untied that there just has to be another book.This was weird and macabre and hilarious and absolutely awesome! Definitely recommended!"}, {"userName": "Ash Wednesday", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/10484016-ash-wednesday", "userReview": "[her head have died too when Douglas got killed? And if she didn't isn't that a big chunk of a clue that he ISN'T dead? (hide spoiler)]"}, {"userName": "Eric", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/2786617-eric", "userReview": "First let me say that I find it a bit weird that I hadn't realized how starved I was for books like this. I know I've always been a fan of the smart, witty, dark humored variety but really it hadn't occurred to me until I picked up the short story Death and Waffles (Necromancer: A Novella). Once I knew what I was getting myself into I pretty much as quickly as time (my bandwidth) would allow Audible to download the book for me started listening this and LOVING EVERY MINUTE!I really liked (a) it wasn't all boy meets girl (b) everyone was still a person (c) even when things were crap there was still sarcasm on Sam's side :-) Honestly, I was so much of fan of this book I knew pretty much 20 minutes in that when it was over I was going to be so sad cause there wouldn't be any more to read. That said I'd start raided other peoples shelves on GR to find more books like it (thank you Flannery for Paranormalcy it's right up my alley).Oh yeah that book, you've came here for a review right? This one's got everything, necromancers (...), vamps, shifters, even a harbinger (whom I hope you already know and love). Everyone is pretty much trying to get along, doing their own thing, living among all those boring humans. Having jobs and all (hehehe) except for this one badass who apparently has been killing not so random but pretty specifically in fact so until someone figures out what todo about that they're all up the creek...Like I said it's fun and witty - with loads of fun moments that will have you laughing. I must say as for audiobooks this one is great because the voice of Sam has some artistic moments that shine. He really reads it very well. I won't spoil it for you but you definitely know where the emotion is.Currently I'm still getting my dark humor fix but when Lish McBride finishes up whatever is next I will be sure to take the plunge no matter what it's about, I don't even care if it's about emo fluffy cotton balls in denial, I'll be there. Hold Me Closer, Necromancer is a definite recommendation to all who are curious."}, {"userName": "Eunice", "userReviewDate": "Mar 24, 2012", "userURL": "http://www.goodreads.com/user/show/6078895-eunice", "userReview": "4.5 starsThis book is so much FUN! I love love love everything but most especially Samhain Corvus LaCroix! I tell you, I'm in love with this guy yeah, like I don't feel like that with most of the heroes I met. XD. Its like I met the guy version of Sophie Mercer (Hex Hall)! This dude made me all laughing from the first page to the last and even on worst situations. While this book offered lots of good humor it also gave a very good side of dark and paranormal stuffs. I love reading books with male protags but I tend to be really picky about them. But when I heard that this gave off the same aura as White Cat, which is one of my favorite series with male lead, it definitely caught my interest. I'm not sure about it though when I started reading it but when Sam started using his smart-mouth, oh boy, I realized I gonna love it big time. Sam's character is very appealing and admirable. I like how he talk about things and handle stuff, he knows who he is. Oh wait, no. He didn't know he's a necromancer before - more like he's honest about himself. He acts with no pretense and admits things he's capable of and what he's not. And most of all, he's smart-mouthed. His snide comments and witty comebacks had me all laughing out loud. His relationship with his friends - Ramon, Frank and Brooke - was also really adorable and funny. I love how much he cares for his love ones.This is the book where you're gonna love almost all the characters in it. You'll definitely take notice with everyone even if they don't share much exposure. Ramon and Frank were loyal and very reliable friends. Brooke, I adore her so much! She's funny and definitely a strong character. Bridin, I thought when Sam met her she'll intimidate him but she didn't. She's actually sweet and very supportive but also a tough and brave character. Then Ashley too! I just really love that girl! Even the villain here, Douglas, is an interesting character.The paranormal stuff is very entertaining and intriguing. I love the idea of hybrids, the were-hounds, the hybrid between werewolves and fey. I also think that what made Sam powerful is because he's also a hybrid between a witch and a necromancer. I'd love to discover more of these paranormal creatures and to see Sam's abilities develop on the next book. Oh yeah, and I'd like to see what's gonna happen between him and Brid! ^^I highly recommend this book! This is a humorous and very enjoyable read with an interesting and amusing paranormal plot. I really had so much fun reading this! :))This review is also posted at Book Overdose"}, {"userName": "Victoria Schwab", "userReviewDate": "Dec 25, 2010", "userURL": "http://www.goodreads.com/user/show/1695365-victoria-schwab", "userReview": "Really had a blast with this one. Picked it up because of the title, but found the voice fabulous, and McBride's version of necromancers really compelling. Also, I LOVED the handling of Sam and Brid. Fresh, original, and enjoyable. Exactly what I needed."}, {"userName": "Laura", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "Where is the number one place for finding severed heads? What makes pressed jeans SO creepy? And where can I get homemade waffles right now? These are just a few of the many fun questions that rolled around in my head and made me laugh while reading Lish McBride’s Hold Me Closer, Necromancer.For me, the star of this show is the playful attitude and tone of the tale. The characters find themselves in some painfully awkward conversations and dangerous situations, but they always seem to come up with a smart-alecky, whip-smart comment or response. The story moved along and possessed a quick, sarcastic, fun, laid back feel and pace that made every page, adventure, interaction, and fall out of bed hilarious! The humor slowly eases the reader into this world of darkness, filled with creatures and magic. A world Sam has a connection with in his past and within himself.Our hero, Samhain LaCroix, is struggling to find his place in this world and a big missing piece of his life just fell into place. Sam along with his friends and family find themselves in a whole new world filled with all new kinds of dangers. Troubles even more terrifying than a life as a bitter fast food warrior fighting to survive the lunch rush with his soul intact! It’s a good thing Sam has his friends for support and to issue a good slap upside his head!Even with all the sarcasm and smart-ass comments, the love and warmth all the characters feel for each other jumps off the page. I truly adored every character and how their love, loyalty, and pride shined through in every situation. Sam, Ramon, Frank, Brooke, Brid, Haley, the Moms, and so many more were the back bone of this book for me. I just knew and felt they all had each other’s backs! A small to “could-develop-into-a-huge” crush has begun to burn for Sean! Hehe….He made me giggle and he wasn’t even in there all that much! Can’t wait for more scene stealing from that guy! :DOne of my favorite aspects of horror and fantasy is the “yes-we-have-been-right-here-in-front-of-your-face” angle. This tale does a beautiful job of creating a matter-of-fact vibe about the whole monster world with leaders, councils, bitter rivalries and even paperwork under the surface of everyday society. Sam is so “yeah-so-what” about the whole hanging out with werewolves, fairies, seers, and the undead. It makes me giggle. It notches up the pay attention to your surroundings to a whole new level. I so want to gossip about some of my favorite parts, but I feel like even explaining the setting will spoil some of the fun. Readers should just dive in and discover the giggles all on their own!Raising and communicating with the dead is not all fun and games though. Several strong messages of loyalty, finding your way, and facing your past run deep through these pages. As we all know, history always has a way of catching up, repeating herself, or just plain beating the sense out of us eventually if it is not dealt with. Sam must find his past before he can fight for his future.My only disappointment with the book was the big confrontation. I felt like it lacked bite! Come on! That’s all you got for me? The scene and Douglas himself felt a little reigned in at times, but that could just be my bloodlust calling out. Next time—I hope Ms. McBride knows her readers can take it. Bring it on! Have fun with Necromancer and all the gang! I cannot wait for more!**Two very important side notes**I LOVED the shout out to Calvin & Hobbes! I am so happy I am not the only one missing those two. *sigh* The comics were never the same after they left.The severed head question….my guess for the number one spot and where I would hide one is the microwave! Hehe :D It’s not just for popcorn anymore!"}, {"userName": "Merril Anil", "userReviewDate": "Jul 05, 2015", "userURL": "http://www.goodreads.com/user/show/20903756-merril-anil", "userReview": "This is fantastic I had so much fun reading this book. It is definitely one of favorite books now after having such an amazing time reading this. In fact this book was so good for me that merely into ten pages and I had already placed the order for the second book. Imagine!! in just 10 pages I was floored by the bookThis is my first experience with the topic of necromancy and what an experience. I love how the book is not all about educating and spreading more light on the concept of necromancy but rather it’s a light hearted story of a teen boy who gets hit by dangerous circumstances and is fighting with all he has got. The beauty of the book is its simplicity and maybe if somebody does not like this book then perhaps their reason would be the same that it was too simple for them but personally I loved the book for this same reasonFrom the start to end, the book never complicates or loosens its grip on you. The character unlike other books only gets better and bolder as you progress. You start falling in love with the central character for his wit, humor, sarcasms and goofiness. With very gentle treatment the author has told an exciting story and I wish badly that this could be made into a movie as on big screen this book could be an amazing adventure. A fantastic book from start to end. The book is absolutely a fun ride with lovable characters .Humor is seamless and tickles the funny bones quite warmly. The entire book for me is simplicity personified. It is elegant, smooth and has got friendly characters and a story that is told with the warmth of a bedtime story. This is one of the books that you can pick up if you are feeling down and want some light and funny read to cheer you up. I am in love with this book and I am sure I will love to read this book again and again at any given time because I loved the central character that much. Funny, cute and adorable."}, {"userName": "Regina", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "This book is so much fun. If you think (like I did before I started this book) that urban fantasy has done everything it can and there is no book that can take on urban fantasy in a fresh and interesting way - -then you need to try this book. Hold Me Closer, Necromancer has what you would expect of an urban fantasy series: werewolves, harbringers, necromancer, witches, supernatural councils, misunderstood power, dragons (yup!), gnomes (uh huh!), ghosts, zombies, the fae, and one higher entity demon type creature. It also includes a group of young adult friends (some in college and some not) and very very funny dialogue. Even though the book is funny and light, it also has a darker side. The magic at work is dark and grim. But Sam, the main character, comments on everything happening in a sarcastic and funny way. Bitter and sweet together. Hold Me Closer, Necromancer was exactly what I needed both to give me hope that I am still a fan of the urban fantasy genre and to just have fun with a book. I recommend this book for fans of urban fantasy genre and young adult books."}], "description": "Sam leads a pretty normal life. He may not have the most exciting job in the world, but he's doing all right—until a fast food prank brings him to the attention of Douglas, a creepy guy with an intense violent streak. Turns out Douglas is a necromancer who raises the dead for cash and sees potential in Sam. Then Sam discovers he’s a necromancer too, but with strangely latent powers. And his worst nightmare wants to join forces . . . or else. With only a week to figure things out, Sam needs all the help he can get. Luckily he lives in Seattle, which has nearly as many paranormal types as it does coffee places. But even with newfound friends, will Sam be able to save his skin?", "title": "Hold Me Closer, Necromancer\n      \n          (Necromancer #1)", "url": "http://www.goodreads.com/book/show/12354691-hold-me-closer-necromancer", "average": 3.93, "cover": "https://images.gr-assets.com/books/1434527732l/12354691.jpg", "reviews": 2008, "authors": [{"url": "https://www.goodreads.com/author/show/3484883.Lish_McBride", "name": "Lish McBride"}], "type": ["Young Adult", "Fantasy", "Fantasy", "Fantasy", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/12354691-hold-me-closer-necromancer", "http://www.goodreads.com/book/show/8041873-hold-me-closer-necromancer", "http://www.goodreads.com/book/show/9680287-hold-me-closer-necromancer", "http://www.goodreads.com/book/show/13131305-hold-me-closer-necromancer", "http://www.goodreads.com/book/show/9463117-hold-me-closer-necromancer", "http://www.goodreads.com/book/show/13409145-necromancing-the-stone", "http://www.goodreads.com/book/show/16117921-firebug", "http://www.goodreads.com/book/show/10151346-necromancer", "http://www.goodreads.com/book/show/16093689-heads-will-roll", "http://www.goodreads.com/book/show/23310689-pyromantic"]}