{"ratings": 1270, "userreviews": [{"userName": "Gerhard", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/40517871-gerhard", "userReview": "This collection of short stories by the late Canadian broadcaster Stuart McLean is the literary equivalent of a helping of strawberries and cream, or perhaps an ice-cold beer on the hottest day of summer. I cannot for the life of me imagine any reader not being bowled over by these amiable and extremely funny tales of the everyday ups and downs of a perfectly ordinary Toronto family. The period covered stretches from one Christmas to the following winter (hence the subtitle A Year of Stories.) Each season of the year in question is allocated a number of stories. This adds to the realistic flow of the book, as we accompany the family from Christmas to Christmas. And what uproarious and catastrophic yule tides they prove to be -- from the hapless head of the family Dave left in charge of the preparation of the turkey (an aparently simple operation that soon threaten to turn into a major disaster), to a rum-spiked bowl of eggnog that finds its way into the circle of children innocently pursuing their own harmless festivities in the basement. Dave is the owner of the Vinyl Cafe (apparently the smallest record bar in downtown Toronto.) His better half Morley is a housewife at first, but later enters the work market as the manager of the Century of Wind Theatre Company. The rest of the family consists of sixteen-year-old Stephanie and seven-year-old Sam. The stories introduce us to various neighbors and friends who feature in the sometimes true-to-life, sometimes farcical adventures that befall the family. Particularly delightful is Kenny Woo, owner of Woo's Scottish Pies -- a true friend to Dave and the one who has the record store owner's back at all times. Kenny is the one who comes to Dave's rescue when the latter is in serious trouble after his caring for a neighbor's iconic sourdough starter goes sidesplittingly pear-shaped. There are also wonderfully detailed vignettes concerning Dave's and Morley's parents, and richly rendered flashbacks to their own chidhood years, disastrous teenage dates, and the story of how they first met. All of this ensures an extremely easy and palatable mix, leaving the reader in a more-or-less continuous state of hilarity, while being superbly entertained by the author's sparkling wit and inventive storytelling. So persuasively is the world of this one family presented that most readers will end up convinced that they know these likeable people as intimately as they know their own families. Highlights include young Sam's birthday party where a planned sleepover is ruined for ten little boys as a result of the wrong choice of movie, Dave's surreal encounter with a wilfull blood pressure reading device, and an unenviable situation for our hero while on the roof of his house in sub-zero conditions stringing up Christmas lights. Stuart Mclean wrote a string of best-selling books about Dave and his family, besides creating a popular Canadian radio program featuring more of the same. Not being Canadian, this is my first encounter with this phenomenon. I thank my lucky stars that I listened to my gut feeling when I saw this volume sitting quietly and unassumingly on the shelves of my favorite second hand book dealer. It has given me untold pleasure and will continue to do so in retrospect."}, {"userName": "❀ Susan G", "userReviewDate": "May 01, 2017", "userURL": "http://www.goodreads.com/user/show/7820199-susan-g", "userReview": "Last year, our book club experienced challenges as we tried to find a \"happy\" book to share. If only we had thought of reading a book from the Vinyl Cafe collection of short stories, we would have had a fun discussion! The stories are 'laugh out loud' funny and tell the stories of Dave, Morley and their children, Stephanie and Sam. These heartwarming tales and descriptions of every day antics leave the reader smiling and reflecting on their own family situations.Many CBC listeners will have listened to Dave tell the stories on the radio but they can also be enjoyed in a series of books. Home from the Vinyl Cafe: A Year of Stories starts in the Winter with the story of Dave's challenges cooking the Christmas turkey and ends the following winter with Dave's escapades as accidentally mixed up the adult and the children's punch bowls of egg nog! My favourite was The Birthday Party which took place in the spring when Dave was left in charge of his son's birthday party. The story began with an incident at the liquor store when Dave left in a huff. When he realized that he had left his credit card behind, he didn't want to face the clerk so he cancelled his card rather than returning. This started an avalanche of issues - the vegetarian boy ate meat pies, the partygoers watched a scary zombie movie and there was a lumpy cake baked by Dave. The sleepover culminated with all but one of the kids being picked up in the middle of the night which is a situation that many parents could identify with!As a cat lover and parent, I could certainly relate to the Road Trip story when the cat accidentally ended up in the car. I was literally laughing out loud reading A Day Off when the couple played hooky from their jobs only to have Dave's mother in law arrive to take care of them. These every day stories promote laughter and pleasant reflection.Unfortunately, Stuart McLean passed away this past February at the age of 68. He died of melanoma but his stories will be enjoyed by Canadians for years to come. He had told his tales at the Sanderson Theatre in Brantford a few years ago and I will always regret missing this opportunity. If you are looking for a quick pick me up, add a Stuart McLean book to your collection and experience his short stories one day at a time!I am looking forward to discussing Home from the Vinyl Cafe and Vinyl Cafe turns the Page at tomorrow night's book club. It will be fun to see which books and stories are discussed as we share our favourites!"}, {"userName": "Gene", "userReviewDate": "Nov 06, 2007", "userURL": "http://www.goodreads.com/user/show/295765-gene", "userReview": "These stories made me simply, deeply happy.\"To be that close to a face with that look is something that you never forget. She was sitting on the couch talking to Michael when she noticed that his glasses had begun to fog up - for no apparent reason - and he seemed to be out of breath. Which struck her as peculiar, because he wasn't moving. He was just sitting there with his arm around her shoulders. She wasn't sure how it got there. Then she realized his face, with that faraway look, was moving closer and closer, and she knew what was happening and she knew that it had nothing whatsoever to do with her. It could have been any girl sitting there beside Michael. She just happened to be in the wrong place at the wrong time - it was like a traffic accident. She didn't dare move, not a muscle, even though the arm of the couch was digging uncomfortably into her back. She was afraid if she even shifted, Michael might take it as a sign of passion. And things could get worse\" (32-3).How am I just discovering McLean? I feel like I'm late to the party, and I'm kind of pissed about it."}, {"userName": "Karyl", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/1462387-karyl", "userReview": "I'm not really one for short stories; I want a book with a single plot. I feel like short stories are sort of a rip-off because you get so invested in them, and whammo, they're over, just like that. But this book is ideal. Yes, it's a collection of short stories, but they all revolve around the same family, so you get to know everyone over the course of a year. The night I started this book I stayed up till 1:30a and got halfway through it. It's a fun, quick, enjoyable read, and I found myself laughing out loud several times. Highly recommend."}, {"userName": "Joe", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/19582217-joe", "userReview": "Like eating a bowl of warm homemade soup. But as a book."}, {"userName": "Ken", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/579935-ken", "userReview": "Sometimes you never know what you might find in the bargain bin. I grabbed this about a year ago because I liked the title (shallow, I know). Motivated by my personal history as an obsessive LP collector I was lured to the \"Vinyl Cafe\" for whatever stories were available. Turns out, Stuart McLean is Canada's answer to Garrison Keilor. The book is loaded with heartwarming short stories that are all centered around a single family facing many of the same life challenges we all experience, only its written with a folksy wit that makes it fun and fresh. Upon further exploration I discovered that the author, Stuart McLean, broadcasts a weekly show where he tells his stories and invites musical guests. Several \"Vinyl Cafe\" podcasts are available on iTunes for free. I highly recommend checking them out if you enjoyed even one of the stories in this book. I've listened to several and you can't help but laugh out loud or be touched.  All in all, a nice discovery."}, {"userName": "Devin Tait", "userReviewDate": "Apr 16, 2008", "userURL": "http://www.goodreads.com/user/show/98478-devin-tait", "userReview": "I got this book for Christmas and had several other books in line ahead of it. When I started it, it seemed a little dry and difficult to get into. However, once I had read a few chapters and became acquainted with the characters it was a very fun, lighthearted read. The four family members each have their own unique personalities and each chapter tells the story of some quirky incident that one or all of the family members are involved in, and include many flashbacks that are interesting and add perpective and humour. I read the majority of this book while on vacation in Mexico - it was an odd juxtaposition to be reading a book set in Canada while on the carribbean."}, {"userName": "Felicia (Little Prairie Library)", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/6549324-felicia-little-prairie-library", "userReview": "This entire book was a delight to read, from the first page. Stuart McLean really is a master storyteller. He has created characters and a community that make you feel like you're a part of it. I love every character, and reading about their escapades. At one point I was laughing so hard that I was crying! I don't think a book has ever made me laugh that hard before!"}, {"userName": "Pam Shope", "userReviewDate": "Aug 01, 2014", "userURL": "http://www.goodreads.com/user/show/10285446-pam-shope", "userReview": "absolutely loved this book! story is written as a year passes by in the life of the main character and his family. almost fell off the chair laughing about cooking the turkey and the squirrel on the bird feeder."}, {"userName": "Rebecca Woodall", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/9440182-rebecca-woodall", "userReview": "Wonderful stories for every season. A must-keep book for me which is rare. As the stories are short, I can see myself reading some again (or at least lending it out to others). Having heard Stuart McLean on the radio it was great to read a whole series of stories."}, {"userName": "Amber", "userReviewDate": "Jun 01, 2011", "userURL": "http://www.goodreads.com/user/show/182082-amber", "userReview": "What a fantastic book! I loved every minute of it. Laughed out loud throughout and also teared up a few times. I need to find more of these books!"}, {"userName": "Nina", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/19141256-nina", "userReview": "I'd heard most of these on the radio programme, but it was still a good collection."}, {"userName": "Sheena", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/5172305-sheena", "userReview": "Loved. What more can I say? I can always count on Stuart McLean and Dave and Morley's family to entertain me!"}, {"userName": "Vionna", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/2186601-vionna", "userReview": "I just loved this book - the stories are humurous and homey - a nice pick-me-up!"}, {"userName": "Sarah", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/14404226-sarah", "userReview": "This book wasn't my usual genre of reading. But that doesn't mean it wasn't written well. The author provided some nostalgia from my childhood and there were a few stories that made me laugh out loud and the rest were enjoyable anecdotes.Reading this book was like going to a series of dinner parties and being entertained by a host and hostess that knew how to tell the mundane aspects of their lives in a humorous way. Sometimes the stories were funny, sometimes sweet, and sometimes made the hosts look good as people.You don't really get to know the characters, or find out why they do what the do. It's just a series of snapshots from their lives. I gave it a three out of five because the stories were well written and fun, but as I said, not my typical genre, and there was nothing enlightening, or thought inducing about the stories (for me).I won't read any from this series, but would recommend this book to people who enjoy this genre."}, {"userName": "Paul Ferguson", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/21756617-paul-ferguson", "userReview": "Bittersweet because I can't read anything more by Stuart. I like when an author becomes a friend through the ink and paper, whether it would or could have happened in real life or not. His stories and characters are sometimes me and often people I know and have known. Read it, you'll have no regrets. Listen to some podcasts too, perfect for road trips until your eyes get a little blurry."}, {"userName": "Brice Fuqua", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/69731752-brice-fuqua", "userReview": "Humorous stories about a couple who own a used record store in Toronto. These stories originated as radio monologues on a Canadian show similar to A Prairie Home Companion. Anyone who enjoys Garrison Keilor's stories will love these."}, {"userName": "Kristal", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/12056885-kristal", "userReview": "Another great collection of short stories! This one has his most famous story, \"Dave carves the turkey\". I found myself laughing out loud in public. Stuart McClean has become my go to for easy, funny fiction."}, {"userName": "Lila", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/27846964-lila", "userReview": "Light slice-of-life essays that probably work better on radio, where they have been aired. This is an humorous view of Canadian family life in Toronto. I have never heard the radio broadcasts nor read earlier works, so I am at a disadvantage. Sometimes the humor works, sometimes it doesn't."}, {"userName": "Wendell Hennan", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/26997520-wendell-hennan", "userReview": "A delightful of Dave and Morley stories organised in the seasons of the year and ending with the neighbours Christmas Party where the adult and kids punch bowls got mixed and the final story, Sam's jock strap for hockey. Like spending a half hour with Stuart again on CBC. RIP Stuart."}, {"userName": "Jena", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/70547472-jena", "userReview": "I love this book. It is so simple and sweet. Reminds me a lot of my childhood. Definitely a good book to read if you're really busy and need something quick and happy."}, {"userName": "Ray Zimmerman", "userReviewDate": "Jan 06, 2018", "userURL": "http://www.goodreads.com/user/show/21889207-ray-zimmerman", "userReview": "The book is a great read, and I really enjoyed the stories, but not as much as I enjoyed listening to the broadcast on his radio show. Several of these were featured there as well as in the book."}, {"userName": "Kristen", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/79725820-kristen", "userReview": "So funnui. Il mel ha!"}, {"userName": "Gaurav Bose", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/66779452-gaurav-bose", "userReview": "Such tasteful and good natured humour about oh so ordinary everyday life is a rarity."}, {"userName": "Kristal Turner", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/48766578-kristal-turner", "userReview": "A quick, but incredibly excellent read."}, {"userName": "Norman Weatherly", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/59932827-norman-weatherly", "userReview": "Another slice of Canadiana that seals Stuart McLean's status as an icon of Canadian literature."}, {"userName": "Mary Mackie", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/42480205-mary-mackie", "userReview": "Whimsical but thought provoking. I really enjoyed it"}, {"userName": "Christen Lee", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/22453325-christen-lee", "userReview": "This collection takes you through a year in the lives of Dave and Morley and the kids. All the major holidays and seasons are in here! It starts with the story of when \"Dave Cooks the Turkey\", and finishes with the story of \"Polly Anderson's Christmas Party\", so you know you're going to have a great time! Rest in Peace Stuart McLean <3"}, {"userName": "Heather", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/8358599-heather", "userReview": "Stuart McLean was an amazing author and he will definitely be missed. I loved this book and I love the Vinyl Cafe. The stories make you laugh out loud and you grow to love the characters."}, {"userName": "Jesse Hill", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/51969226-jesse-hill", "userReview": "This second collection of Vinyl Cafe stories is chock full of classics. The stories in this book follow Dave and Morley and the kids through the seasons starting with \"Dave Cooks the Turkey\" through spring, summer, and fall, wrapping up with another couple winter stories. Heartfelt and poignant, yet always humorous there were plenty of times I couldn't stop smiling while reading this book and even a few when I couldn't help but laugh out loud. Stuart McLean was one of a kind and he will be missed."}], "description": "Welcome to the world of the Vinyl Cafe. Meet Dave, the proud owner of the world's smallest record store. Meet his pal, Kenny Wong, who runs Wong's Scottish Meat Pies. Meet Dave's wife and their children. Watch while they all bump and stumble through a hilarious year of mistakes, miscues, misunderstandings, and muddle.The adventures begin in December with Dave's disastrous yet inspired attempts to cook the family turkey. And they move through the seasons to the following Christmas's fiasco, when Dave accidentally spikes the kids' punch bowl at his neighbor's Christmas soiree.Home from the Vinyl Cafe also explores the tender awkwardness of first love, the challenges presented by a dying guinea pig, and the answer to the question of why a teenager would rather eat vegetables and clean his room than go on a family vacation.Whether it's the mystery of sending kids to camp, the dangers of putting up Christmas lights, or the potential for mayhem at the grocery store, in the hands of humorist and master storyteller Stuart McLean the chaotic melody of daily life is underscored by the harmonious sounds of family, friends, and neighbors.Warm, witty, and moving, these stories will walk right into your life and make themselves at home.", "title": "Home From The Vinyl Cafe: A Year Of Stories\n      \n          (Vinyl Cafe #2)", "url": "https://www.goodreads.com/book/show/1022331.Home_from_the_Vinyl_Cafe_A_year_of_stories", "average": 4.12, "cover": "https://images.gr-assets.com/books/1180302922l/1022331.jpg", "reviews": 157, "authors": [{"url": "https://www.goodreads.com/author/show/8363.Stuart_McLean", "name": "Stuart McLean"}], "type": ["Fiction", "Short Stories", "Cultural", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/1022331.Home_From_The_Vinyl_Cafe", "http://www.goodreads.com/book/show/1022332.Home_from_the_Vinyl_Cafe", "http://www.goodreads.com/book/show/632610.Home_from_the_Vinyl_Cafe", "http://www.goodreads.com/book/show/6903594-home-from-the-vinyl-cafe", "http://www.goodreads.com/book/show/7217903-home-from-the-vinyl-cafe", "http://www.goodreads.com/book/show/1022330.Home_From_The_Vinyl_Cafe", "http://www.goodreads.com/book/show/1022329.Stories_from_the_Vinyl_Cafe", "http://www.goodreads.com/book/show/13384.Vinyl_Cafe_Unplugged", "http://www.goodreads.com/book/show/13388.Vinyl_Cafe_Diaries", "http://www.goodreads.com/book/show/1591730.Secrets_from_the_Vinyl_Cafe", "http://www.goodreads.com/book/show/6923032-extreme-vinyl-cafe"]}