{"ratings": 1198, "userreviews": [{"userName": "Rick Roseberry", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/3844362-rick-roseberry", "userReview": "For those of us who grew up in the 1950s and 1960s in American suburbia, Elaine Tyler May’s Homeward Bound: American Families in the Cold War Era provides a walk down memory lane. While we all experienced the “duck and drop” drills at school and remember watching “I Love Lucy” and “Leave it to Beaver” on television, May has tied the international and domestic situations of the time together as cause and effect using her concepts of “containment” and “security.” She hypothesizes that when Truman proclaimed the doctrine of containment for international communism, the reaction of the American family was containment on the home front - containment of any dissent against the “American way of life” and containment of the fears created by a world fraught with uncertainty by a withdrawal into the nuclear family. She asserts, “With security as the common thread, the cold war ideology and the domestic revival reinforced one another.” (198) The United States looked for security from Soviet missiles, bombers, and nuclear warheads; the American family looked for security as well, from communists, homosexuals, divorce, childlessness, dissent, and nonconformity. “To alleviate these fears,” she contends, “Americans turned to the family as a bastion of safety in an insecure world.” (9) While we hear politicians yearn for the “simpler” and “traditional” way of life of the 50s and 60s, it is intriguing to note that May considers the era an aberration rather than a time of normalcy. She asserts that the period, sandwiched between the roaring 20s, the depression, and the reawakening of activism in the late 60s and 70s, does not represent the benchmark for American culture, but an era unique in its own way. Nor does she view this era as a return to Victorian ethos; her examination of the sexual mores of the day reveals that there was a containment of sexual expression to within the marriage contract and nuclear family rather than a repression of sexuality. May makes use of the Kelly Longitudinal Study (KLS) throughout the book. The KLS was a survey of the interaction between the ideals and the behavior of about six-hundred men and women who formed families during the 1940s and 1950s. E. Lowell Kelly, a psychologist at the University of Michigan, who was interested in the long-term personality development among married persons, conducted it. Of particular interest were the comments, written by the survey participants in their own words, describing their personal opinions about their satisfaction with their marriages and their sexuality. These comments, even more than the statistical data, seem to reveal that women were much less satisfied with the state of domestic affairs of the era. She makes the point that the nuclear family of the era, in spite of the nostalgia, may have not been as homogeneous as appears on the surface. While men went to often tedious and uninspiring jobs to fulfill their position as breadwinner for the family, women sometimes considered their “jobs” as homemaker and wife equally tedious and uninspiring. However, there was no other choice; married women who worked outside the home were ostracized and viewed with suspicion.While she well documents the paucity of opportunities available to women during the postwar era, other than marriage and family, her wistful “what ifs” appear unscholarly. She bemoans the “widespread challenges to traditional gender roles” brought about by the Great Depression and the Second World War that “could have led to a restructured home.”(5) “If opportunities had expanded,” she laments, “the number of women holding jobs would have risen dramatically. Viable long-term job prospects for women might have prompted new ways of structuring family roles [italics mine:]” (57)  May does, however, thoroughly document and establish her thesis that “the evidence overwhelmingly indicates that postwar American society experienced a surge in family life and a reaffirmation of domesticity that rested on distinct roles for women and men.” (6) Beginning with her initial chapter about “domestic containment” during the cold war, she carefully traces the evolution of the American family from the Great Depression, through World War II, and to the postwar era, which is the focus of her work. While she would have hoped that American society might have looked at the resulting increase of women in the workforce as a fundamental change in postwar society, the fact is that the increased participation of women was viewed as a temporary situation in reaction to crisis. To her chagrin, the domesticity of women became the norm, and the man became the undisputed king of his castle. May continues to tie her domestic and international “containment” theories together in the final chapter detailing the baby boomers’ coming of age. “As domestic containment began to crumble at home,” she maintains, “the antiwar movement gave rise to the first large-scale rejection of the containment policy abroad.” (210) She concludes, “It is clear that in the later years of the cold war, the domestic ideology and cold war militance rose and fell together.” (216)May’s book is an important addition to scholarship on the era. It was well written, documented, and researched. Her inclusion of photos and posters help illustrate her points. She statistically documents her premises as well as including numerous case studies. For those of us whose intellects were formulated during the postwar era, her book helps us understand who we are and from whence we came."}, {"userName": "Simon Purdue", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/60886254-simon-purdue", "userReview": "In Homeward Bound Elaine Tyler May seeks to explain the phenomenal rise of the nuclear family in post war America. In the years following the end of WWII marriage rates soared to all time highs, divorce rates dropped and birth rates exploded in what came to be known as the ‘baby boom’. Previous scholars had dismissed this societal reorientation as a product of the return to peace, but May argues that it was much deeper. Noting that a similar familial boom did not occur in the aftermath of the First World War, May argues that ‘nothing on the surface of postwar society could explain this boom’. Indeed she suggests that the reconfiguration of American society before and after the war- with the surge of women into the workplace and the earlier manifestations of a sexual revolution- made it more likely that marriage and birth rates would fall in peacetime. Thus instead of looking at the wartime/peacetime dichotomy that previous scholars have used, May examines the wider cultural milieu of the early Cold War to explain this search for security in the home and the family. Crucially May suggests that the generation that married and reproduced in the late 1940s and 1950s represented an anomaly in demographic trends, arguing that their children- those of the 1960s generation- had much more in common with their socially revolutionary grandparents than they did with their parents. At the core of May’s analysis is the suggestion that this familial moment was the product of a truly national anxiety and sense of insecurity. A new scepticism, fuelled by political scaremongering and a wariness of the fragility of postwar booms, led Americans to retreat to the security of the nuclear family. As these Americans were children of the great depression, the perceived dangers of postwar profligacy loomed prominently in the minds of many. Further, the fear of internal threats to the ‘American way of life’ and a perceived international instability on a new scale were pervasive (as demonstrated by McCarthyism and the red scare). This anomalous re-orientation of society was, May argues, a defence mechanism designed to reaffirm American values and provide a social and economic safety net. A wariness of the ‘decadence’ of New Deal politics and the perceived dangers of national overspending led to the rise of a new economic conservatism and with it a new self-protectionist form of social conservatism that sought to gain security in the family, rather than through the national project. At home as on the global stage, ‘containment’ was the name of the game. May’s book offers a surprisingly broad and deep exploration of the family in the early Cold War era. She accepts the distinctly white and middle class limitations of her study, arguing that African Americans were systematically excluded from the ‘promises’ of the new nuclear family through such policies as redlining, de facto segregation, and systemic racial discrimination. Her book argues that although the new post war social order promised the end of class stratification and a new mobility, it only served to bolster racial and gender stratification, creating the environment in which the new radicalism of the 1960s could foster and flourish."}, {"userName": "Teri", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/3052770-teri", "userReview": "This is a very interesting topic with very interesting information that some people might find dry but left me wanting to read more. Homeward Bound looks at the relationships of husbands and wives during the Cold War years. Elaine Tyler May uses data from the Kelly Longitudinal Study, which was conducted from 1935 - 1955. The KLS surveyed hundreds of married couples to get their thoughts on family dynamics including home life, work life, sex, and children. Attitudes obviously changed from the 30s to the 50s. The author put the data in context with the state of the nation throughout the Cold War showing how families changed and evolved. Attitudes on personal safety (the A-bomb / duck and cover drills / personal fallout shelters), dating, contraception, family roles (a woman's place is in the home....or is it?), and children were also discussed. There's no humor here but I thought the book was somewhat engaging but at times repetitive or just too much data being thrown at the reader. What was most interesting to me was to see how attitudes changed over time. What I came away with is that many people were unhappy in their marriages and often married due to social norms and pressures to \"have the ideal family life.\" Women hated being stuck at home to run the house when they had ambitions in life. They were expected to go to college to find a husband, then bail on school or any other thoughts on a career to have children, wait on their husbands, and run the house. Men simply treated women as lesser beings that were there to be at their beck and call. They were unequal partners who needed to stay at home and make sure the kids were taken care of and sent off to school. By the time the 50s and 60s rolled around, women began to find their voice and feminist attitudes began to challenge the old norms. Many of the survey respondent's comments were eye-opening and entertaining. This book will certainly make you understand how far we have come and how family life has changed since the Cold War.What I didn't get a feel for, was the diversity of the surveyed couples. That is, were they all from a certain part of the country? Were they all urban, suburban, or rural couples? Financial and educational status was lightly discussed, but I didn't get a feel for whether the respondents were representative of the whole country or a specific area. It may have mentioned it in the Appendix, but I missed it if it did. I did like that the Appendix included the survey that was given. Recommended for anyone interested in family dynamics post World War II."}, {"userName": "William", "userReviewDate": "Jan 31, 2012", "userURL": "http://www.goodreads.com/user/show/4733070-william", "userReview": "Perhaps my expectations were poorly formed, but I found the chapter which dealt with the aftermath of World War II, “War and Peace: Fanning the Home Fires,” to be somewhat uneven. May quite thoroughly lays out the occupational and economic changes for women workers both during and after the war. Her insight on the Women’s Army Auxiliary Corps (WAACS) and the Women Appointed for Volunteer Emergency Service (WAVES) is equally pertinent to a discussion of the contribution women made to the war effort. In fact, this treatment in particular could have been expanded to examine some of the very particular non-traditional roles women performed in military service at the time - for example, women serving as test pilots - which truly stretched the boundaries of mid-century notions of sexed occupations.However, May’s discussion of the challenges which faced returning male veterans, both in terms of their economic and occupational situations, as well as their medical, psychological, and educational/vocational needs, was, at best, perfunctory. Mention is made of male notions of the quintessential young woman waiting “back home” as a sustaining ideal during service abroad, with important attention allocated to the response of American women to this pressure placed upon them. This point deserved expansion, as the readjustment of returning veterans to post-war America was linked to the reception they received by the women they had idolized during the war. At the same time, wounds, whether physical or mental, sustained during the war would not only follow the veteran for many years after the cessation of hostilities, but would in fact influence family life, sometimes through drug and alcohol abuse, emotional distance, or anger and abuse problems. Finally, the generation of men which fought World War II became the baseline for American masculinity by which their sons, who faced the crucible of Vietnam twenty years later, were judged by themselves, their fathers, and American society. May leaves this particular facet of American family life sadly and critically undeveloped.This last item, the cementing of a particular notion of American male masculinity, is the other side of a coin well-developed by May - the seeming promise of expanded socioeconomic roles for women during the Depression and World War II which prematurely was curtailed with the return of American servicemen following the war. That May specifically references in her Epilogue, the post-9/11 “elevation of male heroism” as a “widespread invocation of traditional gender roles” without substantially connecting the popular perpetuation of these roles to their reification during the immediate post-WWII years and the early portion of the Cold War, and most significantly, the challenges to this perception which began in earnest around the Vietnam War. The heated political rhetoric, saturated with overtones of male virility, that surrounded the 2004 presidential election, which pitted John Kerry, a Vietnam War veteran decorated for combat valor, against a fellow Baby Boomer who rode out his generation’s crucible of masculinity in the Texas Air National Guard, should have merited some comment on the continuation of these distinctive Cold War gender mores into the Global War on Terror.The remainder of the book is a fairly useful contrast of the post-war \"ideal\" middle class, white American domestic situation with the actual lived experience of married couples matching that description, based nearly entirely on the Kelly Longitudinal Study (KLS), which surveyed precisely this demographic. May's book is rather shortsighted to contemporary eyes because it lacks substantive analysis of non-white couples, and particularly lacks enough focus on non-white women, a consequence of relying on the KLS.This last shortcoming, combined with a fairly alarming lack on analysis on the constrictive gender norms which trapped returning male WWII veterans just as effectively as women, limits the utility of May's work in this book."}, {"userName": "Nate", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/858334-nate", "userReview": "Elaine May’s Homeward Bound asks why Americans made so much of family after World War Two. The book makes an important contribution in that it historicizes the mid-20th century family. May notes that, and this certainly speaks to my own experiences growing up toward the end of the Cold War, it is widely believed that the 1950s was the last hurrah of a longstanding form of the family. In fact, the turn to family after World War Two was precisely that, a turn, a change.Homeward Bound starts relatively late in the period it analyzes, opening with the famous \"kitchen debate\" between Nixon and Kruschev. While it late returns to the 1950s, the book moves backward in time from the kitchen debate, focusing first on how the Depression and then the Second World War impacted family structures. Both events changed the participation of women in the workforce. Women worked more outside the home, which shaped attitudes and desires around women's roles in family and work. One central factor which fed into the creation the 1950s family was people’s perception of relative insecurity between the Depression, the Second World War, and the threat of nuclear annihilation after the war. Family became a way to achieve some feeling of security, and the drive toward family was in part a drive toward feeling secure. May stresses that other historical avenues were possible, even if they were ultimately not taken. By eroding men’s monopoly of the role as the so-called breadwinner, the Depression and Second World War could have given rise to a more egalitarian family as opposed to the traditional - though new - family of the 1950s. In some respects, the unfulfilled potentials of war time became an engine for reaction against those potentials. As May writes, “sudden emancipation of women during wartime gave rise to a suspicion surrounding autonomous women.” (77.) The book draws on a variety of sources, including movies, popular magazines about celebrities, demographic data, and a series of surveys conducted with middle class families about their satisfaction with and thoughts about their marriages. The surveys allow May a remarkable window onto might be an otherwise difficult to grasp part of life. They also allow her to tell people’s very personal stories about marital happiness and unhappiness. The surveys allow a look at aspects of people’s lives which are simultaneously uniquely individual as well as exemplary of larger social trends. \tMay’s work offers useful examples of how a historical argument and narrative can link issues of policy and attitudes in one part of society with other social and cultural sites, and use very different sources. May links feelings of insecurity during and after World War Two with the increasingly widespread view that women’s independence posed a danger to masculinity and thus to society. This could be a useful model for some of my on workplace injuries, law, and insurance in the early 20th century United States. I would like to look at the theme risk and security across policy debates over workers’ compensation, juries’ attitudes toward work, and popular perceptions of war. Just as May looked a gendered component of the Cold War and assessed the expansion and contraction of the range of opportunities for women, I would like to see if worker’s compensation programs ultimately offered more or less opportunities for women and disabled people."}, {"userName": "Robert Wood", "userReviewDate": "Sep 25, 2015", "userURL": "http://www.goodreads.com/user/show/18242471-robert-wood", "userReview": "May looks at the new structures of white domesticity that arise after World War II, in relationship to the cold war. She argues that these are new structures, in response to the pressures of the cold war and the radical activism of the 1930's, rather than a throwback to old forms of family. Although most of her work draws on the material from the KLS longitude study to see how middle class husbands and wives considered their positions in the family, the history shows how these structures were also a product of state policy, from subsidies for housing to a variety of other policies. She then maps how this structure partially collapses in the 1960's and 1970's, although not completely. Worth the read."}, {"userName": "Sarah", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/26770902-sarah", "userReview": "I had almost forgotten how good this book is. I just reread it because I assigned two chapters to my Postwar America class. Next time I will probably have them read the whole book, or at least I will add the intro in because it is solid. This is such a great example of accessible cultural history. For those of you who have thought primarily about the Cold War in terms of foreign policy or anticommunist politics a la McCarthy, Homeward Bound is a fantastic and quick read that will expand your ideas about the Cold War home front, gender, sexuality, and class. It's one of the few academic histories I would recommend to absolutely anyone. Read it!"}, {"userName": "AskHistorians", "userReviewDate": "Sep 30, 2015", "userURL": "http://www.goodreads.com/user/show/46890061-askhistorians", "userReview": "A very interesting history of the post-war family, women's roles, and the fifties-era cult of \"domesticity.\" A classic, and a very interesting read."}, {"userName": "kate", "userReviewDate": "May 29, 2007", "userURL": "http://www.goodreads.com/user/show/104729-kate", "userReview": "A good read with great first-hand accounts on marriage, sex, family culture, and consumerism."}, {"userName": "Frederick", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/8146637-frederick", "userReview": "I was looking for a social history for after the greatest war that history had produced. This came highly recommended. The problem with it is that while I am aware of the sexual symbology of the Cold War era I think it is going a bit overboard to define it by the sexual hang-ups of Caucasian-Americans. May provides some good and even important information but you would think when you read the book that we engaged in the Cold War with Communism, Containment, and all of those buzzwords that surrounded the era because we were sexually repressed. Be wary of historians who oversimplify history. They are an impediment to understanding it.On the other hand the book is quite readable and there are some very interesting insights regarding the uniqueness of post-World War Two America in relation to the rest of our history, particularly the generation that saw World War One and the Great Depression. It is a valuable resource for someone interested in social history."}, {"userName": "Rebecca Dobrinski", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/8616326-rebecca-dobrinski", "userReview": "Elaine Tyler May opened her book, Homeward Bound: American Families in the Cold War Era, with a description of a 1959 publicity stunt. A young couple, recently married, chooses to spend their honeymoon in a bomb shelter. Surrounded by consumer goods, the couple enters the bomb shelter for two weeks and will have nothing more for entertainment than canned goods and each other. As May writes in the introduction, the couple epitomizes the image of the post-war family as “isolated, sexually charged, cushioned by abundance, and protected against impending doom.” (1)As the book progresses, May’s thesis is clear: the Cold War/anti-communism/domestic bliss of the 1950s may have been ideal for men and children, but was detrimental to women, their sexuality, and their personal fulfillment. She connects the Cold War and anti-communism to the oppression of women. A whole generation was inundated with propaganda describing the ideal domestic life and anything that deviated from the norm was “bad”. To support her conclusions, May draws from popular culture, Hollywood, politics, and the Kelly Longitudinal Survey. These examples show how messages infiltrated the American psyche and helped form the attitudes of a generation of men and women towards marriage, child bearing, and life in the suburbs.The 1950s was an era when, for the first time in decades, the birth and marriage rates increased, and the age of marriage and divorce rates decreased. Pundits, scientists, and so-called specialists advocated traditional gender roles and the submissiveness of women as a way to battle the spread of communism throughout the world. May shows how American domestic life mirrored the need for security with the boxy ranch-style home, fenced in back yard, and the family spending time indoors in front of the television – all protected from the evils of the outside world. May describes how the needs of 1950s women are suppressed and subservient to the needs of their husbands and children. May explains that this contradicted the previous gains women had made in the 1920s, 1930s, and 1940s. Women’s emancipation movements started in the 1920s with suffrage. In the 1930s women went to work during the depression to help support their families and continued working in war industries during the 1940s. At the time, even Hollywood contributed to the image of the strong, independent female with role models like Joan Crawford and Katherine Hepburn. One of the more fascinating sources May uses is the Kelly Longitudinal Study (KLS). The KLS is a long-term study interested in personality development as well as the subjects’ attitudes towards marriage, family life and social situations. Questions were answered in detail, often taking more room than allotted on the surveys. It is a window into the life and psyche of the “picture perfect” 1950s family, which shows that the picture wasn’t so perfect. Unfortunately, as May points out in her introduction, this study is limited to the affluent, white middle class and their experiences with marriage and family life. Her book is a great start to open further research into the KLS study as well as the lasting affects of the repression of women in the 1950s have had on later generations of women."}, {"userName": "Kayleigh", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/57707945-kayleigh", "userReview": "2.5 stars. Very interesting, but too repetitive."}, {"userName": "Tim", "userReviewDate": "Apr 04, 2009", "userURL": "http://www.goodreads.com/user/show/978026-tim", "userReview": "The 50s \"was not, as common wisdom tells us, the last gasp of \"traditional\" family life with roots deep in the past. Rather, it was the first wholehearted effort to create a home that would fulfill virtually all its members' personal needs through an energized and expressive personal life.\" (11) This book offers that provocative thesis and some substantive support for its views (less so on the \"energized and expressive personal life\"). It is also a strong effort to dismiss the 50s as an ideal for family life, finding it more anomaly than historically continuous. But I think she misses the ideal nature of the family image, an image that is consistently middle-class, and existed back into the late 19th century. Only in the 1950s, after depression and world war, but also after the increased assimilation of immigrant groups and the great rise of the middle class and the suburb, could that ideal be approached on a broad basis. Such a picture of family life (nuclear family, several kids, dad at work, mom as homemaker) offered the security and even the \"containment\" she highlights in Cold War family life and it was readily accepted by the American population in the 1950s. \tMay is not so fond of the image (including its \"repressive\" sexual ethic and minimal freedom for women) and in the end the book grated on me because she generates only modest amounts of sympathy and understanding for her subjects (lets try to explain and understand before we judge). Her sympathy instead lies with the next generation (despite their narcissism that she reports quite clearly). \"Rejecting familial security as the means but retaining individual freedom and fulfillment as the ends, they carried forward the quest for liberation through politics as well as their personal lives.\" (15) \tI think class and consumption are handled in too cursory a fashion. By relying on the Kelly Longitudinal Study, the results of which are included in many chapters and dominates one almost exclusively, the book offers a particularly white Protestant, upper middle class view of the post-war experience (and glides over the experience of newly middle-class and/or suburban non-protestants). Although she makes the interesting point that 1950s consumption centered on the home, the chapter on consumption felt short on detail to support its wider claims. \tBut despite all that piling on, it is a good book to wrestle and even argue with because it makes more foreign what seems to be so familiar in the 50s sitcoms (aside from the Honeymooners)."}, {"userName": "Rachel", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/12915554-rachel", "userReview": "I read this book for a second time for a class I'm assisting with. I had read it previously about 7 years ago for graduate exams. I had forgotten what a superbly written and compelling read it is. May does an excellent job of connecting the Cold War policy of containment to the American domestic sphere by showing how many, many Americans bought into the \"domestic ideology\" of \"sexual containment\" (her name for it). Essentially, in order to keep the homeland safe, Americans needed to contain their sexual energy in marriage and make a safe, secure, stable home life their goal. She argues that it was this ideology in combination with demographic factors that contributed to the baby boom of the 1940s and 1950s--a demographic trend at odds with the generally downward trend of the birth rate in the early 20th century. She also argues that it was this era in which the \"traditional family values\" so often touted in the late twentieth (and now early 21st) century were actually created. I really enjoyed reading it again. It has some weaknesses, of course. She relies very heavily on survey data that came primarily from white, Protestant, middle class families, for instance. Still, her argument is tightly written, and her prose is unusually engaging for an academic monograph."}, {"userName": "sdw", "userReviewDate": "Dec 19, 2007", "userURL": "http://www.goodreads.com/user/show/232376-sdw", "userReview": "Homeward bound  is the classic examination of domesticity and the cold war. May argues that the ideals of domesticity fit within cold war ideologies of containment. The 1950s family must be understood within the larger political framework of the era. Dangerous scary threats to society like the atom bomb, female sexuality, and communism all needed to be contained. Early marriage with an erotic charge and plentiful reproduction contained the dangers of sexuality and offer a de-politicized shelter from the politics of the time. The home became a “sphere of influence” where mothers nurtured consumerism and kept communism at bay. Parents contributed to the civic good through raising good children, rather than participating in public sphere debates. Turns to expert advice and therapeutic solutions of adaptation replaced social change and struggle (ie – lets give you meds to make you less anxious rather than identify what structures lead to your stress). May uses a lot of demographic evidence, combined with first person responses from white middle class married couples to understand the dynamics within their relationships. Marriage operated to the benefit of capitalism. Men transitioned to more alienated positions at work as “organizational men” losing their sense of self and purpose on the job. Rather than struggle for a different organizational system of labor, they were encouraged to release the stresses of work in their home. Their sense of purpose was to be derived from their family life of middle class consumption rather than from their careers. Thus sitcoms emphasized the adult male’s identity as Father and Husband and placed him squarely in the home."}, {"userName": "Caitie", "userReviewDate": "Mar 30, 2016", "userURL": "http://www.goodreads.com/user/show/13439094-caitie", "userReview": "I did not particularly like this book, the author seemed to drone on about some of the subjects. It seemed to be well researched, but only mentioned one study of marriage and family life in the forties and fifties--the KLS study. I didn't feel like I was learning anything new by reading this. As I said, the writer just seemed to be repeating this several times throughout the chapter. The writing could have tighter, that would have made the book much more interesting. It's hard to read something when the author keeps mentioning the same things over and over.I also believe she did not have to keep using the term \"homeward bound\" in almost EVERY chapter conclusion. I get that's the title of the book, so you don't need to keep bringing it up seemingly all the time. I did like how she mentioned the differences between white and black women, but rarely mentioned black women until the last chapter (which talked briefly about the Civil Rights Movement). Weren't minority families important in the Cold War era too? It's strange that the author just arbitrarily mentions blacks in relations to whites,but doesn't feel the need to go into detail. What about Hispanic or Asian families? These people aren't mentioned at all. This bugged me. I didn't feel as though the epilogue added anything to the book at all. Maybe it was just a way to stay more current? It was more about the war on terror than about families, in my opinion. I understand that after 9/11 people were frightened, just like during the Cold War (at least in the beginning) but the similarities end there for me. The author seemed to stretch her point a bit too far."}, {"userName": "Craig Werner", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/5567347-craig-werner", "userReview": "One of the best books I've encountered in two years of immersion in post-war American history. It was curious reading Homeward Bound and realizing that I'd internalized many of May's arguments about the relationship between the Cold War and what she calls \"domestic containment\" without knowing where they'd originated. The core of May's argument is that Americans turned to the domestic sphere in large part because they were seeking some sort of stability in the face of the standoff between the U.S. and the U.S.S.R. which many expected to go nuclear at any time. She delineates the arguments that equated sexual repression with anti-communism and makes the connection with the peculiarly incoherent stance on race, that attempted to assure the world that African Americans were included in post-war American prosperity while propagating all sorts of policies that made attaining that prosperity difficult to impossible. While May's primary focus is on the late 1940s and 1950s, her final chapter links the unresolvable tensions of the 50s--primarily the commitment of women to upholding a sort of separate spheres ideology that was becoming both economically and psychologically (not to mention sexually) non-viable. Homeward Bound is written with admirable clarity. It's conceptually sophisticated but jargon-free. This is what history would be. This goes on the A list for anyone interested in post-war America."}, {"userName": "Tyler", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/5876938-tyler", "userReview": "A very interesting book about an interesting time in American history when marriage & family was heavily emphasized in our culture and politics. The book was well-researched and I thought her arguments were generally well-founded.The author is definitely a feminist and sometimes it shows pretty heavy-handedly and in a few cases I thought that viewpoint made her argument a little over the top. There were places where she refers to women who have additional career options as being \"emancipated\" from their role as homemakers, which I find distasteful. She does point out that being a homemaker was a financially logical optional at the time, due to relatively limited options in jobs and careers, but she never seems to honestly acknowledge that some women-- even those who DO have other options-- genuinely want to be stay at home Moms and DO find it fulfilling. She cites a lot of evidence about women who feel unfulfilled by their role as homemakers, but downplays the statements of women that say they found being mothers very satisfying and bringing joy to their lives as \"settling\" or trying to make the best of a bad situation. I disagreed with that part of her argument.There are interesting parallels between the themes of Fear and Security that were dealt with in the early Cold War period and the same issues that we face in the modern world today. Very interesting to think about."}, {"userName": "Cindy", "userReviewDate": "May 23, 2007", "userURL": "http://www.goodreads.com/user/show/44223-cindy", "userReview": "I will admit, I read this for a class and never would have picked it up otherwise. If you're into the Cold War, 1950s culture, or what life would be like without feminism, it's definitely a good read.The Big Idea in the 50s was the containment of Communism. Elaine May takes this containment idea and writes about how it applied to pretty much everything. American was one contained place. For example, sexuality was okay, as long as it was contained within a marriage, but very not okay otherwise. Teenagers, of course, wanted to bang so they were encouraged to marry younger and younger. So the banging was contained, with the added bonus that everyone had as many babies as possible so we could repopulate after a nuclear attack. Strange times. May focuses pretty much only on white middle class suburban families, which you could criticize her for, but then again you have to get specific if you're writing a book on something as big as \"the family in the 1950s.\" As usual, I'm left wanting to hear about what the homos were doing. If you like reading about second wave feminism, this book is a pretty ideal lead up to The Feminine Mystique. May writes more about housewives than anyone else, and The Feminine Mystique is all about the period when housewives realized they were being cheated out of um, their identities as unique individuals."}, {"userName": "Laura", "userReviewDate": "Dec 29, 2011", "userURL": "http://www.goodreads.com/user/show/5472203-laura", "userReview": "I’m currently taking a 20th Century America class (I’m Canadian..FYI) for school and it’s actually proving to be quite interesting. For part of the class, you have to do a non-fiction book report, from a set list, and I chose Homeward Bound by Elaine Tyler May for well, the reason above. Focusing on families and family dynamics (the Baby Boom, women’s role in the family etc.) in America during the 50s and the Cold War Era, May is able to give a personal and informative look into the era. Using a lot of pop culture references throughout, the book remains mostly factual base but in an easy to digest form. May’s main argument in Homeward Bound is that during the Cold War there was a belief that “containment was key,” in order to protect you from the outside “threatening” forces at the time. (Nuclear weapons, the Soviet Union etc.) With this in mind, Americans were “homeward bound,” in the sense that they were creating a safe and contained family structure and home.In the updated prologue of Homeward Bound, May does well to connect the post-9/11 feeling with that of the Cold War era. Proving to be a very interesting read, Homeward Bound, is both a great and informative read for academic and leisure reading purposes."}, {"userName": "Madeline", "userReviewDate": "Nov 03, 2009", "userURL": "http://www.goodreads.com/user/show/418354-madeline", "userReview": "really interesting look at the politics (both public and private) of containment, gender roles in the nuclear family, and how those roles manifested themselves during wwII and the nuclear arms race. largely draws from a study done on new england couples at various points in their marriage at a time when the marriage age dropped and *everyone* was getting married. fascinating answers from the study highlight how sex was viewed before and during marriage for women vs. men, fidelity, womens' careers, and fulfillment from having children, among other things. i often think about this book when i'm watching mad men."}, {"userName": "Piker7977", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/3571033-piker7977", "userReview": "Homeward Bound is a fine study that peels back the facade of postwar idealism and security. Behind these ideals were sexual insecurities, professional frustrations. and domestic fronts that were influenced by Cold War ideology. May goes deep into family and suburban life to paint the early Cold War period as a time when patriotism forced women into homemaker roles and encouraged consumerism. These tendencies would not survive the 60s as the baby-boomers would accost their parents and inspire societal change. Well researched and well written. This is a good companion to books that focus on America's role in the geopolitical realm of the Cold War."}, {"userName": "Eva Derzic", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/5596659-eva-derzic", "userReview": "It's an interesting analysis of the nuclear family and containment strategies during the cold war. The inclusion of responses from KLS interviews regarding work and marriage are enlightening and a bit disillusioning; it's amazing how many people stayed in unhappy marriages just because forming their own nuclear family structure was their only vision of happiness. The book is a bit repetitive and the chronology is ... totally skewed in places, but for what it's worth, it's still an interesting read."}, {"userName": "Carrie", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/8586546-carrie", "userReview": "I found this book to be both enlightening and enraging, especially with the new afterward that focuses on Post-9/11 challenges. It serves as an excellent examination of Cold War-era gender roles and the movements that challenged them. I read this for a class, but I would still recommend it for the stories found within, the engaging writing (a true find in academia), and for its relevance in women's history."}, {"userName": "Dan Gorman", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/19684478-dan-gorman", "userReview": "A very eloquent book, but it didn't contain any bombshell revelations about life and American anxieties in the 1950s. The passages on the anti-communist and anti-homosexual purges in the U.S. government were sad and eye-opening. The use of statistics was well apportioned, and May draws from several large-scale anthropological surveys of suburban life. Yet this book is not about all American families; really it is just about white, and mostly Christian, families."}, {"userName": "Melissa", "userReviewDate": "Sep 16, 2007", "userURL": "http://www.goodreads.com/user/show/123584-melissa", "userReview": "Basically, this book is The Feminine Mystique rewritten in 1988 with a slightly broader focus and statistical support. It frequently polarizes gender roles (all women must work or all women must stay at home), relies heavily on longitudinal studies, is extremely anglo-centric, and uses scare quotes around words like \"hotbed.\" Problematic on a number of levels. It is interesting, though, in broadly contextualizing Cold War American culture."}, {"userName": "Lulu", "userReviewDate": "Jun 24, 2007", "userURL": "http://www.goodreads.com/user/show/150400-lulu", "userReview": "The perfect gift for the arm-chair, Cold War historian on your Christmas list (at last!!). This book links together US social and political history from 1940-1960s. Some great news archive photos of couples \"honeymooning\" in their bomb shelters and civil defense ads that link a stocked kitchen pantry to national security. There is also an extensive discussion of sexual and gender politics during the baby boom era."}, {"userName": "20hrsinamerica", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/2465010-20hrsinamerica", "userReview": "This is a well thought out analysis that links cold war political containment to sexual containment at home. I think it's both good for women's and gender studies courses regarding sexual containment and women's domestic roles, but also for a foreign policy course as a way to a) better understand the context and b) the effect of (foreign) politics on every day life which few students grasp."}, {"userName": "Kate", "userReviewDate": "Mar 29, 2009", "userURL": "http://www.goodreads.com/user/show/1262800-kate", "userReview": "This book maybe doesn't do quite as much with its material as I might hope, but the material alone is pretty great. In particular, it's pretty fascinating to hear the actual voices of '50s housewives. Anyone interested in the history of women will be very interested in this book...and anyone who is not interested in such maybe should be required to read it."}, {"userName": "Laurie", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/881664-laurie", "userReview": "I will admit that my perspective on this book is biased, as the author was my senior thesis advisor. I revisited the book and was blown away by how she manages to write ground-breaking academic work that is engaging and accessible. Homeward Bound is one of the few academic texts that I would suggest to people who aren't in academia. I love it."}], "description": "In the 1950s, the term ”containment” referred to the foreign policy-driven containment of Communism and atomic proliferation. Yet in Homeward Bound May demonstrates that there was also a domestic version of containment where the ”sphere of influence” was the home. Within its walls, potentially dangerous social forces might be tamed, securing the fulfilling life to which postwar women and men aspired. Homeward Bound tells the story of domestic containment - how it emerged, how it affected the lives of those who tried to conform to it, and how it unraveled in the wake of the Vietnam era's assault on Cold War culture, when unwed mothers, feminists, and ”secular humanists” became the new ”enemy.” This revised and updated edition includes the latest information on race, the culture wars, and current cultural and political controversies of the post-Cold War era.", "title": "Homeward Bound: American Families In The Cold War Era", "url": "https://www.goodreads.com/book/show/212048.Homeward_Bound", "average": 3.86, "cover": "https://images.gr-assets.com/books/1405431576l/212048.jpg", "reviews": 54, "authors": [{"url": "https://www.goodreads.com/author/show/56193.Elaine_Tyler_May", "name": "Elaine Tyler May"}], "type": ["History", "Nonfiction", "North American Hi...", "Feminism", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/212048.Homeward_Bound", "http://www.goodreads.com/book/show/19666921-homeward-bound", "http://www.goodreads.com/book/show/5089306-homeward-bound", "http://www.goodreads.com/book/show/18546875-homeward-bound-american-families-in-the-cold-war-era", "http://www.goodreads.com/book/show/7489543-america-and-the-pill", "http://www.goodreads.com/book/show/35305672-fortress-america", "http://www.goodreads.com/book/show/291100.Barren_in_the_Promised_Land", "http://www.goodreads.com/book/show/97721.Great_Expectations", "http://www.goodreads.com/book/show/347475.Pushing_the_Limits", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}