{"ratings": 7288, "userreviews": [{"userName": "softlykaz (on hiatus)", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/42130592-softlykaz-on-hiatus", "userReview": "shoutout to me for making it through this book(if you’re looking for a better substitute for humor, mystery and general fulfillment: buzzfeed unsolved)"}, {"userName": "Katerina", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "Delightfully morbid.\nI loved Stalking Jack the Ripper. It was a book I will always hold dear, mainly because I was enchanted by the gloomy Victorian London ambience and disturbingly fascinated by the gruesome murders and their riddles. Yet Hunting Prince Dracula, with its mystifying touch, with lores whispered by supersticious villagers and seemingly crazy professors, medieval orders and forests covered in white snow yet somehow tainted by crimson blood and chilling howls, is the reason I bowed to Kerri Maniscalco's exquisite pen.\n\n“Has the Immortal Prince returned?”\n\nAfter the tragic events of Stalking Jack the Ripper, Wadsworth and Cresswell head to Romania, to attend the Academy of Forensic Medicine and Science. But the prestigious Academy hides many secrets, from dark corridors and chambers to brutally murdered corpses that indicate one thing; the Impaler Lord has returned, seeking blood. Whose blood though and why, that's a different story. Trying to reason with evidence of the supernatural while fighting the nightmares that haunt her, Audrey Rose must find some answers and give justice to those who have already perished, before her time comes to join them in the eversleeping realms of Death.\n\n“There's nothing quite like the aroma of a bloaded corpse to get one in the mood for adventure.”\n\nMy dear Mr. Thomas Cresswell cound not be more right. From the grey streets of Victorian London, Kerri Maniscalco transferred us to Romania, and painted with her colourful palette Dracula's castle and picturesque villages, blending red with white. White for the blinding snow. For the innocence lost. For the shroud that covered the victims of a villain utterly terrifying, that made your stomach churn with disgust and terror. Red for Wadsworth's lips, lips that craved to taste Cresswell's with a searing need. Red for the Prince of Blood, and his horrendous domain. For the autopsies performed by brilliant students who could not shut down their humanity. The atmosphere was eerie. Foreboding. Danger lingered in every corner. Everyone was a suspect, and everyone a potential victim. There were many times I wished for Ms. Harvey's traveling tonic to help me steel my nerves and keep reading. But in this deadly and macabre puzzle that gave you gooseflesh and toyed with Wadsworth's (and your very own) sanity, between the constant suspense and the legends of warrior societies and a brutal Prince worshipped by his countrymen, Kerri Maniscalco managed to ease the tension and make your lips curl up with mirth.I suspect you already know the reason. \n\n“I have a feeling you haven't invited me here for kissing. Though it never hurts to ask. You're dressed for sneaking about Dracula's castle. Be still my thawing, dark heart. You certainly know how to make a young man feel alive, Wadsworth.”\n\nAnd along this witty and charming duo, you also felt alive. Belly rumbled with laughter, heart that pounded rapidly with the snarky dialogues that oozed sarcarm yet tenderness and affection at the same time, lungs that ran out of air when tension was too much to handle, Cresswell and Wadsworth are a couple the likes of which you haven't encountered so far. Wadsworth struggled with her demons, and the wounds the events of the previous book were raw and fresh, depicted in a powerful and devastating way. I won't lie and say that I was on board with every decision Wadsworth made. I think that she could become so fixated on her independence that she misinterpreted the attempts to protect her as actions to cage her, and she could be really unfair towards Cresswell. But she came a long way overcoming her emotional trauma, and her development was evident. Her sharp mind and equally sharp tongue make her a remarkable heroine.Now let's talk about Cresswell.\n\n“You've stared fear in its nasty face and made it tremble. You will make it through this, Wasdworth. We will make it through this. That is a fact more tangible than any dream or nightmare. I promised I'd never lie to you. I intend to honor my word.”\n\nAs my dear friend Nastassja once said, Mr. Thomas Cresswell turns bloody and creepy into sexy so, so easily. While his social skills are still rusty, and his good intentions don't always work out as planned, his arrogant and (completely) inappropriate remarks, his flirtatious ways and the intensity of his feelings towards Wadsworth make him utterly delectable. Their scenes crackled with pent-up tension, and you couldn't help but pant a little even when there was no touching involved. Only heated stares. Innuendos. Sinful thoughts. And a love deep and powerful. From every challenge, they emerged stronger. Together and as individuals. I think I'm in love with them both. All in all, a delicious and macabre tale, with the perfect blend of suspense, horror, Romanian folklore and sparking romance, Hunting Prince Dracula surpassed its predecessor and established Wadsworth and Cresswell as the new hot duet of crime solvers!*ARC generously provided by the publisher in exchange for an honest review*You can find this review and more over on BookNest.eu!\n\n\n\nBEFORE\nDelightfully morbid, with the perfect blend of suspense, horror, Romanian folklore and sparking romance, Hunting Prince Dracula surpassed its predecessor and established Wadsworth and Cresswell as the new hot duet of crime solvers!Full review to come!"}, {"userName": "Emma Giordano", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "As I was not a huge fan of Stalking Jack The Ripper, I was unsure if I would continue with the series until hearing rave reviews of book two, especially from people who also did not enjoy the first installment. I did enjoy Hunting Prince Dracula more than book one, but it still just wasn’t for me.CW: murder/gore, sexism, ptsdMy absolute favorite part of this series is the characters and romance. I wasn’t the BIGGEST fan of Audrey Rose in book one, but I actually loved her in book two. I adore her independence, her intelligence, her passion, her determination – she just has so many loveable qualities! I also love Thomas even more than I did in book one (which I didn’t think was possible.) He is analytical, witty, flirtatious, respectful and all around wonderful. I adored the development of their relationship in this installment. It is so refreshing to see a YA couple that view each other as equals. Thomas and Audrey have a fulfilling, healthy relationship and they complement each other in the best way. Their growth as a couple is the perfect slow-burn and I would honestly read anything where they are together, even if this series is definitely not one of my favorites.I really enjoyed the setting of this story. I’ve always loved vampire folklore so the added exploration into how these legends play into Romanian culture was fascinating. I also loved the choice to transform Bran Castle, a place of great mystery and history, as the primary location of the novel. It was equal parts enchanting and creepy.Truthfully, there are not many distinctive critiques I have for this novel – It’s just not a favorite of mine. I do not frequently reach for historical fiction, but the plot of this series is too intriguing for me to pass up. The prose is fine, but nothing profound in my opinion. Similarly, the mystery was “okay.” I will admit I was bored for some of the story as I feel it was extremely slow-paced up until an intense ending. I just was not as engaged as other mysteries I have read. While this series is overall not for me, I am glad I read book two and I definitely plan to read book three. I don’t feel it is within my capacity to love this series as much as others, but I really love the premise of each story and hope to be surprised even more by the next installment."}, {"userName": "Kerri", "userReviewDate": "Oct 27, 2016", "userURL": "http://www.goodreads.com/user/show/5360854-kerri", "userReview": "9/18/17 PUBLICATION EVE UPDATE!don't forget to submit screenshots of your preorders to receive the MEETING THOMAS CRESSWELL novella! ends TONIGHT at midnight! (open INTL even though it says US/CA, promise.)http://jimmypatterson.org/hunting-pri...8/16/17 UPDATE!The map for finished copies of HPD has been revealed! Check out my social media if you'd like to see it. I'm also hosting two giveaways, one on twitter and one on instagram! xoxo*****8/8/17 UPDATE!!!!SECRETS ARE SO HARD TO KEEP, but the wait is officially over—i can FINALLY share the HUNTING PRINCE DRACULA pre-order campaign with you! i wrote an exclusive STALKING JACK THE RIPPER novella narrated from Thomas’s point of view. that’s right…for everyone who’s ever wanted to be inside Mr. Thomas Cresswell’s Sherlockian brain, this is your chance.MEETING THOMAS CRESSWELL is a special limited-edition offer—you won’t be able to get this novella anywhere else once the campaign is closed.from deductions, to sass, and how he felt meeting Audrey Rose for the first time, i hope you enjoy Cresswell’s story!details on how to pre-order giveaway can be found on http://jimmypatterson.org/hunting-pri...It is open internationally, even though it says US/CA. (That's for physical giveaways and this novella is a digital download. I checked with my publisher!)***all receipts must be received and uploaded by September 18th at midnight.************Here it is! The cover reveal plus first chapter are up on Entertainment Weekly!http://ew.com/books/2017/03/13/kerri-...****3/10/17 update: the cover plus first chapter will be revealed on MONDAY! (3/13/17)****well...i'm obviously super biased because i wrote it, but i love this next installment so much and cannot wait to share the official summary and title with you. xoxo"}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "\"Lead the way, Wadsworth. I'm simply along for the brute strength and charm.\"\nOmgah. This was FANTASTIC. I loved the first book, but this one blew it out of the water. Kerri Maniscalco can WRITE. (Thank you to the publishers for sending me a gorgeous arc!)Every page was brilliant. The prose was gorgeous. I loved loved loved it. (Mind you, I had to skim some of the bloody parts-weak stomach eek!) But seriously you guys, don't miss this. \n\"Flowers need plenty of water to grow. Love, too, needs attention and affection or else it slowly withers away from neglect.\"\nLet's start with the most important matter. Thomas. Freaking. Creswell.Just when you think you have him figured out, well... trust me. You have no idea. He was the highlight of this book. The banter and chemistry was OFF THE CHARTS. I mean, he was pretty freaking great in the first book, but the heat between him and Aubrey Rose was multiplied ten times over here. Just because they ended on a happy note in the last does NOT mean anything loses its steam. Like wow. \n\"Do you want to know what I think? The Truth?\"\"Yes.\" He gazed unabashedly into my eyes. \"Make it scandalous too. This is bit too serious for my tastes.\"\nNot to mention, Thomas is hiding one little detail that makes him EVEN MORE LEGIT OH MY LORD. Ugh I can't spoil but like...ermergersh. (Seriously can someone freak out with me please?)Aubrey Rose and Thomas are off to attend an academy set in the Brahn Castle in Romania (Dracula's castle- yes it exists.) The setting was so flipping cool. Creepy castle with secret passageways? Check. Enchanting forest and medieval village? Check. Bits of history and rumors woven throughout? Check. I'll admit the story was a bit on the creepy side and I'm not really a fan of horror or macabre, but I was able to skip the bits that disturbed me easily enough. Sorry Kerri, you're brilliant with the whole cadaver scenes but ahhh I had to skim that. Either way though, the story was brilliant (have I said brilliant enough? I'm going to say it more.) I don't want to give anything other clues about the plot, but just enjoy the ride. But even aside from the cool-as-crap setting and the edge of your toes storyline, the character development was phenomenal. Aubrey Rose is suffering from PTSD throughout the book, and it wasn't dealt with lightly. I was a little unsure of how everything played out in the end of the last book, but I was impressed with how well it was written in this one. Thomas, on the other hand, has his own dealings that broke my heart. But even amidst it all, they find little ways to move forward. I also loved the addition of Thomas's sister who is BAMF omg. But most of all? I loved discovering everyone's secrets ahhh!\n\"For there are no limits to the stars, their numbers infinite. Which is precisely why I measure my love for you by the stars. An amount too boundless to count.\"\nSo all in all, this gets a glowing review from me. My Blog ~ Instagram ~ Twitter ~ Etsy"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I have always wanted to travel to Romania so it was fun to go with Audrey and Thomas =) Audrey and Thomas are going to study at a medical school inside of Bran Castle. Oh what joy =) But along the way, while riding on the Orient Express, they find a body outside of Audrey's compartment with a stake through his heart! And thus it begins....There are some wonderful new friends they meet at the school and some not so nice. AND more bodies show up. What is happening to these people? The towns people think Vlad has come back! But I know the real story =) It's a little cray, but not too much. There were some little tidbits of things that I enjoyed finding out though. Also, Thomas finds some interesting things out about his family tree. This was so much fun! I could just picture every little thing going on and the creepy atmosphere. Oh the joy! Well, accept when they were doing autopsies. Luckily this time around I wasn't snacking. I learned my lesson in the first book! The next case will take place somewhere in America! I wonder what they are going to do next? I can't wait! Happy Reading! Mel ♥MY BLOG: Melissa Martin's Reading List"}, {"userName": "Sana", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/26402455-sana", "userReview": "Hello everyone, I would really love it if you all start addressing me as Sherlock Holmes because your girl right here, solved it. I mean I had my theories and ideas and screamed when I was right oh em gee. I really didn't like the first book because it was just so dull and focusing a lot on the forensics, leaving me uninterested and bored, but this book??? was so much more intriguing and interesting. !!!!!!Spoilers from the previous book from here on!!!!!So what is this book about?After finding out who Jack the Ripper was and facing very disturbing events, Audrey's father let's her go to Romania to study at one of the best forensic schools with Thomas Creswell!!! Somebody is murdered on the train she's traveling on and a killer is on the loose murdering people the way Dracula did. ●This book is honestly so great!! Audrey Rose is the perfectly, flawed and strong character. She's bullied and made fun of because of her sex. No one thinks she's capable of doing anything because she's a fucking female!! But she speaks up and doesn't back down. She proves to them that's she's just as capable as males and can do whatever the fuck they can. And it's fabulous. \n“Oh? Where in a medical dictionary does it say a woman cannot handle such things? What is a man’s soul made of that a woman’s is not? I had no idea my innards were composed of cotton and kittens, while yours were filled with steel and steam-driven parts.”\n●She's so strong and badass!!! She wears dresses and cuts open dead bodies. She shows, that as a woman she can do anything anyone else could. I honestly don't understand why it's so hard for people to just understand the fact that a woman should be treated equally as anyone else and she can do ANYTHING!!!\n“Perhaps it was time for fathers to teach their sons how to behave around young women. They were not born superior, no matter how society falsely conditioned them. We were all equals here.”\n●She has anxiety, hallucination and flashbacks of what happened in the previous book. She's dealing with the loss of her brother and mother. And tbh, that makes her so so perfect. ●Thomas Creswell is the best person to exist. He's always teasing Audrey with dirty jokes, trying to get a kiss from her, always there to support her, HE MADE A HUGE MISTAKE!!!!!, but so does everyone because we're all humans. He goes through some incredible character development and learns so much about himself. He's a little closed off and mysterious. And he's always there to support Audrey and respects her. \n“'You are not mine to take.' He brushed his lips against mine. Softly, so softly I might have imagined them there. My eyes fluttered shut. He could persuade me to build a steamship to the moon when he kissed me. We could orbit the stars together. 'You are yours to give.'”\nI need this boy in my life. I just love how he's not portrayed as the perfect, heroic guy. Audrey here takes her own lead while he helps her. He isn't the main hero and more of a sidekick type when solving the mystery and it's perfect. She saves him multiple times and he's totally fine with that. I mean, it should be fine with everyone. ●This book is so much more intriguing and complicated from the previous. I, personally, LOVE Romania, Vlad Tepes and the whole Vampire, Dracula thing. I remember watching this one show about the whole history of Vlad, his castle and how he was imprisoned and the gore and murder. So the mystery and plot were much more interesting.●Romania is beautiful and I just loved it.●there's!!! a!!! F/f!!!! Couple!!!! And!!!! I!!!! Love!! Them!!!!!! Spoiler about who dunnit and how ya girl solved this case!!!/////////////I knew for a fact it was going to be a female because of how Maniscalco portrays woman empowerment and I realized the murderer was definitely going to be a woman. Then Anastasia's giddy, cheery behavior, taking Audrey out to the woods at night and giving her the warning of being careful, her being the headmasters daughter and also talking about how she has to prove she's good enough as a woman in their eyes. I realized she was trying to appear innocent by trying to \"help\" out Audrey with the case. Then when we find out she's the headmasters niece or something, we all go, nahhh she can't be it, BUT I KNEW IT WAS HERRRRRR because it's all too suspicious!!!I got hints that she was the murderer because of all that, but then when she \"died\" I was like, \"aw shit, it's not her\" and thought it was thomas's sister. BUT THEN AT THE END THIS BITCH IS BACK AND I WAS LIKE AW YEAH FUCKERS, I WAS RIGHT EAT ALL OF MY DUST HOLMEYYYYSPOILER ENDS////So like, overall, you guys should really read it because this book gives amazing messages about feminism, equality and it's such an intriguing read!!!Also, I'm opening my own detective school where y'all can learn from me because I'm fabulous at this ;pp"}, {"userName": "destiny ☠ howling libraries", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/15335689-destiny-howling-libraries", "userReview": "#1: Stalking Jack the Ripper ★★★★★#2: Hunting Prince Dracula ★★★★★#3: Escaping From Houdini ???Spoiler free review! Are you guys ready for some serious fangirling?! This series has utterly bewitched me.\nPerhaps it was time for fathers to teach their sons how to behave around young women. They were not born superior, no matter how society falsely conditioned them. We were all equals here.\nWhile we got to see Audrey's feminist snark come into play a little in SJTR, she is loud, proud, and feminist as hell in this sequel. I am so here for this! Despite struggling with PTSD from the ending of the first book (and her PTSD is represented really solidly!), when she arrives at Bran Castle, Audrey refuses to let the headmaster or any of her male colleagues look down upon her. True to her nature, she claws her way to the top despite her trauma and the scorn of the men around her.\n\"Mr. Thomas Cresswell would descend into each circle of Hell if you needed him to. You are the beating heart inside his ribcage.\"\nReally, though, my favorite thing about this book was how much time we get to spend with Thomas and how much his character develops. He is shamelessly head-over-heels for Audrey, and while he occasionally slips up, his intentions are always good. He learns from each mistake along the way and views her as his equal in all ways. In a genre filled with unhealthy and/or unrealistic relationships, Kerri has written a romance that feels authentic, legitimate, exciting, and so sweet. \nHis eyes were my favorite constellations to gaze at; each fleck of gold surrounding his pupils were new galaxies begging to be discovered.\nAudrey develops tremendously as well, and opens her heart to the possibilities of a life filled with more than just cutting open cadavers and chasing down villains. I found it really delightful to watch her come to terms with the idea that she could be a strong, feminist woman without sacrificing her emotions or blossoming romance.\n\"Society at large is staggeringly obtuse. If one simply looks to others for their opinions, they lose the ability to think critically for themselves. Progress would never be made if everyone all appeared and thought and loved in the same manner.\"\nDid I mention there's a queer romance in this book? Because there's totally a super precious and adorable f/f relationship between a couple of side characters. ❤ If you couldn't tell already, I loved every freakin' moment of Hunting Prince Dracula. The setting is incredible - a creepy old castle, what more could I ask for? - and the suspense is on point. I know there were some complaints that SJTR threw out too many red herrings, but I don't feel that was the case at all with this sequel. I found myself legitimately considering every possible avenue for the culprit, and while the ending didn't shock me, I loved how everything played out. Plus, we learned some delicious secrets about Mr. Cresswell, which I really hope will come into play in the next book!If you enjoy YA suspense/thrillers, mysteries, gothic horror, and/or an adorable romance in bloom, I highly encourage you to pick this series up ASAP! You won't regret it.Thank you to Jimmy Patterson Books/Little, Brown and Company for providing me with an ARC in exchange for an honest review!"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "Ok let me just preface this by saying that I'm generally not super into murder mysteries but I still had to read this sequel because I adore these characters. And I genuinely did enjoy this book! The writing's so strong that it's hard not to get pulled into the story. Everything was really well done and fans of the first book will absolutely love this!! I'll say more closer to the release date. Thank you to the publisher for sending me an ARC."}, {"userName": "Grace (BURTSBOOKS)", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/63164992-grace-burtsbooks", "userReview": "So, since I've never actually figured out the art of writing reviews for sequels I'm just gonna direct you to my review of Stalking Jack the Ripper for any coherent thoughts on this series you might be interested in while I gush here about how much I loved this book. 1. I am in actual love with Audrey Rose and her genius self and will never not be and if this book series turns one more person she trusts into a murderer I will riot. She needs a break - someone buy her a bath bomb2. I also love Thomas and his stupid, emotionally stunted ass hole self and if he ever makes the ill-advised decision to play dead and make me ugly cry again I will kill him for real myself. 3. The school setting was perfect. 4. Audrey Rose's aversion to marriage is so damn relatable to me and it's so interesting to read about because it is never explored in YA5. The audiobook voice actor is so talented it's insane6. GIVE ME THE NEXT BOOK IMMEDIATELY7. I don't give a shit about romance but if Audrey Rose and Thomas don't end up together by the end of the fourth book I will no longer believe in love"}, {"userName": "Stacee", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/7359586-stacee", "userReview": "I loved SJTR, so I was 10000000% on board with this being a series and as soon as I got this book in my greedy hands, I dropped everything. I love Audrey Rose. She's smart and sassy and doesn't back down. It's so much fun being in her head. And don't get me started on Thomas because I wouldn't know where to start. I live for the banter between them and it's even better when they're flirting at the same time. Plot wise, it's a big bundle of mystery. There are creepy castles and late night searches and oh yeah, bodies. There are some new characters introduced that I hope we get to see in the next book and a few revelations at the end that had me practically screaming. Overall, it was a fun read that had me captivated from the first page. I can't wait to get my hands on book 3. **Huge thanks to Kerri for spoiling me rotten and sending me to the book**"}, {"userName": "maymay❀", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/49148508-maymay", "userReview": "Full review postedI was going to forgive 2017 for all the crap it gave us if this book didn’t disappoint and THANK GOODNESS 2017 GETS ANOTHER CHANCE Antique pages were a scent that should be bottled up and sold to those who adored the aroma.(s) Reasons why this book saved 2017-\tAnxiety/hallucination rep from one of the most badass woman to ever walk -\tSo much fem power bois this is a good one-\tThomas Cresswell, my husband-\tIn book 1, Audrey was so impassive to gross things and I totally get it but seeing how they impacted her more in this book MADE ME RELATE TO HER SO MUCH-\tThomas and Audrey go on lots of adventures together-\tAnd their banter is epic as always-\tBASICALLY YOU’RE JUST SCREAMING AT THEM TO BLOODY KISS BC THEYRE SO PERFECT AND YOU JUST NEED TO SEE THIS SHIP SAIL DAMMIT-\tThe twists, man-\tThe revelation of the killer got me good-\tI didn’t guess right -\tCresswell is a shameless flirt-\tI want to marry him, im so done with the world why does he have to be fictional-\tLots of science-y things-\tI LOVE HISTORIC ANYTHING AND HISTORIC ROMANIA WAS AWESOME-\tAudrey basically gives a middle finger to gender roles and social conducts, its great-\tLots of unchaperoned adventures 😏 😏 😏-\tTHOMAS’S SISTER IS SO PRECIOUS-\tEverytime Thomas opens his mouth you’re just bracing yourself for the adorableness that will pour out of him-\tThe teacher guy was creepy tho, not a fan-\tIf you want a mystery set in historic Romania with two darling characters that you will be screaming at THEN PICK THIS BOOK UP ITS SO GOOD WORTH IT WORTH IT WORTH IT(s) 5 stars!! gimme book 3 right now please~~~~~~~~~~~~~~~~~~~~~~~~~*screams in the general direction of the sun* I AM READY FOR SOME AUDREY AND THOMAS BANTER AAAAAAAAAAAAAAAAAAAAA~~~~~~~~~~~~~~~~~~~~~~~~~3/13/2017 updateTHECOVERHASBEENREVEALEDlooks hella creepy and mysterious I'M IN~~~~~~~~~~~~~~~~~~~~~~~*touches cheek*where did these  tears  come from????!!!????BOOKTWOIN ROMANIAWITHAUDREYROSEANDTHOMASCRESSWELLcan i have now?????"}, {"userName": "Nastassja", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/7734134-nastassja", "userReview": "Monsters were in the eye of the beholder. And no one wanted to discover their hero was the true villain of the story.\nWadsworth and Cresswell are back and this time they are hunting Dracula himself! Before starting this review I should probably mention that Stalking Jack the Ripper was one of my favorite books last year. I had an absolutely illogical crush on Thomas Cresswell, which was pretty obvious from my review (note: fangirling rumblings without stop is a better way to describe that review), and I cannot express with words how excited I was to read Hunting Prince Dracula. Of course, I preordered the book as soon as possible and the waiting began. Months of anticipation and teasers from the author and finally the book was in my hands! But than something unexplainable happened: I absolutely loved the gothic atmosphere of book two, I loved the mystery, which I didn't guess as soon as i did in book 1, but my dear Cresswell didn't make my heart jump out of my chest and didn't turn my breathing erratic as it was before. What happened, I asked myself? Was it due to the stress I am having at the moment in real life that everything feels less bright to me? But no, the answer was buried much deeper than the influence of the outside factors. Simply, Cresswell stopped to intrigue me as a character, because he lost the spark he had in book 1. What I mean is we have the same problem as many YA books before: a hero turns into obedient, character-less puppy in the presence of a strong independent feminist heroine. Sigh. I get that Audrey Rose is all modern and amazing, but why Cresswell's character must suffer because of it? What about strong male characters that could be equals to strong female characters? Everyone remember Rhett Butler. Huh? I don't remember him turning into a goo in the presence of a very strong Scarlett. Moreover, it seems that Cresswell lost his genius mind along with his temper. It literally explained to us because of his love for the heroine he couldn't deduct simplest of things. Well, if things has turn this way than I demand this couple to break up! If Cresswell was with me he wouldn't've lost a ounce of his geniality, that's it! Sorry for my rumble, but I was extremely disappointed with Cresswell in this book. I still hope book 3 will bring me back my snarky dashing hero with his geniality intact. Apart from some out-of-character behavior I enjoyed the story a lot. I mean: Europe, Dracula's castle, secret passages, monstrous creatures and everything dashed with mystery and romance - a perfect mix to take one's mind from everyday problems. I felt myself fully engaged by the storytelling and couldn't wait to find out who the main culprit was. And in the case of Hunting Prince Dracula I didn't guess the murderer as soon as I did in book 1, and it added to the level of enjoyment I received from this story.I am extremely curious as how the story will evolve in book 3, what will be the main theme; what legend or real life murder case the author will choose for the story. Plus, you know, the story takes place in America and it's interesting to see our beloved characters in new surroundings testing their minds and relationship.The writing was as perfect as in book one: the words were coming alive and flying from the pages in a cadence of perfect symmetry, and images were born before my eyes with a perfect clarity and a dash of morbid anticipation tickling my nerves in the best way possible (I love to test my nerves like that). I noticed more than once that I was reading some lines aloud, enjoying the way words were built into sentences and pictures in my head. Kerri Maniscalco once again proved to be a queen of storytelling. Bravo! If you haven't read the book yet, I don't want to give extra details about the plot. Better dive into the story without knowing much about the storyline and enjoy every revelation waiting for you on book's pages. As for me, I am mostly satisfied with everything, but still waiting for some improvement for my dearest Cresswell. So hopefully my fangirling over his awesomeness will be back in book 3. And for those who haven't started this series yet: just give it a chance and maybe you will find the world of Thomas Cresswell and Audrey Rose Wadsworth to your liking, and, who knows, maybe even to you adoration *wink*.\n\"If you were guilty and wanted to hide, where might you go first?\"\"Depends on what I'm guilty of. Dirty thoughts or wanton follies, I'd send myself straight to your quarters to be punished.\""}, {"userName": "Candace Robinson", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/33995641-candace-robinson", "userReview": "I still liked book one more, but this was a fun ride! The question is, is the killer an immortal or someone pretending to be.My favorite character is Thomas! Love him and his personality! There were some pretty interesting and grotesque stuff that was awesome! Some of the book lagged in the middle, and when Audrey got mad at Thomas, it was ridiculous for the reasons. There was a twist that I was not expecting. I can't wait for book 3! Full review on my blog https://literarydust.wordpress.com/20..."}, {"userName": "Lola  Reviewer", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "Oh yes, this is what I’m talking about. I almost didn’t read this sequel, because I struggled to finish the first book, but I’m Romanian so I was curious to see how Kerri Maniscalco would present my homeland as well as its history. Overall, she did a good job. Obviously she consulted with Romanian speakers because she didn’t make any mistakes in the writing of the language. Thank goodness as I really hate to have to mention when they do in my reviews and it can very much be a deal breaker in some cases.I was interested in this mystery from day one. There are a couple of deaths under mysterious circumstances occurring and the population believes their centuries-dead Prince Vlad Dracula is behind the attacks. Just to make things clear, while this historical figure inspired Bram Stoker’s novel, Vlad Dracula was not a vampire. Because of the gruesome ways he employed to kill his enemies, some entertained the idea, but alas (or fortunately) he was not a creature pertaining to the fantasy world.But I liked that this book did indeed entertain the idea. It made me wonder if maybe someone hunted for prey as a vampire would or fancied themselves to be the latter. I couldn’t know for sure, but I was simply happy to know as much as Audrey and her sidekick did. It’s probably wrong for me to call him a ‘‘sidekick,’’ seeing that he is important to the story and helps find answers as much as Audrey does, but am I the only one who is tired of the sarcastic flirty comments? I’m surprised I even minded them, as I normally enjoy clever back-and-forths, but I had the feeling Thomas Cresswell tried too hard to become the next Will Herondale. Good thing he cares about Audrey in a truthful way, even though he makes annoying mistakes, otherwise I would not have been able to tolerate him. Perhaps the number of comments will decline in the future tomes? Eh, I doubt it. It was a pleasure to read this mystery. However, it is not terrifying or worth being categorized as a ‘‘horror’’ story. Only the spiders made me want to read faster, but then again I had so many spiders in my room last summer that now instead of scaring me they’re just being bothersome. In a pros and cons list, this would be a pro by the way. I prefer not to have nightmares, thank you very much. But to go back to the storyline, I especially enjoyed and appreciated the Romanian culture, history and folklore incorporated. No wonder I love fantasy; I come from a place with a past most peculiar. While I was eager for Audrey to undercover the identity of the murderer, I took pleasure in the journey. That’s the most important part. The ending lasts only a couple of pages, but the journey lasts a couple of hundreds of pages. I feel as though I understand Audrey and Thomas much, much better after today. In the predecessor, we are introduced to Audrey’s family, but in this sequel, we are introduced to Thomas’. Some lovely new faces—and some you’ll want to forget. I sure can’t wait to see what else the author has in store for us. To America!Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Maram", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/36873117-maram", "userReview": "I chanted all throughout this slow paced book that I was here for Thomas Cresswell and it worked because by the time I reached chapter 38, I couldn't put it down. Hunting Prince Dracula is a lot more complicated in its mystery aspect and there was just so much going on in the forensics institute that both leads were in. I couldn't accurately predict the killer but I'm so glad how it turned out in the end. Of course, just like in Stalking Jack the Ripper, there were lots of healthy bickering between Audrey and Thomas which kept the story alive and will make you want to root for them even more in this book. \nFAV QUOTES:1. \"You're dressed for sneaking about Dracula's castle. Be still my thawing, dark heart. You certainly know how to make a young man feel alive Wadsworth.\"2. \"If we're all being hunted by some highly creative murderer, we might as well enjoy our last moments alive.\" he continued. \"Might I offer a few alternatives to spiders and dingy tunnels? Perhaps drinking too much wine. A warm fire. Inappropriate flirtations.\"3. “Monsters could wear the smiles of friends while secreting away the rotten soul of the Devil in the darkest crevices of themselves.”------★ buddy read ★ with my queen 🌸Despite the mystery element in Stalking Jack the Ripper being predictable from 4 chapters in, I still quiet enjoyed it and hope that Hunting Prince Dracula surprises me. I also can't deny that I'm here for Thomas Cresswell and only Thomas Cresswell :) (c)"}, {"userName": "Riley", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/23179211-riley", "userReview": "Audrey Rose is not here for anyones misogynistic bullshit"}, {"userName": "The Girl Murdered by Her TBR", "userReviewDate": "Oct 24, 2017", "userURL": "http://www.goodreads.com/user/show/53967892-the-girl-murdered-by-her-tbr", "userReview": "5 freaking stars!!!If Nancy Drew and National Treasure had a book baby it would probably this book (just add gory murders). If I had some issues with Stalking Jack the Ripper, this book managed to wipe all of it. It was phenomenally awesome!!! The suspense, mystery, horror, adventure, and romance was superb! In the first book I had a problem with the identity of the culprit because it was too obvious, but with this book? My brain totally failed to guess the culprit. It was that surprising and good. The setting was more exciting because I love everything about Transylvania. This place is rarely featured in books and even movies, which made me more thrilled and happy to read this book.I still love Audrey Rose and Thomas Cresswell in this book. Audrey was somewhat different from the girl she was on the first book. She experiences extreme sadness because what happened in the first book. Well. There is no doubt that Thomas Cresswell managed to wipe me off my feet. I really wish this dude is a real person so I can make him mine. I love him so much. I love how smart, observant, brilliant, charming, flirty, and absolutely adorable he is. I'm glad how the sexual frustration was solved in this book. I was half-swooning, half-frustrated with their flirting because THEY ARE A TEASE. A FREAKING TEASE. I can't wait to read Escaping from Houdini!"}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "3 ½ stars, rounded up because… well, it was really entertaining, and also overall of much higher quality than book one. And wow, I suddenly love the two leads? I’m going to be talking about this a lot in relation to Stalking Jack the Ripper. So here’s that review.First let’s talk about the mystery, because that was something I didn’t like in book one and… wow, I love him. The cleverness of the solution here has really stepped it up. I didn't guess the solution at all. Okay, for the most important part, let’s talk about characters, because that is the real success of this book. I really really really like Thomas - I only liked him in the last book - and I never like love interests in books like these. He’s such a good man. There’s a scene in this book where he totally fucks up, and I was expecting it to be glossed over completely, but he immediately apologizes and doesn’t blame Audrey Rose at all. Speaking of such, \nI love Audrey Rose.\n Audrey Rose is suffering from severe ptsd and I think the way she is written here is so clever, so beautiful, so stunning. I love her. And \nI also love their relationship.\n Just… every scene between them is so tense. I love it. K, let’s talk about Same issue with the lack of discussion of colonialism in Audrey Rose’s backstory - she’s biracial and Indian and that’s really awesome but colonialism is like… not discussed at all. BUT I will say the feminism thing has improved a lot - so many of the major characters in this book are ladies and it's great. There are even side sapphics and it's what I deserved. But perhaps more in the vein of feminism, I adored the narrative around Audrey not wanting to be protected and Thomas having to learn not to violate that but being totally willing to work on his own privilege. I felt like the takedown of that was missing from book one?Unfortunately, I did think this one could've used some \nediting down\n - it's a hundred pages longer than the first book and it really drags in the middle. Part of that is the fact that the plot points feel less convoluted and weird and thrown-in, which is good, but Kerri Maniscalco hasn't quite gotten a handle on how to make plot points that aren’t convoluted but are still interesting, which means there are just fewer interesting plot points.I think my slump ruined my enjoyment of this book a lot but also... it was good. I’m so invested in the two leads. Blog | Goodreads | Twitter | Youtube"}, {"userName": "Amber Robertson", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "Thank you to Hachette Children’s Books for kindly sending me a copy to review. All thoughts are my own, however.TRIGGER WARNINGS: anxiety, grief, murder, gore and PTSD.THIS REVIEW & OTHERS CAN ALSO BE FOUND ON MY BLOGR A M B LEI try to make it known that Kerri Maniscalco is one of my favourite authors. I don’t know If I’ve made that clear, but I love her. Is that too far? She just seems like an incredible person and I am absolutely in love her writing. Hunting Prince Dracula met every expectation I had and more. Maniscalco manages to weave a haunting and mysterious tale that incorporates romances between incredible characters. She puts her twist on historical fiction and she does it well.This book features some things that the first didn’t, though. We still have the feminism in place for our main character, and even more feminist characters are introduced throughout the novel. However, the events of the first book are weighing down on our main character. Audrey Rose is plagued with flashbacks to what happened (what I’m labelling PTSD) and anxiety, while also dealing with an immense amount of grief. I’ll speak more on these later, but the author deals with these particular topics in a way that is perfectly integrated into the story. The mental health incorporations are seamlessly introduced and, in my belief, treated with care as they should.I’m not sure what else I can ramble about. This book features a diverse cast and is one of the only historical fiction novels I can find myself sitting through without getting mad about the treatment of women. Audrey Rose and Thomas are incredible and the overall cast of characters is beyond interesting. Not a single event in this book can be viewed as filler and it is my belief that this book in no way suffers from second book syndrome.P L O THunting Prince Dracula is quite clearly a mystery. Our main characters are looking at becoming forensic scientists (I believe? They basically cut open dead bodies) and are now travelling all the way to Romania to further their studies. This is pretty amazing since Audrey Rose is a woman in the 1800’s.However, wherever our main characters go mystery follows, it seems, and soon the pair is caught up in the strange murders that are plaguing the village near them. Villagers are going missing and the legend of Dracula is returning. The puncture marks and lack of blood in any of the victim’s bodies make it easy to believe one thing; the Strigoi have returned.While all this is happening, Audrey Rose is struggling to come to turns with what happened in London a few weeks prior to her attending this school. The idea of another killer on the loose sends her into a spiral of fear. It was interesting to see her reactions to certain events, how she had to do her best to remain unflinching in order to be seen as an equal to her peers. I loved seeing the friendships she made and how she did her best to remain ‘a proper lady of society’ while doing things that no one of that era would approve of.The mystery is beautifully woven in a way that you are second guessing everyone. I worked out it was pretty early in the book but I was second guessing myself the whole way until the reveal. It was incredible. I could barely keep my draw my dropping. I was also grinning giddily in public at other parts.So, warning, don’t read this in public if you are afraid of people watching you.C H A R A C T E R S#A U D R E Y R O S EAudrey Rose is everything I want to be and more. She is an icon. I have gone through some events in my life that have lead to me being slightly untrusting and cautious of new people. However, in some ways, Audrey Rose has gone through more traumatic scenarios and still fights for her rights in a man dominated world. An absolute icon.Throughout this book we witness her discovering herself more. Who she is when she isn’t surrounded by people she grew up with and when the restrictions that society have placed on her seem to get left behind. It was enchanting. Can I say that? Well, I just did. I just absolutely adored seeing how she dealt with situations and viewing her struggles with her mental health.It was absurd, in some ways, to see struggles I face on a day to day basis reflected in another character. I don’t know. Whenever there is PTSD in a book I immediately have so much love and appreciation due to my own struggles. Especially when it’s done amazingly well. And, let me tell you, it was like Maniscalco had gone into my head and plucked thoughts and feelings to put in text. I just have no words to describe how reading a character so like me felt.#T H O M A SThomas Cresswell is the actual love of my life. I have never read a character who I would love to meet in person (and probably fall in love with him only to be rejected, it’s how my life goes, friends). He is everything I want in a man. I truly didn’t know it was this possible to fall in love with a character. I may need to change degrees and learn how to create humans (I have no idea on science, clearly) so I can form my own Thomas Cresswell for myself.On a more professional note (big joke there, when are my reviews ever professional?) Thomas is an incredibly complex character. The way he develops and grows in this series. His charm, his sarcasm, his adoration for Audrey Rose. It is all so completely swoon-worthy. The fact he is merely there to be her sidekick rather than the focal point. He is okay taking the backseat and letting her drive which is a dream.Thomas was a tad absent this book due to mistakes he made and were dealt with amazingly, but I could still feel his presence as we learnt more about his past and how he was connected to Romania.Basically, I love Thomas Cresswell and I would give away all my books to find a guy like that (not really, but let’s pretend).O V E R A L LOverall, Maniscalco did it again. She has delivered another incredible story that leaves you on the edge of your seat in anticipation. She has delivered a story with a full cast of characters that will instantly become some of your favourites. She has delivered a masterpiece, in my opinion, that has immediately shot to my favourite 3 books of this year (maybe ever). I am truly anticipating book three and what I can do to wrap my greedy little hands on it despite the fact it’s only in the draft stage.Happy reading, everyone! And, if you have time, you need to pick up this series."}, {"userName": "Fables&Wren", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/42780417-fables-wren", "userReview": "WrensReads Review:This book just screams gloomy-enchantment. Like the ton of Van Helsing or Dracula (that’s probably the point). There’s just so much to talk about but so little that I can say.Audrey Rose and Cresswell are off to study the dead at a once-castle in Romania. But from the moment they got on the train, there is a trail of murders for them to solve already. No matter where these two go, there is always a mystery to solve.The worst part about this whole murder-thing is that they all look like vampires did them. Blood drained... bite marks... garlic... the whole package is there. Heck, the castle is even infested with bats to put the cherry on the cake. So could the supernatural make an appearance in this lovely gory series?The characters are by far the best points of this series. Audrey Rose is are protagonist and she is going through major PTSD from the last book. The author really does show that in a light that is realistic. She doesn’t use it as a tool to make you feel sorry for her or cripple her; she uses it as a growth tool. Audrey Rose has flashbacks to that awful night she discovered who was Jack the Ripper, and it wasn’t just going to go away.“I have a feeling you haven't invited me here for kissing. Though it never hurts to ask. You're dressed for sneaking about Dracula's castle. Be still my thawing, dark heart. You certainly know how to make a young man feel alive, Wadsworth.”Cresswell is as charming as ever. His wit is sharp but his understanding is lacking. He constantly is dealing with “I thought that you would think it was funny” or “I thought I was doing the right thing” and he is growing constantly and understanding the people around him (mainly Audrey Rose). You also get to learn more about his past and where he came from. This whole story is just so thought out and well written. Oh! The writing! It is just a poem and weaves so well together. You get the chills down your spin from the eerie atmosphere and the gore that is so beautifully worded. WrensReads | Goodreads | Twitter | Instagram---AHHHHHHHHHHHHHHHHHHHHHHHHHHH RTC.---This is just as thrilling as the first book and I'm LIVING for it. ---OH YOU SAY YOU HAVE A BAT PROBLEM IS THAT BECAUSE YOU'RE A VAMPIRE JUST TELL ME---She has such PTSD from the ending of the last book... this poor girl 💔"}, {"userName": "Rachel E. Carter", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/29482005-rachel-e-carter", "userReview": "THAT ENDING WAS SO GOOOOD!!! I adore Creswell & Wadsworth SO. MUCH. And a total teaser for the next book, I can't wait. GOING TO AMERICA!!! Also, seriously, you guys need to listen to the audiobooks for these -the narrator is FANTASTIC."}, {"userName": "Jiana", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/10502567-jiana", "userReview": "I am only giving this book 3 stars because of Thomas Cresswell. The book actually deserves a lower rating. I can't believe how disappointed I am. I will begin with the plot, which I absolutely did not give a shit about. Comparing this plot to that of Stalking Jack the Ripper? This one fell horribly flat. It was so mind-numbingly boring and dull. I literally didn't even try guessing the murderer, I just did not care who it would be. I wasn't invested one bit. I started this book incredibly excited; I've been waiting to read it ever since I finished Stalking Jack the Ripper. First because, obviously, Thomas Cresswell and second because everyone says this one is much better than the first. WOULD YOU LOOK AT THAT? AN UNPOPULAR OPINION. I enjoyed the first one way way more. Literally if Thomas Cresswell was not in this book, I would have DNFed. BUT of course, I'm excited about the upcoming book because I still love the series overall.\n“Perhaps it was time for fathers to teach their sons how to behave around young women. They were not born superior, no matter how society falsely conditioned them. We were all equals here.”\nNow... the best thing about this book and the reason I couldn't give it a lower rating: Thomas Cresswell. Where do I begin? Ugh, I love him so damn much ajhsdajsh. LIKE LITERALLY YOU GUYS, IF YOU ARE STILL CONTEMPLATING READING THE SERIES, JUST DO IT FOR THOMAS. He is so worth it I promise. I admit there was one scene where I got so very angry at him. I was actually very shocked at the scene. Like?? Cresswell?? What the fuck?? But I love him too much to stay angry at him for more than 3 pages so yeah. I also did like how Maniscalco presented the themes, specifically PTSD and feminism, but I won't go into details because honestly I don't have much to say about it besides that I liked how they were presented and shown! Additionally, Audrey Rose is a fantastic MC. She's flawed and strong and resilient. She refuses to be undermined and belittled and knows her worth. I absolutely love her.\n“For there are no limits to the stars, their numbers infinite. Which is precisely why I measure my love for you by the stars. An amount too boundless to count.”\nAnother reason I was angry at this book was the romance. NOT BECAUSE I DISLIKE IT. NO. I ADORE AUDREY AND THOMAS TOGETHER. Part of why I enjoyed Stalking Jack the Ripper was the slow-burn nature of their relationship and their continuous banter. We see that in this book, but... I did not enjoy it. I just did not overly enjoy their ship as much as I did in Stalking Jack the Ripper. I mean I get why Maniscalco opted for that. It's a book set in 1880's, so naturally romance was done differently and I get it 150%, I just did not expect to see a slow-burn here too after Stalking Jack the Ripper. BUT OH WELL. Buddy read with my angel. ♥"}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "[ This book ends with the characters heading off to America, I'm so curious what mystery the next book will tackle! (hide spoiler)]"}, {"userName": "Caitlin", "userReviewDate": "Oct 05, 2017", "userURL": "http://www.goodreads.com/user/show/57334157-caitlin", "userReview": "I hate to do this. I honestly despise giving this book a 3 stars. I absolutely adored the first book but this one certainly fell flat for me. It took me 7 days to read it and I spent all 7 of those days pretty much bored and detached from the entire plot and characters. I’m so sad with how disappointing I found this book. I had such high expectations and clearly they were not met. I’m still very excited for the next book and I will definitely try reading this book again because perhaps I just wasn’t in the right mood for it."}, {"userName": "Sara (sarawithoutanH)", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/7397330-sara-sarawithoutanh", "userReview": "Such an improvement from the first book. There were way more side characters and intrigue in this sequel. I enjoyed the mystery so much more than the last and thought the resolution was better."}, {"userName": "Tweebs♥️", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/35431290-tweebs", "userReview": "If i could sum up this book in two words, it'd be sexual frustration Yeah trust me, you're reading that correctly. RTC"}, {"userName": "Miranda (MrsLeif's Two Fangs About It)", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/15295977-miranda-mrsleif-s-two-fangs-about-it", "userReview": "OH MY GOOD GOLLY GOSH. THIS BOOK WAS SO FREAKING GOOD. I THOUGHT THE FIRST BOOK WAS AWESOME, BUT THIS BOOK TOOK IT TO A WHOLE NEW LEVEL!!!Let's start off with the setting of this book. I freaking LOVED the Romania setting of this book. With the enchanting forests, creepy castle, and medieval village, there was a lot to love. The author did such an amazing job describing the setting in such a luxurious and detailed manner. I genuinely felt like I was in this world right alongside the characters.SPEAKING OF CHARACTERS, I SHOULD TALK ABOUT HOW MUCH I ADORE THE CHARACTERS IN THIS SERIES. Audrey Rose is seriously my idol. She is such a smart, determined, kind, and headstrong girl. One of the things I loved about her in the first book was how much of a feminist she was, especially in her time period. I was happy that her strong feminist views were still EXTREMELY present in this book. Audrey NEVER let people bring her down due to her sex. SHE IS SUCH A STRONG AND FIERCE WOMAN AND I LOVE HER FOR IT. Audrey was coping with some dark subjects in this book and it broke my heart to see her in such a dark place. The author did a great job at writing Audrey's PTSD in such a realistic manner. It was such an important element in this book, and it was executed wonderfully. OKAY, NOW I CAN TALK ABOUT THE LITERAL LOVE OF MY LIFE, THOMAS. Thomas was just as smart, cunning, hilarious, snarky, and loyal as EVER in this book. There was a lot of character development for Thomas in this book and there were a lot of things revealed about Thomas that shook me to my core. He dealt with a lot in this book and I JUST WANTED TO REACH THROUGH THE BOOK AND GIVE HIM A HUG. HE IS A PRECIOUS CINNAMON ROLL. THOMAS IS AS CLOSE TO PERFECTION AS HUMANLY POSSIBLE. Thomas made a few mistakes in this book, but he had good intentions and I still loved him anyway. \n“I have a feeling you haven't invited me here for kissing. Though it never hurts to ask. You're dressed for sneaking about Dracula's castle. Be still my thawing, dark heart. You certainly know how to make a young man feel alive, Wadsworth.”\n\n“Finally, Thomas moved enough to whisper into my ear, his lips trailing along my jawline. 'You are most certainly going to be the death of my dignity, Wadsworth.'”\nHOW CAN YOU NOT SWOON ANYTIME HE SPEAKS?!?!? HOW?!?!I thought the banter and chemistry between Audrey and Thomas was intense in the first book, but this book took it to A WHOLE NEW LEVEL. OH MY LANTA. AUDREY AND THOMAS ARE SERIOUSLY SOULMATES. I WANT THOMAS FOR MYSELF, BUT SERIOUSLY, HIM AND AUDREY AND PERFECT TOGETHER. There were a lot of hurdles that Audrey and Thomas had to overcome in this book and there was some angst along the way. I loved that the angst in their relationship never felt over the top or unrealistic. The angst added the perfect little element of tension in their relationship. I SHIP IT SO SO HARD AND I LITERALLY SQUEALED ANYTIME THEY INTERACTED. MY POOR SHIPPER HEART COULD NOT HANDLE IT.The mystery is this book was addictive, fascinating, and completely engrossing. I was so absorbed in the mystery of this book and I got goosebumps on my arms numerous times when clues were revealed. This book had a lot of horror elements as well as gruesome descriptions of corpses. As disturbing as it was, I was enraptured by all it. The author's writing was brilliant throughout the enitre book. Kerri has become one of my all-time favorite authors. SHE IS SERIOUSLY A GENIUS. SHE IS A QUEEN. \n“For there are no limits to the stars; their numbers infinite. Which is precisely why I measure my love for you by the stars. An amount too boundless to count.” \nI could go on and on about how much I love this book. READ THIS BOOK. READ THIS SERIES. FANGIRL WITH ME. DIE WITH ME AS WE WAIT FOR BOOK THREE.5 /5 FangsMrsLeif's Two Fangs About ItFacebookTwitter"}, {"userName": "alyssa ♛ semi-hatius ", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/56485897-alyssa-semi-hatius", "userReview": "on hold, will continue laterI’ve lost interest in this, y’all. not rlly feeling any mystery/detective vibes right now but I’ll definitely come back to this later ☺️~ ~ ~ ~ ~ im mainly here for my baby thomas ❤️"}, {"userName": "Isa Cantos (Crónicas de una Merodeadora)", "userReviewDate": "Nov 05, 2017", "userURL": "http://www.goodreads.com/user/show/20954985-isa-cantos-cr-nicas-de-una-merodeadora", "userReview": "\"You should stop saying you're going to kiss me... and just do it\".\"Deberías dejar de decir que vas a besarme... y sólo hacerlo\".Después del intenso caso de Jack the Ripper que tuvieron que vivir Audrey Rose y Cresswell en Londres, los dos deciden trasladar sus aventuras a Rumania. Allí llegarán a estudiar al Instituto Nacional de Criminalística y Medicina Legal que, curiosamente, tiene su sede en el Castillo Bran, el lugar en el que vivió el famosísimo Vlad Tepes. Sin embargo, Audrey Rose y Cresswell ni siquiera han llegado a Rumania cuando se encuentran de frente con un extraño asesinato en el tren: el cadáver parece haber sido dispuesto como si hubieran matado a un vampiro usando todas las técnicas y supersticiones locales. Así, en medio de asesinatos de sujetos que parecen tanto vampiros como víctimas drenadas de toda su sangre, empiezan las aventuras de Audrey Rose y Cresswell para averiguar si el famoso Vlad Drăcul se ha levantado de entre los muertos a beber sangre nuevamente o si algún criminal lo está imitando. Al igual que con Stalking Jack the Ripper, Kerri Maniscalco logra que no confiemos en absolutamente nadie a lo largo de todo el libro. Hilando perfectamente el folklore de Europa del Este con respecto a los vampiros, se va creando una historia en la que la ficción empieza a confundirse con la realidad. ¡Y me pareció súper interesante que incluso se usaran palabras rumanas en medio de la narración! Sentía que el relato se tornaba mucho más auténtico y ambientado en el supersticioso Siglo XIX. En Hunting Prince Dracula la autora no olvida todos los traumas que los protagonistas desarrollaron por el traumático caso de Jack the Ripper. De hecho, en esta ocasión, Audrey Rose no solo está peleando con las fuerzas oscuras que rondan el castillo por la noche, sino también consigo misma y con el miedo constante de no ser capaz de recuperar su tranquilidad y racionalidad a la hora de examinar a los muertos. Por otra parte, nuestro misterioso y maravilloso Cresswell está ocultando algo muy interesante en este libro. Y no son sólo sus sentimientos por Audre Rose sino algo que corre muy profundo por su sangre. De verdad, alucino con lo intrincada e oscura que puede llegar a ser la historia de Rumania y la antigua Valaquia y con cómo Kerri Maniscalco la manipula sutilmente para que Hunting prince Dracula sea el libro oscuro e intrigante que es. La historia que viven Audrey y Cresswell no se limita a los muros del Castillo de Bran y a Brasov, sino que tiene que ver con la gran leyenda que se creó alrededor de Vlad Tepes, con las guerras, las líneas de sucesión y las Órdenes que han jurado mantener vivo el legado de su Príncipe. Sobre el último cuarto del libro empecé a pasarlo muy mal porque Audrey y Cresswell se inmiscuyen en las profundidades del castillo y se encuentran con horrores que sentía en carne propia. Las descripciones y la ambientación que creó Kerri Maniscalco en esos capítulos estuvieron tan bien desarrolladas que, en realidad, tuve pesadillas con una de esas escenas. Fue horrible, sucio, claustrofóbico y pegajoso. ¡Pero lo adoré! Fueron, sin lugar a dudas, las mejores páginas del libro que, muy a mi pesar, no tuvo el mismo ritmo de Stalking Jack the Ripper.Ahora, ¿podemos hablar de la tensión tan fuerte que hubo durante todo el libro entre Audrey y Cresswell? Porque... ¡MADRE MÍA! Mi corazón no podía con tantos preámbulos. Creo que nunca, nunca, nuuuuuunca había leído a un personaje tan coqueto y mordaz como Cresswell. Y es que, claro, Hunting Prince Dracula está ambientado en el S XIX así que no puedo esperar que se besen a la primera de cambio por el recato y el decoro y tal, pero la espera me estaba matando. ¡Y si yo estaba muriendo imagínense como estaba Audrey que es quien recibe todo ese coqueteo, guiños y frases inteligentes de Cresswell! Pero, como también se los decía en la reseña de Stalking Jack the Ripper, Kerri Maniscalco no deja que el amor secuestre la trama principal del libro. De hecho, usa el coqueteo y la tensión entre Audrey y Cresswell para mantenernos enganchados, pero sin dejarnos olvidar que han encontrado un montón de cuerpos sin una gota de sangre dentro de ellos. ¡Oh! Y, además de todo eso, adoro que Kerri rompa con toda clase de estereotipos e introduzca de una manera nada forzada a una pareja LGBT en la trama. ¿Y qué decir del final? Está a la altura de todos los misterios y pistas que han ido apareciendo en el camino de Audrey y Cresswell. ¡Y es inesperado! Una vez más, Kerri nos despista para que el asesino sea alguien que estaba frente a nuestras narices pero que jugaba tremendamente bien su papel. Ahora, y con la aparición de un personaje al final del libro que nos adelanta que la siguiente aventura de nuestros protagonistas será en Estados Unidos, no puedo esperar a leer con qué asesino o leyenda nos encontraremos esta vez. ¡Qué nervios!"}], "description": "Following the grief and horror of her discovery of Jack the Ripper's true identity, Audrey Rose Wadsworth has no choice but to flee London and its memories. Together with the arrogant yet charming Thomas Cresswell, she journeys to the dark heart of Romania, home to one of Europe's best schools of forensic medicine...and to another notorious killer, Vlad the Impaler, whose thirst for blood became legend.But her life's dream is soon tainted by blood-soaked discoveries in the halls of the school's forbidding castle, and Audrey Rose is compelled to investigate the strangely familiar murders. What she finds brings all her terrifying fears to life once again.", "title": "Hunting Prince Dracula\n      \n          (Stalking Jack the Ripper #2)", "url": "http://www.goodreads.com/book/show/33784373-hunting-prince-dracula", "average": 4.39, "cover": "https://images.gr-assets.com/books/1489420853l/33784373.jpg", "reviews": 1610, "authors": [{"url": "https://www.goodreads.com/author/show/14584166.Kerri_Maniscalco", "name": "Kerri Maniscalco"}], "type": ["Historical", "Young Adult", "Mystery", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/33784373-hunting-prince-dracula", "http://www.goodreads.com/book/show/34849684-hunting-prince-dracula", "http://www.goodreads.com/book/show/36796731-hunting-prince-dracula", "http://www.goodreads.com/book/show/28962906-stalking-jack-the-ripper", "http://www.goodreads.com/book/show/30375937-escaping-from-houdini", "http://www.goodreads.com/book/show/37539001-untitled", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}