{"ratings": 68811, "userreviews": [{"userName": "Nataliya", "userReviewDate": "May 02, 2010", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "[\"And suddenly he thought, I'm the abnormal one now. Normalcy was a majority concept, the standard of many and not the standard of just one man.\" (hide spoiler)]"}, {"userName": "F", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/8161922-f", "userReview": "I loved this book! Was very creepy to read.I thought it was brillant from beginning to end.One of my favourite books of all time ever!That ending! WOW"}, {"userName": "Mary ~Ravager of Tomes~", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/1452829-mary-ravager-of-tomes", "userReview": "Hm.Honestly, this is a tough book to review.I did like the story, but one of the biggest bothers  for me here was not fully understanding why the world has gone to shit & why everyone is now a vampire. The book just drops you right in the middle of Robert Neville's situation, which is a day to day existence of killing vampires during the day & hiding in his house during the night.I'm the kind of SF reader who likes a bit of depth to be given to the cause of disaster, and this story largely glosses over the \"Why?\"But I'm coming at it from the angle of a reader who has exhausted the zombie/vampire/virus genre. For the time it was written, this probably struck readers in a much different way. If you're basing your opinion of this book solely off your knowledge of the movie, I'd ahead and throw that idea out the window because this book is nothing like the Will Smith, good-guy-out-to-save-humanity, crying-over-his-dog, self-sacrificing version Hollywood has created. This is much darker.In fact, I imagine a group of important movie folks came to the conclusion that Matheson's story is \"pretty nifty, but how about we throw out all the deep, scary conclusions about human nature & amp up the action x1000 & also we need a German Shepherd in there so Smith comes off as even more relatable & wholesome.\"Robert Neville is not necessarily squeaky clean protagonist, and that realistic quality of his character is essential to the observations Matheson is making here. By the end, you aren't 100% sure what outcome you're rooting for & for me that is one of the most powerful aspects of how the story is told.But again, I'm not sure I'm fully on board with the details of why & how Neville has managed to survive for years under these conditions. Neville has brick- & rock-proofed his home against the vampires that are constantly trying to get in with a reliable supply of garlic. He sound proofs his house, has a gas generator that he keeps running by way of a nearby gas station, and an ungodly amount of alcohol, cigarettes, and wine in his home. I guess a scenario where all of those things exist in Neville's possession isn't outlandish but the story itself wasn't long enough to explore any sort of break down of these proofs, and thus it felt a bit unrealistic to me. Even so, Matheson does well in capturing the absolute lowest levels of human desperation, taking us down deep into the terrifying subconscious of a secluded man on the brink of losing his ability to be compassionate & remember what it means to be human. The pro here is, if you're curious about this story, it's short & will only take a bit of time to consume. If you don't love it, no big loss. If you do, well now you know!Unfortunately I didn't love it, but I appreciate the concepts here & I definitely enjoyed the last 1/4 a lot more than the first 3/4. Worth a read!This review and other reviews of mine can be found on Book Nest!"}, {"userName": "Jim", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "I just re-read this after watching some of the movies based on it. It's truly a chilling book. It's an apocalyptic novel. The vampire plague has destroyed our society. Much of the book focuses on our hero's loneliness. When he finds an uninfected dog, his attempts to befriend it are almost pathetic & truly heart-wrenching. It's well worth reading.There are 3 movies that I know of that are based on this book. The Last Man On Earth starring Vincent Price in the mid 60's. This follows the book pretty closely.The Omega Man starring Charleton Heston in 1972 is very loosely based on the novel, but a great look at the 60's & 70's attitudes. I Am Legend starring Will Smith in 2008 or so is the one I haven't seen yet. I caught the first 5 minutes & it bore no resemblance to the book & had really horrible CGI. Looked like a video game. I expected to see a Toon driving, not Will Smith.Update: I did finally see this movie including both endings. It was incredibly bad. The happy ending was ridiculous."}, {"userName": "Algernon", "userReviewDate": "Jul 09, 2013", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "I was going to rate the book a lukewarm 3 stars, but then I looked once more at the date of publication (1954) and reconsidered. A bit of historical perspective, of literary context elevates this novel to the well deserved 'genre classic' status. At the time Matheson published his science-fiction take on the gothic vampire myth, the market was a lot different from today's oversaturated landscape that has largely trivialized the subject and gave it a curious teenage romance slant. Even bringing in the scientific method of study for the phenomenon and its associated paraphernalia ( the bloodsucking, the garlic, the cross, the wooden stake, the fear of light, the sleeping underground, the bullet invulnerability) was probably a novel approach to a dusty theme: Something black and of the night had come crawling out of the Middle Ages. Something with no framework or credulity, something that had been consigned, fact and figure, to the pages of imaginative literature. Vampires were passe, Summers idylls or Stoker's melodramatics or a brief inclusion in the Britannica or grist for the pulp writer's mill or raw material for the B-film factories. A tenuous legend passed from century to century. I didn't much care for the prose: it is concise and clear in its presentation of the main themes but I found it lackluster and unconvincing when it tried to delve deeper into emotional intensity for the main character. I could also complain about the lack of action, but I believe this is more a novel about ideas than a high octane action thriller. To finish with the grumbling, I would have liked a more rigorous attempt with the scientific speculations. Most of the ideas are sound, but the way they are fitted together seems fishy, with some of the argumentation incomplete. Let me give you a few examples :- vampires are destroyed by sunlight, yet when they are hidden in deep cellars and dark places during the day they are still handicapped- the transmission is supposed to be airborne, yet two other theories are given equal importance : direct contact with open wounds and insect bites (mosquitoes)- bullet wounds are instantly healed (didn't they have exploding ammo in 1954?) yet knife cuts are still bleeding- the disease affects the brain, but in a curious way : speech is unimpeded yet the use of tools is lost and social interaction is lost.The last one is the one I struggled with the most. Other reviewers noticed also that the monsters are closer in behaviour to zombies than to classic vampires. Cesar Romero cites the book as a primary source, Stephen King alsao makes reference to it.On the positive side, two aspects of the novel stand out and will probably come to define it for me in later years as the actual details of the plot will fade from memory:- the psychological pressure of being the last man on earth : Richard Neville is utterly alone, he has nobody to turn to, has lost his wife and kid in horrible circumstances, yet he must find the resources inside himself to go on living from day to day. His heavy drinking, his episodes of paranoid depression and self destructive rage are painfull to watch, as are his efforts to organize his daily routines with checklists and his obsession in hunting down his afflicted neighbours when they are incapacitated during the day. The episode of the feral dog is probably the best written part of the whole novel.- the implications resulting from the demotion of humanity from the top of the food chain, something that I have remarked upon in another classic I read earlier this year (The Day of the Triffids).  Normalcy was a majority concept, the standard of many and not the standard of just one man.  exclaims Neville towards the end of the novel, when he realizes that the monster from the fairytales is in fact himself. The future of the human race might well be carried on by people with wings or by people who use photosynthesis instead of eating solid food or by vampires who drink blood and go out only at night.[edit] for spelling"}, {"userName": "Matt", "userReviewDate": "Feb 22, 2016", "userURL": "http://www.goodreads.com/user/show/1232712-matt", "userReview": "I’m not much of what you might call a “vampire guy.” By which I mean both that I am not a vampire, or a guy who likes vampires or vampire-themed endeavors. Thus it stands to reason that I never would have read Richard Matheson’s I Am Legend had not the wildcard of my book club chosen it as this month’s selection. Frankly, I was a little underwhelmed by the choice. The critical “blurbs” did not help matters along. Dean Koontz said it was the “most riveting vampire novel since Dracula,” which is great, except my last – and only – vampire novel was Dracula. Another blurb called it one of the “ten all-time best novels of vampirism.” If I loved vampires, this would be meaningful. But really, I’m vampire-neutral. Maybe even slightly vampire-negative. (I mean, with the whole Twilight thing). I wholly support zombies, however. But really, I Am Legend isn’t strictly a vampire book. (At 170 pages, it barely achieves book status at all. It's really closer to a novella). Instead, it straddles genres, stubbornly refusing to be one thing or another. Perhaps this is the reason people keep trying to turn it into a satisfying film. It is a potent canvas ripe for many different kinds of tales. The main storyline is pure apocalyptic fiction. The novel opens with our protagonist Robert Neville as the putative last man on Earth. It is 1976, which stands in for the future since this book was first published in 1954. There has been some sort of war/disease combo that is elliptically alluded to in a short flashback. The human race is either dead or turned into vampires (Or both? Are vampires undead? I suppose I could look this up...). The exception, of course, is Robert. Woven into the end-of-days context is an old fashioned cast-away story, akin to Robinson Crusoe or The Swiss Family Robinson. I Am Legend begins well into the vampire apocalypse, introducing Robert as a man who has learned to survive. It takes us through a typical day: waking up; eating breakfast; making repairs to the house; leaving the house to kill sleeping vampires or pick up supplies; returning home; making dinner; listening to music; getting drunk; trying to ignore the vampires outside your house who are taunting you both verbally and – in the case of the female vampires – sexually. (Because anything having to do with vampires has to touch on the repression of sexual urges in some manner). I Am Legend is also, and most fascinatingly, a grim kind of character study. Matheson makes a rather daring literary choice in not giving Robert anyone or anything to play off of. There is not another human to talk to. There is no pet. There is not even an inanimate object like Cast Away’s Wilson to act as a sort of muse. There is only Robert. He is an angry, bitter man, which is altogether understandable. He is also a high-functioning alcoholic. Also understandable. The novel's high points are a couple powerful sequences in which this hard, down-to-basics shell is peeled away to surprisingly moving effect. (If that ambiguous sentence leaves you scratching your head, I have succeeded). One thing I found entirely missing, other than people, is any semblance of lightness or joy. Robert – who lives in the LA-area – never has any fun with his sanctified status as last living avatar of the human race. He doesn’t go into a museum, take all the famous artwork, and then use it to decorate his bedroom. He never goes to an adult bookstore and takes all the porn. I suppose this is closer to a realistic response to losing your family, friends, and the rest of the world. Still, we can all use a laugh now and then, right? Matheson tells this story in the third-person limited. The point of view is strictly confined to Robert and what he is seeing, feeling, thinking. The result is a constricted, almost claustrophobic atmosphere. Robert’s world is as small as it is empty. Matheson makes you feel the cramped confines of Robert’s fortress-house. He is also good at suggesting the creeping madness that comes along with that confinement. I can’t say much more without venturing into spoiler territory, and I don’t want to do that. So instead of dancing around themes or vaguely hinting at plot-points for another 1,000 words (which is actually my first inclination), I'll just wrap this up. This is a quick, surprising little novel with a slammer of an ending."}, {"userName": "Emma", "userReviewDate": "Jul 09, 2017", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "This was creepy and sad too. I don't think I would have lasted long as the last person alive. I would have just given up and let myself get caught! The vampires of this story are quite zombie like, I thought. How events turn out in the end surprised me."}, {"userName": "Morgue Anne", "userReviewDate": "Jan 07, 2008", "userURL": "http://www.goodreads.com/user/show/62480-morgue-anne", "userReview": "I just finished reading this book. Completely different from the movie (The 2007 version), I wish they would have gone with this story instead. The reader spends the whole story (Which is really only 170 pages) following the last man on earth as he fights for his survival against vampires (and yes, they are vampires). He boards up his house, stocks up on canned goods, and researches a way to combat this disease. He is not a doctor or a scientist, just a regular man stuck in an irregular situation. But, as Matheson so beautifully states, \"Man can get used to anything\", and so he does - burning corpses left on his doorstep by his vampire \"friends\", gathering fresh garlic, and fixing up his house for them to come back each night and try to drag him out.Robert, the main character, spends years in this manner. He breaks into a nearby library and gathers an armload of books on anything and everything he thinks will be useful. In this way, Richard Matheson gives us the first realistic look at vampires from a scientific standpoint. Some vampires are afraid of crosses because of experiences in their pre-infected life. None can stand garlic - but it must be fresh and strongly scented. The reason they turn to dust? Well, read and find out. Learning the few ways there are to destroy them, Robert makes an attempt to kill a handful each day.**SPOILER**What he doesn't realize is that these creatures are not mindless zombies. They have emotions and desires beyond that of fresh blood. While Robert spends his nights locked away in his home, the infected have set about creating their own society. The most heart-wrenching moment (A phrase I do not use lightly) comes when a female vampire looks at Robert and tells him \"I had a husband. You killed him while he was sleeping.\" They are not the blood-thirsty monsters he believes them to be. In fact, in their world, *he* is the monster, and that is where the book gains it's title. \"I Am Legend\" is like saying \"I Am Boogeyman\". A fantastic look at who the monsters of this world really are."}, {"userName": "Justin", "userReviewDate": "Sep 13, 2015", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "1. I'd like to take this opportunity to apologize for all of the Will Smith jokes. It's going to be difficult, but I will refrain from including him in this review.2. Stuff I liked - Matheson does an amazing job in describing the situation Neville has deal with as the only person left in the world. The scariest parts for me where when Matheson deals with themes like isolation and loneliness. That stuff was much more terrifying than the vampires (more on them later). There were entire chapters of the book describing Neville's fruitless attempts to find companionship. Those chapters along with the glimpse into Neville's past with his family were really, really good. Being alone like that is much scarier than....3. Stuff I didn't like - vampires. Yeah, I get it. They add another level of fear to the story, and that's fine. I just felt like when the story was really taking off, it would hold itself back by getting too technical with what these creatures were, how to kill them, how to test their blood to see if they were infected, whatever. I wanted to hear more about Neville's family and how he is struggling to survive and less about what he reading at the library. Also, I'm not really huge vampire fan anyway. I'm more of a ghost story, monster in the closet, things that go bump in the night kind of guy, I guess.4. (Don't do it, Justin. You said no Will Smith jokes this time.... don't.... do.... it............Click \"Save\", Justin. Get outta here.)"}, {"userName": "Tfitoby", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/5454475-tfitoby", "userReview": "I Am Legend by Richard MathesonMy rating: 4 of 5 starsBlurb: Robert Neville is the last man left alive on Earth...but he is not alone. Every other man, woman and child on the planet has become a vampire. Neville spends his days scavenging for food and supplies, and hunting down the undead in their lairs in the ruins of civilisation. At night, he becomes the hunted and barricades himself in his home, waiting and praying for the dawn.I Am Legend was one of the first, and certainly the most brilliant, fusions of horror and science fiction. Its powerful and disturbing reworking of the vampire myth has made it a classic and enduring novel that has had a profound impact on generations of writersThoughts: Having seen Omega Man and the recent Will Smith movie adaptation and heard a few different people talking about the differences in the book I managed to put together a strange 'ideal' composite of what I imagined this novel to be, leaving me in the strange situation of having three stories going through my mind whilst reading an entirely different fourth one. Not exactly condusive to enjoying a book most of the time but in this instance failing at dampening the pleasure I got from reading Matheson's wonderful novel.It was and is very difficult to analyse this without comparing it to the movies, it's possible for example that if I had been unaware of the storyline this might have received a 5 star review, but as it is it may take additional readings for me to make that distinction.For now I will simply tell you that aside from being a powerful insight in to human loneliness and an intriguing premise of the last man standing amongst a spreading bacteria it is also a science fiction novel of the highest quality (whether the science used is correct or not it matters little to me, it is the presentation of the ideas that carries all the greats of the genre in my mind) and contains passages of prose that will leve you breathless in empathy and anticipation.I know little of the vampire legends and myths, I don't generally read books about vampires or vampirism, but Matheson gives you a strong grounding in it and then attempts to poke and prod the silliness of them; his assuredness that crosses will only work on Christian vampires and Mohammedan vampires would simply drink your blood when faced with a crucifix was a particular favourite revelation of mine. And the way the novel ends left me near certain that this has been integral to a lot of the more interesting developments in vampire novels/movies of recent times such as Sergei Lukyanenko nightwatch trilogy and Blade.All in all I can't recommend this novel highly enough.Originally posted at blahblahblahgay"}, {"userName": "Kat  Hooper", "userReviewDate": "Apr 28, 2011", "userURL": "http://www.goodreads.com/user/show/2177891-kat-hooper", "userReview": "ORIGINALLY POSTED AT Fantasy Literature.I don’t like vampire novels much, so I wasn’t planning to read Richard Matheson’s classic vampire story I am Legend which was published in 1954, is also known by the title The Omega Man, and is, of course, the basis for the movie I am Legend.But then I recently read and was enthralled by two other books by Matheson: The Incredible Shrinking Man and Steel and Other Stories. I realized that The Incredible Shrinking Man wasn’t really so much about a man who was losing his height as it was about a man who was losing his manhood. Likewise, the novella “Steel,” the titular piece of Steel and Other Stories and the premise for the movie Real Steal, isn’t so much about a fighting robot as it is about a man who, similar to the shrinking man, is fighting to keep his position in life. The psychological aspects of these stories fascinated me and I began to wonder if perhaps I am Legend wasn’t really about vampires after all.As I suspected, it’s not. Well, on the surface it is. Robert Neville is the last human being on Earth. Everyone else has been infected with a virus that causes vampirism, but for some reason, Robert is immune. He spends his daytime hours securing his house, staking vampires, and trying to discover a cure for the virus. At night he hides indoors while the vampires, some who are his former acquaintances, try to break in. During the story there are flashbacks which show the gradual loss of Robert’s family and friends to vampirism.I was fascinated by Robert’s preparations and daytime activities, and his studies to find the cause and cure for the virus. The thought, for example, of having free access to anything you want, including cars, jewelry, clothes, houses, art, scientific equipment, and every book in every bookstore and library in the world is exhilarating... until you realize that there’s nobody to share it with. All those things are almost meaningless outside of their social context.So, this is Matheson’s gut-wrenching focus — what it means to be the last human on Earth, especially when you’re fighting for your life. We all know that humans are social creatures, but none of us has actually experienced a total lack of companionship. What would it mean to rule the entire world alone? And yet, as depressing as that is, why, when there’s nothing to live for, do we still cling to life so desperately? Matheson writes so powerfully about these emotions. I ached for Robert Neville and a few of Matheson’s scenes had me in tears.The story is called I am Legend because Robert Neville gradually comes to realize that vampires, the creatures he thought were only legend, are real. Now, Robert Neville, the elusive human being who vampires fear, has become the legend.I listened to Blackstone Audio’s version of I am Legend which is perfectly read by Robertson Dean. This is one I will listen to again. By the way, I am Legend is not a full-length novel, so some versions include additional stories in a collection called I am Legend and Other Stories. ORIGINALLY POSTED AT Fantasy Literature."}, {"userName": "7jane", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/28266234-7jane", "userReview": "[frightening and tragic: seeing those ferals being destroyed, then being taken to be executed into the more-civilized and day-walking vampire camp. But in the end, one can sort of see that there might be a more hopeful, human-like future that Robert will not see... that there will be eventually a compromise-coexistence within these human-like vampires, that they will become more and more like the human's civilisation was before the plague - even though they are now still in the revolutionary, search-and-destroy stage of existence. (hide spoiler)]"}, {"userName": "Duane", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Richard Matheson may be the most underrated genre writer ever. When you look at a list of his books- I Am Legend, Somewhere In Time, Hell House, Duel: Terror Stories, What Dreams May Come- just to name a few, you realize how unique and diverse his talent was.This novel, I Am Legend, a perfect little bricolage of apocalyptic, dystopian, sci-fi, horror, vampire, zombie, is probably his best known work, although I'm partial to Somewhere in Time (Bid Time Return) being such a romantic sentimentalist.I haven't seen the movie which I understand is nothing like the book, which is too bad because I think the story is worthy of a good film.4 stars."}, {"userName": "Carol. ", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "There are some excellent reviews out there. I know I was complaining about sqeeing and gifs recently, but I can't help but think a classic book like this could use a little modern reviewing.Summary: I'm a little mixed in my reading reactions to a novella that feels more like a self-conscious allegorical tale than truly innovative storytelling. The short, choppy prose suited the narrator, but gave a more limited ambiance to the setting. Given the protagonist Neville's relatively easy ability in moving around the world (seems to take a little siphoned gas and he's go to go), I felt like it was an incomplete story that left me with many questions about the world. I do appreciate the sophisticated way Neville's personal history is blended in to the current experience, an impressive contrast to many writers who feel the need for long expository paragraphs, but I would have liked more. The limited description leaves something lacking, perhaps the extent of the devastation. Is it enough that Neville feels isolated? Do we need the steps of how he got there? What does 'humanity' mean if you are the only human? Why try to survive? I'm not sure, and as Neville poses these questions, I found myself wondering what he had done to find other survivors, the timeline of catastrophe, the extent of the world breakdown. The spare depiction make me feel like it was more of a metaphorical tale, a study in the psychology of the individual and his coping with isolation and meaning without context of society. In this respect, the movie was more able to give the visual sense of complete loneliness and the frustration of working for a potentially futile goal.It was also hard to have sympathy for Neville. Truly an Everyman, he drowned his emotion in alcohol as often as he attempted to control circumstance. I didn't admire or respect him; he was dogged but not creative or thoughtful. The lapses into existential questioning only reinforced the emotional distance.The ending was a surprise; perhaps more likeable than that of the movie, but also more self-conscious and created. There wasn't much build to the ending; there was very little sense of the \"types\" of vampires through the story--I had more of a sense of Neville's drinking preferences than the vampires. Still, it is a classic, so I'm glad I took the time to read it, but it feels a little too much like reading The Metamorphosis for my taste.Cross posted at http://clsiewert.wordpress.com/2013/0..."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Oct 30, 2009", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "[(The protagonist came down with a weakened form of the \"vampire microbe\", his immune system beat it, and he's immune. He is of course apparently the only one in the entire world to whom this happened). (hide spoiler)]"}, {"userName": "Megan Baxter", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "Yet again, I've been breaking the rules. This time, it wasn't on purpose! But I went into reading I Am Legend knowing the ending, knowing the twist. Years ago, you see, my husband had wanted to talk about the book, probably when the most recent adaptation to movie form had come out, and I am well known for not reading horror, so it wasn't an unreasonable assumption that I would never read this.So, wrong, in the long run, but it made reading this for the first time a very different experience than it would be for someone who was going into it cold. Note: The rest of this review has been withdrawn due to the recent changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Gabrielle", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/6753400-gabrielle", "userReview": "Let me being this review by saying that I never saw any of the movie adaptations of this book. I turned the first page of \"I Am Legend\" with zero knowledge of what Hollywood did to it because a friend of mine gave me an important warning. He said: \"When it comes to this story, there is no movie; there is just the book\".The story is Robert Neville's, the last man on Earth after a strange plague has turned every other human being into a vampire. He lives in a carefully barricaded house, stuffed with canned and frozen food, books and records, as well as a hothouse full of garlic. He spends his days in the same monotonous way: making stakes and roping up garlic cloves on every possible entrance to his refuge. When he's not doing that, he's using up all his stakes to kill the sleeping vampires in their dens. His nights are spend listening to the vampires crawling around his house, fighting among each other and trying to lure him out. He's kind of on the edge of going insane when the book begins: this has been going on for 5 months, and he's fraying at the seams.He manages to hang on to sanity when he decides to approach the vampire situation from a scientific point of view: catch one of them, get some of their blood, study it, try to find some sort of vaccine or antibiotic to cure the disease that took away everyone he loved. This goal carries him forward, until the day he finds himself face to face with someone else who can walk in the day time.I was pleasantly surprised by the quality of the prose: Matheson is succinct, but also very elegant, and he does built dramatic ramp ups of tension when you least expect it. \"I Am Legend\" is not the scariest book I've ever read, but I did make me turn the pages frantically because I had to know what was going to happen. He also conveys Neville's emotions very well: his paranoia, his heartbreak, his frustration...I won't spoil anything, but there's an obvious lesson in this book: to the \"monsters\", the \"good guy\" is a murderer. But more than the simple morals message, the thing that really stuck with me was the atmosphere of decay, paranoia and white-knuckle resistance to madness. It would be so easy for Neville to give up: all he has to do is walk out of his house after sundown and his struggle is over. But he resists, he holes up, he fights back. The so-called twist can have more than one meaning: the importance of perspective, sure, but also the futility of fighting something so big it can never, ever be defeated. It made me think of all those atrocious zombie TV shows (yes, \"Walking Dead\", I mean you!) where it gets to a point where you just want the dumb characters to get caught and bitten already, because they have committed so many atrocities to stay alive that they can't really be referred to as protagonists anymore.I also loved the way this book is a very self-aware vampire story. Neville gets to wondering what the deal is with the stakes and the garlic, and can't find any rational reason for their effectiveness. This little wink to the absurdity of the legends was a really nice touch of dark humor in what could have otherwise been a way too serious and depressing book.If you like vampire stories, this is a classic that you shouldn't miss! A quick, but riveting read with a great ending.(I still haven't watched any of the movies, and frankly, I don't intend to.)"}, {"userName": "Johann (jobis89)", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/50893023-johann-jobis89", "userReview": "\"The strength of the vampire is that no one will believe in him.\"Robert Neville is the last man on earth...or is he? Following the outbreak of an incurable plague that has mutated every other human on earth into bloodthirsty, nocturnal creatures, Robert Neville must scavenge for food and supplies during the day, whilst hiding in his boarded-up, vampire-proof home at night. Living a solitary life for so long is not easy, and so he is constantly on the look-out for fellow survivors...This was a buddy-read with my bestest friend, Abbie. We chose this because she is literally a speed-demon and if we had chose a long book, I would be lagging behind for too long! Turns out, I did lag behind anyway because even though we both finished I Am Legend pretty close to each other, my edition also had a selection of short stories written by Richard Matheson. So I'm only now \"finishing\" the entire book.I had watched the movie I Am Legend a number of years ago. All I can remember about it is Will Smith and a dog... and that's it. Although what I've found really weird about my reading experience is that I did not cast Will Smith as the role of Richard Neville in my head - Abbie said she did.I really liked this book, which was surprising to me given that its basically focused on one character. Usually I would find the lack of dialogue and conversation quite boring - although we did get some flashbacks to before the plague, which I particularly enjoyed, with some scenes being quite chilling. Similar to what Abbie said, the constant drinking and throwing whiskey around and smashing glasses did start to grate on me after a while. I understand his alcoholism - I'm pretty certain I might succumb to addiction myself if I was the lone survivor of some plague, but it just gets repetitive after a while. What was disturbing to me was his weird fascination with the female \"vampires\" - DUDE. What the fuck is wrong with you!!Okay, so I feel like the last paragraph had a lot of complaining, so I'll talk about what I loved. I loved the SCIENCE. I was geeking out over Richard's thoughts about what possibly caused the plague. He was basically conducting his own research and it was like reading my day-to-day experiences in the lab - disappointment after disappointment. A theory that seems so promising quickly dispelled. Microbiology and bacteria are my forte, so his research around this area had me nodding along in agreement. So that was awesome. The \"vampires\" themselves were pretty damn scary. I got confused at times because I was like \"Are they vampires or zombies? Or a mixture of both?\" There were different types and it just wasn't explained very clearly at times.As for the ending...WOW. I was blown away. One of the best endings I've ever read in a book. It felt completely out of left-field and left me a bit gobsmacked. AMAZING. I Am Legend was a great, quick read and I have to give it 5 stars out of 5. Matheson's writing is simply outstanding and I want to read more.With regards to the short stories, some were great and some were not so great. Prey was a brilliant short story, it reminded me of Battleground by Stephen King. Dance of the Dead was also pretty eerie. I didn't really include the short stories when giving my rating for this book, as I simply wanted to rate I Am Legend as a standalone book.But yes! More Richard Matheson is definitely on my radar. Now for another buddy read with Sadie, Mindi and Ashley from bookstagram - can't wait!"}, {"userName": "Graeme Rodaughan", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/56397934-graeme-rodaughan", "userReview": "[ until late in the novel. (hide spoiler)]"}, {"userName": "Vane J.", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/19590155-vane-j", "userReview": "I enjoy being alone. There's some kind of peace in loneliness. I'm never more happy than when I'm by myself. I've said, though, that if the loneliness if forced upon me, it's not so glorious. Robert Neville's situation is similar to this latter one.In first instance, when I came upon this book, it reminded me of The Last Man by Mary Shelley. In both books, the hero is, or believes to be, the last man on Earth. The rest of humanity had died because of a plague. In TLM it was some cold, and in IAL it was vampirism.Yes, you read that right: A plague of vampires. Vampires who had a scientific basis rather than a supernatural one, and I must say, it worked better that way, because I don't think the introduction of supernatural beings would have done good to the book, especially since it is horror science fiction (sigh, like my favourite book series ever).Vampires have always been seen as monsters. As they're monsters to our eyes, there comes this question: Are they in fact the monsters, or is it us? In this book, something similar is addressed.But are his needs any more shocking than the needs of other animals and men? (...) Is he worse than the manufacturer who set up belated foundations with the money he made by handing bombs and guns to suicidal nationalists? (...) Really, now, search your soul; lovie—is the vampire so bad? All he does is drink blood. Why, then, this unkind prejudice, this thoughtless bias? (...) He has no means of support, no measures for proper education, he has not the, voting franchise. No wonder he is compelled to seek out a predatory nocturnal existence.Of course, in my honest opinion (I'm trying to be the less biased as I can), it worked better in The Monstrumologist by Rick Yancey, because the answer to that question was more developed and included things that only made the series very dark.Th hero also questioned himself why he went on living - he being the last man he knew alive, there was no point in continuing his life, is it?He found himself wondering again why he chose to go on living. Probably, he thought, there’s no real reason. I’m just too dumb to end it all. The book should have had a strong ending, but around 90%, something very underwhelming happened. I won't say, of course, yet... I'm still trying to process that finale because I have confused feelings - does it really make sense and is that the way everything should have ended? - so I will not speak ill about it just now. In the meanwhile, I recommend this book, and if you in fact read it, I would not complain if you came to this review to tell me your opininon about the ending."}, {"userName": "Kimberly", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/17371689-kimberly", "userReview": "I AM LEGEND, by Richard Matheson is one of his \"longer\" stories, that I hadn't previously read. This is a vampire tale, but one very unique to this genre. The last survivor in a plague that left humanity dead--or, undead--Richard Neville has spent the past three years learning everything he can about what caused this change. Many are the days when he wonders why he even bothers to go on, when everyone around him is \"lost\".\n\". . . In a world of monotonous horror there could be no salvation in wild dreaming . . . \"\nThe story itself was captivating enough, but the ending that Matheson leaves on was what truly earned my admiration. Just when you think you've read it all, a classic tale such as this comes your way.....Highly recommended!"}, {"userName": "Penny", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/10165256-penny", "userReview": "[ In the beginning he fights his urges that cry out for sex which the monsters outside seem to know he has and use against him. Celibacy isn't something I've ever thought of as a potential problem in a post-apocalypse setting because there are usually a number of human survivors. What do you do when you're the only one? He drowns his emotional pain and shock in whiskey which is probably how he stayed sane through the first year of being alone. Isolation is a terrible thing that breaks minds and I'm not sure why it didn't break Robert Neville. The only explanation I can think of is that he had chores and music and he used booze as an anaesthetic. I found his exploration into the workings of the germ and learning from books rather remarkable. I didn't find it at all unbelievable, but I was very impressed at his ability to learn so much with no help from an experienced hand. I thought the explanation for the infection was novel and interesting. I found the distinction between the living and dead infected brilliant, and I was always interested in any theory Robert Neville posed because it was always well thought out and well presented. The idea that the living were actually psychologically rather than physically changed was fascinating. If you consider how mass hysteria can produce physical symptoms of illness it makes perfect sense that many of the living would simply go crazy and think they too were monsters of the night.I found the part of the story when he find the dog and tries to win him over very touching and heartbreaking. There's little else to say about it. It was beautifully done and one of the most powerful parts of the book for me. I didn't ever stop being suspicious of the girl. I knew she'd be the end of Robert Neville though I didn't know how exactly. The questions of how you come to deal with loneliness and what an intrusion company can be was very cleverly done. When you're used to your life being just so and you get the thing you've been wanting for so long, suddenly you can really ask yourself if you really wanted it after all. The ending. I found it emotionally unsatisfying at first, but it made a huge impact! He really was the outsider now and his death was a necessary part of the formation of the new society. I didn't really expect or need him to live happily ever after, but I was sad to see him die. He survived so much for so long. But he was outnumbered and a threat they had to get rid of.  (hide spoiler)]"}, {"userName": "Dirk Grobbelaar", "userReviewDate": "Jan 26, 2010", "userURL": "http://www.goodreads.com/user/show/3102740-dirk-grobbelaar", "userReview": "A novel that has been both heavily criticized and revered, I Am Legend straddles an uneasy line between Horror and Science Fiction. However, there is no denying its influence, nor its simple charm. In comparison with some of the 'vampire' drivel being served up today, this little novel is indeed legend. It ranks with Salem's Lot as one of my favourite reads on the vampire mythos. I know that the science isn't sound, but Matheson has done a terrific job of introducing new ways to broach the subject of vampirism. And has ever a novel captured loneliness such as this? Highly recommended."}, {"userName": "Glitterbomb", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/30307187-glitterbomb", "userReview": "This book has been made into four seperate film adaptations. All of which deviate significantly from the novel. Why is that? Why meddle with brilliance? I read this AFTER seeing all four films, and none of those movies had anywhere near the impact the book did on me. It's dark, and gritty, and bleak. Its tells a tale of human loss and suffering and our stubborn will to survive. You could quite easily pick this up in another 50 years time and think it were set in the near future. It's incredibly well written and I was a little stunned when I found out it was first published in the 50's. Brings to mind the old adage 'they don't make 'em like they used to!'Matheson was a trailblazer and I am Legend was instrumental in the popularization of the apocalypse caused by global disease and the vampire/zombie apocalypse genres. If you're at all interested in visiting the origins of these incredibly popular genres, start here. Be prepared to feel a little depressed afterwards though."}, {"userName": "Anna", "userReviewDate": "Nov 23, 2013", "userURL": "http://www.goodreads.com/user/show/18202588-anna", "userReview": "Εκπληκτικό βιβλίο που έγινε μια επίσης εξαιρετική ταινία με το Will Smith. Εγώ πρώτα είχα δει την ταινία, αλλά - φυσικά - το βιβλίο είναι καλύτερο. Όχι μόνο γιατί γενικά τα βιβλία έχουν περισσότερες εικόνες από τις ταινίες και διεγείρουν τη φαντασία περισσότερο, αλλά και κάποιες μικρές διαφορές για μένα αναδείκνυαν περισσότερο κάποια συναισθήματα έναντι άλλων. Για παράδειγμα: Ο Will Smith (συγχωρήστε μου ότι ξεχνάω το όνομα του χαρακτήρα, πάνε χρόνια που διάβασα το βιβλίο, αφήστε που λόγω της ταινίας έχω ταυτίσει τον ήρωα με τον ηθοποιό) έχει μείνει μόνος του στον κόσμο μετά από μια vampire (διόρθωση!) apocalypse. Στην ταινία έχει ως μόνη συντροφιά το σκύλο του, ενώ στο βιβλίο είναι εντελώς μόνος και μετά βρίσκει το σκύλο (επίσης συγχωρήστε μου ότι δεν θυμάμαι αν είναι ο δικός του ή ένας οποιοσδήποτε σκύλος που τον υιοθετεί). Φανταστείτε λοιπόν πόσο σημαντική συντροφιά είναι ένα σκυλάκι, εκεί που ο ήρωάς μας ήταν εντελώς μόνος και δεν είχε να πει μια κουβέντα σε κανένα ζωντανό πλάσμα. Εκπληκτικό επίσης είναι το τέλος, μια από τις λίγες φορές (σκεφτείτε επίσης πότε γράφτηκε το βιβλίο) που διαβάζαμε για εξέλιξη των ειδών και προσαρμογή σε νέο περιβάλλον. Χαρακτηριστικά επίσης θυμάμαι τη συζήτηση με ένα φίλο που τον πείραζα για σπόιλερ και τον απειλούσα ότι θα του διαβάσω την τελευταία φράση του βιβλίου. Θορηβημένος, έκανε διάφορες αστείες χειρονομίες για να μην με ακούσει! Η τελευταία φράση, λοιπόν, είναι \"Είμαι θρύλος!\", η μόνη φορά που αναφέρεται σε όλο το βιβλίο ο τίτλος. Το πώς και το γιατί είναι το πραγματικό σπόιλερ, διαβάστε για να δείτε!!!!"}, {"userName": "Carmine", "userReviewDate": "Jul 25, 2015", "userURL": "http://www.goodreads.com/user/show/43396096-carmine", "userReview": "La normalità della maggioranza L'impatto di un'opera come \"Io sono leggenda\", tanto nel suo genere quanto nell'immaginario collettivo, è qualcosa di assimilabile a una bomba atomica.La forza di Matheson, capace di riscrivere la figura del vampiro in chiave scientifica e sociale, è quella di fotografare la tremenda dittatura della maggioranza e riequilibrare gli sbilanciamenti delle forze in campo attraverso il solo movente che muove ogni collettivo dotato della forza del numero: l'autoconservazione a discapito degli altri.E cosa c'è di più efficace nel rendere una leggenda chiunque sia diverso da noi, così tanto diverso che forse potrebbe non esistere?L'errore più grande dell'umanità sarà sempre quello di non comprendere che, alle volte, è necessario accettare il cambiamento e farsi da parte: inutile la resistenza quando si diventa custodi di ricordi e realtà fittizie che hanno fatto il loro corso."}, {"userName": "Bel", "userReviewDate": "May 25, 2011", "userURL": "http://www.goodreads.com/user/show/869166-bel", "userReview": "Four fifths of the way through and the only thing on my mind was how incredibly boring and one-dimensional Robert Neville is. You would think that someone forced into solitude and surrounded by death and insanity would have a wonderfully colourful and twisted mind - if you're going to have a book revolving around a single character, make him a really good one. So, it wasn't until he began chasing, abusing and kidnapping a woman in the name of science (everything in this book was tunnel-viewed 'in the name of science' and dismissed any other possibilities and ways of thinking) that I let my imagination take over the plot.I Am Legend is actually unintentionally Nabokovian. Robert Neville is a delusional psychopathic woman killer safe in his fantasy world of vampires and violence where he presents himself as the last vestige of rational thought. Closing himself off and leading a hermitic life, he spends his time dreaming about killing the filth of humanity who haunt his dreams and bitterly reflecting on his \"wife\", a woman who he was unhealthily obsessed with and murdered when she became a \"vampire\" ie he realised that she was not his misogynist vision of an inferior, man-worshipping, overly-emotional cretin lower than a dog (who he treats with more respect). One day, he finds, abuses and kidnaps a woman and locks her in his bedroom and she tries to win her freedom through seduction (though in the end finds that hitting him over the head is more effective). He gets arrested and is made to face what he has done, his victim even developing Stockholm syndrome, but further retreats into the safety of his self-deceptive mind where he twists the conventions of the world to point himself out as a legend, the last macho, narrow-minded, patriarchal\"real\" man.I give this book an extra star from all the fun I had trying to salvage something interesting and in the wise words of The Smashing Pumpkins: \"The world is a vampire, sent to drai-ai-aiiiiiin\""}, {"userName": "R * A Reader Obsessed *", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/21987508-r-a-reader-obsessed", "userReview": "2 StarsBartender!? Another please!Talk about a freakin downer! Man, that ending. So infuriating and pointless especially with such a great buildup and interesting take on vampire lore.This barely resembles the infamous Will Smith movie but the backbone is there. However, while the movie left you in sad despair, there was triumph in the wake of Neville’s sacrifice. This simply ends with not one speck of hope, and it totally sucked because I’m not a masochist by choice."}, {"userName": "Matthew", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "This is definitely one of the Grand-daddies of the Post-Apocalyptic/Dystopian/Virus/Monsters-taking-over-the-world stories.This book had to be a commentary on where Matheson thought we were headed as a society - not just a simple tale of vampires created by a virus.It is amazing how much he fits in to a 160 page book. I am thinking that Matheson must have been a master of telling a lot of story in very few pages. A very suspenseful and quick read. This would be a great choice for horror fans, post apocalyptic fans, and vampire fans"}, {"userName": "Sara", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/1170391-sara", "userReview": "3.5 stars. I haven’t seen any of the ‘I Am Legend’ films out there, so had nothing to compare this to. It’s a classic of the science fiction genre, and at just shy of 200 pages I knew it would be a quick read. It was. And it was enjoyable for the most part. We have the lonely ‘last man on earth’, desperate for companionship, a purpose to continue and justify his existence. We have the now typical apocalyptic landscape and vampire enemy. Enigmatic and ruthless, just as easily turning on each other as they are on our narrator. It had scenes of tension, heartache and bitter uneasiness. You feel at any moment that Neville could either end it all, or finally be taken by his neighbour or another vampire. Neville is a strong protagonist. You feel his emotions in waves of despair. His background is touched upon sparingly, hinting at awful post apocalyptic traumas, but enough is left to the readers imagination to see how he’s got to where he is at the start of of novel. His life is filled with endless monotony, leading to madness and melancholy. It’s rather artfully done for such s shout novel, and I can understand how this is such a pioneer for the genre. But. Something just wasn’t there for me. I don’t know if it was the rather enigmatic approach to the vampires and their disease (we never really know for sure what is at the root of the problem other than it being a germ), or if it’s because this is such a singular journey. We follow Neville and that’s it. There’s no expansion of the plot away from Neville, and for most of the novel there’s no interaction with anything or anyone. It’s all Neville’s thoughts.I just felt that something was lacking. Some deeper look st this world perhaps. But I did enjoy it."}], "description": "I Am Legend is a 1954 science fiction novel by Richard Matheson about the last man alive in a future Los Angeles, California. It is notable as influential on the developing modern vampire genre as well as the zombie genre, in popularizing the fictional concept of a worldwide apocalypse due to disease, and in exploring the notion of vampirism as a disease. The novel was a success and was adapted to film as The Last Man on Earth in 1964, as The Omega Man in 1971, and again in 2007 as I Am Legend. Later releases of the novel include several of Matheson's short stories: Buried Talents, The Near Departed, Prey, Witch War, Dance of the Dead, Dress of White Silk, Mad House, Funeral, From Shadowed Places and Person to Person.", "title": "I Am Legend", "url": "http://www.goodreads.com/book/show/1073848.I_Am_Legend", "average": 4.06, "cover": "https://images.gr-assets.com/books/1314899468l/1073848.jpg", "reviews": 4338, "authors": [{"url": "https://www.goodreads.com/author/show/8726.Richard_Matheson", "name": "Richard Matheson"}], "type": ["Horror", "Science Fiction", "Fiction", "Classics", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/1073848.I_Am_Legend", "http://www.goodreads.com/book/show/14064.I_Am_Legend", "http://www.goodreads.com/book/show/1056014.I_Am_Legend", "http://www.goodreads.com/book/show/904621.I_Am_Legend", "http://www.goodreads.com/book/show/6576785-i-am-legend", "http://www.goodreads.com/book/show/20644705-i-am-legend", "http://www.goodreads.com/book/show/9756205-io-sono-leggenda", "http://www.goodreads.com/book/show/12434237-i-am-legend", "http://www.goodreads.com/book/show/547094.I_Am_Legend_and_Other_Stories", "http://www.goodreads.com/book/show/33547.Hell_House", "http://www.goodreads.com/book/show/33553.A_Stir_of_Echoes", "http://www.goodreads.com/book/show/33555.What_Dreams_May_Come", "http://www.goodreads.com/book/show/33544.Nightmare_At_20_000_Feet"]}