{"ratings": 284715, "userreviews": [{"userName": "Haleema", "userReviewDate": "Dec 11, 2010", "userURL": "http://www.goodreads.com/user/show/4336293-haleema", "userReview": "This book is so strange and awful, it's hard to explain exactly why I dislike it. Thank God this book didn't live up to its hype like Twilight did. At least I hope it didn't because I don't really hear much about this one. I couldn't get past chapter nine. It was such a bloody bore. I decided to give it time for me to find that little \"spark.\" But, no. Now here are the problems:1. Lore can't use the word \"and\" in the proper way. Which seems like it's not a big of a deal, but it is! He randomly places it and tries to get his readers to understand his reading and it's quite awful. 2. The characters are all bland and pathetic. John seems to have a false sense of bravado. Henri makes me want to bang my head against the wall. And don't get me started on Sarah. The characters are so emotionless. No depth. 3. Lore tends to forget the most significant details regarding his plot. It's like, \"OH I FORGOT TO MENTION WHAT MY POWERS ARE!\" \"OH, WAIT! MY NAME IS ---\"4. His writing is dull and boring in every possible way. It reminds me of Fitzgerald's writing."}, {"userName": "Lucy", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/3813315-lucy", "userReview": "The language and phrasing is really simplistic, which wasn't bad, but the story itself makes no sense whatsoever. It blends genres and not delicately. I feel like the concept of the novel was born before the characters and logic wasn't worked out around it.I Am Number Four is about John Smith, a teenage boy who is actually an alien from another planet. I'm going to give a breakdown of some of the flaws with the story.1. John has a guardian from his planet, but the guardian has no special abilities. It's like the author realized a bunch of little kids couldn't crash land on the planet and run amok so he gave them each a single adult -- but the kids have to be the special ones. So the adult alien is another species of humanoid alien from the planet, but a sort of servant species.2. The servant species of aliens are powerless, but their life goals are to train the powerful mutants. Um... why? Why would you put the power training in the hands of the un-powered species? The powered species seems to be just as numerous, if not more so, then the un-powered species. So really -- why. I know! Ao that the adults accompanying the children have a purpose!! Also, the author doesn't seem to want to refer to them as slaves or servants, which waters down the whole situation and makes it even more convoluted.3. The aliens got their powers as a gift from the planet for protecting it and reversing the damage they did to it. Of course, the servant species works just as hard but they get no 'magic.' Evolution does /not/ work that way and it is never explained why only one humanoid race developed powers.4. The children are protected by a 'charm' that means they can only be killed in order. Why a charm? This is what I mean about mixing genres. First it's science fiction, but instead of using any understanding of science to explain the situation the author leaps to magic because that doesn't need to be explained!! After all, he's writing a children's book so who gives a frig? There are a thousand more creative ways to say why they must be killed in order. Or even that the race hunting them is methodical and hunting them in age order since age dictates when they get their powers. Or that they are impossible to identify before they manifest their powers. It was just like he reached the fastest conclusion possible and then stopped thinking, job done.5. There's absolutely /no/ visible reason for the aggressive alien race to hunt the nine children into extinction. They wiped out a planet, an entire PLANET, filled with older, trained aliens without breaking a sweat. The children represent no threat.6. The aggressive alien race is interested in earth, but they're still dedicating most of their time to hunting these nine stranglers. When you wipe out earth you're going to get them anyway, guys. What's with the obsession?7. The charm breaks if any of the children come together. They go through pains to stay scattered. One of them deliberately breaks this so they can gather together to make a stand. Your /entire/ race made a stand and they died, you fucking tool.The characters are charmless. The male lead is stupid and pigheaded and clearly the author's suave wish-I-was in high school. He's very I can kick your ass puny mortals, but I won't. The lead makes many stupid, stupid choices that endanger everyone around him and break all the rules set up in the beginning of the book.The female lead is a hot ex-cheerleader who choose to be 'good and kind' to everyone instead of being popular. The author wants you to know that the male lead could screw a blonde head cheerleader, but he has depth and intensity and soul. So he's going to bang the one who wants to rescue strays and take beautiful black and white photos of flowers. It's CONTRIVED. I didn't like either of them, nor did their romance ever feel even slightly real.In essence, this book was lazily written, barely edited (there's several typos in the book) and pure crap. It's a money making scheme and a waste of time for any semi-intelligent reader."}, {"userName": "Joyzi", "userReviewDate": "Oct 01, 2010", "userURL": "http://www.goodreads.com/user/show/1591538-joyzi", "userReview": "[image error]"}, {"userName": "Ken", "userReviewDate": "Jul 12, 2010", "userURL": "http://www.goodreads.com/user/show/730754-ken", "userReview": "I AM NUMBER FOUR is actually number four million if you consider the predecessors it is based upon. Meaning? We've been here before. About a bazillion times.Let's take stock: aliens on Earth disguised as Earthlings. In fact, your neighbor may be a Lorien (the \"good guy\" planet of concern here) and the haberdasher (way to blend in!) may be a Mogadarian (the \"bad guy\" aliens who are hunting Lorien-types to the death). Novel idea, eh?So our protagonist is on his 5,398th alias. It's (steady now) \"John Smith\" (\"John Doe\" must have been taken). He is what's called a \"Garde\" and will get special powers when he hits puberty (I got a cheap Timex). These powers are called \"Legacies.\" Special powers are quite the thing in fantasy YA these days. They go by different names, they borrow shamelessly from Marvel Comics, and they're viral. Speaking of viral, at 440 pages and at Gate #1 of a projected 6, this book is both too long and too predictable to be extended into a series. Do we blame Harry Potter for this pernicious YA fad? The conceit, you see, is that Mogadarians can only kill the Lorien-types in order. Conveniently enough, Numbers 1, 2, and 3 have been killed before chapter the first. This means (gasp) hold on to your seats action from the get-go as John Smith and his protector (called \"Cepans\" here) move to a small Ohio town to blend in.Blending in defined: fall in love with a gorgeous (surprise!) girl named Sarah. Draw the attention and ire of a (surprise!) bully named Mark who happens to also be the captain (surprise!) of the football (surprise!) team and Sarah's ex-boyfriend (surprise!). Get in a fight with Mark and accidentally display your super powers which are supposed to be kept under wraps for fear of attracting Mogadarian attention (remember, one of them could be the janitor, the principal, or even the candlestick maker!).That's the sort of goings-on you'll get in this book. Characterization? You might as well hunt polar bear in the Everglades. Description and mood? Try finding fine china at Walmart. But oddly, the book will be a big hit with many young readers (especially of the \"reluctant\" variety) because it's all about plot. Period.As is often the case with genre reads in YA, I'm torn here. The book's style is choppy and the author's ability to write action scenes filled with inconsistencies and gaps. It's predictable. It's one-dimensional. But it is what it is, and I know a lot of kids will be snapping it up in my classroom this fall -- and liking it, too. Does that mean they have bad taste? Not at all. It means they like action. It means they like plot. It means they are Pittacus Lore's target audience and I should be sure to get this book in their hands."}, {"userName": "P ", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/25327841-p", "userReview": "“It's the little mistakes that lead to big mistakes.” \nI Am Number Four was unexpectedly fun. John Smith or Number four is my favorite character. I really loved his wits and the pace of this book, it's insanely fast that I didn't dare to breath when something happened. Pittacus slowly built up tensions through the book, and he abruptly released them at the right time, it worked so well for me I gave 5 stars without hesitation.\n“That’s the worst way to miss somebody. When they’re right beside you and you miss them anyway.” \nAstounded by the concept and the plot, I was also into the characters and their storylines. John runs away all his life, nowhere is safe for him to stay. But when he meets a girl that he feels something special for her, running is harder to him. That's what the point this book was so interesting for me and I couldn't put it down for hours until I finished it.Moreover, Reading I Am Number Four was like reading a Japanese manga, it was imaginative and easy to enjoy. The twists were well-planned and very heart-wrenching for me. I don't regret that I picked up this book last year and reread it again today, it will be my standard of reading sci-fi novels from now on.This is an epitome of the books using a simple narrative, yet it could be overly fun.\n“The price of a memory, is the memory of the sorrow it brings.” \nThat twist, though.Thai review https://goo.gl/Iz8tOd"}, {"userName": "Arlene", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "[I want to know who took the video of John saving Sarah and the dogs and who sent the fax? Who wants #4 gone besides the Mogadorians? What was in the letter? Why did they need to go to Paradise, Ohio? (hide spoiler)]"}, {"userName": "Jessica", "userReviewDate": "Oct 15, 2010", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "The Mogadorian caught Number One in Malaysia,Number Two in England,And Number Three in Kenya. I am Number Four.I am next.Catchy, isn’t it?Unfortunately, the story itself isn’t quite as catchy. I was rather underwhelmed, to be honest.The plot was ok but somehow it only managed to hold my attention for a period of about 10 minutes. After that, I found myself getting bored and my thoughts kept drifting off to random topics like \"what’s for dinner\" or \"shit, I really need to iron that white blouse of mine\". While some parts of the story were quite entertaining, other parts were just so cliché that I almost gave up on the book entirely. I found myself slapping my forehead more often than is healthy and several times I surprised myself (and random people around me) by shouting out loud \"Oh come on! Seriously?\"The scenario in a nutshell:Alien hides out in small town, alien falls in love with human girl, alien goes to party with human girl, party escalates, house starts burning, alien saves human girl from flames (said alien is resistant to fire), alien tells human girl about true identity, human girl has no trouble at all accepting this, alien and human girl lie to police about rescue that should have been impossible, nasty reporter dude gets suspicious of alien and fishy rescue story, chapter ends with reporter dude yelling after alien \"I will find the truth! I always do!\"Now tell me, is this worn out or is this worn out?And this was just one of the scenes that made me want to bang my head on the table. There were more...The characters also felt kind of flat to me. John aka #4 was nice enough (imagining him as Alex Pettyfer actually helped a lot), I also liked Sam, Henri and even Mark but just like John’s and Sarah’s relationship, the girl herself was dull and just plain boring. I didn’t feel the love, there was absolutely no tension, no tingling, no butterflies, nada, zip, zero, zilch. Just nothing at all that could have triggered any kind of emotion on my part.I think the characters I liked best were Six (she really kicked ass) and the dog. o_OOverall this was a solid two stars read for me, seeing as the story did entertain me at times (especially towards the end) and I made it through the book, but it was definitely nothing memorable for me. I’m really looking forward to the movie, though. I think this might be one of those rare cases where the movie is actually better than the book. We’ll see..."}, {"userName": "Sabrina", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5771244-sabrina", "userReview": "I removed my review (and all the comments).I was tired sick of people writing me lengthy comments about how I read too much realistic fiction (really?), how I can't appreciate something fun and not overly brainy (do tell!) and, in general, all the ways I'm so obtuse for failing to appreciate this crap book.Sorry trolls people, but my opinions are my own and I still think this book was lame, badly written, unoriginal and an overall neurons-killer."}, {"userName": "Kogiopsis", "userReviewDate": "May 13, 2010", "userURL": "http://www.goodreads.com/user/show/1462364-kogiopsis", "userReview": "Full review still in progress, but here's approximately the first half... pre-reading comments at the end.EDIT: Okay, I'm never going to finish this thing. Frankly, I don't care. But I added a list of things I was planning to put into it at the end.EDIT 2: Everyone who is even THINKING about reading this book should read this article: http://nymag.com/arts/books/features/... and find out exactly what you're dealing with and what you're supporting.Introduction: I Am The Fourth MatrixThere is a theater in my city that shows movies after they’ve left the other theaters, for two or three dollars a ticket. It’s a pretty good deal. On Friday night they showed The Matrix- which I’d never seen- and I went with a couple of friends. It was decent. A little bit predictable, a little bit too violent at times, but overall pretty good. The problem was, I’d been reading I Am Number Four that same day, trying to finish it and put it behind me, and I watched one of the released movie clips of Six to reassure myself (before I encountered her in the book) that someone actually cool would show up eventually.This tainted my viewing of The Matrix.You see, I Am Number Four is what you get if you took the coolest sequences of The Matrix and the premise of Superman, tossed them in a blender, and added a sprinkling of generic Love Interest Powder to the top. But, ah, be sure not to blend it too smooth- it has to be choppy and jolting to experience, and you can’t have that if things meld together seamlessly.I’m frustrated with ‘Pittacus Lore’ for making me think of his characters when I was watching Keanu Reeves stop bullets in midair. But on the other hand, there’s a wonderful irony to going to see the original on the opening night of the cheap, poorly-concealed knock-off.I’m not going to see the movie, obviously. It’s not worth my time. But I did spend time on the book, so let’s talk about that for a while…Bad Researcher, No CookieIt is painfully obvious that ‘Pittacus Lore’ doesn’t know jack about science. I’m not sure if he’s trying to bill this as science fiction or not, but if so someone should go hit him over the head with the entire collected Dune series or something, because this is pretty much the worst science fiction I’ve ever read. Why do I say this? Oh, where to begin… well, actually, that’s obvious.Lorien is a cheap imitation of Earth, and its inhabitants are equally cheap imitations of humans. Think about it. The fact that they look enough like us to pass as us without extra technology or spells or whatever should have given it away. If that wasn’t enough, maybe someone else noticed the color scheme of the planet? Really, Mr. ‘Lore’, do you think that all plants are automatically green everywhere in the universe? Or for that matter that all water is blue? It’s a matter of chemicals and elements, and since you take great pains to point out that Lorien has a different concentration of mineral resources than Planet Earth, we know that the ratios of elements in the soil have to be different. And even if the readers were inclined to let that slide, did you really think you get away with giving the Loric people all of these human structures? They drive cars and park them in driveways, for heaven’s sake! They have grass! Air shows! Fireworks! They even have the same kind of names! In essence, they are \nexactly like humans except for the ones with sparkly Sue powers.\nAh, and those powers. Did you think I’d miss that, too? Treat it as science fantasy, whatever, but let’s talk a little hard evolutionary science for a moment. When explaining the origins of the Legacies, Henri tells John that they were ‘like a gift from the planet’ or some crap like that.Um.No.That is not how evolution works.It goes like this: New traits come to be through random mutations. Some of them will be beneficial, some simply not detrimental; some will be fatal or sterilizing. Events in the environment lead to one trait being favored over others, but it must already exist within the population. Evolution doesn’t spontaneously create beneficial traits; it amplifies them in the population at large. So there would have to have been Legacies already present among the Loric for them to become prevalent.Okay, change gears here.Planets and stars.Lorien is one tenth the size of Earth, and its star is twice the size of our Sun. It’s fourth away from this star. All of these should have shaped the kind of life that evolved there. For this I have the manga Planetes to thank, because without it I might not have noticed; but gravity affects the way body shapes develop. Growing up in lower gravity, hypothetically, should result in a taller individual, because there’s less strain on the body. Now, unless you’re going to tell me that Lorien is superdense, that wasn’t accounted for in this book.And as for that planet. Smaller than Earth? It can’t hold as much atmosphere. Still relatively close to the Sun? It should be BAKED before it can ever support life outside of Kingdom Archaea. (Granted I may be incorrect on this point; biology is more my strong point than astronomy.)Culture, physiology, solar system… OH WAIT.Parallel evolution.If you’re not familiar with the term, this is what happens when sci-fi writers get lazy and decide that every sentient race in the universe looks almost exactly like humans, except maybe with pointy ears and funny eyebrows, or some crazy forehead makeup. TV shows can get away with it, or they could until technology caught up with them. Books just can’t. You don’t have to worry about how to simulate this alien; you’re just describing it, anyhow! That’s how we get things like the gaseous race that shows up in one of Anne McCaffrey’s ‘The Ship Who’ books.It’s possible to explain parallel evolution to reader satisfaction. (The Lighthouse Land by Adrian McKinty did this well.) ‘Pittacus’ didn’t do so. And what’s worse, it’s not just one race that looks suspiciously humanoid… there are two alien races that are nonetheless capable as passing as native Terrans with a minimum of work. Even given that the book was optioned for a movie before it was published, this is unacceptable. Parallel evolution is the cheap trick that, as far as I’m concerned, should never be used.And on that note, let’s talk about humans and the Loric.Humans Lame, Aliens Awesome: Your Accomplishments Mean NothingThis is a theme of I Am Number Four that particularly stood out to me, and here is why: One of the roleplays I’m doing on Gaia right now is about human settlers reaching the first planet they intend to colonize and finding an existing alien civilization. As I’m in control of the aliens, I’ve been doing all the worldbuilding for this place, and that included figuring out why they resembled a cross between humans and Terran birds. My solution was a little like McKinty’s: I tossed in an ancient race that meddled with both the younger species and made them in their own image. When I first proposed this, though, I hadn’t really figured out how it would go yet, and so my partner raised a point: isn’t this cheapening human achievements as a species, if you credit their whole existence and all their achievements to other aliens?And he was right, you know? So I backed off and made it work a different way.I wish Pittacus Lore had had to run his ideas by a similar audience. Because he didn’t, we get things like this: “We helped the humans, taught them to make fire, gave them the tools to develop speech and language, which is why our language is so similar to the languages of Earth.”Okay, really? No one language can be similar to all the languages of Earth. It’s simply not possible. Apparently Pittacus hasn’t seen a language family tree… well, ever. Grammar alone, even if every language had the same sort of pronunciation, would make it impossible; add in the fact that letters are pronounced differently, or that you have tonal languages and languages that use percussive sounds as well- not to mention myriad dialects- and this whole sentence is shown to be complete bullshit. But it’s not the worst. This is:“What happens if we try to have children with humans?”“It’s happened many times before. Usually it results in an exceptional and gifted human. Some of the greatest figures in Earth’s history were actually the product of humans and the Loric, including Buddha, Aristotle, Julius Caesar, Alexander the Great, Genghis Khan, Leonardo da Vinci, Isaac Newton, Thomas Jefferson, and Albert Einstein.”I’m going to ignore the suggestion that the Greek gods were also just half-Loric humans, because this is more than preposterous enough. According to Pittacus Lore, you see, not only would humans not have developed fire or language on their own, they wouldn’t have come up with things like the Four Noble Truths or the theory of Relativity if the speshul aliens hadn’t been involved. Frankly, seeing this list, I’m kind of surprised that Lore stopped here: why not claim responsibility for Muhammad, or Jesus, or Confucius, for example, while we’re undermining world religions? Why not assert that Michelangelo or Van Gogh were half-Loric? Hell, what about George Washington… or, since Genghis Kahn made the roster, Adolf Hitler? Because clearly noooooothing important can go on without alien involvement. (Oh, and how did the two species crossbreed? This goes back to the evolution thing, I guess- if there’s an explanation there, it might solve this problem too, but I doubt there is.)Formerly planned sections: The Hero Is Exempt From Morals…In which I would have discussed John's flagrant abuse of his power, including some incidents of untempered (and unregretted) harm caused to others who were barely more than bystanders, and that one time he attacked Henri. Also the fact that he never cared about Henri enough to remember his name until he was dead.…And All Characters Are Exempt From BrainsIn which I would have discussed Henri's abominably stupid decision to investigate a Mogadorian threat on his own, and John's decision that staying in the town where his girlfriend lived was more important than his own life or the future of his planet.We Should Have Expected This From James FreyIn which I would have discussed the way Frey wrote his own pen name into the story and glorified himself by making 'Pittacus' one of the most famous Lorics of all time.Of Course, He Wasn’t Being Paid That WellIn which I would have discussed Frey's book factory business plan and the truly horrible writing in this book.Minor FailsIn which I would have discussed the anvilicious (and obvious attempt at trend-riding) environmental 'message' presented in the contrast between the Lorics and the Mogadorians, the absurd plot convenience of Sam just happening to mention the Mogadorians, and the fact that it is impossible to see vegetation moving under wind if the globe you're looking at is the size of a raquetball.Long story short: Don't waste your time or your money. If you want sci-fi, go read some C.J. Cherryh or Frank Herbert or watch Firefly or Doctor Who.While reading:Forget Alex Pettyfer. Let's see Tom Baker in this part!Before reading:I've got a galley of this sitting on my bookshelf, and I was quite looking forward to it... until I saw an add for the movie trailer on Facebook.No book should be made into a movie for release the year after publication. I'm sorry, but that's just wrong. And now I 'm kinda not looking forward to reading this. I still will, but I'll take my time getting to it."}, {"userName": "Literary Ames {Against GR Censorship}", "userReviewDate": "Dec 09, 2010", "userURL": "http://www.goodreads.com/user/show/2109885-literary-ames-against-gr-censorship", "userReview": "You must turn off your brain and ask no questions when reading this book. It’s a requirement to enjoy it. I failed miserably. It may be readable but I Am Number Four is predictable and clichéd with inaccurate and vague descriptions and explanations. For the most part I Am Number Four is an easy read although the language at times struck me as amateurish and clunky. Perhaps I expected too much after all this is YA but Lorien, it’s inhabitants and culture were too simple or too similar to that of Earth and humans. I was hoping for a bit more alieness than just boy-with-powers and shapeshifting animals. I expected a new spin on this cliché of a story but it was an incompetent rehash of old formulas. A lot of “how” questions kept popping into my head in relation to unrealistic circumstances. A major one:From what I understand 19 Loriens made it to Earth. The rest are dead. Those 19 have to repopulate Lorien when the time comes. Henri tries to dissuade John from procreating with humans because he’ll need a Lorien partner to produce pure children. Erm...are you serious? How would this work? You need many more individuals for a species to prosper. Reproduction would eventually become incestuous with the result of such unions suffering the disorders (deformities + genetic disease + infertility = extinction ) associated with inbreeding due to little genetic diversity in such a small gene pool making it impossible to adapt, evolve and therefore survive and prosper. A tad scientific but this is science fiction, emphasis on the science. I learned the above in high school biology and this is aimed at that age group -I’m just sayin’.Other “how” questions:--> How could John’s girlfriend, Sarah so easily accept his alien status without much proof?--> How did Mark come by the message that brought him to John’s home and into the fight?--> How did Henri explain what was going on to Mark?--> How did Six survive her many serious wounds? --> How can a book with so many illogical errors not only make it to publication but be turned into a movie when there are so many better ones out there?Why is the book by Pittacus Lore? It doesn’t make sense. Didn’t he die 10 years ago with the rest of his people? There was something about the elders disappearing during the ultimate battle on Lorien so there’s a small possibility he still lives, however the book is in first person from John’s POV. WTH?!Small sidenote: I don’t know about other countries but here in the UK “spastically” is controversial and considered highly offensive if not used in a medical context. I was very surprised to see it here but I’ll put it down to cultural difference and move on. The final battle didn’t interest me. I skimmed. There were moments throughout the book that gripped me. That were exciting. I liked Henri, John and his dog they made a good team but it seems they’re fighting a losing battle. Henri encourages us to have hope even when the task ahead appears impossible but 6 kids with powers versus a whole race –I’m not optimistic. No matter how many abilities these superhero kids develop.In some ways this reminds me of The Lightning Thief with the godlike powers, beasts and the run-for-your-life theme. That was targeted at 9-12 year olds and I think this should be too. I think they’d have a better time with it than I did.The movie, released next week, looks spiffy and exciting. Hopefully it will be better than the book it’s based on because this was just terrible.ETA Mar 2, 2011: The movie changed almost everything I had a problem with in the book. It was also 100x more entertaining so I encourage you all to see the movie and burn the book!"}, {"userName": "~Tina~", "userReviewDate": "Aug 05, 2010", "userURL": "http://www.goodreads.com/user/show/2594672-tina", "userReview": "(4.5stars)The planet Lorien had been destroyed, leaving only nine young Garde and there guardians/keepers a chance to escape, survive, in hopes that they can fight again and save there race, flee to Earth.They secretly weave among us as they slowly learn how to develop there powers, there Legacies. The Mogadorians, the ones responsible for destroying there home hunts them by order of there numbers. It started out as a group of nine. Three killed. Six left. They wont stop till all are destroyed. John Smith (aka Number Four) is next...I Am Number Four is a wicked fantasy fit for any sci-fi junkie. I'm not sure if I'm into alien type books really, but I was very impressed with the concept and the theories that laces through out the story. It's riveting, masterfully imaginative and creatively inspiring. I may not be use to these kind of books but I was hooked none the less.Pitacus Lore's (aka James Frey & Jobie Hughes) writing is strong, driven and completely gripping. It did take me a bit to get use to the writing style since I'm not use to first-person narrative, taking the story to different paces through out the story.Some chapters are fast paced and heart stomping, taking dramatic surrounding with vivid memories and haunting us with striking creatures and characters.Then there were the more slow moving scenes, to either gather information for the readers to keep up, or to give us a look at life around John and Henri. These chapters were both somewhat harder to get through only because I'm an impatient reader and want to get to the good stuff and also easier since I was already invested in these characters lives and wanted to see how things would play out.One thing is for certain though, each page is lined with an intense urgency that made it more compelling to keep reading to the very end.I loved John and Henri, they have the greatest bond and I connected with them right away. There story is extremely interesting and I loved learning about the history of the planet, the training and magic of it all. Bernie Kosar is awesome.While the storyline has more of a crucial feel to it overall, there is also some romance. These characters are only 14-16 years old, so it's not overwhelming and at times it did feel a little flat and maybe even unbelievable but it was also sweet in it's own right. I will say that I didn't like some reactions, thinking it played out a little to smoothly but that's all I'm going to say about that.Already a movie in the making. Steven Spielberg scooped the rights to this and the movie is set for release on Feb 18th 2011, staring Alex Pettyfer (Prettyface) as Number Four. I'm actually mighty curious about it. I'm not sure if I can envision the movie or even Prettyface being John, so this should be very interesting to see.Even though this book does have it's flaws, there were some parts I just loved, some parts that were just okay, some parts I had to roll my eyes and others left me turning the pages as fast as possible.All in all, I still had a really good time reading this book and realize in the end that this is some pretty dame good storytelling!I'm looking forward to the sequel and the movie, and while I'm still not completely sure that I'm an extraterrestrial fan at this point, anyone looking for an out of this world read should get a kick out of, I Am Number Four.Bravo!"}, {"userName": "Kristy", "userReviewDate": "Sep 30, 2010", "userURL": "http://www.goodreads.com/user/show/2705039-kristy", "userReview": "Okay, class. here is your quiz!Did I enjoy this book??? YesWas it fast-paced? YesDid it include enough action? YesWas there a love story? YesDid I have strong emotions in certain scenes? YesDo I want to read the next book? YES!!!Will I watch the Movie? YES!!!Were the character's likeable? YesWere the well developed? YesDid I enjoy the unvieling of the Legacies? YesDid I love Henri? YesWas I completely in the dark and suprised by the ending? YesDid I like the appearance of #6 at the end? YesDid it make me sad? YesDid it make me laugh? YesDo I love Sam Goode? YesDid Sarah's character get on my nerves at times? YesWas this an original story? YesWas it well executed? YesWas is a short read? YesDo I think the author borrowed a little from star wars? YesDo I think you should read this? YesDo you think you could pass my class?????!!!?!?!?!I have read some mixed reviews on this one.... But, I absolutely loved it! I highly recommend everyone to read this!!! I completely agree with this articleHere's a preview for the movieI'm about to become a fan-girl. Man, this looks good! Can't wait!!!Edit:Movie was pretty good. It followed the book pretty closely, shockingly.Husband liked the movie, even without reading the book. So the movie by itself made sense to non-readers. Ready to read #2!"}, {"userName": "Ashley Daviau", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/35915119-ashley-daviau", "userReview": "I was quite pleasantly surprised by how much I enjoyed this book! I've heard a lot of hype surrounding it and so I was a little hesitant going in but from page one I was completely drawn in and didn't want to put it down! I absolutely adore everything about the concept. From the Legacies to the Loric to the Chest and everything in between, it's just all so interesting and absolutely captivating! I wanted to dive into this world and completely immerse myself in it! I also really loved the characters, they really are all amazing! But Sam definitely holds a special place in my heart. From the moment we met him and his belief in aliens, I was instantly in love with him! He's the quirky sidekick that you can't help but fall for! I honestly can't think of one thing I disliked about this book, it was just that good! It had fantastic characters, phenomenal world building AND was crazy action packed with all kinds of twists and turns that left me itching to start the next book!"}, {"userName": "Natalie Monroe", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "[he gets caught by a bunch of journalists. Then later on Henri wants to leave for safety reasons and John fucking uses his powers on Henri to threaten him into staying.Afterwards, they get caught (like we didn't see that coming) and John's all weepy and apologizes, saying how it's his fault.Guess what, dickhead? It is your fault. And you think a fucking apology can make up for it? Uh-uh. (hide spoiler)]"}, {"userName": "Anja", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/6054186-anja", "userReview": "*3.75 LORIEN STARS*\n\"When you have lost hope, you have lost everything. And when you think all is lost, when all is dire and bleak, there is always hope.\"\nThis was my first time reading this book and it was a pretty okay read. I wasn't blown away but it wasn't bad either. I watched the movie adaption about 4 years ago when it first came out but I didn't remember a lot of it so the story was still quite \"new\" to me.One thing that immediately annoyed me was John's name. I mean, John Smith? Seriously? I felt like I was watching/reading Pocahontas or something! I sincerely hope he'll change his identity in the next book and will go by a different name soon! (Or that the next book will be from a different perspective alltogether, maybe Six or something?)Another thing was the insta-love between him and Sarah. I thoroughly dislike stories with insta-love with a passion. In the book, he saw Sarah walking around with her camera for the first time and BAM, he was sold, and vice versa! I mean, come on, I get that the story needed to progress really fast, but I would've liked to see some development in their relationship before they fell head over heels in love.The action in the end made up for a lot though! I literally breezed through the last 100 pages, so much was happening and it was totally badass. Sometimes it was a bit chaotic but I really didn't mind. The last few pages really made me cry, but I feel like it was needed for John's journey to finally take off. I feel like interesting things are going to happen in the future, together with Six, Sam and Bernie Kosar.I'm definitely going to read the rest of the series one day, I think I'm just going to wait a few weeks to start with the second book because I feel like reading something different right now."}, {"userName": "Alicia", "userReviewDate": "Feb 10, 2011", "userURL": "http://www.goodreads.com/user/show/3074525-alicia", "userReview": "One of the worst books I've read so far in 2011, second only after Spells in stupidity. I suppose this is another case of a book with a decent concept, but incredibly weak execution of said concept. My main gripe with this book was that it just bored me out of my mind. I am not usually a skimmer. I tend to read slowly, and really absorb each word and sentence, but this book just had me itching to skim through large sections. Boredom aside, I found the characters and dialogue quite wooden, and the entire plot was rife with cliches. The so-called \"romance\" between the protag and his love interest was ridiculous, cheesy and bland. The love interest was the stereotypical, perfect, gorgeous, personality-less, blue-eyed, ivory-skinned blonde. She seemed to be valued mainly for her looks, as the reader has it hammered over their head over and over again that she is \"the most beautiful girl John had ever seen\" blah blah etc etc. I suppose she was also valued for her supposed \"goodness\", which was demonstrated to the reader only in the most banal, cliche ways (ie. she works at an animal shelter! she is semi-nice to the school outcast!). At one point she was actually described as \"fluttering her eyelashes\" at him. I mean, c'mon, who actually does that? I just had no interest in any of the characters. I couldn't feel anything for them. They all seemed like teenage cliches, not real people. In fact, the whole book had a distinctly teenagerish feel, which is not necessarily a bad thing for a book to be and completely understandable considering it's YA, but that doesn't mean it has to suck. I enjoy plenty of YA and children's books, but this one was just.. I don't know.. immature? Unsophisticated? One-dimensional? Too commercial?The writing was serviceable, although again, very bland and uninspired. Plus, there are some pretty questionable ethical issues when it comes to the \"authoring\" of this book and whether the author who wrote the bulk of it was fairly compensated. See here for more info. I wasn't at all surprised to learn about the conditions that the book was written under, as that's exactly what it reads like - some kind of mass-produced, commercial product coming out of a YA-book-trend factory. There's no handmade flourishes, no artistry and no heart. It's like they just grabbed a bunch of cliches and popular YA trends - a love triangle, magic powers, etc. and clumsily assembled them together. That's not writing, it's a tragedy."}, {"userName": "Amanda", "userReviewDate": "Apr 30, 2011", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "You know the most suspenseful, well-written part of I am Number Four? The cover: \"Three are dead. I am number four.\" Pretty kick ass, huh? I certainly thought so, which is why I read it. Now I wish I had just left it on the shelf and let the power of those two lines remain my only association with the novel. I'm about to point out several flaws to which many people will say, \"Yeah, but it's young adult fiction.\" To them I say that just because a novel is labeled as \"young adult\" doesn't excuse sloppy writing, simplistic plotting, and stock characters that make the cardboard cut-outs of Will Ferrell at the local movie theater look three dimensional, complex, and full of depth. There is some damn fine young adult science fiction out there (I offer The Hunger Games trilogy by Suzanne Collins or the Chaos Walking trilogy by Patrick Ness as prime examples of intelligent, well-written young adult fare), but I am Number Four should not be listed among them. The initial premise is that Number Four (aka John Smith) is an alien from Lorien who, along with nine other children, was sent to earth as a small child to escape the destruction of his planet by the Mogadorians. The plan is for the children to survive and later return to repopulate the planet. Knowing the Mogadorians would hunt the children down, they are bound together by a charm that prevents them from being killed out of their numeric order. When one of them is killed, a spiral scar is seared into the leg of the remaining Loriens, signaling the threat level to the next in line. So far, so good. This is, unfortunately, when the whole thing starts falling apart:1) Lorien was a planet that was being destroyed by pollution and mistreatment of natural resources by its populace. Fortunately, before it was too late, the Lorien people got their collective act together to save the planet. As a thank you, the planet gave powers known as legacies to some of the citizenry. These legacies begin to manifest as a Lorien becomes a teenager and, guess what?, if you save your planet right now, you don't just get one superpower, you don't even get two superpowers, you get a whole shitload of superpowers! These include hands that glow like flashlights (lame), the ability to communicate with animals (meh), a fireproof body (getting better), invisibility (now this could be something worthwhile), and telekinesis (Yahtzee!). The overt environmental message here is blatant and didactic: save your planet and your planet just might hug you back by giving you some really cool shit.2) Not every Lorien receives powers. Those who got the planetary shaft in this deal became known as \"cepans\" whose job was to train and protect those with legacies. Why? If you have magic powers, why do you need a bodyguard? When the Lorien nine were sent to earth, each was given their own cepan to help raise and protect them until their legacies became evident. This makes a little more sense, but also raises the question of why didn't they send young adults whose powers had already matured to earth? Instead, Lorien is basically destroyed by the Mogadorians and the fate of the Lorien race is put on pause while they wait for their saviors to stop drooling and shitting themselves. Apparently, \"intelligence\" was not one of the legacies bestowed upon the Loriens. 3) There's not a single authentic character in the entire novel. John is bland vanilla-ville. He complains and whines his way through the novel. Sarah's sweetness is gag-reflex inducing and, despite the inevitable romance between the two, there's absolutely no chemistry. They seem to have fallen in love in the span of 5 nanoseconds and then spend the rest of the novel swapping the vapid sweet-nothings typical of a couple in a Valentine's Day commercial for Zales. 4) For two people who have spent the last several years hiding and trying to survive long enough to return to Lorien, John and his cepan, Henri, seem intent on getting their asses handed to them. They both know that the three other Loriens have been killed, they know the Mogadorians are closing in, and they know John is number four. So what do they do? John openly uses his powers and draws more attention to himself than a neon light outside a strip club, Henri goes and stirs up a nest of Mogadorians in a town two hours away, etc. However, do they get the hell out of Dodge? Nope. John manages to convince Henri every time that he's tired of moving and he's finally in love, concerns that are legitimate IF YOU'RE NOT FREAKIN' NUMBER FOUR! I would think all of these would take a backseat to the fact that John's number is literally up. 5) Simplistic writing with only the vaguest descriptive touches. The one that really killed me was \"It's a great house. A classic family home with bedrooms on the second floor, an attic where one of her brothers has his room, and all of the living spaces - the living room, dining room, kitchen and family room - on the first floor.\" What teenage boy has walked into a house and thought, \"You know, this really is a classic family home? I love the layout. Very traditional.\" 6) A flaw unrelated to the book: I've seen the movie previews and noted that Timothy Olyphant plays Henri (I won't lie--this, too, initially drew me to the book). Dear God, do not let this connection forever ruin Raylan Givens for me. I could go on, but I won't. Basically, the author has taken equal parts Superman, X-Men, and Twilight, blended them together in a concoction as delightful as swill and served it with a heaping side-order of teenage angst, a la \"I feel so out of place and no one understands me. Maybe it's because I'm really different. Special. And not the short bus special, but really special special.\" Having said all of this, pre-teens and teens may love the book--in fact, many of my 10th grade students think it's the most awesome thing ever. I'm in favor of anything that gets them to read, but this is too predictable for most adults or teenagers with more literary sensibilities.Cross posted at This Insignificant Cinder"}, {"userName": "Sandy", "userReviewDate": "Jan 02, 2011", "userURL": "http://www.goodreads.com/user/show/4515165-sandy", "userReview": "You know the characterization sucks when the best character in the book is the dog...."}, {"userName": "Michelle. D.", "userReviewDate": "Aug 21, 2010", "userURL": "http://www.goodreads.com/user/show/3699649-michelle-d", "userReview": "OK, I loved this book. LOVED IT.The characters were great, the plot was great, the events were great, the setting was great, EVERYTHING WAS GREAT!The whole concept of the book was amazing!But I got this weird vibe coming from deep within me after I finished reading the book. And it really annoyed me and angered me.Here I am, just finished reading this amazing book, and i have this weird vibe just radiating from me.It took me a few days to figure out what it was, so I will explain to you what the weird vibe was.I felt like the book should have been longer. It just felt like everything was happened too fast even though it had an average speed. That my head was thinking something totally different than my body. My body was thinking something else. Which is really creepy in my opinion. The book should have just been longer. Aughh! Stupid random weird body feeling that have a mind of their own.SADNESS! Madness! I wonder why that had to happen... Message me if you wanna know.I gave this book 4 stars because of my annoying weird feeling that made me cut it down.There is one thing I am confused about though...If Sam went with them, wouldn't anyone notice that he isn't there? Like his mom? Other than Sarah and Mark but...Meh.SARAH AND JOHN FOREVER!!! ♥What is John's real name, anyways....?"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "This book is an entertaining and easy read. It reminds you of Superman plus X-men which means this book contains a really cool story with really cool characters. The story begins so intensely, it grabbed my focus immediately. Its movie adaptation is good enough, though not as good as the book. I wonder when the movie sequels will come."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Sep 19, 2015", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "$1.99 on 23 June 2016Wow, crazy mixed reviews for this one. I mean, cray cray mixed. For $1.99, I just might be crazy enough to find out for myself... I mean, aliens, right? Aliens are awesome."}, {"userName": "Annalisa", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/542037-annalisa", "userReview": "Years ago I was watching The X-Files movie and during the climax scene Mulder and Scully need to get out of some remote, creepy warehouse before the building is destroyed (probably by aliens; it was always aliens that messed up Mulder's plans, and the show. Once upon a time X-Files was one of my favorite shows until they fell on the alien crutch every singe episode and gave up on coming up with with cool sci-fi explanations for the unexplained. Aliens ruin another good story, sigh. But I digress, back to the movie). Only Mulder and Scully aren't running or scheming or even freaking out. They're talking, without a hint of panic, while in my brain I'm shouting at them \"Move! Now! Or you're going to die! Okay, fine, if you're not worried about your predicament, I don't know why I should be.\"That's how I felt getting to the climax scene of this book. Big, tense scene coming up, but instead of the characters being proactive or planning or running or doing anything at all, they sit around and wait for the cool action scenes to fall upon them. For all their awesome powers and abilities, they don't do much to fight or consider the obvious strategies that would get them out of their predicaments. I wish the author (more ranting about that later) would have planned the segues and logistics behind those scenes that will look cool on the big screen instead focusing so much on the action so I didn't find myself rolling my eyes so much in the last hundred pages. All the workings were there for a great climax if it had just been crafted a little better.But let's talk about the rest of the book. The premise is that nine alien children from a destroyed planet are hiding out on earth until they develop their powers and are strong enough to fight back. But their destroyers are on earth tracking and killing the children one by one. The novel begins when the first three have been killed and number four knows he's next. I'm not a huge fan of alien plot stories, but it was a good premise, and I was hooked from the first page. The balance of answering my questions while keeping me intrigued about what I didn't know until I cared enough about number four to find out the rest of his story was perfectly done. That balance of pacing is something that is very hard to get just right in commercial fiction and it's done just right here to keep to you glued to the story. In fact, until the climax read like a choreographed fight, I probably would have given this four stars.I liked number four (never really came to think of him as John) and was vested in his story, and while I think Sarah could have been better defined, more than just gorgeous and empty, for an action book, the characterization wasn't bad. Sometimes alien was too-convenient answer, there were some holes and mistakes that most people probably wouldn't stop to think about, and the chameleon was way too obvious, but overall I found the description of this other planet and people interesting and well done. Very imaginative and creative. Normally I'd think present tense would be perfect for a fast-paced action story, but something about the dry short, choppy sentences (a guy obviously wrote this) coupled with the present tense rated on my nerves as childish. But all of that is details. The story was good and I can see why people are caught up in it and why it's been optioned as a movie. The bad news comes in the form of the sequel...Remember James Frey who dealt with a lot of backlash for the untruths he told in A Million Little Pieces? Well, he's back in the news, again with people up in arms for his Frey Fiction Factory (Full Fathom Five). Frey has been offering MFA students a mere $250 for their high-concept blockbusters and a promise of 40% some undisclosed amount the author can never verify. What's worse is that Frey owns the rights to the work and doesn't have to use the author's writing or credit him in anyway. You can read the abysmal contract here.A guy named Jobie Hughes is one of the authors who took up Frey's offer in hopes of making a name for himself in the publishing industry. I Am Number Four is his creation, thus the pseudonym. He has since parted ways with Frey (good for him), but he doesn't own the rights to his baby. So if there is a sequel, he will not be the one to write it. All of this did nothing to change my opinion of the book (only Frey), but it is disheartening to see a promising series get lost in a war over money."}, {"userName": "Suzanne", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "I cannot believe I waited so long to start this series! I am going to go get the others at the library throughout the next few weeks. This is a very fascinating plot and the characters are so likeable!"}, {"userName": "Evangelin", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/53962118-evangelin", "userReview": "\"I Am Number Four\" is an interesting novel packed with action,YA and romance.I was addicted to this book because of the concept of this book.I will explain to you in short about the story line.Ever wondered that maybe all of them who are in this world aren't normal people?What if they have special powers??Even your best friend could be one of them.No one knows!! Nine people(along with their guardians)are on a run.They come from a far away planet called Lorian which is ten times smaller than Earth.All of them look just like us.Go to high school like us.But they are not us.They have special powers.Their planet,Lorien,had been attacked and destroyed.The nine of them(Garde) and their guardians(Cepan) are the only ones who have survived.They arrived on Earth and have parted ways.They are in hiding in different parts of the world.Before the had left the planet,the elders of that planet had put a charm and linked them all together so that if one of them dies the others will know it.And they can be killed only according to their number. The nine of them are the only hope of that planet.They have to get together before the people who attacked their planet attacks kills them.Number one was caught in Malaysia.Number two in England.Number three in Kenya. John Smith has been moving from place to place his entire life.He is in hiding.He cannot make friends and have a normal life because he isn't normal.John is number four.He knows that he is next.He must be ready to fight back or face the worst-death. This novel is stunning and worth a try.I really liked the story line.I would recommend it to readers who like paranormal activity.I'm looking forward to reading the next book of the series.BOOK TWO(the power the six),HERE I COME!!!"}, {"userName": "Cat", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/5056038-cat", "userReview": "I'm not sure what \"I Am Number Four\" is doing here on a website dedicated to reviewing books, because whatever this thing is (a travesty? a sham?), it's not a book. It's a disgrace to real books, which isn't quite the same thing.That's how awful this piece of writing is. It's so awful I can't bring myself to call it a book, even though it's masquerading as one for tax purposes. Heed my warning, gentle reader: do not read this thing. I don't know you, but I know you're better than this. I have faith in you.What's that? My pep talk isn't enough, you say? You need further convincing? Fine. Here's another reason to stay away from this contemptible excuse for a novel: you probably have better ways to spend your money than funding the career of a hack. A thousand curses upon your rating system, O Goodreads, for making it impossible to give a book 0 stars - this \"book\" has 0 redeeming qualities and deserves a corresponding rating."}, {"userName": "Eric Allen", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/6229358-eric-allen", "userReview": "I Am Number FourBook 1 of the Lorien LegaciesBy Pittacus LoreA Review by Eric AllenOnce upon a time, Michael Bay made a horrible movie. Okay, he's made quite a few horrible movies, but I Am Number Four stands out amongst them as having the absolute worst acting I have EVER seen put to film in my life, and keep in mind I've been through college film-making courses where I had to watch quite a few awful student films. It is REALLY saying something when this large budgeted flop of a movie takes the cake for bad acting. Let's put it this way, a puppet manipulated by Frank Oz would have been a thousand times more expressive, emotive, and realistic than the guy they got to play the lead. Despite the horrible acting, it wasn't the worst movie I've ever seen, though I wouldn't ever actually call it good. This movie went into production before the final draft of the book was even completed, and Bay has been quoted in saying that a lot of the differences in the story stem from that. Naturally, after seeing the movie, and reading up a bit on the production history and the history of the book that it was based upon, I was intrigued enough to pick up a copy of the book from my local library. They have fifteen copies. None of them were checked out. That is usually a pretty good indication of something...I Am Number Four follows Four, a.k.a. John Smith, an alien from the planet Lorien, now laid to waste by another alien race called the Moggadorians. Nine children, members of the Lorien Garde, destined to develop super human powers and abilities that they will one day use to take Lorien back, were sent to Earth, each with a protector, to hide, grow, and train. John and his guardian Henri have moved from town to town every few months for the past eleven years. John barely remembers his home world, his parents, or what he is supposed to be fighting for. The Lorien children have a charm placed upon them that they can only be killed in order. Three are dead, and John is next.Upon moving to the town of Paradise Ohio, John begins to develop his powers, or Legacies, super speed, strength, the ability to shine lights from his hands, an immunity to heat and energy weapons, and the ability to move objects with his mind. He has run ins with the school bully, falls in love with the prettiest girl in school, and generally behaves like a typical teenaged girl (yes, I said girl, and if you read this book, you'll see why) until the Moggadorians find him and the battle for survival ensues.The Good? Despite having two authors, one--James Frey--an idea stealing, lying, worthless waste of human life who can't find a fire to die in fast enough for my tastes, this book is relatively well written. Which is hardly ever the case with collaboration pieces. Check out the Left Behind series for a good example of why more than one author is a bad, baaaaaad idea. The history of Lorien, the mystery of its fall, and of John and the other numbers' mission on Earth are all pretty well paced. I typically absolutely despise the first person present tense viewpoint used to tell the story. An example of this style would be The Hunger Games by Suzanne Collins. Where it was a constant irritant to me in The Hunger Games, and caused me to stop reading several times before I finally managed to slog my way through it, it is not overly distracting here. I attribute this to the fact that I Am Number Four is written by decent authors, and Suzanne Collins couldn't write anything decent to save her life. The book was interesting enough, well paced enough, and written well enough that I was willing to forgive the use of present tense, and first person.The climax of this book is very good and rather exciting, putting that of the movie absolutely to shame. The writers actually managed to out Michael Bay Michael Bay, and since John is slightly more emotive than the block of wood playing the lead in the movie, it's a lot more satisfying to see him succeed. The book builds up to it perfectly, and everything pays off spectacularly in a final confrontation at the school between two of the numbers and a whole army of Moggadorians. It's a quick, easy, and generally enjoyable read for anyone who likes science fiction, or saw and enjoyed the movie.The Bad? There are several factors that go into my ratings for books. Does the book have a good story? Does the book have good Characters? Does the book build up to a satisfying climax? Is the book well written? 4/4 of these will get a 5 star rating. 3/4 a 3-4 star rating. 2/4 a 2-3 star rating. 1 or less gets 0-1 stars. This book had the story. It had the satisfying climax. It had generally good writing. But the characters were all just cookie-cutter stereotypes without a shred of personality. John is a generic teenaged boy stereotype. His friend Sam is a generic sci-fi nerd stereotype. His girlfriend is the generic girlfriend stereotype. The bully is a generic high school douchebag stereotype. Henri is a generic father figure stereotype. It reminds me somewhat of the actors in the movie. Maybe they weren't just horrible actors after all and they were just doing the best they could with the material. Almost every character in this book is bland, boring, and without a shred of real personality. There is nothing to define them as characters and make them stand out. They're like stick figures filling in for real characters because the authors were too busy building up the back story to bother filling in the people that the book is about. When you don't really care about the people that the book is about, it's hard to care what happens to them. When it's hard to care what happens to the characters, it's hard to become invested in the plot. When you're not invested in the plot, then there isn't usually much conflict and tension, and any action or climactic events become meaningless. Good, well developed, well rounded characters are integral to a good story. And when a book doesn't have them, relying completely on generic stereotypes instead, it takes away quite a bit from the experience. I was still interested in the story, and the mystery of what was going on. The writing was good enough to keep me going to the end. Despite not really caring much about any of the characters, the climax was pretty exciting. However, it all could have been so much more so if only the writers had taken a little extra time and effort to come up with decent characters to act it all out.In conclusion, despite a number of things against it, I did enjoy this book. I would have enjoyed it more if there were some actual, real characters, but it's a fun and quick enough read without. This book did lack the incredibly important element of real characters that a reader can get behind and care about because they're all bland, boring, generic cardboard cut-outs without a shred of real personality. I enjoyed everything else about the book, even though it was co-written by someone whom I wish would die at his earliest possible convenience, making the world a better place with his absence, but it could have been so much more. Because of the lack of well developed characters, I'm giving this book three stars. It was FAR better than the movie, and did keep me entertained for an afternoon, despite it's vices. I wouldn't go so far as to call this a good book, but it's not bad if you've got a spare afternoon and nothing else to do. Sometimes I want to take a break from the heavy stuff I typically read with something simple and fun, and this book fit the bill. Check out my other reviews."}, {"userName": "★ Jess ", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/2683062-jess", "userReview": "A few years ago I heard about a movie called District 9. The majority of people I spoke to seemed to love it. One day my dad brought a copy home from the DVD store, and against my better instinct decided to watch it. I firmly believed that-being about aliens, spaceships and full of action-I would hate it. I thought it would be a 'geekish' movie, but none the less decided to give in to my dads pestering and watch it. 112 minutes later, the movie had ended and I walked from the room with a giant smile on my face. Turns out I completely misjudged the movie. It wasnt bad or geekish, It was amazing. I added it to my list of favorite films, and decided to never judge sci-fi movies again. Skip forward to early 2011. I had received a copy of I Am Number Four for Christmas. I had my eye on this since September, but when I found out about the main character being an alien, and having a lot of backstory about a sort of space-war, I wasnt so sure. But remembering \"District 9\", I decided to try some space/alien books, hoping it would be a similar experience to to the previous said film. And it was. It was amazing. Okay, enough bad movie comparisons, onto the proper review: WOW! My mind was blown. I loved this book! Pittacus Lore-whoever he is-did everything right.The pacing was perfect, I cared for the characters, the style was perfectly readable and the scenery was wonderfully visual. Firstly, I am going to rant about the good stuff, and at the reviews end I have a tiny complaint. But first, the characters: Number Four/John Smith: He is my favorite character all year. Mind you, the competition is fairly weak Reckless, Extras and The Running Man But still... He is a pretty cool guy. And I liked his personality. I agree with one of my friends reviews, he would make a good boyfriend :) Sarah Hart: I loved Sarah :) She was so likable! The whole time I was reading, I kept picturing Dianna Agron as Sarah. Later, whilst watching the trailer I am pleased to see Dianna Agron! They cast her as Sarah! PERFECT CASTING MOVE! Whoever was behind that deserves a pat on the back. Henri: Possibly my favorite character, at least in the top two.He was the awesome, kick-but, protective, chilled back father figure. I kept imagining him as a cross between Stanley Tucci and Henri Leconte. Number Six: I liked her appearance, but would have loved some more information on what she has been doing for the past 10 years, where she has been hiding, how her guardian was killed etc etc. BUT, I saw that in the film's cast she will be portrayed by Teressa Palmer. This is awesome for a number of reasons: 1) She is Australian. Like me. 2) She is from Adelaide, South Australia. Like me. 3) She went to the SAME FREAKING SCHOOL AS ME!!!!!But I digress, moving on: The pacing. As I previously mentioned, this was spot-on perfect! The book starts with a short, well written addicting hook. Then we are filled in on the characters and their lives, and presented with a problem. For a hundred pages or so, their is a focus on a cute relationship between characters, whilst the suspense of being hunted down rises-and we learn important facts about the main character. Then comes a 50 page block of suspense, and a bit of action, which is a small preview of what is to come. Then there is a crisis-important stuff happens (cant say or it would be a spoiler!), and finally there is a big-epic-awesome climx where all the shit hits the fan. There was not a dull part, and Mr. Lore (or should I say Jobie Hughs? haha take that james Frey, I found out who your underling is! No idea what Im talking about? this should explain it.)The writing style was great. Descriptive scenery, suspenseful prose , and surprisingly sweet romantic scenes. I could clearly the the small town-John's house, the school, the forest. All wonderfully written-or maybe it was just me over imagining things?Oh, and John and Sarah were incredibly cute together :)Now, onto a few problems I had with the book: -Characters. I know I said that this book has had the best character ive read about all year-but they still need work. They still need some more depth. Especially Sam, Mark and Number 6. The battle was almost hard to read with these character, since they seemed so darn flat. Hopefully we see all the characters develop in the highly anticipated sequel The Power of Six. (The title either means we see loads of #6-the character-Teressa Palmer making us Adelaidian's proud!-or the remaining 6 Lorien kids reunite, which would be totally awesome! (I wish I had a dollar for everybody who just though of A Very Potter Musical) . -Plot holes. Okay, so this is the main thing that holds this book down from 5 stars. *POSSIBLE SPOILERS TO FOLLOW*I never found out WHY The Mogadorians wanted to kill Number 4? We are told that the Mogadorians killed most of the Lorics for their resources, and they want to do the same to Earth. But WHY do they need to kill the numbered Loric kids? Cant they just let them be? Roam on Earth until its destroyed? And even if the numbered Lorics (cant think of anything else to call them) return to Lorien, then they would be killed anyway, by the thousands of Mogodorians already there? Even if all nine of their Legacies had developed, it would be no match for the thousands of Mogadorians who had fought thousands of Lorics (also with developed Legacies) years before. Oh yeah, and the Bernie Koaler (sp?) twist didnt surprise me. I did see it coming. *END SPOILERS* All in all, I really enjoyed the book. I cared for the characters and loved every second of reading it! Highly recommended to all (except for those who have an un-dying, sever hate for aliens). The movie trailer looks mediocre, but maybe they are just aiming it at the wrong audience? It shows to much focus on blue energy stuff, if you know what I mean. Fingers crossed the movie is amazing! Oh yes, And I feel lots of awesome fan-fiction coming on. Stay tuned."}, {"userName": "LeAnne", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/7862560-leanne", "userReview": "This was a teenaged fantasy-other world - alien - magical powers book I listened to along w my 14 year old. We started listening to it on a 5 Hour drive home this past weekend. Upon having unloaded the car, he called out to me MOM!!! CMON - LETS LISTEN TO THE REST! So, yeah. I put in 11 or 12 awful hours over the past two days with this teeny bopper thing. But my kid and I got to complain about the characters, ask each other plot questions, etc for all that time. PRICELESS! 💙💚"}, {"userName": "Sara", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/25950644-sara", "userReview": "Instead of writing a whole essay about the flaws in this book and my issues toward Pittacus Lore for writing such a disgraceful book as I had originally planned, I decided to write only one pro and one con. Hopefully, once you read the pro and the con, you can decide for yourself whether or not I Am Number Four is worthy of your time.\nPro:\n The plot and ideas expressed in this book are extremely clever and witty. An alien planet called Lorien was destroyed and in order to survive, nine Lorien children and their guardians were sent to planet Earth. However, these children are being persecuted by the alien race that originally destroyed their planet. \nThey caught Number One in Malaysia.Number Two in England.And Number Three in Kenya.They killed them all.I am Number Four.I am Next.\nSounds pretty badass, right? It was, it was.\nCon:\n The characters are stu-pid. John Smith (can I just point out how basic that name is?), the main lead, is Number Four, and the next one on the kill list. He's in danger so he constantly moves to different states in order to keep a low profile. But when he arrives at a small town, he not only makes a friend (his first one ever), but he also falls in love (it'd be cute if the romance wasn't so cliche and stupid). When John's guardian insisted on leaving because the race wanting to kill John was near, John, like a child, threw a tantrum, refused to leave and threatened his guardian by using telekinesis to lift him up in the air until he agreed to let John stay. \nTHIS FIFTEEN YEAR OLD IS GOING TO GET FREAKING MURDERED AND THERE HE IS JUST ENJOYING HIS WALKS WITH HIS FIFTEEN YEAR OLD GIRLFRIEND WHO HE BELIEVES HE'S IN LOVE WITH WHEN NEWSFLASH YOU'RE FREAKING FIFTEEN AND HE'S PUTTING HER IN DANGER BY STAYING AND ALL IS RAINBOWS AND SUNSHINES WHILE A FREAKING AGGRESSIVE ALIEN RACE IS LOOKING FORWARD TO STICKING A SWORD IN HIS FREAKING STUPID CHEST LIKE WHAT THE HECK KID YOU NEED TO GO HOW DUMB CAN YOU BE.\nSo, yeah. You decide: is I Am Number Four worthy of your time? Please make the right choice."}, {"userName": "Clare Cannon", "userReviewDate": "Oct 27, 2010", "userURL": "http://www.goodreads.com/user/show/3655732-clare-cannon", "userReview": "The trailer looks exciting - if you're into that sort of thing. So is the book it's based on any good? It really depends what you mean by ‘good'. It's readable, and the New York Times bestseller list shows it has a wide following (particularly among teen boys... and girls who like Alex Pettyfer). The basic storyline: nine young people came to earth from the planet Lorien to escape the evil aliens who attacked their planet. The Lorienites are super humans who look like us but have special powers. The evil aliens pursue them to earth, but a protective spell means they can only be killed in order from the first down to the ninth. The protagonist of our story is number four, the first three have been killed already, and he's next. He and his guardian take assumed names (John Smith and Henri) and move around frequently, trying to pass unnoticed. But at sixteen John's tired of running and wants to make friends, have a girlfriend and try to be normal. That lasts about a week before he starts to develop his special powers and his enemies track him down. The plot is probably the best part of the story, but the style is jarring. There's lots of action (fights and battles, including a retelling of those in history), leaving little room for character or relationship development. I can't help feeling, however, that the authors were trying to create a \"Twilight\" for males. There are some plot similarities: a super-human tries to blend in at a normal high-school, falls in love with a human and everything is great until the baddies turn up. And without crossing ‘the line' the love scenes are just as superficial and sentimental as Twilight, though the extent of the action means there are much fewer love scenes, so perhaps they'll do less harm. The author has taken the pseudonym of one of the characters mentioned in the story. A little more research tells you it's actually two people, James Frey (the controversial author of the false ‘memoir' A Million Little Pieces) and Jobie Hughes (a recent creative writing graduate who seems to have done most of the writing in this novel). According to Wikipedia (that gold-mine of popular wisdom) they actually set up a young adult publishing company in 2009 which aimed to create highly commercial novels like Twilight. Telling. So with that backdrop, here are some of the highs and lows. There's the characteristic ‘hope in adversity' theme that features in most epics; maybe it wouldn't feel so corny if I were a teen. Then there's the Twilight appeal of lover-boy's infatuation with his unbelievably beautiful (of course) classmate, and her rather sudden preference for him as well. The only ray of light was the paragraph explaining why she quit cheerleading and broke up with her previous boyfriend who was, naturally, the star of the school football team: she realised was becoming like him (i.e. mean and judgemental), drifting from her parents and friends, drinking and letting her grades slip, and she didn't want to be like that. John is different somehow, or so we're told. I was a little surprised at Henri's advice to John about marriage: back on Lorien it is a complete and life-long union, \"one of the gifts our planet gave us is to love completely. Without jealousy or insecurity or fear. Without pettiness. Without anger...\". He views human loves as much weaker and often shorter, though John - in his infatuated state - didn't want to agree. But then my cynical self suggests that maybe it's just part of the 'wholesome' Twilight, mass-market appeal. The youth of the author comes through when he mistakes John's immaturity for strength of character. John thinks he is being strong when he physically coerces Henri into letting them stay in town because he doesn't want to leave his girlfriend and friend, though it puts them all in danger. He literally holds him up in the air until he agrees... highly mature behaviour. And when Henri just gives in without fight or even reasoning... it doesn't seem realistic. There's also some quaint environmentalism: unlike the virtuous Lorienites, humans have been negligently killing the planet for years. So there's a bit of everything thrown in, perhaps in the hope that most will find something to like. The 2011 movie has John played by Alex Pettyfer (who looks 16 going on 30). It seems to have the 'all-absorbing' effect the book lacks, which may entice teens to give the book a try. And while I wouldn't call it good reading, perhaps teens who don't read much else will find it quite engaging."}], "description": "Nine of us came here. We look like you. We talk like you. We live among you. But we are not you. We can do things you dream of doing. We have powers you dream of having. We are stronger and faster than anything you have ever seen. We are the superheroes you worship in movies and comic books--but we are real.Our plan was to grow, and train, and become strong, and become one, and fight them. But they found us and started hunting us first. Now all of us are running. Spending our lives in shadows, in places where no one would look, blending in. We have lived among you without you knowing.But they know.They caught Number One in Malaysia.Number Two in England.And Number Three in Kenya.They killed them all.I am Number Four.I am next.", "title": "I Am Number Four\n      \n          (Lorien Legacies #1)", "url": "http://www.goodreads.com/book/show/7747374-i-am-number-four", "average": 3.94, "cover": "https://images.gr-assets.com/books/1305807140l/7747374.jpg", "reviews": 14738, "authors": [{"url": "https://www.goodreads.com/author/show/3380908.Pittacus_Lore", "name": "Pittacus Lore"}], "type": ["Young Adult", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/7747374-i-am-number-four", "http://www.goodreads.com/book/show/8442817-i-am-number-four", "http://www.goodreads.com/book/show/10400186-i-am-number-four", "http://www.goodreads.com/book/show/8598781-i-am-number-four", "http://www.goodreads.com/book/show/7953518-i-am-number-four", "http://www.goodreads.com/book/show/9462073-i-am-number-four", "http://www.goodreads.com/book/show/8598746-i-am-number-four", "http://www.goodreads.com/book/show/7953517-i-am-number-four", "http://www.goodreads.com/book/show/8659601-the-power-of-six", "http://www.goodreads.com/book/show/12971616-the-rise-of-nine", "http://www.goodreads.com/book/show/15861491-the-fall-of-five", "http://www.goodreads.com/book/show/19346451-the-revenge-of-seven", "http://www.goodreads.com/book/show/24488476-the-fate-of-ten"]}