{"ratings": 443, "userreviews": [{"userName": "Jenre", "userReviewDate": "Jun 02, 2010", "userURL": "http://www.goodreads.com/user/show/2620867-jenre", "userReview": "I have to admit, I'm a bit of a sucker for post-apocalyptic sci-fi books, especially those which chart the disintegration of society. It gives me a shiver down the spine to read about just how close society is to total melt-down. When I was a teen I loved John Wyndam's books, especially Day of the Triffids and other post-apocalyptic books such as Death of Grass by John Christopher. Why am I telling you all this, you may ask? Well, just that this novella by one of my favourite m/m authors fits exactly into that 'recovery and survival in the face of disaster' mould that can be found in books by John Wyndam. Unsurprisingly, I loved this book.I Fell in Love with a Zombie begins with our hero and first person narrator, Jay, coping with the aftermath of a swine flu virus which has wiped out most of the world, including his lover, Mike. Not only that, but some people who have supposedly died of the flu come back to life after a couple of days. These 'zombies' have limited speech and motor skills, but most horrifying of all, for no reason they attack humans with a lightening speed and superhuman strength. Jay battles with grief over Mike and the unknown fate of his family as well as surviving in a world littered with dead bodies and zombies who want to kill him. In desperation, Jay decides to leave the city in search of other humans. On the way he encounters many dangerous situations, not all due to zombies, and finds love in an unexpected place.As I said earlier, I loved this book. It contains many classic elements which can be found in post-apocalyptic survival books and I was delighted every time I came across one of these well loved parts in the story. Firstly, there was the theme of survival with Jay having to do things that he would never have done otherwise. At the beginning of the book Jay recounts the first time he had to kill a zombie who was attacking him. At the end of the account he says:Was this what my life was going to be from now on? It was enough to make me wish I had died with everybody else.It's not only rampaging zombies, Jay also has to cope with other survivors, never knowing who to trust, and yet desperate for some contact to ease his loneliness. In some ways these scenes were the hardest to read as Jay is treated badly by those with whom he hopes to find some companionship. It was heartbreaking. Jay's loneliness is a constant presence throughout the first part of the book as he tries to come to terms with the fact that his life has been overturned in less than a month.Another theme which I enjoyed is that of the journey that the hero has to take to find some semblance of peace. Jay travels from town to town by taking a discarded car and driving it until the petrol runs out. On the way he encounters different situations before finding someone with whom he can settle. Even then life isn't easy for Jay and Dave, and it isn't long before they have to continue their journey. This gave the book a pacey feel as the setting moves from place to place with our heroes. It also meant that there was a lot of action in the book which counterbalanced the slower parts as Jay muses on what has happened to him, and the section where he and Dave meet and begin to fall in love.Given what I've written above you might think that this would be a maudlin and slightly depressing read. Whilst parts of it were undoubtedly sad, as Jay copes with his grief and life alone, Jay is actually quite an optimistic character, with a strong sense of purpose. This injected the story with a bright shaft of hopefulness as Jay moves on from each difficult situation in the hope that the next situation will have a more positive outcome. I liked Jay a great deal, liked his willingness to see the best in others, even when they treated him badly and his pragmatism that life must go on, so make the best of what you have. As narrators go, Jay is incredibly sympathetic and likeable and this went a long way towards my great enjoyment of the book.One word of warning for those of a slightly squeamish nature. There are several gruesome parts in the story, especially those involving Jay and the zombies. Personally, I felt this fit well with the genre of the book and I'm not particularly squeamish and so those bits didn't bother me at all. I liked that the author hadn't chosen to wash over some of the more unpleasant aspects of life within a time of chaos, such as the stench of rotting bodies or the sorrow that whole families lay unburied. I also liked the depiction of the zombies, that they were disgusting and brutal, but also that, for some at least, there was a trace of humanity.Whilst reading this book I experienced a whole wealth of emotion. At some points I felt genuinely frightened, at other points angry. I felt joy and happiness for Jay and Dave, but also sadness for them - even crying at one point. I completed the book feeling overwhelmed, knowing that I'd read something extremely well written, that moved me. If you like sci-fi, horror and stories set in a post apocalyptic future, then this book is an absolute must. I thought it was bloody brilliant."}, {"userName": "Ami", "userReviewDate": "Jun 04, 2010", "userURL": "http://www.goodreads.com/user/show/134600-ami", "userReview": "WOW.That was the first word that came out from my mouth after I finished this novella. Sean Kennedy is one author that I keep my eyes on (ever since I discovered \"Tigers and Devils\"). When he mentioned about writing a different kind of 'love story' that involved zombie, I have been wondering how it would turned out. And who boy, did he deliver.It was a world after most of world's population was swiped away by Swine Flu. At the same time, without ogical explanation, some of the deads were also being brought to life as zombies. The narrator of this person, Jay, was one of the survivors. In a world that was desolate - where he must fight to survives, including killing brutal zombies if necessary, Jay met the one zombie that he never would have expected. His first love, Dave. But Dave wasn't like the other zombies. He somehow still had a spark of humanity in himself, despite the fact that he was no longer alive. Now Jay was faced with the fact -- was this a second chance for him? Even if it was in the most unacceptable situation?I won't even classify this as a love story. This is more like a futuristic/sci-fi short literature. Like reading Cormac McCarthy's \"The Road\" (which was good but too bleak for my taste). Like watching \"Blindness\". I feel that the theme is actually humanity and survival. While heartbreaking at one parts, brutally honest at the other, it also carries some hope in the end -- as Jay and Dave embraced the uncertainty of the future with a distant promise. It was really, REALLY EXCELLENT story. Hats off to you, Mr. Kennedy"}, {"userName": "ttg", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/1629211-ttg", "userReview": "Excellent dystopian zombie love story. Kennedy keeps his storytelling tight and his pacing fast in this short novella about pandemic survivor Jay who is moving from haven to haven as he tries to stay ahead of the \"zombies\" that wander the streets. Then one day, he's rescued from a swarm of violent zombies by another zombie, one that he soon recognizes as Dave, a man who was once his lover. But that's not the only surprise for Jay, as he realizes there's more to the zombie epidemic than he ever realized.Very smooth, unburdened writing that had underlying threads of both tension and melancholy--tension for being on the run and melancholy since both Jay and Dave lost loved ones in the pandemic, and realistically, even as they try to survive, those past relationships still ghost their present. But they're both \"living\" in this new reality, and reforming a connection, and that connection is the heart of the story. (Ironic that out of the three people Jay meets in the story, Dave the \"zombie\" exhibits the most compassion.) I also liked Kennedy's twist on zombies, both different from the general zombie lore, and similar. (You get shambling, you get 28 days later speed, and you get Kennedy's spin.)Great read, and overall not *too dark* considering the subject matter, which I liked. My only beef is that I wish it were longer since it would be interesting to see where things go from here. (This is understandably a very HFN story.)"}, {"userName": "Kassa", "userReviewDate": "Jun 07, 2010", "userURL": "http://www.goodreads.com/user/show/2095317-kassa", "userReview": "I Fell in Love with a Zombie is a funny, witty, clever, and seriously entertaining story. It’s a cross between Shawn of the Dead with the hopeful, somewhat neurotic, but very likable first person narrator and the setting is close to a classic post-apocalyptic movie like 28 Days. The beginning of the story describes the setting and how zombies evolved from a swine flu like virus. The deserted buildings, lack of food, barricading shelters, and sense of extreme loneliness all harkened to the opening scenes of 28 Days for me. It’s creepy, scary, and very believable. From there the narrator in Jay takes on a hopeful, almost wistful, tone as he describes how he came to be alone and his thought process in where to go and what to do. He travels from the city to a small town and happens to meet up with his ex-boyfriend, who is now a zombie. But unlike any zombie Jay has known and he’s not sure what that means. Figuring out not only what Dave is capable of but what Jay feels about it has some truly inspired moments. I literally laughed out loud several times, such as when Jay is mentally grumbling that zombie Dave is walking away. Oh. I was being abandoned again. Did he just want to get the last word in? That was so fucking like Dave.Alongside the entertaining elements is the very real isolation and danger of their predicament. Not only is Jay dealing with finding an ex and some unresolved issues around that, but they’re also dealing with other zombies, paranoid survivalists, and the real question of how to survive. This mixture of lighthearted humor, quick pace, great comic timing, and a realistic, dramatic setting all combine to give a thoroughly enjoyable and satisfying story. Additionally there are moments of extreme violence but again, it reminded me of the ultimate in zombie comedy. So the scenes didn’t feel gruesome even as limbs and blood are flying, but more so exaggerated for comic effect. Honestly that worked rather well as I thoroughly enjoyed Jay’s take on his surroundings and fights with zombies. He’s witty with a dry sense of humor that mixes well with the moments of stark fear, loneliness, and sickness at the world around him. He’s instantly likable and fun to follow along with whether he’s figuring out what to do or rationalizing his feelings. I can’t remember when the last time was I had such fun reading a story and hated to see it end. There’s even a mild sex scene thrown in but I’ll leave it up to readers to figure out how a zombie and a human make it work. It’s definitely worth the few dollars and time to read this gem."}, {"userName": "Heller", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/4975636-heller", "userReview": "[leave the farm. I don't trust that message about the new government and I worry for what they'd do to Dave when they realize he's one of the re-animated. (hide spoiler)]"}, {"userName": "MLE", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/2761976-mle", "userReview": "Interesting story. I liked the idea of Zombies in this story. It was different, and seemed well thought out. I really like Jay. He is a survivor, and willing to do what it takes to keep going. I respect that his losses haven't broken him. The ending felt very abrupt, and I'm hoping that there will be more to come. There's a lot I'd like to find out more about. I'm thinking their plans are not going to work out quite the way Jay hopes."}, {"userName": "Ayanna", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/10493318-ayanna", "userReview": "[I can think of no way that city would realistically accept Dave into their ranks and that's what bothers me the most. If anything, I see them \"accepting\" them and then taking Dave away to perform all sorts of sordid experiments on while they basically distract Jay with the vast humanness of it having people together again and needing to all do work (it's some kind of co-op. Has to be) and all that. And then shit happens. Idk, he finds out somehow?And then they have to leave...Or idk. That's where it stalls because I'm warring against \"BECAUSE FUCK YOU. I DON'T CARE HOW IT HAPPENS; THEY GET THEIR FUCKING HEA\" and \"...'realistically,' Dave would get killed (again?) and Jay would have to go on living as human without him.\" (hide spoiler)]"}, {"userName": "Jordan Price", "userReviewDate": "Jun 12, 2010", "userURL": "http://www.goodreads.com/user/show/2709426-jordan-price", "userReview": "As with Tigers & Devils, what made this story a delight to read, and will make it a re-read for me, is Jay's character voice. I love that he runs the gamut from desperate to survive, to pleased with himself for figuring out how to hotwire a car, to disgusted with himself for his first sexual encounter in ages, to hopeful (eventually.)The atmosphere and setting very zombie-movie-like, so zombie movie fans will definitely enjoy it. One thing the book was able to touch on that the movies don't is the inner turmoil of being a regular person who has to kill someone else to survive.The love interest is a surprise and a delight, and though he has very few lines, he's infused with a funny and disturbing pathos. He could very nearly have stolen the show, but he's handled adeptly so he doesn't.I do hope there's a sequel. The plot doesn't tie up in a neat bow at the end, but I think if it did it would overshadow the point, which is that Jay has found hope."}, {"userName": "Smokinhotbooks K.C.", "userReviewDate": "Jun 06, 2010", "userURL": "http://www.goodreads.com/user/show/2841223-smokinhotbooks-k-c", "userReview": "What better combination than zombies and manlove... Even though it is only 75 pages it didn't read like a short story. My only wish ( because I didn't want it to end) was that it was a little longer. \"You want my brains, motherf*cker? Come and get them!\""}, {"userName": "Chappy", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/11128890-chappy", "userReview": "Great twist on a zombie apocalypse tale.My heart went out to Jay...he lost Mike and then was so lonely trying to survive on his own. Thankfully, David finds and rescues him but everything is not as it seems.The story ends quite abruptly and I was hoping for a sequel???"}, {"userName": "Janna", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/2659749-janna", "userReview": "I Fell in Love with a Zombie is a novella written by the author of Tigers and Devils, one of my absolute favorite m/m romances. I adore Sean Kennedy’s writing and I love his sense of humor, also present in this very unusual story. The premise of I Fell in Love with a Zombie intrigued me immediately when I read the backblurb. I was curious how zombies could have a place in a romance story. It seemed an impossibility, because I’m one of those soppy romance readers who need a HEA or at least a HFN (Happy For Now) and I just couldn’t see it happening with a zombie. But I guess Sean Kennedy did make it happen. Sort of. The ending can be seen as a HFN. Although I’m not quite convinced yet about their HEA. But I bet, if Mr. Kennedy decides to write a sequel to Jay’s and Dave’s story, he can make me believe in a happily ever after for these guys if he wants to. Maybe he doesn’t want to. Maybe he didn’t want to write a romantic love story. I can’t really tell for sure. It’s not very romantic what’s happening in Jay’s and Dave’s life but rather gruesome and horrific. Yet, a love story it is. Or isn’t it? Jay and Dave were lovers a long time ago and Jay considers Dave as the one that got away. And even when Dave can’t talk much, being a zombie and all, his behavior shows he cares for Jay. If we consider this a romance story then at least it isn’t a conventional one, that’s for sure.Does it really matter? Not much, especially when we look at the other qualities of this novella. While reading the first pages - about the beginning of this incredible apocalyptic disease - I Fell in Love with a Zombie reminded me of a novel from José Saramago called Blindness. Here we also see a rapid spreading epidemic, which, in Saramago’s case, makes everyone blind. In Sean Kennedy’s novella it’s a swine flu like virus that causes people to die quickly and some of them to return as zombies. Both stories show a fascination with how people will behave when put in extreme situations, when conventional rules of behavior don’t seem to apply any longer. Where Saramago’s novel turns into a more moralistic lesson on human behavior in general, Kennedy’s novella focuses mainly on the feelings and events of one individual who tries to survive and entertain hope for a better future. But both stories make you wonder how you would behave in an extreme situation like this. With a few strokes of his pencil Sean Kennedy paints a very believable and realistic threat to our modern society. And that realistic picture relentlessly invites a ‘what if’ question.One of the other qualities of this story is the way it’s voiced through Jay in a first person POV. I enjoyed Jay’s narrative voice almost as much as Simon’s from Tigers and Devils. Jay’s view-point on things is witty, toned down and light. It makes all the horror bearable and even comical thanks to the way he describes the violent and gruesome occurrences. His voice makes this story a hopeful story. And I adore how Jay is interpreting Dave’s behavior; sometimes with so much humor I had to laugh out loud.But the choice for this one-sided point of view in first person also means no insight at all in Dave’s thoughts and feelings, aside from Jay’s interpretations in that regard. Somehow Dave’s (absent) point of view seems so incredible intriguing to me. I mean, who wouldn’t want to have a peek inside the head of a zombie, right? And maybe Dave’s POV would’ve added something that could’ve made me believe easier in their HEA. I guess, to convince me now, only a sequel to I Fell in Love with a Zombie will help... Just so Mr Kennedy knows what I’d like. ;)In short, I really enjoyed I Fell in Love with a Zombie because of the wit and lightness of Jay’s narrative voice and the originality of the story’s setting and vision on society. The message of hope that spoke louder than the horrid events and the unusual communication between the heroes added to my appreciation. However, as a romantic story I found this novella was not completely convincing. I guess I need to know more about how a human and a zombie are going to work out their differences and their communication problems to believe in a happy future for Jay and Dave. It´s because they are such intriguing characters, that I would happily read a complete novel about them. So, do zombies and romance match? I think they can, actually. Mr. Kennedy has shown me it’s not completely impossible. In fact, he has me wishing for a sequel to Jay’s and Dave’s story that I would buy and devour as soon as it would hit the shelves of the ebook store.Linking:Sean Kennedy’s website | blog | on Twitter| on Facebook | on GoodreadsBuy \nI Fell in Love with a Zombie\n hereOther books by this author:Tigers and Devils - one of my all time favorite m/m romances, check out why hereDash and Dingo: In Search of the Tasmanian Tiger, written with Catt FordWings of Equity (steampunk novel, released last week)For a complete list of Sean Kennedy’s short stories go hereThis review was originally published at my blog."}, {"userName": "Serena Yates", "userReviewDate": "Jun 22, 2010", "userURL": "http://www.goodreads.com/user/show/2798257-serena-yates", "userReview": "I liked this story because it carries a message of hope. Not just hope for humankind after a pandemic destroys society as we know it, but hope for those deemed \"unacceptable\" by the survivors.The main character and narrator of the story, Jay, changes from totally anti-Zombie to a more considered point of view. This is very difficult for him, because the Zombies are not really seen as human by anyone. They become violent at the drop of a hat, and nobody can figure out what causes it. Most people's response is sadly a very human one - kill that which you do not understand.When Jay runs into his ex-lover, Dave, who has turned into a Zombie, something triggers recognition in Dave - and Jay discovers that underneath the apparent lack of brainpower something human may remain. That is the part I liked best: hope for the individual, the one who is different, and even hated, to be accepted after all."}, {"userName": "Josephine Myles", "userReviewDate": "Jun 08, 2010", "userURL": "http://www.goodreads.com/user/show/3558604-josephine-myles", "userReview": "It was hard to know how to rate this - It was going along really nicely, and Sean has a great way with words. I love the post-apocalyptic scenario with zombie-ism as a virus, and Jay is an endearing and witty narrator.And then it ended so abruptly. I needed more. It felt unresolved, and I find it hard to imagine an HEA for Jay and his zombie boyfriend. I'll definitely read a sequel if there ever is one, but for now it was a strangely unsatisfying read, especially considering how much I loved it up to the very end."}, {"userName": "Renae Kaye", "userReviewDate": "Nov 12, 2015", "userURL": "http://www.goodreads.com/user/show/29358296-renae-kaye", "userReview": "I never expected Sean Kennedy NOT to write a good story. So the fact that I loved this story is no surprise to me. It's a short story/novella, so don't go in expecting a fully rounded, long falling-in-love novel. I would've liked a few more spots fleshed out, but it is what it is.Enjoyed. Wanted more. 4.5 stars.Where's the next bit Sean??"}, {"userName": "V", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/4663207-v", "userReview": "This is one of those times that I regret not reading a book sooner.What a terrific plot.My only complain is, the author still hasn't write a sequel for such a fantastic story."}, {"userName": "Deanna", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/3264585-deanna", "userReview": "\"The Davisons had shit taste in music. I pawed through their CDs and grimaced....Creed? Why they weren't using that as a coaster, I don't know.\"I love Sean Kennedy's humor :)"}, {"userName": "Lori", "userReviewDate": "Aug 10, 2015", "userURL": "http://www.goodreads.com/user/show/20569708-lori", "userReview": "I enjoyed it but it kinda just ended. I want to know what happens next."}, {"userName": "⚣❣☙ Cocky™ Michaelle ❧❣⚣", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/12661067-cocky-michaelle", "userReview": "[the title is a slight misnomer as MC didn't \"fall for\" a zombie; the zombie was in fact someone he'd loved once and let go, but obviously never stopped caring for. (hide spoiler)]"}, {"userName": "Wax", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/34309429-wax", "userReview": "I'm not saying I want to read more books with zombies, but honestly this wasn't bad. I was drawn into Jay's story and predicament early on. I didn't like the uncertain ending, but honestly I'm not sure what kind of HEA or HFN ending you could have with a post-apocalyptic world and a zombie MC."}, {"userName": "Achim", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/22952388-achim", "userReview": "Nice dystopian shorty about the Zombie Apocalypse although these zombies are not movie-like zombies but probably victims of a flu virus mutation - so no rotten, brain-eating corpses but nevertheless mindless killer machines. But maybe not so mindless after all. At least one of them is special and remembers his life prior to the virus change.There's no real horror and the love story is more reactivating a past love than falling in love with a tortured soul in dangeous times. Was it too short to convince me of both, too short to close loose ends, to built a unique world, to create something else than a vague HFN? Was a nice read but could have been more."}, {"userName": "Lissa", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/30936578-lissa", "userReview": "[I've watched enough zombie movies and read enough zombie books to realize that heading toward a reconstituted \"civilization\" at the end is almost always A VERY BAD IDEA. I can't help but think that it would be an exceptionally bad idea for poor Dave, who is still a zombie. Jay is hopeful that this place might have a cure for him - I have a very bad feeling that the \"cure\" is going to be a bullet into Dave's head. But apparently we'll never know, because it ended. It's kind of a let down, to be honest.  (hide spoiler)]"}, {"userName": "Valentina Heart", "userReviewDate": "Jun 19, 2010", "userURL": "http://www.goodreads.com/user/show/3100057-valentina-heart", "userReview": "I actually really liked this story, and would have given it a 5 if not for the abrupt ending. Now I know these zombies are not the same as the 'movie' zombies, but I couldn't help thinking about possible endings. And it was basically the mood that stayed with me from the moment I started reading. Someone wrote how the book is about hope, and I just don't see how it can be. People are not creatures full of love and understanding. Sure, those emotions exist, but are never the first ones to come out. No one will say, 'oh hey, he's a zombie, I bet he's one of the nice ones', the more realistic reaction would be shoot first apologize later. For that same reason the ending left me feeling sad. I can only see resolutions that leave both of them dead, anything with a real happy ending is just too unrealistic. But then again, I'm talking about fiction where a man fell in love with a zombie and that's just a lot of weird.The ending aside; I loved the gore in the book, Jay was pretty much a great character and the flow of the story didn't slow down at all. Even though it is a short story, I never had that feel to it while reading, and my over all impression is \"quite satisfied\"."}, {"userName": "Tammy K.", "userReviewDate": "Aug 24, 2012", "userURL": "http://www.goodreads.com/user/show/4626742-tammy-k", "userReview": "Three and a half stars, but since this one ends with such a feel good ending, I am going to round up to Four stars.This is my idea of a ‘good’ zombie short story. The characters are well defined. The pace of the plot is steady with several moments of ‘run for your life’ action. We see both the good and the not-so-good in mankind/zombie-kind. The author has created his own version of Zombies and offers up a solid explanation on how they came about. (Kudos’ for originality). While the very thought of a Romance story with a Zombie made me cringe at the beginning, I feel that it ended up working nicely and was believable (if such a thing can be said about a zombie romance) when it unfolded in the story. This is the first book that I have read by this author. I found his writing to be smooth and enjoyable. I do not know if this story has a part two to it or not, but if it does I would be interested in reading it.I recommend this book to Zombie Horror, and MM Romance readers."}, {"userName": "Zuyuan", "userReviewDate": "Jul 10, 2010", "userURL": "http://www.goodreads.com/user/show/2879830-zuyuan", "userReview": "Made me think of a story from S.A. Payne. Started with swine flu, human turned to something non-human, one of protagonist who can survived the flu falling in love with the other one who turned to something else but still had human conscious. I didn't say it's duplication since I can understand how this flu can inspire such theme. But this version was too short, some of behavior seemed absurd (why someone was easy to put all of their trust to zombie cause it saved your life, even it used to be you lover, in this world end situation which it's hard to put your believe in anything). I got the feeling, like when I read \"Dash and Dingo\" from this same author: it's good to write with imagination but something should base on real thing. Actually I'm glad this story end within only 74 pages because my interest left me since chapter 2."}, {"userName": "Scarlett", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/22525233-scarlett", "userReview": "[ do they reach Arkana? Is there a cure?  (hide spoiler)]"}, {"userName": "Wren", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/2621165-wren", "userReview": "I wasn't at all sure I'd like it. I should know better: Sean Kennedy doesn't disappoint. His story-telling is terrific. Here we have Jay, who is one of the few survivors left after a plague hits the earth. A plague that turns the victims into zombies (who tend to be violent but don't seem to eat brains). Jay goes on the run and ends up with a former lover, Dave, who is a victim of the disease. But Dave still retains some humanity, enough that the two men forge a bond and carry on through a few adventures and...?"}, {"userName": "Sarah", "userReviewDate": "Jun 02, 2010", "userURL": "http://www.goodreads.com/user/show/1856722-sarah", "userReview": "I Fell In Love With A Zombie by Sean Kennedy was cool. I think I brought this mainly to see how in gods name he’d make a Zombie into a sexorin fest… without appendages falling off during important, intimate moments. This was a totally cool read and I cannot believe he made a zombie seem sexy. I mean, ewww! The story was nicely paced with loads of great world building and plenty of scope to maybe write more. Zombies, true love and an apocalyptic world.http://sharrow.wordpress.com/2010/07/..."}, {"userName": "Penny", "userReviewDate": "Jun 09, 2010", "userURL": "http://www.goodreads.com/user/show/2665212-penny", "userReview": "I loved this short story. It's about Jay. One of the few survivors of a virus that has spread across the world. Unfortunately not all the victims stayed dead, but turn into Zombies. Yes, even a past lover.So it's a zombie, horror, adventure, love story.It's not your typical m/m romance novel. It's not for the faint of heart, but it is a wonderful touching romantic short story. It just has a zombie in it and a bit of gore thrown in.Sean Kennedy has done it again!!!"}, {"userName": "Lisa Worrall", "userReviewDate": "Feb 24, 2012", "userURL": "http://www.goodreads.com/user/show/5080742-lisa-worrall", "userReview": "I totally loved this story. Felt so much for Dave and Jay, felt their loss and then the possibility that this was not the end for either of them despite Dave's...um... condition.This is one of my favourite re-reads and is firmly ensconced on my Kindle :)"}, {"userName": "Chris", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/99747-chris", "userReview": "Very good post-apocalyptic m/m with which I had two problems: the ending is abrupt (is there going to be a sequel?!) and I kept hearing this song in my head the entire time I was reading."}], "description": "Jay didn't expect to be one of the very few survivors of the virus that decimated the country, leaving shambling, ravenous zombies behind. Fighting for his life amongst the dead, he keeps moving until the day he's surrounded and facing his bloody end-and shockingly, another zombie saves him. But not just any zombie... it's Dave, the first man Jay ever loved, and there's something special about him even now, in the midst of the horror around them.", "title": "I Fell in Love with a Zombie", "url": "http://www.goodreads.com/book/show/8350094-i-fell-in-love-with-a-zombie", "average": 3.62, "cover": "https://images.gr-assets.com/books/1356184135l/8350094.jpg", "reviews": 94, "authors": [{"url": "https://www.goodreads.com/author/show/1120780.Sean_Kennedy", "name": "Sean Kennedy"}], "type": ["Romance", "Horror", "Fantasy", "Horror", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/8350094-i-fell-in-love-with-a-zombie", "http://www.goodreads.com/book/show/6430659-tigers-and-devils", "http://www.goodreads.com/book/show/15841201-tigerland", "http://www.goodreads.com/book/show/25719764-tigers-on-the-run", "http://www.goodreads.com/book/show/17159584-the-first-supper", "http://www.goodreads.com/book/show/16352284-just-like-florence-nightingale", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}