{"ratings": 5321, "userreviews": [{"userName": "Oriana", "userReviewDate": "Aug 10, 2007", "userURL": "http://www.goodreads.com/user/show/30800-oriana", "userReview": "I love this book so much that I copied out some of the best lines in thick sharpie onto a shirt that I wore so often it's now terribly stained and faded and rather hard to read. An interesting cyclical thing, sort of, given the flimsiness of what remains of Sappho's works. Also, I once had a writing teacher who said we should follow the \"Sappho rule\": every word of your writing should be so good that if there was a great flood or conflagration and only snippets of lines survived, there would still be great beauty and intensity in what was left. Kind of a tall order, but given the state of publishing today, I'd say it's needed now more than ever."}, {"userName": "Hadrian", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "Fragment 147:Someone will remember usI sayeven in another timeEven the fragments are beautiful and haunting. Excellent use of epithets. Take, for example 'sweetvoiced', or 'sweetbitter unmanageable creature', or 'goldsandaled dawn'. What poet was this, that even the tattered pieces mark her as one of the best ever?"}, {"userName": "anna (readingpeaches)", "userReviewDate": "May 03, 2016", "userURL": "http://www.goodreads.com/user/show/8645302-anna-readingpeaches", "userReview": "if i weren't already a lesbian, this would turn me into one someone will remember usi sayeven in another time"}, {"userName": "Liz Janet", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/5114433-liz-janet", "userReview": "\"Someone will remember usI sayeven in another time\"Sappho was an ancient Greek poetess from the island of Lesbos, but little is known of her life, with mostly fragments of her work surviving, and which are often not taken as biography. So little of her works survives, that it is known she was exiled from Lesbos after the rise of Pittacus, but very little of her political standing has been discovered. “yet if you had a desire for good or beautiful thingsand your tongue were not concocting some evil to sayshame would not hold down your eyesbut rather you would speak about what is just” Sappho wrote with wit and sharpness, but so soft and beautiful, that I would love to listen to her fragments being sang, they create a space of peace within me. It makes me happy. “Evening you gather backall that dazzling dawn has put asunder:you gather a lamb, gather a kid,gather a child to its mother.” It is to say, that a poem written 2 millennial ago, by an ancient woman, not to my eyes in its native tongue, and not even in its entirety, and it still survives and is widely read, loved, admired, and studied, is to show the magnificence of the author."}, {"userName": "Marley", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/72975-marley", "userReview": "I took high-school Latin, as perhaps a couple of my recent reviews have mentioned. The first poem they ever had us translate in our AP Catullus/Horace class was Catullus' half-translation (\"inspired by?\") of the second-most-complete Sappho lyric I think we have: Sappho 31. It's perfectly preserved as far as it goes, because it's in someone else's book and quoted in full in Greek, except that it very likely cuts off suddenly. As Carson translates the original, it begins \"He seems to me equal to gods,\" (I now paraphrase) that lucky man who is standing in front of you and getting to hear your sweet voice. It's every high school crush rolled into one, double-strength for adults. The awe there of a particular type of love from afar. And having your voice stopped up, just as the poem goes on to say. Really, it's the run into the third stanza, which came through just as overwhelming in my own half-proficient high school translation out of Latin when I was 17, that gives me shivers:for when I look at you, even a moment, no speakingis left in meno: tongue breaks and thinfire is racing under skinand in eyes no sight and drummingfills ears.(Nobody seems to be sure whether this stray last line was a mistaken addition in a later copy or whether the jerk of a grammarian we got it from decided to break off one line into another stanza--and Catullus' copy doesn't help either, because after some very gorgeous poetry, he breaks off somewhere ENTIRELY differently right at this point -- starts grumbling about how all this desire is probably just a sign he's got too lazy a schedule. That's the Roman in him, even though no other Roman appreciated Sappho like Catullus did--all his love poems are to \"Lesbia,\" after Sappho's homeland, which had at the time more sensual and artistic than solely homoerotic connotations.) The PointAnyway, this is a long, nerdy, Goodreadsy introduction, but there's a reason: a poem nearly 2,600 years old, not even in its original language, not even in its entirety, and originally written as a song but with the music lost aeons ago (one wonders whether this is what will happen to Bob Dylan one far-away day)--what I am saying to you is: all these qualifiers, all this in between us and the original impact, and me bored in high school, and it still knocked me flat on my ass.And now you realize there is only one other poem in better shape (from a book of her work as late as the 8th century, which KILLS me that she survived in good shape over 1,000 years but couldn't last more), and every single other one in existence is in pieces--some still getting you most of a through-line, others just one or two or three words. Shattering.And of course, this is exactly what Carson plays up, translating every tiny snowflake of parchment we've ever been able to trace to Sappho, every time some stodgy grammarian or hokey philosopher quotes half a line to keep his audience from falling asleep--and showing you as best she can how much is lost, and how much you can tell through this incredibly hazy lens how fantastic a poet she clearly was.And I'm getting frustrated, because this input form has eaten half my review twice already (starting to feel like our subject, here), but I'm going to lay out what this means if it kills me:The way Carson shows you the gaps are with the power of ASCII art: brackets, brackets everywhere. Left hand page is always the Greek, laid out in the SHAPE of what remains, brackets to show the yawning gaps in the ripped or torn or blotted parchment, and to show the little interpolations that remain. Right hand page is her English--still using brackets, but gesturally, to give you a sense of the \"papyrological event,\" as Carson says in her introduction--and desperately trying to translate only the words that remain, to show you that lack that is also need that is also desire.How else to behold:]noble]taking]sing to usthe one with violets in her lap]mostly]goes astrayand realize even those few words come from two full stanzas we will never see, and not go as silent as the lover in that first poem I mentioned, trying to grapple with the passion for life that still blazes out of this gorgeous, tragic confetti?"}, {"userName": "Alex", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "We have almost none of Sappho, the Bob Dylan of ancient Greece, the most famous poet of like 600 BCE. What we have is aching and mysterious and sexy. As my friend JG pointed out, there's an intimacy here that feels modern. A lot of the old Greek stuff feels like dudes standing around yelling (because a lot of it is drama). Sappho's in the room with you, whispering in your ear.For her dress when you saw itStirred you. And I rejoice.In fact she herself once blamed meKryptageneiabecause I prayed this word:I wantSome of the other fragments, you're a little confused by. If Not, Winter collects every surviving Sapphic word, which is a few poems and a heap of scraps, and that's noble but you may find yourself asking, what good does this do anyone?I had a girlfriend in college with this tattooed on her ankle, probablyBut Anne Carson is not just a mighty translator but a poet herself, and she's off on her own trip here, making a sort of found poetry out of these fragments, a larger statement about echoes and loss. And it works: it has a cumulative power, skimming over all these snatches and breaths.Their heart grew coldthey let their wings downI mean, cumulative power and also it reminds you of those refrigerator magnet poetry sets on the fridge at someone's party right before someone rearranges it to sound dirty.Who even knew they had soda back then?"}, {"userName": "☙ percy ❧", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/19742661-percy", "userReview": "\"But now she is conspicuous among Lydian women as sometimes at sunsetthe rosyfingered moon surpasses all the stars. And her lightstretches over salt seaequally and flowerdeep fields.\" -------\"someone will remember usI sayeven in another time\"(this last one is particularly poignant because it makes up the entirety of the poem. damn.)"}, {"userName": "Brierly", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/25485458-brierly", "userReview": "I don't know what to dotwo states of mind in meAnd so goes this translation of Sappho, compiled by Anne Carson. Carson's done something unique here: presented Sappho in exact context, missing fragments and all. A lot of Sappho's work has been lost or truncated; Carson includes a lot of blank space to emphasize just how much of Sappho we will never know. The book itself is multilingual; the left page reads in Greek while the right reads in English. I love reading ancient texts this way--my copy of Troilus and Criseyde follows this format.you came and I was crazy for youand you cooled my mind that burned with longingReading Sappho is an otherworldly experience because she feels so distant from me in time . . . 2500 years. Two thousand and five hundred plus years. That is humbling, especially with so few women's texts surviving until present day. Guess what? Sappho is still very good. She writes lyric poetry; in this case, Sappho's poems are meant to be sung with a lyre. This edition was a short, enjoyable read that I would recommend to fans of history, poetry, and women's lit. Brava to Carson for her work compiling this."}, {"userName": "Warwick", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "•Greek Lyric: Sappho and Alcaeus, tr. David A Campbell, Loeb 1990•If Not, Winter: Fragments of Sappho, tr. Anne Carson, Virago 2002•Stung With Love: Poems and Fragments, tr. Aaron Poochigian, Penguin 2015SAPPHICS FOR SAPPHOEach ellipsis teases, inviting dreams – dreamsFormed from torn papyruses' single words. Bare,Lonely scrawls of sigmas and psis that sing, still,      Sticky with meaning.Fragments all. What's left is the one percent, rich,Rare. When Alexandria burned, the whole worldChoked to breathe the smoke of the ninety-nine. Now,      Desperate to get youBack, we trawl millennia-old unearthed dumps,Hunting out your clotted Aeolic strung lines.Lone hendecasyllables' sounds that awed Greeks      After you quoted. Questing, reading, marvelling – so we search on,Poets seeking answers to questions all lostLovers ask. Your answers still reach us, drenched, fresh      From the Aegean.A LIFE IN FRAGMENTSTowards the end of the second century AD, in the last flickering light of classical Greece, a philosopher called Maximus, in a city on the Levantine coast, wrote a grammatical textbook about figures of speech. Casting around in old books for examples of how poets have described love, he writes: ‘Diotima says that Love flourishes when he has abundance but dies when he is in need: Sappho combined these ideas and called Love bitter-sweet and “ἀλγεσίδωρον”.’So we have this one word that Sappho wrote, some eight centuries before Maximus was born. This is what we mean when we talk about her poetry existing in ‘fragments’. The Canadian poet Anne Carson translates this example as:171paingiverVery often these remnants are quoted with no regard to any poetic quality, but rather in illustration of some grammatical point. Apollonius Dyscolus, for instance, writing again some time in the 100s AD, included a throwaway remark on variant dialects during an essay on pronouns. ‘The Aeolians,’ he said, ‘spell ὅς [‘his, hers, its’] with digamma in all cases and genders, as in Sappho's τὸν ϝὸν παῖδα κάλει.’ Again Carson's translation gives us just the phrase in question:164she summons her sonCarson's translation of Sappho's oeuvre is well subtitled ‘Fragments of Sappho’, since most of what's left is of this nature. It's certainly nice to have everything collected in this way in English, though it must be admitted that her book sometimes seems more an exercise in completionism than in poetic expression. That said, as other reviewers have pointed out, reading pages and pages of these deracinated terms (‘holder…crossable…I might go…downrushing’) can succeed in generating a certain hypnotic, Zen-like appeal.Nevertheless, such things lose a lot by being read in isolation; the as it were archaeological pleasure of digging them out of their original context, in works of grammar or rhetoric, is completely absent. For that, the Loeb edition translated by David A. Campbell is far preferable, for all that he has no pretensions to being a poet, just because you get Sappho delivered in that context of other writers. The fonts used for the Greek are also much more readable in the Loeb. (The Carson edition does include the original Greek, and points for that – though there are some strange editorial…choices? mistakes? – such as printing ς for σ in all positions.)MUSIC AND LYRICSTo the Ancient Greeks, Homer was simply ‘The Poet’ – and ‘The Poetess’ was Sappho. She was held in extraordinarily high esteem, which makes it the more frustrating that so much of her has been lost: ninety-nine percent, according to some experts. Only one or two poems remain that can be said to be more or less complete.Her poetry is mainly ‘lyric’, that is, designed to be sung while strumming along on the lyre. Sappho was, in modern terms, a singer-songwriter; she was known to be an extremely talented musician, designing a new kind of lyre and perhaps even inventing the plectrum. When we read her poetry now, we have to remember that we're looking at something like a shredded collection of Bob Dylan or Georges Brassens lyrics, with no idea of how their meaning would have interacted with the music.But however important the lost melodies, we do know that she was revered for the beauty of her phrasing. This is something translators struggle with. Fragment 146, a proverb about not wanting to take the bad with the good, is rendered literally by Campbell as ‘I want neither the honey nor the bee’ and by Carson, ‘Neither for me honey nor the honey bee’ – which is better, but consider the alliterative dazzle of the original:μήτε μοι μέλι μήτε μέλισσα(mēte moi meli mēte melissa)Reading the Greek, even if you don't understand what any of the words mean, will often get you halfway there with Sappho. Say it out loud and you'll get a tingle, as it starts to dawn on you what all the fuss might have been about.But the rest of the job has to be done by translators. The Loeb edition will not help you here: its prose translations are only a crib to help you study the original. Carson's approach is slightly conflicted. She quotes approvingly a well-known statement from Walter Benjamin to the effect that a translation should ‘find that intended effect…which produces in it the echo of the original’, i.e. that one should translate ideas and feelings rather than words. But she also claims to be trying to use ‘where possible the same order of words and thoughts as Sappho did’, which is the sort of thing that makes me instantly suspicious.Here's her version of Fragment 2, which is one of the more complete poems we have, scratched on to a broken piece of pottery which has miraculously survived from the second century AD. The first stanza (an invocation to Aphrodite) is probably missing, but the next two run like this:]here to me from Krete to this holy templewhere is your graceful groveof apple trees and altars smoking      with frankincense.And it in cold water makes a clear sound throughapple branches and with roses the whole placeis shadowed and down from radiant-shaking leaves      sleep comes dropping.This is not bad. I think the word order is unnecessarily foreign at times, but it does sound good and Carson even includes a few of Sappho's famous hendecasyllabic lines – though they are not true ‘Sapphic’ verses, a very strict form which is not well adapted to English (as you may be able to tell from my attempt at the top of this review).Aaron Poochigian, in a selected edition for Penguin Classics, takes a different approach. ‘Sappho did not compose free verse,’ he chides, perhaps with one eye on Carson, ‘and free-verse translations, however faithful they may be to her words, betray her poems by their very nature.’ Poochigian's version of the stanzas above goes like this:Leave Crete and sweep to this blest templeWhere apple-orchard's eleganceIs yours, and smouldering altars, ampleFrankincense.Here under boughs a bracing springPercolates, roses without numberUmber the earth and, rustling,The leaves drip slumber.I think that's pretty great. It takes much more liberties with Sappho's actual words but, to the extent that it produces a sensual thrill in English, it more faithfully reproduces the effect that Sappho had on her original audience. At least, to me it does. Poochigian's selection, called Stung with Love, is much shorter than the other two I read, but a very good encapsulation of her qualities. It also has by far the best introduction, a brilliant essay which puts Sappho in her context extremely well. And because it's the most recently published, it's also able to include the magic new Sappho poem discovered in 2013, written on a scrap of papyrus used to stuff a mummy.BIGGER THAN A BIG MAN‘Someone will remember us / I say / even in another time.’ Another fragment. The irony of this one upset me at first, because she should have survived in far greater quantities than she did. But even so, the thrill of hearing the voice of a woman who lived six centuries before Christ was enough to catch my breath over and over again. Generally speaking, women in antiquity are pretty silent. But Sappho isn't, and her influence, despite the meagre remains we have, is ginormous.It might sound hyperbolic to claim that all modern love poetry is inherited from Sappho, but in fact there's a very real sense in which that's true – so great was her reputation among Classical writers and the Europeans who, in turn, studied them, that it's quite possible to trace a direct line from Sappho, through Catullus, to the Romantic poets and from them to contemporary pop lyrics. Every song about the pain of unrequited love owes something to Sappho's Fragment 31, for example – ideas now so clichéd that we forget they have an ancestry at all. That's just natural, surely – just the way people speak? But no, it isn't natural, it's Sappho. She's part of our inheritance, part of our language. She's under our tongue."}, {"userName": "Jimmy", "userReviewDate": "Jun 28, 2011", "userURL": "http://www.goodreads.com/user/show/1325473-jimmy", "userReview": "[ld sandals, the final cu (hide spoiler)]"}, {"userName": "Trish", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "This marvelous collection of the extant fragments of verse attributed to Sappho is a glorious spur to the imagination. Sappho was a lyricist, a poet, a musician. It is unknown whether or not she was literate in reading and writing, but her work was collected in writing, and reprinted, but little has survived the centuries. Only one full poem, the ode to Aphrodite, survives whole at twenty-eight lines.Sappho was known and lauded throughout the ancient world for the beauty of her poems accompanied by the lyre. She wrote nuptial songs mainly, it seems, for the tenor of the fragments suggest the happy circumstance of a marriage. The Encyclopedia Britannica suggests that Sappho taught young women the arts of courtesanship, seduction, marriage which may (I speculate here) be one reason why she was so universally adored and admired. Can we all agree that to be a brilliant courtesan requires great intelligence: a deep understanding and acceptance of human nature and desire, and enormous self-control and discipline? Add to this her apparently unparalleled skill as a poet—alas! We do not have enough of her work surviving to adequately judge, but the fragments set us to dreaming and are an undeniable spur to writers and lyricists alike. We will have to trust her contemporaries and sup upon lines like \nEros shook my mind like a mountain wind falling on oak trees\nand \nyou burn me\n Anne Carson has chosen to reprint fragments attributed to Sappho, sometimes single words, separated by brackets to indicate lost fragments. The blank spaces are fruitful places for meditation on what was once there. Sometimes the few words jump from the page \nfor as long as you want\nor\n] ] ]]goatherd ]longing ]sweat ] ] ]]roses ]]]\nDoes your mind race? And this \n ] ] ] ]robeandcolored with saffronpurple robecloakscrownsbeautiful]purplerugs]]\n and \n]Dawn with gold sandals\nIf many of the song or poem fragments were composed for weddings, just that concept brings a host of associations and an understanding of Sappho’s history. There is more to learn about her as an individual (she had three brothers, was married with a child, was exiled to Sicily in her twenties it is thought) but not much more. It is thought she lived from 610 B.C. to 570 B.C. A collection of her work was published during the Middle Ages in nine volumes but has not survived. Our imagination will have to suffice. That the work of an individual has so inflamed the public imagination for such a long time is cause enough for wonder. One fragment shows an awareness of her fame\nsomeone will remember us I say\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t even in another time\n Sappho was a “honeyvoiced…mythweaver,” \n]nectar poured from gold ]with hands Persuasion\nThe surviving fragments are a kind of spur to the creative mind. When writers or lyricists find themselves stuck, they could do much worse than flip through this book for its inspiration. To my mind Sappho addresses writer's block: \nfor it is not right in a house of the Musesthat there be a lamentthis would not become us\n Apologies to Anne Carson and publisher AA Knopf for not being able to reproduce the high quality typesetting and lovely spacing in this book. If this review is at all intriguing to you, try to lay your hands on a printed copy from 2002. The formatting is as informative as the print. Also, I put pictures in my blogpost."}, {"userName": "Miriam", "userReviewDate": "Mar 05, 2009", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "In this place you Kypris taking upin gold cups delicatelynectar mingled with festivities:pour.***Evening you gather backall that dazzling dawn has put asunder:you gather a lamb, gather a kid,gather a child to its mother.Useful front- and end-notes."}, {"userName": "Khashayar Mohammadi", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/32374363-khashayar-mohammadi", "userReview": "so]]]]]Go [so we may see []ladyof gold arms []]doom]"}, {"userName": "laura", "userReviewDate": "Dec 07, 2008", "userURL": "http://www.goodreads.com/user/show/30920-laura", "userReview": "the difference between four stars and five is something categorically different from all other star-number differences. the move from 'i really liked it' to 'it was amazing' is a move away from the the realm of sheer personal pleasure, and toward something externaler. this book was often a pleasure, but that's not why it gets five stars. i could have enjoyed it more. it took me a little while to get into it. at the beginning especially i sometimes found myself flipping through inattentively, mind wondering, and have to go back. but once i hit a stride, it was a transcendent kind of pleasure. i sometimes didn't realize i was holding my breath until it hurt a little. i read pages and pages and can't remember turning any.a hundred other reviewers will have said it better, but anne carson has made something serious, and earnest, and illuminating. i can't even fully grasp the temporal distance across which these words have cut. the primary accomplishment here, for what it's worth, is that i feel i know what sappho actually said, and what its power is."}, {"userName": "Camilla", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/60222131-camilla", "userReview": "When Sappho’s fragments are better than everyone else’s complete poems you know she’s an actual goddess. Sappho and Carson are a match made in Elysium."}, {"userName": "Zanna", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "yes! radiant lyre speak to mebecome a voiceThis book seems so short. How little of Sappho we have. Anne Carson's very brief, graceful introduction hints at the difficulty of best arranging that little to get the most from it - the most excitement (\"brackets are exciting\"), the maximum number of delicious shivers... The Greek is on the left page, translation on the right, with lacunae marked where appropriate in both. Carson uses the clearest language possible, and adorns the text with minimal punctuation.Carson has given us a poet's translation that feels as fresh and immediate as cold water, yet somehow carries to us the thrill of reading an ancient text, an incomplete text, a distant music sometimes caught and sometimes lost. Her work here is exquisite, I think. Reader: don't skip the intro, and don't neglect to read the notes. Carson says nothing unless she has something worth saying.As for Sappho... well... nothing I say will do her justiceSome men say an army of horse and some men say an army on foot and some men say an army of ships is the most beautiful thing on the black earth. But I say it iswhat you love."}, {"userName": "Shawn", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/21117192-shawn", "userReview": "This is one of those rare instances when I finish a book and have almost no opinion about it. There are about 200 translations, but so many of them are just a couple of lines, or even just a few words, or even just one word. Anne Carson notes in her preface how a break in the text is \"exciting\" because then the reader gets to imagine what might have been written there. While that's true in some cases, when we're talking about one word per line surviving and everything else being illegible, connecting those dots becomes essentially futile.Still, there are a few translations that are really beautiful, and some of the fragments do have enough to at least get a gist of Sappho's original tone and meaning. Leave it to Anne Carson to take ancient literature and find a way to make it sort of experimental and postmodern."}, {"userName": "Jonathan", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/531153-jonathan", "userReview": "yes! radiant lyre speak to mebecome a voice"}, {"userName": "Madina", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/38874522-madina", "userReview": "maybe i'll put out a proper review later but right now my heart is just aching / bursting with warmth at the same time. these fragments... what would i do to recover them in their full form, tbh. also POETS: USE MORE EPITHETS. smush up words. our sapphic icon would smile at you."}, {"userName": "Maggie", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/147203-maggie", "userReview": "Anne Carson, poet and Classicist, presents all we have of Sappho in the original Greek and in English translation. Carson indicates with brackets where the papyrus has simply fallen apart or is incomprehensible, which gives a curious flow to most of the fragments. When I read this, I heard some of the lines with pauses; some of the lines overlapped as if multiple voices were speaking, breaking in and over the voice before it.As you sift through chance lines, half-expressed thoughts, you begin to wonder and compose in your head. What sort of dripping cloth? Is it a tear-soaked handkerchief? Is is a bloodied gown? Whose eyes? Why would she not think to touch the sky with two arms? And as you're musing, you're suddenly rewarded (as if poetic contemplation was not reward enough) with whole chunks of poetry, full finished lines and thoughts. The rhythm, which I cannot express in the expected vocabulary of meter, resonated (I hate this word, but nothing else suffices) like all the best lines I've ever read - be it by Tiptree, Szymborksa, or Fitzgerald. These are phrases that I understand, but cannot articulate why. These are ideas that will sit with me and then suddenly pop up years later.And with the turn of a page you're back to the laundry lists of adjectives and nouns, the scraps and pieces that you start again to fit together into something... anything. I could imagine another great poetry project in which the poet tried to incorporate into individual poems some of these phrases or adjectives left behind.Carson's notes are interesting too, even if you're like me and lack any real Classical learning. How this woman manages to dance between Sappho and Emily Dickinson, and Julian, and George Eliot, and Gertrude Stein is beyond my comprehension, but it all works beautifully.That it really - it's beautiful."}, {"userName": "Jamie", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/31790398-jamie", "userReview": "I'm fine, I'm not fucked up over this or anything."}, {"userName": "Tori", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/45103079-tori", "userReview": "stars around the beautiful moonhide back their luminous formwhenever all full she shineson the earthsilvery-from fragment 34"}, {"userName": "Jason Gignac", "userReviewDate": "May 17, 2009", "userURL": "http://www.goodreads.com/user/show/2326585-jason-gignac", "userReview": "(Original Review)This is the sort of book that strikes me cleverness dumb. So I will simply begin by telling you what the book is.If Not, Winter is a collection of all of the known works of Sappho - almost entirely fragments. Sappho was, in ancient Greece, considered one of the two greatest lyric poets, alongside Pindar. However, probably in part because she was a woman and in part because she appears to have been bisexual (her home was Lesbos, and the words lesbian and sapphic come from her), only one complete poem of hers survives, and then a series of fragments. The book, then, is a collection of those fragments, some salvaged bits of papyrus, some quotes (sometimes just a quoted word) from her contemporaries.Of all the books I've ever read, as a physical book, this is probably the number one most beautiful, in terms of words, I've ever seen. The concept and layout is beautiful, sparse, and extremely powerful - it is a book that proves that books themselves are still pertinent and meaningful. The beautiful thing is, without the layout, honestly, most of these fragments would feel meaningless and orphaned. The way the fragments are presented conveys the feeling of loss, the frustration of something we can never have in ways that description cannot. Fragment 107 is a good example. Each fragment is composed of facing pages, the left in Ancient Greek, the right an English translation. Fragment 107 is an empty, white page, with 107 on the top, and simply the fragmented sentence:\"do I still yearn for my virginity?\"Similarly 126 just reads:\"may you sleep on the breast of your delicate friend\"Sometimes there is more, as in 104, where there is enough to get a fleeting echo of a voice in it:104AEveningyou gather backall that dazzling dawn has put asunder:you gather a lambyou gather a kidyou gather a child to its mother104Bof all stars the most beautifulOf course, in isolation like this, that seems silly. But it isn't! I saw a review that likened it to trying to hear a poorly tuned radio station. To me, it's more like sitting outside of a concert, slowly realizing that they're playing something beautiful, and then having the concert end before you can get in the door. Ther are lines, sometimes:138: stand to face me belovedand open out the grace of your eyessometimes, there is even enough to catch the gist of a tune:94:I simply want to be dead.Weeping she left mewith many tears and said this:Oh how badly things have turned out for us.Sappho, I swear, against my will I leave you.And I answered her:Rejoice, go andremember me. For you know how we cherished you.But if not, I wantto remind you] and beautiful times we had.For many crowns of violetsand roses] at my side you put onand many woven garlandsmade of flowersaround your soft throat.And the brackets! I ahve never had a relationship with a piece of punctuation like I've now developed with the square bracket, which signifies, in the text, a lost block of text, illegible or destroyed:] heart] absolutely] I can]] would be for me] to shine in answer] face]] having been stained]And so it is, the entire book. Whenever you read a poem in translation, there is a certain feeling of loss - in this case, Carson takes that loss and uses it as a tool, instead of an impediment, uses it to show it what it actually means to be blind to beauty, or even worse, to destroy it or prevent it. Every frustrating break, every meaningless half sentence after a beautiful unfinished metaphor speaks in this powerful white space, whispering, \"This beauty was and is no more. A man, like you, destroyed it. History is a damaged cloth, and we, we men, are moths...\"By the end of the book, the fragments have sheared themselves into single words, it's like listening to the broken soul of a mad person, these bursts of meaninglessness, meaningful only because we wish they were, empty, but pregnant with impossible loss:184danger185honeyvoiced186Medeia187of the Muses188mythweaver189soda190manyskilled191celery192gold anklebone cupsAnd that's the end. gold anklebone cups, and the book of history closes, a woman is put into a little book (it take about two hours to read), and tucked away into a mass of whitespace, and the shreds of what she was. If you love poetry, and you want to remember why you love it, and what life would be without it, read this book."}, {"userName": "Daniel Chaikin", "userReviewDate": "Oct 28, 2016", "userURL": "http://www.goodreads.com/user/show/18695911-daniel-chaikin", "userReview": "65. If Not, Winter : Fragments of Sappho by Anne Carsoncomposition: c ~612-570 bcetranslation 2002format: 389 page hardcover, quite beautifully done by Knopfacquired: library read: Oct 16-19rating: ?What an odd, curious experience. On the left page are the poems in Greek, as preserved, with random bits of letters and lots of gaps. On the right page is the translation, as much as can be translated. It seems to be a very direct translation, although she had to take leaps here and there. And, even in the translation, she preserves the gaps. Some poems consist entirely of half lines. Nothing is filled in. So you scan through lots of oddball scraps, and suddenly get very excited when a complete sentence shows up, or even a stanza!There isn't much left of Sappho, The Poetess of Ancient Greece. Her nine books are lost and only handful of lengthy sections of poems exist - maybe two are complete. All we have is a reputation and a very many tantalizing fragments quoted or found here and there. Carson claims she finds the gaps exciting, as we can imagine our own various completions. She has put together a beautiful book, one for reflection as we look at a page of two incomplete lines and can spend some time, if we like, pondering them. As they are the only thing on the page, we might just do that, and then do it again on the next. Or you might find yourself trying to learn some Greek by finding the reoccurring words, or other such nonsense tasks. I really really like that this book exists. I can't, however, say that I truly got anything useful from reading it. And, if I did, couldn't possibly tell you what that was."}, {"userName": "Elie F", "userReviewDate": "Sep 21, 2017", "userURL": "http://www.goodreads.com/user/show/54680202-elie-f", "userReview": "\"I would rather see her lovely step and the motion of light on her face than chariots of Lydians or ranks of footsoldiers in arms.\"\"You came and I was crazy for you and you cooled my mind that burned with longing\"\"Virginity virginity where are you gone leaving me behind? no longer will I come to you no longer will I come\"It's hard to explain why I don't strongly love Sappho. The words are beautiful even in fragments, although they do seem too feminine and sensual to me. I find it hard to project myself into her poems. There is just something missing there."}, {"userName": "sassafrass", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/11660972-sassafrass", "userReview": "Even fragmented Sappho's poetry is absolutely beautiful and profoundly moving. Trying to pick a favourite would be impossible, so I will just go with one of the final extracts that I adored: 'spangled isthe earth with her crowns'Short, dismantled, and yet still wonderful."}, {"userName": "Anya", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/6098324-anya", "userReview": "YAAAAAASSSSS MY QUEEN YAAASSS"}, {"userName": "J.", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/17241396-j", "userReview": "Sappho was a musician, her lyric poetry was composed to be song. She lived in the city of Mytilene on the island of Lesbos from 630 B.C. It is assumed that due to political affiliations she was exiled to Sicily between 604 and 595 B.C.The Greek philosopher and historian Strabo said of Sappho, 'Sappho an amazing thing, For we know in all of recorded history not one woman who can even come close to rivaling her in the grace of her poetry'. She was called 'the tenth muse' by Plato. One poem has survived intact all the rest are fragments. Her words are sensual, beautiful and put down with great passion and sometimes frustration.\"no tongue breaks and thinfire is racing under skinand in eyes no sight and drummingfills earsand cold sweat holds me and shakinggrips me all, greener than grassI am and dead- or almostI seem to me.\"Sappho subverts the male literary epic tradition. 'O immortal Aphrodite of the many coloured throne'. As Mary Beard says in her essay \"Sappho Speaks\", Sappho is echoing 'the words of the hero Diomedes in the midst of battle in the fifth book of Homer's Iliad when he prays for help to the goddess Athena'. Showing us the distance between the male domain epic heroism and female private concerns. Sappho is reinterpreting Homeric epic to give it a fresh female meaning. From soldiers in battle we leap to women in love. Sappho subverts the language. \"I would rather see her lovely step and the motion of light on her face than chariots of Lydians or ranks of footsoldiers in arms.\"Anne Carson the translator of this work is director of graduate studies in Classics at McGill University Montreal. Carson uses brackets and line breaks in the text where there are holes or breaks in the papyrus. She also provides notes on the text for those who want a more in depth reading.This is an interesting format in which to present the work as if you the reader are reading the papyrus with all it's breaks and gaps. There is a parallel translation with the Greek provided on the facing page. She is very strict about translating word for word rather than translating the flow or feeling so this is not a loose presentation of the work. You find yourself filling in the gaps. As it is a faithful reflection of the work, some pages have only two or three words on them. I'm sure somebody more interested in poetry can appreciate and find beauty in the spareness of the book. I found myself surmising about what was left out by cause of destruction. It's an interesting approach, in a sense the incompleteness encourages the reader to engage more with the work. Still in my opinion this faithful plain approach doesn't always reflect the passion of the work fully but is true to it.\"Eros shook mymind like a mountain wind falling on oak trees\"Sometimes her words are prescient.\"someone will remember usI sayeven in another time\"."}, {"userName": "Nathan", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/25213052-nathan", "userReview": "I finished this last Thursday, but I've had a hard time thinking of something to put down, since very idea of assigning Sappho a star rating makes me feel dirty. Sappho really has some fantastic bits in here, but since only one poem remains in its entirety, it's hard to judge her quality of writing and ideas. Poem 69, for example, just reads \"Sinful\", since that's the only word that survived. It would feel wrong to assign any value to something so poorly preserved.That being said, Sappho has some beautiful language. And it's remarkable that she's still relevant after almost 2600 years. In the first poem, she writes about how pervasive the notion of the fickle woman who doesn't know what she wants is. She writes:  For if she flees, soon she will pursueIf she refuses gifts, rather would she give themIf she does not love, soon she will loveeven unwilling It was the \"even unwilling\" that got me. It says in so few words the feeling that a woman who decides her own life just doesn't know what's good for her. An older man was giving my brother romantic advice the other day, and he said to him something along the lines of:\"I asked my wife out several times before she said yes. Make sure to remember that no doesn't always mean no\", and I thought of this poem. Sappho wrote it centuries before people cared about non consensual sex, millennia before there were talks of rape culture, and yet in plain words she expresses the feeling that she is treated like less of a human because she is a woman.Anne Carson has also taken wonderful poetic license here in translation. There's a clear lyricism, yet the poems are presented accessibly. Some of the line breaks and formatting were clearly not in Sappho's original script, but it gives a modern feeling to what's been written. It's a remarkable feat that only another poet could have accomplished to show both the ancient feeling and the modern reverberations as clearly as they are in If Not, Winter. A collection to revisit, it's a tragedy that so little of her work has survived."}, {"userName": "S.", "userReviewDate": "Oct 27, 2010", "userURL": "http://www.goodreads.com/user/show/612774-s", "userReview": "It makes me uneasy to be underwhelmed by a book the rest of the planet rates very highly, but underwhelmed I was. I am neither a Greek scholar nor have I read Sappho previously, so maybe this was the wrong place to start. There were definitely some good fragments in the book, but a lot of the time I was having an emperor's-new-clothes experience. For example, one page has the fragment:sinfulAnother page says - ]]all]but different]hair]The ]s represent places in the original Sappho where the papyrus is destroyed or illegible. There are fuller pages than these, and many of the poems and fragments are supplemented by end notes, which are in part explanatory.I do like the frequent violets, and the \"dripping (pain)\" but give me Emily Dickinson any day. I think the most exciting moment of reading this book was when it dawned on me that the title of JD Salinger's \"Raise High the Roof Beam, Carpenters\" is a line from a Sappho poem."}], "description": "Of the nine books of lyrics the ancient Greek poet Sappho is said to have composed, only one poem has survived complete. The rest are fragments. In this miraculous new translation, acclaimed poet and classicist Anne Carson presents all of Sappho’s fragments, in Greek and in English, as if on the ragged scraps of papyrus that preserve them, inviting a thrill of discovery and conjecture that can be described only as electric—or, to use Sappho’s words, as “thin fire . . . racing under skin.” By combining the ancient mysteries of Sappho with the contemporary wizardry of one of our most fearless and original poets, If Not, Winter provides a tantalizing window onto the genius of a woman whose lyric power spans millennia.", "title": "If Not, Winter: Fragments of Sappho", "url": "http://www.goodreads.com/book/show/209833.If_Not_Winter", "average": 4.38, "cover": "https://images.gr-assets.com/books/1436946290l/209833.jpg", "reviews": 391, "authors": [{"url": "https://www.goodreads.com/author/show/59712.Sappho", "name": "Sappho"}, {"url": "https://www.goodreads.com/author/show/34336.Anne_Carson", "name": "Anne Carson"}], "type": ["Poetry", "Classics", "Lgbt", "Glbt"], "outlinks": ["http://www.goodreads.com/book/show/209833.If_Not_Winter", "http://www.goodreads.com/book/show/150253.If_Not_Winter", "http://www.goodreads.com/book/show/948204.If_Not_Winter", "http://www.goodreads.com/book/show/209828.Sappho", "http://www.goodreads.com/book/show/235719.Poems_and_Fragments", "http://www.goodreads.com/book/show/24874364-come-close", "http://www.goodreads.com/book/show/209835.Poems", "http://www.goodreads.com/book/show/6707803-stung-with-love"]}