{"ratings": 5794, "userreviews": [{"userName": "Lola  Reviewer", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "It’s as though Jennifer L. Armentrout wasn’t even trying to be original. Like she thought, ‘‘Okay, so I need to write a book because I’m on contract, but I don’t have any new ideas, so I’m just going to write about something that’s been written before, and add a lot of cheesy scenes, and my fans will probably enjoy it.’’Nuh-uh. You should know that I’m a JLA fan. Have been ever since I read the Lux series. I even loved THE PROBLEM WITH FOREVER, which she published last year. I have to say I find her fantasy books better than her contemporary ones, because it’s easy to be cheesy and cliché with contemporary romance, but I’ve always adored her writing and characters.This book, however, displeased me from the start. I finished it, of course, because one cannot not finish a JLA book—that’s how addictive they are. Unfortunately, I rolled my eyes for the entire drive (HA!).I have a problem with contemporary novels that are trying to be mysterious. Look at the blurb for this one. It’s so intentionally vague. It’s a marketing strategy, but seriously not a good idea in this case, since the ‘‘mystery’’ isn’t one, and also, when you get to that part, you’re going to be so annoyed, because there’s nothing original about Lena Wise’s ‘‘mistake.’’ The first part should have been removed. And can I just say that irony in a story isn’t always good either? Like the fact that Lena’s family name is ‘‘Wise.’’ Oh, for the love of God. Anything else would have been better—literally anything. To be honest, I thought this book would be dealing about teen pregnancy, and I expected it. I mean, come on, ‘‘A single choice can change everything.’’ She’s a teen, who’s in love with her best friend, who she recently kissed, and she’s a virgin, and the sort-of prologue shows her in a hospital. But I was wrong. Oh, how I wanted to be right. It would have been more interesting than this. I’m not saying what Lena deals with is not important, since it obviously is, and it’s true that there should keep being stories about it. But if you’re going to write about something that’s been written a thousand times before, add something original to it, something that makes it YOUR story, not your borrowing of a thousand other authors’ stories. I know I’m complaining a lot, but I did like Lena. She’s a credible teenage girl who hasn’t everything figured out. She loves books, works hard, even plays volleyball. She’s a nice kid. Her blaming herself is definitely annoying, but we are warned about it beforehand, and I’m sure anyone with a conscience would blame themselves in a case like Lena’s. Plus there’s good writing, no surprise there. And once again, it’s addictive. Just not memorable, rather cheesy and predictable. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "5 stars!!!   “I should’ve listened to that little voice in my head and that feeling in the pit of my stomach, but I hadn’t. If I had, today would’ve been different. Tomorrow would be like all the better yesterdays.”  Gosh I love JLA books, she never fails to pull me out of a book rut and brighten my day!Lena Wise is about to start her senior year of high school, and her biggest concerns are getting into her college of choice and having a crush on her best friend Sebastian, the boy next door. But very quickly, something changes her life, a choice. The wrong choice. Now Lena’s entire life has changed leaving her in turmoil and completely turned around.Lena’s friends try to be supportive, but more and more she pushes them away, including Sebastian. But Lena falls deeper and deeper into a spiral of guilt, and she needs to find the strength within herself to move on from what happened.  “Actions and inactions have consequences. If we did not accept responsibility or blame for them, then we’d be at risk of repeating those actions.”  It’s no secret that Jennifer Armentrout is one of my top favorite authors, I can open 99% of her books and fall in love with them in a couple of words or pages. If There’s No Tomorrow follows in the same vein, I was completely sucked in by JLA’s writing and Lena’s story from the very beginning and stayed up late into the night to keep reading. She also writes the best male love interests that make you swoon and want to date the good guy.The themes most present in this book are consequences and forgiveness. I won’t say exactly what happens with Lena as it’s a spoiler, but what happened to her could happen to anyone, teen or adult. My heart bled for this girl, and all of the other people in the world who had been through what she had. It may be a story we’ve heard before, but I think it’s one that merits repeating.A beautiful story, and one that will stay with you for a long time. If There’s No Tomorrow is a book worth driving to the bookstore to buy on release day!  “You do deserve happiness and a future and everything you’ve ever wanted. That one night is not going to define your whole life.”   ARC provided by the author. All quotes in this review came from an advance unedited copy and may be subject to change in the final product. Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"userName": "Candace Robinson", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/33995641-candace-robinson", "userReview": "Armentrout is the one author that I know I can always get into her books from the get go. This one was no exception. It was an emotional ride and didn't have a lot of angst like her other books, and it wasn't needed here. There were some swoony scenes though, and Sebastian was great! I wanted to shake Lena at times, but I understand why she felt the way she did. I felt like this book also makes you really think about things. I only wish the side characters were developed more! Loved it! Full review on my blog https://literarydust.wordpress.com/20..."}, {"userName": "Jennifer Kyle", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/9916227-jennifer-kyle", "userReview": "3.5 Stars"}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "“One of the things I’d learned was that when someone offered you a hand, you took it. And sometimes it was hard to see that offer or accept it, but life was easier when you did.”\nDuring the first half of the book I was simply enjoying the story of a girl crushing on her best friend since they were children. I was really looking forward to a cute, romantic read like one of Kasie West’s novels. I forgot this was JLA, the same author of The Problem With Forever which although I loved, I also read with caution, dreaded and worried over my heart getting crushed because of the tragedy threatening to happen. That book did exactly those things to my heart but in the end it also put the pieces back together. I should have taken the same caution when I read If There is No TomorrowJennifer Armentrout is kind of like Colleen Hoover of the YA genre. Like CoHo, she write tragic stories and raises societal issues worthy to stir moral debates but at the same time, throws in a really swoon worthy love story in them. Her writing is just as addictive and as gripping and often makes me pause to mull over the thoughts written all over the book and makes me sympathize with the characters. After the tears and the heartbreak, in the end I was left satisfied, hopeful and whole again.\n“We don’t always get tomorrow. Sometimes it’s not because of death. Sometimes it’s the decisions we make for ourselves.”"}, {"userName": "Suzanne Leopold", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/9004645-suzanne-leopold", "userReview": "Lena Wise is starting her senior year of high school. She is an honor student who also plays varsity volleyball and works part time. Lena has a tight circle of girlfriends from school but her best friend is named Sebastian. He grew up next door and they have been been friends since childhood. The only troubling thing in her life is that she wants a romantic relationship with him. She is afraid to tell Sebastian how she feels fearing that his feelings are not mutual. Sebastian plays football and is under pressure from his father to continue playing throughout college. Lena’s parents are divorced, and she has not been in touch with her father for years. Their relationship develops into a trusted sounding board for each other's problems. Their friendship gets tested one evening when an error in judgement redefines their lives forever.This is a Young Adult book written by Jennifer L. Armentrout. Having raised a pair of teens I could relate to this authentic depiction of the struggles of today's youth as they progress towards adulthood."}, {"userName": "justmiaslife", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/45823447-justmiaslife", "userReview": "Es gibt echt wenige Bücher, bei denen ich schon während des Lesens des ersten Kapitels weiß, dass dies ein absolutes fünf Sterne Buch wird, deswegen hat es mich umso mehr gefreut, dass dies bei \"Und wenn es kein Morgen gibt\" von Jennifer L. Armentrout der Fall war. Mich hat es selbst zutiefst überrascht, da ihr letzter Jugendroman \"Und morgen lieb ich dich für immer\" ehrlich gesagt eher ein Flop war. Lena & Sebastian's Geschichte haben mir dann jedoch wieder einmal bewiesen, warum die Autorin zu den absoluten Queens in YA-Bereich zählt.Die Grundthematik des Romans hat mich von vornherein angesprochen, da ich Beste-Freunde Romanzen absolut liebe! Die Protagonisten Lena und Sebastian kennen sich schon seit frühesten Kindheitstagen an und sind seitdem unzertrennlich. Zwar hegt Lena schon seit damals Gefühle für Sebastian, allerdings fehlt ihr das gewisse Selbstvertrauen, um ihn darüber kundwerden zu lassen. Und plötzlich kommt auch alles anders: Ein schwerer Schicksalsschlag stellt nicht nur ihre gemeinsame Freundschaft, sondern auch ihre Gefühle auf die Probe.Mit Lena konnte ich mich von der ersten Seite an total identifizieren, da ihre Gedankengänge meinen eigenen gar nicht so unähnlich sind. Es kommt selten vor, dass introvertierte Buchcharaktere sich über die selben Dinge Gedanken machen wie ich und ich das Gefühl habe, ich selbst könnte ein Teil dieser Geschichte sein. Als Leser merkt man schnell, dass sie mit dem Prickeln bezüglich Sebastian mehr als überfordert ist und die gemeinsame Freundschaft nicht gefährden will, weshalb sie ihre eigenen Bedürfnisse und Wünsche hinten anstellt. Besonders schön fand ich, dass sie selbst gerne gelesen hat und es deshalb im Buch auch einige Anspielungen auf andere Romane wie z.B. von Sarah J. Maas und Erin Watt gab.Sebastian war ein absoluter Bookboyfriend, was ich selbst vorher niemals gedacht hätte. Er hat eine sehr humorvolle Ader, kann allerdings auf der anderen Seite auch sehr einfühlsam und gefühlvoll sein. Man merkt einfach sofort, dass auch für ihn die Freundschaft mit Lena etwas ganz besonderes ist und er sie auf keinen Fall verlieren möchte. Ich weiß gar nicht wieso, aber sein Charakter hatte irgendwie so viel Charme, dass ich ihn einfach direkt in mein Herz geschlossen hab.Die Liebesgeschichte der beiden konnte mich vollkommen überzeugen. Besonders schön finde ich, dass bei den beiden alles damit beginnt, dass sie beste Freunde sind und sich daraus schließlich mehr entwickelt. Aber wenn zu einer Freundschaft Gefühle hinzukommen, ist das natürlich ein doppeltes Risiko - denn wenn es mit der Liebe nicht klappt, verliert man nicht nur diese, sondern auch eine Freundschaft. Die Romanze baut sich ganz langsam auf und entwickelt dann weiter. Welches Ereignis die beiden jedoch dann wieder auseinanderreißt, müsst ihr an dieser Stelle selbst lesen. Fazit: Jennifer L. Armentrout hat hier nicht nur einen sehr gefühlvoll, sondern auch bewegenden Roman erschaffen, der absolut authentisch geschrieben ist. Ich hatte während des Lesens die ganze Zeit eine Gänsehaut und habe mich mit den Charakteren gefreut, aber auch gleichzeitig mit ihnen gelitten. Wer einen Jugendroman sucht, der einem unter die Haut geht - der hat mit \"Und wenn es kein Morgen gibt\" das richtige Los gezogen."}, {"userName": "Glire", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/7227066-glire", "userReview": "Is there such a thing as trying too hard? Let's see...\n\"I could not wait to get home, shower off the scent of fried chicken tenders and burnt tomato soup, and finish reading the latest drama surrounding Feyre and the fae courts.\"\nOh, so Lena reads. I don't like that much the books of SJM, and this feels a bit like advertising, but... she reads and that's good. ------\n\"Then I was moving on to that sexy contemporary read I’d seen people talking about in the Facebook book club I lurked in, something about royals and hot brothers. Five of them. Sign me up for that.\"\nAnd now she's doing a bit of advertising to Paper Princess, ok.------\n\"I was legit boring. I read more than I actually talked to people.\"\nlol, yes, I get that you like to read.------\n\"I’d always been a reader and I read a lot, usually sticking to books with some sort of romantic theme and a classic happily-ever-after.\"\nOk, this is getting awkward.------\n\"Lori used to make fun of me nonstop for it, claiming I had cheesy taste in books, but whatever. At least I didn’t have pretentious taste in books like she did.\"\nSo, you're telling me that people who don't read romantic books are pretentious? ------\n\"Sometimes I just wanted to...I don’t know, escape life. To delve headfirst into a world that dealt with real-life issues to open my eyes, or a world that was something else, something completely unreal. One with warring faes or roaming vampire clans.\"\nIs she seriously going to keep making references about SJM's books?------\n\"I was so ready for Feyre to kick some serious ass. I slapped the hardcover shut and pressed my forehead against the smooth cover. My heart pounded in my chest. The last five chapters had been a nonstop heart attack, and I prayed that the third book was already out.\"\nYes, she is. -- I wonder why SJM said this was one of his all-time favorites.------\n\"Sometimes I wondered how we’d become such close friends. We were polar opposites. She didn’t read unless it was flirting tips in Cosmo or the weekly horoscopes in the magazines her mom had around the house. I, of course, read every book I got my hands.\"\nOH YES OF COURSE YOU DO. But, please, do tell me once more how much you love to read, you erudite, you literature goddess. I think the previous 80 times have NOT BEEN ENOUGH.------So, when people say there's no such a thing as trying too hard? SHOW THEN THIS."}, {"userName": "Alyssa", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/8472395-alyssa", "userReview": "4.5 stars.***Review posted on The Eater of Books! blog***If There's No Tomorrow by Jennifer L. ArmentroutPublisher: Harlequin TEENPublication Date: September 5, 2017Rating: 4 starsSource: ARC sent by the publisherSummary (from Goodreads):Lena Wise is always looking forward to tomorrow, especially at the start of her senior year. She's ready to pack in as much friend time as possible, to finish college applications, and to maybe let her childhood best friend Sebastian know how she really feels about him. For Lena, the upcoming year is going to be epic--one of opportunities and chances.Until one choice, one moment, destroys everything.Now Lena isn't looking forward to tomorrow. Not when friend time may never be the same. Not when college applications feel all but impossible. Not when Sebastian might never forgive her for what happened.For what she let happen.With the guilt growing each day, Lena knows that her only hope is to move on. But how can she move on when she and her friends' entire existences have been redefined? How can she move on when tomorrow isn't even guaranteed?What I Liked:I wasn't planning on reading If There's No Tomorrow. I'm a huge fan of JLA's books, but her YA contemporary didn't seem like it would be for me. To begin with, I don't usually love YA contemporary, especially though-issue YA contemporary. The Problem with Forever is 100% not for me, and I have avoided that book. I was going to do the same with this book, but when I received an ARC of it, I decided to give it a shot. Especially since I knew that certain elements that made me steer clear of The Problem with Forever were not present in If There's No Tomorrow. I'm glad I gave this new book a chance because I ended up enjoying it!To be clear: The Problem with Forever and If There's No Tomorrow are not related. They are both YA contemporary standalone novels. I'm comparing them because they're both YA contemporary novels by JLA, but they are not part of a series or anything like that.This book is told in three parts: yesterday, today, and tomorrow. \"Yesterday\" begins the story, with everything that happened before the accident. Not in a flashback sort of setup, but the story itself, before the accident. \"Today\" is after the accident. \"Tomorrow\" is after the accident and after Lena makes some decisions. I liked this setup a lot. I don't enjoy stories with a lot of flashbacks so I'm glad this book had none. Rather, Armentrout told the story like a normal novel, but there were dividers every third of the book. Nothing about the narrative changed, but you knew something was different by each section divider. Before the accident, immediately after, and after when Lena decides some things.The tagline of this book is \"A single choice can change everything\" and this is incredibly true. Before, Lena was enjoying the last summer before senior year, working and hanging out with friends, including her neighbor Sebastian whom she has been in love with since they met as kids. When the accident happens, everything changes. Lena is not the same, and neither are her friends, whom Lena is sure will never forgive her.This is tough-issue contemporary, but it isn't the kind of tough-issue contemporary that I can't read. It is heartbreaking but not dark. It is thought-provoking but not hopeless. Lena is lost, but drowning. This book deals with a lot of \"tough issues\", like death, grief, counseling, underage drinking, relationships, even parent-child relationships. It's a dense book that doesn't feel dense, because the story is so engrossing and captivating.I connected with Lena easily and could see myself in her, on certain levels. She loves being home and reading a book in her bed. She isn't a party type and doesn't like to drink. She loves hanging out with her friends but she knows how and when to prioritize work or school or sports. After the accident happens, Lena sort of shuts down, and shuts everyone out. Her response is completely understandable. I liked her a lot, during yesterday, today, and tomorrow. I felt like I understood her and it made liking her very easy.This story is told from her POV and she is the only primary character, but the secondary characters are just as great as she is. Sebastian is her best friend, and her next-door neighbor. They'd known each other for nearly ten years, and have been inseparable. She has been in love with him - and what she doesn't know is that he had always been in love with her. Sebastian is such a sweetheart; he's charming and a little arrogant, and a gentleman. He's a genuinely good guy and it's no wonder Lena's mom liked him and trusted him.I liked Lena's friends Dary and Abbi. Both are supportive and kind, even when they were struggling with their grief over the accident. Lena and Abbi's friendship becomes strained, but it was wonderful to seem them work on their relationship. This friendship seemed so authentic, given the ups and downs, their reactions to things, their fights. The parents in this book are not crazy or absent. Lena's mom is a wonderful mom who is clearly in Lena's life like a normal mom would be. Lena's mom and dad aren't together and her dad is a point of conflict in the story, but Lena's mom is awesome. Sebastian's parents are also pretty cool, though Sebastian's dad pushes him a little too hard. But it was nice to see that the parents of the characters (minus Lena's dad) were present and in their children's lives.I loved the slow-burn romance of this story. Sebastian and Lena are best friends, and they are secretively in love with each other. This story is a roller coaster in terms of the accident and everything after, but there is also a lot going on in terms of the romance. It's slow-burn, but there is also a lot of chemistry between Sebastian and Lena. There are plenty of sweet and steamy scenes in this book (YA appropriate). I loved seeing them open up and be honest with each other. Their romance is sweet and swoony and ship-worthy and I loved it.This book was a delight to read, even when it was heartbreaking and sad. Lena goes through so much and has to work through so much, but it was a wonderful journey to experience. The ending is excellent and a HEA in several different regards - not a bittersweet or heartbreaking ending, don't worry. I love how Armentrout ended the book!What I Did Not Like:I wanted a little more detail in terms of the aftermath for certain legal things. I know this is super vague but I don't want to spoil things. I felt like Armentrout didn't provide enough specifics (that I remember?). In general, the book wrapped up well, but there were a few small loose ends that could have been taken care of. Nothing major though, that would have affected how the book ended.Would I Recommend It:If you enjoy YA contemporary, this is definitely not a book to miss. Armentrout does a fantastic job with the story, the characters, the romance. I'm not usually a fan of YA contemporary and I was going to pass this one straight, but I'm glad I didn't. This book was the kind of contemporary that I don't mind and most of the time, enjoy. I definitely think YA contemporary fans shouldn't miss this one! I'm more of a fantasy girl and I know many readers are, but this was a lovely change of pace.Rating:4.5 stars. It had been quite some time since I read an Armentrout book - I preferred her paranormal stuff to her fantasy stuff. I'm glad I tried this one. It might be up there among my favorites of hers, both in YA and adult (I do like her adult books a lot). Armentrout has outdone herself!"}, {"userName": "Bree", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/29344066-bree", "userReview": "Short and Sweet: If you’re looking for a book to destroy your soul and then piece it back together. Read this.This book left me like:I sometimes have a hard time reading books that deal with grief. Especially those dealing with survivors guilt or just plain out guilt around someone passing away. Not too long ago, I was in Lena’s shoes. Not the exact situation, mind you, but a situation where I truly believed that I had contributed to someone’s death. And it sucked. I wouldn’t wish it upon my worse enemy.I think that’s what resonated with me so much about this book. Every emotion that Lena was going through, I had felt. Being terrified to and feeling guilty for moving on. A smile, grin, or laugh feeling like the most foreign thing I’ve ever done. It took me weeks before I was able to laugh at something as simple as a TV show without bursting into tears immediately after. I felt like I didn’t deserve to be happy or be able to enjoy anything. That person was dead, I was alive, how dare I feel anything but sadness and grief.But like Lena, once I faced my guilt and I was able to grieve, life got easier. Along with some help from my husband, family and watching my favorite game being played on Game Grumps, it finally got a little easier. Honestly, never underestimate the power of two guys just being silly.I’m floored with how well Jennifer described moving on:Living when others died wasn’t something you just woke up one day and got over, even though sometimes it felt that way. Even when I realized I’d gone an entire day, or maybe two, without thinking about *them*. And sometimes I still felt guilty about that.* I took out the names to avoid fully spoiling the book.It’s so unbelievably true, though. You don’t immediately forget that person, and you’re not randomly done grieving one day. Eventually you’ll realize that instead of crying once every hour, it was once every few hours. Or a song got easier to listen to, or a place got easier to go to. It’s a slow, grueling process, and I think Jennifer described it well.Leaving the heavy stuff alone, this book was absolutely amazing. I love how Jennifer captured all the different friendship dynamics that goes along with groups of friends. Each separate person in the group honestly felt like a real person. Even the parent/child relationship was so well rounded that it was perfect. The parents weren’t just someone to die at some point to further a story line.The romance between Sebastian and Lena was so adorable, I really loved how he treated her. Jennifer always comes up with the best book boyfriends. Their friendship was so believable and I think that’s one thing that the author truly excels in.Also, I will never get enough of bookworm main characters. Give me all of them.On risk of completely spoiling this, I’m going to cut the review off short. Point blank, I think this is an amazing book that dealt with really hard subjects, really well. Sometimes it feels like an author is just using it for shock value and this book didn’t have that feeling.Please, read this. You won’t regret it."}, {"userName": "katherine", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/43359632-katherine", "userReview": "As soon as I saw this book to request on Netgalley I was drawn straight away to the cover, I mean come on – look how beautiful it is?!?! I have read Armentrout’s other contemporary and I enjoyed it, this one I did like but overall for me it was just an okay book.For me, I didn’t find any of the characters very memorable, I can probably remember a handful of their names and there were quite a lot of characters. I like that this book touches on some really important topics such as survivors guilt and the loss of friends, and it was done well.The romance wasn’t for me in this, I didn’t feel it was really necessary throughout the whole of the book, maybe at the end when Lena had finally accepted what had happened but I didn’t feel like it was needed that much, Sebastian was nice and all of course.I thought there was an interesting message that came across from reading this book about not falling into peer pressure, but overall for me this book wasn’t my favourite read of this year.The writing was good but I don’t think I’ve read a book by Armentrout that I’ve not liked the writing, I thought the general concept of the story was good and overall it was an okay book! 😊➡️ thank you to HQ young adult and Netgalley for the arc.♕For more reviews, recommendations and bookish chats head over to my blog ♕"}, {"userName": "Warda", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "This book didn't hit me as hard as I would've liked. Despite the fact that it speaks about grief and survivors guilt, I just wasn't convinced by the overall story or the romance. And speaking of romance, I loved Sebastian! Good guys with their pure souls make me melt.I still enjoyed it. I wish the story had more meat to it though."}, {"userName": "Suzanne", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "4.5* This is a heartbreaking book about a very real situation that occurs too often. It was devastating and beautiful to read. I haven’t read many J.L. Armentrout books but the ones I have read, I have LOVED! She is a wonderful writer and tells gripping stories. I plan to checkout some of her other books very soon!Overall, this book is emotional and difficult to put down. A devastating situation with so many consequences for all involved. Hits you hard so hold your heart and read!"}, {"userName": "Jasmine", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/21803154-jasmine", "userReview": "Thank God it's better and more readable than The Problem with Forever. Although the writing style is the typical JLA, there's no denying that I still love those cheesy scenes. ;)"}, {"userName": "Amy", "userReviewDate": "Oct 02, 2017", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "This was my first experience reading an Arementrout book and everything I’ve heard about her books is true, she will crush your heart in the best possible way, similar to Colleen Hoover. Her writing is raw, highly emotional and so relevant and important. This will be put in my small stack of books to have my kids read when they get older, it’s a must. Books about vulnerable teens always get me right in the feels and this was no exception. It’s told solely from Lena’s perspective and broken into yesterday, today and tomorrow. It’s not told over the course of just three days in her life but rather the time before a major event, during and the time afterwards. I just loved Lena, she’s a bookworm who would rather spend a Saturday night tucked in with a Sarah J. Maas book than out at a party with friends, but she’s not a total loner. She has a tight knit group of friends and a best friend, Sebastian who was quite possibly the sweetest, most endearing kid I’ve read about in a long time. After a devastating tragedy, her and her friends are shaken to their very core and she must find a way to look forward to tomorrow. There was such an authenticity to this book, both in the scarily believable plot and the behavior of these teens. The dialogue was dead on, these kids were genuine and wholly realistic, I feel like if I had been eavesdropping on a group of teenaged friends their mannerisms and conversations would’ve been exactly like the ones portrayed in this book. I do want to mention that it gets off to a pretty slow start, but if you hang in there after the first third it gets better. Once it picks up the pace it’s full steam ahead and turns into something beautiful and powerful that took me on quite the journey. Much of it was absolutely gut wrenching but extremely poignant and touching, again every teen should read this the lessons inside are unforgettable and vitally important. All of my reviews can be found on www.novelgossip.com"}, {"userName": "AJ", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/3143126-aj", "userReview": "4.5 stars!An unexpectedly emotional standalone from JLA, but so profound and beautifully written – along with the humor, wit, sweetness and romance that I have come to expect from one of my favourite authors. This is one girl’s journey through heartache, despair, guilt and grief and is a story that I am sure will touch a lot of hearts.17-year-old Lena is about to begin her senior year of high school. Apart from her key goal of enjoying her final year and scoring a volleyball scholarship, she’s also dealing with the fact that she’s in love with her neighbour and best friend, Sebastian, and has been for years. Luckily her fantastic group of girlfriends have her back in all things. It’s gearing up to be a great year for her… until everything changes.\nHow does one just get over that? How does that pain ever lessen, even over the years? …How do you move on?\nAll at once, Lena’s life is completely derailed. Everything that she thought she wanted seems completely out of her reach now, and the lives of her and her friends and family will never be the same again, and she has no idea how to move forward. \nOne night had irrevocably changed all of our lives. One choice had altered the course of what we were all supposed to become.\nI don’t want to give the story away, because this is a read that you just need to dive in and experience, but be aware that this is a really emotional read. I thought I was prepared for the feels, but the nature of the story and its emotional impact took be completely by surprise. The subject matter is intense, and its impact is profound, and my heart ached for Lena and all that she went through. It’s the kind of book that makes you think about your past and the choices you made, and it’s the kind of book that I think a lot of teenagers would benefit from reading. Lena’s situation is heartbreaking but it’s completely relatable, and I think that is what makes this such a meaningful story as we watch her battle to reclaim her life and be ok again.\nJust because you wanted something so badly to be okay didn’t mean it would be that way.\nBut there is more to Lena’s journey than heartbreaking intensity and emotion. There’s also a beautiful childhood-friends-to-lovers romance as Sebastian is by her side pushing her forward, and the two of them get to explore the emotion that has been building between them for years. And damn, but that boy turned me into an epic cougar because he is absolutely perfect! Fun, sweet and completely swoony, I just loved him.\n“What does waiting do? None of us are promised a tomorrow ... We don’t always get a later.” He kissed my temple again, then pulled back, his eyes finding mine. “I’m done living like we do.”“I love you … I’ve been in love with you for as long as I remember.”\nI loved this book. Yes, it was heartbreaking, but there were moments of humour, sweetness and fun and all of the different facets of the story were blended together perfectly. And as always with JLA, her character dynamics were spot on. I laughed along with the hilarious banter, and fell in love with Lena, Sebastian, and their friends. I was fully immersed in Lena’s journey from start to finish, and thought that JLA handled an emotional topic in a respectful, relatable and sensitive way, in a story that was ultimately uplifting. It was really wonderfully done.\nI knew I couldn’t go back and start a new beginning. I couldn’t rewrite the middle. All I could do was change tomorrow, as long as I had one.\nBeautiful - 4.5 stars.An Advanced Review Copy was generously provided by the author in exchange for an honest review."}, {"userName": "Tracey (Life and Literature)", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/4748843-tracey-life-and-literature", "userReview": "3.5 stars for If There's No TomorrowTurn on the news any night of the week and it's possible you'll see a story dealing with the events of If There's No Tomorrow. It's such a relevant subject matter, but being as the synopsis for the book doesn't really allude to what that is I'm not really going to delve too closely into that. You're much better off going in not knowing. Life can change in an instant. One day you're making plans for your future. You have dreams and hopes and plans. And then, in the blink of an eye everything can change. That future you were planning doesn’t seem so achievable or important. I really liked Lena from the get-go. I found her so relatable and down to earth. She wasn't perfect. She made bad choices and decisions. But I enjoy flawed characters so much because they're real. It’s so much easier to become invested if you’re able to relate to characters and their situations, and that was the case with Lena. Her love of books was an instant win for me. JLA does that often in her books and for me, she can’t go wrong with that. Sebastian is Lena’s neighbour, friend, and the boy she’s been in love with for years. He was so easy to love! He was sweet, and protective, and caring. I loved the friendship that he had with Lena. It wasn’t always’s smooth sailing, but when things were good between them there was such an ease to their friendship. I have to say that I thought that there were times when one person or another was a little hard on Lena. She showed a real strength in dealing with everything, and I really admired that about her. Don’t go into this one expecting a fast paced story. That’s not what this is. If There's No Tomorrow is friendships, it's falling in love, it's dealing with the choices you make, it's growing up. Whether you're a long time fan of JLA or new to her awesome writing, pick this one up for a read and let me know what you think.Thanks so much to Harlequin Australia for the free eBook for review."}, {"userName": "Nancy The book junkie", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/5102896-nancy-the-book-junkie", "userReview": "Rating: 4.75/5Review to come!"}, {"userName": "Lara (Bookish_turtle)", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/64318901-lara-bookish-turtle", "userReview": "I just don't know how I feel about this book? It was nice, but not as impactful as I thought it should have been, and none of the characters were that memorable. Except Sebastian. He was a lovable idiot and very cute. Still an idiot though.I just didn't feel like it was super convincing? It talks a lot about grief and shows it in Lena's character, but it just felt like a textbook response, and not really real. It seemed like it was written from a textbook about grief rather than a real person trying to deal with such a serious trauma.I was not a fan of Lena. It is really a pet peeve of mine when a character claims to be a nerd or a geek, but they're really not. Lena is established as a nerd, but in the parts of her that we get to read about in this novel, she watches a few documentaries and reads a few books, but is certainly not a nerd by any stretch of the imagination. This was not that big of a deal, but also it bugs me SO MUCH! WHYYYYYYYYYY?!Also, another small detail which I am going to be super picky about, it talks about her family being not super well off, buying only off brand pop tarts and needing a scholarship for college etc., but it also describes her as having huge bookshelves, overflowing with books, and also having books stacked all around her room because they won't fit. BOOKS ARE SO EXPENSIVE! I'm not saying she couldn't afford them, but really. It was describing her hardcover of ACOMAF. Hardcover! And it wasn't a special case, it was the first time she was reading the book! I was really annoyed about this! (Secretly just really jealous of her bookshelves but ssshhhhhh..... Me? Petty? Never...)The plot was okay. Only like three things happened in the whole book, but it wasn't super long so I wasn't bored. Anyway. It wasn't my favourite, but some parts were cute and I did kinda enjoy it..."}, {"userName": "Kaila", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/35924884-kaila", "userReview": "3.5/5 stars\n“You do deserve happiness and a future and everything you’ve ever wanted. That one night is not going to define your whole life.” \nThe question of the day is: Will I ever not enjoy a Jennifer L. Armentrout book? So far, the answer is 100% no. I have thoroughly enjoyed all of her novels to date, and this was no exception. I was worried that I wasn't going to like this book after the first couple of hatters, but it only got better from there. This was a surprising thought-provoking novel with themes that were a lot darker than I was expecting. There's love, forgiveness, healing, grief and acceptance...pretty heavy stuff for a young adult novel. Nevertheless, it was well executed and had an adorable romance on the side to the lighten the mood. I definitely recommend this book.\n“I knew I couldn’t go back and start a new beginning. I couldn’t rewrite the middle. All I could do was change tomorrow, as long as I had one.” \nLena is living a normal teenage life, and the future is looking hopeful and exciting for her. She has a group of best friends, a doting mother, a spot on the volleyball team and a boy that she is crushing after. Her opportunities seem endless, and her life seems to be going how she had intended. Well, this is a thought that every tn person has, because the future is always unknown. So Lena would never have guessed the tragedy and life changing events that were only days ahead. She especially didn't see her life come to an extreme holt, like it has. No longer is Lena looking forward to uni with, or perhaps confessing her love to her he's friend Sebastian. Instead, she is stuck thinking about one massive mistake and it changed her life, and so many lives around her.Lena has to learn to overcome and live with the guilt that seemed to be building and festering inside her. She has a choice now, stay stuck in the past regretting one decision or make a move to look past her mistakes. But this is so hard when even the people around her seem to be giving up. Her friends are no longer the same, her relationship with Sebastian has changed her old family problems seem to be arising once again. But people can live through tragedies, and so Lena tried her hardest to overcome her regret and guilt, and instead, look forward to tomorrow even with all of its uncertainties. \n“I should’ve listened to that little voice in my head and that feeling in the pit of my stomach, but I hadn’t. If I had, today would’ve been different. Tomorrow would be like all the better yesterdays.” \nI'm going to be honest and say I was really not enjoying this book at the beginning. It had a lot of high school tropes which I'm not a fan of. I was also worried that it would be too cliche or stereotypical, which is why I'm happy to say it wasn't. After 'the event' occurred, this book to a new direction that really surprised me. It immediately diverted from the path of an average high school novel. It gained this sense of authenticity, profoundness and depth. The tropes that I mentioned before never disappeared, but they didn't bother me as much when the book had more substance to it. I was really surprised with how this book ended up progressing, but in a good way. I left the book feeling happy and satisfied with the story as a whole. I have never read a book that has dealt with this sort of subject matter. Usually books focus on protagonists and antagonist in situations, but they don't address the bystanders or the people who don't prevent events from happening. I'm not going to specifically say what happened, because that's a spoiler, but the exploration of guilt and regret can be linked to many other situations. This book had a lot more depth and authenticity than I would normally expect from a young adult novel. The plot was very emotionally driven, and focused on acceptance, self improvement and resilience. After the turning point in the novel, I was fully captivated by the emotional growth that Lena went through. I also really appreciated the incorporation of therapists and family members in Lena's journey to overcome trauma. This book portrayed quite a healthy way of dealing with problems.I had an up and down relationship with the relationships in the novel. I really loved the friendship, and wish that was explored in more depth, though the moments where it was portrayed were my favourite. I also liked the romance for the most part, but also think it diverted from the subject matter. It gave the story a kind of superficial feel as the plot became more focused on the relationship than Lena's growth. Despite this, I couldn't stop myself from gushing at the many cute moments that were in this book. I had a different feeling towards the family in this novel, it all kind of felt off to me. I just didn't like the scenes with the mother and sister for some bizarre reason, and I'm still not quite sure why. I will admit that it improved as the book went on, so I can look past it.\n“What does waiting do? None of us are promised a tomorrow ... We don’t always get a later.” He kissed my temple again, then pulled back, his eyes finding mine. “I’m done living like we do.”"}, {"userName": "Joanna", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/3288439-joanna", "userReview": "What a roller coaster ride of emotions. This book made me feel a little crazy that I just have to stop when it got too much. ha ha. YA books always make me feel like this. Too many emotions for teens.One minute I was like...then the next...\nMajor thought: LENA WISE was a one tough girl.\nThoughts:\n1. One big mistake can change everything.\nDo we ever really know when we're about to make a big mistake? Sometimes, we know or we are conscious about it but there are times that we simply don't expect it. All we have to do is to always think before we act. Sometimes accidents happen and we simply can't control the situation.\n2. Living for yourself is not entirely selfish.\nDon't ever try to stop living because you feel like you have to punish yourself for impacting a disastrous incident on other people. Especially, if it's not your fault entirely. Yes, being partially responsible makes you feel guilty but in the end, you can never choose to erase that event that played out. You can never go back and have a redo. All you can do is try to survive and work your head on straight and learn from that incident. It's not selfish at all. \n3. What does waiting do? None of us are promised a tomorrow. We don't always get a later.\nThis quote really did a number on me. It made me feel like reaching up and getting all the things that I want now, because you'll never know what tomorrow could bring.....Waiting doesn't do anything but just feel that existence of every living moment that I have. Like I was just here... breathing and thinking and just doing mundane stuff. ACT NOW. ACT NOW ACT NOOOW. lol.\n4. I knew I couldn't go back and start a new beginning. I couldn't rewrite the middle. All I could do was change tomorrow, as long as I had one.\nThe feeling of regret will always come when we feel like we have done something wrong, or when the effect did not go to the way that we though it would. This quote made me think that every tomorrow that we get is a chance for us to do something worth it. To do something valuable to our lives, like accomplishing simple and off-the chart stuff that we want to do. Like, do not waste all your time doing something that you don't want but always do something you know that is right. Of course, to someone like me, I always overthink that's why I don't usually get anything done. haha. But, this quote makes me want to really try. And I will, with the perfect time....\n5. THIS STORY! \nIt's YA, it has romance, it has friendship, it has family, and it has drama. I LOVED IT! THE ROMANCE WAS JUST WORTH IT. I LOVE IT. The bestfriends things. the balcony, the nightly chats, the tent....Sebastian was just so dreamy. hahah! I know it's not just a simple life of a teen dealing with bad decisions, it's about making others relate to the realities of life. This could happen to anyone and I love how it could make an impact on others decisions and actions. Making others more aware of the consequences that their actions could bring. \nThank you Ms Jennifer Armentrout for writing such wonderful, eye opening, forgiving and enlightening book!!!"}, {"userName": "melissasbookworld", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/34871171-melissasbookworld", "userReview": "Wow! This book..... took my breath away. so tragic,heart breaking and beautifully written. I'm still chock full with emotions right now after just finishing the book.. it was a really emotional rollercoaster ride, reading this book and I mean that in the beat way possible. this book touched my heart, and will leave me thinking about it for a long time to come..FULL REVIEW ON MY BLOG:http://melissasbookworld.com/2017/10/..."}, {"userName": "Tom Lewis", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/41086818-tom-lewis", "userReview": "This is one of those YA novels that’s so aggravating at times, but if you can plow through the frustration of the main character escalating her problems by refusing to be honest with her friends, there’s a really beautiful story here about dealing with grief."}, {"userName": "Francesca", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/3098810-francesca", "userReview": "I thought it would be a chatty & annoying high school book in the first part, but Jen surprised me and I was moved by the heroine's journey.As usual, the hero is a sweetheart.Pour ce nouveau roman YA de Jennifer L Armentrout, l’auteur se consacre à un thème sérieux et grave. J’ai eu un peu peur au début quand l’histoire débute par une intrigue digne des cours de lycée, avec ragots, garçons et compagnie. Mais Jen a su me surprendre et m’émouvoir avec un twist que je n’avais pas vu venir.Désespérément amoureuse de son voisin et meilleure ami de toujours Sebastian, Lena entame sa terminale. Ce qui devait être sa dernière année avec ses amis et son ultime tentative d’avoir son happy end se retrouve complètement bousculé par un drame qui remet toute son existence en cause. La culpabilité, le chagrin, les sentiments négatifs la bouffent et impactent sa vie et ses proches. L’évolution de son personnage tout au long du roman est traitée de belle manière par Jen, ce qui en fait le sujet principal, plus que la romance.Mais Jen étant Jen, l’amour n’est pas mis de côté, et nous avons une histoire, dans le genre YA, qui est tendre et pudique, pas de scènes hot ou de langage cru, mais ça donne tout autant de papillons dans le ventre. Sebastian est comme d’habitude avec Jen un book boyfriend parfait, mignon, prévenant.J’ai apprécié les références à d’autres auteurs et sagas qui sont disséminées dans le récit. Darynda Jones et Sarah J Maas étant parmi mes auteurs préférés, je n’ai pu qu’aimer les clins d’œil."}, {"userName": "Cheryl La Pa", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/20985154-cheryl-la-pa", "userReview": "Loved it! Hard hitting, emotional & unforgettable! I tried so hard not to cry, but failed miserably.RTC..."}, {"userName": "‘Jennifer | Wortgetreu", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/31890936-jennifer-wortgetreu", "userReview": "Ich mochte den Beginn und die Mitte des Buches total! Ich mochte die Charaktere, war ein wenig verliebt in Sebastian und habe einfach bei dieser süßen Geschichte mitgefiebert. Die letzten 100 Seiten jedoch fand ich dann leider nicht mehr so stark, weshalb ich einen Stern abziehen muss. Ich fand das Ende sehr langweilig und zu unemotional."}, {"userName": "Sophie Elaina", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/54237690-sophie-elaina", "userReview": "This book is now one of my favourite contemporaries ever, which is really saying something after all the great books I've read recently. Even though some themes and plot points have been explored in the past by many different authors in loads of different ways I still feel like this was unique. The author took a concept that sadly happens way too often in the real world and was able to truly explore why such things do happen. I'm trying to be vague because I don't want give away plot points, but this story is strikingly realistic, and heartbreaking.The protagonist is Lena; a seemingly ordinary teen living the typical high school life. A girl with friends and family problems, and an actual shot at real love. Gradually she begins to feel out of her depth, but things soon take a turn that makes those problems seem extraordinarily small in comparison. We follow her journey of grief, love, heartbreak, guilt and finding out what truly matters to her.  “Sometimes I just wanted to…I don’t know, escape life. To delve headfirst into a world that dealt with real-life issues to open my eyes, or a world that was something else, something completely unreal. One with warring fae or roaming vampire clans. I wanted to experience new things and always, always, read the last page feeling satisfied. Because sometimes happily-ever-after existed only in the books I read.”The characters seemed so real that in fact it was easy to get lost in the story and really make you think 'what if?'. The author was able to show grief in a way that I had never read before, in such a brutally honest way. The writing was beautiful and flowed easily making this a really fast read. So fast in fact that I wanted to keep stopping because I didn't want the book to end. I do warn that their is a slight case of the friends to lovers trope, however I'd like to defend it by saying I liked it because it wasn't the one friend pining and the other not realising until the other had moved on. “I knew I couldn’t go back and start a new beginning. I couldn’t rewrite the middle. All I could do was change tomorrow, as long as I had one.”The author was really able to make the characters rememberable, and yet have them be relatable. I don't know how she did it, it was like magic. I honestly can't praise her enough for what she has created. From previously reading 'The Problem With Forever' I definitely had high expectations as I really loved that too, but this was even better. I absolutely adored it. I also very much enjoyed the fact that Lena loved reading and the quirky references to some of my favourite books of all time. That first reference to 'A Court of Thorns and Roses' was like a revelation. “I’m not leaving. You can get mad. You can get upset, but I’m staying right here, because whether you realise it or not, you shouldn’t be alone.'In addition to everything else I've already mentioned, the descriptions were well placed and didn't feel forced at all, and I found that I could easily fall back into the story after putting it down for a while. The first person narrative was excellently done and as apposed to many other contemporaries that I have read in first person the author was able to keep the main character still slightly mysterious and also ensure that it was presented in a sophisticated way. I often feel that first person can get cheesy if not done right, especially within the contemporary genre, but that was most certainly avoided in this case. I could really tell the more I read that so much went into the creation of making this book work out the way it did. It was truly great!I think that these characters will really stay with me for a long time. RATING: 5 Stars!Thank you to HQ Young Adult, Jennifer L. Armentrout and Netgalley providing an arc to read and review.For more, check out my blog/website: https://www.sophieelaina.com"}, {"userName": "TheBibliotheque", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/36566317-thebibliotheque", "userReview": "“I knew I couldn’t go back and start a new beginning. I couldn’t rewrite the middle. All I could do was change tomorrow, as long as I had one.”This is a raw and bittersweet YA contemporary that I think every young adult should read. Scratch that, must read.Yes, it has all the delicious elements any other JLA book has: love, cheese, friendship, a perfectly sweet love interest and a flawed main character that goes through, let's just say, a lot. But even if you are not that big of a fan of the cheese or the romance, I suggest you pick this one up anyway. Because it delves in a very important topic, one that every young adult should be aware of, should talk about and should think about twice.This time around, Armentrout went beyond the sweep me off my feet romance, and delivered a raw and important message. But do not fear, you know she is gentle - after smashing your emotions in a hundred pieces, she does wrap you up in a warm and fuzzy HEA.Rating: 4.5/5"}, {"userName": "Casey", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/43797056-casey", "userReview": "This book was unfortunately a miss for me. The main character wasn't very interesting and while the story is about grief and some really important topics like survivors guilt and dealing with the loss of your friends it felt random at times and like I was supposed to be sad rather then making me feel something.The only thing that made me emotional was reliving how I dealt with grief and my personal memories, I don't think that deserves extra stars for making me *feel* something. The message in this book is good I guess, don't fall into peer pressure, don't make mistakes that could lead to you and your friends dying but if I'm being honest I felt like this was a tad preachy in the \"we've all made Bad decisions, look what will happen if you make a bad decision too, you don't want to end up like this main character do you...\" And that message is just not really for me. \n slight spoilers in this paragraph\nSure I don't want anyone driving drunk but I think we're all prepared and know not to get in the car, it doesn't stop people from doing it and I don't really think this book will either when push comes to shove. People won't be like  oh remember that book where that girl got in a car with a drunk driver and ruined her life  not happening. \nSlight spoilers over\nThe main character also mentioned Sarah j Maas and newer books and that just felt weird, I do like pop culture references but is Sarah J Maas really pop culture? I know she's very popular but surely she's not at JK or Stephenie Meyer levels? What happens when someone picks this up who doesn't know who the hell Maas is and just does not relate. Anyhow overall this book is written to make you really sad and put the message in your head to not cave to peer pressure and it was just not for me.  Thank you netgalley and the publishers for allowing me a free copy in exchange for an honest review."}, {"userName": "Amber Robertson", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "DNF @30%I received an eARC from the publishers via NetGalleyIf There's No Tomorrow is a hard pass for me. Not only was the writing quite cringe worthy, but it was trying so hard. I don't hide the fact I'm a fan of JLA's writing, I love a lot of her books. This, was not her best work in my opinion. From the first chapter we reference A Court of Thorns and Roses by Sarah J Maas and Paper Princess by Erin Watt, one series that I love and the other I would like to burn in a volcano. These references are reinforced by the fact our main character lives to read. She seriously loves it. It's basically her entire personality. Ultimately, it felt it was trying way too hard. On top of this, the \"not like other girls\" trope was so present. From the popular girls at school to the books she reads she is so different. Her big secret is also that she loves her best friend. Something I can't deal with currently. This isn't the book for me, but if you're looking for a trope and stereotype ridden book this is perfect for you. I may try this again when I'm looking for a silly contemporary."}], "description": "A single choice can change everything.Lena Wise is always looking forward to tomorrow, especially at the start of her senior year. She’s ready to pack in as much friend time as possible, to finish college applications, and to maybe let her childhood best friend Sebastian know how she really feels about him. For Lena, the upcoming year is going to be epic—one of opportunities and chances.Until one choice, one moment, destroys everything.Now Lena isn’t looking forward to tomorrow. Not when friend time may never be the same. Not when college applications feel all but impossible. Not when Sebastian might never forgive her for what happened.For what she let happen.With the guilt growing each day, Lena knows that her only hope is to move on. But how can she move on when she and her friends’ entire existences have been redefined? How can she move on when tomorrow isn’t even guaranteed?", "title": "If There's No Tomorrow", "url": "http://www.goodreads.com/book/show/34225450-if-there-s-no-tomorrow", "average": 4.04, "cover": "https://images.gr-assets.com/books/1492387574l/34225450.jpg", "reviews": 1040, "authors": [{"url": "https://www.goodreads.com/author/show/4476934.Jennifer_L_Armentrout", "name": "Jennifer L. Armentrout"}], "type": ["Young Adult", "Contemporary", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/34225450-if-there-s-no-tomorrow", "http://www.goodreads.com/book/show/33998316-if-there-s-no-tomorrow", "http://www.goodreads.com/book/show/38092978-und-wenn-es-kein-morgen-gibt", "http://www.goodreads.com/book/show/35285687-if-there-s-no-tomorrow", "http://www.goodreads.com/book/show/12578077-obsidian", "http://www.goodreads.com/book/show/13047090-onyx", "http://www.goodreads.com/book/show/13362536-opal", "http://www.goodreads.com/book/show/13644052-origin", "http://www.goodreads.com/book/show/9680718-half-blood"]}