{"ratings": 1762, "userreviews": [{"userName": "Nancy", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/763271-nancy", "userReview": "Posted at Shelf Inflicted I remember coming across this book on Thomas' shelf and briefly thought about picking it up at the library. The title, cover, and Thomas’ lukewarm review made me decide to give it a pass. Now that I’ve discovered OverDrive and am in the mood for zombie stories, I decided to give this book a chance and borrowed the e-version. Though I still had my doubts after looking at the cheesy cover, I pressed on. I finished the story in one day and was surprised by how funny, sweet and smart it was. Alley, along with the group at her lunch table, is on the staff of the school paper. She is living in the “post-human” era, in a world where vampires, werewolves, and zombies live amongst humans. Like other oppressed minorities, their struggle for basic rights and acceptance is a constant uphill battle. In this world, dating the undead is cool, but Alley stubbornly clings to her independence and harshly ridicules the idiotic behavior of her classmates. \n“Sadie is my oldest friend. She kind of falls for the whole vampire thing, but at least she’s realistic. She likes dead guys, just like every other girl in school, but Marie loves them. She isn’t even interested in dating living guys. She’s like, necrosexual.”\nWhen Alley is asked to review a local band’s performance, she’s intrigued by Doug, a part-time member of the band, whom she later learns is a zombie.Alley learns that liking the same musicians is not enough to sustain a relationship. She must deal with resistance from school officials and other “post-humans”, and her own changing views about life and love.At times, Alley’s voice seems a little too mature for her age, at other times she is as fickle as teenagers are, but I have to admire her independence and strength of character. There are a lot of strong messages in this story about acceptance, relationships, and maintaining one’s identity. I’m surprised I enjoyed this as much as I did."}, {"userName": "Vinaya", "userReviewDate": "Apr 17, 2011", "userURL": "http://www.goodreads.com/user/show/4687823-vinaya", "userReview": "Okay, to be honest, I might never have picked up this book, if Adam Selzer had not been such a huge supporter of The Book Lantern. And what a mistake that would have been!Reading reviews for this book, I am shocked by the number of people who simply don't get what this book is about — a trend I have found disturbingly common in YA satire. Spoofs? No problem, every one knows when to laugh, and at what, so they're still considered witty and amusing. Satire? Not so much. Similarly to Bumped, I'm frustrated when people critique the story without understanding that it is, for the large part, tongue-in-cheek. THIS IS A SATIRE, people!!!Okay, so there's this girl who's smart, witty and funny but then she meets this paranormal creature and falls madly in love in the space of a few days and loses her sense of humor, her coolness and even decides to give up her future plans and her mortality to stay with him 4eva and eva, the end. Or not quite...Sounds familiar? Yeah? That is because this is a smart, funny, cleverly-done satire on Every Paranormal Romance Today. However, unlike Bella who's not very interesting, and Nora, who's not very smart, Alley (short for Algonquin) Rhodes is actually witty and smart and interesting; until she meets the love of her life, who she slowly discovers is a paranormal creature- a zombie, in fact. But despite the smell of embalming fluid and the greyish tone of his skin, and his inability to perform several acts of a sexual nature, Alley still finds him kind of hot. And then they start dating seriously, and a vampire (who's in love with Alley because of her rare blood type — get it, get it?) gets into the picture, and Alley tries to rearrange her life around her boyfriend, even going so far as to consider \"conversion\" into a zombie; but since she's actually smart, she ends up doubting her decision to die and give up her mortality forever and ever *cough Bella Swan cough*This is a fast, fun, zippy read of only a 114 pages or so. It's a little sad, a lot gross (in parts) and sometimes moving and in the end, very empowering. I'd totally recommend it to people who want to have a little laugh over the YA pnr genre today, and do it with a heroine who's funny and intelligent, as well as really knowledgeable about music! Fun times!"}, {"userName": "Katie M. ", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/2568537-katie-m", "userReview": "WARNING: You are about to read my severe rant about one character. If you want to skip that and read all the OTHER reasons I hate the book, feel free to skip it. :] It took me roughly five minutes to realize that I hate Alley Rhodes.  She begins the book as a witty individual, filled to the brim with awesome jokes and coolness and common sense that made me like her, but as the book progressed into chapter two, she quickly became a doey eyed fool for Doug, the \"goth\" who sang for the worlds crappiest band. The kid who never changes his clothes, smells like dead stuff, and is so painfully obviously a zombie that it almost physically pained me to read her ignorance.  1. She begins the book by briefly explaining WHY there are Vampires in her school. This has a lot to do with Zombies, and place called Megamart, where they were slaves.  2. They later stop at Megamart to pick up Doug's \"medicine\" which he gets for free due to a legal settlement, at which point the main character goes into a whole story about the Zombies and Megamart, and yet she still doesn't connect the freaking dots! Even when her classmates are calling him a zombie. Gah! If this weren't bad enough, she's already sending the poor boy \"Thinking of you\" texts after one date, and picking out her prom dress before they even hit date number 2. I might actually feel bad for Doug and any of the characters associated with her, if they actually had, well, character of any kind.  It amazed me that her and all her friends trash the vamps and the goth wannabes, and yet they all dress like goths themselves. Not only this, but Alley has spent her entire teenaged like treating every boy in town like poop on a shoe because she doesn't want to get stuck in Des Moines, but is willing to skip her big Seattle dreams for Doug, the kid she's known for about a week and two dates. She even seriously considers becoming a zombie herself, something which she would have laughed in the face of any Vampire loving girl for.  ----> rant over <--- My little tangent being through with, I'll say that aside from my pure hatred or the main character, though this book still sucked, it was a good concept, and could have been done really well, but I found that the author wrote more like this was his first book, or as if this were his first book for teens, and he usually writes for the kiddies.  I felt like They mentioned the Mega-Mart Scandall, but it didn't really play into the plot much, same as the mention of both ghosts and Werewolves. I think the author tried to shove way too much into such a short book, which is funny since the plot was pretty thin.  It reminded my of a fanfiction, in the way that the characters were often going places, but nothing of event was really happening \"We went on a date and (paragraph of nothing interesting) We went on another date (repeat) then we went to a party (and repeat once again).  Generation Dead did it better."}, {"userName": "Lisarenee", "userReviewDate": "Dec 13, 2010", "userURL": "http://www.goodreads.com/user/show/2038272-lisarenee", "userReview": "Okay, I read this book because of our discussion on whether or not authors could cross a line when redefining a supernatural creature. A zombie/human relationship is the one we felt would cross that line with the Eew factor. So in the name of research I read this book. :)The Good - I liked the message at the end which was don't take life for granted. Don't throw it away and enjoy it for the incredible gift it is. Plus, there was quite a bit of humor added in and this was not meant to be a serious romance.First Kiss - before she knows he's a zombie. she thinks he's sick:\"There're a lot of things I can't do,\" he says. \"With my health.\" (side note from me, Lisarenee - Thank Goodness!lol)Well,\" I say, \"can you kiss girls?\"He nods, and I lean over and give him our first kiss. Whatever it is that he has makes his mouth cold and dry, and I can taste the medicine on him, but he leans into the kiss.\" If you really like someone, it doesn't matter what their mouth feels or tastes like. The kiss is still awesome. Page 42The Bad: The first kiss had an Eew factor of 7 out of 10 on the Eew scale, but the fact she made out with the zombie (although not in great detail - thank goodness) brought it up to a 9 out of 10 on the Eew scale. Then there was the last scene which brought the Eew scale to 10, but I'm not going to spoil it for you with details. lolThe ugly - Zombies! Duh! Thankfully, I do not see a bunch of Zombie/Human romances in the near future. I say don't do it authors. It's just too gross! So with the good, the bad, & the ugly out of the way I give this book a 3 stars. It had me alternating between chuckles and Eews and had a nice message at the end."}, {"userName": "Gertie", "userReviewDate": "Jan 27, 2015", "userURL": "http://www.goodreads.com/user/show/267182-gertie", "userReview": "I bought this as a joke. The whole zombie craze, which I will admit I was once a part of, has become ridiculous. Seriously. Some days it seems like every new author who has realized that anyone can write and publish a book thinks they can write a zombie book, so the market is saturated. Overflowing. Some really good books have actually come out of this movement, but I've been too inundated with them so have grown a little wearisome of zombie fiction. (Not that I don't still read the occasional z-book, the lure is too great!)Anyhoo, when I saw this book a couple of years ago I had to laugh because it was another sign of the zombie fervor, and also... well, EWWWW. So I got it as a joke, thinking I might give it to someone at some point.Here's the thing though — it didn't totally suck."}, {"userName": "Thomas", "userReviewDate": "Apr 08, 2010", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "I Kissed a Zombie, and I Liked it is about strangely named Algonquin \"Alley\" Rhodes, who so happens to have kissed a zombie - and liked it. She can't help but fall for Doug, the uncolored, unchanging, undead zombie of a hunk who might just be able to thaw her out from her ice queen identity. Of course, the structured society of her school doesn't exactly agree with their relationship - so they'll have to fight to keep it alive.To put it blatantly, this book was nothing but a parody. There was no real plot, no interestingly developed world, not even a smudge of character development, even. This novel is one to take at face value: it would interest someone if they're looking for a book about an unsympathetic heroine who falls in love with a hopeless zombie. It is guaranteed to disappoint anyone else. Finally, the cover is atrocious."}, {"userName": "Rebecca McNutt", "userReviewDate": "Jun 02, 2015", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "...OH MY  GOD .What a horrible book! I know you shouldn't judge a book by its title, but I think that this would be a worthy exception. The shallow and lifeless characters got on my nerves so much (and I don't just mean the zombie guy, I mean both of them, they were as generic and melodramatic as a high-school girl's diary), and Selzer's attempt at humor is just pathetic. The plot was nothing if not predictable, and the writing was choppy and dull."}, {"userName": "Robert Beveridge", "userReviewDate": "Jun 23, 2010", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Adam Selzer, I Kissed a Zombie, and I Liked It (Delacorte, 2010)Man, this book had two and a half strikes against it before I even picked it up. It's obviously titled to capitalize on the success of Katy Perry's song “I Kissed a Girl” as well as the current undead-teen-novel craze (which brings up the question in my head of whether Katy Perry is actually alive, but we won't go there right now). But it hit my TBR list nonetheless, and on the same day, my wife picked it up at random at the library for the kid to read. Providence, right? So I got stuck waiting around for something and it was the only handy book in the car, and it looked short, so I picked it up and started reading. And there I was laughing out loud, something I rarely do when reading, by the end of page one. A couple of hours later, I'd finished the silly thing, and what do you know? It was miles better than I expected it to be, though Selzer did tone down the comedy a good deal after the first fifty pages or so. That wasn't the best possible idea, but by then, I was hooked.Alley Rhodes is one of the snarky girls on her high school's newspaper, a clique known as the Vicious Circle. She spends her days coming up with one-liners and avoiding getting emotionally entangled with anyone. Until, that is, she gets an assignment to review an awful high school band and falls for their part-time lead singer. He seems attracted to her, too, and everything's going great until she discovers (this isn't a spoiler, given the title) that he's actually a zombie. She's got to decide what to do about interspecies dating. Worse, one of the school's hottest vampires is chasing after her. Why her, when he could have any girl in school with a glance?Yes, there's a lot of cliché to be found here, and Alley is just a little too hip-cynical (not to mention way too self-aware) for someone her age. (I have been resisting the urge to use the phrase Juno of the Living Dead. Obviously, I just failed.) And I know I should hate everything there is to hate about this book. But I couldn't help myself. I fell for its dubious charms, and I fell hard enough that I can almost literally say I couldn't put it down. (I had to, because if I try to read in a moving car I get carsick, and the family would not sit in the parking lot waiting for me for another hour). Recommended, and I'm as surprised by me saying that as you are. *** ½"}, {"userName": "Eilonwy", "userReviewDate": "Oct 11, 2013", "userURL": "http://www.goodreads.com/user/show/17237503-eilonwy", "userReview": "Alley Rhodes, high school senior and music reporter for her school newspaper, can't wait to get out of Des Moines, Iowa, insurance capital of the world. But one night a really different guy does a guest stint as lead singer for an otherwise pathetic band, and Alley is smitten -- and suddenly starts rethinking both her plans, and her opinions. She's never been a fan of the undead or the supernatural since the Megamart Zombie Scandal also opened the door to vampire and werewolf rights -- but maybe it's time to change her mind. I am pleased to say that this book was everything I could have hoped for! Alley is snarky and brittle and funny in a way that only a 17-year-old can be, and the story is a direct slap at TWILIGHT, but in a mostly light-handed, good-natured, very humorous way. It's delightfully short, and still manages to make its point perfectly (hint: it's very much pro-human and pro-living). The book is very funny, but is also insightful and even poignant in just the right amounts.My only complaint is that the title and the blurb on the back both contain a huge spoiler, since for the first half of the book, Alley is supposed to be unaware that Doug, the Leonard Cohen/Cole Porter crooning guy she falls for, is a zombie, and it would have been nice for me, as the reader, not to have already been sure about that. But other than that, the book is just about perfect at what it's trying to be. Very much recommended!"}, {"userName": "Alejandra", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/16506579-alejandra", "userReview": "In the novel “I kissed a zombie, and I liked it,” author Adam Selzer presents a story of eighteen year old Algonquin mostly known as “Alley” Rhodes. Alley is the writer of the school’s newspaper. She goes to parties and other events that are in town to judge them that’s the way every one known if they were good or not. In one of the concerts Will’s band was going to play in a club that used to be a restaurant in the past. After Will was done setting up all the instruments, Doug the guess singer starts the concert with the first two songs. Will let’s Doug play in his band even though his not part of it. They let Doug in their band because he is a great singer. A young lady named Alley was seated down in one of the tables that are close to the stage, when the concert was over, Doug walked over to Alley, they both talked for a bit than he asked Alley on a date. Alley and Doug got to know each other better and they became boyfriend and girlfriend. Alley and her best friend Sadie went shopping to the mall, they shopped for their graduation dresses. Sadie and Alley think they will be going to the school’s Ball without a date. After Doug Asked Alley out they go on a date to their favorite shake store, that’s where Doug asks Alley to go with him to the Ball. Alley starts to fall hard for Doug but she does not notice the few weird things about him the author says, “He never changes clothes, his head is a funny shape, and he says practically nothing out loud.” The night of the Ball everyone thinks that it is going to be the best night of their lives, but when the vampires and the few zombies meet in the same Ball, a fight starts when Will wants to convert Alley into a vampire even though she wants to convert into a zombie. Will think it’s better for Alley to convert into a vampire than a zombie because people see vampires more often. After the tragedy that happened to Alley with her boyfriend Doug, she cannot get over his death. I encourage you to read this book, and find out more about what happened with Alley you will like it as much as I did."}, {"userName": "Dayla", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/5039340-dayla", "userReview": "Well. This was a really weird book."}, {"userName": "Katieb (MundieMoms)", "userReviewDate": "Apr 09, 2010", "userURL": "http://www.goodreads.com/user/show/470067-katieb-mundiemoms", "userReview": "Adam delivers world in which vampires, werewolves, and zombies are accepted in everyday life. I liked the world he created. At the high school Alley goes to, the creatures of the night are walking right beside her and sit next to her in her classes and at lunch. To quickly become popular, all you have to do is date the undead. Alley is dealing with her last year of high school and can't wait to get out of town and head to college in Seattle. She writes for the school newspaper and is the smartest student at her high school. Being witty, and smart has landed her on the not so popular list, as well as the most desirable list of the brooding vampire, Will. Alley has no interest in Will or any of the other guys there until she meets Doug. There's something very different about Doug, and Alley's the only one who doesn't pick up right away that he's a zombie.I needed a little more exploration of character from Alley, as she's smartest girl in school and at first doesn't realize her boyfriend, Doug is a zombie. While Alley does deliver some great one liners herself, sometimes the delivery of her lines and what she said, at times sounded like it was coming from a guy. There were a few times I forgot I was reading it from a girls point of view. I do like her snark and some of the lines she delivers had me laughing out loud. I also had a hard time with some of the context of the book. I felt Alley's parents where a bit too liberal and had a lack of responsibility in her life. On the flip side, when Alley all the sudden decides she can ditch her dream of going to Seattle, and settling for Duke, which is closer to home and Doug, Alley's friend snaps her back into reality. She reminds her that no 18 yr old should change her college plans and rearrange her life for a boyfriend she barely knows.I liked the vampires vs zombies theme through out the book. I thought Doug's character was great. He's a teenage boy who gets a second chance at living, even if it's being a zombie. Will, the lead vampire will stop at nothing to make Alley his mate, was a believable character, who matches Alley's snark perfectly. While the zombies and vampires can co-existest, they don't have to like each other, even if they're in a band together and Doug's their main singer. Doug and WIll may tolerate each other, but don't have to like each other. In the end, they'll either work together or against each other, as someone's making new Zombies that need to be stopped.While I had a hard time getting into the main character's voice, Adam did deliver some great one liners through out the book. This quick read is one book I couldn't get into like I wanted, but one I know other people will enjoy reading it."}, {"userName": "Sarai", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/2506057-sarai", "userReview": "This book was supposed to be funny, but at times I found it to be working too hard to amuse. The heroine was kind of annoying, and not in a good way. And she is supposed to be really smart but she doesn't realize at first that the guy she likes is a zombie? There were nods to Twilight (the book) and Titanic (the movie), among others, but they almost seemed too wink-wink-nudge-nudge, ha-ha-aren't-I-amusing.Product DescriptionAlgonquin “Ali” Rhodes, the high school newspaper’s music critic, meets an intriguing singer, Doug, while reviewing a gig. He’s a weird-looking guy—goth, but he seems sincere about it, like maybe he was into it back before it was cool. She introduces herself after the set, asking if he lives in Cornersville, and he replies, in his slow, quiet murmur, “Well, I don’t really live there, exactly. . . .” When Ali and Doug start dating, Ali is falling so hard she doesn’t notice a few odd signs: he never changes clothes, his head is a funny shape, and he says practically nothing out loud. Finally Marie, the school paper’s fashion editor, points out the obvious: Doug isn’t just a really sincere goth. He’s a zombie. Horrified that her feelings could have allowed her to overlook such a flaw, Ali breaks up with Doug, but learns that zombies are awfully hard to get rid of—at the same time she learns that vampires, a group as tightly-knit as the mafia, don’t think much of music critics who make fun of vampires in reviews. . . ."}, {"userName": "Alicia Mccommon", "userReviewDate": "Jun 18, 2012", "userURL": "http://www.goodreads.com/user/show/7830333-alicia-mccommon", "userReview": "Ok I gave this two stars for a reason. Alley the main corrector is so annoying. She makes out with guys and then just dumps them, and she acts like she's sooo popular. \"Iv made out with plenty of guys. But I just make out with them, send them on their way and make fun of them later.\" \"Guys know what there getting into when they make out with Alley Rhondes, the ice queen of Vicious Circle.\" She said that I mean Really! Come on this girl is shallow! I'm pretty shoure she made that name for her self she's so full of her self. The girl thinks she poplar because she wrights mean reviews about teen music bands FOR HER SCHOOL NEWS PAPER! I couldn't connect with her at all. And her friends are forgettable along with her parents. Her parents are just wered. And Dug was just plain boring. All in all I'm going to go to bed and forget the whole thing by 2maro until I have to return the book back to the library in which case all I'm going to remember is how much I hate Alley the Ice Queen of the Vicious Circle. How ever I do like how she dosnt like how boys try to do every thing for her and got annoyed when a boy opened a can of soda for her. That would annoy me too."}, {"userName": "Norm", "userReviewDate": "Apr 09, 2011", "userURL": "http://www.goodreads.com/user/show/971750-norm", "userReview": "I have to hurry and post my review because if you believe some people, the world is going to end tomorrow (May 21). And if that happens, perhaps we'll all wake up and be zombies ourselves.Anyway, I enjoyed this book, despite not liking zombie books as a rule. I just don't get the whole brain-eating thing. But Selzer put together a quick, light read and I liked how he gave plausible (well, if anything zombie-related can be called plausible) explanations for why zombies stumble around groaning 'Stella'... er, 'brains.'It wasn't particularly deep, but, you know, it doesn't need to be. My books aren't either, so I won't throw those stones.He proves even a zombie book can be fun.Normhttp://www.normcowie.com"}, {"userName": "Alley Kat", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/5010782-alley-kat", "userReview": "I Kissed a Zombie, and I Liked It, no matter how silly the title was, was an amazing book. It was a quick and easy read, yet still presenting details and character growth throughout the story. Algonquin, the main character known to us as several names, was well developed and showed great change throughout the story. She's a senior, close to graduating, no the school paper with dreams of college ahead of her. Doug, the zombie in this story, was a fun character, understanding of Alley and quick to make a spot in her heart. The plot was good, simple though. The story had a bit too much romance for me, but it wasn't too sappy. It had a wonderful ending that I didn't expect, but enjoyed better than what I thought would have happened."}, {"userName": "Jannat Bhat", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/9774522-jannat-bhat", "userReview": "The book is based in a post-Twilight world where vampires and zombies and other paranormal beings have 'come out of the closet' so to speak and roam freely amongst humans. Not surprisingly they are also the object of teen fantasy and obsession.I'd say overall it was an okay read for me ,not the best book in the world but it was okay ,nothing extraordinary or anything like that.I did like the love story of this book which was kind of sweet in its own way.That being said, it was a cute little book. Would I recommend this book to people? Probably not. If you have an hour or two to kill with nothing else to read then go for it."}, {"userName": "Scarlet", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/4684496-scarlet", "userReview": "I often judge books by their covers and titles. So, I wasn´t expecting too much from this book. After a couple of hours of reading (and laughing out loud) this short book, I'd finished the silly thing, and what do you know? It was miles better than I expected it to be!This story is part parody, part paranormal romance, part comedy.Funny, quick and hilarious!4,5 stars"}, {"userName": "Jordan Price", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/2709426-jordan-price", "userReview": "The funny parts of this book were a smokescreen for some interesting commentary on society, young girls and self-esteem. Post-humans (vampires, werewolves and zombies) came to light three years prior, when the narrator Ally was a high school freshman. Now she's a senior itching to leave Des Moines for college in Seattle. She's not only too cool to be flattered by boys, she's too cool to get caught up in the vapid vampire-love hysteria that's flooded every other teenaged girl on the planet.But then she falls fast and hard for the mysterious and sickly Doug, who she assumes is just a goth, like every other boy on the planet who's trying to mop up the vampires' sloppy seconds. With the title of the book being what it is, we can all guess Doug's affliction.A few of the quibbles I had: some of the worldbuilding was great, and some was vague or maybe a bit silly. The zombies need to drink embalming fluid every four hours or else they crumble? And the method of making them is blown off. Contrast this with the worldbuilding of the social ramifications of post-humans coming to light, which is filled with message boards full of pathetic teenaged girls who don't know the difference between there/they're, and weird, upbeat pamphlets about \"converting\" to posthumanism in the school nurse's office.The main character was too self-aware of her ice-queen reputation and her effect on boys, and this aspect was expressed in both exposition and action. I thought taking out the exposition and leaving the action would have been better. Then, in the end, when she finally matures and mellows, it would feel like a more natural character arc.Sexuality was handled in vague terms. I suppose it was done that way on purpose so the characters would seem streetwise to any reader regardless of the reader's perception of what's daring or risky sexual behavior for her own social group. Lots of talk was made of \"hooking up\" but it seemed like that just meant makeout sessions, where of course in real life nowadays kids take it a lot farther than that.The ending felt tacked-on and the character voice was \"off.\" Her feelings were explained, maybe over-explained, and yet they rang false for me. I won't be more specific here because it would be too much of a plot spoiler.Criticisms aside, overall I really enjoyed the book.Aside from the worldbuilding, what I loved about the story was its humor. When Ally and her friends are trying to figure out what disease Doug has...chronic, non-contagious and embarrassing being the parameters...they decide he must have explosive diarrhea. Ha ha, I still laugh at that one. The scenes with Ally getting angry at the message boards where none of the girls can spell were also highlights of the book."}, {"userName": "Mad Scientist", "userReviewDate": "Nov 10, 2010", "userURL": "http://www.goodreads.com/user/show/4347702-mad-scientist", "userReview": "Posted at http://madsteampunkery.comConcoction of a Review:I Kissed a Zombie and I Liked It is not a literary masterpiece or a Halloween masterpiece for that fact. It is a fun, facetious take on the young adult genre. Selzer takes teen trends, pop culture and the vampire craze that swept the nation as of late and twisted it together with irony and funny prose. As a person who is intertwined with a different age, I do not see the cleverness behind the pop culture reference standing up to the test of time.Algonquin, otherwise known as Alley or Ice Queen of the Vicious Circle, spends her days coming up with witty one liners and working on the high school newspaper (blog). She is a very negative goose when it comes to courting and love. The Ice Queen does not want to get emotionally tangled with anyone. To temper the loneliness she uses and tosses poor boys aside. *tsk tsk* She also has the pessimistic side to life, everything will be better once I move out of this forsaken city. *sigh* These young wiper snappers do not realize that the grass is hardly greener elsewhere.Her eyes open up and take a new brightness when she meets Doug, a goth who makes an appearance singing for the towns crappiest band, the Sorry Marios. Ice Alley starts to melt along with her reputation, from the first note she hears come out of Doug's mouth. Everything who she is becomes insignificant. She soon becomes one of those doe eyed girls who changes their skeptical outlook a the sight of good man Zombie. Now she needs to figure out about interspecies dating. *Gasps*There were a few parts where Alley was torn over the things she wanted in life and Doug. I found it rather interesting to watch her make tough decision about her love life. This book brought me back a few centuries to when I was young lady in waiting. We did not have these types of problems to face but those are the days that shape us into the people we will become.Ah, the ending. *Holds hand to chest* Ladies and Gentleman... the ending was a bit surprising. Even though I was shocked, Selzer did some great tinkering and wrapped up the story beautifully. This book was a sweetly spun first love romance threaded with a number of paranormal allusions. 3.1 BlastsWhile being mildly fun, this was a quick book to read on a different Zombie spin. Can Zombies fall in love? Now that is the Question!"}, {"userName": "Patricia Lynne", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/4153833-patricia-lynne", "userReview": "Vampires, zombies and werewolves are real in Alley Rhodes's world. Only they aren't anything like the myths say. Alley could really care less. She'll leave dating post-humans to the idiots. One night, she goes to cover a local band for the school newspaper and mets Doug. His soft, crooning voice captivates her. She can tell he's a real goth and not a wanna-be like most of her classmates. They start dating and despite a few odd quirks Doug seems pretty normal. Unfortunately, he's a zombie. How did Alley miss that fact? And what does she do now?When I started this book I expected a fun, light read. Adam Selzer does a great job of capturing teenage voice. Without an over abundance of the word like. I could believe Alley was a senior in high school, eager to get the hell out. Her feelings towards Doug were realistic as well. The way she was smitten was cute. The changes her attraction to Doug was handled nicely. It was instant, not too fast. Alley questioned herself, asking herself if she wanted to rearrange her life around Doug. As for Doug, I could say it'd be nice to get to know him a bit better, but how much I saw was good for the plot. What Alley knew about him and her reactions fit how I remember being a teen. She asked at one point how much did she know about Doug? Was it enough? Like any teenager, when he'd show up the question no longer mattered. I remember moments like that well. The vampires were interesting too. There was definitely a whole world that is touched upon. Since the vamps were major players you only learned enough for the story, but it made me want to know more.Over all, it was a cute story about a girl having her first love and the inner turmoil it puts us females through. The supernatural theme added to the turmoil. What I didn't expect was the ending. I did not see that coming and the ending made me cry. The ending fit, but I wasn't expecting it. It was a nice twist too from the usual way paranormal YAs end."}, {"userName": "Chibineko", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/4436152-chibineko", "userReview": "I picked up a copy of this the other day, looking for something cute & brainless (ha!) to read. After flipping through the first few pages, I knew I had a winner when it had me chuckling out loud.The dead walk among us... and they're kind of emo jerks. Teenager Algonquin AKA \"Alley the Ice Queen\" is overly negative & pessimistic when it comes to love & life in general. She'd rather love `em & leave `em, then sit on the sidelines with her friends & mock the so-called \"popular\" life rather than become one of them. Especially since the undead & supernatural population have come out of the casket & joined the rest of society. It's only when Alley meets Doug at a local band appearance that she begins to change her cynical outlook to something less pessimistic. But when you're dating a being that doesn't age, what about the future?While this isn't going to win any awards for being the most cerebral read, it is one of the quirkiest reads I've had in a while. Poking fun at several vampire romance stories & clichés (including Twilight), this book had me laughing out loud at several different points in the book. (Don't worry Twilight fans- it's all in good fun.)I really did like the characters & I liked that Alley actually thought through her relationship, something that I don't often see in many supernatural romance books. It's refreshing, to be honest.I just wish that there'd been a little bit more to the book- I'd have loved to have seen more of the friends as well as learn a bit more about the various supernatural creatures. The book mostly focuses on zombies, which is partially because Alley focuses mainly on zombies, but I'd have liked to have learned more about the vamps & weres.This is a great book & I can see many people enjoying it, but in the end it is just a little too short for my tastes. Still, in a genre that is getting flooded with similar entries, this book manages to bring a little something new to a table filled with UF romance clones."}, {"userName": "Lindsey", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/1444742-lindsey", "userReview": "I saw this as I was cataloging books at the library, and it was an intriguing title, so I looked at the summary on the cover. And the summary hinted that there would be lots of fun poked at the Twilight-style vampires, so I just had to look inside. And Alley's voice and the premise--vampires and zombies \"come out of the coffin\" (snort) and hang around high school to pick up girls--intrigued me. So I ignored the gazillion wholesome, soul-nourishing books I was reading at the moment, cataloged it, vandalized it, which is what I call stamping \"(Insert Name) Public Library\" all over it, and checked it out.It was a quick, one-sitting, lighthearted read. Alley is sharp and snarky and even as she falls hopelessly in love a voice in the back of her head notes the ludicrousness of the situation. The book never takes itself too seriously--actually, never takes itself seriously at all--but there are a few sly, astute observations. There is a lot of making fun of Twilight vampires. And page 97--the book was worth reading just for that. Hilarious. Language is decent, so low-key that even I wasn't offended. Several references to making out and sex, but not over the top, and...um...delicately handled. And Alley herself doesn't drink or do drugs. Violence--there are a couple of zombie attacks but the descriptions are almost cartoonish in nature.Overall, fun, inoffensive, only 150 pages, and a good chance to have a hearty laugh at Twihard fantasies. Recommended for when you need to read something but don't have time to commit to a more intense novel."}, {"userName": "Nina", "userReviewDate": "Oct 23, 2010", "userURL": "http://www.goodreads.com/user/show/2695465-nina", "userReview": "I saw this book at the bookstore and the cover made me flinch. Ooh, kissing a zombie, that got to be disgusting. I have no idea why a girl would want to kiss, well face it, a death corpse. But hey, there must be differences in the world.Alley is not a girl I would be friends with. She’s too sarcastic, rude and just too hard on boys. I could not see how after one date she could be head over heels with a guy, who she thinks wears grey make up, smells bad and doesn’t talk a lot. It was unbelievable to think that she was so madly in love that she could not see he was a zombie. Just too obvious.So the romance in this story was off. I could not feel the connection between them and I could not believe that she could fall in love with someone like that. Call me judgemental!The plot of the story was okay. There could have been more telling about the zombies and vampires, but in 117 pages it was done nicely. There was a action scene. Yes, one! It didn’t last long, but the author did put one in. So a bonus point. The ending disappointed me, but Alley did finally grew up in a good way.The writing is easy and it flows all well together. There where some funny moments and that made me laugh, but nothing quite spectacular. I kissed a Zombie and I liked it is a quick, light read about a girl with a crush on a zombie. Get it if you need some time to kill."}, {"userName": "Jay", "userReviewDate": "Mar 24, 2011", "userURL": "http://www.goodreads.com/user/show/2419499-jay", "userReview": "From what I can tell, this author takes pop culture references (I Kissed a Girl by Katy Perry as an example) and puts them with a supernatural twist, thus this title.This book suffers from Indecisive Parody syndrome. It starts off as a real kick in the pants for Twilight and its fans. Girls want an undead boyfriend, but others gently (or seriously) mock them. Alley starts out as a somewhat anti-Bella. People don't like her (though this seems to be an informed attribute) and she can't stand this undead phenomenon and she already has plans to skip town once her time at high school is done.Enter Doug, stage left. He seems to be Edward, only as a zombie. And, unlike Bella, Alley is quite slow to work this out. Cue to a Bella/Edward -esque romance that makes me cringe. I still enjoyed this book. Adam Selzer admits that Doug and Alley would have broken up after six months, anyway, but he just didn't have time to write all that. I knew Doug couldn't go away peacefully, but I'm surprised his departure, so to speak, was so abrupt. And it was a touch annoying that the limited action only occurred in the last two chapters.So, a good book, but a misdirected at times."}, {"userName": "Cecilia", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/2183201-cecilia", "userReview": "I had really hoped to love I Kissed A ZOMBIE if only for its title which totally rocks out and its theme song \"I Thought He Was A Goth\" (see music player below). But sadly the story fell a little too short - lots of potential loving, but I needed more...\"oomph\" I guess. Not enough of that high school drama, doomed romance, head-butts with the popular crowd, etc. It was there, don't get me wrong, I just thought there would be more of it! I know, I could be easily demented and simply just crave to relive my high school idealisms :DI haven't quite decided if I like Alley 100%. She has her awesome moments, but the Alley that greets us in the beginning seems a little too snarky that it borderlines mean. She has a super-hard exterior and doesn't really give anyone a chance to get close to her - I can understand her not wanting to establish any ties to a hometown that she prefers not to be in after high school, but it was even hard for ME to get close to her. After she meets Doug, Alley starts to show her marshmallow insides despite her natural instinct to snark.What say I about I Kissed A ZOMBIE in the long run? Well, I didn't go zombies over it, but I think this would be a great introductory book for the zombie-innocent, especially if you prefer your YA not too bubbly and sticky sweet."}, {"userName": "Faye", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/3655734-faye", "userReview": "It was good and it was refreshing since it was different not on the paranormal genre but on how the author presented his storyline and how he ended things. I think that he had made a one hell of a good ending and it was amazing even if Alley didn't get her happily ever after with Doug because she did learn a lot in the short span of time they were together and make her appreciate life even more and lessen her cynicism (I just felt it was an appropriate word) because she doesn't want to be attached to anyone. It was also kinda funny too with the one liner witty lines that Alley and her friends used to others and to each other as well. Very quick read and light too with a touch of drama in the end. Quotes I liked:\"There is a crack in everything. That’s how the light gets in.\"(I feel that my optimistic-o-meter just reached another level with these twelve words. Hahaha! Funny but I'm quite serious. Just can't stop with the witty comment there.)\"Wow,” says Peter, “when your guidance counselor tells you to die, you really have problems.\"(In this one, I have to laugh out loud when I read it. I find it really funny because when I hear guidance counselors, I pictured those who are very well-mannered and polite when they talk to you, not someone who will tell you go ahead dear, find a way to die. Haha.)"}, {"userName": "Cereja Cult", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/5374664-cereja-cult", "userReview": "Never say neverI fell in love with this book from page one. The way that Alley and the vicious cycle act gave me a jaw cramp from all the laughing.For her the dead should stay dead, but then she met Doug and his breathy voice wins over the Ice Queens' heart.Alley become Gonk and discovers that being a zombie's girlfriends isn't easy.The reading is very contagious and, dough it didn't seams, You learn with it. Don't believe in stereotypes and don't trust only in your head or only in your heart. The balance between the two is the key.****Nunca diga nuncaEu me apaixonei pelo livro desde a primeira página. O modo como Alley e o ciclo vicioso agem me fazia ter caimbra no maxilar de tanto rir. Para ela os mortos deviam continuar mortos, mas aí ela conhece Doug e sua voz soprada ganha o coração da rainha gelada.Alley se torna Gonk e descobre que ser a namorada de um zoumbie não é nada fácil.A leitura é contagiante e, embora não pareça, você aprende com ele. Não acredite em estereotipos e não confie somente em sua cabeça ou somente em seu coração. O equilibrio entre os dois é a chave."}, {"userName": "Trisha", "userReviewDate": "May 20, 2014", "userURL": "http://www.goodreads.com/user/show/1238273-trisha", "userReview": "The title alone prepares you for this silly read. This girl is rude and mean and nasty to just about everyone. Her name is Alley and she's proud of her Ice Queen nickname. She doesn't give guys or anyone else a chance. She'd rather insult and belittle everyone than make a new friend.Well...that's because she considers most people completely annoying in their love and lust for the undead. Although all the creatures have come out, Zombies and Vampires are the main ones in this book. Most girls would just LOOOVE to convert (ie DIE!) to be with a zombie or a vampire. And Alley thinks they are all dumb in their craze for both boys and love.But then Alley meets Doug. And he's cute and sweet and she suddenly finds herself smitten.....and doing/acting in ways she never thought she would.Meh, it was cute and the message was interesting. But overall, it was obnoxiously annoying. I didn't find Alley/Gonk funny - I just thought she was a pretty awful person. I thought her friends pretty much sucked as well and Doug....meh. I'm just glad this was short."}, {"userName": "Michele Lee", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/778299-michele-lee", "userReview": "Ali Rhodes is the quintessential teenage curmudgeon. Music reviewer for her school paper and notorious snark queen she's the last person to fall for trends and scams--or in love. But at a local show she meets a guy who is tall, Goth and handsome, and who knows how to sing with soul. It's just too bad Doug is a zombie.\tWhile it starts off as a snarkeriffic paranormal humor tale in the end it makes a statement on the social pressures teens (and everyone really) face. (It manages to make fun of a lot of the trends in YA fiction as well.) Ali thinks she's highly resistant to the fall-in-love-with-a-vampire deals, but finds herself reconsidering the rest of her life when her guidance counselor pushes “converting” on her and Doug's personal limitations rear their evil heads.\tWhile the book ends too quickly I highly recommend it, especially for school or public collections with a lot of paranormal YA readers as it manages to be witty, funny, and meaningful.\tContains: mild language, hinted adult situations"}], "description": "Algonquin \"Ali\" Rhodes, the high school newspaper's music critic, meets an intriguing singer, Doug, while reviewing a gig. He's a weird-looking guy--goth, but he seems sincere about it, like maybe he was into it back before it was cool. She introduces herself after the set, asking if he lives in Cornersville, and he replies, in his slow, quiet murmur, \"Well, I don't really live there, exactly. . . .\"When Ali and Doug start dating, Ali is falling so hard she doesn't notice a few odd signs: he never changes clothes, his head is a funny shape, and he says practically nothing out loud. Finally Marie, the school paper's fashion editor, points out the obvious: Doug isn't just a really sincere goth. He's a zombie. Horrified that her feelings could have allowed her to overlook such a flaw, Ali breaks up with Doug, but learns that zombies are awfully hard to get rid of--at the same time she learns that vampires, a group as tightly-knit as the mafia, don't think much of music critics who make fun of vampires in reviews. . . .", "title": "I Kissed a Zombie, and I Liked It", "url": "https://www.goodreads.com/book/show/6609694-i-kissed-a-zombie-and-i-liked-it", "average": 3.32, "cover": "https://images.gr-assets.com/books/1438204810l/6609694.jpg", "reviews": 280, "authors": [{"url": "https://www.goodreads.com/author/show/345739.Adam_Selzer", "name": "Adam Selzer"}], "type": ["Horror", "Young Adult", "Romance", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/6609694-i-kissed-a-zombie-and-i-liked-it", "http://www.goodreads.com/book/show/18852053-play-me-backwards", "http://www.goodreads.com/book/show/33154631-h-h-holmes", "http://www.goodreads.com/book/show/6661932-the-smart-aleck-s-guide-to-american-history", "http://www.goodreads.com/book/show/6660370-your-neighborhood-gives-me-the-creeps", "http://www.goodreads.com/book/show/641751.How_to_Get_Suspended_and_Influence_People", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}