{"ratings": 89, "userreviews": [{"userName": "Kimberly  Higgins", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/11476994-kimberly-higgins", "userReview": "When I learned that my childhood friend, Lisa C. Temple, had written a book, I was very impressed by the sheer accomplishment of such a task, and I ordered a copy. What a treat was in store for me!One of the first things that struck me, was that I knew these places described in the book. I was born and raised in Montgomery, Alabama, and often traveled those back roads to Lake Martin, as well as Wetumpka, and surrounding areas. So I really felt like I was with Gracie as she drove down that dark road on a particularly fateful night, cranking tunes and trying to be brave. (And speaking of tunes, I would be remiss not to mention the clever use of an appropriate song title for each chapter!)I also enjoyed the southern sayings and colloquialisms; phrases with which I grew up, and that always remind me of my mother, who would deliver these with her soft drawl. Lisa captured this very well, and for those who were not raised in this part of the country, you can rest assured the depiction is authentic.Beyond these delights though, lies the story itself. I immediately identified with Gracie, remembering the doubts I had as a young woman, and I think readers of all ages, male and female, will also understand these emotions. The story also contains little mysteries that keep you turning the pages, as gems of insight turn up along the way. It is a story of hope and redemption, and a beautiful request of each of us to let our light shine brightly.I look forward to the sequel..."}, {"userName": "LaDonna McNutt", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/24349940-ladonna-mcnutt", "userReview": "Up to page 159- Halfway Point\tThis…this is shocking. I am slowly but surely falling in love with this book. The descriptions are beautiful, and the characters are written so well. \tGracie Bennett is the picture of a sullen, self-conscious teenage girl, with the sarcastic attitude to dominate them all. Her story really kicks off, when after delivering food to some secluded house down some Alabama dirt road, she’s given a job offer from the sassy and stout Mrs. B, and her kind hearted, instant “good-guy-vibe” employee/friend, Willem. To old and quirky folks living in a big mansion, offering to pay her a small fortune to run errands? Oh yeah, she jumped on it. And, of course, I could never forget the boys…boyssss.\tMerchison Spear, -Merc- the drop dead gorgeous, Jesus-fry-eggs-on-that, bad boy, who rescues her from her flat tire and constant feelings of self-doubt, and Locke Wingard, Willem’s golden boy grandson, and king of the whiplash effect personalities…who always happens to look like an Angelic J. Crew model. While Gracie cannot even begin to fathom why these two perfect specimens would be vying over her attention, a few things out of the ordinary start to occur, such as her over hearing Mrs. B and Willem fight with Locke over her “safety,” and how Merc would “protect her with his life,” Uhm, hello, ominous much? \tBut anyway, in order to not give away any early pertinent keys to the “mystery” of this story, I shall not go any farther, but to say that fans of Becca Fitzpatrick and Lauren Kate may very well have to move over and make room, because Lisa Temple is pulling in, and honestly, the competition is just so Fear and Loathing.Rest of review:Alright, childrens. It took me a bit to formulate a halfway decent response for the last half of this book, but I've finally got it. We finally find out the mystery around the whole Save Gracie plot: She's an \"angel-lite\", a human who's been in contact with an angel, making her stronger, faster, and beautiful...and the target of demons, intent on using her for the summoning of their \"Master\"- Lucifer himself. The ring leader of this crazy-A demon circle? Beladona, a fallen angel, and the brother of a certain golden boy, with angel status of his own. Who's that, you may ask? Our lovely little Locke. Yup. And who is it that Beladona's been parading around as, sinking their clutches deeper and deeper into our dear Gracie, under the false pretense of trust and protection? She's tall, she's blonde, and if you've read the book, good luck not wanting to punch her out when you realize. And of course, I'll keep the BEST twist to myself, because honestly, I don't think you can handle it. As you approach the close to Illuminating Gracie, prepare yourself for plot twists 'comin out the word works, y'all, and I look forward to waiting with you all for the sequel ^_^"}, {"userName": "Kimber Wheaton", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/16667146-kimber-wheaton", "userReview": "*I received this book from the author in exchange for an honest review*Illuminating Gracie is a paranormal take on a coming of age story. I think at some point we've all wished for a 'redo' for some event in our lives. Can you imagine the opportunity for a complete 'redo' of your entire life? Grace's story is complicated by the influences of good and evil vying for her soul. The choices Grace makes and will make affect so much more than her life, but she is a confused, bitter seventeen year old girl forced into a situation she doesn't understand.Grace is an interesting character. She is very intelligent, yet lacks motivation to do well in school. She thinks she's an overweight, unattractive girl, though the way the guys in the story act, that just isn't true. Overcome with OCD and ADHD, Grace has a hard time in day to day life. She has a loving family that obviously cares about her, but she just doesn't see it. Sometimes it gets tiring just how much the poor girl wallows in self-pity. Grace is in desperate need of a mental makeover or she is destined to walk a dark path in life.When fate lands Grace at the mansion inhabited by Mrs. B, Willem, and Locke, her life immediately starts to change. She agrees to take a job assisting Mrs. B with her autobiography. In one day Grace lands two dates, both with drop-dead gorgeous guys. Merc is enigmatic and Grace feels an immediate, yet undeniable pull to him, even though part of her screams 'danger'. Locke is the all-American boy next door type. Grace feels comfortable around him, but doesn't feel the pull toward him that she feels for Merc.The pacing starts out a bit on the slow side, but picks up significantly about a third of the way through. Lisa Temple's sweeping descriptions are so detailed, the scenes just leap off the pages into the mind's eye. There were a few times I felt a bit mired by descriptions, but that occurred mainly when I was desperate to learn the next secret. This novel is full of so many twists and turns, some the reader just doesn't see coming. I especially liked the way Grace's best friend, March Ann, ended up being portrayed. All I can say is 'wow'. This is the first book in a series, and that's made clear in the epilogue. I'm not sure how I feel about the final revelation in the epilogue. I can't say it necessarily surprised me, but it still threw me for a loop.I recommend Illuminating Gracie to everyone high school and up that enjoys a deep, reflective story. The novel is well written, using amazing imagery and imagination. I look forward to seeing what else Lisa Temple has to offer."}, {"userName": "David Chattaway", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/20815832-david-chattaway", "userReview": "I have to say I really didn't know what to expect when I started reading this book. I was drawn in from the onset by the intrigue and mystery of the mansion, the characters that Grace met at the start and by the sudden love triangle she found herself in. I'm a huge fan of supernatural stories and I particularly loved the way that the author described the physical change that the Angels would go through when taking on their \"True\" form. \"Illuminating Gracie\" packs in everything you could want from a great read, it has a swarm of excellently detailed characters, each with their own voice and personality. It has some shocks and twists which keep you wanting to turn the pages, but most importantly it has a powerful message. The whole story is told from Gracie's perspective, and over the course of the 300 plus pages the reader gets to witness her transformation from a person riddled with self doubt and low self-esteem to the inevitable woman she becomes. Stronger and more confident, because of the journey she's taken. I found myself thinking deeply on the message written in the last few chapters of the book. What are the outcomes of my decisions? How do they effect both others and myself? I think anytime you finish a book and not only wish there was more to read but also carry the intended message into your everyday life afterwards the author has achieved something truly profound. I'll eagerly await the sequel!"}, {"userName": "Dawn", "userReviewDate": "Dec 04, 2013", "userURL": "http://www.goodreads.com/user/show/17199296-dawn", "userReview": "I was given a free copy of this book for an honest review.Illuminating Gracie is a good young adult fantasy. It grabbed my interest from the beginning and flowed well. Lisa C. Temple’s writing is easy to read and I enjoy her sense of humor.The first half of Illuminating Gracie is about Gracie finding out who the new people she has met actually are and how she is connected to them. She starts out as a typical negative teen with a poor self image, but as the story progresses she begins to mature.The second half of the book is more about angels and demons, the age old fight between good and evil, and although it was still good, I didn’t enjoy it as much as the first half. I couldn’t think of a better ending for Illuminating Gracie. Things were resolved for the moment but you know there’s so much more that can happen. In other words, I’m looking forward to the sequel!"}, {"userName": "Amanda", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/4856511-amanda", "userReview": "I found this book to be wonderfully well written. The author has a talent at drawing you in to the story with such clear descriptions of the surroundings that you feel that you are there. The way she has written the characters make them feel real to you as you read. I loved Gracie from the moment she thought that she was just a pair of stiletto heels and a tube top from a bad b movie! Then she checked to see if her shoes were tied good in case she had to run from werewolves or zombies! Yep, that would have kept me reading if I hadn't already wanted to know what was going to happen. This was in the beginning of the book, and it just kept getting better from there. I love that this character has her problems that I don't actually come across in most of the books she reads. I am all to familiar with OCD. I live with a house full of people that suffer from it to some degree. I recognized and connected with her immediately. While I never have the need to check under my bed multiple times or to countdown to de-stress, I have had to live with a person that goes into high gear obsessive cleaning sprees that can last for hours if not days. I have had the child that had to compulsively rearrange his furniture as soon as he was old enough to move it himself. So I started off feeling an emotional attachment to Gracie. Plus her worries about her weight and her lack of social standing are so real. I suffered through high school as well feeling like the fat outcast with no friends but the one pity friend. Of course I am still friends with her today, so obviously she wasn't a pity friend, but when you are in high school you see things differently.OK I will stop talking about myself and get back to the book. Everything that I have been talking about that attracted me to this character and this book are in the very first chapter. Imagine how eagerly read the rest of the book and how much I enjoyed it more when Angels and Demons and hunky guys cropped up!This book is a must read for just about anybody. It might be a little slow at first, but it picks up. The characters are well developed, you can feel emotionally connected to them. The writing is wonderfully descriptive and engaging. I think this is a great book and I look forward to reading more from this author. OH! And the ending! I wish I could tell you about it. It was really well done. Just read it and you'll find out. Disclaimer: I received a copy free for reviewing purposes. Regardless, all opinions are my own. I was not required to write a positive review."}, {"userName": "Quinn Barrett", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/5383614-quinn-barrett", "userReview": "Wise Bear Media Reviews \"Illuminating Gracie\" by Lisa Temple -- 4 Paws!I want to give a little background as to how I came to read this book because I’m not a huge fan of young adult fiction and my religious leanings are definitely secular. The author, Lisa Temple, had been a recent guest on a weekly podcast I host (http://www.wisebearmedia.com/quotable...) and I was so impressed by her humor and southern charm during our discussion that I was interested to learn more about Lisa Temple as a writer. I don’t read many of my guest author’s books because time is a rare commodity in independent publishing and I always have too many irons in the fire. That said, I occasionally make an exception, and “Illuminating Gracie” had a concept, book cover, and even a website that intrigued me.Temple’s writing style is much like her personality–quick, funny, and smart. There are a few places where I thought some of Gracie’s vocabulary was less adolescent and more full grown women. This is a fairly common occurrence when adults write for a younger audience–a personal pet peeve of mine that drove me crazy while attempting to read “Twilight.”Although this book could easily be marketed as Christian fiction, Gracie’s story has mass appeal to a much broader audience. There is a strong paranormal element to the novel’s plot that some readers will view as primarily religious; but the story of good and evil has been told in so many ways and in such a variety of books over time that “Illuminating Gracie” shouldn’t be pigeonholed into such a narrowly defined niche.For a first time novelist, Temple has done a lot of things right. The characters are generally believable in the context of a paranormal story line with a nice plot twist at the end. The love triangle between Gracie, Merc, and Locke will keep true YA readers interested, but could seem a little protracted for some of us older folks. Overall, the author understands her audience, and readers will be pleased to take this journey in the fight of good versus evil."}, {"userName": "Melanie", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/1095633-melanie", "userReview": "(4.5 stars) This is one of those books that the longer it sits with me, the more I like it! While I was reading it, there were parts that I absolutely loved and highlighted, especially near the beginning. Then it took a strange turn, yet that part was still essential to the story. It ended strong, though, and I enjoyed getting some questions answered. Finally, there was the Epilogue which was unsettling but has me wanting to read the next book asap.I enjoyed Gracie's relationships. She met two good-looking guys, Locke and Merchison, who were both vying for her attention. They are also keeping secrets from her and she wants to find out what they are. She's not sure which one she can trust and feels confused. I definitely had my favorite and after some other things are revealed, she ends up with the one I want her with. However, they are both young and still have a lot to go through so I'm hoping they can make it to the end.I also enjoyed Willem and Mrs. B. They were mysterious and odd and hard for Gracie to figure out. They gave Gracie some good advice but, like the guys, she wasn't exactly sure if she could trust them. We were given enough hints throughout the story to figure out who they were and I enjoyed the reveal to Gracie and her subsequent \"illumination.\" Gracie has a good sense of humor, too, and her internal conversations were fun to read.This is a great story illustrating good vs. evil and second chances. Gracie learns what her relationship is to everyone else and it will be interesting to see where the story goes from here. Gracie is young so will she stay on the path she's currently on which will change the course of her life or will she fall back into old, familiar patterns? I'm looking forward to finding out!Mel's Shelves"}, {"userName": "Sabrina Olteanu", "userReviewDate": "Mar 02, 2014", "userURL": "http://www.goodreads.com/user/show/9585212-sabrina-olteanu", "userReview": "I received this book in exchange for my honest review. Thank you so much Itching for Books and Lisa Temple for the chance of reading Illuminating Gracie.I thought this is going to be another book about an obnoxious teenager. Guess who was wrong?! I couldn't believe how perfect the story is written. Everyone had moments in they're life where they just want to go back in time and redo something. We wished it so hard and still nothing. So we accept the situation. But, this isn't the case. We have in this story Grace, a seventeen years old girl who has had enough bad luck and suffering to last her a life time. She doesn't have strength to do anything at all, school isn't great because she can't concentrate and she has a bad impression about herself. No matter what she does, Grace hates her life and she wants to change it. When she gets the chance tot change everything she doesn't waste any time!I don't know how to even describe this book to do it justice. It is just a great story! The author really managed to describe Grace so perfectly I thought I knew her for a long time and I could understand what she was going through. When I started reading the book I didn't know this was going to be such an amazing journey! The book really teaches you something about life! You should give it a chance because you won't regret it! I highly recommend it!"}, {"userName": "Victoria", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/23644355-victoria", "userReview": "Partially through the book review:Just received this yesterday and I'm already half way through it. Lisa does an excellent job keeping the reader interested in the book, I also must say you feel you really connect with Gracie herself, as if you're almost there with her. After finishing the whole book review:I thoroughly enjoyed Illuminating Gracie! It kept me on the edge of my chair waiting to find out what would happen next. I am not an avid reader, but finished it in a couple of days. I felt as I, and many girls, could relate to Gracie's young insecurities. I loved her wit and humor. I think it would make a great movie! I do hope there are more books and adventures of Gracie to come.Note: I received this book through Goodreads First Reads!"}, {"userName": "Donna Zink", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/23041024-donna-zink", "userReview": "Wasn't sure what to expect when I began to read \"Illuminating Gracie\". What a Treat! It's a YA book that should be read by any one young or old (like me ;-)) You'll find humor, self-doubt, mystery, and plenty of angel against demon action. Gracie is a very believable teenager that many if not all can identify with. Time after time something she either said, thought or did triggered a memory that had me nodding and saying to myself \"that is so totally me when I was a teen\". It has a wonderful message to anyone young or older that should be taken to heart. But it also has plenty of suspense and action. I would, will and have recommend \"Illuminating Gracie\" to any and everyone. Read and enjoy!"}, {"userName": "Dawn Barkalow", "userReviewDate": "Sep 16, 2013", "userURL": "http://www.goodreads.com/user/show/5867271-dawn-barkalow", "userReview": "I love the unexpected in a book and Illuminating Gracie delivered! It was a page turner from the beginning and the end was a very delightful \"Wow!\". The characters in the book were intriguing, unpredictable, and complicated - but also comfortable; the kind of people you would want to know and spend some time with. In addition to the wonderful characters and story, there is an uplifting message of purpose and hope. I highly recommend this book!"}, {"userName": "Ronda Clancy", "userReviewDate": "Feb 07, 2014", "userURL": "http://www.goodreads.com/user/show/26062555-ronda-clancy", "userReview": "From the very beginning I was fascinated with the concept of being able to redo your life. There are parts, some big, some small, that we would all love the chance to go back and do differently. Lisa Temple has done a wonderful job of letting us do just that with Mrs. B. and Gracie. Her characters are beautifully written and keeps you hurrying to finish each page."}, {"userName": "Michele Centeno", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/9235670-michele-centeno", "userReview": "Like in my comment....this book would be a great movie.....very deep, psychological meets paranormal...Lisa has created a new genre!!!"}, {"userName": "Janet Robinson", "userReviewDate": "Nov 24, 2013", "userURL": "http://www.goodreads.com/user/show/4740999-janet-robinson", "userReview": "What a fantastic read!! I thoroughly enjoyed Illuminating Gracie!! Mystery, snarky humor, overcoming the odds...this book has it all. I will post a much more extensive review soon!!"}, {"userName": "Kim", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/8465925-kim", "userReview": "TOUCHED BY AN ANGEL MEETS BUFFY THE  VAMPIRE SLAYER!“Illuminating Gracie,” is a spiritual story of redemption and unconditional love, and a cautionary tale of the fight between good and evil forces in our lives. Grace Bennett is a young girl with a terribly low self-esteem and a fast-growing darkness with her. The book is told from her viewpoint, and the blinding honesty of this heroine makes her immediately likeable and entirely relatable. I don’t think there is a person alive has not had at least some of Grace’s doubts and fears at some point in their life.While delivering food for “The Martin’s Nest,” Grace meets an old woman that seems vaguely familiar to her. The old woman – along with her manservant, Willem – ask Grace to work for them for the summer, and though Grace dislikes the old woman on sight, she agrees. That same evening she meets two young men, Locke Wingard – the congenial grandson of Willem - and Merchison Spear, a gorgeous and mysterious boy who lives on the old woman’s property, Grace likes both boys, but it is Merc who she is romantically attracted to.Grace knows Locke is the better choice, but she can’t help but be drawn to Merchison Spear. Grace cannot see any beauty within herself, so she is shocked and suspicious when she finds that he Merc likes her too.Over the course of the weekend, Grace battles both her inner-demons of self-hatred and insecurity and real demons that are somehow connected to the old couple and the two boys. Each of Grace’s new friends wants to help in her fight, but it is Grace who must learn to depend on her own inner-strength to take down her demons. Once she is victorious, she can then go into the world and fight for others. There are real-life lessons within “Illuminating Gracie,” that the author subtly conveys through humor and well-drawn characters. The book teaches, but the reader is having such a good time, they never realize they are being taught!"}, {"userName": "Paula M. of Her Book Thoughts!", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/23287093-paula-m-of-her-book-thoughts", "userReview": "MORE REVIEWS AT MY BLOG\"You must be most cautious of the unknown – those parading as good, when indeed they are not. And don’t forget as long as one has a heartbeat, they have a soul capable of saving. Nothing is ever as simple as black and white, dear one. You must be diligent, patient and forgiving. You must be constantly seeking ways to turn hatred into love.\"The kind of story that you’ll read slowly so you can digest every word that the Author says.When I first read Illuminating Gracies’ blurb I know that I will like it from the start. The blurb was interesting and very intriguing. I mean, the thought was worth pondering.. If you have the chance to re-do your life, will you? And what are the changes you’ll make?Gracie is most like teen agers nowadays. Insecure, bitter and full of self doubts and very reserved. Her captivating story starts when her Aunt Patty asked her to deliver at a well kept mansion. She met Mrs. B and Willem that are both mysterious and intriguing. Mrs. B is a little bit grumpy but hilarious. While Willem is very soft hearted and gentle.First of all, I enjoyed being inside Gracies’ head. The author did an amazing job of voicing her out. That’s one of the reasons this story is a success. Lissa’s character aredynamic, and they compliment one another like a well conducted orchestra.Second, the plot is unique. I never encountered a story like this before. The twist and turns are unbelievably well executed because of the Authors’ brilliant writing. My attention was easily captured from the Prologue. Then my interest intensified when Merc and Locke was introduced.Third, the story was very well written. The plot was well thought. Lissa’s writing style wad hilarious and easy to understand. It was all jam packed into one. Romance, A liitle bit of fantasy and a lot of moral lessons.Illuminating Gracie for me is a very long read. But oh so worth it!"}, {"userName": "Saumya singh", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/15908048-saumya-singh", "userReview": "Illuminating GracieLisa C. TempleEverybody at some point in their lives think about ‘redoing’ some events in their lives. Can you imagine about redoing your whole life? Illuminating Gracie is Grace’s story with complications of every seventeen year old girl yet completely different. She is at the crossroads of her life. The Good and the Evil are vying for her soul. But she has to make choices, whose’s influence on her life she doesn’t understand and she is forced into a world of situations she doesn’t understand one bit.  Temple has created a very interesting character of Grace. She is intelligent and smart yet she questions herself and is not ready to use her intelligence, she is confident yet she is insecured about herself. She can have a nice life but she still has a hard time in day to day life. She is one who needs a mental makeover else she has a dark path ahead of her. Other charcters are also commendable. Merc is enigmatic and Locke is the typical boy next door. The book’s pace starts a little slow but picks up in significant time. Temple has given sweeping descriptions for her scences which just jump into the reader’s mind making her work more interesting. The pace is kept alive with the desperation for the reader to learn the next secret. This novel is just full of all twists and turns at all the unexpected turns and roads. As the 1st book in the series as the epilogue suggested and what was expected, it has proven a great start and I’m just ticking off days on my calendar till I get to read it’s sequel. Also I really loved the idea of using song titles as appropriate chapter headings.To describe the book in one word- CaptivatingAnd I give it 5 stars"}, {"userName": "April", "userReviewDate": "Aug 15, 2013", "userURL": "http://www.goodreads.com/user/show/10974615-april", "userReview": "Illuminating Gracie is an amazing novel that is relatable and exciting. As a teenager myself I loved Grace because I have felt every insecurity that she has, possibly five times more. I was a little apprehensive when she arrived at Mrs. B's house although I knew that this would be a turning point in the novel and somehow work out for her in the end. Due to the relationship and behavior between Willem and Mrs. B I knew that something was a little strange and that Grace was not being told the entire truth about many things. I think meeting Merc and Locke did a lot for Grace's confidence and I was extremely happy for her even though I sensed something off about them. Through out the novel I felt as if something was not right about many of the characters and that they were hiding something from Grace. The resolution and conclusion of this novel helped a great deal in solving the billions of questions firing in my head while reading this book. In the end I was incredibly happy for Grace and Merc. The epilogue devastated me, although I am hoping that due to the way it ended there will be a sequel.Overall: Overall I enjoyed Illuminating Gracie because it is thought provoking and captivating. I would and will recommend this novel to anyone who loves romance and fantasy. I happily give Illuminating Gracie 5 stakes(stars) and will definitely read this again.*I received a copy in exchange for an honest review*Full review on http://onceuponacoffin.blogspot.com"}, {"userName": "Aimee (Getting Your Read On)", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/1934633-aimee-getting-your-read-on", "userReview": "Illuminating Gracie is a book with such an interesting premise. An old lady who has lived a cold and bitter life is offered a chance to go back and influence her younger self to choose a different and better path. It really makes you think, right? What would you do if you had the chance? How would changing one decision alter the course of your life? It's an interesting concept for sure.This is a story of coming of age and of redemption with an added paranormal twist. Demons and angels in the age old story of good vs. evil. Mysterious men, lots of secrets and one girl with a large low self esteem problem. I always like when characters make some sort of emotional or mental journey and grow into something better than when they started the story. Gracie does this with the help of people around her. When she starts to believe that she is smart enough and pretty enough and strong enough, the story reaches the best place. I enjoyed many of the secondary characters who added much to the overall feel of the book.The book starts out very slow but does eventually pick up. I thought this was a good book, although not quite up to par with the likes of \"The Hunger Games\" or even \"Twilight\" as touted in the summary. There is a bit of profanity (God and Lord used as exclamations)."}, {"userName": "Joana Arteaga", "userReviewDate": "May 03, 2014", "userURL": "http://www.goodreads.com/user/show/31069350-joana-arteaga", "userReview": "In the beginning of the book Grace has very low self esteem and seems a little depressed. I imagine Grace to be very similar to Bella from Twilight. By the end of the book Grace is like a whole different person. She is more confident, happy and appreciates all the people that love her. It takes a lot for her to get there though. First she meets an old woman and man that want to hire her and then two men that want to date her all in one day. They all seem to be keeping secrets from her though and when Gracie finds out that there are angels and demons on earth she doesn't know who to trust. It is up to Grace to figure out what is good and what is evil and make her life better. I wasn't a big fan of Gracie but I really liked the story because it's about getting a second chance to do your life over again and make better choices."}, {"userName": "Kirstie", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/13704387-kirstie", "userReview": "I have often thought about what I would tell myself if I could go back in time...If I could do things differently...By goodness I certainly would tell me to be less self absorbed and appreciate what gifts I had in the palm of my hands.An old woman, bitter and angry at life,is given the opportunity to go back and live a more fruitful life not just to make her own life better...but for the bigger picture. This masterful paranormal romance is so well written that it takes its reader on a journey of self discovery, that is thought provoking and often emotionally challenging. All I can say is thank goodness that there is more to come...I cannot wait to see what Ms Temple has in store for Gracie! A absolutely fantastic read!"}, {"userName": "Jordan", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/14356583-jordan", "userReview": "[ When Merc took Gracie driving with alcohol, I was like this boy is bad news. I don't like him....Ha!  (hide spoiler)]"}, {"userName": "Diana", "userReviewDate": "Sep 25, 2013", "userURL": "http://www.goodreads.com/user/show/6036263-diana", "userReview": "If you could see where you are forty years from now what would you change? Gracie is believable, her struggles are real. The supernatural beings that come into play keep this book moving with twists and turns. They are described in detail that make you see them as you read about what they are doing. I read somewhere that this is the author's first book, if so, she is a talented writer. This book will keep you wonder what happens next, and who the good guys really are!"}, {"userName": "Kirsty", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/19893306-kirsty", "userReview": "Illuminating Gracie is such an amazing book. It's full of suspense, humor and a beautiful message which is developed by the end. The story is so gripping it was actually really hard to put the down. The characters are so well developed that they feel real and you can't help but feel for them. I would highly recommend this book to anyone!!"}, {"userName": "Kathryn Svendsen", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/16178383-kathryn-svendsen", "userReview": "This was very much a good vs evil fantasy novel where the main character is flawed and needs to work through her “inner demons” in order to become the person she truly is inside. The battle is a spiritual one fought between angels and demons. Gracie is a teenager with some serious psychological issues of low self-esteem, obsessive-compulsive disorder and probably some depression. She has few friends and feels deserted by her parents who have gone to live for a year to Kuwait so her father can work at a civilian assignment, leaving her to live with her brother and sister-in-law at the bed-and-breakfast that they run.The book claims to be a Christian Young Adult Fiction book based on Matthew 5:16 “…let your light shine before others, that they may see your good deeds and glorify your Father in heaven”, and the book does indeed convey that thought. However, in this book, the angels lie to Gracie “for her own good” but according to the Bible, lies are not condoned even in the Ten Commandments, so in my opinion, I would not classify this as a book of Christian fiction, but rather fantasy.I thought that Grace was a fairly realistic character. I liked her because she was flawed. She had many of the same flaws that are common to many of us at one time or another – a lack of self-confidence, poor self-image, anxiety, low self-esteem. She also experienced some deeper psychological issues. Through Grace’s experiences with the angels and demons, she learns to rely on her heart and the strength within herself, allowing who she really is to shine forth. When she does, the beautiful person she really is can be seen, “It was if I’d spent my life being slightly out of focus and then, through some magical or divine intervention, my knobs were turned and my image sharpened and perfected.”There were two parts to the prologue that at first didn’t make a lot of sense until I started reading the first couple of chapters into the book, when things started connecting together. The book moved along a quick pace and kept the reader guessing as to what might happen next. Being a fantasy novel, anything could happen from things appearing out of nowhere to beings being able to fly.This was an interesting novel that could generate a lot of discussion about what would happen if you could do things over again. I gave it a rating of three stars.Thank you to the author Lisa C. Temple for providing a free copy in exchange for a fair and honest review. I was not required to provide a positive opinion. All thoughts are my own."}, {"userName": "Danielle R'dson", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/11994157-danielle-r-dson", "userReview": "More like 3.8 starsThis book was quite good. However, my main problem with it is that it was a bit too slow in pace for me. It took too long to get to the action. But when the action finally came, it was pretty freaking great. And the ending! Great twist, though I'm a bit confused by it. The book was also a bit predictable to me (except for the twist). I kinda knew what was going on from the beginning. The main thing that makes this book good is the main character, Gracie. She's so funny and relatable, and she's got a nice strong voice. I love that the reader was aware of all of Gracie's faults and insecurities. It made her more realistic. There's also some great character development for her. In the beginning, she's an insecure, paranoid mess, but by the end, she's gained a good deal of confidence in herself. So yeah, I recommend this book to anyone that's looking for a nice motivational read with a good message. And I'm definitely looking forward to the next book in this series, whenever it comes out."}, {"userName": "Angie", "userReviewDate": "Oct 10, 2013", "userURL": "http://www.goodreads.com/user/show/10209729-angie", "userReview": "This book really made me think....about what I would do different if I could see myself as an elderly person, about how I treat others (and myself) now and about how I think about myself. I struggle with self-esteem and it was refreshing to see my 17-year old \"self\" portrayed. I remember struggling with my weight...and I weighed all of 115 throughout high school (can I please go back!!). Gracie overcame some of her issues and I think seeing herself elderly will help shape her into a kinder more confident adult. I seriously hope that Lisa is working on a sequel to this book. I whole-heartedly recommend this book to anyone!!!!!"}, {"userName": "Alicia Johns", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/22431150-alicia-johns", "userReview": "This is a fantastic read. I couldn't put it down. Intelligent, funny and heartrending, all at the same time. The main character, Gracie Bennett, is so believable because she is \"every girl\". Her honesty and humor make the book something very special. Dialogue is sharp and fresh, and the author does a wonderful job in drawing each character and scene. This would make a great book club book and I intend on asking my daughter's English dept. (my daughter is 17), to put it on the reading list at the school."}, {"userName": "Laken", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/10566121-laken", "userReview": "3.5 Stars"}], "description": "As an old woman's lifeless body lies on a cold stone floor, her soul stands before an angel who offers her a miraculous opportunity: the chance to do it all again. But that is easier said than done. In order to change the path her life has taken, she must put aside years of self-loathing and pain, so she can help the young girl she once was become the woman she should have been. At 17 years old, Grace Bennett is a bitter young woman. Though blessed with a loving family, looks and brains to spare, she hides her light under a bushel, spending most of her time in the darkness of her mind with little more than sarcasm and self-pity to keep her company.But things are about to change for Grace. While delivering food for her family's bed and breakfast, she turns onto a desolate dirt road and drives straight into her destiny.It's on this isolated country lane that the damaged girl meets a strangely familiar old couple and two mysterious young men. Together the group fights the demons that surround Grace, and they teach her what it means to let her light shine.\"Illuminating Gracie\" is, at once, a metaphorical tale of the fight between good and evil and a spiritual saga of one girl's journey from darkness into the light. If you liked \"Twilight\" and \"The Hunger Games,\" you will love the story of Gracie.", "title": "Illuminating Gracie", "url": "http://www.goodreads.com/book/show/18087897-illuminating-gracie", "average": 4.08, "cover": "https://images.gr-assets.com/books/1374469570l/18087897.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/2975312.Lisa_C_Temple", "name": "Lisa C. Temple"}], "type": ["Fantasy", "Young Adult", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/18087897-illuminating-gracie", "http://www.goodreads.com/book/show/19279485-illuminating-gracie", "http://www.goodreads.com/book/show/23266296-untitled"]}