{"ratings": 245, "userreviews": [{"userName": "Ms. Yingling", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "E ARC from Edelweiss Above the TreelineMamie enjoys spending the summer of 1969 hanging out with her best friend and next door neighbor, Buster. They play with her cat, Campbell, watch television when they can, read in the cool basement, or more often, run around outside until dinner time. Mamie is enthralled with the upcoming NASA project, and has decided that she likes astronaut Michael Collins more than Neil Armstrong or Buzz Aldrin, and continues her class project of writing a letter to an astronaut even though it's summer vacation. She finds it a good way of dealing with the stresses in her life. Her father thinks the NASA mission is a waste of money, but her mother wants to have a Launch Party. When her father says that she can't, it's the last straw, and her mother packs a bag and goes to stay with his sister. After a couple of days of awkwardly tending to Mamie, her father also goes off to try to reconcile with her mother. Mamie is left in the care of her older sister Bess, who is either sleeping or hanging out with her boyfriend Vinny, and even older sister Eleanor, who has her own apartment and works as a secretary. Mamie isn't too worried about being on her own, and doesn't want Buster to tell his mother. Instead, the two research Apollo 11, and Mamie plans her own party. As exciting as the moon walk is, it also is an event that shows how much life is changing in Mamie's world, and all around her. Strengths: The details of everyday life in 1969 are absolutely perfect. THIS is what we need in historical novels. The constant battle over Froot Loops (How are they better than Cap'n Crunch?), the insistence that children need to be outside all day, the phone numbers written on the side of the phone, the details of watching the NASA coverage (Buster's father works downtown, so will go to the appliance store to watch!), and the idea that a 16 year old who sleeps all day is perfectly fine for watching a ten year old while her parents are two states away-- wow. Tang. Erector sets. Hoop earrings. One fan in the house that moves from room to room. This book used more details to good effect than any I have read recently. On top of that, the story was pitch perfect as well. Mamie's mother is tired of being at home, tired of having to ask permission, and her father was just confused about this. It had always been that way! Why isn't it working now? Told through Mamie's eyes, and including lots of details about the moon launch and talk, this is a fantastic slice of red and blue frosted life at a particular moment in time. Weaknesses: I'm not a fan of epistolographic novels involving famous people (Dear Hank Williams, and it just seems like there are others), but this had such great details about daily life that it won me over. Also, the pitcher for the Tang on the front cover is not quite right. There were about 400 million promotional Tang pitchers, and I'm betting Buster would have had one!What I really think: ADORED this. Buying two copies because it is so perfect for the 1960s unit one of my teachers does."}, {"userName": "Ellen", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/226292-ellen", "userReview": "I was about the same age as Mamie when the first astronauts walked on the moon, so reading this book was a stroll down memory lane for me. Like Mamie's, my parents told us we had to play outside all day, every day, in the summer and I don't remember ever being bored. Mamie and her best friend and next-door neighbor Buster played together every day and spent a lot of time at the library learning everything they could about that summer's mission to the moon. Told in a series of letters to Michael Collins, the third astronaut on the mission who stayed on the ship while the other two walked on the moon, Mamie pours out her heart and she broke mine a little with her candor and bravery in what was a difficult summer for her. A love letter to friendship and to those who stay behind with the ship, this was the balm I needed for the rough summer I've been having. (A big thanks to Sonia for the recommendation!)"}, {"userName": "Anna", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/24339207-anna", "userReview": "[I loved how he was a true man and pursued his wife when she ran away. And then they calmly found a way to resolve their problems and stay true to their marriage vows. (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/1748363-sarah", "userReview": "I really enjoyed this. As historical fiction for children goes, it was so refreshing to read a story that was tied to the specific time, with period details, and a historical event, that was not Colonial America. And I really liked how it was a part of the story. Regarding one aspect of the story: I think today's readers' minds will boggle at kids being left alone, and honestly even as a very lax parent I thought \"wait, what? why is no one making sure someone is there?\"I thought her feelings were so real and I always enjoy a story told through letters. Recommended listening while reading this book: Public Service Broadcasting's \"Race for Space\", which incorporates historical audio related to the space race and Apollo 11 into their music."}, {"userName": "Hoover Public Library Kids and Teens", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/2775666-hoover-public-library-kids-and-teens", "userReview": "What begins as a simple school assignment (write a letter to one of the moon landing astronauts) quickly becomes a young girl's coping mechanism for family drama."}, {"userName": "Kel", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/9598370-kel", "userReview": "If you read this book: you'll not only know who the third astronaut was during the first landing on the moon, but you'll think about writing him a few letters, and - more than anything - want to send Mamie a whole stack of mail. And want a friend like Buster. And (regrettably) be reminded that Tang existed.The facts that: the book is fiction, set in 1969, Mamie doesn't exist and I haven't seen Tang since the 80s are all minor points. The feelings remain, as does the beauty of the story.'I Love You, Michael Collins' is one of those rare gems of a novel that not only discusses the fears, hopes and relationships of 10 year-olds (and associated humans), but does so with humour, outstanding voice, and respect for the range and scope of their experiences and feelings.The pivotal importance of your best friend (and particular enthusiastic applause for a girl-boy best friend pairing!), dependability, communication and loyalty are neither sugar-coated nor avoided. Baratz-Logsted doesn't take the easy plot twists either, or escapes, and the novel is all the more exceptional for it.In terms of wordcraft, Baratz-Logsted approaches the fears of Mamie brilliantly, with a deft use of epistolary (for the entire novel), interwoven with historical phrasing and nuance which only highlights the depth of the characters and fundamental relationships in Mamie's orbit. The characterisation of Mamie is skillfully crafted; her differences are revealed in passing, (sometimes with hilarious, sometimes stinging, asides), her motives believable, her pain all the more devastating as a result. I admit it. This book made me cry. It also made me laugh, had me run my fingers over the cover and angle it to better catch the light, remember my own best friend at age 10, and put this to the top of my list for gift-giving this year. I don't care how old you are, this book is humanity, beauty and sheer wonder."}, {"userName": "Kris", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/1363258-kris", "userReview": "I loved it. I am also fascinated my the moon landing. The premise drew me right in. This is a great read. Mamie is a strong female character. I love the friendship she has with Buster and his enjoyment of Tang."}, {"userName": "LeeAnn", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/30912428-leeann", "userReview": "3 stars. Ah, letter writing, the social media of Mamie's day and one that didn't involve sharing the pouring out of your guts with the world. Unless, of course you are a character in a book. Yet I don't think it was Mamie sharing her day to day life--including family dysfunction--in this way was what threw me out of the story several times. We all need a way to vent on occasion and pouring out our confused emotions to a stranger, one we will never meet, can seem much \"safer\" than doing so with someone we know. Rather, it was the \"As you know, Bob--or in this case, Michael Collins\" style of storytelling the letter device made unavoidable when it came to providing the necessary background information. I'm hoping readers who didn't live through those historic events won't find it so distracting because the overall story is good. And besides, I have a soft spot myself for Michael Collins."}, {"userName": "Barbara", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/1222379-barbara", "userReview": "This one is a 3.5 for me. For those who think that teachers and their assignments have little impact outside of the classroom on their students, this book provides ready evidence to the contrary. After her teacher assigns the class to write to their favorite astronaut, ten-year-old Mamie decides to write to Michael Collins while the boys write to Buzz Aldrin and the girls write to Neil Armstrong. For reasons that will become evident over the course of the book, Mamie feels a strong connection to Collins who will remain with the space ship while the other two men will walk on the moon. Although she receives no reply to her initial letter and even after school ends for the year, she continues to write to the astronaut, pouring out her heart and revealing the troubles that plague her family as her parents fight and separate. It's a good thing that Mamie has a bet friend, her next door neighbor, Buster, with whom she spends her free time. Buster is an avid reader and someone who is curious about everything, even space and rockets. Because Mamie's story is told through her letters to Michael Collins during the summer of 1969 as the world prepares for this groundbreaking event, readers are able to hear her voice clearly and read between the lines about some of her feelings. While there are points in which that written voice seems too mature and sophisticated and too grammatically correct for a ten-year-old, the author excels at painting a vivid portrait of 1969 with Tang as a drink served as a tribute to the astronauts as well as certain foods, clothing, music, news coverage, effectively capturing a time when the whole world held its breath as the first men walked on the moon. And yes, I still remember the distorted voice of Armstrong as he moved across that landscape after my father insisted on my brother and me getting out of bed to behold history in the making. This title is charming in many respects, providing a glimpse into the way things were way back in 1969. The judgmental attitudes of many toward those who dressed differently from them or held beliefs different from them when it came to politics or the role of women in the home are captured vividly here, leaving readers to form their own impressions from the hints that are dropped. As I always tell my students, those were turbulent times. As her family seemed to be falling apart and everyone was deserting her, I'm grateful that at least Mamie had Buster. There is a lot of truth to the fact that it's those heroes who simply quietly go about doing their jobs and staying with the ship or holding down the fort on the home front who go unrecognized but deserve their own measure of recognition and appreciation."}, {"userName": "Carolyn Deas", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/7228231-carolyn-deas", "userReview": "I Love You, Michael Collins is not a true story, but I'm sure it hits home with a lot of people when it comes to the \"celebrities\" that they look up to.In this story, Mamie, is directed to write a letter to one of the three Apollo 11 astronauts. With most students picking Neil Armstrong or Buzz Aldrin, Mamie takes a different route and writes to the main pilot, Michael Collins. Mr. Collins is almost never mentioned by anyone (most people don't know who he even is) but Mamie takes it upon herself to let him know just how great he is.A one time assignment to write a letter becomes a passion for Mamie. She writes him a letter almost everyday until the day he lands safely back on earth. She writes about her family problems, her best friend, Buster, her cat, Campbell, and asks him all sorts of questions about his life and family.What I love most about this book is that she is rooting for the underdog. I'm sure there is a better way to say that, but I can't think of one currently. Mamie learns everything she can about this man and comes to find out that it was a struggle for him to get to where he is. She also realizes that he may be the most important one on the Apollo 11 mission; without him, no one will get home.The emotions that Mamie goes through during the story are vivid in her messages to Mr. Collins. Haven't you ever just wanted to tell someone everything that's on your mind? Although she had never met this man and he didn't get most of her letters before his trip to space, she feels confident that he's reading them and that he cares. Back when a time when there was no social media to connect with people that we admire, letter writing was the only way to go and there are no \"read receipts\" for snail mail.I thought that some of the issues that Mamie had to deal with, like both of her parents more or less abandoning her and her sisters being unaware of how to take care of a ten year old were a little too much for this story. I understand she needed something to write to Mr. Collins about but it just seemed weird and out of place and something that wouldn't actually happen, even in 1969 (but I could be wrong).If you love space, diaries, the moon, and kids becoming friends with adults, then this is a book for you. It will make you smile, laugh, and even cry a little but it's a story with heart."}, {"userName": "Terri Faulkner", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/52009804-terri-faulkner", "userReview": "I Love You, Michael Collins is a tender novel set in a richly detailed 1969 small town America, a time in which TV dinners were enticing fare, debates about who was the better Beatle raged, and the nation was captivated by the Space Race and the Apollo 11 mission to the moon. Mamie is the 10-year-old protagonist, the youngest of three sisters (including Eleanor and Bess, all of whom were named after the First Lady at the time of their birth). Her best friend is the boy next door, Buster, and their steadfast friendship guides the story through the events surrounding the launch of Apollo 11 in July, 1969. Mamie continues a school-year class assignment in which she was supposed to write a letter to one of the Apollo 11 astronauts. While her classmates chose to write to the better-known Neil Armstrong or Buzz Aldrin, Mamie chose to write to Michael Collins, the third Apollo 11 crew member, the one so frequently overlooked and the one who must stay with the ship instead of walking on the moon. The book is written in letter style, with Mamie describing her family, her world and the discord between her parents in long letters she send to Michael Collins. She is also fearful for Michael Collins, aware of the very real dangers he chooses to face as an astronaut and the courage he must be summoning to continue forward. Her voice is clear and convincing as a sometimes silly-sometimes wisely observant child, and the parallels between her choices and those of Michael Collins will not be lost on young readers. This is a solid choice, a delightful first-person account of friendship, anxiety and national pride."}, {"userName": "The Dusty Jacket", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/56572994-the-dusty-jacket", "userReview": "It’s 1969 and the day before the last day before summer vacation. Ten-year old Mamie Anderson and her class have to write a letter to one of the astronauts of Apollo 11. Mamie chooses Michael Collins because, quite simply, no one else did. After all, where is the glory for the one who gets left behind?Through a series of letters written to Michael Collins, Mamie shares details about her life, her family, and her best friend, Buster. We even get to learn more about Michael Collins, the Apollo 11 Mission, and the dangers of space travel. As the time for the moon landing draws closer and as Mamie’s world pulls apart, she’s left asking, “Doesn’t anyone stay with the ship anymore?”This is an enchanting and absolutely delectable book to read. Was it sentimental and nostalgic? You bet! I couldn’t get enough of Mamie’s references to Magnavox color TVs, Erector Sets, TV dinners served in compartmentalized metal trays, and doing research at the library by pulling periodicals. And despite the racial riots and Vietnam War, for one rare moment in time, the world was united in witnessing a truly extraordinary event. Everyone came together not as multiple races, but as one race—the human race—to watch a man from the planet Earth set foot on the moon for the very first time.I loved experiencing the awe and thrill of the lunar landing through the eyes of a 10-year old girl who decided to write to the astronaut who she considered to be “the best one”, not because he walked on the moon, but because he stayed with the ship so that he could bring everyone safely back home again."}, {"userName": "Sarah Peddicord", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/27446377-sarah-peddicord", "userReview": "You may not know it, but Michael Collins is an American Hero. When Apollo 11 went to space, he stayed with the ship while Neil Armstrong and Buzz Aldrin took one small step for man. It all begins when Mrs. Collins asks her class to write letters to the three brave astronauts. Every boy in Mammie's class wants to become an astronaut when they grow up and all the girls want to marry one (except Mammie.) Mammie decides to write her letter to Michael Collins because no one else decided they would. She continues to write letters throughout the summer explaining how life went from bad to worse. Will the astronauts survive the moon landing and return to Earth? Will Mammie survive a summer that begins with her mother leaves her dad and all the curveballs that come after? 1. I love how the entire story is written in letters. It's exciting to read and contains so many small moment stories.2. There are so many one-liners that stuck with me throughout the story. I could fill half of my \"best line ever\" board from this book alone.3. True friends are worth gold. I was encouraged by a story where the narrator only has one friend. I know I felt that way growing up. It can be lonely. Or you can learn to recognize the luck of having one good friend.I only wish I had bought more copies for #mocknewbery this year! Sometimes you lose hope and watching a miracle can give you the courage you need to keep moving forward."}, {"userName": "Titis Wardhana", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/1647581-titis-wardhana", "userReview": "It's ok to be different...Kelas Mamie mendapat tugas untuk menulis surat kepada salah satu astronaut yang akan pergi ke bulan. Semua anak laki-laki menulis surat ke Buzz Aldrin, dan semua anak perempuan ke Neil Armstrong. Sedangkan Mamie malah ingin menulis surat ke Michael Collins yang tidak menginjakkan kaki ke bulan, tapi tetap berada di pesawat dan mengorbit. Seisi kelas menertawakannya. Ketika guru Mamie bertanya lagi apa cita-cita mereka, semua anak laki-laki menjawab ingin menjadi astronaut, dan semua anak perempuan ingin menjadi istri astronaut #haha. Hanya Mamie yang menjawab tidak tahu ingin menjadi apa. Selama liburan, menulis surat dan menceritakan peristiwa sehari-sehari yang terjadi di rumahnya kepada Michael Collins menjadi kebiasaan rutin Mamie.Buku ini berbentuk surat yang ditulis Mamie kepada Michael Collins. Pada awalnya, keluarga Mamie terlihat seperti keluarga yang biasa-biasa saja, tapi seiring dengan semakin mendekatkan peluncuran roket ini, semakin terlihat kalau ayah dan ibu Mamie tidak harmonis. Sedangkan Bess, kakak Mamie, yang berusia 16 tahun, setiap malam pergi dengan pacarnya, pulang larut dan tidur sampai siang. Tapi beruntunglah Mamie karena memiliki sahabat sebaik Buster yang sangat loyal dan memahami Mamie. Menyenangkan sekali membaca persahabatan Mamie dan Buster di sini.Pas baca gw sampai google soal Michael Collins dan ternyata beliau masih hidup."}, {"userName": "Lauren", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/10292734-lauren", "userReview": "\"DOESN'T ANYBODY STAY WITH THE SHIP ANYMORE?\" - Favorite line!Very cute little historical fiction novel about friends and broken families and the Apollo 11 mission. I particularly enjoyed the framing device, as a one-sided epistolary novel, with all the letters written to the oft-forgotten third man on the Apollo 11 mission, Michael Collins, who stayed with the ship. It dragged a little at times and students who already know a lot about the Apollo missions will find some of the explanations tedious. Recommended: I'd give it to kids who like character-driven historical fiction. The main character reads pretty young so I'd say about 3rd-6th graders will find the most to enjoy. I'd give it fans of The Wednesday Wars, Twerp, The Seventh Most Important Thing, or Neil Armstrong is My Uncle and Other Lies Muscle Man McGinty Told Me."}, {"userName": "Danielle Hammelef", "userReviewDate": "Sep 08, 2017", "userURL": "http://www.goodreads.com/user/show/966359-danielle-hammelef", "userReview": "Told in a series of letters to astronaut Michael Collins, this book shows the reader how a young girl deals with family, friends, as well as growing up. I enjoyed the voice of the POV character and found her to be lovable, however, at times I felt this was not a 10 year old speaking, but an older tween. Some of the ideas and thoughts she had seemed too old for a fourth-grader. Overall, I am happy I got to know Mamie and Buster and still have a smile on my face because the ending is so perfect. Michael Collins and Mamie turn out to have more in common than just the love of the space race.Spoiler alert: Even though this was set in 1969, leaving a child home alone who is only 10 for more than just a quick errand or awaiting your return from work after school, is unrealistic and scary to me as a parent. I would never just leave without talking to the responsible person who is promising to be there for my child; based on the loving relationships this author must feel are important for families in her own life (Mamie's own parents are loving and caring people in this book), the leaving seemed too much out of character. Despite this, however, families are portrayed as important parts of our lives, and working to keep them strong and together is worth every tear."}, {"userName": "Sam", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/1559491-sam", "userReview": "Huge thank you to Raincoast for this ARC!I read this book in a day, and my goodness is it adorable. This book is the story of Mamie, a young girl who has a school assignment wherein she must write letters to an astronaut. While every other kid in her grade selects Neil Armstrong or Buzz Aldrin, Mamie selects Michael Collins, the man responsible for orbiting around the moon. Through a series of letters, Mamie pouring her heart and soul, sharing all her feelings to Michael Collins. Since this story takes place in 1969, a lot of this story looks at the space race, Vietnam, and other historical events that Mamie is witnessing through television. Each letter shares a bit more about what is personally going on with Mamie, from her parent's falling out, to her sisters growing up, to her feelings for her best friend Buster. This story is so sweet, and so sad at the same time. It's also just a very quick read as Mamie is so easy to love as a character.This short and sweet read is for anyone who loves middle grade contemporary. Mamie is delight and her letters will easily pull you in."}, {"userName": "Marathon County Public Library MCPL", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/9426686-marathon-county-public-library-mcpl", "userReview": "With the impending historic walk on the moon, students in ten-year-old Mamie’s class are given the assignment to write to one of the U.S. astronauts on this mission. With all the other students picking Buzz Aldrin and Neil Armstrong, Mamie makes a split-second decision to pick Michael Collins, who will be staying with the ship. When school is out for the summer she continues to correspond with him, telling him about her life and what is happening in her family. As the situation in her family appears to get worse instead of better, she observes the similarities in their lives. Mamie’s story is told through her letters to Michal Collins in this enjoyable tween novel. Anyone who enjoys novels with a diary-like format and a strong, likable female protagonist will especially enjoy reading this book.  Sharyn H. / Marathon County Public LibraryFind this book in our library catalog."}, {"userName": "Yapha", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/3722795-yapha", "userReview": "On the last day of school, Mamie's sixth grade class is given the assignment to write a letter to one of the three astronaut's going to the moon that summer. Everyone else picks either Neil Armstrong or Buzz Aldrin, but Mamie picks Michael Collins, because to her he is \"the best one.\" Although school is out for the summer, she continues to write him letters, talking about her home life which seems to be falling apart. Her mother is fed up with her father and leaves. Her father goes after her mother to try to get her back, leaving Mamie at home with her less than reliable teenage sister. Thankfully, Mamie's best friend Buster lives next door and is more reliable than anyone else in her life right now. Together they spend the days leading up to the moon landing learning all about the mission, while Mamie also learns a lot about herself and what is going on with her family. Told completely in letters, this is an engaging piece of historical fiction and an excellent slice of life of a middle class family in 1969. Recommended to grades 4 & up, particularly those with an interest in space travel."}, {"userName": "Lynn", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/935500-lynn", "userReview": "Mamie starts writing to astronaut Michael Collins as a class assignment but continues her letters to him as the Apollo 11 Moon walk mission takes place. Her own life is experiencing a major upheaval and Mamie's struggle to understand her family's relationships and her own strengths and growing awareness of the world are revealed in the letters.The real strength of this sweet book is the nuanced portrayal of characters and relationships. Mamie's voice is well crafted and her growing understanding of her family and her own abilities unfolds well.I did think the pacing had some issues as the story slows noticeably when big chunks of historical and scientific information are brought in. I did love some of the great details like Tang and chicken baked in cream of chicken soup and how the kids loved the TV dinners because of all the little compartments ;-)"}, {"userName": "Justinian", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/66498491-justinian", "userReview": "2017-12 - I Love You, Michael Collins. Lauren Baratz-Logsted (Author) 2017. 240 Pages. Euphemia picked this up at the library because it has a Saturn V on the back and an Apollo Command Module on the front. She sat down one day and started reading … she finished this book … and made a point of finishing it in one day. She then told me to read it. That I would like it. She was right. It was a very good book. A work of fiction built around a real life journey. I cried openly at the end, moved by its sweetness and its message. The audacity of Project Apollo and the way it inspired everyday people …especially children growing up in a tie of war (Vietnam) and political chaos. All of this and the look inside the struggles of an outwardly looking normal family. A winner."}, {"userName": "ula", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/4998331-ula", "userReview": "[permasalah keluarganya rasanya antiklimaks (hide spoiler)]"}, {"userName": "L", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/40107783-l", "userReview": "I thought Lauren Baratz-Logsted's glimpse into the summer of 1969 from a ten year old girl's view point was well done. The letter format works well in this situation and allows the main character, Mamie to express all of her feelings and experiences without worrying too much about being judged. With an astronaut as a confidant, Mamie is able to survive her family being turned upside down, and even being left on her own. I think many children will enjoy the book, especially if they can look to the story rather than the title. (I think it may throw off some kids who would enjoy the story, thinking it's a mushy story.)I received an ARC copy from SLJ, all opinions are my own."}, {"userName": "Cassandra Childrens", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/80528018-cassandra-childrens", "userReview": "This book just made me cry a little bit. Introducing kids to the moon landing through a little girl writing letters to Michael Collins, the only astronaut on the Apollo 11 mission who won't get to walk on the moon. Mamie thinks Michael Collins is the best astronaut on the mission because \"someone has to stay with the ship\" and she proves it by writing him letter after letter. Her best friend Buster is more scientific minded than Mamie so he is able to explain everything to her, thus explaining it to the reader. Mamie's home life is not ideal, especially this summer. Very moving overall, definitely good for boys and girls."}, {"userName": "Cassandra", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/7984244-cassandra", "userReview": "This book just made me cry a little bit. Introducing kids to the moon landing through a little girl writing letters to Michael Collins, the only astronaut on the Apollo 11 mission who won't get to walk on the moon. Mamie thinks Michael Collins is the best astronaut on the mission because \"someone has to stay with the ship\" and she proves it by writing him letter after letter. Her best friend Buster is more scientific minded than Mamie so he is able to explain everything to her, thus explaining it to the reader. Mamie's home life is not ideal, especially this summer. Very moving overall, definitely good for boys and girls."}, {"userName": "Jennifer Meadows", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/8314482-jennifer-meadows", "userReview": "I really liked this book. It will be a lovely read for my ten-year-old daughter. I think I'll save it and give it to her to read at the start of summer (since the events of the story all take place during the summer of 1969). This book really did a great job of capturing the excitement of what it must have been like to follow Neil Armstrong, Buzz Aldrin and Michael Collins as they set out to be the first men to make it to the moon. And while not delving too deeply into those topics, it does give a solid nod to other social issues of the time. I enjoyed it and learned a lot along the way."}, {"userName": "Mary Louise Sanchez", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/2315127-mary-louise-sanchez", "userReview": "A school assignment to write to one of the three astronauts going to the moon in 1969 becomes more to ten-year-old Mamie (named for a First Lady) as she continues to tell him the details of her life. They include her relationship with her best friend, Buster; her parents' troubled marriage; and her indifferent seeming older sisters. Mamie knows Michael Collins must stay with the ship, and she relates this to herself when the people in her life seem to be abandoning her and literally do the day the astronauts landed on the moon.The details of the moon landing brought back great memories. The theme that came out of this story was powerful!"}, {"userName": "Virginia Walter", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/2102711-virginia-walter", "userReview": "When 10-year-old Mamie's class is assigned to write letters to the Apollo 11 astronauts who are about to launch their rocket to the moon, Mamie is the only one who chooses Michael Collins. This epistolary novel is told through her letters to the astronaut on that expedition who didn't walk on the moon because his job was to stay with the spaceship. Mamie continues to write to Collins after school ends, telling him about Buster, her neighbor and best friend, about her two older sisters, and about her parents, whose separation may be leading to a divorce. This is a nice mixture of recent U.S. history and family issues from a child's perspective."}, {"userName": "Megan Marvel", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/4095840-megan-marvel", "userReview": "This book would make SUCH a great pick for a book club. There is so much to unpack within the novel. Discussions could revolve around historical fiction, the space race, popularity, family (separation/siblings), friendship, responsibility, and much more. Poor Mamie's family desert her and leave her home by herself, each thinking someone else will take responsibility and look after her. This occurs during the momentous time of the moon landing. Mamie's story is paralleled with her newfound hero, Michael Collins, who, like Mamie, is the one left behind."}, {"userName": "Isabel", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/3224477-isabel", "userReview": "In BHHs, you are often asked, “What does the author think you know?” In I Love You, Michael Collins, Baratz-Logsted drops the reader into the 1960s during the era of the US’s space race against Russia to be the first to get to the moon. The author alludes to the politics of the era as well as the challenges of being female in the 1960s. This book is a great example of choosing a setting that matches the struggle of the character herself. It’s also written in epistolary (letter) style which means the story is told to us even though the character is writing to an astronaut. This is a surprisingly complex text considering that it is also appropriate for a younger audience.You can go as deep or shallow as you like with this story.Dive in!"}], "description": "It’s 1969 and the country is gearing up for what looks to be the most exciting moment in U.S. history: men landing on the moon. Ten-year-old Mamie’s class is given an assignment to write letters to the astronauts. All the girls write to Neil Armstrong (\"So cute!\") and all the boys write to Buzz Aldrin (\"So cool!\"). Only Mamie writes to Michael Collins, the astronaut who will come so close but never achieve everyone else's dream of walking on the moon, because he is the one who must stay with the ship. After school ends, Mamie keeps writing to Michael Collins, taking comfort in telling someone about what's going on with her family as, one by one, they leave the house thinking that someone else is taking care of her—until she is all alone except for her cat and her best friend, Buster. And as the date of the launch nears, Mamie can't help but wonder: Does no one stay with the ship anymore?", "title": "I Love You, Michael Collins", "url": "http://www.goodreads.com/book/show/31145091-i-love-you-michael-collins?from_choice=true", "average": 4.11, "cover": "https://images.gr-assets.com/books/1497304771l/31145091.jpg", "reviews": 76, "authors": [{"url": "https://www.goodreads.com/author/show/27212.Lauren_Baratz_Logsted", "name": "Lauren Baratz-Logsted"}], "type": ["Historical", "Childrens", "Childrens", "Family", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/31145091-i-love-you-michael-collins", "http://www.goodreads.com/book/show/35795963-i-love-you-michael-collins", "http://www.goodreads.com/book/show/34408212-i-love-you-michael-collins", "http://www.goodreads.com/book/show/34845795-i-love-you-michael-collins", "http://www.goodreads.com/book/show/7823311-the-twin-s-daughter", "http://www.goodreads.com/book/show/6202108-crazy-beautiful", "http://www.goodreads.com/book/show/6909640-the-education-of-bet", "http://www.goodreads.com/book/show/406670.The_Thin_Pink_Line", "http://www.goodreads.com/book/show/4314911-annie-s-adventures"]}