{"ratings": 432479, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "\"How much money did you get from the Clutters?\"\"Between forty and fifty dollars.\"\nTop Picture Hickock, Richard Eugene (WM)28 KBI 97 093; FBI 859 273 A. Address: Edgerton, Kansas. Birthdate 6-6-31 Birthplace K.C., Kans. Height: 5-10 Weight: 175 Hair: Blond. Eyes: Blue. Build: Stout. Comp: Ruddy. Occup: Car Painter. Crime: Cheat & Defr. & Bad Checks. Paroled: 8-13-59 By: So. K.C.K.Bottom Picture Smith, Perry Edward (WM) 27-59. Birthplace: Nevada. Height: 5-4. Weight: 156 Hair: D. Brn. Crime: B&E. Arrested: (blank) By: (blank). Disposition: Sent KSP 3-13-56 from Phillips Co. 5-10yrs. Rec. 3-14-56. Paroled: 7-6-59.As I write this review, I'm sitting about 60 miles from the Clutter house in Holcomb, Kansas. Holcomb is a small, farming community located just west of Garden City. This is a place where everyone in the whole county not only knows your name, but also has a working knowledge of your family history going back fifty plus years. I usually avoid reading true crime books. I don't want my head filled with tragedy. I want to go about my life with a degree of caution, but not be ruled by the fear I feel such books will instill. I picked up a copy of this book at the Dodge City Library. The librarian at the check out desk, a woman about mid-sixties, slender, elegant, and still attractive ran her finger along the edge of the spine. I noticed a shiver had rolled up her back and rippled her shoulders. She looked up at me with pinched blue eyes and said in a whisper, \"I remember when this happened\". She watched her father put locks on the doors for the first time. The murders became a demarcation line in her life there was life before the Clutter murders, and then there was life after the Clutter murders. Her response surprised me. We live in a time when any crime anywhere in the country is broadcast out to the nation and something tragic that happens in Illinois or in Virginia or Alaska impacts our lives. I would have thought over time some of the significance of the Clutter murder would have been buried under the avalanche of murder and mayhem that the news cycle brings us 24/7. For this community and for all the small communities dotting the map of Kansas, and even in the surrounding states, this was something that wasn't supposed to happen in a small town. This was big city crime that happened in their own backyard. As I talked to people about the Clutter murders most everybody had some kind of physical reaction. They flinched as if they were dodging a blow or took a step back from me or developed a twitch along their jawline. Their eyes gazed through me or beyond me as the fears and anxieties of 1959 came flooding back into their mind. Most of them attributed more deaths to the crime, each of them citing six deaths rather than four. I'm sure they remembered that there was six family members, but two older girls had already left the home to start their own lives. They were not present on that fateful night when their family was murdered. In Cold Blood was required reading in many schools in this region clear up until about the 1970s, so even people who were too young to remember the crime have experienced the tragedy through Truman Capote. In the description above regarding Perry Edward Smith there is a reference to Phillips County. This has special significance for me because I was born and raised in Phillips County. The family farm is located in Phillips County. My Father and I graduated from Phillipsburg High School. My Dad was a sophomore in high school in 1955 when Perry Smith decided to burglarize the Chandler Sales Company in Phillipsburg, Kansas and this seemingly insignificant act was really the beginning of this story. Smith and his accomplice, also Smith, stole typewriters, adding machines etc and left town with their ill gotten goods in the backseat of the car. Later they ignored a traffic signal in St. Joseph, Missouri and were pulled over by a police officer. The cop was very interested in what was in their backseat. They were extradited back to Phillipsburg, where through an open window (image my embarrassment for the law enforcement of my home county) they escaped. Later Perry was caught again and sent back to Phillipsburg where the law enforcement fortunately did a much better job of keeping track of him. Perry Smith received 10 years in the Kansas Penitentiary in Leavenworth. Richard Eugene Hickock was already serving time in Leavenworth for fraud. The two met and became friends. The final piece to the puzzle that not only determined the fate of the Clutter family, but also the fates of Smith and Hickock was snapped down in place when they meet Floyd Wells. Wells, serving time for some bit of stupidity, had worked for Herb Clutter back in 1948. He told Hickock and Smith that Clutter was a wealthy farmer, and kept a safe full of cash in his house. Wells was absolutely full of shit. There was no safe. There was no pile of cash. There was absolutely no reason for four people to lose their lives for $40. \nAfter the murders they went to Mexico for a while, but even though they could live cheaply down South the money still trickled through their fingers. After they burned through the goods they had acquired through the Clutter robbery and through defrauding a series of retail stores, they found that working in Mexico didn't pay well either. They came back up to the United States and there was this baffling moment where Perry Smith is reading the paper and sees an article about a family that was tied up and shot to death. \"Amazing!\" Perry glanced through the article again. \"Know what I wouldn't be surprised? If this wasn't done by a lunatic. Some nut that read about what happened out in Kansas.\" WTF? Some nut? How about the original coconut heads that murdered the family in Kansas? Perry does have a moment or two where he weighs what happened in Kansas. \"Know what I think?\" said Perry. \"I think there must be something wrong with us. To do what we did.\"\"Did what?\"\"Out there.\"\"Deal me out, baby,\" Dick said. \"I'm a normal.\"Truman Capote had been looking for the right story for an experimental form of writing he'd been considering trying. He wanted to blend fiction and nonfiction. The Clutter murders struck him as the perfect story to launch this new form of writing. I have to admire his fortitude, for a man of his sensibilities not only spending that much time among farmbillies, but having to befriend them as well. It must have been somewhat of a painful experience. \nCapote in the Clutter homeFloyd Wells eventually comes forward and tells what he knows about the murders. He had always liked Herb Clutter and felt ashamed that what he had told, in a moment of prison bonding, had led to such a vicious conclusion. Without his statement I'm pretty sure that Smith and Hickock would have gotten away with the murders. The slender evidence tying them to the murders would have made it almost impossible to prosecute them. Their sentencing can have only one conclusion...death. As they are being led back to their cells:Smith says to Hickock, \"No chicken-hearted jurors, they!\" They both laughed loudly, and a cameraman photographed them. The picture appeared in a Kansas paper above a caption entitled: \"The Last Laugh?\"When I consider their bravado the last vestiges of any sympathy I may have been harboring for their plight dissipated. This is a beautifully written book. I want to thank Harper Lee for her role in helping Capote bring this book to completion. I'm not sure Capote would have had the perseverance to see it through without her holding his hand. I was surprised about how many connections I have to the events in this book many of which I had no idea until I read them in the book for the first time. I was long overdue to read this book and this experience has certainly convinced me to add more of the classic True Crime genre to my reading queue. This book is legendary not only because of the heinous nature of the crime, but also because Capote was ushering in a new way to tell a story. If you wish to see more of my most recent book and movie reviews, visithttp://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Michael Finocchiaro", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/48483884-michael-finocchiaro", "userReview": "I just wonder why it took me so long to get this masterpiece on my currently-reading shelf. What a breathtaking story! And told in the most amazing novelistic style! The cold-blooded murders in Kansas in 1956 is described by a cold, distant narrator via the interviews of the family, acquaintances, and community around the victims and the the hair-raising stories of Perry and Bobby, the murderers. It is a real page-turner - I couldn't put it down! The descriptions of the youth of all the tragic protagonists is explored from every angle as under a magnifying glass. In Cold Blood kept me thinking that most of the recent murder mystery shows and movies were indebted to this piece of literature (that Capote probably deserved a Pulitzer for but was passed over, helas, in 1965). There is this strange homoerotism between the two murderers (who call each other \"sugar\" and \"honey\") but who both spout homophobic words throughout. Like the lawyers, I felt Richard was the coldest one and Perry the most twisted and tragic. This book is a true masterpiece of the non-fiction novel (even if some of the facts brought out by Capote were disputed) and its narration is stupendous in character development and maintaining an enormous amount of suspense end-to-end. It is even more astounding, because the reader already knows who commits the crime, the novel only elucidates the \"why\" and even that is ambiguous and pathetic. An awesome read.Note that in A Capote Reader, there is a great short essay about the making of movie In Cold Blood where Capote talks a bit about the 6 years it took him to write this masterpiece. (Haven't seen the movie yet :/)"}, {"userName": "Brina", "userReviewDate": "Oct 18, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "In Cold Blood is the new school classics selection in the group catching up on classics for November 2016. Having read Truman Capote's Breakfast at Tiffany's recently and enjoying his writing, I could not wait to read this nonfiction thriller in advance of the upcoming group read. Writing in his relaxing southern style, Capote turns a horrid crime into a story to make the how's and whys accessible to the average American. It is in this regard that I rate this thrilling classic five stars. On November 15, 1959 Richard \"Dick\" Hickock and Perry Smith, on a tip from another inmate, brutally murdered four members of the Clutter family of Holcomb, Kansas. Having heard that the Clutters possessed either a safe or $10,000 cash in their home, Smith and Hickock desired this wealth for themselves so that they could live out their days in a Mexican beach resort. To their surprise and chagrin, the Clutters did not have neither the safe nor the cash, but Hickock had said to leave no witnesses. Crime committed, the pair escaped to a life of continued crimes and violence and believing that authorities would never catch up with them. And in the beginning it appeared that this ill advised lifestyle might actually work. Due to the relentless work of the Kansas Bureau of Investigations (KBI) lead by Alvin Dewey, Hickock and Smith were eventually brought to justice and ultimately given the death penalty. Capote weaves a tale by giving us the backstory of both felons as well as a picture of Holcomb and nearby Garden City, Kansas as an idyllic place to raise a family. The crime changed everything. Families kept their doors locked and did not allow their children to venture far from home. In the surrounding areas, people viewed their lives as a before and after. Inevitably, the Clutter case lead to less community interaction and a beginning of a breakdown of society. Yet by providing the backstories of the felons, Capote allows the the readers to emphasize with their place in society. Dick Hickock was on his way to finishing at the top of his class with a possible athletic scholarship and a degree in engineering. His family could not afford a university education even with the scholarship so Hickock went to work. An automobile accident left him partially brain damaged as his parents maintained that he was not the same person since, and this one incident lead to his adult life of crime. Smith, on the other hand, lead a bleak childhood to the point where readers would feel sorry for him. Coming from a fractured family and only a third grade education, Smith suffered from a superiority complex his entire life. His role in the Clutter murders was the consummation of a lifetime of rejection. The felons came from diametrically opposed upbringings and yet I was left feeling remorse for both. Capote pieced together the crime to the point where I felt that I knew the people of Holcomb as well as the principal players in the crime intimately. This work lead to a new genre that brings together nonfiction and fiction in a way that history feels like a story. Both Capote and his research assistant Harper Lee ended up as award winning authors. Their fictional writing skills allowed for the personalization of this tale and ultimately help change the way many write nonfiction. Truman Capote is one of 20th America's master storytellers, and In Cold Blood is by many considered his opus. His research was detail oriented and allowed him to bring the story of the Clutter murders to the average American home. After completing this five star work painting the picture of the how's and whys of murder, I look forward to reading more of his charming Southern stories."}, {"userName": "Justin", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/2795921-justin", "userReview": "At the beginning, In Cold Blood reads like a classic southern gothic tale. I've read about Harper Lee hanging out with Capote while he put this thing together, and at times it feels like she greatly influenced how it was written. You meet the Clutters who are just the nicest people in the world out working hard and going to school and being awesome people in the town. And, I know there's all this controversy over how the book is written since it adds fictional conversations and thoughts that Capote obviously couldn't have known, but everything is rooted in the nonfiction account of what happened, and I think it adds a deeper layer of connection to the family. I read Helter Skelter in high school, and I remember that book starting out right from the gate with all the details of the murders before diving into the Manson family and the trial. In Cold Blood works more in reverse and saves the details for later, and my God when I got there I didn't even want to read about what happened. It was all so senseless and random. I had a hard time finishing the book after that. I just wanted it to be over. Often beautifully and brilliantly written, sometimes tedious to get through, sometimes way too meticulous with details, sometimes spending a couple of pages discussing cats or a building or something, this book is a classic in the true crime genre. I haven't read a lot of true crime in my reading life, but I've read enough to know that this deserves a spot at the top of the list. Capote does an excellent job laying out the story, and gives the family, the murderers, and the cops an overwhelming amount of description and development. I knew more about the killers than I ever wanted to know, and I want things to go a different direction even though I knew they wouldn't. Now I have to watch the movie, then Capote, then Infamous. This is a story that will be stuck in my head for a while. It's a harsh reminder of the evil that exists in the world, and how fragile our existence on this planet really is. It's also a very detailed account of the senseless murder of most of a family, but I took away a lot of other stuff from its pages, too. Read it."}, {"userName": "Amy Galaviz", "userReviewDate": "Mar 28, 2008", "userURL": "http://www.goodreads.com/user/show/528777-amy-galaviz", "userReview": "After I read it, I looked up pictures of the Clutter family, and just stared for about five minutes. They endured what is probably everyone’s worst fear.Having never heard anything of the Clutter murders prior to reading this book, the experience of reading it was intense, gripping, and suspenseful from beginning to end. Capote, with his impartial writing style, relayed facts and details in such a way as to give a complete character illustration of everyone involved: from each of the Clutters, to the investigators, lawyers, and even the murderers themselves. He did not reveal his personal sentiments or biases, or even presume to know right from wrong. In what he coined a “non-fiction novel,” Capote brilliantly combined the elements of a fictional murder novel with factual journalism and psychological analysis to show the moral dilemmas surrounding the act of murder.In the section about the Clutter family life during their final days before the murders, Capote’s description of their daily routines and habits made what was to come even more troubling. Nancy and Kenyon were going through the typical hardships of adolescence; Nancy had a boyfriend of whom her father did not approve and was the most popular girl in school, while Kenyon was self-conscious, nerdy, and socially awkward. Herbert and Bonnie’s marriage was a bit shaky; Bonnie had a mysterious and fleeting mental illness, and Herbert was very busy with his farming business and did not have much time to tend to her. However, despite their problems, they maintained a strong family bond, were well-liked by the entire community, and we get a sense that things were looking up for them.After the murder takes place, as if to intensify the suspense, Capote does not immediately reveal to us exactly how or why Perry and Dick committed the crime, but instead takes us on their journey as they attempt escape through the deep South while the investigators begin to try to solve the crime. We learn much about these two characters through their interactions with each other, letters, diary excerpts, and interviews with family members. We are brought deep into their psyche, learning everything from their personal hygiene habits to their mannerisms and quirks. In an uncomfortable yet brilliant way, Capote allows us to sympathize with the murderers, if only for a moment. What exactly went wrong with them? Did Perry Smith’s childhood of abuse, neglect, and displacement lead him to have moments of extreme callousness and violence? Dick, who had a seemingly normal childhood and a loving family, was in a car accident which left him with a permanent head injury. Was his head injury the cause of his downfall, or was it some other unknown character defect? Even though they were capable of evil and cold-heartedness, they also had goals and insecurities as well as the capacity for creativity, love, and fear. The murders were a tragic “psychological accident” (according to Alvin Dewey), the collision of two personalities gone terribly wrong with an innocent family who was in the wrong situation at the wrong time.The final section of the book, from their first of many trials to their execution, presents us with the moral dilemmas surrounding the punishment of crime. Capote does not make any definitive conclusions, but poses many questions: Is execution right or wrong? Why the long delay (approx. 6 years) between the guilty verdict and the execution? Was a fair trial possible or necessary, given the horrific nature of the crimes committed? It is impossible to summarize the impact of this book in a few paragraphs, but it will definitely stay with me for years to come."}, {"userName": "Lyn", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "In Cold Blood by Truman Capote was described by its author as a non-fiction novel. The novel was first published in 1965 and at the time this style of writing, perhaps even the template for a new genre, was fresh and new and bold. Almost 50 years later and the disturbing images are as fresh, vibrant and malevolent as when the ink was wet. The style of writing has no doubt inspired generations of writers since, but their imitation has done little to diminish the power of Capote’s work. Whether it was wholly accurate or not is for journalists and scholars to debate, but for the reader, his vision was compelling and his perspective on the crime, and especially as a character study, almost a biography, on the criminals is hypnotic. Critics may take umbrage with Capote’s sympathetic depiction of the killer’s plight, and perhaps such an argument has great merit, since the murderers showed no mercy to their victims, but Capote’s contribution lies in his objective illumination of all the surrounding facts and details of the crime. The author began with the crime scene outlines of the victims as they were stenciled on the floor of an upper middle class home in western Kansas and rippled outward until his narrative covered the lives, background and family dynamics of the victims, their murderers and the laws and cultures that had produced both. A staggeringly detailed account of a brutal slaying, Capote has left us with a rich literary gift that should be on a list of books that must be read."}, {"userName": "Matthew", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "[ when speaking of what criminals could do on death row in Kansas, basically everything – every form of comfort, entertainment, ways to pass the time – were taken away from them. The justice system went out of their way to make things as uncomfortable as possible for those awaiting death. However, they let them read as much as they want. I am wondering why reading was the one acceptable past time they were given? (hide spoiler)]"}, {"userName": "Will Byrnes", "userReviewDate": "Oct 20, 2008", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "This is one of the great ones. Capote blankets Holcomb, Kansas with his curiosity. The root of this work is a ghastly crime. Two recently released convicts, seeking a fortune that did not exist, invade the Clutter family home, tie up the four family members present and leave no witnesses. It takes some time for the perpetrators to be identified, then tracked down. Capote looks at how the townspeople react to this. Many, fearful that one of their own was responsible, become withdrawn. How do people mourn? He looks at the sequence of investigation that leads ultimately to the capture of the suspects, focusing on one of the chief investigators. He looks in depth at the criminals. What makes them tick? How could people do such awful things? In reading this I was reminded of some of the great panoramic art works of a bygone age, works by Bosch, Breughel, in which entire towns were brought together into one wide-screen image. This is what Capote has done. But even with all the territory he covers there is considerable depth. I was also reminded, for an entirely different reason of Thomas Hardy. Capote has an incredible gift for language. He writes beautifully, offering descriptions that can bring to tears anyone who truly loves language. It has the power of poetry. This is truly a classic, a book that defined a new genre of literature. If you haven’t read it, you must."}, {"userName": "Stephen", "userReviewDate": "Mar 14, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "PART 1: STEVE’S REVIEW4.0 to 4.5 stars. Written over a period of 7 years and published in 1966, this novel, while not technically the first “true crime” non-fiction novel, is credited (correctly) with establishing the genre and being the progenitor of today's true crime novel. I would certainly agree that most of the other true crime novels that I have read followed almost the exact \"blue print\" laid out by Capote in this book. That is quite a testament to the technical excellence of this novel.The book recounts the story of the brutal murders in Holcomb, Kansas of a farmer named Herb Clutter, his wife and their two children. The book spends the early pages going back and forth between introducing the reader to the Clutter family and also to the two murderers, Perry Smith and Dick Hickock. I thought Capote did a superb job of allowing the reader to “get to know” the Clutter family (and the killers for that matter) so that impact of the actual murders would resonate more deeply.Overall, I thought the job that Capote did of laying out the story in the sequence that he did was masterful. By following the structure that he did he was able to keep the narrative tension high throughout the entire novel. This is a difficult task to accomplish when both the nature of the crime itself and the eventual fate of the perpetrators are known before you even pick up the book. However, Capote pulls it off and for that he deserves much credit. The novel is also much more comprehensive than just a detailed restatement of the murders. The book spends considerable time showing the effect the killings had on the Holcomb community and how different people responded to the event both postively and negatively. It follows the killers, both leading up to the murders and also during their time in hiding afterwards. Further, it recounts the actions of the police and the manhunt that eventually led to the capture of Smith and Hickock. Lastly, Capote spends considerable time on the trial of the two killers as well as the effect the trial and its aftermath had on the people most closely involved with the case. Overall, I thought the book was just about perfect in its execution. The critical events are detailed and fully-fleshed out without excess padding over the book’s 400 pages. I thought it was very interesting to discover that Capote produced almost 8000 pages worth of transcripts, notes and commentary from which he then distilled the final product. This certainly highlights the painstaking research Capote did and the unprecedented access he was given to the events and people surrounding this tragedy. An amazing achievement and one that I HIGHLY RECOMMEND people read. PART 2: STEVE’S CONFESSIONI only gave this book 4.0 to 4.5 stars. I feel weird saying “only” when the rating means I more than really liked it (call it really, really, super duper liked it). It just wasn’t memorable enough for me to give it 5 stars. Sadly, I think this says more about me than it does about the merits of the book. The recounting of the killings just did not have the emotional impact on me that I think, in all fairness, they should have. I guess you could say that I was shocked to find myself “not shocked” by the recounting of the murders. Unfortunately, having grown up in a world that has been witness to horrors so far beyond the tragic events described in the novel, the slayings did not evoke the kind of visceral reaction that I would have expected. A contributing factor to this may be that at the same time as I was listening to this book on audio, I was reading Jack Ketchum’s Off Season and DRACULAS by J.A. Konrath et al, two of the goriest books I have ever read. The horrors recounted in Capote’s novel came across as very PG to PG-13. Again, that is both a sad and scary thing to realize just how “comfortable” you can become reading, watching or hearing about crimes like this one. I think this last comment leads nicely into the next section. PART 3: STEVE’S RANTHave the horrors of the world today really become so fucking “over the top” extreme that they have numbed me to the point where reading about the pre-meditated, unprovoked murder of a family of four doesn’t quite have the requisite “shock value” to immediately cause bile to rise in the back of my throat. In all honesty, YES!! In fact, I believe that as horrific as the killings were they would barely be a two minute headline on the evening news today. When you really stop to think about it, how catastrophically and dementedly fucked up is that!! The truth is that nowadays events like the Clutter family killings happen all too often. In fact, it's possible that if the murders happened today they might go completely ignored by everyone except the local news where they occurred. Sadly, when on any given day we might be hearing about some troubled teen going “Columbine” on his classmates because some douche bag tripped him in the lunch room or reading about some disgruntled worker deciding that the boss who fired him doesn’t deserve to live and so proceeds to kill a dozen of his former co-workers because they are in the wrong place at the wrong time. Don’t take my comments as advocating the curtailment of ANY form of entertainment being made today whether it be books, movies, music, video games or TV shows. NO, NO, No and please NO!! I like and love my violent, over the top, blood-soaked books, graphic novels and even TV shows (pause for a big shout out to Dexter). Now I could do without most of the real gory, slasher type films but hey, to each their own.So this is not about advocating change in what we watch or read (I certainly have no plans to change). I am simply recognizing the fact that as a society we have fallen down the “rabbit hole” and are living in a fucked up, violent, blood-soaked world that tears at our empathy on a daily basis. It is just something that many of us (myself included) seem to have become all too comfortable with it. Whether its loving us some Tony Soprano (and c’mon how can you not) or laughing as we shoot hookers during a game of Grand Theft Auto (I would note without further comment the current serial killings involving prostitutes) or hearing about another 5 dead American soldiers killed by a roadside bomb and then casually changing the channel to get back to the ball game so you can put it out of your mind. This is us. We have become the world that Cormac McCarthy envisioned in No Country for Old Men and, like Sheriff Tom Bell in McCarthy’s novel, I think it would be impossible for the people of Capote’s time to imagine the world as it is today. I am not sure what, if anything, all this says about us or me, but there you have it. Rant over, review concluded."}, {"userName": "Ginger", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "[Two recently released convicts, seeking a fortune that did not exist, invade the Clutter family home, tie up the four family members present and leave no witnesses. (hide spoiler)]"}, {"userName": "Jason", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/4426615-jason", "userReview": "It is clear from reading In Cold Blood that not only is Philip Seymour Hoffman an excellent writer, but he is also an in-depth researcher. Every line in this book is painstakingly detailed and therein, as they say, is the devil. Well, the devil had me hooked from start to finish.Beginning with a day-in-the-life of the Clutter family shortly before four of its members were slain, Mr. Hoffman presents the real-life tale of the murders (as well as its aftermath) in a somewhat nonlinear fashion, skipping past the killings themselves to account for the daily activities and whereabouts of their perpetrators—Dick Hickock and Perry Smith—until finally revealing, once Hickock and Smith are caught, the goings-on at the Clutter family home on the night of the murders. All of this, I think, adds to the intensity of the storytelling and maintains the suspense necessary to move the narrative along.\nThe Clutter family home in Holcomb, KS, site of the November 15, 1959 murders.Though the writing is technically perfect, and someone (like Trudi) might come onto this review and yell at me for having attributed to it an incorrect number of stars, it is difficult for me to award that fifth star in cases where the book fails to rock my world, emotionally speaking. In other words, a book has to have its way with me—it needs to seduce me and whisper into my ear, and even making breakfast for me in the morning wouldn’t hurt. But these are just explanatory ramblings, and they are mostly unnecessary. Because this really is one helluva book.In doing some research of my own I have discovered that Mr. Hoffman was not alone in his procurement of the details for this book. His good friend Catherine Keener, author of To Kill a Mockingbird, accompanied him to the small town of Holcomb, Kansas, where the murders took place. He did this, presumably, to maximize the information-garnering potential for his manuscript. But oddly enough, Keener is not credited anywhere in the novel as having made any contribution to it whatsoever.Come to think of it, though, neither is Philip Seymour Hoffman."}, {"userName": "emma", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "I do not, as I have said many a time, feel things very often. I am just shy of being a sociopathic monster, mainly because I consider myself to be way too cute and charming for that. (Except sociopaths are capable of charm...huh. Back to the drawing board.)Anyway. Even in my actual, real life, I try to experience emotions as infrequently as possible. This is only truer for the books I read.In Cold Blood is a true crime narrative detailing the crime, investigation, and trial related to the murder of four members of the Clutter family, and therefore I wasn’t planning on feeling anything if at all possible. Because, duh, emotions related to that aren’t exactly going to be the equivalent of “eating cotton candy while at the top of a Ferris wheel at a fair in the beginning of summer” or “hearing an infant laugh for the first time.”And yet, by page 50, Truman Capote had me feeling overwhelmingly fond of the Clutter family.I knew what was going to happen to them. Even if I hadn’t known the book’s synopsis going in, I would have felt the building tension. Somehow, though, even though I knew what was coming, I was really hoping the Clutters would be okay.Mr. Clutter, the tenet of his community. Mrs. Clutter, who finally felt she might be overcoming her lifelong struggle with mental health. Nancy, the sweet, kind teenager who overbooked herself because she didn’t want to say no to anybody. Kenyon, nerdier than his older sister, but smart and kind and passionate.As I read about their lives on and before November 15, 1959, I hoped they would be okay. Even as Perry Smith and Dick Hickock entered their home late at night, I hoped they would somehow leave a survivor. What I expected out of this book was an exciting, impressive rendering of a horrible crime. I got a lot more. I was made to care about these people, and to feel their loss. I empathized with their loved ones, their community, their police force. I could have read about the Clutters for much longer than I did.Unfortunately, the Clutters and the crime itself only took up about a third of the book. The remaining two thirds followed the investigation and the trial, but more than that, it followed the killers.I felt no pity for Dick Hickock. I don’t think I was supposed to, or I hope I wasn’t. Because that guy was a piece of total sh*t. I’m someone who believes that people can be partially exonerated by their circumstances, but Dick Hickock had no circumstance that could make up for what a f*cker he was.Perry Smith, on the other hand. Even for him, who suffered all his life, I was only able to feel partial pity. A sickening kind of pity - it nauseated me to read about him.Maybe if this book felt more focused on the Clutters, I would have given it five stars. I don’t know. It’s still a four star read because it’s so impressive. It’s no wonder that this book to some extent birthed the genre of true crime as it is today. The exhaustive research and attention to detail is pretty much astonishing, and the writing is for the most part beautiful.But the later parts of the narrative were sickening, and hard and unpleasant to read. Not just for their content, but for the treatment of the people it followed. I don’t know. It felt like it strayed a lot from the Clutters. Maybe it wasn’t ever supposed to be their story - maybe it was Perry and Dick’s all along. But I’d prefer to think it wasn’t.Bottom line: I love true crime. I love classics. This feels outside of both of those genres. Genre-defying. I don’t even know what it is. It’s good. Hopefully that’s enough.-------------PRE-REVIEWi am so glad that i'm sticking to my plan of reading a classic a month. (i'm so proud of myself you'd never guess it's THE SECOND MONTH OF THE YEAR.)i always forget how much i love classics until i pick them up??? they're classic for a reason.whatever. i digress. this is a great book and i'll review it at some point hurray"}, {"userName": "Mark", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/52374080-mark", "userReview": "Unashamedly my favourite book of all time. Written originally as a piece for the New York Post by Capote, he later developed it into this novel.I have very little to say of the plot because YOU NEED TO READ THIS BOOK YOURSELF. The dawning of a new type of literature - the true crime book - but still not as we know it today. Today's true crime are full of fact after grisly fact, who shot who and countless mass murders or gangland wars. Don't get me wrong I love those books too.In Cold Blood is different. ONE major crime followed by a myriad of smaller, stupid crimes. The major crime was never really planned to happen and it never should have happened but when dumb criminals are involved in poorly planned crimes things can go VERY wrong. But that is the story, no reprisals from rival gangs and no 'over the top, gun blazing' street battles. No bodies found buried in the woods, no booby trapped houses.Capote was infatuated with this story and he knew from the time he had finished his New York Post article that he had to give it more time to breathe. This book reads like any fictional crime novel only it is based on fact. A truly remarkable piece of work, Capote keeps you turning pages waiting for the big twist, he has you riding along with the story so much so that you almost forget you are reading a true account of a crime. He doesn't sensationalize the events but the way he could write with such descriptive clarity is at least the equal to any fiction you could read."}, {"userName": "Ɗắɳ  2.☊", "userReviewDate": "Apr 10, 2014", "userURL": "http://www.goodreads.com/user/show/12058788-2", "userReview": "[And there were half a hundred other items he had decided he must take with him, among them his treasure maps, Otto’s sketchbook, and two thick notebooks, the thicker of which constituted his personal dictionary, a non-alphabetically listed miscellany of words he believed “beautiful” or “useful,” or at least “worth memorizing.” (Sample page: “Thanatoid = deathlike; Omnilingual = versed in languages; Amerce = punishment, amount fixed by court; Nescient = ignorance; Facinorous = atrociously wicked; Hagiophobia = a morbid fear of holy places & things; Lapidicolous = living under stones, as certain blind beetles; Dyspathy = lack of sympathy, fellow feeling; Psilopher = a fellow who fain would pass as a philosopher; Omophagia = eating raw flesh, the rite of some savage tribes; Depredate = to pillage, rob, and prey upon; Aphrodisiac = a drug or the like which excites sexual desire; Megalodactylous = having abnormally large fingers; Myrtophobia = fear of night and darkness.”) (hide spoiler)]"}, {"userName": "Jason", "userReviewDate": "Sep 24, 2009", "userURL": "http://www.goodreads.com/user/show/2447803-jason", "userReview": "Within 10 minutes of finishing In Cold Blood you'll be on the internet searching for pictures of the killers and victims of this real world multiple-slaying narrated brilliantly by Truman Capote. The photos are there, and like a voyeur, you'll be drawn, captivated, needing to see the mug shots, the murdered family, the courtroom stills, the crime scene, each room that held a body with a head blown open like a busted melon.Capote breathes such realism into the characters that all you'll need to make the story complete are those black-and-white photos. With an economy of words and language that is clear and straightforward, Capote successfully makes a difficult story very readable, very believable. The difficult part was taking a true story constructed from witness statements, interrogations, and multiple interviews between killers and author, and then salting in between with a dialogue that is perfectly deduced from a close personal knowledge of the killers--their attributes, their movements, their proclivities. I felt like I was watching the action unfold, not so much reading it. And yet, Capote was able to do this without the cloyed techniques so prevalent in the mass media paperbacks you find at large grocery store chains. There are no outrageous cliffhangers between chapters, no desperate chases, no irrational climax, no unknown player revealed in chapter finis. In fact, he chose to introduce the murderers up front, then coolly alternates chapters between killers and victims, and then, when victims were eliminated, between killers and prosecutors. I liked this approach. It's uncommon. I liked the way it disarmed me, and made it a story of mechanical transaction rather than an emotional racetrack. For this reason the story, for me, was one of 'why' instead of 'how.'I also liked that Capote applied psychoanalysis to the crime. Surely there must have been some insanity involved. But no, not really! And that was the real surprise. Apart from a tough childhood and some persistant hard knocks, the killers were probably no more deviant than a majority of cases that fall through the juvenille system, even today. The key ingredient to the crime was the bizarre congruency of their personalities--merely deviant when separated--that when mixed together created a lethal combination. Operating together, the killers must have felt the bewilderment one experiences when finding 2 spalls of broken rock in a large pile and suddenly, absurdly, fitting them exactly together.New word: sartorial"}, {"userName": "Reev Robledo", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/6954712-reev-robledo", "userReview": "Capote paints perfect pictures of every character. You can almost feel them breathing right beside you. Their thoughts, their mannerisms, their physique, their psyche, etc. Bravo.He painstakingly describes every detail—with thousands of commas and dashes preceding thousands of commas and dashes—his keen sense of observation (and exaggeration) is both impressive and tiring at the same time. I felt that Truman probably held the details of every interview close to his heart hence a lot of unnecessary banter between town-folk, relatives and even very minor characters were not omitted. The conversations were crucial, but somewhat too plenty.I couldn't help but think of one of Disney's famous editing principles while reading this book: If it's not important in the telling of the story, cut it out. Of course, this is way beyond the family-oriented themes good ol' Walt implemented. It's gruesome, shocking and certainly deserves the accolade of the \"true-crime\" genre.I love how Capote matter-of-factly drops sentences that depict the horror of the crime done after a rather mundane recollection of events. \"I slit his throat.\" is one. Narratives of Nancy, Sue, Al Dewey stood out, perhaps because they had a natural flow to the story-telling and did not sound like a police report. Mrs. Kidwell's dream, though briefly described and wildly unbelievable, was haunting.Now let me tell you why I am not impressed. My biggest question is: Would I have enjoyed this book if I didn't know that it was real? Will it stand up on its own minus the decades of controversy around it?The answer lies in the text itself. The book is obviously a novelized transcript of interviews: if it isn't, then it certainly felt like it was. Truman Capote \"filled in the blanks\" with suppositions, questionable truths, and fictional drama—that wouldn't be an issue had he not boldly claimed his work to be \"non-fiction\".It is my belief that Truman wanted to shock the mainstream with his empathic crusade for the murderers. Without question, he had an affinity for Perry and Judge Tate, and a clear distaste for Dick. Perhaps during the interviews, Hickok was appalled by Truman's nosy intrusions and homosexuality—that's just a guess—while Smith was more accommodating.I am not sure if I am simply desensitized by the countless crime books, tv shows and movies I've seen. But I did not feel an ounce of pity towards the criminals. Things would have probably been different if I had read this in the 60s or 70s when coverage of crimes like these were bold and anti-Hollywood, therefore \"cool\".Forgive my natural tendency to reject what's popular...for what most claim to be \"a really great novel\". I just had too many \"Oh c'mon, how could you (Capote) have been there to know that?\" moments to merit praise. Based on further research, many of the characters deny that many events in the book (Mrs. Meir having a picnic with Perry in jail for one) really happened.Had this been categorized as a tale based on true events, then I would have given it double the stars. If you say this story is true, then I'll be doggoned if pertinent details were fabricated just to express that \"creative license\". It doesn't only not help in the telling of the story, it just makes the story something else entirely—a fictional one."}, {"userName": "J.L.   Sutton", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/3675162-j-l-sutton", "userReview": "A seminal work for the non-fiction novel and the true crime genre, Truman Capote's In Cold Blood stands apart from most of its literary descendants. Not only is it compelling and suspenseful even when you know (like many crime dramatizations) what's going to happen, it's also very well-written. In fact, its literary quality gives In Cold Blood a dimension which few other non-fiction novels will match. The evolution of the form, since In Cold Blood, is nothing short of astonishing. It makes you appreciate how different the experience of reading the book is now compared to when the book was published. Yet, it is not a stuffy classic. Definitely worth reading!"}, {"userName": "Darwin8u", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"I thought he was a very nice gentleman. Soft-spoken. I thought so right up to the moment I cut his throat.\"- Truman Capote, In Cold BloodI'm not sure why I waited so long to sit down and read this novel. I've read and enjoyed Other Voices, Other Rooms and Breakfast at Tiffany's. Perhaps, it is just that the novel wasn't very, well, novel. Without having read it I felt I already knew it. I was surrounded by New Nonfiction inspired by Truman Capote's 1966 book (originally published serially in the New Yorker). Everyone now seemed to write long-journalism pieces like Capote. His influence on journalism and especially on New Journalism was huge. But my kids were reading Harper Lee's To Kill a Mockingbird and, perhaps, triggered by some vague, dusty memory that Harper Lee and Truman Capote were cousins and that she helped Capote out with the research and interviews for 'In Cold Blood' I decided it was the right time to read one of my copies (I own a first edition* and a Modern Library copy). I wasn't born, but apparently when this came out in the New Yorker back in the mid-1960s it was a sensation. I'm trying to think of a series of articles recently that could compare. Probably the closest thing might be the PODCAST \"Serial\" or the TV show \"Making a Murderer\", but I still sense that it was bigger. It was one of those works that both made the author and kind of destroyed him too. Anyway, it was brutal. Brutal because of its very humanity. Dick and Perry aren't painted as horrible (or even scary) killers. Like Arendt, Capote's trick (perhaps not trick) is to show us how banal, how casual evil is. It was like staring wickedness in the face and recognizing just a bit of oneself (but the boring, cereal eating side). It reminded me of a German Shepherd my dad (a veterinarian) rescued once when I was a kid. He was viscous. I spent hours trying to \"tame\" him. Over months I was able to (I thought) reduce the anger, the fear, the viciousness in this dog. But occasionally I would see it. He (the dog) hated old people. An old man or woman would walk by our fence and \"Bozo\" would go mad. We finally found an adopted home for him. Months later, we heard he had jumped an 8 foot fence and attacked an old man and had to be put down. I remember thinking how sad it was. I loved that dog, but at the same time, I recognized that there was something IN that dog that was dangerous and would never change. Anyway, that was kind of how I felt reading about Perry. Here is a man who had, at one level, a certain gentle quality, but without regret, without much pushing, could also quickly kill another human being. I think that duality. That humanity touched by that evil is what haunts that book and makes it relevant now and into the future.* These aren't very rare because the first edition of 'In Cold Blood' was printed like it was the Bible in 1966 because of the interest shown by the original New Yorker articles."}, {"userName": "Jilly", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "Every once in a while I feel the need to get a couple of IQ points back by reading something that is considered a \"classic\" or won prizes or whatever.So, this book is based on a real murder that happened way back in the 1950's. A family was killed in a small town in Kansas and it was a big deal. Not like these days. We hardly flinch anymore when the weekly killing spree is on the news. Truman Capote was super obsessed with this case and took his buddy, Harper Lee, with him to Kansas where they interviewed everyone extensively in this small town. This book was the result and took him 6 years to get out. He insisted that it is completely factual even though he was called a filthy liar with pants on fire because \"they\" say he made some things up. Personally, I don't care. The book is good whether or not he exaggerated or gave \"alternative facts.\" Again, sign of the times. We are so used to facts being spun that we don't even expect absolute truth anymore. The only thing that was difficult for me with this book was the unbelievably descriptive writing. I have little patience for long flowing sentences with many many adjectives to describe a wheat field. I die of boredom really easily. It's a problem. But, I pressed through it because I am brave like that, and I found myself very immersed in the story. I don't know if it is because all of that purple prose got my mind envisioning the story better than others or what, but it worked. Still not a converted fan of the excess adjectives though. I made ONE exception. Can I go back to my vampire smut books now?Cool! See ya!"}, {"userName": "Jonathan Ashleigh", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/33737465-jonathan-ashleigh", "userReview": "This was the best story about true crime that I have read. Capote's description of these events is riveting and everybody should read it, whether they like books on true crime or not."}, {"userName": "K.D. Absolutely", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "A couple of weeks back, a disgruntled former senior inspector Rolando Mendoza from the Manila Police District shot and killed eight Hong Kong tourists ending the hostage crisis drama that lasted for around 10 hours. This took place at the Quirino Grandstand in the heart of Manila, Philippines. The whole nation was stunned while watching the images unfolding on TV screens. The whole world watched with us as the events are covered by CNN. Mendoza's demand was for him to get his job back. He was about to retire in a year's time when he was kicked out from the service due to allegation of extortion. Each of us, including me, quickly say Mendoza is wrong. It is wrong to extort (forcibly ordering a chef to eat cocaine!). It is wrong to carry a firearm (he was no longer in service). It is wrong to take people as hostages (especially tourists!). It is wrong to kill (eight innocent unarmed foreigners!). But... have we heard his side? (he is already dead) Have we at least heard the people he was close with? Do we know exactly what went into his mind why he did those senseless and brutal shootings?That is what Truman Capote (1924-1984) did in his nonfiction novel, published in 1966, In Cold Blood. He was so good at it that my heart cried for the killer, Perry Smith. Yes, the murder of the whole Clutter family of Holcomb, Kansas in 1959 was wrong. Smith and his partner, Dick Hickock should not have gone to the house with the intent of robbing the family. Then when they did not find the safe (supposed to contain US$10,000), Smith shot each of the people in that house (they ended up getting a measly amount of US$50, a binocular and a portable radio). I felt total raging hatred for Smith and Hickock. But when their own life stories were presented by Capote, at first I did not know what to feel (he came from a broken family, he grew up with strangers, his father humiliated him, all he wanted was to have a good education, when he was small he cried looking up at the moon as he thought it was so beautiful). Until that scene when Smith was taken back to his cell after the verdict was given. That scene when he extended his hands so the warden's wife could hold them... That scene followed by the one with the squirrel missing Smith in his cell... Capote's narration reaches out to your heart so that it bleeds pity and empathy for a wrong person.The book screams to us: is capital punishment right or wrong? Prior to this book, I used to react to this question with a shrug and \"yes, it is right\". Then I normally add that as a father, I feel the pain of my daughter whenever she cries (due to sickness or whatever), etc. In short, no debate needed, I was totally in the side of the victim (pp.336 \"I believe in hanging. Just so long as I'm not the one being hanged\"). However, in this book, Capote opened my eyes to the other side of the argument: the background of the killer (he is also a victim of the society, he could be schizophrenic: feeling totally detached from himself at the time of the killing, taking the killer's life does not give him opportunity to change, taking the killer's life is a pure and simple act of revenge).I bought this book from a second-hand bookstore at P50 (around US$1) last year. My brother says that we used to have a copy of this when we were kids in the province. He also says that my late father read and liked this so he read it too. I was young then and not interested in literature. Last Wednesday was my father's 13th Death Anniversary so as my way of remembering him, I picked this from my to-be-read pile. One good decision I made. This book is life-changing.I have 51 friends here in Goodreads. More than half of them are Filipinos. Some of them are Americans or Europeans. Not a single one of my Filipino friends has this in any of his or her folders (read, marked-to-read, currently-reading, wish-to-read, etc). None. All the Americans and Europeans have read this book and rated this with either a 5 or a 4. Last Friday, I saw brand-new copies in a popular bookstore. Oftentimes, I also see many second-hand copies in other bookstores. It is not thick (only 343 pages) and it is an easy read.My theory: there are so many killings and murders in the Philippines that Filipinos are either desensitized already or Filipinos are fun-loving people so we do not want to read books or watch movies that we already experience in real life. My opinion: this is wrong. We need good books like In Cold Blood to widen our perspective on important issues like in this case, capital punishment. For all we know, we could have already set biases and prejudices clouding our judgment and views. In fact, in one of the TV news programs last week, I saw no less than Senator Miguel Zubiri calling for the return of capital punishment in the country.I am not saying that Rolando Mendoza was right in taking those tourists as hostages and killing them in the end. No! All I am saying is that we should not be too quick to pass judgment on him or the likes of him. Voices should be heard."}, {"userName": "Jean", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "As an English reader I had not heard of the Clutter massacre, and all I knew about Truman Capote was his novel \"Breakfast at Tiffany's\". It took a while before I recognised this novel as truly great. The 1950's domesticity did not appeal to me. It seemed alien, claustrophobic, gender-specific and rather dull. But after a while I realised the genius in describing the setting of this time and place to the minutest detail. The \"New York Times\" calls In Cold Blood \"The best documentary account of an American crime ever written.\" It is a ground-breaking book by Truman Capote, generally agreed to be the first factual novel, although others had explored the idea before. It is about the murders in 1959 of the Clutter family at their farmhouse in Holcomb, Kansas. The four murders received a lot of media attention, as the motive was unclear. Partly because of this Capote and his friend author Harper Lee decided to travel to Kansas to write about the crime before the killers were apprehended. They painstakingly interviewed all the local residents and investigators, taking numerous notes which Capote subsequently worked into his novel over the next six years. The killers, Dick Hickock and Perry Smith were arrested six weeks after the murders, but Capote does not start at that point; not at the point of the actual slayings for dramatic effect, as many writers would. He starts by describing the comfortable, happy family lives of devout Christian people living in the small town of Holcomb down to the smallest detail. Their daily lives, the aspirations of both old and young, the clinical depression of Bonnie Clutter (the mother, Herbert's wife) are all carefully set down. Carefully woven into the narrative, Capote also writes a dispassionate account of the killers' early childhoods, recording the highlights and events which in retrospect seem shocking in the extreme, but are so meticulously recorded by Capote that they form a non-judgmental picture. It is the juxtaposition made by Capote which means that the reader assesses the situation for themselves. The impoverished and brutal early childhood (some of the cruellest episodes ironically were perpetrated by nuns) of Perry Smith contrasts sharply with the settled happy community who had been devastated by the event. First hand accounts from the residents are included. Most were fearful; all were stunned and confused. Some bent on revenge, some on forgiveness. Every single one in this church-going community seemed to want to do the Right Thing, though they differed as to what that was. The feelings - the stress and deteriorating health of investigators involved - became more intense as the search went on. Truman increases the feeling of suspense as the search continued whilst making us more familiar with the two characters who had perpetrated it, so we are familiar with both Perry Smith's abusive childhood and Dick Hickock's head injuries and possible brain trauma following a car crash in 1950. At no point however does the author comment on such episodes; he remains impartial. He does not really need to. The reader now has ample material to make subtle inferences as to how responsible for their actions these two could be. The actual murders are recorded about halfway through the book, and the following 6 weeks where they were on the run is chronicled as a time when the relationship between the two was breaking down. Here are the thoughts of Dick Hickock, as he envisages setting off on his own, as set down by Capote.  \"Goodbye, Perry. Dick was sick of him - his harmonica, his aches and ills, his superstitions, the weepy womanly eyes, the nagging, whispering voice. Suspicious, self-righteous, spiteful he was like a wife that must be got rid of.\" In turn Perry Smith is beginning to wonder why he ever admired Dick Hickock, who takes a delight in running over stray dogs and prefers to steal even when they do have money in their pockets. Both are coming across as extremely damaged personalities, before we ever get to any formal psychiatric analysis.The pair were eventually tracked down by the evidence of a former cell-mate Floyd Wells. Having himself worked for Herbert Clutter he chatted to Dick Hickock about how well off this Methodist family were, giving details of the farmhouse, habits of the family, whether they had a safe etc. When he saw the subsequent use Dick Hickock had made of the information he told the police. (He claimed that although Hickock had stated to him that he would kill all the family, such boasts were so common in prison as to be meaningless. In addition, there was a reward for information.)There was enough other evidence to convict the pair - photographs made of bloody shoe prints which had been invisible to the naked eye, a radio which had been stolen from the house at the time of the attack and subsequently sold ... It seems precious little evidence to present-day readers used to DNA analysis etc, but coupled with the evidence given by the prisoners later, as to where they had disposed of the weapons etc, this was enough at the time.Capote uses the statements made by both prisoners (who were kept separate so that there could be no collaboration) to describe these horrific events. By this clever device the part of the novel which could have been almost unbearable to read takes on a clinical feel. It is never sensationalist or gratuitous. These are the killers' own words.At this point the complex psychological relationship between the men comes more into prominence. We already feel we know these men; we know perhaps some of the reasons why they were able to do what they did. It is becoming poignantly clear that what sparked the actual events was the complex relationship between the two, who in turn relied on each other, admired each other, hated each other ... Here is a quote from Perry Smith to detective Dewey, \"Then he says to me as we're heading along the hall towards Nancy's room, \"I'm gonna bust that little girl.\" And I said, \"Uh-huh. But you'll have to kill me first\"….that's something that I despise. Anybody that can't control themselves sexually.\" And again, most revealingly as picked up by a psychologist later, \"I didn't want to harm the man. I thought he was a very nice gentleman. Soft-spoken. I thought so right up to the moment I cut his throat.\" And of Dick Hickock, \"I meant to call his bluff… I didn't realise what I'd done til I heard the sound. Like somebody drowning…. Dick panicked….I couldn't leave him like he was…. Then I aimed the gun.\" Dick Hickock also shared this antagonism against his partner, but it was only later when his former cellmate Floyd Wells was called as witness, that Capote says, with a flash of insight he realised he was not as dangerous as Perry. \"Suddenly he saw the truth. It was Perry he ought to have silenced.\" Capote states that Alvin Dewey, the investigator most involved with this case considered that the two versions of the killings were very much alike. But he concluded that the confessions of how and why failed to satisfy his sense of meaningful design. The crime was a psychological accident, virtually an impersonal act. The actual amount of money stolen was between 40 and 50 dollars.The lead up to the trial, as everything else, is carefully documented. The choice of legal representation, of the judge, of the jurors. One potential juror said, when asked his opinion of capital punishment, that he was ordinarily against it, but in this case, no. Yet he was still allocated to the jury. There were no qualified psychiatrists within Garden City, where the trial held. The prosecuting attorney referred to the profession as a \"pack of head-healers\" sympathetic to the defendants. \"Those fellows, they're always worrying over the killers. Never a thought for the victims….. Our own local physicians attend to the matter. It's no great job to find whether a man is insane or an idiot or an imbecile.\" Whereas the defending counsel said, \"Whatever their crime, these men are entitled to examination by persons of training and experience… Psychiatry has matured rapidly in the last twenty years.\" Listening to both sides, the judge acted strictly within law, appointing 3 Garden City doctors, despite the fact that the unpaid services of a qualified psychiatrist experienced in such cases had been offered.Details from the trial stick in the memory. The testimony of Dick Hickock's father, who was seriously ill at the time (he died months later) but was mocked by the prosecuting attorney for getting the dates of the car accident which led to his son's head injuries and subsequent personality change wrong. One eminent psychiatrist had been called as a defence witness. However the judge only allowed him a yes/no answer to the question, could he could state that the defendants knew the difference between right and wrong. He answered \"Yes\" in respect of the first one, then was dismissed. No further comment was allowed. Presumably faced with an impossible question to answer in those terms he then answered \"No\" to the question when put about the second accused. Again, no further elucidation was allowed by the judge, as this was perfectly allowable under Kansas law. Capote goes on to quote the psychiatrist's prepared analysis, after his examinations of the defendants, which presents a much fuller picture. The conditions described after several intensive interviews he had had with the killers use terms which are more familiar to modern readers - organic brain damage from the accident, schizophrenia and dissociative behaviour, where an individual suddenly finds himself destroying some key figure in his past, who may be unclear to him. They may well have been new concepts to the jurors who were in the main farming people, but they were not privy to this crucial information in any case.Although the ending of the trial is a foregone conclusion, the actual execution of Dick Hickock and Perry Smith did not take place for a further 5 years. Capote explains that in the US judicial system it is possible to appeal several times, and that this is common practice. He spends a further part of the novel in describing the characters and crimes committed by various other inmates on Death Row. Interestingly, this part of the novel is not as objective as the rest. Capote's feelings begin to impose more. Perhaps it did not seem as important to be scrupulously impartial as these cases were not crucial to the main text. What it does do for the reader however, is to create a feeling of the suspension of reality - a reflection of the interminable waiting that the prisoners must have felt in their turn.The execution by hanging, the witnesses, the quiet behaviour of the killers is all described. And a final short scene is added which is pure fiction, where Alvin Dewey goes to the graves of the Clutter family and meets one of the children's close friends, now an adult. This I found quite allowable as a coda. It ties up the ends nicely, and I am not sure how else Capote could have done this, without inserting his views in a summing-up, which clearly he did not want to do.This novel is not only ground-breaking but superbly crafted; a pretty near perfect novel. The continual switch between present and past tenses only serves to give a more immediate feel; an edge to the narration. My star rating? Well, I cannot say, I \"like it\", (3 or 4 stars) but I can say, \"It was amazing!\" Five stars."}, {"userName": "Stepheny", "userReviewDate": "Oct 30, 2012", "userURL": "http://www.goodreads.com/user/show/7091879-stepheny", "userReview": "Holcomb, Kansas November 15, 1959(Herbert, Bonnie, Nancy and Kenyon)Four of the six members of the Clutter family were bound, gagged and murdered in their home. Herb and Bonnie and two of their four children-Nancy age 16 and Kenyon age 15. The family was well-liked within the community and was generally known for being “good people”. Two parolees had heard that Mr. Clutter was a man of wealth and that he had a safe tucked away inside his home. ( Perry Edward Smith)(Richard Hickcock)These two men entered the Clutter home on the evening of November 15, 1959. They ended the life of those four people, leaving two surviving children that were not present on the night of the murder.The town of Holcomb was left in terror that something so awful could happen in their quiet little neighborhood. The townsfolk could not fathom the murder of such innocent people for what appeared to be- no real reason. Truman Capote was apparently “obsessed” with this murder and followed its trial closely. The movie, Capote, is an excellent one for any who are interested. This was the first book I have ever read by Mr. Capote and I am absolutely amazed with his writing.This is a heartbreaking story reality. I continuously had to remind myself that these events were not made up; that this actually happened. This is a book that everyone should read; a book that will stay with me* through several lifetimes. It is a masterpiece through and through and I recommend this book to everyone. An incredible read despite its grim content. *Thanks, Dan 2.0! ;)"}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Nov 21, 2010", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "At first I wasn't going to compose a review about this book. Considering the adapted-to-screen version, the biographical film centering around this period in the author's life, the seemingly infinite number of editions printed over the last 40+ years, the massive hype surrounding the murders/murderers even today, the more than likely THOUSANDS AND THOUSANDS of reviews already written about the novel, and the general rock-stardom that IS Truman Capote, it seemed about as pointless as dropping a pebble into the Pacific Ocean and hoping for a wave. Then I remembered that I had the gall to write a review about Dante's Inferno and thought...hey, why start worrying about being humble now? Truman certainly wasn't. He was blingin' before bling was even a word, kids. Hell, he had to walk to school uphill both ways barefoot in the snow carting around all his bling. But enough about SlickRick...err...Truman. On with the review! (gallop, gallop, gallop)\nThe true-crime genre. Generally stinkier than what I would imagine that obese dude in Se7en's gaseous wind-breaks would be. I generally never peruse this section, which is why for entirely too long I was living under the assumption that the local bookstore was simply always sold out of copies of In Cold Blood. I'd been trying to read it for ages, but hadn't even considered that it could be over on the same shelf as The Stranger Beside Me (some of you, my lovely goodreads BFF's, may recall my feelings regarding THAT piece of shit). But enough with the review-nostalgia. I finally found it one day, took it home, and pounded it down like it was dressed tequila. It was the perfect book, in fact, to get me out of my reading funk. THREE CHEERS FOR MURDER! But I digress...The novel is superbly crafted, with spot-on pacing (with the exception of the first chapter which, though necessary, does draaaaaaaaaag on a wheeeeeeeeee bit) and, more importantly, characters so real that they don't even seem real. Their conversations flow with a subtle grace rarely seen in published writing in general, and specifically (surprisingly) even less in true crime novels. You would think that you would think \"the shit is, like, for real real, so it should seem more for real real when you write it down for real than other not for real shit that you write down, right?\" However, part of the oddly convincing feeling that one gets from the characters in In Cold Blood is actually largely due to the fact that the dialogue is written in a novelistic style rather than through the true crime genre's irritatingly common habit of using(more often than not chopped to bits) \"direct\" quotations. I would argue that this approach serves to put you outside of the situation, and makes you feel detached from the horrors of the subject matter, as well as less sensitive to the most important lessons that we could possibly learn from true crime books in general: The WHO these people actually were. The WHAT drove them over the edge. The WHEN they lost their marbles. The WHERE in their pasts the pivotal damage occurred. In short, not just the HOW they did what they did, but WHY they did it to begin with. I can’t say that Capote necessarily answer all of these questions. However, he made his best effort to, setting the stage for generations of true-crime authors to follow in his footsteps and expand upon the genre-bending path he laid for them. It is really too bad that so few actually do."}, {"userName": "Duane", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "With all the commonplace violence we are faced with today, bombarded constantly by a 24/7 news cycle, portrayals of violence in movies, video games, etc., it's easy to see why there may be a level of indifference, even apathy toward the problem. But occasionally a crime is committed that rocks us to the core; a crime so senseless, so brutal, that it defies explanation. This murder of the Clutter family in Holcomb Kansas in 1959 is just such a crime. Senseless: they stole less than 50 dollars. Brutal: they shot their 4 victims in the head at close range with a shotgun.Of course, this crime, as violent as it was, would have been lost in the annals of crime history if not for Truman Capote. His relentless research, which led to this brilliant 1966 \"non-fiction novel\"' and the subsequent movie by the same name, will shine a spotlight on this innocent family and their brutal killers, Richard \"Dick\" Hickock and Perry Smith, for years to come.One of the interesting side notes for me was the fact that Capote's childhood friend, author Harper Lee, accompanied and assisted him in his research for this book. My reason for 4 stars instead of 5 is my dislike for the genre, and there were a few minor details that bothered me. But it's an extraordinary literary achievement, no doubt, and one that defines Capote's career still today."}, {"userName": "KamRun", "userReviewDate": "Aug 06, 2017", "userURL": "http://www.goodreads.com/user/show/12342179-kamrun", "userReview": "قتل عام کانزاسدر سال 1959، 4 نفر از اعضای خانواده‌ی کلاتر‌ها در حالی که با طناب بسته شده بودند به طرز وحشیانه‌ای با شلیک یک گلوله به صورت کشته شدند. قربانیان این جنایت، هربرت ویلیام کلاتر ( 48 ساله) ، بانی فوکس (45 ساله)، نانسی (16 ساله) و کنیون (15 ساله) بودند. یک سال پس از این، ریچارد هیککاک (ملقب به دیک) و پری ادوارد اسمیت به اتهام قتل درجه یک بازداشت و در دادگاه به اعدام محکوم شدند. این دو 4 سال بعد در سن 36 سالگی به دار آویخته شدند. در کمال خونسردی داستانی‌ست درباره‌ی چگونگی وقوع این جنایتدرباره‌ی کتابرمان‌های جنایی، بخصوص آ‌ن‌ها که جزء کلاسیک‌های این ژانر طبقه‌بندی می‌شوند (نظیر مجموعه پوآرو یا خانم مارپل آگاتا کریستی) ساختاری کلیشه‌ای دارند: وضعیت پیش از فاجعه اندکی توصیف می‌شود (مقدمه‌چینی)، آنگاه جنایتی معماگونه رخ می‌دهد (گره افکنی) و کارآگاهی به حل این معما مشغول می‌شود و در انتها راز جنایت فاش و قاتل به سزای عملش می‌رسد (گره گشایی). حال آنکه رمان‌های پیشروی جنایی، با ساختارشکنی روندی کاملا متفاوت را دنبال می‌کنند. در این گونه آثار مسئله‌ی اصلی حل معمای جنایت نیست، چه بسا گاهی معمای جنایت حل نشده باقی می‌ماند ( تابوت‌های دست‌ساز اثر کاپوتی، قول اثر فردریش دورنمات) یا آنکه داستان روی جنبه‌ی روانشناختی شخصیت قاتل پس از وقوع جرم متمرکز می‌شود ( آثار جیمز کین، در کمال خونسردی کاپوتی)در کمال خونسردی اما نقطه‌ی قوت دیگری دارد و آن مستند و گزارش-داستان بودن روایت است، سبک منحصربه‌فرد کاپوتی. او سال‌ها روی این پرونده کار کرده و تمام جزئیات را از شاهدین و کسانی که در بطن ماجرا بوده‌اند استخراج کرده و سپس دست به خلق این اثر فوق‌العاده جذاب زده است. از این رو تمام شخصیت‌پردازی‌ها و وقایع این کتاب واقعی هستند. کاپوتی روی شخصیت‌پردازی و توصیف دقیق حالات روانی قاتل‌ها بسیار عالی کار کرده و تمام جذابیت داستان هم به همین ریزبینی نویسنده است، وگرنه پایان ماجرای قتل عام کانزاس از همان ابتدا مشخص است. مخاطب وقتی به خواندن این اثر مشغول شود، بیشتر از آنکه از قربانیان یا جنایت چیزی بخواند، با کاراکتر قاتل‌ها و افکار ‌آن‌ها عجین می‌شود، طوری که شاید در پایان ماجرا در وضعیت پارادوکسیکالی قرار بگیرد و با وجدانی شرمگین، از اعدام پری اسمیت، ضد قهرمان روان‌نژند و دوست‌داشتنی داستان غمگین شوداقتباس سینماییبعد از دیدن فیلم درباره‌اش می‌نویسمترجمه‌ی فارسیکتاب دو بار به فارسی ترجمه و منتشر شده، یکبار به ترجمه‌ی باهره راسخ تحت عنوان به خونسردی و یکبار به ترجمه‌ی پریوش شهامت تحت عنوان در کمال خونسردی. برای آن‌دسته از دوستانی که قصد خواندن این کتاب را دارند، ترجمه‌ی باهره راسخ بعلت ایراد‌های متعدد توصیه نمی‌شودلینک دانلود در کمال خونسردی - ترجمه پریوش شهامت"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "In Cold Blood, Truman Capoteعنوانها: عنوان: به خونسردی؛ به خونسردی - شرح واقعی قتل چهار نفر و پی آمدهای آن؛ در کمال خونسردی؛ نویسنده: ترومن کاپوتی؛ تاریخ نخستین خوانش: هفدهم سپتامبر سال 1998 میلادیعنوان: به خونسردی؛ نویسنده: ترومن کاپوت؛ مترجم: باهره راسخ؛ تهران، فرانکلین، 1347، در 345 ص، موضوع: داستانهای امریکایی قرن 20 معنوان: به خونسردی - شرح واقعی قتل چهار نفر و پی آمدهای آن؛ نویسنده: ترومن کاپوتی؛ مترجم: پریوش شهامت؛ تهران، نشر پیکان، 1376، در 467 ص؛ شابک: 9646229123؛داستان برگرفته از خبری واقعی از قتل‌عام یک خانواده، در کانزاس است، و همین رویداد به نویسنده فرصت می‌دهد تا نخستین رمان غیرداستانی خویش را بنویسد. نویسنده زمان بسیاری را صرف مصاحبه با: شاهدان، دو قاتل، و بررسی گزارش پلیس، می‌کند. کتابش در سال 1965 میلادی با تیراژی میلیونی براییش شهرت، موفقیت و ثروت به همراه می‌آورد. با این کتاب به اوج می‌ر سد و نمی‌تواند هرگزی کتاب دیگری در همین اندازه بنویسد. زندگینامه نویسش: جرالد کلارک، علت را زمان طولانی تحقیق، و خستگی ناشی از کار سنگین او می‌داند؛ ا. شربیانی"}, {"userName": "Jeremiah", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/1811124-jeremiah", "userReview": "I originally thought this book would be a page turner on hypothermia. Being that thermoregulation keeps human blood at about 100 degrees, and hypothermia sets in at the high 90's, I assumed \"cold\" blood would be around 60 degrees...meaning instant death.However, I did completely misjudge the book and its subject. Well played, Mr. Capote...well played."}, {"userName": "Mandy", "userReviewDate": "Sep 06, 2015", "userURL": "http://www.goodreads.com/user/show/30940542-mandy", "userReview": "For the longest time I thought this book was about the mob. Truman Capote just sounded like a name associated with the mob to me. My father in law told me to read it and gave it to me stating it was a true murder mystery that happened in KS. The story started out slow for me I really just wanted to read about the murders and what really happened in that house. The story was set up in four sections and for good reason which I won't spoil for those who have not yet read it. The Clutter family was definitely murdered in a heinous way that makes you want to lock your doors and windows. This book really pulled at my heart strings and there were times I get sick, mad, irritated, and then lonesome, especially at the very end. This book left me in despair. Four members of a family brutally murdered and what? Life still goes on for the rest of us. I hope some day in my life to go to Holcomb, KS and put flowers on the graves of the Clutters."}, {"userName": "Rolls", "userReviewDate": "Mar 06, 2007", "userURL": "http://www.goodreads.com/user/show/18657-rolls", "userReview": "Truman Capote's \"In Cold Blood\" is a highly disconcerting read. After painting an idyllic scene we'd expect from the Midwestern setting evil makes it's presence felt. The blood is chilled and the heart gripped as a result.As everyone must know by now this is considered the first nonfiction novel. All the bare facts of this story actually took place. A family of four was indeed murdered in their home by two unknown assailants on 14 November 1959. What made this book innovative was the fact that Capote handled these facts not as a journalist but as a novelist. Rather than restrict himself to just the \"who, what, where, when and why\" of the fourth estate he let the fiction writer in him fill in the gaps left by the facts at hand. Scenes like Bonnie Clutter's last sad night on earth could and would only be attempted by a novelist.While Capote never makes it possible for us to forgive the murderers - not that he or anyone could - he goes a long way towards making them sympathetic. It is the film's (\"Capote\") claim that he fell in love with Perry Smith while writing this book. Perhaps. Smith does indeed come off as a fully rounded person while Hickock seems less interesting to him and consequently to us. What counts though is that he makes them human. After reading about the nature of this crime that in itself is a huge achievement.Finally, I just want to point out a person who played a huge part in this story but always fails to attract the attention accorded to the murdered, the murderers or Capote himself, namely Alvin Dewey. Dewey is the relentless Javert of this tale and it is through his eyes we see the facts unfold. Capote's drawing of him as a man morally wounded by the evil inherent in the murders of this poor family touches the heart. His refusal to let the murderers get away with their heinous crime galvanizes the spirit in turn.This is where the true greatness of this book lies.I started this book one night at two in the morning and read til I finished it at nine a.m. It is the very definition of a page turner. Once you are told what happened it is impossible to put this book down until you find out why."}], "description": "On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. As Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, he generates both mesmerizing suspense and astonishing empathy. In Cold Blood is a work that transcends its moment, yielding poignant insights into the nature of American violence.", "title": "In Cold Blood", "url": "https://www.goodreads.com/book/show/168642.In_Cold_Blood", "average": 4.06, "cover": "https://images.gr-assets.com/books/1424931136l/168642.jpg", "reviews": 12887, "authors": [{"url": "https://www.goodreads.com/author/show/431149.Truman_Capote", "name": "Truman Capote"}], "type": ["Nonfiction", "Classics", "Crime", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/168642.In_Cold_Blood", "http://www.goodreads.com/book/show/9920.In_Cold_Blood", "http://www.goodreads.com/book/show/16098650-in-cold-blood", "http://www.goodreads.com/book/show/29361284-in-cold-blood", "http://www.goodreads.com/book/show/5096865-in-cold-blood", "http://www.goodreads.com/book/show/882485.In_Cold_Blood", "http://www.goodreads.com/book/show/3405186-in-cold-blood", "http://www.goodreads.com/book/show/774782.In_Cold_Blood", "http://www.goodreads.com/book/show/8294562-in-cold-blood", "http://www.goodreads.com/book/show/2289.In_Cold_Blood", "http://www.goodreads.com/book/show/27401851", "http://www.goodreads.com/book/show/2339175._", "http://www.goodreads.com/book/show/251688.Breakfast_at_Tiffany_s", "http://www.goodreads.com/book/show/2287.Other_Voices_Other_Rooms", "http://www.goodreads.com/book/show/9919.A_Christmas_Memory", "http://www.goodreads.com/book/show/60483.Music_for_Chameleons", "http://www.goodreads.com/book/show/9924.The_Grass_Harp_Including_A_Tree_of_Night_and_Other_Stories"]}