{"ratings": 997169, "userreviews": [{"userName": "Steph Sinclair", "userReviewDate": "Jun 08, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "I want to give a big old round of applause to HarperTEEN and their insane marketing campaign. Bravo. That is not mockery, but a legit salute. I sincerely have to give it up to you for convincing me that I had to own this book. I was caught up and boarded the Twitter hype train as it drove me round and round the blogosphere's Factions. (BTW, I still don't know who drives the damn train.) So, by the time I stepped into my local bookstore and laid eyes on Insurgent I happily handed over my $17.99. I wasn't thinking logically. It was as if I was under a simulation. (HAHAHA! Did you see what I did there?)And that ending? Ugh. I... I... I need a moment. Let me just stop myself right here before I end up writing a really negative review and 1 starring one of the most anticipated books of 2012. But know I am displeased. VERY. Just look at how long it took me to finish the book! -----------------------------------------------What a shame. The most anticipated book of 2012 is my most disappointing read so far. After all the positive reviews I read, I knew for sure I'd love it. Unfortunately, it didn't work out that way. I was conflicted on whether to give this book one or two stars. In the end, Insurgent's saving grace is that it simply doesn't belong with some of my other one starred books. So, I feel I must warn whoever stumbles across this review: If this is one of your favorite series and you love it with the burning passion of a supernova, this review might have the potential to piss you off. It might be best for both you and I if you just hit the back button now before things get going. Go on. Spock and I will wait.*whistles*Oh, you're staying, huh? Well, strap yourself in because I have a feeling it might just be one of those reviews...Spock tells me this review must contain mild spoilers in order to logically explain this illogical novel. Sorry, kids. Spock's call.The first big negative right off the bat was that Insurgent picks up directly after Divergent left off. There is virtually no recap to the story or characters and if you read the book a year ago, well, you may be screwed. But thankfully, Roth wrote up a lovely little cheat sheet for just this purpose. Yay! However, the problem doesn't just lie with remembering names. It lies with the connection the reader may or may not have had with the characters in Divergent, which was now non-existent since I could barely remember who was who. What's that you say? So and so just got shot in the head? I'm sorry, I can't find a single fuck to give. Then, we are introduced to even more characters. So, not only do I have to attempt to remember the old characters, but I have to keep track of these newbies too? That's just way too much work. Obviously, this isn't really Insurgent's fault, but I thought it would helpful to point this out.The Plot:What happened here? What happened to the action packed dystopian series I was introduced to in Divergent? Where the hell was Tris and why was Bella playing her role? Why did Four suddenly update his Facebook status to Douche Bag? Who's idea was it to turn Insurgent into a Dystopian Romance? One thing I loved about Divergent was that the romance took a back seat to the story and action. But in Insurgent the action is scattered with a heavier focus on Tris and Four's relationship. Look, that is not what I signed up for. I really don't care if Four loves Tris or if they'll end up riding a unicorn that poops rainbows as they ride off into the sunset. Whatever, whatever, whatever.So, the Erudite are trying to take over their world by creating a new serum for those that are Divergent while the Factionless plan a rebellion. But all that usually happens in the background with occasional mention to keep the reader up to date. Most of the novel we are stuck in Tris' head as she goes into angst mode over Four, her parents and Will. It was so boring I felt like I was stuck in a throwback episode of As the World Turns. On repeat. Save me. But wait! We have a random plot twist at the end right before the battle is about to go down. Marcus (Four's abusive father) decides to enlist Tris to help him retrieve information stolen from Abnegation. He tells her it's super secret and that he can't tell her what it is because it's something you have to see, that she'll just have to trust him. Doing so would betray Four. She agrees.Wait. Pause.Tris hates Marcus. Tris loves Four. Tris doesn't know what information they would be retrieving. She also doesn't know if Marcus is telling her the truth. She has absolutely no reason to believe him. No real evidence to back up his claim. She agrees. Without much thought. Tris is supposed to have an aptitude for Erudite, right? She's supposed to be logical, RIGHT?!Tris, pack your bags. I think Spock has just voted you off the island.That makes no sense! And then when I found out the super big secret, guess what? He could have easily told her! I smell and easy plot cop-out, folks. The secret is kept long enough from the reader just so it can push you off the cliff on the last page.World Building:In Divergent I let a lot slide and roll off me because I was entertained throughout the entire book. I'm known to do that with a lot of books like Wither and Across the Universe, for example. I could not do it with Insurgent. You see, I have the attention span of a fruit fly. If I'm not fully engaged in the book, I'm going to notice things. Things I probably wouldn't care too much about if I were enjoying myself. Like how the Erudite wear glasses just because they're smart. Or how even though Tris is emotionally unbalanced 16-year-old, everyone still looks to her to \"analyze the situation.\" Or even how impossible I find these factions. How is it that you can put all of these traits into neat little boxes and ask a person to choose one over the others? This is the same problem I had with The Hunt. In both novels the author tries to pitch an idea of human behavior completely different from what reality is, but you can clearly see the flaws with it. However, the main character fully believes in that world and way of thinking. They try to rationalize it, convince you of it. Yes, I realize it's a Dystopian novel, but this is a hard concept to sell because it makes it difficult for me to sympathize with the main character, their conflicted feelings and understand their world. Believability is key for me and I have a hard time believing this world. Tris frequently switches back and forth between her Dauntless, Erudite and Abnegation sides. Other characters comment on her embracing one trait depending on what the situation calls for it. But this doesn't work for me. Real talk, you can't just put logical thinking back in the toy chest when you decide you don't want to play with it anymore. It doesn't work like that. At least... I don't think so. Spock?I'm getting no-ish vibes.Tris:This series gets a lot of comparisons to The Hunger Games and in a way I can see why. You have your young girl who, one way or another, plays an important part in bringing forth change to her society. And if I really had to compare the two, I'd say that Insurgent is like Mockingjay. Tris is depressed, struggling to hold it together and fight in the war. The difference comes into play when Tris borderline gives up, while Katniss kicked ass until the very end. I'm not saying Tris didn't have the right to be depressed because I do believe she did. But it was really over done for me. I felt like I was drowning in her angst. This book is over 500 pages long and most of the action doesn't even show up to the party until the last 30 pages! So what was Tris doing for the other 500 pages? Not a damn thing. No, scratch that. Spock tells me that is inaccurate. Tris was in fact doing something. She was off being selfless, trying to get herself killed so that no one else would die. Bella is that you? I didn't know you did Dystopias now! That irritated me to no end. At one point she turns herself into the Erudite because they threatened to kill off people until Divergent started surrendering. So, of course, Tris thinks it has to be her and sneaks off to give herself up before the Dauntless can form a plan. Now, let's think about this logically. Tris knows the Erudite want to experiment on her for a Divergent-proof serum. Which means more people would be enslaved and/or killed because of her turning herself in. *facepalm* Then she almost dies, but it was too late because I had run out of fucks by then! So I had to shake Spock down for some.\nWhat do you mean you're out of fucks?! One of us has to care if Tris lives or dies!\nThe Ending:Okay, lots of spoilers here, folks. Spoilers all around from this point on.I didn't like the ending. I felt cheated because I had hung on for the ending. Everyone said how it made up for the rest of the book and what not, but here's the thing: The ending couldn't make up for all the angst-filled fluff the rest of the book was stuffed with. I didn't feel the anticipation throughout the novel and I hate to admit that I was really tempted to skim. The villan was killed really fast without much of a fight. I always hate when that happens. The villan has been giving the characters hell all throughout the story and by the time their number is up, they beg for their life and die by a simple stab wound?\"Yes, if you kill me you'll never find the information!\"*stabby stab*>insert blood and stuff<\"UGH! I'M MELTING!\"*dies*\nStill no fucks I see. That's cold, bro.\nAnd the big secret wasn't anything you couldn't have guessed from Divergent. It's revealed that the world is in chaos outside of the fence. Murders, destruction, etc. The weird thing is that I actually forgot about their society being enclosed in the fence until it was brought up near the end. It totally slipped my mind. But, I digress. The entire point of their society was to be a fresh start to the world. Somehow by boxing people in these Factions and waiting for the Divergent to emerge that equates to saving humanity. I'm not exactly sure how that works since the book just ends with that revelation and the Acknowledgements rolled. But I feel like Roth wrote herself all the way to a deserted island, sent up her S.O.S. signal and that cliffhanger fell right out of the sky to the rescue. *sigh* I really hate cliffhangers. It was one of the things that I liked about Divergent. For the most part things were tied up, but with Insurgent? It's quite the mess we'll be walking into in book three.Will I read the next book? Yes, because I've come this far and I'm hoping I will enjoy book three as much as I enjoyed Divergent. I think Insurgent suffers from \"Second Book Syndrome\" and the infamous \"Hype Train,\" may it die in a fire (the Hype Train, not the book). But ultimately, I'm interested in how Roth will explain away everything. Maybe then this whole series will make perfect logical sense to me. Until then, drink time, Spock?More reviews and shenanigans at Cuddlebuggery Book Blog."}, {"userName": "Lyndsey", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/4224396-lyndsey", "userReview": "All right. Start it up \"We Will Rock You\" style, now.Clap, clap, stomp. Clap, clap, stomp. Clap, clap, stomp. Clap, clap, stomp.We are, we are DAUNTLESSWe are, we are DAUNTLESSBeatrice, Now called Tris, Made a big changePlaying on the trains, She became a Dauntless one dayShe's got mud on her faceA parental disgraceNow she'll be kickin your ass all over the placeSingin'We are, we are DIVERGENTWe are, we are DIVERGENTTobias is a Dauntless, DivergentShoutin' to them all, We can take on the world todayErudite got blood on their faceWe'll put them in their placeInto the past, out of our Fear LandscapesSingin'We are, we are INSURGENTWe are, we are INSURGENTCome on!We are, we are INSURGENTWe are, we are INSURGENT\nThe Rundown\nOkay, I'm sorry but I am NOT going to give you a summary of this book. I knew nothing going in and I loved it that way. Everything was a surprise and I think maybe that's how it should be. Plus, you know you want to read it anyway.And if you haven't read Divergent yet... WHAT ARE YOU WAITING FOR?! Shoo! Go read it NOW.\nThe Plot and World-Building\nThis world in Insurgent is darker and even more exciting than Divergent. Each chapter raises the stakes until you're all in. The characters in this book are so much more alive than in any other book I've read recently. They have such fascinating layers and depth that I feel I could never uncover all he secrets they hold. Luckily, Veronica Roth is amazing at helping us do just that. The characters are masterfully unraveled before our very eyes. Insights unlocked that I'd have never seen coming.The same goes for the storyline. There are things happening in this book that I wouldn't have once guessed. And I consider myself pretty adept at figuring out storylines. Every new plot twist is a welcome surprise. Every new bit of info is an exciting reveal.I was very pleasantly surprised that the romance storyline DID NOT overwhelm the majority of the plot. This was a book about society and about war and about dealing with everything that comes with both of those. That's what dystopian fiction is supposed to be about.The plot expands greatly upon what we know about the society and it's background, which in the first was mostly nil. I was thrilled with the way the information was revealed and what it means for the future of the series.\nThe Characters\nTris really FEELS the emotions brought on by the deaths that she believes herself to be responsible for, even when she had no other choice. In fact, she feels her feelings almost too much. A lot like the way people really do in even less dire real life situations. She's just an ordinary girl in an extraordinary situation. At least, that's how she sees herself. She doesn't at all realize how strong and extraordinary she really is.As much as I love Katniss from The Hunger Games, I never really felt her inner turmoil the way I do with Tris. My stomach clenches when I think of what she's gone through so far. If I think about it too much, I'll get nauseous.On another note, I have a tiny gripe about the passages involving Four's looks, like this one: \"Some girls might focus on the way his ears stick out, or the way his nose hooks at the end.\" Plus, many other little ones about his spindly long fingers and gaunt face.Wow, move over Fabio! Lemme at him!! GOOD LORD, this woman really does not want us to find Ol' Toby attractive, does she?  I appreciate that he isn't your typical \"hero\" type, because let's face it - not every guy has long blonde waves and gleaming teeth. But not every girl finds that kind of guy attractive either.  It doesn't have to be one or the other. I would like a bit sexier description of him from time to time. You know, something that doesn't make it sound as though he looks like Beetlejuice.For example, most people wouldn't call Edward Scissorhands himself a classically handsome man. If you tried to, you could make some of Johnny Depp's characters sound pretty hideous in a text description, but he somehow manages to transcend the gloomy and unique nature of those characters and bring them to life in a way that makes them sexy and intriguing. I just would like a little something like that in the description of Four in the future.\nThe Romance\nFirst off, yes, I still call him Four. Tris switches off between calling him Four and Tobias in the book. Lately, I've found myself calling him Tobias in my head but when I write it, it usually ends up being Four. I mean, that's what he was called throughout almost the entire first novel... but the name Tobias is starting to grow on me.To be honest, I was afraid that Tris and Four's relationship would go down the cookie cutter route. I couldn't be more thrilled with the direction their romance has taken. They have real issues that they work through. There is no angst purely for the sake angst. It's all based on their present and past situations. If you're looking for a lovey dovey, pink fluffy unicorns dancing on rainbows kind of relationship, then sorry but you won't find that here. Sorry to burst your cotton candy bubble gum bubble. And yes, I know I'm evil. *sly grin*There's angst and arguing but NO love triangle with the main character. At least not one that was discernible to me. If there was one, it was a ninja assassin love triangle.\nThe Verdict\nLOVE, LOVE, LOVE. I cannot wait to get my hands on the next book in this series. Insurgent was an incredibly delicious, exciting, and emotional read! But mostly, it just flat out made an impact on me.The other night I was watching Merlin, which has newly been added to my list of all-time favorite TV shows, and there was one particular moment where a character shows a redonkulous amount of bravery in a certain heartbreaking scene which cannot be named, and I literally thought to myself \"That's so Dauntless.\" That's the power of the world that Veronica Roth has created. When a story becomes part of pop culture, when it is so unique and recognizable that it can be spoofed or merchandised, and when it's terminology works its way into your everyday life - that's when you see the true power of literature. I believe that this is one of those stories.Oh and by the way, I want a T-Shirt with the Dauntless faction symbol, so... someone get started on that ASAP. *snap, snap*The winner of the Divergent and Insurgent PRIZE PACK has been announced on STRANGEMORE.COM. Check the Rafflecopter Widget to see the name of the winner!"}, {"userName": "Emily May", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "The size of my disappointment probably has something to do with why I can't bring myself to award this two stars. I know Divergent isn't really a great book, the dystopia makes no sense, the Dauntless are ridiculous people who jump off trains to prove themselves... but, for me, it was still a wildly entertaining read. It was fast-paced, full of action, Tris was delightfully kickass, and the romance between her and Four complemented the main story without overtaking it. Insurgent failed on all of those.Normally, I might put it down to middle book syndrome and carry on with book three anyway, but not this time. Even though no time passes between the end of the first book and the start of this one, Tris and Tobias/Four feel like completely different characters and this is an inconsistency I can't forgive. Whatever happened to tough Tris who made difficult decisions and put survival above all else? She has disappeared and in her place is a \"heroine\" quite like the majority of other young adult romantic heroines. Tris is now solely concerned with Tobias and their relationship angst, I lost count of how many pages were filled with their make-out sessions and melodrama.Tobias also seems to have changed a lot more than his name. I really liked his character in Divergent, I found him to be sweet, kind and a little mysterious (indeed, in this book he was the only mystery). However, he has been replaced by someone who is aggressive, always frowning and frequently yells at Tris. He used to be so cool, even in a crisis - so what the hell happened? I couldn't even begin to believe in a story where the characters had changed so dramatically without logical reason.Plus, there's also the whopping great fact that nothing actually happens. Okay, so let me be honest, I read the first 300 pages and then I skim-read the rest. So I suppose that it's entirely possible that I missed something really good, it couldn't have saved the novel for me anyway, but I'm just saying that it is possible. In those first 300 pages, though, nothing happens. People sit around talking about their problems and what they should do, Tris repeatedly remembers her parents (I know she's upset, but can't we move on to the current drama?), Tris thinks about Tobias, obsesses about Tobias, worries about Tobias, tries to solve the mystery that is Tobias...Basically, the first 100 pages go something like:- Tris and Tobias make out- Tris thinks about where they should go from here- Tris and Tobias make out- Tris and Tobias talk about where they should go from here- Tris and Tobias make out- Tris thinks about her parents' deaths- Tris and Tobias make outI honestly don't care about their relationship. Maybe I did when I liked their characters, but now I don't even recognise them. It's not even that I doubt Roth has some brilliant ending planned for the third book, it's more that I no longer give a single damn about Tris or Tobias. I didn't even care enough to read this book properly and find out what happens at the end. I think it's clear that this series just died out for me."}, {"userName": "Ellie ", "userReviewDate": "Jun 14, 2011", "userURL": "http://www.goodreads.com/user/show/4827159-ellie", "userReview": "[dissolve into a shower of tears for weeks and weeks. (hide spoiler)]"}, {"userName": "Maggie", "userReviewDate": "May 11, 2011", "userURL": "http://www.goodreads.com/user/show/3928317-maggie", "userReview": "FINALLY the book is out! After months of waiting, I managed to snag this book on the day of its release and thank goodness for that!**Warning: There will be no spoilers of Insurgent, only of Divergent**After having not been immersed in the Divergent world since the first book came out last year, I had qualms about diving headfirst into Insurgent without refreshing myself with the basic events that happened prior to the start of this novel. However, having neither the time nor the care for rereading a book with this enticing, new, fresh book lying in front of me, I decided to be a Dauntless and take the risk (small risk, but hey, it's the thought that counts).My first thought? That rereading Divergent would have been unnecessary in the fact that Insurgent picked up right where Divergent left off and had enough continuity to it that I slowly but surely picked up all the dormant pieces of information that I needed to know for this book. The action picks up right away, and my worries for this book, the middle book of this trilogy, were completely blown away with the events that happen. Oftentimes the second book of a trilogy slows down and loses some, if not a lot, of the pacing of the first book, only for the climax and the denouement to pick up drastically in the finale. Insurgent, however, did not disappoint me in that way.I loved so many things from this novel, many of which I will point out below:STRONG FEMALE LEAD: Tris is a kickass sort of person, and there's no denying that truth. Not only is she Divergent, but she's also a particularly strong type of Divergent, which we had all the clues for in Divergent but were not pronounced clearly until now. She is inherently strong, but she isn't invulnerable; she shows weakness when we expect her to, just like any human and regardless of her Dauntless faction. She's strong, but she's not overly ambitious, unlike Jeanine and other people who will rise up to power and take advantage of the chaos. What sets her apart from others is that she has all the capabilities of a leader, yet she shows enough humbleness and humility to know when to step down. I was feeling iffy about the polarization of characteristics between the different factions, but Tris's multiple affinities make her more well rounded and more admirable for what she chooses to do instead of what she can do with the capabilities she has.FOCUS OF THE NOVEL:Come on, I didn't read Insurgent for its romance. It's obviously a perk, of course, but the romance between Tobias and Tris isn't the main focus of the novel, not at all. The conspiracies, the conspiracies within the conspiracies, and the struggle between choosing what feels right and what logically is right is oftentimes employed here that makes you want to read further and further to see who's really the good guy. And then somewhere along the way, you realize that the good guy may not be the nicest guy. I think Roth aptly puts this to justice when she writes: \"And while he has done cruel, evil things, our society is not divided into “good” and “bad.” Cruelty does not make a person dishonest, the same way bravery does not make a person kind.\" The multilayers to every action and every character makes you stop and think of the macro events, which is what I believe books should truly be about.REALISTIC OUTCOMES AND PLOT DEVICES THAT MAKE YOU WIDE EYED FOR MORE:Stemming from what I said earlier about events that occur in this book, I just want to say that Roth really does know how to set her pacing for the trilogy well. Just reading the revelations that each page brings shows the careful thought and planning that was placed into the creation of the Divergent world. People you thought you could trust to be on the \"good\" side suddenly aren't so clear anymore; everyone falls into some gray, fuzzy area on where their loyalties lie. The aptness of the adage \"the road to hell is often paved with good intentions\" fits in with this world, and many people think that the end justifies the means of their actions. This strikes out to me not only for the complexity it brings to the series, but also the reality of the situation that no matter how much you're a part of Abnegation, in the end human instincts demand that you take a look at the grand scheme of things and figure out how you're going to survive. It's not necessarily saying that people are inherently bad or good, it's just that everyone takes action for their own survival, and that ultimately pits people against each other, both realistic and true. Who you trust ends up affecting what actions you take, and quoted from Roth: \"People, I have discovered, are layers and layers of secrets. You believe you know them, that you understand them, but their motives are always hidden from you, buried in their own hearts. You will never know them, but sometimes you decide to trust them.\" Roth doesn't hesitate to pull out all the stops with layers upon layers of events that make Tris change her mind about which course of action to take countless times. It's the sort of thing that makes your brain freak with the constant flow of new information while it simultaneously processes what it just learned.CHARACTERS:'nuff said. You don't find multifaceted characters easily, and every single one of these characters has something to contribute to the Divergent world as a whole. Remember, it's a society where things were always a specific way when a huge wave of reform is about to strike violently at you. It's a time of strife and war, something that most of us in first world countries can't comprehend on a personal level. (I quote an example from Isabel Allende here: \"Once my daughter said to me that feminism was dated, that I should move on. Feminism is dated? Yes, for privileged women like my daughter, but not for most of our sisters in the rest of the world who are still forced into premature marriage, prostitution, forced labor\"). In such a setting, chaos is everywhere, and I can't stress how good it was reading about the diversity of people who, at the end of the day, all wanted to just survive. ENDING:I would be cautious of reading Insurgent if I were you. The ending was the most terrible, horrible, jaw-dropping cliffhanger that I've read in a while. We don't even have a specific date to look forward for the third book, either! I can't (well, yes I can, but you understand my shock) believe that Roth would put us through such misery of revealing such a huge closely guarded secret, the truth of all truths to Divergent, and then end it right when chaos breaks out. Such a tease, and such a brilliant move. That'll keep us fans holding on for sure.Would I recommend this book? Heck yes, without a single doubt. It's got action, suspense, adventure, mystery, and romance packed into it, and it was both cleverly and well executed. I couldn't ask for more of a novel, and I sincerely thank Roth for sharing it with us.The pre-review I had posted that gathered all the likes to this review:WHO REVIEWED IT ALREADY??? I'm tempted to give death glares to any that did because at this point giving it a rating is just petty hate mail. Judging by the average rating for the first book and the FACT THAT THE SECOND BOOK ISN'T EVEN OUT FOR ARCs YET, there should be no ratings! How can you rate a book based on what you're anticipating it to be???What it's rated now is by no means true, since we don't even know what the book is about!"}, {"userName": "Nataliya", "userReviewDate": "Apr 09, 2013", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "Uh-oh. Why did I break my promise to myself and read this book?Was it my curiosity? Well, I need to be more careful. After all, curiosity killed the cat - and I'm a Leo. Uh-oh.\nNow I'm afraid that this book may have made me use up a few of my allotted nine lives. O_O\nWelcome back to the senseless world of dystopian Chicago where you are only allowed to have one personality trait, which apparently is determined in what seems to be an equivalent of a 5-question multiple choice test. And this ridiculousness is presented very seriously. Let's catch up, shall we?If you happen to give your seat on a bus to an old lady - well, you must be selfless! Welcome to Abnegation where you can enjoy shapeless clothes and bland food.If you have ever wondered how stuff works and dared to ask a smart question - welcome to the EEEEvil Educated Erudites Exclusive Establishment! A set of complementary spectacles and a seat at the library are waiting for you!You frown upon lying? Welcome to candid life of Candor. Enjoy your lie detector tests! Now there's only one answer you can give to the eternal question, \"Does this make me look fat?\" (and punched in the face you will be, no doubt.)You are a tree-hugging (or people hugging) hippie? Amity, 'nuff said. You are a near-suicidal borderline sociopath who loves jumping off moving trains and beat the crap out of people??? Heh-heh. You must be Brainless Dauntless. Enjoy your youth because you'll die young and in true Darwin Awards fashion.But what if you happen to be a normal person with more than one personality trait? \nWhat if you are a tree-hugging gardening-loving hippie who helps old ladies cross the street while being able to truthfully recite 34 decimal digits of pi?????? \nHIGH ALERT!!!! YOU ARE DIVERGENT!!! THE HORROR!!! YOU ARE SOMEHOW SPECIAL!!! DANGER TO THE SOCIETY!!! RUN AND HIDE!!!!This how we left things in Divergent that for all its flaws was quite entertaining. Now we're moving on to Insurgent where ridiculous overpowers the fun amidst nothing happening.We start with our lovely heroine Tris, recently tortured and shot in the shoulder after which she lost quite a bit of blood - right away easily jumping off trains and running around like the invincible little special snowflake she is. When she's not defying basic laws of human physiology, she moons over her boyfriend Tobias, and tries to pull the traditional YA self-sacrificing for the sake of the loved one cliché.Peripheral characters die left and right in this book - but Tris is not even slowed down by serious physical injuries. It's like she's Superman's long lost cousin. And how exactly is she so badass? Is it her 'extensive' Dauntless training? I beg to differ.After a few weeks of haphazard training in the Dauntless compound - the training that appeared to consist of teenagers pummeling each other into pulp, shooting guns and throwing knives without any real instructions, jumping from moving trains, and never actually having time to recover from physical injuries, and playing 'Capture the Flag' - Tris is, of course, a highly trained physical menace. If that's what makes you so super-fit in this dystopian world, the rest of them must be so deconditioned they fall over from just walking.\nDauntless training: Left: what we are expected to believe it is. Right: what it probably looked like the entire time.Seriously, all the training happened in the previous book. This one really presents Tris as an accomplished badass - again, after a month or so of physical training. Really, book?-------Tobias, apparently less than impressed with Tris's special snowflake-ness, spends the majority of this book pouting at her, yelling at her, being bossy, patronizing, dismissive, and full of double standards. In the meantime, Tris spends quite a bit of time swooning over him, while Nataliya spends quite a bit of time perfecting the eye-rolling exercises (my version of Dauntless workouts, using eye muscles only). -------And here's the worst thing - in many many many many pages of this book not much of significance ever happens. Seriously.The rest of the story (the parts not about Tobias and Tris' relationship) consists of contrived yet repetitive situations in this ridiculously constructed world that is completely unsustainable the way it's presented that read like a 12-year-old wrote them. Go to a new compound, meet stupid and selfish/evil/plotting/weak leaders, engage in a confrontation with the Erudites, meet those prejudiced against you, watch a peripheral character die, do something noble, do something reckless, do something selfless, rinse, repeat, pass 'Go', collect some angst points.Most side characters are so under-developed and one-sided that the idea of the world where people are okay with being defined only by a single quality almost begins to make sense - except I think it's less deliberate planning than poor characterization. Add to this the fact that not much actually happens in this book to meaningfully advance the plot in any way - and you see how this can get juuuuust a bit frustrating. And the much-talked-about ending? I found it (a) ridiculous and (b) quite predictable - I called it not that far into the book, thinking about the only possible way a world so illogical as this one would ever come into being (and, in all honesty, I watched enough of M. Night Shyamalan's films to jump to the conclusion that is the Big Reveal. Call me nerdy? Well, yeah). Hey, but at least we get a mention of prefrontal cortex and mirror neurons in the context of pseudo-science of the Erudites here. Neuroscience Made Ridiculously Simple, huh? If things like that are what makes the Erudite seem smart, this world is screwed.By the way: What did smart people ever do to Veronica Roth? Erudite = Evil gets annoying rather quickly. Why is it that it's the \"brave\" who are awesome - and all the other qualities appear vastly inferior? Is it because Gryffindor in Harry Potter (another universe that sorted kids by their one defining character trait) housed the brave? Is it because bespectacled kids (the stereotypical 'smart') seem like easy targets on the playground? C'mon, Veronica Roth, smart kids are cool, oh-kay?Cool smart people. See - I'm not kidding.Anyway, 2 stars - I feel generous since I had so much fun looking for all the Big Bang Theory images for this review. I still may read the third one because apparently I enjoy torturing myself with eyeroll-worthy books.--------By the way, my review of 'Divergent' is right over here.And my review of  the final book in the series, 'Allegiant', is here."}, {"userName": "Eunice", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/6078895-eunice", "userReview": "4.5 starsWhen I first read Divergent, I was awed. I loved it and I really enjoyed it. However there was this small part of me that just cannot acknowledge that this series could be, like most reviews had said, leveled with The Hunger Games. I don't know, there was something I need to see or feel for me to be completely convinced that it is worth comparing to THG or say that it could be as great as THG. And well, great job Veronica Roth, because Insurgent just had me convinced that this series is indeed f*cking AH-MA-ZING! I was floored! I can certainly say now that this series could be leveled with not just THG but other really great dystopian novels as well. I was so happy this sequel didn't become a filler book, or that it didn't suffer on the \"second-book syndrome\" in which most second novels in a trilogy tend to be. I was surprised to realized that throughout the book there were so many things that actually happened, so many discoveries and things learned. I thoroughly enjoyed the parts where we get a look on each faction. It was fascinating and interesting to see how they work and learn their beliefs and principles and ways of living. I saw the good and the bad in each of them, their issues and flaws and realized how much their world were twisted seeing how it limited their people to have their own individuality. With her grief over the loss of her parents and her guilt over Will's death, Tris went through an intense emotional roller coaster ride. Her regrets and remorse from what had happened drove her to make thoughtless and careless decisions and actions. Which made me ache for her but also drove me pretty crazy and frustrated me a bit. It was understandable and believable though especially after all that had happened and obstacles they were still facing. With all those emotional suffering she'd been through she was still an amazing and admirable character, a really brave and strong-willed heroine. In the end she was able to find her way and realized the right things she has to do. Tobias/Four. I saw a lot of different sides of him in this book. His usual 'cold and aloof' facade he wear most of the time was gone. He showed a lot of emotions in this one and he'd been more open regarding his feelings. I saw a frustrated Four, a vulnerable Four, a regretful Four but also a very loving and caring Four and boy did I fall in love all over again!What I also loved so much in this book was how Tris and Tobias's relationship was handled. It was very real, believable and mature. I love that it showed how it was to have a relationship in a situation were too many obstacles, conflicts, emotional baggages were thrown. It wasn't easy and it wasn't always beautiful. But they were still able to overcome it. The downside of it helped established their relationship into a much stronger and more in depth one. I was touched by them and I just so freaking loved them. I found myself dumbfounded by the ending. It was mind blowing and I was seriously surprised. It wasn't really a brutal cliffhanger but it was a very good cliffhanger! I wasn't expecting that and it made me so excited for the next book! Overall, Insurgent was a very remarkable and impressive sequel! Once you read it, you'll never have a doubt about his series. I highly recommend it. Book 3, hurry up! :)) This review is also posted at Book OverdoseTeaser: \"He kisses me again, more insistent this time, his hands squeezing my waist. His breaths, his body, my body, we are so close there is no difference.\""}, {"userName": "Inge", "userReviewDate": "Apr 03, 2012", "userURL": "http://www.goodreads.com/user/show/6278820-inge", "userReview": "2.5 stars\nIf you have been following my status updates for Insurgent, this gif will look very familiar to you. That is because I have used it twice in a row. I wanted to use it again, but that might have been overdoing it. Sadly, I didn't enjoy Insurgent as much as I thought I would. The first 100 pages were a total snore-fest and I was literally vibrating my lips just like that, because that was more interesting than what I was reading. I already have concentration issues, and Insurgent didn’t hold my attention for very long. I really wanted to like this book. I wanted to love it and marry it and have tiny literary babies with it. I had high hopes. Very high hopes. Maybe too high. I think it is safe to say that Insurgent was my most anticipated book for this year. I needed this book, I was yearning for it. And it left me sorely disappointed.Since I read Divergent only a couple months ago, I didn’t have any trouble recalling who everyone was and what happened. Nevertheless, I did read the summary Veronica Roth provided us with and it freshened up my memory. I was good to go. I actually liked the fact that there were no pages wasted recalling everything that had happened in the previous book. That’s typical for this series – the speed. No time wasted. Just getting straight to the point. And I liked it. Lord knows this book was long enough as it was.Tris was not the badass girl we knew from last time. Don’t get me wrong, she had every right to be sad and less badass. I completely understand. I am a very empathetic person, you see. *nods* She lost both of her parents and killed one of her best friends. That’s bound to leave permanent, emotional scars. But she also turned into a whiny, Bella Swan-like persona, constantly whimpering about her past actions (the past is the past, Tris! You can’t change what happened!) and her relationship with Four. And don’t even get me started on Four. Okay, you’ve asked for it. Four, or Tobias as dear Tris now so lovingly calls him, was not the brooding, sexy Four we knew from Divergent. He was selfish (a Dauntless trait), mean, judgmental and not likeable at all. I was not able to swoon over him (a girl needs to swoon!) and basically I just wanted to whip him with a belt (oh yeah, I went there).There were too many unimportant characters I couldn’t care less about and the villains were so easily dealt with that it was laughable. As was the major cliffhanger. Only not. I saw the ending coming from miles away. It did not make me gasp, nor did it make me beg for more. I won’t have any trouble waiting for the third instalment, though I will read it, because I want to know how it ends. I assume this is a trilogy? I just hope Insurgent suffered from the ‘Second Novel Curse’ and Detergent (or however the third book will be called) will be a lot better again.And Tobias, I’m warning you. You better not be a fucknuckle anymore, or you’ll have to deal with my knuckles."}, {"userName": "Diane ϟ [ Lestrange ]", "userReviewDate": "Jun 19, 2011", "userURL": "http://www.goodreads.com/user/show/3442094-diane-lestrange", "userReview": "“Come on, Insurgent,”“What?”“Insurgent,” he says. “Noun. A person who acts in opposition to the established authority, who is not necessarily regarded as a belligerent.” I look at Fernando. The last time I broke into a faction’s headquarters, I did it with a gun in my hand, and I left bodies behind me. I want this time to be different. I need this time to be different. “I like it,” I say. “Insurgent. It’s perfect.”Once again I find myself with mixed views over a book. Middle books are usually filled with landscape designing, set up and transition for the next book so I usually didn't expect much from them. But Divergent is far from usual. And it’s ending? Let just say the expectation to the second book was set pretty high. I admit there were so many things I forgot about in this series. I had trouble remembering who was who -like with Tris guilt for killing Will (I can’t freaking remember who's Will was). To my defense Divergent was blindly fast pace and with a year gap between the two books it’s a bit disorienting for Insurgent to immediately jumping right in. Insurgent started directly after where the first book left us - Will's murder, Tris parents' deaths and the destruction of Dauntless and Abnegation, with Tris, Four, Marcus (Four's father) and Peter, all on the run. It picks up exactly where it ended - on the train.The first part of the story was already full of action. And comparing the amount of actions in this book to the first one? Better not, because this will give you no pause for time out. There is also a great sense of unease and unknown. As the book progresses, there are events that complicate and confuse me more that It made the pace kind of slow. But the worst was me keep guessing what's the unimaginable-scary-thing outside the fence that they kept secret -all the time. I really can’t get that out of my mind the whole time I’m reading this. It’s frustrating, like Tris-annoying-character-in-here.Insurgent has lots of loopholes and unpolished side that to my opinion is not that noticeable if you didn’t give it too damn time to criticize. Veronica writes with a believable heroine. I kind of hated Tris character in here, but it still believable none the less. I still like this book and still super like this series. The shifts gear of the ending was a major WHOA. And the other major thing that I really like is the -'It don’t have love triangle drama'! 'That' my friends, is a major plus for me._______________________________________________Post from Veronica Roth's blog about her 2nd book:INSURGENT!This post really wouldn't be complete without a dictionary definition, so here it is:\nINSURGENT.\n Origin:1755–65; < Latin insurgent- (stem of insurgēns ) present participle of insurgere: to get up, ascend, rebel.1. a person who rises in forcible opposition to lawful authority, especially a person who engages in armed resistance to a government or to the execution of its laws; rebel.2. a member of a section of a political party that revolts against the methods or policies of the party.3. one that acts contrary to the established leadership (as of a political party, union, or corporation) or its decisions and policies4. (international law) a person or group that rises in revolt against an established government or authority but whose conduct does not amount to belligerencyNot all of those definitions are equally applicable to the book-- some are more spot-on than others. But I won't tell you which ones yet.Now all I have to do is finish! Back to the writing cave!Now my friends if you haven't read Divergent yet well turn off that darn screen and run the hell out of your house and buy that freaking book and READ IT! NOW!Super love the title! <3_______________________________________________________"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "OMG! That ending! Well, now I'm going to have to binge the next two books along with some other books I'm reading so I will probably fade away into the mist somewhere! I loved this book a lot more than the first book. I'm seriously going to read that one again at some point because I think something was just off with me. I really think I had watched the movie so many times that it felt like I was kinda watching it again only not watching it and it was weird. Who knows!!! Movin' on . . . This book had a lot more going on and someone I really liked died. Well, a lot few people died in both books I liked but that's the way it goes. I'm going to have a hard time with the next books because I saw someone's spoiler about what happens to someone so that was a bummer. But, I'm going to get through it. So all of these factions are against each other now with all of the stuff that went down in the first book. Well, some are getting together to go against other ones. I can't keep up with them all. I just know that I like Abnegation and I do like the good Dauntless people. Oh, and the Amity people. It turns out Tobias is a very important man because of his parents. I still think he's crush worthy =) Not because of his parents, because it just popped in my head. Don't ask. Tris is going around like some kind of robot. It makes me wonder, I really wonder what is going on with her. I know the Divergent's are different but still, I wonder if something else is going on too. Caleb, her brother is a twat. I mean one minute he's this and one minute he's that but he's still with them. He's just easy to brain wash. Watch, I'm going to get to the end of the books and the author is going to say it was all a dream or something weird. NO ONE TELL ME! And I have to mention that I am in love with these hardback covers. I still had the plastic on the boxed set until I opened them last week and started them so I had no idea. I don't usually like those shiny weird covers, but these are awesome. I don't know if it's a different kind of shiny cover and they are so pretty and big and YES, I WILL JUST ADMIT I HAVE HUGGED AND PETTED THEM SEVERAL TIMES! There, you happy? I love my books, I can't help myself. On to the next and I'm scared =("}, {"userName": "Lola  Reviewer", "userReviewDate": "Oct 18, 2014", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "''You're too important to just... die.''\nThis book was extraordinary. Not like the first one at all, but a good different. A different that will bring many emotions out of you and will definitely hook you from the first to the very last page.\nI pout my lower lip for a second, but then I grin as the pieces come together. ''That's why you like me!'' I exclaim. ''Because you're not very nice either! It makes so much more sense now.''\nTris and Tobias have this incredible chemistry that is impossible to not see. They belong together. But that doesn’t mean that everything is easy for them. Not at all. They have to face many obstacles and ones that are quite dangerous but do they ever give up on each other? No. The don’t. And, they never will. At least, that’s what I’m hoping for, because they became one of my favorite couples of all time.\nCrying defies scientific explanation. Tears are only meant to lubricate the eyes. There is no real reason for tear glands to overproduce tears at the behest of emotion.\nThere are some witty sentences in this story. The writing is not only great but also intelligent. I think this author will be one no one will ever forget, if she keeps writing amazing stories like this one. I could have quoted this entire book, to be honest, since every written word was, to me, important and I read them with a vehemence desire to know what would happen next.There are actually many characters in this book that have a unique role attributed and ones you can’t imagine dying. However, there is a high number of deaths in this story. I don’t know how this will sound to you, but I actually like seeing characters die in these kinds of plots. Not main ones, of course not, but some that will only contribute to make the story seem more realistic or give intensity to some specific scenes.I do admit that there were times when Tris’ choices were a little…too much. And she does lie a lot. But, she has her reasons and she in fact learns from her mistakes. I’m definitely not saying that what she does is the right thing but she just has her motives and she believed she could succeed at everything she planned…so I did too, in a way. Very strongly.\n''What is wrong with you?'' I shake my head. ''Pull it together.''\n And that's what it feels like: pulling the different parts of me up and in like a shoelace. I feel suffocated, but at least I feel strong.\nI can’t recommend this series highly enough. It is worth it. It is actually worth putting whatever you’re currently reading aside and start this moving, well-developed, written and unique story."}, {"userName": "karen", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "wait, so book three is out soon, right?? RIGHT???second books are always hard, particularly the middle book of a trilogy. so many times, they just operate as filler - adhering the beginning of a story to its conclusion with unnecessary stickiness. most trilogies should probably just be duologies, you ask me.there are always exceptions: the border trilogy, chaos walking trilogy - where the middle book is actually the strongest, and books like kjaerstad's jonas wergeland trilogy, where each book is a perfect luminous gem. but usually, the second book will let you down.and this is NOT a bad book. it's just my expectations were too, too high. i loved divergent. loved it. and that was despite its having one of the more ridiculous premises i have come across in YA fiction. but it didn't affect my enjoyment of the book one bit, because her writing was so remarkable, and the pacing was so blindingly fast, i barely had time to register the silliness. and by the end, when i stopped to think, \"wow, there are some ridiculous foundations to that story,\" it didn't matter at all, because i had had such a wonderful time reading that book.this book is a much slower and more deliberate story, with more psychological character development that slows down the pacing just enough to really highlight its weaknesses.the strengths:tris is a fantastic character. i really love her. she is tough and foolish and headstrong and capable and athletic without losing her femininity. she is completely believable. and even though she gets lost in her own head for a great deal of this book, and that can be really frustrating, it is also very believable. i mean, with everything that has happened to her and those around her, i think giving her a little me-time to mourn and wallow is completely reasonable. i'm glad that she doesn't just bounce right back after everything, and that it affects her relationship with four and others around her. realism is appreciated.and her relationship with four is so refreshingly real. this is a very mature treatment of a relationship that isn't blinded by neediness or delusions of the others' perfection.i was really touched by them, if you want to know the truth. they each have their own shit going on, and a lot of this book finds them dealing with that shit independently, but they keep believing in each other and the strength of their bond. i love his expectations of her. he never tries to shield her or protect her because she is such a capable character, even with all her human frailties. she never needs to be put in a corner, even when she doubts herself. my biggest problem was just, again, the factions. i thought they were silly in the first book - these very limiting designations where everyone is one of five ways with very little deviation. silly. this one just made it a little sillier, with people leaving factions and going undercover into other factions, and blending with other factions in sanctuary, and i just got a little muddled trying to remember who is wearing what color and what that means and who is double-crossing and wearing a disguise and no one can tell because they are wearing red, so everything else is overlooked...i found it hard to believe in the built world, even though she manages to give enough details that it can be accepted as \"their world, not our world.\" suspend your disbelief,and you should be fine. you should read this book. you know you want to. just know that it is a more meditative volume. there is plenty of action (oh, boy, is there ever!), but overall, it is a more sedate and in-depth study of tris' world, and the way it affects the populace. read it for tris, if nothing else."}, {"userName": "Alejandro", "userReviewDate": "Mar 15, 2015", "userURL": "http://www.goodreads.com/user/show/665584-alejandro", "userReview": "I was glad that I decided to continue the book series!\n\nA FORETOLD DOOMED DYSTOPIA\n\nThey’ve made mistakes, of course, but they like everyone else, are a blend of good and bad.\nI commented in my review of the first book, Divergent, that the presented dystopia in the story was doomed to fail by itself, and it wasn’t any shock that happen, even due many of the observations that I did. So, I don’t know you, but I think that all was part of the plan......well, not their plan, of course......but the plan of the author, Veronica Roth......now I am realizing that she did all this intentional, and if so, it’s working wonderfully!\nSTILL THE SAME FACTIONS AND SOME ODD THINGS HERE\n\nThere is always something to learn, always something that is important to understand.\nAs I commented in my previous review......Amity and Candor are still a bunch of wimps and cowards (but as in anything, there are some exceptions)......Erudite still should be smarter to realice how faulty was this society system (but surprising enough, while the supposed “villains”, they were like the only faction trying hard to keep on the current system (by questionable methods but still)......Abnegation still is a bunch of hypocrites, and definitely is one of the factions that will suffer the worst part in this war......and Dauntless is still a bunch of moving trains jumping psychos (and now the favorite pawns of everybody)...While I say that Veronica Roth must do everything according to some secret plan of her own, still there are some odd elements in the narrative......how the heck a car took an hour to reach the Amity Headquarters from the center of the city? There wasn’t any traffic! I can’t believe that this city can be that big to need an hour to reach a compound in the limits of the fences......how is that all Abnegation house have the same inner structure? So far it seems, they took an already constructed city and they took it as their own place to live. Proof is in comments like the Candor Mart, the Ferris Wheel, and other buildings, so it’s really weird that all the sudden the Abnegation people have identical family homes......how the heck the Factionless have safe houses?! Was Dauntless (even before the shit hits the fan) sleeping? The Dauntless should be patrolling the whole city and securing non-occupied buildings, and even so, the Factionless should be contained in a sector without option of leaving the assigned areas. Now, the Factionless not only got free food and clothes, but also they can roam the entire city without supervisión? This dystopian system is everytime dumber and dumber......there was an odd comment at some moment telling that “Joshua” wasn’t an Abnegation name. Mmh. Hello! Tranfers! How the heck supposed to exist typical names in any faction if they keep tranfering a lot to other factions?\nTHE LONELY ROAD OF A HERO(INE)\n\nYou’re the best attack dog they’ve got.\nTris still can’t think of a world without the dystopian system that it has been her reality since she was born. One curious thing is that in this second book, Insurgent, the story starts just where the first book ended, there isn’t time displacement, so Tris is still with her injuries suffered during the events of the first book and with no time to heal, she will have to deal with that.Tris will be tested in her belief about the society system, but also her desire to know the truth behind it.However, she may not be prepared for the sacrifices that it will mean.Her loyalties in all levels and fields will be tested to the maximum.And it some moments, she will feel so lonely, but she may find allies in the most unlikely places.\nTHE TRUTH WILL SET YOU FREE\n\nThe truth has a way of changing a person’s plans.\nIn this book, the most inner secrets of Tris and Four will be in the open, and nothing will be the same anymore, but also, they will see how while weaker and more exposed they may be at first, now with their most personal shames known by everybody, now they are only stronger and even their enemies will be unable to push their buttons so easily now.\nFUNNY THING CALLED LOVE\n\nAnd sometimes, if you want the truth, you have to demand it.\nThe romance between Tris and Four is managed in an excellent way, since Four isn’t the perfect guy and he will do some mistakes and he will be contradictory in some of his actions, and Tris won’t be afraid of pointing out all that.I think that all that conflict makes a lot more interesting and real their love relationship without falling in cliché oversaturated romances.\nFORTITUDE IN CHARACTERS\n\nCruelty does not make a person dishonest, the same way bravery does not make a person kind.\nI commented in the first book, that the interaction and richness of the character was one of the strongest positive points in the narrative, and here, in the second book, that still the same for the good.The characters have depth, and sometimes they are so complex that it’s impossible to know what they will do or why they are doing it.The characters’ interaction is richful and with surprising twists in the least expected moments.One thing is certain, after this, nothing will be the same anymore in the story."}, {"userName": "Seth", "userReviewDate": "Jun 05, 2011", "userURL": "http://www.goodreads.com/user/show/1379900-seth", "userReview": "Ugggh. I wish that Tobias would just go by Four. Or Toby! That would also be good :D . . . THE COVER.I'm so freakin excited for this book!******EDIT AFTER READING*******I guess my excitement died down a little lol :P But it was really good still, even though I read it like two years after the first one :P"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "Insurgent (Divergent #2), Veronica RothInsurgent is a 2012 science fiction young adult novel by American novelist Veronica Roth, and the second book in the Divergent trilogy. As the sequel to the 2011 bestseller Divergent, it continues the story of Tris Prior and the dystopian post-apocalyptic version of Chicago. Following the events of the previous novel, a war now looms as conflict between the factions and their ideologies grows. While trying to save the people that she loves, Tris faces questions of grief, forgiveness, identity, loyalty, politics, and love.عنوانها: یاغی کتاب دوم از سه گانه ناهمتا؛ شورشی کتاب دوم از سه گانه سنت شکن؛ نویسنده: ورونیکا راث؛ تاریخ نخستین خوانش: روز بیست و ششم ماه جولای سال 2016 میلادیعنوان: یاغی کتاب دوم از سه گانه ناهمتا؛ نویسنده: ورونیکا راث؛ مترجم: امیرمهدی عاطفی نیا؛ مشخصات نشر: تهران، آذرباد، 1393، در 504 ص، شابک: 9786006225364؛عنوان: شورشی کتاب دوم از سه گانه سنت شکن؛ نویسنده: ورونیکا راث؛ مترجم: هدیه منصورکیایی؛ مشخصات نشر: تهران، نوروز هنر، 1393، در 413 ص، شابک: 9789647109567؛کتاب نخست از این مجموعه با عنوانهای: ناهمتا، سنت شکن؛ از نشر درآمده است؛ و کتاب سومش نیز با عنوان: «هم پیمان» لباس نشر در زبان پارسایی پوشیده؛ همین کتاب از سه گانه نیز، با عنوانهای: «یاغی» و «شورشی» چاپ شده؛ در آینده پس از جنگ جهانگیر، جامعه‌ ی شهر شیکاگو به پنج فرقه‌ ی مجزا تقسیم شده‌، که هر یک از فرقه‌ ها از یک فضیلت ویژه ی انسانی حمایت می‌کنند. نام فرقه‌ ها: فداکاری، صلح طلبی، صداقت، شجاعت و دانش هستند. هر سال در یک روز مشخص، همه ی نوجوانان شانزده ساله، بایستی در آزمون استعداد سنجی شرکت کنند؛ تا بدون توجه به فرقه‌ ای که در آن به دنیا آمده‌ اند، تصمیم بگیرند که باقی عمر خویش را، در کدامیک از پنج فرقه سپری کنند. «بئاتریس پرایر» شانزده ساله، عضو خانواده‌ ای از فرقه ی فداکاری ست، اما خصلت از خودگذشتکی، هرگز در ذات او وجود نداشته است. وی تحت تاثیر محیطی که به او فشار آورده، احساس می‌کند که به آن‌جا تعلق ندارد. بئاتریس در آزمون استعداد سنجی شرکت می‌کند، ولی نتایج آزمونش شگفت‌ انگیز است. وی با تمام ورودی‌های دیگر یک فرق اساسی دارد؛ چون یک ناهمتا یا همان سنت شکن است، و این موضوع می‌‌تواند زندگی خود و اطرافیانش را تحت تأثیر قرار دهد و خطرناک باشد و باقی خیال نگارگر خیال است که نگاشته و باید خواند؛ ا. شربیانی"}, {"userName": "Dija", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/2857113-dija", "userReview": "My overall impression of Insurgent is mostly bipolar - on one hand, I believe this was the only possible sequel to Divergent. On the other though, I feel almost cheated by what became of one of my favorite YA heroines and series. The latter is the more dominant of the two, and hence the low rating.Firstly, the brave, sweet Tris I fell in love with in Divergent is replaced by an angsty heroine in Insurgent who is a complete STRANGER to me. What happened to my precious baby?? I realize murder and war and the works have quite an impact on people's personalities, and I can understand Tris's anguish and depression, but letting it influence everything she does, to the point where she's making rash and careless and selfish decisions and pushing everyone who cares about her away - that just doesn't sit right with me. I seriously expected more from her.Secondly, I had to force myself to finish this. The plot wasn't boring, but since I was so puzzled by the characters' behavior, I couldn't really bring myself to read this in two sittings, like I did Divergent, and it had nothing to do with a lack of free time. Although I do admit that there were nearly as many \"OMG-WTF-just-happened\" moments in Insurgent as there were in Divergent, but where I was impressed by them in the first book, I was mostly unpleasantly surprised by them in this one.Another thing I absolutely didn't like? How Four (I refuse to call him Tobias) never seemed to understand Tris and that she needed love and gentleness after going through all that she did, not somebody to keep pushing her to the limit. After witnessing the chemistry and natural connection between the two in Divergent and how Roth promised there wouldn't be a love triangle, I was sure Tris and Four would become one of my most favorite couples in YA, once they actually got together. But while there were quite a few melty-gooey moments, they were greatly outnumbered by the moments I actually cringed inside by how crassly Four handled Tris. Still, I hope all of the above is just because this was the second book and Roth is saving all the great relationship development and intrigue for the next and final book, because otherwise, I am very, very disappointed with what became of one of my most-anticipated releases of the year. For more reviews, visit my blog."}, {"userName": "Emily", "userReviewDate": "Jun 26, 2011", "userURL": "http://www.goodreads.com/user/show/3464340-emily", "userReview": "If I thought the last book left me with a lot of questions, this one left me with even more. sdrftgbhjnkm. I wish I would have been able to just sit down one afternoon and read this book in one sitting, but I was so busy, but whenever I started reading, I wouldn't want to stop, but unfortunately something always got in the way.My opinions on different things through the book kept changing, and now that it's done, I can't quite figure out what I feel about most things.One thing I know for sure though, I still prefer the name 'Four' rather than 'Tobias' even though I had the whole book to try to get used to it."}, {"userName": "Katy", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/4572741-katy", "userReview": "3.5 stars - Wow, what an end! Overall, a pretty good book, but boy was it infuriating!First of all, I LOVED LOVED LOVED Divergent. But I didn't like Tris or Four very much in this book. I don't remember Tris being such a bitch, and I understand that she is Dauntless now, and she has been through a lot, but she is just so mean. And Four has more mood swings than a girl - especially for someone who was so stoic, not in actual feelings but in display of feelings, in the first book. The two made me want to shake them - and not in the \"you frustrate me so much you make me hot\" kind of way. No, they made me angry in the \"why do you keep TRYING to pick a fight with each other\" and \"why do you two insist on acting so stupid!\"As for the storyline itself. It started a bit slow, and it was a bit confusing as they moved from faction to faction - not because I didn't understand what was going on, but because I couldn't see how things were going to play out in the whole scheme of things. The real action doesn't really happen until much later, and I thought the end was kind of mind-blowing because it was NOT what I was expecting at all.Setting my frustrations with Tris aside, I did like how the book showed the different sides of her - proving she is a true Divergent, but I still don't understand a few things like what the Divergents' role in how are they supposed to help/hurt the \"mission?\" I guess this is going to be left for Book 3.Overall, it was a good book, but not nearly as good as the first book because I felt a lot was going on, and I was am left with so many questions at the end. I know it's trying to lead readers into Book 3, but I was hoping more would have been filled along the way."}, {"userName": "Clau R.", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/13061577-clau-r", "userReview": "More like 3.5 for me...I didn't liked this book as much as the first one (and not that I liked the first one THAT much, either). You see, in Divergent I loved all the part of the story when Tris was trying to win a spot in Dauntless, it was awesome to read. But when all the rebelion/revolution/whatever thing started, the book went down to me, and Insurgent is ALL about that! And Tris, God, she became insufferable! Always depressed, always taking reckless desitions, telling lies to Four, and she can't even hold a gun anymore. I mean, I tried to understand her, I think I would be worse if I had suffered the things she has, but sometimes she was boring to read. I liked Tris better in the first book.Also, the ending left me all confused, but I think that was the point."}, {"userName": "Jodi Meadows", "userReviewDate": "Mar 03, 2011", "userURL": "http://www.goodreads.com/user/show/4011205-jodi-meadows", "userReview": "Oh yeah. It's amazing . . . and even better than the first."}, {"userName": "Booknut", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/6917862-booknut", "userReview": "I am unable to type properly due to an extreme amount of emotion going through me at the present time. I am also thoroughly angered by the fact there aren't more than 5 stars to fill in. I feel something like this:\n\n\n\n\n\n\nI will try and post up an actual review on my blog...once I get over my fangirling and that horrible mournful feeling that is associated with the fact that I have just realised that Four isn't real and I will never become a Dauntless and marry him.\nReal life sucks. Majorly.(Previous review before reading it)\nSuper excited - Insurgent's nearly out!! I was reading the first few chapters that were released yesterday and I felt content, and I sat there thinking:\nOf course, I'm mainly reading it for Four (haha, very funny it rhymes):\n \n \nBut, of course, people just have to rain on my parade and say \"You know Four and Tris aren't going to last!\"\n\nListen guys: Four + Tris = Fourtris. Like a FORTRESS. Ever tried taking one of those down? Uh uh - I don't think so!I'm going to stop now, and go back to counting down the seconds until I get my hands on a copy of Insurgent!"}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "Mar 16, 2011", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "Hmm...I wonder what will happen to Peter. Will he become a better person or will he stay an a-hole?EDITFirst of all,I am NOT one of those people who give 5 star rating to every damn book they read(obviously) so I am NOT going to give Insurgent 5 stars just because Divergent was great. That is not enough. I know all of my friends will say I am crazy for not liking this book but after reading books for so many years I just can't put up with certain things. I understand some characters need to die in dystopian novels but there was so much death in here. Charley Davidson (First Grave on the Right) will have her hands full. I was completely in love with Divergent and I couldn't wait to see what will happen next. But after months of torture I got a lot of yawning and eye rolling. Tris was such a frustrated MC. The Elena Gilbert type of MC-she is always selfless,tries to do the right thing all of the freaking time. Now I'm thinking that I probably never really liked Tris. The best thing about Divergent was the story itself. Insurgent had a lot action but it felt kind of dry. It didn't had that spark-the think that got me hooked in the first place. I've said the same thing in my review of Legend. Also that so called cliffhanger was laughable. Is it even a cliffhanger? Dunno,don't care. How to rate this? I have no idea. In the end it wasn't bad but I need to remember in the future not to expect miracles from authors. One more thing,I have a major crush on Peter. I like him cause he is a bastard so that probably makes me a bad person. I just don't care,I want that twisted son of a gun."}, {"userName": "Miranda Reads", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "People, I have discovered, are layers and layers of secrets. \n Umm, no honey. You're thinking of something else... \nOf the three books, this book is the long-neglected and likely disturbed middle child. Not as fun as the first nor as smart as the third. Doesn't contribute or stand out. Essentially, it's just there, staring at us and wanting us to notice.  The \"plot\": Tris & Co. are betrayed, run to a new faction, cue long description of new faction/faction life, Tris & Co. are betrayed...run to new faction...etc. Literally, the whole book is Tris trapsizing around of the Divergent world. It's like Veronica spent too much time designing these factions and didn't want the effort to go to waste...hence we get the grand tour. Well, I shouldn't say that's all we get...we also get gems like this:\n“Killing you is not the worst thing they can do to you,\" I say. \"Controlling you is.” \n\nYou could completely skip this novel and not miss a thing for the third.  Oh wait. They do use the classic 'government knew of everything and manipulated every possible thing to get this exact outcome' popularized recently by the The Maze Runner. See? Unoriginal middle child.My favorite part? When Veronica Roth assumed we were too stupid to understand the title:\nInsurgent, he says. Noun. A person who acts in opposition to the established authority, who is not necessarily regarded as a belligerent.\nMind. Freaking. Blown."}, {"userName": "Charlotte May", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/14002983-charlotte-may", "userReview": "“People, I have discovered, are layers and layers of secrets. You believe you know them, that you understand them, but their motives are always hidden from you, buried in their own hearts. You will never know them, but sometimes you decide to trust them.” So much better than the first one! The factions are so fleshed out, we see rounded characters with numerous flaws and traits. I loved Tris’ character development, she has learned and changed from the way she was in book 1 and her relationship with Tobias is supportive and healthy. When war breaks out among the factions and Erudite begin using simulations to control the minds of others it is time to act. The Divergent are being hunted and studied - but why? And what is this information that Erudite supposedly stole from the Abnegation? Full of action, twists and turns. This was a vast improvement on book 1 and I’m excited to see how the trilogy will end.  “Insurgent,” He says. “Noun. A person who acts in opposition to the established authority.”"}, {"userName": "Wendy Darling", "userReviewDate": "Sep 21, 2011", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "Meh. I really liked the first book, but somehow this one just didn't grab me as much..."}, {"userName": "Brodie", "userReviewDate": "Mar 14, 2011", "userURL": "http://www.goodreads.com/user/show/2748076-brodie", "userReview": "It's safe to say that Divergent was THE novel of 2011. It quietly snuck up on me at the time and completely BLEW ME AWAY. So naturally Insurgent has been my most anticipated sequel of 2012. Did it live up to the hype? Not at all.IT OBLITERATED IT.Insurgent picks up instantly where Divergent left off, with Tris, Four (Tobias), Marcus, Caleb and Peter having escaped the horrors of the Erudite attack and now seeking refuge in Amity. I'm pleased that we got to explore more of both Amity and Candor this time, but true to Roth-style, they are not always as black and white as they seem in theory. I'm not going to delve too deeply into plot specifics, because it's the surprises that are the most exciting. But Insurgent is the most thrilling, emotionally evocative and addictive (you must have god-like willpower if you can put this down for a SECOND) sequel I have ever had the jaw-popping, eye-bulging, electrifying joy to read. Tobias and Tris? Favourite. YA Couple. EVER. I want MORE relationships like this in YA. It's secondary to the overall plot, but when it's focused on, it so intimately sweeps you up in the moment. I swear, I've never slowed down so much during the sexy-scenes of a book, just to savour every single word and fully appreciate the emotions both characters are feeling with every heated second. What they have is not puppy love. It's POWERFUL. It could destroy whole worlds with it's quiet intensity. They are magnetic in a way only Veronica Roth can pull off. And even when they're at odds with one another, which they are for quite a lot of the novel, with tension so thick you can taste it, the relationship slows to a simmer, but the desire rages on and every touch, every look shared across a roomful of people or tense conversation filled with longing and frustration, is simply put: f****** brilliant. Their relationship is layered and complicated, nothing is simple, nothing is easy, but every obstacle is so goddamn worth it.Tris is one remarkable heroine. With all she endured in Divergent, we see a girl carrying a heart full of guilt, regret and raw pain. She lost so much and she incited loss too, the guilt of Will's death plays heavily on her throughout Insurgent. She goes through one heck of an emotional roller coaster, but through it all, even when she falls to the lowest of lows and especially when she doesn't believe she can go on, she does. She keeps fighting, because she is a survivor. She is still Tris. Brave and strong and not without fear, but not without fury and fire too. She's smart and resilient and one of the strongest, most complex and admirable heroines I've seen in YA. Even if at times you might not agree with her decisions, you still cheer her on and not for a minute does she allow you to become disengaged in her story.Revealed are more sides to Tobias and oh, in the name of all that is holy and Dauntless, I am in love with this boy. He's not without his frustrations, mystery and secrets, but that is what makes him so captivating. It's his flaws that give him intrigue, mixed with a beautiful kindness and exhilarating, sometimes scary side. Four.... Tobias... he is a thrilling specimen. Sometimes I wish Tris was more expressive with him, because you could see in certain moments the pain and sadness he was holding back, but it made for the kind of emotional angst that is torturously delightful. Tobias goes through his own emotional turbulence in the sequel, some of which puts him in a position where he and Tris struggle to stay on the same page, but each has their own reasons, each fueled by the right motivations, and while it's painstakingly messy sometimes, both Tobias and Tris shine as individuals.New alliances form, old ones shatter. Known faces are shown in an entirely new light; some for the good, some for the worse. I love how Veronica can so expertly shift your perspective on a character. She does it slowly, sprinkling clues, building up to the moment where she lays it all bare and you're left gasping for an oxygen mask. An uprising is well into play and our favourite characters are right in the centre of it. War, deceit, love and pain are crashing upon us and Veronica is not afraid to throw in all she has, leaving you to wonder how she'll recover to do it all again in the next book. I laughed, I gasped, I melted, my heart ran a marathon at dizzying speed and I bit my knuckles so hard I'm surprised I didn't draw blood. The action is as pulse-pounding as ever, the secrets are more earth-shattering and the suspense will almost kill you. It has all the brutality, intensity and surprise of Divergent, but - and I never thought this possible - it's even better. Insurgent is every bit a worthy successor to the novel that smashed so many favourite lists of 2011. Veronica is an author who deserves to rise to the same kind of fame as Rowling. Yes, I am really going there. Insurgent is THAT good. And I am counting down the SECONDS until the third installment, because with the way she ended things? OMFG. DON'T END. DON'T END. DON'T END. DON'T END. *IS DEAD*"}, {"userName": "Brigid ✩ Cool Ninja Sharpshooter ✩", "userReviewDate": "Sep 18, 2011", "userURL": "http://www.goodreads.com/user/show/886144-brigid-cool-ninja-sharpshooter", "userReview": "Warning: this review will probably contain five billion spoilers (more or less). And I probably won't cover them up or anything because ... I just don't want to. So if you are avoiding spoilers for this book like the plague, you should probably just go away.All right, now. Here we go.Let me start off by saying, I really liked Divergent. It wasn't the most fantastic or original thing I'd ever read, but it was a fun read. It was exciting, it had some cute romance, and so on. I read the whole thing in only a few sittings.I found Insurgent to be much more tedious to get through. While the first book kept me hooked and seemed to go by in a flash, this book seemed to drag on for ages. That isn't to say I didn't like it––because I did like it. I just don't think it was as strong as Divergent. Of course, middle books in a series tend to be the worst, and since the end of this one set up a lot of interesting ideas, I am still looking forward to the third book. So anyway, I think I will start off with the things I didn't like, and then go on to the things I did like. The length:It was just far too long. More than 500 pages, and there were probably only three or so small sections of it that really held my attention. A lot of the book consisted of characters essentially sitting around waiting for things to happen, having conversations that lasted for too many pages, etc. I'd say probably 200 or so pages could have been edited out. There was too much unnecessary fluff between important events, and it kept making me feel rather impatient. It got to the point where I wanted to jump up and shoot the wall out of boredom. Like Sherlock!Tris:Tris. Just. Tris. I liked her well enough in the first book. And even though she had her cool moments in this book ... over all she just started to get on my nerves. I think I said in my review of the first book that she wasn't a Mary Sue. But, after reading this book, I take it back. Because she was totally Mary Sue-ish in this one. First of all, there was her constant whining about how she'd killed Will. A classic Mary Sue trait is to agonize over something you did in the past, even though it wasn't really your fault. After all, she shot Will out of self-defense––and Veronica Roth seems to take every opportunity to try and justify why Tris shot Will, why she didn't have another option (even though she totally could have just shot in the arm or something instead of the head but ... oh well). Yet, no matter how people try to convince her, Tris can't stop ranting about how guilty and horrible she is. And yes, I know it must be a terrible feeling to have shot your friend for no good reason. But, the reader doesn't have to be reminded of it every five seconds. Yes, we all feel bad for you. I think we've established this already. At some point I just felt like:And to make it even more annoying, I think Christina forgave her way too easily. I mean, she just saw how people acted under the simulation and she was like, \"Oh, that's what Will acted like? Well then, I guess it was okay for Tris to shoot him in the head after all!\" Just ... No. Tris still could have stopped Will by just shooting him in the arm or the leg or any part of him that was not his head. I understand she was acting on impulse, but surely she could have thought straight for a second and said to herself, \"Because he's my friend, I should at least try not to kill him.\" Yes, I could understand Christina forgiving Tris eventually ... but it should have involved more effort on Tris's part. I mean, Tris really didn't do anything to earn Christina's forgiveness. She killed Christina's boyfriend, lied about it, and didn't tell Christina the truth until it was literally forced out of her in front of a large group of people. In my opinion, it was kind of a cop-out.Secondly, Tris became the self-sacrificing type––you know, the type of protagonist who is always easily willing to get herself killed to save everyone else. And sure, that's great and all, but I always have trouble believing that kind of thing. Yes, it's understandable that someone might sacrifice himself/herself to save someone he/she loves, but it's still a difficult decision. But in this case it kind of just felt like,EVIL PERSON: SO, WHO WANTS TO DIE?TRIS:She just kept wanting to die to save everyone else––but then at the last second she would change her mind, and then someone else would have to come and save her butt. Just ... gah.My last problem with Tris ... well, I'm not sure whether to blame it on her character or on Veronica Roth herself. But, there were just so many little things that Tris said/thought that rubbed me the wrong way. These were mostly subtle things, which I probably wouldn't have even noticed if I was reading quickly––and probably Roth didn't even mean for them to be offensive––but they just came off as feeling a bit careless and inconsiderate.For example, Tris made some remark about how Johanna \"would have been beautiful if it wasn't for the giant scar on her face.\" Umm. So, people can't be beautiful if they have scars on their faces? Sure, this was only one little sentence, but it could be rather emotionally damaging if, say, someone with a scar on their face were reading it. They would probably be like, \"Gee, thanks.\" Although this one I'm not so angry about, since later on in the book Tris said something along the lines of, \"Well, actually I realized that Johanna isn't beautiful despite her scar, but with her scar.\" So, okay Veronica. I'll let this one slide.Then, Tris also made a comment about Lynn that really bothered me. She made this observation about how under her baggy clothes, \"Lynn's body bends and curves the way it's supposed to.\" I was just like ... Excuse me? Supposed to? Implying there's a single way that all female bodies are supposed to look? I don't understand why Roth couldn't have just described Lynn as being \"skinny\" or something along those lines. But in this case, her word choice was just offensive.But I think what bothered me the most was Tris's response when Peter saved her life. He works so hard and goes through all this crazy shit to save her, and then a) she isn't nearly grateful enough, and b) she even goes so far as to criticize him for the reason he saved her. Because basically, what he says is that he felt he \"owed\" her for the last time she saved his life. And then for like a paragraph, she rants about how she \"can't imagine thinking like that\" and how you should \"save someone because you love them and not because you feel like you owe them something.\" And I'm just like,I mean, goodness gracious Tris! He didn't have to save your life, you know. He could have just let Jeanine kill you and been off on his merry way. But you're just going to sit there and be angry with him because he didn't save you out of love? Oy vey. So yeah. Basically, Tris became quite obnoxious. With her constant angst, self-sacrificing nature, and uncalled for criticisms of other people, I just started to lose sympathy for her.Tobias/Four:Again ... a character I liked in the first book. And now, I've grown kind of tired of him. I think he was more appealing in Divergent because he was all mysterious and secretive and whatnot. But I felt like by now, it feels less like he has interesting secrets to hide and more that he's just not that deep of a character. I do think parts of his backstory are interesting––like how he switched factions to escape his father, that kind of thing. But otherwise, I don't find him to be particularly likable.I think where I really started to dislike him was when he started beating up Marcus in front of everyone. Really, the whole thing just struck me as being a bit ridiculous.First, there was everyone constantly calling him a coward for running away from his faction. And that was like, literally the only thing people were doing to harass him. It was just like, \"HO HO HO, TOBIAS IS A CHICKEN!\"And he's like, \"I know a logical solution to this! I shall beat up my father in front of everyone to show what a badass I am!\" And I'm like, \"Gah, noooo Tobias. Just ... no.\" I understand that he chose Dauntless, and that being called a \"coward\" when you are Dauntless is a huge insult and all. But really, he's what––18 years old? He's an adult. I think he could be mature enough to ignore people until their insults died down. I thought his response to the situation was a weak one and it made me lose quite a bit of respect for him.But then there was also the way he treated Tris. I ... did not like it. One second he would be all over her, making out with her and telling her how wonderful she is. And the next second, he would be taking out all his anger on her and saying she was stupid and cowardly and whatnot. It was like he was totally leading her on and then pushing her away again, and it got quite annoying.Nevertheless, Tris is still obsessed with him. And then she tells him she loves him, and his response is, \"Say it again.\"Uhhhh. I'm sorry, what?I mean sure, after she repeats it he gives the normal \"I love you, too\" response. But still ... What? Telling someone you love them is kind of a big deal. And to command that they repeat it just seems unnecessarily demanding and rude. You're supposed to be grateful that this person had to courage to confess their love to you. You're not supposed to be like:*Shakes head* Well anyway ... moving along.The \"shocking twist\":- OMG BIG SPOILER BELOW -And by that I mean, the whole thing where Caleb turned out to be working for Jeanine. This is one of my greatest pet peeves. I just hate when a seemingly normal character just suddenly turns around like, \"BWAHAHA. I'M EEEVILLL.\"I just think it's a cheap trick. If there is some hinting towards it ... then okay, that makes it a little better. But if it doesn't have much foreshadow or justification, and the author is only doing it for the shock factor, that tends to piss me off. I think that's about all I have to say on the matter.WELL NOW. I think now would probably be a good time to explain the things I did like.Some of the secondary characters:This might seem like a lame thing to like, but really. There were a lot of characters I would have liked to have seen as the protagonist(s) rather than Tris and Tobias. Like Lynn for example. Or Uriah. They just seemed more interesting. While the main characters got rather annoying, I thought Veronica Roth did a good job with secondary characters and I wish she would have done more with them.Lynn especially. Okay seriously, I was reading this book like, \"La di da, I wonder if there will be any LGBTQ characters!\" Because I like LGBTQ characters. And then literally, Lynn confessed she was a lesbian (well, or bisexual possibly) and then died. Like, \"Oh hey everyone! I'm gay! .... *Dies*\"It just felt rather lame. Like Veronica Roth was like, \"Oh look, I made a gay character! I'm creating character diversity! LOL But I'm totally not going to explore that issue, so I'm just going to wimp out and kill her ...\" *Sigh* Oh yeah, isn't this section supposed to be about things I like? Well, I liked Lynn. That's the point. I just wish she hadn't died. The world-building:I thought there was a disappointing lack of world-building in Divergent, and I think it improved in Insurgent. The idea of the simulations is cool (although I'm not sure if scientifically possible, but oh well). Specifically, I think the idea of fear landscapes is quite interesting. Particularly the way Tobias interacts with his, how he checks it regularly to see if anything has changed. It's kind of like a really intense kind of meditation or something. As odd as it sounds, I kinda wish I could see my own fear landscape. Like sure, it would be really horrible, but it would also force me to face my fears and learn to conquer them or whatever. And that would be pretty cool. So yeah, I just think it's a thought-provoking idea.I'm also glad that Roth more clearly established why this dystopian world exists and what's going on outside of it. That was something that really bothered me about the first book (and what bothers me about a lot of dystopian books, really)––where I'm like, \"Wait, how did this society even come to be? Why did they think it was a good idea? What's going on outside of it, in the rest of the world?\" So, it's cool that she actually started to explain it. I mean, the explanation was pretty sudden and rushed, but still.The setup for the next book:Towards the end, I was kind of losing hope that Roth could set up enough plot for the next installment in the series. But, now I've become very curious. I'm interested in seeing what happens when these characters move out of their isolated society and into the real world. What are they going to do? How much, exactly, has changed? I didn't really expect to be excited to read the third book ... but now I am, because I really wonder what's going to happen next.So, yeah. This review had kind of become crazier than I expected. And I realize I made it seem like the cons really outweigh the pros. But really––over all, I did enjoy the book. I don't think it was as good as the first book, and I had a lot of issues with the pacing and characters and whatnot. However, there were exciting sections of the book that drew me in. Also, I think the world Roth has created is interesting and I do really want to see where she goes with it in the third book."}, {"userName": "Gerasimos", "userReviewDate": "Aug 10, 2012", "userURL": "http://www.goodreads.com/user/show/11731184-gerasimos", "userReview": "Like a wild animal, the truth is too powerful to remain caged.This is the opening line of Insurgent. The whole book is built around this opening line. Around truth and lies. And I didn't realise that until the very end. Divergent is one of the best dystopian books I have ever read. Therefore, I was very excited for Insurgent! For the most part of it, right until the last 100-pages, it was as good as Divergent was. But then everything changed! Insurgent was not as good as Divergent any more. It was ten times better! Insurgent is phenomenal. Divergent was amazing, but this book is spectacular! One of the things that I wanted to see in Insurgent was more world building. I was confused on how this society works, how everything started, what's outside Chicago, what's happening in the rest of the world... Insurgent addresses all those questions and the answers are unbelievable. This is what made this book so much better than Divergent for me. The world building. But all the elements that made me love Divergent so much can be found in here as well. The numberless twists and turns, the action, the agony. Reading Insurgent feels like you're drowning. The action, the emotions & the adrenaline hit you like waves that take your breath away. It is amazing how Roth can fill the reader with adrenaline and fear. The deaths in this book felt like water penetrating into my throat making me choke. Roth does not hesitate to kill main characters. In the first book this was painful, but in this one it is unbearable. The characters are so multidimensional, that you love them without even realizing it. When they die, it hurts. And then there is the sweet love story between Tris and Four. The love story in this trilogy is one the most believable love stories in YA literature. It unfolds naturally, beautifully slow. It is sweet and it makes you smile. I love it. In this book there is some angst in their relationship. While in most books I don't like that, in this one it adds to the story. In a ruined world that is dominated by war, angst is expected. Unlike Divergent this book does not focus only on the action, but it also goes deeper into character's emotions and feelings. The psycho-graphic part of the book is very well done. You can see the loss inside the character's heart, you can feel their pain. Their actions are compatible with what they have been through. Tris is not a heroine in the classic way. She is not fearless. She is a very human character that makes mistakes. How can a book be both action-driven and character-driven? I don't know. But Veronica Roth does it. The first part of the book was moving through a direction that I wasn't sure if I liked or not. It was very focused on the war between the factions and I was worried that we were not going to see the world building and the bigger picture of this dystopian society that I was craving for. I was wrong. In the second part of the book things happen that I wasn't expecting at all. Especially in the end, there was a twist after every second line. And then there was that huge twist in the end that I loved! This twist is what made me to love this book so much. I just cannot stop thinking about it. I was expecting some of these things to happen (one death in particular), but not that early! I was expecting them in the third book or something. But Veronica Roth surprised me again proving that it is just not possible to predict what will happen in her books. Another aspect of this trilogy that I love is how well it pictures war, violence, brutality, propaganda and political games. The messages in this trilogy against all these things are breathtaking. It is not just an action story. It is not just a love story. It has a little bit of everything. Agony, humor, twists, action, love, friendships, loss, grief, family values. It is a book that talks about braveness, the effects of war and the most important, how crucial choices are.I can't say enough for this book and for this trilogy. There are no words. One of the best dystopian trilogies and books out there right now! I cannot express how much I enjoy living in this world with this characters that I love. Four is a HUGE crush and Tris is one of the best heroines I have ever read. It is a story that will stay with me for a very long time."}, {"userName": "Mohammed Arabey", "userReviewDate": "Apr 04, 2014", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "Welcome Back to the World of Dystopian Chicago..Let's cut it short and get to the main reason of why my rating get higher than My Rating for Divergent..it's The MovieTris' character is more mature, The setting is truly breathtakingAs a male reader,One of the main reasons that bugged me with Book One was how Tris was dealing with Four's acts, touches, fingers and almost everything.. Here was almost the same ,even with her mourn for her parents and guilt for Will's death.Also with the relation between them growing it becomes more and more annoying, like those odd couples who just keep annoying each others almost EVERYTIME. ***“You didn’t tell me,” he says. “Why not?”*** “I wish you trusted me enough to tell me things like that.”***I feel a flare of anger—how many things is he going to keep from me?—and try to stifle it.***“Why should I tell you? You don’t tell me about your plans.”His straight eyebrows furrow. “What are you talking about?”It really almost made me mad again of the novel , But the movie made it better and thinking of \"Shailene Woodley\"'s portrait and performance for Tris was amazing ..It helped Also a good point for the movie to make the Divergent deal more clear, and didn't make the final moments of Tris' mother totally Out of Character -as she was in sleeveless shirts in the novel was totally ridicules-. =====*****=====The Second main reason it was better part is the Setting..The movie made visualizing the setting of the Dystopian Chicago more easier.. Also part 2 \"Insurgent\" has much more places to visit.. A thriller chases went throw every place in Chicago ,Amity headquarter to Factionless sector, to the Candor's headquarter to the Dauntless' one again.. back to the roots in the Abnegation's Houses and till we end up in Erudite's Headquarter ... I loved the thriller here and the action more than part one, But I still find some difficulty with the author Veronica Roth's way in describing some settings. \"The whole spying on the meeting with the Bridge ,girders, stone wall and the meeting place ,the river...the whole scene was a mess of description for me\"Just like that \"Pit\" description in part one gave me hard time getting the full picture of it.But the story really getting stronger, more thriller .. And the most important some of the mystery revealed , may be wasn't enough for me BUT it's really interesting to know..We finally know Why the Faction System...and what's all the fuss about the Divergent.Surprises , allies reunited and others broken.. new characters with mysterious shades, and a truly very interesting real scientific information about the Brain and reactions.I liked that depth ,It make me rate the novel from 3 to almost 4...And what makes me sure it is 4 ,and even 4+ is ..The Collector Edition********************The interview with the author Veronica Roth showed me that the pray scene at this part is not \"just a random scene\", she's a respectful religious person which I truly respect And that's a super plus point I can't resist not mentioning.One more thing..in her explanation of the \"too much deaths @ Divergent\" she refer to  Harry Potter and J.K. Rowling And that was a big \"WOW\" for me...I was expecting that since reading and reviewing DivergentJust mentioning how she's respect and like the Harry Potter Series is total honesty of he. and that's another BIG + for the Divergent series.One last thing I guess I was glad to buy the collector edition although I already got the Trilogy box set :)  The Free Four scene shows \"Four\" point of view of Tris...which \"again as \"older, male reader\" I respect and find that he complain the same as I did about how Tris sometimes just....Anyway :) finally, I liked that part way better, got more respect for the series \"and the author as well\" And not cause it again leaves me with a Cliffhanger \"even steeper that part one\" ,But I'm more willing to read Part 3 cause I want to have one more visit to....Dystopian Chicago....And The Divergent WorldMohammed ArabeyFrom 11th April 2014To 19th April 2014=====*****=====\"الريفيو العربي قريبا\""}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Sep 21, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "9%, that's it. I finished 9% and I can't go one more page. I have a rule, if I didn't get to page 100, I won't rate the book. Well, screw my rules. I REALLY disliked this book. Sorry. I'm rating it. And yes, I did read enough to rate it. No, I don't need to finish it. I don't care if there is something coming, or there is some great twist, or if it will all make sense in the end. The 9% I read was not good. The characters are horrible. This is not even a review. I'm just ranting. Thus, I stop to ponder a real review. Which means, I wait since I'm still annoyed that I read 9% of this book. Thank you Regina for reminding me of my own words and reminding me that it IS okay to stop a book."}], "description": "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.New York Times bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature.", "title": "Insurgent\n      \n          (Divergent #2)", "url": "http://www.goodreads.com/book/show/11735983-insurgent", "average": 4.06, "cover": "https://images.gr-assets.com/books/1325667729l/11735983.jpg", "reviews": 56953, "authors": [{"url": "https://www.goodreads.com/author/show/4039811.Veronica_Roth", "name": "Veronica Roth"}], "type": ["Young Adult", "Science Fiction", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/11735983-insurgent", "http://www.goodreads.com/book/show/13068756-insurgent", "http://www.goodreads.com/book/show/13425323-insurgent", "http://www.goodreads.com/book/show/13480671-insurgent", "http://www.goodreads.com/book/show/13598952-insurgent", "http://www.goodreads.com/book/show/25576955", "http://www.goodreads.com/book/show/15743060-insurgent", "http://www.goodreads.com/book/show/13335037-divergent", "http://www.goodreads.com/book/show/18710190-allegiant", "http://www.goodreads.com/book/show/18126198-four", "http://www.goodreads.com/book/show/13615258-free-four", "http://www.goodreads.com/book/show/18080920-the-transfer", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}