{"ratings": 46495, "userreviews": [{"userName": "Brina", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "Julia Alvarez has been one of my favorite authors for the past twenty years. Her memoirs, both fictional and nonfiction, are laced with poetic humor and often leave me with a smile on my face. Alvarez' family left the Dominican Republic in 1960 in the middle of the revolution to overthrow the dictatorial president Rafael Leonidas Trujillo. Because her father had connections, the family was able to escape. Yet, what of those left on the island? In this fictional yet poignant account of the Mirabal sisters who came to be known as the symbol of the revolution, Alvarez reveals the fate of those left behind. Minerva Mirabal always wanted more than to be a simple country woman like her mother. In a machismo culture where few women learned to read and write, she did not have a future although her dream was to go to law school. Her older sister Patria Mercedes believed to have a religious calling, and their middle sister Dede was the obedient one who went along with the other two. By age ten, the three sisters entered the La Escuela de Imaculada Concepcion and started down the path to both a higher education and to learning revolutionary ideals. Using poetic prose, Alvarez writes how the three older Mirabal sisters and their youngest sister Maria Teresa \"Mate\" came of age to be modern women. No longer would they be subservient members of a machismo culture but productive members of society who would make a difference going forward. Alternating chapters from the point of view of each sister, Alvarez expresses how each came to be a revolutionary from a unique place. Especially powerful, were the diary entries written by Mate throughout her life as she grasps what joining the movement would do to herself and her family. The sisters either married a cousin as was expected or for love, and all four couples played a role in the revolution that would take down Trujillo and bring democracy to the island. Known as the mariposas and meeting clandestinely outside the home of Patria and her husband Pedrito, the guerilla movement took root. Even their young children wanted to participate despite the danger involved. Trujillo's spies planted themselves on Mirabal land, equally determined to squash the masterminds behind the rebellion. This lead the extended family to live in constant fear and had me as a reader mesmerized by Alvarez' writing, showing she is gifted in relating powerful emotions across more than one genre. November 25, 1960, the day of the real life Mirabal sisters abduction and murder, is now the International Day Toward Violence Against Women. Through the courage and unwavering attitude of the Mirabal sisters and their families, the revolution occurred less than a year later. Alvarez points out in her postscript that even Dominicans living in the United States knew of the bravery of the Mirabal girls. In this powerful book which I rate 4.5 bright stars, Julia Alvarez tells her readers \"Vivan las mariposas\" so that we never forget these courageous Mirabals."}, {"userName": "Petra X", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[which is what the Dominican Republic is called in the Caribbean (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/835505-sarah", "userReview": "The first time I traveled through Mexico, I found this book... and read it in three days. Towards the end of the story, before the impending tragedy strikes, the oldest (and easily the bravest) sister is remembering a moment from her youth... she and her sisters are playing this game, in the dark, behind their parents' farm house: the idea was to walk off the porch, into the pitch black of the night, and to go as far as they could before turning back. What she remembers, is how everyone always thought she was fearless... and on the contrary, how much fear she did feel, how she couldn't breathe, how she didn't know if she could do it... and how she just stepped forward anyway. Feeling the fear, and walking right into it. It really spoke to me at the time; I'd leapt into this crazy adventure, all by myself, with a backpack and a map, in the middle of nowhere, at a young age... and no one could understand what I was doing... really, neither could I, but somehow I knew that I needed to do it; I needed to conquer this thing. I had never read such an apt description of what that feels like."}, {"userName": "Crumb", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/53025065-crumb", "userReview": "I hate reviewing books that I only found mediocre. I really, really wanted to like this one. I thought the plot was very promising. Frankly, I really didn't know much about Trujillo's dictatorship in the Dominican Republic and I thought by reading this I would learn a lot.. and I did. I just wasn't captivated by the story or the characters. However, this book was based on fact and that should count for something. I also think that in this case, it was me, not the book. Just like when a boyfriend breaks up with his girlfriend and says \"Its me, not you.\" I did however appreciate it for what it was: An enlightening story about a dark time in Latin American history. I also am grateful that I completed it and learned about this time period."}, {"userName": "Sara", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/5512657-sara", "userReview": "In the time of Batista and the revolution in Cuba, there was another dictator, as bad or worse, ruling in the Dominican Republic. His name was Trujillo, and his preferred way of keeping his power was murdering anyone who challenged him, spoke a word against him, or displeased him in any way. In the midst of this repression, we find the four Mirabal sisters, Minerva, Dede, Patria and Maria-Teresa (Mate). This fictional account of their lives is riveting and oh so bittersweet. The sisters have become known in history as Los Mariposas (the butterflies), but each of these women was a distinct and different person. Each was motivated by a different urge and desire. Each was trying to find her own voice. But above all, they were for one another, with one another, loved one another. Their bravery ranged from raw courage to a simple inability to desert someone well-loved. That they put aside their own safety for the preservation of the collective serves as an echo of what true revolution is. What true defiance means. I wonder at their strength and feel cowed by it. When I finished this book, I was literally shaking with sadness and anger. Knowing it is based upon real events makes it all the more poignant, and Alvarez has done a magnificent job of breathing life back into these women who were martyred for the cause of freedom in the Dominican Republic. She alternates between the points of view of the sisters, and in doing so brings each of them to life equally. While Minerva is the star of the revolution, each of the other sisters brings her own personality, fears and desires to the table and we, the readers, are handed a feast. At the outset, we know the fate of these women, but the old axiom that the journey is more important than the destination could not be more true than when applied here.In her postscript to my edition, Julia Alvarez acknowledges having merged actual events and imposed her own interpretation onto others. She states, “I sometimes took liberties--by changing dates, by reconstructing events, and by collapsing characters or incidents. For I wanted to immerse my readers in an epoch in the life of the Dominican Republic that I believe can only finally be understood by fiction, only finally be redeemed by the imagination. A novel is not, after all, a historical document, but a way to travel through the human heart.She has achieved her goal admirably. I felt the beating of these hearts and at some point in the story their heartbeats seemed to merge with my own."}, {"userName": "Helen", "userReviewDate": "Nov 27, 2007", "userURL": "http://www.goodreads.com/user/show/598138-helen", "userReview": "I'm not an Alvarez fan, but I enjoyed getting a fictionalized glimpse into a part of Dominican Republican history. Once again, I was so frustrated by history. This story is the same story in so many countries. But, I was encouraged in Alvarez's afterword when she commented that she gave herself room to fictionalize the characters because the Maribel sisters have become so mythic that they are almost superhuman, but through her book, we can see that any one of us can be as courageous as Patria, Dede, Minerva, and Mate.And although, this book really is a 3 for me, I gave it 4 stars because of the afterword and the epilogue. Dede comes full circle if she, not Minerva, is the courageous one afterall. We all want the passion and dedication of the Minerva's, but what of the Dede's who live (sometimes the harder choice) and carry on the story?"}, {"userName": "Snotchocheez", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "[ even as we know from the opening pages that that sister is one of three that is assassinated by novel's end...so how is she telling her own story? (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/23841736-sarah", "userReview": "At the age of 10 years old Julia Alvarez had to flee the Dominican Republic because her father had gotten on the wrong side of the Trujillo regime. A strong desire to understand this particular time period, and what happened to Las Mariposas, caused Alvarez to write this book.This book is told in alternating first person POVs from each of the four sisters over a period of 22 years. We know that the Butterflies did indeed die in 1960 but it doesn't take the horror out of the moment when Dedé finds out that they did. It's a somewhat emotional book that I really enjoyed. That said, I would have liked to have seen more interactions between the characters and have more of an understanding of why Alvarez's characters made the choices they did. What would cause four women (from a macho society to boot) to put their lives on the line the way that these women did? I would have liked to see a bit more in that direction.I did really like it and I especially liked the cultural information that was a part of the story. I also really liked the way that it showed how much these women inspired the rest of the country, to the point that they became such an inspiration that they almost became public property as a celebrity would. This has inspired one of those moments when I need to absorb D.R. history through osmosis because I want to know everything right now! A Wikipedia page is insufficient."}, {"userName": "Zanna", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/22591633-zanna", "userReview": "I think I've decided not to re-read this, so I can't review it properly because I've forgotten my thoughts. I'm glad this was brought to my attention by the year of reading women selection because it's an amazing story and an important piece of radical history. As other reviewers note, by focussing on the personal and making the sisters distinct (even idiosyncratic) and flawed Alvarez demonstrates that extraordinary courage comes from people like you and I (Malala Yousefzai's book comes to mind here). Also, La Mariposas come across as awesome and heroic, but generally very feminine in the sense of a familiar traditional gender socialisation; nurturing, caring, with integrity stemming from avowed emotion, conscious of self-presentation, and aspiring to a passionate and stable family life, especially young Mate. I am inevitably projecting my own experiences onto Latin@ culture however.My favourite voice was Patria's, although I related more to willful Minerva in general. Patria's self-awareness seemed extraordinary, and her religious faith challenged my (generally negative) perceptions of Catholicism and faith generally. If I felt the girls/women were bourgeois and privileged, that's probably why Alvarez devotes a lot of time to conveying the texture of their experiences in prison and the relationships they built there. I appreciated Alvarez's focus on women; the many men in the story remain peripheral. The limited attention to race is my main disappointment in a generally satisfying read. Brief mentions of the Taino and Trujillo's white supremacy are included, and there is a little space for raising awareness in the jail, but we don't see much confrontation with racism in the extensive character development.For me what makes this so worthwhile and exciting is the depth and detail of characterisation. Sometimes I was really struck by the thoughts behind the thoughts, mostly of Patria, but also others, such as Mate's confession: 'I think I'm going to burst' in a context that causes this to position the soul as desire and desire as a kind of fullness, the opposite of the classic formulation. On the level of the personal, this story gives much food for thought."}, {"userName": "Emma Taylor", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/55602670-emma-taylor", "userReview": "n the Time of the Butterflies by Julia Alvarez is an intense tale of the four Mirabal sisters, Minerva, Dedé, María Teresa, and Patricia. The book starts in the 1960s as an interviewer arrives at one of the sister’s houses for an exclusive interview. The story is told in flashback form and eventually makes a full circle back to 1960. In the Time of the Butterflies is extremely captivating; once you start reading, you won’t want to put the book down. Julia Alvarez does a great job of not only drawing the reader in, but also keeping their interest.Set in the Dominican Republic in a time of intense conflict and war, the Miribal sisters must decide if and how to fight the oppression they, and the entire country, are facing. The reader watches as the girls develop into strong women. In the beginning, the Mirabal’s believe that their beloved president, Rafael Trujillo, is as powerful and great as God himself. However, while away at school, one of the sisters is told a horrific story of the oppression Trujillo is responsible for; the girls quickly realize that he is not a great president, but rather a cruel dictator. After the shocking truth is revealed, they must decide if this fight is worth risking their lives for.Alvarez makes the reader connect to the Mirabal sisters, instead of seeming like political rebels, they seem like humans, with families and lives. Adding a personal connection to the girls makes Trujillo seem even worse because the reader is strongly invested in the sisters and wants to see no harm come to them. As the reader keeps reading, they become more and more emotionally invested in the livelihood of the sisters and makes them hold on to every word.I would strongly recommend In the Time of the Butterflies to anyone who enjoys reading a book with intense action but also an emotional connect. While the book is fiction, the themes are very real and truly exemplify the harsh oppression many Dominicans had to face."}, {"userName": "☮Karen", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/1076079-karen", "userReview": "This is Julia Alvarez's take on the reign of the Dominican dictator Trujillo and the brave Mirabal sisters who sacrificed their comfortable lives to form a resistance against him.  I also read about them on Wikipedia and watched a short video about the sister who survived.  Julia Alvarez created this story from a few pieces of known facts; the background is of her imagination, based on some truths.  But even so, it serves as an inspiration to the oppressed and especially women of the world to stand up to injustices of all kinds.  I do recommend, but with some reservations because, until the final chapters, I thought the story extremely slow moving."}, {"userName": "Tara Chevrestt", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/2544368-tara-chevrestt", "userReview": "Darn good story with strong Latina characters. A must read for all Hispanic ladies. Until I picked this up, I didn't realize that the Dominican Republic had such a turbulent past. Thus, the book has been educational as well as entertaining.In the sixties there was rebellion. Revolutionists wanted Trujillo, a dictator, out of the way. This book follows four sisters. Patria is the oldest and appears to be your average stay at home wife and mother who occasionally struggles with her deep Catholic faith, but one day she witnesses catastrophe and she enters the revolution. Dede is the \"play it safe\" sister and doesn't get directly involved but does her part in saving her sisters who are. Minerva is the one with the firey words and passionate speeches. Her constant rebellion fuels the others and she plays a very strong role in the revolution. Maria Teresa, \"Mata\" also becomes embroiled in the underground plans, not realizing that she may be biting off more than she chew.Fantastic writing style. I really felt I was getting to know all of the sisters, their thoughts, their feelings, their doubts, and their reasons for going against Trujillo. As always, in a revolution, disaster is inevitable. There shall be casualities on both sides... Who is this one going to take?A movie came out in 2010..not based on this book, but about Minerva Mirabel. http://wwwbookbabe.blogspot.com/2011/..."}, {"userName": "dianne", "userReviewDate": "Aug 08, 2007", "userURL": "http://www.goodreads.com/user/show/246171-dianne", "userReview": "a brilliant novelized version of las tres mariposas - the name given to the 3 sisters who, despite being from a wealthy, landed family fought bravely to their deaths, against Trujillo. i found one of the loveliest insights was how they came to be political in three VERY different ways - one, a traditional mother became angry about the treatment of children and family, another fell madly in love with a freedom fighter, and a third was intrinsically an activist - righteously furious at the inequity and tyranny foisted upon the Dominican Republic by this brutal dictator.the twin daughters of Hope are Anger and Courage."}, {"userName": "Erin", "userReviewDate": "Jan 26, 2008", "userURL": "http://www.goodreads.com/user/show/833298-erin", "userReview": "I read this in Spanish because I thought it was originally written in Spanish, being written by a Dominican author and set in the Dominican Republic. But no; it was written in English and I just got some extra reading practice. This is a non-fiction-told-as-fiction, the dramatization of real events. It is the story of the real-life Mirabal sisters, who were members of the underground resistance to the Dominican dictator Trujillo. The story is told over many years in separate chapters from the points of view of all four sisters, reflecting their very different personalities and motivations, the view of the youngest told through her diary entries. This is the kind of book our book club was founded for--a story of strong, admirable female characters. It is tense and inspiring, and although you know how the story is going to end (the first page of the story consists of the epitaphs of three of the sisters), it still manages to be horrifying and gut-wrenching, especially with the knowledge that it actually happened. A must-read for women and revolutionaries."}, {"userName": "Viv JM", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/4243437-viv-jm", "userReview": "I loved this fictionalised account of the lives and deaths of the Mirabal sisters. The author gives each sister a distinct voice and motivation for rebelling against the Trujillo regime. She makes them very human and flawed and I think that makes the reader really think about what can give a person the courage to stand up for what they believe. Highly recommended."}, {"userName": "Ana ", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "Nobody touch me. I'm so emotional right now. This book is heartbreaking."}, {"userName": "Chrissie", "userReviewDate": "Apr 06, 2009", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "I have completed the book. I am not as enthralled as when I began it. Why? What went wrong? I am only going to give the book three stars.I am not going to give another synopsis of the book. If that is what you are looking for please see the book description above. I have learned how it might have been to live in the Dominican Republic during the latter half of the 20th Century, mostly under Dictator Trujillo!s reign. The four Mirabel sisters fight against him have today reached mythic proportions. This book is fiction. Neither myth nor fiction give us the true facts. I would have preferred that the epilogue clearly stated what is known and what is imagined. The author wants to wipe out the mythic status of these women so that we readers can more easily relate to them as four individuals, four different women with different personality traits. Clearly one is portrayed as the rebel rouser, one is religious, one just hasn't the requisite courage and the fourth? Well, she is the youngest and this is evident all throughout the story. Does the author succeed? Do we readers empathize with them? Do we relate to one of the women more than another given our own specific personality traits? I did not empathize with any of them, although I did recognize their differences.Each chapter title indicates which sister is speaking and the dates when the events in the chapter take place. Thus each chapter should reflect the views of one of the four sisters. You are given her thoughts. You are meant to see the events through her eyes. Something went wrong with this presentation: I frequently had to flip back to check which of the girls was speaking or when the events were occurring.The bottom line is: I did NOT relate to the girls that well. I actually cringed when I had to get through the religious sister's chapters. Neither do I know if the author has portrayed their personalities correctly. This should have been made clear in the epilogue with detailed entries explaining why she chose to represent each as she has done.I did enjoy how the author expressed herself, particularly at the beginning of the book. I did enjoy the suspense of the denouement. I think it is admirable that the author wants us to relate to the sisters on a personal level. I believe she wants us to do this so that we too might be encouraged to take a stand against injustice, as they did! **********************This is good simply because the lines make me smile. What do you think of these: \"The country people around the farm say that until the nail is hit, it don't believe in the hammer.\" Or: the air was so fragrant that it \"smelled like a rose garden wished it could smell.\" I want a writer to delight me with their ability to express themselves in an imaginative manner. I am on page 76; every couple of pages I hit sentences that I love.And I didn't know much about the dictator Trujillo of the Dominican Republic. I am learning. This is just my kind of historical fiction in other words!"}, {"userName": "Mia (Parentheses Enthusiast)", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/23106940-mia-parentheses-enthusiast", "userReview": "UGH. I'll probably write a half-assed review of this book at some point in the future. But since I had to read it for school, I will have to analyse the shit out of it in class, and right now it's the summertime and I don't want to think any more about In the Time of the Butterflies than I absolutely have to.EDIT 10/15/15: So here's my astoundingly brilliant review... This book sucks. I shouldn't say it sucks, I should say that I didn't like it, but any way you phrase it, this book bored the shit out of me. I could not sympathise with any of the characters and it was more about who married whom and who is pregnant and what all the sisters are wearing who has a weird breastfeeding fetish (swear to god, it was in the book TWICE, I am not making this up). The writing was quite bad as well- lots of telling and not much showing, and the plot just got swallowed up by the unbelievably insipid tone of the writing. I was expecting sisters banding together to fight an oppressive regime, what I got was a four hundred page account of fashion and periods and giggling and unhappy marriages that nobody does anything about, with an occasional paragraph thrown in to remind the reader that it takes place in the República Dominicana and that bad government stuff is happening. It is so vague when it should be specific and so specific when it should be vague. I wish I could donate or sell my copy, but I was so frustrated whilst reading it that I scribbled angry annotations all over it. I'll include some pictures of my notes once I figure out how to put my own photos into a review."}, {"userName": "Glenn", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/987678-glenn", "userReview": "Fictional account of the sad and true story of four sisters in the Mirabal family, three of whom were murdered in November 1960 in the Dominican Republic for working against Trujillo, the dictator in power at the time. A decent read overall and I thought it started out well, but got bogged down in the middle for me, with too many characters and shifting time periods between the chapters that I thought made it difficult to follow the story and keep track of the different sisters, let alone all the other characters that were introduced. I found myself at times wondering \"Now, which sister am I reading about?\" and flipping back to the beginning of the chapter to find out, which tells me the author didn't do a very good job of giving each character their unique voice.This book was written as a totally fictional account of the four sisters based on the author's perception of what their lives might have been like, which took something away from it for me. I would rather have read a true account by an author who had researched their lives."}, {"userName": "Lorena", "userReviewDate": "Mar 21, 2009", "userURL": "http://www.goodreads.com/user/show/948934-lorena", "userReview": "This was an excellent read, I knew very little about Trujillo's Dictatorship of horrors and that dark part of the Dominican Republic's history. I know this is Historical Fiction, but I have truly enjoyed getting to know Las Mariposas, it makes me feel so bad though about the inaction I have been living on. There are so many people out there that give it all for the wellbeing of the community, even their lives while I just live my confortable little existence and do nothing for others, made me feel ashamed about that. There was a small part in the book where I thought \"do I really need to know about all this little girl's thoughts?\" but then later on when she grows up and goes through hardship, because I knew her I felt so much more the worse about her experience, I felt the Mariposas were my sisters, my cousins, my friends ... I'll miss them in the next couple of weeks!"}, {"userName": "Judy", "userReviewDate": "Dec 05, 2011", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "Take four sisters, add the backdrop of the oppressive Trujillo regime of the Dominican Republic, include the fizz of drama and voila! introducing In the Time of the Butterflies. Julia Alvarez portrays each sister as a unique individual. The eldest, Patria, encased in her religion; Dede the second-born plays it safe; Minerva is the catalyst; while the youngest, Mate, lives for love, together, make for an intriguing tale. When I picked up this book I hoped I wasn't in for a depressing read. To my delight, it was one of the best reads of the past year. The Trujillo oppression is the skeleton of the book, but the drama of the sisters lives is the focus. This keeps the book positive.In the Time of the Butterflies is a good read for anyone wanting to know more about what life was like under the Trujillo regime."}, {"userName": "Robert Case", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/24463210-robert-case", "userReview": "In the early 1960's the author, Julia Alvarez, arrived in NYC, fleeing with her family from the tyranny of the Trujillo dictatorship in the Dominican Republic. She was a young girl. Her father had been part of a resistance cell plotting against the regime. The secret police arrested him before the revolt could begin. A few months after her family's exile, the same secret police would murder three brave sisters on a remote mountain road, along with their driver. They were attempting to return to their homes and families after visiting with their political prisoner husbands in jail. Indelibly impacted by all these events as a youth, the author returned to her island home as an adult writer to begin the work that would become this fascinating and timely story. Author Alvarez could have chosen memoir or biography. Instead, she turned these events and her own life experience into a sadly gripping novel. I listened to the audio version of the book. In part I of the book, the sisters are children living in the family home and attending a Catholic school. Each character is done by a different voice over actress. This allows the listener/reader to imagine the personalities and interests, and gives depth to the storytelling. Part II of their story is told in the first person by a fourth surviving sister. It's a good story of a heroic family, well told. I highly recommend it to lovers of history and historical fiction."}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Aug 08, 2008", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "This is a fictionalized account of the lives of the four Mirabal sisters, Patria, Dede, Minerva, and Maria Teresa. They grew up in the Dominican Republic during the dictatorship of Rafael Trujillo. Trujillo ruled brutally for thirty-one years, merciless and drunk on power. It disgusts me how these vain, arrogant little men like Hitler and Trujillo can wield so much power and do so much damage.The book alternates among the \"voices\" of the four sisters. The first part of the book tells about their growing up years, convent school, college and/or early marriages. This part is a little more slow moving, but interesting.The second part of the book tells about their participation with their husbands in the revolution intended to overthrow Trujillo, and the subsequent imprisonment of all but Dede. After their release from prison, they made weekly trips to visit their husbands, who were still imprisoned. Patria, Minerva, and Maria Teresa were murdered by the Trujillo regime on November 25, 1960 while on their way home from one of these visits. This part of the story is true. The Mirabal sisters, \"Las Mariposas,\" were real, and they were revered by their people for their bravery and martyrdom. November 25 is now observed in many Latin American countries as the International Day Against Violence Towards Women.The author and her family fled the Trujillo regime when she was ten years old, several months before Las Mariposas were murdered. Her father had also been a revolutionary and had to escape before being found out. Her personal knowledge of the life and culture of the Dominican Republic gives this story a nice colorful authenticity."}, {"userName": "Mrs. Reed", "userReviewDate": "Sep 05, 2007", "userURL": "http://www.goodreads.com/user/show/284689-mrs-reed", "userReview": "I'm on a Julia Alvarez kick. So far, I've just read this and iYo!, but based on these two, she's one of the most imaginative, creative authors I've ever encountered. This is historical fiction in a new sense. She took the stories of famous Dominican revolutionaries and fictionalized pretty much their entire lives. The main parts, of course, are true. Reading it, I was always questioning what was \"real\" and what was an Alvarezation. When I finished it, I had a little cry (right there on the train) and wondered about the importance of which parts were \"true.\"It's no secret, historically or in the novel, that the sisters are going to be killed. Alvarez makes sure we know that right from the start. Still, the writing propels the story and builds suspense.She creates a distinct personality for each sister, letting them take turns as narrators. Their voices are so distinct that I could soon tell who was \"talking\" without looking at the chapter heading."}, {"userName": "Lisa Vegan", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/83445-lisa-vegan", "userReview": "I can’t rate this book with 5 stars because its fiction/non-fiction format drove me crazy. I’d rather have had a non-fiction book about the Mirabal sisters. Given that there is one surviving sister I’d hope that wasn’t an impossible feat. If it really was, however, then I’d rather this historical fiction story have had entirely fictional characters as the main characters. The pertinent real people could have taken on more minor roles in the story, and then I wouldn’t have minded their fictionalization. But this book really grabbed me. I ended up having actual nightmares because of and relating to this book. I thought the author did a tremendous job of giving an accurate feeling for what it might feel like to live under a dictatorship regime, and of being public, oppositional figures in such a situation. I enjoyed the writing style much more than I’d expected. I’d like to read other books by this author. I’ve heard her speak a couple times, and I’ve always come away favorably impressed.I loved the humor in the book. I learned a lot about the time and place. I enjoyed the different voices, although I had to occasionally look back to see who was narrating.I really enjoyed the characters Maria Teresa, and Minerva, but Patria less so. Maria Teresa struck me as somewhat shallow but very funny, Minerva as passionate and generous, and at times infuriating. Dede felt like a bit of a blur for much of the book; she’s the one who survived and who was available for providing some factual content. Perhaps it was her privacy that needed to be protected. There weren’t many, but I enjoyed the little drawings in the story; some were like maps, though of small places.My paperback copy had fascinating extras. The author talks a bit about herself; she was a refuge from Trujillo’s regime because of her father’s activism. I feel her passion coming through in her storytelling. There are discussion questions. And she explains about her choice to write this as a historical fiction novel. I’d love to know how all the children and grandchildren and other descendents are doing now. I did get from this material how hard it must be to be a survivor of those who were and are martyred and revered. And I’d like to read more about this period in this place. I’m embarrassed that I knew nothing of it, even though I was alive (albeit young) during these atrocities. I’m always astounded and perturbed to read about horrific events that took or are taking place during my lifetime. I always think about what I was doing at the time, and how different my life was, and how ignorant I was.I read this for my real world book club, and I finished it late, a first for me, but not because I wasn’t enjoying my reading experience."}, {"userName": "Xueting", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/4691420-xueting", "userReview": "Gorgeous writing!!! that kept me engaged even when the tone got more and more serious and dark. Alvarez said that though she did a lot of research she took some creative liberties by inventing and collapsing details, but she ultimately wanted to bring out the spirit of the Mirabal sisters as she imagined them. And I really connected to them, women in the early 20th century Dominican Republic who had more fiery courage than I may ever have in my life! I love how, from this novel, I learnt not only more about a history I never knew about previously, but also more about the human spirit that we all share, from different times, lands, social identities and more. Alvarez wanted to look at the Mirabal sisters as humans, behind the legends and myths, as people who felt fear, doubt, hesitation and weariness. But to me the impact goes beyond just connecting with the Mirabals and their particular situation. Alvarez created such distinct personalities in each of the sisters, which I think gives us present readers some hope that courage can take so many forms and sizes. There's so much about historical fiction that can be discussed too; I'm particularly curious why Alvarez ordered the perspectives the way she did (then later reversed the order in the last part) and why she chose to use the diary format for Mate. Also, some of the narrative perspective/pronouns used were odd... I've read Julia Alvarez's first book The Garcia Girls and I loved it, I can't believe it took me so long to get to this!! Her writing and storytelling is really masterful."}, {"userName": "Kate", "userReviewDate": "Mar 03, 2009", "userURL": "http://www.goodreads.com/user/show/1283496-kate", "userReview": "\"In the Time of the Butterflies\" was beautiful and sad. I loved every one of the sisters. Their sacrifice, during the Trujillo regime, made me question what I would be willing to sacrifice for freedom and it made me think about my sister. The image that made me cry and made me angry was of the sisters standing in the garden one night looking back at the lit house as their mama bustles around getting their children ready for bed. Alvarez says they look at the house with longing as if they were already dead and wishing to watch their children grow up. That decision between political upheaval and being with and living for their children haunted me. How could they sacrifice a life with their children? I know they were fighting against an oppressive, tyrannical regime and that they believed their fight for freedom was to create a better world for their children. I guess it bothers me because I admired the sisters but I wouldn't have made the same choice.I don't know how Dede survived losing three sisters. My sister is lovely, vivacious, and passionate and I don't think I would be able to stop screaming if she was taken from me. I wondered while I read if it haunted Dede that her sisters died in fear. They weren't shot by snipers. They watched their murderers strangle them. Like I said, a sad book, but a book I think teens in the U.S. should have to read to learn more about Latin American history and the U.S.'s role in the political insecurity in that region."}, {"userName": "Melanie", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/4843124-melanie", "userReview": "I have mixed feelings about this book. I totally loved reading this book, I liked the perspectives of the women as they grew up and became more and more involved with the revolution movement. Yet, there is a part of me that struggles with it, turning the life of these incredibly inspiring women (yes, I read about them online) into a what is essentially a \"light\" read. I know I might be quite alone in this and don't get me wrong, I enjoyed the book, but I am torn."}, {"userName": "Zeren", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/48381130-zeren", "userReview": "1950'lerden itibaren Dominik Cumhuriyet'inde otuz küsür yıl hüküm sürmüş diktatör Trujillo döneminin \"kahraman\" kadın direnişçileri Mirabal Kardeşler. Tırnak içinde çünkü aslında hiçbiri kahraman olmak istememişler. Hiçbiri bir süper güce sahip değil, kahraman olmakla alakaları olan insanlar da değil. Belki biri, doğuştan isyankar bir ruha sahip Minerva hariç. Bir rejimin son derece sıradan insanları bile nasıl birer direnişçi haline getirdiğini her bir kardeşin ağzından kronolojik olarak çok sağlam bir dille anlatıyor Alvarez. Kitabın son otuz sayfasında hayatta kalan kız kardeş Dede'nin olanlarla hesaplaşmasından, hikayenin geneline nazaran çok daha fazla etkilendim. Hatta kitabın sonuna iliştirilen notla tüylerim diken diken olarak bitirdim romanı. Yazarın, kızların hikayesiyle kitabın sonunda yaptığı hesaplaşmayı da çok samimi ve haklı buldum. Ben bu romanı tarihe bir belge olsun diye yazmadım diyor yazar. Belgeler insanlar üzerinde bir etkiye sahip olamıyor ne yazık ki. Halbuki romanlar, insan kalbine ulaşmanın en güzel yollarından biri."}, {"userName": "Rusalka", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/6163718-rusalka", "userReview": "I got distracted again by life. It really needs to stop getting in the way like that. Last book that was half read on the plane and half in a jet-lagged state was In the Time of Butterflies. This poor book got a bit more love than I would like, as I'm pretty meticulous with my books, as I had a mother of a cold on the plane and sneezed, causing me to wave my hands in the air like a numpty, which then collected my G&T and doused my lap and my book in too much tonic and not enough gin. At least I missed the two unfortunate women sitting next to me...Besides the wiggly and alcoholic state of the book, I actually liked the book. I am hesitant when there are a few narrators and they they use diaries to describe their life events etc. But this book balances it beautifully. It has first person narration, scribbles in personal diaries as well as third person observations about the....This post was briefly interrupted by the fact that I tried to shift my weight on my computer chair by leaning on one arm and moving my body. At this stage all the screws holding the chair to the frame fell out on the left hand side of the chair, propelling me over the right hand arm rest I was leaning on and landing on my head on the floor. I have now spent 10 minutes finding the appropriate allen key to screw in all the screws again and am back in business.....dictatorship of the Dominican Republic under Trujillo, and the story of the 4 Mirabel sisters and their attempts through the Underground, where they were collectively known as the Las Mariposas (the butterflies), to overthrow him.Who am I kidding? I am not going to recover this post! Good book, well written, nice introduction albeit fictionally into the world of dictatorships in Central America.For more reviews visit http://rusalkii.blogspot.com.au/"}], "description": "Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. From the author of How the Garcia Girls Lost Their Accents comes this tale of courage and sisterhood set in the Dominican Republic during the rise of the Trujillo dictatorship. A skillful blend of fact and fiction, In the Time of the Butterflies is inspired by the true story of the three Mirabal sisters who, in 1960, were murdered for their part in an underground plot to overthrow the government. Alvarez breathes life into these historical figures--known as \"las mariposas,\" or \"the butterflies,\" in the underground--as she imagines their teenage years, their gradual involvement with the revolution, and their terror as their dissentience is uncovered.  Alvarez's controlled writing perfectly captures the mounting tension as \"the butterflies\" near their horrific end. The novel begins with the recollections of Dede, the fourth and surviving sister, who fears abandoning her routines and her husband to join the movement. Alvarez also offers the perspectives of the other sisters: brave and outspoken Minerva, the family's political ringleader; pious Patria, who forsakes her faith to join her sisters after witnessing the atrocities of the tyranny; and the baby sister, sensitive Maria Teresa, who, in a series of diaries, chronicles her allegiance to Minerva and the physical and spiritual anguish of prison life. In the Time of the Butterflies is an American Library Association Notable Book and a 1995 National Book Critics Circle Award nominee.", "title": "In the Time of the Butterflies", "url": "http://www.goodreads.com/book/show/11206.In_the_Time_of_the_Butterflies", "average": 4.13, "cover": "https://images.gr-assets.com/books/1411410276l/11206.jpg", "reviews": 3387, "authors": [{"url": "https://www.goodreads.com/author/show/7277.Julia_Alvarez", "name": "Julia Alvarez"}], "type": ["Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/11206.In_the_Time_of_the_Butterflies", "http://www.goodreads.com/book/show/7304461-in-the-time-of-the-butterflies", "http://www.goodreads.com/book/show/4990183-en-el-tiempo-de-las-mariposas", "http://www.goodreads.com/book/show/820285.In_the_Time_of_the_Butterflies", "http://www.goodreads.com/book/show/35227718-kelebekler-zaman", "http://www.goodreads.com/book/show/11208.How_the_Garc_a_Girls_Lost_Their_Accents", "http://www.goodreads.com/book/show/17643.Before_We_Were_Free", "http://www.goodreads.com/book/show/286843.Yo_", "http://www.goodreads.com/book/show/11210.In_the_Name_of_Salome", "http://www.goodreads.com/book/show/3236586-return-to-sender", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}