{"ratings": 316197, "userreviews": [{"userName": "Cassy", "userReviewDate": "Jun 19, 2009", "userURL": "http://www.goodreads.com/user/show/2282938-cassy", "userReview": "Life got you down? Then join us on a guided expedition led by Capital Idiocy Inc. as we climb to...\nThe Summit of MOUNT EVEREST\nFor the bargain price of $65,000,[1] we will take you on the adventure of a lifetime full of scenic views,[2] camaraderie,[3] and athleticism.[4]Worried that you lack the necessary climbing experience? Don’t be discouraged![5] While Mount Everest is the tallest mountain in the world, it is not the most technically challenging climb. And in addition to our expertise and mentorship, we will have the support of the local populace, the Sherpa, to handle the basic logistical arrangements so that you can focus on the prize.[6]Never been above sea level? Don’t sweat it! We will prepare you for the high altitudes with our carefully developed Acclimatization Program.[7]Sensitive to the cold?We have you covered…with the best protective clothing available![8]When the time is right,[9] we’ll organize the final push to the summit where you will enjoy the exhilaration of being the King/Queen of the world.[10]Remember your safety and health are our top priority![11]What are you waiting for? There is limited space! Call us today at 1-800-YOU-DEAD to sign up.[12]-----------------------[1] Does not include airfare to Nepal and subsequent FedEx expenses when we return your personal belongings to your grieving spouse in [insert idyllic American town here].[2] Just avert your eyes from the dead bodies along the trail. They have been there for years. Honestly, after the first one, you won’t notice them anymore. [3] Well, most of the people are great. Some of them suck big time…when it matters most too. They’ll pass you over for dead THREE TIMES before they put some effort into helping you.[4] Just kidding! We’ll provide bottled oxygen at the higher altitudes. [5] Seriously, zero experience is required. We’ll take anyone.[6] That’s an understatement! We would be screwed without these guys. They cook, carry the heaviest loads, and lay out the ropes. Essentially they take care of the most dangerous tasks for a fraction of what we pay our Western guides. Plus they always have a delicious, steaming cup of tea ready when you reach your tent.[7] It really is a good program. But you can never be 100% sure how high altitude will affect individuals. We’ll do our best to help if you develop High Altitude Cerebral Edema (HACE) where your brain starts leaking fluids, but remember at the top of a mountain, there is only so much we can do. And again, that’s not much.[8] But it’s still damn cold up there. And if a storm hits and you cannot find your way back to camp? Oh boy! Get ready for a windchill exceeding 100 below zero. And frostbite. Lots of frostbite. Plus what good is all that gear when people keep losing their mittens and we find the deceased half-stripped?[9] Did you not read the previous footnote? Storms. They can come out of nowhere. [10] For a few minutes at least. Plus we use the verb “enjoy” loosely. You won’t have slept or eaten properly for days. You’ll be physically spent. And with your severely handicapped mental capabilities, you may not even realize where you are. Heck, you may not even be at the top in actuality! Some losers mistakenly thought they’d reached the top and placed all their trinket flags. They were off by a good 500 feet. (Plus they died on the way down. Double losers.)[11] Now that’s just a lie. Our number one priority is getting you to the summit, no matter the risks. Otherwise you’ll run home and whine that we turned you around 200 feet from the top. You won’t think to thank us that you are alive to do said whining. And you’ll hurt business. Plus it’s hard as hell to keep you safe up there and you won’t be one quota of help. And health? Ha! You can hardly hold us accountable for the intestinal parasites you’ll contract in that camp where everyone shits in the open.[12] Having second thoughts? Look, why don’t you read Into Thin Air instead? You can read it at home in your bed, safe and warm. The author, that crazy guy, already climbed Mount Everest for you. He reminds me of travel writer, Bill Bryson with his accessible, factual, and tension-filled writing, minus the humor. Because climbing Mount Everest is not funny. Vicariously, that’s the only way I recommend climbing this one."}, {"userName": "karen", "userReviewDate": "Nov 20, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "RELEASE THE KRAKAUER!!!!seriously, it is time to just raze everest and be done with it already. i mean, it's big and impressive but it is just taking up all this room and killing people so why do we even need it anymore?? can't we just get over it? really, i think it has reached its peak and is all downhill from here.shameless punning aside.so this started out as an article that KRAKAUER was asked to write for outside magazine about the commercialization of everest. it should embarrass us that something that costs 75,000 dollars to even attempt even has the potential to become \"commercialized\". (for example - i just balked at shelling out $7.17 for the sandwich i am eating. and like everest, it is kind of crappy) how misplaced is our spending? for fifty bucks a toe, i will chop yours right off and you can pretend you climbed everest and had a gay old time. everyone wins! but there are purists who think that there was golden age of everest and everything since then has just been compromised and now everest is a trash heap full of inconvenient dead bodies and empty oxygen bottles and really just anyone can climb everest so it isn't even a challenge anymore...THAT IS THE KIND OF ATTITUDE THAT EVEREST WILL FUCKING KILL YOU FOR HAVING!!!do not climb everest - it is a trap!!when i was making this year's thanksgiving meal, i decided to have a little fun and incorporate things i learned from everest into the prep. because i had soooo many brussels sprouts to prepare, as well as parsnips, carrots, beets, sweet and regular potatoes, turnips, onions, cauliflower, etc. it was a lot of peeling. and i tried to see how many i could peel while holding my breath, and what that did to my motor skills. all i learned is that i really like to breathe and any activity in which i cannot breathe is not for me. by the end, i was weeping, \"KRAKAUER wouldn't give up!! he would chop allllll the brussels sprouts!!!\" but from everything i have read of everest (note: two books) it is THE WORST. all of the reaching of the summit which should be time for celebration is always so anticlimactic. you can't stay up there very long because humans need to breathe and all; there is no fireplace and hot cocoa like at the top of the viennese alps, and then there is the small matter of DESCENDING!! all that bullshit and putting-up-with for ten seconds of \"experience\"?? i gave all that up in high school, thank you very much.oh shit - i have class now. i will \"review\" more later...okay, so i went to class. i learned some stuff.and i don't have much more to say about this. it is not as action-packed as peak, and a lot of it reads like KRAKAUER working through his personal demons and dealing with his culpability, but it is still interesting. i still think everest is unnecessary - it is like a hot fourteen year old - who needs that kind of temptation, right? oh, and also, this:seriously. everest: who needs it?"}, {"userName": "Brigette", "userReviewDate": "Jun 21, 2007", "userURL": "http://www.goodreads.com/user/show/144444-brigette", "userReview": "I recently attended the Banff mountain film festival in Canada. One of the key speakers was Simone Moro, the close friend of Anatoli Boukreev, the climber who was killed in an avalanche several years ago on Annapurna and whom Krakauer pretty much vilifies in this book as not having done enough to save the lives of those caught in the blizzard on Mount Everest in May of 1996. Needless to say, the vibe in the room was chilly whenever the subject of Krakauer's version of events came up; he was accused of slander and some in the room even claimed that he had not done much himself to save the lives of those in danger during the Everest disaster. Nevertheless, as a reader of climbing nonfiction, I stand by Krakauer. I have always found his account of the Everest disaster an intensely moving and thought-provoking one. Like Joe Simpson's books, Into Thin Air reveals its speaker to be a climber with a conscience. Kraukauer loves climbing but is completely honest about the fact that such a dangerous sport so often puts one in the agonizing position of having to make life or death decisions under conditions that make clear thinking nearly impossible-- the cold, the lack of oxygen, the immense strain on the body at that great elevation. One gets the sense while reading that he is trying to make sense of this crazy sport as he writes, that this book is his process of figuring out the answer to the question: with all of the dangers and fatalities that result from climbing Everest, why on earth do people actually sign themselves up for this kind of thing? In the years since I first picked up this book, I have discovered many other great climbing books in the adventure genre, although Krakauer's remains one of my all-time favorites. For more accounts of the Everest disaster, see also Boukreev's The Climb and Beck Weather's Left for Dead. If you enjoy Krakauer's writing, you might also enjoy Nando Parrado's Miracle in the Andes, a true account of the narrow escape of some members of a Uruguayan rugby team that survived by any means necessary-- and I do mean ANY means necessary--two grueling months in the Andes after their plane crashed in the mountains on the way home from a game. In addition, Joe Simpson's Touching the Void is a similarly remarkable story of a climber who survives unlikely odds after breaking his leg on the side of the mountain Siula Grande in Peru. There are also movie versions of both (Titled Alive and Touching the Void, respectively.) In addition, a movie version is due out soon for one of Krakauer's other wilderness adventure books, Into The Wild."}, {"userName": "Michelle", "userReviewDate": "Nov 30, 2007", "userURL": "http://www.goodreads.com/user/show/512643-michelle", "userReview": "This is not a review. I don’t feel like writing a review for this book, but I feel like I should at least say something about it because I did enjoy it. I mean, it did make me utter “Jesus Christ” out loud more than one time, and I don’t often talk to myself while I am reading a book.(I almost want to post a picture of a LOLcat with a caption that says “This buk wuz gud,” but I don’t have one.)So…These are a few things I learned from reading this book:1. If a person decides to climb Everest, they are likely to encounter dead bodies along the route up to the summit.2. Lobuje, which is on the way to Everest Base Camp, is a place that overflows with human excrement. While Krakauer was there in 1996, he wrote \"Huge stinking piles of human feces lay everywhere; it was impossible not to walk in it.\" Lovely. Insert “Want to get away from it all?” commercial here.3. Without the assistance of Sherpas, it is unlikely that climbers would be able to reach the summit at all. Besides schlepping tons of your crap, they also know the way, and they place climbing ropes and in some instances, repair ladders, so people will be able to ascend the trickier places. The place would also be a lot dirtier without them because they are partially responsible for removing some of the trash that Everest has accumulated over the years. One camp reported having around a thousand empty canisters of supplemental oxygen (as I said below in a review comment, so I might as well stick it in here, too).4. In 1996, it cost $65,000 to be a client on a guided tour climbing Everest.5. It is very easy to develop high-altitude sicknesses and/or hallucinations as a climber gets closer to the summit. In fact, the \"every man/woman for him/herself\" attitude that people had, whether or not they had to have it in order to survive, was more than a little disturbing. On this particular excursion, two climbers got stuck on the mountain during a storm. They spent the night at 28,000 feet without shelter or supplemental oxygen and were believed to be dead. The guide sent to look for them the next day found them barely breathing after chipping off three inches of ice from their faces. Believing that they were beyond help, he left them there. One of the climbers, my personal hero, woke up from his coma hours later and was lucid enough to get himself back down to one of the camps. Sure, he lost half an arm, his nose, and all of the digits on his other hand to frostbite, but he's still alive.Oh, and sure, the events that happened on Mt. Everest in 1996 were tragic, but I do think the people who climb it know what they are risking."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Sep 07, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“Everest has always been a magnet for kooks, publicity seekers, hopeless romantics, and others with a shaky hold on reality.”\n\nWelcome to one of Kelly’s creepy obsessions! (Advance apologies - this might get rambly.) Okay, so I’m totally obsessed with all things Everest and CAN. NOT. WAIT. to see the movie that details the same tragic events which are covered in this book (even though just watching the preview in IMAX 3-D made me have diarrhea). I have spent the past month watching EVERYTHING Everest-related on Netflix and You Tube. (Note: I highly recommend the television series Everest: Beyond the Limit as well as Ultimate Survival: Everest – unfortunately the IMAX Everest documentary which was filmed during this fateful 1996 expedition didn’t end up so great. Kudos to the filmmakers for attempting to produce a final product, but really once you’ve watched 8 of your fellow climbers die your heart probably isn’t in the project so much.) Anyway, back to my bizarre fangirl squeeing. Because I’m ignorant I had no clue that Into Thin Air was an Everest book or that it was THE Everest book detailing the storm of the century . . . \n(Note #2: The film is the same story, but the rights to Krakauer’s book were not purchased in order to make it – it’s a conglomeration of all of the survivors’ memories.) I had read Into the Wild and enjoyed Krakauer’s ability to spin a tale, but wasn’t thrilled with the story as a whole so I put his name on the backburner of authors I would read in the future should I come across him. Then everyone started reading Missoula: Rape and the Justice System in a College Town which brought him back to the forefront and me searching for his books – which leads to long story long HOLY SHIT HE WROTE AN EVEREST BOOK?!?!?!?!?!Please note I have zero desire to ever attempt to climb Mt. Everest (or anything higher than a flight of stairs). EVER. First, I’m fat and have resigned myself to the fact that I will always be at least a little bit so. Second, I’m terrified of heights. We’re talking I can’t climb a stepladder. And third, EVEREST. Seriously. You know what you die of on Everest? Your BRAIN F-ING SWELLING TO THE POINT WHERE YOUR EYEBALLS BULGE OUT OF YOUR HEAD. Either that or you drown on your own lung juices. Drowning in water terrifies me, drowning because I was dumb enough to attempt to climb to the height of where a jumbo jet flies is beyond my comprehension. All that being said, I did the next best thing to really make me feel part of the action – I read this book while walking at a 30% incline on my treadmill. Just like being there I’m sure . . . \nI can never wrap my brain around the fact that people spend hundreds of thousands of dollars to go on a vacation where there is a one in four chance of dying rather than reaching the summit. That’s cray. I also am one of the nutters who, although totally obsessed with the climbing of Everest, doesn’t really want anyone doing it. Everest is one of the natural wonders in the world – and due to the “cool factor” that one gets should they reach make it safely to the top and back down again it is also the home of 10 tons of garbage and heaping pyramids of human waste. It’s also a place where inexperienced adventure seeking overgrown children think they can buy their way to the top, but as Rob Hall (one of the expedition leaders who lost his life to the mountain) said . . . \n“With enough determination, any bloody idiot can get UP this hill. The trick is to get back down alive.”\nFor a price of between $50,000 to $100,000 nearly anyone can attempt to make the climb and many believe the hiring of Sherpas and the hopes of being “short-roped” if the going gets tough will let them achieve their dream. While Krakauer was lucky enough to be matched up with some experienced climbers (between Rob Hall and Scott Fischer’s groups there was TONS of publicity/advertising money at stake so they needed everyone to summit safely in order to promote their expedition companies) they were still a rag-tag team of climbers that mixed expedition leaders, guides, sherpas, a lawyer, several doctors, a personnel director, a publisher, a postal worker and a journalist together. The reality of an Everest expedition is this - once you’re at altitude and the shit hits the fan. . . \n“You might as well be on the moon.”\nAnd with the price being one that the wealthy can easily afford (or that the middle-class can save a lifetime for in order to achieve the biggest bucketlist item out there), Mt. Everest doesn’t even have to throw the curveball of bad weather. This . . . .\nis often times the kiss of death. With the summit visable from this vantage point, climbers are nearly impossible to turn around – leading to a greater chance of hypothermia, frostbite, not making the descent before dark, running out of oxygen, etc. In my opinion, it should cost a million dollars per person to climb Everest. That would be enough money for clean-up and deter the wannabe super(wo)men from attempting the climb. Because seriously, while this book was fascinating in a “watching a trainwreck” type of way – it should have served as Exhibit A of why massive changes in the rules/regulations regarding Everest needs to happen.Recommended to anyone who likes to experience adventure and defy death from the safety of their reading chair. My only advice is to familiarize yourself with the specific locations which are continually talked about with respect to the Everest climb. Places like the Lhotse Face, Khumbu Icefall or the Hillary Step. It’s easy to forget the danger that is the Khumbu Icefall if you don’t know that this is what it looks like . . ."}, {"userName": "Michael", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "Utterly harrowing and propulsive. I could not put this book down. This is another book that details people's misguided quests to conquer nature--to see nature as something to be conquered. It's also another great cold-weather read, to make you realize that, really, it's not so cold out after all."}, {"userName": "Maxwell", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "I'll be the first to admit that I'm not the biggest fan of non-fiction. I prefer to listen to podcasts or interviews, rather than read straight-up non-fiction about a certain topic. And as someone who isn't particularly interested in climbing or sports in general, this wouldn't be a book that I'd normally read. But I'm so glad that I did.It definitely reads more like a memoir, since the author was present for the events of the story. That made it a much more palatable read for me, rather than a book about an event where the author does all the research but has no first-hand experience of the thing. However, after having read this I would definitely read anything else Krakauer has written or writes because he is such an amazing storyteller. I was never bored reading this book. He blends history and personal accounts into a gripping, harrowing, horrifying, fascinating story. It's truly awful, but I couldn't put it down. I'm not sure how I particularly feel about being so interested in reading about a tragedy like this, but I also think it opened my eyes to SO many new things that there is definitely merit to the story. On top of that, I can only imagine it was a story Krakauer felt he had to tell after having lived through it. I will definitely be recommending this book to friends and suggesting it to people who, like me, are hesitant to pick up non-fiction books that aren't memoir."}, {"userName": "Petra X", "userReviewDate": "Nov 02, 2010", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "Into Thin Air or Injustice (of many kinds) on the Mountain.Until almost the end this book was exactly as I expected it to be with just one exception. It was the story of a journalist climbing Mount Everest both as a journalist and as a mountaineer. Ideal getting paid to do your hobby! It was interesting because Krakauer is a damn good writer and because its fascinating to see the details of how the mountain is climbed. Its also disappointing because few individuals do it by themselves, without a major support, like the guy who bicycled all the way around Europe to Nepal and then climbed the mountain alone (I would have liked to have read his story but it was only alluded to in the book). For everyone else its a package tour for the fit and not-necessarily experienced who want to climb Everest and have an awful lot of spare cash. Transport is arranged, tents are set up, luggage is carried, there will be steaming hot tea awaiting the climbers on their return to their tents after an expedition, and if they really can't climb well, they can be short-roped and pulled up. Short-roped is the climber roping themselves with a less-than-one-metre rope to the waist of the would-be-climber and literally hauling them up. Still, even with all this portering and pampering I was surprised that the first climbers of the season (using last year's ropes) fitted ropes up Everest so that the climbers didn't have to set their own. More than that, the really difficult bits got ladders installed! But no matter how many shortcuts and easements they are able to achieve there are two things that can neither be predicted nor controlled. One is altitude sickness which in some forms can kill very quickly, and in others causes mental delusions that led one of the team to his death. And the other is the weather. 15 climbers died the year Krakauer climbed.At the beginning of this review, I mentioned there was one exception to my expectations for this book based on several books I have read by this author. The exception was one extraordinary chapter full of the most vituperative nastiness against a socialite climber. I didn't know why it was there. He didn't get any nicer towards her as the book progressed either, but then he said that when he was writing the book he had a 75 minute phone conversation with her. Either she didn't know what he'd written - I would never bother wasting time on someone who had that little respect for me and intended to tell the world - or he didn't write it until after the phone conversation. My only reaction to the chapter was thinking that the author was such a damn bitch.The last chapter was tremendously interesting. Krakauer had not had much respect for another of the climbers - the guide and tour leader Anatoli Boukreev. He felt that Boukreev was more fulfilling his own ambitions of climbing than in sticking to his job of helping others to climb and looking after their safety. Boukreev wrote his own book saying that Krakauer had not mentioned certain incidents somewhat detrimental to himself and that he had made some observational errors, either through oxygen deprivation or wilfullness, and gave his own version of the climb. This argy-bargy went back and forth in print and on tv, and this chapter is Krakauer defending himself. Sadly Boukreev, a climber par excellence, was buried under an avalanche on Annapurna the following year, in 1997, so we will never get to hear what he thought of Krakauer's defence.The book is worth reading because the Sherpas have always been sidelined in stories of climbing Everest. As if it is somehow more praiseworthy for a White man to climb the mountain and its nothing really for the Sherpas who can just hop up and down like monkeys carrying all the loads while the white man Climbs. This book sets the record straight. The mountain could not be the business it is without the Sherpas. The tour companies and guides have enormous respect for these men and their abilities and form as firm friendships with them as they do with anyone else in their lives. Its a shame that this respect doesn't extend to paying them more than the one-tenth they earn compared to the tour guides but of course its justified in the traditional way - this is local wages, this is a lot of money for the locals, the locals don't need the things the guides from America, Australia etc do... Oh YAWN, I've heard it all before. Why can't people just put their money where their mouth is. You can't pay bills and put your kids through school on respect. Reduced by 1-star to four stars because of this."}, {"userName": "Katie", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/8106992-katie", "userReview": "What a read to start 2018! I enjoyed the majority of this, and I'll admit I fell down a bit of a black hole when it came to the controversy behind Krakauer's perspective. Review will be up tomorrow! :)"}, {"userName": "Steve", "userReviewDate": "Oct 19, 2009", "userURL": "http://www.goodreads.com/user/show/236411-steve", "userReview": "Note to self: take climbing Everest off bucket list."}, {"userName": "Arah-Lynda", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "Several authors and editors I respect counseled me not to write the book as quickly as I did; they urged me to wait two or three years and put some distance between me and the expedition in order to gain some crucial perspective. Their advice was sound, but in the end I ignored it- mostly because what happened on the mountain was gnawing my guts out. I thought that writing the book might purge Everest from my life. It hasn’t of course. But it is the way this reads, as Jon Krakauer, a client of Rob Hall’s, Adventure Consultants Guided Expedition, takes us step by brutal step up that mountain, in the spring of 1996. And back down again! Clearly the account of an anguished man desperately trying to make sense of it all, by telling it all. Not an easy task.The Everest climb had rocked my life to its core, and it became desperately important for me to record the events in complete detail. The staggering unreliability of the human mind at high altitude made the research problematic. To avoid relying excessively on my own perceptions, I interviewed most of the protagonists at great length and on multiple occasions. When possible I also corroborated details with radio logs maintained by people at base camp, where clear thought wasn’t in such short supply.Chances are I would not have read this were it not for my daughter’s unbridled enthusiasm in discussing it one Saturday morning when I was over for coffee. When I left that day Into Thin Air left with me. Hands down the greatest adventure, survivor story I have ever read. How could it not be? The author's visceral honesty in portraying his own part in this tragedy, took my breath away and lends undeniable,crediblity to this account. The plain truth is that I knew better but went to Everest anyway. And in doing so I was party to the death of good people, which is something that is apt to remain on my conscience for a very long time."}, {"userName": "Elyse", "userReviewDate": "Dec 21, 2012", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I can't even imagine how Jon Krakauer was able to write this story which came out in 2007, just one year after the deadly expedition in May 1996....where nine climbers were killed on Mount Everest. Krakauer is an astonishing journalist, and writer. His telling 'this' story was particularly compelling being an experienced climber himself. He was physically there when the tragedy took place. \"Descending from Camp Four after the storm, at 25,000 feet, Krakauer turned to look back at the upper reaches of the peak, where his friends, Hall, Harris, Hansen, and Fischer has lost their lives. Nimba had perished on the South Col, just twenty minutes from shelter\". In the author's notes at the end of the book, Krakauer mentions an article he wrote for 'Outside', which angered several of the people and hurt the friends and relatives of some Everest victims. He says, \"My intent in the magazine piece, and to even a greater degree in this book, wasto tell what happened on the mountain as accurately as honestly as possible, and to do it in a sensitive and respectful manner\". This book is not about blame - but about understanding what happened. Krakauer admits his own mistakes and points out mistakes of others. For example - much is mentioned of Anatoli Boukreev's actions on the mountain. (senior guide- the only climber who had climbed Mt. Everest previously). Krakauer praises numerous of his heroic actions. He also mentions real concerns he had of guided ascents up Everest, the use of oxygen by guides, the inexperience of people who paid $65, 000 each to be escorted to the world's highest peak. I said in my first sentence - yeah I couldn't imagine how Jon Krakauer wrote this book, when he himself was in the midst of a traumatic experience. With feelings of guilt, he went back to interview other survivors to get the truth ---BUT.... What I CAN imagine is the rip-roar there must have been when this book first came out. Ugly attacks of blaming- judging- ( negative attacks on Krakauer -- self serving money gambit), and a lot of egos thinking they know \"more to the story\"...People like to blame.....and it's a shame!!This a tragic story -- real human beings did the best they could in unexpected circumstances. Jon Krakauer did a remarkable job writing this book --- and I'm glad he did."}, {"userName": "Jonathan Ashleigh", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/33737465-jonathan-ashleigh", "userReview": "This book was well told. At times I felt oxygen deprived and often this made me unaware of tragedy. I am not a huge fan of non-fiction but this is worth a read."}, {"userName": "Paul Bryant", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "This is the most defaced book I ever read. It must have been used in a school at one point. Up to page 69 there are two different people highlighting passages in pink and green but then in the margins, suddenly there is this:Katie is Eric’s fave, to bad for him, he is silly, I hope he’s a good kisserAnd then on page 77, which otherwise would be blank:This is the most boring book I have ever read, I swear if anyone read this book by choice they are the biggest idiot in the worldJason is such a dorkJonathan has been a fag latelyI HATE THIS BOOKIt will be funny when you ask Jason if he kisses our/your hair. Ask is he kisses your hair, then if he kisses anyone elses hairAlways SpicyOn page 88, in a different hand, we readEric Conner, Feb 24 2000 he asked me outAnd on page 107:Troy is hot! (but I never said that!) And her friend writes:We should go to the movies, you, me, Troy & Eric coz they’re friends & Troy’s hot, so you could have “fun” Okay, I will spare you the rest. There’s a poignant contrast between this dreamy teen hair-kissing and the terror-stricken narrative that Jon Krakauer patiently lays down here. It’s clear that the teenagers just didn’t connect to the story, and in some ways I can see why. In an attempt to be scrupulously correct, JK almost turns the events which killed eight people on Everest on 10-11 May 1996 into a stolid police report. THE GULF OF COMPREHENSION BETWEEN MOUNTAINEERS AND NORMAL PEOPLEMountaineers voluntarily put themselves in harm’s way, spend loads of money on their own obsessive self-centred dreams and then expect to be congratulated by the rest of us for their feats. Lugging your mortal flesh into very high altitudes is madness.There was no forgetting that we were more than three miles above sea level. Walking left me wheezing for several minutes. If I sat up too quickly, my head reeled and vertigo set in. The deep rasping cough I’d developed worsened by the day. Sleep became elusive. Most nights I’d wake up three or four times gasping for breath, feeling like I was suffocating. Cuts and scrapes refused to heal. My appetite vanished… my arms and legs gradually began to wither to sticklike proportions. This was at 16,200 feet. The summit of Everest is 29,000 feet. The further you go up, the more likely you are to get HAPE (high altitude pulmonary edema), where you froth blood, lapse into a coma and die) or HACE (High altitude cerebral edema), where you become deranged, lapse into a coma and die. Krakauer is also keen to deny that mountaineers are adrenalin junkies. We lubbers may imagine that when they get to the summit they experience some great euphoria. Not at all, he says. Getting up a mountain is grinding your way through great pain in the knowledge that getting back down from the summit is more dangerous than getting up to it. Mountaineering does not sound like a healthy outdoor pursuit to me.THE MOUNTAINEERING CLASS SYSTEM Climbing the big mountains like Everest is very dangerous, but it’s popular. A lot of ridiculous rich white people want to do it. So they join guided expeditions. On an Everest expedition there are three classes of people.The guides – these are the white expert mountaineers who organise everything and guarantee client safetyThe clients – these are the rich white people who have nothing better to do. We know they are rich because it costs an arm and a leg to be a member of an Everest expeditionThe Sherpas – these are the Nepalese guys who do the actual manual labour of lugging all the rich white people’s food and essentials from base camp to camp 2 to camp 3 to camp 4 and back again along with making sure the white people don’t kill themselves in the fifty different ways available to them.Sherpas put in the route, set up the camps, did the cooking, hauled all the loads. This conserved our energy and vastly increased our chances of getting up Everest.  This enforced client passivity earns these guided expeditions great contempt in other more radical mountaineering circles. That’s not really climbing a mountain at all, they say. These rich clients have no mountaineering skills themselves. It’s like herding rich white sheep. And some of the haughty sneerers also say that using oxygen tanks is cheating too. They say that you can only say you’ve climbed Everest if you do it without Sherpas and without oxygen. And guess what, some of these hard core guys have gone right ahead and climbed Everest without Sherpas and without oxygen, and when they got to the top they looked down on everyone else, you can bet your life.THE TURN ROUND TIMEInto Thin Air is sometimes flawed by not explaining important concepts clearly enough for us non-climbers. One crucial concept was the TURN ROUND TIME. This was a big part of why eight people died and it took me a while to work out why. On the day your team is going to reach the summit the guide will announce a turn round time, usually 2 pm. This means that wherever the client is,  they must turn round and begin descending at that time, even if they haven’t reached the summit yet. They might be only 30 minutes away but they must turn round and start descending. How ultimately frustrating! There were several companies guiding clients to the summit on 10 May 1996 and one of them was new and very keen to get all of its clients to the summit. So keen that they allowed some stragglers to continue to the summit up to 4pm that day. According to JK, this contributed to some clients getting swallowed up in the sudden blizzard that hit the summit in the afternoon. No one saw it coming. But there was a whole tangle of wrong decisions that day, including some made by JK himself. It’s a complicated picture, but to complicate it further, at least one other book has been published slagging off the conclusions and accusations made by JK in this book. So, a self-inflicted confused disaster, many of the details of which are disputed. At the end of it all I was more convinced than ever that I will never, ever understand the motivations of many of my fellow human beings"}, {"userName": "Scott", "userReviewDate": "Jun 23, 2015", "userURL": "http://www.goodreads.com/user/show/36819318-scott", "userReview": "Does your dream holiday involve spending north of fifty grand to risk a fatal aneurysm, walk past the dead bodies of weaker adventurers who’ve come before you and possibly lose your fingers, toes and nose, if not your life? If so, then step right up to climb Mount Everest!Seriously though, If you’ve ever thought you might like to climb Everest, read this book. If you still want to attempt the highest mountain in the world after finishing Into Thin Air, you are a braver person than I.This is a masterful account of an adventure-turned-disaster that cost the lives of eight people, and scarred (both physically and psychologically) the lucky survivors.If you've read Joe Simpson’s Touching The Void you have some understanding of the horrors of mountaineering gone wrong. Into Thin Air similarly deals with a climbing catastrophe but with the horrifying struggle consuming an entire group of climbers instead of a lone individual.Jon Krakauer, a seasoned mountaineer, joined a 1996 expedition to Everest with experienced guides who had reached the mountaintop on numerous occasions with previous groups.You would think that only the best of the best attempt Everest. The toughest, fittest, most experienced mountain-crazy hardasses out there. Alas, you would be wrong. As Krakauer details, the guides that led people up the mountain often weren’t as picky as they should have been, as theirs is a business like any other, and a need for customers led to many expeditions shepherding weaker sheep up the perilous slopes of the Himalayas.What follows is a sad tale of bad luck, bad judgement, and many, many massive screw-ups that lead to eight people dying awful deaths in the snow after getting caught in bad weather and simply running out of strength in ‘The Death Zone’ (doesn’t that sound like a fantastic holiday location? The South of France has nothing on Everest) above 8000 meters, where even the strongest person can have unpredictable and fatal reactions to the low air pressure.Krakauer writes with clarity and humanity, giving us a window seat to how everything goes so wrong, and both the heroism and foolishness that occurs in such trying circumstances. He doesn’t shy away from his own feelings of guilt, and the way that what happened on the upper reaches of Everest has impacted his life.Into Thin Air is a gripping, terrifying and informative story that taught me more about mountaineering and its risks than any other book I’ve read. It’s an amazing story, both well told and memorable. Read this book, and prepare to shiver in imagined cold as you walk with Krakauer through the middle of a sub-zero high-altitude disaster.Postscript: I read this book as I headed to Ladakh in the Indian Himalayas. Krakauer discusses in detail the effect that high altitude can have on perception, memory and the ability to focus, and when I stopped at a driveable pass on my trip that reached 5600m I experienced this firsthand. Within minutes I felt nauseous, disassociated from my surroundings, and in need of some serious sleep. How anyone dares to face the perils of altitudes above six kilometres is beyond me."}, {"userName": "Duane", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Jon Krakauer standing on the summit of Mt. Everest.\"Straddling the top of the world, one foot in China and the other in Nepal, I cleared the ice out of my oxygen mask, hunched a shoulder against the wind, and stared down into the vastness of Tibet\".You have heard the saying, \"truth is stranger than fiction\". In this case truth is more frightening, more compelling than fiction. This is the first hand account of the 1996 tragedy on Mt. Everest that claimed the lives of 12 mountaineers, many of them highly skilled and well trained professional guides. It is told by Jon Krakauer, a journalist and accomplished mountaineer in his own right. The fact that he lived to tell the story is amazing in itself. How and why it happened, who, if anybody, was to blame is a matter of debate and interpertation. The fact is, Mt. Everest is a deadly place, especially in the upper region known as the death zone, where the air is thin and brutally cold, made worse by the force of the jet stream winds. If you are caught in this region in an unexpected storm, as this group was, then your chances of getting back down, of surviving, become problematic at best. This is a story of human accomplishment, bravery, suffering, and determination. This is adventure of the highest order because it isn't fiction, this really happened."}, {"userName": "Kim", "userReviewDate": "May 09, 2008", "userURL": "http://www.goodreads.com/user/show/520753-kim", "userReview": "Read within the span of 10 hours. This is not a hard read, well, if you take out the subject matter. I picked this up because 'Into the Wild' has been out or on hold for months at the library so I thought I'd at least get a feel for Jon Krakauer's writing style. I also have to admit that it wasn't the writing style that sold me, not that it isn't well done, but usually I'm not drawn to 'personal accounts' or non-fiction, in general, unless it is a subject that really fascinates me. I'm an escapist and sometimes the reality of all this seeps in and rattles me in ways I'd rather not tap into. This is very much rubbernecking. I knew that there is no happy ending to this tale, yet I was riveted and sickened the whole way through. I wasn't drawn so much to the feat of the climb or the determination of the climbers but more to their never ending egos and downright obsession. Their fanatical need to conquer. The fact that these people spend upwards of $65,000 to subject themselves to hypoxia, frostbite, and possible cerebral edemas just makes me shake my head and say 'what the fuck?'Krakauer states in the first chapter that once reaching the summit, a sheet of ice at 29,028 feet above seal level, he couldn't summon the energy to care. He spent less than 5 minutes on the 'roof of the world' with absolutely no spiritual awakening to speak of. What makes people do this? What drives them to become so consumed with the thought of scaling a mountain that's killed 1 in 4 climbers since the first summit reach in 1953? Because it's there. Which, on its own, I can understand, sort of. But, to get there and not feel the euphoria? That's where I become lost. This passage, in particular, floored me:\"People who don't climb mountains...tend to assume that the sport is a reckless Dionysian pursuit of ever escalating thrills.... The ratio of misery to pleasure was greater by an order of magnitude than any other mountains I'd been on. I quickly came to understand that climbing Everest was primarily about enduring pain.\"The fact that the drive to reach the summit had climbers walking over corpses of their peers also is mind-numbing. To think that some of these climbers were so single-minded that they would assess a fellow climber, make the instantaneous decision that they would be nothing more than baggage and refuse to help them sends me spiraling to that survival of the fittest mentality that makes my stomach curl.This is a freakin' Darwinian rat race. I need to research this further, the IMAX film has been netflixed and I'm adding the K2 disaster and other stories to my reading list. What a fun summer this will be."}, {"userName": "Caroline ", "userReviewDate": "Nov 29, 2015", "userURL": "http://www.goodreads.com/user/show/3236194-caroline", "userReview": "***NO SPOILERS*** May 10, 1996 was a very, very bad day to be climbing to “the roof of the world.” On that day, journalist and avid mountain climber Jon Krakauer reached the summit of Mt. Everest with a group as part of a guided expedition. He was on assignment for “Outside” magazine and was one of the few in his group to survive this expedition after a ferocious storm hit out of the blue. Into Thin Air is as much a meticulous detailing of this tragedy as it is a personal catharsis, and he says as much in the foreword: “ . . . what happened on the mountain was gnawing my guts out. I thought that writing the book might purge Everest from my life.”For those who know little-to-nothing about climbing Mt. Everest (or mountain climbing in general) Into Thin Air is a good place to start. There’s a lot that’s covered, and Krakauer’s a very well-organized writer who didn’t skimp on the details necessary to bring to life the reality of high-altitude climbing. It’s pretty grim, at best: Mt. Everest climbers are guaranteed to encounter plenty of corpses on their journey to the summit (there are now more than 235 on the mountain); they must travel across crevasses via metal ladders; and they’ll struggle for breath more and more the higher they climb. The harshest reality? That one in ten dies. This climb could be ultimate adventure or agonizing death. Krakauer explained all this in a highly engaging, vivid manner. At no time is any of this dry, and even for those who aren’t outdoors types, Into Thin Air will prove compelling. Something Krakauer made clear early on is how very crucial adequate acclimatization is. No climber arrives at the foot of the mountain and just starts climbing. Climbing is done in a series of organized phases, with climbers climbing to and resting for a few days at a series of five camps located at increasing altitudes on the mountain. He also gave lots of attention to the growing commercialization of climbing Mt. Everest, and it’s fascinating to read about. This awe-inspiring mountain may be a natural wonder, but access to it is far from free. Anyone who wishes to climb it must fork over tens of thousands of dollars, and most climb as part of guided expeditions. Though Krakauer is a journalist, his style is never unfeeling or distant. Intermingled with climbing facts and thorough portraits of the other climbers on the mountain are his own musings, fears, and personal admissions. A few times he wondered whether he was being snobby in his judgments of the others in his group; he described crushing, altitude-induced headaches so excruciating that even moving his eyeballs hurt; he struggled greatly with survivor’s guilt after so many of his new friends died hideous deaths. At one point, thinking about a missing friend that he’d spent an hour searching for in vain: “I fell to my knees with dry heaves, retching over and over as the icy wind blasted against my back.”Krakauer was so forthright and unafraid to share his lowest moments and the feelings of guilt that consumed him that the reader feels that anguish too. There’s simply no way not to empathize with him. Critics who have dubbed Krakauer “cowardly” and “selfish”...well, one can only wonder whether they read the same book.On the surface, Into Thin Air is a story about mountain climbing and tragedy, but deeper down it’s an emotional survival story. It has a universal resonance. All lovers of nonfiction--outdoorsy or not--will want to read this.Final verdict: As moving as it is educational. Highly recommended."}, {"userName": "Tatiana", "userReviewDate": "Sep 28, 2009", "userURL": "http://www.goodreads.com/user/show/2250020-tatiana", "userReview": "If Krakauer's intention was to kill all of our romantic ideas about mountain climbing with this book, he undoubtedly succeeded. Whatever idealistic notions of bravery, athleticism, adventure, and brotherhood I had about this \"sport\", are now gone forever.What Krakauer delivers instead is a very tough picture of people who are ready to risk their lives and lives of those around them (guides, Sherpas, rescue workers) for the purpose of satisfying some masochistic macho aspirations of theirs or, even worse, to get some cheap fame. I now know that there is no sportsmanship or athleticism or fitness about these trips to the top of Everest. People kill their brain cells, they freeze off their body parts, they lose eye sight, they die, all for the privilege of standing on the top of the world for a few seconds. I never understood this achievement before, I understand it even less now, knowing the costs of it. Even more, what kind of an achievement it is, if everything is done for you - Sherpas build your camps, make your food, carry your baggage (including laptops, TVs, gourmet foods, and magazines), fix ropes for you to hang on, even haul you to the top if needed?But enough of ranting, time to talk about the book itself. I think Krakauer is a great non-fiction writer who manages to suck you into any story. Same goes for \"Into Thin Air.\" It is a compelling book, more interesting in the latter part than in the beginning (once you pass 150-page mark, the book is virtually unputdownable). I personally would have preferred him to talk more about the trip and its difficulties rather than recounting everyone's back stories, but in the end, I have to admit, it adds certain relatability to the narrative. I also was afraid that he would spend a lot of time assigning blame to various players (including himself), but was pleased to see that he had learned from his \"Outsider\" article and came to the right conclusion that the Everest disaster was nobody's fault. Overall, a very interesting and in many ways eye-opening story, which in spite of being beyond my scope of interest, managed to hold my attention. Reading challenge: #10"}, {"userName": "Ginger", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/14097149-ginger", "userReview": "I absolutely loved this!! I had a feeling that I would due to my personal experience hiking and climbing in the Pacific Northwest region.\"Why did you want to climb Mount Everest?\"This question was asked of George Leigh Mallory, a Himalayan mountain climber in 1921.And his answer was,\"Because it’s there.\"This might not make sense to someone who’s not into this sport or adventure, but to me, I get it.Why do I test myself on grueling 4500’ elevation hikes or scrambles?Well, to get to the top!To challenge myself physically, mentally and sometimes emotionally to push myself up that trail. The scenery is beautiful, takes your breath away and you just can't beat it. I’ve had some of my happiest moments lost in the woods, so to speak. I do realize it's not for everyone but I tend to understand why the climbers in this book wanted to climb Mt. Everest. It gets into your blood and yeah, you get addicted to it.Especially when you get to the top!! It's a wonderful feeling of accomplishment and I'm sure marathon runners get this same high.My husband is also a hiker and climber. He has been on my case to read this book for years and I’m finally glad I did!Jon Krakauer did an excellent job writing this book. I can’t imagine it was easy to write about your own personal experience in regards to the Mt. Everest disaster. He seemed to ask himself in the book if he could have done more and blamed himself for misunderstood memories. I can’t imagine what the lack of oxygen does to a person since I’ve never experienced this phenomenon. Because of his undeniable credibility in the account of this tragedy, I’m more inclined to believe his version of the climb on May 10th, 1996.I know other accounts are out of there such as Anatoli Boukreev's book, The Climb. It's in response to Krakauer's book.I'll try to get to other books one day about this tragedy.Will I plan to read more books by Krakauer?!Hell yes I will! It's due to the fact that I’m not a non-fiction fan and this was damn good!!"}, {"userName": "Natalie Vellacott", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/34178791-natalie-vellacott", "userReview": "This is probably the best climbing book I have read despite the controversy surrounding some aspects. It was as enthralling as books like Endurance and as readable. I was with the author on the mountain and felt the terrible pain of the losses they endured, the guilt of the survivors and the many \"what ifs\" after the event.The author relays his personal experiences climbing Everest in 1996 with a number of groups. This was the tragic year when many of the participants didn't make it off the mountain due to a catalogue of errors and an untimely snow storm. He also documents a lot of the history of other climbs and delves into the personalities and characters of some of the great climbers. More generally, I am drawn to these adventure books and stories which hold a certain fascination. But whenever I read about the cost ($70,000 minimum,) the risk ( 1 in 4 people die in an Everest attempt) and the pain and possible life changing injuries from frost bite, I am always glad I can just read about it from the warmth and comfort of a safe altitude on dry ground.There is something unique about people who set out to achieve these goals. Krakauer describes them like thisTo become a climber was to join a self-contained, rabidly idealistic society, largely unnoticed and surprisingly uncorrupted by the world at large. The culture of ascent was characterised by intense competition and undiluted machismo, but for the most part, its constituents were concerned with impressing one another only. Getting to the top of any given mountain was considered much less important than how one got there: prestige was earned by tackling the more unforgiving routes with minimal equipment, in the boldest style imaginableI find myself wondering how they feel when it is all over. They have spent a fortune, risked everything, endured much pain, put their waiting family through a nightmare and possibly lost colleagues or friends to a gruesome death. What is it all for? Is it worth it? What are they really seeking? Reading books like this, one might suppose that most climbers do it for the beauty of the scenery or the thrill of the surroundings. However, it is clear from this book and others that these aspects very much take a back seat. Instead, it is a competition to be the best in the field and it can take over a person's life. Climbing mountains is what they dream about and ultimately what they live for. It can become an obsession in the same way that sport or work or any other hobby can. That is when it becomes dangerous and purposeless.God created each of us with a vacuum that only He can fill. Man will seek to deny this and seek pleasure and fulfillment in many places other than God. These things then become idols. They must be kept in their proper place and we need to keep a proper perspective.This is a great book. The strong language is not so great hence the less than perfect rating. There is no sexual content and no violence. There are upsetting scenes of death."}, {"userName": "Red Panda", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/44824883-red-panda", "userReview": "I'm just going to come out and say it: I just don't get it.Even after reading this book, I just cannot understand why anybody would want to climb Everest. If nobody had ever done it before, I could understand it from the perspective of exploration and new discoveries, but this is a mountain that has now been climbed so often it has a serious garbage problem. From Jon Krakauer's descriptions in this book, it actually sounds like a bit of a shithole (or the opposite of a hole, I suppose).Krakauer lists several different, contradictory statistics on how likely you are to die climbing Everest, but they were all far too high in my opinion, especially for something that's essentially a pointless exercise. I mean, I do understand that it's impossible to live a life free from risk... but there's a big difference between necessary risks and playing Russian Roulette and climbing Everest seems no different to me than pointing a gun at your head with one bullet in the chamber and pulling the trigger. It serves no more purpose to society and is just as dangerous.Ah, maybe I'm just a grumpy old bastard with no sense of adventure! Who knows? However, when reading about this horrible tragedy on the slopes of Everest, the fact that their being there in the first place was essentially completely unnecessary just compounds the tragedy for me.Krakauer certainly brings the whole affair to life; when reading this book I actually felt chilled to the bone at times. It was a harrowing read and a powerful one. I actually cried at his descriptions of how his teammates lost their lives.There were aspects of his writing I wasn't that keen on. For example, I wish he hadn't kept referring to people by their first names one time, then their surnames the next time they were mentioned and then, in one case, even their nickname. If he'd been consistent in referring to them just by one name throughout I wouldn't have had to keep flipping to the list of participants at the front of the book to remind myself who he was talking about. Maybe the fault is with my memory rather than his writing; benefit of the doubt and all that.I also didn't like the lengthy post script that dealt with his battle with one of the other climbers about the veracity of their different accounts. I can see the need to mention it, but not at such great length! A whole tenth of the book is taken up by this bickering-heavy post script! It was ugly and left me with a bad taste in my mouth as I finished the book.All in all, I'm glad I read this, but I very much doubt I'd ever want to read it again. Such a senseless loss of human life with, as the author himself states, absolutely no lessons learned from it. Tragic."}, {"userName": "Brandon", "userReviewDate": "Apr 11, 2012", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "About a year ago, I read a book called Blind Descent: The Quest to Discover the Deepest Place on Earth which was basically all about finding the basement of the earth. A group of cave divers descended into a seemingly bottomless cave full of all sorts of unknown danger. For some reason after finishing it, I didn’t return to any exploration books even though this tale fascinated me. It wasn’t until recently when I listened to an episode of Kevin Smith and Scott Mosier’s SModcast in which Mosier recommended Jon Krakauer’s Into Thin Air that I gave it another go.Now, going in, I knew next to nothing about Mount Everest. I knew the basics: a)\tIt’s the tallest mountain in the word and;b)\tIt’s really difficult to climb.Just how difficult? Well, for starters there are frozen bodies littered on it. Try that on for size. I thought I had a grip on just how difficult it was to climb the damn thing but I had no idea that people had died on there and that upon dying, never left. Oh, and don’t forget altitude sickness, falling rocks and boulders as well as blocks of ice the size of large buildings that have been known to detach and fall without warning.Jon Krakauer gives a stunning account of his attempt at conquering the mighty monster in 1996 with a slew of others. While he goes into pretty extensive detail in describing his arduous journey to the top, it’s what happens when he reaches the summit that is both captivating and terrifying. Greeted by a terrible and destructive storm, Krakauer and his teammates struggled for survival in an attempt to make their way back down the mountain. Some made it, others didn’t. In fact, some of those who survived did so with extraordinary feats of strength coupled with an undying will to make it off of that mountain.I’m not going to go into a lot of detail here; I feel I would ruin it if I don’t let Krakauer have his go at telling the full story to you. There are parts of this book where you honestly think to yourself, this can’t get any worse. Then, it does, especially when it comes to Beck Weathers. Sweet cream on an ice cream sandwich, what that man went through is mind-blowing."}, {"userName": "Greg", "userReviewDate": "Mar 25, 2009", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "I had no idea what shelf to put this on. So I made up a new one, lacking the number of characters needed, this shelf should be called, true stories about things I would never do or try to do. But maybe that is a lie. Like Krakauer I too have had a near death experience while engaged in 'climbing', like the doomed people in this book, my own life was possibly endangered by faulty decisions made by those who are being paid to know better. My own experience is pretty undramatic, and was rectified in a few moments, and possibly if my parents had been the litigious sorts I could have bankrupted the Boy Scouts, and still be suing them for the experience and blame every anxiety and problem I have on this moment. That would be a huge lie though (my own experience was at summer camp, I didn't want to rappel, but I was talked into trying it, I was tied in, and as I stepped backwards over the lip so that I was on the vertical part of the rock the knots on my harness and carabiener started coming undoing themselves. I freaked. Some teenage kid had tied me in who was assisting the guy in charge. The real guy in charge retied my harness, I for some reason decided to try it again and actually enjoyed it, not that I ever did it again after that, and probably will never try it again).Seriously though, this book is about people doing something really dangerous and paying the price for it. It's pretty fucked up on all kinds of different levels, and anyone knowing what it's like to climb into the danger zone of high altitude and then goes and does it anyway so that they can say they have stood on the top of the highest mountain of the world, you can't feel too sorry for (or I can't). Sure it's a testament to the human spirit to overcome obstacles, and being able to do this is something I know I would never be able to do (or want to do), and it's pretty amazing that people can do what it takes to climb these high mountains, but it's also really dangerous and people die doing things like this all the time (historically up until 1996, 3% of all people who climbed just above base camp on Everest died, that's not even necessarily the people who made it all the way up to the final reaches near the summit where the events of this book took place). What I took from this book is that accidents happen, and they can be awful. That being in really high altitudes seriously fucks with you in ways I had no idea about. I also learned that maybe man shouldn't fuck with nature so much for profit, and that maybe commercialization of things alters the perception of real risks involved. Nature and high altitude don't realize that just because you paid big bucks for the ride up to the top that they should lay off and let your trip be like Club Med. I also learned that certain South African's are dicks, and sadly they didn't get to play as much of a role in the narrative as other groups of people, which is a bit sad because there was something absurdly funny about them."}, {"userName": "Jill Hutchinson", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/2222319-jill-hutchinson", "userReview": "I started this year with one fantastic book. Let me say that you do not have to be interested in mountain climbing to enjoy this true story of the 1996 tragedy on Mount Everest, written by one who was there. It is an amazing story and will have you still asking the question \"why does man climb mountains\". Someone once said \"because they are there\" but that really isn't the answer. I have put a quote by a famous mountaineer at the end of this review which partially explains that enigmaThe author, who is a climber, was a member of the 1996 team, headed by an expert who had attained the summit of Everest several times and was considered one of the best guides available. Included in the group were experienced Sherpas but the majority of the group had various skills in climbing which would prove to be problematic.The guide had very strict rules about the climb and the team moved slowly upward taking two weeks to get acclimated to the diminishing oxygen in the air as they ascended. Oxygen tanks were a major piece of equipment on the climb since hypoxia was the curse of thin air and could lead to deadly complications. Several members of the team had to turn back early as they physically could not complete the upward trek and the guide set a strict \"turn around\" time which was the moment that all should turn back even if they were in sight of the summit.On the last day as they neared the summit, things started going wrong, very wrong and to add even more problems a violent storm overtook them and it became \"every man and woman for themselves\". It was the worst situation that could happen to anyone on Everest and the results were tragic.I could write pages on this enthralling book but my advice is....read it. You won't be sorry.Here is the partial explanation of why Everest is such a magnet to those who climb:There are men for whom the unattainable has a special attraction. Usually they are not experts: their ambitions and fantasies are strong enough to brush aside the doubts which more cautious men may have. Determination and faith are their strongest weapons At best such men are regarded as eccentric; at worst, mad. Everest has attracted its share of men like this.......three things they all had in common: faith in themselves, great determination, and endurance."}, {"userName": "Randy", "userReviewDate": "Jun 29, 2008", "userURL": "http://www.goodreads.com/user/show/1063283-randy", "userReview": "Jon Krakauer is a student of extreme behaviors and those who engage in them, and he happened to be on Mt. Everest during the notorious May 10-11, 1996, disaster. A series of seemingly minor mishaps, oversights, and questionable decisions kept climbers moving up the mountain hours later than any reasonable turnaround time. At 29,000 feet, that would have been bad enough given cold, hypoxia, and a finite supply of supplemental oxygen, but an unexpected storm that moved in from the south turned a problematic climb into a catastrophe. Several people died, including two widely regarded expedition leaders. Krakauer was one of the stronger climbers that day; he spent only a few minutes on the summit and was on his way to camp when the storm struck. His account of the disaster is gripping, painful, and angry. Krakauer is not shy about offering up criticism of expedition leaders and some fellow climbers, and he discusses his own feelings of guilt as to one guide who died on the mountain. I know nothing about mountain climbing, and I couldn't put this book down.ETA--I was so fascinated by the book that I looked up dang near everything I could find online about the disaster. I'm not the only one; PBS Frontline ran a special just last month about some of the survivors. Krakauer's book angered a few other participants from his climb; however, their criticisms go to peripheral matters (did guide Anatoli Boudreev behave responsibly in descending before his clients? Was one of the sherpas too busy attending to a Manhattan socialite to perform his other duties properly? Did Krakauer himself collapse while descending the mountain? Could Krakauer have left his tent on the South Col and helped Boudreev's heroic rescue effort on the night of May 10?) and not to the major issues raised in the book. There appears to be broad agreement that Rob Hall and Scott Fischer allowed other concerns, personal and commercial, to take precedence over getting their clients down off the mountain safely. Also, Fischer's judgment may have been seriously impaired by a high-altitude ailment. Moreover, the number of deaths on Everest suggests that there are plenty of people climbing the mountain who have no business being there in the first place."}, {"userName": "Alisa", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/2738978-alisa", "userReview": "I live in Seattle and on a reasonably clear day Mount Rainier, at 14,000+ feet, graces the skyline with her majestic beauty and mystique. Sometimes it looks like you can reach out and touch it. It has an undeniable allure. There are lots and lots of climbers up there every year, and it is a highly desirable North American peak for people to scale that still offers challenge and excitement and danger. High altitude mountain climbing is not for the faint of heart yet it is easy to understand how people can be seduced by the idea of conquering a big feat like this. But you look at Everest and wonder why anyone in their right mind would risk their life to go up there. Aren't some things and places in nature better left to just be? Apparently humans can't help themselves. “Everest has always been a magnet for kooks, publicity seekers, hopeless romantics, and others with a shaky hold on reality.” Jon Krakauer was offered an opportunity to join an Everest climb so he could write a magazine article. He ended up on a historic climb that turned tragic for several in his party as well as a couple other expeditions on the mountain at the same time. Krakauer is a very good writer and he conveys the magnitude of the operation, the challenge, the personalities, and the journey quite well. That he managed to survive could be chalked up to what turned out to be some fairly good decisions on his part despite his relative lack of experience at this level. It is tough to breath up there much less think, and although he had climbing experience this was a first for him. Seeing the journey through his eyes was fascinating. With the benefit of hindsight, he levels criticism at some of the planners, guides, and fellow climbers, that may be warranted but understandably was met with controversy by loved ones and some in the elite climbing community. Nonetheless, it is the true story of a harrowing climb that few ever attempt. Gripping story."}, {"userName": "Alissa Patrick", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/20229277-alissa-patrick", "userReview": "This book was insane. No way in hell. These people are nuts."}, {"userName": "Algernon", "userReviewDate": "May 20, 2012", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "My 5 star rating reflects both the quality of the book and a lifetime passion for mountains. I've devoured in the past all books and magazine articles I could find, following climbers from Cerro Torres to Eiger or Matterhorn, Trango Towers, Kilimanjaro or McKinley. The Jewels in the Crown have always been the Himalayan peaks, with their musical names promising adventure and fame to the bold and determined climber: Nanga Parbat, Makalu, Annapurna, Kangchenjunga, Chomolungma, Lhotse, Dhaulagiri, Gasherbrum, Nanda Devi, Nuptse - the final challenges in the attempt to eliminate the white spots from the world maps. Jon Krakauer's account of the 1996 doomed attempt at climbing the highest mountain in the world as part of a commercial expedition is a worthy addition to my Mountain themed bookshelf.I didn't pick up the book in order to find out the ultimate truth about the events that culminated in one of the deadliest climbing days at high altitude. I was already aware of the numerous controversies surrounding the publishing of his reportage, and I decided to be circumspect in accepting the facts as presented. This is an eye-witness account of somebody who has been in the thick of it, directly involved in decisions that meant life and death for members of the summit teams on that unlucky day. It probably has its share of finger pointing and self serving selective presentation of facts. A second source of interference that I detected came from the fact that the story was comissioned by Krakauer publishers with a predetermined theme, and I suspect that they had their say in the final version of the book, especially regarding the dangers of commercial guided expeditions and amateurs promised a safe climb to the top.My reservations about the book were soon forgotten as I become immersed in the day to day grind of preparing for the crucial moments in the \"death zone\" - acclimatization ascents, health hazards at base camp and above, the interplay between members of the team and between different expeditions. Krakauer puts these preparation weeks to good use, sketching detailed portraits of the main actors in the drama, getting the reader familiar with them and with the technical aspects of high altitude climbing, and letting the later chapters be focused on the unfolding events on the peak and in the aftermath of the devastating tempest that left all previous planning and training irrelevant.Krakauer training as a journalist is visible in the clear cut prose, the depth of his research and the high emotional impact of the human interest stories behind the cold facts that left 9 people dead. One of the things that drives home to me the merciless nature of the Himalayas and the devastating effect of the lack of oxygen and the physical exhaustion of the climbers is the casual mention of climbers passing by frozen corpses on their trail to the summit, bodies that have lain there for decades in some cases, and that nobody tries to bring down to Base Camp because of the risks the rescuers are exposed to. 8000 m above sea level is called the \"death zone\" for a reason : humans are not meant to live here, and the body will refuse to function, no matter how strong the will of the climber is, or how good his training. Krakauer and his team mates are not inconsiderate of the risks, in fact they are well aware of them from past ascensions and numerous accounts of previous expeditions. The author does a good job here exploring the motivations, himself included, that drive people to put their lives at risk: fame, the call of adventure, the pride of belonging to an elite group, curiosity, self-fulfillment, commercial interests, escape from the tediousness of a life without real challenges, and so on. He also speaks clearly about what a high altitude climb really feels like : you have no time to admire the landscape or to think deep thoughts about existence and fulfilled dreams; you are too busy dragging thin air into your lungs three times for every step forward, too exhausted after three nights without sleep, after weeks without proper food, your brain slows down for lack of oxygen and your eyes are blinded by snow and ultraviolet light. Every hour spent in the \"death zone\" increases the risk of remaining there for ever. Here's what Rob Hall, the most famous guide on the mountain in 1996, had to say : With enough determination, any bloody idiot can get up this hill. The trick is to get back down alive Jon Krakauer may be subjective in what he included in his account, but he convinced me as a reader that he was there on top of the world, and he survived to come back with a warning about overestimating ones prowess, disrespecting the mountain and taking risks with people's lifes. His lesson about excessive commercial interests and lack of organization between different teams has not been learned: sadly, just while I was in the middle of the book, I saw an item on the news that on 21 May 2012, 4 more people died on Everest, not in accidents, but due to exhaustion. Apparently 150 people tried to climb the summit on the same day, producing a traffic congestion on the most dangerous part of the climb.I will end my report, with a quote from when Jon first saw the peak, on the trail to base camp : The summit looked so cold, so high, so impossibly far away. I felt as though I might as well be on an expedition to the moon. As I turned away to continue walking up the trail, my emotions oscillated between nervous anticipation and a nearly overwhelming sense of dread."}, {"userName": "Viv JM", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/4243437-viv-jm", "userReview": "Unfortunately, the sort of individual who is programmed to ignore personal distress and keep pushing for the top is frequently programmed to disregard signs of grave and imminent danger as well. This forms the nub of a dilemma that every Everest climber eventually comes up against: in order to succeed you must be exceedingly driven, but if you're too driven you're likely to die. Above 26,000 feet, moreover, the line between appropriate zeal and reckless summit fever becomes grievously thin. Thus the slopes of Everest are littered with corpses. Into Thin Air gives the account of a disastrous day on Mount Everest in 1996, when 8 people lost their lives. The author, a journalist but also an accomplished climber, was among those attempting to reach the summit that day, and recounts what happened as far as it is possible to tell. The tragic events of that day seem not to have one cause, but were an accumulation of small errors in judgement, possibly coupled with a smidgen of hubris and machismo. Krakauer does attempt to disavow the notion that mountain climbing is all about ego and adrenalin seekers: Above the comforts of Base Camp, the expedition in fact became an almost Calvinistic undertaking. The ratio of misery to pleasure was greater by an order of magnitude than any other mountain I'd been on; I quickly came to understand that climbing Everest was primarily about enduring pain. And in subjecting ourselves to week after week of toil, tedium, and suffering, it struck me that most of us were probably seeking, above all else, something like a state of grace. I'm not sure I'm totally convinced. Throughout the book, I found myself frequently scratching my head in bewilderment, thinking \"why on Earth would anyone want to put themselves through this?\" Maybe it is because I have absolutely no compulsion to conquer anything...other than perhaps the mountain that is my TBR pile :-) It is testament to the skills of the author that, even though you know the outcome before you start reading, this book is such a page turner and the suspense is maintained throughout. It is a thrilling read.Alongside the paperback for reference, I listened to the audiobook of this, narrated by Philip Franklin. He was mostly pretty good, other than when he did New Zealand or English accents - they were a little on the cringeworthy side."}], "description": "A bank of clouds was assembling on the not-so-distant horizon, but journalist-mountaineer Jon Krakauer, standing on the summit of Mt. Everest, saw nothing that \"suggested that a murderous storm was bearing down.\" He was wrong. The storm, which claimed five lives and left countless more--including Krakauer's--in guilt-ridden disarray, would also provide the impetus for Into Thin Air, Krakauer's epic account of the May 1996 disaster.", "title": "Into Thin Air: A Personal Account of the Mount Everest Disaster", "url": "https://www.goodreads.com/book/show/1898.Into_Thin_Air_A_Personal_Account_of_the_Mt__Everest_Disaster", "average": 4.13, "cover": "https://images.gr-assets.com/books/1463384482l/1898.jpg", "reviews": 11192, "authors": [{"url": "https://www.goodreads.com/author/show/1235.Jon_Krakauer", "name": "Jon Krakauer"}], "type": ["Nonfiction", "Adventure", "Autobiography", "Travel", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/1898.Into_Thin_Air", "http://www.goodreads.com/book/show/271285.Into_Thin_Air", "http://www.goodreads.com/book/show/871781.Into_Thin_Air", "http://www.goodreads.com/book/show/12236183-into-thin-air", "http://www.goodreads.com/book/show/9819621-into-thin-air", "http://www.goodreads.com/book/show/30987311-into-thin-air", "http://www.goodreads.com/book/show/1845.Into_the_Wild", "http://www.goodreads.com/book/show/10847.Under_the_Banner_of_Heaven", "http://www.goodreads.com/book/show/24911006-missoula", "http://www.goodreads.com/book/show/2936415-where-men-win-glory", "http://www.goodreads.com/book/show/1897.Eiger_Dreams", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}