{"ratings": 8612, "userreviews": [{"userName": "Deanna ", "userReviewDate": "Aug 16, 2016", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "My reviews can also be seen at: http://deesradreadsandreviews.wordpre...I am quite surprised that I haven’t read anything from Allison Winn Scotch before. When I came across this book and thought it sounded very interesting. A bit of a lighter read after all of the thrillers and books about missing adults and children that I have read lately.I read this quite quickly. The plot was good and flowed well. As I am almost the same age as these characters I could relate to a lot of what was going on back when they were in their early twenties and also twenty years later.Twenty years ago, six friends shared a house while attending Penn University. Bea, Annie, Catherine, Owen, Colin and Lindy. They considered themselves not just friends but family. They promised themselves and each other that no matter what happened in life they would always remain close.“We were twenty-one. We were allowed to believe impossible things.”However, life happens and as the years pass a few things happen that end up severing the ties between many members of the group.Now twenty years later the five friends have been summoned back to the house they lived in all those years ago. It is the 4th of July weekend and they have all returned to the house that held so many memories. But this isn’t exactly a happy homecoming. All of the friends have returned not only with the issues they have with each other but the many issues they have going on in their own lives. So many secrets and things left unsaid.Will they take this chance to make things right? Can they come together and be as close as they once were? Or will their stubbornness, insecurities, and revealed secrets pull them even further apart?I really enjoyed this book. The characters were compelling and well-developed. The author skillfully writes about secrets, friendships and marriage. It all felt very believable. The egos and insecurities and all of the things that get in the way of relationships. Her descriptions of those gut wrenching feelings of crushes, early love , break-ups as well as unrequited love were bang on. I remember when forty felt so far away and twenty years a lifetime. I felt nostalgic reading this. It made me even more aware of how my own life has changed over the years. Makes me feel like I need to do a better job of reaching out to some of my old friends.The one thing I do wish was that the ending was a bit longer and more detailed. I can understand where the author was going with it, sort of leaving some things up in the air, but I think it would have been really nice to see how things tuned out for these characters that I grew to care about.All in all an engaging read that held my interest from beginning to end. I am definitely looking forward to reading more from Allison Winn Scotch."}, {"userName": "Allison", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/95055-allison", "userReview": "Hi guys!So, yes, this is my book and yes, I'm rating it five stars. :) But I am truly so excited to get it out in the world (on July 1st): it's my first book in three years, and it's the reunion book I've hoped to write for a while now: bringing together a hodgepodge of estranged best friends who gather to pay respects to their late ringleader on the eve of her 40th birthday. It is (I hope) a story not just of friendship and family, but also of failed and rediscovered dreams, of faltering and renewed love, of lost and recovered selves. Mostly, I think it's about home and how we go about tethering ourselves to those around us when the world outside proves fragile.If it sounds like it might be up your alley, add it to your shelf because we're giving away lots of ARCs here on Goodreads in the coming months before the July release. Hope you enjoy it as much as I loved writing it.Allison"}, {"userName": "Chelsea Humphrey", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/47207032-chelsea-humphrey", "userReview": "Find all my reviews on my blog: https://thesuspenseisthrillingme.comDate Read:Pub Date: 07/01/164 STARSTwenty years ago, six Penn students shared a house, naively certain that their friendships would endure—until the death of their ringleader and dear friend Bea splintered the group for good. Now, mostly estranged from one another, the remaining five reluctantly gather at that same house on the eve of what would have been Bea’s fortieth birthday.But along with the return of the friends come old grudges, unrequited feelings, and buried secrets. Catherine, the CEO of a domestic empire, and Owen, a stay-at-home dad, were picture-perfect college sweethearts—but now teeter on the brink of disaster. Lindy, a well-known musician, is pushing middle age in an industry that’s all about youth and slowly self-destructing as she grapples with her own identity. Behind his smile, handsome plastic surgeon Colin harbors the heartbreaking truth about his own history with Bea. And Annie carefully curates her life on Instagram and Facebook, keeping up appearances so she doesn’t have to face the truth about her own empty reality.Reunited in the place where so many dreams began, and bolstered by the hope of healing, each of them is forced to confront the past.College is a milestone most wish they could relive from time to time. Personally, I didn’t finish college (never say never!) and didn’t have the typical experience that most did as I was married at a very young age (19 to be exact). Throw 2 kids into the mix and going back to school became a distant thought. This book brought all those feelings and dreams back to my forethought and felt somehow comforting as I read it. These friends, who seemed to live completely different lives than they expected as their younger selves, were interesting to watch grow throughout the story.My favorite character ended up being Owen; I felt as a fellow stay at home parent I could relate to some of his struggles and lifestyle. Lindy was probably the most trendy character as a famous musician and I enjoyed reading about her lifestyle struggles as well. I think as women we all to some degree fear the aging process, as our society celebrates youth and tends to throw women away once that tiny aspect of our being is dried up completely. This is such a scary reality and I could really feel all the emotion Lindy experienced during her part of the story. The rest of the characters were also well developed and relatable, the previous two were just my personal favorites. I loved how this makeshift “family” seemed to be “stuck like glue” no matter how they tried to live separate lives. The years had passed, and this time capsule plucked everyone from their new lives to come together and relive old memories, learn from each other, and grow into a maturity they hadn’t realized quite yet they were missing. I’ve enjoyed Allison Winn Scotch’s novels before and was thrilled to read this one!*I received my copy via NetGalley in exchange for a fair and honest review."}, {"userName": "Melisa - Traveling Sister", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/42481357-melisa---traveling-sister", "userReview": "In Twenty Years is a story of reunion of six college roommates who were like family but have lost touch throughout the years. There were some very touching as well as laugh out loud funny moments. This book should have resonated with me more than it did - I lived in a house with my closest friends in college, and I am nearly the same age as the characters - however, I could not relate to any of them. Perhaps it's because of their stations in life, it seems they all became wildly rich and successful, there was no \"average\" person among the group. I believe I may be a bit critical here, so take this with a grain of salt, but it seemed as if the idea of postpartum depression in this book was kind of a throw away. I, as well as several people I know, have experienced some form of postpartum depression, and I feel as if it should be written about with a bit more reverence. Be kind with me here, friends. It takes a lot to open up about this, as well as discuss it among strangers. I feel I can't write much more, but if you've been there, know you're not alone.I would recommend this book as a poolside read. Light, but with a good message in the end.Thank you to Netgalley and the publisher for a copy of this book in exchange for an honest review."}, {"userName": "Sarah  T", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/22663838-sarah-t", "userReview": "2.5 stars (struggled to decide between 2 and 3).Setting aside the improbability that in a group of six college friends one would become a major rock star, one the CEO of her own company with a regular media presence and one a top plastic surgeon for a minute......Nope, can't quite do it. The group at the centre of this book have all had such unlikely trajectories (of the other three, one is former trailer trash who has married a blue blood and one is dead which just leaves ONE character whose life seems vaguely normal) that it is hard to buy in to the novel. The fact that the characters themselves aren't particularly likeable either doesn't help - although I appreciated the fact that fame and fortune wasn't portrayed in a particularly positive light.For all that, this was perfectly readable, well written for the most part and with a nice optimistic central premise about letting go of youthful mistakes and moving forward with adult life."}, {"userName": "Nanie Hurley", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/4016066-nanie-hurley", "userReview": "This book was not for me.I struggled to finish the reading. I didn't quit because the author is pretty good and writes very well, but the story was just too boring.If I hear once more how Bea was amazing and would have all the answers and make their lives just perfect, I will lose it. I understand that we often remember those we lost in a better way than the reality and we tend to forget all we did not like. But this group goes too far. Let's face it, nobody is perfect. And even if he perfect somebody (a.k.a. Bea) did exist, that person would not be the answer for all your f***ing problems.The remaining 5 are completely lost. And I just could not connect. I didn't feel sorry for any of them, I just wanted to slap their faces and say \"collect yourself, face your life and do something\". They just moan about the same problems throughout the book and nothing happens. I do not recommend this book."}, {"userName": "Danielle", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/4157075-danielle", "userReview": "I made it halfway through and regret even that time spent. This is truly just bad. I skimmed the rest to see if I was missing anything: I wasn't. The author lost me with this one.Fingers crossed I read a good one soon!"}, {"userName": "Obsidian", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "I dithered about this book for a while. There was something bugging me about it and then I realized. I pretty much called every single one of the endings for the characters. I didn't really like the character (Lindy) who was bisexual being portrayed as \"slutty\" and the poor girl/woman (Annie) who sat around harboring same lame crush on a guy (Colin) that didn't want her. I was more interested in the married couple (Catherine and Owen) but even after a while I tired of them. I think this book was a mash up of The Big Chill and I will be the first to say I was not a fan of that movie. Probably because even as a child I had no patience for selfish people (which I counted a ton as while watching that movie).I had liked I think maybe 1 or 2 of Scotch's prior works. But the later stuff has not been doing a thing for me. I think if this had been shortened a bit, or maybe just didn't include this manic pixie girl (Bea) as this bigger than life character we never get to really see as readers it would have worked better. I just had a hard time with people who have been sporadically in touch through 20 years to all of a sudden make a sojourn back to a house they stayed at during college. Don't get me started that one of the characters is as popular as Martha Stewart and another one is a world famous musician. You don't get the sense at all from the little introduction chapter we get on these people that these are the careers they would fall into or want to do. I don't know who I disliked the most out of the characters: Bea, Colin, Annie, or Lindy. It's pretty much a toss-up for me. I didn't care for the character of Bea based on what we see about her during some other character's flashbacks. Bea to me is very manipulative. I didn't get some wise woman living in a young woman's body. We are told constantly that Bea lived on the edge and was IMHO way too close to her friends from college. We get some bare insight into this character about finding out she's an orphan. But I ultimately didn't like how she chose to treat Annie like a small child who had to be protected. Annie was aggravating. I never got a handle on this character either. I think that her unrequited crush on Colin and her ridiculous propelling of him onto a pedestal is what made it so hard to like this characters. Plus Scotch introduces the husband via Annie's character who you don't care for at all, but then you learn some things so you end up having some sympathy for him, and then Annie proceeds to make terrible decisions throughout the book. The character of Lindy is a popular musician who is a lesbian some of the time but has sex with men still. I am still confused by this whole character. Did Scotch not want to have a bisexual character? Cause it made me confused why Lindy I think identifies as a lesbian though she is attracted and sleeps with men. Seriously someone help me out here, I just didn't get what was going on and what was Scotch trying to portray with this character at all. I also hated the whole Lindy can't be monogamous thing that was going on either. I know that one of my friends who is bisexual and happily married with kids now said it used to tick her off when people thought her identifying as such meant she slept around. I think ultimately I was confuse though because a secret is put out about why she really went about sleeping with the character of Colin and I just wanted to tell her to go see a therapist. Colin I found to be gross.Catherine and Owen were ultimately the only two characters that seemed to be fully fleshed out. I wish that Scotch had stuck with them more honestly. I was more interested in this atypical marriage which is becoming the norm (wife works and husband stays home) and seeing how Owen is feeling unfilled at this role. Heck, this is what a lot of mothers feel as well, so it would have been great to see these two acknowledging that things are not working out and how to fix it. There's just a lot of drinking, fighting, and acting crazy. The writing was okay, though I got really confused while reading. Maybe if the book had been told in a linear fashion (start off with them about to graduate, then go to the wedding, then hit 17 years later or whenever it was they all received letters). Instead we have characters flashbacking and being in \"present\" time while reading chapters. I honestly think the multiple POVs throw this book off too. We start off with Bea, then go to Annie, Lindy, and after that I believe it's Catherine, then Owen, and finally Colin. Then we beep bop around for the whole book. The last chapter made me roll my eyes a lot too. I think I was supposed to get a feeling of well being instead of annoyance that made me feel like none of these people learned a thing. We also don't equally stick with characters. Most of the book belongs to the women characters. And honestly, after two rounds of Lindy, I was pretty much done with her. The book mentions that this is about 6 friends (a 6 pointed star) who go to Penn and I can tell you that no one calls the University of Pennsylvania Penn. If you say Penn, most people think you are talking about Penn State. I was so surprised when I realized this book was supposed to take place in Philadelphia and then I put two and two together and was like oh she mans University of Pennsylvania. And can I say that besides some random talk of cheese-steaks, I did not get Philly from this book. Let alone these people who had lived at a house nearby the university for a number of years."}, {"userName": "Catherine McKenzie", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/2796203-catherine-mckenzie", "userReview": "This should be on your summer must-read list!"}, {"userName": "Judy Collins", "userReviewDate": "May 20, 2016", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Lake Union and NetGalley for an ARC in exchange for an honest review. Contemporary Chick-lit queen, Allison Winn Scotch returns following (2013)  The Theory of Opposites  with a perfect summer sizzler to celebrate July 4th, IN TWENTY YEARS, from nostalgia, to reconnections—a reunion of friendship, relationships, love, loss, mixed with lots of wit and heart.Bea was the glue  which held them all together. Their last night under the same roof as a six-point star. They all loved each other, and her wish was to come together in twenty years at the same house. She made this possible; however, she was in the only one which will not be in attendance. Twenty years ago, six Penn college students which shared a house, would come together. A time capsule. Their twentieth reunion. Forty-forty two years old. Where would they e their life’s journey? Would they have regrets?1998:  Annie and Lindy were off to New York. Annie had lined up a job in PR. Lindy was intent on being a superstar. Owen and Catherine were set to domesticate outside of Chicago. Colin was driving west to Palo Alto for medical school. A neurosurgeon. Bea made them all promise, that nothing would change. They were her family. They believed in the impossible. Their star, and destiny. 2016:  They each receive a mysterious letter in the mail. Requesting their presence. They had not seen each other in thirteen years. The horrible day at Bea’s funeral. They were all there: Annie, Catherine, Owen, Colin, and Lindy. Mail arrives for everyone from an attorney in New York. On behalf of Beatrice “Bea” Shoemaker. She had asked a notice be sent to everyone in June 2016. The executor of her will, back in 2003. She purchased the former residence on campus at the University of Pennsylvania. The executor has managed the row house and according to her will - will vacate the premises for the summer of 2016. The weekend of July 2016 on the eve of Bea’s July 4th birthday—her fortieth. Bea had set aside something important for all. The stipulations—no one could receive the said item until the five of them are all together for her birthday. From indiscretions of youth, resentments, secrets, fears, dreams, loves, and ambitions. Of course, things have not remained the same, over the years for anyone. They all have led different lives, each with different sets of problems. Catherine,  the CEO of a domestic empire. Owen, a stay-at-home dad, were picture-perfect college sweethearts—but now teeter on the brink of disaster. Lindy, a well-known musician, is pushing middle age in an industry that’s all about youth and slowly self-destructing as she grapples with her own identity. Colin:  Behind his smile, handsome plastic surgeon harbors the heartbreaking truth about his own history with Bea. Annie carefully curates her life on Instagram and Facebook, keeping up appearances so she doesn’t have to face the truth about her own empty life. From five different points of view  we hear from each character. From flaws, friendships, and dreams of youth. An ideal beach summer read, with perfect timing for the July release date. What did Bea hope for in twenty years? Who would she be, and what did she dream of? They would do it together, as one. They are the six-point star, now a five- point new star. Family. Friendship, Relationships. Beautiful Fireworks!Each person will need to face the past in order to heal, and move forward with their lives. Long buried secrets are exposed. Grab a hammock, a cocktail, some quiet time, and enjoy the holiday read of old friends!If you have read  any of Scotch’s previous books, you can expect lots of wit and drama, with her well-developed characters, capturing the nostalgia and youth. Contemporary chick-lit, sprinkled with social media, trends, drama, with music and events of the times. Fans of Sarah Pekkanen, Jennifer Weiner, Julie Buxbaum, and Emily Giffin  will love this poignant reunion!The book reminds of an older movie (1983) The Big Chill,  an American comedy-drama film with the plot focusing on a group of baby boomer college friends who reunite after 15 years when one of their old comrades, Alex, commits suicide without warning. (Beaufort, SC) Also influencing the TV series, Thirty Something. Can you even imagine what you would have in common with your college friends, especially when you get to be my age? OMG—nothing. This book really takes you back at some of the crazy choices we made.  Loved the  Author's inspiration behind the book.  JDCMustReadBooks On a personal note:  Of course, when I was in college and in my twenties, I was married, having two babies, diapers, school, homework, buying a first home, and work. Juggling it all. We either get our fun early or late. \"My time\" came when I had two boys off to college when I reached the age of forty, divorced, nice career, and living the life of a twenty-something and single. (everyone thinks you are your sons’ girlfriend when you visit them in college). If I had to do it over, would do it the same way again (with a few more wiser choices). We all have to ask ourselves this question, reflecting back twenty years ++. Something to be said for being 40 and already having your kids in college, versus my son (1975) today at almost forty-one next week. His kids are in the first grade and third grade; the other son, (1973) not even married yet, with no children-enjoying being single. Too set in his ways. You either get your fun early or late – pick your poison. When you are young you have much more patience. Happy with “my way” --sixties and still young enough to still enjoy life, upcoming retirement, grandchildren, and travel. With a head start at adulthood very early--then you can play later."}, {"userName": "Jodi", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/3164911-jodi", "userReview": "I want to thank Netgalley & Lake Union Publishing for the opportunity to be able to read this advanced copy.What a great book. So many characters, but they all just seemed to draw me in. A group of college friends make lists of what they want to tell their \"older self\" 20 years later...unknown to them is that the one who dies seems to be the glue that holds them together. Through her will, she brings them all back to their old haunting grounds where they find themselves once again. In just one weekend their worlds turn upside down.Looking for a great summer beach read? Look no further."}, {"userName": "Theresa Alan", "userReviewDate": "Jul 15, 2016", "userURL": "http://www.goodreads.com/user/show/3268839-theresa-alan", "userReview": "The multiple points of view that tell this story are wonderful and deftly executed. In college, six friends lived together. Eighteen years later, the surviving friends receive a letter from a lawyer about a trust put together by their deceased friend, and to learn more, they must all return to the house they shared for the weekend of July 4th, which was the birthday of Bea, the friend who died.In those eighteen years, the friends lost touch after a wedding in which friends betrayed each other and the death of Bea soon after that wedding.The characters seem successful on the outside, but they are all in the midst of a crisis, which they keep from each other for as long as possible during their weekend together.One of the things the author did extremely well was balance what it meant to be a stay-at-home mom (Annie) married to a wealthy man, a mom (Catherine) with a demanding career and a stay-at-home dad (Owen) who was her college sweetheart, and a woman who focused on her music career and avoided serious relationships (Lindy—she is selfish and self-centered and occasionally unlikeable, but her motivations make her a complex character despite her faults). Scotch never suggests that one path is better than any other or easier than any other. The other friend is Colin, a plastic surgeon in LA, and the only friend who knows the full truth about Bea’s death.This is an extremely well-written book and I thank NetGalley and Lake Union Publishing for giving me an advanced look at this novel.To read more of my reviews, please visit http://theresaalan.net/book-review-wo..."}, {"userName": "Elizabeth", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/4247182-elizabeth", "userReview": "I've never been interested in reunions - either high school or college. They've never appealed to me. But - and this is a big but - maybe I've been wrong. This book is all about getting to know old friends and see how they've changed. Believe me, they all changed in \"In Twenty Years.\" Bea is the main character in this book. She held a group of college students together for their college years. I vaguely remember belonging to a group of women like this. They did everything together.Twenty years later, they receive a letter demanding the come back for a reunion. The story is all about what has happened to each of these characters during the twenty years after they graduated. I found this book to be a little long winded, but it did make me think about growing up in the 60's and 70's and what I did in college. It's a little nostalgic.I received this book from NetGalley and Lake Union Publishing in return to an honest review. Thank you."}, {"userName": "Amy", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/14045562-amy", "userReview": "3.5/5I’m joining in again with Throwback Thursday which was created by my good friend Renee at It’s Book Talk. She started this weekly feature as a way to highlight old favorites and read books that have already been published. I have so many older books on my TBR that get ignored in favor of review copies and I figure participating in Throwback Thursday will help me to read at a least one older title a week!This is told from multiple perspectives that of Catherine, Owen, Annie, Colin and Lindy. This group couldn’t be more different, but maybe that’s what made them all connect in the first place twenty years ago. Catherine and Owen are married with children and go the non traditional route as he stays home with the kids and she works. They seem like the perfect all American family on the surface, but resentment bubbles under the surface. Annie is also married with one kid and she tries really hard to present the perfect life to the world, especially online. We all know no one is perfect though… Colin is a successful surgeon with a big secret about their late friend, Bea and Lindy is a famous musician with way too many issues to list here. For such a large ensemble cast of characters I found them all to be really well drawn and relatable. Some more than others, I didn’t have much in common with Lindy’s rock star life but could relate to both Annie and Owen as stay at parents. (I wonder why? 😜)This isn’t a traditional mystery but rather a story of secrets and long held grudges with mysterious elements. When they reunite at the bequest of Bea most of them haven’t kept in touch at all and all have different issues with each other and things they really don’t want the others to know. I admittedly got slightly annoyed with most of them because so many of their problems could’ve been solved by simply talking to each other, but without conflict this would’ve just been a boring story about a group of middle aged friends, so I get that it was basically the driving force of the book. Overall this was an enjoyable read, the author is a good writer my only complaint was the ending, I felt like there were just too many loose ends that weren’t tied up at all BUT I’m super picky about endings so take that with a grain of salt. All of my reviews can be found on www.novelgossip.com"}, {"userName": "Melissa", "userReviewDate": "Sep 18, 2016", "userURL": "http://www.goodreads.com/user/show/110328-melissa", "userReview": "What would it be like if you were required to have a reunion with your closest college friends? The ones you no longer have much contact with, that is? This is what Allison Winn Scotch explores in her latest novel. I found the contrasts in the friends' lives to be interesting. They were scattered all over the country. Two were famous for entirely different reasons. One was faking her happiness on social media. The last time they saw each other, there was a huge fight. Suddenly, they're practically forced to be in the same house for a weekend, after thirteen years apart, to appease their deceased friend. I could relate to some aspects, since I'm the same age as these characters and went to college around the same time they did. Reading about their college memories made me nostalgic. It's also interesting to see how much people change over time. I know I have changed, and that's probably estranged me from some college friends. Not to say that some of them haven't changed though. Initially, the story focuses on where each character is at in their lives and eventually reveals what led to the fight. The story builds up to a dramatic climax when various things go wrong for each of the friends. Confessions are made. Secrets are revealed. Embarrassing situations are caught on video. Messages are sent that can't be taken back. There's a heightened level of drama, which kept the last half of the book moving along, keeping me guessing as to what would happen next. I probably could have done with less introspection and self-psychoanalysis, but I probably do that a lot in my own life, even without putting it on paper.Overall, I enjoyed Allison's latest novel and the friendship dynamics within. Would I want to be forced into a reunion with my college friends? Maybe with some, but definitely not with certain others. Here's my Hollywood dream cast:Annie: Michelle MonaghanLindy: Jenny LewisCatherine: Isla Fisher Owen: Corey Stoll Colin: Alex O'Loughlin"}, {"userName": "Tina", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/5009669-tina", "userReview": "3.5 *Loved the premise of this story. Six people who were the closest of college roommates gather for a twenty year reunion and to read time-capsule like letters from their younger selves. Only now, there are five of them left. After the death of their \"leader\" they have since drifted apart. This is a story of forgiveness, hope, love and acceptance. The writing is good and the story flowed at a good pace. I do wish there was some more closure with some of the characters. Perhaps the author left us guessing on purpose. I could so see this book being made into a movie. I'd definitely see it!As always thanks to NetGalley and Lake Union Publishing for allowing me the opportunity of reading this advanced readers copy. Special Note: Lake Union Publishing never seems to disappoint me. Their books are always intriguing and delightful."}, {"userName": "Lauren R.", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/4356867-lauren-r", "userReview": "Ugh finally. Three stars feels generous, to be honest. I liked certain parts of the book and some scenes but god these characters were T E R R I B LE. Like, the worst I've encountered probably ever? I loved the two boys but the three girls omg I cannot. Selfish and annoying and frustrating. I loved the reunion aspect (obviously) but the rest felt heavy-handed and overall blehhh."}, {"userName": "Lorilin", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/5887880-lorilin", "userReview": "Twenty years ago, there were six of them: Annie, Lindy, Catherine, Owen, Colin, and Bea. When they graduated from Penn State, they were hopeful about their futures and determined to remain connected. But after several disastrous get togethers, and then especially after Bea’s shocking death seven years after graduation, the remaining five have grown apart.Flash forward 20 years, just weeks before what would have been Bea’s 40th birthday, and the five friends receive a cryptic message from Bea’s former lawyer, asking them to gather at their old house near campus to receive one last package from Bea. Though none of them is particularly looking forward to seeing the others, they all meet at the house and spend the next several days confronting past hurts, confessing long-buried feelings, and making amends for, well, a whole lot of crazy drama.This book is longer than it needs to be, but it is still so very readable. I liked the story and enjoyed the characters. I was actually pleasantly surprised at many of the relationship dynamics in here (for example, between Lindy and Annie, and even between Annie and Colin). I couldn’t predict exactly where certain storylines were going, and I always appreciate when an author can surprise me.My only real complaint is that the characters were sometimes cliche. Lindy is such the chaotic rock star. Catherine is the anal retentive Martha Stewart. Annie is the unhappy and fragile housewife (very Charlotte from Sex in the City). And worst of all is Bea who comes across like The Oracle in The Matrix. She’s the all-knowing Oprah of the group who is ever patient, ever kind, and always wise beyond her years. Bleh. Luckily, the men–well, at least Colin and Owen–are portrayed more realistically, but they still don’t get nearly the attention they deserve.So yeah. I liked this book. It’s mostly light, sometimes funny, and even offers a bit of insight every once in a while. It could have been edited down, but I didn’t mind giving it some extra time."}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "\"In Twenty Years\" is about a group of college friend brought back together after their friend, Bea, who passed away tragically declares in her will that they must come back to the house that they shared in college for one weekend twenty years after graduating college. By this time, most of their friendships have fallen apart. They are no longer the inseparable group they once were. Will this one weekend change anything?I really was looking forward to this book! The idea of meeting up with people from your past is so intriguing to me. Relationships change but you always have the memories of the good times with people you were close with at some point in your life. The group in the book is absolutely wracked with memories of each other. Some have become very successful since college. Some are struggling to keep up the image of a perfect life. All are suddenly haunted by Bea's memory, which casts a presence over the entire book. I loved how the author explored all of the different thoughts and feelings of the different characters in the book. Each of the characters feels well-rounded and real. This is the kind of book that makes you wonder \"what if.\" It is easy enough to live in the past and to worry about things that happened oh-so long ago. These characters have both love and grudges in the forefront of their brains throughout the weekend. This is a great book with memorable characters and I enjoyed it! It would be a perfect read for those who like a little bit of drama with well-rounded characters!"}, {"userName": "Carol Brill", "userReviewDate": "Oct 09, 2016", "userURL": "http://www.goodreads.com/user/show/4427869-carol-brill", "userReview": "I was grateful and excited to win 15 copies of In Twenty Years for my book club from Reading with Robyn. As a fan of relationship stories, the description of a twenty year reunion of six college best friends interested me. I grew up in Philadelphia, so the Philly setting at Penn was another hook. The story is told from the six different points of view, two men and four women. The group reunites on the 40th birthday of Bea, who was their ringleader. Unfortunately, the characters fell flat for me and the story just didn't seem plausible or relatable--their antics during the reunion seem more like those of college students than forty year olds. I find it really hard to like a book when I don't relate to the characters. Colin, one of the men, was the only character I found likeable. This may appeal more to readers in their twenties and thirties."}, {"userName": "Claudia ", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/9073507-claudia", "userReview": "This book reminds me of a movie from the 80’s, The Big Chill, former college friends are reunited after the funeral of one of their friends. This book starts with Bea telling the story of 5 of her college friends living together on the last day of college, how their lives got so complicated and different from what they wanted t to be and how they found each other, one more time, at the same house almost 20 years later. I read this book in one day and I was sad because I didn’t want the book to end. Thanks to Netgalley and the publishers for sending me a copy to review."}, {"userName": "Pam Jenoff", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/4980927-pam-jenoff", "userReview": "Six friends shared a house a college two decades earlier. After the untimely death of one of them (Bea) the others splintered and were never the same. Now on what would have been Bea's 40th birthday, the remaining five come back to campus and the space they once shared. Reminiscent of The Big Chill, In Twenty Years is a thoughtful and moving look at the friendships that shape us, the someones we once thought we would be, and the bonds that can be strained but not broken."}, {"userName": "Siv30", "userReviewDate": "May 13, 2017", "userURL": "http://www.goodreads.com/user/show/5260037-siv30", "userReview": "סיפורם של 6 חברים מימי הקולג': בי, לינדי, קולין, אנני, קתרין ואוון. בי נפטרה אי אז לפני שנים ועתה על פי צוואתה הם חוזרים לבית שבו הם גרו, כשהם בני 40 ולא נפגשו כ- 15 שנים. לינדי, זמרת מפורסמת בי סקסואלית שכעת חייה עם בת זוגה טטיאנה. באופן מתיע לשהותה בבית מצטרף לאון, שהוא דמות מנטור שמעירה הערות שמפקסות את הזרקור על הדברים החשובים בסיפור אם כי חלקו בסיפור לא ברור.קולין, נמתח פלסטי מפורסם. הוא לא נישא מעולם למרות שהוא הציע פעם אחת אבל הבחורה סירבה. אנני,היא מה שמכנים:Trophy wife היא נשואה לבקסטר שבוגד בה בלי הפסקה אבל היא מתעלמת מכך ומציגה את הנישואים שלהם כמושלמים למרות שהיא סובלת מדכאונות ומחרדות קשות. קתרין היא מנכ\"לית של חברה לעשה זאת בעצמך היא נשואה לאוון בן זוגה מימי הקולג' הוא עזב את הקריירה שלו כעו\"ד על מנת להיות עם הילדים בבית. אוון לא מודע למצב החברה של קתרין, וקתרין אינה מודעת לאי שקט והתסכול של אוון.בחתונה של אוון וקתרין אירע מקרה שפירק ופורר את החבורה. המקרה הזה מתבהר במהלך הספר. לאחר מותה של בי הקשרים נפרמו והחבורה לא היתה בקשר שנים ארוכות. עתה הם יחד שוב כשלכל אחד מהם סודות ותיסכולים מעברו ומההווה שלו. הפגישה מביאה אותם לנקודת הרתיחה והסודות נחשפים במהלך היומיים.אהבתי את הספר. הוא מסופר מנקודות המבט של החברים שהגיעו למפגש וכל נקודת מבט כזו מוסיפה רבדים להבנת ההיסטוריה וההווה. אחת הבעיות בספר היא שישנן דמויות שלא מספיק מתפתחות והקול שלהן חלש עד בלתי נשמע. בעיקר הדמויות הגבריות של אוון ושל קולין שהפרקים המוקדשים להם מעטים ביותר. לדמות של לאון לא מוקדשים פרקים וקולו נשמע רק מדיאלוגים שהוא מנהל עם הדמויות השונות. במובן זה דווקא הסיפור של אוון מפוספס ביותר לטעמי. יחד עם זאת הסיפורים של לינדי, קתרין ובמיוחד הסיפור של אנני משתלבים בהרמוניה והם אלה שהעניקו מבחינתי 4 כוכבים לספר הזה."}, {"userName": "Cindy Burnett", "userReviewDate": "Aug 03, 2016", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "In Twenty Years was an entertaining read that really made me think about the process of growing older. A group of six friends at Penn shared a house and believed that their relationships would endure the test of time as they headed out into the real world. Time, the death of one of the six (Bea), and life splinter the group apart. On the eve of what would have been Bea’s 40th birthday, the friends end up reuniting for a long weekend at the house where they lived in college. As the group attempts to survive the weekend together, each individual must come to terms with the state of his/her own life and relationships. I felt the resolution was realistic and hopeful even though I did feel like it was a trouble filled group. I enjoyed the book and was glad I read it. Thanks to NetGalley and the publisher for the chance to read this book in exchange for an honest review."}, {"userName": "J.F. Penn", "userReviewDate": "Jul 08, 2016", "userURL": "http://www.goodreads.com/user/show/1696949-j-f-penn", "userReview": "Having recently attended a 20 year semi-reunion, I couldn't resist this. An enjoyable fast read about old friends & the passing of time."}, {"userName": "Christina (Confessions of a Book Addict)", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/2418140-christina-confessions-of-a-book-addict", "userReview": "In college, you feel like the friendships you made will last forever and everything will stay the same, but little do you know when you enter the real world, everything changes. Six Penn students, all best friends, lived together during college and as the years go by things change drastically and most of them end up not speaking to one another. Unfortunately, one of the friends, Bea, dies and they all receive letters stating that they need to come to the house they lived in at college for 4th of July weekend. It would have been Bea's 40th birthday and she wants them all together. But can they all forget the mistakes of the past? Allison Winn Scotch's In Twenty Years is a satisfying reunion story about friendship and forgiveness. If you have ever dreamed of being reunited with all of your old college friends for a glorious weekend, you'll appreciate this book.Read the rest of my review here:http://www.confessionsofabookaddict.c..."}, {"userName": "Jen", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/11892319-jen", "userReview": "Twenty years is a long time to hold grudges, lose friendships and forget who you were. Allison Winn Scotch perfectly captures what it's like to approach 40 and rekindle old friendships and resolve those issues. The drama and heart is very real and can be any one of us. Though it's unlikely any of us are rock stars or blog superstars, I think anyone in their mid-30s and up can relate to some part of this in some way. Losing someone dear to you, reminiscing on what could have been, finally confronting issues that you have carried with you since you left school, a marriage losing it's traction....I highly recommend reading this book. You will find at least a part of yourself in one of these characters, guaranteed."}, {"userName": "Grace {Rebel Mommy Book Blog}", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/39472009-grace-rebel-mommy-book-blog", "userReview": "This review was originally posted on Rebel Mommy Book Blog"}, {"userName": "Laurel-Rain", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "Twenty years ago, six Penn students shared a house, naively certain that their friendships would endure—until the death of their ringleader and dear friend Bea splintered the group for good. Now, mostly estranged from one another, the remaining five reluctantly gather at that same house on the eve of what would have been Bea’s fortieth birthday.Their story began in 1998, and now, on the Fourth of July that would have been Bea’s fortieth birthday, they converge upon the house they once shared. The house that Bea had secretly bought, with the ultimate plan of bringing them all together again.In Twenty Years was a story of friendships that unraveled, and how each of the five remaining friends struggled with their quests to find themselves.Annie was probably the most insecure of them all, hoping to rise above her “trailer trash” past. Trying to attain a kind of perfection she imagined in the others would make her road rocky. Lindy was brazen, in many ways. Loud, opinionated, and brash. She became a success in the movie business, but beneath it all is the hidden, and unrequited love from the past.Catherine and Owen had been a couple back then…and still are. But there is a chasm growing between them. Catherine’s Domestic Goddess role in her company is falling down around her, and she fears that she will be exposed as a fraud. Owen, a stay-at-home dad, feels bored and worthless.Then there is Colin, a successful LA plastic surgeon. He remains unattached…but why is he unable to commit?Alternately narrated by the five characters, we get to see more of their struggles, and in each of their voices. We are also shown Bea's voice, in the prologue, and in a letter at the end. There is a sense of her hovering presence throughout.By the time we neared the end, however, I was bored with them and their narcissistic quests, as they bemoaned the choices they had made. Could they not realize how happy Bea would have been to live and make her own choices…and mistakes? I was glad to be done with them. However, in all fairness, the writing was great, the dialogue showcased how they interacted, and made me think that, despite their flaws, they were interesting people. 4 stars."}, {"userName": "Debbie", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/2880730-debbie", "userReview": "A six point star - that's what a group of 6 Penn studnets considered themselves in 1998. As their Senior year comes to an end and they all prepare to head out into real life, their fearless leader, Bea, insists they make a time capsule and promise to return in 20 years to see where life has lead them. She makes them all promise that nothing will change and their friendship will endure.Fast forward 18 years. Bea doesn't make it and her loss haunts them all. They all get a FedEx package from her attorney saying her will had requested they all meet at the house the lived in together at Penn on the eve of her 40th birthday (4th of July weekend). Through various chapters we get to know Owen & Catherine (who were college sweethearts and are now married), Annie (a once professional who is now a SAHM with a wandering hubby), Colin (a plastic surgeon on whom Annie pined over for years) and Lindy (the brash outspoken roommate who is now a music superstar).We learn how their lives have been since college. The loves and losses. The hopes and dreams. Infidilities. Babies. Careers. Thoughts of Bea intermingled through it all.Really liked this book. Although found hte ending did not resolve everything I had hoped it would. I'm hoping that means a sequel!Thank you Netgalley & Lake House Publishing for my ARC copy. It was my pleasure to read it and give you my honest review."}], "description": "Twenty years ago, six Penn students shared a house, naively certain that their friendships would endure—until the death of their ringleader and dear friend Bea splintered the group for good. Now, mostly estranged from one another, the remaining five reluctantly gather at that same house on the eve of what would have been Bea’s fortieth birthday.But along with the return of the friends come old grudges, unrequited feelings, and buried secrets. Catherine, the CEO of a domestic empire, and Owen, a stay-at-home dad, were picture-perfect college sweethearts—but now teeter on the brink of disaster. Lindy, a well-known musician, is pushing middle age in an industry that’s all about youth and slowly self-destructing as she grapples with her own identity. Behind his smile, handsome plastic surgeon Colin harbors the heartbreaking truth about his own history with Bea. And Annie carefully curates her life on Instagram and Facebook, keeping up appearances so she doesn’t have to face the truth about her own empty reality.Reunited in the place where so many dreams began, and bolstered by the hope of healing, each of them is forced to confront the past.", "title": "In Twenty Years", "url": "http://www.goodreads.com/book/show/28353727-in-twenty-years", "average": 3.58, "cover": "https://images.gr-assets.com/books/1456793265l/28353727.jpg", "reviews": 748, "authors": [{"url": "https://www.goodreads.com/author/show/344525.Allison_Winn_Scotch", "name": "Allison Winn Scotch"}], "type": ["Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/3521419-time-of-my-life", "http://www.goodreads.com/book/show/7052976-the-one-that-i-want", "http://www.goodreads.com/book/show/18361466-the-theory-of-opposites", "http://www.goodreads.com/book/show/638959.The_Department_of_Lost_Found", "http://www.goodreads.com/book/show/11890804-the-song-remains-the-same"]}