{"ratings": 318, "userreviews": [{"userName": "Erin", "userReviewDate": "Jul 27, 2007", "userURL": "http://www.goodreads.com/user/show/222845-erin", "userReview": "AWFUL. The most pretentious, unnecessarily complicated writing I have ever encountered. Just don't."}, {"userName": "Amy Hunter", "userReviewDate": "Jan 10, 2012", "userURL": "http://www.goodreads.com/user/show/5788510-amy-hunter", "userReview": "HATED this book. I couldn't finish it - that's saying a lot for me. In the past I've put down books because of content, but I've never NOT finished a book because it failed to interest me. It was extremely difficult for me to just stop reading this book, as an avid reader it made me feel like a little bit of a failure, to not conquer that book...but I just couldn't get through it. It was pretentious, the author was name dropping every other sentence. It was also very repetative, she'd say something and then a paragraph, page, or chapter later she'd say the same thing almost word for word. I'd be reading and think, \"did I already read this page? Was I just not paying attention?\" but flip back a little and see that I had just read the same thing twice. I just couldn't push through, I couldn't do it."}, {"userName": "Mark", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/9434335-mark", "userReview": "A book on a crime before it is solved is a challenge. Since there is no resolution, the author, Maria Flook fills the pages with a social history of an ambitious yet damaged young woman (murder victim Christa Worthington) who embodies the young urban professional: educated, insecure, materialistic, indulgent with herself and her child. But this slice of life delivers undeniably juicy anecdotes about the fashion industry, school days at Vassar, challenges of writing for high-powered magazines and life in New York, Paris and Truro (Cape Cod). This will not be enough for everyone. Flook has a bad habit of calling people \"nobodies,\" fatties,\" and \"losers\" as if we all want in on her nasty dorm room appraisals. The murder victim, Christa Worthington never had a chance to out grow this viewpoint. Fortunately, there is still time for the author."}, {"userName": "Koren ", "userReviewDate": "Oct 21, 2016", "userURL": "http://www.goodreads.com/user/show/17535433-koren", "userReview": "I started this book thinking it was a true crime book but its not really. It is more of a biography of the victim. If you are reading it as a biography it is ok. There are very few details of the actual crime. There is a lot of description of the town and surrounding areas, which if you are from the area you might like reading about that. At times the author seems to go off in a direction that doesn't seem to have anything to do with the story or the victim. At 400 pages I thought it might be a better story if it was at least 100 pages shorter. It seems to belabor every point. About half way through there didn't seem to be a lot that was different and I wanted it to move along a little faster."}, {"userName": "Michelle", "userReviewDate": "Aug 24, 2008", "userURL": "http://www.goodreads.com/user/show/1062623-michelle", "userReview": "The author's note warns you in the beginning that this book will not tell you who did the murder coz the crime was still unsolved at the time of publication. I appreciated the warning coz I'd've been MAD if I didn't find that out 'til the end! Knowing there'd be no answer, I was able to enjoy the tale behind the headline I remember of the murdered lady found with her two year old clinging to her bloody body, trying to nurse and to feed Mommy juice from her sippy cup (\"Mommy got into my paints.\") Interesting to read about how she ended up there. AND the internet told me that the crime was solved eventually. I looked up who did it after I finished the book. The book was just as good without the solution as it would have been with it, I think."}, {"userName": "Rosa N", "userReviewDate": "Nov 07, 2017", "userURL": "http://www.goodreads.com/user/show/45196923-rosa-n", "userReview": "Worst book I've read in years - poor writing, no substance. Fair warning - don't waste your time or money. Dislike for this author who writes herself into the book grew & grew!"}, {"userName": "Jessica", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/11164589-jessica", "userReview": "In all fairness, I think Invisible Eden is more biography than it is true crime. But still I thought the book was good, and I became emotionally attached to the victim Christa Worthington. Though the book started off slow and wayyy too detailed... the author got her flow going by the middle of the book and left me quite intrigued by the whole case. I suggest googling it after you finish this book, since a lot more has happened with the Christa Worthington murder since the publication of Invisible Eden."}, {"userName": "Amy", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/1657508-amy", "userReview": "I got to page 34 when the line reads \"I'm a little embarrassed to have to admit to O'Keefe that I don't know what that is--grand jury. I've heard of \"Grand Prix,\" \"grand slam,\" \"grand piano,\" but--Why would you ever write in this style? Also, you don't know what a grand jury is but you are writing a true crime novel? Get real.That's it for me. Page 34 and no more!!"}, {"userName": "Beth", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/61988964-beth", "userReview": "So long. And so boring."}, {"userName": "Suzie Flohr", "userReviewDate": "Apr 24, 2015", "userURL": "http://www.goodreads.com/user/show/5841724-suzie-flohr", "userReview": "this was good,but we didn't know who killed her and also it was very long winded."}, {"userName": "Dawn", "userReviewDate": "Mar 25, 2008", "userURL": "http://www.goodreads.com/user/show/1023650-dawn", "userReview": "Hated this book - never finished!"}, {"userName": "Joyce", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/51654727-joyce", "userReview": "Aweful"}, {"userName": "Kerry", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/1445914-kerry", "userReview": "My favorite thing about this book may have been that my friend Jim was interviewed and so turned up in a couple of places, which delighted me. To be fair, it may have also suffered from unrealistic expectations on my part. I was expecting a more straight-up true crime style narrative, which this most decidedly was not - it was more of a profile of the victim and meditation on class/social history on the Cape. I should probably place a little blame on the Somerville Public librarian for putting it in a display on true crime books, as well as my having just finished the Killing On The Cape podcast. Anyway, tt was well-written and I found the author's interactions with the police chief (?)/sheriff (?) [can't quite remember his title now] amusing, if at times a bit condescending on her part. Worth a read, especially if you know what to expect going in."}, {"userName": "Brianna Sowinski", "userReviewDate": "Aug 27, 2017", "userURL": "http://www.goodreads.com/user/show/4817375-brianna-sowinski", "userReview": "I don't typically read true crime but this one must have crossed my path and interested me since I requested it but now I have no idea where I heard about it. An interesting detailed look at the circumstances surrounding a murder in the early 2000s in Maine. Made me want be more tidy in case I am randomly murdered and judged by how dirty my house happened to be that day. While the investigator identifies possible suspects there is no resolve at the end. After finishing the book I looked the case up and it appears a person was found guilty that I don't believe was mentioned at all. This made the whole exercise seem a bit pointless."}, {"userName": "Breanna", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/26152837-breanna", "userReview": "I really enjoyed the different approach that the author wrote this book in. By giving more of a historical background to Christa and the area she was from, the reader is more invested into this true story. However, I felt that the story was drugged out for too long and several parts seemed to be repetitious."}, {"userName": "Kim Wright", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/49316906-kim-wright", "userReview": "A great deal of research. Work on paragraph structure.The author did not skimp on research. She included copious amounts of character history which was needed for consideration of a possible killer. Story was at times difficult to read when topic 'skipped around.' Paragraphs did not follow a single theme. Still an extremely interesting account of a tragic event on Cape Cod."}, {"userName": "Ellen", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/1444817-ellen", "userReview": "See review of Peter Manso's \"Reasonable Doubt.\" Her writing is so terrible, it's hilarious. She actually writes that after Christa Worthington found out she was pregnant, she looked out at the bay which resembled \"a giant blue diaper pail.\""}, {"userName": "Jules Gianneschi", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/38330637-jules-gianneschi", "userReview": "Interesting story, poorly written. Unneeded information about the sideline characters and their habits and attempts to hook up with the author."}, {"userName": "Julie Barrett", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/3023796-julie-barrett", "userReview": "Invisible Eden: A Story of Love and Murder on Cape Cod by Maria Flook Christa Worthington, famous fashion writer that lives in Truro, MA on the cape and about her life and her work.Love the talk of the coast and washashores, lobstering on the island and living year round on the cape.The story is about the murder and gives you many options as to who it might have been. She was unmarried and had a boyfriend but she alsohas a past in town as well. Love the history of the place, never knew it all and lives lost on the seas of those who had fished from there.I don't recall that she had left a daughter behind either, it was just a sad story on the news and I did follow who did it...Liked the eye disease discussions.  I received this book from National Library Service for my BARD (Braille Audio Reading Device)."}, {"userName": "Lita", "userReviewDate": "Mar 09, 2012", "userURL": "http://www.goodreads.com/user/show/5011907-lita", "userReview": "This book has mixed reviews but I was enthralled with it. I have been vacationing in Truro for decades so I am very familiar with the town. So familiar, that I immediately knew the street the murder happened on when the story broke on the news. The book pulled me right in and I felt that I was beside the author as she wrote of the murder of Christa Worthington. I may not be as objective as I should be because I was able to put myself in every location, it was hard not to. There was only one scene in the book that distracted me because the author would have no way of knowing what was taking place at a specific moment since Christa was alone. I won't say what scene it was for people who may want to read the book.This book is worth a read if you enjoy true crime, just know up front the murder was not solved at the time this book came to print."}, {"userName": "Jennifer", "userReviewDate": "May 22, 2008", "userURL": "http://www.goodreads.com/user/show/133770-jennifer", "userReview": "Enjoyable book. I was a little annoyed at how some of the book was written. I felt the author made herself a part of Christa's story, and felt at times as though she had a little obsession with her. The two women had things in common, but had never met one another. I was interested in Christa, and not so much the author. Secondly, as I was reading the book, I learned that the murder has been solved. Try as I might, I couldn't help myself and did google it and found out who it was. It completely changed the way I read the book from that point on, but was still very interesting."}, {"userName": "Wordsmith", "userReviewDate": "Feb 20, 2012", "userURL": "http://www.goodreads.com/user/show/7584724-wordsmith", "userReview": "Well Written, Well Researched, really a flawless piece of Journalism that reads more like literature in the capable hands of Maria Flook. She delves into to the private life of Christa Worthington, whose murder shocked this small town in Cape Cod and privacy was no longer an option. Maria Flook handles Christa's life and death as well as the main suspects too I might add, with dignity and class throughout. She is an elegant writer."}, {"userName": "Amy", "userReviewDate": "Sep 03, 2008", "userURL": "http://www.goodreads.com/user/show/859903-amy", "userReview": "I like Flook's style a lot. She gets really deep into the main character's life and is able to paint a rich portrait. But for a book of the true crime genre, I found it a bit out of place. The crime was far from solved by the time this book was published. Flook doesn't get anywhere near the truth in this book and the details she does focus on end up being far from consequential in the end. I had to Google for the real ending."}, {"userName": "Jen", "userReviewDate": "Aug 05, 2007", "userURL": "http://www.goodreads.com/user/show/67414-jen", "userReview": "This is set on Cape Cod, so drew my attention because of my familiarity with the area (though no familiarity with the case). Standard true crime stuff, although the author's views about what happened have not come true, according to the recent arrest and conviction of someone barely mentioned in the book."}, {"userName": "Leah", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/8389281-leah", "userReview": "This was an interesting book. The book held my interest with stories about the victim and the players in her life. I'm familiar with Truro, but not enough to know anyone personally which gave me an objective edge. I found the book for the most part well written. And agree with one review that being an unsolved murder at the time left no real conclusion."}, {"userName": "Jeanmarie", "userReviewDate": "Dec 28, 2009", "userURL": "http://www.goodreads.com/user/show/376297-jeanmarie", "userReview": "Not really a true crime book, more a biography of Christa Worthington. Which would be interesting were the writing not so. . . overwrought. I allow myself to buy true crime books these days because I mail them to Lee when I'm done with them. This makes me feel thrifty and kind. But maybe I should start mailing some of them to Larissa. Yes?"}, {"userName": "Emily", "userReviewDate": "Apr 30, 2008", "userURL": "http://www.goodreads.com/user/show/986213-emily", "userReview": "Basic true-crime book, a pretty good one I thought. The crime happened in Truro, a teeny town on the Cape and a friend has a summer house there, so that was kinda cool. Although the entire chapters devoted to her blabbing on about how the assistant DA hit on her (the author) was really annoying."}, {"userName": "John Lyman", "userReviewDate": "Oct 12, 2010", "userURL": "http://www.goodreads.com/user/show/1836233-john-lyman", "userReview": "Extremely in depth description of the life and the events surrounding Christa Worthington's murder. At times the descriptions of Christa's life were too in depth for my tastes and it's hard to believe that the author knew so much about her. I guess she had access to her diaries, if not, it seems like a lot of fiction. I hope the killer is caught soon, if he hasn't been already."}, {"userName": "Lindsay", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/1628354-lindsay", "userReview": "Since I vacationed on the cape since I was a child, I really enjoyed this book. Slightly freaky to read as women but very interesting none the less. If you like to watch law and order type shows, this book is perfect for you."}, {"userName": "Jill", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/21835218-jill", "userReview": "Interesting read about a real life murder on Cape Cod. But at times is was disjointed and not sympathetic to the victim. Not my favorite real life crime book, it was meandering in the telling of the events."}], "description": "A literary investigation by \"one of the most powerful American writers at work today\" [Annie Proulx] of a story that riveted the nation: how an accomplished, world-traveled fashion writer who had retreated to a simpler life as a single mother on Cape Cod became the victim of a brutal, still-unsolved murder.On the surface, Christa Worthington’s life had the appearance of privilege and comfort. She was the granddaughter of prominent New Yorkers. Her sparkling journalism earned the fashion world’s respect. But she had turned her back on a glamorous career and begun living in the remote Cape Cod town where she had summered as a child. When she was found murdered in Truro, Massachusetts, just after New Year’s Day in 2002, her toddler daughter clinging to her side, her violent death brought to the surface the many unspoken mysteries of her life. Invisible Eden is the deeply felt story of a career woman's attempt to start over and reinvent her life away from the fashion circles of New York and Paris only to have an out-of-wedlock child with a local fisherman, forge a life as a single mother, and meet a violent end. Brilliantly portraying Christa’s hunger for belonging and her struggle for survival as a first-time mother, Flook searingly evokes her search for a safe haven, her many tumultuous relationships, and the evidence linking family, strangers, lovers, suspects, and innocents to the tragedy that both shocked a seaside town on Cape Cod and horrified the nation. Flook intricately maps Christa's charged life before her death and follows the first year of the murder investigation with the help of the district attorney who is in an election battle even as he searches for the killer. At the same time, Invisible Eden captures the Cape's haunted landscape, class stratifications, and never-ending battles between its weathy summer residents and its hardscrabble working families who together form a backdrop for a powerful chronicle of love and murder. An edgy and compelling portrait of a woman's tragic journey, Invisible Eden is a mesmerizing true story.From the Hardcover edition.", "title": "Invisible Eden", "url": "https://www.goodreads.com/book/show/1113116.Invisible_Eden", "average": 3.02, "cover": "https://images.gr-assets.com/books/1181100928l/1113116.jpg", "reviews": 50, "authors": [{"url": "https://www.goodreads.com/author/show/214361.Maria_Flook", "name": "Maria Flook"}], "type": ["Crime", "Nonfiction", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/1113116.Invisible_Eden", "http://www.goodreads.com/book/show/376045.Invisible_Eden", "http://www.goodreads.com/book/show/6414838-invisible-eden", "http://www.goodreads.com/book/show/8557389-invisible-eden", "http://www.goodreads.com/book/show/7606299-invisible-eden", "http://www.goodreads.com/book/show/840881.My_Sister_Life", "http://www.goodreads.com/book/show/552818.Lux", "http://www.goodreads.com/book/show/1190875.Open_Water", "http://www.goodreads.com/book/show/1194337.Family_Night", "http://www.goodreads.com/book/show/2144028.Reckless_Wedding", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}