{"ratings": 3792, "userreviews": [{"userName": "Regan", "userReviewDate": "May 08, 2008", "userURL": "http://www.goodreads.com/user/show/349718-regan", "userReview": "Reading through some of the reviews written by others, I've found that David Stoll's indictment of Menchu for not adhering to the \"pure facts\" is still alive and well in the academy. There seems to be a tendency to ignore some very important factors that lead to the creation of this book, particularly the genre, testimony, and the nature of memory itself.Testimony, or testimonio, is a literary genre that in many cases (although certainly not all) involves a testimoniante (one who testifies) and a letrado/a (academic). In the case of this testimony, Elizabeth Burgos-Debray recorded a series of interviews with Rigoberta while R.M. was in France seeking international solidarity and material help for her people who were being brutalized by Guatemala's government. Debray takes the liberty of ordering and editing Menchu's testimony in order to make it flow more easily, but there is certainly more to this work than Debray acknowledges. Another important characteristic of what is called \"exemplary testimony\" is that the speaker (for indeed Menchu's spoken words are what are recorded, transcribed, and manipulated here) seeks a certain representativity for his/her group in order to call for solidarity and for aid. Stoll seems to require of a testimony that it be a historical document with correct dates, names, etc. His anthropological view (and I highlight the word \"his,\" for many more anthropologists staunchly disagree with his point of view) seems to deny testimony some of its basic characteristics: political, and personal, urgency; desire for solidarity-building; urge to express one's own, very shocking, lived reality.This last characteristic can be easily linked with the nature of memory. At the time in which Menchu was in Paris giving these interviews to Debray, she had just recently fled from Guatemala where she was under constant death threats and where she had witnessed countless death threats and institutional killings actually carried out. It is easy to understand, then, why details and dates and names might be less than crystal-clear in her account. But again, why must there be an expectation (unreasonable, in my estimation) of empirical facts in a document whose very process implies a temporal urgency (her fellow Quiches were still being brutally repressed and murdered) and a desire for self-fashioning, for narrating one's own experience. What could be more subjective that the lived experience of an individual?I think the value of this testimony lies squarely on its speaker, an indigenous Guatemalan women, whose voice would never have been heard nor her people's story ever told had it not been for her relationship with Elizabeth Burgos-Debray. Guatemala's government held strict controls over their press, therefore the only way to build international solidarity and to gain aid for her country, Menchu had to go into self-imposed exile and tell her story.This is a literary work, not a juridical document, and it should be treated as such. To see a thorough deconstruction of Stoll's indictment of Rigoberta Menchu, see Arturo Arias's  Arturo Arias Taking their Word  Taking their Word (2007)."}, {"userName": "Alex", "userReviewDate": "Aug 23, 2017", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "If you go into this book without knowing what it is, there's sortof a plot twist halfway through that's one of the better ones I've read. It's a true story! I just didn't predict this woman's reaction to her life.For the first half of the book, it's an oral history of a young peasant in Guatemala. She seems nice. Her life is desperate; she's poor and exploited by a racist government. She tells heartbreaking stories. Her baby brother was strapped to his mother's back as she worked on a finca (plantation). A cropdusting airplane flew over them all, as they do, scattering pesticide. The baby began to have trouble breathing. He shortly died. They were unable to bring him back to their mountain homeland, and when his body started to smell, they were forced to pay their entire family's entire season's wages for the right to bury him on the finca that murdered him.That's sad, right? Makes you want to fight someone! And here comes the twist - and I don't think it's really intended as a twist, it's more or less described on the cover, but if you want the weird surprise I got then you should stop reading now. I'll give you a hint: Rigoberta Menchú ain't nothin' to fuck with.What happens is that this sad teenager telling the story, around halfway through the book she's like, \"So we decided to fight.\" All of a sudden she's describing how they built pit traps for soldiers. She practices throwing lime so that it'll go into their eyes and blind them. They organize. She - Rigoberta Menchú specifically - travels to other mountain communities, to teach them how to train their dogs to attack soldiers. They join a revolution.And it turns out that Rigoberta Menchú is a hero of the Guatemalan Civil War, loosely between 1960 and 1996. The crucial events in this book, which turns out to be about her awakening as a revolutionary, take place in 1979. It reminds me a little of Nelson Mandela's Long Walk To Freedom, in that the author wants peace but is willing to use war to get there. Both books give pretty specific instructions on how to revolution. And both authors are winners of the Nobel Peace Prize. (Which, honestly, the Nobel dudes are basically just trolling dictators, aren't they? They're constantly giving awards to people who are not super devoted to peace. Lookin' at you too, Obama.) I want to give what I guess is a trigger warning: you may choose to skip chapter 24, entitled \"The torture and death of her little brother, burnt alive in front of members of his family and the community.\" (Different little brother.) The title is an accurate description of what happens. She describes everything that was done to him, and it's very bad. The idea was to intimidate the people. It doesn't work. Chapter 27 is about her mother, and it's also upsetting. This is the toughest stuff I've read since Survival in the Killing Fields from Cambodia. I, Rigoberta Menchú was assigned reading for my incoming freshman college class, along with the mighty Nella Larsen. Liberal indoctrination: successful! And good choices, these are both legit great books. I've revisited them over the past few years and I remain impressed by the judgment of whoever made that decision. Rigoberta Menchú ain't nothin' to fuck with and neither is this book."}, {"userName": "Anna", "userReviewDate": "Oct 02, 2007", "userURL": "http://www.goodreads.com/user/show/388184-anna", "userReview": "This book is a memoir of Rigoberta Menchu's childhood and later years in Guatemala as an Indian woman. According to her story, she grew up uneducated in a small community with very strong rules and traditions. Her people, the Indians, were in conflict with the Ladinos (specifically the wealthy) for many years. As a result, her father, mother, and several siblings died. After reading this book, I found out that she had fabricated many important details in the story. On the very FIRST page, she tells us that she never went to school. On the contrary, Rigoberta seems to have attended a private school run by nuns, and got the equivalence of a middle school education. While a middle school education isn't stellar, it's better than nothing. Rigoberta learned to speak spanish at school, and not later on in her life as she claims. She lies about witnessing her older brother die (which she did not), having a younger brother starve to death on the coffee plantations (he's still alive and living in Guatemala), and the conflict between her father and the wealthy Ladinos over his land (in reality he was having a conflict with his in laws!). I understand that someone writing a memoir could forget some minor details, but this seems very intentional. In my opinion, she is biased against the Ladinos and the Guatemalan government, and isn't writing a bestseller just the best way to get back at them? However, the fact that Rigoberta lied about her experiences is not the only reason that I gave this book one star. The book is written in a very dull way. It's amazing how Rigoberta makes even the most heartbreaking parts boring. Her parents die, her brothers die, she joins a rebel group, her life is threatened. All of these would make for a fascinating memoir that can't be put down. But Rigoberta interestinly shuns author's craft. The entire book is as if she is talking to you. No dialogue, suspense, etc. It's very unique, but still boring. On a final note, Rigoberta won the Nobel Prize for this book. I'm not sure exactly how writing a sad book warrants a Nobel Prize. Perhaps it was awarded for bringing attention to the conflict in Guatemala? If so, then yes, that worked for me. I had never heard of any genocide in Guatemala prior to reading this book. But I, Rigoberta Menchu is so lie ridden that I am unsure what is the truth. The book introduces what happened in Guatemala to me. But to find the real truth, I'll just have to research it."}, {"userName": "Francesca Helm", "userReviewDate": "Jul 11, 2010", "userURL": "http://www.goodreads.com/user/show/3801494-francesca-helm", "userReview": "Had been looking for a book related to Guatemala as am travelling there and this seemed like an obvious one but got totally put off after reading various reviews. After talking to people here in Guatemala, who say despite any inaccuracies (lies critics say) and despite her subsequent political career which is also somewhat controversial here - her book really brought world attention to the Mayan cause and is an incredibly important book to read, I bought it. Though clearly not 'great literature' it's incredibly sad but interesting, a fascinating insight into life of Mayan people and the Repression which continued 'Civil War'. She brings up a great deal of issues which are still relevant today - discrimination, poverty, land rights, language, literacy, human rights abuses - just look at what's happening now with the mining companies who are throwing people off land where their families have lived for centuries, burning their homes because they are \"illegally occupying land which belongs to the mining companies\" - watch this video  about Canadian mining companies in Guatemala!I found it interesting what she said about the importance of learning Spanish to communicate with the other Mayan communities (there are 22 languages in Guatemala) and to be able to understand what was being done to them - again an important issue today as these govrnments and companies get away with murder by not translating, getting people to sign documents they cannot read and understand!!"}, {"userName": "Suzanne moodhe", "userReviewDate": "Jan 04, 2009", "userURL": "http://www.goodreads.com/user/show/394762-suzanne-moodhe", "userReview": "I know all about the controversy - did she write the book? Didn't she? The point is that whether or not all of these things happened in particular to this one woman, Rigoberta Menchu, but whether or not they happened to not only her but women that she knew. I believe that this is a collection of events that happened all around her - and having lived in Guatemala for a short period and seen the reconstruction efforts of the Mayan people after the war that was waged on them during the 80's with Jose Effrain Rios Monte, I believe them all to be true."}, {"userName": "Max", "userReviewDate": "Apr 15, 2009", "userURL": "http://www.goodreads.com/user/show/455540-max", "userReview": "This book with an incredibly uncreative title is a falsified memoir by Rigoberta Menchu. The book describes a poor family who was forced to work and work until they got fired and then the Guatemalan army came in and destroyed their lives. First, Rigo's brother got killed and tortured in a completely unsituational way, and then her father got killed. After that, her mother was caught and raped. Then, she had to run away to America. This book at first made me feel pity for the narrator but eventually, I realized that this was too gruesome to be true. If horror movies are fiction, how can this crap of a book be, where Rigoberta remembered every detail of the tortures her family members suffered without actually witnessing them. This book was also contradicted by a journalist and Rigoberta admitted some parts were lies and agreed to change it. The moment she even admitted this made me sick as not only did she dishonor her family members so harshly, but the $19.95 I spent on this book could've bought me some pretty damn delicious sandwiches.There was absolutely NOTHING to learn from this book after you know it was a bunch of lies. This book was just a completely exaggerated bias belonging to a fat woman who wrote bullsh*t to rip off my money. This book had its exploitation at imagery for a moment, but the fact that she (the author) won the Nobel Peace Prize for writing this garbage sickens me. It disgraces everyone who has rightfully earned it so far."}, {"userName": "Susan", "userReviewDate": "Aug 26, 2007", "userURL": "http://www.goodreads.com/user/show/272876-susan", "userReview": "Read this book a long time ago, when I was in Berkeley in the 1980s, it was kinda de rigeur. Just picked it up again from the bathroom reading pile in the house in Vancouver where I'm renting a room for the year (my new roomie is really active in native radical politics). I hadn't given much thought to the book since I heard the news that Menchu fictionalized certain parts of it, wanted to see if I still found it powerful. I did. Not so much for the politics, which even when I read it the first time seemed propagandistic in places, but for the evocativeness of indio life in the mountains. It made me think a lot about Bourdieu's \"habitus,\" the way Menchu described the various customs and rituals, particularly around marriage. It's an interesting truth-making practice she was involved in, creating a collective voice and porsopographical portrait."}, {"userName": "Florence", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/7133770-florence", "userReview": "This book recounts the life of a remarkable young peasant woman who endeavoured through exteme hardships, to make a political commitment to bring change to the lives of the Guatemalan people. Her father, an activist, her hard working mother and a young brother were all tortured & murdered by the military. The descriptions of injustices suffered leave the reader forever scarred.Rigoberta learned Spanish so she would be able to tell her story. (one apparently common to most of the 23 Indian communities of Guatemala.)"}, {"userName": "Ashley", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/506610-ashley", "userReview": "This book is about an Indian women living in Guatemala. This book was ridiculously sad and later I learned that some of the events that took place didn't happen and that she over exaggerated which made me feel so betrayed because she's a liar and I don't like that. This book is an autobiography about her life and the hardships she had to overcome."}, {"userName": "Jim", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "Rigoberta Menchú's I, Rigoberta Menchu - An Indian Woman In Guatemala is a combination autobiography and description of the Maya guerrilla movement that mobilized to combat the military government during the period of 1970-1996.The book begins with detailed descriptions of a Quiché Maya upbringing, discussing the lives of men and women living in small rural altiplano villages. Gradually, as Ladino landowners employ the army to steal the land farmed by the Maya, and force them to pick coffee and cotton along the Pacific coast of Guatemala, Rigoberta and her family become politicized.She originally works with CUC (Comité de Unidad Campesina) and eventually aligns herself with more militant factions, especially one named after her father, Vicente, who was murdered by the army. Her mother and one of her brothers were kidnapped by the Army and tortured to death.This book was originally dictated to a Venezuelan writer named Elisabeth Burgos-Debray. It does a good job of describing the lives of the Highland Maya and the reason why the resistance to the army and landowners cmae about and grew."}, {"userName": "Fiona", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/6084788-fiona", "userReview": "I once heard Ms Menchu speak at a conference. She was always smiling. How could she smile when she has lived a horrendous life?! So, I wanted to read her story.This was written in 1982 (give or take a year) during the Guatemala's Civil War. This is her story about living and working in the antiplano (highlands) of Guatemala. It was a tough life. She had no formal schooling and she worked at such a young age. She had no childhood. She worked in the finca's (large estates growing cotton and coffee) and later as a maid. She saw the inhumanity and discrimination by the ladinos (of Spanish blood) against the Indians. Dogs were treated better than the Indians. She and her family became activists and revolutionaries. She saw her younger brother tortured and murdered by the army; everyone in the village had to witness it or they would be next. Her father was killed in the fire at the Spanish Embassy. Her mother was kidnapped, raped, tortured, and left to rot. No wonder she has a hatred for the ladinos, and especially the army.There were sections of her story that I found disturbing, particularly the torture descriptions. How can the human body survive that torture!?Her upbringing taught her that she will have a tough life and that's the way it will be. At her 10 year celebration when she becomes a women, her parents told her that she \"would have many ambitions but I wouldn't have the opportunity to realize them. They said my wouldn't change, it would go on the same -- work, poverty and suffering.\" How sad. Where's the hope?She was taught that schools are bad because they take away and destroy the Mayan culture. The students at schools could not wear their heritage costumes, but uniforms. Also, the students are taught that the Spanish conquest was victorious, but \"we knew in practice it was just the opposite.\" This is because the Mayan culture, ceremonies, dress, and languages still exist today.\"...we don't like killing. There is no violence in the Indian community.\" She blames the ladinos, especially the Spanish conquistadors for all the killing and violence. True, there is discrimination and senseless killing by the ladinos towards the Indians. However, she neglects to mention that her ancestors before the conquistadors had wars amongst themselves.Very moving story. No wonder she won the Nobel Peace Prize.UPDATE: I did a little internet research on the Guatemala civil wars. Apparently, there is some critique on Ms Menchu's story. Some of her stories are not true. Dr Stoll provided an expose when he took a trip to Guatemala. http://alumni.stanford.edu/get/page/m..."}, {"userName": "David", "userReviewDate": "Sep 06, 2007", "userURL": "http://www.goodreads.com/user/show/346827-david", "userReview": "one of those books that are sad and leaves nightmares. The book written by Rigoberta Menchu tells the world of the cruelty that went in Guatemala as the \"Silent Holocaust\", a genocide upon the Indians in Guatemala. The conflict all start off when the new president took land from the rich to give to the poor as a civil rights movement, but a US Fruit company disliked the idea and took the US gov. that communist activity was going on in Guatemala, therefore triggered the genocide...The peasants (indians) are mostly illiterate because of poverty. Therefore, most people cannot communicate to people from other villages. This linguistic barrier suppresses each of the peasant communities from joining together. This barrier restrains rebellions. The government takes advantage of the peasant’s lack of abilities to read and scammed the peasants of their land. There is a big gap between the poor group and the rich group. Upon from the suppression, comes a ladino group who are a mixture. They think they are better than Indians and look down upon Indians. In addition there are groups of Indians that forgotten and abandoned their traditions. People have different ideas and thoughts. This makes people think differently and act differently and this is what separates everyone into different groups and divisions. This is also how conflict occurs.In a society, everyone is responsible for their actions. All actions come with consequences and aftermaths. The decision of one will affect many others.It is selfish to just think about oneself when everyone else is sacrificing their lives for the community. Each individual have their own roles in the struggle and cannot just do whatever they want. Rigoberta is in charge of her role and she must follow her role until the end. The sacrifices of individuals in society will only strengthen the ones that are left to fight, to never give up and fight for what they believe in. In a society, there are people who betray others for their own egotistical purposes. Those people then are irresponsible, self-centered, and hated. There are always disagreements in society and that makes people argue and fight.Rigobeta mentions fighting back, for her people and her culture. The people from the elections, the goverment would give the community false hopes in order to get the people to vote for him. The governments need the power of the people yet they also suppress the people so the people won’t hold too much power, but she wants EVERYONE TO FIGHT BACK..."}, {"userName": "Rita", "userReviewDate": "Jan 09, 2010", "userURL": "http://www.goodreads.com/user/show/76512-rita", "userReview": "In 1983 Elisabeth Burgos met the 23-year-old Rigoberta Menchu and spent a week interviewing her and made that into this book, which is partly autobiography and partly 'testimonial' speaking for the experience of the whole Indian community of Guatemala [[60% of the popul. is pure Mayan, tho divided into 3 language groups and many smaller subgroups:]. [Book transl. into English by Ann Wright.:]Horrifying how the mountain peasants are exploited by plantation owners on the coasts, living in subhuman conditions and being paid almost nothing. Makes you sick. Menchu [who of course won the Nobel peace prize in 1992:] does a good job of showing in detail how the exploitation can take place - with collusion from the gov't, the police, and the army - and partly because most Indians receive no formal schooling and therefore don't speak Spanish and are not literate.It also makes you sick how attempts to organize unions and protest for better working conditions and so on are so brutally repressed. Systematic torture and murder of whole villages. There are plenty of places around the world with similar situations.This book shows graphically exactly how this oppression works in everyday life.Unfortunately, I pretty much have to conclude that human nature seems to make oppressors the victors, in Guatemala as elsewhere.original title: Me llamo Rigoberta Menchu en asi me nacio la conciencia."}, {"userName": "Ling Juan", "userReviewDate": "Jul 11, 2008", "userURL": "http://www.goodreads.com/user/show/522758-ling-juan", "userReview": "This book is about Rigoberta, her family and her community. They were going through a harsh, grief and tragic time. They are Indians that lives high up in a mountain with no fertile lands. Oneday the landowners decided to get back their lands because the Indians started to have crops. Rigoberta and her community thought of traps that will prevent the people from coming into their lands. During this period, a lot of people stuffer from torture and death, including Rigoberta's mom, dad and brothers because they were part of the community.As this continues, the government found out that Rigoberta was a leader of this, so she was chase after by the soldiers..."}, {"userName": "Jane Mettee", "userReviewDate": "Dec 13, 2013", "userURL": "http://www.goodreads.com/user/show/8799192-jane-mettee", "userReview": "This is the auto biography of an Indian woman who won the Nobel Peace prize in 1992. It tells about her life of severe poverty and harassment, killing and torture, of the Indian people by factions of the Guatemalan government that was engaged in civil war. She devoted her life to resistance and support for her people. She dictated the book to get it into print and get the message out to the world. Tragic but interesting and important message."}, {"userName": "Tari", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/23248982-tari", "userReview": "If I could give a book a -, I would. It was most frustrating to read this book for a class knowing that the horror written about was found to be a lie. Yuk! Plus, she won such an honor for a book that was untrue about her life. Pathetic!"}, {"userName": "Miriam", "userReviewDate": "Sep 09, 2009", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "I read this in Spanish for Spanish class. I may have been unduly hostile towards it because I knew ahead of time that it was not actually Menchu's autobiography."}, {"userName": "Il cassetto dei libri", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/69843490-il-cassetto-dei-libri", "userReview": "Rigoberta è la Voce dei vinti, non solo dei Maya del Guatemala, ma in generale di tutti i nativi spazzati via da popoli che si definiscono civili, ora come in passato. E la parola è la sua, la loro, arma di riscatto come diritto all'esistenza e alla dignità dopo secoli di sottomissione, di schiavitù camuffata da libertà acquisita, di isolamento e silenzi talvolta forzati, talaltra volontariamente remissivi per proteggere a denti stretti la propria identità culturale. Secoli nei quali le verità storiche sono sempre state considerate unilateralmente. Popoli che fanno della tradizione orale la loro unica fonte di storia, Rigoberta \"appartiene a una cultura in cui l'arte del raccontare, così come l'esercizio della memoria, sono alla base di una millenaria tradizione[..] che ha consentito ad alcune popolazioni indigene [..] di sopravvivere al silenzio e dare origine a una storia fondata sulla memoria ancestrale.\" Libro controverso, in seguito vennero confutati da parte di un antropologo molti degli avvenimenti della vita di Rigoberta e non ritenuti veritieri, ma l'opinione pubblica si spaccò a riguardo, essendo stato egli \"della controparte\",  amico di uno dei dittatori che si susseguirono nel paese nonché negazionista dei genocidi. Io mi sono permessa di leggerlo oltre le righe, non come la voce di una sola donna, ma come la coralità di tante minoranze, tralasciando poi che gli avvenimenti narrati siano accaduti a lei o ad altri. Sicuramente gli innegabili soprusi delle sanguinose dittature militari, subiti da migliaia di guatemaltechi, vanno al di là di tutto."}, {"userName": "Letitia", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/86892-letitia", "userReview": "This is both a beautiful and chilling personal narrative. Rigoberta begins with explanations of her Quiché culture and her family dynamic, transitioning into documentation of the atrocities committed by the Guatemalan government against indigenous peoples, and finally into the narrative of her own rise to activism and community mobilization. It is simply told, in the vocabulary of about 5th or 6th grade, since Rigoberta is speaking in her second or third language, which was of course translated to English for the edition I read. It is part ethnography, part oral history, part witness and part philosophy. I highly recommend it as a lesser-told story of Guatemala's recent past, and an example of the strength and resilience of one woman to fight for her people."}, {"userName": "Terri Lynn", "userReviewDate": "Apr 23, 2014", "userURL": "http://www.goodreads.com/user/show/5699299-terri-lynn", "userReview": "While I found the story interesting, this is supposed to be Rigoberta Menchu's autobiography and my standard for autobiography is that it should be TRUE and HONEST yet this is nothing but a pack of lies and that taints the story. I had to read this for a graduate school seminar and fortunately the university allowed us to write papers about the controversy rather than accept the book as factual. A few years after the book came out, David Stoll (he has his doctorate from Stanford University) was planning to write a book about Rigoberta's book since he had a deep interest in Guatemalan history. He was shocked to find that Rigoberta had lied through the whole book. Some examples:(1) She says in many places that her father would not let her go to school and that she had never been to school when in fact she had been sent to two different Catholic schools from the time she was 5 years old to around 15 on scholarship. (2) She claimed, at age 23 when this was written, to have resisted learning Spanish until 20. The truth is, she had been taught to read, write, and speak Spanish fluently from the time she was 5. (3) She claimed a brother who turned out to not even exist died of starvation.(4) Chapter after chapter covered day to day experiences she claimed to have had at home and working hard and seeing terrible things on the fincas where families went for farming jobs. In fact, she was away at boarding school and never worked in the fincas or saw what went on at home.(5) She claimed to have watched a female friend die while they worked in the fields after poison was sprayed. She was away at boarding school when she claimed this happened and it never did happen.(6) She claimed she and her parents were forced to watch her brother be burned to death. This never happened.(7) She claimed another brother died of starvation when she was a kid but researcher Dr. David Stoll and also the New York Times found that brother alive and well decades after she said he died.(8) She detailed how the ladinos and soldiers battled them for their land. Lies. Hundreds of family members, friends, and neighbors said it was no such thing, that her father was embroiled in a decades-long feud with his in-laws over the land. These are only a few of the lies. Instead of owning up to it, Menchu alternately refused to answer even family, friends, and neighbors who asked why she lied, said these were her memories and she was entitled to them (she was 23 when this was written and she knew they were lies and not memories she told them), said it was the experience of people in Guatemala (while masquerading as lies she said were factual thing that happened to her personally), and even said were not her words (despite the verification of 18 hours of audio tapes in her voice of her telling the lies) and finally, that it was racist to call her on the lies."}, {"userName": "Derek", "userReviewDate": "Dec 09, 2010", "userURL": "http://www.goodreads.com/user/show/239943-derek", "userReview": "I fully recognize that Menchu's voice--conversational, unpretentious, emphatic--is what draws most readers to I, Rigoberta Menchu. At the same time, I found it the most grating aspect of the book, full as it was of contradictions, superlatives, and simply repetitive insistences on the positive aspects of her culture and the crimes committed by her country during the Guatemalan Civil War. Which isn't to say, of course, that I don't think she has every right to tell this story; the crimes she rightfully describes are horrifying, and conveying the intricacies of her culture had a practical purpose, given that she was seeing so many of her people die. But there's something missing on just about every page here for me, something that I think is a result of that voice. There were places that warranted more reflection, places where a deeper understanding of the limitations and contradictions of that Quiche culture might have been explored (yes, alongside the positives), but these things rarely happened. And the book suffers for it.The first half of the book is a lengthy discussion on her Quiche Indian culture, and the difficulties faced in being an Indian in Guatemala. There's of course some narrative, but this is mostly an anthropoligically valuable description of her village in the mountains. The second half shows Menchu being far more specific, describing her particular story and how she came to see her family killed, and the influence that these events had on her decision to join the CUC and the movement started in her father's name. All good information of course, but structuring the book this way lessens considerably the impact of either section because each piece informs the other in ways that would have been far more illuminating if mixed. It's difficult to say how much of this is the fault of the interviewer, Elisabeth Burgos-Debray, but the end result is the same: a book that drags far more than it ought to, given the import of Menchu's message.I won't spend any time here reviewing the narrative's inaccuracies uncovered in the 1990s by David Stoll. This isn't because I don't think they are relevant (by god, they are), but rather because they've been much more thoroughly explored elsewhere; there's little I can add to that conversation. Needless to say, these inaccuracies also greatly detract from the book's merit, even more so than my comparatively minor complaints against superlatives and narrative structuring. Is the book worth picking up? I suppose. But there are serious drawbacks to consider, and much of what Menchu claims seems to need a healthy dose of salt to be swallowed."}, {"userName": "Liz", "userReviewDate": "Jan 05, 2011", "userURL": "http://www.goodreads.com/user/show/4747877-liz", "userReview": "I took an anthropology seminar called Narrative Lives in which the first half of the semester was spent reading 3 life-histories followed by another book that evaluated, or bluntly stated, debunked much of the narrator and interviewer's credibility. I, Rigoberta Menchu was the third life-history we read, and I was completely touched by her eloquent story-telling, and her dreadfully touching and powerful struggle. I remember sitting outside, near done with the book, and dreading reading David Stoll's Rigoberta Menchu and the Story of All Poor Guatemalans. Rigoberta's story was touching and beautiful as it was, and I felt any incongruity that appeared was not important enough to take away from my experience reading her life-history, and I didn't see how anyone could question the stories Rigoberta told. But I read Stoll's book, and I was shocked to discover some of the most striking memories of Rigoberta's never actually happened; her brother was not burned alive, she never worked on the large farms, and all the stories from the farm never happened to her, and she did receive an education, among other incongruities. After my first shock, and feeling of betrayal, I accepted that it didn't matter if what was written in her life-history happened as it was written word-for-word, what was important was the Guatemalan struggle. Some of the stories didn't happen to her, but they happened to other Guatemalans. I believe this is a very interesting life-history to read, but should definitely be read along with David Stoll's Rigoberta Menchu and the Story of All Poor Guatemalans."}, {"userName": "K M", "userReviewDate": "Mar 16, 2013", "userURL": "http://www.goodreads.com/user/show/145667-k-m", "userReview": "It took me longer to get through this than I had anticipated- probably because of the controversy this book stirred regarding the authenticity of some of the contents. I kept putting it down for a few days, trying to decide if I wanted to continue (which I did.) It was a very interesting account of Rigoberta's life in rural Guatemala. She detailed the rich cultural life of her people, including descriptions of many rituals, ceremonies, and practices of the her indigenous group. It was quite interesting to read of the blending of the native religions with the Catholicism that was brought in from the \"outside\" world. Toward the end, Rigoberta reaches some very telling conclusions about the effects that Catholicism had on her people.Life for her people was heartbreaking and harsh to begin with, but the political climate of the country made things intolerable for the native population, leading to the organization and radicalization of many. Whether or not the details are totally authentic, I think the book is still worthy of attention."}, {"userName": "Karen", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/1006779-karen", "userReview": "Rigoberta Menchu grew up in the Highlands of Guatemala and on the coffee and cotton plantations near the coast. When the landowners tried to take the peasant communities land away from them, Rigoberta's family became involved in organizing a way to protect the community. The Landowners were supported by the army and the government.Soon Rigoberta was involved in a much wider anti-government movement, to get better and consistent wages for the peasants. Her father was killed by the army, and her mother was later torture for their roles in trying to bring human rights to the poor. She has had to flee to Mexico to avoid capture by the government, and brought to light the atrocities of the authorizes in Guatemala Rigoberta received the Nobel Peace prize in 1992 for her work."}, {"userName": "Megan Bowers", "userReviewDate": "Feb 14, 2016", "userURL": "http://www.goodreads.com/user/show/17958210-megan-bowers", "userReview": "A powerful narrative of the life of a fierce and brave young woman, whose passion and dedication for her people you can feel reverberating off the pages. Some reviewers complain about or questions its \"accuracy\" but the story is told in the style of an oral history which I think is culturally appropriate, and thus does not aim for scientific accuracy. As stories are told and retold, the details might change slightly, but what is important is the message and the emotions, and in those aspects, this book succeeds remarkably."}, {"userName": "James Briggs", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/30798824-james-briggs", "userReview": "This book is a phenomenal book on equality, and natural human rights. Living in Guatemala for two years, including more than a year with the Poqomchi and Q'eqchi' Indians I was really able to relate to this book and understand how real the fight for equality was and still is to some level. However, at times it was a little hard to get into the story. But overall it was still a worth while read."}, {"userName": "Lisa", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/2099130-lisa", "userReview": "This is the story of one indigenous leader's struggles to work with her people to gain humane treatment from a cruel world. It is part memoir and part anthropological study. I found it quite interesting."}, {"userName": "Sarah", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/9488362-sarah", "userReview": "Really powerful book. Important insight into the struggles and oppression that still exist in modernity. Slavery has not been extinguished."}, {"userName": "Susan Halvor", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/8359170-susan-halvor", "userReview": "Read this in the 1990s, when I visited Guatemala, and looking forward to re-reading as I anticipate visiting again!"}, {"userName": "Nani", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/25169543-nani", "userReview": "A must read"}], "description": "This book recounts the remarkable life of Rigoberta Menchú , a young Guatemalan peasant woman. Her story reflects the experiences common to many Indian communities in Latin America today. Rigoberta suffered gross injustice and hardship in her early life: her brother, father and mother were murdered by the Guatemalan military. She learned Spanish and turned to catechist work as an expression of political revolt as well as religious commitment.", "title": "I, Rigoberta Menchú: An Indian Woman in Guatemala", "url": "http://www.goodreads.com/book/show/233292.I_Rigoberta_Mench_", "average": 3.72, "cover": "https://images.gr-assets.com/books/1438357591l/233292.jpg", "reviews": 357, "authors": [{"url": "https://www.goodreads.com/author/show/648569.Rigoberta_Mench_", "name": "Rigoberta Menchú"}, {"url": "https://www.goodreads.com/author/show/481547.Elisabeth_Burgos_Debray", "name": "Elisabeth Burgos-Debray"}, {"url": "https://www.goodreads.com/author/show/49510.Ann_Wright", "name": "Ann Wright"}], "type": ["Nonfiction", "Autobiography", "History", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/233292.I_Rigoberta_Mench_", "http://www.goodreads.com/book/show/6618075-i-rigoberta-menchu", "http://www.goodreads.com/book/show/9727066-mi-chiamo-rigoberta-mench", "http://www.goodreads.com/book/show/8170835-i-rigoberta-menchu", "http://www.goodreads.com/book/show/233296.The_Girl_from_Chimel", "http://www.goodreads.com/book/show/233294.The_Honey_Jar", "http://www.goodreads.com/book/show/233299.Crossing_Borders", "http://www.goodreads.com/book/show/3147903-the-secret-legacy", "http://www.goodreads.com/book/show/29242702-la-grotta-magica-il-fantastico-viaggio-di-ixkem-bambina-maya", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}