{"ratings": 11781, "userreviews": [{"userName": "Zoeytron", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Whew! What a story! Started off at breakneck speed and never let up. Characters with more secrets than you can shake a stick at. Slopped through my chores today in order to get back to reading. I typically jot down at least a few notes while reading, but didn't want to stop long enough to do that here and thus, the abbreviated review. Loved every minute of it."}, {"userName": "*TANYA*", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "How is it that I fall more and more for this author with every book of his I read??!!?? This one was full of action, edge of your seat suspense. I loved it!! This one tugged at my heart something fierce. Lol."}, {"userName": "Linda", "userReviewDate": "Mar 15, 2016", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "No one presents flawed characters like John Hart does. No one.Two brothers, as different as day and night, are living in the Iron Mountain Home for Boys in a woodsy area of North Carolina. One bears the strength of the Sun and the other reflects the low-cast, eerie light of the Moon. There is more \"existing\" here than actual living. A horrible incident occurs and one of them is on the run.Fast forward twenty years: Michael finds himself in New York and under the wing of a crime boss. His determined resilience has won him a life lined with dastardly deeds and a talent for permanently and swiftly evicting target individuals. Michael is a solid representation of his craft, but now he wants out. His love, Elena, is pregnant and Michael only wishes to leave his former life behind. He seeks the blessing of the crime boss. But breaking free comes with a very heavy price.Julian, emotionally challenged, is living in a quagmire of an existence. Michael's desire to re-connect with his brother forces him to make choices that he has never bargained for. And it leaves both brothers standing on the threshold of a very, very bad storm on the horizon.John Hart casts a shadow on the premise of which has more impact on an individual: the force of the blood in our veins or the environment in which we find ourselves. Does long fought control slip through our fingers in a blink of an eye? Forceful and dark, Hart's characters are deep and sometimes unlikeable. There are indeed sideways glances into a world you know exists, but you certainly would not want to reside there. Brutal and unsavory, jagged and deceitful are the characters you will meet here. Hart does a fine job of displaying a panorama of it all."}, {"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "A solid thriller that accomplishes what it sets out to do – keeps you flipping those pages. Stone cold killer Michael and his brother Julian are both emotional wrecks after a horrific childhood in the orphanage from hell. An upbringing that’s made Michael strong and Julian weak, you know the needy over-emotional artsy type. A big shot in the mafia Michael’s looking for a lifestyle change, to settle down with his girlfriend Elena and raise a family. But nobody quits the mob, so between killing off mobsters (and we're talking seriously nasty guys) rescuing his girl and protecting his little brother he’s kept pretty busy. Intrigue, scandal, bodies piling up, it's a lot of fun.I actually preferred the minor characters. Abigail Vane as a neurotic powerhouse of a woman “iron on the inside and harder than any woman alive’ is a hoot. Had me humming a few Elvis Costello bars ‘she’s filing her nails as they’re dragging the lake.' Hands-down my favorite though was her bodyguard Jessop, a peach of a guy who gets the best line. \n“We can all live with doubts. It’s the knowing that breaks us’\n Cons: It’s SO over-wrought… A few graphic torture scenes in lieu of suspense; fast paced but just missing that adrenaline rush you expect from a thriller. Speaking of torture, Elena was so rip-your-hair-out annoying in her Damsel in Distress role that I could really care less. About as emotionally engaging as watching a shrieking Olive Oyl tied to a railroad track - where’s a train when you need one…cold, I know. I'll stop now, it’s not as bad as I’m making it out to be. Just wish I’d picked up The Last Child as an intro to Hart instead – hear it’s terrific.  For the thriller genre 3 ½ stars ________________________________________In case you're feeling nostalgic... 'Watching The Detectives' \"https://www.youtube.com/watch?v=xO_sD...\""}, {"userName": "Lisa", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/32081931-lisa", "userReview": "This is my first venture into John Hart & I must say how awesome this book was, its fast paced never lets up & I loved every character except for Randall Vane as he made my skin crawl. The plot was A1 I just loved every minute I could not put this book down, even if I did due to things going on I got back to it as soon as I could.Michael & his brother Julian were brought up in Iron Mountain a boys home both very different Michael was strong as they come, Julian was weak & sickly, always picked on & beaten within an inch of his life a horrible incident occurs between Hennessey & Julian it is then that one decides to run.Now 20 years later Michael finds himself under the wing of a powerful criminal Otto kaitlin he is a fighter, killer but now he wants out, as he wants a new life with Elena who knows nothing of his past & present she is the mother of his unborn child.Now Otto Kaitlin is dying & Otto is the only one who could set him free so he visits him in the hospital close to death he asks for freedom but instead chokes the life out of him, this sets Stevan into rage , determined to kill Michael & Elena he gets Jimmy a man who would kill his own mother & not blink an eye on his side & together they plot Michaels down fall.Otto Stevans father housed Michael & taught him every thing he knows he even loved Michael more than his own son rage consumes Stevan as jealousy sets in this makes the plot go up up up, its not until Randall vane a weasel of a man a senator who has his own agendas & Abigail comes into it we find out more about Julian & his life I must say it was heartbreaking all that Julian went through & what a mother Abigail would do to protect her son was inspirational.There were so many secrets each character had it made my head spin Abigail was an inspiring character as was Michael who I loved their teamwork together to find the truth was compelling I was cheering both on, this for me was one of the best books I have read in the thriller Genre for a long time. There were twists & turns at every corner just when I thought I knew what was going it it turned out that I was wrong, all I can say is WOW will be reading more of John Hart all the stars + more."}, {"userName": "Daniel Audet", "userReviewDate": "Aug 29, 2011", "userURL": "http://www.goodreads.com/user/show/4411850-daniel-audet", "userReview": "My first book by John Hart, \"Iron House\" makes me feel like I wish I had read his other books too. And I will.Iron House is the most amazing blend of literary eloquence in writing and graphic narration/description I've ever read. The reviews say \"riveting\" and other terms reserved for the bestsellers of our day, and believe me, they're all true. I honestly didn't know what to expect as I picked up this novel but the reviews spoke well of it and I liked the title. I'm glad I did. Third person POV, complex love/hate characters, including our hero who fits no mold I can think of, intrigue, classic thriller plotting and killer pacing make this an awesome read for both writers and seasoned readers alike. Hart's transitions are the stuff of legends. Somehow he makes it possible for the reader to be everywhere, all the time, with the characters and story as it unfolds. For writers it's a virtual clinic in POV shifts and story arcing. Not to mention the clearly advanced style Hart has already attained after this his fourth novel release. Amazing. (I say this not knowing much of his background...)Readers are in for an e-ticket ride and nothing short of a burning page turner. I usually have a book figured out by now, the who-did-it thing-and-what-happens-next, and all that, but not so with this book. VERY CLEVERLY WRITTENLike I said, I'm a little better than halfway through the book and I'll wait till I'm done and complete this review with an overall picture of the story and my final thoughts. If you find yourself looking over this review at a point where you're looking for a good book, well, look no further. Iron House is your next read. *More soon."}, {"userName": "D.B. Woodling", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/41355949-d-b-woodling", "userReview": "Iron House, an orphanage in the mountains of North Carolina, is a dismal and dangerous place, embodying an almost Dickensian undercurrent. This brutal beginning prepares Michael for a profitable but less-than-illustrious career as an enforcer for a New York Mafioso-type crime boss.On the run following a bloody power struggle, Michael spirits his ladylove, Elena, away and returns to the North Carolina Mountains where he hopes to keep her safe and reunite with his long-lost brother, Julian. But Jimmy — a coldblooded assassin — has an alternative plan.Incorporating revenge, dark family secrets, and the indomitable will to survive, Iron House is complex, believable, and entertaining."}, {"userName": "Doug Bradshaw", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/808994-doug-bradshaw", "userReview": "I'm torn between three and four stars but I think I'd better go with three which means I liked it instead of I really liked it. Instead of the normal review, I'm going to list some of the things that held me back:The  bogosities: Michael is a young handsome Clint Eastwood type with long eyelashes, as long as a girl's eyelashes. Bite meThe mother has a diabetic gimpy stinky stump of a leg and is going to die soon. Let the bastard live/die. She beat the hell out of Abigail and made her drown her little brother when he was young. Oh puleeze. She sexually services the rich and sometimes handsome men when she is young and pretty and then ends up with the workers and she is really a selfish horrible woman and Michael is tempted to kill her. Isn't this kind of horrible comic book writing?The main characters are ridiculously rich with tons of cash and liquidity and yet are bribed, give five million to the orphanage because they feel guilty, all the while excellent and tough businessmen and women. The whole picture of their money is bogus. And he is a US Senator which makes it even worse! Don't you hate two faced billionaire cheating Senators?The story of the gangsters and the old man who really only likes Michael (certainly not his son Stevan) and then the idiots who chase him down because he wants to leave and live a normal life seemed fabricated and chliched. Michael had the audacity to mercy kill the suffering old man because he begs him to!! Now Michaels's got to die, the bastard. They're all a bunch of unsympathetic goofball idiots. Julian is a weak wimp and Michael is going to protect him and yet he's the one who kills the dreaded idiot by shoving a knife into his neck and killing him when he's just a kid. He's also able to write books for kids later and sells millions of copies and has plenty of money and yet he's lurking about with the girl in the cave and he likes her simply because she's so strong! Huh? Get on a plane and move to Provo, Utah. The shooting scenes, especially the last one with Jimmy are all a bit simplistic. Jimmy's hand is coming down to hit the trigger to kill Elena while Michael's bullet takes out a chunk of his neck. As Jimmy's hand is almost there and then, like magic, that little bulldog of a tough ass sister perhaps as her psychological alias, flies in with a sickle and cuts of his hand off turning the arm into a stump! He has a thing for stumps. Don't you hate it when all you have left is a stump? And wasn't it irritating that Elena did a pretty good job of hurting Jimmy and escaping only to jump poorly and damn near break her foot off? And then, of course, there he is in Barcelona and you know she's going to call. I was wondering what cellphone plan he had. Before that, I found his time with Julian to be ineffective and remarkably anti-climatic and poorly done. Elena may be a bit of a gold digger after all plus she's obviously a sucker for handsome guys with long eyelashes who end up rescuing her and everything. Redemption: Anywhoo, other than those little things, it was fast paced and kind of fun and it brought up a multitude of philosophical questions about the relativity of the law to people with Michael and Abigail's backgrounds. I don't doubt the horrors of some orphanages and I know there really are kids with terrible drug addicted parents, etc. etc. It was the kind of book that makes me think that life is really horrible and lugubrious for a lot of people. I guess the build up and then the revenge were pretty good. To make that revenge really sweet you have to just hate the bad guys. I guess I hated them, morons that they were."}, {"userName": "Frederick Masterman", "userReviewDate": "Oct 22, 2011", "userURL": "http://www.goodreads.com/user/show/2058052-frederick-masterman", "userReview": "Although I am impressed by John Hart’s talents as an author, I was disappointed in his work in Iron House. He is capable of much better writing, as evidenced in his former excellent novels.This story is somewhat complicated, but the saga of a “bad man-gone-good-because-of-true love” is familiar, and in Hart’s hands the old story gets an entertaining treatment. My reservations lie in the credibility of many aspects of the story. Michael, the hit man and beloved “adopted” son of a feared mobster, falls for innocent Elena and wants out of his life of crime, for which his dying boss/father-figure grants permission. However, the reformed Michael must flee the wrath of the other mobsters, two of which are potent enemies: Stevan, the actual son of the dead chief, insanely jealous of Michael because of his father’s favoritism, and Jimmy, the sociopathic henchman who has trained Michael since his entry to the gang as a lost teenager. Michael’s plan to escape with Elena is complicated by his need to say farewell to his brother Julian, who was a child with Michael in a hideous orphanage, Iron House, buried in the mountains of North Carolina. Throughout the story, with its many violent convolutions, Michael sails on unscathed. The reader sympathizes with Julian, a schizophrenic suspected of multiple murders, who flees into a dense forest with the aid of a feral girlfriend. The reader sympathizes with the mother of the adopted Julian; she is the prisoner of deadly secrets, and is vulnerable before her jealous, power-crazed husband. The reader sympathizes with innocent Elena, pregnant by Michael and kidnapped by the bloodthirsty gang of mobsters. However, it is hard for the reader to sympathize with Michael, whose decision to be good somehow ignores the murderer he is, considering he was so deadly even the insane Jimmy fears him. Michael never shows a grain of regret for the murders of his past, and the reader must accept him as having converted into a noble champion for lost brother (whom he has not seen for twenty years) and kidnapped, terrified lover/fiancée/whatever. Michael goes from place to place in the spooky mountainous setting, not knowing “why, but he must go”—and in each place finds exactly the right person to speak with in unraveling the mysteries of the past. The mysteries eventually come to light: cleverly woven into the fabric of the story with a few clues dropped along the way. ~~ The story is a good read, a page-turner at times. But this fact is unfortunately balanced by the need to constantly accept incredible coincidences, and the fact that the reader never worries about the protagonist. He rides over the tempest with hardly a scratch (even a gunshot seems to heal overnight) and actually ‘gets the girl in the end’. A book that simultaneously entertains and disappoints, which is a kind of accomplishment. I guess."}, {"userName": "Michael", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/1177534-michael", "userReview": "They say you should never judge a book by its cover. Or in the case of John Hart's Iron House, it might be more appropriate to say you should never judge a book by its cover blurb and marketing campaign. Hailed as one of the best books of the summer, it'd be easy to assume that the story would follow the usual tropes of the action/mystery/thriller genre. A hitman for the mob meets a beautiful woman, falls in love and wants to get out of the game. He's granted permission by the dying patriarch of the family, but his son doesn't want to let him go. When our hitman hero finally helps the older patriarch shuffle off this mortal coil, the son decides he has to take out our hero and his new lady love to maintain his hold on power. On the surface it sounds like something familiar, but Hart wisely uses this springboard to make Iron House something far more interesting and far more compelling. Turns out our hero Michael and his brother Julian were orphans, raised in a brutal orphanage called the Iron House. At a young age, Julian showed a violent streak and when that lead to Julian killing a bully, Michael realized Julian couldn't survive the punishment to come and took the blame. Julian was adopted by a wealthy senator and his wife while Michael went to prison before eventually being taken in by the mob boss. The mob decides to target Julian as well as Michael and the girlfriend. Michael sets out to protect his brother but in doing so, he uncovers some secrets about his past. I'll admit I was skeptical when I heard all the praise heaped on this book and while I was eager to begin enjoying it, part of me wasn't sure it could live up to the hype. Those fears quickly vanished as I found myself pulled into this world and into one of the best thrillers I've read not only this year but in many years. Hart's emphasis on characters is on full display here and while you may not necessarily like everything or everyone in this book, Hart makes sure you'll understand the motivations of each character as well as the way they became the person they are today. This is especially true in the character of the Elena, who starts out the novel ready to dismiss Michael from her life due to his past and his connection to violence but who we see slowly coming to accept that who Michael is at his core is a good man she fell in love with. (To say much more ruins some of her character arc, which you really have to experience to truly appreciate).I've read Hart's other novels and while they were good, they only hinted at what was to come. With Iron House he not only lives up to the promise of those early books, but he exceeds it. The last half of the novel builds at such an intensity and pace that you may find it next to impossible to put it aside to do other things. If you're looking for a great thriller that will not only entertain but also works on a emotional level, this is the one."}, {"userName": "Brenda", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/5240149-brenda", "userReview": "John Hart's fourth book maintains the complexity I expected based on reading the previous three. Two brothers, Michael and Julian, as different as night and day, live in the Iron House Home for Boys. After a horrendous event occurs, one runs away and the other is adopted. Fast forward 23 years. There are many threads and factions at play, and Hart eventually unravels and reveals the history and the truth.Character development is one of Hart's strengths. Not all of his characters are likable, but even they are well drawn. They all have secrets, make questionable decisions, get angry, love hard, and have doubts. The one character I felt was weak was Elena, Michael's fiancé.The setting in North Carolina is interesting. It ranges from a U. S. Senator's lush estate in Chatham County to a village without electricity in the mountains. Iron House was heartbreaking.I'm really looking forward to John Hart's next and latest book, Redemption Road."}, {"userName": "Perri", "userReviewDate": "Nov 11, 2016", "userURL": "http://www.goodreads.com/user/show/17951043-perri", "userReview": "I like the way Hart writes and the Iron House plot just keeps humming along. So trying to figure out why I didn't love this. I think it was a disconnect to the characters who I found annoying or unbelievable. Hoping I like other books more, because I have several on my TBR list."}, {"userName": "Valerie", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/2206179-valerie", "userReview": "Time heals all wounds - or does it? For Michael and Julian, time is an enemy, that rips the past into the present, and places the future in uncertain jeopardy...Michael and Julian begin as orphans at Iron House - a decrepit boys home in the North Carolina mountains. Facing down bullies and inept caretakers, Iron House is more of a prison than a home to the young boys. When Michael apparently kills one of the bullies who torments his younger, weaker brother Julian, he runs to protect Julian and disappears into the night.Julian's life is irrevocably changed - by Michael's disappearance and by his adoption into a wealthy, privileged family. However, Julian is tormented by that night, and years pass without Michael, until the past comes back to life.Michael, on the other hand, survives on the street, until he is \"adopted\" by a family - with nefarious connections to the Mob. Michael becomes a killer, but finds unconditional love from his \"father.\" However, Michael wants out - he wants a life away from violence, with a family, and with Elena, his pregnant girlfriend. Michael believes he is out of the family, with the old man's blessing - until he finds out his \"family\" has threatened the one thing he holds dear, other than Elena - his brother. Time is quickly running out, and not only is he in deep trouble with the Mob, his brother has other problems that lead directly back to the past - to Iron House. An intricate story of loss, courage, redemption, and love, juxtaposed against a story of violence, greed, and cruelty, Iron House is a must read - an absolutely stunning story of family, the ties that bind, and the power of the past."}, {"userName": "Jenny Jo Weir", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/34570157-jenny-jo-weir", "userReview": "Another one knocked out of the park by John Hart. I borrowed this one from the library, finished it and already bought myself a copy to own. Yes, it's that good.I think Hart is one of those authors to which writing comes naturally. Nothing in his books feels forced or unnatural. Everything has a flow and good follow through. I also enjoy how the characters evolve and the unveiling of their back stories. Highly recommend this one!"}, {"userName": "Jim", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "[ He's part of a gang & he wants to quit 'the life' & KNOWS they won't let him, but he sticks around & hopes for the best. He works as a dishwasher for love, yet has millions, & doesn't tell his girl anything. Blech! He also tosses around way too much money which makes him very visible, yet he's supposed to be the invisible killer, the left hand of the old man. (hide spoiler)]"}, {"userName": "Vannessa Anderson", "userReviewDate": "Oct 31, 2011", "userURL": "http://www.goodreads.com/user/show/1380029-vannessa-anderson", "userReview": "Iron House is a great work of horror! Iron House is a sheer work of genus! John Hart gave me what I like in horror thrillers. He gave me the walking through dark corridors with sounds that set my nerves on edge. He made me give thought about wanting to see what’s around the corner and he did this all without gore and slice and dice. Rarely will readers find an author who knows how to stimulate readers imaginations to stretch beyond their comfort zones.During the winter in the North Carolina mountains, two hunters come across a ten month old infant, Michael, and his premature brother, Julian, left abandoned on the river bank. The hunters carried the boys inside their coats to protect them against the elements. The next time we meet the brothers is during their stay at Iron House, a state run orphanage for boys located in the North Carolina hills and far away from civilization on Iron Mountain that was once a mental institution that housed shell shocked soldiers.Michael learned early that to survive Iron House he would have gather all his courage not to run from a fight but to win every one. Julian was the opposite of his brother; he ran from every fight, was caught, brutally beaten then thrown out of windows. This was Julian’s life. After each beating, Julian learned to retreat into himself to pretend life wasn’t as bad as the beatings he incurred.Michael told Julian he’d have to learn to fight back if he wanted the beatings to stop. And so Julian did. He found the courage to fight back when he found an old rusty knife and plunged it into the neck of the worse of the five boys who had tormented him throughout the years. His brother, suspecting that his nine-year old brother would be sent to prison, took the blame because he knew in his heart that his brother Julian would never survive prison. While Julian was murdering his tormentor, a senator’s wife, who had come to adopt them, sat waiting for them to be brought to her. Michael runs away, Julian is adopted, and they don’t see one another for a couple of decades, and then, under extreme unpleasant circumstances.The bodies of the other boys who had tormented Julian are turning up in Julian’s family’s lake and Julian is suspected of being the murderer and Michael feels obligated to clean up the mess to, once again, save Julian.The author does an exceptional job of making us go back and forth on whom we suspect of being the killer because we all know that Julian is not the killer, or do we?It’s a challenge to distinguished truths from untruths from all the twists and turns.Iron House is a piece of fiction that should remain on the New York Times best sellers list for years.If made into a movie it should be made by a Clint Eastwood like director, or Clint Eastwood himself, Iron House would be at the top of my list of movies to see.Iron House is a must read!"}, {"userName": "Kelly", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/773729-kelly", "userReview": "What a ride! My heart was in my throat the entire time and I just wanted to race to the end so I could find out what was really going on. I was wildly speculating different scenarios as I read...funny to think back on those after finishing it. Strong characters - I loved some and loathed some. I've said it before and I'll say it again, characters that evoke strong emotions in me usually bode well for me really liking a book.This would have been a 5 star book for me but for a couple brutal scenes that my soft heart could not deal with (which is why I very cursorily skimmed them...basically just to figure out where they ended), and because profanity makes me cringe (it isn't pervasive just strong for me)."}, {"userName": "Richard", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/8386404-richard", "userReview": "9/10This was very, very good. Not quite what I was expecting from the blurb on the back as I thought it would be more like “Gangster” by Lorenzo Carcaterra (one of my favourite books) but it was more character driven and focused in the present and not really centred on organised crime. I don’t like writing reviews for books I have really enjoyed as I don’t feel I do them justice so I will keep it brief: If you enjoy books which are good, read this. If you like this, try: “The Last Child” – John Hart."}, {"userName": "Miles", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/4309357-miles", "userReview": "Two babies left to die in an icy creak. Two boys who must fight to survive. Two men, two very different lives. One unbreakable bond. When a twelve-year-old boy murders his tormentor in their brutal orphanage, his older brother takes the blame and runs to New York - into the heart of organized crime. Two decades later, Michael returns to North Carolina with a sentence on his head, the mob in hot pursuit and his long-lost brother in trouble of a different kind. With vast sums in play, political fortunes at risk and bodies piling up, the brothers must reunite to solve the mystery of their shared past.We are half way through the year and I have a monumental problem – not only is there a distinct lack of sunshine for our supposedly glorious British summer - I honestly have no clue how I’m going to finalise a Top 20 reads list for 2011. The quality on offer this year has been outstanding so far and with the addition of John Hart’s Iron House, the front runners are now getting anxious and even if I declared 2011 over right this minute, I’d still have a problem.So where does one begin reviewing Iron House? I guess, following the advice from Super Nun Maria in The Sound of Music, “Let’s start at the very beginning, a very good place to start” – not that there are any comparisons between the two – actually, come to think of it, both have great big mountains in the storyline so a tentative link has been formed! Et voilà! [Ok ok so I don’t see Michael singing Do-re-mi – he’s just not that type.]The first couple of chapters in Iron House, like so many other titles out there, set the tone for the entire book and until its dénouement there really is no let-up in its pace, intrigue, freneticism and of course death – cold, hard and calculated death. Within a matter of pages I’d lost track of the death count and an abacus was called for and although there are moments when, believe it or not, no-one is murdered the narrative continues regardless with a mesmerising storyline that teases throughout.Full Review on my blog:- http://www.milorambles.com/2011/06/17...Iron House is a complex page turner in every sense. You think you know what’s going to happen but believe me you really have no idea. I distinctly remember reaching the half-way point and thinking that I had everything sorted and couldn’t see any other way out but I couldn’t be further from the truth. The book keeps changing; Hart takes you one way and then flips everything on its head and changes direction – very clever.John Hart is a magnificent storyteller and I couldn’t shake the comparison I felt with another of my favourite authors, Michael Koryta [So Cold the River, Cypress House]. Writing evocatively Hart draws the reader in with a wonderful narrative that is effortless to read and incredibly morish."}, {"userName": "Lee", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/1617945-lee", "userReview": "John Hart's fourth novel doesn't start in first gear.( This is not out yet (07/12),I won an ARC on \"First Reads\" ) This one starts with the peddle to the floor, and the tension stays all the way through. In this tale of two brothers, Michael the tougher, protective older one, and Julian, weaker and tormented by other boys at the orphanage. When the life Michael had, blows up in his face, and has to get out of town fast,with the mob in hot pursuit, with the woman he loves. Not seeing his brother for more than twenty years, and Michael finding out Julian needs his help from his adopted mother. The bond between these two, the family Michael never had, and wants so badly to be part of one, is done very well by the author. With greed, a powerful Senator, lost souls and mob violence...this was one hell of a ride!"}, {"userName": "JoAnne Pulcino", "userReviewDate": "Jul 23, 2011", "userURL": "http://www.goodreads.com/user/show/5096613-joanne-pulcino", "userReview": "IRON HOUSEJohn HartWow! What a fantastic read! Be prepared for a great ride!This impressively masterful thriller is riveting with all the components of steady building tension and a plot rich with a complex family history.Having already been a fan of Mr. Hart’s previous books, I was looking forward to a good read. Needless to say, I was immediately captivated and lost sleep, so he exceeded my expectations.Two orphaned brothers who were raised and abused in the IRON HOUSE, an orphanage in the mountains of North Carolina end up leading very different lives. The older, stronger, brother, Michael becomes an enforcer for a crime boss in New York. When he falls in love, and wants out of the life, his life and that of his pregnant girlfriend are in terrible jeopardy. The younger, weaker, sensitive brother, Julian is adopted by a Senator and his wife and becomes an artist and writer. But the traumas he suffered have left him mentally crippled and reclusive.The boys in IRON HOUSE at the same time as the brothers and were responsible for a lot of the abuse, have begun being murdered and Julian is the prime suspect. Michael and the Senator’s wife join together to rescue Julian, and at the same time Michael must defuse the threat from the sadistic mob hit men.Mr. Hart’s treatment of the familiar story of mistreatment as a child delves into the inner lives and emotions of the characters with great compassion and a loving spirit. His beautifully, graphic depiction of their yearning for love is truly heartbreaking.Bravo, Mr. Hart, an unforgettable and marvelous read."}, {"userName": "Caitlin", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/2209914-caitlin", "userReview": "Who doesn't love a story about orphanages or reform schools - those places where children are hidden away from sight, where Lord of the Flies-style children's societies form, where adults are often the worst enemy? They're like stories about asylums, full of that sense of Gothic danger.Iron House manages to successfully combine Gothic elements within an action-type thriller. The story is well-paced, full of twists and turns, and hits all the high notes for its genre. Almost too good to be true (but not quite), Michael and his brother, Julian, are survivors of an orphanage. Damaged in different ways, but still bound together by blood and history. Michael survives by becoming a pragmatic, dispassionate killer; Julian, by retreating into madness, circling and circling for the door that will take him to a better place. Separated by years their worlds collide when Michael's mentor, a legendarily ruthless mob boss, dies leaving Michael vulnerable to his mentor's son who considers him an intolerable threat. As much as this is a thriller, it is also a story about love, forgiveness, and finding your way to home and redemption.Yes, parts of this are improbable and yes, some of it is predictable, but it is always thrilling, always compelling, and continually delightful in the twists on genre traditions. One of the best thrillers I've read all year. Highly recommended for readers who need a roller coaster ride."}, {"userName": "Donna", "userReviewDate": "Nov 05, 2014", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "Wow. I've read a book and I have nothing bad to say about it. I really liked this one. It gripped me from the beginning and pulled me right in. It kept me firmly rooted, waiting to see what was going to happen next. Great suspense. The characters were so flawed, but so like-able. They were well defined, but yet unpredictable. There were some creative twists and turns in this that kept the pace moving and they provided avenues of gaining new information little by little, both of the plot and the people.I look forward to reading more by this author."}, {"userName": "Kim", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/1012358-kim", "userReview": "This was a terrific book! I read it in just a couple of days. John Hart does a great job keeping the reader guessing until the end. I have to say that my favorite \"characters\" in the book were the Land Rovers. I plan to check out his other books just to see if they feature Land Rovers as prominently too.Loved this book!"}, {"userName": "Christine", "userReviewDate": "Jun 06, 2014", "userURL": "http://www.goodreads.com/user/show/24724974-christine", "userReview": "I listened to the audio edition of this book and it's sad when you keep wanting a book to be over. I could not even finish it. I know Hart can do better than this. Too much forced drama and not enough depth."}, {"userName": "Krissy", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/610509-krissy", "userReview": "I really enjoyed this book. Except for Elena. She was annoying, weak and just TSTL."}, {"userName": "The Just-About-Cocky Ms M", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/11969567-the-just-about-cocky-ms-m", "userReview": "Wowza! OK, one star less than the first two Hart books I read, but even so, this one is heads and shoulders better than most thrillers out there. Lots of dark psychological issues that in one case were a bit over the top, a \"love interest\" I wanted to bitch slap, and a plot wrinkle that was a stretch, but despite those small glitches, this was a riveting read."}, {"userName": "Carolyn", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/5349403-carolyn", "userReview": "John Hart is known for beautiful, literary writing; his mystery books set in the American south. He has won two Edgar awards and this one is every bit as good; a riveting read. 4.5 stars. Hart manages to get into the minds and hearts of his characters.The lead character, Michael, is a mob hit-man in New York. He does not hesitate to kill on behalf of the crime family, and will also kill to protect those he loves.It should be difficult to like and empathize with such a person, but we do. The story begins when two orphaned brothers are inmates of a prison-like Iron Mountain Home for Boys. Julian is shy and weak, both physically and emotionally. He survives bullying only because his older, tougher brother, Michael fights to protect him. The wife of a billionaire senator visits the home in hopes of adopting the two brothers. On this day Julian responds to the biggest bully by killing him. Michael takes the blame and flees the orphanage. How did the boys end up at the orphanage? What was their previous background? How much nature or nurture influences the adult one becomes? Twenty years have passed and the lives of the two boys have taken different paths. Michael was taken off the streets of New York by the organized crime boss whom he has come to regard as a substitute father. He meets a lovely, innocent girl and she is expecting his child, , the mob boss has given his blessing for Michael to leave the crime family. The mob boss is dying and pleads with Michael for a mercy killing, which Michael carries out after much hesitation and soul searching. Now the man's son and other members of the mob are out to make Michael pay for the mercy killing and for wanting out of the crime family. They threaten the life of his girlfriend, Elena and also his brother, Julian. Julian is living with a billionaire and his wife in North Carolina. He is emotionally unstable, but has become a noted author and artist.Michael must go to Julian to protect the brother he hasn't seen since he fled Iron House. At the same time boys who abused Julian at the orphanage are now turning up dead, and Julian is suspect. This is a multi-level book, with well developed characters and many twists and turns. There is a unpleasant old woman living on the edge of the billionaire's vast estate who is considered a witch. She has a wild teen-age daughter who prefers to live in the woods rather than with in her mother's shack. How do they relate to the story?  Hart is probably my favorite mystery writer, and am looking forward to his future books."}, {"userName": "Michael", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/2065514-michael", "userReview": "Have you ever considered how hard it is to get out of an impossible situation?Michael and his brother, Julian, were raised in a home for boys. Iron House provided a shelter and discipline. Julian was constantly abused and bullied by other boys. Michael wanted to protect his brother and was forced to fight for both of them. As a result, he became a ferocious combatant. When Julian finally struck back at his main tormentor, Michael took the blame.Julian was adopted and Michael left the home and lived on the streets, frequently having to defend himself. At age fifteen, he was attacked by a group of boys in Spanish Harlem. He fought courageously. Otto Kaitlin, a crime boss, was watching the fight and rescued Michael. He saw Michael as similiar to himself as a youngster. Michael became his protege and later, his main enforcer. Otto's own son, Steven, continued his education but didn't have Michael's fighting spirit.Years later, Michael falls in love with Elena. When she becomes pregnant, he asks for Otto's blessing and permission to leave the gang and live normally. Otto is near death and Michael knows that Steven and the gang members loyal to him, wouldn't let Michael leave.Michael visits Otto again and sees his friend in severe pain. When Otto pleads with Michael to end his suffering, Michael obliges.Now he knows he's made an enemy of Steven and must go on the run with Elena.There is a parallel story of Julian and his adoptive partents. Eventually, Julian's past returns to haunt him and he and Michael converge again.The story is reminiscent of Charles Dickens where the central characters at the start of the story are in terrible situations and are impoverished. Somehow they must rise above the destitute and the manner in which this is done is entirely realistic and well described."}, {"userName": "Shelli", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/1561203-shelli", "userReview": "I enjoyed this as a fast-paced mystery thriller. I listened to the audio which might not have been the best format as the narrator tended to make some of the characters come off as too cliche and overly dramatic. I liked it best when I just \"stayed in story\" and went with it. If I thought about it too seriously, I would end up picking it apart for the absurdity of certain situations and dialogue. It did have some characters who were interesting and I was pulling for them. I had a hard time with the main character, Michael. In a few scenes his actions and conversation had me laughing out loud, which was not the correct response for what was happening. I found the story itself to be interesting overall. I wanted to know what had happened to get to where the story started. It did have a few gruesome scenes which felt a bit out of place, I'm not sure they added much to the story. This is the second book I have read by this author. I thought The Last Child was much better. I have a couple more books by him and will definitely try another."}], "description": "An old man is dying.          When the old man is dead they will come for him.          And they will come for her, to make him hurt.\nJohn Hart delivers his fourth novel -- a gut-wrenching, heart-stopping thriller no reader will soon forget.He would go to Hell     At the Iron Mountain Home for Boys, there was nothing but time. Time to burn and time to kill, time for two young orphans to learn that life isn’t won without a fight. Julian survives only because his older brother, Michael, is fearless and fiercely protective. When tensions boil over and a boy is brutally killed, there is only one sacrifice left for Michael to make: He flees the orphanage and takes the blame with him.To keep her safe...      For two decades, Michael has been an enforcer in New York’s world of organized crime, a prince of the streets so widely feared he rarely has to kill anymore. But the life he’s fought to build unravels when he meets Elena, a beautiful innocent who teaches him the meaning and power of love. He wants a fresh start with her, the chance to start a family like the one he and Julian never had. But someone else is holding the strings. And escape is not that easy. . . .Go to Hell, and come back burning....    The mob boss who gave Michael his blessing to begin anew is dying, and his son is intent on making Michael pay for his betrayal. Determined to protect the ones he loves, Michael spirits Elena—who knows nothing of his past crimes, or the peril he’s laid at her door— back to North Carolina, to the place he was born and the brother he lost so long ago. There, he will encounter a whole new level of danger, a thicket of deceit and violence that leads inexorably to the one place he’s been running from his whole life: Iron House.", "title": "Iron House", "url": "https://www.goodreads.com/book/show/10024937-iron-house", "average": 4.09, "cover": "https://images.gr-assets.com/books/1442918881l/10024937.jpg", "reviews": 1662, "authors": [{"url": "https://www.goodreads.com/author/show/47072.John_Hart", "name": "John Hart"}], "type": ["Mystery", "Fiction", "Thriller", "Suspense", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/10024937-iron-house", "http://www.goodreads.com/book/show/11341797-iron-house", "http://www.goodreads.com/book/show/13126669-iron-house", "http://www.goodreads.com/book/show/12632398-iron-house", "http://www.goodreads.com/book/show/10243012-iron-house", "http://www.goodreads.com/book/show/5556466-the-last-child", "http://www.goodreads.com/book/show/26883206-redemption-road", "http://www.goodreads.com/book/show/446038.Down_River", "http://www.goodreads.com/book/show/82375.The_King_of_Lies", "http://www.goodreads.com/book/show/31450687-the-hush", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}