{"ratings": 334, "userreviews": [{"userName": "Katy", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/4572741-katy", "userReview": "This caught my eye at the library. I couldn't tell if it was a thriller or a comedy/satire - still can't. Jenny showed interesting character development, but don't expect a lesson learned. I found myself enjoying it. I wonder what that says about me. LOL"}, {"userName": "Nancy", "userReviewDate": "Nov 21, 2008", "userURL": "http://www.goodreads.com/user/show/406332-nancy", "userReview": "Thinking about the one hundred and one ways to murder your lying, cheating ex-boyfriend is one thing, but to actually kill the guy? Jenny Green takes revenge to a whole new level towards the despicable boyfriends she encounters: by violently putting them to their death and then getting away with it. The first time I saw the title, I didn’t think much of it. I didn’t even catch the glaring cover—a girl holding a pointy knife—but once I read the blurb, I laughed at the pun. It’s a smart way to draw your readers in. It’s the definition of catchy. The book itself, however, deflated my good expectations. The character is meant to be a portrayal of a spoiled teenage brat, and while the author has got that trait hands down, I find Jenny Green too one-dimensional. She doesn’t come alive on paper. But it’s not just that. The story is terrible. She keeps killing off the guys one by one, but she never gets caught. When she makes her final kill towards the last five pages of the book, it seems as if she has her regrets. After all, she confesses to her crimes in paper. But two pages later, she runs from the scene of the crime. Then Jenny says Canada’s not for her; therefore, she will return to America. I’m guessing there’s a sequel, but if there isn’t—holy cow. What kind of message would that be? You can get away with murder? Most definitely NOT. That one moment of remorse isn’t enough either. Where are the lessons about responsibility and good character taught? Nowhere. That’s the demise of this novel."}, {"userName": "Erin Reilly-Sanders", "userReviewDate": "Oct 23, 2011", "userURL": "http://www.goodreads.com/user/show/2961636-erin-reilly-sanders", "userReview": "So, this one was of the worst books that I've read in a long time. While it sounds like readers who were able to connect with Jenny Green were the ones who liked the book, I found her to be absolutely obnoxious and had little sympathy for the horrible situations she put herself in and the semi-disastrous results. Yes, I understand that this is unfortunately not an uncommon situation for young women (well, without the murdering part) but the lack of respect for her body that this girl had really made me feel sick and I didn't feel like the authors addressed this in an sort of productive way. I think that the fatal flaw for the book was the attempt at writing a vigilante-type anti-hero (like Batman). Unfortunately, rationalizing murder after the fact by saying that you've done the world a favor isn't quite the same as rationalizing it before you do it. This story type also depends on a likeable anti-hero who often has some character trait that incites sympathy, like being kind to animals (see http://www.writingexcuses.com/2009/12...) but for most readers this seems to fail horribly. Thankfully, it looks like few places bought Jenny Green's Killer Junior Year so you won't be tempted by it. If you want something that investigates gender, pop culture, and a little bit of violence, try Libba Bray's generally sarcastic Beauty Queens for some well-thought-out social commentary with a hilarious sugar coating."}, {"userName": "Chelsey Boyd", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/81539237-chelsey-boyd", "userReview": "i couldnt put the book down, i read this within a day. This book is the reason why i started to read books. I felt the words speaking to me, it was easy to paint a picture of what was going on. This book kept me wanting more, i couldnt stop til i new what happed to Jenny. Than all of a sudden i was on the last page! i couldnt reccomend this book enough! ☺"}, {"userName": "Shel", "userReviewDate": "Sep 11, 2011", "userURL": "http://www.goodreads.com/user/show/2045382-shel", "userReview": "REVIEW: Jenny Green's Killer Junior Year (I was not impressed)Belasen, A., &; Osborn, J. (2008). Jenny Green's Killer Junior Year. New York: Simon Pulse.284 pages.So, when I first started typing this review, I accidentally put 'yar' instead of 'year.' As though 11th grader, Jenny, had become a pirate. (Note: I would read that book. I may be out of high school, but I'm still looking for ways to transition to a career in piracy.)Appetizer: After a sucky sophomore year, Jewish American Princess (or--I kid you not--'Jap' as she prefers to use *shudders*) Jenny Green decides to leave her Long Island public school in the hope of finding cooler people and \"the one\" (AKA Prince Charming) at boarding school. She has a good idea of who her prince will be: a boy named Josh who had transfered previously.Jenny settles into Molson Academy, navigates having to live in a house of artists/hippies, finds a friend, orchestrates running into her prince, finds a way to cheat in her AP calc class, considers losing her virginity and flirts with her favorite professor. But all is not perfect. She starts to realize that Josh may not be as wonderful as she thought he was and after he drunkenly attacks her, Jenny will have to do things she'd never considered before: become a killer.But what starts out as self-defense, quickly evolves to murder as other men wrong her.I wouldn't say I *hated* this book. I could say I disliked it. But, I think saying I didn't get it would be gentler. From the first page, I hated Jenny. She was shallow and judgmental. So, when she started killing other characters, with seemingly almost no regret, I was not inclined to care. Eventually guilt and potential consequences do present themselves, but by then, I was just reading to get the book done.On top of that, the book repeatedly refers to 9-11 and a potential school shooting at Molson to explain some of Jenny's choices and to imply that the crazy-screwed-up world is somehow contributing to her choices. While I appreciate the effort to show the subtle pressures influencing Jenny, my reaction as I was reading was just to say \"WTF?! What the heck is this doing in this book?!\" I felt like Jenny Green's Killer Junior Year was attempting to make some cultural or feminist commentary, but I just failed to follow it. Oh, and this book is supposedly humorous.I didn't find it very funny.Was I missing something?Also, aside from the killing, there are also a handful of pretty sexually explicit scenes.Dinner Conversation:\"'Twas the end of a long and bitter sophomore year. 'Twas. I just really wanted to use that word. I promise I won't use it again; this ain't Dickens. Seriously, though, sophomore year totally sucked. I broke my toe and couldn't be in the school production of Grease, Doug Lapidus took a picture of a huge zit on my nose and broadcast it on Facebook, and that bitch Veronica Cohen stole my prom date Mark Leibowitz\" (p. 3).\"Still, none of my experiences in high school could have prepared me for the utter lameness of the guys I'd soon meet in boarding school. I repeat, and seriously, feel free to scribble this somewhere while you're reading: None of my experiences in high school could have prepared me for the utter lameness of the guys I'd soon meet in boarding school. Pretty please, keep this in mind before you blame me for everything that happens in the next however many pages\" (pp. 5-6).\"It proved fairly easy to track down Josh Beck. Some random girl knew him and said he was usually at the school gym around five.Okay, I'm totally gonna sound like a stalker now, but I basically camped outside the gym until I spotted Josh.\" (p. 41)\"Memories flooded my feeble mind--memories of 9/11. My family and I were supposed to go into the city the night before to watch a Broadway play and stay at a hotel. It was a tradition. We called them \"Green Apple Nights,\" and Daddy let us take off from school and everything.Anyway, Daddy had a friend in the towers that we were going to visit the morning of 9/11, and the only reason it didn't happen is because Abby got food poisoning and everything was canceled. Daddy's friend died in the attacks. It took me years to recover from the fact that I, too, almost died that day. And here death was again, knocking on the door but not coming inside. It chilled me to my core. What the F was up with September?\" (p. 53)\"I wanted to get away with it. Beneath the anger and the self-defense lay something primal, something pleasurable even. As I'd watched Josh squirm, a feeling came over me I can only describe now as empowerment. Watching this creep die suddenly filled me with a force I'd never known myself to possess. It was all mine. I was Supergirl\" (p. 68)"}, {"userName": "Janelle", "userReviewDate": "Feb 12, 2009", "userURL": "http://www.goodreads.com/user/show/695206-janelle", "userReview": "Jenny Green’s Killer Junior Year by Amy Belasen and Jacob Osborne is a sometimes funny, generally captivating revenge tale narrated by Jenny Green, the teenaged killer, herself. Readers are privy to Jenny’s innermost thoughts through out the book, from the mundane--dieting and wardrobe woes-- to the decidedly creepy thoughts of death and murder. Jenny Green is bored of her Long Island life. A self appointed Jewish American Princess (JAP) reeling from the latest round of high school humiliation and misery, Jenny decides to leave it all behind and start over in a new school, in a new place, with new faces. And what better place to start over than a boarding school way up north in Montreal, the very same boarding school her middle school crush, Josh Beck, attends? But along with a fresh start, Jenny also finds that not all experiences with the opposite sex are the stuff of romance novels. After her first accidental taste of murder and fed up with the lying, cheating ways of the males in her life, Jenny decides to take her revenge on those that have hurt her.I really, really wanted to love this book. I did enjoy it, and it turned out to be an entertaining read, but it sure wasn’t “love”. The beginning was a little slow and I kept wondering when the killing would begin. That sense of anticipation is what kept me reading to find out who would make Jenny’s list of victims. The killings are not very graphic, as Jenny is narrating and hates the sight of blood. Jenny’s thoughts are the creepiest thing about the book, though the creepiness factor is pretty fairly balanced with humor. So what’s not to like? Jenny’s character took quite a while to grow on me. Through a good portion of the book I didn’t really care about her until all of a sudden I found myself rooting for her. It surprised me because up until that point I saw her as little more than a spoiled brat; a stereotype of a wealthy teenage girl. Thankfully, Jenny grows somewhat, and moves beyond her initial flatness. Unfortunately, the same cannot be said about the supporting characters. These characters are not really fully fleshed out. The pessimist in me says the authors chose stereotypes over real characterization. The optimist in me says the characters consciously left the supporting characters (especially Jenny’s victims) one dimensional in order to make them appear more disposable or less real, thus making their murders easier to swallow. Whatever the motivation (or lack thereof) the characters never really reach beyond stereotypes and become full fledged human characters. Overall, Jenny Green’s Killer Junior Year is an entertaining read with an interesting premise; it’s a dark spin on the ubiquitous teenage dating drama books."}, {"userName": "Jennifer Wardrip", "userReviewDate": "Oct 24, 2008", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by Jaglvr for TeensReadToo.comWanting to get away from the life on Long Island, Jenny Green convinces her parents to let her attend boarding school in Quebec. She's done her research and she's pushed for Molson (yes, as in the beer) Academy. She's got her reasons for choosing Molson. For one, it's out of the country. For another, Josh Beck's family has moved to Quebec. But all does not start well when she arrives at Molson. Deciding on the school late in the summer, the only dormitory rooms available for Jenny are either in the freshman dorm (no way!) or the Female Artists' Colony (aka Hippie Hall.) The lesser of the two evils seems to be Hippie Hall. As soon as she meets the housemother, Raven, and her roommate, Jacinda, she begins to question her choice. Jenny settles in and thankfully one normal girl is in her dorm - Chloe. The two immediately click and a friendship is formed. But it doesn't take long for Jenny to feel like she doesn't belong. She never felt a part of the group in Long Island; the same is now happening at Molson. Jenny eventually runs into Josh, who recognizes her immediately. The two soon start to hang out together. Unfortunately, it seems that Josh isn't the dreamy boyfriend she thought he'd be. Molson is in shock when one of their own students is arrested on conspiracy charges. They find in his possession a list of students he wanted to shoot. Jenny is shocked to find out her name was on the list. In that moment, she decides that she doesn't want to die a virgin and decides to have sex with Josh. His parents are out for the night, so the two go back to his house. When she learns that he neglected to use a condom, fear of pregnancy and disease quickly turns to anger. How could he be so selfish? The sex wasn't even any good! From that first lack of consideration by one male in her life, Jenny Green turns into \"Supergirl\" in her own head. When Josh comes to her dorm room expecting a little intimacy, Jenny loses it and grabs the closest thing she can, her roommate's glass bong. In her haste, she manages to slash Josh. She slashes enough that she kills him. Jenny is able to clean up the blood in her room without anyone noticing, and manages to cart his body out in a large duffle bag. She drags him to a deserted building and stages a fake suicide to avoid detection. When Jenny seemingly gets away with Josh's murder, she feels invincible. This is the beginning of Jenny's downward slide into her murdering madness. Any male that crosses her path is in for a rude awakening (or should I say death?). Jenny thinks she's too clever to be caught. But is she as smart as she thinks she is? Pick up JENNY GREEN'S KILLER JUNIOR YEAR to find out for yourself!"}, {"userName": "Tara K", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/54489073-tara-k", "userReview": "\"Jenny Green's Killer Junior Year\" by Amy Belasen and Jacob Olsen was overall an interesting read. Initially thinking it would be far below my reading level, I was pleasantly surprised with this book. The story of a spoiled teen leaving her hometown for a boarding school where she can start over is somewhat overused, but this story had a large twist as the story went on. Learning more and more about Jenny Green's life and her motives behind the actions she partakes in throughout her new school. I chose this book because the title grabbed my eye considering I am only a year younger than Jenny in this story. The story itself was very interesting and really engaged the reader. Jenny's experience at her new school was something rather out of the ordinary; which is really what drew me in. The ending being the only thing that really was not in my favor; it could have gone in a different direction than it did. Overall, I did enjoy this book and the transformation that Jenny undergoes. Going from the average spoiled teen who constantly cared about how she looks and what people thought of her to a young, changed women who has experienced an endless amount of tough situations."}, {"userName": "Khy", "userReviewDate": "Jul 17, 2008", "userURL": "http://www.goodreads.com/user/show/1339150-khy", "userReview": "Jenny Green is a spoiled teen \"princess\" and the newest junior Montreal's Molson Academy. Jenny wants a fresh start in her new school, and she's curious to see what Montreal has to offer, most especially in the boy department. Beautiful, charming, and sharp-witted, Jenny has no trouble getting the boys to fall for her. But when she discovers just how despicable the male gender can be- with the lying, the cheating, and the utter disrespect- she decides to make them pay... with their lives. This deliciously dark comedy with style should resonate with any teen reader who's been spurned by love...and craved a little revenge in return.---Let me first say that this book is kind of creepy. Not in a 'I'm going to have nightmares and be paranoid about getting killed' way, but a way 'Uh....what the heck is up with some of these fictional characters? They go from snobs to murderers. Scary.'Jenny Green was a bizarre protagonist. Until the end of the book, she's one of those extremely annoying girls who only care about their designer jeans and Juicy purses and who says 'like' or 'ohmigod!!!' every other sentence. You wouldn't exactly expect a girl like that to go on a murderous rampage, but Jenny did because got very mad very fast. Her sophomore year was horrid because of things her friends did to her. (Her friends are appalling, by the way. They are 10 times worse than Jenny in the snobby rich girl department. And they say 'holla' a lot. I wanted to punch them. I can see why Jenny wanted to go to another country to go to school.) Most of the guys she managed to find were the worst kinds of guys you could find. They ended up treating her- and sometimes other girls- horribly. She just got sick of it and decided to do something about it. She kind of reminded me of Frankie from The Disreputable History of Frankie Landau Banks by E. Lockhart. They both wanted to do something to boys so that women could potentially be treated better. While Jenny's methods of doing this were much more extreme than Frankie's, they had similar goals. And because of this, Jenny eventually outgrew her annoying rich girl self.Another good thing was that Jenny actually had reasons for killing these guys. She wasn't just a murder crazed zombie. We got to see why she killed them and how each murder effected her personally. And each of them did have an effect on her, which was nice.This book receives 8/10 and I encourage you to read it when it comes out on September 23.from http://freneticreader.blogspot.com/"}, {"userName": "Emmalee", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/15251047-emmalee", "userReview": "The novel \"Jenny Green's Killer Junior Year\" written by Amy Belasen was both exciting and mysterious. Like every book, there are parts that are slower to read than others, but most of the book was suspenseful and full of twists and turns like any good book would contain. Jenny Green was just starting out at her new boarding school Molson Academy in Montreal after days of convincing her parents to let her go in hopes of rekindling things with her lost lover Josh from her other school back home, but when already got off to a 'bad start'when she moved into her dorm and saw that she's surrounded by messy, pot-smoking hippies. Although she is very unenthusiastic about her roommate situation, one good friend does come out of the mix for Ms. Jenny Green. Chloe, one of the roommates in the same dorm as Jenny, might as well be her twin. They happen to like all the same things having the same morals on guys and dating and they definitely have the same charisma and fashion sense, that of 'daddy's little princess', but still as bright as a button. (Or at least they contained common sense.)When things start to rekindle with Josh and are finally where she wants them to be again, it all takes a turn for the worst when drunken jock Josh showed up at her dorm looking for some one on one time and she refused to participate in his hands on games. When Jenny refused Josh and his 'smooth moves', he blew up and started to forcibly place himself on her. He pressed, and pressed, and pressed some more until finally, the perfect, pretty princess snapped and out of rage, killed Josh. Shocked at what she had just done, horrified at the scene, and disgusted from his piggish actions, she decided to hide the body, and made his death look like a suicide covering up her tracks as she retraced her steps carefully. Nothing after that night was the same with the guys scene and Jenny ever again, even when things seemed to go well for her. Maybe she was just too far gone by Josh's death, or she couldn't stand the male community and their ghoulishly slimy games anymore. Either way, she was fed up with guys pushing around, manipulating, and taking advantage of her, but not just her, all girls for that matter. She knew these boys had to pay for playing their silly little love games and for being down-right demeaning cruel towards her, and so she set out to make it happen. She made them pay alright, but not in the way any rational girl would. She made all the boys pay, with their own lives."}, {"userName": "4nancy", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/2154339-4nancy", "userReview": "Boy's, drama, murders, and more in the book Jenny Green's Killer Junior Year. Sounds interesting right? Well not really, other than the plot, nothing else is really interesting. The point point of view is in the eyes of Jenny, but I do not like that. The ending is also very bad. They could have provided a little more details at the end.When you read books of course you want the story to be interesting.  Jenny Green's Killer Junior Year, has a good one. Jenny Green the main character grew up in New York. She did not like it that much, so in her junior year she moved to a broading school in Canda. Although she liked male attention she did not like to mistreated by them in anyway. Most boys were not aware of this though. It started with one boy mistreating her, and accidental killing. After that each boy that mistreated her in anyway got what she thought they deserved.Point of view is an important part of a book. The narrator of this book is Jenny. You see and hear everything she does. I do not like it this way in this book. They should have had an all knowing narrator. Knowing what other people thought about her would have made it more interesting. Telling if the boys thoughts were the same as what Jenny thought they were.Ending a book with some questions is good, people can think whatever they want. Ending a book where your left with a lot of questions that could have easily been covered is not. Authors end books with information you were waiting for. Did they get caught? Did he survive? Are they together? Jenny Green's Killer Junior Year left me with so many questions. It does not give me anything about what happened to her. It just ends, with no happy or sad ending, it just ends.Books have to be interesting for me to like them. This book was almost there but not really. The plot was very good, but thats about it. The point of view could have been a little different. So it gives you more of other peoples thoughts. The ending was also bad. You do not just end a book you have to leave the reader a little information."}, {"userName": "Anna", "userReviewDate": "Feb 25, 2011", "userURL": "http://www.goodreads.com/user/show/948988-anna", "userReview": "Let me just begin by saying this: I hated this book. Hated with a capitol H. I know many people who disagree with me, and also a few who agree with me, so I think this is one of those where you either like it or hate it, with no middle ground.Jenny comes across as a spoiled rotten Jewish kid who I couldn't relate to at all. There were so many \"Ohmigods\" in this book and it just got really annoying after awhile. Also the use of the word \"gonna.\" Now, when I'm IMing or e-mailing or whatever, yeah, I use \"gonna.\" But when writing a paper or a story? Going to. Not gonna. That also got annoying after a while. Jenny's voice just wasn't very open to people being able to relate to it.The whole idea of the story was also very odd. Points for originality, but honestly, what girl is going to kill her boyfriends after they've broken up with her because they're jerks? I'm pretty sure not too many. Yeah, there's a lot of guys out there that can be jerks, but that doesn't mean you need to kill them. It means you find a good guy and stay with him, let other girls find out about those idiots.One last thing I will mention: the ending. Uhm, weird much? I don't want to say anything about what happens, in case you still want to read this book, but it's... weird with weird sprinkled on top of it. I didn't like it much, haha. :)But: points for originality. And the cover. I like the cover. :)Overall, I wouldn't recommend going out and buying this book (which is what I did...). I would borrow it from a friend who owns it or going to the library. Honestly, I found buying this book to be a waste of my money."}, {"userName": "Nyasa", "userReviewDate": "Aug 28, 2009", "userURL": "http://www.goodreads.com/user/show/2443224-nyasa", "userReview": "Jenny Green's Killer Junior Year was about a girl named Jenny who transfered from her old school in America to go to a boarding school in Canada. Jenny has decided to reinvent herself, she does this byt going out with guys and when she starts to really like them they hurt her so she does something that makes her feel better, she kills them. When police get involve and figure Jenny did it she does it she does anything to cover it up. Wehn everything points to her and the police are after her she says goodbye Canada and hello America. I give this a text-to-world connection. I give it a text-to-world connection because in TV shows and movies they have the physco girl who either kills the guy there with or the girl or women the guy is with. They do it out of revenge just like Jenny did. But the difference is that the people in the TV and movies always end up going to jail Jenny on the other hand runs away and gets away with it. Jenny most likely won't get caught and will kill many more guys and the chics in the movies and TV shows get put on TV ao everyone knows who they are. I gave it 5 stars because the book is hilarious and violent. It's like a comedy/murder show, they put a twist on the whole rich girl thing. Instead of her finding another guy like they normally do she kills the guys that hurt her and it's put as an accident or she blames someone else. It's fantastic"}, {"userName": "Angel", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/6174238-angel", "userReview": "Originally, I had this rated at 4 stars because, for some reason, pre-pubescent Angel thought that a self-absorbed serial killer was a great narrator and deserved sympathy. But, looking back, Jenny Green does not deserve anyone's sympathy. Of course, the men she comes in contact with do some very disgusting things, but they do not warrant death. And Jenny actually believes that she is a superhero nonetheless. Superheroes don't just kill because they can. Especially that one innocent guy who was just in the wrong place at the wrong time. Jenny Green can't be described as a feminist, fighting the patriarchy. She isn't the heroine in her story. She's the antagonist. When I try to give the author's the benefit of the doubt, I try to say that maybe they wrote her this way on purpose. But, then I try to think of why they would write her this way--what message were they trying to get across? Karma's a bitch? Any one of the Ten Commandments? Whatever I came up with, it just didn't make sense. None of them were strong enough. The only conclusion I can come up with is that Jenny Green's Killer Junior Year was written as a parody or some editor should probably get fired for letting this get published."}, {"userName": "dm21", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/7816770-dm21", "userReview": "I had known of this book's (not so good) reputation so when I saw it at my local library, I had to pick it up. And I really wish I hadn't.The idea of a scorned girl getting back at men is appealing but it is not appealing enough to save this book. The characters and the plot were so shallow I'm not sure which was worse. The men all started off acting nice but of course it turns out they only want one thing: sex. The only boy who isn't obsessed is described as a geek, nerd, etc.The book tries hard to justify Jenny's killings but nothing seems to work. If Jenny was just the slightest bit of a like-able character this book might have been worth two stars. But that's a mighty big might considering Jenny sits back and let's a girl get drugged to get back at her for stealing Jenny's prom date. You could say she makes up for it by murdering the guy but that could have been prevented if she didn't sit back and let it happen.There's other things I didn't like about this book but the only one that really sticks out is Chloe (who was revealed as a lesbian if only because why the hell not?) and jenny's overbearing use of the words totally and killer with a side of her always seeming to talk down to you in narration."}, {"userName": "The Lost Lola", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/1139549-the-lost-lola", "userReview": "Summary:Jenny Green is a rich Jewish girl who decides to transfer to a school all the way in Canada just to be with a guy she likes. But men can sometimes be... disappointing, so when Jenny is wronged by the guy in question, she decides it's time to teach them all a lesson.Characters:Jenny Green: The protagonist... or maybe antagonist of the story. She makes a habit of reminding you all the time about being Jewish and her love for Juicy Couture. She murders any guy who she feels has done her wrong.Chloe: Jenny's lesbian BFF. She shares her likes and dislikes about pretty much everything, except, of course, murder.Review:This book had such a good premise going for it, and I was totally disappointed by the entirety of it. The sex scenes were pretty disgusting, the murder scenes were actually glossed over, and Jenny was a completely unlikeable character that I was actually HOPING she got caught in the end (which, by the way, she doesn't). Badly written, poorly planned, you can tell this book was written by 2 people; and does one of the authors have to have SO MUCH in common with Jenny?? The only reason I have this book 2 stars instead of 1 is because of the large amount of Juicy references, which were oh so fun to read about :)"}, {"userName": "Deltay", "userReviewDate": "Aug 16, 2009", "userURL": "http://www.goodreads.com/user/show/2396797-deltay", "userReview": "Junior year can be killer – Jenny Green should know.Jenny’s your typical spoiled brat with a revenge craving streak. In keeping with her character, she convinces her parents to let her leave Long Island for Molson Academy, a boarding school in Montreal. Through a series of rather unfortunate incidences, Jenny begins building a case against the male gender in general.While losing herself, Jenny discovers her inner killer. Guys, this is one femme fatale that you do not want to mess with.Deviously funny in parts and shockingly serious in others, the dark humour in Jenny Green’s Killer Junior Year is not for the faint of heart. The killer duo of Amy Belasen and Jacob Osborn has cranked out quite a murderous book – in the literal sense. More so than you know.Funny enough for stress relief, but deep enough for readers to emphasize with, Jenny Green’s Killer Junior Year will leave you questioning yourself. Just remember, not everything is as it seems. That girl-next-door over there? You could be her next victim.One thing’s for sure though; Jenny Green has had a Killer Junior Year."}, {"userName": "Want My YA", "userReviewDate": "Feb 26, 2009", "userURL": "http://www.goodreads.com/user/show/1715302-want-my-ya", "userReview": "Here's a snippet from my blog review: This book can only be described as interesting. Well, maybe guilty pleasure fits in there too. I'd never understood that phrase before because I've never understood why anyone should feel guilty about what they're reading. However, as you follow Jenny through the murders, there is a bit of a guilty glee in watching her get away with it.It's also really interesting to see what happens to Jenny as a result of these murders. I'll tell you now, the first one truly was an accident and self defense. However, the turning point comes when she chooses not to report it and manages to get away with it. As Jenny keeps on getting away with it, the murders start to eat away at her. From the beginning to the end, Jenny is a very different person, which I guess is the goal of any story. So check it out and tell me, do you think she's better off at the end?And here's the link to the original post: http://wantmyya.blogspot.com/2009/03/..."}, {"userName": "Lisa", "userReviewDate": "Mar 01, 2009", "userURL": "http://www.goodreads.com/user/show/1747446-lisa", "userReview": "Jenny Green is a spoiled teen \"princess\" and the newest junior at Montreal's Molson Academy. She has everything that she ever wanted or needed and is a daddy's girl. The first boy Jenny meets is sex addict. He gets high and then tries to have sex with her while she is studying. She kills him. She kills a lot of boys at her time in Canada, but sooner or later her secret is revealed. I can make a text to wold connection. There is a lot of abuse towards women all over the country, many of them just bear with the pain and sooner or later die. But some of them like Jenny take charge and give them some payback. Her payback is a little too harsh but she is telling them what she should have done a long time ago.  I gave this book 5 stars. Even though this book is a little graphic for a 12 year old girl, it is really hooking and funny to read. Jenny Green is a amazing character, even though she has a lot of anger issues she still is number one."}, {"userName": "christine.", "userReviewDate": "Jan 27, 2009", "userURL": "http://www.goodreads.com/user/show/1388457-christine", "userReview": "Trashyyyyyy.I think that's the first thing that comes to mind when I think about this book. The narrator is a sixteen-year-old murderer who constantly talks about sex and violence in pretty graphic detail (okay, we're not talking Battle Royale detail, but still). Her voice borders on highly annoying to psychotic, and the whole thing really reads like some \"softcore trashy novel\" (to quite Jenny).This book is populated with some of the worst men I've ever seen in literature. It makes Montreal look like the epicenter for the perverted, depraved, and deprived male species. Not a single one has any real redeemable qualities (well, except maybe Edgar, but even then...). It's a pretty super unbalanced book.The ending is also pretty blah. But it's a compulsive read, the pages fly fast, and it's over quick. It's mindless fun while it lasts, but this baby definitely doesn't have any morals to teach the YA set."}, {"userName": "Michael (Mai)", "userReviewDate": "Jan 09, 2009", "userURL": "http://www.goodreads.com/user/show/1884422-michael-mai", "userReview": "This book was really, really funny at the beginning. I thought the choice of language (while annoying) really made the character easy to read so when she made stupid decisions you could understand why. It was also easier to see her as young and naive. But as the book progressed it got darker and Jenny sunk lower and her personality changed and I thought that was great. I would have given this book four stars if Jenny just would have been caught in the end, or died herself. She deserved to be caught, even she knew she should be. The happy go lucky \"It's been a year and I'm still free\" epilogue was pretty lame. I also thought it was a little sad that pretty much every male she depended on after getting to her new school turned out to be douchebags. I mean everyone can't be that bad, can they?"}, {"userName": "Ella Perkins", "userReviewDate": "Dec 31, 2008", "userURL": "http://www.goodreads.com/user/show/1747456-ella-perkins", "userReview": "This book is about a girl named Jenny Green. She is a girl in collage and she is a mans treat. All the men at school want Jenny. But when she finds out that she getting cheated on, lied to, druged, and treated badly she takes it the wrong way.I can make a text to world connection because a lot is women in the world are getting treated badly and other than doing what Jenny does we could just tell the and talk. Not kill and regret it later and get caught buy the police. She and all other women ghouls just back off. I would give this book 4 stars because at sometimes I thought tgatvthe was just to much killing. But then others the book was just really discriptive and just good to read. I would recomend this book to people who like weird mystery/murder/love books."}, {"userName": "Cydnei childers", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/9819509-cydnei-childers", "userReview": "this book totally blew my mind. i was 14 when i read this book which i wouldnt suggest for other 14 year olds, this book is really too mature but im glad i did because i wouldnt of been able to find this book now that im 17 and i would of really been missing out if i hadnt gotten to read it. being allowed access into the mind of jenny green is access to a sick twisted wonderfully psychotic place in this book jenny starts off as naughty little miss perfect princess and although she made many changes along the way she mainly stayed the person through and through only musch more naughty and 100 times more crazy and i felt it was very refreshing and wonderful to be there as she made that change and im sure anyone else who reads this book would agree"}, {"userName": "Justin", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/5977936-justin", "userReview": "The novel was pretty interesting...I thought that it was going to be about this ultra-airhead and superficial girl who constantly regretted all her actions but I was proven wrong. Jenny was pretty cool cuz she wasnt sad about her actions and she was kinda crazy so Id def recommend this novel to people. The only thing that surprised me was how provacative some of the scenes were and how they implied _____ _______(?????). It was hilarious trying to figure it out and btw...I have no idea what the blanks meant lol"}, {"userName": "Eleni ( La Femme Readers )", "userReviewDate": "Jul 28, 2009", "userURL": "http://www.goodreads.com/user/show/2447786-eleni-la-femme-readers", "userReview": "I have mixed feelings about this one. Jenny Green is pretty much a spoiled, materialistic brat, but she is pretty funny. I really got into the book when she starts murdering boys because the way she does it, is really clever and a bit psychotic. However, her personality can sometimes be annoying but the author's writing is nice since it has a sarcastic tone. But, the ending wasn't the best, it was a little too open ended for me, unless their is a second book coming out, I should check into that. Overall, I did enjoy the book and I would recommend it."}, {"userName": "Emi B", "userReviewDate": "Jul 13, 2009", "userURL": "http://www.goodreads.com/user/show/2516596-emi-b", "userReview": "I thought this was a pretty good read.It held some suspense in it as to wether or not she would be caught through out the book.Some of her murders the way she planned them were brilliant.The details were very thought out.However as the book went on her murders were sloppy and didnt have the same amount of thought put into them. There was alot of talk about sex and violence through out the book.So I would say the age group for this book would be 16+ overall I found it a quick and easy going read."}, {"userName": "Katty", "userReviewDate": "Jan 08, 2009", "userURL": "http://www.goodreads.com/user/show/1643139-katty", "userReview": "For some reason I have laughed my way through this whole book. I saw all the bad reviews for it, but I 'm really enjoying it. It is one of those things you have to take with a grain of salt. Jenny is absolutely psycho, but thats where all the fun comes from. I read one review that compared this book to Dexter and I agree. The thing is that it is quite fun to see the extreme reaction to finding out how horrible things can get with the opposite sex. Its funny and dark and I love it!Although the ending left something to be desired, it kind of fell flat."}, {"userName": "Gina", "userReviewDate": "May 15, 2009", "userURL": "http://www.goodreads.com/user/show/2313988-gina", "userReview": "I really did enjoy this book. Jenny Green is a spoiled rat, but I love how she's sarcastic and she is really funny. It wasn't very deep, although I wasn't very content with the ending I really did like the book. It deals with teenage issues, and the way she kills the boys are strangely psychotic yet unique. I laughed at alot of parts in the book, because it's set in the teenage perspective. I'd recommend anyone who is entertained easily and is a teenager. But it's kinda short, so don't expect anything too spectacular or deep. :)"}, {"userName": "Jenny", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/2630825-jenny", "userReview": "Didn’t like the main character from the beginning. Jenny was materialistic and shallow. I picked this one up because the main character has the same name as me and also because the summary says she “makes guys pay with their lives” so I wanted to see if she would actually kill the guys. Big mistake…when I got to the killing part, it completely freaked me out. Her ex-boyfriend tries to rape her and she kills him in self defense but instead of calling the police she dumps his body and makes it look like a suicide. I’m sure she would kill again and that was the end of the book for me."}, {"userName": "Julianna", "userReviewDate": "Sep 09, 2014", "userURL": "http://www.goodreads.com/user/show/34639468-julianna", "userReview": "If I could I would have given this book 0 stars. It was THE. WORST. BOOK. I'VE. EVER. READ! It was demented, creepy and overall poorly written and I recommend it only to people who want to punish others. It was awful and I don't think anyone who appreciates books should ever read it and its a waste of trees."}], "description": "Hell hath no fury...  Jenny Green is a spoiled teen \"princess\" and the newest junior at Montreal's Molson Academy. Jenny wants a fresh start in her new school, and she's curious to see what Montreal has to offer, most especially in the boy department. Beautiful, charming, and sharp-witted, Jenny has no trouble getting the boys to fall for her.  But when she discovers just how despicable the male gender can be -- with the lying, the cheating, and the utter disrespect -- she decides to make them pay...with their lives.", "title": "Jenny Green's Killer Junior Year", "url": "https://www.goodreads.com/book/show/2819108-jenny-green-s-killer-junior-year", "average": 3.11, "cover": "https://images.gr-assets.com/books/1400875509l/2819108.jpg", "reviews": 54, "authors": [{"url": "https://www.goodreads.com/author/show/1226896.Amy_Belasen", "name": "Amy Belasen"}, {"url": "https://www.goodreads.com/author/show/1226895.Jacob_Osborn", "name": "Jacob Osborn"}], "type": ["Young Adult", "Fiction", "Young Adult", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/2819108-jenny-green-s-killer-junior-year", "http://www.goodreads.com/book/show/14694284-jenny-greens-killer-junior-year"]}