{"ratings": 93, "userreviews": [{"userName": "Cedric Nye", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/20861058-cedric-nye", "userReview": "--Okay, here is the straight scoop on \"Jordans Brains: A Zombie Evolution\"I LOVED it!! Oh, you want more? Okay, not a problem. Without any spoilers, let's see what I can do.Jordan lives in the nut-hatch, and has a life-long obsession with Zombies. Sounds like a pretty good recipe so far, right? Oh, it gets even better!Jordan has run countless Zombie drills in preparation for the Zombie Apocalypse, so when the Zombies make their appearance, Jordan is ready to rock and roll.Jordan is constantly being forked by the fickle finger of Fate as the Zombie Apocalypse progresses, but with steadfast determination..... Ummm, okay, let me be honest. It isn't steadfast determination that keeps Jordan going, CRAZINESS is the fuel that fires Jordan's cylinders!As more stress is piled onto the already unstable structure of Jordan's mind, and the truth about the origin of the Zombies is made clear, Jordan begins to lose all semblance of sanity, and we get a deep, dark glimpse of Jordan's Brains!I have never read a Zombie tale like this one. It was a roller-coaster ride of fun, fear, and flat-out lunacy. I recommend this book for any ages between twelve and the coffin. This is NOT your every day tale of shambling corpses. Rated \"R\" for READ IT RIGHT NOW!WELL DONE, J. Cornell Michel!!"}, {"userName": "DJ Harris", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/18766325-dj-harris", "userReview": "Jordan’s Brains: A Zombie Evolution by J. Cornell MichelA mentally ill person walks into a Zombie Apocalypse…Jordan is your average everyday mental patient preparing for the Zombie Apocalypse against the advice of their immediate family and medical professionals.Following the destiny that Jordan’s deceased father left for Jordan the night he passed Jordan is diligent in working Zombie Drill practices, storing emergency supplies, and developing a solid plan to not just survive but assist others in the event of the end of the world.Unfortunately, some things in life you just can’t plan for.Jordan has always been ready to save the world from a Zombie Apocalypse as a human. That’s all Jordan ever trained for. Now that Jordan is seeing the world through different eyes Jordan has to find a new path to fulfill the destiny Jordan’s father left behind.Can a mental patient with a zombie obsession really save the world?\nHeartfelt thanks to both the author, J. Cornell Michel, and GoodReads for providing me with a free copy of Jordan’s Brains: A Zombie Evolution. I have had such a blast reading it, and truly appreciate the generosity. I was the lucky winner in the First Reads giveaway for this novel.Beautiful book, colorful cover, lots of zombies, references to movies/tv shows/books that I love, humorous writing, lots of zombies.Upon arrival of this book I noticed it was shipped with love, being wrapped tightly in bubble wrap and placed gently in its envelope. It came autographed with the authors name and a personalized message; “Zombies are people too!”. The author, J. Cornell Michel, also took the time to insert one of his business cards into the pages of the novel, a great bookmark! The gifts didn’t stop there! The coolest thing in the package, besides the book itself, was a hand-written note on monogramed stationary addressed directly to me! I was highly impressed with the book before I even cracked it open. I want to thank J. Cornell Michel again for the care he put into sending me his book!\"\"Interesting fact,\" I say to break the silence, \"the story of ‘The Tell-Tale Heart’ is narrated in first person, and the protagonist’s gender is never revealed. Most people assume the murderer is a man, but it’s possible the killer is a woman.\"\"It was so perfect that the author chose to write ambiguously. \nThe Tell-Tale Heart\n by Edgar Allan Poe is my absolute favorite of all his wonderful writings. It didn’t take long for me to figure out what J. Cornell Michel was doing, but it must have been hell to write the story that way from time to time. It is rarely realized how often we use gender identifying pronouns.\"I have always known the greatest period of my life would be a dark time for the rest of the world.\"After reading the opening line… the first line… that gripping line… I knew I wasn’t going to be able to do this review like I do many of my others. I would want to include too many pieces of the book. If I tried to include ALL the quotes from the book that I want to in this review, I think it would be easier to just type out the whole book!!! Every bit of it is brilliantly written.Jordan is a true prepper, a zombie aficionado, and at heart a survivalist. I know his/her brother, Taylor, comes off as the true prepper in the story but Taylor seemed to have less abilities and experience despite his time on the force and/or his money sucking prepping supply hobby lifestyle. I believe if, and when, we see a major catastrophe in the world that there is going to be a lot of Taylor’s out there.\"I move the curtain out of the way to reveal the door to Taylor’s fallout shelter. He got drunk one night and told me his secret code to open the door of the shelter. I press 2-4-6-8, and the door slowly opens. Taylor has been preparing for the end of the world for at least ten years. His friends tease him about it, but I’m sure they wish they had shelters now. Taylor never believed me when I told him that zombies would be the cause of the apocalypse. He thought it would be an asteroid or a nuclear bomb.\"It is easy to joke about a Zombie Apocalypse, that is until you really think about all of the disasters that could fall under such a broad heading. Think about it! Everything from Plum Island experiments gone wrong, to Pittsburgh Zombie Capital of the World type brain-nibblers, to the leftovers of a FDA High Fructose Corn-syrup generation could fall under the heading of zombie. A little push and you’ll get apocalypse!Personally, I see the world bringing back the fear of nuclear weapons to a whole new generation now. Re-use, recycle, they say! I guess being a part of that cold-war generation I don’t see the value in this type of scare diplomacy, but then again I’m not part of the New World Order running the show. Nuclear zombie’s are fun in the media, maybe that is their ultimate goal!Jordan handled his families disregard for his/her warnings much better than a mentally stable person would have. I know plenty of chicken little’s who freak out if you don’t hang on their every word!\"Everyone should be comfy during the apocalypse.\"I love that Jordan remains so calm throughout the book. There are very few times that she/he starts to show his mental cracks, despite his obvious mental instability. Jordan is a very complex character that must have been both exciting and nearly impossible to write. Jordan his/her-self definitely drove the story here and I am sure as scary as it can be to let your character take over the story J. Cornell Michel must have had a lot of fun letting Jordan run amuck throughout the pages!\"I have seen every zombie movie ever released, as well as most other horror movies, and some are created purely for entertainment, while others are educational. For example, Zombieland is one of my favorite movies, and it offers plenty of good advice on how to stay alive during a zombie invasion. Army of Darkness, while not technically a zombie movie, is entertaining, but it doesn’t really teach you anything useful (unless you need to know if something is a trick and whether or not to get an axe).\"I don’t carry a cellphone, I refuse for many reasons, but when I did it was filled with sounds from Army of Darkness for every action it performed. I love Bruce Campbell! I agree with Jordan that zombie movies have a wide spectrum. If the zombies ever do take over I wonder how much of what we read and watch about them will be true?It was nice to see Jordan siphoned through the information available and prepared a scaled down version of what Jordan considered relevant information. I’m not sure many people could be that dedicated.\"As the kids are getting in the car, I give one of my booklets to Heather. She looks like she’s about ten years old, so I assume she can read.\"Thanks,\" she says. I hear her sister ask her what it is as she gets in the car. \"I think it’s a comic book,\" Heather says.\"Even though Jordan’s booklet turns out to be a bit incorrect, I’d love to see it made into a real comic book. I think a lot of people would buy it, maybe even distribute it at comic-con’s and the like. I loved how the author added in some of the facts at the end of the chapters. My only complaint would be is that I wish there had been more of them!\"A whole pile of maps flies out. Thank you again, Doris. I pick up the one on top and see that it’s a Cracker Barrel map. That won’t help. I have a mental image of a group of zombies sitting in rocking chairs playing checkers while waiting for their table at Cracker Barrel. I’ll take an order of the macaroni and brains, please.\"It’s funny. I have only been to a Cracker Barrel twice. Once in Oklahoma and again in Pennsylvania. My visit in Tulsa, Oklahoma went just fine, but when I visited the Pittsburgh, PA Cracker Barrel it was a different story.Everyone there looked like they were one step away from death. Either too obese for the seats, old enough to have known Hitler’s grandparents, or hacking into a tissue like they were spreading the plague. We stopped on the way to my father’s funeral and so the condition of the patrons really was not our first concern, perhaps it should’ve been.My significant other ordered the meatloaf which they promptly informed us they were out of. No big deal, he changed his order and we went on with our evening. Within twenty or so minutes paramedics descended on the Cracker Barrel. Someone had died. It was hard not to giggle, at least a little, when the waitress came to our table to let us know the dead man had received the last order of meatloaf.\"The van is waved through the gates, and we drive into a tunnel. This can’t be good. Tunnels are never good in zombie movies, where the government invariably has secret underground labs all ready for experimenting on zombies.\"The government is already experimenting on a ton of things we are told every day does not exist, why would this be a stretch? Jordan was right to be fearful of a place like this. I was surprised that he/she was cooperative at all. I know Jordan just wanted to save the world, but he/she had to know there were better ways than that. I’m really happy Jordan eventually figured that out.\"I was told there would be meat provided. I have seen no such meat.\"I would love to see anyone, government or not, lock up a pile of super hungry people and leave them un-fed, poked, and prodded over a period of hours/days/weeks. Did anyone watch what happened during Hurricane Katrina? Hungry people do not like to play!I think the story would have made a drastic turn if they had just fed the prisoners. YES, I called them prisoners! It is not like they were there voluntarily, and I didn’t see anyone offering to let them leave.\"The driver gets out of the car, and then someone else steps out of the passenger side. Both of them start to remove their clothes, showing their skin to the people with the guns. They must be checking for bite marks. Then it hits me that this town is a safe zone.\"Safe zone is another word for FEMA Camp. I think I’d rather take my chances with the zombies!\"I have given up any hope of returning to my human self. I know it’s not going to happen. I’m actually enjoying my zombie existence. It was a little rough in the beginning, but I have finally found my place.\"Jordan seemed more \"normal\" than most of the other characters in the story. Jordan also seemed the \"calmest\" and \"sanest\" of the bunch! I think I liked Jordan as both a human and a zombie, because the author did a really good job of keeping the character of Jordan consistent no matter what adversity arose.\"Everyone needs an obsession to pass the time, and mine just happens to be zombies. That doesn’t mean I’m crazy.\"I HIGHLY RECOMMEND this book!\n\n\nReview provided by DJ Harris (aka DJ6ual):\n1st Annual Zombie Fighter Jango's Zompoc Giveaway!ZFJ/Primal Punch/Jango/Cedric Nye says Hello!"}, {"userName": "Lori", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/369169-lori", "userReview": "J Cornell Michel played around with the whole zombie genre and really made it her own. I loved the narrator's voice! Our protag, Jordan, voluntarily lives in the nuthouse and obsesses over zombie culture. Jordan believes without a doubt that the world will end in the rotten clutches of the dead and openly fantasizes about being the one to save us all when it finally does.Though the book has a great sense of humor, about three quarters of the way through the whole thing started to wear on me a bit. It felt like it started to run on just a little too long. And admittedly, I was a mildly disappointed with where Michel took the book towards the end. Full review to come"}, {"userName": "Lucy Hayes", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/18779552-lucy-hayes", "userReview": "Great book! Quite possibly one of the best Zombie books I have ever read. Not gory or gross. Full of action and real solid storyline. The character of Jordan was relate-able and unexpected. There were surprises around every corner of this thriller! It is a must read, even if you are not a Zombie Apocalypse fan! I received this book for free because I was the winner of a First Reads giveaway on Goodreads, bt I would have gladly paid full price. It is a wonderful novel!"}, {"userName": "Patti", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/16427962-patti", "userReview": "[Jordan was a guy. (hide spoiler)]"}, {"userName": "Ian McClellan", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/10755809-ian-mcclellan", "userReview": "Loved this book. Not as brutal and gory as most of the zombie books I've read, but it really didn't need to be. Really funny at times, but more so in the beginning before things get serious. This book sets up all the traditional 'rules' of zombie literature and then knocks them down, including what exactly constitutes being a zombie. I suspect that, like myself, the author gets annoyed with the people that are hung up on what zombies 'have to' be and the way they 'have to' act. To me, the things that were different about this book were part of what made it great.The main character was fantastic and I loved that, in another of the book's breaks with tradition, you never found out his or her gender."}, {"userName": "Sarah", "userReviewDate": "Jun 07, 2013", "userURL": "http://www.goodreads.com/user/show/7407943-sarah", "userReview": "I loved it! Not a gory zombie book but funny at times and unique storyline. I liked the perspective of the main character throughout the novel - Jordan takes on several \"roles\" as you'll see :)"}, {"userName": "Poet Gentleness", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/14649015-poet-gentleness", "userReview": "This is not my genre, specially zombies. I dislike horror stories so much I have always been tempted to read Stephen King but never picked one of his books. I hate horror and gory, they give me nightmares. And life has enough of it, thanks.So, what the hell am I doing reading a Zombie book? Well, first of all my daughter said it looked nice, so I jumped in. What really interested me in this book was:1- Jordan is insane and voluntary lives in an asylum. 2- It was said it was not gory and it was very funny.Jordan's Brains: A Zombie Evolution is an easy reading. I went through it today, in a few hours. I did laugh out loud a few times and I cried in the end (what can I do? I cry easily.)But more than this, it has some very interesting passages, which got highlighted in my kindle.It is quite difficult to do this review without spoilers, but I'll try: Jordan is quite the compassionate, loving lunatic. Not exactly what people think a insane person is. In fact, apart from the character's obsession that the zombies are bringing the apocalypse, Jordan is completely inoffensive.Told in the first person POV, this book never, ever let you know what genre is Jordan. A Male or a Female? Sometimes, I was pretty sure Jordan was a female, in others that he was a male.It is pretty interesting to accompany the narrator as it never leaves a hint about his/her genre. I was obsessed in the end to discover that... you have to read the book. Just because of this, I would give a 5 star rating to the author's talent. It must be pretty difficult not to let it slips away.Then the first part of the book absolutely blew me off. I was speechless and that was not an easy thing to do. In hindsight, I am laughing more, because it should have been so obvious, but, damn! J. Cornell Michel did it. The author left my mouth hanging open as I was not waiting for the turn of events. And again another 5 star rating for that first part. Quick and fast paced, it was incredible.On the second part, I was in doubt. But I let the narrator guide me through the story. And although a few... hmm... not quite gory, but weird scenes popped here and there, well, it was not like Dark Places, from Gillian Flinn (Gory, horrible, not funny, depressive, sucked out my energy and I got nightmares for more than week). No. This was a nice gory (?)... More a mix between a comedy and a horror movie.What I loved more was the part of the interaction between Jordan and his family. It has some really intelligent and profound notes on how Jordan, the supposed lunatic, can see so clearly through people and diagnose them so easily. And, in the end, I am pretty sure this book has more to do with Jordan's relationships than with zombies."}, {"userName": "John Hennessy", "userReviewDate": "Jan 22, 2015", "userURL": "http://www.goodreads.com/user/show/6981944-john-hennessy", "userReview": "Jordan's Brains has been on my read list for too long, far too long, but like most things we apply patience to, they turn out to be well worth the wait. I hadn't read a zombie tale in about a year, and the trend seemed to be all very samey. Fortunately, the author has stayed away from the old zombie cliches, whilst giving us some rip roaring funny moments, that quite honestly, I never expected.J Cornell Michel has a real talent for surprise. There are many twists and turns in this story, and like I have said (without giving anything away which would spoil it) this is a fun zombie read with a heart - one which may be handed to you.It's also rather scary in parts, with 'Resident Evil' type jumps thrown in aplenty. That doesn't mean we really get used to them - the author weaves quite a bit of suspense into the tale and again, if you can see it coming, you're better than me.Whilst the story itself is good - and the sheer number of reviews on here have covered that already in depth, for me, the real star was the dialogue. It was funny on many occasions, always interesting, and always going somewhere. \"Do you remember anything about being a zombie?\"\"Yeah, but I don't want to talk about it.\"You could take that as funny, or poignant, but the book is choc-full of dialogue like this.\"If somebody wants cigarettes during the zombie apocalypse, then I should be the one to help.\"With more zombie action than you can possibly take a spade to, I recommend you give this book a try. I loved it. In fact, I would go as far as to say it is the best zombie-themed book I have ever read. Pop culture references that seem so forced in some other books I have read are brilliantly placed in this one. I saw Night of the Living Dead on tv - that was enough to scare me. I can't imagine seeing it on a big screen cinema!I'm off to find a blue t-shirt with 'This is What A Zombie Looks Like\". Then I think I'll re-read this book. In short, if anyone recommends this book or indeed this author to you, get it and read it quick. I absolutely loved it."}, {"userName": "Edward Wolfe", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/18779163-edward-wolfe", "userReview": "Best New Author of 2013(The title above is just my opinion. I don't know if this book has won awards or not. It should.)I used to primarily read books by big names authors such as Lee Child, Stephen King, J.D. Robb, etc. But this year I've been reading a lot of books on Amazon from new authors; fresh voices. Every once in a while I find a book that is unique, well-written and takes me on a ride away from reality for a while just like the authors I know and love. Jordan's Brains is one of those books.From the very beginning, I slipped into the narrative like a boat flowing down a swiftly but smoothly flowing river. I could hear the protagonist talking. (And in my head, she's a female, although she's not identified as such in the book, so read it however you prefer. The author leaves it up to you, and nothing in the story will contradict your choice.)I've seen almost every zombie movie ever made, but I've never read a zombie book before and didn't think I ever would. The movies are fun to watch, but usually a bit campy and funny, even when they don't intend to be. I think The Walking Dead (which started out as something new and impressive in the zombie world) has been stagnant for the last season and a half, but for whatever reason, I can't *not* watch. But zombie books? I just never saw the point in it. I would imagine they're like a typical post-apocalypse story with scenes of graphic undead encounters here and there.I don't know, and I won't really know until I read another one, because Jordan's Brains is unlike any zombie tale I've ever watched, or heard about. (Reviews from zombie book readers concur that it's completely unique.) I'll never write a spoiler in a review and many things are spoilers whether people think they are or not, but I don't think you want me to tell you what the story is about. You already read the description. What you want to know is if the book is good or not. Maybe you want to know *how* good it is.This book is awesome. I loved it. It was an unexpected delightful surprise and the next zombie book I'll be reading is the next one J. Cornell Mitchel writes.It probably wasn't intended, but to me, the main character was adorable. She's not mentally well, but her illness is not readily apparent. She has a form of normalized insanity that's almost endearing. She's so good-hearted that she doesn't see the obvious when someone is about to do something bad to her. She always interprets the actions of others to be just as good-willed as her own are. When she's being robbed, she thinks the robbers just want to share, just as she would. She's naive, but she's resourceful and intelligent. But she lacks the ability to see the world the way everyone else does. Her skewed perception of the world and her beliefs are solely hers and she fails to understand why everyone else doesn't think the way she does. Her illness causes her to consider some things normal that no one else would and this is one of the things that had me laughing out loud multiple times as I read this book.This is one of the few books that I read this year that had me reading while walking down the hall at work, going to bed later than planned, telling myself, \"just one more chapter, then I'll stop,\" and telling anyone near me that they have to read this book.Very original and very entertaining. A terrific debut effort from an author I'm absolutely sure we'll be hearing more about - especially if this book makes it to the big screen *where it belongs* as a really refreshing entry to the zombie lore we've become so enamored with lately.If you like to tune out the world and get lost in a story, laugh out loud and constantly be surprised by the twists and turns of a well-written story, get this book - you'll be glad you did.The Kindle version is only a buck. You can spare that with ease and it'll be a well-spent dollar. But if you get the paperback, you can loan it to your best friend when you're done, and you can read it again when they give it back. :)Great book, J. Cornell Michel! Please write more."}, {"userName": "Heather", "userReviewDate": "Aug 13, 2013", "userURL": "http://www.goodreads.com/user/show/1438185-heather", "userReview": "I loved this book! The hero, or heroine because you're never told the gender, is so very atypical it's delightedly refreshing.Jordan lives in a mental hospital, an asylum. He/She is obsessed with zombies and has been since childhood, much to the chagrin of his/her family. Zombie apoc drills are run, especially when medication is not taken. Everyone tells Jordan to stop living in a fantasy and accept that zombies don't exist, and never will. Then, two years after the last drill, it happens. Zombies walk.There's not much more I can tell of the story without giving away major plot lines, and I'd rather not ruin it for others. Throughout the novel Jordan is most assuredly not your normal hero/protagonist. Even when things don't go his way I found myself rooting for him and loving him just the same. He's endearing and no matter what holds on to his humanity and compassion.I was pleased with how the author handles the process of the infection itself. It made it seem very plausible in today's world with things the way they are now, and that made it a bit eerie. Nicely done."}, {"userName": "Michael Garza", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/23233234-michael-garza", "userReview": "This is not your average zombie tale. Jordan has prepared his/her (I'll get to that later) entire life for the zombie apocalypse and when it finally comes (kind of) Jordan's residence is a mental hospital. There are plenty of zombies to keep the fan base happy but the true measure of this book is Jordan's mental disorder. It is difficult at times to understand what is going on in Jordan's reality and what is simply apart of his/her disease. This was frustrating for me at first but I soon began to enjoy it as a unique part of the story I don't think I've ever come across.J. Cornell Michel has a wonderful way of weaving humor into the story. There were more laugh out loud moments than I can remember and that alone is worth a look from those no into the zombie craze. J. Cornell Michel created a uniquely interesting lead character in Jordan, one I found myself cheering for by the end."}, {"userName": "David Lucchesi", "userReviewDate": "Jul 07, 2013", "userURL": "http://www.goodreads.com/user/show/21169180-david-lucchesi", "userReview": "really liked this one. it took me forever to get thru 'cause my roomie took her eReader away, but my auntie came to the rescue with a hard copy of the bk. it isn't lk a normal blood and guts gore zombie story. instead its more of a story about Jordan and his failures and triumphs. it was a great read and i would recommend it even to ppl who don't like zombie stuff.havin' a main character that was \"crazy\" was a cool idea. that seems to be a theme in the bks ive been reading lately. i'd like 2 know what kinda psych hospital lets their patients roam the streets that freely. i'll go there on my next break-down! i liked the bk more when Jordan was a make-shift hero than a zombie but both parts were cool. lots of twists and turns.i didn't not like anything in this bk. it had a good story and strong characters. hope others will check it out!"}, {"userName": "Shana Festa", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "I received this book for free in exchange for an honest review. The opinion in this review is unbiased and reflects my honest judgment of the book. Jordan is a normal, everyday girl with a big heart and the desire to help people whenever she sees an opportunity. The only problem...Jordan is BSC (Bat $hit Crazy) and resides in a Maryland psychiatric hospital. Jordan is voracious in her belief that zombies exist and a widespread outbreak is inevitable. She has spent years researching and planning, and even wrote a helpful guide to pass out to survivors of the outbreak when it happens.To keep her skills sharp, Jordan performs intense drills to get her family to safety; mapping out and testing the best routes to get to her mother in Florida and being a good Samaritan along the way while peddling Jordan's Zombie Booklets.Alas, poor Jordan is bitten, shattering her fantasy of saving the world. But she quickly realizes everything she thought she knew about the zombies was bunk, and her booklets rendered useless. Jordan's Brain gives readers a fresh take on the genre as Jordan tells her story from both the human and zombie perspective.Jordan's character is skillfully crafted into one of the most rounded and intriguing personalities this reader has come across. She shows a childlike vulnerability that stems from shouldering the burden of self-blame over her father's death. Her quirky sense of humor shines through with what results in some seriously funny dialogue.“Middle Child Syndrome,” I say with a straight face.“Really? That’s odd. I didn’t know that was a real disorder.” This guy has no idea that I’m kidding. People assume that I don’t have a sense of humor just because I’m a little crazy.“Oh, sure, Middle Child Syndrome is quite common,” I continue. “It’s a very serious problem, and it should be treated immediately when symptoms arise.”“What are the symptoms?”“Jealousy, rage, severe headaches, hysteria, seizures, and pink eye.”The easy flow of the story was intensified by the first person narration. The author did an excellent job of keeping the story from becoming cliche, and instead used the main character's mental illness to write something original and unusual. Jordan's brain is anything but predictable. My only gripe is that while the main character is written so beautifully, the secondary characters are superficial and not very realistic. Take, for example, her brother Taylor. Taylor is a police officer and there was a missed opportunity to show the two of them fighting side by side to save those in danger. Instead, while Jordan plays hero he tucks tail and runs, giving no thought to the safety and well-being of those he was sworn to protect. I also think the cover doesn't give this book the justice it deserves. It could benefit from a makeover.Jordan's Brain is a provocative work of fiction that kept this reader questioning every situation and whether it was reality or just another manifestation of her delusion. Do zombies really exist or is she just a gun toting loonie turned cannibal on a killing spree. This outside the box work of fiction has earned a place on this readers permanent bookshelf and won't soon be forgotten."}, {"userName": "T.R. Horne", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/22708284-t-r-horne", "userReview": "The main character Jordan (whom we don't know is a boy or girl), is a young person that is living in a psychiatric home when the \"zombie apocalypse\" occurs. He (for lack of better terms) has planned and waited for this day and is all too pleased to finally show that he has been right all along about the impending doom of the world. Jordan takes to the streets, saving those who he/she thinks is in need and slays a few zombies in the process, until something unexpected happens and changes his story from one of savior to one of monster. Albeit, sympathetic and still grasping on to his humanity, he finds out more about the world and the infection that's swept the nation. I really enjoyed this book! It was written in first person POV and really helped the reader feel like they knew Jordan with his quirky thoughts and dry humor. I tried my best to find out little hints of whether Jordan was a girl or boy but I settled into thinking it was a boy by the end of the book. I like how J. Cornell Michel made that a fun twist to the novel. If I could give the book 4.5 stars I would. I like that the author did not stray from character at all the entire book. The character sounded young, optimistic, slightly off and one track minded...which was what the author was going for, I assume. I only took a half star away because I missed some of Jordan's personal feelings on some things that I was yearning to know more about how he felt, rather than only dwelling in what actually happened. Ironically, he came alive and had more feeling towards the end of the book when things got really sad and confusing for him. I held back tears at the end and really dreaded finding out what happened...but I did. This book is an amazing read for someone that wants to get inside the mind of a slightly crazy, zombie addict during the zombie apocalypse. It's a great story and full of twists and turns that will keep the pages floating by. I must add that the print copy was amazingly put together and I enjoyed it probably more than I would on the e-book (which I purchased). Overall, I recommend this book to all zombie lovers that don't want to be stuck to the same ole zombie stories and even readers that want to find a new niche. You won't be disappointed! - T.R. Horne, author of Breaking Mobius and Crazy Dirty Love, blogger/reviewer at www.ragingbookreviews.wordpress.com"}, {"userName": "Tammy K.", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/4626742-tammy-k", "userReview": "Entertaining, thought-provoking, fresh characters.This zombies apocalypse story stands out the most for it's main character Jordan.Burdened with a mental health condition which blurs reality and delusions, Jordan tries to cope to the best of his/her ability with a positive attitude as he/she attempts to decipher fact from fantasy.The story is told through the eyes of Jordan during his/her delusions and brief moments of clarity. This unique perspective added equal parts excitement and confusion to my reading experience. Quite frankly, there were times that I had to stop and think about what I just read.The story was broken into two parts with a two year unexplained gap between the parts. It was tempting to stop reading at the end of the first part, but had I done so than I would have missed the better of the two stories. This is a story that grows on you as you read it. By the time I reached the end of the book, I had become rather attached to Jordan and his/her world.There is one other notable aspect to this book, the gender of Jordan was not disclosed.I tried my very best to pretend it did not matter, but it stuck in my mind and would not rest the whole book. It was for this reason that I did not give this book five stars. I found this approach to be an unnecessary distraction which drew me out of the story as I tried to work out that worrisome worm. When I read a book, my mind envisions the world and characters of that book. Without a description of the main character Jordan, I might as well have been trying to paint with water because nothing stuck.Overall this was a good read and one worthy of your time and effort. I have a strong feeling that Jordan's Brain will be stuck in my brain for some time to come."}, {"userName": "Jeff Dawson", "userReviewDate": "Nov 07, 2013", "userURL": "http://www.goodreads.com/user/show/5163904-jeff-dawson", "userReview": "This is a whole new concept on the Zombie Apocalypse. Instead of focusing on the killing of zombies or taking the world back, we get to see the apocalypse through the eyes of a Zombie. That, in its self, is worth three stars for originality. Our heroine/hero, yes, we’re not told what sex the main character is, has spent a lifetime preparing for the war she/he knows is coming. The obsession has he/she placed in a mental facility for their own safety, until “Dawn of the Dead” becomes a reality. Despite all the training and research, Jordan is bit and becomes one the walking dead. Now comes the fun. All of the unanswered questions regarding what human flesh tastes like, the soul of a zombie and their mental capacity are revealed. Very refreshing.The only con was towards the end when Jordan siphons gas from cars. All through the book, the author avoids repetitive, unnecessary dialog until now. I found it a bit redundant to keep informing the reader how to siphon the liquid. I believe fifty percent could be eliminated without upsetting the scene.Finally, I had no problem believe Jordan to be a girl. Something in the characters speech/thought patterns were the keys for me. Now, that was really cool. For me, it wasn’t important to know the sex of the character. The story is that well written. Overall, this is a great read for Zombie/YA fans looking for a new perspective on the topic.Four stars"}, {"userName": "Angie", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/19184609-angie", "userReview": "From start to finish I loved everything about this book. Jordan, who I think is a guy, was entertaining as well. I loved his inner monologues of people, and I wish more of his zombie survival guide had been included.This is also the first book I've ever read that lets you know how things are from the zombies point of view. That was cool, bloody and gory but definitely cool. Jordan, who practiced for his zombie apocalypse a lot, found things weren't actually like his favourite books and films, but in the end despite it all, still could enjoy land of the Dead on tv. Brilliant!"}, {"userName": "Michelle", "userReviewDate": "Oct 17, 2013", "userURL": "http://www.goodreads.com/user/show/2383751-michelle", "userReview": "I was intrigued by the blurb, a psychiatric patient who is preparing for a zombie apocalypse. It sounded like a novel take on the zombie genre, and it was.Jordan's Brains was faced paced and held my interest throughout. I like how the gender of the main character is never revealed, although I have my suspicions. The author did a great job of 'humanizing' the zombies. I felt some sympathy for them, even as they were taking bites out of humans. I also love how the author emphasized strong family bonds.I'd describe this as an action packed, fun read, with heart."}, {"userName": "Randy Harmelink", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/2029520-randy-harmelink", "userReview": "A totally new and strange way to view a zombie apocalypse. From the viewpoint of a sometimes delusional zombie expert that lives in a mental hospital. And then we get to follow the main character as a zombie. Or do we? Not only that, but the story is written in a very clever way, so that the gender of the main character is never confirmed. You can choose whichever gender you prefer.Never boring, I found it an easy book to read. The pages practically turned themselves."}, {"userName": "EmmiK", "userReviewDate": "Mar 23, 2016", "userURL": "http://www.goodreads.com/user/show/34437178-emmik", "userReview": "$2.99 Well spent.Goodreads just ate up my Loooong review. UGH.Let's just say this was AMAZING. I will definitely read it again."}, {"userName": "Anna Tyler", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/38635469-anna-tyler", "userReview": "This was a really interesting perspective on a zombie story. It starts out with it being told from a survivalist perspective of a friendly psychopath and then transforms into them becoming a zombie that is not actually dead. I don't want to give away any spoilers so I will say this: they are not dead, but they still are zombies. What a twist as said by one of my favorite directors."}, {"userName": "A.S. Thompson", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/9124222-a-s-thompson", "userReview": "I would like to start this review by saying that I loved this book! And that is important because I watch all things zombie, but I've never been the hugest fan of \"evolved\" zombies- that is, thinkers, weapon handlers or ones who fall in love. My preference is for fast or slow zombies who crave flesh.That being said, I can't count the number of times I laughed out loud, found myself relating to people and situations, and was surprised by the twists in Jordan's Brains. It is definitely not your typical zombie tale! J. Cornell Michel did an outstanding job getting, keeping and holding my interest. I found myself invested in characters and even rooting for \"the bad guys.\"Now for the story...Jordan's Brains is told in the first person of Jordan, a mental patient, who has been waiting anxiously to play a part in the zombie apocalypse. When it finally comes, Jordan is ready, or at least thinks so, despite the character's assumptions and \"knowledge\" of zombies.Jordan was a really fun, unique character to be in the mind of. I even found myself identifying with Jordan's selflessness, courage, (and admittedly) Jordan's twisted sense of humor. For example, Jordan's mental condition is often times used as an icebreaker or as a joke with complete strangers, who naturally get a little freaked out and withdraw nervously. Then there's the always-upbeat Jordan who takes everything in stride and is always looking to help others- often times to a fault.When the story takes off, it doesn't slow down. Jordan's east coast journey is filled with hope, devastation, resolve and will to survive and thrive (in more ways than you might think). With each page I learned more about Jordan's mental state, and to be honest I didn't know what was real and what might be made up- I had my suspicions, but I won't say whether I was right or wrong- in any case, kudos to Michel for creating the suspense and uncertainty. These days, it's not easy to keep an audience guessing, but the way Michel writes and describes situations gives the reader possibilities to choose wether the events are actually happening or are taking place in Jordan's mind.The last point I will address is Jordan's sex. Purposefully, the reader never learns whether Jordan is male or female, but as you will discover for yourself, it doesn't matter. I say that because in my opinion, it is about Jordan's personality, ideology, morality and mentality. As Michel points out in the end, it is up to us to decide if Jordan is a man or woman.To sum it up, I thoroughly enjoyed this book and would highly recommend it to anyone looking for a fresh read. Michel, if you're reading this, I am very impressed by your ability to create scenes, characters and drama. More than a few times I found myself shocked when the story went a completely opposite direction than I anticipated. I think that your \"tweak\" on the zombie genre is not only fitting and refreshing, but gives a unique and new perspective to it. Great job and I'm looking forward to your next work!"}, {"userName": "Thom Shepard", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/5166612-thom-shepard", "userReview": "Though zombies are more popular than ever, even die-hard horror fans tend to relegate them to secondary status. They aren't sexy or romantic like vampires nor tragic figures like the Frankenstein monster or the Fly. Never mind that these flesh-eating creatures were ever human beings who once loved and were loved. Now they are just mindless eating machines, right?Well, books like J. Cornell Michel's Jordan's Brains: A Zombie Evolution challenge this notion.Michel's book is an unpretentious joyride between two worlds. And while it contains many, many deaths, the violence is summarized rather than grossly described. This fits perfectly with Michel's uncluttered narrative voice. Readers will absolutely root for this charming protagonist. Even within the most horrifying circumstances, Jordan's innate goodness shines through. Both an idealistic young person and a clever tactician, our guide through this zombie apocalypse performs many brave -- and occasionally naïve -- acts of kindness in a quest to reunite with family members. To provide more specifics runs the risk of spoiling some mind-blowing plot twists along its way to a shattering conclusion.But Jordan's Brains is much more than just another enjoyable beach read. It also contains many intriguing literary qualities, including the playful use of the unreliable narrator (Jordan's early assumptions about certain characteristics of zombies turn out to be somewhat inaccurate), as well as the author's unusual but ultimately perfect decision to leave the gender of Jordan to the reader's imagination. Best of all are the many brief but vivid descriptive passages that play in Jordan's brain like haiku or snippets of song. For example:Bloody zombie, huge arms, heading in my direction, no shirt, bloodshot eyes, heading in my direction.Overall, Jordan's Brains is a great summer feast, and I gobbled it down in just a few satisfying sittings. I found it to be a gutsy zombie book with plenty of heart that also tickled my funny bone, and I will never again watch The Walking Dead without wondering whether zombies can remember anything about their past and how they might see their world now."}, {"userName": "Badseedgirl", "userReviewDate": "Dec 16, 2013", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "Per FTC guidelines this review for Jordan’s Brains: A Zombie Evolution by J. Cornell Michel for a book received for free in a Goodreads.com First Read Giveaway.J Cornell Michel’s Jordan’s Brains is not like your typical zombie novel. The main character Jordan is convinced that a zombie outbreak is inevitable. Jordan is also self-committed to a psychiatric hospital. So for the first part of the novel Jordan is trying to get to his/her mother in Florida from his/her home in Maryland through a zombie outbreak, when he/she gets to Florida, the reader realizes things are not as they seem.The author never indicates if the main character is male or female, but I guess for sexist reasons, I always assumed Jordan was a male. But if Jordan had been female, it would have made the scene with the older Christian Scientist make more sense. I always wondered why she would bring a strange man to her home with her sick husband. This was an extremely well written novel. I could not wait to get to the end to see how Jordan does. The scenes in the medical testing facility and the safe zone definitely made this novel unique. The author is able convey the violence of the zombies without excessive bloody chunks and spilling intestines. That is refreshing for the genre. I appreciate a different view of the zombie apocalypse, and Jordan’s Brains provided it. I have already recommended this novel to someone and would do so again."}, {"userName": "Omnipotent Dystopian Now", "userReviewDate": "Jul 18, 2013", "userURL": "http://www.goodreads.com/user/show/11190982-omnipotent-dystopian-now", "userReview": "What I enjoy most about this story is the way that Jordan is constantly dropping subtle one-liners that I found to be quite funny. I've never read anything quite like Jordan's Brains, and I have to say that it is very unique. I can't say very much about the plot without giving the surprises away. Just imagine what it would be like to be a zombie. I'm still trying to figure out if/how a zombie poops. That's always been the toughest part for me to rationalize. They eat, so they must poop, right? Maybe poop just putters out of them like how a deer does or something. Maybe it's weird that I'm even wondering about how a zombie poops. Anyway, I also like the way the author examines the psychological aspect of having empathy for zombies. After all, they're not so different than the humans. Aaaaaaaaarrrrhhhhhhhhaaaahhhhh!!!"}, {"userName": "Johney Brown", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/24314326-johney-brown", "userReview": "ZOMBIES ARE PEOPLE TOO!!! I highly recommend this book for a very entertaining read! The twist & turns will keep you guessing and take you on a roller-coaster ride through the zombie apocalypse as experienced by a psychotic mental patient: Jordan.Jordan has prepared for a zombie apocalypse for years: running drills, creating a rule book for survival and stashing supplies in a bug-out bag. Suddenly the day arrives when Jordan must put the preparations to the test. Jordan sets off to save family, and the rest of humanity, but is surprised when things don't go as planned.I don't want to give too much away so you will just have to read it for yourself. :)This book is so much fun and a truly refreshing take on the zombie phenomenon!GET THIS BOOK-you won't know what your missing till you do."}, {"userName": "Kimberly", "userReviewDate": "Dec 26, 2013", "userURL": "http://www.goodreads.com/user/show/12871174-kimberly", "userReview": "Jordan's Brains *possible spoilers*I'm not usually a fan of inner zombie monologues and people-turned-zombie stories in general, but Jordan, the main character, was just so darn likeable. Jordan had a dream, to see the zombie apocalypse come to life. And he gets exactly that. But after just a short time, Jordan, our loveable crazy guy, gets turned into a zombie. Like I said, not normally a fan of the downside of the story...it usually just takes too much away from the the horror aspect of it, but Jordan was entertaining enough to get me through the zombie portion. A decent read, would read it again as a quick summer read.And as for what the author said at the end about Jordan's gender, Jordan was male in my mind."}, {"userName": "Netanella", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/1157679-netanella", "userReview": "I loved this book - even if it fooled me in the beginning and I followed right along with Jordan's delusions!Jordan is our slightly-off protagonist who enjoys telling people s/he lives in psychiatric ward. And Jordan's been preparing for the zombie apocalypse forever and a day, so when it really, truly comes, Jordan is prepared.This is not your typical zombie book, and our hero Jordan is not your typical zombie slayer. Rather, Jordan's experiences throughout this book - from hero to zombie and back again - are exhilarating and fun. I truly enjoyed Jordan as a zombie, leading the pack, caring for his people, using zombie movie plotlines to plan strategies. Most excellent, as Ted would say, and recommended."}, {"userName": "Kacennnka", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/5074871-kacennnka", "userReview": "Překvapivě dobrý příběh. Bláznivý, postavený na hlavu, nereálný... Ale taky vtipný, čtivý, zajímavý a originální. Jordan je specifický charakter, neskutečný smaritán, optimista, blázen do zombíků a obyvatel psychiatrické léčebny. (A přestože o něm mluvím jako o klukovi, pohlaví Jordana nikdy není odhaleno. Záleží na čtenáři, jak se sám rozhodne.) V celém přibehu byl nespočet zvratů a vývoj událostí jsem si takhle úplně nepředstavovala, takže mě to v mnoha ohledech překvapilo. A být v kůži zombíka je možná trochu náročné na žaludek, ale rozhodně sranda. Tuhle knihu doporučuju, první zombie kniha, co mě opravdu bavila. :)"}], "description": "Jordan is a kindhearted zombie expert who voluntarily lives at a psychiatric hospital. Having prepared for the zombie apocalypse since childhood, Jordan is thrilled when hordes of the infected undead finally invade. With a bug-out bag and a confident grin, Jordan leaves the safety of the psychiatric hospital and wanders alone into zombie infested streets to rescue family and strangers alike. Everything seems perfect until Jordan's loved ones start dying, and Jordan has to face the harsh reality that the zombie apocalypse isn't going according to plan.", "title": "Jordan's Brains: A Zombie Evolution", "url": "http://www.goodreads.com/book/show/17994284-jordan-s-brains", "average": 4.02, "cover": "https://images.gr-assets.com/books/1369881627l/17994284.jpg", "reviews": 38, "authors": [{"url": "https://www.goodreads.com/author/show/7110072.J_Cornell_Michel", "name": "J. Cornell Michel"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/17994284-jordan-s-brains", "http://www.goodreads.com/book/show/18075658-jordan-s-brains", "http://www.goodreads.com/book/show/25426178-where-s-my-dinner", "http://www.goodreads.com/book/show/23525649-twas-the-bite-before-christmas", "http://www.goodreads.com/book/show/22547795-zombie-zeitgeist", "http://www.goodreads.com/book/show/25277318-a-picture-is-worth-1-000-words"]}