{"ratings": 6780, "userreviews": [{"userName": "Abigail Larsen", "userReviewDate": "May 05, 2012", "userURL": "http://www.goodreads.com/user/show/6561878-abigail-larsen", "userReview": "Meet Marguerite Henry, one of my favorite childhood authors. Why? Because all the stories I read by her were about horses, and like most young girls, I was horse crazy. Justin Morgan Had a Horse was her only chapter book that I remember reading through three times. I recommend it to all fellow horse-lovers out there. The true account (with a fictional twist) of how the popular breed Morgan came to be in the late eighteenth century, you’ll find it inspiring and fun.It all begins in 1791 when likable school teacher Justin Morgan accepts Little Bub, a scrawny colt, as payment for a debt owed him. Feeling he is stuck with the short end of the stick, Justin doesn’t see much potential for Little Bub. But he hands him over to Joel, an eager young student, as a project. It is Joel who discovers the unique, strong, and soon-to-be-famous horse he has the privilege of training. Turns out Little Bub isn’t so little; he’s a colt the world will not soon forget. Enjoy the exciting story of this obscure horse turned celebrity and get a history lesson while you’re at it. You’ll never look at Morgans quite the same way after you understand their memorable ancestor: Little Bub.Recommended read-aloud age: all agesRecommended read-alone age: 8 and upMy blog: www.oursureanchor.com"}, {"userName": "Manybooks", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/2970379-manybooks", "userReview": "Although I do indeed very much appreciate Marguerite Henry's Justin Morgan had a Horse as a story (the sweet and loving connection between Joel and Little Bub which not only endures but grows stronger and stronger over the years, and that it is young Joel who first notices there is something extraordinary and truly special about Justin Morgan's horse), and believe that the main message presented is necessary and of both historical and contemporary significance and value (namely that one should not judge a horse either by its perceived lack of a pedigree or by its stature, its physical appearance and size), I am actually also somewhat disappointed with this novel (even though Justin Morgan Had a Horse is considered a classic and won a Newbery Honour designation for the author). But unlike Marguerite Henry's Misty of Chincoteague series or her brilliant and evocative King of the Wind, I actually never did manage to feel all that fully and personally involved in Justin Morgan had a Horse and in the antics and exploits of Little Bub (to the point of distraction, to the point of even skimming entire chapters that just did not seem all that interesting). Still recommended, but definitely not that good a fit for me personally (I guess all the Americana and patriotism, although historical and thus of course even understandable, does not entirely, totally endear me to Justin Morgan had a Horse either, as I have never been all that into nationalism, finding it more often than not tedious, even at times politically and culturally distasteful, not to mention potentially if not inherently dangerous).Now the version of Justin Morgan Had a Horse I have just read and reviewed (and also the one most commonly available and in current print) is the expanded 1954 edition, which would thus obviously NOT be the 1945 first edition of Justin Morgan had a Horse that won the 1946 Newbery Honour designation. And while I do wonder whether I might like the original first edition more (and often rather enjoy comparing and contrasting older and newer editions), our local library only has the expanded edition; and even ILL could not manage to locate the older unexpanded edition of Justin Morgan Had a Horse free of charge. And I do not at present really want to take the chance of trying to purchase a copy of the original 1945 Justin Morgan had a Horse novel online, as this could prove expensive, I already have far too many children's literature books inhabiting both my shelves and my floor, and I have in the past purchased used books online deemed so-called first editions only to find out that they were not first editions after all (so I will and gladly refrain for the time being, unless or until I am able locate a used and above all inexpensive version of the original 1945 Newbery Honour winning novel at one of the local used bookstores we sometimes frequent). Sure is a bit disappointing and misleading though, since this 1954 edition of Justin Morgan Had a Horse does not in any manner indicate that it has been expanded from the first edition and also clearly features the Newbery Honour designation on its cover (which at best, is only partially correct)."}, {"userName": "Cheryl", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/3498889-cheryl", "userReview": "I just reread (?) the 1954 edition and it was *not* the book I remembered. So, maybe when I was a child I was fortunate enough to read the original 1945 edition, the one that is about 1/2 the length the more available one? Maybe I focused on what I saw as the strengths of the book, based on my enjoyment of other books by Henry & Dennis? I am going to try to find an original to compare the two for myself. I'd be willing to bet the older is better. Even the artwork of this newer book seems coarser, more hurried.And the publisher lies! The back flap claims that 1947's *Misty* is Henry's first book for children, and still puts the (1946) silver sticker on the front cover of JMH!"}, {"userName": "Squire", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/15986821-squire", "userReview": "Another Newberry Honor book by Marguerite Henry. I'm not a horse person. But I'm quite taken by Henry's horse stories. One of the things that impresses me about Henry is that all her stories are based on true stories and the amount research she does to write them is tremendous. And it shows in the final product. The illustrations of Wesley Dennis add another level of enjoyment to her stories. Here she relates the story of the the runty colt that grew up to become his own breed and the boy who believed and loved him. It starts in the mountains of Vermont and goes through the War of 1812. Exhilarating and suspenseful with lovable characters, this one turns out to be an endearing piece of historic Americana as President James Monroe makes an appearance in the finale of the book. And the journey of \"Lil' Bub\" turns out to be allegorical to the American experience. A true masterpiece of children's literature.I missed this one when I was growing up, but it never really fit into my reading interests as a youngster. Reading it as 51 has been a revelation to say the least."}, {"userName": "Abigail Wallace", "userReviewDate": "Jul 15, 2014", "userURL": "http://www.goodreads.com/user/show/12492068-abigail-wallace", "userReview": "I never was a horse crazy girl, but I loved Misty of Chincoteague even still. MISTY is Marguerite Henry's best known horse novel. When I stumbled over this one last month, looking for a good read aloud for my 7 and 9 year old sons, it was a no-brainer! With the high drama of horse, his boy and their nation coming of age, not to mention thrilling horseraces and backbreaking hard work complete with both heartache and happy endings, JUSTIN MORGAN did not disappoint! All that in 170 pages. JUSTIN MORGAN held the attention of both sons (and their mom and dad). It taught us all a thing or two about the makings of true greatness, too. We finished the book the week of July 4th, so my patriotism was already kindled. Regardless, JUSTIN MORGAN will make you proud(er) to be an American. From the author's forward: \"This is the story of a common, ordinary little horse who turned out to be the father or a famous family of American horses... Even in his own lifetime he became an American legend. He labored hard all day, and then at sundown, when he should have been fed and bedded down for the night, he took part in races and pulling bees...Today his descendants, known as Morgan horses, are renowned throughout the world. Yet nobody knows whether that first Morgan's parents were British or French or Dutch. And nobody really cares...He's just like us. He's American.\""}, {"userName": "Tarissa", "userReviewDate": "Feb 02, 2010", "userURL": "http://www.goodreads.com/user/show/2630602-tarissa", "userReview": "If you went to Vermont, back in the time of the late 1700s... you would meet Justin Morgan. He was a man who had a problem. It all started because a farmer owed Justin some money. The farmer couldn't pay the debt, so instead, he gave a horse. To some people, that would be a wonderful thing to receive, but Justin didn't need a horse. He needed money. One might say, \"Sell the horse\"--but that's just the problem. No one wants to use their money on a small, (VERY small), scrawny animal, who is weak and cannot work like other horses. Since no one will buy poor Little Bub, Justin is indeed stuck with him. See what can happen that turns this story upside-down when Justin Morgan's friend decides to help out. Why, even President Monroe takes notice! This book tells a true story. I liked the book because while I was reading it, I knew that it actually happened. In fact, Little Bub's tale became an American legend. This is a delightful horse story, great for boys & girls to read (ages 9 and up)."}, {"userName": "Sheila ", "userReviewDate": "Jun 27, 2012", "userURL": "http://www.goodreads.com/user/show/774914-sheila", "userReview": "A wonderful, touching horse story that I somehow missed reading in my preteen and early teen horse loving years. The relationship between Joel and Lil Bub was very special, and this book was all the more enjoyable because it is basically a true story about the horse that founded the Morgan horse breed."}, {"userName": "Sarah", "userReviewDate": "Feb 06, 2014", "userURL": "http://www.goodreads.com/user/show/369801-sarah", "userReview": "We read this book as part of our American History studies this year. It takes place just after the Revolution and covers several more years on past the War of 1812. My kids really enjoyed it but then we haven't read a Marguerite Henry book that they didn't love."}, {"userName": "Amy", "userReviewDate": "Oct 03, 2015", "userURL": "http://www.goodreads.com/user/show/8231627-amy", "userReview": "My oldest just LOVED this title! :)"}, {"userName": "Michael Fitzgerald", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/151004-michael-fitzgerald", "userReview": "This is the original 1945 edition (89 pages). This version (not the expanded rewrite from 1954) was the Newbery honor book. The illustrations are well done, and they suit the book perfectly."}, {"userName": "Jenny", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/1366775-jenny", "userReview": "I liked but didn't love this story. I appreciated Joel's concern, love and dedication toward Little Bub. The story was interesting but didn't fully draw me in."}, {"userName": "Karol", "userReviewDate": "Aug 09, 2016", "userURL": "http://www.goodreads.com/user/show/290438-karol", "userReview": "I loved the story of one young man's devotion to both Justin Morgan and his remarkable horse."}, {"userName": "Leah Markum", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/41224003-leah-markum", "userReview": "Little Bub, Justin Morgan's horse, knows how to make a statement. From the first whinny in chapter one as a \"too small\" colt to the \"deep snorty rumble\" he obliges to President Monroe at the peak of the horse's fame, he frames the history of the first of the Morgan breed in style.Justin Morgan Had a Horse depicts the real story of how the Morgan breed came to be. It hauls logs, pulls carriages, out races Thoroughbreds on the 1/2 mile, possesses a sweet disposition and calm manner, and packs all those characteristics into a tiny body that originally no one thought would be worth any money. Marguerite Henry consults with many historians, surviving relatives of some of her book's characters, and many history books to make her horse stories as authentic as possible. That and great story telling makes all of her books fascinating reads.The narrative follows Joel Goss, initially a ten-year-old boy joining his teacher, Justin Morgan, on a peregrination to Massachusetts. Morgan has debts to repay, and he was hoping a friend that owed him had the money. Instead Morgan and Joel leave with one colt...wait, it seems the friend saw Joel eyeing the other colt, so the friend left the gait open and...two colts. Joel and Little Bub begin their story.Morgan can't find anyone willing to buy such a small creature and had Joel gentle and train him. Joel aims to buy Little Bub one day, but in the meanwhile a novel passes. Little Bub grows in fame. He's able to do everything one can expect from a horse, and then some. Size doesn't matter. However, money does and Joel has to keep saving.I love Henry's books for many reasons: the horses, the history, the friendliness of the people, and the bond between the main human character and the main equine character. Joel wants a life filled with love and horses, and he's willing to find a way to make that happen even though his father forces him to sign on as an apprentice to the town's inn and sawmill owner. Little Bub gets rented and owned all over, competes all over, but Joel finds a way to accompany him. I imagine those movies where bad things happen to the animals--and even though this rarely happens in Henry's books--I feel like Joel is a projection of myself, and assuring the safety of the horse everywhere he goes.I'm amazed how long-lived Little Bub was. The book runs from around 1794 to maybe 1815--the book is vague at some points, but shows official dates at others. Little Bub was put to work almost immediately--trained over his first winter in Vermont, and logging by summer. So he couldn't have been as tiny as the earliest chapters make him sound, which was perhaps a yearling. I'm going to suppose he was born in 1791 to be barely old enough for the heavy hauling he did. He's perfectly healthy around 1815. I'd imagine 24 years is exceptional for a horse in that time period.Little Bub, who adopted his owner's name Justin Morgan, was the little horse that could"}, {"userName": "Marlo", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/5466821-marlo", "userReview": "As a young girl, I desperately wanted a horse as so many girls do. My parents bought be Marguerite Henry's Misty books instead. As an adult, I'm no longer a horse person other than to appreciate their beauty, but I have a nine year-old daughter who's a lot like me. While she read the Misty books on her own, I read this to her as part of our school curriculum. We both enjoyed it immensely. I appreciated the historical aspects of it as well as the kindness and affection portrayed between the characters of Joel and Master Morgan and the affection between Joel and Little Bub, in addition to the positive character Joel showed in his persistence of caring for and pursuing Little Bub. It's a worthy book for education and pleasure."}, {"userName": "Suz Thackston", "userReviewDate": "Sep 02, 2017", "userURL": "http://www.goodreads.com/user/show/20747470-suz-thackston", "userReview": "It may be that all Marguerite Henry books don't deserve 5 stars. I'm sure they're flawed. But you won't hear about their flaws from me. I grew up on them. I met my first Morgan before I read this book, so she's not responsible for Morgans being one of my absolute most favorite horse breeds. But this clinched it for me. And real Morgans, like Bub, not the nervous fancy hybrids so popular today.This is an ageless timeless classic. If you have a horse crazy kid- or any kid- or if you or anyone you know likes a great story with a real life protagonist who does ordinary heroic things- go read this book."}, {"userName": "Victoria", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/3412574-victoria", "userReview": "I think if I read this on my own even as a kid, I'd probably be a bit bored, but my sons seemed intrigued by it and kept enjoying it as I read it to them out loud. It was a good story regardless. Joel is a kid and his schoolmaster is named Justin Morgan. There is a little horse that Joel takes a real liking to that Justin Morgan gets ownership of and Joel wants to train it (or as they say, \"gentle it\"). The rest of the story is about Joel's relationship with the horse. This book is based on historical situations but the story's fiction."}, {"userName": "Kristen Coffin", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/66395940-kristen-coffin", "userReview": "Until I read this book, I never knew that the Morgan horses were named after a real person. I'd never really thought about it, but I guess I had just always assumed it was a place or a town or something. So not only was this read interesting because it's about horses (which I love), but also very informative, because it teaches the history of a breed of horse from it's very beginning.Recommend for any horse lover."}, {"userName": "Andrea", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/548376-andrea", "userReview": "What if the one thing you wanted in life was the one thing you couldn’t have? Should life therefore have no meaning? This book tracks the life of a little horse from the perspective of a child who grows up over the course of the book. This book shows that looks aren’t everything and that hard work matters. I like how this book shows the importance of paying ones debts. I like how the story includes an impossible obstacle and the main character’s determination to never give up."}, {"userName": "Gay", "userReviewDate": "May 19, 2017", "userURL": "http://www.goodreads.com/user/show/19612158-gay", "userReview": "Your kids will love this classic about a small horse that made a breed. Marguerite Henry has a way of weaving a tale about real horses. She tells of the hard times found in different periods of time. Grab this and all her books. You won't be disappointed."}, {"userName": "Sam Wagner", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/63897096-sam-wagner", "userReview": "Just finished the book and I was thoroughly disappointed. Though the book is descriptive and uses multiple artistic elements, it simply lacked action and relatable characters. The book can be completely summed up with merely the title."}, {"userName": "Cathy Smith", "userReviewDate": "Feb 05, 2017", "userURL": "http://www.goodreads.com/user/show/18018634-cathy-smith", "userReview": "This author writes some of the best stories for young people. And the art work is always excellent. You learn a lot while reading this, and it can be read over and over again. I have not read this since I was a child, but would read it again today without hesitation."}, {"userName": "Jeri", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/251929-jeri", "userReview": "I read this wonderful book 50 years ago. Funny, I had forgotten everything except that it was wonderful! Reread it today in about an hour, it is a classic. Justin Morgan's horse was an American. Read it and love it."}, {"userName": "Amy", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/11519114-amy", "userReview": "Audiobook was wonderful. Very interesting story."}, {"userName": "Barb", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/5757804-barb", "userReview": "3.5 stars. Listened to this. Had never read it. It's been a long time since I saw the movie, but think it's somewhat different than the book. Probably the book is closer to the truth."}, {"userName": "Terralyn Brown Barfield", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/52552978-terralyn-brown-barfield", "userReview": "I LOVED these books by Marguerite Henry as a pre-teen. Any girl who is horse-crazy will love them."}, {"userName": "Vickie Simpson", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/57156009-vickie-simpson", "userReview": "Great StoryGreat book from childhood"}, {"userName": "Sara Best", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/22147676-sara-best", "userReview": "This is one of the books I read before I started keeping my book list. Even though it was years ago, I remember the story and how much I loved it.The date is estimate."}, {"userName": "Sue Colter", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/37519440-sue-colter", "userReview": "I know it's a child's book. I bought it in Vermont when I visited the home of the Morgan horses."}, {"userName": "Sarah Johnson", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/58588704-sarah-johnson", "userReview": "My 8 year old boy is horse crazy and loved this book. He said it’s a 5 star because it’s an awesome book. It made him laugh in some places."}, {"userName": "Wendy Post", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/15887492-wendy-post", "userReview": "Just because I was interested in the history of the Morgan."}], "description": "Joel's face suddenly lit up as if he had thought of something for the first time. He spoke now to the horse, as though he were the one that mattered. \"Why, come to think of it, you're just like us, Bub. You're American! That's what you are. American!\"  In 1791 a Vermont schoolmaster by the name of Justin Morgan comes home with a two-year-old colt named Little Bub. Taken as payment for an outstanding debt, the little colt doesn't seem like he is worth much, but the kindly teacher asks one of his students, Joel Goss, to train him. Joel knows the horse has great potential, and soon word about Little Bub spreads throughout the entire Northeast for his ability to outwork, outrun, outtrot, and outwalk any horse in the area.  This is the extraordinary tale of a little workhorse, who, after being born in obscurity, becomes one of the greatest breeding stallions of all time. In this true story Newbery Medal-winning author Marguerite Henry and artist Wesley Dennis celebrate the life of the only horse ever to establish a breed all by himself -- the Morgan.", "title": "Justin Morgan Had a Horse", "url": "https://www.goodreads.com/book/show/79667.Justin_Morgan_Had_a_Horse", "average": 4.02, "cover": "https://images.gr-assets.com/books/1385071784l/79667.jpg", "reviews": 175, "authors": [{"url": "https://www.goodreads.com/author/show/10652.Marguerite_Henry", "name": "Marguerite Henry"}, {"url": "https://www.goodreads.com/author/show/441088.Wesley_Dennis", "name": "Wesley Dennis"}], "type": ["Animals", "Fiction", "Childrens", "Animals", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/79667.Justin_Morgan_Had_a_Horse", "http://www.goodreads.com/book/show/123194.Justin_Morgan_Had_a_Horse", "http://www.goodreads.com/book/show/464390.Justin_Morgan_Had_a_Horse", "http://www.goodreads.com/book/show/6233896-justin-morgan-had-a-horse", "http://www.goodreads.com/book/show/863750.Justin_Morgan_Had_A_Horse", "http://www.goodreads.com/book/show/25629150-justin-morgan-had-a-horse", "http://www.goodreads.com/book/show/17461.Misty_of_Chincoteague", "http://www.goodreads.com/book/show/423156.King_of_the_Wind", "http://www.goodreads.com/book/show/296125.Stormy_Misty_s_Foal", "http://www.goodreads.com/book/show/123196.Brighty_of_the_Grand_Canyon", "http://www.goodreads.com/book/show/901311.Black_Gold", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}