{"ratings": 3287, "userreviews": [{"userName": "Lisa", "userReviewDate": "Jul 21, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Most often, young adult fiction leaves me quite cold. I read it for professional reasons, make suggestions regarding suitability for class reading, and put it aside again. Every once in a while, though, I come across beautifully crafted novels, containing the human condition in the making, made accessible to a younger reading audience without diluting content and message.Just In Case is such a case. Pun intended as it is part of the story, as well. Justin Case, the main character, all of a sudden realises how fragile his reality is becoming and wants to make sure he stays in control. In order to do that, he has to take all possibilities of the world into account. Just in case... A quite impossible task, of course. He decides to trick Fate. He needs to change shape to go unnoticed!I loved the idea of trying to hide from Fate by becoming another person, and how that decision ultimately becomes part of your Fate and your identity.Justin Case is in many ways a typical teenager trying to find his way through the jungle of different options that suddenly open up as he is preparing to become an adult. His increasingly bizarre actions are motivated by his fear and wish to control the surrounding world. It is a genuine coming-of-age story, describing the vacuum between the protected world of childhood and the responsibility and agency of the grown-up.When Justin understands that he has to give in to the fact that total control is impossible, he is ready to take charge of his own life.I find that to be an important message not only for adolescents, but for adults as well. Sometimes hiding from Fate is the worst thing you can do. The ancient Greeks knew that already, as demonstrated in countless myths involving people trying to avoid the unpleasant news of the oracle and thus creating the stage for its fulfillment. Paris or Oedipus come to mind, for example.In our modern world of perfectionist obsession, we can use a dose of Justin Case's medicine to let go of some of the fears that prevent us from enjoying what we are doing fully. Just in case you have some time to spare, I highly recommend this novel!"}, {"userName": "Naban", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/17391666-naban", "userReview": "[She also has sex with Justin, a minor.  (hide spoiler)]"}, {"userName": "Emma", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/1454851-emma", "userReview": "I wanted to like this. I really did. I loved \"How I Live Now\", thought it one of the best written and innovative young adult books for a generation. And indeed, I did love the first third of this second novel. I felt the same sense of heady exhilaration at the sheer audacity and exuberance of Rosoff's prose.But then I began to falter. Or rather the story did. First I noticed the frequent changes of viewpoint. Writers are recommended to stick to just one viewpoint per scene for a reason - to do otherwise is both distracting and distancing. You feel you are never truly in any one character's head, and frankly that's where you need to be for a story to really work.Then I felt that the plot, quite simply, was floundering. All satisfying plots hinge on character development, and Justin didn't seem to develop at all. By the end of the story, he can barely even pull himself out of a coma. Without a compelling 'hero', all the other characters seem redundant, incidental to each other. I remember reading a publisher's warning not to bother sending in manuscripts about depressed teenage boys. It's the default option of young adult fiction, and not inherently interesting, unless you actually are J D Salinger. I think this may be a case in point.To summarise, I still think Meg Rosoff is an immensely talented author, unsurpassed for her daring and honesty. But I am not at all sure this story was worthy of the telling - like Justin, it seemed to promised much, only to sicken and turn comatose, utlimately revealing itself as gloomy, self-absorbed, and not really going anywhere."}, {"userName": "Meaghan", "userReviewDate": "Nov 06, 2007", "userURL": "http://www.goodreads.com/user/show/430758-meaghan", "userReview": "Although I loved How I Live Now, Just In Case seriously didn't do it for me. This book just seemed to go nowhere. I mean, things happened, but it felt like nothing was happening at all, and the story line was just drifting along. It was like the author couldn't decide between fantasy and psychology. Also, I had a hard time believing David/Justin's parents would just let him run away from home and quit school and move in with that older girl without being just a little bit upset. Try again, Meg Rosoff. Your first book was so good I'd be willing to give you another chance."}, {"userName": "Haley", "userReviewDate": "May 06, 2008", "userURL": "http://www.goodreads.com/user/show/697359-haley", "userReview": "I give this book a high review because it is different. I don't mean different in that flashy \"oh my god this book changed my life\" sort of way. No, this book is different in that it is unexpected. It is not altogether an incredibly happy book nor is in extremely depressing. \nJust In Case\n embodies the the full fledged confusion, angst and self centered mindset of the teenage adolescent and multiplies it by pi. This book both stretches the imagination and ties you firmly into a state of reality in a way that only a teenager both wanting to grow up and stay a child can. I hope you find this book as enjoyable as I have. ;-P"}, {"userName": "Roya", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/22146366-roya", "userReview": "YES. This is what actual YA literature looks like. This is what actually goes through the mind of an actual person who is actually grappling with life and adolescence and shit"}, {"userName": "Jennifer Wardrip", "userReviewDate": "May 06, 2008", "userURL": "http://www.goodreads.com/user/show/1125613-jennifer-wardrip", "userReview": "Reviewed by Me for TeensReadToo.comNow that I've finished reading JUST IN CASE and it's time for me to write my review, I'm having a hard time thinking of how to describe it. I've had the pleasure of reading HOW I LIVE NOW, Ms. Rosoff's Michael L. Printz award-winning book, so I began reading JUST IN CASE with high expectations. I wasn't disappointed, not in the least, and have high hopes for the awards this book will garner over the coming year. It's just that, now that I need to put it in words, it's difficult to describe just who, exactly, the main character in this story is--David Case, now known as Justin, or Fate? I guess the book could be summed up, quite easily, by the words (actually, by the alphabet blocks) of eighteen-month-old Charlie Case: \"JUST IN CASE WHAT?\" Or, possibly, by the photograph of Agnes, the style-maven with the pink hair, entitled \"ANTHEM FOR DOOMED YOUTH.\" Regardless of how you describe the story, you'll find yourself quickly immersed in the life and times of Justin Case. A teen on the verge of sixteen, David Case is irrevocably changed on the day he saves his baby brother from falling out of an open window. For those of us who are privy to his story, we would see two lucky brothers, one narrowly avoiding a long fall to his death, and one heroic for his quick thinking. For David, though, this break isn't a lucky one. No, this is just one more example of how Fate has it in for him. How can he get away, escape, allude Fate, trick it? He begins by changing his name to Justin, follows it up by becoming even more quiet and withdrawn than he originally was, and finishes it up with a new way of dressing, walking, and talking. When Justin meets Agnes, she immediately takes him under her wing--and uses him for her own purposes, although Justin doesn't realize it at first. Justin is too busy dodging Fate, avoiding certain death, worrying about the ways that Fate can trick him into an early grave. As Justin survives day to day, with the help of Boy, his imaginary dog, and Peter, his not imaginary friend and fellow runner, Justin is unable to see that Fate is still following him, hot on his heels. JUST IN CASE is the story of David, who becomes Justin, who melds into a boy that simply wants to make his own choices in life, rather than having it mapped out for him in advance. It's the story of Agnes, who wants to fix Justin, but in the end doesn't even truly understand the ways in which he's broken. It's the story of Charlie, an abnormally bright child who wishes his brother could forgive himself. It is, most of all, the story of Fate, and Fate's wicked sense of humor. Although it's hard to put JUST IN CASE neatly into a category, I can highly recommend it nevertheless. Once I started this story, I was unable to put it down until the very last word--and even then I was still entranced by Justin Case and his battle with Fate. This book is definitely one worth reading."}, {"userName": "Blodeuedd Finland", "userReviewDate": "Jun 05, 2010", "userURL": "http://www.goodreads.com/user/show/1962503-blodeuedd-finland", "userReview": "I liked this book, but then I am drawn to weird books that do not make much sense, and this one is no exception.It starts at once. David Case rescues his brother, who get annoyed. His brother tells him (well thinks it) what he wanted to do, of course out of the 1 year olds mouth nonsense comes out. Through out the book we can hear the baby's clever thoughts, and he is sure wondering why no one gets him.David is dead sure that Fate is out after him, and he has a lot of gloomy thoughts. So he changes his name to Justin, starts wearing new clothes, and thinks that Fate can't find him any more. He also gets a dog, a greyhound, and the dog is of course not real. But he sees him. He gets a new friend, who also plays with the dog. I guess crazy attracts crazy. And then there is the older girl who wants to photograph him, and he falls in love. I think that was all teh crazy stuff.Or was it? No, this book has a second POV, Fate with short sentences tells us that he actually is after David.Why did I then like this book? I didn't think I would but suddenly I was drawn in to it and could not stop. David was so crazy, I guess it made me think of that Gyllenhaal movie with the rabbit. But David, or Justin really believed fate wanted him dead. And soon he saw dangers in everything, and that is not a way to live. His love affair with the girl was doomed, and it was rather painful to read who much he wanted her, when one could see her indifference. Even if she did care for him as a friend. Luckily he did meet Peter, who was great, and his little sister. That family was a pillar in Justin's life, even if they did talk about the dog. Like saying that Boy needed Justin to survive and exist...yes cos he was made up, duh. But then again Justin needed that dog, I think it made him stay sane.There was the crazy, the weird thoughts, fate showing up and scaring me, first love, friendship and a wonder how this all would end. A great YA book in the end, with some amazing writing in it.What can I say, I am a sucker for the weird,Blodeuedd's Cover Thoughts: Pretty, but pretty girl, but yes looks YA.Reason for reading: libraryFinal thoughts: I enjoyed this strange tale, about a boy who lost is footing in the world."}, {"userName": "Janelle", "userReviewDate": "May 05, 2008", "userURL": "http://www.goodreads.com/user/show/589327-janelle", "userReview": "This was probably one of the strangest books I have ever read. I didn't think it was as good as I thought it would be. Actually, to be honest I didn't even finish it! I made it to chapter thirty then just decided that I wasn't interested in reading it. It was pretty confusing because it switched from one persons thoughts to another, and even the little baby brother had thoughts. Also, there was almost no dialogue! So, even though I really hate stopping in the middle of a book, I could just not continue with this one."}, {"userName": "MallyReads", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/5294489-mallyreads", "userReview": "This is a terrible book. Be aware, people, this may ruin the book for you - but hey, I'm only trying to warn you to  not  read this book, no matter what. This book starts off with David Case's younger little brother trying to throw himself out of a window because he believes he can fly. This is believable, as young children obviously don't understand much. What  isn't  believable is that a: the child talks, like full fluent English. Oh no, he doesn't actually  say  the words out loud, its more like thinking but so that it seems like talking -  yes, very confusing. And b: David believes that after this encounter that his brother had with death, that  he  (no, not his brother, but him) is cursed, and that Fate has it in for him. Uh-huh. My thoughts at this stage of the book:  This person is obviously paranoid. Then we have small witty dialogues from Fate him/herself, these actually interested me so I decided to continue reading.  Stupid me. So then, he changes him name - to Justin, gettit - Just in Case, Justin Case. Yay, awesome!  *sarcasm there*  And then goes to a shop, where we meet Agnes, who hands him a load of clothes and takes pictures of him before Justin leaves the shop. Now, at this point I am pretty scared - why would you let a stranger take a load of pictures of you? Who knows what they would do with them?  *sigh* Then there is school, where everyone thinks David - oops, I mean Justin - thinks is extremely weird. He is. And to top it all off! He has  an imaginary dog  , yeah, a greyhound... At this point I came to the conclusion that the author was...a: highb: drunkc: both (probably this one) when she was writing this horrible novel --> if you can call it that. David - Justin - then joins the cross country team (track, whatever) and because he actually gets better at running, he believes he is all suave and mysterious and more Justin, than David.  Oh lord. Oh, and he has  one  friend who runs as well, Peter. And to be honest, Peter was like the only  normal  person in this book. And then Agnes calls Justin 'cos she wants to meet him, and Justin agrees. Thoughts: Why? Why would you meet with a complete stranger? What? Oh, yeah, cos your Justin now, not David. Anyways, they meet up, he tells her about Fate wanting to kill him (oooooh) and she takes a load more pictures of him. Does this book even have a plot?A load of other stuff happens, not necessarily in this order, but here goes:-More dialogues from Fate, showing he/she is a bitch. Yeah...the crazy thing. -David - Justin - nearly dies when a plane crashes, making him believe Fate is trying to kill him.-Justin moves in with Agnes...oh lord...and they have sex (at 15)...(note about this further down.)-Justin falls in lurveeee with Agnes, but Agnes doesn't love him.-There is an art gallery opening with pictures of Justin - (note further down about this.)-Some dude dies, trying to save a coat from being run over by a taxi - Justin's coat. -And Justin falls into a coma...and I don't even remember why, something at track.-Fate acts even bitchier.-I don't get the ending, plain weird.Okay, notes:-Throughout the book, Justin says that he wants Agnes to beg him for sex and all...Oh god: Seriously, WHAT THE FUCK? You're 15, for god's sake!-As for the gallery, Agnes doesn't tell him he was her muse, and she kinda acts cruel because she used him for pictures, had sex with him, and tossed him away.This book is  TERRIBLE . I repeat, TERRIBLE! BAD BAD BAD BAD! EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEVIL! *sighs* I really need a really good book now! Bye!"}, {"userName": "Kayla_greeley", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/6322062-kayla-greeley", "userReview": "Meg Rosoff, the author of Just in Case wrote a ground breaking novel, with a complex plot through the intriguing believable mind of a teen age boy. Meg Rosoff won the Carnegie Medal in 2007 for the novel Just in Case. I found very similar plot lines and themes between Just in Case, The Catcher in the Rye by J.D Salinger and A&P by John Updike. Each of these novels uses the theme of coming of age. I would defiantly recommend Just in Case to fellow readers because it is very much a classic, a book recommended because of the metaphors and multifaceted characters. There are few characters in the novel, but the ones that are in it have their purpose, some of who play a large role in David Case’s life.The novel Just in Case by Meg Rosoff is a realistic, coming of age novel with a genuine account of a 15 year old boy, who has a change of heart after a forbidding life or death moment with his toddler brother. David Case living in Lutton, England, was watching his baby brother Charlie Case when a blackbird flies by the window. Charlie gets the assumption that he can fly and was attempting to leap out the window to test his flight. David grabs his brother; he pulls him through the window only to saves his brother’s life. Some would take this as a lucky moment and be glad he saved his brother’s life, but David is a strange boy. He thinks fate is out to get him and will stop at nothing to deceive fate. David has a plan to outrun fate and disguise himself so fate will not find him ever again. I quiet enjoyed reading about David’s life and his alteration of a new identity, I thought it was extremely ironic that the name of the book is Just in Case, the name he chooses for his new persona, Justin Case. My favorite aspect of the novel is David’s friend Anges, who meets Justin/David in a thrift store trying to decide on what type of style his identity should have. Anges is a photographer, she takes pictures of everything Justin does, and publicizes him as a character of “doomed youth”. She is my favorite character because she is Justin’s first friend in his new life. Another part of the novel I enjoyed reading is how he has an imaginary dog, name Boy. Even his friend Peter acknowledges his “dog” frequently. This novel gave me an intriguing outlook in the mind of a despondent teenage boy.I would recommend this novel for others to read, because although there was not a lot of action and it only had engagement with people, it had an incredible, believable replication of an inside look of a boys mind. The novel is very similar to The Catcher in the Rye. The similarities are each boy is trying to find their way in life, while believe the world, and fate is out to get them. The Catcher in the Rye is a classic, and so is Just in Case, The New York Times even said Just in Case is, “A modern Catcher in the Rye”. Another reason why I recommend Just in Case is because in current times now, children and teenagers are acting older and wiser than their actual age, very much like David, so people can relate. Throughout the novel the over dramatized ideas of David have a huge effect on the reader, making you ether sympathizes for him, or just think he is a crazy youngling trying to find problems in everything. In the novel it is once said, “Pouring breakfast cereal into a bowl, he saw his life crashing down in smoking ruins”, stressing the speculation of David’s life. David has his fellow grey hound, his family and friends but still feels he has a quandary with life. Like many obstructed teenagers he wants to blame fate for his problems but soon he finds out the true meaning of life, and it is not outrunning fate."}, {"userName": "Margaret Sophia", "userReviewDate": "Jan 14, 2011", "userURL": "http://www.goodreads.com/user/show/4721355-margaret-sophia", "userReview": "DISCLAIMER: This is my first review, and therefore as bad as this book.I'm not going to lie. I picked up this book in the library because the cover was intriguing. That's a euphemism for the boy on the cover was very attractive . The name was actually intriguing. Just In Case, Justin Case. Clever. But the name, and the cover jacket blurb are extremely misleading. This book was not intriguing. It was all over the place, and I found it just a mash together of several implausible situations.The book started off pretty mild, with a little boy trying to jump out the window and a teenager attempting to reinvent himself. The few words from fate got me interested, so I decided to stick around. I wish I hadn't.This book, to put it mildly, was a complete and utter disappointment. Plot? What plot? The story is about a crazy kid, who no one seems to be able to figure out is crazy, despite the fact that he acts like a total schitzo. Only once in the entire book is it suggested that he go see a doctor or a counselor. Oh, but wait-there's more! Not only is this kid totally insane, he's also Fate's little plaything. Fate tries and tries again to... kill him? It's not always clear, Fate's a confusing guy. But, Justin manages to avoid death, once even saving himself from getting hit by a plane by... STEPPING OUT OF THE WAY.What?Here's a list of complaints, since I'm struggling with this whole review:1. EVERYONE seems to have something to say in this book. But not vocally, no. In fact, there's hardly any dialogue in this book and the parts that are dialogue are extremely short. No, this book is in everyone's head. Even a baby, who is about 2 years old, seems to be having complex thoughts, and is the only one in the book that \"gets\" Justin.2. Does no one care about this kid? His parents let him run away from home and move in with an older woman. The older woman gives up on him, so he moves in with his friend. Once again, the parents don't even care.3. For someone who is mentally unstable and constantly thinking about fate, he sure thinks about sex a lot.4. His friend's sister, Dorothea? Yeah, she aggravated me to no end."}, {"userName": "Kathryn", "userReviewDate": "Oct 13, 2007", "userURL": "http://www.goodreads.com/user/show/418078-kathryn", "userReview": "David Case wants a life that is just like everyone else's, but Fate just can't seem to leave him alone. In an attempt to outwit Fate, David changes his name to Justin, takes on a new persona and begins to run, quite literally, from what Fate has in store for him next. From causing bicycle accidents to being the target of a plane crash to a deadly disease that nearly kills him, Justin learns that it is not Fate that determines his future but the choices he makes and the people he surrounds himself with that guide his course. The running dialogue between Justin and Fate can be quite disturbing at times with its intensity, but it helps you see how Justin's mind works. And Rosoff seems to understand that depression/anxiety/borderline schizophrenia can make the mind a dark place to dwell, especially for a teenage who is beginning to deal with it for the first time. The most exciting aspect of this book actually comes from the case of supporting characters, all of who wait in the shadows of Justin's mind to lead him on new paths. With an imaginary dog that the most unexpected people seem to be able to see and an older girl whom Justin thinks is his lucky charm, Justin builds a life that is far from normal, but this book goes on to make you question what is normal in an entirely different way that any other book."}, {"userName": "2balik", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/42653183-2balik", "userReview": "okudugum en çarpıcı gençlik hikayesi. \"just-in case\" kaderinden kacabilecek mi? veya sorgulamalardan?ismi pek duyulmamis bir kitapta neler gizliymis megerse :)bazı yerler yuzeysel gecilmis gibi gelse de ergenlik dönemi çalkantilarini oldukca derinden incelemis yazar.dorothea en sevdigim karakter oldu, keske daha yakindan taniyabilseydim"}, {"userName": "Viola Sung", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/31009784-viola-sung", "userReview": "The last parts of the book fell short, but at first it was reallllly good. Rosoff's fresh narrative gave the story a quirky suspense and I was really eager to see where the plot would go. But as it progressed, Justin's oddness just became plain weird and the characters failed to display whatever the book was trying to convey. (Or did I just not understand it?"}, {"userName": "Hannah", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/59368865-hannah", "userReview": "This is my favourite Meg Rosoff book - I thought that nothing could beat 'What I Was', but this has. It was very moving and emotional and I loved it."}, {"userName": "Jen", "userReviewDate": "May 30, 2014", "userURL": "http://www.goodreads.com/user/show/338249-jen", "userReview": "This is an interesting coming of age story that starts with a bang: a depressive teen's baby brother almost falls out a window on his watch. He realized how his life could have been shattered and decides he is doomed, and needs to reinvent himself to hide from Fate. Fate is an actual character - there's no hiding. The baby brother is remarkably intelligent - we are privy to his thoughts, which then comically come out in babyish blurts that give no hint of the sweet, brilliant boy within. The depressed teen has an imaginary greyhound, a touch I loved. And it's ultimately redemptive. A really cool look at mental issues, and how they can be swayed.I will say that it really struck a chord to be reading this when the Isla Vista massacre in Santa Barbara occurred. That was a privileged boy who wanted revenge on women who had spurned his advances/withheld love. That is a major catalyst for David/Justin Case's downward spiral, and it leapt off the page at me. Chilling.Despite the heavy content, Rosoff lightens it with humor and quick dialogue.\"Eventually they left together and spent a steamy half hour in Alex's car, during which Shireen provided the requisite sexual satisfaction. Her new boyfriend did not return the favor, a fact she might have resented had she given it much thought.\"\"He opened the door, and the gallery coughed him out into the street.\"\"If you were eighteen months old and lucky, the world was one big shiny gift of needs fulfilled and fears allayed.\""}, {"userName": "Kristina Čechová", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/5231162-kristina-echov", "userReview": "Když od knihy neočekáváte příliš, dopadne to tak, jak u tohoto výtisku. Při čtení prvních stránek jsem se opravdu cítila jako Alenka v říši divů... řekla jsem si však, že to nevzdám, jelikož ta myšlenka \"rozmlouvání s vlastním osudem\" se mi velmi líbila. V polovině knihy začalo všechno dávat smysl a šel z toho až mráz po zádech. V mysli se mi náhle začaly vynořovat řady teenagerů, kteří mohou být vlastně stejně bezradní a ztracení v sobě samých, jako hlavní postava - patnáctiletý Justin. Kdo z nás si nikdy neřekl, že si s ním osud pěkně pohrává a že je to všechno nespravedlivé. Kdo z nás svému osudu uměl jen nadávat a nikdy ho nenapadlo, že náš osud nám do života přivádí i ty šťastné momenty, za které neumí poděkovat. Kniha v roce 2007 dostala ocenění Carnegie Medal. A jak sama autorka říká, tuhle knihu budou lidi buďto milovat nebo nenávidět. A já s tím naprosto souhlasím, jelikož jsem si udělala ten samý úsudek ještě před tím, než jsem si tento náhled autorky přečetla na stránkách. Až se rozhodnete tuto nesmírně zvláštní a výjimečnou knihu přečíst, nedívejte na poslední stránku. Možná se právě po té stránce také po těle zachvějete a na rtech se vám vykouzlí úsměv.Dodatek: docela se mi nelíbí fakt, že S osudem v zádech je na www.bux.cz nabízeno už dětem od 10 let. Dle mého názoru je to naprosto nevhodné, jelikož kniha je plna erotických fantasií a myšlenek hlavní postavy a občas se objeví i hanlivý výraz."}, {"userName": "Annika Samuelsson", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/38806122-annika-samuelsson", "userReview": "A book for book meatings, a book that have many aspects you can discuss."}, {"userName": " Kürbis", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/3088245-k-rbis", "userReview": "Well, I usually find at least an enjoyable or worthy part of books that I don't like. However, \"Just In Case\" is not the case. I tried to think about what I like about this book, even a tiny-ti-nee one, surprisingly there are none!!! I don't see the gist of the story. OK, I know that our lives are full of inconstancy and danger but this is the very bad way to convey this message. I think the theme could be carried out in a more interesting story. I happen to hate all the characters in the book which made me feeling nauseous about it. The characters are mentally scary and I don't want to imagine there are really such people out there. This book reminds me of the movie \"Napoloen Dynamite\" which is the freakiest movie ever. I am honestly and officially scared.I know that there are quite a few people who like this book and I am sorry but I don't feel like it is my cup of tea. I obviously and utterly dislike this book. I was quite reluctant to read this book which is bad enough, but I have to go through a test about the book is unimaginably the worst."}, {"userName": "Oana", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/14552196-oana", "userReview": "The story of David Case, who is babysitting his younger brother when he (the younger baby brother) nearly falls out of a window and dies. David goes paranoid, and tries to outsmart fate by changing his name, and clothes, etc to stay hidden from fate. (Nothing weird about that, is there?)I didn't really enjoy it. I hated David (or Justin, as he names himself) for being such an over-the-top dramatic weirdo essentially. He plays with an imaginary dog, obsesses over a girl much older than him who doesn't love him back, and many other things.The other characters were unlikeable too, like Justin's new friends, who understand his obsession about getting away from Fate, see and play with his imaginary dog like it's a normal everyday occurrence, and never once think about sending Justin to a psychiatrist. His parents are pretty much the same. Overall, I didn't like the book. Probably wouldn't read again."}, {"userName": "Kelly", "userReviewDate": "Dec 17, 2010", "userURL": "http://www.goodreads.com/user/show/1421882-kelly", "userReview": "Favorite. Book. Ever!I just adore this book! I love Rosoff's style, her characters, her theme, her story!The story follows a British teen as he grows up. He believes that Fate is out to get him (he is. we hear from Fate occasionally) and decides to hide by changing his identity. However, poor Justin is doomed to play an unwelcome game with Fate.The book uses something that I've heard referred to as 'magical realism'. I'm not sure if that's an accurate description, but Rosoff's use of the fantastic certainly adds intrigue to the story. Regardless,she's able to make each event seem significant and emotive, whether it's large or small. Her style is so beautiful and mellifluous, that I pick the book up again and again."}, {"userName": "Marisa", "userReviewDate": "Aug 22, 2007", "userURL": "http://www.goodreads.com/user/show/41590-marisa", "userReview": "Read this one several months ago. I was hoping for big things after How I live Now. This book was good, quite funny at times, but not even on the same level.A kid name, I don't know, maybe Aaron Case or something, gets completely and totally preoccupied with fate/predestination and all the terrible things that could happen to him. So, he decides to adopt the name Justin Case (get it, Just In Case, har) and completely change his public identity in the hopes of outwitting fate. Cute premise, but the book itself falls a bit short. Still, I'm sure avid YA readers will enjoy it."}, {"userName": "Wai Lam  Chan", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/34749673-wai-lam-chan", "userReview": "Just in case is a novel about a teenage boy who changes his identity when he believes that fate is after him. One thing that had intrigued me was the doggedness of David’s character and how he was convinced that he was vulnerable to disaster at any moment. Although, the notion of fate being after him was quite unbelievable and surreal, the voice of fate and the behaviors and thoughts of Justin solidified the idea. Overall, I enjoyed this book because it was an interesting and unpredictable read."}, {"userName": "Chloe", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/32840527-chloe", "userReview": "it was an intriguing read, knowing how one incident changes the life of a fifteen year old boy. he changes his name, changes his personality. But, he slowly began to feel badly about himself, feeling like he was the cause of all mishaps and bad luck. I liked how the storyline described his thoughts and how his presences makes an effect on others, but I think it was a draggy story with not much of an \"oomph\" feeling to be given 4/5 stars."}, {"userName": "Mateus Bandeira", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/3847885-mateus-bandeira", "userReview": "I'm still trying to figure out how I feel about this. It is beautifully crafted, extremely well written, and had really realistic characters (tho some of them - like the main character - are really hard to swallow). An interesting deliberation on life/death/identity in Young Adult novel, and, to be honest, one of the best YA books I've ever read."}, {"userName": "Vendea", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/7443396-vendea", "userReview": "Nenuťte mě číst to znova. Ač se jedná o zajímavý nápad, imaginární pes tomu nasadil korunu, jméno psa rovněž. Neříkám, že kniha nemá potenciál, ale po prvních 10 stranách mi kniha bohužel už neseděla."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : Just in Case - Nevisande : Meg Rosoff - ISBN : 385746784 - ISBN13 : 9780385746786 - Dar 256 Safhe - Saal e Chap : 2009"}, {"userName": "E.", "userReviewDate": "Dec 13, 2008", "userURL": "http://www.goodreads.com/user/show/995476-e", "userReview": "I read the first chapter, and it really gave me a lot to think about... But I've heard its not very clean, so, as much as I would like to, I'm not going to read it."}, {"userName": "Zahra", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/48123707-zahra", "userReview": "He probably had bipolar disorder. Some mental problem obviously. Great book for literary analysis tho, lots of hidden symbolisms woven through the text."}], "description": "- Carnegie Medal Winner - From the 2016 recipient of the Astrid Lindgren award and author of international bestseller How I Live Now, National Book Award finalist Picture Me Gone, and most recently Jonathan UnleashedDavid Case never questions his ordinary suburban life -- until one fateful day, a brush with death brings him face to face with his own mortality. Suddenly, everywhere he looks he sees catastrophe, disaster, the ruin of the human race, the demise of the planet...not to mention (to pinpoint the exact source of his anxiety) possible pain and suffering for himself.So he changes his name, reinvents his appearance, and falls in love with the seductive Agnes Bee -- in the hope that he'll become unrecognizable to Fate and saved from his own doom. With his imaginary greyhound in tow, Justin Case struggles to maintain his new image and above all, to survive in a world where twists of fate wait for him around every corner.", "title": "Just in Case", "url": "https://www.goodreads.com/book/show/1941569.Just_in_Case", "average": 3.21, "cover": "https://images.gr-assets.com/books/1442124730l/1941569.jpg", "reviews": 370, "authors": [{"url": "https://www.goodreads.com/author/show/93575.Meg_Rosoff", "name": "Meg Rosoff"}], "type": ["Young Adult", "Fiction", "Contemporary", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/1941569.Just_in_Case", "http://www.goodreads.com/book/show/590120.Just_in_Case", "http://www.goodreads.com/book/show/18865970-just-in-case", "http://www.goodreads.com/book/show/209390.Just_in_Case", "http://www.goodreads.com/book/show/1212760.Just_in_Case", "http://www.goodreads.com/book/show/28433058-her-htimale-kar", "http://www.goodreads.com/book/show/36648540-just-in-case", "http://www.goodreads.com/book/show/12374620-s-osudem-v-z-dech", "http://www.goodreads.com/book/show/161426.How_I_Live_Now", "http://www.goodreads.com/book/show/17465457-picture-me-gone", "http://www.goodreads.com/book/show/1220721.What_I_Was", "http://www.goodreads.com/book/show/10280563-there-is-no-dog", "http://www.goodreads.com/book/show/27774717-jonathan-unleashed"]}