{"ratings": 42, "userreviews": [{"userName": "Aditi", "userReviewDate": "Jul 22, 2014", "userURL": "http://www.goodreads.com/user/show/16069171-aditi", "userReview": "“The best secrets are the most twisted”  ----quoted by an American author, Sara ShepardDonna Hechler Porter, another American author, spectacles us with her new novel, Keeping Secrets. Similar to Sara Shepherd's quote, Keeping Secrets book expands its horizon on the subject of secrets and their nature. This book not awes us with its intrigue and mystery, but also we get time-traveled to the 1700s in Virginia. From the mesmerizing setting to the vivid descriptions of the lifestyle of that time, everything has been captured by the author so profoundly. And this captivating story will arrest your mind and soul from its very beginning. All the characters in the book are entangled with one-another by secrets, some past secrets and some present secrets, which devastate their world in one, go!Thanks to the author, Donna Hechler Porter, for giving me this opportunity to read and review her novel. Amon Cayle lost his wife, Abigail, a year ago, in a kitchen fire accident. But now he is in search of a seamstress, who will sew Amon's and Amon's eldest son, David's clothes.Mary McKechnie too lost her husband and is look-out for a job to support her daughters. But her vile and evil brother threatens her and forces her to take a job from any of his fellow friends. Amon wants Mary to work as a seamstress for his family, but Mary is reluctant not to take up Amon's offer, since twenty years ago, they had a history, and since Mary left Amon for another man, and the reasons are unknown to Amon, And now he is bent to unravel the reason/secret, whereas on the other hand, Mary too is reluctant not to give away her best-kept secret.David, Amon's eldest son, gets too involved in his father's world that he almost fails to notice the girl who becomes an important piece of puzzle in his life.Annie, Mary's daughter, keeps her secret hidden among herself and from her mother while she follows her mother's entanglement with Amon's family.Amon and Mary and David and Annie, all four are seen to be entangled in their own hidden secrets and when their secrets come out in the open, each secret happens to shatter them equally. Although the author leaves us with David and Annie's secrets cliff-hanger, but still, all the while, I felt like without learning the secret from reader's point of view, the contemplation of the secret is like killing me. The author knows how to keep things under wraps and how to unfold them layer-by-layer. I almost lost myself in the author's narration of this tale, and the time-period that she has chosen aptly suits with the plot of this book. Mary and Amon's chemistry or rather say, relationship seems quite alluring to me and kept me very engaged with their shred past and troubles. I loved the author's approach of representing so many characters with their own point of view by keeping it thoroughly engrossing.If you enjoy some nice historical romance with a beautiful set-up and time-line, then, Keeping Secrets completely fits the bill!"}, {"userName": "Shantelle", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/5482096-shantelle", "userReview": "A very interesting historical fiction that kept me guessing at every turn. Keeping Secrets, book one of the Children of Light series, brought the world of Quakers Amon Cayle and Mary McKechnie of the 1750s to life. Amon is a widower and a father, trying to take care of his family after the tragic loss of his wife, Abigail, and keep in good standings with the Society of Friends. Not to mention, he needs a seamstress. Mary has also endured the loss of a spouse, and is working desperately to provide for all her daughters. When Amon offers her a job, she’s quick to turn it down, all too aware of her and Amon’s past. David is the oldest son of Amon Cayle. Trying to stay out of the way of his wily cousin, Jackson, and keep the peace with his papa, he hardly noticed when a certain girl becomes ever so important to him. Annie knows all too much about keeping quiet about things. Threatened by her uncle, she painfully tries to keep her mother, Mary, from worrying and from the truth. All the while, she watched her family get entangled with the Cayle family… even as she herself does. This novel definitely had the right title. Keeping Secrets. That’s what Amon, Mary, David, and Annie did. Secrets from the past. Secrets from the present. Secrets that will harm. Secrets that will heal. All bottled up inside a person, something is liable to go wrong. I was captivated almost at once. Keeping Secrets taught many lessons in a gently flowing, real-life, almost vague, but not really, sort of way. Everything seemed so befuddled at times, but it all came together in the end. (Well… except for one thing, and that has me anxious to read the next book in this series, Breaking Promises!) Anyway, perhaps the first 90 pages were just kind of me getting into the book. Then I became hooked. This was one book that I just couldn’t figure out what was going on, who did it, what the secrets added up to. It kept me quite entertained, and I was always happy to come back to the pages of this novel! :) Amon and Mary, but especially David and Annie, were lovely characters to walk along with, discover, and heal with. Amon and Mary’s relationship was quite interesting, seeing as they have a past and all. Donna Porter indeed created a story that came to life, a plot that drew you in, and an ending that left you wishing for the next book so you could continue the journey! Some things I didn’t like as much. Hmm… the slaves. Though that was indeed a normal thing of the 1700s, it felt weird reading about people as if they were property. They were treated kindly, perhaps more like servants, but they were still just slaves. Another thing I thought I’d mention, though I found things that very much marked Keeping Secrets as a Christian book, there wasn’t much… well, not much of spiritual growth maybe. But it was pointed out that Amon and Mary both confessed Jesus Christ as their Savior, and some very good values were discussed and thought through in this book I felt. Oh, and probably fifteen or so and up for the romance, and some scandal mentioned. So yes, Keeping Secrets was a lovely historical read. One of those novels that doesn’t just feel like a fluffy, dreamy story. The characters were real-like, they had flaws and struggles and sordid pasts. They healed, and they messed up, and they forgave again. It was wonderful to watch this tale come together. I eagerly await Breaking Promises!I received Keeping Secrets from the author in exchange for my honest review."}, {"userName": "Juliana Strong ", "userReviewDate": "May 28, 2014", "userURL": "http://www.goodreads.com/user/show/7273631-juliana-strong", "userReview": "I really enjoyed Keeping Secrets and I'm looking forward to the next book in the series"}, {"userName": "Trisha Robertson (Joy of Reading)", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/21132617-trisha-robertson-joy-of-reading", "userReview": "This book will whisk you away to a bygone era. Come sit in the kitchen while Mary brews up a cup of tea and shares her story. Like the title suggest, this book is full of secrets. “Oh what a tangled web we weave, when first we practice to deceive.”Mary’s life hasn’t been easy. Her marriage to Samuel had not been what anyone would consider a love match. He had been a difficult man to live with, harsh and easy to anger. At 40 years old, she finds herself a widow with 5 girls, and if that isn’t enough her older brother is threatening to take the girls away and place them as indentured servants. She refuses to allow that to happen and desperately needs work.Amon continues to grieve the loss of his wife, the charred remains of the kitchen a daily reminder of what he lost. However, it seems it is time to start moving forward. Among many things he has neglected, his children are growing out of their clothes. At the suggestion of his sister, he reluctantly agrees to hire Mary to sew his family a new wardrobe.Mary & Amon share not only a history but secrets. Are the secrets of their past too much to surmount? Come find out in this historical story of love lost, and found, and of a family that struggles to hold on to what is most important.The old-speak language in the book can be difficult at times, and in a few places the “thee” was forgotten and replace with “you”. As the title suggests there are many secrets; so much so that at times it was almost overwhelming. As a whole, I did enjoy reading the story of Mary & Amon and I am interested to know what will happen with some of the other characters.(I receive complimentary books for review from publishers, publicists, and/or authors, including Netgalley. I am not required to write positive reviews. The opinions I have expressed are my own.)"}, {"userName": "Lynne Moody", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/32853015-lynne-moody", "userReview": "Wow such a awesome book ! The storyline and characters as I read had me glued to this book . The more I read the story it got better and better with each chapter. Totally worth reading for all romance loves."}, {"userName": "Leila", "userReviewDate": "Oct 17, 2015", "userURL": "http://www.goodreads.com/user/show/15194189-leila", "userReview": "Mixed feelings about this book. I struggled a little at the beginning and almost gave up with the way the characters spoke and addressed each other although at the time it was set it was about a group of people belonging to a 'Community of Friends' so the form of speech would be authentic. In time I grew more used to this. The book is well written and the author has done her research. Set in Virginia around 1700 it is authentic in the description of how the people in the Community lived and the standards they lived by in their little 'Community of Friends' The main theme is about 'secrets' past and present held by the main characters, all of whom are deeply drawn. Given the time the book is set the way the characters interact is very different from the modern way people live, The secrets are so damaging between them all and emotions run rampant. Overall the many secrets reminded me of a ball of wool that has become so hopelessly tangled up it appears impossible to ever free them. Characters are prevented from gaining any happiness because they all refuse to give up their secrets for various reasons Some are afraid of causing pain to their loved ones, others keep their secrets out of the fear of consequences to themselves and their loved ones; then there are the ones who have been too hurt to speak of why or keep quiet due to personal guilt and blackmailing threats if they speak! The story is extremely complex. In a way it keeps you guessing, yet in another way the reader just knows that the 'baddies' will eventually get their just deserts and hopefully the main characters who are normal flawed human beings will eventually find the happiness they are seeking. I found myself feeling quite frustrated at the determination of each of them to keep their secrets, no matter what punishment came their way I found the ending a bit too pat. It was almost as if the author just wanted it all sorted so the feeling was for the reader that all would be well - eventually! As apparently there is a second book, hopefully more will be revealed but I am not sure I want to buy it to be honest, after feeling quite emotionally wrung out by the high drama of it all with the story's very many tragic twists and turns, some of which I felt as a modern reader seemed over the top as in the lashings."}, {"userName": "Tess", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/23388429-tess", "userReview": "I received this book through Goodreads first reads.Amon Cayle is a widower in need of a seamstress to sew clothes for his family who are sorely lacking since the death of his wife a year ago. Mary McKechnie is a seamstress in need of employment. Her brother (who you are going to despise, I can guarantee it) has threatened to put her daughters in indentured service if she can't provide for them but he refuses to allow her to work for anyone other than fellow Friends. Mary and Amon have a past, over twenty years ago she walked away from him and married another man. She had her reasons and those reasons are secrets she has kept from Amon, secrets Amon would like to unravel. Neither is keen on seeing each other after twenty years, but he needs her to work for him and she needs the work.There was a point during the time I was reading when I just wished the story was shorter because not knowing what had happened some twenty years before the events of the story was killing me. Believe me this book is worth the read.Amon and Mary are great together and their struggle is engaging and I can safely say I have rarely invested myself so fully into the relationship of two fictional characters. The story is not just focused on them but also on each of their families and the problems that both families endure. I loved the interactions although at the beginning I found that the connections between the characters were a bit confusing, I suppose that happens for all large families.I was worried about how the children would be portrayed, there were so many of them and some authors feel the need to tell the story from everyone's point of view and in trying to cover all characters they make them too thin. Not in this book, the story flipped comfortably between the points of view of Amon, Mary, Annie and David. I liked the pace and I loved those characters. I look forward to reading more about Annie and David though as I need some closure for that part of the story (I think I can safely say that I am too emotionally invested in the books I read).One thing is for sure I will be reading any sequels."}, {"userName": "Emily", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/317181-emily", "userReview": "oh god, why was that SO LONG!?!? and disjointed, and just because you provide a genealogy doesnt mean you can just throw in a character's name if you have literally never introduced them before in the story and expect people to know who you're referring too. it was OK, but not great, too long, uneven pacing, weird terrible things that happened with no real reason except the author couldnt figure out a better way to make something else happen,... really it was OK but not good really... 2.5, oh also a personal sticking point is when \"historical\" authors use words that weren't in use at the time of their book, like \"nope\" ... Amon Cayle has lost his wife and nearly lost his eldest son to a terrible fire, but it was a year ago and it's time to get back to living. Mary McKechnie and her daughters have been free of her husband for a few years now, but her life is not getting any easier: her father died and her elder brother Lawrence is withholding her inheritance. Lawrence was also left in charge of her and her children in her husband Samuel's will, and his threats overshadow any joy the McKechnie's might find in each other. Amon needs someone to do wifely things around his plantation: take care of his children, sew new clothes for his family and his slaves. Mary needs income so that Law doesn't take her children away. Seems like a simple solution right? Wrong, Mary and Amon have a HISTORY together and 20 years of secrets might just stand in the way of their happiness...."}, {"userName": "Courtney", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/29440107-courtney", "userReview": "I wanted to give this book 4 stars but had to knock it down to three due to some issues that kept pulling me out of the story, but should have been caught by a good editor. The characters are supposed to be Quakers but switch between you and thee, even within the same statement and by those who are supposed to be very strict in the religion. The were several typos, but also things like the plural of daughter-in-law being written as daughter-in-laws. Also, the problems between the H/h are hinted at many times, but very little is revealed to the reader until late in the story. It was frustrating to keep getting references to something so many times without the story moving forward. Finally, once the main romance is resolved, it is completely dropped from the last part of the book to focus on the secondary one which has also been developing.That said, I really liked the overall story. I felt it was original and well written other than the errors above. While this is a Christian romance, there was enough sizzle between the H/h to keep it interesting. I will be reading the next book in the series."}, {"userName": "Ally", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/10598644-ally", "userReview": "I won a copy from Goodreads First Reads.At first, I thought it was going to be a good book. With a lot of soap opera qualities (but I don't really care about that). Anyway, I read it to about the one-third point and was so bored by it all to the point where I was like, \"Gun... Mouth...\" Sorry, but I have to tell the truth. The characters seem like the classic two lovebirds. Meant to be. Soulmates. Blah, blah, blah. Yeah, Harry met Sally, but I never felt that spark or chemistry. And it was clear that I didn't enjoy reading it. So I took mercy upon myself and gave up. And the evil villain was like... Seriously?But it wasn't just that. The dialect killed me too. Sometimes the dialect bothers me, sometimes it doesn't. But this one really killed me. All the contractions and... Oh, those words... I forgotten how many of those words there are... But there seems to be so many.Sorry, guys. But I don't recommend this one. It is too boring. Not like, \"I hate it.\" But more like, \"I really, really am bored\"/rolling my eyes. Rating: Two out of Five"}, {"userName": "Lesia Chambliss", "userReviewDate": "Jul 03, 2014", "userURL": "http://www.goodreads.com/user/show/9105299-lesia-chambliss", "userReview": "Donna Porter's beautiful style of writing brings you a story about a plain family in the community of Friends. This is not a simple story though. She has created a depth to each of her characters, even the children, giving them their own problems to handle as their parents try to sort out theirs. She weaves her plot around each character, and has created a deep mystery in their past, that may come back to tear their lives apart. She hasn't made the story difficult to follow, rather you are pulled into the story.I very much enjoyed reading this book, and truly I couldn't put it down once halfway through. The only disappointment I have is the ending. I wanted to see more of Amon & Mary's story. However, I still recommend this as a great read! I look forward to Donna Porter's next book about David & Annie's story, and maybe we will see more of Amon & Mary in their book."}, {"userName": "Julie Futrell", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/33128529-julie-futrell", "userReview": "What an incredible read! I've been like an addict wanting to read more; yet dreading that it was almost over! The multi-faceted story line, bursting with drama and romance kept me returning again, and again. The characters and story came to life in such a way, that one feels like they are transported back to a simpler time; yet, with all the trials and temptations of a very current day. This was a thought provoking, heart warming, and at times, heart wrenching story , full of suspense and intrigue. It was expertly written and I absolutely cannot wait for the next in the series! You must get Keeping Secrets!"}, {"userName": "Jacquelyn Matties", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/17497137-jacquelyn-matties", "userReview": "I was one of the lucky people that won this book on the Goodreads First Reads Giveaway. Keeping Secrets was one of the best books I have ever read. I have always been fond of historical fiction romances and this is definitely a great one. I couldn't put the book down as the story was so suspenseful and I desperately wanted to find out what the mysterious secrets were. In the days since I have finished the book, I keep thinking about the story and what happens next and it keeps getting me excited. Keeping Secrets definitely did not disappoint and I can't wait to read Breaking Promises. This is the kind of book I wish I could get my hands on more often. Pure excellence!"}, {"userName": "Carolyn", "userReviewDate": "Jul 20, 2014", "userURL": "http://www.goodreads.com/user/show/6917462-carolyn", "userReview": "Keeping secrets is always a very bad idea. It was good, but there was so much angst, deception and unexplained backstory, I had a hard time getting really into it. Why were Lawrence and Margaret so evil and grasping, yet still determined to part of the Society of Friends? The 'Quakers' were not the same as Puritans, they typically had a close relationship with God, not just a 'religion' Nothing about these characters (any of them) seems to indicate that."}, {"userName": "Ellen Christian", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/2606277-ellen-christian", "userReview": "Keeping Secrets truly fascinated me. I loved learning more about the time period that the characters lived in and about what life would be like in The Society of Friends. The author really did an amazing job with details and I really felt like I got to know each character in the story. If you enjoy Christian romance, I definitely recommend Keeping Secrets by Donna Hechler Porter."}, {"userName": "Denise", "userReviewDate": "Jul 11, 2014", "userURL": "http://www.goodreads.com/user/show/32992687-denise", "userReview": "Delightful read! Loved the strong characters whose secrets are slowly revealed layer by layer throughout the book, pulling you in emotionally as if you are there and leading you all the way to the end. You've got to read this book--it's fresh and artfully written! Loved it!"}, {"userName": "InD'tale Magazine", "userReviewDate": "Jan 10, 2015", "userURL": "http://www.goodreads.com/user/show/13341540-ind-tale-magazine", "userReview": "This is a beautifully written story, but it tends to drag due to too much detail.Read full review in the 2015 February issue of InD’tale Magazine."}, {"userName": "Laney", "userReviewDate": "Jul 07, 2015", "userURL": "http://www.goodreads.com/user/show/4597628-laney", "userReview": "I really enjoyed this historical fiction. It was engaging and clean. It was very different than I expected, and I liked seeing a glimpse into the Friends society."}, {"userName": "Ashley Burner", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/44342789-ashley-burner", "userReview": "Unique historical opens your eyes to an interesting way of life and how so many values have changed. Loved the imagery this author creates."}], "description": "This is an alternate cover edition for ASIN: B00KK87I66A woman with a past, a man determined to uncover the truth, and a secret that could tear them apart forever. A Grieving Husband: Amon Cayle needs a seamstress. He has spent the last year rebuilding his life after the tragic death of his wife in a kitchen fire, the same fire that nearly took the life of his eldest son as well. The business of grieving their loss, as well as the work of his tobacco plantation, has caused him to neglect the simplest of tasks. His family now needs clothes and despite his dislike for Mary McKechnie, and their shared past, he offers her the job.A Desperate Mother: Mary McKechnie needs a job. Her brother has threatened to take her daughters and place them into indentured service if she can’t provide for them. He hasn’t made it any easier by insisting she work only for fellow Friends. When Amon Cayle offers her a job, she has little choice but to accept.A Devastating Secret: The last time Amon spoke with Mary, after she walked away from him into the arms of another man over twenty years ago, she assured him she was not keeping secrets. He didn’t believe her then, and he doesn’t believe her now. While she is working for him, he is determined to find answers. She is just as determined to not give them. Will Mary be able to save Amon from the past? Or will his love threaten to destroy them both?Keeping Secrets is the first book in the Children of the Light Series. The Society of Friends (Quakers) and colonial Virginia in the years preceding the French and Indian War provide the backdrop for this sweeping historical about families trying to live their faith in a new land. Following Keeping Secrets will be the second and third books of the trilogy: Breaking Promises and Binding Fire.", "title": "Keeping Secrets (Children of the Light #1)", "url": "http://www.goodreads.com/book/show/25314505-keeping-secrets", "average": 4.0, "cover": "https://images.gr-assets.com/books/1428415374l/25314505.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/8172831.Donna_Hechler_Porter", "name": "Donna Hechler Porter"}], "type": ["Historical", "Historical", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/25314505-keeping-secrets", "http://www.goodreads.com/book/show/22041549-keeping-secrets", "http://www.goodreads.com/book/show/22597169-keeping-secrets", "http://www.goodreads.com/book/show/22590780-keeping-secrets", "http://www.goodreads.com/book/show/25596435-breaking-promises", "http://www.goodreads.com/book/show/26814074-binding-fire", "http://www.goodreads.com/book/show/32806218-will-someone-please-shoot-the-cuckoo", "http://www.goodreads.com/book/show/36515432-the-rood", "http://www.goodreads.com/book/show/28242198-the-children-of-the-light-trilogy"]}