{"ratings": 2137, "userreviews": [{"userName": "Skyler Autumn", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/12859342-skyler-autumn", "userReview": "1 Star (Generously) Kate is a typical small town girl living in a lonely world ; ) She is back from a girls trip to Turkey to get over the end of a 10 year relationship with her high school sweetheart. Now that can be tough on a 28 year old let alone add the fact she fits the exact description of the women in her small town being strangled to death at night. Call her paranoid (I know I did) but Kate starts to suspect that she's being watched and perhaps she's the next victim that caught the eye of our serial killer. For the longest time I couldn't figure out why I disliked this novel so much. Was it the overly simplistic writing? Sure. Underdeveloped characters? Maybe. Obvious villain? Not a great sign when you figure out the antagonist in chapter one but its not a deal breaker for me. Or is it the clearly formulaic writing style? I don't thinks so, if I was going to write off a novel every time it followed an obvious formula I would never be able to read a book in the YA genre again.No there was something more, something that borderline irritated me with how this novel was portrayed and then it hit me. This novel treats its readers like they are IDIOTS. Its patronizing. Every point made, every twist concocted is then thoroughly explain as if we the readers are unable to draw basic logical conclusions. In a word this novel is completely void of any form of subtly. It feels as if everything is spelled out in big bold red letters, surrounded by flashing lights and then followed by a DO YOU UNDERSTAND NOW IDIOT? Maybe this is more my pet peeve then others but I do not like to be talk down to in the books I read, as if the author has to dumb down every point and then repeat it more carefully and slowly so I, a lowly reader, am able to understand the genius that is their writing. Give your readers the credit they deserve. After reading the brilliant Big Little Lies just over a week ago it is clear that there is a right way and a wrong way to write about domestic abuse. The severe juxtaposition of the handling of such a sensitive issue just made me appreciate the brilliant complexity that is Liane Moriarty's writing, and unfortunately just showcased the amateur-ish writing of Alex Lake, and that they bit off more then they could chew trying to tackle the intricacies of domestic violence. So overall there is way too many brilliant thriller writers out there for me to return to another Alex Lake novel, but at least Killing Kate did one good thing for me it made my love for Big Little Lies even stronger."}, {"userName": "Laura von Eden", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/51197670-laura-von-eden", "userReview": "Kate hat sich nach vielen Jahren von ihrem Jugendfreund Phil getrennt und genießt nun das Leben. Jedenfalls möchte sie das gerne tun, aber in ihrem beschaulichen Wohnort geht ein Serienmörder um. Dieser ermordet mit Vorliebe junge Frauen, die Kate erschreckend ähnlich sehen. Ihr Exfreund scheint außerdem nicht sehr gut mit der Trennung klar zu kommen. Gibt es da vielleicht eine Verbindung?Bereits zu Beginn des Buches wird jedoch noch eine weitere Storyline angedeutet. Kate gehörte mit 3 weiteren Freundinnen zu den sogenannten ‚Fab Four‘. Doch eine der Freundinnen, Beth, scheint nicht mehr zur Clique zu gehören und man bekommt das Gefühl, dass Beth irgendetwas passiert sein muss. Warum Beth nicht mehr zur Clique gehört, erfährt man jedoch erst sehr viel später, da sich das Buch zunächst mit Kate beschäftigt.Kate wird als eine sehr sympathische und auch liebenswerte Person, mit Ecken und Kanten dargestellt. Man kann sich gut in sie hineinversetzen, nur manche Aktionen von ihr fand ich etwas drüber. Man kann verstehen, dass Kate sich angesichts der Tatsache, dass alle Opfer ihr sehr ähnlich sind, sehr fürchtet. Glücklicherweise wurde sie aber nicht als paranoide Jungfer in Not dargestellt, sondern eher recht besonnen.Der Thriller war insgesamt wirklich sehr spannend, da stets neue Dinge passierten, so dass man merklich das Gefühl hatte, dass sich die Situation zuspitzt. Einen großen Minuspunkt gibt es jedoch für mich – die Vorhersagbarkeit.Vielleicht mag es daran liegen, dass ich einfach schon sehr viele Thriller gelesen habe, aber im Prinzip hatte ich schnell einen Verdacht, wer hinter all den Vorfällen steckt, wenngleich der Beweggrund dahinter doch nochmal eine Überraschung war. Trotzdem gab es einfach so viele Hinweise auf den/die Täter*in, dass es eigentlich schon wieder zum Schmunzeln war. Hat der Autor wirklich so plumpe Hinweise eingebaut? Einzeln betrachtet, mag man da vielleicht noch nicht auf die Auflösung kommen, aber insgesamt hat es schon ein sehr eindeutiges Bild ergeben.Ich kann nicht mal genau benennen, warum mir dieses Buch trotzdem unglaublich gut gefallen hat, vermutlich lag es am tollen Schreibstil des Autoren und dass trotzdem immer wieder versucht wurde, andere Personen zu verdächtigen. Es wurde einfach nicht langweilig und selbst nach der Auflösung folgten noch über 100 Seiten voller Spannung.Insgesamt hat mir das Buch wirklich gut gefallen, auch wenn sich mein schneller Verdacht zum Ende hin bestätigt hat. Wer hier genauso schnell den/die Täter*in errät, ist vielleicht trotzdem vom großen ‚Warum‘ überrascht, denn darauf wäre ich auch nie gekommen."}, {"userName": "Joanne Robertson", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/25524955-joanne-robertson", "userReview": "It was a nice surprise to see this for sale on Amazon although after all the hype that surrounded After Anna when it was released, Killing Kate has rather crept in the back door without much of a fanfare! I thought that After Anna was a decent enough read so after reading a sample chapter of Killing Kate I downloaded the rest and settled down to read.The thing that attracted me most from the sample was the fact it was set locally to me, around the Warrington area and I'm always a sucker for a Cheshire based book especially a psychological thriller. But beyond that, I really loved the idea that a killer was going around killing women who looked exactly like Kate, even though I had to suspend belief that they all coincidentally lived in or around the same village as her. There is obviously a back story surrounding the group of three friends, which once included a fourth, and the book starts with them on holiday in Turkey where Kate meets Mike, also coincidentally from the same area. And at home brooding about their recent break up, Kate's long term boyfriend Phil is trying to get back on the dating scene whilst battling an addiction to stalking his ex. All great so far! I have to admit that, like before in After Anna, i did work out what was going on pretty early in the book. But because I was aware that this would probably be the case I was able to just relax and enjoy the ride, especially the last quarter of the book where things do get rather dramatic and exciting, if a little bit far fetched at times. This is a book that you will probably want to devour in one sitting, rather like I did. It's a fun and easy to read grip-lit full of unlikable characters which seems to be a bit of a theme for Alex Lake. And it was nice to be able to picture the settings as I went along, Jodrell Bank being a particular favourite, alongside the good old M6 bridge The Thelwall Viaduct.Worth a look especially if you really enjoyed After Anna and I have to say that for me personally, Killing Kate does have the slight edge."}, {"userName": "Karen", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/1119019-karen", "userReview": "Kate Armstrong has just broken up with her long-time boyfriend Phil and, together with a couple of friends, goes away on a short break to Turkey. Her ex is not taking the split well and develops obsessive stalking tendencies, in the misguided idea that Kate will reconsider and they can get back together.In the meantime, Kate realises that she has the freedom to enjoy her new single status and takes full advantage; that is, until she returns home and discovers that women who look just like her are being murdered.Killing Kate is just the type of book I enjoy – it’s an extremely well written, fast paced, serial killer thriller and okay, it wasn’t difficult to work out quite early on who the killer was but this didn’t spoil my enjoyment at all and I just immersed myself in the story. I may have worked out the ‘who’ but certainly not the ‘why’ and this was where the story became more intense and twisted.The main characters were very well developed and realistic. Part of me despised Phil for being so full of self pity and for virtually begging Kate to take him back – I wanted to shout at him to man up but at the same time, I couldn’t help but feel sympathy for him. They had been together for over 10 years and now suddenly his life had completely changed – he’d lost his home and his lover and was reduced to relying on a friend’s generosity for somewhere to live. Likewise I had a lot of time for Kate – she was sensible and goodhearted but despite this she made some rather dubious choices which you could just see would come back and bite her. Everyone has a back story and in this case, the separate strands between the present and five years earlier tie up very well to form a dramatic conclusion.The dialogue, the descriptive writing, the short chapters – these all hooked me in straight away and even if the story did become perhaps a little incredulous towards the end, it was one of those reads that I didn’t want to put down. Definitely recommended if you like a twisty, tension filled story.The name ‘Alex Lake’ is a pseudonym of a British novelist and this is the second book published under that name. I do have the author’s previous thriller (After Anna) on my shelf to read which I bought ages ago and haven’t got round to and after reading this I’m hoping to bump it up the TBR mountain. I am also very intrigued to know who the author really is – if anyone knows, please tell!"}, {"userName": "Sam (Clues and Reviews)", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/20224869-sam-clues-and-reviews", "userReview": "Kate returns from a post break-up holiday with her closest friends as news of a serial killer, dubbed the Stockton Heath Strangler, hits in her hometown; all the victims look like Kate. Reeling from his breakup with Kate, Phil is drinking more and blacking out and once he is questioned in the connection to the murders, Kate wonders if the man she had spent ten years of her life with could be a killer.Killing Kate by Alex Lake is a serial killer thriller following Kate Armstrong was my first experience with a work by this author; I’ll have to admit, it was a fairly addicting read. I was able to read this one easily over the course of a few hours. Filled with red herrings, a mix of past and present events, along with a plethora of complex characters, this one had me wanting more.The novel opens with Kate, fresh from her breakup with Phil, returning from a trip with her friends. Once she arrives home, she cannot escape the news of a serial killer who has been running rampant and strangling his victims throughout her neighborhood. The victims all look like Kate. As the killer claims for victims, Kate becomes increasingly more paranoid as she feels she is being followed. Her ex-boyfriend quickly becomes a suspect and Kate turns to her new boyfriend for comfort. As she searches for the truth, she stumbles upon something much more sinister.Lake fills the plot with red herrings and has the reader consistently asking questions. The story is told through the perspectives of Kate and Phil, the reader is forced to question, which narrator is reliable and who should be trusted. The “Kate” narration further ventures into the past as we delve into the discussion of her friend Beth and how her group of four became a trio. I was left wondering (and puzzled) to how this was all related. Once I realized, I was impressed with Lake’s ability to weave it all together.Although I did find the plot “twist” to be quite predictable, I did enjoy the end of the novel and found the story enjoyable long after the killer’s identity is revealed. I would recommend this novel for anyone who likes a fast paced thriller and wants to “sit back and enjoy the ride”. This one releases January 31, 2017. Thank you to Alex Lake, Harper360 and Edelweiss for a digital copy of this novel; it was my pleasure to provide an honest review."}, {"userName": "Liz Barnsley", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "I was a fan of Alex Lake's \"After Anna\" so I was looking forward to reading Killing Kate - and once again it was totally addictive. I do love a good serial killer thriller and thats kind of what you get here with an added mystery back story and a clever engaging plot.So women are being murdered - they all look somewhat like Kate. Kate meanwhile is going through a divisive break up and with this on top its a worrying time. Alex Lake weaves a fast moving and highly readable story here surrounding Kate's past and her present issues. We also hear from her ex who is not coping with the break up well at all - but could he be dangerous? And what did happen when four friends became three?The author teases things out nicely, I love the writing too it just gets right to the heart of the characters and keeps the reader guessing, if you like crime and thrillers its bang on target. Overall really really enjoyed this one. It'll keep you up at night!Another Killer Read from Killer Reads.Recommended."}, {"userName": "Claire Finlayson", "userReviewDate": "Nov 25, 2016", "userURL": "http://www.goodreads.com/user/show/52079817-claire-finlayson", "userReview": "Killing Kate has an intriguing premise, and that is about it for the good things I can say about this book. In between the direly predictable plot, and the narcissistic irritant of a main character, there was not much left to enjoy. I found myself willing the killer to catch up with Killing Kate (pun absolutely intended) just so I could stop wanting to do it myself. I could write page after page about why Kate is a nuisance, but I will spare anyone who is reading that misery. I have a sneaking suspicion that the big reveal was meant to be a \"gotcha!\" moment, but it was akin to a game of hide and seek, where you can see the person's feet sticking out from under the curtains, but have to keep up the lame pretence of not knowing where they are for the sake of the game. Just don't. There's better books out there if you're looking for this kind of read that you don't need to waste your time on this one. Do not recommend."}, {"userName": "Elizabeth", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/14882361-elizabeth", "userReview": "serial killer is stalking your home town.He has a type: all his victims look the same.And they all look like you.Kate returns from a post break-up holiday with her girlfriends to news of a serial killer in her home town – and his victims all look like her.It could, of course, be a simple coincidence.Or maybe not.She becomes convinced she is being watched, followed even. Is she next? And could her mild-mannered ex-boyfriend really be a deranged murderer?Or is the truth something far more sinister?What did I think:5 starsThis book was amazing, once I started reading I couldn't put it down, I had to know what was going to happen next, and who the killer was and why was he picking girls that looked like Kate, of course I had to re start it but that because I lost my place and couldn't remember where I was , but just look before I was pulled into the story, it does touch on abuse , but it doesn't take any thing away from the story. I do have to say that it does play with your mind a little bit .So if your looking for a good thriller then this might be what your looking for."}, {"userName": "Danielle (The Blonde Likes Books)", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/19967008-danielle-the-blonde-likes-books", "userReview": "Kate has just broken up with her high school boyfriend after a 10 year relationship, and all she wants is to have fun, and figure out what she’s like as a single woman. Unfortunately, recent murders in her hometown have her on edge. When she realizes that all of the murdered women look eerily similar to her, she begins to worry.She especially starts to panic when she can’t shake the feeling that she’s being watched and followed. When he ex-boyfriend gets dragged into the investigation, she wonders if the murder is much closer to home than she ever realized. Will she be the next victim? Will her past come back to haunt her?I really enjoyed Killing Kate, as it was a thriller, but also had some aspects that reminded me of chick lit – a lot of focus on her friendships, relationships, and personal growth, so I loved that mix. The book builds slowly, starting with weird events happening around Kate with some flashbacks to Kate’s past mixed in. The last quarter of the book is where things really picked up, and I read all of that part through to the end because I wanted to know how it would end!I definitely pegged the killer and motives from very early on, so the twists didn’t come as a shock to me, but I enjoyed the book none the less. It was easy to read, and when I was reading it, I always got sucked into the book and engrossed in the story.All in all, this was a 4 star read for me, and it won’t be the last thing I read by Alex Lake!"}, {"userName": "Yellagirlgc", "userReviewDate": "Dec 03, 2016", "userURL": "http://www.goodreads.com/user/show/19324853-yellagirlgc", "userReview": "I received a copy of this book from Edelweiss and the publisher for my honest opinion. Action! Suspense! Character development. All included in Killing Kate by Alex Lake. This was a five star read by an author that knows how to write the psychological suspense I'm a huge fan of. Once you figure out what's going on the action doesn't stop there. Great read to the last page."}, {"userName": "Dayle (the literary llama)", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/5597352-dayle-the-literary-llama", "userReview": "RATING: ★★☆☆☆ / 2 Good Idea but Very Predictable stars.REVIEW: I received this book from Harper360 in exchange for an honest review.I'm not quite sure where to start. I feel a bit lackluster about writing this review because, frankly, the book was lackluster. So this may just be a very short review.The overall idea is fantastic. I mean, of course it is, I wouldn't have picked up the book and read it if the synopsis and overall idea wasn't intriguing. A women notice's that a recent serial killer's victims all resemble her. That suspenseful beginning could go in a number of different and thrilling directions and I wanted to find out which it was......Unfortunately, it didn't go far.There was no real mystery. Everything was predictable and just when you were hoping that the author would prove you wrong and show you how she was making it look predictable in an effort to blindside you with a thrilling surprise and turn everything on it's head, well...you were just greeted with everything you had already surmised.Beyond the plot, the writing was a tad dull and slow. I didn't feel driven to finish this book, unless you count just wanting to be done because i was bored. The characters weren't intriguing enough or particularly likeable. In these types of books you expect a level of naivete in the lead character but you don't want them to be outright stupid... and Kate was bordering on stupid. She would have exasperated me but I was beyond caring by mid-book.Overall, I feel there are better books in this genre to devote your time to reading."}, {"userName": "Poppy fairy ", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "Review by www.ireadnovels.wordpress.comHold your breath 1. 2. 3. Get set go, start reading Killing Kate, but be warned I did just recommend that you hold your breath before reading. If you thought that After Anna was a nightmare of a thriller, then I can a sure you all Killing Kate is much frighteningly better. Kate, May, Gemma, and Beth were four best friends, from their first days at infant school. Kate had finished with her boyfriend Phil. It broke Phil's heart that Kate didn't love him any more. Kate, Gemma and May go to Turkey for a holiday. While they are in Turkey Kate sleeps with a man who she can't even remember his name. When Kate arrives home the news of a serial killer is killing young women that seem to look just like Kate. Is Kate being watched and followed. Who is killing victims that look like Kate? So much happens with twist and turns I was breathless reading every page. Killing Kate is so much of a page turner I very, very highly recommend it."}, {"userName": "Stephanie", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/9958229-stephanie", "userReview": "3.5 Stars. Short chapters just make books so much more readable and I must say that they served this book really well. Even though the pace was actually pretty slow, the short chapters kept the suspense up and made it so much easier to say \"just one more chapter\" long after I should've stopped reading. As for the story itself...it was ok. It was kind of a different angle of a serial killer book and I liked that. Kate was not a very likable character. I preferred the chapters from her ex-boyfriend's POV, Phil. A little over half way through I guessed who the serial killer was and what the slight \"twist\" with it was. It wasn't too long after that that everything was revealed, but then it just drug on and on and on. I was not at all satisfied with the ending. However, the fact that I found it addicting for a while is bumping my rating up the extra half star."}, {"userName": "Donna Hewitt", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/38807249-donna-hewitt", "userReview": "First half of the book was really good. Unfortunately second half was not so good and quite predictable. It was a shame as it could have been a really good book otherwise.Ok book"}, {"userName": "Luke", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/58254885-luke", "userReview": "killing Kate was a good read but not fast paced enough for me"}, {"userName": "Paula  Phillips", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/1969584-paula-phillips", "userReview": "Kate and her friends were close growing up, and they were a foursome that no-one could split up. That was until five years ago when something tragic happened to her friend Beth. Kate was the only one who could see what was happening with Beth and her new boyfriend Colin but didn't help till it was too late. Five years later Kate is re-evaluating her life and has just split up from her high school boyfriend Phil and headed to Turkey on holiday with her friends Gemma and May. Kate has a one-night stand in Turkey and is enjoying her life. Meanwhile back home, a serial killer is on the loose, and all the victims look just like Kate. They could be her sisters. They all have what Kate's grandmother called The Old Irish Look. As Kate returns home, more woman her age turn up dead and then when her ex-boyfriend's new girlfriend is a victim, he becomes the main suspect. Is Phil the killer, killing because Kate broke his heart or is the killer someone else close to Kate? About 3/4 quarters of the way through the book when old cases were surfaced, I guessed who the killer was but then it wasn't till near the end of the story that I figured the reason behind the killing and why Kate was targeted. If you love murder mysteries and ones set in the UK that are fast-paced, then Alex Lake is an author to add to your list, this is the second book I have read by Alex Lake."}, {"userName": "Cindi", "userReviewDate": "Jul 08, 2017", "userURL": "http://www.goodreads.com/user/show/3559694-cindi", "userReview": "This is a really good thriller by an author I'd never read before. My only real issue is that I figured out who the killer was way too soon. That didn't (really) take away from the story but it was a little too predictable.I actually purchased After Anna, the author's debut novel, before this one. I'm eager to start on it after reading Killing Kate.Overall, a nice thriller. The main character, Kate, had a few TSTL moments but it was still an entertaining read.Full review can be found at -"}, {"userName": "Rhian Eleri", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/78434507-rhian-eleri", "userReview": "This is a story that feels like its building up to a killer twist. I knew from the first few pages that bad vibes were coming...and that something had happened in the past was going to catch up with kate and her friends. I had a couple of theories, and was a little bit dissapointed that i had guessed the outcome pretty much in the beginning. Even though i did fall for some red herrings along the way. but deep down, always knew what was going on! Maybe i expect bigger things when it comes to psychological thrillers. I have given this 4 stars because it gripped me, it just didn't give me the shock element that i like to get. The first half of the book is a time to read and enjoy, speculate and make the most of it because the second half (or somewhere around the middle...) the twist is revealed. mystery solved. speculation over. so second half is all about the tying up of the story, explanations, and reveals. i half expected a more shocking twist towards the end but it never came."}, {"userName": "Lisa Houston", "userReviewDate": "Nov 04, 2016", "userURL": "http://www.goodreads.com/user/show/42863563-lisa-houston", "userReview": "Loved Killing Kate. Its the 2nd book of Alex Lake's ive read and I wasn't disapointed.There's a serial killer on the loose in your area. He's only killing females that look like you. That's what happened to Kate. She was the main character in the book. You could feel a real empathy to Kate. While this was going on she was going through a messy breakup with Phil. He was finding it hard to let her go. Following her at night, turning up where she is. She then finds out someone has been hacking into her emails. Is it Phil? Lots of twists and turns. Couldnt put this book down. At one point guessed who the serial killer was. But couldn't have predicted how twisted, and what lengths he would go to. Highly recommend this book"}, {"userName": "Kate", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/5737182-kate", "userReview": "Absolutely fantastic! I loved After Anna and this is even better."}, {"userName": "Jamma", "userReviewDate": "Feb 17, 2017", "userURL": "http://www.goodreads.com/user/show/4309712-jamma", "userReview": "Well this was just awful. The author would continually repeat herself just in case we didn't get it the first time. I guessed the killer way at the beginning - nothing exciting about this book"}, {"userName": "Michelle Trainor", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/9695180-michelle-trainor", "userReview": "This was my first Alex Lake book. It was a little painful for me to read. It was just so obvious what was happening here. I prefer my suspense novels to have more shocking twists. I predicted this book from the first chapter. This novel is narrated in third person from Kate's POV mostly but had a few chapters from Phil, Kate's ex-boyfriend's POV. The premise was interesting where girls in Kate's hometown are being murdered and they look exactly like her. I think a lot of people will still enjoy this novel. It just wasn't for me."}, {"userName": "Dorie", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/15981415-dorie", "userReview": "Couldn't do it.Kate had zero personality, I was waiting for her killing to begin.Come to think of it, none of the characters really had any memorable qualities.Terrible, amateur writing. Hokey, inconsequential dialogue. Drawn out small talk. Unnecessary repetition - yes ALL of us readers remember that someone flashed their high beams while driving behind Kate, we don't need a summary of events each time Kate talks to the police. Jesus someone please kill her already. Kill them all. I was cheering for the serial killer in this one.Did not finish. Made it to about 45%."}, {"userName": "Megan", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/1229290-megan", "userReview": "Predictable and boring. I guessed the killer halfway through the book. I also disliked the main character and her actions in the epilogue seemed contrived and fake. I am surprised at how many 4 and 5 stars this book received."}, {"userName": "Gillian Ashton", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/27641106-gillian-ashton", "userReview": "Poorly Written. Couldn't get past that at all."}, {"userName": "Tamara", "userReviewDate": "Jan 11, 2017", "userURL": "http://www.goodreads.com/user/show/7757267-tamara", "userReview": "Review to come closer to pub date.Quick thoughts: I wanted to LOVE this book. It had a great plot, but it just never did grab me completely. There were some excellent suspects and the reveal of the bad person was quite good. Loved the cover! Maybe the cover and summary set my expectations too high.All in all- worth a read. But I doubt I'll ever re-read."}, {"userName": "Kris - My Novelesque Life", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/6275022-kris---my-novelesque-life", "userReview": "(I received an ARC from the EDELWEISS)RATING: Half STARThis is my second \"suspense\" novel by Alex Lake and I think I am now finished with Lake. I find that his mysteries are too easy to figure out, and there is no suspense in his psychological thrillers. I may be in the minority regarding this book as it has a 3.9 rating on Goodreads. It just wasn't my cup of tea."}, {"userName": "Anja", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/17225015-anja", "userReview": "Was für ein Buch! Was ist mit Beth passiert!!??? Das war die erste Frage, die ich mir schon nach der ersten Seite gestellt habe.Gleich darauf lernt man Kate kennen, die sich von ihrem langjährigen Freund Phil getrennt hat und nun ihr Leben genießen will. Also fliegt sie erst einmal in Urlaub, allerdings wird sie dort schon mit der Mordserie in ihrer Heimatstadt konfrontiert, die sich auch nachdem sie wieder zu Hause ist, weiterzieht. Das Buch war durchgehend wirklich sowas von spannend, das aufhören zu lesen ein Ding der Unmöglichkeit war! Wirklich JEDER war hier verdächtig, viele falsche Spuren und und Ungereimtheiten sorgen dafür, das man hier null Plan hat wer der Serienmörder sein könnte, weil es einfach auf jeden gepasst hat. Ich hatte immer wieder mal einen anderen Verdächtigen und war absolut ratlos.Das Leben von Kate wurde sehr gut und bildlich beschrieben, ich fand Kate war ein sehr, sehr starker, tougher Charakter und ich habe es geliebt über sie zu lesen. Die Angst, die sie beherrscht, war zum greifen nahe. Selbst ich hatte beim lesen so oft Angst und eine Gänsehaut, die ganze düstere Atmosphäre hatte mich völlig im Griff. Ich an ihrer Stelle wäre schon längst durchgedreht, aber gut, da war Kate auch mehrere kurz davor und an Schockmomenten wurde hier auch nicht gespartAuch die restlichen Protagonisten waren durchweg einfach nur interessant. Vor allem Phil war mir mehr als oft ein Rätsel, weil ich mir einfach nicht erklären konnte, ob er nun etwas zu verbergen hat oder nicht, denn eigentlich ist er ja ein sehr liebenswerter Mensch? Bis man dann als Leser endlich erfährt, wer der Täter ist und die Frage um das unglaubliche \"Warum\" gelüftet wird, passiert noch einiges, was ich nicht erwartet hätte und war mehr als einmal absolut überrascht. Selbst am Ende, als man dann weiß wie alles zusammenhängt und denkt, das Buch ist nun abgeschlossen, passiert nochmal etwas so unerwartetes....das hätte ich nie für möglich gehalten und war eine völlig unerwartete Wendung. Ich war restlos begeistert von dem Buch, welches übrigens ohne Fragen abgeschlossen ist, und kann es einfach nur empfehlen!"}, {"userName": "Laura", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/9481759-laura", "userReview": "I really hate to give a bad review but I didn’t like this at all. I didn’t mind so much that I figured out who the killer was right off the bat, I mean it was pretty obvious, but that doesn’t always matter as long as I can still enjoy the story as it unfolds. This however, there just really wasn’t anything compelling about it. The villain and the related twist was hokey and unbelievable. The characters were boring and hard to relate to. Kate was just dumb, constantly giving out too much information to people she barely knew. In any other situation this might have helped the plot along but this girl already knew there was a killer out there who was most likely targeting her. Idiot. It makes no sense that she would run her mouth like that. And what about her stupid friend Gemma who thought it would be a good idea to set up an online dating profile in the middle of all this madness? Yeah! Let’s do it. Great idea. The worst part about this entire book was the constant over-explaining. It was so insulting to the reader. And not only did it happen between the killer and Kate but then again, in great detail between the killer and another character. And there were lots of other instances of it all throughout. I thought the whole captivity scene was idiotic. Especially the part about the broken teeth. I think it would take a significantly longer amount of time to break one’s teeth while chewing leather than what was shown in this book and that’s if it’s even possible to begin with. I mean it’s leather. It can stretch. It’s pliable. Unless her teeth were already brittle and bad to begin with, I just don’t see it happening, not in the amount of time that it did anyway."}, {"userName": "Chandra Claypool (wherethereadergrows)", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/9722719-chandra-claypool-wherethereadergrows", "userReview": "Kate goes on holiday to Turkey with her best girlfriends as a get away after a rough break up with her boyfriend, Phil, who she had been with for 10 years. Upon her return, she learns of a killer in her hometown. After the second and then third murder, it becomes clear that the girls look eerily like her. Phil is acting erratically as he is not taking the break up well at all. His obsession with her and the fact that one of the girls he \"dated\" after her was one that was murdered does not bode well for him trying to prove his innocence. Are these just coincidences, or is something more happening? Past secrets come to play and now she is in a race to save not only herself but the people closest to her.This was a very fast and fun read. I felt the plot twists were easy to see coming and my guesses were proven quite quickly. I did like the author's writing style in the fact that every time I had a question, it's like she read my mind and addressed it within the next few pages. Recommend for anyone wanting a page-turner of a one sit read."}], "description": "A serial killer is stalking your home town.He has a type: all his victims look the same.And they all look like you.Kate returns from a post break-up holiday with her girlfriends to news of a serial killer in her home town – and his victims all look like her.It could, of course, be a simple coincidence.Or maybe not.She becomes convinced she is being watched, followed even. Is she next? And could her mild-mannered ex-boyfriend really be a deranged murderer?Or is the truth something far more sinister?", "title": "Killing Kate", "url": "http://www.goodreads.com/book/show/30037038-killing-kate", "average": 3.9, "cover": "https://images.gr-assets.com/books/1469403672l/30037038.jpg", "reviews": 219, "authors": [{"url": "https://www.goodreads.com/author/show/3525499.Alex_Lake", "name": "Alex Lake"}], "type": ["Fiction", "Suspense", "Thriller", "Mystery", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/30037038-killing-kate", "http://www.goodreads.com/book/show/36486714-jeden-tag-geh-rst-du-mir", "http://www.goodreads.com/book/show/31556531-killing-kate", "http://www.goodreads.com/book/show/25801299-after-anna", "http://www.goodreads.com/book/show/33026842-copycat", "http://www.goodreads.com/book/show/38925213-copy-cat", "http://www.goodreads.com/book/show/36601144-jeden-tag-geh-rst-du-mir", "http://www.goodreads.com/book/show/37677610-the-last-lie"]}