{"ratings": 1782, "userreviews": [{"userName": "Andreea Pop", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/4858513-andreea-pop", "userReview": "UPDATE: New death date, as you might already know: Sep 2018. Let the waiting commence yet again.UPDATE: It appears that our torture has been prolonged. May 2018 will be our death date, but Chaol's new book (out in September) will be our life support until our hearts explode. I DON'T EVEN KNOW IF I'M HAPPY OR NOT.***DO YOU REALIZE that 2017 will be the absolute END of us?Bye, Throne of Glass series. Bye, A Court of Thorns and Roses series (Feyre's story arc at least). Bye, life."}, {"userName": "Mirou", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/23473711-mirou", "userReview": "Waiting fot October.  THINGS THAT NEEDS TO HAPPEN: - MAEVE AND ERAWAN DEAD - SAVE AELIN 2K17 - DORIAN BEING THE KING I WANT HIM TO BE AND CLAIMING MANON AS HIS GIRL - MANON BEING THE BADASS WITCH QUEEN AND KICKING HER GRANDMA ASS - THE CADRE JOINING FINALLY AELIN - AEDION AND LYSANDRA. You two, damn you, JUST KISS AND MARRY. - LORCAN BEING A CINNAMONROLL WITH ELIDE - ABRAXOS, A LOT OF MAGIC, INCREDIBLE BATTLE SCENE AND SMUT SCENES. -  AND FINALLY, A PROLOGUE - 15 YEARS LATER WITH A LOT OF BABIES AND COUPLES LIVING HAPPY EVER AFTER. I WILL PROBABLY GO MENTAL."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": ""}, {"userName": "Nat", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "I'm already counting down for this one...  This review and more can be found on my blog."}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "Me, after the last book.Dear *insert person here that I cannot name*Ok but for real.. I need things to be fixed. I need this to be fixed. I need this book now, and I need things to be fixed like right now."}, {"userName": "Lyanna (I need a Herondale in life)", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/25237867-lyanna-i-need-a-herondale-in-life", "userReview": "Sees expected publicationI'll be on my way to college by then?! wHAT?"}, {"userName": "Warda", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "THE EDIT IS CLOSE TO A 1000 PAGES.I REPEAT:THE EDIT IS CLOSE TO A 1000 PAGES!!!!!!😭😭😭——————————————————Title and blurb in one day? I feel spoiled. As for the title... I love it. Surprise. But there's a sense of doom I can't shake off now. Ash?ASH?!!! I ain't gonna be able to make it. 😖------------------------------OMG THE FUCKIN SYNOPSIS!!!!!!!!!!!!!!MY EMOTIONS!-------------------------------How, how, HOW on gods earth that Trump is ruling do I wait till 2018 for the sixth — correction, seventh! 🎉 — Throne of Glass book?! *sobs violently* I'm gonna miss my babies too much!In other news, we're getting a full-fledged Chaol novel. *goes back to composing thine self*"}, {"userName": "emi", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/34410191-emi", "userReview": "4.5.2018 update: A title? A release date? Hahaha I'm already crying.Maybe, if we cancel this book then the series never has to end. /////Do you guys realize???? That this is going to be the LAST Throne of Glass book? Excuse me while I go cry."}, {"userName": "Caitlin", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/57334157-caitlin", "userReview": "GIMME"}, {"userName": "Viktoria Winter", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/36437228-viktoria-winter", "userReview": "Well. Now I can properly plan my funeral."}, {"userName": "Lindsay", "userReviewDate": "Jul 18, 2014", "userURL": "http://www.goodreads.com/user/show/28080810-lindsay", "userReview": "Update: it has a title! Awesome!Update: The publication date being May 1, 2018 better be just a hold for now. Or a joke. Because that is not funny. I need more of this lovely world and amazing people in my life or whatever.Dear Ms. Maas,I need this book. Please give us the title. Or the cover. And maybe an excerpt. Or maybe just the whole book.Sincerely,A fangirl curled up into a little ball in the corner possibly from Manon withdrawals/Manorian withdrawals/general series withdrawalsP.S. You are welcome to and encouraged to continue the series for a long time, or at least make tons and tons of awesome short stories about amazing characters, included, but not limited to Manon and Dorian. Thank you! :-)"}, {"userName": "Melanie", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "[April 5th, 2018] And now a title? We have been blessed. Well, I mean, except that the title is kind of scary and all. [April 4th, 2018] Holy shit the synopsis is up and... goosebumps. BUT HOLY SHIT - Major spoilers for the series and for ToD, so use caution! But... I'm so damn excited! #0.1) The Assassin and the Pirate Lord ★★★#0.2) The Assassin and the Healer ★★#0.3) The Assassin and the Desert ★★★★#0.4) The Assassin and the Underworld ★★★★★#0.5) The Assassin and the Empire ★★★#1.) Throne of Glass ★★★#2.) Crown of Midnight ★★★★#3.) Heir of Fire ★★#4.) Queen of Shadows ★★#5.) Empire of Storms ★★★#6.) Tower of Dawn ★★★★★Blog | Twitter | Tumblr | Instagram | Youtube | Twitch"}, {"userName": "Candace Robinson", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/33995641-candace-robinson", "userReview": "Love the title and so ecstatic it will come out a week earlier!!Even though this will be released just a month later, at the end of October I might add, it is still torturous as all hell to wait. Lol!Tower of Dawn has made the wait for this one completely worth it! I am so scared for all my favorite babies and what is going to happen to them!!September 2018 now???? I'll be okay. I. Will. Be. Okay! ACOTAR novella will solve this problem for me!May of 2018????? When did this happen??? I am going to go have a cry now."}, {"userName": "Hadeel Moh", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/13570136-hadeel-moh", "userReview": "UPDATE:*Apr 18, 2017*2018?! .....................*Aug 26, 2013*2017...???!!!?!?!?!"}, {"userName": "Andrea", "userReviewDate": "Jul 08, 2013", "userURL": "http://www.goodreads.com/user/show/6281284-andrea", "userReview": "I just read Empire of Storms for the fourth time. I'm in a book coma for the fourth time again.Is it October yet??????? Just asking for a friend. -oh my god, omg finally we have a title. Kingdom of Ash. Aelin will burn everything to ash, it'll be epic.----I'm in a book coma after reading Empire of Storms.This is the point in my life that happens every year after I finish one of Sarah J. Maas books the day they released. I don't know what to do with my life anymore.The wait for this book feels like is gonna be endless and painful, and I know after this book releases I'll truly won't know what to do with my life after Thone Of Glass series end. Honestly tho, this is one of my favorite series ever. I had TOG in my TBR list even before it released and since I first read it I just fell in love with this world and characters. Year after year waiting for the next book and most of them I read them the day they released, it'll be tough knowing this is the last book and the last time I'll read about all my favorite characters. \n“My name is Aelin Ashryver Galathynius …And I will not be afraid.”"}, {"userName": "Katrin D", "userReviewDate": "Sep 21, 2016", "userURL": "http://www.goodreads.com/user/show/7018363-katrin-d", "userReview": "I need more than two SJM books per year in my life!!!"}, {"userName": "Jeff", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/68159473-jeff", "userReview": "I DON’T THINK THERE COULD BE A BETTER NAME THAN THIS BUT ALSO, I’M SHOOK, ‘KINGDOM OF ASH?’ Does this mean Aelin will be burning everything in this book? Because I’m down."}, {"userName": "Lexie", "userReviewDate": "Feb 03, 2017", "userURL": "http://www.goodreads.com/user/show/20726801-lexie", "userReview": "MAY 1ST, 2018Soooo... That just happened."}, {"userName": "⚔ Silvia ⚓", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/13306676-silvia", "userReview": "We have a title and I'm here to say that no matter what happens Manon deserves a girlfriend"}, {"userName": "Angelica", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/16201093-angelica", "userReview": "WE HAVE A TITLE!!! Kingdom of Ash... I have a bad feeling about this guys. Fire is about to start raining down on some people and shit is about to get real. All I know is that none of my children better get hurt! If they die, we riot!Followe Me Here Too: My Blog || Twitter || Bloglovin' || Instagram || Tumblr"}, {"userName": "destiny ☠ howling libraries", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/15335689-destiny-howling-libraries", "userReview": "#0.1-#0.5 The Assassin’s Blade ★★★★★#1 Throne of Glass ★★★★☆It's really not normal for anyone to be this invested in the finale of a 7-book series they've only JUST started, yet here I stand 🙃---Maybe I can actually get caught up on the series before this releases so the entirety of Goodreads can stop spoiling the last few books for me 🙃🙃🙃"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "We have a title! AND the cover is gonna be purple. 💜💜💜THE END IS NIGH."}, {"userName": "Cece ❀Rants, Raves &Reviews❀", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/66199133-cece-rants-raves-reviews", "userReview": "I AM NOT OKAY! That title. The synopisis. I’m literally a wreck right now. The waiting is endless and painful. I mean I still get f*cking tears because Empire of Storms destroyed my heart like no other bookTHINGS THAT MUST HAPPEN:- MAEVE AND ERAWAN DEADD- SAVE AELIN 2K18- DORIAN BEING THE KING I WANT HIM TO BE - MANON BEING A BADASS WITCH QUEEN AND KICKING HER GRANDMA ASS- THE CADRE JOINING FINALLY AELIN- AEDION AND LYSANDRA. JUST KISS - ABRAXOS, A LOT OF MAGIC, INCREDIBLE BATTLE SCENE AND SMUT SCENES.- AND FINALLY, A EPILOGUE - YEARS LATER WITH A LOT OF BABIES AND COUPLES LIVING AND STILL KICKING ASS oh god please Maas please my life is in your hands"}, {"userName": "J. Taylor", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/23267752-j-taylor", "userReview": "Update because the synopsis came out and here's my thoughts on it which I'm just having fun with so pre-warned:'As she endures months of torture' Can't say I feel sorry for her. However what if having this happen to her, makes her a better person? Because when she was Celaena she wasn't that bad. The potential!'with seemingly no hope for escape.' Not for long though! It's Aelin, she can get herself out of anything. 'Without Aelin to protect them, soldier Aedion and shapeshifter Lysandra need to defend their homeland at all costs.' But do you need her really? I think, you can do this.'Also left to forge their own paths in order to change history' How can you change history? But seriously, take this opportunity to forge your own paths, guys take it before she gets back and puts you on her path. 'the fae male Rowan, searches the world over for his lost love' Surely you have something better to do? Like come on mate, you can find another girlfriend in that time, one who will bring you back to the Rowan I used to like before you became Aelin's bitch. Also fae male, I know he's a male, why does that need to be pointed out? If you don't know he's a male by now, it's like mentioned multiple times how can you miss it?'Some ties will bond even tighter together, others will be severed forever' Do not break the ties between Dorian and Chaol. Anyone else is fair game but don't break them up.720 pages? I hope it's not terrible because that's a lot of pages. This is what I need: Aelin to die and then Rowan can't live without her so he offs himself. Dorian finds Chaol and decides to be a fucking king with his best friend by his side. Manon realises she's gay and rejoices with the thirteen and they live happily ever after. The immortal's decide that love dooms you hence with what happened to Rowan and become their badass selves again. And Lysandra takes the throne revealing she was only pretending to be friends with Aelin to take it and I'll be behind her one hundred percent. Aedion will discover his place with his father, not with his awful cousin. Have I missed anyone?Oh yeah Maeve, the immortals fight back and take her down, yeah!Or Aelin survives but while her and Rowan are having sex, instead of palm trees being killed, they are. That would be perfect. This is what will happen:Aelin will save herself and become the worlds worst ruler while Rowan pants at her heels. Manon will lose all her independence and ruthless spirit because dick is everything right? Elide will forgive Lorcan as will Aedion with Lysandra and all the straight couples because everyone gotto be white and straight yeah? will live happily ever after while I gag. Oh and everyone will make it, unfortunately. And there will be loads of cringy worthy, I got to go throw up, sex scenes, I shudder just even thinking about it. But one thing throughout it, I'd be like-bitch die! Save the people from her rule because even Dorian's father would not be as bad as her. No one could ever be, well not as bad as Hilter but close."}, {"userName": "Misstdennis", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/41744660-misstdennis", "userReview": "Put it this way... I’m willing to sell my left boob just so we can see the title & cover."}, {"userName": "M. ", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/38974361-m", "userReview": "Update on April 4th, 2018: The blurb was just added. And I am not okay. That is all. -------------------I'm sooooooo not ready for this book to come out. I'm actually happy I have to wait at least a year to read it because honestly, Empire of Storms destroyed my heart like no other book before and I haven't recovered yet. It's a very slow and very painful process... I still have tears in my eyes whenever I start thinking about it. I'm a mess. Thanks, Sarah J. Maas. I hate you. But I fucking love you. But I fucking hate you because you hurt me with every single word you write. But I love you because you're fucking awesome. Here's an actual picture of me reading Empire of Storms:Me, when reading the Rowaelin and the Manorian scenes:Me, when reading the last 30% of Empire of Storms:Me, right after reading Empire of Storms:Me, a few months after reading Empire of Storms:I mean, go right ahead, Sarah J. Maas. Please, do take my heart and fucking cut it in tiny, tiny pieces... I didn't fucking need it anyway. *dead*. I'm good. I'm fine. I'm really, really fine."}, {"userName": "Haadiya // Hiatus", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/55852574-haadiya-hiatus", "userReview": "update 4/5/18  okay first of all THIS TITLE IS BEAUTIFUL SHUT UP OHMYand secondly WHAT THE FXCK DO YOU MEAN KINGDOM OF ASH. IF ANY OF MY BBYS DIE ISTG Update 8/15/17 So Its been pushed back to September 2018. I don't really mind it considering it has to do with her Dad's health problems and yet SJM is still taking the time to write an ACOTAR novella for us. Plus I just don't want this series to end tbh.AGH I STILL NEED THIS.I'm sorry, I'll try to be patient.------x--------x------I can't believe this series is ending next year.I can't.I refuse to believe it."}, {"userName": "Simona Bartolotta", "userReviewDate": "Sep 13, 2016", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "An episode of Strangest Weather on Earth showed spiders raining from the sky in Brazil and in Texas. After an earthquake and a lighting storm, I demand that the main sex scene in this book be backed up with raining spiders.(If you're interested in the raining spiders... https://www.youtube.com/watch?v=aqk2X...)"}, {"userName": "Jiana", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/10502567-jiana", "userReview": "Update 05/04/2018: TITLE. BLURB. TITLE. BLURB. TITLE. BLURB. TITLE. BLURB. TITLE. BLURB.Update 17/08/2017: Soooo, TOG 7 has been pushed back yet again. It's no longer May 2018, it's set for release Fall 2018 now. SJM explains why in her latest Instagram post, here.The wait will be even tougher now, but it's completely understandable why Sarah pushed back the release date!"}, {"userName": "Karin Michael", "userReviewDate": "Apr 17, 2016", "userURL": "http://www.goodreads.com/user/show/37822801-karin-michael", "userReview": "HEY ROWAN, you can ROW your way into my arms.. am I right? Huh? Huh?I'll just LYSANDrive away, so..I'll see you in AELINttle while. Try not to CHAOL yourself, AHAH. ahaaaha, ahaha..Okay bye."}], "description": "The Final installment to the Throne of Glass series.Captured by the Queen of the Fae, Aelin is trapped inside an iron box in a secret location, with seemingly no hope for escape. As she endures months of torture, her friends scatter to different fates. Without Aelin to protect them, soldier Aedion and shapeshifter Lysandra need to defend their homeland at all costs. Also left to forge their own paths in order to change history are Chaol, the witch Manon, and the golden boy Dorian-while Aelin's mate, the fae male Rowan, searches the world over for his lost love.As Aelin gathers the strength to save herself and fight the ultimate battle of her life, all of their destinies hang in the balance. Some ties will bond even tighter together, others will be severed forever, and mysteries will be revealed in this action-packed, heart wrenching series finale.", "title": "Kingdom of Ash\n      \n          (Throne of Glass #7)", "url": "http://www.goodreads.com/book/show/38335045-kingdom-of-ash", "average": 4.62, "cover": "https://images.gr-assets.com/books/1522939209l/38335045.jpg", "reviews": 444, "authors": [{"url": "https://www.goodreads.com/author/show/3433047.Sarah_J_Maas", "name": "Sarah J. Maas"}], "type": ["Fantasy", "Young Adult", "New Adult"], "outlinks": ["http://www.goodreads.com/book/show/38335045-kingdom-of-ash", "http://www.goodreads.com/book/show/33590260-kingdom-of-ash", "http://www.goodreads.com/book/show/31050467-kingdom-of-ash", "http://www.goodreads.com/book/show/7896527-throne-of-glass", "http://www.goodreads.com/book/show/16096824-a-court-of-thorns-and-roses", "http://www.goodreads.com/book/show/17167166-crown-of-midnight", "http://www.goodreads.com/book/show/17927395-a-court-of-mist-and-fury", "http://www.goodreads.com/book/show/20613470-heir-of-fire", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}