{"ratings": 252, "userreviews": [{"userName": "Netanella", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/1157679-netanella", "userReview": "I had to push myself to finish this book, after I took an extreme disliking to the heroine early on in the story. Amberlie's choices seemed to be made for the ilks of the 90's talk-shows of Jerry Springer and Company, aimed in particular for her extreme hatred of the hero, Tedric of Woodrose. How they finally hooked up in the end is beyond my comprehension.It helps to give some background to this sordid tale: Amberlie's Norman family overthrows Tedric's Saxon one and establishes themselves in his keep. She wrongfully believes that Tedric has killed her pansied French husband, Henri. Thus, almost the entirety of the book features Amberlie's conflicted \"I hate him - he's a Saxon brute - he killed my poor Henri\" thoughts while she succumbs to his wicked, wicked ways. Only to kick him to the curb by the following paragraph.And poor Tedric is the Poster Boy for Abused Medieval Heroes in this story. He starts off as homeless, gets beaten and whipped, made to wear a slave collar and serve Amberlie her food on a trencher, thrown into the Pit, beaten by an old grandma with a stick, act like a p****-whipped teenager, takes an arrow for our cruel-hearted Amberlie, gets poisoned by the same old grandma, and finally gets shafted in the shoulder by Henri the ghost's dagger. And after all this, he still loves our beautiful, willful Amberlie. Wow. Tedric had it bad. Too bad his emasculation was just a little over the top for my taste in romance heroes. I'm all about Alphas who'll do anything for their woman, but this was just wow.The plot zigzagged back and forth as well, which kept my interest enough to finish the story."}, {"userName": "Pat aka Tygyr", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/1211886-pat-aka-tygyr", "userReview": "I read this in a bundle entitled - Hearts of Valor. Amberlie was married very young to Henri who was also very young and a Norman. They were good friends and loved each other, but had no children. They owned Woodrose Keep. Tedric, a Saxon, had owned the Keep. He and his remaining people and soldiers are hiding in the area and hope to win by arms the Keep back. In one of the battles, Henri is killed, purportedly by Tedric's hand. Julianne, Henri's mother, is filled with hate and revenge over her only child's death. Though Amberlie should be in charge of the Keep, Julianne and her brother Guy are the ones obeyed. Guy wants Amberlie and the Keep for himself. He will do anything to get them both. Amberlie does not trust him, and she tries her best to tolerate Julianne. King William is coming for a visit. He was a good friend to Amberlie's father and she knows he will arrange a 2nd marriage for her when he comes. Guy has been adding on to the Keep and training the soldiers fiercely and plans to ask for Amberlie as wife.Amberlie wanders from the Keep and is kidnapped by Tedric. While there she learns of where they plan to hide next. She is exchanged for Tedric's sister. Guy and Julianne believe she has been compromised by Tedric and even Amberlie wonders if the King will consider her less of a worthy match now. To try to prove herself, she tells of where Tedric can be found. He is captured. Guy wants to kill him, Amberlie insists he be her slave instead and the King decide his fate when he arrives.The King is not impressed by Guy or his suit for Amberlie. He is more impressed by Tedric and the fact that many of his people still work at the Keep and he has their love and loyalty, while few at the Keep like or are loyal to Guy. The King arranges for Tedric and Amberlie to wed. People try to tear them apart - Julianne, Guy, Glenna (Tedric's betrothed), Edytha (his sister). While their physical lovemaking is intense and very rewarding, they distrust each other and believe lies and misdirections. Tedric is poisoned and Amberlie is suspected. Amberlie is kidnapped again, this time by Guy as his rebellion is foiled and he is escaping. Some believe she went willingly. She is pregnant. Is it Tedric's or Guy's? Tedric believes in his love for her. All the lies are proven false. But is it too late to repair their marriage?"}, {"userName": "Jeanne Johnston", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/27559164-jeanne-johnston", "userReview": "I'm a sucker for historical fiction, but there were parts of this that just left me scratching my head. I suspect the fault lies in the fact that this... I suspect the fault lies in the fact that this was more intended as a romance novel than anything. . .Honestly, I usually root for the \"barbarians\" in a story like this--especially when their counterparts are such sniveling, pussified weasels. I'm honestly not sure why the heroine has any appeal, least of all to Tedric. She doesn't seem terribly quick on the uptake and is easily led. Even worse, as barbarians go, he's just too damned willing to turn the other cheek or run around with his tail between his legs. Yes, I get that greater numbers mean you sometimes have to bide your time, but sheesh. Forget the fickle broad and run the villain through already!This story also confuses me as far as who's who, and I'm wondering if the author even knew. The prissy heroine is Saxon, but the Normans are the barbarians? Correct me if I'm wrong, but weren't the Saxons from the frigid north and the Normans from France? I know the Vikings invaded Normandy and blended in there, too, but the way the characters are written, we've got Normans, French, Saxons, and the names don't seem to mean what they ought to. In the end, I just ignored the labels and thought of them as shirts (bad guys who thought they were all that) and skins (the good guys from the woods, appropriately hunky in the occasional pelt, even if they didn't smell as nice).I dunno. Maybe I'm just lazy and like it better when you know anyone not wearing a kilt is the bad guy. That whole Anglo-Saxon thing was a pain and only served to foist religion on all of Europe in the end.What I mainly took away from this was that it was best read quickly, rather to dwell on these pesky details. And maybe it's just a testament to my age and the crappy Saturday movies I was subjected to that I can't read something like this without casting someone in the role of that evil John Saxon guy with the bad wig. As romances go? I suppose these two deserved each other in the end. I can't say I was really rooting for them at the end but you get your standard happy ending, which I guess is what romance readers will like. The rest of us? Maybe not so much."}, {"userName": "Cassia", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/7421736-cassia", "userReview": "A bit disappointed by this story. The plot created around the themes of: \"kidnapping the Lady\" and \"Saxon and Normans' antagonism\" is not unique, but I have read more absorbing and better crafted stories based on this same subject. The right formula is always the same: more rounded characters (both hero, heroine and villain), a deeper psychologic analysis, less ripetitive love scenes and a deeper care for the setting help casting the spell on the reader who choose to read a medieval historical romance."}, {"userName": "Mei", "userReviewDate": "Nov 14, 2013", "userURL": "http://www.goodreads.com/user/show/5750594-mei", "userReview": "Excellent story. I enjoyed Amberlie and Tedric's path to romance. It wasn't an easy one but it drew me in wanting and waiting!!!"}, {"userName": "Dawn Dorsey", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/24707893-dawn-dorsey", "userReview": "A fun medieval romance, this is based in England just a year after William of Normandy won the Battle of Hastings. Our heroine, Amberlie de Fontaine, was widowed six months earlier, during a battle defending Woodrose Keep, her husband's prize from the Conqueror, from its previous Saxon owner, Tedric. Despite her legal position as the Lady of Woodrose, Amberlie struggles to maintain her sanity and a modicum of self-respect under the domination of her vindictive mother-in-law Julianne and Julianne's viscious and grasping step-brother, who appears as a more likely villain than the dispossessed Saxon lord. There a a few interesting passages showing King William in a more friendly and fatherly light than he is usually depicted, either by Saxons or Normans. He had long since earned his moniker William the Bastard, which he usually seems to accept with pride, but this shows him as concerned for Amberlie's well-being and even happiness as the daughter and widow of a faithful friend and knight, as well as her obvious use as a prize bride to reward a valuable knight. He also appears as not so much hostile to all Saxons as usual, but able to strategically consider the value of an accepted local leader over a potentially undependable Norman."}, {"userName": "Michelle", "userReviewDate": "Dec 24, 2017", "userURL": "http://www.goodreads.com/user/show/39208729-michelle", "userReview": "Good bookYou people should just read this book yourselves and write your own review on this novel yourself and I really enjoyed reading this book very much so. Shelley MA"}, {"userName": "Cindy Bolen", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/17894170-cindy-bolen", "userReview": "A Saxon and a Norman.I love this book. Amberlie is capture by a Saxon knight Tedric who wants to ransom her for his sister that was captured by the Normans. Amberlie is trying to refuse her captor convinced that he was the way be who killed her husband. She didn't expect what his kisses would do. Will she fall for this barbarian Saxon?"}, {"userName": "Camryn Shannon", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/25106573-camryn-shannon", "userReview": "My Enemy, My LoveAs long as Tedric the Barbarian roams free, Woodrose Keep isn't safe. Particularly in danger is Amberlie de Fontaine, a Norman beauty he vows to take as his desirable hostage. Her kidnapper is also the rogue that killed her husband. Amberlie's mother-in-law vows to avenge her son's death. An \"other woman\" in Tederic's life enjoys humiliating Amberlie. Born to be enemies, Tederic and Amberlie struggle against intense passions of hate, attraction, resentment, suspicion and other strong, tempestuous emotions that prevent her from enjoying true love. She discovers Tederic is far from the \"barbarian\" she once feared.Amberlie learns how to rule her captor's soul, but not without plenty of obstacles along the way. A tale of high adventure, KNIGHT'S CARESS is a fast-paced, stirring medieval romance that's guaranteed to sweep readers back in time. If you like old castles and captives of passion, enemies and everlasting love, this romance is for you."}, {"userName": "Becky", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/7288979-becky", "userReview": "Those Normans versus the Saxons!Tedric the Barbarian roams free, and is out for revenge of those who killed his father and kidnapped his sister. And Amberlie de Fontaine, the Norman beauty at Woodrose Keep is the one he vows to take as his desirable hostage. Tedric is the rogue that killed her husband Henry. She has revenge on her mind to take down the man who took him away from her. Her mother in law has no real use for her, and the brother is after her for his bride now to win the Keep. Tedrics mistress finds it amusing to turn Tedric agains Amberlie. There grows the love/hate scenerio of the two. This is a great romance, suspense book. I couldn't put it down. The characters were strong and well defined. The description of the times, and characters made you feel you were right there in the middle of it."}, {"userName": "Petula", "userReviewDate": "Oct 18, 2013", "userURL": "http://www.goodreads.com/user/show/7655196-petula", "userReview": "This is avery good historical romance set in the reighn of William the Conqueror. The main characters are not in control of their own lives.So there is lots of adventure and tension in the story. Not too many big supprises but I enjoyed it, and will look for more from this author.Just one tiny thing , some of our lovely authors do need to check facts sometimes. Especialy when it comes to mentioning animals that are living in the wild . England has never had Chipmonks. Squirrels yes. Another author whose work I love gave us Gophers.x"}, {"userName": "Amanda Richardson", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/18104103-amanda-richardson", "userReview": "I did like this book, interesting twist on the Norman-Saxon plot after 1066. The heroine this time was the Norman and the man the Saxon. The heroine believes the hero killed her first husband, he kidnaps her, she has him captured. Good story, love the Norman-Saxon plot device and the time period, which is always my favorite. Could have had more sex and steamier sex, tamer than I would go for, but I did enjoy the story."}, {"userName": "Niada Niederhauser", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/33596365-niada-niederhauser", "userReview": "What can be said about? It's your average cheesy romance novel that was more about the sex than any believable human attraction. It didn't make a great literary piece because the story felt rushed, the characters were under-developed, etc. This book is one of those easily forgettable ones that you wished you hadn't spent so much time reading."}, {"userName": "Anam", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/9553081-anam", "userReview": "I loved this book! Give me the distraction I needed from everyday life! Gave it three stars because some parts started to lag."}, {"userName": "Missy", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/4435068-missy", "userReview": "First book read by this author and was greatly impressed as it a wonderful book. Will be reading more of her books."}, {"userName": "Anabela Jesus", "userReviewDate": "Aug 27, 2013", "userURL": "http://www.goodreads.com/user/show/9652452-anabela-jesus", "userReview": "I really liked reading Knight's Caress.It was my first book by Lynette Vinet and i hope to read more of her books."}, {"userName": "Lynn", "userReviewDate": "Oct 23, 2014", "userURL": "http://www.goodreads.com/user/show/3636125-lynn", "userReview": "Yup. Just what you'd think it would be. And that's not bad."}, {"userName": "Heidi ", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/416888-heidi", "userReview": "I love a well-written bodice ripper... or chemise ripper in this case. Bonus-- Saxons vs. Normans."}, {"userName": "Myra", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/40046550-myra", "userReview": "Great bookThis was a great historical romance read. Love the story line and the intense love scenes and intense plotting. Great book!!!!"}, {"userName": "Virginia", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/5521244-virginia", "userReview": "I think I read a fan fiction version of this, but it was still a nice little read. It definitely gave me the small dose of historical romance that I was looking for that day."}, {"userName": "Kat Valencia-Benitez", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/15852575-kat-valencia-benitez", "userReview": "It's okay. I find the lady's attitude somewhat irritating. The hero is perfect. I'm glad i read this book. I'll read more from this author soon."}, {"userName": "Crystal", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/21909226-crystal", "userReview": "Her constant betrayals were just too big to me and so the rest of the book didn't work."}, {"userName": "Loretta", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/17845742-loretta", "userReview": "I didn't care for the supernatural elements, as they didn't seem to fit in the story. Overall it was an enjoyable read, even if the ending seemed a bit rushed."}, {"userName": "Louiseann Walter", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/32556481-louiseann-walter", "userReview": "TERRIFICThis was most enjoyable. It told of history romance and comedy. But it also showed jealousy and how some covet another's wife or husband. Very good story"}], "description": "She was his sworn enemy...Though the conquering Normans had taken his keep and his lands, Tedric of Woodrose swore he would wreak vengeance on those who had killed his father and kidnapped his sister. And he knew just the way. He would take his own captive -- Amberlie de Fontaine, the brown-eyed Norman beauty who was now lady of his former keep. And once he had stolen her away, he would not scruple over stealing a fiery kiss or two from this dark and enchanting hostage...He was her only desire...Amberlie knew she should despise Tedric of Woodrose. After all, he had kidnapped her, and worse, it was almost certainly Tedric who had killed her husband in one of his many attempts to regain his land. But the tall, blond Saxon warrior was not the savage she had expected. And try as she might, it was not hate but passion she felt in his presence; passion that stirred her as never before. He had taken her by force, but she would give herself freely to the sweet ecstasy of his tempestuous embrace...", "title": "Knight's Caress", "url": "https://www.goodreads.com/book/show/18368236-knight-s-caress", "average": 3.5, "cover": "https://images.gr-assets.com/books/1377261267l/18368236.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/737576.Lynette_Vinet", "name": "Lynette Vinet"}], "type": ["Romance", "Historical", "Romance", "Historical", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/18368236-knight-s-caress", "http://www.goodreads.com/book/show/6358759-knight-s-caress", "http://www.goodreads.com/book/show/27241293-knight-s-caress", "http://www.goodreads.com/book/show/2930663-pirate-s-bride", "http://www.goodreads.com/book/show/18910863-pirate-hunter-s-mistress", "http://www.goodreads.com/book/show/18369622-emerald-desire", "http://www.goodreads.com/book/show/18685448-savage-deception", "http://www.goodreads.com/book/show/18777748-pirate-s-golden-promise"]}