{"ratings": 1866, "userreviews": [{"userName": "Darth J ", "userReviewDate": "Apr 01, 2013", "userURL": "http://www.goodreads.com/user/show/18974711-darth-j", "userReview": "4.5 StarsOkay guys, remember all the hype surrounding Eat, Pray, Love - about how it was all about the food and the celebration of being your own person? And then you read it and found it to be a pretty vapid and pretentious travelogue? Well, then La Cucina: A Novel of Rapture might actually satisfy you if you are looking for something similar to what was promised with that other book.Not only are there a ton of mouth-watering descriptions of Sicilian cooking, but the prose is actually scrumptious. Really. When I see people reviewing a book and saying the writing was \"beautiful\", I usually roll my eyes because what a lot of readers call \"beautiful\" really just amounts to 8th grade poetry. Not here. La Cucina is written much like Italian cooking - rustic and simple, yet elegant and filling."}, {"userName": "Rosie", "userReviewDate": "Apr 23, 2008", "userURL": "http://www.goodreads.com/user/show/43399-rosie", "userReview": "I felt like I needed to include a book I didn't like. I really, really, really disliked this book. The author peppers the story with Italian words, but never really captures Italian culture. She resorts to some tired stereotypes - the ignorant peasant girl, the possessive father who uses the words \"dishonor\" and \"puttana\" way too much, the fat middle-aged woman, the Mafia taking out a foreigner, etc. This left me cold. I couldn't sympathize with the characters because they were so two-dimensional. The story is supposed to be about a woman who finds love after a long time alone and rediscovers her sexuality with an Englishman, but a lot of the scenes were bordering on gratuitous. I only finished it because I kept hoping it would redeem itself. It didn't."}, {"userName": "Saleh MoonWalker", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/66648866-saleh-moonwalker", "userReview": "Onvan : La Cucina - Nevisande : Lily Prior - ISBN : 60953691 - ISBN13 : 9780060953690 - Dar 263 Safhe - Saal e Chap : 2000"}, {"userName": "Sve", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/1997873-sve", "userReview": "Слаба ракия като цяло. Нещо като смесица между \"50 нюанса сиво\" и \"Като гореща вода за шоколад\".Изключително дразнещо е че книгата е пълна с грешки - не е минавала през редактор и коректор."}, {"userName": "Elizabeth", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/19198565-elizabeth", "userReview": "Magical realism combined with Italian charm make this a really imaginative and romantic read, with deliciousness weaved throughout."}, {"userName": "Albert", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/5916992-albert", "userReview": "Title - La Cucina: A Novel of RaptureAuthor - Lily PriorSummary -  This is the tale of Rosa Fiore, a peasant Sicilian girl who grows up in a passionate household and who in her way finds her own passions. From the men she loves to the cooking she does. Rosa's family has always been suspect in her small village. Her mother's powerful and lustful ways the stuff of much gossip. Until the birth of her brothers, Siamese twins, proof of her mother's wickedness the gossip was always in whispers. For Rosa, in her youth she falls in love with young Bartolomeo, the son of a local Don of the Mafioso. A relationship that would not be permitted.\"..Then you may begin the rolling. Dust the table lightly with flour and divide your dough into eight equal pieces. Taking one piece, begin rolling by moving the rolling pin in a motion away from you, pressing evenly to create a rectangular shape. Continue thus until your sheet of pasta is long and thin and about the thickness of the blade of a knife. The knife that slit Bartolomeo's throat. Slicing through his beautiful young flesh like coltello through lard...\" In her grief, young Rosa cooks and cooks. Her recipes and abundance of food feeds her family and the village. She cooks herself into exhaustion. No longer able to stay in the village where her young love was murdered she leaves to become a librarian in the small town of San Domenico. Twenty five years pass and she has settled into a new life of her own. Far from her village, from her family and from the two passions in her life. Until one day a foreigner comes into the library looking for manuscripts on the recipes of the cultures that had built the city and the island of Sicily. With the arrival of this L'Inglese, the passions that had laid dormant in Rosa would re-ignite. Her love and her cooking.\"..Of course, signor,\" I said very quickly, as if afraid my courage would desert me at the last moment, \"if you really want to know about our food, you will not find it in books.\" \"No?\" L'Inglese read the signal. \"You, um, you need someone to show you.\" I looked at him squarely while blushing like a beetroot. \"You mean you cook, signorina?\" he asked, his eyes bright with a sudden fire.\" \"Signor,\" I said, \"I cook...\" Together, with her L'Inglese, Rosa comes alive again. But will the disapproval of her family reach out to take her happiness away once again?Review -  La Cucina is very similar in its telling as Like Water For Chocolate and if you loved Like Water for Chocolate, you will love La Cucina. If you didn't get Like Water for Chocolate, you will not get La Cucina. It is romantic and passionate but not erotica in a obvious way. It is subtle yet powerful. Prior chooses to be descriptive about the passion and dreams of her characters rather than the acts themselves. The influence of family and small village life is also interesting and adds another dimension to the happenings in this novel. All around a very good read."}, {"userName": "Tanya", "userReviewDate": "Aug 25, 2008", "userURL": "http://www.goodreads.com/user/show/709053-tanya", "userReview": "L’histoireLa Cucina se passe au début du 20e siècle. C’est l’histoire de Rosa, une jeune italienne qui adore faire la cuisine. Elle soulage ses inquiétudes, ses joies, ses colères etc. en faisant à manger pour sa famille et elle-même. Lorsque son amoureux est assassiné, elle quitte sa campagne natale pour aller vivre sa vie en ville. Elle y passera près de 25 ans de sa vie comme bibliothécaire. À l’aube de ses 25 ans de service, elle rencontre un étranger avec lequel s’ensuivra une relation mystérieuse et torride. Bien sûr, une histoire d’Italie ne serait pas complète sans la présence de la mafia…Mes impressionsHonnêtement, j’ai trouvé ce petit livre incroyable. L’histoire est belle et très captivante. L’auteure fait des liens constants entre la vie de Rosa et la cuisine italienne. De plus, le vocabulaire employé permet au lecteur de concevoir la relation entre Rosa et l’étranger, c’est-à-dire la passion entre les deux amoureux.Lily Prior fait sentir au lecteur qu’il est partie intégrante de l’histoire. Les descriptions des scènes d’amour sont très imagées, passionnées et délicieuses.Je vous conseille de lire ce petit bijou en anglais afin de savourer le vocabulaire employé pour nous faire vivre les émotions des personnages et rendre l’histoire ce qu’elle est."}, {"userName": "Dale", "userReviewDate": "May 02, 2009", "userURL": "http://www.goodreads.com/user/show/1002957-dale", "userReview": "What a fun and racy read! The lead character, Rosa, is easy to fall in love with. I found myself in my own daydreams that included the wonderful aroma of her cooking – if only I could have sat at her table for samples! And thank goodness she met L’Inglese in his ‘come to bed shoes’ – I will never look at men’s shoes the same again…Thank you, Rosa, for inspiring me to bake fresh bread last night; it was delicious! And thanks to Bebe for recommending this book as it is a fun and interesting peek into one perspective of Sicilian farm life."}, {"userName": "Jane", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/8957866-jane", "userReview": "Definitely a page turner: I read it in less than three hours. However, I didn't enjoy it as the love interest's personality was repellent. For example, \"[he] waved me ahead of him up the spiral staircase. I had reached halfway before I realized that he had positioned himself directly underneath and was looking up my skirts. I tried to gather the material close around my legs so he could not see anything, but in truth, he had already seen everything. He smiled broadly at my discomfort.\" Urgh. Also, the sex scenes were nauseating."}, {"userName": "Linda Robinson", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/2613351-linda-robinson", "userReview": "A friend loaned this book; her mother loaned it to her because she said it made her laugh. I didn't laugh but I sure enjoyed reading this story of passion, in all rooms of the house and in the garden as well. The cover is rich and so is the story. La Cucina is the kitchen where the life of the cooks in the household takes place. Rosa Flores is a cook - kneading dough calms her, creating an elaborate dish lets her forget her pain. A sumptuous read."}, {"userName": "Julie", "userReviewDate": "Jul 14, 2013", "userURL": "http://www.goodreads.com/user/show/14773738-julie", "userReview": "This novel is much too easy to mock, and so I dare not, since I might get carried away. The author raises \"food porn\" to a whole new level, and I don't mean in a good way. OK, I just can't help myself: one teensy little mockery: the narrator is more full of herself than a Mario Batali cannoli! Read at your peril. (Or if you want to laugh out loud, when you really shouldn't.) On the other hand ... maybe it was meant to be this funny."}, {"userName": "Méyo", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/46973522-m-yo", "userReview": "Lily Prior is now one of my favorite authors. I love everything from her style of writing to her very unique imagination. The only thing that pains me about Lily Prior is her novels are too short. She has so many interesting plot points and characters in her writing that simply get glossed over due to her penchant to keep her novels short and sweet. I liken Lily Prior to 'Haruki Murakami Lite.'"}, {"userName": "MaryAnn", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/23805941-maryann", "userReview": "Really enjoyed this book. Makes you want to cook, eat and have lots of sex!"}, {"userName": "Kim Raymond", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/67192571-kim-raymond", "userReview": "Quand une collègue de travail te recommande fortement un livre en te disant qu'il lui a fait penser à toi... que tu lui donnes un chance même si la lecture de la quatrième de couverture te donne l'impression que c'est très loin de tes préférences... et que le tout s'avère tellement médiocre que tu abandonnes après en avoir lu le tiers. Mal écrit, mal traduit, une histoire insignifiante, d'apparence sulfureuse, mais finalement prude et convenue, avec la promesse d'une intrigue basée sur la puissance de la mafia sicilienne qui est finalement complètement absente de la trame principale (à moins que \"la mort blanche\" du père de la protagoniste, évoquée en une seule phrase, ne suffise pour évoquer la terrible Cosa Nostra comme étant une partie prenante du récit)."}, {"userName": "Jim", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/7817547-jim", "userReview": "Layered with nearly every cliché about Italian life, this \"ribald\" food porn tale about a busty single woman and her love of cooking did provide a few interesting recipes. However, her two affairs (first true love, murdered; the second, a somewhat creepy Englishman) and her cooking comprise the majority of this tale, along with a nosy landlady, some Mafia types, and superstitious locals. While it seems to have pleased other readers, I wonder how they would react to a similarly told story about an African-American woman's lusts and cooking if penned by a white author. Certainly, authors should be able to write about people whom they are not. But to unknowingly camp up an entire culture as merely about sex and food is trite."}, {"userName": "Plum-crazy", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/30347735-plum-crazy", "userReview": "Rosa leaves her family farm & flees to the city after her first love is murdered. For years she lives a quiet solitary life until one day a man known as L'Inglese enters the library where she is working. L'Inglese reawakens the passions deep in Rosa & they embark on a passionate affair until one day he simply vanishes....This tale is full of a wide variety of characters including a perverted priest, half-witted farm hands & siamese twins.....not the romantic story I was expecting, but nevertheless a good read."}, {"userName": "Liva", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/14697956-liva", "userReview": "Paredzēts lasīšanai personībām, kas spēj, neķiķinot, novērtēt izsmalcināti veidotas erotikas ainas. Lasīt sāku dienvidū, guļot pludmalē, un pabeidzu vēlu tās pašas dienas vakarā jau mājās. Atrauties nebija iespējams. Bet jābrīdina, ka šīs grāmatas lasīšana ir kaitīga figūrai - rodas vēlme aiziet uz virtuvi un mēģināt pagatavot kaut vai ko attāli līdzīgu Rosas Fjores gatavotajam.Plašāk blogā:http://lalksne.blogspot.com/2012/06/l..."}, {"userName": "Denise", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/8046470-denise", "userReview": "I read this book at the breakfast table each day. The read was delightful, daring and fast paced. There was plenty of laughter as I read the story that covers a lifetime. ~her sprinklings of Italian recipes were appreciated."}, {"userName": "Okidoki", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/7103418-okidoki", "userReview": "En burlesk må-bra. Inget för de sippa."}, {"userName": "Roslyn Page", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/56324669-roslyn-page", "userReview": "3.5 A bit dated and fairly silly"}, {"userName": "Sam", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/11170235-sam", "userReview": "Enjoyable book, good pace, characters interesting and funny and evocative of Sicily and Italian food."}, {"userName": "Anaïs ", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/51648010-ana-s", "userReview": "Un récit haut en couleur, ponctué de saveurs mêlant tous les sens permettant de se plonger dans les recettes les plus typiques assez facilement. Apologie d'une cuisine sans égale, ce livre m'a donnée faim du début jusqu'à la fin. Quelques passages d'affection redonnent le sourire et apportent de l'espoir à l'avenir du personnage central. Enfin, les scènes de cucina se mélangent harmonieusement avec l'histoire et ses imprévus quotidiens."}, {"userName": "Basia Korzeniowska", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/39035525-basia-korzeniowska", "userReview": "very engaging and very farfetched and unlikely. but I enjoyed it very much!"}, {"userName": "Joanne", "userReviewDate": "Feb 28, 2017", "userURL": "http://www.goodreads.com/user/show/1389591-joanne", "userReview": "A fun, quick read filled with amazing food, ridiculous sex, the odd bit of mafia action, Siamese twins, a library, a farm, a fire and a surprising end. This is a solid"}, {"userName": "The Cats Mother", "userReviewDate": "May 18, 2014", "userURL": "http://www.goodreads.com/user/show/5720552-the-cats-mother", "userReview": "Sue brought this to book club, she's long had a thing for books about Italy and food; it sat on the shelf for a while as the reviews were unenthusiastic, but it looked like a quick read and I'm trying to clear as many books from the pile as I can before our next meeting, so gave it a go. What can I say, I finished it, and it's not as bad as expected, but it's not great.The story is OK - what there is of it - only daughter Rosa grows up on a farm in Sicily in the 1920s surrounded by her dominating mother and multiple brothers - no cliches here! She has a short-lived romance with a local boy but he is contracted to marry the Don's daughter and is murdered by his father for dishonouring the family. Distraught, Rosa throws herself into cooking, cue lots of descriptions of classic Italian foods, puts on weight, and runs away to Palermo and hides out working in a library for 25 years, until one day an ugly Englishman appears to research the cuisine of the region and sweeps her off her feet for a summer of love and food porn. There are some grotesque scenes involving oysters, spaghetti and bodies that would put most people off both food and sex for some time. Then suddenly, like her father so many years before, her lover disappears and poor Rosa falls back into fantasy land. I won't spoil the end of the story as that was what kept me reading to the end.The most annoying thing was the writing style - a mixture of first person and omniscient that doesn't work, she should've chosen one or the other, and ridiculous comments like referring to bad things always happening in the basement in movies... Not in 1958 they didn't...The foodie stuff didn't do much for me, I'm not that enamoured of Italian food anyway, and the OTT descriptions were just too much - what was supposed to be sensual just turned my stomach, and the \"love scenes\", while not as graphic as I feared, were in no way sexy. There were also way too many descriptions of masturbating priests and Peeping Tom's, and people getting it on in cowsheds - I suppose they're meant to convey the lustiness of Sicilian life but it really just showed the hypocrisy of the culture."}, {"userName": "Val", "userReviewDate": "Jul 03, 2016", "userURL": "http://www.goodreads.com/user/show/5271574-val", "userReview": "The author takes a lighthearted and superficial romp through Sicilian stereotypes regarding food, sex and honour. It is a quick and sometimes amusing read, which I quite enjoyed, but neither the descriptions of the sex or of the food really reach the heights of rapture. There is plenty of sweaty pounding of dough and flesh, but the pivotal scene combining food and sex just made me laugh and I'm not sure whether this was intended or not.The book is divided into seasons. In Winter we hear of a series of tragedies which have afflicted the Fiore family over the years: the birth of Siamese twins, Papa's disappearance, Grandfather's death. After each Rosa cooks. Her latest cooking spree seems at first to be a continuation of those, but is caused by Rosa's boyfriend's murder, a completely over-the-top act by his Mafioso father which I can't imagine we were intended to take seriously. Rosa also over-reacts, slaughters all the farm animals, cooks far too much food, pounds more pasta dough, etc. and then, when her mother eventually persuades her to stop, she leaves home. At this point I saw the book as a pastiche, a kind of Cold Comfort Farm with Sicilian sunshine and a volcano rumbling in the background.After this promising start the book unfortunately abandons the farcical overtones and much of the humorous touch. It becomes a story of an overweight, middle-aged librarian finding love with a mysterious stranger; Spring is the anticipation, Summer the consummation and Autumn the withering. The second half of the book is not funny, apart from the food sex scene mentioned, so that I wondered if the humour in the earlier section was accidental. At least the sex was consensual, not abusive, and it was enjoyed by all participants.PS Don't try to follow the recipes, they are all incomplete, confusing or wrong. The pleasure is in the eating not the cooking in this book."}, {"userName": "Megan", "userReviewDate": "Jan 08, 2013", "userURL": "http://www.goodreads.com/user/show/7684391-megan", "userReview": "\"...we sucked and sucked at one another, paddling with our hungry tongues.\" This is one of the worst books I've ever read. It alternated between cliche, trite, badly written, and ridiculous. If the author could have focused solely on the cooking, culture, and crime aspects of the novel, it would have been half decent in spite of the total abuse of punctuation (averaging 2 comma errors per page). However, the romance portions of the book were absolutely atrocious. Many of the interactions between Rosa, the protagonist, and the various male characters bordered on (or crossed that border) non-consensual. However, the worst parts were the completely bizarre \"love-making.\" At one point, spaghetti is ~sexily~ \"woven\" into hair, and the word \"WILLY\" is used on pg 181...I challenge anyone who liked this book to actually LISTEN to the lines. Read them out loud.Here are some true gems (spoiler free):Rape-y \"he covered my mouth with his so that now I could not breathe at all. I tried in vain to wriggle out from underneath him, to free myself...\" (49)\"...imagine my horror at finding ---- at the foot of my bed.... The scream died in my throat.\" (87)\"Then I saw the handle turning. Thankfully, I had remembered to bolt the door.\" (105)\"If you deny me now I will go straight out of here and find a whore on whom to vent my frustrations, and you... will never see me again.\" (128)Ridiculous/Bizarre \"Something inside me heaved.\" [meant to be a positive sexual response](82)\"...brown brogues [shoes], smooth and shiny like melting ice cream\" (82)\"Something resembling the bolt from a crossbow shot through the veins of my leg and exploded into a shower of shooting stars in the long-slumbering layers of my loins.\" (87)\"I looked at his lips: they were moist, soft, flexing.\" (105)\"...we sucked and sucked at one another, paddling with our hungry tongues.\" (132)\"...my taste buds and my loins both began to water.\" (170)"}, {"userName": "Elize", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/12489402-elize", "userReview": "I'm so incredibly disappointed by this book after absolutely loving \"Nectar\". I found myself constantly rolling my eyes at the clumsy attempts at writing a \"passionate, sensuous story about desire\" or whatever all the reviews said."}, {"userName": "Lynette Lark", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/33244332-lynette-lark", "userReview": "Two young people fall in love and the parents aren't happy about this. Boy dies and girl goes back home where she takes over the kitchen and she cooks and cooks and eats. Then another man enters her life at the library. The ending will make you cry. But I loved this book!"}, {"userName": "Debbie", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/672976-debbie", "userReview": "La Cucina was a quick and engaging read that I enjoyed quite a bit. The tale follows the life and loves of Rosa Fiore whose gifts with food were legendary in her Sicilian village and expressed her passions and sensuality in a socially appropriate way. After a tragedy occurs in her home village, Rosa sets off to Palermo and becomes a librarian where, 25 years later, she meets L'Inglese and ignited by a passion for him and for life that transforms her.Without giving away the plot, this story was fun to read. Some of the supporting characters were basically vague outlines rather than fully developed personalities but I don't hold this against the author because it is a fairly short book and I don't believe it hurt the plot. There are a few too many perverts, weirdos or just plain quirky folks in this book but again, it doesn't really detract from the plot.I'm sure this book has been compared to Like Water for Chocolate numerous times so I'll refrain from making the same comparison. However if tales that incorporate romance, passion, sensuality and food are your cup of tea then I recommend reading this book."}], "description": "Since childhood, Rosa Fiore -- daughter of a sultry Sicilian matriarch and her hapless husband -- found solace in her family's kitchen. La Cucina, the heart of the family's lush estate, was a place where generations of Fiore women prepared sumptuous feasts and where the drama of extended family life was played out around the age-old table.When Rosa was a teenager, her own cooking became the stuff of legend in this small community that takes pride in the bounty of its landscape and the eccentricity of its inhabitants. Rosa's infatuation with culinary arts was rivaled only by her passion for a young man, Bartolomeo, who, unfortunately, belonged to another. After their love affair ended in tragedy, Rosa retreated first into her kitchen and then into solitude, as a librarian in Palermo. There she stayed for decades, growing corpulent on her succulent dishes, resigned to a loveless life.Then, one day, she meets the mysterious chef, known only is I'Inglese, whose research on the heritage of Sicilian cuisine leads him to Rosa's library, and into her heart. They share one sublime summer of discovery, during which I'lnglese awakens the power of Rosa's sensuality, and together they reach new heights of culinary passion. When I'Inglese suddenly vanishes, Rosa returns home to the farm to grieve for the loss of her second love. In the comfort of familiar surroundings, among her, growing family, she discovers the truth about her loved ones and finds her life transformed once more by the magic of her cherished Cucina.Exuberant and touching, La Cucina is a magical evocation of lifes mysterious seasons and the treasures found in each one. It celebrates family, food, passion, and the eternal rapture of romance.", "title": "La Cucina: A Novel of Rapture", "url": "http://www.goodreads.com/book/show/20643643-la-cucina", "average": 3.47, "cover": "https://images.gr-assets.com/books/1390864460l/20643643.jpg", "reviews": 193, "authors": [{"url": "https://www.goodreads.com/author/show/212530.Lily_Prior", "name": "Lily Prior"}], "type": ["Fiction", "Food and Drink", "Romance", "Cultural", "Magical Realism"], "outlinks": ["http://www.goodreads.com/book/show/20643643-la-cucina", "http://www.goodreads.com/book/show/401528.La_Cucina", "http://www.goodreads.com/book/show/18331192", "http://www.goodreads.com/book/show/13550003-la-cucina", "http://www.goodreads.com/book/show/1086194.La_Cucina", "http://www.goodreads.com/book/show/372767.Nectar", "http://www.goodreads.com/book/show/1292523.Ardor", "http://www.goodreads.com/book/show/918250.Cabaret", "http://www.goodreads.com/book/show/15755442-la-cucina-seconda", "http://www.goodreads.com/book/show/10322257-the-first-time-i-heard-anthea-speak"]}