{"ratings": 1841, "userreviews": [{"userName": "Erin ", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/2997696-erin", "userReview": "Find this and other reviews at: http://flashlightcommentary.blogspot....Katherine de Valois is a tantalizingly enigmatic historic figure. The daughter of Charles VI and Isabeau of Bavaria, Katherine married Henry V in June 1420 and was crowned Queen of England the following year. She welcomed a son in December 1421 and became a widow in August 1422. Still young and marriageable, the queen dowager planned to wed Edmund Beaufort, but intervention by Parliament quashed all hope of a possible marriage. Forced to live in her son's household, Katherine found happiness in the arms of one of her staff, a Welshman by the name of Owen Tudor. The facts of their relationship are rather sketchy, but the union resulted in the birth of at least three children if not more. The eldest of these was Edmund Tudor, father of Henry VII, founder of the Tudor dynasty.Already fond of the story, I was eager to read Anne O'Brien's The Forbidden Queen, but my enthusiasm was unfortunately short-lived. For one, there is little atmospheric detail and no timetable by which the reader might make reference. Births, deaths, and various battles are occasionally mentioned, but the narrative is marked by the distinct absence of both physical and political ambiance. The lack of authenticity also bothered me. Take for example Katherine's life after she is ordered to reside in her son's household. Am I truly to believe that outside the question of marriage, the queen dowager was allowed to live virtually free of Parliament, that she could uproot the royal youngster on a whim or that the child king wouldn't be surrounded by subordinates acting in the interest of the Lord Protector? I'm sorry, but I don't see it. Not during the intense power struggles of the Middle Ages. O'Brien's attempt to explore Katherine as someone who suffered confidence issues showed promise, but the context made it difficult for me to see her as someone of independent strength. Her courage and spirit ebbs and flows exclusively on the romantic attentions of men, making her appear codependent rather than capable. A difficult read, the only bits I truly enjoyed were the scenes in which Katherine questions her sanity. The allusion created a nice bridge between her father, Charles VI, and her eldest son, Henry VI, both of whom suffered some form of mental instability. Historically speaking, it is an interesting piece, but I think O'Brien could have done a lot more with it."}, {"userName": "Amy Bruno", "userReviewDate": "Dec 05, 2012", "userURL": "http://www.goodreads.com/user/show/1774372-amy-bruno", "userReview": "Woo Hoo...just scored a eGalley at NetGalley!"}, {"userName": "Samantha", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/5880552-samantha", "userReview": "The Forbidden Queen starts out in a very promising way. Poor little Katherine is a princess, yet destitute. Her mother, Isabeau of Bavaria, has resources but not the desire to raise her children. She is too caught up in her own selfish desires to concern herself with the dirty little girls scurrying around the castle. Katherine’s father, Charles VI of France, is insane and may or may not remember who Katherine is when he does run into her. If they chance to interact and he believes that she is indeed his daughter, he makes an effort to provide for her, but his mind is too far gone for her to rely upon him.This tragic picture of childhood is a far cry from the expected pampered royal upbringing that most princes and princesses of Katherine’s day enjoyed. Once her mother realizes the state of her daughters, she removes them to a cold, stern convent to be educated and disciplined. Katherine grows up never learning what it is like to love or be loved. Her only comfort is her sister Michelle, who of course is lost to her upon her marriage.When Katherine is married to the legendary Henry V, she envisions a new life of love and happiness. However, her husband is too distracted by his quest to rule over France in addition to England to spend much time wooing his young bride. She is in love nonetheless because he is all she has. At this point in the story, I could still feel sympathy for Katherine. I cared about what happened to her and felt sorry for the girl who wanted so much to give herself to someone and be truly loved in return. After Henry’s death, the whole story fell apart.Katherine is understandably crushed by her husband’s death and the circumstances surrounding it, but she descends into depression, self-pity, and insipidness that she never (ever) seems to fully recover from. The rest of the book includes her relationships with Edmund Beaufort and Owen Tudor, who are about as two dimensional as characters can be. Meanwhile, Katherine is naïve, selfish, and has a little too much of her parents in her.Edmund is the seducing rogue who everyone realizes is a bad boy except Katherine. Owen is the brooding, strong, quick-tempered, yet perfectly handsome and sensitive Welshman. Katherine spends so much time doubting herself, her relationships, and the motives of the King’s council which rules her life. She makes, or attempts to make, several major decisions without consulting with whichever man she is deeply in love with at the time. She was just so unlikeable.What I was really bothered by in this novel was the repetitiveness. Over and over, the reader was reminded: Henry only married Katherine to gain France, Edmund is sexy but it would be a horrible decision to sleep with him, Owen is a servant! My uncorrected proof copy of this book is 613 pages, while I see that Goodreads lists it as 464, so maybe much of this was edited out. I hope so. The other problem that I had was that we aren’t told much of what is going on other than Katherine’s inner thoughts, which are pretty much only about men. England is battling for the crown of France and all we know is that Owen has glossy black hair. It’s just a little too fluffy for me. However, if you are more of a fan of romance than history, it may be just the book for you. I like a little more history in my historical fiction."}, {"userName": "Jo Barton", "userReviewDate": "Jan 27, 2013", "userURL": "http://www.goodreads.com/user/show/2090731-jo-barton", "userReview": "The Forbidden Queen is the story of how a beautiful young woman was manipulated into a loveless marriage, and then forced to live her life in the shadow of powerful men. Katherine’s story draws you in from the very beginning as we rejoice to see her as an innocent bride and gently protective mother, but then grieve as she learns to live her life as a beautiful young widow, but what really brings the novel to life is the way in which this gentle, charismatic Queen was treated by the powerful men who were appointed as the young King’s protectors.Anne O’Brien has a great skill with words and undoubtedly makes history come alive, so much so, you are easily transported back in time to an age when women were largely seen but not heard, and as the 21st century begins to fade and the echoes of the past resonate within your imagination, you feel the cold of the castle walls and sense Katherine’s unease as she finds herself caught between love and duty. There is no doubt that history has much to thank Katherine de Valois for, as this largely forgotten queen was not only the mother of a King of England, but was also the grandmother of the Tudor dynasty, in this novel Anne O’Brien more than does justice to a story that needed to be told.There is no doubt that Anne O'Brien's historical narratives just get better and better, and this is one of my favourite of her novels to date.My thanks to Netgalley and Harlequin (UK) for an advance ecopy of this book to read and review."}, {"userName": "Tony Riches", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/5240597-tony-riches", "userReview": "Isn’t it great when you suddenly discover a fascinating historical figure you really know nothing about? It doesn’t happen very often, so when it does it’s quite special – and often unexpected. My current WIP is set during the time of Katherine of Valois (the ‘forbidden queen’ of Anne O’Brien’s latest novel), so I’m very familiar with her story. No, the big surprise was her hero, the impressive Owen Tudor, (or Owain ap Maredudd ap Tewdwr as he would have preferred to be called) who of course gave his name to the Tudor dynasty. (There is a theory that the name ‘Tudor’ was actually a typo made by an English scribe who didn’t know any better. We will never know if that is true, although I did read that Henry VIII never described himself as a ‘Tudor’).The awful way King Henry V treated his new wife has been well documented but there was great secrecy about Katherine’s relationship with Owen Tudor. This makes it all the more interesting, as we do have to ‘fill in the gaps’. Anne O’Brien’s relaxed style does this sensitively and convincingly through the eyes of Queen Katherine. Tricked by Duke Humphrey of Gloucester into a life of widowhood, she slowly becomes aware of the real man behind the role of ‘Master of the Household’. (His real title may have even been ‘clerk of the wardrobe’!)There is a fascinating postscript at the end of the book where Anne discusses her inspiration for writing it. She says “I decided that Katherine deserves a re-evaluation. I hope I have done her justice in writing The Forbidden Queen, allowing us to see the woman behind the façade.” Anne has certainly achieved that and more. I will admit to feeling quite emotional at the end of her amazing story. I highly recommend this book to anyone who would like to understand what life may have been like for this remarkable woman."}, {"userName": "Pupottina", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/21008693-pupottina", "userReview": "È stata una lettura interessante e superlativa. Ritrovarsi d’un tratto a vivere la vita di Caterina di Valois e della sua corte è stata un’esperienza impareggiabile. Fantastica l’ambientazione e lo stile delicato e coinvolgente di Anne O’Brien che ha saputo ben amalgamare la componente storica con il genere romance.Caterina di Valois, figlia di Carlo VI di Francia e Isabella di Baviera, andò in sposa a Enrico V d’Inghilterra. Rimasta una giovanissima vedova divenne un trofeo ambito per molti contendenti, corteggiatori instancabili ed avidi. Lei, però, cercava l’amore vero, quello che il suo primo marito Enrico V non è stato in grado di darle, avendola sposata per interesse e non per un reale sentimento d’affetto nei suoi confronti. Per la regina francese, Caterina, l’Inghilterra è un covo di vipere avare e fraudolente, dove con ingordigia e inganno chiunque è pronto a danneggiarla o sfruttarla. Ecco perché lei deve fare della diffidenza il suo punto di forza, prima di coronare il suo sogno d’amore.Come sappiamo già dalle pagine di storia, tra i tanti uomini che cercarono di possederla, Caterina sposò segretamente, in seconde nozze, Owen Tudor, unendo il suo nome alle origini della dinastia dei Tudor.È un’opera preziosissima quella scritta da Anne O’Brien, la quale narra le vicende storiche inglesi, tra intrighi, scandali e passioni, con l’eleganza di uno stile ricercato, rendendo appassionanti anche le lontane emozioni che hanno lasciato traccia sulle pagine dei manuali storici.Se amate le intense e coinvolgenti rievocazioni storiche, soprattutto quattrocentesche, e le personalità affascinanti e sfaccettate, LA REGINA PROIBITA è un romanzo che vi conquisterà."}, {"userName": "Laurie • The Baking Bookworm", "userReviewDate": "Feb 19, 2014", "userURL": "http://www.goodreads.com/user/show/5289134-laurie-the-baking-bookworm", "userReview": "*** This book review, as well as many more, can also be found on my blog, The Baking Bookworm (www.thebakingbookworm.blogspot.ca).Disclaimer: My sincere thanks to Harlequin and NetGalley for providing me with a complimentary e-book copy of this book in exchange for my honest review.My Review: Historical Fiction is one of my favourite genres. There's something awesome about reading a book that puts you back in time so you can learn a thing or two about an era long since gone. I love the historical tidbits and felt that learning about Katherine de Valois, the mother of King Henry VI, would be a wonderful way to spend the weekend. Unfortunately, I had a very hard time getting into this book.I would characterize this book as much more of a romance than a historical fiction novel. I would have loved to have more historical detail incorporated into the storyline but the book just seems to follow Katherine's love life (which I didn't find very romantic to begin with, truth be told). Add to the fact that the character development and plot were both weak and one-dimensional and I just didn't enjoy this book.In the beginning Katherine was a likeable, innocent young girl who has had a hard childhood (I actually would have liked to get more detail into her childhood but that time in her life was glossed over quickly). As the story progresses Katherine continues to be this innocent, naïve, flighty girl and her lack of character development grated on me quickly. She was defeatist from the get go and overall just had an utterly bleak feel to her. It's one thing to be naïve because she was just a teenager when she was sent to England but she came off as whiny, weak and immature throughout the book. She seemed shocked when Henry didn't have time for her. He's the KING OF ENGLAND! He's got countries to conquer and England to run, for goodness sake! For a girl who grew up never imagining that she'd one day get the chance to be married, let alone a Queen, she sure did have a lot of preconceived notions. And for a girl who was raised in a neglectful (albeit royal) home and then sent to a nunnery you'd think that she'd have a lot more trouble fitting into her new life as the Queen of England. But Katherine seems to worry more about whether Henry loves her than learning about her new role and helping to rule a country. This issue continues as she is widowed and essentially looking for love in all the wrong places time and again. There were many times when the story could have gone into further detail to help the reader get a better idea of life during this time but more often than not the details were glossed over to make room for Katherine's beaux.I love strong female characters but Katherine came off as weak and silly. Her happiness is solely dependent on her romantic life. She was very self-absorbed in her own little world and felt very meek, immature, whiny and just generally not a character I could get behind. If she started out weak and immature but then we got to see some growth in her character that would be one thing but it never felt like her character went through any substantial emotional changes throughout the book.Another issue I had with this book concerned the writing style. Throughout the book it felt like I was being told things instead of being shown by the characters actually doing something. We got glimpses into Katherine's life but never really got down into the details. For example, Katherine initially has issues with her 'damsels' (ladies in waiting) but other than the odd comment about her damsels not liking her it's not dealt with. I would also have loved to get a feeling for the political and social issues of the time but instead the storyline felt like it just went from one bad relationship of Katherine's to the next.Finally, one of the main reasons I requested to review this book was the fact that it dealt with Owen Tudor. I was eager to get a peek at the early days of the Tudor dynasty but it was overshadowed by the 'will they won't they?' romantic banter between Katherine and Owen and that got old for me fast.If there was more historical detail, intrigue and character development it would have made for a really good read. Unfortunately, this book came off as a romantic novel with a weak historical framework that focused more on Katherine's love life and less on the political intrigue and historical details of the time.My Rating: 2 stars"}, {"userName": "Cynthia Mcarthur", "userReviewDate": "Dec 06, 2012", "userURL": "http://www.goodreads.com/user/show/6022970-cynthia-mcarthur", "userReview": "One of my favorite stories in English history is the story of Katherine of Valois and Owen Tudor's marriage. So romantic, so unexpected, so honest.But this book is not just about that particular story. This book is about Katherine of Valois, beginning from her neglected childhood in a French court ruled by a mad King and an absent Queen. Katherine is telling the reader her story, from her point of view, naive and foolish as it may have been at times. Katherine is heartbreakingly honest with both the reader and herself as she rises to become Queen of England to the great warrior King Henry V, the man she dreamed would be her hero and true love, but died before the dream could even be touched upon. Katherine is straight forward and remorseful as she tells the reader of her depression and melancholy after the death of Henry, and then angry when her lonely heart falls victim to the schemes of an ambitious courtier. Katherine is truthful, never sugar-coating her actions, even when she happens to accidentally fall deeply in love with her servant, Owen Tudor. Katherine makes no excuses for herself as she grasps for the happiness that she has always sought, fighting tooth and nail with council and country for what she believes her family deserves. Anne O'Brien has written a beautiful, bittersweet novel. This story deserved to be told, in exactly this manner. Katherine's story, on Katherine's terms. Highly Recommended."}, {"userName": "Sarah", "userReviewDate": "Aug 23, 2016", "userURL": "http://www.goodreads.com/user/show/2878333-sarah", "userReview": "Katherine de Valois was a French princess married off to King Henry V of England in return for the promise of a French crown. She successfully produced a male heir within the first two years of their marriage, but was suddenly left a young widow when Henry V died whilst his son was still a baby. Katherine then became Queen Dowager, a figurehead for her son, the child King Henry VI.In this novel, Anne O'Brien paints a picture of a lonely, duty-bound Queen who wants nothing more than to love, and be loved. Yet Katherine does not have the authority to decide when (or if) she will remarry, nor to whom. The story becomes a wonderfully romantic tale of Katherine de Valois and Owen Tudor - master of the Queen Dowager's household. Owen was a disinherited Welshman in a role of servitude, but O'Brien's Katherine is completely smitten by him. The union between Katherine de Valois and Owen Tudor would eventually result in the Tudor Dynasty (Katherine being Henry VII's grandmother).I couldn't help but like and admire O'Brien's interpretation of Katherine and Owen, and the relationship that existed between them. Their resilience and determination to be together in the face of constant opposition is what I enjoyed most about this novel. Why else would a Queen marry a servant, if not for love? A sad story overall, but with sweet interludes."}, {"userName": "KarenV", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/342887-karenv", "userReview": "Ugh! This is the third book I've abandoned in as many weeks. I don't know whether I'm just not in the mood for a particular genre, I'm too distracted to get into a book properly or whether I'm just picking bad books but it's unusual for me to abandon so many at once.Anyway, The Forbidden Queen actually started off quite well, although I thought the chapters could have been shorter - sometimes the focus of the story changed at a point when a new chapter would have been better, rather than continuing with the current one. The story was interesting though and provided a good insight into a period of history with which I'm unfamiliar.However, once Henry V died and Edmund Beaufort came onto the scene, I was suddenly transported into a Mills and Boon romance, with page after page (after page) of gushy declarations of love between Katherine and Edmund. I tried to stick with it but it was just too much. I even skipped ahead a couple of chapters, only to find they were still madly in love and I wasn't in the mood for it. The author has been favourably compared to Philippa Gregory but having read several of Ms Gregory's works and thoroughly enjoyed them, I'd have to disagree."}, {"userName": "Ashley Nichole", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/19214213-ashley-nichole", "userReview": "I literally just finished this book. It was absolutely amazing. I may be a bit biased because I love historical fiction, but this was probably one of the best books I've ever read. It really puts a spotlight on Catherine of Valois, but not all of the information in here is historically accurate. Still a good story, though. The plot was pretty good, but the time spacing was a bit off. I feel like it was in fast forward and I couldn't tell if it was supposed to be days or years between some events. Besides that, the character development and realism was astonishing. I felt like this was an authentic story, like the author really felt a connection with some of the characters. Most of this book was dialogue, and not much attention was given to scenery, setting, or any small details. It was very much a \"bigger picture\" novel. While this story was good, I'm not completely sure if I would read another book by this author, but to each their own. Definitely worth a read if you're into historical fiction."}, {"userName": "Stacey", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/10033112-stacey", "userReview": "[ I did find it very interesting that the author went a bit with a Katherine's descent into madness, like her father. Henry VI had the same affliction, and it is interesting to wonder if Henry VIII's behaviour could stem from the French monarchy too. Fascinating, that although we tend to think of the Tudors as a separate Dynasty, they were still interwoven with an already incestuous royal family.  I liked it, but it didn't wow me and I'm not even really too interested in reading more from this author so I'm afraid I've been very stingy with my stars.  (hide spoiler)]"}, {"userName": "Lisa - (Aussie Girl)", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/3741108-lisa---aussie-girl", "userReview": "A very readable telling of the story of Catherine de Valois, Princess of France, wife and mother of English Kings and one of my favourite historical loves stories between Catherine and Owen Tudor, the ancestors of the current British monarchy. Anne O'Brien does a good job of combining the historical facts and the romantic elements of the story of one of England's most unknown but fascinating Queens. ★★★☆ (3.5 stars)"}, {"userName": "Stacie (MagicOfBooks)", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/4264651-stacie-magicofbooks", "userReview": "I will also do a video review here at my channel: http://www.youtube.com/magicofbooks\"The Forbidden Queen\" by Anne O'Brien tells the story of Katherine de Valois---Princess of France, wife of King Henry V, mother of King Henry VI, and the woman who would create the Tudor dynasty. Every since she was a young girl, Katherine was a pawn in everyone's political games, but she will be the one in charge of her fate for once, even if that provokes the ire of the English court and could put her very life in danger.Yes! Some historical fiction love for Katherine de Valois! Okay, this isn't the first book dedicated to this remarkable woman, but still, I'm glad to see the historical fiction book treatment given to Katherine who history often ignores or brushes to the side. The more books about her, the better. Her life has all the makings of an incredible story: a princess of France with a father who has gone mad, a wife of a king who dies tragically, a mother of a future king who is only a baby when his father dies, and a creator of one of the most famous English dynasties. Plus, throw in political and court intrigue and romance and you are hooked on every page.Anne O'Brien delivers a very well done book from start to finish. She basically divides Katherine's life up into three sections: Katherine's marriage to King Henry V, her infatuation with Edmund Beaufort, and her marriage to Owen Tudor. This certainly provides for a speedy narrative, but a narrative that holds your continuous attention, and never feels like it's moving so quickly that you're missing important moments. Katherine gets her fair share of character development, starting the novel as a naive lovestruck girl, to a flirtatious young woman, and finally to a woman who realizes the mistakes of her past and wants to love and be loved in the fashion that she so chooses and won't let the English court rule her every decision. So who to recommend this book to? Obviously fans of historical fiction. And also to fans of the Tudor dynasty. Many people tend to only read about King Henry VIII and Queen Elizabeth I, but I highly recommend picking this book up if you want to start right at the very beginning...the prequel if you will. We don't know much about the real historical Katherine de Valois, but I like to think that this book is a true representation of her and I hope people see what a remarkable woman she was."}, {"userName": "Patrícia", "userReviewDate": "Dec 28, 2013", "userURL": "http://www.goodreads.com/user/show/4915934-patr-cia", "userReview": "Opinião do blogue Chaise Longue: http://girlinchaiselongue.blogspot.pt...Anne O’Brien vive nas Marcas de Gales, uma área entre Galês e Inglaterra, num chalé com mais de duzentos anos, onde o passado ecoa nos castelos medievais com conexões com os Plantagenetas e os Tudor, conexões essas que levaram a autora a descobrir as lendas e a riqueza da atmosfera da Inglaterra medieval e que, depois dos seus romances históricos sobre a Restauração e a Guerra Civil da Inglaterra de Carlos II, a fizeram começar a escrever romances medievais.Professora de História, Anne ambicionava escrever romances históricos, tendo o seu primeiro livro sido publicado em 2004. Quando escreve, a autora entretém-se no seu jardim, através do qual desenvolveu o seu interesse por ervas e o seu uso, algo que usa amiúde nos seus livros. The Forbidden Queen é o seu quinto romance histórico. Ainda não foi traduzido e foi publicado em 2013.Considerada melhor que Philippa Gregory, Anne tem dedicado os seus romances às mulheres esquecidas da história de Inglaterra, motivo pelo qual quis ler esta autora e, ainda bem que o fiz pois este seu romance satisfez-me como poucos. Apesar da pouca informação existente sobre a sua protagonista, a autora teve o cuidado de imiscuir na perfeição história e lenda, sem exageros ou demasiada personalização ou fantasia, criando um romance envolvente e soberbo sobre uma das rainhas mais importantes (mas esquecidas) para a linhagem real inglesa. Com uma escrita onde se nota a paixão da autora pela História, cheia de charme e beleza, The Forbidden Queen conseguiu um lugar cimeiro nos meus romances históricos preferidos, sem grande esforço.Desde a infância à morte de Katherine Valois, o leitor é levado numa viagem única pela vida desta rainha, usada como peão na Guerra dos Cem Anos que, esquecida e ignorada por todos à sua volta, se atreveu a viver uma história de amor abaixo do seu estatuto e, assim, mudando para sempre a história da Inglaterra. Entre lenda e factos históricos, o enredo apresenta-nos um quadro realista, por vezes belo e outras, cruel, das intrigas e alianças políticas, da vida de corte, da guerra entre a Inglaterra e a França, do ódio aos galeses e da pouca importância das mulheres para a sociedade, fosse qual fosse o seu estatuto. Brilhantemente, todos estes factores são entrelaçados com o romance, transportando-nos para a Inglaterra do século XV e para um dos períodos mais atribulados da história deste país.Página a página, mais do que a época, vamos conhecendo a mulher que foi bisavó de Henrique VIII. Através da sua voz, é nos dado a conhecer as inseguranças de uma jovem princesa nunca amada e entregue ao inimigo, de uma jovem casada que pouco amor recebe e depressa enviúva, das suas lutas contra os homens de poder do seu novo país, do seu papel de mãe nunca aceite, de mulher que sonha com liberdade e amor. Insegura, inocente e ingénua de início, Katherine vai crescendo aos nossos olhos, aprendendo com as vicissitudes e experiências da vida, de princesa a Rainha Mãe, ela vai ganhando fulgor com o desenrolar da sua história, uma história cheia de promessas do que poderia ter acontecido e das consequências inimagináveis dos seus actos.As personagens são brilhantemente elaboradas, tão reais quanto os seus actos, interessantes e cheias de vida que, tornam a leitura ainda mais prazerosa. Aproveitando as intrínsecas e complicadas ligações entre personagens, a autora vai nos dando um prenúncio do destino enquanto nos leva a apaixonar pelas vidas dos que escreveram a História. Desde Henrique V de Inglaterra a Carlos VI de França, aos grandes senhores de Inglaterra e aos futuros reis Henrique VI e Carlos VII, nenhum deles é esquecido nesta trama.Melhor do que Philippa Gregory? Sim. Anne O’Brien é uma autora notável e cuidadosa que romanceia a História sem esquecer os seus limites. The Forbidden Queen é um romance soberbo que satisfará qualquer amante do género.**I received a digital arc from NetGalley in exchange for an honest review**"}, {"userName": "La Fenice Magazine", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/22195890-la-fenice-magazine", "userReview": "Anne O'Brien ci descrive un romanzo storico raffinato e pulsante di vita. Come ci rammenta la scrittrice nelle note, conosciamo ben poco la protagonista, Caterina di Valois, figlia di Carlo VI di Francia e Isabella di Baviera, sposò Enrico V d'Inghilterra e gli diede un figlio, il Giovane Enrico poi divenuto Enrico VI. La storia sembra ardua ma posso garantirvi che non lo è; l'autrice semplifica e rende naturale il decorso della storia, l'addolcisce e l'abbellisce. Valorizza Caterina e la fa divenire una rispettabile donna, intelligente e piena di passione. Tutto gira intorno ad ella anche se forse nella realtà molte volte le donne a quei tempi venivano denigrate e usate solo come intermediarie per arrivare a un accordo fra due nazioni. Così furono le sorti di Caterina data in sposa a Enrico. L'amore fra loro nacque scomposto e lei ancor giovane, vissuta sempre in cattive acque prima e poi in un convento, si innamorerà di un uomo forte, valoroso e soprattutto ricco. Tutto avrà però la sua fine. Enrico non si dimostrerà l'uomo dolce e sensibile che è parso ma un uomo assetato di potere, un arrampicatore sociale, come tutti a quei tempi d'altronde; un uomo di elevata carica nobiliare come Enrico non poteva essere da meno. Lei verrà presa in sposa per congiungere l'Inghilterra alla Francia ma tutto ciò si presenterà in maniera sconnessa a causa del fratello di Caterina (il Delfino di Francia).La scrittura è fluida, non è un monologo, ne un tedioso romanzo storico ma un elegante scritto costruito e elaborato minuziosamente. Anne O'Brien sembra aver perfettamente centrato l'anima di Caterina, la descrizione di ella e dei suoi comportamenti sono pennellate luminose in quelle epoche oscure. Il medioevo è per noi storia buia, ma con l'aiuto di questa abile scrittrice riusciamo a immedesimarci perfettamente nel romanzo. Un romanzo che toglie il fiato, ti fa piangere, gioire e vivere insieme alla protagonista. Caterina di Valois, rispettabile, impeccabile, Regina Madre diventa vedova fin troppo presto a soli 22 anni ma la sua ineluttabile voglia di vita prevale.In seguito fu presa di mira da Edmondo Beaufort abile scalatore che la indusse in tentazione ma lei seppe come destreggiarsi dai suoi inganni e se ne svincolò. Infine, giovane donna sola, ebbe la tentazione del suo Primo Servitore Owen Tudor con cui nacque una profonda e sincera storia d'amore, il primo vero amore dal quale nacque poi la Dinastia TUDOR in seguito! Tutto sembra perfetto, uno stile particolare e curato, amabile; Caterina e tutti i personaggi che la circondano ammaliano il lettore e lo trascinano nei meandri più nascosti della storia. Le descrizioni sono meticolose e avvolgenti. La trama accattivante e l'esposizione di Anne O'Brien un elogio alla Regina Madre più bella di tutti i tempi. Caterina di Valois. Una donna presa in considerazione troppo poco dagli storici ma splendidamente elegante, regale e garbata.Consigliato anzi consigliatissimo per un pubblico che ama le vicende storiche, gli intrighi di corte, la bellezza di quei tempi, lo sfarzo e la nobiltà; tutto è racchiuso in un solo e unico volume ...La Regina Proibita. Buona LETTURA!\"Vostra è la fibiaChe tiene agganciata la mia lealtà,Voi bandite gli affanni dalla mia anima\""}, {"userName": "Melissa", "userReviewDate": "Sep 23, 2015", "userURL": "http://www.goodreads.com/user/show/11425610-melissa", "userReview": "See my other reviews at Never Enough BooksThe Forbidden Queen by Anne O’Brien follows Katherine de Valois from French Princess to Dowager Queen of England. Wed in an arranged marriage to King Henry V at 19 and then widowed by 21, she finds herself thrust in to a game of politics with the prize being her hand and potential control of the throne through her young son. Just as there are those who see her as a prize to be won, there are those who see her as the woman she is. Katherine must learn to tell friend from foe, not only for herself but for the good of England.While The Forbidden Queen is based on actual events, historically there unfortunately very little on the actual person Katherine de Valois. Some points are known and are true; such as she is the daughter of Charles VI of France and was married to Henry V where she bore him a son, Henry VI. She was sent to the convent at Poissy at a young age but whether it was because her father was insane and her mother wished to be rid of her or whether it was so Katherine could receive a proper education is up for debate.How content she was in her marriage to Henry is also another point of contention. During that time women, especially high born ladies, were seen as little more than chattel. They were regarded only as far as how much could be gained through their marriage to another. In effect, women were considered little more than animated property and title deeds. And unfortunately, history paints Katherine de Valois with such broad strokes.What kind of person Katherine truly was is virtually unknown. Generally she is regarded as being not all that bright, the stereotypical ‘dumb blonde’ if one prefers. Yet to have survived for so long in the cutthroat court, Katherine must have had at least a modicum of intelligence. And that is how O’Brien paints her – not as some dim-wit but as an intelligent woman.With her rather lacking upbringing, Katherine is somewhat emotionally stunted by the time she reached adulthood. Something O’Brien plays upon as throughout the novel Katherine constantly doubts herself. She believes herself to be in love with King Henry and her tender heart is broken when he does not return her feelings with the same fervor. Some years later when she develops feelings for Edmund Beaufort, she is devastated to learn that his only reason for courting her was for her crown and the power it held. So when Owen Tudor tries to claim her heart she initially pushes him away. It is when she comes to realize that he does not see her as some prize but as a woman does she allow herself to be happy.Anne O’Brien’s version of Katherine de Valois is a truly memorable one. The real woman is mentioned only briefly in history and not very flatteringly. This version is an intelligent woman who throughout the tale learns to trust her feelings. Though she starts the story as little more than a pawn, by the final pages she emerges as a true queen."}, {"userName": "Kelly", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/8545345-kelly", "userReview": "The story of Katherine de Valois was not one that I was overly familiar with. Though every history nerd knows of Henry V, there appear to be few who know about his French Bride and the mother to his heir. The first quarter of the novel began with promise, with a strong plot and a good selection of characters. Though I thought Katherine was quite meek I hoped that life with Henry and as a Queen would bring her out of her shell and create another legendary Medieval Queen.The stark, neglected early life of Katherine was a lovely comparison against the sudden luxuries that being Queen of England bought. I thought perhaps she would grow appreciative of these indulgences but it developed that Katherine valued one thing above all the fripperies of Queenhood. Love, or more specifically I suppose, attention. This dependence on men for attention actually became very dull reading quite quickly, and after 500+ pages I was certainly ready for the novel to end.There was an undeveloped and awkward juxtaposition between the Queen that Katherine was - meek and naive - and the image that O'Brien wanted to paint of a strong, medieval Queen. When she did flex her royal muscles she tended to give up on the principle very quickly - Defending her position as Henry's mother and her role in his household and then suddenly giving up on the idea by mid-book. She had no interest in politics, war or society. She led a secluded, sheltered life away from court, which was such dull reading. Days and days of her moving from house to house and doing nothing while there. Even Fifty Shades of Grey had a subplot to entertain the reader to break up the periods of...  romance. I can understand why she perhaps didn't bother herself with the ins-and-outs of Henry's wars, or to understand the roles of society following Edmund's political machinations, but she didn't even attempt to understand the Welsh issue once involved with Owen and he was supposedly the  love of her life . She was so self-absorbed. Her world was everything within the walls of her home, but did not extend beyond. Again, this was far too little plot to fill 500 pages and became quite dull. Overall I felt that there was not enough interest or context within the novel to sustain the length. Katherine was an interesting figure but so reliant on male attention that the plot points were merely a collection of times that one of her lovers glanced her way, smiled at her or used her name... Katherine was never happier than when she was being adored by a man, and unfortunately I prefer my Medieval Queens more fiesty.I enjoyed the start, the early days where Katherine had to learn the English way and how to be Queen, but lost interest around about the time Edmund arrived on the scene."}, {"userName": "Catherine Yarwood", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/52001847-catherine-yarwood", "userReview": "The Forbidden Queen tells the story of Katherine of Valois, who was briefly married to Henry V (an English king most famous for his defeat of the French at the Battle of Agincourt). She is the daughter of the famously-mad French king Charles VI and her marriage was a political match to award Henry V extensive lands in France. Henry dies young, his heir Henry VI still a baby, and Katherine lives as a widow. She is perhaps most famous for marrying her servant Owen Tudor (a huge scandal!) and beginning the Tudor line that later claimed the English throne. She died quite young - aged only 35 years old. The context is the cusp of the Wars of the Roses.The novel charts nearly Katherine’s entire life - including an alleged romantic match with Edmund Beaufort which was not allowed by the council ruling in the place of her son. It follows her romance with Owen Tudor and ends as she enters a nunnery, fearing her imminent death (which did indeed happen a couple of months later).This book is primarily a romance, rather than a historical fiction. Though there has clearly been a lot of research - at the end of the novel the author has included some short notes on where she got certain plot ideas from, and also about the places mentioned in the novel. I always appreciate this context for fiction based on real events. I also felt there was a strong effort to incorporate Welsh medieval history, as Owen Tudor was Welsh. To me there could have been a lot more of this interesting subject.Anne O’Brien mentions that Katherine has been portrayed in history as a stereotypical ‘dumb blonde’; beautiful but lacking any substance or involvement the politics of the day. O’Brien thinks this a disservice and wanted to portray a ‘remarkable woman’. To me, this portrayal didn’t come across. Katherine’s character is a typical romantic heroine - silly, obsessed with love and romance, needing protecting and saving by big, strong men. She makes poor decisions and, quite frankly, needs a good slap more than once.I’m not a romance novel fan, so it’s tricky for me to judge this book. I enjoyed the early parts that detail Katherine’s marriage to Henry V, but once she became involved with Owen Tudor I had to start skipping long, impassioned sections with speeches, desperate longing and forbidden trysts. I felt like we were missing all of the action - this was a politically dark and dangerous time as Edward III’s ancestors were beginning their power struggle between houses of York and Lancaster. However, to be fair, there is no evidence that Katherine was involved in the politics of the day. This is probably an accurate representation, but I personally didn’t feel interested in her."}, {"userName": "Mirella", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/19995228-mirella", "userReview": "Katherine de Valois was the daughter of King Charles VI of France and Isabelle of Bavaria. When she was fourteen, her parents entered into negotiations to marry her to King Henry V of England who demanded a large dowry and acknowledgement of his right to the throne of France. After much bantering back and forth, the deal was struck. The moment Henry saw Katherine, he was smitten by her great beauty and they were soon married. True love grew between them and Katherine was very happy with her new surroundings and husband.In 1421, while Henry was fighting in France, she gave birth to a son and named him after his father. Before Henry could return home to meet his namesake, he died of dysentery. At the tender age of 21, Katherine became a widow. Not long afterwards, her father died, leaving the infant Prince Henry to be become king of England and in parts of France. In time, Katherine fell in love with Edmund Beaufort, her late husband 19s cousin. Humphrey, her late husband 19s brother, concerned she might remarry, introduce a bill in Parliament making it impossible for Katherine to remarry without the king's consent. If she did so, her husband would lose his lands and possessions, but their children would be considered members of the royal family. Oh, and he also included the clause that the king must have reached his majority before he could grant his approval. At the time this new law was set in place, the king was only six years old. Edward Beaufort abandoned his ambitious quest to marry the dowager queen and soon found himself another wife. Katherine was trapped, kept under watch by the king 19s counsellors. Ah, but soon, love returned to her life in the form of a handsome man named Owen Tudor of Wales. An impoverished noble, he worked as the keeper of her household and wardrobe. Their love burgeoned, they secretly married, and she soon bore him a child, sending shock waves and scandal through the court. The Forbidden Queen is a historical novel that sticks close to the facts. The story is conscientiously written with lush detail and historical insight. What I found most compelling were the struggles Katherine faced as she fought to stay close to her son while machinations were at work to keep her at a good distance from any decision making. She was to appear by the boy-king 19s side, but was prevented from holding any influence over him.I had never read a novel about this lesser known queen, and was thrilled to have her story portrayed with such passion, elegance, and vivid detail. The writing flowed easily, making it a pleasant read. Highly recommended."}, {"userName": "Allison  Macias", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/2664947-allison-macias", "userReview": "Forbidden Queen by Anne O'BrienKatherine de Valois is a queen won in battle. Given to Henry V of England after the battle of Agincourt, Katherine is smitten with her groom. As a forgotten child, she longs for love and a purpose. Her purpose, according to Henry, is to provide an heir and nothing more. Heartbroken, Katherine learns to live alone and unloved. When she is widowed young, Katherine feels her youth end. Destined to be the Queen Mother, Katherine must give up her wants for the good of her son and England's future king. But life has other plans for The Forbidden Queen.This book was my first book by Anne O'Brien, and my first book about Katherine de Valois. Anne is a wonderful author, who brings Katherine to life. I enjoyed how Anne even displayed her flaws, including her insecurity and mood swings. Though some thought Katherine's indecision made the book stall, I found it strengthened it. I love how both Katherine and Owen fought hard for their love, even after they married. This is an awesome book. I loved it! Thank you to the publisher for providing me a copy."}, {"userName": "Carrie", "userReviewDate": "Jan 30, 2013", "userURL": "http://www.goodreads.com/user/show/1170372-carrie", "userReview": "The Forbidden Queen is a bittersweet and moving book. Katherine De Valois is a well written character that you soon find yourself rooting for.The book starts with Katherine and her sister being brought up in a loveless household in Paris. Where their parents have not time for them. Their Mother is too busy keeping her own court whilst their father suffers from madness. Katherine finds her escape from her hell in the form of her marriage to Henry V, the English hero of Agincourt and she hopes that this is her way to find true love. However soon strikes close to home for Katherine and she finds herself without a husband and without the love that she so craves.As the book progresses you find you want Katherine to find and keep hold of the love that she wants and needs. As she falls in love with each suitor, you do too due to Anne's O'Brien brilliant writing style."}, {"userName": "Snidget85", "userReviewDate": "Feb 01, 2017", "userURL": "http://www.goodreads.com/user/show/60775931-snidget85", "userReview": "Awful. Melodramatic in both plot and word choice, even dipping into the downright ridiculous in some points (when I read the phrase \"liquid thighs\" I actually said 'are you serious?' out loud). There are multiple contradictions in both characterisations and in plot which were frustrating. It is also teeming with cliches.The political machinations between Edmund Beaufort and the Duke of Gloucester were mildly interesting, as was the tiny bit of Welsh history that was thrown in. The rest of the plot was melodramatic rubbish."}, {"userName": "Kate Hewitt", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/4294999-kate-hewitt", "userReview": "I didn't know that much about Katherine of Valois and so I enjoyed this book about her short and somewhat unhappy life. I wish the story hadn't jumped several years to when she'd been married to Owen Tudor, but I can understand why the author made that choice."}, {"userName": "Linda Shea", "userReviewDate": "Jul 19, 2015", "userURL": "http://www.goodreads.com/user/show/6972459-linda-shea", "userReview": "A very enjoyable read - and although no spoilers, the end was not what I expected. Katherine of Valois was truly a remarkable woman. This book made me want to read more by Anne O'Brien!"}, {"userName": "Moppet", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/3118209-moppet", "userReview": "Review here: http://misadventuresofmoppet.wordpres..."}, {"userName": "Romina", "userReviewDate": "Feb 05, 2013", "userURL": "http://www.goodreads.com/user/show/4388582-romina", "userReview": "Originally posted in: http://rominasbkreviews.blogspot.com//2013/03/the-forbidden-queen-anne-obrien-2013.htmlBook Source: NetGalleyThe Forbidden Queen, a historical novel based on the life of Katherine of Valois, definitely caught my attention as it not only is it about a little known (at least by me) queen, it is about a woman who was the mother of King Henry VI (by King Henry V), grandmother of King Henry VII (father of the Tudor dynasty, by her union with Owen Tudor), thus great-grandmother of the infamous King Henry VIII! However, even before all this, she was also the daughter of the French King, Charles VI and the infamous Isabeau of Bavaria (who also needs her own novel, by the way!). This is all a bit too much to take in, so I've posted part of their family tree, which I obtained from www.britroyals.com. (viewable in my blog) If anybody's interested in seeing the entire Plantagenet family tree, just click on the link and there you have it!The author very cleverly states in the cover that Katherine is an \"innocent wife,\" a \"captive widow\", and a \"Tudor mistress,\" giving us the idea that this woman had three separate lives - and indeed she did. I'm going to be bold enough to include a \"pawned princess\" title to the set as before she married Henry V, her parents took advantage of her and her siblings to obtain as much power as possible.Pawned Princess Katherine of Valois is a young princess at the start of the book, aproximately five years old, living in squalor and abandonment in the French Palace, Hôtel Saint-Pol, alongside her slightly older sister, Michelle, abandoned by her insane father and her unfaithful, power-hungry mother. (I wonder if the bouts of insanity King Charles VI underwent were passed on to his grandson, King Henry VI? Hmmm... Did anyone write some scholarly paper on it? Ok, back on track.)After a few years of living like street urchins, but in a palace, their mother decided to remember the existence of her two youngest children and took them to be raised in a convent at Poissy. There, Katherine and Michelle lived in austere, strict circumstances in order to be disciplined into becoming acceptable princesses to be sold married whenever time served. To be honest, before reading this novel, it never occurred to me that princesses (or princes, for that matter) could live in such a neglected manner. Granted, I've always read about their having their own households by the time they were one year old, and such ridiculousness, but to be openly left to starve and then placed in a convent... Wow! It definitely was not good to be royalty at that time, at least in France. Kudos to the author for depicting an event so realistically and including uncommon information to the public.Anyway, she lived there in seclusion until she became a teenager, when her mother saw fit to visit her again to inform her of her plans to marry her off to THE Henry V of England, aka the Agincourt victor. Of course, even though he was a lot older, what girl, especially one living in her circumstances, wouldn't dream about finally being free, married to a powerful king, becoming queen and living happily ever after? She did of course!And so, her mother pawned negotiated her marriage to Henry V, who actually played a bit hard to get and demanded a high dowry, until Queen Isabeau decided to take away the Dauphin's right to inherit the crown of France (remember her husband, the king, was still insane and couldn't really object) and passed it on to King Henry V of England through Katherine once the French king passed away. Who could object to the possibility of being King of France whilst already holding the title of King of England? Absolutely no one, so King Henry V accepted the terms and decided to marry the fair Catherine. Innocent Wife As I already mentioned before, Katherine went into the marriage with all the naivete expected of a young girl of 19 who had no life experience. She believed at first that her husband the king really did care for her, but it was mostly in her imagination. He was corteous, kind, but often absent. Anne O'Brien does a wonderful job depicting the feelings this innocent wife probably had concerning her place in court, in society, but most of all, with her husband. We must recall that she was not only a foreigner, but also daughter and sister of those who were openly warring England. There were those who openly despised and undermined her, and she was practically powerless to do anything as her own husband was often absent or busy, not to mention she was also learning the language! The reader feels the alienation Katherine constructed around her, the hopes she had concerning her marriage, but we are also cold witnesses to her reality, while Catherine is still innocently yearning for something more. She centered her hopes on a future child and how he (it HAD to be a 'he' as Henry would accept nothing else) would magically 'repair' their marriage... but it was not to be. Indeed, after almost a year of marriage, Catherine became pregnant and Henry... Henry went to France to fight her brother, the Dauphin Charles. Yes, King Henry V is definitely illustrated as a coldhearted, task-oriented, ambitious man who had no time for his young, needy wife, so this reader has no compassion for him. However, Katherine's evolution into maturity is shown well, she comes into her own as a person once she admits the truth about her life and the situation of her marriage. It is a believable transformation from a star-struck teenager to a dutiful, conscious wife.Alas! A young heir, another Henry, is born, making Katherine sublimely happy, but still thinking a bit about her husband. A few months after his birth, she decides to visit Henry in France as he seems not overly anxious of returning to his family, or even meeting his son, for that matter. Katherine goes and finds her husband sick with dysentery, making her concerned with his well being. He thinks nothing of it and decides to trample on to another battle, but he never made it… *SPOILERS AHEAD*: and he died before the fight! Katherine finds out a few days later and although she was not a long distance away, he never took the time to actually send for his wife during his last days. Katherine, naturally, is devastated not only by his death, but because even in his deathbed, he had no interest in seeing her. He had sufficient time to deal with all the final details of his son’s future reign, but none to give his wife a last kiss. Total pig!Captive WidowUp to this point, I can honestly say that the story was captivating; however, the same cannot be said during this 'section' of the book. We're encountered with a newly widowed Katherine, an extremely whiny, self-centered, Katherine who seemed to only think about the 'what ifs' of her life (of course, involving her husband) and her bouts of depression. She's bored, she feels useless and powerless in front of her brother in law, the Duke of Gloucester, who's in charge of the realm until her son's coming of age. And there are chapters and chapters and chapters of how bad she feels, of how inadequate her life is, how she's too young to have her life be over (Gloucester had instructed her to act the part of the saintly and pure Queen Dowager)... the author tried to entice us with *SPOILERS* an 'affair' with the younger Edmund Beaufort, but their relationship seemed to be somewhat, childish. They dressed up, kissed on the sly, gave each other heated looks, touched hands, and so forth. And this went on for a year. Yes, A YEAR. I (or any reader) could see from a mile away that Edmund was just using her continued naivete in trying to gain more power... and he wasn't even very smart about it since he never even managed to *SPOILERS* seduce her or anything. Every single person she knew and cared for tried to warn her about her precarious relationship, but she seemed to immature to understand reality, she was blinded again by him. At this point, I lost patience with Katherine and was rooting for Gloucester to finally end the ridiculous liason so as to get to the good part, to Owen Tudor. Owen is introduced here as the Master of the Household, but as a silent brooding figure who for some reason (I can't imagine why) he disapproved of Katherine's going-ons with Edmund by giving her 'dark looks' and the like. Foreshadowing, people! Again, I got the feeling that Anne O'Brien was trying to create some romantic and dramatic moments to grab the reader's attention, but sadly, it didn't work. I for one, wasn't taken with Katherine's nor Edmund's characters; I identified more with the ladies in waiting who were gossiping about their improper behavior! Alright, so I won't say how Edmund finally got out of the picture, since that was the most exciting part, except to say that I was relieved!Tudor MistressOk, so Edmund's out, Katherine's with a broken heart (you have to read it to know why!) and sworn off men. [Yup, with a burning at an impromptu bonfire (candles) to symbolize the burning of her exes, a la Guy Fawkes, and all.] We have a new, stronger Katherine who refuses to wallow in her misery, for oh, about a day. It isn't clear how much later it was that she suddenly realized the existence of Owen Tudor, but it seemed as if about a week passed. Here we also experience a bit of sloppy writing as we have Katherine one minute hating all men after 'loving' one for about a year, and then (have I mentioned that a week passed?) she suddenly sees how she was incredibly attracted to her Master of Household who she's been living with for about eight years (or more) and never even LOOKED AT. And not only attracted, but head over heels in love with. And realizing that her previous \"loves\" were nothing but immature fancies. Nonetheless, I decided to ignore all the sudden rushing of feelings because, after all, history is about to happen with none other than, a Tudor! So Katherine is painfully in love, but doesn't want to show it, although she does since all her ladies in waiting realize it, as does probably Owen since she stutters and blushes every time she's in any type of contact with him. She asks her most trustworthy companion, what she should do about her newfound feelings and at first she says it's a bad idea because, well, he's a servant, and one of the traitorous Welsh at that... though they do discuss his incredible sex appeal so they decide she should finally go for it. Katherine was naturally dubious (isn't she always), though at this point I have to agree with her since she was the QUEEN for god's sake! Repercussions! Gloucester! Her soon-to-be-king son! Her reputation! Although I knew she would ultimately *SPOILERS* become his mistress and later his wife, I truly enjoyed reading about her hesitation because I'm sure it was realistically portrayed. No woman in her right mind would have just jumped into bed with a servant after not having any contact with a man for nine years, and a KING at that, while being under constant scrutiny of the public and her own household, as well as her powerful brother in law and son. I believe Katherine of Valois was portrayed accurately as an insecure woman, mainly due to the circumstances of her conflicting life as a princess, as a neglected wife, and as a lonely widow, and the author grasped these points and masterfully embroided them into the story. I thoroughly enjoyed reading about this wonderful Queen whose life decisions played such a decisive role in history, but also about the woman behind the role. Anne O'Brien took the time to research and include historical accuracy so as to educate the reader, but unconsciously; it never seemed like a history lesson, but like the story of an exceptional female at the time of an exceptional historical point in time, which I'm sure was the intent. Her relationship with Owen was a true pleasure to read. This quote alone redeemed the whole 'widow' section:\"Better to live a day with you, dear heart, than a lifetime with the  breadth of the country separating us.\"Awesome ending, unexpected, highly recommended!4 stars"}, {"userName": "Liz Wharton", "userReviewDate": "Jan 31, 2016", "userURL": "http://www.goodreads.com/user/show/13488519-liz-wharton", "userReview": "Time to delve into my old favorite: historical fiction...I stumbled upon The Forbidden Queen when I was hunting in Overdrive for something different to read from my latest kick of Austen-inspired Regency romance and smoldering modern novel series. I wanted something that reminded me of my obsession since my pre-teens - early English Monarchy. And who wouldn't want to learn about a forbidden queen? Admittedly a big fan of Philippa Gregory and Jean Plaidy, I was interested to delve into this book by Anne O'Brien. And I wasn't in any way disappointed! This historical romance is based around Katherine (or Catherine) of Valois, a french princess from the 14th century who became Queen of England through a fluke of a marriage. Even more importantly to many, she also became mother to the Tudor dynasty, to which even today's English monarchy can trace their roots back. Now, just an FYI - I'm a bit history obsessed, so this review is going talk of the book, and history behind it. I also plan to spoil a bit of the story. If that isn't your thing, you might wanna find another review to read. {Spoiler Alert}Katherine of Valois (by Silvester Harding, 1792)We are introduced to a very young and starved (literally and emotionally) young princess Katherine, running around her royal home in rags. Not what you picture for a child of the top class, but unfortunately, madness ran in her family and her father was most affected by it. Katherine, along with her sister Margaret, were ignored by both mother (reported floozy and adulterer) and father (mentally ill). No love in her life greatly influences Katherine, causing her to become unsure, nervous and needy. Her life becomes structured (in a convent) and strict, despite her need for affection and care. It is a sad, sad story that was sadly true of the real Katherine. Henry V (by unknown artist, before 1923)From here, a hero appears. Henry V, the hero of England, king that has been slaughtering her French kinsmen in the Hundred Years War, offers for her hand in marriage. Even among the honor and splendor, Katherine finds that she is the last pick from her family, and worse, that there is a price for her marriage. Still, the poor love-starved girl finds Henry handsome, compelling and even kind. But that cannot last for this sweet soul. The Marriage of Henry and Catherine (by Jean Chartier, 1490) Katherine's search for love is not ended in the \"happily ever after\", fairy tale royal wedding. Not only is she a foreigner whisked into England without a friend in site, but she is mostly tolerated by her king husband, as his ambitions and visions of a united England and France are his sole focus. Once again abandoned, you can't help but feel for the sorry position of the new queen. Despite all this, she has this hidden strength that I love to see written into historical figures we know little about. I'm sure she was strong - for she survived the sudden death of her husband and managed to raise her son to be the next King of England. All this, in the very face of villains that would plot to hold her virtual prisoner and bind her will every way they could. Still, Queen Katherine would not break. Queen Katherine (by Catarina Carol, 1446)I won't even touch on Edmund because that whole part of the story is why this is a four star and not a five star review. Not that I blame the author for writing about the worthless coward, but no one can truly love Edmund Beaufort, once his serpant-in-the-grass motivations are revealed. What can I say about this man, other than, \"Once a Beaufort, always a Beaufort.\" Owen Tudor (from the BBC iWonder site)At last, my favorite character. From the first mention of Owen Tudor, I was intrigued. I must note here that, before reading this book, I had not deeply explored this far back into the Tudor line. I believe the farthest back I had gone was Henry VII. But after my beloved Welshman Owen Tudor (or Owain ap Maredudd ap Tudor) appeared in the picture, I scampered off to Google so I could read more on the real man. The Owen Tudor of this novel is proud, respectful, dutiful, and solemn. But he is also loyal, loving, fierce and passionate. And for poor Katherine, so unloved for most of her life, this is the ultimate appeal (that and his hot bod - LOL). Very little is known about the real Owen, but I love how Anne O'Brien develops him into this hero that Katherine first thought Henry V to be. And through this, grows a love that will spawn the beginning of a dynasty that will last through the years. Tudor Family Tree (from the English Monarchs site)The writing in this novel is compelling, and drives the reader to not want to put it down - the marks of a good novel. The historical references are good, most of the research sound, but the most compelling part of the book for me is the characterizations of these well-known historical figures that we know very little about personally. That makes this book well worth the read. And then go read about the true history to add to your fun! Next, we tackle a new type of novel review for me - fantasy! For more on the history behind The Forbidden Queen, please follow the links by the pictures. I don't recommend Wikipedia (which can be faulty by its very nature) for the full truth behind the history, but as an overall summary, it isn't bad."}, {"userName": "Kirstie Fisher", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/1813503-kirstie-fisher", "userReview": "I have never read about Katherine de Valois before and this was the first novel. I had been reading reviews about Anne O'Brien's books and was quite looking forward to it. This was my first novel by this author and I really hope that her other books are better than this one. Maybe it is from years of reading Historical Fiction Authors like Philippa Greogry and Alison Weir, but I found the whole novel to be very much as if an amateur had written it. The story jumped from scene to scene, year to year, without having any indication that time had passed. There was no fluidity between chapters. And I found the ending to be very abrupt. One minute she is giving birth to Owen and the next she is, what I assume, entering a nunnery before the madness takes over. The relationship between Katherine and Owen Tudor felt forced in the story. One minute he is ignoring her and the next they are all over each other like fleas on a dog. The story didn't mesh well and I think it will be awhile before I read another Anne O'Brien book."}, {"userName": "Jennifer N", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/24333799-jennifer-n", "userReview": "This is Katherine Valois's story. She grows up in poverty even though she is a French princess and is married to the English King as a teenager. He is neglectful and just wants her lineage to have a claim to the French throne. He is dead within a year and she is left as a young widow with a baby son. Henry's brother immediately takes control and relegates her to the sidelines. He vetoes one suitor and makes a law that she cannot be married without approval of the council and anyone who marries her anyway will lose all his property. She falls for her steward Owen Tudor and helps create the Tudor dynasty. O'Brien portrays her as a strong, intelligent woman even though she is uneducated without powerful friends."}], "description": "1415. Il gioiello della corona francese, Caterina di Valois, sta aspettando che re Enrico V d'Inghilterra la salvi dalla rovina. Lui, intanto, sta falcidiando la sua gente ad Agincourt e ciò che vuole da Caterina è la sua corona, non certo il suo amore innocente.Per Caterina, l'Inghilterra è un covo di avarizia, ingordigia e diffidenza. E quando si ritrova vedova del re a ventun anni diventa ambito premio per molti.Inizia un gioco politico mortale, in cui la regina vedova dovrà presto imparare a districarsi. I contendenti il Duca di Gloucerster, Edmund Beaufort e Owen Tudor sono già pronti a giocare. Chi riuscirà ad averla? Chi ne causerà la rovina?Ecco la storia di Caterina de Valois.", "title": "La regina proibita", "url": "http://www.goodreads.com/book/show/25009447-la-regina-proibita", "average": 3.78, "cover": "https://images.gr-assets.com/books/1424787379l/25009447.jpg", "reviews": 197, "authors": [{"url": "https://www.goodreads.com/author/show/64974.Anne_O_Brien", "name": "Anne O'Brien"}], "type": ["Historical", "Historical", "Fiction", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/25009447-la-regina-proibita", "http://www.goodreads.com/book/show/16249595-the-forbidden-queen", "http://www.goodreads.com/book/show/17791046-the-forbidden-queen", "http://www.goodreads.com/book/show/17611679-the-forbidden-queen", "http://www.goodreads.com/book/show/18168507-the-forbidden-queen", "http://www.goodreads.com/book/show/18526150-the-forbidden-queen", "http://www.goodreads.com/book/show/24987565-la-regina-proibita", "http://www.goodreads.com/book/show/12438180-the-king-s-concubine", "http://www.goodreads.com/book/show/7506776-virgin-widow", "http://www.goodreads.com/book/show/9756599-queen-defiant", "http://www.goodreads.com/book/show/23249847-the-king-s-sister", "http://www.goodreads.com/book/show/19015943-the-scandalous-duchess"]}