{"ratings": 9747, "userreviews": [{"userName": "Diane Barnes", "userReviewDate": "Aug 18, 2014", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "If you like fast paced, action filled, plot driven novels, this this is not your book. However, if you, like myself, love beautiful prose, slowly mounting realizations, characters you come to know and love little by little, and immersion into their lives and the story being told, grab this book and don't let go until you finish the last wonderful page.It takes place in the wilds of northern Canada in 1975, at a small radio station in Yellowknife. Harry Boyd is the station manager, overseeing the quirky, independent people who work there, some of them runaways from other places and situations, some of them from the native population. Five of these people form the nucleus of the novel, and four of them decide to make a 6 week, 500 mile trek through the great barrens of the north. This changes all of them in unforseen ways, and sets in place the paths of their future lives.I found myself reading for their lives, as though I could only insure their happiness and safety by not taking my eyes off the page. I was actually on the page with them, approving their decisions, or hoping against hope they wouldn't make the wrong ones. They didn't listen.Elizabeth Hay is a magician with words, and seduces you quietly into her world, then doesn't let you go, even after turning the last page. \"The phrase that came to her mind was \"the long and sudden of it.\" We go on and on through the long months of our lives until we hit a sudden moment that stuns us.\"That's the truth of this book."}, {"userName": "Carol  ꧁꧂ ", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/25867535-carol", "userReview": "Abandoned with some relief at 66%I was born in Canada & have family who moved to & had some success in Yellowknife. I've consciously (I'm sure I read a few books where I didn't know the author's nationality!)read very few Canadian authors, other than Margaret Atwood and L M Montgomery. I really wanted to like this book!Unfortunately the language is beautiful but empty & the plot (if you could call it that) moves at the speed of concrete. Other than Harry I never cared about any of the characters - and even Harry I don't care enough to flick to the end of the novel to find out what happened. I didn't feel I learned much about Yellowknife's special character.Better books are waiting for me."}, {"userName": "Maciek", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "I'm surprised that this novel won the Giller Prize - one of Canada's most prestigious literary awards. The pacing is glacial, the characters uninteresting, and there's no real plot; the whole book is a collection of situations which happen to the cast, and since we have no real reason to care about any of them there's little to make us want to turn the page. Late Nights on Air is simply not compelling, and I almost didn't finish reading it.I was drawn to the book because of its premise: a novel of people working together at a radio station, in the far north Canadian town of Yellowknife in the Northwest Territories, during the 1970's. There's something about the remoteness of this area that attracts me - perhaps it is its quietness and desolation, which make it one of the last places on the planet where a person can truly be detached from the rest of the increasingly globalized world; where it just takes a few steps to see the sparse but beautiful landscape of the tundra, largely untouched by man. The same place is also unforgiving with its enormous distance to the rest of the populated country, and unrelenting weather with very cold and long winters. For many, radio is the only medium with which they can communicate and stay in touch not only with the world but with their own neighbors, as conditions outside make travel either very risky or downright impossible.Elizabeth Hay does a great job with describing this setting; late in the novel characters embark on a kayaking trip where we feel as if we've gone with them, and witnessed the barren beauty of the tundra firsthand. But the characters themselves are rather flat and I found myself unable to care if they experience any personal growth or not, and their various storylines often did not connect into a coherent whole. One of the novel's themes which should be important but isn't is the construction of a pipeline which would run through a First Nation territory - it felt heavy handed and irrelevant to the rest of the text, and failed to make any impact on me.I expected Late Nights on Air to be a novel about the North and its people, their lives and problems: loneliness, poverty, concern about the environment. All these themes are touched upon but not elaborated, and the fragmented nature of the book doesn't help. I'm sure there are better northern novels, and I'm looking forward to reading them."}, {"userName": "Rebecca McNutt", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Late Nights on Air is so fantastic and nostalgic that it's like opening an old box of Kodachrome slides at an antique shop. This 1970's-set story holds the spirit of Canada perfectly and is certainly worth reading."}, {"userName": "Connie", "userReviewDate": "Jun 12, 2012", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Elizabeth Hay worked as a radio broadcaster in Yellowknife forty years ago, and she revisits that isolated area in Late Nights on Air. Set in 1975, it was a time when radio was being replaced by television. The environment and the northern way of life was also being threatened by a proposal to cross the frozen Canadian tundra with a gas pipeline.The radio station employees are imperfect people who are searching for what they want in life. Some have traveled from more southern areas, hoping to find it in Yellowknife. They have been disappointed in their careers and by love in the past, and are looking for a new start.Written in beautiful literary prose, the story builds slowly for the first half as Hay looks into the souls of the complicated characters at the radio station. My favorite part of the book is the later part, involving four of the characters following the route of John Hornby and two companions, explorers who perished in the Barrens in the sub-Arctic in 1927. The descriptions of Yellowknife and the Barrens are exquisite, with the location also becoming an important character. This is a book for people who are willing to take the time to savor Elizabeth Hay's writing because it is a character-driven story in an unfamiliar world.3 1/2 stars, rounded up to 4."}, {"userName": "Mary S", "userReviewDate": "Feb 05, 2009", "userURL": "http://www.goodreads.com/user/show/2000341-mary-s", "userReview": "I almost didn't finish this book. The first 60 pages were tiresome to drag myself through. Then Ms. Hay caught me with something so \"Northern Canada\" that I was immediately hooked. It was a print out of messages that CBC used to read over the air -- things like \" Joe Blogs, get in touch with the RCMP at Fort Rae for an urgent message from your brother Ron.\" or \"To the Blogs family, Resolute Bay. Jannie had her baby. A boy, 7 lbs 2 ounces. Mom and baby are doing well and say hi.\"I lived for a short time in the Yukon and NWT in the 1970's -- about the same time this novel was supposed to take place, and those messages brought me right back to listening to the radio in the north. Also, many of us had our own crystal or CB radios and used them to communicate with our bases in the cities of the north. I spent several hours each day on the radio.The second thing that Ms. Hay was able to do was paint a wonderfully vivid picture of the tundra -- the Barren Lands. I loved the attention to the botany.Too bad that the rest of the story didn't quite keep up. Why, for example, does Ralph suddenly decide he loves Eleanore? Ralph didn't even seem like a major character, and suddenly he is a huge focus.So, slow to start, great detail and feeling of the north, but characters that are a bit on the \"who cares\" side. But, maybe that's just like life."}, {"userName": "Zinta", "userReviewDate": "Jul 31, 2009", "userURL": "http://www.goodreads.com/user/show/337591-zinta", "userReview": "You’ve heard it said, “hurts so good.” About the writing style of Elizabeth Hay, I can say: cuts so soft. Her words, her turn of phrase, her sweet sentence construction, it is as precise and expertly sculpted as with a sculptor’s chisel or a surgeon’s scalpel. Yet soft. The sharpest knife enters your flesh with hardly more than a red line—and finds its target. The heart. The reader’s mind. There are no ragged edges here. The setting for this novel intrigued me right away. The book was a choice in my book club, recently joined, and I thrilled to the story description of northern wild, a small group of misfits who broadcast from a radio station in a town called Yellowknife, where there is nothing but radio. I was suddenly back in my days of traveling northern Canada and Alaska, and listening to a voice on the radio, passing messages from friend to friend, husband telling wife he would be home late, George telling Harry that the part he needs for his truck has arrived, and hello! Shirley’s baby is born! Late Nights on Air has more sophistication than that, and this group of radio broadcasters and technicians and managers bring with them more than just the drama that flies over the air. There is also the air between them. And their love of the clean air about them. But at the same time, there is that intimacy of community, of strangers connecting by bond of shared humanity. Late Nights on Air is love story of the misfit, love story of the northern wild, love story of life, lived however we manage. And like all love stories, these loves, too, die, except, perhaps, the one for the open wild. A proposed gasline runs through the story like a guideline of place to cut. Hay makes the incision cleanly, and from this opened place emerge the voices of the town, those who have come to it because they found they did not belong anywhere else, and those who belong there root and soul and have so through ancestry. What we see in that opened place is the wilderness inside a man’s, a woman’s heart, and also the stunning wilderness of northern Canada, in this town called Yellowknife and far beyond. It is a cruel yet beautiful world, and we are spared neither cruelty or beauty. Such fine lines Hay writes:“…her voice sounded like a tarnished silver spoon…”“…in the free and easy woods of herself…”“…constant light was like endless caffeine…”“…she seems to want to erase herself…”“At stake was something immense, all the forms of life that lay in the path of a natural gas pipeline corridor that would rip open the Arctic, according to critics, like a razor slashing the face of Mona Lisa.”“The girl had laced up the soft shoe of her voice.”“Dido had a vibrancy about her, like a watered plant after a drought.”“Such a lot to unpack from that slender gift of a sentence.”“…in the wind their voices tore like fabric…”“And the thought came to him that it wasn’t just one person who had died, but all the filaments of life connecting that person to everyone he’d ever known and to every place he’d ever been.”“The sight of her did something to his heart. He felt its exact location and entire size inside his chest.”And there, she’s done it, Hay has done it: thrown away all the excess, trimmed away all the fat, and left the words that describe a moment, a sensation, an image, a life exactly. She has even done the remarkable, passed my personal test of expert word artist, and written both one of the best love scenes I’ve read in many years (and not one thing graphic or crude about it), and later, one of the most profound breaking up scenes I have ever read (and not one thing graphic or crude about it, either). Add for frosting on this Arctic ice cake one of the most memorable death scenes I’ve encountered on written page, without a single note of melodrama about it. These are typically the scenes where even the best writers fall into muck. Where even the best writers die, impaled on a cliché. Hay shines. These human lives tangle and untangle, and they tangle, too, into the wild around them, and there is great sacrifice, yet also great humanity. Not in the deeds marked by medals and honors, but moments marked by one human being alleviating, for but a passing instant quickly moved into memory, the loneliness of another before both go on their way again. These are the imperfect, caught lovingly in their fascinating imperfections, and made perfect by the artist who captures them so on paper for our witness. Late Nights on Air is winner of the 2007 Giller Prize. Elizabeth Hay is a former radio journalist, author of six other books, all of which I intend to read, and winner also of the Marian Engel Award. She lives in Canada."}, {"userName": "Wanda", "userReviewDate": "Oct 02, 2013", "userURL": "http://www.goodreads.com/user/show/9246169-wanda", "userReview": "You can’t get much more Canadian than this novel—it is written by a former CBC employee, it involves the national radio service, there are questions of identity, there is self-discovery through a wilderness trip, and it takes place in the North, mythologized by all of us southern Canadians.Two young women, Gwen and Dido, come to Yellowknife to craft lives and identities for themselves through working on the radio. I related to Gwen’s search for herself through her radio work, having worked a very public volunteer job where it was necessary to create a public persona for myself. How useful that persona was; it created a framework upon which to hang the various facets of my life to display them to those around me, but most importantly to myself.And where else do you search for yourself? The North, of course, a mysterious place to those of us who live pressed up against the 49th parallel, much closer to our American neighbours than to the vast majority of Canadian territory. The people, the wildlife, and the landscape of the Barrens are beautifully invoked, with the canoe trip of discovery forming a rather dreamy portion of the plot line. It made me wish that I was one of the adventurous folks who went on camping trips, canoeing in the wilderness, identifying the delicate wildflowers and observing the skittish caribou. I have friends who do these kinds of things and I long to have the ability and the courage.Running in the background of Late Nights is the whole question of the MacKenzie Valley Pipeline Project and government/business relationships with the aboriginal populations. In that way, it is a timely book for today, as struggles ensue over several pipeline projects and relations with our native populations are in turmoil. On a personal note, two situations in this book got me thinking about a woman that I was friends with long ago. She became involved with a very possessive man and I think she mistook it for “love” as opposed to power. I often wonder about her, as when I last talked with her it was obvious that he was controlling her to an extreme extent and I was very worried. I was cut out of her life rather quickly, as he was busy separating her from her friends and family. Recently we had a significant milestone school reunion and the organizer sent out lots of email to see who all she could round-up to celebrate. My former friend, a gentle, polite woman, replied in a rather hostile manner and asked that she never be contacted again. From this, I assume that she is still with her controlling partner and still acquiescing to his wishes. I continue to wonder how she is, where she is, whether she will ever escape.Perhaps that is why this book left me in a melancholy mood. But for me, that melancholy feeling is a desirable one in literature and I enjoyed wallowing in it for the remainder of the evening."}, {"userName": "Joyce", "userReviewDate": "Feb 16, 2013", "userURL": "http://www.goodreads.com/user/show/7696958-joyce", "userReview": "Aaah, like the tiny beautiful artic flowers, this is a finely woven tale. The characters are all searching for themselves in this most northern landscape where the air, light, sounds and silence are like no other. One could look at this landscape and see little but harshness, nothingness, cold or one could marvel in the beauty of life on small and vast scale, hear the wind speak and connect with the environment and others. The four main characters journey together and separately and each changes, no they find something else. A very good read."}, {"userName": "Hannah Holborn", "userReviewDate": "May 14, 2008", "userURL": "http://www.goodreads.com/user/show/1108499-hannah-holborn", "userReview": "A character in Elizabeth's book describes good script writing as having simplicity, directness, and intimacy. Late Night on Air achieves all three. Whether we love or hate the main characters by the end of the book, we also know them as well as our own skin. And we know something of the north--its timeless fragility, and its ability to both save and destroy those who venture there."}, {"userName": "Christina McLain", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/22005745-christina-mclain", "userReview": "I thought this book was a flawed masterpiece. The story of four quirky characters who meet at a radio station in Yellowknife in the 70's is many things: an ode to the Canadian north,a study of radio and the impact it has on isolated communities and individuals, an essay on the effect of development on the environment and indigenous people and at its heart, the tale of star-crossed lovers, Dido an enigmatic and seductive announcer with a fabulous voice and Harry,the hapless station manager with a soft heart and a world-weary manner. Harry adores Dido but she sets herself on a self- destructive course by falling for the angry abusive sound technician Eddy. All of this is witnessed by fellow employees,Gwen and Eleanor, who care about Harry and are baffled and irritated by the goings-on. The story begins in the summer of 1975 and continues in the following year after Dido's abrupt departure, when several of the characters make a life changing journey into the Barrens following the journey made by an ill-fated British explorer who they admire. I think the reason why I say the book is flawed is because the pace is very slow but as the author explains, it's like the events of life... \"on and on and sudden,\"when we experience a turning point or a moment of clarity. This book was clearly written by an author with a love of nature, Canada, and an interest in the lost and lonely passageways of the human heart."}, {"userName": "Autumn Chrunik", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/19391640-autumn-chrunik", "userReview": "I love that this book is set in Canada and is written by a Canadian author, but I can't get into the story. I didn't understand it and did not feel any connection to the characters. And when I paused to stop reading it for a few days, it made me not want to pick up it up again, or try anything else. This one sadly, just isn't for me."}, {"userName": "Bonnie", "userReviewDate": "Aug 14, 2008", "userURL": "http://www.goodreads.com/user/show/1424859-bonnie", "userReview": "I laughed and I cried and I marvelled and I kept reading in one long sitting. Very deserving of The Giller, in my opinion."}, {"userName": "switterbug (Betsey)", "userReviewDate": "Feb 22, 2011", "userURL": "http://www.goodreads.com/user/show/2843912-switterbug-betsey", "userReview": "\"...this summer of 1975 took on the mythical quality of a cloudless summer before the outbreak of war, or before the onset of the kind of restlessness, social, spiritual, that remakes the world.\"In the Canadian Northwest territories, a place of harsh winters and summers of unrelenting light, the hamlet of Yellowknife remains like an anachronism. Population ten thousand, including native people that have lived on this land for thousands of years; it was their flesh and blood. Now the Mackenzie Pipeline project, a huge construction of an oil and gas pipeline, threatens to \"rip open open the Arctic...like a razor slashing the face of the Mona Lisa.\"A little radio station of the CBC is the center of the novel. Harry Boyd, the 40-something interim manager, whose luckless history of ill-repute but brilliance has brought him back to radio after a wash with TV, is an unlikely romantic. He has fallen in love with the sound of Dido Paris on air, a resonant, smoky-voiced and Netherlands-born young woman of unconventional beauty, a wide-shouldered, slim-hipped enigma of melancholy temperament. She was hired as a parting shot of the former manager.Gwen Symon, a mousy young girl-woman from Ontario, has bravely driven herself in her Boler trailer all the way to Yellowknife to work in radio. She listened to a radio show as a child called \"Death on the Barren Ground,\" about John Hornby, the Englishman who starved to death on an Arctic adventure into the Barrens in 1927. She has since read his biography, three times! Harry is familiar with Hornby's history and his biographer, who lives close by. He is willing to be patient with Gwen's parched and defenseless voice.Eleanor Dew is the point person or office manager at Yellowknife radio, a woman who manages to be pretty even though no part of her is pretty. She is a striving poet and a thoughtful friend to everyone.Eddy Fitzgerlad is the cipher, a radio technician of unknown other talents, a well-cut but terse, insolent man, an unsettling presence in the radio station, with his eye on Dido.Ralph Cody is the radio book reviewer and prodigious photographer of the far North Canadian landscape, with small nicotine-stained hands that are deft with a camera and tripod.This cast of well-drawn, unforgettable characters, as well as some lively secondary characters, is the driving force of the novel. Hay's sumptuous sense of place, redolent of author Jane Urquhart (but more droll), and her precision with character building, fuels the story with an electric and kinetic buzz. Her use of radio as an extended metaphor, her vast store of literary allusions, and her buoyant linguistic play are the ingredients that make for an intelligent and contoured novel. The back story of the proposed pipeline add dimension and depth to the tale.During the summer, four of these characters agree to a six-week Arctic adventure by land and canoe to visit the place of John Hornby's exploration and death. The Barrens were the rugged, treeless, and desolate landscape of the interior Arctic. This would be a mighty challenge for the group, even in summer. The adventure is filled with drama and a supple examination of the human spirit. All four of the radio adventurers will be put to a supreme test of inner and outer strength and tenacity.This is the first book I have read by Elizabeth Hay. I am a delighted admirer of her work now, and I look forward to reading her previous novels. Highly recommended for readers interested in solid and original characters, evocative depiction of landscape, and piercing themes of human survival."}, {"userName": "Jennifer", "userReviewDate": "Aug 17, 2009", "userURL": "http://www.goodreads.com/user/show/2635637-jennifer", "userReview": "elizabeth hay is an amazing writer. seriously beautiful with her prose. this story made me cry. twice. i don't tend to cry when i read books. but this is what happens to me when i read her books - i become so invested in the plot and with the characters that it seems so very real. the triumphs and tragedies sit with me personally and occupy space in my heart. if you are one to time your reads to the seasons, this is a perfect winter book."}, {"userName": "Jennifer Blair", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/3553494-jennifer-blair", "userReview": "This book made me want to pack my bags, catch the first plane to the Yukon, and leave everything behind. Beautifully written, endlessly fascinating, and deeply poignant, Late Nights on Air was just the escape I needed right now."}, {"userName": "Lisa", "userReviewDate": "Nov 19, 2013", "userURL": "http://www.goodreads.com/user/show/3829764-lisa", "userReview": "I just couldn't possibly care any less for a single person in this novel."}, {"userName": "Krista", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "I find myself slightly annoyed after reading Late Nights on Air. I've never been up to the Territories but have long been slightly fascinated by the North: I would love to go on one of those Polar Bear tours up in Churchill, or see the Northern Lights in Whitehorse, or witness the Caribou migration (as described here) outside of Yellowknife. I also know that I am too intimidated by the wilderness, and the wildlife in it, to ever attempt the epic canoe trip described in this book; in fact I'm too lazy to take out a canoe on the glassy lake my parents live on, too nervous to let my dog off leash in the city in case of coyotes. But going into this book, I was really hoping for a Northern experience, and I don't know if I got it.I was trying to find some old quote I thought I knew that says that all Canadian literature is really about geography-- a quote that I have found curious because, as a Canadian who has always lived in cities, the geography of my life isn't terribly different from people who live in cities anywhere in the world. What I found, repeatedly, were references to Margaret Atwood's Survival A Thematic Guide to Canadian Literature, wherein she argues that all Canadian literature is about is the notion of survival and its central character the victim. As this book is set in the timeframe that Atwood wrote her book, I don't think it's a coincidence that all of the characters in Late Nights on Air come off as victims (every female character is obsessed with her relationship with her own father, some are the uncomplaining victims of physical violence from their partners, the Natives are victims of Colonialism, the landscape is the victim of the white settlers, men are the victims of drink or their own passions, etc.) As it is probably also not a coincidence that this is really a book about survival, I take this as an homage to Atwood and her themes, but I have to believe that in the 40+ years since her critical study was published, Canadian literature has moved on from this narrow perspective. Something about this book, therefore, felt diminishing to me.I was also annoyed at the politics of this book-- from the boosterism of the CBC (whose funding today are tax dollars I resent paying) to the notion that all of the Natives who opposed the Mackenzie Pipeline project were doing so out of a selfless regard for the purity of the ancestral grounds it would defile. The last is particularly timely as right now we debate the similar project, the Keystone Pipeline. I have often thought that if the main argument against the pipeline is environmental, then surely pumping fossil fuels south, through two countries that already have strong environmental regulations, must be safer for the Earth than extracting oil in countries without such strict rules and then shipping it across the ocean in tankers. In this book, however, a small scene that describes the skittishness of migrating Caribou goes a long way towards influencing my ideas about the harm of running a pipeline through their calving grounds. Finding the people in this book sketchy and not all likeable, I would have liked more scenes with the animals, more scenes with the wilderness, more of a Northern experience.I was also annoyed, at times, by the writing style. Many passages were fragmentary, which can be poetic or disjointed. Where they were poetic, I revelled in them. Where they were disjointed, I was confused and a little bored. I actually can't believe it took me two weeks to finish this book, but I was rarely looking forward to picking it up.My last complaint: the excessive foreshadowing. I don't know if I have ever read a book that promised so often that something horrible was going to happen. The device did not keep me intrigued, and by the time the tragedy occurred, I was just happy to be getting near the end of the book.I'm not surprised that Late Nights on Air won the Giller Prize; it is unabashedly a Canadian novel, if something of a throwback to early Atwood, but in the end, you know what I wanted? More Canada. At the risk of negating everything I said about not thinking Canadian literature can/should be reduced to its geography, the following geographical passage is where I think Elizabeth Hay gets it right in this book:Somewhere between three and four in the morning, as they were paddling back, they saw a world that Ralph might have photographed had he seen it, and that Gwen would later try to paint. But it wasn't possible to duplicate the colours except by closing her eyes. Then the islands in the distance became the right shade of jet black, and the sky and the water were an identical, intense, unblemished peach.I would love to see that scene, even vicariously, and am left wanting more."}, {"userName": "Shauna", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/4864955-shauna", "userReview": "I don't know how this won the Giller Prize. The selection must have been pretty dismal. Cliche characters (an \"ugly duckling\"-type girl getting a haircut and suddenly being beautiful), and even more cliche themes (an abused woman coming to work with dark sunglasses on, and later falling for the man she initially found repulsive), and the worst sex scene(s) I have ever read (his penis was like an O Henry bar...what?!?). Worse than all of this were the author's high school English class attempts at foreshadowing: endless instances of \"She wouldn't realize until a few months from now what he meant by that...or would she?\". And don't forget all the name-dropping of CBC shows and programs for no reason other than, I'm guessing, to win awards.Now I remember why I rarely read Canadian writing, except for Boyden. And sadly why I rarely read female authors. Way to disappoint, Hay."}, {"userName": "Carole Moran", "userReviewDate": "Jan 07, 2011", "userURL": "http://www.goodreads.com/user/show/4311235-carole-moran", "userReview": "Not only did I positively dislike this book, I was downright angry by the time I tossed it aside, unfinished. It was recommended by my husband, which is why I tried to read it, but certainly not my kind of thing. I don't know if it's good literature or not, but I've read some good literature in my life and this doesn't even compare--in style, in interest, in anything. There appears to be no story, no plot. Just a wandering account of people living in Yellowknife, Northwest Territory, Canada. It begins boring, stays boring (as far as I read), and ends boring. I know this because in desperation, I went to the back to see \"what happened\" of significance when all was over. Absolutely nothing. This is among the worst books I've ever tried to read. I detest people and things that waste my time."}, {"userName": "Kathy", "userReviewDate": "Jun 24, 2008", "userURL": "http://www.goodreads.com/user/show/265256-kathy", "userReview": "I admit that I have an affection for Canadian writers. This is a beautifully written book, the characters are rendered in much detail and the plot is believable. I liked the world she creates in her story and the setting of the radio station is interesting. Once I bought the book and looked at the author's photo I think that I may have met her when I was in Canada attending a music workshop. There were a bunch of writers who were also having a workshop in the same space. Funny coincidence.A really good book. I would compare her to Carol Shields."}, {"userName": "Sarah", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/1309716-sarah", "userReview": "Have I mentioned that I love Elizabeth Hay? Because I do!Normally, I can't stand anecdotes and asides. I prefer to settle into a narrative. But Hay has turned disparate and fragmented stories--some true!--into a symphony of voices, all beautifully, poignantly intertwined.A Student of Weather is still my favorite of hers, but I can see why this one has been so well received."}, {"userName": "Jerrie", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/1239090-jerrie", "userReview": "This book charms and takes you places you had no idea you were going. For one thing, it takes place in a place I've never been in story or reality. I liked the reality of the characters. No sugarcoating. No fear of really revealing. The style is also interesting. Brushstrokes of scenes and move on. Really fresh. It's a great story; one you think about afterwards and the ending is satisfying. What more can anyone ask?????"}, {"userName": "Caroline", "userReviewDate": "Dec 24, 2016", "userURL": "http://www.goodreads.com/user/show/1258852-caroline", "userReview": "I picked this up because it's set in Yellowknife, Canada, where we're going next week. The writing is languid and frequently lovely, but it felt like two books: one workplace drama, one outdoor adventure (with so many foreshadowings of disaster to come that I felt guilty about feeling that the eventual disaster was a bit of a letdown)."}, {"userName": "Shelly", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/7013338-shelly", "userReview": "Like many books set in the north, this is a slow enjoyable book where the landscape is as much s character as any of the people. There are multiple stories being told in this book, some are tragic and some are hopeful. Either way it is a beautiful book."}, {"userName": "Diane", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/7172184-diane", "userReview": "Late Nights On Air takes place in the northern Canadian city of Yellowknife in 1975-76. Television was about to come to the Northwest Territories and a hearing was ongoing to assess the impact of a gas pipeline to be built from the north down \"south of 60\".  Radio, at the time, was one of the only connections to the outside world and a method of communication in much of the remote North.A lot of people escape to the North to run from something in their lives or they come North looking for something, and we open with two women who have done just that, Dido and Gwen. They join broadcaster and temporary manager Harry, receptionist Eleanor and other employees of the small radio station such as Ralph, Eddy and Teresa. The book chronicles their lives, their pasts, their journeys including a physical one, a canoe trip that several of them take later in the book.This novel won the Giller prize. It's not a fast paced book, it's a slow moving, character based story and I really liked it.  Some of the characters you will like and some you won't. You will get a good feel for life in the remote parts of Canada where the radio communicates not just the outside world but passes on personal messages to folks that are listening of things like babies born, family deaths, and transportation delays.  I remember when the radio had \"buy and sell\" segments and would announce anniversaries if you wrote in and told them.The canoe trip that four of the characters underwent north from Yellowknife was particularly wonderful to read. They had more or less replicated a real life journey by a man called John Hornby who did it in the 1920s, whereupon he attempted to spend a winter and he and his companions starved to death. You can read about him here.   I really got a sense of the North, the vast tundra, the wild life, herds of caribou, wolves, bears, the icy lakes even in July, uncertain weather, the utter desolate wildness, peace and beauty of it. That trip changed the characters that went on it, and they felt that difference the rest of their lives.4.5 stars rounded up. This book completes my Cross Canada reading challenge. I'll post something with a round up of all my choices over the next week or so."}, {"userName": "Ron Charles", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "In the good old days, before we had to worry about the Internet killing off everything, we used to worry about the survival of radio. First television drove the industry into the music corner, and then corporate consolidation, rightwing cranks and shock jocks homogenized the dial to death. Let a thousand podcasts bloom, but they can't replace the special intimacy we used to feel late at night in the car or at home -- lonely or missing someone -- listening to the silky voice of a sympathetic deejay holed up in a studio, talking into the dark.Elizabeth Hay misses that voice, too. In fact, in the 1970s and '80s she was that voice. For 10 years she worked as a radio broadcaster for the CBC in the Northwest Territories, an experience that informs her discerning new novel, Late Nights on Air. Set in the bleak town of Yellowknife, about 250 miles from the Arctic Circle, her story meanders through several years in the lives of a collection of misfits at a public radio station. Though weighty themes rumble beneath the tundra of this plot, Late Nights is an understated, easy-to-overlook book. Fortunately, it won Canada's Giller Prize, and that prestigious recognition -- wholly deserved -- may bring it to the attention of readers who will respond to its subtle wit and wistful spirit.Hay's affable hero, Harry Boyd, is a deejay \"with a nearly forgotten reputation for brilliance.\" He peaked early, went on to host a television talk show that bombed, and lost everything: career, wife, dignity. An old friend \"pulled a few strings to get him a night shift in the Northern Service, the very place where he'd started out fifteen years ago. . . . Now he was an old fish in a small pond.\" It's 1975, and the sudden departure of the station's manager (ran off with a waitress) has raised Harry to the position of temporary boss, but late at night when he can play and say whatever he likes on the air, he still wonders how he ended up back here \"in the little rabbit warren of rooms known at CFYK.\"This is essentially a love story, but of muted, smothered love, passion that blossoms not at first sight but at first hear. The novel opens when Harry catches the \"slow, clear, almost unnatural confidence, the low-pitched sexiness, the elusive accent\" of Dido Paris reading the news. She's a gorgeous young woman from the Netherlands -- \"Who didn't fall in love with her that summer?\" Hay asks. Besides her striking appearance, \"she was zealous in her compliments and capable of the most reckless intimacy.\" Dido learned English by listening to recordings of Noël Coward, which only partially explains her intriguing accent. ( Late Nights lavishes attention on the tone, cadence and tenor of characters' voices; we can hear these people even better than we can see them.) Now, running from a bad marriage and an untenable relationship with her father-in-law, Dido begins a flirtatious relationship with Harry that he knows can't lead to anything more, even as he hopes it will.Along with this smoldering love affair, Hay outfits the little Yellowknife station with a quirky cast of employees whom we gradually get to know and care deeply about. The receptionist, Eleanor Dew, is the gracious gatekeeper of the office, an ageless woman whose Christian faith is sorely tested by loneliness. Gwen Symon -- \"an odd mixture of crippling modesty and immodest determination\" -- drives more than 3,000 miles to present herself at the station and ask for work, having been told that \"anyone as inexperienced in radio as she was should try the hinterlands first.\" Eddy Fitzgerald is a brooding, redheaded technician with an aura of revolutionary violence.We meet a few regulars around town, too, especially Mrs. Dargabble, who makes a \"lofty, loquacious, regular plea for classical music,\" and 60-year-old Ralph Cody, the station's book reviewer, whose \"appetite for talk was barely whetted by the ten minutes allowed him on the air.\"The plot of this novel is a faint signal, a series of short moments, sometimes funny, sometimes poignant, often flecked with intimations of tragedy. Hay's writing is so alluring and her lost souls so endearing that you'll lean in to catch the story's delicate developments as these characters shuffle along through quiet desperation and yearning. You'll also begin to hear how Hay is deepening the range of this book. Behind the office conflicts and fumbling couplings of the gang at CFYK, a major national debate plays out: A well-respected judge is roving around the country patiently conducting public hearings about a proposed natural gas pipeline that threatens to disrupt the lives of the native people and scar the Arctic \"like a razor slashing the face of the Mona Lisa.\"This interesting environmental backstory reflects the anxiety Harry and his colleagues feel about their own future -- torn between dread and impatience. They're all drawn to the haunting true tale of John Hornby, an English explorer who lost his life in 1927 trying to live off the land deep in the North. The final third of the novel describes Harry, Gwen, Eleanor and Ralph on a fateful six-week canoe trip that follows the path of Hornby's last journey. The trip, over several hundred miles through lakes and forest, provides an even more striking showcase for Hay's talent, her psychological acuity and her command of striking natural settings.There's real sadness here, but real tenderness, too. Hay listens to these people -- their surprising comedy and their fragile needs -- with enough sensitivity to catch, as she puts it, \"a single word balanced atop a mountain of feeling.\"http://www.washingtonpost.com/wp-dyn/..."}, {"userName": "Sarah stanley ", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/43826065-sarah-stanley", "userReview": "Along with many other reviews, I'm surprised this book was up for the Giller prize. The novel was so slow paced and monotonous, I really struggled to get through it. It wasn't until the end when they embarked on the journey that I was actually interested in reading. Throughout the whole book, not much actually went on. The book tried to bring up politics of the north and mention the pipeline, but I feel like It failed to bring any relevance or add anything to the story itself. Okay book if you like slow reads!"}, {"userName": "Jozel", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/71410604-jozel", "userReview": "I loved this book. the complex flawed characters, the intricate and subtle relationships, but mostly the immersion in the North and the raw imagery depicted vividly and beautifully. It makes Yellowknife a top destination for me and even the idea of going out to the edge of civilization appealing in a way I never thought it would be. I strongly recommend it."}, {"userName": "Ashley", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/6979145-ashley", "userReview": "Foreshadow much? Need to mull this one over a bit more. Very poetic and romantic."}], "description": "The eagerly anticipated novel from the bestselling author of A Student of Weather and Garbo Laughs. Harry Boyd, a hard-bitten refugee from failure in Toronto television, has returned to a small radio station in the Canadian North. There, in Yellowknife, in the summer of 1975, he falls in love with a voice on air, though the real woman, Dido Paris, is both a surprise and even more than he imagined. Dido and Harry are part of the cast of eccentric, utterly loveable characters, all transplants from elsewhere, who form an unlikely group at the station. Their loves and longings, their rivalries and entanglements, the stories of their pasts and what brought each of them to the North, form the centre. One summer, on a canoe trip four of them make into the Arctic wilderness (following in the steps of the legendary Englishman John Hornby, who, along with his small party, starved to death in the barrens in 1927), they find the balance of love shifting, much as the balance of power in the North is being changed by the proposed Mackenzie Valley gas pipeline, which threatens to displace Native people from their land.Elizabeth Hay has been compared to Annie Proulx, Alice Hoffman, and Isabel Allende, yet she is uniquely herself. With unforgettable characters, vividly evoked settings, in this new novel, Hay brings to bear her skewering intelligence into the frailties of the human heart and her ability to tell a spellbinding story. Written in gorgeous prose, laced with dark humour, Late Nights on Air is Hay’s most seductive and accomplished novel yet.", "title": "Late Nights on Air", "url": "http://www.goodreads.com/book/show/1677996.Late_Nights_on_Air", "average": 3.52, "cover": "https://images.gr-assets.com/books/1320425254l/1677996.jpg", "reviews": 631, "authors": [{"url": "https://www.goodreads.com/author/show/270543.Elizabeth_Hay", "name": "Elizabeth Hay"}], "type": ["Fiction", "Cultural", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/1677996.Late_Nights_on_Air", "http://www.goodreads.com/book/show/3739988-late-nights-on-air", "http://www.goodreads.com/book/show/3301884-late-nights-on-air", "http://www.goodreads.com/book/show/2194354.Late_Nights_on_Air", "http://www.goodreads.com/book/show/9970166-alone-in-the-classroom", "http://www.goodreads.com/book/show/507086.A_Student_of_Weather", "http://www.goodreads.com/book/show/22747914-his-whole-life", "http://www.goodreads.com/book/show/1677983.Garbo_Laughs", "http://www.goodreads.com/book/show/698445.Small_Change", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}