{"ratings": 920, "userreviews": [{"userName": "Jonfaith", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "If the history of British rule in India were to be condensed into a single fact, it is this: there was no increase in India's per capita income from 1757 to 1947.This is a harrowing tome, one dense with statistics and cutting with testimonial. The first section details the effects of drought and famine on India, China and Brazil in the late 19C. Their are accounts from notables of the time. The second section examines the science of El Nino. The final section surveys the global economies of the period, citing all the requisite authorities, the conclusion is despairing. Economic and technological advances clearly set the table for despair and calamity. Racism and corruption maximized the effect."}, {"userName": "sologdin", "userReviewDate": "Jun 11, 2011", "userURL": "http://www.goodreads.com/user/show/5610133-sologdin", "userReview": "Though I agree with other reviewers that Davis is at his best when discussing India, the sections on Brazil, China, and numerous other places (to which he pays insufficient attention, truly) are generally informative. Perhaps it's fair to say that he establishes his argument on the basis of the British genocides in India, and then produces schematic outlines of varying depths for the imperial genocides in China, Brazil, Egypt, the Sudan, Ethiopia, the Philippines, and so on. That slight flaw noted, this text has very high quality--fine documentation and a well reasoned, committed perspective. Overall, this text is probably the first step in rationally countering the trash that is *The Black Book of Communism*--call this chapter one of *The Black Book of Capitalism* (perhaps Blum's *Killing Hope* can be chapter 2--and, yes, there is in fact a *Black Book of Capitalism* in German, which is actually about capitalism; I am unaware of any translation yet to English--no surprise there!)Some reviewers have pooh-poohed the text on the basis that it sets up typical marxist hierarchies of villainy in its attempt to define famines as political events. This complaint is of course a straw man: though proper marxists will point out that there is a politics to everything--including the weather--it is unlikely that marxism traditionally attempts to blame someone for everything.Some have also carped against the text for suggesting simply that some deadly virus of capitalism infected China, resulting in the famines there. In fact, Davis' reading of the Manchu Qing dynasty and its policies is much more nuanced than that, and considers a host of issues--including ENSO, the Taiping and other rebellions, surely the Opium Wars, the catastrophic shift of the Yellow River in 1855, and numerous others--including indigenous Chinese corruption, and, yes, some of the more familiar brutalities of the capitalist system. Critics tend likewise to have a dismissive attitude toward Davis' thesis regarding the integration of India, China, and Brazil into the world capitalist system--not a useful intellectual response to a serious historical debate. I for one would appreciate an actual refutation, by means of proofs that the genocides indeed were not caused, exacerbated, or otherwise enabled by British capitalism & imperialism. Instead, for the moment, all the rightwing offers is \"two cheers for colonialism,\" like a pack of dirtbag fascists.Critics have otherwise attempted to critique Davis on the basis of a perceived turn in his analysis of the big 20th century famines, under Stalin and Mao, which are said to be unrelated to ENSO, both in fact and in Davis. Such statements are fairly dishonest and perplexing. Davis does in fact make a case for such developments continuing into the 20th century--and he does in fact furthermore consider, briefly albeit, both the Ukranian and Chinese famines mentioned above. Though his treatment overall of Russia is one of the most schematic in the text, he does note that the Volga basin seems to feature a correlation of ENSO to drought/famine, and moreover records the 1930 El Nino as correlated to the 1931 drought crisis (269). This undoubtedly does not explain the fullness of the Ukranian famine, but it certainly will contribute to an explanation that otherwise focuses on Stalinist criminality and commie bungling. The same goes for the Maoist case, where Davis correlates the famines associated with the Great Leap Forward very specifically to ENSO, an argument certainly to be ignored by unreconstructed Cold Warriors and crypto-mccarthyites (248-251). One of the most assinine criticism of the text from the rightwing regards Davis' thesis that the maoist famine was attributable to the inability of the countryside to communicate effectively with the bureaucracy, the purported lack of socialist democracy, which is summarily dismissed as a fantasy. It is incredibly obtusely dishonest to make this kind of criticism. Davis does attempt to explain the Chinese famine as a result of a complex of factors, including human decisions, meteorology, and the weight of the aggregate of history (the suggestion that Chiang, a victorious Japanese invasion, or an outright US occupation of China would've performed better is quite simply laughable, given the circumstances). Also, critics respond to Davis by heaping adoration on Robert Conquest and western Cold War Sovietologists; these folks would have us believe that, say, Stalin killed 50 million people in the USSR, but still managed to defeat the Nazis, losing 20 million more in the process-such claims make little sense--indeed, the only people who accept Conquest's exaggerations are pathological anti-communists who don't need any evidence at all for anything. The anti-communist will further criticize Davis by suggesting that the lack of \"socialist democracy\" in China is axiomatic, sniping that socialist democracy has never existed. This more or less vapid point is both puerile and a red herring, evading Davis' thesis--which was that the lack of two way communication between Beijing and the Chinese peasant allowed for the true extent of the famine to remain releatively unknown to the state planners. (The rightwing response is of course that the maoists wanted the peasants to die off--which is about as plausible as Bush wanting to blow up Manhattan--but, what the hell, they're evil commies!)It is likewise disingenuous, as any attempts to pair a socialist economy with a political democracy have been destroyed by the Western powers--consider the destruction of Allende's regime in Chile (1973), to take the most famous example, the sabotage of the Vietnamese general elections in 1955, the low intensity warfare carried out against any number of regimes in Latin America or Africa (Nicaragua? Angola?), resulting in their degeneration and destruction, and the crushing of dozens of movements that struggled against autocratic capitalist regimes all over the world (El Salvador? South Africa? Philippines? Indonesia? everywhere in the Middle East?)--all crimes committed by the US precisely to destroy any potential \"socialist democracy\" from coming into existence and thereby providing a model of development that counters western militarism and economic hegemony, i.e., the friendly fascism of the US and its allies.Very highly recommended. Would be perfect if the rigor of the Indian sections were carried through to the rest (including the 20th century items aforesaid)."}, {"userName": "Sara", "userReviewDate": "Aug 04, 2014", "userURL": "http://www.goodreads.com/user/show/27204594-sara", "userReview": "Empire laid bare  [Through my ratings, reviews and edits I'm providing intellectual property and labor to Amazon.com Inc., listed on Nasdaq, which fully owns Goodreads.com and in 2013 posted revenues for $74 billion and $274 million profits. Intellectual property and labor require compensation. Amazon.com Inc. is also requested to provide assurance that its employees and contractors' work conditions meet the highest health and safety standards at all the company's sites].Mike Davis attacks the reader with a firestorm of brutal epiphanies, and even if you're not so smart, or have a degree in economics, you get to grasp the idea. But after discharging his bombs, as in an air strike, the Red Baron veers off, leaving you on the ground, lost amidst smoke and debris. There's no conclusion to the sequence of blows, no further readings, no wrapping up.The book trains the reader in the unpleasant discipline of Empire Pattern Recognition (EPR), and implicitly, after 400 pages spent analysing the most extreme examples of nation states exploiting other nations and their peoples, the reader is expected to continue by themselves, moving from India, China, Egypt, Ethiopia, Brazil between the 1870s and 1900s, to any place in the present day. Do not think - not even for a second - that the holocausts are over. Millions died of hunger because of market ideology in bad faith under Queen Victoria, millions continue to die from market ideology in bad faith today. What resistence is possible? The book's main lesson is that empire first and foremost reengineers societies to make them more vulnerable to volatility (of climate, purchasing power, health conditions). Any attempt at dismantling those institutions that for a given society represent solidarity, i.e. security of livelihood for all, has to be counteracted.The perfect companion to Polanyi's The Great Transformation: The Political and Economic Origins of Our Time."}, {"userName": "Jonathan", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/40032167-jonathan", "userReview": "Without question one of the best history books I have ever read and one against which I will measure all others. Incredibly thorough and well researched, I was repeatedly staggered by the level of detail and range of sources that Davis draws upon. The simple assertion that the British Empire created untold misery and death no longer seems as trite as it once may have due to the numerous ways in which current historiography and its neocon proponents attempt to rehabilitate and apologise for it. An element of apology for empire has always existed of course, but at times this discourse feels supercharged in the 21st Century, presumably as a way to soften the public for the imperialism of the future. The idea that we must entertain, even for a moment, that the Empire did as much good as bad is intellectually and morally insulting. I really do not think that, in even a generous assessment of the evidence, there is much of a debate to be had on this topic.What this book does, searingly, is unpack the idea that the Empire caused famine. It does this in a structurally coherent and straight forward way. I would say that the book is a little dense in places, I will touch on some of the difficulties I had with it personally later, but it is never less than readable. It does take some commitment, I think, but it is worthwhile.Firstly, Davis describes in detail the famines that swept India, Brazil, and China in the 18th, 19th and very early 20th centuries. This section alone warrants attention. The mismanagement of the Raj is laid bare for all to see. The anecdotes and imagery that Davis chooses are harrowing. I wondered if some of the photography was a little gratuitous, but certainly this part of the book is exceedingly effective at detailing the harsh realities of famine stricken communities. The sheer death tolls touched upon would be unimaginable without the vividness of these descriptions and accounts. It grounds the entire work.Given the severity of the famines and droughts discussed, Davis spends time explaining the ecological and climactic factors that led to them and how they relate to the El Niño or warm phase of the ENSO, the climate phenomenon that causes irregular temperate changes in the Eastern Pacific. He details competing meteorological explanations for the ENSO, and how these were at times transparently ideological. Victorians were quick to blame the climate alone. This, inevitably, is the part of the book I found most difficult. It’s outside of what I would usually read and, at times, I found it tough to follow. It is important to the argument of the book, and it is engagingly written, but as opposed to, say, sections regarding the East India Company or the Opium Wars, I lacked an established frame of reference for it. It goes to show, I suppose, how little I know about how our planet actually functions.Do not be put off by this - if I understood the basic principles then I am sure anyone could. I also don’t feel, and this may be my bias towards history showing, it requires that close a reading. Certainly, there is enough here to explain the severity of this particular El Niño pattern.The third, and most crucial part of the book, is essentially a long conclusion showing the interplay between state structures, whatever they may have been, and the famines. Using case studies of previous famines, Davis is able to show how communities in India and China, especially, were able to cope with El Niño prior to the Victorian age. He then expands on the direct and indirect ways imperialism ruined the societal and ecological coping mechanisms, leading to such appalling death tolls.This is what I mean when I say the book constitutes a detailed unpacked of the central idea: the specific privatisation of village life, the removal of existent patriarchal systems of relief and care and the devastation that the wrong-headed application of British common law and liberal economics wrought.The sections about Brazil and China are not quite as detailed, possibly due to the respective availability of sources, but I differ with other reviewers who feel they’re secondary. I think that they are essential in supporting Davis’ argument. For one, it helps show the global extent of both imperialism and the ecological disasters that imperialism exacerbates. It also shows how different interactions with European powers and specifically the British Empire led to the same results.Although corruption and incompetence in China is highlighted, it cannot be overstated that the centuries long external pressure on China from imperialism in the period did to an extent preclude the Qing Dynasty from providing relief to the peasantry starving in vast numbers. This is set against the story of earlier Emperors who took a direct interest in grain supplies. The book continually attacks the Orientalist stereotype of passive, lazy or neglectful regimes. Indeed, some of the most interesting sections are the direct comparison between standards of living for the working classes of China or India and those of Britain. The difference was not so very vast. The book could hardly be accused of excusing the Qings entirely but it importantly shows another way imperialism alters established societal relations for the worse.Brazil too, is shown to be basically a protectorate indentured to British financial interests and how this intersected with the eugenics based racism of the ruling class. At the cost, once again of thousands of lives.I cannot, in a review of this length, do the book justice, I can only really recommend it. There is so much in here to take away and consider. Fragments of detail or certain statistics will stick out to you and remain with you long after reading, the certainly do for me. Outstanding and totally essential."}, {"userName": "Andrew", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/442654-andrew", "userReview": "Previous Mike Davis books showed a brilliant polemical imagination, but this is a book that manages to combine that polemical fire with a rigorous academic discourse, reinforced with reams of quantitative, demographic, and meteorological data. Certainly, Davis presents a compelling argument for how colonialism and liberal capitalism starved certain regions in particular, stoked social unrest, exacerbated social disparities, and destroyed native techniques for dealing with climactic extremes. I would like if he had drawn out how his \"late Victorian holocausts\" continue to impact the third world, but it's a good starting point."}, {"userName": "Javier", "userReviewDate": "Dec 07, 2007", "userURL": "http://www.goodreads.com/user/show/82945-javier", "userReview": "One of the most depressing books I've ever read--highly recommended."}, {"userName": "Maia", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/3467330-maia", "userReview": "explains how the Victorian Empire created the Third World, using mass starvation as a tool"}, {"userName": "Jacob Russell", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/1480128-jacob-russell", "userReview": "Here is the historical background of the \"global economy\" and the distribution of wealth and power. A snapshot of who is going to suffer as global warming and rising seas bring us ever greater not-so-natural disasters. A book I wish I could persuade everyone to read."}, {"userName": "Jim Collins", "userReviewDate": "Aug 05, 2009", "userURL": "http://www.goodreads.com/user/show/2589064-jim-collins", "userReview": "The author divides his book into three sections. The first section comes off as an overheated tabloid expose a la \"The Untold Story of El Nino's Global Impacts.\" That writing style backfires in the context of a scholarly monograph, which this book purports to be, because an expository essay's thesis is supposed to be developed by the evidence, not the temperature of the analysis. Scholarly research should be balanced, contemplative, and it should seek complexity. And while Dr. Davis tones down his hyperbole in the other two sections by discarding the eardrum-shattering verbiage of the earlier section and adopting a more discursive tone, his analysis is anything but balanced, contemplative, and complex. It's too bad because that mediocre analysis compromised his strong integration of some complex material and and the development of a research purpose that was driven by an ingenious hypothesis. Yes, I know, the book won a lot of awards. I am not convinced. Sorry."}, {"userName": "Cheryl Klein", "userReviewDate": "Oct 06, 2008", "userURL": "http://www.goodreads.com/user/show/1416689-cheryl-klein", "userReview": "Davis is a classic muckraker who does an admirable job of combining social and ecological history while debunking many Western myths about how poor countries got so poor. He’s also an academic who includes more obtuse shout-outs to other historians and economists than I care to read. I have to admit that I skipped 13 pages of the middle section on El Niño patterns and at times wished I was reading a New Yorker-article version of this book. Still, Late Victorian Holocausts is a great counterpoint to pretty much everything you thought you knew about world history."}, {"userName": "Ross", "userReviewDate": "Oct 15, 2010", "userURL": "http://www.goodreads.com/user/show/802791-ross", "userReview": "In case you've been wondering why the Indians wanted to boot out the British...A fascinating read, would have finished it but I was only a houseguest for the weekend, plus Davis's writing is a bit dense and academic."}, {"userName": "Elen", "userReviewDate": "Aug 29, 2015", "userURL": "http://www.goodreads.com/user/show/7383572-elen", "userReview": "Excellent; horrifying. Absolutely lays bare the absurd myth of \"colonial beneficence\" that somehow still gets toted around. One of the best historical books I've read recently."}, {"userName": "Carol", "userReviewDate": "Apr 10, 2009", "userURL": "http://www.goodreads.com/user/show/782399-carol", "userReview": "If you, like most people, have never heard of the enormous famines that struck India and China in the late 1800's you owe it to yourself to read this. It's not pretty, but essential history reading."}, {"userName": "Richard Reese", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/13510236-richard-reese", "userReview": "In the years 1876-1879 and 1896-1902 between 12.2 and 29.3 million died of famine in India. In the years 1876-1879 and 1896-1900 between 19.5 and 30 million died of famine in China. In the same period, an estimated 2 million died in Brazil. Famine hit these three nations the hardest, but many other nations were also affected. In the US, churches organized to send relief to hungry farmers in the Dakotas and western Kansas.Mike Davis wrote about these famines in his book Late Victorian Holocausts. The famines occurred in regions slammed by severe drought. The droughts have been linked to the El Niño Southern Oscillation (ENSO), a major factor in global weather patterns. Droughts have been common throughout history, and agricultural societies have commonly prepared for them by creating emergency reserves of stored grain. Because of political shifts in many regions, these safety nets were in poor condition during the late Victorian droughts. In the wake of the Industrial Revolution came a new mode of economic thinking that frowned on setting aside significant wealth for insurance against disaster. It was more profitable to sell the grain today, pocket the cash, and worry about tomorrow’s problems tomorrow. Peasants were expendable.The Qing dynasty in China believed that subsistence was a human right, and it had relief management systems in place to reduce the toll of famines during drought years or floods. By the late Victorian era, conflicts with colonial powers had drained the wealth of the Qing government, so it was incapable of effectively responding to the catastrophic droughts.Prior to the British colonization of India, the Moguls had a similar system for responding to famine. The British, on the other hand, were cruel masters (as they had been during the 1845 famine in Ireland). Food was widely available, but few could afford the inflated prices. While millions were starving, they exported Indian wheat. They outlawed donations of private relief. They forbid the Pariahs from foraging for forest foods, leading to 155,000 deaths. They created relief camps where the starving received inadequate rations, and 94 percent died. Very civilized chaps, eh?The hungry hordes in Brazil were the victims of their own corrupt government, which had disposed of grain reserves. Brazil was not a colony of Britain, but English investors and creditors played a powerful role in the economy, turning Brazil into an “informal colony” that was kept permanently in debt.Davis argued that the millions of deaths were largely a deliberate “holocaust” rather than a spell of bad luck, because political actions were a primary factor behind the high mortality rates. He also argued that this holocaust played a role in the creation of the Third World. In the eighteenth century, Europe did not have the highest standard of living. The biggest manufacturing districts were in India and China. Their workers ate better, had lower unemployment, and often earned more than workers in Europe. Literacy rates were higher, including women. One of Davis’s primary objectives was to spank capitalism, colonialism, and the hideous overseers of the British Empire. There has been lively discussion in the reader feedback at Amazon, and a number of critics have questioned the way in which Davis assigned blame for the massive famines. For me, the book had important messages: (1) Droughts happen. (2) Agricultural societies are highly vulnerable to droughts. (3) Famines commonly follow droughts. (4) Famines can be horrific. When rains ended an Indian drought in 1878, the mosquito population exploded, and hundreds of thousands of malnourished survivors died of malaria. Meanwhile, locusts gobbled up the growing young plants. Hungry peasants murdered many creditors who threatened foreclosure. Then came gangs of armed tax collectors. Hungry wild animals became very aggressive, dragging away the weak, screaming. In the Madras Deccan, “the only well-fed part of the local population were the pariah dogs, ‘fat as sheep,’ that feasted on the bodies of dead children.”In China, the flesh of the starved was sold at markets for four cents a pound. People sold their children to buy food. Husbands ate their wives. Parents ate their children. Children ate their parents. Thousands of thieves were executed. At refugee camps, many perished from disease. If too many refugees accumulated, they were simply massacred. In some regions, relief took more than a year to arrive.Davis’s vivid and extensive descriptions of famine times remind an increasingly obese society that we are living in a temporary and abnormal bubble of cheap and abundant calories. Importantly, he puts a human face on the consequences of climate change, a subject usually presented in purely abstract form: parts per million, degrees Celsius, and colorful computer-generated charts, graphs, and maps.Near the end of the book, Davis gives us a big, fat, juicy discussion on the history of agriculture and ecological catastrophe in China. People who remain in denial about the inherent destructiveness of agriculture typically point to China as a glowing example of 4,000 years of happy sustainable low-impact organic farming. Wrong, wrong, wrong! This chapter provides a powerful cure for those who suffer from such embarrassing naughty fantasies.The late Victorian droughts happened at a time when the world population was less than 1.4 billion. Today, it’s over 7 billion, and growing by 70 million per year. Cropland area per capita is shrinking, and soil health is diminishing. Energy prices are rising, and water usage for irrigation is foolishly unsustainable. We’re getting close to Peak Food. World grain production per capita peaked in 1984, at 342 kilograms per person. World grain stocks (stored grain) peaked in 1986, and have been declining since then.On 24 July 2012, the venerable Lester Brown of the Earth Policy Institute published a warning in The Guardian. “The world is in serious trouble on the food front.” World grain stocks are currently “dangerously low.” “Time is running out. The world may be much closer to an unmanageable food shortage — replete with soaring food prices, spreading food unrest, and ultimately political instability — than most people realize.” For me, the main message of this book was a powerful warning about the huge risks of agriculture, and its insanely destructive companion, overpopulation. The famines discussed in this book were not a freak event in history. Famine has been a common, normal, periodic occurrence in virtually all agricultural societies, from the Cradle of Civilization to today. As the collapse of industrial civilization proceeds and life slows down, opportunities to live more in balance with nature will emerge. Clever societies will carefully limit population size, and phase out their dependence on farming. Un-clever societies will continue to breed like there’s no tomorrow, beat their ecosystems to death, and hippity-hop down the Dinosaur Trail."}, {"userName": "Alison Swearingen", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/20693853-alison-swearingen", "userReview": "Read this book for a class on the history of climate change, and to be fair there were 2 chapters I didn't read because they weren't assigned. Overall I think Davis did a good job of arguing for consideration of both climate and politics in famine in what we consider the Third World today. There were both interesting parts and slow parts, and I think a lot of the most interesting stuff was when he wrote about colonialism in India. Lots to think about in this book."}, {"userName": "Hafsa", "userReviewDate": "Dec 24, 2010", "userURL": "http://www.goodreads.com/user/show/82878-hafsa", "userReview": "In Late Victorian Holocausts: El Nino Famines and the Making of the Third World, Mike Davis casts a wide net by doing a cross-global history of the devastating famines and natural disasters that effected significant portions of the world in the late 19th century. In doing so, he places the blame on the European powers in using these famines to strengthen their colonial rule, eventually leading to underdevelopment which caused the creation of the Third World. I was impressed with the amount of work it must have taken to collect the data and information (including qualitative and quantitative) from each of the regions he described (South Asia, Middle East, Africa, Latin America) and the responses of the colonial powers (the British, Dutch, French, etc.). This is an expansive research project, and I applaud him for being able to tie it all together in a compelling narrative. It is also extremely relevant in our day--and scary how certain themes repeat themselves throughout history."}, {"userName": "Peter van de Pas", "userReviewDate": "Dec 01, 2014", "userURL": "http://www.goodreads.com/user/show/12698135-peter-van-de-pas", "userReview": "Two stars and those only because the subject matter is important. Amazingly, many people seem to be unaware of the dark sides of imperialist capitalism in the 19th century and view this book as an eye opener. In the circle I grew up in this was more or less taken for granted so this book for me is stating the obvious, in a very detailed and I must say annoying way.What bothers me most is the writing style. Mud slinging and overblown language or not for me in the context of a non-fiction book on serious subject matter. The tendency to point at the ideological adversary for everything that is wrong in the world is all too clear here. As Amartya Sen nicely points out in his review of this book, the great famines of the 20th century took place in communist countries and this fact should give every Marxist writer some pause when pointing at Capitalism as the source of all evil."}, {"userName": "Jawrsh", "userReviewDate": "Jun 02, 2007", "userURL": "http://www.goodreads.com/user/show/111282-jawrsh", "userReview": "\"City of Quartz\" was wonderful, dense and disturbing; \"Late Victorian Holocausts\" is profoundly fucked up. Davis essentially maps out the casualties caused by various colonial states during the latter half of the nineteenth century, specifically comparing living conditions in various areas before and after the establishment of colonial rule. Most of the man's books are polemical, and this is no exception, but as usual there are reasons to be pissed, and Davis's impeccable writing, research and usual acerbic style bring the crises of history home all too clearly."}, {"userName": "Adrian", "userReviewDate": "Mar 25, 2007", "userURL": "http://www.goodreads.com/user/show/25708-adrian", "userReview": "A massively informed but quite boring book about an aspect of colonial history that has received little attention. The author documents how changing weather patterns combined with human incompetence, racism and indifference lead to the deaths of millions of people. The book drags quite a lot in those sections where the author goes into the technical details of how El Nino works and how it created famine conditions. The story of the famines and the suffering they engendered are horrifying and heartbreaking and the book is a grim account of the destruction wrought by imperial folly and triumph of profits over people."}, {"userName": "Naeem", "userReviewDate": "Jul 24, 2007", "userURL": "http://www.goodreads.com/user/show/217489-naeem", "userReview": "Mind blowing.For example: his use of the methods of science. Drought turns into famine under British rule; drought does not turn into famine during home rule in India and China. Question: why? Answer? well read it and find out. For example: makes you wonder if the Nazis had anything on the Brits. Why then do I celebrate London?For example: why didn't I know about the policy driven famines in India and China? Yes of course, we have been fed lies; lie upon lie upon lie. But we have been fed systematically. There is balance in the world, is there not? While others are starved of food, and culture, and, dignity we are fed lies and lies and lies."}, {"userName": "Lola", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5898839-lola", "userReview": "You cannot disagree with his arguments.Makes you wanna go on hungerstrike. \"The conquest of the earth ... is not a pretty thing ... \" truth to that."}, {"userName": "Jake Leech", "userReviewDate": "Jun 21, 2017", "userURL": "http://www.goodreads.com/user/show/7672076-jake-leech", "userReview": "This is one of those books that everyone should read. Actually, find a summary somewhere and read that instead. The gist here is that a series of major droughts in the late 19th century were caused by a combination of strong El Nino events coupled with awful consequences of colonialism, laissez-faire capitalism, and social Darwinism. However, after 400 pages, I came away feeling pretty convinced, but also pretty confused, because Davis does a great job of telling the terrible stories of India, Africa, China, and Brazil, but never seemed--to me--to tie them together into one big narrative.He does write a really great description of how El Nino and ENSO work in Chapter 7, but then discusses how there are several other systems which cause long-term and local modulations, so that despite knowing about ENSO, no actual pattern in the floods and droughts discussed ever actually emerges. I felt like the economics side was even worse--prices of this are collapsing, or skyrocketing, or people are suddenly destitute for whatever reason, but it always seemed like there was no underlying scheme or pattern besides Imperialism And Capitalism Did It.So in the end, I'm glad I read it, but I kinda wish Davis could have held my hand a little more."}, {"userName": "Scotty", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/1842277-scotty", "userReview": "the title's a bit too clever for its own good. the term 'holocaust' no longer conjures up the biblical meaning it might have once held in the past, but of the horrors of hitler. well, this book is about other horrors on par with hitler's cruelty that have been sometimes forgotten, forgiven, or (unfortunately) rewarded. perhaps the most disgusting case in here being the story of sir richard temple. a monster whose \"famine relief\" involved more forced labor and less food than buchenwald. that's right, the british empire was, quite literally, worse than nazis.but that's just ONE of the many injustices being laid out in this book. jfc (forgive me john cena), this book is insane. it drones at times, and part iii's inclusion is a real headscratcher (it's largely infoglut that would have best been omitted), but other than that, a brilliant book. and depressing."}, {"userName": "María Dabrowski", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/27693300-mar-a-dabrowski", "userReview": "Did not read two chapters. Lots of repetition, if only to demonstrate how the horrible history of colonialism and environmental destruction persisted throughout history without being recognized and stopped. Interesting hypothesis on the impact of El Niño on historical outcomes."}, {"userName": "Dylan", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/16822626-dylan", "userReview": "Kinda runs out of stream towards the end but I’d highly recommend reading at least the first half of this important book. It’s really shameful that I, like most Americans, knew absolutely nothing about these events prior to reading."}, {"userName": "Hannah Brislin", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/33593511-hannah-brislin", "userReview": "Well-detailed and well-researched book of a period of time that has to seem to have been forgotten even though it is of great importance and significance to acknowledge these crimes against humanity."}, {"userName": "Larry Ggggggggggggggggggggggggg", "userReviewDate": "Aug 07, 2017", "userURL": "http://www.goodreads.com/user/show/12214904-larry-ggggggggggggggggggggggggg", "userReview": "cool how the west took advantage of brown people starving to death to create a global market which continues to exploit the same people, everything is terrible"}, {"userName": "David", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/5900660-david", "userReview": "Where did the massive and seemingly perpetual poverty of \"Third World,\" or global south, come from? This is the core question of Davis's ambitious and disturbing book. His answer is both as old and as new as his question is perennial. For Davis the Third World came into existence quite specifically between the years 1877 and 1902, the high points of the two greatest famine-droughts of the 19th century, and possibly of the previous 500 years. But nature was not unassisted in these developments. Their baleful impact was immeasurably amplified through their coincidence with the integration of the largest and most affected societies in question - China and India - into the newly-global capitalist economy, and their submission to colonial and semi-colonial regimes. On one hand, this is an old argument, first formulated by Indian nationalists intent, as Davis puts it, on turning the statistics of the British against them. They first made the case for colonial underdevelopment in the late 19th century - in the aftermath, it is no coincidence, of the epochal famines that Davis revisits. It was the very implementation of British rule and its program of classic Smithean-Benthamite economic reform, they argued, that served to transform what had been one of the richest civilizations on Earth in the 17th century into one of the poorest by the 1920s. Britain, in a crude simplification of the argument, skimmed the surplus from the Raj, whisking it away for two centuries in order to to balance the Empire's books and to fund its border wars. The result was a per capita GNP in the Raj that by the 1920s had not changed since 1757. On the other hand, it is an eternally new argument. The history of capitalism has until quite recently concentrated on what went right with Europe and, to quote the title of a related book by Bernard Lewis, \"what went wrong\" with everyone else. The tradition stretches back to Marx and the post-Enlightenment critiques of \"Oriental despotism\", and was given its 20th century social scientific chops by Max Weber. More recent thinking, along the spectrum of which I would situate Davis's book, sees the decline of Qing China and post-Mughal India as to a great extent a product of their encounter with Western conquerors and institutions, rather than any preordained internal decay. All the elements of progress that Locke had theorized and Marx had described in the experience of pre-Modern England turned out to be deeply destabilizing when exported elsewhere: the privatization and enclosure of communal lands, the switch to export cash crops, the breakdown of the village commune, the burden of state taxation in the absence of paternalist reciprocities. When combined with intensely racist structures of economic exploitation that knew no equivalent in the Europe of the time, the picture emerges of civilizations that were strategically maimed. The force of the argument rests with Davis's gruesome and often heartbreaking portrayal of the climate disasters that exacerbated these political developments. The demographic destruction, greatest in China and India, but felt as far away as Morocco and Brazil, and as great in its death toll as any of the Holocausts of the 20th century, was a blow to economic resources from which these nations were not to recover until well into the last century. Davis points out that it was from the epicenter of the 19th century Chinese famines, in the northern plains of Shanxi province, that Mao's army marched out to communist victory in 1949; it was not until 1953 that the population of the province reached the pre-famine level of 1870.Davis is most ambitious in his attempt to reconstruct the climate history of the period. In doing so he takes a step closer to a type of interdisciplinary history that allows nature an active role in the story. El Niño is the culprit, and we learn much about it. Perhaps most interesting, and eerily harmonious with the thesis of the book, is that the same forces of global integration that were destabilizing the societies falling under European influence were allowing, for the first time, a truly worldwide climatology. It was the infrastructure of empire that provided the data with which early climatologists first noticed the simultaneity of the weather events of the 1870s and after.Already Davis has accomplished much. By seeking to describe a set of complex feedback loops that involve peasant societies, colonial states, and extraordinarily complex global weather patterns such as El Niño he is taking a step towards a new kind of socio-ecological history that is badly needed in the age of climate change. Where I find fault with his book is that he does not push ahead to make this connection, and to refer to the contemporary irony that, if climate helped make nations vulnerable to the depredations of colonialism in the 19th century, today it is climate change that threatens to affect the poorest nations most severely."}, {"userName": "Mary Alderete", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/48413218-mary-alderete", "userReview": "This book will disgust you. That's why it must be read. These things really happened."}, {"userName": "Ajk", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/7057925-ajk", "userReview": "This was the first Mike Davis book I've read. It is very dense. The subject matter: how linkages to global capitalist market exacerbated famines caused by weak political systems during El Nino events, is not breezy. It's also nearly 400 pages. Dense pages, full of reiterating historians of 19th century India, Brazil and China describing political breakdown and the starvation it caused. There are only a couple true antagonists (Lytton, mostly) and a lot of descriptions of the bleakest of all worlds. Cannibalism, starvation, and apocalyptic landscapes.It is really impressive how he builds his case from all of this. Demonstrating the genesis of despair is a very difficult thing to do, and is very open to screeds, but Davis patiently builds a detailed argument of how markets in western Europe created a new economics that made traditional antidotes to famine (giving people food whether they can afford it or not) impossible. And that this new economics and the famine it caused was not an incident of capitalism, but the entire point — immiseration and destruction of surplus persons. For me, the most impressive part of the book is his description of how devastating British imperial rule was. The statistics showing how not-bad of a place India was to live, until the Brits got there and exhausted markets to benefit Britain, is pretty remarkable. The way Davis demonstrates the lies the British told themselves about their rule is eye-opening.It is a book full of good arguments, and the only reason I'm docking it a star is because he spends so much time building his case – often from secondary sources – and very little time collating those sources into an analysis. He really trusts the reader to follow him along, but there were times when all of that respect could be an overreach — I often went back a few pages while I was reading to make sure I was catching everything. And Davis is not an Asianist or a South Americanist, which is fine and great but means that he relies on a lot of secondary sources which can also mean for tricky reading.It's a necessary book in a lot of ways. I wasn't surprsied to hear that many of my friends have already read it. It also deserves a larger audience, but the way it is written can make that difficult."}], "description": "Examining a series of El Niño-induced droughts and the famines that they spawned around the globe in the last third of the 19th century, Mike Davis discloses the intimate, baleful relationship between imperial arrogance and natural incident that combined to produce some of the worst tragedies in human history.Late Victorian Holocausts focuses on three zones of drought and subsequent famine: India, Northern China; and Northeastern Brazil. All were affected by the same global climatic factors that caused massive crop failures, and all experienced brutal famines that decimated local populations. But the effects of drought were magnified in each case because of singularly destructive policies promulgated by different ruling elites. Davis argues that the seeds of underdevelopment in what later became known as the Third World were sown in this era of High Imperialism, as the price for capitalist modernization was paid in the currency of millions of peasants&rsquo; lives.", "title": "Late Victorian Holocausts: El Niño Famines and the Making of the Third World", "url": "http://www.goodreads.com/book/show/7859.Late_Victorian_Holocausts", "average": 4.08, "cover": "https://images.gr-assets.com/books/1352512855l/7859.jpg", "reviews": 87, "authors": [{"url": "https://www.goodreads.com/author/show/5289.Mike_Davis", "name": "Mike Davis"}], "type": ["History", "Nonfiction", "Politics", "Economics", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/7859.Late_Victorian_Holocausts", "http://www.goodreads.com/book/show/52854.Late_Victorian_Holocausts", "http://www.goodreads.com/book/show/484028.City_of_Quartz", "http://www.goodreads.com/book/show/7855.Planet_of_Slums", "http://www.goodreads.com/book/show/7852.Ecology_of_Fear", "http://www.goodreads.com/book/show/174885.Buda_s_Wagon", "http://www.goodreads.com/book/show/7860.Magical_Urbanism"]}