{"ratings": 17392, "userreviews": [{"userName": "Alan", "userReviewDate": "Feb 02, 2011", "userURL": "http://www.goodreads.com/user/show/2187066-alan", "userReview": "This is a hard book to read - not because the language or ideas are lofty (just the opposite, the ideas have been made extremely accessible) -- the reason this book was hard to read, is because it nearly forces you to take a hard look at the way you live, the way you treat others, and the way you navigate through business, personal, and other situations. The biggest take aways from this book, in my humble opinion, are that we often are at least part of the cause of the problems that we *blame* on others. The blame game is how we deceive ourselves... and effectively undermine any solution to the problem. We then *need* things to go wrong in order for us to feel justified in that blame --- that's not a very easy truth reconcile oneself with. You come away from this book not self-condemning, but enlightened, and with a renewed vigor in trying to mend personal relationships, and thence professional ones. This book *can be* deeply good for not only yourself, but for all of those who surround you. Read it, understand it, think about it, live it, and then pass it along to those around."}, {"userName": "Erin", "userReviewDate": "Apr 02, 2013", "userURL": "http://www.goodreads.com/user/show/3079497-erin", "userReview": "Good principles, a good teaching tool for organizations, but painful to get through.I assume the story format is aimed to make the read easier to get through and understand, but instead it felt like a local TV commercial with a bad script. I would prefer that the narrator was straight, to-the-point and speaking to the reader. Examples are helpful, but following Tom's slow learning process made me feel like I was in a math class that I was too advanced for, ready to move on to the more complicated stuff but being held back by other students.The box metaphor also began to irk me. In certain sections, I wrote a note to myself to replace \"in the box\" with \"acting like a selfish jerk\" and \"out of the box\" with \"being considerate of other people.\" I just wanted to be spoken to in real terms. The box metaphor and story format will hopefully be condusive to a group discussion among team members of an organization, but if you are reading on your own to improve your relationship skills at work, there must be something better."}, {"userName": "Kim", "userReviewDate": "Feb 17, 2008", "userURL": "http://www.goodreads.com/user/show/134400-kim", "userReview": "I know a lot of people who really love this book. It takes complex ideas and presents them in an easy-to-follow format. Which is fine if you're 10 years old. I felt like it was dumbed-down and assumed the reader is less than intelligent. Despite its big print, simple sentences, and few pages, it was a struggle to make it to the end. Want the same ideas presented to competent adults? Check out \"Bonds that Make Us Free\" by C. Terry Warner."}, {"userName": "Eric Glenn", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/3826515-eric-glenn", "userReview": "I read this book in one day...I just couldn't put it down. An excellent book on how to be a better person and leader. Really set well with my beliefs on building relationships which are the love of others versus love of self. I think I will buy this book for each of my adult children to read. Hopefully they can learn these concepts faster than the 52 years it has taken me! It is also a MUST read for leaders in business, especially if you are involved in Network Marketing. Really it is a must read for anyone who wants to make quantum leaps in reaching results in attaining their goals.I want to thank my son-in-law Brett Taylor who loaned me the book to read. Thank you for thinking so good of me."}, {"userName": "Darwin8u", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"My self-justifying image about being learned can be the very thing that sometimes keeps me from learning.\"- The Arbinger Institute, Leadership and Self-DeceptionLike most series, I tend to read them backwards. I've known about these Arbinger books for years, but only recently read them. Last year I read Anatomy of Peace and figured it made sense to close the circle on the \"box\" and read the book that started the whole Arbinger/Self-Deception/Leadership thing. A quick background (I talk about this a bit in my Anatomy of Peace review): I know C. Terry Warner's family. I actually went to a private, prep school in Provo, Utah with both C. Terry Warner's kids and Steven R. Covey's kids (all we needed was Clayton Christensen's kids and we would have had a full set). The school was amazing. I didn't realize at the time that I was learning French and pre-Calc among the progeny of Leadership Gurus. First, let me back up. You might never even recognize C. Terry Warner's name while reading this book. He isn't mentioned anywhere in the book directly. It has, however, his philosophical fingerprints all over it. The book isn't written by one person, but rather by an organization (Arbinger Institute) that was founded by Dr. Warner. It builds on C. Terry Warner's ideas of self-deception, human emotions, and organizational performance. C. Terry Warner is a PhD in philosophy and taught for years at BYU so it is natural that the foundations of a lot of Arbinger (a company he founded) is centered around philosophy, theology, and psychology. This book focuses on self-deception, and how treating people as objects and not people, and self-betrayal (not acting on our impulse to help others), hurts families, organizations, and individuals. I think the ideas in this book are sound. I wasn't, however, a fan of the terms \"in the box\" or \"out of the box\". I understand why they used it (simplicity, visually instructive, intuitive), but it also seemed a bit too simplistic (maybe that is what today's business demand?) and confusing (for years people have used the cliche \"thinking outside the box\" which is a completely different idea). Anyway, I generally hate self-help and corporate leadership books. I do, however, have a soft spot for the Arbinger books, and do find them to be a bit more useful than most. Part of the reason I liked, yet am still also a bit conflicted about it, fits into a term coined by my friend Nathaniel. He called Arbinger and Covey books a sub-genre of \"covertly religious business books\". Some of the stories were familiar to me locally. Some concepts seemed, like Covey's The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change, to repackage theological and ethical arguments I am very familiar with. Again, some of that may come from where I grew up, and the kids I was hanging with."}, {"userName": "Antoinette Perez", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/1363136-antoinette-perez", "userReview": "Really struggled with this book, and I see from the average rating that I'm in the minority here. The contrived fable format... the condescending, read-my-mind closed question interrogations... the shallow introspection... the insistence on the reader forgetting what he or she knows about the phrases \"in the box\" and \"out of the box\" to adopt a new meaning just for this book... long-winded (pages-long) pseudo-explanations of new concepts and jargon that only muddy the waters more, like this excerpt:“By blaming, I invite others to get in the box, and they then blame me for blaming them unjustly. But because, while I’m in the box, I feel justified in blaming them, I feel that their blame is unjust and blame them even more. But of course, while they’re in the box they feel justified in blaming me and feel that my further blame is unjust. So they blame me even more. And so on. So, by being in the box, I invite others to be in the box in response. And others, be being in the box in response, invite me to stay in the box.”\nSay what?!\n Maybe another way of saying that is, \"Blame often creates a self-perpetuating victim spiral.\"More than anything else, it embarrasses me that the moral of the story, as far as I can tell, is that businesspeople need to remember to treat other people like humans, with respect and care. Is it the state of business today that leaders need this heavy-handed reminder?"}, {"userName": "Laura Broder", "userReviewDate": "Feb 22, 2010", "userURL": "http://www.goodreads.com/user/show/1338441-laura-broder", "userReview": "READ THIS BOOK RIGHT NOW.I'm serious.I'm not really into management books, but this one was recommended to me by a friend and mentor who I respect immensely. She gave me her copy months and months ago, and boy do I wish I picked it up sooner.Firstly, this book is incredibly readable. Though it's about communication and interpersonal relationships, it's not a dry, non-fiction handbook. The concepts the book present are unveiled slowly, through a fictional story. Tons of real-life examples are used, and the story just makes you wanna keep reading to find out the next step in getting out of the box. I flew through this book in a couple of days.I won't try to explain the concepts presented in this book; you really need to read it. But suffice it to say that they have changed the way I look at myself and others close to me. I am SO in the box most of the time, and it's time that I got out. I look forward to putting the concepts presented in this book into practice. I know my family, friends, and co-workers will appreciate it."}, {"userName": "Sunny", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/5870882-sunny", "userReview": "7 stars. I’m on about 600+ books now that I’ve read as a semi-adult (am i bragging? probably, who cares?) - I have to admit that this one has gone into my top 5. I would have titled it as the “psychology of self-deception and the impact this has on relationships”. I was blown away by this book that was recommended by a partner in our firm. There is a sequel to the book called the anatomy of peace that’s on my bedside table which I’m going to be diving into very soon. As the book title suggests this book is about self-deception and doesn’t apologise for being didactic about it. The moment of self-deception, of a morally pivoting instance can have a cascade of extremely deleterious effects on the individual and those around him / her. Micro decisions that we make in life if on the wrong side of being right affect us and sometimes we end up carrying the effects of these unvirtuous decisions with us throughout our lives. The authors call this mind-set “being in the box”. This always had a slightly tangential although part related meaning for me because of my addiction to boxing and I couldn’t help but draw parallels between the reality of people finding themselves in the box and the squared circle in which boxers practise their pugilistic dance. The only way out of the box is to question your own virtue - a fight with yourself more than anyone else, which as anyone who boxes will know is the real fight that takes place in the ring. The basic premise of the book can be summed up in the following sequence of activities that take place when we make an incorrect decision or act in an incorrect way which essentially doesn’t feel right to us: 1.\tWe self-betray: an act contrary to what I feel I should do for another is called an act of self-betrayal. 2.\tWhen I betray myself I begin to see the world in a way that justifies my self-betrayal. 3.\tWhen I see a self-justifying world my view of reality becomes distorted. 4.\tSo when I betray myself I enter the box. 5.\tOver time certain boxes become characteristic of me and I carry them with me. 6.\tBy being in the box I provoke others to be in the box7.\tIn the box we invite mutual mistreatment and obtain mutual justification. We collude in giving each other reason to stay in the box ... and the beat goes one. Here are some of my best bits from the book:•“There are a whole host of things we can do - things that can help us reduce our in the box moments and heal out in the box relationships. In face this is precisely what your experiences with Bud and Kate did for you yesterday - you did something while you were out of the box toward Bud and Kate that helped you to get out of the box toward Laura. My mind searched for the answer. What did i do? YOU QUESTIONED YOUR OWN VIRTUE.” •\t“People respond not primarily to what you do but to how you are being – whether you’re in or out of the box towards them.”•\t“We don’t see people straightforwardly as people. Rather we see them in terms of the self-justifying images we’ve created. If people act in ways that challenge the claim made by a self-justifying image we see them as threats.”•\t“In the box every change I can think of is just a change in my style of being in the box. I can change from arguing to kissing. I can change from ignoring someone to going out of my way to shower that person with attention but whatever changes I think of in the box are changes I think of from within the box and they are therefore just more of the box – which is the problem in the first place. Others remain objects to me.”•\t“You can’t get out of the box by trying to focus on yourself which is what you do when you try to change your behaviour in the box.”•“In the box i'm actively resisting what the humanity of others calls me to do for them.”•“This is why the way out of the box is always right before our eyes - because the people were resisting are right before our eyes. We can stop betraying ourselves towards them - we can stop resisting them.”"}, {"userName": "VR", "userReviewDate": "Nov 18, 2008", "userURL": "http://www.goodreads.com/user/show/1264519-vr", "userReview": "A book that teaches powerful principles that I have already begun implementing to great effect in my own life. The principles we already know for the most part, and the general truths don't surprise, but The Arbinger Institute has blended and crafted them in such a way as to help us really put it all together. My favorite and most meaningful insight is that when we are \"in the box\" it doesn't matter what we do, how helpful or good we try to be, we will end up defeating ourselves. Forget blame and see people for who and what they are, rather than as instruments to our own ends. Anyway, lot's of great stuff. Frankly I think everyone needs to read it, for the sake of all their relationships, at work, at home, and anywhere else. Bravo Arbinger!"}, {"userName": "Ian Stewart", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/50743094-ian-stewart", "userReview": "Excellent extended business-oriented parable on what happens when you ignore the instinctual feeling to help those around you. You either honor that feeling or you betray it. What happens when you betray it? It ain’t good according to the book. It’s self-betrayal that sets off a chain of events that leaves you feeling justified and others looking contemptible. You wind up calling that your character and living in a warped version of reality with warped results in all your actions. Worse still you’re probably doing this all the time. It has a dated Sunday School feel to it for a book published in 2002 but I won't knock points for that. It all rang true. Highly recommended."}, {"userName": "Kelly", "userReviewDate": "Jan 19, 2009", "userURL": "http://www.goodreads.com/user/show/1924514-kelly", "userReview": "I came into work one day, and this book was on my desk with no note attached. I picked it up, flipped it over, and read the first quote on the back: \"Fascinating, thought provoking, and insightful! This book is a wake-up call to all those who think they're good with people...\"[return][return]Wait. What?! Was somebody trying to tell me something? Was this some passive-aggressive attempt at telling me I'm a bear to work with? I could actually feel my heart drop and hit my stomach. I hid the book under my purse and tried to check my email, but I just couldn't concentrate.[return][return]I peeked into my neighbor's cube and said in just-barely-above-a-whisper, \"Hey, I had some book on my desk when I came in. Do you know what that's about?\"[return][return]\"Oh, yeah. Our boss left them for us. She wants us to read them before our group meeting in 2 weeks.\"[return][return]My heart sprung back up to its rightful position in my chest cavity. No secret message from a disgruntled co-worker, hooray![return][return]But...assigned reading for work? I have a spreadsheet of 643 book titles I want to read and a stack of 20-ish books from the library all in various stages of being read and flipped through and referenced, and I'm what"}, {"userName": "Farnoosh Brock", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/17483237-farnoosh-brock", "userReview": "The premise of this book focuses on one's own limited view of people, relationships, and organizational dynamics and clearly shows them as obstacles to one's optimal performance and productivity. The Arbinger Institute reveals the new thoughts and debunks false notions around leadership. The best leadership and business books weave the concepts into a story rather than disseminate them in dry abstract paragraphs. Try as it may, abstraction always comes short of making us engage and anticipate the the way a good story does - and few other styles make the concepts more lasting in our memory bank. It is within the context of a good story that true learning happens.At the core of the book, he introduces us the concept of the Box - Being in the Box and Getting out of the Box. In this context, the Box represents the mental borders we draw around ourselves, to protect ourselves, to set us apart from rest of the world and justify our own actions. Bud explains in these sessions that we see others more or less as people only when we are out of the box - and we see them in a systematically distorted way, as mere objects in his words, when we are in the box. \"We can be hard and invite productivity and commitment, or we can be hard and invite resistance and ill will. The choice is whether we do it while in the box or out of the box.\" It alludes to something deeper than behavior that determines our influence on others.In acting contrary to one's own sense of what is appropriate, we learn, one betrays his own sense of how he should be toward another person. That is self-betrayal. The choice is whether to honor the sense or to betray it. According to Bud, \"When I betray myself, I see the world in a way that justifies my self-betrayal and my view of reality becomes distorted, then I enter the box.\" Put another way, when I betray myself, I:Inflate others' faultsInflate own virtueInflate the value of things that justify my self-betrayalBlame othersThe latter part of the book, which guides us into Getting out of the Box and exercising leadership in the liberated box-free world, we share in our hero's confusion in how the usual remedies fail here. This is where new leadership concepts are born and revealed. Getting out of the Box is only possible when we know well the problem with being in the box.If you read only one business book, this would be among my top recommendations. If you can read only a few pages, read page 165-166. \"Living the material\" section is clean, short, void of all business jargon, and beautifully written to boot."}, {"userName": "Nathaniel", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/3809399-nathaniel", "userReview": "I don't know if there's some kind of sub-genre for covertly religious business books, but I feel like there should be. I guess I read a book called \"The Greatest Salesman in the World\" or something when I was a missionary that wasn't even covert. There's also all the religious subtext of books like The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change. Anyway, this book is in that category. What it does is reformulate some basic concepts of spiritual / ethical living in totally secular language, and in so doing it actually does a pretty amazing job of conveying some really first-rate, post-modern Christianity in simple terms.I say \"post-modern\" because the central idea of the book is that we are capable of self-deception. We don't know our own motives and--worse than that--we often contradict our own assumed goals. Here's the basic thesis:1. Everyone has a basic desire to treat other people as people (rather than means to ends)2. Everyone violates that basic desire at some point or other.3. When that happens, we immediately seek to justify our own self-betrayal by inventing a fictitious narrative to justify it. Namely, we (a) accentuate / fabricate negative characteristics of the person we didn't treat right and (b) we accentuate / fabricate positive characteristics of ourselves.This is called, in the book, \"being in the box.\" Weird expression, and I never got it, but whatever.4. When we're in the box, we actually need other people to behave badly because it validates our narrative that we're saintly victims and they're powerful villains.5. As a result, you can get into a vicious cycle with people you live or work with, where both of you are sabotaging the other while pretending to be helpful.It's actually amazingly close to some theories I've written about myself (in an overtly religious venue), and maybe that's why I'm so partial to it. Anway, I really, really liked it, and I'm impressed even if I'm not convinced that it's really that applicable to a business context. (It seems perfectly applicable to a family context.)"}, {"userName": "Dan George", "userReviewDate": "May 19, 2014", "userURL": "http://www.goodreads.com/user/show/13874955-dan-george", "userReview": "The core ideas in the book -- what the authors call getting \"in the box\" toward others and how to get out of the box -- are helpful. However, two things keep me from giving this book a higher rating.First, the story the authors use to introduce these core ideas to the reader could have been much shorter with higher impact. See Patrick Lencioni's business fables for an example of that. Second, two key terms in the book -- \"in the box\" and \"self-betrayal\" -- are not good fits for what the authors are describing. And these terms are used throughout the book and more frequently than any others. What the authors describe as \"self-betrayal\" is actually about how we think about, respond to and act toward others. \"Self-focus\" or \"defensive\" or a term that was more about betraying others would have been more fitting. I had a hard time getting past the misuse of \"self-betrayal\" and almost gave up on the book because of it. Meanwhile being \"in the box\" toward someone else doesn't give a picture that aligns with the outward attitudes and actions the authors describe. Given this book has been around for a while, it is probably too late to change either of these terms. Leadership and Self Deception loses a lot of its potential impact, because it is longer than need be and not as clear as it could be. Still it is worth a quick, skimming-through-it read to get the key messages and to see where you are falling into these traps as a leader."}, {"userName": "Thai Duc", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/37108649-thai-duc", "userReview": "People should read the book. It gives a new way of looking at our behaviors. It gives you an option to look at your acting. By knowing them, you can gradually live a better life, run organizations better. The book does not give you answers for your problems. It gives you the truth.I love the \"Box\" concept and the drawing. The drawing delivered a big impact on my memory.While reading the book, I reflected, I got so many ah-ha moments. The book is my environment to open the other sides of the box. We all have many boxes. The philosophy in the book applies to all aspects, not just in job or leadership."}, {"userName": "Cameron", "userReviewDate": "Sep 09, 2008", "userURL": "http://www.goodreads.com/user/show/1511796-cameron", "userReview": "Life changing way to look at the people around us and our influence on them.I have just gone through this book with another student and it has changed his life. He just apologized to his father for some serious stuff that he would not admit to in the past. He said he does not like his dad still but needs to treat him as a person because that is more fair.What better endorsement for a book?This is the fourth student I have gone through this book with and it is a great intervention in therapy. I had better keep track.M. M. April 2008C. N. September 2008T. S. August 2008A. G. November 2008B. H. March 2009"}, {"userName": "Jesse Stay", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/16067182-jesse-stay", "userReview": "A guidebook for life! This excellent book uses a fictional example to get you thinking \"out of the box\" in how you interact with others, both in business and in your personal life. This should be mandatory reading for every employee and family member. You find yourself in the shoes of the characters as they go through problems in their lives, realizing that we all have these same problems in our relationships with people. I'll be having my kids all read this! This book will help you, and everyone in any type of organization work better together."}, {"userName": "Jenny Stringham", "userReviewDate": "May 27, 2016", "userURL": "http://www.goodreads.com/user/show/952512-jenny-stringham", "userReview": "Good ideas, and a clever way of communicating the ideas while keeping the reader engaged. A little hokey in parts, but it worked good for the subject I thought."}, {"userName": "Trung Thieu", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/12620775-trung-thieu", "userReview": "Sách hay, dễ đọc.Tựa đề tiếng Việt là \"Lãnh Đạo và sự Tự Lừa Dối\" (mua bản ebook của alezaa có 15k còn tiki thì 20k, sách giấy thì tầm 50k)Tuy tựa đề có từ Lãnh Đạo nhưng triết lý của sách có thể được áp dụng vào nhiều mặt của cuộc sống thường nhật.Một số khái niệm:- Sự Tự Lừa Dối: Con người chúng ta luôn chối bỏ sự thật là mình đang có vấn đềẩn dụ bằng hình ảnh nhốt mình trong hộp.- Sự Tự Phản bội:1. Đó là khi ta biết mình nên làm điều gì đó cho người khác nhưng cuối cùng lại không.2. Khi tự phản bội, con người bắt đầu nhìn nhận thế giới qua lăng kính biện minh cho sự tự phản bội.3. Khi nhìn thế giới qua lăng kính đánh giá cá nhân, nhận định của con người về thực tế sẽ bị bóp méo.4. Sự tự phản bội là nguyên nhân đẩy con người vào trạng thái \"nhốt mình trong hộp\"Sau khi tự phản bội, tôi nhìn nhận bản thân dưới góc độ tự đánh giá5. Cùng với thời gian, những nhận định về bản thân xuất phát từ trạng thái \"nhốt mình trong hộp\" sẽ tạo thành tính cách của người đó.Thực hành tài liệu:- Đừng cố trở nên hoàn hảo, hãy cố trở nên tốt hơn- Đừng sử dụng từ \"chiếc hộp\" và những thứ tương tự cho những người chưa biết gì về nó.- Đừng tìm kiếm chiếc hộp của người khác, hãy tìm chiếc hộp của chính mình- Đừng buộc tội người khác \"đang nhốt mình trong hộp\". Hãy cố gắng để mình thoát ra khỏi hộp- Đừng từ bỏ khi phát hiện ra mình đang \"nhốt mình trong hộp\". Hãy cố gắng tiếp tục để thoát khỏi nó- Đừng chối bỏ việc \"nhốt mình trong hộp\" khi bạn thật sự đang trong trạng thái đó. Hãy xin lỗi và cố gắng tiến về phái trước, cố gắng trở nên hữu dụng hơn trong tương lại.- Đừng tập trung vào điều người khác đang làm sai. Hãy tập trung vào điều đúng đắn bạn có thể làm để giúp đỡ họ.- Đừng bận tâm xem người khác có giúp đỡ mình hay không. Hãy tập trung xem mình đã giúp đỡ họ được những gì."}, {"userName": "Mehrsa", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/1045774-mehrsa", "userReview": "So I read this back in college because Terry Warner (the author of Bonds That Make Us Free on whose ideas this book is based) was my freshman year philosophy professor. The man is amazing. He's a saint and he's brilliant and his ideas have been my life's guiding principles. I've read Bonds that Make us Free like 10 times. I hated this when I first read it college, but then I just re-read it again because it's short and I wanted a reminder. And it's like reading beautiful ideas of philosophy (rooted in Buber's concept of I and Thou) and then speaking them through corporate speech. \"Getting out of the box will help our company's bottom line.\" It's a prostituting of some great concepts. The book is also so cheesy. Just read the original."}, {"userName": "Noah Goats", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/41735508-noah-goats", "userReview": "A brief glance at my reading history will demonstrate that this is not the sort of thing that I usually read, but when your boss gives you a book as a Christmas gift, you’d probably better read it. The book’s structure is a little off putting. It’s not written like a standard work of non-fiction; instead it’s like a novel with one boring cardboard character giving another boring cardboard character a lesson about “thinking outside the box.” Apparently, this is the book that popularized that now extremely cliched phrase. Now that I’ve actually read the book, I realize I’ve misunderstood the cliche for years.Despite it’s cardboard prose, Leadership and Self-Deception teaches a lot of sound principles of leadership and interpersonal relationships. It teaches them with clarity, and although it’s not exactly beautifully written, it goes down pretty quick. It was far less horrible than I imagined it would be when I first spotted it on my desk, decked with a bow."}, {"userName": "Phillip Scharf", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/76344758-phillip-scharf", "userReview": "Quite an incredible read. Requires introspection while encouraging growth in a reader. Though I picked it up initially hoping to continue my pursuits of being a capable and quality leader, I found the lessons in the book to be applicable to every aspect of my relationships with others. Seems like a good book to reference in moments where I am stuck or frustrated in my relationships."}, {"userName": "Alireza Nourian", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/24028026-alireza-nourian", "userReview": "کتاب در مورد یک مشکل صحبت می‌کند. مشکل همه آدم‌ها، هر روز. موضوع واقعاً مهم است.با اندکی فکر و مطالعه می‌توان به این نتیجه رسید که انسان، دنیا را طوری می‌بیند که رفتارهایش را توجیه می‌کند. حرف نوی کتاب این نیست. کتاب می‌گوید که چطور، این‌طور می‌شود و پاسخ بسیار کاربردی و غیرمنتظره است. اگرچه مطمئن نیستم که درست و یا حداقل کامل باشد.خیلی خلاصه‌اش این می‌شود که ما گاهی نسبت به دیگران احساس وظیفه می‌کنیم، بعد به این وظیفه عمل نمی‌کنیم و در این هنگام، دنیا را طوری می‌بینیم که رفتار درست، همان عمل نکردن به وظیفه باشد.کتاب واقعاً ارزش خواندن دارد؛ ولی متأسفانه خواندنی نیست. یعنی در هنگام مطالعه گاهی احساس حماقت به آدم دست می‌دهد و فکر می‌کند که اگر کتاب را ورق‌ورق در آب کله‌پاچه ترید کنند، مغز پخته گوسفند مطالب را یاد می‌گیرد."}, {"userName": "Lara", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/185212-lara", "userReview": "I read this for Book Club. It was insightful and I've thought about \"the box\" a lot since then. Every person in a leadership position would benefit from reading this."}, {"userName": "Ambika Rani K", "userReviewDate": "Jan 29, 2017", "userURL": "http://www.goodreads.com/user/show/20212788-ambika-rani-k", "userReview": "A must read book for everyone who thinks he is right all the time and the other person is wrong. A book which serves as a compendium in resolving every troubled relationship in your life."}, {"userName": "عبداللطيف خالد", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/21189744", "userReview": "رائع كرسالة، كان بالإمكان حذف ربع الكتاب على الأقل"}, {"userName": "Corinne Edwards", "userReviewDate": "Oct 08, 2009", "userURL": "http://www.goodreads.com/user/show/875001-corinne-edwards", "userReview": "\"WHAT?\" you say to yourself. WHAT is this fantasy-story-loving girl doing reading a book that demands shelving on the business/psychology shelf? And a valid question it is. I would never in one thousand years have picked it up if my dearly beloved husband hadn't read it first and told me that it changed his life. Changed it to the point where I am SEEING him look at the world in a different way. And when my husband, who has watched me read for 11+ years now and has never once asked me to read something, asks me to read this book, what can I say?I read it, and I can see why he asked me to. This book will make you feel like a weasel on one hand, recognizing that so much of our interactions with others are the results of our own decisions to do or not do what we know is the \"right\" thing to do. But on the other hand, you recognize the potential within you to just CHANGE things - change the way you interact with the people you care about the most.The writing style is readable - it's conversational with lots of real-life examples. Probably for someone used to reading business/self-help books it would be a breeze to read. For inexperienced me, though, it made my brain work hard and I still keep having to ask my husband questions about how to apply the ideas. I think that it will take time (and probably some re-reading) to use the jargon effectively in my mind - phrase like \"self-betrayal\" and \"being in the box\" still don't roll off the tongue, if you know what I mean. But I do know what it feels like when I start seeing myself as the \"good mom\" dealing with my \"my crabby kids.\" And I don't like that me. I want to see myself as I really am and I want to openly see those I love as they really are: as people (not objects) with thoughts and feelings and desires just like I have and which are just as valid as my own."}, {"userName": "John Norman", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/141355-john-norman", "userReview": "A truly remarkable book - read it. The 3-star grade comes mostly from my guess that the value of this book will have everything to do with what it mean to you, not anything integral to the book itself. It's a journey. I learned a lot.A couple of points:* The book essentially makes assertions about humans that would be hard to test. That doesn't mean it's wrong or not valuable, but it's very much in the \"your mileage may vary\" category.* I think that the basic insights may be pretty indebted to some core ideas in the Christian tradition -- e.g., centuries of thought helping us understand consequences of envy, pride, and narcissism. I could say more, but this is just a note."}, {"userName": "Abe Smith", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/24477678-abe-smith", "userReview": "I thought the book had some excellent five star concepts and ideas but it was just a 3 star read. Although the book didn't unnecessarily rehash ideas as business books are prone to do, I felt that it was sometimes difficult to extract the principles being taught because of the story-style way of presenting the material. That said, I plan on implementing a couple of their ideas which I believe can be life altering."}, {"userName": "❀Aimee❀ Just one more page...", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/1463934-aimee-just-one-more-page", "userReview": "Interesting way of thinking that takes some practice for most people. For some reason, I tend to think this way most of the time. I do need to consider this whenever I start to feel my frustration levels rise with someone."}], "description": "The \"disease\" of self-deception (acting in ways contrary to what one knows is right) underlies all leadership problems in today's organizations, according to the premise of this work. However well intentioned they may be, leaders who deceive themselves always end up undermining their own performance.This straightforward book explains how leaders can discover their own self-deceptions and learn how to escape destructive patterns. The authors demonstrate that breaking out of these patterns leads to improved teamwork, commitment, trust, communication, motivation, and leadership.", "title": "Leadership and Self-Deception: Getting Out of the Box", "url": "http://www.goodreads.com/book/show/180463.Leadership_and_Self_Deception", "average": 4.11, "cover": "https://images.gr-assets.com/books/1172487064l/180463.jpg", "reviews": 1896, "authors": [{"url": "https://www.goodreads.com/author/show/828.The_Arbinger_Institute", "name": "The Arbinger Institute"}], "type": ["Leadership", "Business", "Nonfiction", "Self Help", "Psychology"], "outlinks": ["http://www.goodreads.com/book/show/180463.Leadership_and_Self_Deception", "http://www.goodreads.com/book/show/36273416-leadership-and-self-deception", "http://www.goodreads.com/book/show/16617311-leadership-and-self-deception", "http://www.goodreads.com/book/show/889939.Leadership_and_Self_Deception", "http://www.goodreads.com/book/show/6995673-leadership-and-self-deception", "http://www.goodreads.com/book/show/25480369-the-anatomy-of-peace", "http://www.goodreads.com/book/show/27982992-the-outward-mindset", "http://www.goodreads.com/book/show/4601215-the-choice", "http://www.goodreads.com/book/show/2603513-the-parenting-pyramid", "http://www.goodreads.com/book/show/18245006-angels-among-us", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}