{"ratings": 223, "userreviews": [{"userName": "Stephen", "userReviewDate": "Dec 02, 2017", "userURL": "http://www.goodreads.com/user/show/4412069-stephen", "userReview": "this book took awhile to get going and felt the ending was rushed hence why only giving the book this rating. the book itself is based in 1917 Russia after the second revolution as the war goes on the intelligence services change their priorities."}, {"userName": "Liviu", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "kind of boring and couldn't care less about either of the main characters; having Bolshevik leaders as even partially 'good guys\" tops it off; not a 1 star as on occasion it reminded me of the superb ww2 series of the author' still, such a hugely disappointing series...will check volume 4 just for completion"}, {"userName": "Mal Warwick", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/4739424-mal-warwick", "userReview": "When the Russian Revolution erupted in 1917, it was by no means clear that Vladimir Lenin’s Bolsheviks would come into power. Even after Lenin and his allies seized the reins of government in Moscow and Leningrad late in the year, the Communist Party’s control of the country was deeply in doubt. The party was indebted to a shaky coalition partner, the Left Revolutionary Socialists. Royalist forces, later dubbed the Whites, were forming armies led by former czarist officers and rapidly regaining territory. A Czech army of 50-100,000 men was operating in tandem with the Whites. And the Western Allies—British, French, and Americans—were invading the country from the north. Chaos reigned in Russia.In the midst of this fluid and uncertain situation, Jack McColl, a Scot employed by the nascent Secret Service (MI6), enters the country on a mission to help undermine the Bolsheviks. Meanwhile, his unlikely lover, Irish-American journalist Caitlin Handley, is in Russia reporting on the Revolution. Caitlin is a radical with friends among the Bolsheviks and the Left Socialist Revolutionaries. This is the premise on which Lenin’s Roller Coaster is based. It’s the third novel in David Downing’s series featuring Jack and Caitlin.Somehow, in an earlier book in the series, the two fell in love in the midst of a Secret Service operation in Ireland. There, they were on different sides, too. In fact, Jack was responsible for the death of Caitlin’s younger brother, Colm, who “had been hanged in the Tower of London two years earlier, after taking part in an Irish Republican plot to sabotage the transporting of British troops to France. McColl had caught and arrested him, albeit after offering to let him escape.” Improbably, Caitlin is well aware of Jack’s role in Colm’s death and fell in love with him, anyway.Mansfield Cumming (the original “C” of MI6) has sent Jack to Russia with vague orders to connect with other agents already in place there. Cumming explains, “Our job is to shore up what’s left of the Eastern Front and prevent the Germans and Turks from exploiting the Russian collapse.”Lenin’s Roller Coaster relates Jack and Caitlin’s experiences as they make their way to Moscow with painful slowness. Jack enters from the south, through Iran. Caitlin’s route takes her to Vladivostok on Russia’s easternmost coast, then westward on the Trans-Siberian Railway. Both trips take many weeks and expose the lovers to repeated danger. While Downing’s description of the Russian Revolution as it unfolded across the vast expanse of the country is fascinating from an historical standpoint, the slow progression of the plot is tedious. The book works well as historical fiction, not so well as a thriller."}, {"userName": "Alexandra", "userReviewDate": "May 30, 2017", "userURL": "http://www.goodreads.com/user/show/644867-alexandra", "userReview": "The story didn't do much to captivate me but the historical detail was illuminating."}, {"userName": "Lorin Cary", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/2458009-lorin-cary", "userReview": "This is an historical novel, and Downing explains at the end his take on that genre. It's an excellent explanation which fits the story he's crafted that takes places during the first year of the Russian revolution. Jack McColl is a Scotsman and a British secret agent and Caitlin Hanley is an Irish-American journalist and supporter of the Bolsheviks. And of course they are in love. The novel follows them in separate chapters as Jack gets to Russia and as Caitlin works to record history-in-the-making and then to become part of it. Downing captures the context beautifully, the fragility of the regime in that first year, as myriad forces work to crush the revolution, and as the terror-to-come showed some ragged edges. It's a powerful story, and an excellent read."}, {"userName": "Martha Nance", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/36770830-martha-nance", "userReview": "3.5, not quite a 4, but still a good read. Going to start Downing's John Russell series as I find WWII more interesting than WWI."}, {"userName": "wally", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/4268560-wally", "userReview": "finished this one yesterday round about seven seventeen pee em...the 16th of february 2018, what was it, thursday? yeah, thursday. good read, i liked it...barely. three stars. or maybe two. it was okay. didn't ring any bells for me maybe because one of the heroes of the story is a socialist, starry-eyed, rose-colored glasses and all. if the story continued she'd been calling stalin uncle joe. there is an afterword from downing and apparently he tried to stay true to history, people, events to a degree. the big ones, this, that, the other. one thing missing, i thought, was any form of \"piece\"...journalism, from one of the heroes, the woman...there are two, a man and a woman...one a brit spy male and the other an american woman journalist. thought it would be nice to have seen her reportage in person instead of being told...such and such. the opportunity was certainly there, wasn't delivered, no news on the door-step. anyway...some parts of the story were good, more entertaining than others and that is a plus...they both engage in a kind of journey toward a destination and the reader follows along with them."}, {"userName": "Rayrumtum", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/2515087-rayrumtum", "userReview": "I thoroughly enjoyed this 3rd installment in the Jack McColl series. Most of it happens in 1917 Russia after the Bolsheviks have seized power. Many fellow reviewers had problems with it as being too complex or too favorable to the Bolsheviks in their struggle against the Whites. I think much of that is because Russian history at this particular time was extremely complex and Downing caught the complexity. The apparent sympathy for the Bolsheviks was true of many at that particular time as many contemporary observers thought it would unleash a new and better world. Plus the Whites against whom they were pitted were equally vile--especially against Jews. At this time many people/especially artists traveled to Russia to develop art and it was considered an exciting period of free expression. I suspect by the next volume those positive vibes will turn to dust as they have started in that direction towards the end of this one."}, {"userName": "Robert Scott", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/43101170-robert-scott", "userReview": "+McColl is left a home when Caitlin Hanley returns to Russia, but then he ships east with a partner to try to keep the Germans from obtaining essential materials. Caitlin returns to the US and then after covering part of the trial of the IWW leaders in Chicago, she continued on west and returned to Russia via Vladivostok. Train service is often interrupted or stopped all together and the trip to Moscow is not without incident. Meanwhile Jack is making his way through German occupied territory on his way to Kiev and befriends an orphaned boy after his escape from Kiev. Lots of walking, train problems, imprisonment by different groups, a split of the bolsheviks with the LSR, all manner of problems and ethical and other challenges to belief systems. All in all an amazing look inside history in the making.+"}, {"userName": "John Walker", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/13258469-john-walker", "userReview": "The newest Jack McColl/Caitlin Hanley espionage thriller continues the love affair between the two star crossed lovers. Only this time things are not as it seems. Caitlin has become enthralled by the revolution of 1917. It has become everything she could hope for.Meanwhile Jack, our dare-doing secret agent fights the secret war which leads him to Russia, only in the opposite direction from Caitlin coming in from the Far East. Only to miss her by months.Lenin's revolution rolls on in various directions. The Cheka, the Trust and even old Sidney Reilly shows up for a final (?) show down between Jack and Caitlin's relationship. Downing always does a grand job of his history of the times and although I thought the book was a trilogy it seems that there will be a fourth, which makes me waiting again."}, {"userName": "Rich Saskal", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/12783331-rich-saskal", "userReview": "This must be a good series, because I intend to finish it out.Even though there is a lot to quibble with.The lead characters, with their modern sensibilities, come off more as displaced time travelers than creatures of the World War I era when the series takes place.And a continuing series of impressive conincidences throws them together repeatedly on a canvas of events that literally spans the globe.But the plot, and the likability of the characters, is enough to keep me going, particularlygiven that the books reflect thorough historical research about interesting events that aren't particularly well-known anymore."}, {"userName": "Lis", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/2843122-lis", "userReview": "Third in the series, and I still don't love it.The book gives a picture of how precarious the situation in Russia was after the 1917 revolution, with multiple factions and interests. All through the eyes of Jack McColl (English spy, though he mostly has no idea of what his masters actually intend) and Caitlin Harley (American journalist and Bolshevik sympathizer.) But the title suggests we'd see something of Lenin, or at least an overview of what was going on in Russia. It doesn't. This is a view from below, where participants have only a partial and confused view of what is going on."}, {"userName": "Chuck", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/3355947-chuck", "userReview": "I submitted to the lure of this book's cover. A NOVEL OF ESPIONAGE DURING THE FIRST WORLD WAR it said. How was I supposed to resist that? I didn't. We are following a British spy on a sabotage mission in Central Asia and his socialist leaning girlfriend who is a journalist covering activities in Bolshevik Russia. I am a lazy reader. Trying, with little help from the author, to keep up with geographic locations I've never heard of before and a cast of thousands, most with Russian names, overwhelmed me and I put it down without finishing it."}, {"userName": "Vontel", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/22632750-vontel", "userReview": "Actually finished this book a couple of days ago, but system has challenges properly placing books that weren't in the currently reading list prior to putting in dates. I haven't read the previous two books in this series, which is to be four. I found it hard to get into and keep track of the characters and plot until at least half way through the book. This was likely due to not having time to read a few pages at a time for several days. Interesting time in history, both the Russian revolutions and the First World War. Not sure I will read the next book, don't think I could care enough about the characters by the end of this one."}, {"userName": "David", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/11129491-david", "userReview": "Another novel that takes us to an unfamiliar area of the world and a not-so-well known time period, at least for me.I enjoy the author's use of historical characters along with his fictional ones. The off and on again romance between the two protagonists holds my interest and offers the author a way of expanding the scope of the story without straining the reader's credulity.I'm looking forward to the fourth (and final?) volume in the series."}, {"userName": "James Old", "userReviewDate": "Jul 20, 2017", "userURL": "http://www.goodreads.com/user/show/4147907-james-old", "userReview": "This meandering story with a weak plot lacks the wonderful sense of place of much of the author's earlier work. Throughout the book the author seems more concerned with contriving excuses to place the main characters at the scenes of historical events he wants to include than with spending the time needed to develop the characters, setting, and storyline."}, {"userName": "Heather", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/261017-heather", "userReview": "I had a really hard time getting into this. Maybe because literally nothing happened for the first 150 pages - just the two protagonists missing each other and traveling around a lot. It's too bad - it's such an exciting time in history (one of my favorites, actually) - he could have done a lot more with it."}, {"userName": "Ruth Feathers", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/27969446-ruth-feathers", "userReview": "Slow developing."}, {"userName": "Dad", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/21410702-dad", "userReview": "Totally contrived. Too bad because I enjoyed Mr. Downing's other works."}, {"userName": "Bill Whalen", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/47002216-bill-whalen", "userReview": "This book was not as fast moving as the first two books I read."}, {"userName": "Nishant Pappireddi", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/32389451-nishant-pappireddi", "userReview": "Very good historical fiction about the Russian Revolution."}, {"userName": "Lynn Kearney", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/2083891-lynn-kearney", "userReview": "Loved the history ... the romance, not so much."}, {"userName": "Keith Podob", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/46431047-keith-podob", "userReview": "Pointless"}, {"userName": "Bill", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/4719523-bill", "userReview": "Outstanding historical fiction. Can't wait for the conclusion in the next book."}, {"userName": "Marlene", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/1082087-marlene", "userReview": "I enjoy Downing's historical espionage novels. I learn some history and I'm entertained. This was no exception!"}, {"userName": "Timbo", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/62368276-timbo", "userReview": "rubbishpoor storyline, no plot, characters are unbelievably tiresome. hard no, ebook library if you must. too bad, had some promise...i paid for it"}, {"userName": "Judie", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/11974453-judie", "userReview": "Lenin's Roller Coaster is okay but definitely not one of Mr. Downing's best efforts. I'll read the fourth in the series hoping it will reach the same high quality of previous books. The Nook ediiton needs proofreading."}, {"userName": "Viva", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/5639948-viva", "userReview": "2 star = it was ok by GR rating system.Interesting historical fiction set at the time of the Bolshevik revolution. The main story is told at the ground level from an American reporter's point of view. The writing is pretty easy to read and follow. The characters are quite well done and pleasant. The reason I only gave it 2 stars as I found it a bit unfocused. I thought the story followed too many people around. There were a lot of other things going on, things that took away from one main plot line. Maybe the author thought many characters and events added to the story or enhanced it but I thought these other happenings were too long winded. Either way, my interest in the story never reached the point where I enjoyed the book. My interest always approached this point with a character, then the story led somewhere else.I received this book as a free review copy."}, {"userName": "JKSpinkJr", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/51618856-jkspinkjr", "userReview": "Nah..."}], "description": "Winter 1917: As a generation of Europe s young men perish on the Eastern and Western fronts, British spy Jack McColl is assigned a sabotage mission deep in Central Asia, where German influence is strong. As he quickly realizes, the mission only becomes more dangerous the closer he gets to its heart. Meanwhile, the woman Jack loves, Irish-American suffragette journalist Caitlin Hanley, is in Bolshevik Russia, thrilled to have the chance to cover the Revolution. Caitlin knows Moscow is where she is meant to be during this historic event even if she is putting her own life at risk to bear witness.But four years of bloody war have taken their toll on all of Europe, and Jack and Caitlin's relationship may become another casualty. Caitlin's political convictions have always been for progress, feminism, and socialism often diametrically opposed to the conservative goals of the British Empire Jack serves. Up until now, Jack and Caitlin have managed to set aside their allegiances and stay faithful to each other, but the stakes of their affair have risen too high. Can a revolutionary love a spy? And if she does, will it cost one of them their life?", "title": "Lenin's Roller Coaster\n      \n          (Jack McColl #3)", "url": "http://www.goodreads.com/book/show/30724346-lenin-s-roller-coaster", "average": 3.71, "cover": "https://images.gr-assets.com/books/1483418655l/30724346.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/35840.David_Downing", "name": "David Downing"}], "type": ["Historical", "Fiction", "Mystery", "Historical", "Spy Thriller"], "outlinks": ["http://www.goodreads.com/book/show/30724346-lenin-s-roller-coaster", "http://www.goodreads.com/book/show/31850539-lenin-s-roller-coaster", "http://www.goodreads.com/book/show/63729.Zoo_Station", "http://www.goodreads.com/book/show/3285072-silesian-station", "http://www.goodreads.com/book/show/6054413-stettin-station", "http://www.goodreads.com/book/show/8717812-potsdam-station", "http://www.goodreads.com/book/show/12403191-lehrter-station"]}