{"ratings": 597528, "userreviews": [{"userName": "Hippo dari Hongkong", "userReviewDate": "Dec 25, 2007", "userURL": "http://www.goodreads.com/user/show/540865-hippo-dari-hongkong", "userReview": "One of the \"biggest\" book I've ever read, and I remembered Mick Foley's \"warning\" about a big book.\"A big book is like a serious relationship; it requires a commitment. Not only that, but there's no guarantee that you will enjoy it, or that it will have a happy ending. Kind of like going out with a girl, having to spend time every day with her - with absolutely no guarantee of nailing her in the end. No thanks.\"Haha... Well, I took my chances reading this big book. I made my commitment, I spent my time everyday with this book ( about a month ) and what do I get?Happiness and the joy of reading!This book really nailed me, I have my happy ending! Woo Hooo!Thank you very much for the \"warning\" Mister Foley This book is amazing, lengthy in descriptions, compelling storyline and has influenced so many people. Breaks my heart into pieces but somehow put it back together.You want to be a better person after reading this book.\"He said to himself that he really had not suffered enough to deserve such radiant happiness, and he thanked God, in the depths of his soul, for having permitted that he, a miserable man, should be so loved by this innocent being.\" -Jean Valjean about Cossette-"}, {"userName": "Emily May", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Les Miserables can be translated from the French into \"The Miserable Ones\", \"The Wretched\", \"The Poor Ones\", \"The Wretched Poor\" or \"The Victims\". So, as you will have concluded, this is not a happy book, it is the very opposite of fluffy happiness, it is a story about the lowest and darkest parts of French society in the first half of the nineteenth century. Hugo takes the reader on a 1200+ page journey around France and into the lives of criminals, prostitutes, those wasting away under the strain of poverty... and he provides food for thought on commonly-held ideas about the nature of law, justice, love, religion and politics. Not only this, but I can say that not one page of this giant bored me.\nAt the end of the day you're another day older And that's all you can say for the life of the poor\nI feel the need to mention the musical of Les Miserables (and I'm going to incorporate some lyrics into this review) because it's one of the few musicals I have enjoyed and would happily pay to see again. The book is, as is often the case, a much deeper and well-developed version of the same story, but I still recognised many of my favourite scenes from the stage production. I had actually expected the book to be more gentle and subdued than the musical because of the time it was written and to avoid controversy - especially as Hugo's opinion of the French judicial system during this time was made very clear - but this was not the case. Les Miserables is a nasty, gritty, haunting novel that cannot fail to stay with you for a long time whether or not you found the tone of it impressive or just plain distressing.\nI had a dream my life would be So different from this hell I'm living So different now from what it seemed Now life has killed the dream I dreamed.\nIt seems wrong to try and simplify the amazing plot of Les Miserables but I have to somehow fit all that greatness into this little review space. So, the main plot line of this story is about the ex-convict, Jean Valjean, who has been released from prison after serving nineteen years for stealing a loaf of bread and then trying to escape. He comes away from all those years doing hard labour with anger running in his veins, what kind of society sends a man to that disgusting fate for trying to quell his hunger? His thoughts turn to revenge and rebellion - he no longer even wants to try playing by the rules of a country which has done this to him. Until he is shown an act of kindness beyond his imagination by the bishop of the town he has wandered into. The bishop knows how violence and unkindness breeds yet more of the same and he endeavours to break the cycle by offering everything he can in the face of Jean Valjean's anger.\nLovely ladies ready for the call Standing up or lying down or any way at all Bargain prices up against the wall\nTaking the little money and the vast amount of kindness he has been given, Jean Valjean slowly becomes an honest (and wealthy) man who helps those in need. But his new found way of life and the respect he has earned becomes threatened one day when the police officer, Javert, starts to recognise him. But that is just one story being told here, several stories run parallel to one another through this book and begin to entwine more and more as the novel progresses. Another is the story of Fantine and her illegitimate daughter - Cosette. Forced into prostitution in order to feed her child, Fantine is a woman who looks old for her age and no longer has the sparkle of joy in her eye that she enjoyed back when she was allowed to be naive. Cosette, meanwhile, is mistreated by the foster family who agree to take care of her while Fantine \"works\" in the nearby town. Other stories include that of Marius and Eponine, but there are many more.\nThe city goes to bed And I can live inside my head\nThe above lyrics are from one of the musical's best known songs - On My Own - and are sung by one of the most fascinating characters of the novel, Eponine. Eponine's tale is an old one, one of unrequited love but it is far from cheesy. Marius describes her as an \"unhappy soul\" and nothing can be much more accurate. She is a sad, complex and unfortunate character, which I suppose they all are in Les Miserables, but Eponine has a special place in my heart because of several important actions on her part which have always deeply affected me in the musical and now in the book. But she is far from weak, she has been toughened by life, made ugly by poverty, and she is ferociously independent. Yeah, I like her.\nHere they talked of revolution Here it was they lit the flame Here they sang about tomorrow And tomorrow never came.\nThis book is also often considered historical fiction, indeed it is hard to fit it into any one genre, but it does chronicle the events leading up to and including the Paris uprising of 1832 and the messages in the novel include themes of revolution. It is a deeply thoughtful novel that challenges attitudes held at the time in many ways. To use one example, a court of law was ready to sentence an innocent man to life imprisonment because he was slow and uneducated and therefore couldn't speak eloquently in his defence. Perhaps this book is nothing more than an entertaining but dark story that Hugo wrote to grip and shock people, but to me this is a highly political novel that makes many statements about law and justice in France during this period. I find it hard to dismiss Hugo's observations of the treatment of those who are poor and unintelligent as anything other than criticisms of society. But that is just me. I think I can say that you will be affected by this, whether you will thank me for it or not, well, that depends on how easily you tolerate a depressing read. But I've saved my favourite and the most uplifting song for last:\nDo you hear the people sing? Singing a song of angry men? It is the music of a people who will not be slaves again! When the beating of your heart Echoes the beating of the drums There is a life about to start when tomorrow comes!\n[youtube link]"}, {"userName": "Aubrey", "userReviewDate": "Aug 07, 2010", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "Let's say that I could choose a single book with the guarantee that every man, woman, and child would read it. I would not choose my top three favorites, nor would I choose the one whose remnants are permanently inked upon me. I would choose this one. You argue, the length! The time period! The cultural barriers! It's just another long expounding by some old dead white guy whose type has suffocated literature for centuries! Women will be frustrated with poor representation, people who aren't white will be angered by no representation, and everyone will bored to tears! Alright, I see that. Now, let me explain.Human rights have not been perfected. They are as much a work in progress now as they were 150 years ago when this book was first published. If you wish to find the book that gives every variation on the theme of humanity its due, it does not exist, and in all likelihood never will. With that in mind, it is this book that I choose, as while Victor Hugo may have been limited by the era he grew up in, he did a damn good job in dreaming beyond it. He wrote what he knew, but he also wrote what he hoped, and together they form a piece of writing that can mean something to everyone, whatever their life consists of.The book is called 'The Miserables'. I have a feeling that it is the blatant despair that this title provokes that has dissuaded publishers from rendering it into English, instead keeping it in that slightly prettier to the ear French form. It can even be shortened to that chic and oh so clever 'Les Mis', as is the norm whenever the play is discussed. In that light, when you say that truncated phrase it brings to mind not the triumphant book in its majestic entirety, but the abridged version, or perhaps the even more abridged play. You think of the story, but you do not think of the author's ideas, ones that he devotes full chapters to and are just as important to this tome as the characters he has sent running through it. And this is a tragedy.Is tragedy too harsh a word? I don't think so. The book itself is one where tragedy heavily outweighs every other emotional aspect, and reducing it to a pittance of itself is flat out disgraceful. You have countless flavors of human sorrow worked out here: imprisonment, ostracization, slavery, decay of health, decay of morals, decay of life through the brutality of war as well as the slow grind of society’s wheels. There are also the more subtle restrictions on the human spirit, propagated by a firmness of belief that slowly stagnates into constricting bigotry, where humans substitute bias for their reality and confine themselves to a small and mean existence. These confines are more difficult to escape from than the strongest chains, which may bend and break under pressure, whereas prejudices will turn in on themselves and feed on the opposition. It is these barriers that build the barricades, it is these walls that let slip the dogs of war, it is these restrictions that make someone relish petty glories gained in the downfall of their fellow human beings. Where a difference of opinion exists, there will be conflict, and Victor Hugo was intimately familiar with the facets of this violent mechanism.He did not want this for the world. More specifically, he did not want this for his France, his Paris, his creative beacon that teems with contagious culture and ridiculous fashions to this very day, one that can be silly but is often so very, very brave. Like Gavroche the gamin, it thumbs its nose at the world and thinks it slow and stupid, but all the same it loves its fellow human beings, and lives for the times when it can lead them, striding forward towards that thing called Progress. Victor Hugo loved the concept of Progress, and he wished that everyone would love it as well. In his words:\nGo on, philosophers—teach, enlighten, kindle, think aloud, speak up, run joyfully toward broad daylight, fraternize in the public squares, announce the glad tidings, lavish your alphabets, proclaim human rights, sing your Marseillaises, sow enthusiasms, tear off green branches from the oak trees. Make thought a whirlwind.\nHe sent his characters off with this dream of Progress, of finding a life for themselves, of living in a world that bettered itself by the passing day, where the future was not dreary but vibrant and brimming with unlimited potential. Many of them do not succeed. Many fall by the wayside, desiccated by sickness, shot down in wars, slain by grief and the resignation that life is not so much better than death. Some survive in miserable conditions, as restricted by their morality as by a chain around their neck. Some survive only by having stripped their morality as easily as a snake sheds its skin, and in the conditions, who can blame them? The weight of society squeezes the supports, and one is so much lighter and flexible without cumbersome thoughts of being good and kind.In all this sadness and life cut short by miserable conditions long before its time, there is still hope. Victor Hugo illustrated this in his diverging sections as thoroughly as he did in his main story, as hard as that may be to believe. It is true, though. For example, his section on the Battle of Waterloo seems no more than an endless list of casualties, pages of warfare and tactics, and death, so much death. But at the very end, he points out it is not this battle that we remember in so much detail, nor any that came before it. We remember literature. In Hugo’s words:\nNowadays when Waterloo is merely a click of sabers, above Blücher Germany has Goethe, and above Wellington England has Byron.\nAnd what of the other sections? There are many, but two that are particularly powerful in their own subtle ways are the sections on argot and the sewers. Argot is the language of criminals disguising their speech from the ignorant and the all too interested. It is an ever-changing labyrinth of slang, idioms, innuendos, wordplay that whips itself into more contorted evolutions in its effort to escape the law. If this kind of creativity runs rampant on the street, how would it fare if given a warm place to sleep, three meals a day, and a chance to improve its station in life? And the sewers. When first described, they are dirty, desperate, despicable things that do nothing but spread filth and disease and provide a home for the equally depraved. This however was Hugo’s vision of how it had been in the past. In his time, they were clean and meticulous in their function, as well designed as the streets above and ten times as useful. If humans can so improve the lot of that out of sight contraption that carries their shit, imagine what they could do with the parts of life that are meant for open viewing and enjoyment.One last mention. Victor Hugo’s prose has been accused of excessive flouncing about, rambling sentences that quickly devolve into meaningless lists without form or function beyond the enjoyment of their own existence. I say, isn’t that last part enough? Reading his sentences brings to mind a dance, an endless waltz, to a symphony that builds and builds to a final crescendo, for Hugo is very good at taking his countless paragraphs and using them to reach a final glorious message. He could have said it plainly, but it would not have been nearly as powerful without all the exposition; just as his point about the memory of Byron outliving the memory of Waterloo would not have been nearly as striking had he not gone through the motions of describing every minute detail of that terrible battle. To bring the reader to his level of understanding and to make them feel as much as he does about these things, the prose is essential. And frankly, I have yet to come across another author that is as joyous to read as he is, for even while he is going on and on about useless trivia from a time long past, his enthusiasm is contagious. He loved what he wrote about, and he wanted you to love it too, progressing sentences growing more and more triumphant much like the Progress he wished for mankind. An ideal where all, I repeat, all are allowed to flourish and grow, developing their own ideas while more importantly learning to accept those of others, where a stretch of one's limb doesn't require the injury or confinement of another's.So, read the full version, if you can. You’re welcome to the other, shorter versions, but read the full one at least once in your lifetime. Read the introduction even, for in this particular edition there is a wonderful amount of detail about Victor Hugo’s life that brings the book into beautiful focus. The introduction also calls the abridged version insufficient, and says:\nIt is almost impossible to predict the individual detail, the flashing image or human quirk precisely observed, that will burn its way into a reader’s mind for good.\nI cannot agree more.And lastly, for the tl;dr'ers, a summary for what I have said above, which rests within the very first pages of the book:\nSo long as there shall exist, by reason of law and custom, a social condemnation which, in the midst of civilization, artificially creates a hell on earth, and complicates with human fatality a destiny that is divine; so long as the three problems of the century—the degradation of man by the exploitation of his labor, the ruin of woman by starvation, and the atrophy of childhood by physical and spiritual night—are not solved; so long as, in certain regions, social asphyxia shall be possible; in other words, and from a still broader point of view, so long as ignorance and misery remain on earth, there should be a need for books such as this. –Hauteville House, 1862"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I'm in the minority unfortunately. I thought the book was okay. I was hoping it would blow my mind and be a favorite like The Count Of Monte Cristo, as I was afraid of that book too, but alas, it was not =(I might as well put the ole spoilers tag up on here! Oh and even though Jean's name will be changed in the book, I'm sticking with Jean so I won't get all messed up! FANTINE\n1)An Upright Man2) The Fall3) In The Year 18174) To Trust Is Sometimes To Surrender 5) The Descent 6) Javert7) The Champmathieu Affair8) Counter-Stroke\nI worry at times when reading classic books because I feel I won't understand a lot of them. And some I haven't. Come to think of it, I have read books that aren't classic and never understood them and still loved them. I'm strange, I know. I felt the same way when I went into The Count of Monte Cristo. I was so worried I wouldn't get it enough to like it and uh, it's one of my favorite books to date! Les Mis has given me some trouble during the first of the book. I have felt like I'm not going to like it too much and then there would be parts that I just loved. So we shall see when I finish it awhile from now. I really liked M. Myriel, he was a very nice man. I mean just because he's a man of the cloth doesn't mean he will be nice but he was and I loved him. It was sad when he died. Jean Valjean was a prisoner of 19 years for stealing a loaf of bread to try to feed his sister and her seven children. They don't care if people or kids starve to death and going to jail for 19 years. Wow! Jean only heard of news one time of his sister and the youngest child working and going to school. No one knows what became of the rest of the children. After the 19 years Jean was let out on parole. He couldn't find a place to take him in for the night and feed him. He had money but they didn't want a criminal in their inns. But he came upon M. Myriel who was a Bishop at the church. (if I have it all correctly) He let Jean have a bed for the first time in years, gave him food and was very kind to him. In turn, Jean stole away in the night with the silverware. But being the kind man M. Myriel was he didn't press charges when the coppers dragged Jean back. He did tell something to Jean that made him change his ways. \nThe bishop approached him and said, in a low voice. \"Do not forget, ever, that you have promised me to use this silver to become an honest man. Jean Valjean, who had no recollection of any such promise, stood dumbfounded. The bishop had stressed these words as he spoke them. He continued, solemnly, \"Jean Valjean, my brother, you no longer belong to evil, but to good. It is your soul I am buying from you. I withdraw it from dark thoughts and from the spirit of perdition, and I give it to God!\"\nJean was a changed man after this and it was good. Next is the story of Fantine. This broke my heart! Fantine and some of her so called friends had suitors and they all thought they were going to be together and get married, all of the wonderful things. But it was not so. The men left the woman with nothing. Fantine was left with child and her so called friends all went separate ways. Fantine had to leave little Cosette at a home until she got enough money to get her. The home was a fake and they were rude and horrible people. Fantine sent them money to keep Cosette. Year after year she sent money. She worked for Jean who had a different name and owned a business. Sadly for Fantine she was fired because of some jerk workers and Jean never knew about it. Fantine was forced to sale her hair, some of her teeth and become a whore so Cosette would be okay. One day Fantine was taken to jail for scratching a jerk man. Jean found her there and took her to the hospital. He saved her from being put in prison, but unfortunately she had a disease and would not live. He made a promise to find Cosette. It was so very sad that she had to live the life she did and never see her daughter ever again. She was thrown away........ COSETTE\n1) Waterloo2) The Ship Orion3) Fulfillment Of The Promise Made To The Departed4) The Old Gorbeau House5) A Dark Chase Requires A Silent Hound6) Petit-Picpus7) Cemeteries Take What Is Given Them\nSoooooooooooooooo, I wasn't feeling this one as much until it got to Jean & Cosette. Jean found Cosette carrying a heavy water bucket and asked her many questions. He found out she was the girl she promised Fantine he would take care of, her daughter. Jean watched how the couple were treating Cosette because he was staying at their Inn. He as livid and so was I at the way Cosette was treated. Jean told them he was taking her away with him, paid them money (overcharged) for his stay there. Oh, and I loved when he went out and bought her a most expensive doll for her alone because only the owners two daughters got toys to play with, it was so bitter sweet. They stayed on the run for a time. Jean was always on the run on and off as he's always wanted. He can never shake that freaking, Javert. Jean and Cosette ending up staying with a man Jean had saved awhile back. Jean worked in the little garden. Jean, who had lost all thoughts of loving anything when he was in prison. He was a hard man with no love, no anything. But then he felt a spark that grew and grew for Cosette, his daughter, for that's what she became. So sweet. \nHis whole heart melted in gratitude and he loved more and more. Several years went by like this. Cosette was growing up.\nUnfortunately, I'm not liking this book as much as I would have hoped. I love the parts with Jean and Cosette and hope that there will be more and I will at least love it just enough. *The rest of the sections and books in the book I was reading.*Marius\n1) Paris Atomized2) The Grand Bourgeois3) The Grandfather And The Grandson4) The Friends Of The ABC5) The Excellence Of Misfortune6) The Conjunction of Two Stars7) Patron-Minette8) The Noxious Poor\nSaint-Denis And Idyll Of The Rue Plumet\n1) A Few Pages Of History2) Eponine3) The House On The Rue Plumet4) Aid From Below Or From Above 5) An End Unlike The Beginning6) Little Gavroche7) Argot8) Enchantments And Desolations9) Where Are They Going? 10) June 5, 183211) The Atom Fraternizes With The Hurricane 12) Corinth13) Marius Enters The Shadow 14) The Grandeur Of Despair 15) The Rue De L'Homme-Arme\nJean Valjean\n1) War Between Four Walls 2) The Intestine Of Leviathan3) Much, But Soul4) Javert Off The Track5) Grandson And Grandfather6) The White Night7) The Last Drop In The Chalice 8) The Twilight Waning9) Supreme Shadow, Supreme Dawn\nAfterwordSelected BibliographyThe story continues on with Cosette growing up, finding Marius and love. A revolution. Javert still on Jean's trail. The marriage of Cosette and Marius. And the deaths of Javert and Jean. The book did bring some tears to my eyes. It was really sweet with Cosette and Marius. They were made for each other. Even though Jean wasn't too happy about it, he did save Marius in the end so he would live for Cosette. Javert finally gave up. Jean had saved him from death and Javert threatened once again to kill him, but alas it was his own life he took. He was just tired.....Jean was on his deathbed when Cosette and Marius found him. He was so happy to see his daughter and Marius. Jean had an angel watching over him and he went peacefully. Jean, you were a most wonderful man! \nThe night was starless and very dark. Without any doubt, in the gloom, some mighty angel was standing, with outstretched wings, waiting for the soul.\nMY BLOG: Melissa Martin's Reading List"}, {"userName": "Michael", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "This will be another review-as-I-go!First, a thank you to Rachel for recommending the Fahnestock and MacAfee translation, which is wonderful so far!Next, a question: Why have I been so drawn lately to these 1,500 page 19th century behemoths? War and Peace, The Brothers Karamazov, Crime and Punishment, and now this. Am I just a glutton for punishment? Or just showing off? I hope not. When I think about it, I think it has to do with the moral scope and depth of the work and the way these books really wear their morality on their sleeves. They're complex, yes, but they're not hiding their morality behind some veneer of \"show, don't tell.\" They're not afraid to plumb the moral depths of the societies they depict, and I think, when I look around at the society I inhabit, that I hunger for more of this. So here I have it.Hugo certainly takes his time setting up the main action, with a long introductory section on the Bishop (Myriel) before we get to the main character, Jean Valjean. But for some reason it works, so that by the time Valjean arrives on the scene, we have a sense of the place he comes to and the reactions he'll face. Even then, Myriel stands apart from the others in his generosity and kindness, such that the other characters don't even comprehend his attitude. Which of course says as much about contemporary attitudes toward ex-convicts as it does about Myriel himself.Then the scene shifts, and we're treated to a lighthearted section of youthful fun, but there's a dark undercurrent here too--the illegitimate child born to Fantine, the child named Cosette, who's given up to another family while Fantine finds work and who soon transforms from a happy toddler to a bedraggled house servant. Oh, the heartbreak and misery we experience when she's described sweeping the sidewalk in the cold, dressed only in rags.The scene then shifts to follow Fantine, and we see her gradual decline as she tried ever more desperately to raise money to send the family housing her daughter. Eventually she sells her two front teeth and becomes a \"woman of the streets,\" which is where she has a run-in with the police officer Javert--a character reminiscent of Angelo from Shakespeare's Measure for Measure, a stern agent of the law whose facade of righteousness conceals much. Luckily for Fantine, the mayor intercedes on her behalf.Then the two parts of the story so far--that of Valjean and that of Fantine--come together, when it's revealed that the mayor is himself Valjean, years later. Oh, the plot thickens, because Javert was an officer who knew and tried to find Valjean years ago, and suddenly declares to the mayor that Valjean was found in the distant town of Arras and will be tried. What does Valjean do? Continue to conceal his identity so that he may do more good, knowing that someone else will suffer in his place? Or declare himself and lose everything? It's quite a magnificent dramatic moment.And the drama really picks up pace when Valjean rides to Arras to the trial. Will he get there on time? And then there he is, in the courtroom: will he reveal himself? And when he does: will he be arrested right away? How can he escape? It's pure melodrama, in a way, yet fused to the deep moral quandary in the character that makes it irresistible. One of the techniques I see Hugo employing is to switch storylines suddenly, leaving the reader with no idea how they relate, until at the very end of the storyline, he reveals it: Aha! When Valjean is on his way to Cosette, Hugo makes a huge detour into the history of Waterloo and Napoleon's downfall, and you wonder for pages and pages what this has to do with the story, and then at the very end, we see that one of the haggard men stealing from corpses is the father of the family keeping Cosette, and that another officer, who thinks the haggard man has saved him, declares himself in his debt. You can feel Hugo in those lines lowering the boom for more drama to come.Hugo is really setting things up now. We get Valjean and Cosette finally ensconced in Paris, and then the scene shifts to examine a new character, Marius, the son of Pontmercy (who thought the father of the family keeping Cosette saved him). Again, you can see the giant cogs in motion, setting up the eventual collision between all these forces. Just an awesome array of characters and plot points, and I can't wait to see how it's going to come together!Not surprisingly, Marius and Cosette grow up and grow fond of each other through random meetings in Paris. If I had one critique of this book, it's that so much depends on these random meetings of the characters. They keep bumping into each other, as if there were only a few people in the city. But this is a minor critique, and the randomness might even be intentional, making the point that much of life is similarly guided by chance encounters.Now the political scene intervenes: the uprising. One of the saddest characters in the book is Epinone, the daughter of the horrible innkeeper, who acts more than once to keep Marius out of danger. She's clearly in love with him, but she's been so deformed by poverty and the demands of her harsh parents that she feels unable to express that. Anyway, the uprising is where she performs her ultimate act of bravery and self-sacrifice, and it nearly brought tears to my eyes.I can't really do the ending any justice through summary. Let me just say that Hugo brings this entire monumental project together masterfully. If Modernism is defined by ironic detachment, this is the ultimate pre-modern work. It's earnest, political, passionate, encyclopedic, and moralistic in the very best sense. Hugo clearly has a point he's trying to make about human goodness, and I deeply appreciate the project. To say it's moved me is a terrific understatement. I haven't been able to stop thinking about it and its characters since finishing reading a couple of days ago. This is an epic and almost mythical work, and it stands as one of the best novels I've read."}, {"userName": "Fabian", "userReviewDate": "Feb 16, 2015", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "I chose to read the hefty Victor Hugo classic for my 30th birthday, &, let me tell you, the experience was One Biiiig Bitch. I mean, why EVEN go to the 200 + year old text when the Broadway musical exists! THAT work of art exudes all beauty and majesty in one continuous song that unites the characters through time; ultimately giving us a true theme, or feeling of genuine victory over adversity. The plot, one gorgeous telenovela of a story, replete with jailbreaks, insurrections, betrayals, war, calamities multiplied & order restored is, in short, too much muchness for one reader to possibly occupy himself with.This is the longest novel I have ever read (probably Don Quixote, which took me an entire month to read, is the closest second). And as such, it is difficult--a staggering activity indeed--to maintain order in its review, much less in the colossus text itself that's just very disordered, odd, beautiful-but-not-always; it is a mixture (an irritating one at that, & less than a boost toward modernism) of myriad tones & paces, a gargantuan monster from the abysmal depths of time: a list of lists, basically; a lexicon in Everything French Revolution.What is the purpose of so many compilation of details to make a heap of facts that, quite frankly, fail to make either a juicy romance or gory history. It's infuriating because it takes up so much of your time. And, bottom line, the characters, even Jean Valjean the lament-filled hero who feels guilt palpably like the feel of the guillotine, is a beacon that illuminates but also dis-illusions. (...and Cosette is a ninny, and Fantine gets duped awful by a group of boys and girls, and Javert is a true mystery that ends up having less to do with our story than other less famous villains like M. Thenardier...)It is basic Law to read this, so I did. It has not aged well, dudes, fur reels. Like some expensive wine that got rancid. A French one.&, just because I am very generous, these here are the top four best parts (AKA the most heartwarming) in all of Les Mis., if you wanted to know, followed by the four worst:1) How Valjean gets Cosette from the clutches of the Thenardiers (the dude simply won't let go!)2) Gavroche's taking-in of the two Thenardier \"brats\"3) Marius' self-inflicted poverty4) the Bishop's storyThe worst are these girthy diatribes that provoke (gasp!) some paragraph skippage:1) on the Sewers2) on the slang3) on the Streets of Paris4) on the barriacades, which reminds the reader that so many French pre-Revolutionary factoids withholds reader's pleasure, somewhat barricading the avid reader's truest delight."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Jan 17, 2014", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "I saw the movie version of this before reading it and I was utterly shook by the powerful nature of the story. When I read it I hoped for the same experience, instead I had one more powerful. In life there are few truly great men: there are few men that are truly and incorruptibly good. Jean Valjean is such a man; he is a paragon of goodliness: he is a superb character. At the beginning of the novel he sacrifices everything: he steals a loaf of bread knowing full well of the consequences. He risks his freedom in order to save his starving family; he risks his mortality and his morality: he risks everything. He is a truly selfless man, a great man. And what are the consequences for trying to save a starving boy? What is the justice of the land? Imprisonment. Servitude. Pure Corruption. In this the author captures social injustice in its most brutal form; he shows the foolishness of unbending laws, of a system that refuses to open its eyes, and how the common man will always suffer under the yolk of the powerful. But, somehow, Valjean just about retains his decency and his humanity. Somehow in the face of sadistic ruling, he manages to remain Valjean; he even manages to better himself and improve the world around him. Yes, he makes a mistake that leads to the death of an innocent; yes, he was responsible for the snuffing of the life he ignored. However, he redeems himself in a truly extraordinary way, and eventually pays an even greater sacrifice. The world needs more men like Valjean.Then if that wasn’t enough, Valjean even offers his nemesis forgiveness. He sees Javert for the product of society that he is; he looks at him and only sees pity rather than hatred, which would have been a much easier emotion to experience. Valjean does what few men would have the strength to do, and in the process shows his true inner-strength. Javert was fully responsible for his actions. He is a pitiable character. To his cold, singular, narrow-minded, law based logic, Valjean was a simple criminal. Nothing more, nothing less. Javert cannot look beyond the surface. He dedicated his life to preventing this villain form getting away. In this, he is as much a victim as Valjean. When he eventually realises the true errors of his ways, he is broken. He is no more. Javert is not the real villain: it is society. And this is only one aspect of this superb novel. Javert and Valjean are not the only victims of this novel. Pushed aside, forgotten about, is the miserable Fantine. She represents the tragic state of women’s place in such a society. No one cares about her. She is just another woman in the street, another countless victim of misrule: someone to be trampled over. But, Valjean shows that life isn’t completely dark. From such corruption, a heart can remain true to itself and continue beating."}, {"userName": "María", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/17754092-mar-a", "userReview": "Jamás he leído nada igual. Ni lo haré. Ya sé que eso suena exagerado, pero sé perfectamente que no leeré nada tan bueno de nuevo. Los Miserables está a un nivel que solo Victor Hugo puede llegar a tocar."}, {"userName": "Lisa", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "What makes a favourite book?In this case, I will have to say: one single character that broke my heart and shaped my idealism and stirred my anger: Gavroche Thénardier. \"Si l'on demandait à la grande et énorme ville : Qu'est-ce que c'est que cela ? elle répondrait : C'est mon petit.\" One of those street children that see and hear more during their childhood than most people ever experience, who carry pain and neglect with them on their daily adventures to survive in a hostile, careless environment, and still manage to find reasons to love and to live, he made me want to work with children when I was myself still only a teenager. I also wept with his sister Éponine, and with Cosette's mother Fantine, and I followed in Gavroche's tracks through the drama of Parisian 19th century history. His fight became my cause.The main characters, Jean Valjean and his adoptive daughter Cosette, left me rather cold by contrast, as they seemed too perfectly good, too beautiful, too physically strong and mentally one-dimensional to be shaped from real life, and I am not sure Les Misérables would have ranged among my most beloved books, had the novel been slimmed down to their specific plot. The story line of Javert, whose fanatic sense of justice reminds me of later Communist anti-human radicalism, was what made Jean Valjean interesting as a character, rather than his own personality. Would he be caught or not?I will also have to confess that I would have loved to see the poor, abused Éponine find happiness with Marius, as I truly couldn't find anything exciting in the doll Cosette that Jean Valjean had raised. Éponine had the potential to become a bright young woman, had she not grown up with comically bad parents in severe poverty:\"On sentait bien qu’avec d’autres conditions d’éducation et de destinée, l’allure gaie et libre de cette jeune fille eût pu être quelque chose de doux et de charmant.\" The neglected children of Paris - that is what Les Misérables means to me. Ever since I first read the novel during my adolescence, it has accompanied me on my adventures. Gavroche comes to my mind whenever I read about neglected children in the big cities of the world, and now that my own children read the story, and play the soundtrack of the Musical on the piano and sing along with all the pathos they remember from seeing it performed at Broadway in New York, I feel the old shiver down my spine, and I know that one of the sources of my energy as a mother and teacher is to be found in the early feeling of indignation and tenderness towards a child that deserved a better life than he got. He deserved a future. I still believe in that simple idealist dream: each child deserves a future.\"Do you hear the people sing?Singing a song of angry men?It is the music of a peopleWho will not be slaves again!When the beating of your heartEchoes the beating of the drumsThere is a life about to startWhen tomorrow comes!\""}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "873.\tLes Misérables, Victor Hugoعنوانها: ژان والژان؛ بینوایان؛ نویسنده: ویکتور هوگو؛ انتشاراتیها: (مطبعه ایران، جاویدان، بدرقه جاویدان، امیرکبیر ، توسن، نگته، گنینه، فنون، قصه جهان نما، سمیر، آسو، افق، هفت سنگ، پیروز، سکه، اسب سفید، سروش، مشر قره، دبیر، گاج، پارسه، آبان مهر، سپیده، معراجی، توسن، فنون، بنیاد) ادبیات فرانسه؛ تاریخ نخستین خوانش: در ماه مارس سال 1966 میلادی؛ آخرین بار: در ماه ژوئن سال 2006 میلادیعنوان: بینوایان؛ نویسنده: ویکتور هوگو؛ مترجم: حسینقلی مستعان؛ تهران، مطبعه ایران پاورقی، 1310، سپس به صورت کتاب در ده جلد و سپس در پنج جلد؛ چاپ دیگر: تهران، جاویدان، 1331، در دو جلد، چاپ دیگر: تهران، امیرکبیر، 1349؛ در دو جلد 1647 ص؛ چاپ دیگر 1363؛ چاپ چهاردهم 1370؛ شانزدهم 1382؛ شابک دوره: 9640004189؛ هفدهم 1384؛ هجدهم 1387؛ شابک دوره دوجلدی: 9789640004180؛ نوزدهم 1388؛ بیستم 1390؛ بیست و سوم 1391؛ بیست و چهارم 1392؛ چاپ دیگر: تهران، بدرقه جاویدان، 1386، در دو جلد، موضوع: داستانهای نویسندگان فرانسوی - قرن 19 ممترجمین دیگر متن کامل: نسرین تولایی و ناهید ملکوتی، تهران، نگاه، 1393، در دو جلد، شابک دوره: 9789643519568؛ عنایت الله شکیباپور در دو جلد، چاپ دیگر: تهران، گنینه، 1362، در دو جلد؛ چاپ دیگر: تهران، فنون، 1368، در دو جلد؛ چاپ دیگر: تهران، قصه جهان نما 1380، در دو جلد و 962 ص؛ کیومرث پارسای، تهران، سمیر، 1389؛ در پنج جلد، شابک دوره: 9789642200474؛ محمد مجلسی، تهران، نشر دنیای نو، 1380، در چهار جلد (جلد 1 - فانتین، جلد 2 - فانتین، جلد 3 - ماریوس، جلد 4 - ژان والژان)؛ چاپ سوم 1390؛ مرضیه صادقی زاده، تهران، آسو، 1395، در دو جلد؛ شابک دوره: 9786007228982؛ مینا حسینی، تهران، فراروی، 1393، در دو جلد، شابک دوره: 9786005947434؛ محسن سلیمانی، تهران، افق، 1388، در دو جلد؛ چاپ دوم 1389؛ چاپ ششم 1392؛ وحیده شکری، گرگان، هفت سنگ، 1395، در دو جلد؛مترجمین دیگر متن خلاصه شده: گیورگیس آقاسی، تهران، پیروز، 1342، در 335 ص، چاپ دیگر: تهران، سکه، 1362، در 335 ص؛ فریدون کار، اسب سفید، 1345، در 480 ص؛ محمدباقر پیروزی، در 340 ص، سروش، 1368؛ بهروز غریب پور، نشر قره، 1385، در 208 ص؛ شابک: 9643415155؛ مهدی علوی، تهران، دبیر، در 112 ص؛ چاپ سوم 1395؛ شایسته ابراهیمی، تهران، گاج، 1395، در 136 ص؛ صدف محسنی، تهران، پارسه، 1395، در 399 ص؛ مصطفی جمشیدی، امیرکبیر از ترجمه مستعان، در 129 ص؛ سبحان یاسی پور، آبان مهر، 1395، در 140 ص؛ اسماعیل عباسی، تهران، سپیده، در 47 ص؛ الهه تیمورتاش، تهران، سپیده، 1368، در 248 ص؛ چاپ دوم 1370؛ شهاب، تهران، معراجی، در 184 ص؛ امیر اسماعیلی، تهران، توسن، 1362؛ در 237 ص؛ عنایت الله شکیبا پور، تهران، فنون، 1368، در 384 ص؛ ابراهیم رها، 1382، در 64 ص؛ ابراهیم زنجانی با عنوان ژان والژان؛ ذبیح الله منصوری، تهران، بنیاد، 1362؛ در 177 ص؛ چاپ سوم 1370؛ نمیدانم. یادم نمانده این کتاب را چندبار خوانده ام. در کودکی نسخه های کوتاه شده، و خلاصه ی داستان را...، و آخرین بار چند سال پیش بود، باز هم ترجمه حسینعلی مستعان را خواندم. اگر بگویم مدهوش شدم، راه به سوی گزافه نبرده ام. ویکتور هوگو بزرگترین شاعر فرانسه در قرن نوزدهم میلادی و شاید بیش از همین جمله باشد که بنوشتم. ایشان با بزرگواری، با انقلابی بزرگ زندگی کردند، و عمری طول کشید تا بینوایان را نوشتند. یادم مانده جمله ای که نمیخواهم بنویسم. بیشترش شاید از یادم رفته باشد. نیز تا فراموش نکرده ام نوشته باشم که همین داستان بینوایان نیز همچون بیشتر شاهکارهای جهان چند لایه دارد. امروز دیدم یکی از لایه هایش را جناب مهدی به بزرگواری بگشوده است. نقل از نوشتار مهدی: ژان والژان، و «ژاور»، دو شخصیت رمان، هر دو خداباور هستند؛ اما خدایی که هر یک میپرستد، غیر از خدای دیگری ست. «ژان والژان» مردی ست که بیست سال از عمرش را در زندان با اعمال شاقه بگذرانده، مردی ست که قانون او را مجازات کرده، و پس از آن که دوره ی مجازاتش تمام شده، جامعه او را طرد نموده. در این حال است، که اسقف «میریل» او را مییابد، و درک میکند که والژان، نیاز به امید دارد. نیاز به بازگشت دارد. پس به او امید میدهد و برش میگرداند. از آن پس، «ژان والژان» مظهر خدای مسیحی میشود. مردی که در باقیمانده ی عمرش، کاری جز عشق ورزیدن، حتی به کسانی که از آنها بیزار است، نمیکند. در برابر او، «ژاور» مردی ست که به گفته ی خود، در تمام عمر، حتی یک قانون را هم نشکسته است. مردی ست که تمام هم و غمش اجرای قانون است. تا جایی که آنگاه که خود مرتکب جرمی میشود، با سرافکندگی خود را معرفی میکند، تا به سزای کارهایش برسد. این دو شخصیت، یکی نماد خدای مسیحی، و آن دیگری نماد خدای یهودی ست، بارها باهم درگیر میشوند. یکی از درگیریها، بر سر «فانتین» است. زنی روسپی که شاید شباهتی به «مریم مجدلیه» داشته باشد. «ژاور» بی آن که به گریه زاری «فانتین» گوش دهد، و یا به دختر کوچک او «کوزت»، اهمیتی بدهد، او را محکوم به شش ماه زندان میکند؛ اما «والژان»، با اینکه «فانتین» به او اهانت میکند، و به رویش، تف میاندازد، دستور آزادی او را صادر میکند. یکی، هیچ نرمشی در برابر قانون شکنی نشان نمیدهد، و آن دیگری، آغوشش را برای گناهکار میگشاید. یکی دیگر از تنشها، در پایان داستان است. جایی که «والژان»، آغوش خود را برای خود «ژاور» میگشاید. با اینکه توانایی کشتن «ژاور» را دارد، او را زنده رها میکند. ژاور نمیتواند این رفتار را تاب آورد، و درک کند، گیج میشود. او که تا آندم همه چیز را با دیدی انعطاف ناپذیر میدید، دچار تزلزل میشود. میبیند که مردی قانون شکن، توانسته مرد بزرگی شود. میبیند که هم بازداشت کردن آن مرد اشتباه است و هم بازداشت نکردنش بشکستن قانون است. نهایتاً، نمیتواند دوگانگی را تاب آورد و بپذیرد، خود را در رودخانه ی «سن» میاندازد، و خودکشی میکند و اینگونه، از دیدگاه ویکتور هوگو، خدای یهودیت میمیرد و خدای مسیحیت زنده و باقی میماند. ا. شربیانی"}, {"userName": "Miriam", "userReviewDate": "Aug 08, 2007", "userURL": "http://www.goodreads.com/user/show/262139-miriam", "userReview": "This is without question one of the most beautifully written novels I've ever read. Jean Valjean is quite possibly the most complex and compelling character you will meet in a work of literature of this magnitude, and the lives and personalities of the secondary characters are interwoven into subplots that make it almost an easy thing to get through the 1400+ pages of this book. I read the novel after seeing -- and falling madly in love with -- the musical, and this is one of the rare cases in which familiarity with one helped me to appreciate the other more; naturally the musical had to cut out and/or alter significant portions of the novel's plot in order to fit a reasonable time frame, but even as I read the novel and discovered all the things that were left out of the musical, my respect for the artistic choices made for the latter were increased tenfold. Of course the characters were portrayed in significantly richer detail in the novel, Fantine and Marius in particular. The adult Cosette, however, is singularly droll in both the book and the musical, paling in comparison to the character of Eponine in both; Hugo seeks to set Cosette up as the perfect angelic virgin, and in doing so, he makes her both unrealistic and mind-numbingly boring -- this is my only complaint about the book, other than the ways in which Hugo sometimes deals with women in general, though you have to consider that he was, to some extent, a product of the times.Hugo does shoot himself in the foot in one way; his plots are so absorbing that I found myself temporarily skipping over chapters-worth of exquisite prose to find out what happened next, as Hugo had a nasty little habit of setting up wonderfully tense scenes full of suspense and intrigue, only to present you with something like the history of the French sewer system on the next page. But his descriptions are every bit as rich and wonderful as his action plots; my favorite line from the novel is, \"Every bird that flies has a shred of the infinite in its claw,\" which can be found in the middle of a breathtaking paragraph praising the complexities of the natural world, but I cannot for the life of me remember what that was supposed to relate to in terms of the actual storyline of the book.This book is not to be missed. But if you have too short an attention span, then at the very least, see the musical, on Broadway or better if you can. There is, after all, a very good reason why they call it the greatest musical of all time."}, {"userName": "Jonathan Terrington", "userReviewDate": "Sep 17, 2012", "userURL": "http://www.goodreads.com/user/show/6313408-jonathan-terrington", "userReview": "\"We can only suppose that its new life as a musical - and what an appropriate fate for that most operatic novelist - will help to bring Les Misérables to the attention of a new generation of readers, reminding them perhaps that the abuses Hugo catalogues are still alive elsewhere, awaiting their own chroniclers in the brave new world of the twenty first century.\" - Peter Washington, IntroductionThere are few novels which one can consider true masterpieces and among the greatest pieces of writing ever written. The Lord of the Rings, The Chronicles of Narnia, Alice in Wonderland, Peter Pan, The Complete Sherlock Holmes and Complete Stories and Poems number among these as examples. However there are some momentous epics in terms of themes such as Jonathan Strange & Mr Norrell and this great work: Les Misérables, which despite their length are well worth the investment.Les Misérables, as a novel, is far grander than its worthy adaptations (of which the 1998 film with Liam Neeson and the stageplay are the finer works). It is not the simple tale of Jean Valjean escaping from Inspector Javert. It is so much more. It is: a love story, the love story of France as well as a romance; a tragedy, a catalogue of the miserable citizens of historic France; a historical chronicle, a mapping out of the cultural landscape of one image of time; above all it is a literary masterpiece.Victor Hugo may have his failings in this novel. At times he falls into pompous verbosity, rambling on about subjects which appear to lack relevance to the story. However, what he has achieved in this novel is nothing short of remarkable. This is literature at its finest, a book recording the suffering and beauty of humanity and reflecting upon it in language which is both complex and simple despite translation. Speaking of translation, this version by Charles E. Wilbour appears quite excellent (if old fashioned). And therefore anyone interested in reading this work is encouraged to get a true unabridged version. Reading the abridged versions will only ruin the charm of the story and perhaps your understanding of the story itself. This review has been moved to my site, click this link to read the rest!"}, {"userName": "Dana Ilie", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/21690081-dana-ilie", "userReview": "The experience of reading Les Miserables is akin to that of any lengthy novel. For hundreds of pages you’ll be hooked, dazzled, unable to put it down. Alt autor vinovat pentru pasiunea mea de a citi. Nu citesc pentru ca e la moda, ca sa par boema sau ca sa devin mai populara, citesc din pasiune , pentru ca imi plac lumile si povestile create de oameni talentati . Nu ma ascund de realitate in spatele unei cari, doar traiesc povestea alaturi de autor si personaje.Nu cred ca e cazul sa va spun ca e o poveste trista, Coperta pe care am ales-o ilustreaza cel mai bine ce am simtit cand am citit cartea. Banuiesc ca nimeni nu priveste poza de mai sus si se simte fericit, sau se tavaleste de ras…. Eu am citit varianta cu 5 volume, nu-mi aduc aminte editura. Dupa ce citesti cartea iti dai seama de ce Victor Hugo se afla printre monstrii sacrii ai literaturii. O poveste luuuunga , cu multe personaje, dar doar 5-6 centrale (toata lumea a auzit de : Jean Valjean, Cosette, Gavroche), dar nu simti ca citesti sute de pagini. Are fragmente in care te plictiseste cu detaliile istorice legate de generali, de bataliile date de Napoleon, care daca sari peste ele nu iti vaduveste cu nimic firul narativ al povesti. Spre rusinea mea eu saream peste ele, imi place istoria , dar fragmentele respective ma adormeau…..Este o capodopera pe care o recomand tuturor deoarece simt ca eram mult mai saraca daca nu o citeam. Asa cum am autori preferati ( printre care si Hugo) am si un top 10 carti pe care le-as recomanda fara sa clipesc. Chiar nu pot sa povestesc nici un pic din carte , este mult prea complexa, mult prea bine scrisa, si de-a dreptul fascinanta.In linii mari pot spune ca vom gasi saracie, nedreptate, fericirea luata din ajutorarea semenilor si din bucuria de a avea copii pentru care sa faci orice sacrificiu. Lupta cu saracia, lupta covarsitoare cu eticheta pusa de societate, fuga permanenta de oamenii legii, privirea peste umar la orice pas. Sa anticipezi miscarile facute de posibilii dusmani, si tot chinul acesta o viata de om. Simti o apasare , tristete, dar in acelas timp nu poti sa nu speri ca totul se va colora in culori mai vii. Cu fiecare situatie nefericita sau de-a dreptul revoltatoare te simti tot mai invaluit in poveste si te apropii de personaje , dorind sa le oferi confort si siguranta. Citind imi lasa impresia sincera ca daca citesc incontinuare ajut personajul aflat intr-o situatie periculoasa sa scape. Nu puteam sa las cartea din mana pana nu se afla intr-un loc sigur / situatie fara pericole.Destinele personajelor se intersecteaza pe parcursul cartii, iar dupa mai multi ani cand se reintalnesc , nici nu au habar cum si-au influentat uniialtora viata.Spre sfarsit apare si frumoasa poveste de dragoste mult asteptata. Doi adolescenti frumosi si o dragoste pura."}, {"userName": "Mohammed Arabey", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "في عيد الحب قررت كتابة مقال إخترنا لك و إختيار سبعة أعمال أدبية و فنية عن توليفات من العشق من فرنسابالتأكيد أول ما سيخطر ببالك هو “كم سيكون هذا المقال تقليديا، لإنه عيد الحب وفرنسا مليئة بقصص العشق والهوي, ياللتقليدية !! ..لن ينقص المقال سوي موسيقي الفيلم الفرنسي رجل وامرأة الشهيرة”بصراحة، إذا لم تخني الذاكرة فالموسيقي موجودة بالفعل بالمقال...ولكن أختياري اﻷول علي اﻷقل لم يكن تقليديابؤساء فيكتور هوجو، والتي سعدت لقراءة مقتطفات من ترجمتها العربية لحافظ إبراهيم، وبالطبع مشاهدة الفيلم الملحمي في 2012أتمني أن إختيارتنا بمقال  إخترنا لك:سبع توليفات من العشق الفرنسي تحوز علي أعجابكم، برغم تقليديتهاوحتي ريفيو كامل للروايةمحمد العربيفي 14 فبراير 2015"}, {"userName": "Duane", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "I'm obsessed with everything Les Miserables. The novel, the musical, the movies, especially the latest adaptation of the musical. I actually saw the musical before I ever read the novel. It's musical score is second to none and yes I have been known to shed tears during the performance.The novel is epic, a timeless classic and described by some as \"the greatest story ever told\". I don't know about that but it is one of the most detailed and intricately constructed novels I have ever read. The length can be daunting to some readers but go slow, read a little each day. After a time you won't put it down. As a book lover you want to have this one on your resume of books read."}, {"userName": "Foad", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "دو خدا، دو خداباورمقدمهاول: علی شریعتی در \"سیمای محمد\" می گوید تصویری که تورات از خدا ارائه می دهد با تصویری که انجیل از او ترسیم می کند، متفاوت است.\"یَهوَه\" یهود، خدایی قهار است که بر فراز عرش نشسته، تخته سنگی غول پیکر بالای سر بنی اسرائیل نگه می دارد و می گوید: \"به خدایی من اقرار کنید!\"بزرگترین نمود یهوه، ده فرمانی است که بر موسی نازل می کند. خدای یهود، خدای شریعت است. قانون وضع می کند و قانون شکن را مجازات می کند و معروف ترین قانون او، این که \"چشم در برابر چشم!\"\"پدر آسمانی\" مسیحیت، خدایی مهربان است. فرزندش را می فرستد تا بار گناهان آدمیان را به دوش بکشد. اگر از گله ای یک بره جدا شود و در ورطه ی هلاک بیفتد، نود و نه گوسفند را رها می کند و به دنبال بره ی گمگشته می رود.خدای مسیحیت، بخشایشگر است و معروف ترین موعظه ی او، این که \"گونه ی دیگر خود را پیش بیاور!\"دوم: داستایفسکی در قسمتی از \"برادران کارامازوف\" گفت و گویی را می آورد. در یک طرف، \"ایوان کارامازوف\" برادر وسطی است که مقاله ای نوشته و در آن گفته که ملکوت موعود مسیحیت، محقق نمی شود مگر بعد از این که حکومت کلیسا برقرار شود. در طرف دیگر، راهب روشن ضمیری است که می گوید حکومت، نیاز به قانون محکم دارد و قانون محکم، نیاز به مجازات قانون شکن. ولی وقتی قانون شکن مجازات شد و جامعه او را طرد کرد، نیاز به جایی است که پناهش دهد، باورش کند، توبه اش را بپذیرد و او را باز گرداند.و اگر کلیسا در منصب مجازاتگری نشست، منصب توبه پذیری اش را از دست خواهد داد.این کتاب\"ژان والژان\" و \"ژاور\"، دو شخصیت معروف رمان \"بینوایان\"، هر دو معتقد به خدا هستند؛ اما خدایی که هر یک می پرستد، غیر از دیگری است.ژان والژان مردی است که بیست سال از عمرش را در زندان با اعمال شاقه گذرانده. مردی است که قانون او را مجازات کرده و پس از آن که دوره ی مجازاتش تمام می شود، جامعه او را طرد می کند.در این حال، اسقف \"میریل\" او را می یابد و درک می کند که او، نیاز به امید دارد. نیاز به بازگشت دارد. پس به او امید می دهد و بازش می گرداند.از آن پس، ژان والژان می شود مظهر خدای مسیحی. مردی که در تمام عمرش، کاری جز عشق ورزیدن نمی کند. حتی به کسانی که از آن ها بیزار است.در مقابل، ژاور مردی است که به گفته ی خود در تمام عمر یک قانون را هم نشکسته. مردی است که تمام هم و غمش اجرای قانون است. تا جایی که وقتی خودش مرتکب جرمی می شود، با سر افکندگی خودش را معرفی می کند تا به سزای کارهایش برسد.این دو شخصیت، که یکی نماد خدای مسیحی و دیگری نماد خدای یهودی است، بارها با هم دچار تنش می شوند. یکی از این تنش ها، جایی است که بر سر \"فانتین\" ستیزه می کنند. زنی روسپی که شاید شباهتی به \"مریم مجدلیه\" داشته باشد. ژاور بی آن که به گریه و زاری فانتین گوش دهد و به دختر کوچکش، \"کوزت\"، اهمیتی بدهد، او را محکوم به شش ماه زندان می کند؛ اما والژان، با آن که فانتین به او اهانت می کند و در رویش تف می اندازد، دستور آزادی او را می دهد.یکی، هیچ نرمشی در برابر قانون شکنی نشان نمی دهد و دیگری، آغوشش را برای گناهکار می گشاید.یکی دیگر از این تنش ها، در انتهای داستان است. جایی که والژان، آغوش خود را برای خود ژاور می گشاید. با این که توانایی بر کشتن ژاور دارد، او را زنده می گذارد. ژاور نمی تواند این رفتار را درک کند و به همین دلیل گیج می شود. او که تا کنون همه چیز را با دیدی انعطاف ناپذیر می دید، اکنون دچار تزلزل می شود. می بیند که مردی قانون شکن، توانسته مرد بزرگی شود. می بیند که هم بازداشت کردن این مرد اشتباه است و هم بازداشت نکردنش.نهایتاً، وقتی نمی تواند این دوگانگی را بپذیرد، خود را در رودخانه ی \"سن\" می اندازد و خودکشی می کند.و این گونه، از دیدگاه ویکتور هوگو، خدای یهودیت، می میرد و خدای مسیحیت باقی می ماند."}, {"userName": "Petra X", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[Good, excellent, as the book was, I am left with one question, how come Valjean never recognised Thénardier no matter how many times he met him? (hide spoiler)]"}, {"userName": "Matthew", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "I dreamed a dream of reading this book - and I accomplished it! Surprisingly easy to read - even though it did take quite some time. Hugo does go off on quite a few tangents, but the whole experience was fantastic!"}, {"userName": "Elyse", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I noticed a few friends currently reading this masterpiece. I read the unabridged version over 20 years ago. ( with a class )I enjoyed reading Goodreads member, Chrissie's process with this book and the many comments. Highly recommend reading her process, followed up by what others have to say. I was blessed reading this -with a class - and with my daughter who was only in the 8th grade at the time. Her brilliant literature teacher got each parent and student involved ( my husband was too). After all the investment of time and discussion - plus having seen the play ( which we went to see again 2 more times while it played in SF), I concluded this has got to be one of the greatest books of all time. I don't think it's important to have to try and remember all the minor characters names. ( which seemed to be a concern for readers)...but I think it's terrific they now have this novel in audio. What a wonderful gift ...( plus if a reader followed along with the novel)... The audio sounds like it could be a wonderful way to engross oneself. Just my 2 cents! OH YES!!!!!!!!!!!!!AGREE! 5 stars!Plus, its still my favorite play today"}, {"userName": "Kim", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "I put off tackling this novel for more years than I can remember. This was mostly because I wanted to read it in French and the length of the book daunted me somewhat. That, and the fact that every time I was in the local foreign language bookstore they didn’t seem to have all of the volumes. The fact that I was relying on a local bookstore rather than the Internet to obtain a book in French indicates how many years it’s been since I gave reading the novel any serious thought. The last two months have been a Les Misérables immersion experience as I listened to the audiobook downloaded for free from this site. The narrator, who goes by the name of “Pomme”, is superb. Although she doesn’t use different accents or create obviously different voices for the characters, she renders emotions quite beautifully and is a pleasure to listen to. I can now understand why so many people consider Les Misérables to be the great French novel and, for that matter, one of the greatest novels of all time. The plot is well known to anyone who has seen the musical. However, the novel is so much more than the story of Jean Valjean’s redemption, than his pursuit by the determined Inspector Javert, than the love story of Marius and Cosette, than the world of the villainous Thénardiers. Rather, it is the recreation of the world of Victor Hugo’s youth, with vivid and detailed descriptions of Paris in the 1820s and 1830s, with digressions on topics as varied as the Battle of Waterloo, the manufacture of jet jewellery, French politics, the difference between a riot and a revolution and the Parisian sewerage system. For some readers, Hugo’s essays on these and other topics get in the way of the story. For me, they are the story. Or at least they make the story so much more than the elements of the plot which form the basis for the stage adaptation. This is a vast, sprawling, hugely digressive, powerful, sentimental monster of a novel. It is by no means flawless. Hugo suffers from the failing of so many male writers of the 19th century, that is, an unhealthy preoccupation with the virginity and purity of nice young women. This means that he makes the adult Cosette not only dull in her perfection, but stupid as well. She is infinitely less interesting than the brave Eponine, the frightening Madame Thénardier or the tragic Fantine. However, Cosette’s blandness is easy enough to deal with in a novel otherwise populated with such wonderful characters. Of them, Jean Valjean and Inspector Javert are of course the standouts. Hugo creates intensely detailed psychological portraits of these two fascinating men, who have such different philosophies of life. I sorely regret not reading the novel sooner, because the number of times I will be able to re-read it is so much more limited than it would have been otherwise. Listening to the novel over the past few weeks has been a fabulous literary experience. I appreciate that not all readers will appreciate its length, its language or its digressive nature, but for total immersion in a different world there can be nothing more satisfying. For anyone interested in the geographical locations described in the novel and planning a trip to France, a blogger has written a great account of travelling through France while reading the novel. He has also created a fabulous interactive map which shows the locations of various events in the novel. The blog can be found here and the map can be found here."}, {"userName": "Raya راية", "userReviewDate": "Mar 29, 2018", "userURL": "http://www.goodreads.com/user/show/23224678-raya", "userReview": "\"إن الآثار الأدبية الإنسانية كالآثار المعمارية والفنية لا تزداد مع الأيام إلّا حُرمة ونفاسة بل وإشراقًا في بعض الأحيان. وإنما يتأكد هذا المعنى أكثر حين تكون القضايا التي يعالجها الأثر الخالد مطروحة، ما تزال، في بلادنا، سواء على الصعيد النظري أو على الصعيد العملي، أو على الصعيدين جميعًا\".\nمنير البعلبكي في مقدمة ترجمته الكاملة لرواية البؤساء\nتعود بي الذاكرة إلى أيام المدرسة الابتدائية عندما كنت في الصف السادس، كنا في مكتبة المدرسة الصغيرة، ووقعت عيني على رواية ضخمة، كان عنوانها البؤساء، كانت ضخمة جدًا وكانت أول رواية مسّتها أصابعي، وكانت ورقاتها صفراء مهترئة، قَلبت صفحاتها وأتذكر بأنني قرأت الصفحة الأولى منها ولم أفهم شيئًا، ما معنى أسقف؟ مدينة ديني؟ كلمات وألفاظ غريبة، وعاهدت نفسي بأني حين أكبر سأقرؤها وأفهمها. مرت السنون وأصبحت في الصف التاسع، وفي درس قواعد اللغة العربية قرأت نصًا قصيرًا، وكُتب في الهامش بأن النص مقتبس من رواية البؤساء لفيكتور هوغو، وأتذكر أيضًا بأنه يتحدث عن معركة واترلو ونابليون. وصلت الصف الأول الثانوي، وذهبت إلى مكتبة المدرسة، واستعرت رواية البؤساء، وقرأتها لأول مرة –وأذكر أنها لم تكن ترجمة كاملة-، سكنت هذه الرواية روحي ووجداني. دخلت الجامعة ومباشرة ذهبت إلى مكتبتها الضخمة وفي قسم الأدب والروايات وهناك في رف عالٍ كانت المجلدات الخمسة من الرواية مرتبة، استعرتها وقرأتها وعشت معها وفيها أيامًا طويلة. عاودت قرأتها بعد ذلك ثلاث مرات ولكن بترجمات مختلفة. حاولت البحث كثيرًا عن النسخة الكاملة لأقتنيها ولكني لم أجدها، ومؤخرًا نشرت دار العلم للملايين الترجمة الكاملة بمجلدين اثنين، وعاودت قرأتها للمرة السادسة. وإن قدّرني الله ومد في عمري سأقرؤها وأقرؤها وأقرؤها.تتناول هذه الرواية الضخمة موضوعًا مهمًا جدًا ألا وهو حال الأشخاص الواقعين تحت ظلم المجتمع، وتحت المظالم يخلقها القانون، والحضارة، والأعراف الاجتماعية. وبؤساء هذه الرواية ما هم إلّا نماذج تصوّر حال البشر المظلومين في كل عصر ومكان. \nجان فالجان هذا البائس الذي قضى في سجن الأشغال الشاقة 19 عامًا من أجل رغيف خبز! وحين يخرج، يرى المجتمع يغلق أبوابه في وجهه، نفسه المجتمع الذي أفقر أسرته واضطرّه إلى السرقة، نفس المجتمع الذي وضع قوانينه الصارمة، نفس المجتمع الذي عاقب والذي حَرَم والذي خلق كل هذه المظالم، ظلمه شابًا وظلمه سجينًا وظلمه حرًا! مما شكّل في داخل نفسه كرهًا وحقدًا شديدًا على هذا المجتمع. \n\"إن النفوس المتردّية في قعر الشقاء الأقصى، والرجال البائسين الضائعين في الأعماق السفلى حيث يحتجبون عن العيان، وأولئك الذين صبّ عليهم القانون لعنته –إن هؤلاء جميعًا ليحسّون فوق رؤوسهم بكامل ثقل ذلك المجتمع البشري المخيف إلى أبعد الحدود في عين المنبوذ خارجه، الفظيع إلى أبعد الحدود في عين القائم تحته\"\nومن غير ذلك الشقي المتردّي في قعر الشقاء أكثر حاجة إلى الإحسان وإلى معاملته كبشر! وهذا ما أحدثه الأسقف ميرييل في نفس جان فالجان، فحطّم في نفسه الحقد وأضاء فيها شعلة الخير. \n  \"إن السماء لتبتهج للدموع التي يسفحها آثم تائب، أكثر مما تبتهج لمئة بُرد أبيض يرتديها مئة رجل صالح\"وخُلق جان فالجان خلقًا جديدًا، وأصبح الأب مادلين، وذهب إلى قرية بعيدة وأنشأ هناك صناعة وأحسن إلى الكثيرين وأحب الناس وأحبوه. لكن ضميره الذي أيقظه الأسقف ميرييل، أبى عليه أن يرى شخصًا آخر يُساق إلى السجن مكانه، فاعترف على نفسه بأنه هو نفسه جان فالجان.\n\"إنه لا يستطيع أن يلج باب القداسة في عيني الله، إلّا بالعودة إلى العار في أعين الناس!\"\nفعاد مرة أخرى إلى سجن الأشغال الشاقة, وبتيسير الأقدار استطاع أن يهرب.فانتينهذه الفتاة الجميلة البريئة التي لم يرحمها المجتمع من ظلمه أيضًا وأوقع عليها شقاءً أكبر. فبعد أن غرر بها أحد الشبان المتعطّلين الأغنياء، وهجرها، وضعت مولودتها وبدأت تشق طريقها في بحر الشقاء المتزايد. فعملت لتعيل نفسها وابنتها، ولم يكتف المجتمع بما أوقعه عليها من شقاء، فتربّصت بها أعين المتربّصين واتُهِمت ظلمًا وطُردت من عملها، فلم تجد مأوى سوى الشارع، تعذّبت ومرضت وباعت نفسها من أجل أن تقيم أود طفلتها.\n\n\"ما هي قصة فانتين هذه؟ إنها قصة المجتمع يشتري أمَةً رقيقة. ممن؟ من الشقاء. من الجوع، من البرد، من الوحدة، من التخلّي، من الحرمان. صفقة موجعة. نفسٌ بشرية مقابل كسرة من الخبز. الشقاء يَعرض والمجتمع يقبل.\"\n\n\nتقاطعت حياة جان فالجان –الذي كان في تلك الأيام الأب مادلين- وفانتين، فعلم بوضعها وأحسن إليها وأشرف على تقديم العلاج لها، ووعدها بأن يحضر ابنتها لها، لكن الأقدار لا تسير بما نشتهي، وماتت فانتين قبل أن ترى ابنتها.كوزيتلأن \"العذاب الاجتماعي يبدأ في كل الأعمار\" ولا يفرّق بين رجل وامرأة وطفلًا، رزحت كوزيت الطفلة تحت نير المظالم الاجتماعية في سن مبكرة جدًا، حيث تركتها والدتها فانتين، في رعاية تيناردييه وزوجته، اللذان كانا يستغلّان وضع الأم ما أمكنهما الاستغلال، وحين انقطعت الأموال التي كانت ترسلها فانتين –لأنها ماتت- جعلا تلك المخلوقة البريئة الصغيرة خادمة في فندقهما الحقير. لكن ذلك لم يستمر، فجاء جان فالجان وأنقذها من هذين الغولين البشريين. وذهب بها إلى باريس. لقد لمس الحب بأنامله المضيئة قلب جان فالجان لأول مرة، فأحب كوزيت كروحه.\n\"ذلك بأنها جدّ مبهمة وجدّ عذبة هذه العاطفة العظيمة الغريبة التي تعمُرُ القلب في حبه الأول\"\"كان أبًا فيه حتى الأم ذاتها، أبًا أحب كوزيت، وعبدها، وكانت له تلك الطفلة ضياء، وكانت بيتًا، وكانت أسرة، وكانت وطنًا، وكانت فردوسًا\"\nوأحبت كوزيت ذلك الرجل الذي هبط عليها من السماء كملاك وخلّصها من براثن الشقاء، ولم تعرف كوزيت قريبًا أو أبًا أو أمًا أو أحدًا في الحياة غير جان فالجان.\n\"وكانت إذا ما جلس تُريح خدّها على شعره الأشيب، وتسفح دمعة في صمت، قائلة لنفسها: \"لعله؟ لعل هذا الرجل أمُي\"!\"\n\nعاش جان فالجان وكوزيت في دير بيكبوس الصغير الذي آواهما من ترصّد جافير لسنوات طويلة، فكبرت وكوزيت وتعلّمت، وعمل هو كمزارع هناك. فلم يعرف سعادة سوى بالقرب من طفلته وهي لم تعرف سعادة سوى بجانبه\n\"كان هو سناد هذه الطفلة، وكانت هذه الطفلة هي نقطة ارتكازه. إيه أيها اللغز الإلهي الذي لا يُسبر غوره، لغز توازن القدر!\"\nعاش جان فالجان من أجل كوزيت.جافيرمفتش الشرطة الذي لاحق جان فالجان من أول الرواية إلى آخرها. وجافير الذي لم يكف أبدًا ولم ييأس من اللاحق بجان فالجان وإعادته إلى السجن. ويمثّل جافير برأيي، سلطة القانون والمجتمع التي تأبى أن تترك السجين- المظلوم وشأنه، والتي لم ولن تستطيع أبدًا أن تبرّر الجريمة التي أوجدتها هي.\n\"أكان ثمة، إذن، حالات يتعيّن فيها على القانون أن يتراجع أمام الجريمة مجلببة بالسناء، وهو يغمغم بالمعاذير؟\"\n انتحر جافير أخيرًا لأنه لم يتحمل أن يُحسن عدوّه جان فالجان إليه وأن ينقذه من الموت. لم يتحمل يقظة الضمير ومحاسبة النفس، لم يتحمل أن يرى في قانونه ثغرات وتجاوزات.\n\"أن يضطر إلى الاعتراف بهذا: أن العصمة من الضلال ليست معصومة؛ وأنه قد يكون في العقيدة الجوهرية خطأ ما؛ وأن القانون حين يتكلم لا يقول كل شيء؛ وأن المجتمع ليس كاملًا؛ وأن السلطة مشوبة بتردد؛ وأن التصدع في ما هو غير قابل للتغير ممكن؛ وأن القضاة ناس من الناس؛ وأن القانون يُخدع؛ وأن المحاكم قد تخطئ! أن يرى صدعًا في بلور القبة الزرقاء الهائل\"\nماريوسالشاب الجميل الذي تربّى في كنف جدّه لأمه. يتيم الأم, لا يعرف أباه الكولونيل، الذي حرمه جدّه منه، فزرع في رأس الطفل أن يكره أباه وينبذه. لم يعرف ماريوس أباه إلّا حين مات، فكانت تلك نقطة تحوّل في حياته واكتشف مقدار حب أبيه له، ومآثر أبيه في معارك نابليون. فقرر ترك منزل جدّه وثروة جدّه، وأن يعيش مع رفاقه يشاركهم بؤسهم، وبؤس أبيه من قبله. تحول ماريوس من شاب تربّى في بيئة برجوازية إلى نابوليوني. وفي تلك الفترة رأى كوزيت، فأحبها وأحبته. وهنا نرى بوضوح نفس فيكتور هوغو التي تدعو الناس إلى الحُب بكل قوة وبأن الحُب هو نور الحياة وأسمى عاطفة يستشعرها الإنسان.\nرسائل ماريوس إلى كوزيت\n\n\n\n\nتيناردييه وزوجته وشركاؤه في جرائمهتشكل هذه الفئة أدنى فئات المجتمع، التي تعيش في كنف الظلام وتمارس شرورها وحقارتها وجرائمها فيه. هذه الفئة التي حرمها الجهل والظلام من أي فضيلة إنسانية سامية. فتحاول استخدام مهاراتها التدميرية الشريرة من أجل تحقيق مصالحها الذاتية الأنانية.أصدقاء الألفباءأصدقاء ماريوس؛ مجموعة من الطلبة والعمال الذين جمع بينهم حُب فرنسا وحلمهم بالجمهورية، وهم: آنجولراس، كومبوفير، جان بروفير، فويي، كورفيراك، باهوريل، ليغل، جولي، غرانتير.\n\"إن للمخاطر العظمى هذا الجمال، وهو أنها تلقي النور على أخوّة الغرباء\"\nوكلهم ماتوا في ثورة حزيران/يونيو 1832.-------------------------------يثور فيكتور هوغو في روايته على الظلم الذي يوقعه المجتمع على أفراده ويعاقبهم ويجرّمهم على أشياء صنعها هو، فنراه يصرخ في مواضع كثيرة بضرورة نشر التعليم المجاني بين الناس، لأن التعليم هو النور الذي يمحي ظلام الجهل؛ وما الجهل إلّا البذرة التي تبنت منها كل جريمة وشر:\nالأسقف ميرييل: \"علّم الجاهل ما وسعك التعليم. إن المجتمع ليُجرمُ حين لا يزوّد كل امرئ بالعلم المجاني. إنه لمسؤول عن الظلام الذي يحدثه. وحين تُترك النفس في الظلام، فعندئذ تُقترف الآثام. والمجرم ليس ذلك الذي يقترف الإثم، ولكنه ذلك الذي يُحدث الظلام.\"\"إن جميع الإشعاعات الاجتماعية السخيّة لتنبثق عن العلم، عن الأدب، عن الفنون، عن التعليم. اصنعوا رجالًا؛ اصنعوا رجالًا. امنحوهم الضياء لكي يعطوكم الدفء. وسواء عاجلًا أم آجلًا، ستحتل مسألة التعليم الشامل الباهرة مكانها بسلطان الحقيقة المطلقة الذي لا سبيل إلى مقاومته\".\"إن تحت المجتمع –ونحن نصرّ على ذلك، كهفًا ضخمًا هو كهف الشر، ولسوف يظل هذا الكهف قائمًا تحت المجتمع، إلى يوم يزول الجهل\".\"دمّروا الكهف المسمَى الجهل تقتلوا الخُلد المسمَى الجريمة\".\"إن التقسيم الحق للناس هو الذي يجعلهم نوعين: مشرقين ومظلمين. والعمل على إنقاص عدد المظلمين، وزيادة عدد المشرقين هو الغاية. من أجل ذلك نصيح: التعليم، المعرفة! إن تعليم القراءة أشبه شيء بإضرام النار. وكل مقطع يُهجَّى إنما يطلق شرارة\".\n\nويسلّط الضوء أيضًا على تشرّد الأطفال وشقاءهم ويرى أن الجريمة تبدأ بتشرّد الأطفال. وتمثّلت هذه الفئة بكوزيت الطفلة وغافروش إيبونين وآزيلما وابني تيناردييه الصغيرين.\n\"والحق، أن الذي لم يرَ غير بؤس الرجل لم يرَ شيئًا؛ يجب أن يرى بؤس المرأة. ومن لم يرَ غير بؤس المرأة لم يرَ شيئًا؛ يجب أن يرى بؤس الطفل\".\nإن بؤس الأطفال هو الصورة الفجّة على قسوة المجتمع وظلمه. ---------------------------\nإن رواية البؤساء ليست فقط رواية اجتماعية، وإنما وثيقة تاريخية مهمة، تصوّر عصرًا كاملًا تضاربت فيه الأحداث وتغيّر فيه وجه أوروبا والعالم. جسّدت الرواية تاريخ فرنسا في أشد حقبه خطرًا –ليس التاريخ الثورة الفرنسية (1789) كما يظن البعض خطأً- وهي الفترة التي امتدت من بعد خسارة نابوليون لمعركة واترلو، وحكم شارل العاشر والإطاحة به في ثورة تموز/يوليو 1830، والمصادقة على ابن عمه، من فرع أسرة أورليان، لويس فيليب، كملك دستوري لفرنسا، حتى الإطاحة به في ثورة 1848. وكل هذه المظالم الاجتماعية التي صوّرتها الرواية ما هي إلّا نتيجة لتقلّبات التاريخ، وأحوال البلاد، من ملكيات إلى جمهوريات إلى حروب. لقد كانت النزعات التحررية في فرنسا والحروب النابوليونية صفعة قوية في وجه الملكيات الأوروبية المطلقة، فكانت فرنسا من أوائل الدول التي أدركت حق شعبها في اختيار نظام حكمه، وإسقاط الحق الإلهي في الحكم، حيث كان حكّام وملوك تلك الحقبة من التاريخ يحكمون بشكل مطلق ويستمدون سلطان هذا الحكم من الله، وكأنهم ظله على الأرض. فتجاوزت قيم الثورات الفرنسية وإعلان حقوق الإنسان حدود فرنسا إلى دول أوروبا والعالم، فشكّلت خطرًا شديدًا على الحكّام فحاولوا القضاء على نابوليون وإرجاع آل بوربون إلى عرش فرنسا\n\"لقد وُجدت فرنسة لكي توقظ روح الشعوب، لا لكي تخنقها. فمنذ عام 1792 لم تكن جميع ثورات أوروبة شيئًا غير الثورة الفرنسية؛ كانت الحرية تشعّ من كل رجًا من أرجاء فرنسا. تلك حقيقة ساطعة سطوع الشمس في رائعة النار. وأعمى هو الذي لا يراها\".\nلكن هيهات أن يقبل شعب ذاق طعم الحرية، العودة تحت ظل الملكيات المطلقة، هيهات أن يقبل شعب تشرّب أفكار فولتير ومونتيسكيو وديدرو أن يرزح تحت الدكتاتورية، فرفضوا وحاربوا، وتمزقت فرنسا وسال دم أبناءها في سبيل هذه الحرية الغالية.\n\"إن جميع الفتوح الجليلة هي، كثيرًا أو قليلًا، ثواب الجرأة. فلم يكن كافيًا –لكي تندلع ثورة- أن يتنبأ بها مونتيسكيو، ويبشّر بها ديدرو، ويعلنها بومارشيه، ويدبّرها كودنورسيه، ويمهّد لها آروويه، ويتعمّدها روسو. كان من الضروري أن يجرؤ عليها دانتون\".\nنعم لقد تجرّأ الشعب الفرنسي الذي راهن عليه فيكتور هوغو، واستطاع أن يتنزع حرّيته وحقّه الطبيعي في تقرير مصيره. \n\"إن هذه الأقدام الحافية، هذه الأذرع العارية، هذه الأسمال البالية، هذه الجهالات، هذه الحقارات، هذه الكلمات، يمكن أن تُصطنع في النضال من أجل تحقيق المثل الأعلى. انظُر من خلال الشعب تلمح الحقيقة. إن هذا التراب الخسيس الذي تطأه بقدميك، إذا ما قذفت به الأتون، وتركته يذوب ويفور، يصبح بلورًا يبهر الأبصار، وبفضله سوف يلمع غاليليو جديد أو نيوتن جديد فيكتشف النجوم\".\nولم تصل فرنسا اليوم إلى ما هي عليه من ديمقراطية إلّا بعد أن شهدت الويلات ومات الملايين من أبنائها فداءًا للحرية والجمهورية.-------------------------------تجلّت قدرة فيكتور هوغو الساحرة في الوصف في هذه الرواية أشد تجلٍّ، فنراه يغوص في نفوس شخصياته ويسبر أغوارها ويكشف لنا ما يعتمل في سويدائها\n\"هناك مشهد واحد أعظم من البحر؛ ذلك هو مشهد السماء. وهناك مشهد واحد أعظم من السماء؛ ذلك هو باطن النفس البشرية\"\nونراه يصف الحُب والمحبين بأعذب وأرق الألفاظ والصفات\n\"إن أسمى مراتب السعادة في الحياة إيماننا بأننا محبوبون؛ محبوبون لذواتنا –وبكلمة أفضل- محبوبون رغم ذواتنا\"\nهذه ليس رواية وإنما تحفة أدبية ورائعة من الروائع التي خطّتها يد بني الإنسان يومًا. تضطرب في قلبك كل المشاعر أثناء قرائتها. شكرًا فيكتور هوغو على ما قدّمته لنا في هذا العمل الخالد.------------------------لنتحدث عن الترجمة قليلًا، تُعدّ ترجمة منير البعلبكي –شيخ المترجمين- الترجمة الكاملة لهذه الرواية الضخمة، فلم ينتقص من تفاصيلها شيئًا. على عكس ما يصدر كل يوم من اختصارات لهذه الرواية، اختصارات معيبة جدًا بحق عمل عظيم كهذا، ترجمات قاصرة جدًا، لم تعطي الرواية حقّها أبدًا، وإنما ساهمت بإيصال أفكار مغلوطة عنها للقراء. فكيف بالله عليكم أن تُختصر رواية ضخمة بهذا الجحم في 400 صفحة، هذه الـ400 صفحة لا تشكّل حقيقةً سوى واحد من أقسامها الخمسة! كيف يمكن لشخص ما أن يقول بأنه قرأ البؤساء (النسخ المختصرة) وهو فعليًا لم يقرأ سوى مختصر معيب عنها! كنت قد قرأت الرواية بترجمة مختصرة 4 مرات، ولم أجد الكثير الكثير الكثير مما يوجد بالترجمة الكاملة. لذلك أدعو الجميع بأن يقرأوا ترجمة منير البعلبكي الكاملة الإبداعية الرائعة، الصادرة بنسخة حديثة من دار العلم للملايين.ملاحظة على الهامش: أثناء قرائتي لهذه الرواية، وصلتني العديد من الرسائل والتعليقات بأن \"البؤساء\" خطأ وأن الأصح أن تترجم \"بائسون\"، وأن أقول لهم يا أخواني وأصدقائي، أنا لست سوى قارئ بسيط، لم أترجم هذه الرواية ولا أشرف على دور النشر التي نشرتها وطبعتها ملايين المرات, وأدعو أي شخص لديه اعتراض على ترجمة العنوان أن يراسل دور النشر ويخبرهم بما لديه.----------------------------------\nاختم مراجعتي هذه بصرخة فيكتور هوغو في وجه النظام الاجتماعي:\n\"حُلّوا المشكلتين، شجعوا الغني، احموا الفقير، أَلغوا البؤس، ضعوا حدًا للاستغلال غير العادل الذي يُنزله القوي بالضعيف، اكبحوا الحسد الطاغي الذي يستشعره ذلك الذي لا يزال على الطريق نحو ذلك الذي بلغ غايته؛ عدّلوا أجور العمل في دقة وعلى نحو أخويّ؛ أضيفوا التعليم المجاني والإلزامي إلى نمو الطفولة، واجعلوا العلم أساس الرجولة، نمّوا العقل فيما تمسكون بالذراع؛ كونوا شعبًا قويًا وأسرة من الناس السعداء في آن معًا؛ اجعلوا الملكية ديموقراطية، لا بإلغائها، ولكن بتعميمها بحيث يصبح في ميسور كل مواطن بلا استثناء أن يكون مالكًا، وهو شيء أيسر مما يُعتقد. وبكلمتين اثنتين، تعلّموا تنتجون الثورة، وتعلّموا كيف توزعونها، وعندئذ تتم لكم العظمة المادية والعظمة المعنوية، متحدتين، وعندئذ تكونون جديرين بأن تدعوا أنفسكم فرنسة\"\n\nانتهت بحمد الله...."}, {"userName": "Jason", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/2447803-jason", "userReview": "1466 pages!! And I've isolated the best single sentence in the whole book. It describes how you die in warfare:If anything is horrible, if there is a reality that surpasses our worst dreams, it is this: to live, to see the sun, to be in full possession of manly vigor, to have health and joy, to laugh heartily, to rush toward a glory that lures you on, to feel lungs that breathe, a heart that beats, a mind that thinks, to speak, to hope, to love; to have mother, wife, children, to have sunlight, and suddenly, in less time than it takes to cry out, to plunge into an abyss, to fall, to roll, to crush, to be crushed, to see the heads of grain, the flowers, the leaves, the branches, unable to catch hold of anything, to feel your sword useless, men under you, horses over you, to struggle in vain, your bones broken by some kick in the darkness, to feel a heel gouging your eye out of their sockets, raging at the horseshoe between your teeth, to stifle, to howl, to twist, to be under all this, and to say, \"Just then I was a living man!\"(p. 355)Wow. How do you review a 1466-paged complete and unabridged uber-classic? The book has the rectilinear dimensions of a fire-baked brick. It's a doorstop.Les Miserables is a successful, sweeping epic. It follows several interrelated characters throughout their lives, and philosophizes on religion, language, warfare, science, etc. I'm sure it's much more poignant, more beautiful in its original language, but this was a satisfactory translation.Nevertheless, I can't award more than 4 stars, and here's why. The unabridged version is just too much book; it's too slow-moving; it's too expansive; it's too overwrought; it's too circumlocutious. Near the end of the book (oh...say by page 1150), I quickly started losing the motivation to finish it, despite that I was still interested in each character. When I was finished, I felt the release of 1 month/40 hours of reading being lifted pleasantly off my shoulders, like removing a fire-baked brick from my scapula and clavicles--definitely not a 5-star characteristic. This is not to say it's poorly-written. On the contrary, I think Hugo, more than any other writer besides Shakespeare, has the most memorable, thought provoking one-liners. He'll write an entire paragraph on a single thought, then sum it up in one profound, euphonic sentence.- Nothing is so dismal as the brightness of deserted streets.- A man without a woman is a pistol without a hammer.- The ground in summer is as quick to dry as a child's cheek.- Nothing is so beautiful as greenery washed by the rain and wiped by the sunbeam; it is warm freshness.- He who does not weep, does not see.- Unhappy is he who surrenders himself to the changing heart of woman!Stop! I could list 100 of these aphorisms simply by rifling through the book and randomly pulling one from each page. They're there, on every page, and they're all profound, take a look.Hugo also blithely diverges for 20-50 pages on war, language, religion, revolution, love, science, the Paris sewer system. In this unabridged version, Hugo's diversions act as an antecedent, merely establishing what at first seems like an unnecessary diatribe, but actually provides the background (or milieu) for a subsequent storyline involving the main characters. For example, Hugo waxes for almost 60 pages about the Battle of Waterloo, with absolutely no reference to the main story, except at the end--the last paragraph of the diatribe--where he provides the critical link back to the story. I'm not an editor, but these diatribes, these philosophical meanderings, makes it absurdly easy to edit Les Miserables into a successful abridged work. Cut out these diversions, and you have quite a driving story of only 600 pages. The 'Complete and Unabridged' version has its place; it exposes the reader to the wonderful expanses of Victor Hugo's polymathic mind. However, as a final recommendation, I can only tell you to read the abridged version!! I feel horrible saying that, but as Hugo would quip, wherever you go, there you are.New words: euphony, antonomasia, sutler, chilblain, anchylosis, afflatus, demiurge, argot, ochlocracy"}, {"userName": "Kirstine", "userReviewDate": "Sep 16, 2011", "userURL": "http://www.goodreads.com/user/show/5172557-kirstine", "userReview": "I don't believe I've ever been this ambivalent about a book. I don't remember having ever read anything that I loved and hate the way I do this. Okay, it got four stars, so maybe there are more loveable than loathsome parts, but still, thinking about it tugs my heart in both directions. When it's good it's excellent, and completely deserves 5 stars - more even. The descriptions of the moral complexities a man is faced with are spectacular and Jean Valjean's internal struggles are always a wonder to witness. Hugo really nails large parts of the human condition in much of the book; the compassion, the cruelty, the greed, the forgiveness, the love. He presents us with some memorable characters, who each possess qualities and flaws that we're all familiar with. Enjolras and Grantaire are great examples of this, of two men who, in their contrast, fulfill each other somehow, and both together and apart help describe a part of human life. It's brilliant, I loved it. I want to go into detail with all the major characters, and some of the minor, but I'll refrain. I'll have nothing new to say anyway. But the characters are the best part about this book, no doubt.Unfortunately, when this book turns bad, it turns goddamned awful. Before that, however, let me address the length and version of the book I read. I read a fourth of this unabridged before I gave up and got an abridged version. I both regret and don't regret this decision (there it is again, the fucking ambivalence). The unabridged version simply had too much ridiculous filler chapters in it. Yes, the battle of Waterloo is interesting, no I don't want 6 effing chapters of it. That's not what the book is about. However, the abridged version meant you lost some of the details and character descriptions and I regret not getting that. There was one hilarious moment in this particular edition, after Marius sent Cosette his love letter, it shows us one and a half page of his lovesick rambling, and then goes something like \"The letter goes on like this for another 4 pages\". 4 PAGES! YOU HAVE NEVER EVEN SPOKEN TO HER YOU CREEP! (in actuality the letter is described as being 15 pages, but maybe he just has terrible hand writing?)Which cleverly brings me back to what is so awful about this book. The love story. Holy. Shit. No. Get it away from me. I know how you all love to say Edward and Bella have an abusive relationship and Edward is a shady stalker, but guys? He has fucking nothing on Marius. A year he follows Cosette around. A YEAR. He sends her a 15 page long love letter, without having spoken a word to her. How did he get her address? He asked someone to track her down. But, you know, okay. Fine. People like what they like and times were different back then. I could have forgiven it somewhat if that was it, but it isn't. Before her marriage and before her ridiculous infatuation with Marius, Cosette actually seemed to have real character, she could stand on her own, but then Marius enters and she slowly evaporates. She lets her entire soul and being be overtaken by Marius. It's worst after their marriage. She turns into a pretty, shallow shadow of her husband. It is absolutely despicable. I wanted to throw the fucking book through a window, I was so mad. That, ladies and gentlemen, is not a healthy relationship and it irked the hell out of me. Unforgivable, Hugo, I don't care how much you thought you couldn't write women, that's no excuse for not even trying.And for this reason I also feel a wonderful kinship with Enjolras as he sings to Marius in the musical: \"Who cares about your lonely soul?\". Because indeed, who cares? Not me. Marius is a pawn in this book and probably one of the least interesting characters.In contrast, I love the story of Jean Valjean - it's breathtaking and immensely moving - and I love the story of the barricades and the revolution. I just also absolutely despise the story of Marius and Cosette. The great thing is that my anger toward that one part hasn't tainted my love of the other part. It simply makes it difficult for me to love the book as a whole. This got very long, I apologize. I urge you all to read it. It has some amazing philosophy in it - another part I regret about reading it abridged; a lot of Hugo's own musings were gone. I'd love to have someone collect and organize of his thoughts on various things as they are presented throughout this book and make into a separate book. That'd be very interesting."}, {"userName": "Rebecca McNutt", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "There are many books that bring up morality and the meaning of \"right\" and \"wrong\", but none capture it as well as Les Misérables. This timeless classic needs to be remembered for as long as there are people on this earth.SIDE NOTE: What's your favourite film adaptation of this book? I personally prefer the 1998 version but both versions are very well-made. :)"}, {"userName": "Camille Stein", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/19308897-camille-stein", "userReview": "Cosette * by Émile Bayard - http://ow.ly/tWxbgMientras, a consecuencia de las leyes y de las costumbres, exista una condenación social que cree artificialmente infiernos en plena civilización, y enturbie con una fatalidad humana el destino, que es divino; mientras no se resuelvan los tres problemas del siglo: la degradación del hombre en el proletariado, la decadencia de la mujer por el hambre, la atrofia del niño por las tinieblas; mientras en ciertas regiones sea posible la asfixia social; en otros términos, y desde un punto de vista más dilatado aún, mientras haya ignorancia y miseria sobre la tierra, los libros de igual naturaleza que éste podrán no ser inútiles.¿Qué más podía desear? Un pequeño jardín para pasearse y la inmensidad para soñar. A sus pies, lo que podía cultivar y recoger; sobre su cabeza, lo que podía estudiar y meditar; algunas flores sobre la tierra y todas las estrellas en el cielo. Esta sinceridad de la inmundicia tiene algo de bueno y alivia el alma. Cuando se ha vivido teniendo que soportar el espectáculo de la gran importancia que se arrogan en la tierra la razón de Estado, el juramento, la sabiduría política, la justicia humana, la probidad profesional, las austeridades de situación, las togas incorruptibles, consuela entrar en una alcantarilla y ver el fango a que se ha reducido todo esto. El amor es el único éxtasis. Todo lo demás llora. El amor es un niño de seis mil años. … Qué decir de esta aventura descomunal, tratado psicológico y moral, historiografía mística y mítica de París e inventario de las glorias de Francia, de sus épocas y sus usos y costumbres. Si no fuera por el didacticismo enervante, por ese entusiasmo político y discursivo, por los excesos de vehemencia y romanticismo… No sé, quizá sin todo esto ‘Los miserables’ hubiera sido una obra impecable, definitiva y certera, sin duda más equilibrada. Y probablemente distinta. Porque de lo que no hay duda es de que Victor Hugo es un gran creador, un consumado constructor de personajes, un maestro en la fluidez de las tramas paralelas que se van entremezclando a lo largo de la novela. Crea arquetipos (por no decir estereotipos), encarnaciones del bien y del mal con las que predispone a sus lectores y dirige sentimientos, afectos y odios. Y lo hace con tal conocimiento de la naturaleza humana que el lector acaba por rendirse a su talento. O por abandonar: yo mismo he estado a punto de hacerlo en varias ocasiones. Pero he de reconocer que individuos como Charles-François-Bienvenu Myriel o Jean Valjean, o el singular recorrido por la historia del alcantarillado de París, entre otros muchos episodios y peripecias, merecen el ingente esfuerzo de alcanzar el final."}, {"userName": "Corinne", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/38579677-corinne", "userReview": "In my vacation, over the last two weeks, I visited the birthplace of Victor Hugo in Besançon, his home in Paris where his children were born, and his grave in Pantheon. I also read his “Les Miserables” again, that is 21 years after I read it for the first time in my High School in France, and I was surprised to see how differently I reacted to this book. Then I realized the book has not changed over these 21 years, but it’s me who has changed!At the school, I was obliged to read this book as a part of our curriculum, and it came across as something heavy. But, now that I have been blazed a few times in my life, I could relate to this book a lot better, and, at times, even felt healed by it. The aspect that struck me the most is how Victor Hugo has constructed his characters: they’re neither entirely good, nor entirely bad; they’re humane, yet extraordinary. The police inspector Javert values his duty of keeping law and order above human beings, until he is humbled by Jean Valjean, when he saves the life of Javert, his worst enemy, during the barricade. Then Javert enters his irreconcilable internal conflict between ethics and law, that is between his moral duty to preserve a good man like Jean Valjean and his legal duty of turning him in as a fugitive, and Javert ends his life to save Jean Valjean. This comes across as a surprise, because Victor Hugo had set up all along Javert as a man of unbending principles, yet not incredible, because we’ve also seen Javert to be a man of good heart and conscience. Victor Hugo didn’t set up Jean Valjean as a paragon of virtue either. We can see his humane side, even after his conversion into a good man, when he enters his severe inner conflict vis-a-vis the man about to be condemned in his place, for having stolen the forty sous from Petit Gervais. You can see his temptations to evade law and save his own life; you can also see traces from his life of ex-convict when he gets angry with people, and the use of his force when his personal ethics conflict with the law. And, even for a powerful man like him, you can see his fears, his anxieties, and his insecurities about Cosette.Even for the rogue Thenardier, Victor Hugo has made him humane, by letting him save the father of Marius in the battle of waterloo!! Hugo also gave Thenardier a realistic end, in the sense that, in spite of all his dirty tricks, he ‘succeeds’ in life, from Thenardier’s perspective of course. Gavroche, the son of Thenardier, earns his bread by stealing, but he also steals your heart when he saves the two kids, and gives up his life at the barricade. His sister, Eponine, is another thief and manipulator, but she sacrifices her life at the barricade too, trying to save Marius, her secret love. Marius, the closest in resemblance to Victor Hugo (whose middle name is ‘Marie’ by the way), is a political idealist, yet insensitive to many in life, including Jean Valjean; you’re in love with him, and angry at him at the same time.It’s this powerful use of contrast, in the characters and in the events of the novel, that I find absolutely fascinating in Victor Hugo’s work, particularly in Les Miserables. And, I think this is what makes his works so lifelike, because, just like in life, you can’t really put a definite label on any of his characters or story events; that’s why you can never predict anything, and you remain hooked in suspense till the end.Of course, there are his big philosophical discourses about life and love, but, if you focus on the core drama of this novel, it’s just absolutely gripping. The way he details the inner landscape of the characters, and the values of the society he touches upon, are as universal today, as they were during his time. It’s because those details are so unique and specific that they no longer remain individual; they become us, the universal. This evening I’m going to see the grave of Juliette Drouet, who was the muse of Victor Hugo, for fifty years!! As a woman, I wonder what was there in her spirit that could inspire a writer like Victor Hugo, for so long.(Review updated on 29/07 for my second read)"}, {"userName": "Antonio", "userReviewDate": "May 08, 2014", "userURL": "http://www.goodreads.com/user/show/21081005-antonio", "userReview": "Pobre de mí, este año me será muy difícil hacer un top 5 de las mejores lecturas.Al parecer las grandes historias empiezan con el robo de un pan, supongo que algo tan bueno como el pan merece ser robado, pero pocos se pudieran haber imaginado todo lo que iba a desencadenar en la vida de Jean Valjean este pequeño hurto.Este libro es sensacional, su historia, su filosofía, sus personajes ¡Que personajes! los ame a todos incluso a los que odie (extraño lo sé), pero es que están tan bien hechos, todos son muy humanos, no son totalmente buenos, aunque uno o dos están muy cerca de serlo, ni totalmente malos, aunque hay algunos que lo parezcan. Cada personaje tiene fuerte convicciones, la conciencia de Jean Valjean, el extremo sentido del deber de Javert, la abnegación de Fantine, la pasión de Marius (dividida entre Cosette y el espíritu revolucionario), la perversidad de los Thenardier, la picardía de Gravoche; también, de una forma u otra todos son unos miserables, pero esta palabra tiene un significado mucho más profundo de lo que parece, y felicito al señor Víctor Hugo por tener el titulo más acertado de la historia. Aunque la historia cuenta con muchos personajes, no hay duda que en el centro está esta complicada relación entre Jean Valjean y Javert, perseguido y perseguidor, pero ¿quién es el bueno? ¿Quién tiene la razón? ¿A quién apoyar? La cosa no es sencilla, ellos me recuerdan al Dr. Frankenstein y a la criatura, a Charles Xavier y a Magneto, estos casos peculiares que se encuentran en la ficción, que te hacen cuestionar la ética, y si su enemistad tiene sentido. ¿Qué si lo recomiendo? Un gran SI, a pesar de que la historia tiene más de cien años, bien pudiera haberse escrito ayer y ser el éxito de hoy, trata temas que para la humanidad son constantes pero Victor Hugo se las arregla para relatarlos de forma emocionante, eso sí, sin miedo a filosofar, y a darte datos históricos de vez en cuando (y eso que leí una abreviación, bueno ahora se mas sobre el alcantarillado de Paris de los 1800 estoy seguro que algún día ese conocimiento me será beneficioso… creo). Y si lo tuyo no es leer (nota mental, debo recordar que estoy en Goodreads) la película del 2012 es una de las mejores adaptaciones cinematográficas que he visto (con diferencias, como todas las adaptaciones, pero pasables) y tiene el extra de ser un musical. P.D. ¡Vive la france! ¡Vive la liberte! ¡y que viva el pan!"}, {"userName": "Laz", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/22313662-laz", "userReview": "“Teach the ignorant as much as you can; society is culpable in not providing a free education for all and it must answer for the night which it produces. If the soul is left in darkness sins will be committed. The guilty one is not he who commits the sin, but he who causes the darkness.”\nA literary masterpiece. This is truly one of the best books I've ever read and I'm glad I took my time with it. So many characters, so many stories woven into one; a powerful & soulful book.Victor Hugo is wordy, not in a bad way but in the way you want to read and read and read because this author had a talent for taking the smallest of things and creating something beautiful & amazing out of it without ever creating that feeling of unneeded information. There were historical details, many historical details and although I'm not a big fan of history, I enjoyed reading how Victor Hugo perceived several historical milestones, such as the battle of Waterloo and more importantly the French Revolution. He gave his own personal note to these events, more so to the French Revolution where he put characters and events and gave us every single feeling of how it was to living through something like that, something so important to the nation of France.The story follows many characters. Protagonist of it, is Jean Valjean, a convict who were for 19 years in the galleys for stealing a piece of bread because he was too hungry. We can see Jean changing throughout the book, changing to become the man he always was supposed to be but life got in the way and prevented him from becoming the good, kind and loving man he was to become. We can see the struggles of living in post-Revolution France and how dire the situation for everyone who wasn't rich was. Jean Valjean, we cannot exactly say he was a man who regretted for stealing that bread although he definitely was sorry for losing all those years from his life. But if he hadn't stolen that bread, then maybe nothing of all the things that followed would have happened and maybe he never would have grown to known love & care like he did.I do not wish to write about all of the characters, Jean Valjean is enough I think. I think he is the core of the book, the one character we all awaited greatness from. He is a frank man, who makes honest mistakes and will give you all of his love if you're worthy of it.We can see what happens when you're too far from the truth and finally that truth catches up to you. The lies, the fear of being denied the very thing that we were born to give and receive, love.Mr. Hugo did an excellent work of captivating moments, of explaining situations in a way no else can. I just simply wish I spoke French just so that I could have read this book in its prototype & not a translation of it. I believe that the feelings would have been more magnified and more tense.If you decide to read this, do it because you want to not just because someone told you to. Be conscious of your decision and when you do read it make sure you take your time with it, savor every moment and cherish every second of this book. Don't be hasty, don't read it in the heat of the moment, keep at it slowly and let it speak to you and let yourself get lost in this tale of pain, hate, obsession, redemption, pride & lastly, the lesson of love this book will teach you.."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "873.\tLes Misérables, Victor Hugoبینوایان - ویکتور هوگو (جاویدان ، امیرکبیر ، توسن) ادبیات فرانسهعنوان: بینوایان؛ نویسنده: ویکتور هوگو؛ مترجم: حسینقلی مستعان؛ تهران، مطبعه ایران پاورقی، 1310، سپس به صورت کتاب در ده جلد و سپس در پنج جلد؛ چاپ دیگر: تهران، جاویدان، 1331، در دو جلد، چاپ دیگر: تهران، امیرکبیر، 1349؛ در دو جلد 1647 ص؛ چاپ دیگر 1363؛ چاپ چهاردهم 1370؛ شانزدهم 1382؛ شابک دوره: 9640004189؛ هفدهم 1384؛ هجدهم 1387؛ شابک دوره دوجلدی: 9789640004180؛ نوزدهم 1388؛ بیستم 1390؛ بیست و سوم 1391؛ بیست و چهارم 1392؛ چاپ دیگر: تهران، بدرقه جاویدان، 1386، در دو جلد، موضوع: داستانهای نویسندگان فرانسوی - قرن 19 ممترجمین دیگر متن کامل: نسرین تولایی و ناهید ملکوتی، تهران، نگاه، 1393، در دو جلد، شابک دوره: 9789643519568؛ عنایت الله شکیباپور در دو جلد، چاپ دیگر: تهران، گنینه، 1362، در دو جلد؛ چاپ دیگر: تهران، فنون، 1368، در دو جلد؛ چاپ دیگر: تهران، قصه جهان نما 1380، در دو جلد و 962 ص؛ کیومرث پارسای، تهران، سمیر، 1389؛ در پنج جلد، شابک دوره: 9789642200474؛ محمد مجلسی، تهران، نشر دنیای نو، 1380، در چهار جلد (جلد 1 - فانتین، جلد 2 - فانتین، جلد 3 - ماریوس، جلد 4 - ژان والژان)؛ چاپ سوم 1390؛ مرضیه صادقی زاده، تهران، آسو، 1395، در دو جلد؛ شابک دوره: 9786007228982؛ مینا حسینی، تهران، فراروی، 1393، در دو جلد، شابک دوره: 9786005947434؛ محسن سلیمانی، تهران، افق، 1388، در دو جلد؛ چاپ دوم 1389؛ چاپ ششم 1392؛ وحیده شکری، گرگان، هفت سنگ، 1395، در دو جلد؛مترجمین دیگر متن خلاصه شده: گیورگیس آقاسی، تهران، پیروز، 1342، در 335 ص، چاپ دیگر: تهران، سکه، 1362، در 335 ص؛ فریدون کار، اسب سفید، 1345، در 480 ص؛ محمدباقر پیروزی، در 340 ص، سروش، 1368؛ بهروز غریب پور، نشر قره، 1385، در 208 ص؛ شابک: 9643415155؛ مهدی علوی، تهران، دبیر، در 112 ص؛ چاپ سوم 1395؛ شایسته ابراهیمی، تهران، گاج، 1395، در 136 ص؛ صدف محسنی، تهران، پارسه، 1395، در 399 ص؛ مصطفی جمشیدی، امیرکبیر از ترجمه مستعان، در 129 ص؛ سبحان یاسی پور، آبان مهر، 1395، در 140 ص؛ اسماعیل عباسی، تهران، سپیده، در 47 ص؛ الهه تیمورتاش، تهران، سپیده، 1368، در 248 ص؛ چاپ دوم 1370؛ شهاب، تهران، معراجی، در 184 ص؛ امیر اسماعیلی، تهران، توسن، 1362؛ در 237 ص؛ عنایت الله شکیبا پور، تهران، فنون، 1368، در 384 ص؛ ابراهیم رها، 1382، در 64 ص؛ ابراهیم زنجانی با عنوان ژان والژان؛ ذبیح الله منصوری، تهران، بنیاد، 1362؛ در 177 ص؛ چاپ سوم 1370؛ نمیدانم. یادم نمانده این کتاب را چندبار خوانده ام. در کودکی نسخه های کوتاه شده و خلاصه ی داستان را...، آخرین بار چند سال پیش بود، باز هم ترجمه حسینعلی مستعان را خواندم. اگر بگویم مدهوش شدم، راه به سوی گزافه نبرده ام. ویکتور هوگو بزرگترین شاعر فرانسه در قرن نوزدهم و شاید بیشتر از همین جمله باشد که بنوشتم. ایشان با بزرگواری، با انقلابی بزرگ زندگی کردند و عمری طول کشید تا آن را نوشتندامپراطور گفت: کیست این مردک که مرا نگاه میکند. میری یل گفت: اعلیحصرتا، شما یک مردک را نگاه میکنید و من یک مرد بزرگ را، هر یک از ما میتواند، استفاده کند. از کتاب بینوایان، قسمت اول فانتین، کتاب اول یک عادل - 1 - مسیو میری یل"}, {"userName": "Giannis", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/29826697-giannis", "userReview": "«Δεν είναι τίποτα να πεθαίνεις. Είναι φριχτό να μη ζεις!»Δε θα ξεκινήσω με το κλασσικό «Θεέ μου γιατί δεν το είχα διαβάσει νωρίτερα», αλλά αντιθέτως θα πω, νιώθω ευλογημένος που το διάβασα. Γιατί η ηλικία του αναγνώστη δεν έχει καμία σημασία. Αυτό το βιβλίο… «Βίβλος ανθρωπιάς» σε ότι ηλικία και αν διαβαστεί, θα συγκινήσει και θα ανάψει τη «φλόγα» που κρύβουμε όλοι μέσα μας, όσο Άθλιοι και αν είμαστε!Το βιβλίο μας εξιστορεί την καθημερινότητα διαφορετικών ανθρώπων του Παρισιού και μας περιγράφει την αθλιότητά τους. Άλλοι γιατί είναι πραγματικά άθλιοι στη ψυχή και άλλοι γιατί η κοινωνία τους εξαθλίωσε και τους ανάγκασε να ζουν στο περιθώριο. Αλλά η καρδιά των περισσότερων ήταν ζεστή όσα χτυπήματα και αν είχε δεχθεί το κορμί τους, η αξιοπρέπεια τους και η ύπαρξή τους η ίδια. Αν και όλοι οι χαρακτήρες αναλύθηκαν υπέρ του δέοντος από τον «μεγάλο» Βίκτωρ Ουγκώ, πρωταγωνιστής ήταν ο Γιάννης Αγιάννης. Ένας σύγχρονος… Ιησούς Χριστός ο οποίος απέδειξε ότι μία μόνο στιγμή, αρκεί για να αλλάξει η φιλοσοφία σου για τη ζωή. Ότι όσο Άθλιος και αν είσαι, μπορείς να βοηθήσεις τον εαυτό σου και τους γύρω σου. Ο ήρωας ήταν υπερβολικά συμπαθής και «Άγιος», αλλά είχε το νόημα του αυτή η συμπεριφορά του. Χρειαζόταν προσωπική εξιλέωση και αποφάσισε να δοθεί ολοκληρωτικά σε μία ύπαρξη. Σε μία ψυχή. Σε μία εξαθλιωμένη ψυχούλα που μέσα από τα μάτια της γινόταν φανερή η αγάπη και η ευγνωμοσύνη προς τον σωτήρα της.Το βιβλίο το τέλειωσα σε μόλις μία εβδομάδα και αν και γραμμένο σχεδόν δύο αιώνες πριν, είχε τόσο ωραία ροή, καταπληκτικό λεξιλόγιο, πλήρης περιγραφή του Παρισιού και των δύο «κόσμων» που κυριαρχούσαν εκείνη την εποχή, και χαρακτήρες τόσο καλογραμμένους που δεν αφήνει κανένα περιθώριο αμφισβήτησης για την… πένα του Ουγκώ. Υπέροχο, μαγευτικό, συγκινητικό. Ένα βιβλίο που ανήκει στο Πάνθεον της λογοτεχνίας δικαίως. Ένα βιβλίο που ούτε το 10/10 μπορεί να το χαρακτηρίσει, ούτε ένα μικρό (διθυραμβικό) review μπορεί να το περιγράψει!!!"}], "description": "In this major new rendition by the acclaimed translator Julie Rose, Victor Hugo’s tour de force, Les Misérables, is revealed in its full unabridged glory. A favorite of readers for nearly 150 years, and the basis for one of the most beloved stage musicals ever, this stirring tale of crime, punishment, justice, and redemption pulses with life and energy. Hugo sweeps readers from the French provinces to the back alleys of Paris, and from the battlefield of Waterloo to the bloody ramparts of Paris during the uprising of 1832. First published in 1862, this sprawling novel is an extravagant historical epic that is teeming with harrowing adventures and unforgettable characters. In the protagonist, Jean Valjean, a quintessential prisoner of conscience who languished for years in prison for stealing bread to feed his starving family, Les Misérables depicts one of the grand themes in literature–that of the hunted man. Woven into the narrative are the prevalent social issues of Hugo’s day: injustice, authoritarian rule, social inequality, civic unrest. And this new translation brings astonishing vivacity and depth to Hugo’s immortal dramatis personae–the relentless police detective Javert, the saintly bishop Myriel, the tragic prostitute Fantine and her innocent daughter, Cosette, the dashing lover Marius, and many others whom Jean Valjean encounters on his path to sublime sacrifice.Featuring an Introduction by the award-winning journalist and author Adam Gopnik, this Modern Library edition is an outstanding, authoritative translation of a masterpiece, a literary high-wire act that continues to astonish, stimulate, enlighten, and entertain readers around the world.", "title": "Les Misérables", "url": "https://www.goodreads.com/book/show/2410774.Les_Mis_rables", "average": 4.15, "cover": "https://images.gr-assets.com/books/1320480043l/2410774.jpg", "reviews": 14409, "authors": [{"url": "https://www.goodreads.com/author/show/13661.Victor_Hugo", "name": "Victor Hugo"}, {"url": "https://www.goodreads.com/author/show/187094.Julie_Rose", "name": "Julie Rose"}, {"url": "https://www.goodreads.com/author/show/4747.Adam_Gopnik", "name": "Adam Gopnik"}, {"url": "https://www.goodreads.com/author/show/1067211.James_Madden", "name": "James Madden"}], "type": ["Classics", "Fiction", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/2410774.Les_Mis_rables", "http://www.goodreads.com/book/show/33175.Les_Mis_rables", "http://www.goodreads.com/book/show/15810872-les-mis-rables", "http://www.goodreads.com/book/show/24280.Les_Mis_rables", "http://www.goodreads.com/book/show/1499979._", "http://www.goodreads.com/book/show/119486.Les_Mis_rables", "http://www.goodreads.com/book/show/841078.Les_Mis_rables", "http://www.goodreads.com/book/show/15812846-les-mis-rables", "http://www.goodreads.com/book/show/119485.Les_Mis_rables", "http://www.goodreads.com/book/show/9976857-les-mis-rables", "http://www.goodreads.com/book/show/37839397", "http://www.goodreads.com/book/show/23524925-los-miserables", "http://www.goodreads.com/book/show/17701425-los-miserables", "http://www.goodreads.com/book/show/24284.Les_Mis_rables", "http://www.goodreads.com/book/show/2742179", "http://www.goodreads.com/book/show/13497196", "http://www.goodreads.com/book/show/30597.The_Hunchback_of_Notre_Dame", "http://www.goodreads.com/book/show/63038.The_Man_Who_Laughs", "http://www.goodreads.com/book/show/63040.The_Last_Day_of_a_Condemned_Man", "http://www.goodreads.com/book/show/1572079.Les_Mis_rables_", "http://www.goodreads.com/book/show/63037.Ninety_Three", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}