{"ratings": 1517, "userreviews": [{"userName": "Christina", "userReviewDate": "Mar 15, 2009", "userURL": "http://www.goodreads.com/user/show/334273-christina", "userReview": "I finally finished this book just so I could say I had read it, but it was difficult to get through. I admire Marjorie Hinckley, and it was a bit fun to read about her day-to-day life (the sick babies, the traveling, the gardening ...). I also thought it was interesting to get those little insights into the life of a General Authority and public figure. However, I found the book boring.I thoroughly enjoyed Glimpses into the Life and Heart of Marjorie Pay Hinckley, so I expected this one to be fun to read too. But I found that most of the good insightful quotes were already in the \"Glimpses\" book. This collection of letters is probably fun for Marjorie's children and grandchildren to read, but I thought her other book was much more interesting. I also learned a lot more about Marjorie herself from the other one. She is such an amazing woman, and I just didn't get that impression from these letters."}, {"userName": "Adelina", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/1382079-adelina", "userReview": "I love Sister Hinckley. Before reading Letters though, I didn’t know much about her though, other than that she was the Prophets wife, and anytime I saw photos or video of her, she just radiated love and kindness.Reading Letters gave me such a beautiful insight into Sister Hinckley’s life, and helped me realize she’s just as human as me with similar struggles and worries. The first few letters, as she writes Gordon reminded me of similar circumstances in my life as a very young mother.Now that I’ve finished reading Letters, I’m inspired to write more of my own letters. I’ve been writing my kids letters on their birthdays, but they’re still young and at home. My siblings are spreading around the globe, and because of the ease of social networking, we don’t actually stay in contact as much as I would like. I’m going to follow Marjorie’s example and send a little snail mail love to my sisters and brothers."}, {"userName": "Kristin", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/307083-kristin", "userReview": "My grandma passed away a month and half ago and as I was packing up her extensive library I found this book and started reading. I love the Hinckleys and I enjoyed reading the letters that Sister Hinckley wrote to her family and the glimpse it gave into her life.I miss the days of letter writing. My grandma wrote a weekly family letter and sent it to all of her children. It kept us all involved in one another's lives and up-to-date. Letters used to be such a vital part of one's life. My grandma wrote so many letters in her life time and received so many. Just like Sister Hinckley she wrote regularly to her children and grandchildren. It was interesting to get a glimpse into the everyday life of a woman throughout the many seasons of her life...as a young mother, a mother of teenagers, an empty-nester, a grandmother, and a great-grandmother. The letters included in this selection are sweet and loving, and while not necessarily riveting, there can be no doubt of the love that Marjorie Pay Hinckley had for her family. I especially enjoyed her realistic commentary about what it was like to be married to a general authority in the LDS church. Her honesty was refreshing.My Rating: A sweet and thoughtful book."}, {"userName": "Kay", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/887097-kay", "userReview": "I so enjoyed reading this compilation of letters written by this unassuming, delightful lady- the wife of a prophet of God- to her family. Her cheery attitude and her recounting of her day to day life and service was truly inspiring to me. These letters made me want to be a better person. I am grateful to her family for sharing them in this book. There are many wonderful quotes in this book, but I think this is my favorite from a letter written to her daughter, Kathy: “I have a new project, 1 chapter a day from each of the standard works. I have been on it for four days and am only 3 days behind. Better to have tried and failed than never to have tried.”"}, {"userName": "Alyssa Topham", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/3235811-alyssa-topham", "userReview": "Such great insights into their daily lives. She was full of so much spunk and gumption!"}, {"userName": "Jodi", "userReviewDate": "Jul 21, 2009", "userURL": "http://www.goodreads.com/user/show/1052593-jodi", "userReview": "I'm impressed that so many family members kept letters and postcards from Sis. Hinckley! It's amazing to think that letters were written so frequently and regularly now that we have instant email. This was an interesting book, but not nearly as good as \"Glimpses\" was. I enjoyed reading most of these letters and seeing what a positive attitude Sis. Hinckley had, but by half-way or two-thirds through the book, it started feeling a little more redundant. It was fun to get a better idea of what life was like married to Pres. Hinckley as a general authority and apostle. I was also impressed by her letters because when she wrote them she obviously had no idea they would be published for so many people to read! So it was neat to see how honest her letters were--the reader gets an honest and true sense of Sis. Hinckley's character. It was fun to read about things like having dinner with Jimmy Stewart in 1980 when he came to film Mr. Krueger's Christmas. I laughed out loud at her description of the groundbreaking for the Tanner building at BYU. It was interesting to see more into the life of Sis. Hinckley, and this book left me wondering if I should have been saving more letters from people or writing better letters to others!"}, {"userName": "Sherry", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/1468288-sherry", "userReview": "This isn't a book you want to hurry through because much of it is just day to day trivia. I see she wrote other books that got better reviews than this one, possibly because she wrote it leaving out the trivia. For me it was interesting to find the prophets wife was somewhat discouraged and homesick when she moved to Denver away from her family. I sure was when we moved to Connecticut with four children under eight so far away from friends and family. The little parts would pop up like when she wrote about President Hinkley being ...sick sick of writing and at other times she expressed the speaking and writing as \"chores.\"I loved to read about the prophet being such a handyman and also how involved they were in their children in spite of their assignments. Sometimes she wrote a gem of a thought as this one, \"It is well into the new year and I scarcely have Christmas out of my system yet, although I hope it is all packed away and out of sight for another year. The very worst part is putting it all away--not just the work, but the melancholy of it.\" It made me feel a bit better about my ordinary life."}, {"userName": "Kim", "userReviewDate": "Feb 26, 2008", "userURL": "http://www.goodreads.com/user/show/579325-kim", "userReview": "I liked reading this book. The introduction written by her children explains why: \"We hope that you will see [her letters] as a celebration of the power of the ordinary. We hope that as you peek into the Monday, Tuesday, and Wednesday-ness of her life, you will see with new eyes the value of your own.\" Here is this family we revere for their righteousness and upstanding lives, and this collection of letters shows us that they lived lives similar to ours, except with all the extra traveling and responsibilities. But Sister Hinckley was plagued by similar concerns--sick children, the need to do yard work, and the inability to find cute clothes when shopping. Having read Gordon B. Hinckley's biography, it was interesting to get Sister Hinckley's perspective on their lives. And I think I liked it because I know several of the Hinckley's children and grandchildren."}, {"userName": "Missy", "userReviewDate": "May 17, 2008", "userURL": "http://www.goodreads.com/user/show/963226-missy", "userReview": "Lovely is not a word I use a lot, or at least not whe I am being serious. Honestly, though, there is not a better word to describe Sister Hinckley than lovely. This book was such a breath of fresh air. Letter writing is truely a lost art. It was fun to see into the corners of her life and realize that she had the same struggles many of us face - weight gain, wild children, etc. Sometimes she was even in a grumpy mood (if you can believe it!). However, she got over it quickly and was back to counting her blessings. At the end of the book was a letter that President Hinckley had written to her. It was beautiful. You can tell what a treasure she is to him, and that he was the great man that he was because of her. We can all take a lesson from that."}, {"userName": "Heidi", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/1049866-heidi", "userReview": "This book was a quick read. However, I had a hard time being inspired to read it. I am sure that the letters hold higher sentimental attachement to family members. However, since I didn't fall into this slot, it wasn't the most interesting book ever. It did have a few jems in it though such as some funny stories about the Hinckleys as well as being very informative about life as a General Authorities wife."}, {"userName": "Laura Farrer", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/10795627-laura-farrer", "userReview": "Absolutely LOVED this book!!! I mean I already loved the Hinckleys, but I was crying and laughing through the whole thing. It was wonderful!!"}, {"userName": "Charly Troff (ReaderTurnedWriter)", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/72233814-charly-troff-readerturnedwriter", "userReview": "This is a collection of letters that Marjorie Hinkley wrote to different relations throughout her life, compiled by her children she died. It was of course beautiful. I loved seeing how patient she was with the hardships she faced and with how much the church asked of her husband. I also loved seeing the everyday life she described with young kids at an earlier time than I'm living with young kids and found some of her insights very true and relateable.In my life, it has not only given me a travel bug, but also remotivated me to begin writing letters to my loved ones who don't live close by."}, {"userName": "Angie", "userReviewDate": "Dec 03, 2017", "userURL": "http://www.goodreads.com/user/show/1041880-angie", "userReview": "I enjoyed this book of letters from Sister Hinckleys Life. Her family has divided them into sections like the letters she wrote as a young mother, letters from her travels, and even letters she wrote to her grandchildren. This book is a very intimate way to get to know Sister Hinckley, as you get to read her own words and get a real sense of her wonderful personality. My admiration and love for her grew from reading this book."}, {"userName": "Becky", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/932316-becky", "userReview": "What I enjoyed about this book is the recording of ordinary and at times hard times of life. She showed grace and grit and determination and I just love the nostalgia of letter writing, something that is lost in my generation. An uplifting read which helped me ponder on how I can better keep connections with my family and our children as they grow up."}, {"userName": "Megan", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/1299500-megan", "userReview": "This book is composed of letters that Sister Hinckley write to various family members from the time she was a young mother to a grandmother. I was impressed with just how ordinary she was. It gives a glimpse at just how busy an apostle is and just how tired they can get. Such sacrifice for families."}, {"userName": "Marlene", "userReviewDate": "Apr 05, 2018", "userURL": "http://www.goodreads.com/user/show/54985755-marlene", "userReview": "I love the sweet messages, the direct language, and the witty sense of humor that tell the story in the letters from this amazing woman. Life was not always peaches and cream for the wife of a future prophet of the Lord. But she rarely let it get her down and just kept moving forward. If you didn't already love this woman, you will after sharing in her thoughts, hopes, and dreams."}, {"userName": "Melanie", "userReviewDate": "May 04, 2017", "userURL": "http://www.goodreads.com/user/show/1637130-melanie", "userReview": "I love how down to earth she is."}, {"userName": "Wendy", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/2222383-wendy", "userReview": "It was so fun to learn more about Marjorie Hinckley through the letters she wrote to her family. What a wonderful person!"}, {"userName": "Mary Ellen", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/37827256-mary-ellen", "userReview": "I love Marjorie Pay. I was super excited about this book. However, I have to agree with a lot of reviewers. These letters would make a great family keepsake, but it wasn't the most exciting of reads. It was mostly notes about who was sick, where she had traveled, things she needed to buy, etc.  It was fun to get a feel of her day to day life, but I don't feel like I learned much about her. Her letters weren't thoughts on life or even much about anything other than the mundane day to day stuff."}, {"userName": "Erin", "userReviewDate": "Feb 18, 2017", "userURL": "http://www.goodreads.com/user/show/1450195-erin", "userReview": "Delightful book that gives the reader an inside look to what a beloved wife of a Prophet is really like. If you read the Introduction to the book, written by her children, it is very clear as to the reasons this book was published. If you read with those reasons in mind, you will not be disappointed. Letter writers are obsolete now, as we have instant communication audio and video, e-mail, social media, etc. As a faithful journal writer, I appreciated reading Marjorie Hinckley's letters. I love her interest of travel and how she described the various places she visited. I also love her optimism and faithful spirit that came through as I was reading. Reading what she wrote about everyday life, was fun."}, {"userName": "McKenna", "userReviewDate": "Feb 19, 2017", "userURL": "http://www.goodreads.com/user/show/24739849-mckenna", "userReview": "I think the most valuable thing about this book is just what it portrays about Marjorie herself. She's very human as well as very good, and her humor and humility are inspiring."}, {"userName": "Stephanie", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/1011479-stephanie", "userReview": "I have already read this but it's been a while. I was impressed to read it again this past Sunday after watching the Gordon B. Hinckley movie with one of my boys. I love the candidness of this book, the glimpse that it is into this amazing woman's life. It helps me feel better knowing that even the wife of a prophet was concerned with the everyday drudgery of endless housework/repairs and things as simple as hairstyles and clothes. She kept herself HAPPILY busy, going about the ordinary tasks of life while living an incredibly EXTRAordinary and exciting life. Some of my favorite excerpts: \"Finished the Book of Mormon this morning in response to Dad's challenge. No 24-year-old boy could have written it. People wouldn't get into so much trouble if they read it continuously. What a book!\" \"P.S. Angela (one of her grand kids): In your note you said \"sorry if we got on your nerves sometimes.\" Now I ask you, how could you get on my nerves? What a thing to say, when you know it was pure joy to have you here. Thanks for coming and for just being you. I love you so much.\"Ohhh! It is just so fun to hear HER voice expressing her concerns and worries about life amidst her unwavering testimony and total devotion to her family. So inspiring! I'm sure this isn't the last time I'll read it."}, {"userName": "Kate", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/946539-kate", "userReview": "I belong to The Church of Jesus Christ of Latter-day Saints, and believe that God has called prophets to lead His people in this day and age, just as He did in Biblical times. One of those prophets was Gordon B. Hinckley (1910-2008). President Hinckley led the Church from 1995, until his death in 2008, and until her death in 2004, his wife Marjorie Pay Hinckley was always by his side. I cannot think of anyone who didn’t adore Sister Hinckley. She was a small, smiling, grandmotherly type woman, who always had a gracious word for everyone. When a friend of mine reviewed her book ‘Letters’, I knew it was something I wanted to read for myself, and I am so glad I did. My impressions of Sister Hinckley were of a gracious woman, one who found joy in life, but was content to be in the background. From her letters, I learned that my impressions were correct, and yet I learned so much more. Her personality really shone through in her writing, and I found myself smiling and laughing at her humour and use of words like ‘swell’ (let me tell you, that did NOT sound like the Sister Hinckley I was familiar with, but did it ever endear her more to me!) and such. If you want to get a more complete glimpse into the life and personality of Marjorie Pay Hinckley, I HIGHLY recommend this book!"}, {"userName": "Kristopher Swinson", "userReviewDate": "Aug 27, 2009", "userURL": "http://www.goodreads.com/user/show/1180061-kristopher-swinson", "userReview": "I'm not so certain that \"one of the appealing things about these letters is the unremarkableness of the accounts\" (93). It felt as if we had to perform all the labor to glean insights after poring through years' worth of ordinary family accounts. This is partially because she wasn't one to complain (33, 41, 72, 79) or immodestly put anything forward. This elect lady shared her husband's concern for the one (see 234).I was very amused at their busy pace, as they \"were not born to be Saturday golfers\" (124), and \"We had the TV repaired this week, but I don't know why. We haven't found a program worth sitting through yet\" (63-64). You'd never have known President Hinckley had a respiratory weakness (66; see 155), as he was \"always away\" (73; see 75, 78, 147, 161, 225, 240). In 1959, she sat \"in a Sunday School class with him for the first time in 22 years of matrimony\" (80).All told, this is not a time investment for the lazy, and I'd rank it far behind her other writings. There's a reason why people prepare focused public addresses."}, {"userName": "Angie Bollard", "userReviewDate": "Jun 30, 2008", "userURL": "http://www.goodreads.com/user/show/922190-angie-bollard", "userReview": "I loved this book. Sister Hinckley was my favorite person. She had such a cute sense of humor and she had a beautiful soul. That shines through in this book. From raising a young family to traveling the world over. She saw much of the world and she still wrote about her longing for home and family. Some of my favorite parts are:-When she attends the dedication of the business administration building at BYU and they use dynamite for the groundbreaking ceremony and they used a little too much and knocked out a girl standing 5 feet from Sister Hinckley.-When she had dinner with Jimmy Stewart when he was making \"Mr. Kreuger's Christmas\".-When the Secretary of State knocked on her door to ask when he could have her room for a Vietnam Peace Summit."}, {"userName": "Queen", "userReviewDate": "Feb 18, 2008", "userURL": "http://www.goodreads.com/user/show/917155-queen", "userReview": "I absolutely adore this book. I adore Marjorie Hinckley to begin with. I admire her and when I read these letters and saw that she was just like us as a young mother, it gave me hope. Granted, she is more patient and lovely, but it was nice to read a letter where she uses the word \"freak\". I love that she gets irritated by the things we do. That it's ok to be REAL. That's what I love most about her and President Hinckley. They keep it real. They don't have time for playing a role - they just do it they way they are.This book is a must for women, mothers... sisters... love it. I keep it close by whenever I have a moment to spare. It always brings me joy/hope."}, {"userName": "Melissa T", "userReviewDate": "Sep 05, 2008", "userURL": "http://www.goodreads.com/user/show/1100748-melissa-t", "userReview": "Ah the Hinckley's, how I miss them. This book is actually a collection of letters written by Marjorie Pay Hinckley to family members over the years and demonstrates her quiet strenght, her unfailing love, her sweet faith. I felt as though some of the letters were written to me, she has a way of cutting through the fluff and getting right to the heart. I adore her and hope to meet her in person someday. I would read anything written by her - she certainely fits the definition of an elect lady."}, {"userName": "Kristen", "userReviewDate": "May 17, 2011", "userURL": "http://www.goodreads.com/user/show/137397-kristen", "userReview": "I really enjoyed this book - why did I wait so long to finally read it?!!!? Walking away from this book, I think the thing I'll take with me the most is that Sister Hinckley was a completely normal, imperfect person, who, in spite of all that, did extraordinary things! I think we often find ourselves thinking we're not as good as other people, when, in essence, we're only as good as we allow ourselves to be. Sister Hinckley's personal letters were a breath of fresh air to my sometimes downhearted soul!!"}, {"userName": "Melissa", "userReviewDate": "Aug 22, 2012", "userURL": "http://www.goodreads.com/user/show/1631362-melissa", "userReview": "I thought this book was really cute. I have always wanted to know what Sis. Hinckley is like. I enjoyed reading her letters written to family members at different points in her life. They gave me a taste of what she was like and what her life was like. I learned that her life was filled with daily routines as mine is, yet she was a strong, amazing woman, truly an example to us all. She gives me something to aspire to! I recommend this book to anyone who wants a glimpse into the sweet and witty heart of Sister Hinckley!"}, {"userName": "Karie", "userReviewDate": "Aug 13, 2008", "userURL": "http://www.goodreads.com/user/show/1098923-karie", "userReview": "This book was a priceless window into not only an amazing woman's life, but also into the ordinary life of a woman, mother, sister, daughter, and wife. Marjorie's candid and funny expressions on life's great moments and challenges were comforting and inspiring. The letters written to various family members over the years (her children, her family, her husband, and even grandchildren) give one an idea of the well rounded loving but realistic faithful woman that Marjorie Hinckley was. It is easy to come away from this book just loving that woman!"}], "description": "When Marjorie Pay Hinckley passed away in April 2004, every woman who had ever known her, even merely through reading her books or hearing her speak, felt as if she had lost a friend. Sister Hinckley looked at life with a twinkle in her eye. Her genuine interest in others made them care a little more for each other. Her quiet, constant support of her husband showed what an eternal partnership could be like here and now. Most of all, her shining faith was a beacon of hope for thousands, even millions of people across the world. Sister Hinckley's legacy of love and faith and humor is preserved, in large part, in the many letters she wrote over the course of the years. Letters is a sampling of those marvelous communications, a look behind the scenes at the life of an extraordinary but somehow delightfully \"real\" woman, wife, and mother. The letters run the spectrum of experience: her trials as a young mother, her musings sent to adult children, her observations on her travels, her words of love to grandchildren. In them, a portrait emerges of a woman whose life is not so different from our own, a woman who took the everyday experiences of her world and made of them something beautiful and lasting. \"Of all the things that she left behind when she passed away at the age of ninety-two,\" write her five children in the introduction to this book, \"we treasure nothing more then her letters and postcards. We hear her voice; she returns to our circle and helps us remember earlier times. In the touch of the paper and the tidy, small handwriting we are tangibly connected again.\" Readers everywhere will appreciate the opportunity for this final, tangible connection with a much-loved friend.", "title": "Letters", "url": "http://www.goodreads.com/book/show/399196.Letters", "average": 4.4, "cover": "https://images.gr-assets.com/books/1387730663l/399196.jpg", "reviews": 165, "authors": [{"url": "https://www.goodreads.com/author/show/226482.Marjorie_Pay_Hinckley", "name": "Marjorie Pay Hinckley"}], "type": ["Nonfiction", "Christianity", "Religion", "Religion", "Lds"], "outlinks": ["http://www.goodreads.com/book/show/399196.Letters", "http://www.goodreads.com/book/show/8728588-letters", "http://www.goodreads.com/book/show/399197.Small_and_Simple_Things", "http://www.goodreads.com/book/show/399198.To_Women", "http://www.goodreads.com/book/show/2090536.Mothering", "http://www.goodreads.com/book/show/30133424-she-s-a-mom", "http://www.goodreads.com/book/show/1840674.The_Wondrous_Power_of_a_Mother", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}