{"ratings": 396, "userreviews": [{"userName": "Gigi", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/14801913-gigi", "userReview": "this is one of the rare occasions when i wish i could call the author and vent my frustration about devoting hours of my life to their craft only to be shoved down a literary trap door. i am flat out annoyed by how ridiculous this story became. ridiculous and lazy and negligent.when you meet the main character mead, you are at first tempted to not go on his journey because you're sure you've heard it all before. ten year old boy, wildly smart and ostracized by his peers, somewhere-ville small town usa, parents with unrealized dreams who make all the wrong choices when trying to set it right for their kids. throw in a hearthrob older cousin who plays softball and a quarry where the kids make daring leaps all summer and you know where this story is going.but you forge ahead, because in the opening chapters there is something compelling about the language and a hint of something new about this coming of age tale. and so you follow mead through incidents with bullies, puberty and embalming and then to college where he discovers girls, cd players and seduction at the hands of a wealthy, conniving elder classman who has problems of his own with old dad. blah blah blah. i am not going to talk about plot points because they're average at best. and then, for no reason at all (although, perhaps, a feeble spin at holden caulfield's repeated use of \"damn\" or \"and all\"), mead starts saying \"shit\" every dozen sentences. literally. we're talking scores of \"shit\" littered all over the second half of the novel. standing alone or tossed in mid sentence. for instance: \"time enough to get some work done, to finish mapping out that stupid outline for the dean. visiting mathematicans. shit. that's heady stuff.\" OR (not half a page later) \"the dean has invited professional mathematicians, the most brilliant minds in the field, to come listen to me. me! shit i am going to look like a fool up there on that stage.\"i struggled through the second half of the book (one must never put a book down once started), trying to avoid those \"shits\" like literary landmines. impossible. by the time i came to the end of the book (and to a finale that was actually more offensive than the landmines!), i felt like i had been pelted with cactus plants all afternoon.in short: no go on Life After Genius."}, {"userName": "Jennifer Defoy", "userReviewDate": "Nov 03, 2011", "userURL": "http://www.goodreads.com/user/show/1613620-jennifer-defoy", "userReview": "This was a weird one for me. I liked the story, even though it was a bit odd, but I didn't really connect with the main character. But the mystery of why Mead came home was pretty engaging. I just wanted to know why. The story jumps around through different times in Mead's life. It got to be a bit confusing at times, as Mead also seems to be having a bit of a nervous breakdown throughout the story. But the jumping around really adds to the mystery of what happened and if Mead really is starting to loose his mind.Mead appears to have had a rough social life growing up. Being so smart and so much younger than the kids he's in school with made him a bit of a target for bullies and such. So it's really no surprise that once Mead goes to college young he's still an outcast. Herman, Mead's best friend/mortal enemy tries to befriend Mead for a while and has to take a HUGE step to get Mead to really open up. But as the story progresses we learn that while Herman seems to have been born with the silver spoon his life wasn't really all that easy. Even though I didn't particularly care for either of the main characters there was something about this story that I couldn't walk away from. It was so out there at times and yet so \"normal\". It's so hard to describe. Even the ending was a bit odd, and it left more questions than it answered. But at the same time most of the really important stuff is cleared up before we get to the end. Like I said it's hard to describe..."}, {"userName": "Jeffrey", "userReviewDate": "Mar 07, 2009", "userURL": "http://www.goodreads.com/user/show/747648-jeffrey", "userReview": "Mead Fegley is a genious and goes to college at a young age to study mathematics where he has a real aptitude, but his journey to college is waylaid and he rushes home a few days prior to his presentation of an important paper on a noted mathemician's theorem. Jacoby's tale is split into three separate time lines, which are her way of showing how Mead turned out the way he has, what happened in college and why he left. This non sequential story worked for me although I could see how it would not work for everyone. The most recent timeline is right before his presentation of the paper and graduation from college, one of the other timelines is three years before when he started going to school and the other is about his life as a youth. There are a lot of side issues that Mead has to deal with besides the main one. Firstly, there is the death of his cousin. Then there is his cold mother. Finally there is the situation with his Aunt's reaction to his cousin Percy's death and finally there is his situation with Herman Weinstein, a student in his college who he is running away from. In the end Mead does grow up a little and take awareness of his life, but as in all decent books its the journey of self discovery that is the main thing and I thought this journey was handled well."}, {"userName": "Alice", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/8612372-alice", "userReview": "Mead Fegley is a solitary 15-year-old prodigy who flees his oppressive, well-meaning family for the wilds of a prestigious university in Chicago. I find the book intriguing and a wonder to read, thought provoking and conversational. With the structure of the suspense with Mead without reason stopping home, despite the fact that what he chooses to do after he returns home was never revealed, Jacoby provides readers with the urge to read page after page to find out what goes on next. For some that wants to be on the top of the world as a genius, this novel provides another perspective, from the first person narrative point of view, as a matter of fact. As an unique individual in the society of one, Mead insulated himself from family and schoolmates out of self-preservation and desires to connect. The novel, however, appears to be unfinished, and there really should be a sequel to what happens next, with Mead finding out his real purpose in life, are some topics untouched at the end of the novel."}, {"userName": "Miriam", "userReviewDate": "Jul 28, 2008", "userURL": "http://www.goodreads.com/user/show/27572-miriam", "userReview": "Totally great, almost surreal story about a boy genius who loses it six days before he is supposed to graduate from college (at age 18). I'm totally fascinated by extraordinary minds and this book really captures the anguish that can go along with being just a little bit different.It's an adult book, but I think it would appeal to fans of YA as well."}, {"userName": "Jeruen", "userReviewDate": "Jun 09, 2011", "userURL": "http://www.goodreads.com/user/show/5603048-jeruen", "userReview": "Awesome book this truly was. Oops, time to switch to the non-Yoda dialect.Anyway, I should say that I thoroughly enjoyed this book. It was very interesting and captivating that I blasted through it in just a couple of days.So, this is a book that revolves around Theodore Mead Fegley, who is a math genius, genius enough to skip several grades in elementary, middle, and high school, and enters college at 15, and finishing his undergraduate in less than three years. Almost, since the book begins when he walks out of college a week before graduation, without delivering his senior thesis.Several characters revolve around Theodore. His father, Lynn, is an undertaker, very quiet, refuses to accept a scholarship for his son and instead insists on paying for his college education on his own. His mother, Alayne, is this control freak, who thinks that Theodore is different from his father's side of the family, and dreams big for her son. She basically is the typical parent who wants their kids to do the things that they were unsuccessful in accomplishing. Theodore's aunt Jewel, used to be a very caring aunt, but now, after the death of their son Percy, she went into catatonic depression. Uncle Martin on the other hand is a fellow undertaker, managing the family business of a funeral home, and is harsh and cruel on Theodore, because he blames him for Percy's death. In short, every character in this book has their own skeletons in their closets.I suppose it is difficult to recreate the conflicts that this book presents, as everyone seems to be blaming everyone for the existence of their skeletons. Theodore decides to have a new life once he enters college, so he wants everyone to call him by his middle name now, which is Mead. This creates a divide in the arenas in the book: his family members still call him Teddy, his school associates call him Mead, while his arch-nemesis calls him Fegley.Growing up, he battles the bullies, destroying his science project, embarrassing him to various degrees. He also battles the cutthroat people in college, people who would go into depths of crime and bribery just to get an A, like his \"friend\" Herman Weinstein, who turns out to be the person that he battles the most in the story.The book presents a very good scenario for several psychological conflicts. It indeed is psychological fiction at its best, although I think it may have been a little over the top. There are too many abnormal people in the story, which I think is the only bad element of this book. But then again, who in the world is normal? We all have skeletons in our closet.I have to say that I liked this book a lot, and found plenty of things in which I can relate. Mead has conflict with his parents: her mom only wants one thing, that is, to get him out of the small town of High Grove, Illinois by means of his genius. His father on the other hand secretly desires his son to be an undertaker like him and continue the family business. So there's the overprotective mother and the very impassive father. Their family dynamics are so extraordinary that I feel pity for Mead. It also made me appreciate the value of openness, and listening. Mead's parents didn't even listen to him, only insisting on what they think was best. Never did they realize that they had to listen to what Mead had to say as well, they only realized that late in the game, when their kid is all grown up. In the beginning, they were more willing to think that Mead was simply hallucinating instead of taking his word for the truth.With respect to the structure of this book, I highly took a liking to it, since it wasn't the traditional chronological narration. Every chapter was dated, as to how many days or years it was before graduation. Thus, the chapters were in different time periods in Mead's life. It was presented based on content, and not based on the date. One chapter can be 8 years before graduation, when Mead was just 10, and the next can be 3 weeks before graduation, when his parents were in town visiting the university. In this way, I believe the author had trusted her readers that her readers would be smart enough to reconstruct the missing links in between the episodes. I liked that factor, since it needed use of my brain by requiring me to read between the lines.I also liked the ending. The conflicts were slowly being resolved, one by one. One by one, Mead's family members get normal, and finally sees the light, in a way. However, the good thing is that the author did not fully end the story. The main conflict is between Mead and his relationship with Herman Weinstein, and the ending leaves it hanging, welcoming the reader's imagination to fill in the blanks.Overall, a very awesome novel. 5 out of 5 stars."}, {"userName": "Carey", "userReviewDate": "Oct 29, 2008", "userURL": "http://www.goodreads.com/user/show/1496307-carey", "userReview": "What could drive a brilliant young man to leave college eight days before graduation, without his degree, and return to his hometown to work in the family Mortuary business? Being a genius is a difficult thing. For Theodore Mead Fegley, it has brought him nothing but grief. He started high school at the age of twelve, finished in three years, and started college at the age of fifteen. He has always been younger and smaller than everyone else. And, of course, the victim of taunts, ridicule and pranks for his entire school career. He is thrilled to go to college, where he thinks he will be among equals, learned individuals who will value his intellect. Poor kid, how wrong he is.To facilitate the brand new start Theodore feels he is getting with college, he starts to go by his middle name, Mead. Unfortunately, the very first day he is reminded, yet again, that he is different from everyone else and does not fit in. Girls are too old for him, he is too young for drinking and partying, he has little in common with other young men on campus. His life is lonely and friendless. His only real friend, his cousin Percy, is off pursuing his dream of baseball glory. Percy sends a constant stream of postcards to Mead, letting him know what is going on in his life. But since Mead has no friends he doesn't really know how to BE one, so he never responds to Percy's postcards.Mead excels at mathematics and spends his college career working on solving the Riemann Hypothesis, a 150 year old mathematical theory. When Herman, a wealthy and attractive fellow math student, befriends Mead it seems a little strange to him that this guy would want to spend time with him. But Herman offers to help Mead on the Riemann Hypothesis so, against his better judgement, Mead allows himself to go along with Herman's schemes. The results will force Mead to change, come to some important realizations about life and to see his parents and family through new eyes.With Life After Genius, M. Ann Jacoby has written a wonderful story about the process of growing up. It is not enough to be smart, maturity lies in the ability to put aside your selfish concerns and do what is better for others, both people you love and people you may not like very much. She reminds us all about the discomforts of our school days when all we wanted was to be included, be liked, be part of the \"in\" crowd. You will fall in love with Mead Fegley, a sweet and awkward boy who learns the most important part of being a man."}, {"userName": "Serena", "userReviewDate": "Oct 20, 2008", "userURL": "http://www.goodreads.com/user/show/1349220-serena", "userReview": "Life After Genius by M. Ann Jacoby is a book that examines one young genius' struggle to find himself and his place in his own family and society.Theodore Mead Fegley's father runs a furniture store and funeral home with his brother Martin, while his mother's main goal in life is to push her son to achieve as much as possible and not squander his intelligence. The pressure mounts for Mead as he speeds through his elementary and high school years, reaching the University of Chicago at age 15.The narrative easily shifts from the present to the past, and the chapter breaks make it easier to keep the timeline in perspective with details about what period in Mead's life is witnessed and what location he is in. Mead is a young teen thrust into academic life with peers who are much older and experienced. Mead's life takes a stark turn when he meets Herman Weinstein, a fellow mathematics student at the university. Mead's pushed aside as his faculty advisor chooses Weinstein over Mead after the professor is offered a department head position. Mead is angered by the turn of events, but only until he finds a new mentor, Dr. Alexander. Mead throws himself into the Riemann Hypothesis, and he hopes to either prove or disprove the hypothesis, which has been debated for more than 100 years.Jacoby easily weaves in events from Mead's past into his present and how those events shape Mead and his actions at the university. Herman insinuates himself into Mead's life, and tensions rise until Mead finds himself running home to rural Illinois before graduation, his major mathematical presentation, and his valedictorian speech.While math problems make me cringe, this story brought me back with the discussions of matrices--math I actually understood at one point--but Jacoby does a great job of including this information without burdening or boring the reader. As Mead's life unfolds and the mystery grows more intense, the pages flow quickly as the reader grows more anxious to find out why Mead left the university. This novel is dubbed as an academic thriller, but it is more like a coming of age story. Mead finds himself, what's important to him, and how to cope with his reality."}, {"userName": "Sara", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/6605347-sara", "userReview": "I lied a little bit. I haven't actually finished reading this book, but at page 110 I have grown so tired of it that I thought I'd read the reviews here to see how it all plays out. Unfortunately, no spoiler alerts, so I might never learn what the mystery is and if Meade ever gets his young life together. I couldn't help thinking that the author was trying desperately to write Catcher in the Rye for the 21st century. The writing is so self-conscious, contrived and clichéd, and I just hated to see the way Meade was treated throughout his life; it borders on sadistic to put this poor character, and the reader, through such torment with no real pay-offs or even enlightenment. To me, it is a depressing book and a very sad commentary on human nature. I found little to like in any of the characters, including Meade, and the small dingy world they all inhabit and the mystery wasn't enough to pull me through to the end. Later that day...Well, I cheated (first a liar and now a cheater, this book is making a monster out of me!) and skipped over to the last two chapters, just to give myself a sense of \"closure\" (hate the term, but it's useful here). If anything, the ending of the book made me hate it even more, it left me with a dull empty feeling and the sense of being had - which makes me angry. It's been a long time that a book has caused this kind of visceral anger in me and I have reduced my initial two star rating to just one. Perhaps it is mean-spirited of me, but I wonder if this book was published simply because the author is in the publishing business herself. You know that old expression, \"it's not what you know, but who you know\"; in my opinion, this book should never have been published. (the cover is quite good though)"}, {"userName": "Katherine", "userReviewDate": "Dec 27, 2011", "userURL": "http://www.goodreads.com/user/show/6134235-katherine", "userReview": "A coming-of-age story, if anything, is what Life After Genius develops into as the life of Mead Fegley unravels and re-ravels as he struggles with choices he makes in his final year of college. Mead, a childhood genius who, quite easily, is accepted into college at the age of 15, and is set to graduate at 18 decides, willingly, to throw away his entire education. His reason to do this? To give up possible fame of becoming the closest person in history to get anywhere near disproving or proving the Riemann Hypothesis, as well as his entire education, I found, very, very silly. Albeit, this story hops from one time in Meads life to another, from his childhood, to the present, the future, and back again. This style of writing is not confusing, as it adds to the interest of the book, although it does become an immediate frustration once the mystery of why Mead came home begins to unfold. I must say this book was interesting, and I found myself leached to it for two days straight. With both the arrangement of the chapters, and the impressive setting and character descriptions that help you imagine each scene, this book will not disappoint if you are looking for a gripping read. It keeps you wanting, which keeps you reading. However, in the end you are left with many questions; the only downside to the novel. After everything begins to add up, and you think you know what will happen, it ends. Just like that, three hundred and eighty some pages later, it ends without an explanation. That is the only downside, and that is why this book is lacking its final star. I recommend this book to any young mind that enjoys coming-of-age stories, as this is one that may resemble well-known novels of the same genre, it is able to stand its own."}, {"userName": "Christine", "userReviewDate": "Dec 14, 2014", "userURL": "http://www.goodreads.com/user/show/10974082-christine", "userReview": "I finished this book in a day. Couldn't put it down. Loved every second of it. At least, until I got to the last page, realized it was over and now I'm dealing with emotional trauma dealt at the hands of a book! This was going to be one of my all-time favourite books, but I don't know how to cope with the ending. If the author had tied up more of the loose ends I wouldn't have thought twice about giving it five stars. And maybe that's part of the point of the book; life isn't tidy and things are rarely finished up neatly when it's all said and done. But just because life is that way doesn't mean that's how I want my books to end! Argh! I'm traumatized I tell you! Traumatized!"}, {"userName": "Brian", "userReviewDate": "Nov 28, 2011", "userURL": "http://www.goodreads.com/user/show/6399555-brian", "userReview": "A predictable, and not especially cleverly written piece.Sometimes it is hard to write up characters who are smarter than yourself."}, {"userName": "Julie Shelton", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/17912297-julie-shelton", "userReview": "The characters and story are good. But it just kind of went on a little too long. The nagging question I'm left with is What does being a friend really mean? It makes you think about those relationships that were hard. The ones you let go and the ones you kept."}, {"userName": "Ashley", "userReviewDate": "Aug 18, 2009", "userURL": "http://www.goodreads.com/user/show/1587865-ashley", "userReview": "Oh, Ann. Ann, Ann, Ann. We started off so well - Mead is a great character and you handled his somewhat overdone (super smart kid that starts college early but is still oh-so socially awkward) with surprising dexterity and relatability. Your writing is good and the pace was perfect. And the jumping from before graduation to after graduation with the pivotal event of the book being the convergent point totally worked! But the last 20 pages? That is were things went off the (pun intended) proverbial cliff, Ann. What happened? Did you give up? Were you exhausted from putting together a really great 350-ish pages before that? Or perhaps you became preoccupied, like Mead, with the Riemann hypothesis? Whatever it was, when I read the last sentence - with a growing sense of unease that had been mounting for the last 20 pages that things were not about to end well for anyone, least of all me - I thought the edition I bought was missing a few more chapters. They must have stuck the draft ending that your editor surely would have had a conniption over. But no. For whatever reason, you and your editor and whoever else reads books before they get published decided that this was the best ending; that it belonged and meshed with the rest of your story. I disagree. The ending was a big letdown and I closed the book feeling like I had waited all week - all week! - to watch the season finale of my most favorite show that I had DVR'd. I looked forward to settling in and enjoying every minute of it, to savor it. Only to press play and see that for whatever reason my DVR decided to record an hour of the weather channel. I have no idea how many stars to give your book, Ann. The first part was great; when anticipating finishing the rest of it tonight I thought at work - just a few hours ago - that I finally had found another book worthy of 5 stars (I'm notoriously stingy with them). But then I got to those last few pesky pages. I was blindsided by Weinstein. And I can't decide if I love you for that or not. Obviously, these are my initial reactions as I literally just finished the book. You definitely got a reaction out of me, and isn't the reason anyone writes? Will come back later to rate."}, {"userName": "Francis", "userReviewDate": "Apr 22, 2009", "userURL": "http://www.goodreads.com/user/show/1232443-francis", "userReview": "This book is a coming-of-age story about a boy, Mead, who goes off to college at 15 after enduring a childhood of ostracism in a small town and an overbearing mother who demands that he rise above the mediocrity of his father's family, and it is also a story of academic, professional, and personal betrayal, written in a mixed-chronology suspense format, to gradually unveil the characters' backstory and motivations.The book appears to be the author's first, and I felt it was rather rough around the edges. In my opinion, most of the characters were caricatures: the overbearing mother in a chair scolding him for not being good enough \"the six-legged monster\", the flamboyant spoiled rich kid upstairs who becomes his best friend and ultimately betrays him, the haughty academic who passes Mead up at first but then needs his brilliant work later, the elderly, eccentric genius professor who takes Mead under his wing, etc. Also, I felt that the mathematical and academic dialogues were rather stilted. She said that she was inspired by Derbyshire's \"Prime Obsession\" and I am surmising that she did not have much mathematical training beyond that. I think it would have beneficial if a someone with more mathematical training had copyedited the book to enhance the authenticity of the technical details, which included rather odd course names like \"Theoretical Geometry\" and a dialogue that appeared to be an attempt at \"testing\" Mead's mathematical skill using the Sieve of Erathosthenes. (Something like Paul Erdos' quizzing of Lajos Posa with the question of why n+1 distinct integers between 1 and 2n must include two that are relatively prime would have been much more authentic in my opinion.) I also felt like the resolutions of the various central conflicts by revealing the traumas that motivated the respective characters to behave in their irrational manners was predictable.The subject matter was interesting but I felt that the book was a little too trite to be very engaging, and I was distracted by the technical inadequacies."}, {"userName": "Corinne Edwards", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/875001-corinne-edwards", "userReview": "Mead is one of those boys - the ones who keep skipping grades because they are so smart, the ones that everything academic comes easily to, the ones who are destined for great things. If only it was that easy for Mead. Growing up the \"genius\" in his town was a pretty harrowing experience. Combine some worse-than-usual bullying with a kid who has a lot of brains but virtually no social skills and an over-the-top mother and you get: a pretty traumatic childhood. Mead hopes that all this will change when he \"grows up\" and goes to college at 15, but when we meet him at the beginning of the book, he has just run away from his college graduation.The book is almost like a mystery - where we know what happens almost at the end but we have no idea how we got there and the book takes us back and forth between the past and the present. I really liked this style and it kept me very interested in the story. It was nearly a thriller, often surprising me with a turn of events and I could tell that the author had really done her homework because the mathematical lingo felt credible (I even threw a few theorems out to my husband who backed her up). While there were a few characters I found very sympathetic, Mead was not one of them. I wanted him to find a way to be happy, but to be honest, his general lack of judgment was very frustrating to me. I think partially I was really hoping for Mead to learn a little bit more about being something more than a \"genius,\" so maybe I just had the wrong expectations for the novel.I am reminding myself that not everyone can love every book. As much as I wanted to like this one, the coarse language and the portrayals of the underside of college life turned me off too much to love it. For those less sensitive than me, I do think that Jacoby has an interesting story to tell about a boy finding his place both in academia and in his family."}, {"userName": "Nikki", "userReviewDate": "Jul 01, 2011", "userURL": "http://www.goodreads.com/user/show/1125599-nikki", "userReview": "[and would continue to cave under the manipulation of people like Herman while not bothering to consider anyone else around him. And was that a literal cliffhanger...? *rolls eyes* (hide spoiler)]"}, {"userName": "Jennifer", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/1460754-jennifer", "userReview": "To be completely honest I always throw a book in the bathroom. Who knows when you are going to need one in there to stave off boredom, so I keep one at hand. It's always a book that I own because...any alternative seems gross to me. Usually at some point I will pick up the book and then it will become \"the book I'm reading\" because it will have captured my attention to the point where there is no going back and I have to finish it. That didn't happen with this book.It's not that I didn't like it. But it is a slow, quiet book with a relatively slow and quiet ending in which nothing much really happened that felt pressing enough that I couldn't put it down and wait for another day to continue on with the story. Finally, I got to the end of the year and I still had about a hundred pages left to read, so in the interest in \"finishing off the reading of last year\", I just made it \"the book I'm reading\" and finished it. It didn't take long, but it wasn't the sort of reading urgency that I like. I really wanted to like this book, but I just couldn't muster the kind of enthusiasm for the main character, Mead, as I had hoped. I didn't agree with his decisions. I still don't understand why he never talked to anyone about his problems. And I certainly don't have ANY idea why he would get in the car at the end. I don't like it when characters don't make any sense, and Mead seems all over the place. I know he is young. I know he is out of his element in many ways, which is the point of the story at its core. But...I still don't believe that he would be quite so obstinately unforthcoming with ... everyone, really. Overall, it is a decent book that could have been so much more."}, {"userName": "Laura de Leon", "userReviewDate": "Oct 23, 2009", "userURL": "http://www.goodreads.com/user/show/2013736-laura-de-leon", "userReview": "As I said in another review, I enjoy books about precocious kids. What's interesting here is that at18, Theodore (or Mead, as he prefers to be called) isn't really a kid anymore. He's transitioning from childhood to adulthood with some big issues to face.It took me a little while to get into Life After Genius. I found Mead hard to get to know, and for the first few chapters, the skipping around in time got in my way.About 1/3 of the way in, the book clicked for me, and I wanted to get to know Mead better, I wanted to understand what had happened and why. The skipping back and forth in time became an interesting way of doling out information, of setting up why I should care before being told about an event.I really liked the pull between Mead, the bright young man in control of his mathematical future, and Teddy, the boy who is younger than all of his peers, and doesn't have the social skills to cope with this-- even with those that are well meaning (which certainly isn't everyone). Both sides came into play with his reactions to events in the book.Mead's cousin Percy's story really touched me as it unfolded. This is another one of Mead's contrasts-- how he dealt with the cousin who was successful in so many ways that he wasn't. Percy's story plays out, and really affects Mead's world, and Mead has to come to terms with it.I did have to stop and decide what I thought about the \"ghosts\" in the book description. I wasn't sure I liked the idea of math/mental illness link, as we had to decide why things were happening the way they were for Mead. In the end, I was OK with it."}, {"userName": "Joann", "userReviewDate": "Apr 11, 2011", "userURL": "http://www.goodreads.com/user/show/2588158-joann", "userReview": "This was the best novel I read in 2011, and maybe a few years before and maybe after. I couldn't put it down and I didn't want to. I read most of the reviews, and agreed with some, and was completely confounded by the person who didn't like it because he didn't agree with the math...um, this is a novel not a text book.What I liked best: The characters and their fully realized development and presentation. Theodore Mead Fegley, his consistently annoying mother, his father, Aunt Pearl, Herman Weinstein and all the rest, rang true. These are real people. The situations. Mead at 15 ('I prefer to be called Mead'), holding it together at the University of Chicago, and later desperately sleeping on the floor at Bell Labs. I particularly liked the development and semi-tragic collapse of the high school science project. Poor Mr. Cheese.Not much I didn't like. I even liked the ending. Anyone who has suffered through their teen years from being different (not fitting the expected or anticipated 'norm') through no fault of their own should relate to this...but I sense that many of the negative reviews were from very (that word is relative) young people. I think the tempering of a few years might bring a change of mind if not heart.This is a novel, that like it's protagonist, Theodore Mead Fegley, finds it's own path and hangs in there.Note to the math complainer. The author's profession was as an Art Director. She researched the math and made it interesting to the general reader and integral to the story. Amazing."}, {"userName": "Lauren (Shooting Stars Mag) Becker", "userReviewDate": "Nov 28, 2008", "userURL": "http://www.goodreads.com/user/show/1310914-lauren-shooting-stars-mag-becker", "userReview": "Teddy is a genius. He graduated high school early and would have graduated college at the age of 18. That's right...he would have. Instead, Teddy (now known as Mead) is back home and refusing to reveal why. With his mom trying her hardest to get answers out of him, his father believing he shouldn't work at the furniture/funeral home with him, and his uncle putting Mead down any chance he can get....what will happen on this journey home? I've read a lot of people's thoughts on this novel and many have asked me to post what I think about the ending....But starting at the beginning, I really enjoyed the book. Mead is smart, but has a great sense of humor that sees him through the rough times in life. College is a time of discovery for Mead, but only nearing the end of his senior year when he befriends a boy named Herman, who Mead soon realizes he should never have trusted.This book was a fast, interesting, sad, and humorous read all in one. However, back to the ending...it definitely leaves you wanting more and I'd be fine with it if there was going to be a sequel, though I don't think there is. Certain things aren't totally cleared up and the ending was simply a cliffhanger of sorts. Beyond that though, I would recommend the book. It's a unique idea with a great main character...Just keep the odd ending in mind."}, {"userName": "Tricia", "userReviewDate": "Sep 15, 2008", "userURL": "http://www.goodreads.com/user/show/845495-tricia", "userReview": "This book is very different from other things I've read lately. Part academic thriller and part coming-of-age story, this novel explores the world of an 18-year old math genius at the cusp of graduating from college when he shows up at home 6 days before graduation and he won't say why. Mead Fegley has grown up in a small midwestern town, the son of a furniture store owner/undertaker. His whole life he has been picked on, singled out, and alone. His thinks his luck will change when he enrolls at the university at age 15, but through the course of the novel he realizes he still has some growing up to do.I thought the author did a nice job with character development. The bad guys were really evil, the oppressive mother really exasperating, and Mead was as complicated as I imagine an adolescent trying to scale a very adult world would be. I was at times frustrated with Mead because I felt he brought a lot of misery on himself. But at the same time, I could totally understand how he got himself into the mess he was in. The book switches between the past and the present and gives the reader a revelation of tidbits and details that show how Mead ended up where he was. The ending did leave me feeling vaguely unsatisfied and the sexual themes and language were too coarse for my taste."}, {"userName": "Kelly", "userReviewDate": "Oct 30, 2008", "userURL": "http://www.goodreads.com/user/show/1398055-kelly", "userReview": "I finished Life After Genius this afternoon while waiting for the freshman football game to start. Thank goodness for mandatory time spent sitting in the car, it allows me reading time!!I think we've all known some people that are just a bit..well...different. In fact, I think that there is a little bit of Mead in all of us. We all feel like we're just a little peculiar sometimes. It's been very easy to empathize with Mead, and as the book drew to the conclusion, I found a deeper understanding of Mead's family as well. I'll admit to being a little confounded by the ending. It seemed almost abrupt, and as a rule, I don't like endings that are somewhat inconclusive. I guess could be considered a good type of ending, as the reader can draw their own conclusions and pretty much write the ending they'd prefer in their minds. However, I always feel a little bit let down by novels with endings like this one. Since I've been told I live in my own little happy world too often, I've decided to give the novel a \"They all lived happily ever after\" ending for my purposes. But I would have much rather the author had shared with us what her ending would have been for the characters. Life After Genius is a pretty good book nonetheless, and well worth your time to read."}, {"userName": "Sandra", "userReviewDate": "Nov 24, 2008", "userURL": "http://www.goodreads.com/user/show/719994-sandra", "userReview": "I was intrigued with the synopsis of this book. A book about a mathematical genius. And I was pleasantly surprised to find that I knew what was being talked about most of the time. Means I didn't spend all that money on a degree in mathematics for nothing.At first, the book was a little awkward to read. I found myself relating a lot with the main character, Mead, in that his mom is a bit overbearing. Though my mom isn't as overbearing as his mom is, I did see some similarities. And I have a hard time reading about when other kids are being picked on.There were a lot of dynamics at play with this book. The dead cousin, the genius child who only wants to blend into obscurity, the overbearing mother and the passive father. However, there were a lot of holes left at the end. I didn't particularly like the ending because I didn't think it tied it up as nicely as it should've. And Herman freaked me out. He was a bit manic, but nothing is really tied up with him.For the most part though, I enjoyed the read and would recommend it to other nerdy friends."}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "I felt that more could have been done. The story thinned out towards the middle and the ending left me feeling a bit let down. I think the genius struggling with adult eye opening experiences (that hey the world and the people in it can be truly crappy and take advantage) was spot on. His naiveity really made sense as did the fact that being a genius doesn't bestow upon a young boy social know how nor the wisdom age and the hardknocks school of life gifts us with. But the author could have explored so much more. I liked the struggle he had of loving as well as envying his older, atheletically gifted cousin. It was an honest characterization of two different types of human gifts and flaws. I liked it because it was different and well written but I also felt it stopped short of giving readers what they want."}, {"userName": "Gaby", "userReviewDate": "Dec 08, 2009", "userURL": "http://www.goodreads.com/user/show/1185483-gaby", "userReview": "When we first meet Mead, he's just turned his back on college, fled, and returned to his hometown where he's regarded with as a genius and an oddball. His family is disappointed and puzzled at his reappearance. As Mead works at the family businesses, we slowly see the sacrifices that his family went through to help him succeed at University of Chicago as well as the adjustments and cost that Mead paid in his search to succeed and to stand out.Life After Genius is a fun and interesting read. At times sad and poignant, and at times witty and humorous. It's about the cost of personal success and about the strength of love and family. It's a story that will stay with you long after finished the book.Publisher: Grand Central Publishing (October 28, 2009), 400 pages.Review copy provided by the publisher."}, {"userName": "Rose", "userReviewDate": "Jun 02, 2011", "userURL": "http://www.goodreads.com/user/show/4280522-rose", "userReview": "Interesting coming of age story told in a present & past tense format. Mead's a genius whom at 18 is graduating from university but flees home to Illinois a week before the graduation ceremony. I wanted to read this to find out what traumatic thing could have caused this guy to leave his precious studies to go back to an undertaker father, a nosy overbearing mother, & a hateful uncle. The overall story was a good one, though Mead's above average intelligence bodes well in school, it does nothing for his social life or his emotional growth. & that's what sweet about the story, to see him understand things he'd failed to grasp before & connect with his family as he should have years earlier."}, {"userName": "Ken", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/877451-ken", "userReview": "I got about 20% into this book--about up to page 60. The book begins by setting up conflicts and plot points in three different timelines for the hero. Chapter 1 begins 4 days before Mead, the genius of the title, is supposed to graduate from a university in Illinois. Chapter 2 begins 8 years before the same graduation when Mead is in grade school, and Chapter 3 begins 3 years before graduation when Mead begins his university career. None of the narratives in any of the three time frames engaged me, and I couldn't find one character I liked or could sympathisize with, so I gave it up.I will say that two of the reviews I read of this book said that by the end of the book, the journey is worth it, so it might be worht the time. For me, I decided to move on to another journey."}, {"userName": "Anne Calvert", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/16299212-anne-calvert", "userReview": "I enjoyed it. My curiosity was piqued almost immediately. He was a genius, skipped grades, and moved on to college ahead of his time. The way the author moved between Chicago and High Grove and timeframes gave a glimpse, a luring in each chapter. This being the author's first novel, I was impressed. I like the style of the writing. The way she explained certain things, ie Reimann Hypothesis, was detailed enough to give a good idea of what it is. I do understand that the author was using a few of the more graphic things pertaining to the guys and some of the language to show the reader Mead's morphing from boy to man, but she could have omitted some of it and it still would have been a good read."}, {"userName": "Lydia", "userReviewDate": "Jan 03, 2009", "userURL": "http://www.goodreads.com/user/show/1331593-lydia", "userReview": "This is an amazingly insightful tale of a boy genius, with an underdeveloped sense of social graces, an overbearing mother, a checked-out father, a loving cousin and aunt, and a confused uncle. yet, the question arises, are these characters, as seen through the eyes of this brilliant mathematician, as he goes from 16 to 18 and becomes a potential graduate of the University of Chicago, true to form?Couriously, this book was not listed as a YA selection in the public library, however I believe it has a place in that category. For me, it parallels \"A Beautiful Mind\" , essentially addressing the early years. The writing is elegant, tight, concise and stays wonderfully in the perspective of the protagonist. I enjoyed this tremendously and can highly recommend it."}], "description": "Theodore Mead Fegley has always been the smartest person he knows. By age 12, he was in high school, and by 15 he was attending a top-ranking university. And now, at the tender age of 18, he's on the verge of proving the Riemann Hypothesis, a mathematical equation that has mystified academics for almost 150 years. But only days before graduation, Mead suddenly packs his bags and flees home to rural Illinois. What has caused him to flee remains a mystery to all but Mead and a classmate whose quest for success has turned into a dangerous obession. At home, Mead finds little solace. His past ghosts haunt him; his parents don't understand the agony his genius has caused him, nor his desire to be a normal kid, and his dreams seem crushed forever. He embarks on a new life's journey -- learning the family business of selling furniture and embalming the dead--that disappoints and surprises all who knew him as \"the young Fegley genius.\"Equal parts academic thriller and poignant coming-of-age story, LIFE AFTER GENIUS follows the remarkable journey of a young man who must discover that the heart may know what the head hasn't yet learned.", "title": "Life After Genius", "url": "https://www.goodreads.com/book/show/7049293-life-after-genius", "average": 3.27, "cover": "https://images.gr-assets.com/books/1267027692l/7049293.jpg", "reviews": 84, "authors": [{"url": "https://www.goodreads.com/author/show/1633202.M_Ann_Jacoby", "name": "M. Ann Jacoby"}], "type": ["Fiction", "Young Adult", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/7049293-life-after-genius", "http://www.goodreads.com/book/show/3830153-life-after-genius", "http://www.goodreads.com/book/show/7049292-life-after-genius", "http://www.goodreads.com/book/show/11084932-life-after-genius"]}