{"ratings": 21, "userreviews": [{"userName": "Dan Barr", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/16086049-dan-barr", "userReview": "This books is somewhat difficult to critique for two reasons. The first is that it is a compilation, so instead of reviewing a single author I must separate the book into portions and then try and combine those portions into a whole to create a single review. Overall I found the authors to be thoughtful, informed, and skilled writers. They wrote with confidence and emotion, and you really come away from the book believing that these authors are dedicated experts. Not taking into account subject or personal views, this book is a well-edited, well put together piece of non-fiction, the kind I would normally gravitate to. However, when making a review, one must take into account subject and personal views, and this where the second difficulty comes in.I am not a proponent of the particular views or ideas this book supports. \"Why buy it then?\" you may ask. Well, I didn't, I won it from a goodreads first-reads giveaway (plug!) and that can be a sort of shot in the dark. This one happened to have been a miss. Without getting into the politics of the thing (cause if there's one place that could be described as a paragon of informed political discourse, it's not the internet), I'll just say that I cannot support the particular world view this book is affiliated with. For the sake of potential customers I will reveal that that view is one of far-left activism and, to a degree, anarchy (in fact, the publisher describes themselves as \"the oldest and most vibrant anarchist publisher in the U.S.). Normally I support people reading books that disagree with their beliefs because, that way, they are able to expand their understanding of culture and society, and had this book been an informative book I probably would have given it one to two more stars for that reason. However, it is not an informative book, it is an instructive book, which presupposes that the reader already supports its ideas and is looking to delve deeper into the culture. Like anyone who encounters a belief that they do not endorse, I find holes in the logic which backs the underlying principles the essays in this book are based on. I also wonder if the authors and editors see the contradiction in their claims, made in a freely printed and distributed book which is available to anyone who has access to amazon.com, that the government suppresses their work.So, for me, I can't possibly give this work more than two stars (one of which is for the skill of the writers plus the excellent cover and layout. Props to Margaret Killjoy for that), but I know someone who would unquestionably give this work five stars, and even more if he could. He'll be getting this as a gift soon."}, {"userName": "Kevin Meter", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/18083579-kevin-meter", "userReview": "Editors of and contributors to Life During Wartime will be touring the southwest and west coast from 4 August to 10 August 2013. Click for event information: https://www.facebook.com/events/19635..."}, {"userName": "Ken", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/3415915-ken", "userReview": "Brilliant anthology covers how contemporary policing is nothing more than counterinsurgency tactics focused domestically."}, {"userName": "Shenanitims", "userReviewDate": "Apr 30, 2015", "userURL": "http://www.goodreads.com/user/show/5662085-shenanitims", "userReview": "This was a real interesting read especially coming off of OD'ing on James Bamford's \"Puzzle Palace\" and \"the Shadow Factory.\" I was pretty familiar with the protest movement(s) a decade ago, so it's reassuring to see that the fight continues. While I don't agree with all the politics expressed in the book, I think the difference in opinions is actually a plus. (Shows we're both thinking.) Hell, one of the chapters is expressly about why solidarity with contrasting groups can be beneficial to a movement. I've been a lifelong supporter of the AK Press, and after a few years MIA, it looks as if I'm hooked again!"}, {"userName": "Dawn", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/18747266-dawn", "userReview": "great resource."}], "description": "\"Together, the writers sound a sobering warning: the American government is an iron fist in a velvet glove whose purpose remains preserving the status quo and enriching the rich.\"— Publishers WeeklyWhat happens when the techniques of counterinsurgency, developed to squash small skirmishes and guerrilla wars on the border of Empire, blend into the state's apparatus for domestic policing? In Life During Wartime, fifteen authors and activists reflect on the American domestic security apparatus, detailing the increasing militarization of the police force and the re-emergence of infiltration and counter-intelligence as surveillance strategies, highlighting the ways that the techniques and the technologies of counterinsurgency have been applied on the home front, and offering strategies for resistance.Includes contributions Kristian Williams, Will Munger, Walidah Imarisha, George Ciccariello-Maher, Beriah Empie, Elaine Brown, Geoffrey Boyce, Conor Cash, Vicente L. Rafael, Alexander Reid Ross, Evan Tucker, Layne Mullett, Sarah Small, and Luce Guillen-Givins.", "title": "Life During Wartime: Resisting Counterinsurgency", "url": "http://www.goodreads.com/book/show/16057163-life-during-wartime", "average": 4.1, "cover": "https://images.gr-assets.com/books/1367340065l/16057163.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/300968.Kristian_Williams", "name": "Kristian Williams"}, {"url": "https://www.goodreads.com/author/show/6544376.Lara_Messersmith_Glavin", "name": "Lara Messersmith-Glavin"}, {"url": "https://www.goodreads.com/author/show/6544377.William_Munger", "name": "William Munger"}], "type": ["War", "Politics"], "outlinks": ["http://www.goodreads.com/book/show/16057163-life-during-wartime", "http://www.goodreads.com/book/show/1200492.Our_Enemies_in_Blue", "http://www.goodreads.com/book/show/547710.American_Methods", "http://www.goodreads.com/book/show/13226069-hurt", "http://www.goodreads.com/book/show/34381043-between-the-bullet-and-the-lie", "http://www.goodreads.com/book/show/23105938-fire-the-cops"]}