{"ratings": 295368, "userreviews": [{"userName": "Nayra.Hassan", "userReviewDate": "Mar 26, 2016", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "للذواقة فقط..لعشاق مباهج الحياة..ولو لم تكن منهم ،مثلي انا، ستنبهك \"تيتا\"لكل ما يفوتك ..ستجعلك تتساءل بغل :لماذا تزداد تعاستنا كلما ازدادت حياتنا سهولة؟؟؟ رواية من 12فصلا يبدأ كل منها بوصفة طعام مناسبة لكل شهر من شهور العام..امتلأت الرواية بالطعام و لم يأت ذكر للمال في اي سطر من سطورها!!؟  فهل المال سر تعاستنا؟ لا..ابدا\" !فكل الابطال كان لهم نصيبهم الوافي من التعاسة...ولكنها ناتجة عن حماقة وانانية.. بلا حدود ♡لابد أن اؤكد اولا ان نقطة ماء واحدة تفسد الشيكولاته تماما و لا يناسب الماء سوى مسحوق الكاكاو فقط♡و ما ان تندمج في مآسي عائلة تيتا و بيدرو و عللقتهم المستحيلة ..حتى تضحك في بلاهة على الخيال المذهل:\"بكت حتى اغرقت السلالم بالماء وبعد آن جفت الدموع.. كنسوا 5كيلو من الملح ليطهوا به لعام كامل !!\"او\"و تدثرت بلحافها الذي صنعته في ليالي الارق ...ليغطي 3هكتارات!أي كل أراضي المزرعة \"اهي رواية عن الأنثى المشعة. .صاحبة الفطرة السليمة..المنتجة لكل ما هو ساحر..اكلات ..مشروبات 🍸...علاجات..ملابس.احاديث ..اهتمام صادق..كيف تاسر من حولها.. وتفوز بغيرة من هم دونهاتذكرنا الرواية بأن للطعام مكانة كبيرة لا تضاهى في ذكرياتنا. .بحلوها و 🍄مرها..حافلة بروايح ذات مغزى...و كل صنف يرتبط داخلنا بعواطف شتى ..إيجابية أو سلبية..و نادرا ما تتبدل ولكن.. هناك اعتداء كبير على صورة الام التقليدية..فالامهات البيولوجيات في الرواية مثال الأنانية والقسوة ،بل والغيرة من سعادة الأبناء..بينما بالرواية أمهات لم ينجبن ولكن حنانهن فاض على الجميع ..كل من يعتقد ان الرواية رومانسية..ابشره انها بعيدة تماما عن جو السهوكة المعتاد..بل وتعتبر الرواية اصل لكل\" افلام الطعام\" التى نعشق مشاهدتها عندما يضيق الحالFood movies🍡في زمن الرواية كانوا يصنعون معجون الأسنان من عظم الحبار..والكبريت من الفسفور..ومراهم حروق من البطاطس ..اى ان الحياة كانت كابوس لا ينتهي من العمل المتواصل فهل\" البطالة هي ام الرذائل\"؟ كالماء للشيكولاتة تخرج لك أسرار الحياة من المطبخ..وتذكرك في النهاية ان\" الروح ترغب في الارتداد للمكان الذي جاءت منه وتترك الجسد..خامدا \"ا"}, {"userName": "Rinda Elwakil ", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/13856367-rinda-elwakil", "userReview": "\"I don create art, I create chaosلا أخلق الفن، بل أحدث الفوضي\" الفن؟ الفن يحدث الفوضي، الفن يبعثرك و يجمعك و يشكلك من جديد، الفن لا يشبه شيئًا ولا يشبهه شئ بطلتنا صاحبة موهبة، و الموهبة لا تُقتل جراء محنة، بل، تستيقظ، تشتعللكل مكان عادات من صناعة قاطنيه، قوانين غير مكتوبة (بدأت في التصديق أن جميعا غير منطقية ظالمة) و لكل من يتخطاها الويل و النبذ و ما أسوأفي هذا المكان البعيد جرت العادة ألا تتزوج الفتاة الصغري للعائلة (فقط الصغري) غير بعد وفاة أمها، و لأن الحياة لا تعطي محتاجًا لم تقع في الحب سوي صغري فتيات العائلة، و التي ظنت أن أمها الصارمة التي تحكم المزرعة و من فيها بالحديد و النار سيرق قلبها لمشهد لشابين متحابين و تكسر القاعدة و تتمني لفتاتها حياة سعيدة، بتلك البساطةتقدم الشاب لخطبة بطلتنا، و خرجت الأم معلنة التالي: ستتزوج ابنتها الكبري من الشاب، أصدرت فرمانًا و تمت الخطبة و لم يستطع أحد أن يعترض، حتي الشاب، بتلك البساطةطلبت من الابنة الصغري أن تستعد لإعداد مأدبة الزفاف، فهي طاهية العائلة، بتلك البساطةبكت الفتاة علي سلم المزرعة طوال الليل، و في الصباح عندما جففت الشمس آثار سهرة أمس كنس الخدم سبعة أجولة من الملح استخدموها فيما بعد في الطهي لمدة عامين، بتلك البساطةكان الاستعداد للزفاف علي قدمٍ و ساق، و كانت الفتاة تعد المأدبة و هي تبكي، بكت حتي اختلطت دموعها بمزيج كعكة الزفاففي الحفل، و بعد تناول الطعام، تذكر كل الحاضرين أكثر فقد موجع و كأنه حدث منذ لحظة، و بكي الجميع كما لم يبكوا من قبل، بتلك البساطةلتبدأ رحلة غريبة في بيت يسكن تحت سقفه علي كل شئ و نقيضه، السلطة الغاشمة عديمة القلب و الرحمة، مقابل الحب و الشغف، و الأهم: الأمل.ليس غريبًا تحت سقف كهذا أن تسمع عن آحداث غرائبية كطفل انقطع حليب أمه و رفض كل طعام أن ترضعه خالته التي يحبها والده فيهدأ و ينمو جسده، و لا أن يموت عندما تكتشف الجدة الصارمة ذلك و تبعده عنها، و لا أن تغزل فتاة حزينة من أحلامها غطاء في ليالي السهر القمرية حتي يصير بحجم يغطي مزرعة بأكملها، و لا أن تعد فتاة ولهة أهداها حبيبها وردة الطعام فيصاب كل من يتذوقه بحب مشتعل مجنون ، فيذهب هذا ليعيد ما سبق و انقطع، و ذاك ليخبر أحدهم بما تكاسل عنه، و تلك التي تشعر بحرارة جسدها تتصاعد تدريجيا فتذهب للكابينة الخشبية لتستحم فيشتعل الخشب فتهرع للخارج و تظل الكابينة للأبد تفوح برائحة الورود، الرائحة التي جذبت رجلًا من الناحية المقابلة للبلدة ليأتي و يقابل الفتاة المشتعلة فيأخذها علي ظهر حصانه و لا يعود أحدهما مجددا، فتصدر الأم فرمانا بحرق صور الفتاة و منع ذكر اسمها مجددا كأنما لم تولد قط!و الكثير و الذي لا تظن أني أفسدت عليك قصة ما حدث في تلك المزرعة بذكر ما سبقلم أقل إلا شئ يسير.لم الفن؟لنعرف أن صناعة المعجزات لا تتطلب الكثير،مثلا.. كان يكفي بطلتنا أن تضع حبًا في المزيج، و كثير كثير من الشغف، لتحصل علي شئ فريد، يكفيه أن ينال منك حاسة واحدة حتي يمتلك باقي الحواس و لا يفلتهاكالفن."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 04, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "195.\tComo agua para chocolate = Like Water for Chocolate, Laura EsquivelLike Water for Chocolate (Spanish: Como agua para chocolate) is a popular novel published in 1989 by Mexican novelist and screenwriter Laura Esquivel. The novel follows the story of a young girl named Tita, who longs for her lover, Pedro, but can never have him because of her mother's upholding of the family tradition: the youngest daughter cannot marry, but instead must take care of her mother until she dies. Tita is only able to express herself when she cooks.مثل آب برای شکلات - لورا اسکوئیل (روشنگران) ادبیات؛ تاریخ نخستین خوانش: روز چهاردهم ماه ژوئن سال 2012 میلادیعنوان: مثل آب برای شکلات؛ نویسنده: لورا اسکوئیل؛ تهران، روشنگران، 1376؛ در 235 ص؛ شابک: ایکس - 964551276؛ چاپ سوم 1380؛ چاپ هفتم 1386؛ شابک: 9789645512765؛ موضوع: داستانهای نویسندگان اسپانیایی - قرن 20 مکتاب تا به پایان آمد، داغ داغ دوباره خواندم، آشپزیم بهتر شد، اگر از احوالات داستان خواسته باشید، ملالی که ندارد هیچ، بسیار هم همچو شیرین ما شیرین است، انگار قند و همان دوران کودکی. خوانش دوم که به سرانجام رسید، انگار کردم، شکلات خوشمزه ای بود، که در دهانم آهسته آب شد، بار دوم دفترچه ام را از یادداشت پر کرده بودم، برای همین بود که سه باره خواندم. داستان زندگی زنان نسلهای گذشته ی مکزیک است که به سبک رئالیسم جادویی و با زبان خانگی و فُرم زنانه (نوشتار زنانه) نگارش شده‌ است. این رمان، عشقی زیبا را در کنار مبارزه ی یک زن با سنتهای جامعه ی خود را نشان می‌دهد. هر فصل از کتاب با دستور آشپزی، یا داروسازی، آغاز شده و به موضوع آن فصل می‌چسبد. کتاب در سال 1989 میلادی نوشته شده و در سال 1992 میلادی فیلمی نیز براساس آن در مکزیک، توسط: آلفونسو آروآ، ساخته شده است. به سی زبان ترجمه شده و میلیونها نسخه از آن چاپ شده‌ است. عنوان کتاب نیز معنایی دوگانه دارد: نخست اشاره به دستور تهیه ی شکلات داغ (هات چاکلت) که در مکزیک با آب و کاکائو تهیه می‌شود (نه با شیر). دوم، اصطلاحی ست در زبان اسپانیایی استعاره ای از احساسات تند و برانگیختگی. ا. شربیانی"}, {"userName": "karen", "userReviewDate": "Jul 18, 2012", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[ so this is one of those books i always thought you either read in high school, or you just never read. my AP english class senior year, i had a teacher i loved. i had him for three classes that year, and he was the \"cool\" teacher with the chuck taylors and the ponytail, the irreverent one who cursed and treated high school kids like sentient beings, went by a nickname, and about whom there were rumors of indiscretions (of the drugs-and-alcohol sort, not the other kind). but he was also a canon-adherer. basically - white european males. all the time. (although we did read little foxes, so there was one lady.) the other AP class was a much more \"hey, let's read a range of perspectives\" syllabus. and a bunch of people dropped out of his class to go to t'other, and by the end we were down to like nine students, which was great for me, but probably reflected poorly on him. but he was completely unapologetic about it, \"if women of brewster place was as good a book as heart of darkness, we would read women of brewster place.\" and in a way - dick, right? but he was a great teacher, narrow perspective aside, and i learned so much in that class, even though i had to read heart of darkness, which - yes - a great book for structure and themes and resonance, but such a snooze. so anyway, i know the other class read this book, and it is always on the school reading lists i have to fetch books for at the job, but i probably never would have read it without tatiana's suggestion, because i consider it a book that i had missed the boat on, associating it as i do with high school reading lists, and i am old. when i sat down this morning to write this review, i decided to see if i could find out what old roz was up to.http://florida.arrests.org/Arrests/Be...aaaaaand there it is. god, i love this man. don't let them get you, roz!! drive recklessly into the night!!! okay, that's all (hide spoiler)]"}, {"userName": "Foad", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/25683251-foad", "userReview": "دستور پخت رمان مثل آب برای شکلاتمواد لازم:یک عدد دختر تیره روزیک عدد مادر مستبدسه عدد مثلث عشقی (می توان تعداد را به دلخواه افزود)سنت های خشک، به مقدار لازمدوازده عدد دستور آشپزی عجیب و غریب و اشتها برانگیزطرز تهیه:رمان را به دوازده قطعه تقسیم کنید، و هر فصل را به یک دستور آشپزی اشتها برانگیز اختصاص دهید. در ضمنِ آموزش تهیه غذای مورد نظر توسط دختر تیره روز، هر جا که نیاز شد مادر مستبد و سنت های خشک را به مخلوط اضافه کرده، خوب به هم بزنید. مخصوصاً دقت داشته باشید که احساسات دختر تیره روز را خوب توصیف کنید و با تکنیک های رئالیسم جادویی نشان دهید که این احساسات وقتی با غذا ترکیب شوند می توانند طعم و روح غذا را تغییر دهند و از آن سمّی مهلک یا شهدی بهشتی بسازند. در آخر برای بیشتر شدن شوری و شیرینی ماجرا، مثلث های عشقی را به داستان بيفزاييد. رمان شما آماده است.ادامه دارد...دستور پخت ماه بعدرمان طاعون"}, {"userName": "Hoda Elsayed", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/22257733-hoda-elsayed", "userReview": "حينما توغّلت فى قراءة هذه الرواية استحضرتنى مقولة برنارد شو الطريفة:\n«ليس هناك حبّ أصدق من حبّ الطعام»\nومع ذلك فالرواية لا تقتفى سيرة رجل شره أو أكول،بل حكاية امرأة امتلأ قلبها شغفاً بحب مستحيل، فاستعاضت عن العشق بفنّ الطعام. وبدلاً من أن تكبت رغبتها في أغوار نفسها، فجرت البطلة أحاسيسها الإنسانية، أو الأصحّ الأنثوية، في وصفات مختلفة يُمثّل الحبّ المكوّن الرئيسي فيها.\n\"من القلب إلى المطبخ\"\nيُمكن اختزال فكرة الرواية فى هذا العنوان.عندما تتمسك ماما إيلينا بتقاليد عائلية تقضي بعدم تزويج ابنتها الصغرى تيتا وإبقائها عزباء لخدمتها ورعايتها حتى يوم مماتها، فإنها تكون كمن يؤثث للبؤس في أيامه الآتيه.أسرة ماما إيلينا مكوَّنة من ثلاث بنات. تقوم هي برعايتهن، أو بالأحرى بالإشراف على سير حيواتهن، وتسييرها بالشكل الذي تراه مناسبًا ماما إيلينا الشغوفة بالطبخ، تتصرف كما لو أنها تريد صنع عجينة قَدَرِها بيدها. فهي امرأة صارمة، بإمكانها أن تقف ببندقية مخبأة في ثيابها، متحديةً نقيب الثوار، فتأمره بالانصراف عن بيتها. بالطريقة نفسها التي تحكم على تيتا بأن تُسجَن في المطبخ، بين النكهات والمقادير، الوصفات الغذائية واستعمالات كل نوع من الأطعمة. تُفرّق ماما إيلينا بين بيدرو وتيتا بتزويج ابنتها الكبري من بدرو..فيوافق بيدرو بدوره على هذا العرض الجنوني بغية البقاء إلى جانب معشوقته الأولى والأخيرة، تيتا.فتغدو النظرة العابرة بينهما أشبه بشرارة تُشعل نار الشوق في قلبيهما. كلاهما يعيش درجة الغليان نفسها، فيصير كل واحد منهما للآخر تماماً كما الماء للشوكولاتة. إنها أحداث رواية \"كالماء للشوكولاتة\" التى كتبتها لاورا اسكييل ووزعت أحداثها على مدار اثنى عشر شهرًا من السنة.هذه الوصفات تروي قصص حب. كذلك تروي قصص موت وتمرد وفرار . فالأطعمة لها شخصياتها، ومزاجها أيضاً.إسكيبيل تسمح للفانتازيا أن تأخذ حيزًا مهمًا، كما لو أنها حريصة على إبقاء الفانتازيا بالمقدار اللازم لإثارة شكوك القارئ .تكتب لاورا بلغة جميلة مُعبّقة بروائح اللخبز الساخن والحليب المغلى والبهارات الفوّاحة.تكمن السحرية في وصفات تيتا نفسها. فهي تعتني بها وتحضّرها بشغف عاشق ولهان،لا سيما بعدما صار الطبخ متعة حقيقية تستعيض بها عن متعة الغرام. لذا نجد أنّ الأطباق تخرج بمذاق رائع.يجد القارئ نفسه هنا بين حالتين: روحانية العشق، ومادية الطعام.(رواية ممتعة بديعة..تمزج بين غذاء الروح(الحب) وبين غذاء الجسد(الطعام."}, {"userName": "Kelly", "userReviewDate": "Nov 07, 2007", "userURL": "http://www.goodreads.com/user/show/82063-kelly", "userReview": "This book was disappointing. It felt overwrought and melodramatic.Tita, the youngest daughter of overbearing Mama Elena, has to give up the hope of ever marrying. It will be her duty to take care of her mother in old age. This becomes a big problem when she meets Pedro. When Pedro learns of Tita's duty to her mother and impossibility of future marriage, he agrees to marry Tita's sister, just so he can be closer to Tita. This sets in motion this fable of unrequited love that is the thread through the book.This book, put by some, into the category of magical realism, is not at all subtle or richly textured like others in the genre. Perhaps a better category would be tall-tale or fairy tale. If I had come to the book with that perspective, maybe I would have been able to hold back on all of the exaggerated eye rolling I was doing while reading. Also, I would have been more apt to forgive the book for the delivery of one-dimensional characters.Now, I did give this book 2 stars which means it isn't completely devoid of literary value. The language, though simple and spare was evocative, the recipes and description of food interspersed between chapters was a delightful diversion.I would only recommend this book to readers who have a high tolerance for love stories that tend to the saccharine. If you're a true Cinderella girl, you might enjoy the story without concern for its plausibility. Don't bother if you're more like me--interesting in rich characters."}, {"userName": "PorshaJo", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "What a wonderful, magical story. The tale of women in turn-of-the-century Mexico and how they live their lives. Tita is the main character and what a strong woman she is. This story is told in 12 month chapters though time progresses much faster. Each chapter is started with a recipe. Yes, the kitchen and food is central to this story. You get the details of the recipe and how to make and it's weaved so perfectly into this story. In a nutshell, Tita is the youngest of three girls. They live on their ranch with their mother, Mama Elena. Let's just say Joan Crawford, ala Mommie Dearest, has *nothing* on Mama Elena. Tita is in love with Pedro, a local boy, but custom dictates that the youngest child, Tita, is not allowed to marry and must care for her mother until the day she dies. Care for really means be a slave to her and her abusive ways. Mama Elena is so cruel that she has Tita's sister marry Pedro and makes Tita cook the meal for their wedding. Tita can infuse her emotions into the food that she is cooking. As she cries and pours her tears of sorrow into the cake for her sister's wedding, something happens. Everyone at the wedding becomes sorrowful and is sick. Naturally she is accused of destroying the wedding. There are other tales of Tita's emotions being put into the food she makes. I especially loved the story of passion in the food that her older sister ate and the passion just exploded in her.Oh there is so much magical realism in this one and I just loved it. I'm a big fan of magical realism and food. So put the two together and it's a wonderful tale. I have been wanting to read this one for so long. I picked up a copy on a library sale and started it earlier this year, but after the first paragraph I knew I had to save it. It started 'Take care to chop the onion fine' and I knew I wanted to save it for my vacation where I could just immerse myself in this story without interruptions. Though that didn't go as actually planned, as too many distractions.I could not help but keep comparing this work to Isabel Allende's work. Both have that magical realism element to it, a sweeping family saga, such heartbreak, and just a beautiful story. I'm so glad I finally read this one as now I can actually watch the movie version."}, {"userName": "Fabian", "userReviewDate": "Jan 08, 2010", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "I could not help but fall for this short novel that encapsulates vividly yet simply the lives of these women in Mexico during the Pancho Villa Years. The family unit is both necessary AND a culminating curse-- it's hardly fair that our heroine must not live out the life she desires but the one that is handed down to her. A stupid family tradition (it is true-- mine's a bit like Tita's clan, sure, though not at all) dictates that the youngest daughter gets to take care of the matriarch and never marry nor fall in love. Tita does, of course, fall in love & her longing, desperation, and hope all are ingredients for the eleven dishes she prepares and shares with the reader. More than the story itself about shitty circumstances imprisoning a beating heart & a stunting of a passion that soon after becomes nothing else but a heavy burden... the mixture of recipe with story... the book is actually revolutionary in taking a different approach about the way we look at the culinary aspect of our (especially us Mexicans') lives. Whereas I got a sour flavor disgusting my palate watching such drivel as \"Julie and Julia,\" this book (the movie does it little justice, by the way) masterfully employs a type of rare literary alchemy* by mixing elements as one would mix ingredients to give rise to something as tasty as it is nourishing.*Speaking of alchemy, it must be mentioned that this has a similar voice and tone as that of (Madonna's fave!:) Paulo Coelho ('The Alchemist', 'Veronika Decides to Die')... but, seriously, a WAYYY more imaginative--& therefore more enjoyable--sense of storytelling."}, {"userName": "Emily  O", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/2302019-emily-o", "userReview": "Have you ever finished a book and thought \"Man, this is going to be hard to review?\" Because that's the first thing I thought when I finished this little book by Laura Esquivel. Like Water for Chocolate: A Novel in Monthly Installments With Recipes, Romances, and Home Remedies is a book that really left me conflicted. There were things about it that I absolutely loved, and things about it that made me very angry. The only way I can think to write this review is to explain what I found good and bad, and let you all come to your own conclusions.First, let's start with the good things. I loved the way this book was written. Like Water for Chocolate reads like a folktale, and a fun one at that. Some people's reviews that I've read found the magical realism trite or annoying, but I found it really endearing. The book managed to be an easy, quick read without sacrificing quality. Now, I cannot review this book without talking about the recipes. The book is split up into monthly installments, and each month has a recipe that Tita makes that ties the story together. The recipe is given at the beginning of each monthly chapter, and the instructions for preparation are woven into the story. Now, I'm a huge fan of cooking, so I found this idea to be really great. Since so much of the story takes place around and hinges on food, putting the recipes in the book makes perfect sense. I loved the way that the preparation instructions were included in the action of the story. Some people seem to find it gimmicky, but I thought it was a fun little addition to a book already filled with the tastes and smells of good Mexican cooking.Now, for the things that troubled me. First of all, I have to admit that even though I'm a huge lover of all things fairy-tale and myth, I do not like the \"love at first sight\" narrative. It's not that I'm not a romantic, but I feel that real love is something that is built up from a knowledge of a person's character and personality, not something that magically happens when you see someone from across the room. As for Tita's beloved, Pedro, I honestly didn't like him. He spent the entire book being selfish, immature, and whiny. I have no idea what Tita saw in him. While this book started out with that \"love at first sight\" narrative, there is a point that it has the chance to go away from that narrative and treat love in a realistic and touching manner. Honestly, that was the ending I was hoping for, so I was pretty well disappointed with how the book actually ended. For me at least, the ending was the worst part of the book. I feel like it kept the book from really having any particular meaning or significance, and instead just avoided any difficulty and wrapped up as quickly and neatly as possible. It just wasn't satisfying.There were also plot elements that I found really disturbing. There are some *spoilers* in the following paragraph. At one point Pedro completely ignores all concepts of consent and just assumes that Tita wants to have sex with him, even though she has denied him repeatedly because he is married to her sister and she is promised to someone else. Does he care about this? No. Is this seen as a problem in the book? No, of course not. As soon as Pedro grabs her and pulls her into a room, Tita magically forgets all of her previous objections, and it's just seen as more proof that they need to be together. Honestly, I find that to be pretty wrong. If somebody who I had repeatedly told to leave me alone just assumed that I didn't really mean it and that I really wanted to have sex with him and decided to pull me into a dark room, I would kick him so hard he would never want to have sex again. It wouldn't matter how much I actually loved him, if he can't respect my decisions he is not worth my time. Combine that incident with the not-very-sympathetic treatment of a rape victim at another point, and you can imagine that I wasn't exactly happy with the way this book treated consent. *End spoilers here* Basically, this book had some incidents that left me with a bad taste in my mouth, and made me wonder exactly what kind of love the author is trying to promote.Overall, the good writing and fun recipes in this book did not outweigh the problematic elements in the narrative. As much as I wanted to, I could not let myself simply enjoy this book, because problems with the plot and the ideas in the book kept jolting me out of the magical world of the narrative. This book was supposed to be a great love story, but I couldn't help feeling that Tita ended up with the wrong man. The ending of the book was completely disappointing, and only served to cement my growing discomfort. For those of you who don't mind the things that I mentioned, this book could be enjoyable. For those of you who want realistic love and respectful healthy relationships, I would suggest that you stay away from Like Water For Chocolate.Rating: not recommendedGood things: enjoyable writing, fun format, successful magical realismBad things: unrealistic love, unhealthy relationships, consent problems, unsatisfying ending For more reviews, visit my blog at http://readingwhilefemale.blogspot.com"}, {"userName": "Aliaa Mohamed", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/4991427-aliaa-mohamed", "userReview": "حسناً .. أود الاعتراف بشيئين ، الأول أنني انتهيت من تلك الرواية قبل ساعة تقريباً من الآن ومنذ ذلك الوقت وأنا مترددة حول ما سأكتبه ، ليس لأنه ليس بداخلي شيئاً لكي أقوله ، بل لأن ما بداخلي لا أستطيع التعبير عنه بسهولة !الأمر الثاني الذي أود الاعتراف به هو أنني لم أقرأ عملاً أدبياً بهذا الكم من الجمال منذ فترة طويلة ، بل ويمكنني القول أن وصف تلك الرواية بالرائعة هو قليل للغاية !فجمال الرواية مصدره أسباب عديدة ، أهمها ذكاء الكاتبة الشديد والذي اعترف أنني احسدها بشدها ع امتلاكه ! فيكفيها أنها عالجت فكرة بطريقة لم تأتِ إلى ذهن من سبقها ف الكتابة ، فكان من السهل عليها أن تكتب قصتها أو فكرتها بشكل تقليدي بحت عن فتاة ارتبط مصيرها بمصير والدتها حتى وفاة الأخيرة طبقاً لتقاليد قومها ونتج عن ذلك ابتعادها عن حبيبها الذي ستزوج اختها حتى يبقى بجوارها ثم تزوجا ف النهاية بعد أحداث كثيرة ..قد يرى البعض أن الفكرة تقليدية للغاية ولكن الكاتبة بكل ذكاء حولت التقليدية إلى غرائبية ، واستغلت كافة الأدوات السحرية المتوافرة لديها لتقدم لنا نصاً بديعاً امتزجت فيه الكلمات بالطعام ووصفات الأكلات المكسيكية !فالرواية جاءت مقسمة إلى شهور السنة الـ12 ، ومع بداية كل شهر تذكر الرواية اسم أكلة ومكوناتها وطريقتها ، ولكن هل لتلك الأكلة علاقة بمحتوى الفصل أم أنها دخيلة ؟ بالطبع ليست دخيلة بل لها علاقة قوية للغاية بمحتوى الفصل ، فمن خلاله تبدأ الحكاية وأحداثها ، ولم تكتفي الكاتبة بذكر ما سبق فقط بل وفرت داخل العمل فانتازيا غير معتادة حول علاقة الحالة النفسية بمذاق الطعام وعلاقة كل ذلك بالأحداث ومدى تأثيره عليها !!عليك أن تتخيل أيها القاريء أن كل ذلك وأكثر من الأشياء التي لم تتاح لك قراءتها من قبل ، كل ذلك ف عمل واحد لا يتعدى الـ256 صفحة فقط !!من كثرة انسجامي مع الأحداث وانجذابي إلى الرواية ، نسيت أن هناك راوية ف البداية وتذكرت ذلك ف النهاية فقط !!أود الاعتراف بشئ آخر ، وهو أنني نادمة بشدة لكوني لم اقرأ هذا العمل من قبل ! فلن أكون مغالية ف حديثي إذا ذكرت أن هذا العمل جعلني أحب المطبخ وأنا المعروف عني عزوفي الكامل عن هذا المكان وكل ما له علاقة به رغم قربي من عامي الـ24 !!آخر شيء أود قوله هو أن عليك عزيزي القاريء التفرغ بشكل كامل لتلك الرواية إذا قررت قراءتها لأنك لن تتركها إلا عند الصفحة الأخيرة فقط !ملحوظة : النجمة المفقودة لأنني تمنيت أن لن ينتهِ العمل أبداً ولم أتمنى أيضاً تلك النهاية له !"}, {"userName": "Maria Clara", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Realmente me ha encantado! Es una de esas historias que cuando la terminas sólo puedes preguntarte por qué has tardado tanto en leerla!"}, {"userName": "Shriya", "userReviewDate": "Mar 21, 2008", "userURL": "http://www.goodreads.com/user/show/1010127-shriya", "userReview": "What an easily forgettable novel. The language was exceedingly childish, and the style of the novel massacred the subtlety with which magic realism is to be employed. This was my first taste of the famed Latin American style of writing, and I was sorely disappointed. (Class discussions surrounding this book also bothered me - not only were we forced to read bad literature, we were forced to analyse it for meaningful content.)The characters were not at all developed successfully; no motivations existed behind some of their actions. The magic realism was not artfully or subtly employed to provide significant insight into the events of the novel. As odd as this may sound, not one of the characters in that book was likeable. One character - and not the main one - had the potential to be developed into a very interesting and powerful figure, but her story was reduced to a side-thread that the author seemingly gave up on. The plot was childish in nature, with strange sexual undertones that were jarring. Picture if you will, the story of Cinderella - but this time with sex involved. You see? The mind is jarred by the image. In that same vein, the novel attempts to reconcile a highly immature plot line with fairly adult themes. My first experience with Latin American novels was thus a failure. I suppose I have to thank school for introducing me to better Latin American novels as time went by - this was their way of saying \"ok - you've read the wrost one now, it can ONLY get better from here!\""}, {"userName": "Dina Nabil", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/50169548-dina-nabil", "userReview": "تظل تبحث عن عمل يخطفك من واقعك ليدفعك الى عالم موازى شديد الثراء ، تتنقل من مجموعة قصصية الى قصيدة شعرية الى نوفيلا او رواية مطولة ، تسافر ذهنيا بين اداب نازية المانيا و عصور جاز امريكا و تفرقة جنوب افريقيا و حرافيش نجيب محفوظ ، تفتح ملفاتك الاليكترونية و مكتبتك الصغيرة التى امتلكتها بعد عناء ، و وسط بحثك تجد رواية لروائية لم تسمع اسمها قبلا و من بلد لا يمكن وصفها بالرائدة فى الادب فاذا بها تفعل بك الافاعيل و تسحركلاورا إسكيبيل المكسيكية تقدم مزيج مبهر بين النسوية و الواقعية السحرية فى رواية محكمة ممتعه تختار لها اسم محلى و مبتكر : \"كالماء للشيكولاته\" لكن استاذتنا نادية جمال الدين محمد التى نقلت لنا النص فى ترجمة المشروع القومى للترجمه تختار الاسم البديل \"الغليان\" لتقدمه للقارئ العربى مخالفه فى ذلك استاذنا صالح علمانى الذى فضل فى ترجمته لدار بلومزبري و هو من فضل الاحتفاظ باسمها الاصلى .....كالماء للشيكولاته او الغليان او حتى \"شيكولاته مرة\" كما فى ترجمتها الفرنسية تظل الرواية ملفته للانتباه حتى فى تنوع اشكال اغلافتها بين الطبعة و الاخرىرواية لا تهتم بخارج البيت ، فلا الحروب او الثورات او السياسة او حتى الطقس يثير اهتمام لاورا اسكيبيل او تيتا بطلتنا الصغيرة و لا حتى نحن الا فيما يؤثر ذلك فى شخصيات منزل روايتنا .... تفضيل ذوبان الشيكولاته بالماء على اللبن عند تيتا اهم من حرب عالمية اخرى ، و نظرة واحدة من بيدرو المحب الممنوع يوازى صعود الانسان الى القمرعائلة صغيرة محكومة بالحديد و النار لا تحيد عن تقليدها العتيق ، الا تتزوج الابنة الصغرى قط لتتفرغ للعناية بشيخوخة الام ... لم نعلم بعد ان كان التقليد حقيقى فى الريف المكسيكى ام انها لعبة ادبية من المؤلفة و ربما لا نهتم كثيرا فتسارع الاحداث و عمقها يجذبنا من تساؤلاتنا الى واقع شخصيات تتطبق قواعد الواقعية السحرية كافه فقدميها فى باطن الارض و رأسها بين السحاب حالة القهر التى عبرت عنها لاورا -حتى فى قالبها الخيالى العاطفى- تكسب الرواية طعم نسوى بالتاكيد ... ارتباط شرطى بين الطعام و الطبخ و بين اطفاء نيران الوحدة و الشوق و الخذلانو كما بدأت تنتهى بسعادة غامرة و حزن دفين ... فى امتزاج حميمى تماما كالفلفل بالرمان المكسيكى الشهيرفى عمل يجمع بين وصفات الطعام الشهرية و العلاجات المنزلية و الغراميات الملتهبة و ارضاع الطفل من ثدى عذراء و كثير من فن الحكايات قدمت لى المكسيكية لاورا اسكيبيل قصتى المفضلة الجديدةدينا نبيلفجر ٢٠ ابريل ٢٠١٥"}, {"userName": "Mohammed-Makram", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/15385951-mohammed-makram", "userReview": "رواية عجيبة كالزمن الذى كان عدد فصولها تماما مثله من يناير و حتى ديسمبر و فى كل شهر فصل من فصول الحكاية و طبخه من طبخات الزمنلا أعلم ان كان هناك ثمة تشابه فى اللغة المكسيكية بين القدر بجر القاف و القدر بفتحها الا ان المزج بينهما يبدو و كأنه هو عين الحقيقة طوال أحداث الروايةلم اتفاعل مع القصة الا بعد حوالى ربعها و حينها لم استطيع تركها الا كطبق شهى لم يتبق منه شىء الا المذاق الطيب و الشعور بالإمتلاء و الرغبة فى تكرار التجربة"}, {"userName": "peiman-mir5 rezakhani", "userReviewDate": "Oct 19, 2017", "userURL": "http://www.goodreads.com/user/show/42133960-peiman-mir5-rezakhani", "userReview": "‎دوستانِ گرانقدر، این داستان میتواند قلبِ هر انسانِ با وجدان و مهربانی را به درد آورد.. داستانِ تباه شدنِ زندگی و جوانیِ دختری زیبا و مهربان، بخاطر رسم و رسوماتی غیر انسانی و پست و خودخواهانه.... داستان در موردِ زندگیِ دختری به نامِ <تیتا> میباشد... چیزی که از تیتا مانده: داستانِ زندگی اوست و کتاب آشپزی او که برایِ نسلهای بعد به یادگار گذاشته است--------------------------------------------‎تیتا این دخترِ زیبا و مهربان، هیچوقت نباید ازدواج کند، چراکه او کوچکترین دخترِ خانواده است و رسمِ احمقانه و غیر انسانی میگوید: کوچکترین دختر باید تا مادرش زنده است، از او پرستاری کند و این بدان معناست که در خانه همچون برده و کنیز باشد و برایِ تمامی اهلِ خانه آشپزی کند..... پدرِ تیتا زمانی که او به دنیا آمد، متوجه شد که دخترش از مرد دیگریست و زنِ چندش آورِ او <النا> به وی خیانت کرده است، همان زمان در دم سکته کرد و جان باخت... تیتا هیچگاه در آغوش مادرِ چندش آور و مغرور و احمقش بزرگ نشد و وظیفهٔ بزرگ کردنِ او بر عهدهٔ <ناچا> پیرزن خدمتکار و مهربانِ خانه بود... به همین سبب بود که او در آشپزخانه با بویِ انواعِ خوراک ها و ادویه ها و سس ها و چیزهای دیگر، روز به روز در آغوشِ ناچا، بزرگ و بزرگتر شد و البته به آشپزی بینظیر تبدیل شد‎پسری از خانوادهٔ مازکویز به نامِ <پدرو> عاشقِ تیتا میشود، و تیتا نیز به عشقِ پدرو دل بسته و عاشقِ او میشود.. ولی مادرِ بدنهاد و زشت خویِ تیتا، به سببِ همان رسم و رسوماتِ کثیف، اجازهٔ ازدواج آنها را نمیدهد و به آقای پاسکال، پدرِ پدرو پیشنهاد میدهد که پدرو به جایِ تیتا، با دخترِ دیگرش <رزارا> ازدواج کند... رزارا دختری حسود و زشت است که دو سال از تیتا بزرگتر است ... پدرو برایِ آنکه بتواند به تیتا نزدیک شده و با او در یک خانه زندگی کند، پیشنهاد را قبول کرده و با رزارا ازدواج میکند و رزارا این خواهر حسود نیز از خوشحالی به اصطلاح بال در می آورد و اندوهگین بودنِ خواهرش تیتا، برایش مهم نمیباشد‎پس از مرگِ ناچا، سرآشپزِ خانه تیتا شد و خواهر بزرگ آنها <گرترودیس> نیز با سرکردهٔ راهزنان و انقلابیون فرار کرد.. و سپس با او ازدواج نمود... مادرِ بد نهادِ آنها، عکس ها و اسنادی که نشان میداد که گرترودیس دخترِ آن خانواده است را در آتش انداخت و سوزاند... بله عزیزانم، گرترودیس توانست از آن خانه و از دستِ آن مادر زورگو و نادان، بگریزد‎پدرو و رزارا بچه دار شدند و نام پسرشان را روبرتو نهادند... رزارا نمیتوانست به پسرش شیر دهد، ولی به طرزِ شگفت آوری، سینه هایِ تیتا که باکره بود، از شیر پُر شد و او روزها به نوزاد شیر میداد.... پدرو و رزارا به اصرارِ مادر، از آنجا مهاجرت کردند و پس از چند روز خبر رسید که نوزاد هرچه میخورده بالا می آورده و سرانجام از دنیا رفته است‎از آن روز تیتا نتوانست دستوراتِ مادر زورگویش را قبول کند و بیمار شد.. دکتر <جان براون> او را از مزرعهٔ مادری بیرون آورد و به خانهٔ خودش برد تا حالش بهتر شود... تیتا از خدمت کردن به مادرش خسته شده بود و حتی دیگر سخن هم نمیگفت، چراکه نمیخواست واژه هایی که از دهانش بیرون می آیند، دردهایِ زندگی او را فریاد بزنند‎دکتر جان، که مردی مهربان است و همسرش مرده و یک پسر نیز دارد، به تیتا پیشنهادِ ازدواج میدهد.. ولی تیتا تمام وجودش برایِ پدرو میتپد‎عزیزانم، بهتر است خودتان این داستان زیبا را خوانده و از سرنوشتِ دردناکِ تیتا و سرانجامِ غمبارِ این داستان آگاه شوید***************************‎بخشی از کتاب‎ما همه با بسته ای کبریت در درونمان به دنیا آمده ایم، ولی خودمان نمیتوانیم کبریت هایِ درونمان را روشن کنیم... درست همانندِ آزمایش ها در آزمایشگاه، ما نیز به اکسیژن و شمع نیاز داریم.. فقط در مورد ما این نکته وجود دارد که: در ما اکسیژن باید از نفس هایِ یک عاشق بیاید و شمع میتواند هرچیزی باشد: یک ملودی، یک واژهٔ زیبا، یک نوازش، یک صدا و یا هر چیز دیگر که به نوعی یک تلنگر باشد که بتواند یکی از کبریت هایِ درونمان را روشن کند.. ما باید کسی را بیابیم که آن تلنگر را ایجاد کند، تا با روشن شدنِ کبریت بتوانیم به زندگی ادامه دهیم، چراکه شعلهٔ همان کبریت در اصل غذایِ روحِ ما میباشد... اگر چیزی نباشد که آن شعله را برانگیزد، بستهٔ کبریتِ در درونِ ما، نم دار و خیس میشود و ما نمیتوانیم هیچکدام از آنها را روشن کنیم------------------------------------------‎امیدوارم از خواندنِ این داستانِ زیبا، لذت ببریداگر به زبانی غیر از فارسی تسلط دارید، ترجمهٔ این کتاب را که سانسور و حذفیات دارد را نخوانید‎<پیروز باشید و ایرانی>"}, {"userName": "Maryam Shahriari", "userReviewDate": "Jun 22, 2007", "userURL": "http://www.goodreads.com/user/show/145223-maryam-shahriari", "userReview": "حدوداً ۸ سال پیش این کتاب رو از کسی قرض گرفتم و خوندم، اما همیشه وسوسه دوباره خونیش توی دلم بودم. حدوداً ۳ سال پیش اونو برای خودمم خریدم و گذاشتم توی کتابخونه‌م، اما تازه دیشب بود که بالاخره تونستم دوباره بخونمش.من رئالیسم جادویی رو دوست دارم. داستان‌های عاشقانه‌ای که زنان راوی ماجرا هستند رو هم دوست دارم (البته نه تو ژانر فهیمه رحیمی!). آشپزی هم یکی از کارهای مورد علاقم محسوب میشه. پس نباید جای تعجب داشته باشه که از خوندن این کتاب لذت برده باشم.با خوندن این کتاب زن درونت یاد می‌گیره احساساتش رو دست کم نگیره، با سرنوشتی که دیگران براش خواستن بجنگه، و زندگی خودش و اطرافیان رو جوری مدیریت کنه که نه سیخ بسوزه نه کباب! و البته، اگر یه کم بیشتر دقت کنه می‌بینه که ۲۰ سال سخت می‌تونه خیلی راحت توی داستان تعریف نشه، ولی به جاش اون لحظات خاص به یاد موندنی برای همه با آب و تاب تعریف بشه. از دیشب که این کتاب رو دوباره خوندم دارم به این فکر میکنم که زندگی این لحظه‌های ساده و روزمره نیست. غرغرهای ما از سختی‌ها هم نیست. زندگی هر کدوممون اون لحظه‌های ناب و نقاط عطفی هست که توی ذهن خودمون و بقیه موندگار میشه. همونایی که اگر نباشه کتاب زندگی‌مون کسل کننده میشه...زندگی‌تون پر لحظه‌های ناب و نقاط عطف رفقا:)دوباره خوانییکشنبه ۱۷ آبان ۹۴"}, {"userName": "Carlos", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/43073965-carlos", "userReview": "No sé por qué, pero es una mezcla entre leer un libro de cocina metido en un cuento de hadas.El libro es fácil de leer, no es denso y el lenguaje es simple, sencillo, se digiere rápido.Amo la comida con todo mi corazón, pero cocino pésimo, por lo que no me apasiona todo lo que sea gastronomía.A pesar de que el lenguaje y la historia es simple, me cuesta aceptar que ingredientes de cocina estén tan metidos en un libro que tiene intención de novela.Por otro lado, la historia se asocia con mujeres sufridas, amores imposibles. Por otro lado, el hombre que simplemente se casa con la hermana para estar cerca de su amada, y sumarle que es el típico macho egoísta, como el Mr. Darcy latino. Ok, puedo decir que la historia tiene sentido PERO ¿Mezclar tanta comida e ingredientes en la historia? Meh, a mí al menos eso me hace ruido.¿Recomendable? A los que les gustan las historias románticas de amores imposibles y cuentos de hadas, sí. Quizás estoy equivocado, pero no es mi tipo de literatura y quizás olvide pronto a Tita, Mamá Elena, Pedro, Rosaura, etc."}, {"userName": "Calista", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "10 years ago I would have thought so differently about this than I do now. Mama Elena is one of the most monstrous, villainous characters I have ever met. Our main character is Tita, the youngest daughter in her family. The evil family tradition is that the youngest child will not get married or have a life of her own, she will take care of the aging mother. Tita is the youngest and she falls in love with Pedro. They are electric together - passion. Tita also cooks. Each chapter is a recipe for food that is part of the story. Tita is not allowed to marry since she is youngest and so Pedro, being a coward, will marry her older sister to spend time with Tita. Pretty sick logic. Rosario, the older sister, thinks this is ok too. Mama Elena is a monster. She does everything she can to harm her youngest daughter and keep her from a real life. She is blunt and vicious. Any bit of happiness outside of the kitchen Tita has, her mom is trying to stop her. It gets so bad that Tita's nephew dies and she is sad and Mama Elena tells her to get on with her work. Tita confronts her mother and they blow up. Tita is sent to live in the cornloft where she goes crazy. Her mother, who has ruined her life, would rather send her to an asylum than help her. Vicious. Tita her meets a doctor named John who is kind and caring and Tita feels safe and at peace. He is a good, no a great man. Tita is happy and wants to marry. He does not take Tita to the asylum. Tita is going to marry John. Well, Pedro, who was sent away, is back to mess up the wedding plans and confuse Tita.SPOILER!!!I didn't like the ending. Tita, after years of waiting for Pedro ends up with Pedro. It's supposed to be this romantic thing. She was at peace and happy with John. She should have chosen John. That passion she felt was fleeting and he wasn't a man enough to just ask for what he wanted. They waited for the sister to die. Tita waits 22 years for her love instead of building a good life with John and having her own children. Ugh. This story was terrible that way.Mama Elena one of the most evil, monstrous characters I have read. Terrible. Oh, she comes back as a ghost to haunt Tita. She is horrible and would rather see her child suffer than be happy. She is evil. She also has a middle daughter who becomes a whore and the mother burns her birth certificate and declares her dead. She becomes a general and makes something of herself. Rosario wants to raise her only daughter in this tradition also and Tita will have none of it. None. What an evil tradition. I thought this was very well written and great characterizations. The part with the food made me hungry and you could smell it. Laura had wonderful insights into life and her words are well chosen and beautiful. It's the ending. I hated the ending.In my 20s, I probably would have thought this was a great ending, but now, I feel what a waste. I know she loved Pedro, but Pedro chose to marry her sister. He was a coward. She found someone that made her happy and he was willing to over look their affair even. Who knows, if she had bedded John, maybe she would have found a great passion in this man who saved her. Pedro left her in her prison. John freed her and let her be happy for once. A happy ending would have been marrying John. This was a tragic ending and it is a tragic sad story. Very very sad. Tita made a choice. Oh well."}, {"userName": "Amira Mahmoud", "userReviewDate": "Aug 29, 2017", "userURL": "http://www.goodreads.com/user/show/23833335-amira-mahmoud", "userReview": "يُقال أن أكثر ما حُرم منه جيلنا هو حميمية العلاقات الاجتماعية، الاجتماع معًا في مجلس عائلي يتضمن الكثير من الطعام والكثير من الأحاديث والضحكات، والكثير الكثير من الحكايات الغير مترابطة والعشوائية بتفاعلات حقيقية دون أن يجلس الجميع ورؤوسهم مُنكبّة على هواتفهم المحمولة.أتخيل أن حينها الشخص الوحيد الذي سيشعر بالوحدة هو الجدة؛ تلك التي تمتلك في جُعبتها الكثير من الحكايات ووصفات الأكل والكثير من الحنان أيضًا لكنها لا تمتلك معرفة جيدة بتلك التكنولوجيا اللعينة التي تأخذ صغارها وصغار صغارها منها.ما كنت أشعر به وأنا اقرأ هذه الرواية، هو أن \"تيتا\" بطلة الرواية تجلس على كرسي هزاز متدثرة بشال صوف وأنا أجلس تحت قدميها تُضفرّ ليّ شعري وتُخبرني بقصة حياتها تلك التي تُشبه المأساة؛ الغريب أن كل تلك المآسي وكل ذلك الألم حين يُحكي أو يُقرأ سيبدو وكأنه يمرّ سريعًا، سنشعر بالصدمة والحزن نعم لكننا لن نشعر أبدًا بتوقف الزمن عن الحركة الذي يسببه الألم.تيتا التي حُكم عليها أن تبقى بلا زواج لرعاية أمها حتى تموت، فتحولت حياتها إلى سلسلة مشوهة وغير مفهومة من الأحداث ولا أدري حقًا كيف يمكن لنا أن نقرر نيابة عن آخر مصيره وكأننا نُنّصب أنفسنا آلهة ولا أدري كيف يمكن للآباء والأمهات أن يفعلوا ذلك بصغارهم رغم كل ما يُقال عن ذلك الحُب الذي يحملوه بداخلهم لهم غريزيًا وبدون أي شروط، كيف يمكن له بدم بارد أن يجعل قطعة منه تتحمل كل لك الأذى؟لا أعلم لما ذكرتني الرواية أثناء قرائتها بمئة عام من العزلة لماركيز، ذات النمط الي يركز على عائلة واحدة بأحداثها ولا يحاول رسم الزمن أو الأحداث خارجها إلا بما يُعتبر ضرورة وإضافة للعائلة ولحياتها وذات النمط الذي يحكي المأساة بسرعة وحسم ولكن بتكثيف وكأنها ومضات تأتي وتذهب فجأة لكنها تترك أثرًا صادمًا.الرواية ممتعة، ممتعة للغاية ومؤلمة أيضًا؛ كانت وصفات الأكل تُضجرني فالمطبخ هو أكثر الأشياء التي لست على وفاق معها أبدًا ولا أفقه فيه شيئًا لكنني كنت أشعر أنها أعطت نكهة ما للرواية واكملت الصورة، ما لم يعجبني حقًا النهاية ولا أدري لمَ!تمّت"}, {"userName": "J Omar Vidrio", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/15364227-j-omar-vidrio", "userReview": "Un libro lleno de mexicanidad.La magia que tiene Laura Esquivel, al mezclar la deliciosa comida mexicana con está historia tan hermosa de amor, es sublime.Los absurdos sucesos acompañados de la realidad histórica de la época crean un maravilloso \"cuento\", una de las mejores historias mexicanas.Quien no sea seducido por los platillos, las recetas y los sucesos que en este libro ocurren, tiene un enorme problema en el sentido del gusto."}, {"userName": "mai ahmd", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/7154074-mai-ahmd", "userReview": "كالماء للشكولاتة لذيذة بقدر ما فيها من وصفات وتحضيرات مطبخية وروائح الطعام ، استندت على الخيال والعاطفة المتطرفة التي لا تعرف قيودا كقيود العائلة أو الدين أو التقاليد .. فكسرت كل الأعراف التي تقف في وجه حب عاصف .. عندما تقرأ هذا النص تعرف إنك تقف أمام روائية قادرة على شد انتباهك بطريقتها الغرائبية الشيقة التي ربطت ما بين المطبخ والطعام وبين الحب والخيال ، الضوء والدفء والعاطفة .. هذه الفنتازيا السحرية لقصة امرأة لم تكن تملك سوى مهارتها في المطبخ لتناضل بها ولتعالج بها ولتحب بها إنها وصفة غريبة ولكنها متدفقة وعالية المستوى !الماء .. القوة ، النقاء ، الشفافية ، يختلط بالشوكولاتة ، الشكولاتة اللون الرائحة الطعم لذة الحياة ولذة الحب ، العاطفة التي حرمت منها تيتا بسبب سيطرة أمها التي تبدو كزوجة أب شريرة . تبدأ الرواية بتلك الأشغال الشاقة التي كانت تيتا تقوم بها دون كلل أو ملل من قبل أم لمتسلطة تشبه زوجة أب سندريلا ، تتمسك بالتقليد الذي يقضي بأن تكون الإبنة الأخيرة في رعاية أمها حتى وفاتها ، يبدو الأمر سيئا بما يكفي إلا إن الأمور تزداد سوءا عندما تلتقي تيتا بحبها الحقيقي ، تيتا الممنوعة من الحب والمنذورة لخدمة الأمالقصة مناسبة جدا لأجواء الواقعية السحرية المحيطة بها وظفت فيها الأساطير والأعراف وحكايات الجدات فابتدعت لاورا قصصها الخاصة فلاتملك إلا أن تبتسم لتلك التي ماتت بنفس الطريقة التي ماتت بها أول مرة ، الموت مرتين يا له من عذاب تلقته أوسادورا لتموت عقابا لها على خيانة شقيقتها ، إن الخيانة عند لاورا أمر غير مستساغ وغير مقبول في محيط العائلة لذلك ما فتأت إيلينا حتى بعد موتها تلعن تيتا التي ردت على الخيانة بخيانة ، وبالرغم من إن الروائية أكدت على قدسية العائلة في مشاهد مطبخية كثيرة لكنها أيضا ثارت على التقاليد التي تكبل المرأة لتختار شريك حياتها إن الرواية تدور حول فكرة التنفيس عن الرغبات والإنتصار لها بالدرجة الأولى لذلك ينتصر الحب في النهاية..في أدب الواقعية السحرية الموت أمر لا مناص منه إنه أمر يقارب السحر بغموضه وماهيته الغير معروفة ، في الموت هناك الكثير مما يمكن الخيال من الجنوح إليه ، كما هو المطبخ فللموت أسرار كما للمطبخ أسرار ، وهؤلاء اللاتي لا يدخلن المطبخ يفتقدن معرفة هذه الإسرار الصغيرة التي تجعل من المطبخ مكانا حميميا ممتلىء بالروائح والنكهات والكثير من المشاعر والعواطف والتقلبات كما يظهر هنا في هذه الرواية البديعة فالوصفات مرتبطة إرتباطا كليا بمشاعر وتقلبات عواطف تيتا ، فتيتا حين تحزن يحزن كل المدعوين وحين تفرح تسكب كل مشاعرها السعيدة في كعكة من الفرح فيبتهج الآخرين ...يبدو العمل في مشاهد كثيرة أمرا مستفزا ، ليست وصفات الطهي من بينها بلا شك وهي جزء كبير من القصة ، ولكن إذا رأينا هذا العمل من منظار ساخر فإن الفكرة تصبح أكثر قبولا ، كالشخصيات الجامحة ذات الإيقاع المجنون خيردوتس مثال على الرغبة في كل أشكالها الحرية ، بلا قيد ولا شرط ، الشقيقة التي ضربت عرض الحائط بكل القيم والأعراف لأجل رغباتها ، تيتا وعلاقتها ببنت أختها ، والرضاعة التي حدثت من ثدي لم يعرف الأمومة ليحضر ذلك الرابط الذي ربطها ببيدرو والذي ظل قائما مليئا بالحب ومترعا بالحليب بينما كان صدر أختها جافا ، الحمل الكاذب الذي توهمته تيتا من بيدرو والذي لعله كان يشير إلى علاقة الحب الغير مشروعة التي حدثت بينهما هناك رمزيات كثيرة في النص أجملها كان مشهد الاحتراق البديع في نهاية الرواية الغريب إنني لم انتبه أن هناك راويا قريبا من شخصيات الرواية في النص إلا في نهايته !الترجمة بارعة للغاية للدرجة التي تود أن تأكلها أكلا"}, {"userName": "lames", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/18610721-lames", "userReview": "ربما كان فيها سحر خفي ولكنه مع الأسف كان خفي عني أيضا فمنذ بدأت قراءتها وأنا أنتظر أن أري أي لمحة سحرية و لكن لم أجد إلا قليلا فجاء الملل حليف الرواية منذ البدايات وانتظرت لتغيير الدفة نحو السحر والمتعة ولكني تعثرت في الكثير من الملل فجاء سحرها ناقصا غير مشبع للحواس والخيال إلا قليلا جدا ولهذا استحقت نجمتين فقط."}, {"userName": "Niyura", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/51197819-niyura", "userReview": "Un 5 de 5Me ha tenido enamorada toda la novela, es una historia fácil de leer, encantadora y hasta cómica! Recetas, amor, muchos sentimientos, es un libro lleno de emociones."}, {"userName": "Amanda", "userReviewDate": "Mar 31, 2009", "userURL": "http://www.goodreads.com/user/show/645979-amanda", "userReview": "If all the lights inside you can be lit at once, your heart will burst, and infinity becomes permanent.Fuck. My heart is beating hard these days. Poor Tita makes it beat harder. A beautiful sad story of forbidden love and orgasmic passion, Tita and Pedro's tale is the hope that love IS enough after all. At that life is worth living...Three stars for the book in general, plus one because I'm feeling so \"in love\" these days."}, {"userName": "Ahmed Oraby", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/8711518-ahmed-oraby", "userReview": "الريڤيو:https://goo.gl/pdDd2q"}, {"userName": "Raya راية", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/23224678-raya", "userReview": "\"الحب لا يحتاج إلى التفكير، إما أن نشعر به أو لا نشعر\"\n\nجذبني غلاف الرواية قبل أي شيء آخر، ولا أعلم لِمَ لم أقتنيها حين رأيتها مرات كثيرة في المكتبات! والاسم الغريب أيضًا والفاتح للشهية كذلك. ولكن شاءت الأقدار أن يكون وقت قراءتي لها في الفترة التي أتبّع فيها نظامًا غذائيًا صارمًا، فلا شوكولاتة ولا يحزنون! لشد ما تألمت لهذا السبب كثيرًا، فكمية الوصفات وطرق الطبخ، تملئ الرواية، شعرت بأنني أشم حقًا رائحة التوابل والبهارات! يا إلهي كم تعذبت معدتي الخاوية المسكينة بوصفات \"تيتا\" اللذيذة! تيتا التي ولدت وتربّت في المطبخ وورثت عن أسلافها ألذ وأشهى الوصفات، وبمهارة وحذق وبراعة منقطعة النظير تمكنت من إتقان فن الطهي، فكانت فعلًا فنانة بكل ما تحمله الكلمة من معنى. لكن تيتا أُجبِرت على حمل قدرها على كاهلها منذ أن ولدت ورأت عيناها النور، فتقرّ العادات والتقاليد آنذاك على أن تكرّس صغرى البنات في العائلة نفسها وحياتها لخدمة والدتها حتى تتوفى، فيحرم عليها الزواج والإنجاب وممارسة حقها كأنثى وكأم! وبهذا التقليد اللاإنساني والجائر والظالم حُرمت تيتا من حبيبها بيدرو، وتجرّعت الألم والمرارة واليأس والحسرة. ووضعت كل أحاسيسها ومشاعرها واضطرابها بالوصفات التي أتقنتها، وربما وجدت في الطبخ بعض العزاء لما حلَ بها. موضوع الرواية الأساسي هو ذاك التقليد العائلي الجائر بحق الفتاة الصغرى من كل عائلة في المكسيك -ولست أعلم إن كان منتشرًا في كل البلاد أم في مناطق معينة فقط- والتي راحت ضحيته في روايتنا هذه \"تيتا\". في إطار من الأحداث السياسية المتقلّبة والثورات التي شهدتها المكسيك. أما عن أسلوب الرواية، فهي آسرة جدًا، مليئة بالأحداث العجيبة السحرية كعادة الأدب اللاتيني، تتقاطع فيها مصائر الشخصيات بشكل غير متوقع، فلا تملك حيالهم سوى أن تشعر بالتعاطف. استمتعت بها جدًا وبالوصفات اللذيذة وبالاجتماعات العائلية والولائم العامرة بصنوف المأكولات الشهية. ..."}, {"userName": "Amanda", "userReviewDate": "Oct 01, 2011", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Okay, so maybe more of a 3 1/2 star. I have a love/hate relationship with magical realism and, if anything, part of my disappoint with the novel comes from the fact that there's not as much \"magic\" as I had hoped for (I prefer Isabel Allende's House of the Sprits by comparison). However, I still enjoyed the novel as it was unique in its structure, and the conduit for the magical aspects of the novel--food--was beautifully rendered in the recipes and descriptions of the connection between food and culture, as well as food and memory.Tita, the youngest daughter in her family, is doomed by tradition. She grows up knowing that she will never marry as it is her fate to take care of her tyrannical mother as she enters old age. Tita might have been able to resign herself to her destiny if it weren't for Pedro, the man with whom she falls passionately in love at first sight. Tita's mother, of course, forbids the marriage and instead does the unthinkable--offers Pedro her eldest daughter Rosaura's hand in marriage. Pedro, the effin' fool that he is (oh, that's my other complaint with the book; I did not cotton to Pedro, although, to be fair, he's not a very well-developed character and so his actions come across as moronic since his only driving impulse is to be with Tita), accepts because it is the only way he can be near Tita. Oh, yeah. You know that's a plan that's going to end in a fustercluck. Tita is both elated to know that Pedro is only marrying her sister out of love for Tita and depressed by the fact that their love is to go unconsummated as long as her mother's eagle eye ensures that the two are kept apart. Unable to express her innermost desires, they instead surface in her famed cooking. Ordinary meals become an emotional feast as those who eat her food are consumed by Tita's suppressed passion, anger, and resentment.The episodic structure of the novel is genius, separated month by month and beginning with the recipe around which the story will revolve. The characters are somewhat one-dimensional, but given that the novel has a fairytale quality to it and reads more as myth than reality, I'm willing to forgive that. What ruined the entire novel for me was the ending. I don't want to ruin it for other readers, so I will simply say that I don't think Tita chose the right man and leave it at that.Cross posted at This Insignificant Cinder"}, {"userName": "Floripiquita", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/63637736-floripiquita", "userReview": "Me encanta este libro con el que reír y llorar, en definitiva emocionarse mucho. Y la película es una adaptación maravillosa."}, {"userName": "Tammy", "userReviewDate": "Feb 08, 2011", "userURL": "http://www.goodreads.com/user/show/3912806-tammy", "userReview": "Warning: This recipe may induce plenty of gushing. See notes below to see how severely affected this reviewer was... and still is)1. Take one book2. Add a few sumptuous recipes3. Infuse with touches of magic realism4. Add a heap full of fragrant flavours5. Pour in a cupful of earthy, human emotion6. Mix in a healthy dose of unresolved lust, tension and heated gazesPour in a bowl, mix them all together and watch as the perfect love story unfolds. Allow it to simmer, heat and send your system into a seductive frenzy that will leave you feeling dizzy with its luscious writing and mouth-watering recipes.Side notes: Be sure to flush out all superfluous ingredients such as jealous sisters, forbidding, spiteful mothers and outdated, traditional rules that threaten to spoil and get in the way of a happy ending. Chained to Mexican tradition at the time, Tita, the youngest of three daughters is gifted with an exquisitely unique cooking skill.Confined to a dreary future of serving and attending to her mother's needs till her death, she is forbidden the right to marry (according to the staunch rules amongst traditional Mexican families at the time).Naturally tradition finds itself flailing in mid-air upon the arrival of the forbidden - which just so happens to come in the form of the very delicious Pedro.Enchanted by the utterly beguiling Tita, it doesn't take him long to fall in love with the extraordinarily talented cook.When he tries to win her hand in marriage, his request is vehemently refused by Mama Elena, Tita's staunch, unyielding and spiteful mother. To try and soften the blow, Mama Elena offers her older daughter Rosuara to him instead.Out of sheer desperation Pedro agrees to marry her - only doing so to remain close to Tita.For the next 22 years, Tita and Pedro are forced to move in the same circle, swathed in their unconsummated passion for each other – and kept apart by ensuing events which affects everyone in the family…Review:This book is the book that introduced me to a genre that to this day still leaves me enchanted. I actually read this years ago, but the contents of it are still as vividly imprinted into my mind as if I just finished it yesterday.One has to marvel at a book with the capacity to instantly transport you into its earthy, vibrant and voluptuously decadent world, even though you haven't read it in years.The element of magic is a very strong feature in this novel and is written in monthly instalments of magical and sumptuous recipes – each of which plays a pivotal part in the events that follow within the story.Each dish that Tita prepares speaks of the emotions that she cannot always express when around her family and is used as a means to express her love to Pedro and often has comic and heartbreaking effects on everyone else who consumes her dishes.The writing, the characters - everything about this novel has a sensuality about it that always leans on the precipice of something greater. It's not what is said that makes the novel so fantastic, but how the author invites you to use your imagination with her sensual, decadent words.Every word is smooth as velvet chocolate, melts on your tongue and lulls your system into a drug-induced state of hazy, hedonistic pleasure.In short, the book is an aphrodisiac.And if you don't quite believe me, I'd highly recommend reading that shower scene. (*Tammy pauses to recover from a bout of swooning*)I'd love to reveal more about the characters, but for once, I'm going to just tell you that this is a book where the characters, their emotions, interactions and connections need to be experienced firsthand - especially the electric chemistry between Tita and Pedro.What I can say though, is that their love story is a story I would want for my own... except without the horrible mother and evil sister of course.Part mythical and partly historical, Like water for chocolate is an enchantingly magical, sumptuous feast of a novel touched with a quality of earthiness and idiosyncratic grandeur that makes for a delicious read…Yes, yes... I abuse the word earthy. It's completely and utterly the book's fault. Still, you should go out and read it this instant. It's a timeless classic every die-hard romantic should experience."}], "description": "Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, Like Water For Chocolate is a romantic, poignant tale, touched with moments of magic, graphic earthiness, bittersweet wit - and recipes. A sumptuous feast of a novel, it relates the bizarre history of the all-female De La Garza family. Tita, the youngest daughter of the house, has been forbidden to marry, condemned by Mexican tradition to look after her mother until she dies. But Tita falls in love with Pedro, and he is seduced by the magical food she cooks. In desperation, Pedro marries her sister Rosaura so that he can stay close to her, so that Tita and Pedro are forced to circle each other in unconsummated passion. Only a freakish chain of tragedies, bad luck and fate finally reunite them against all the odds.", "title": "Like Water for Chocolate\n      \n          (Como agua para chocolate)", "url": "http://www.goodreads.com/book/show/6952.Like_Water_for_Chocolate", "average": 3.94, "cover": "https://images.gr-assets.com/books/1430241812l/6952.jpg", "reviews": 7169, "authors": [{"url": "https://www.goodreads.com/author/show/4694.Laura_Esquivel", "name": "Laura Esquivel"}, {"url": "https://www.goodreads.com/author/show/5758324.Thomas_Christensen", "name": "Thomas  Christensen"}, {"url": "https://www.goodreads.com/author/show/577215.Carol_Christensen", "name": "Carol Christensen"}], "type": ["Fiction", "Romance", "Magical Realism", "Historical", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/6952.Like_Water_for_Chocolate", "http://www.goodreads.com/book/show/18049229", "http://www.goodreads.com/book/show/1288308._", "http://www.goodreads.com/book/show/89477.Like_Water_for_Chocolate", "http://www.goodreads.com/book/show/77007.Like_Water_for_Chocolate", "http://www.goodreads.com/book/show/73716.Como_agua_para_chocolate", "http://www.goodreads.com/book/show/578378.Como_agua_para_chocolate", "http://www.goodreads.com/book/show/73718.Como_agua_para_chocolate", "http://www.goodreads.com/book/show/25517.Malinche", "http://www.goodreads.com/book/show/25520.The_Law_of_Love", "http://www.goodreads.com/book/show/28090792-pierced-by-the-sun", "http://www.goodreads.com/book/show/724834.Swift_as_Desire", "http://www.goodreads.com/book/show/30051360-el-diario-de-tita", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}