{"ratings": 766, "userreviews": [{"userName": "Hannah Greendale", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend. This lovely little book sparks an interest in learning more about these forty remarkable African American women who defied oppression, followed their dreams, and changed the world."}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "5 stars! THIS BOOK WAS AMAZING! This is one I happened to pick up as it was sent to my library from the book selector gods (may they ever be so kind). The artwork caught my eye and I decided to take a better look. Best decision I’ve made in a long time.This is a nonfiction book where the author wrote about a black female leader in history and then illustrated a picture of them. I loved reading about all the trailblazing women in this book, some I had never even heard of until I read about them in here. I’m also in love with the author’s illustrations, I immediately went and stalked her on etsy to see what she had for sale.If you have a child in your life, boy or girl, I highly suggest you purchase this book or check it out from the library for them. It’s a book that young readers need to read and experience.Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"userName": "MissFabularian", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/2060082-missfabularian", "userReview": "Love, love, love this book! Buying copies for my nieces...will probably need to buy some copies to donate to area libraries. My mommy is in love with the illustrations, crossing my fingers for a quilt rendition....I'm too emotional, logging off... Full review HERE."}, {"userName": "Julie", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "This is my third illustrated girl power read in less than a year, and, even though I'm giving it four stars, I'd also like to have a little moment to bitch.I started this girl power journey with Good Night Stories for Rebel Girls: 100 Tales of Extraordinary Women and was positively blown away with the original art work (as were my two daughters), but the collection included so many unknown women and omitted so many more obvious choices, I was left scratching my head in confusion. The book held both of my daughters' interest for about 50% of the time.We then moved on to Chelsea Clinton's brainchild She Persisted: 13 American Women Who Changed the World and, though the illustrations were not the stunners of the previous book, they were lovely. However, I was once again left scratching my head over the 13 women who were chosen, (why, why must so many of them be so obscure?), and my 7-year-old had no interest in any of the stories, and my 9-year-old was interested for about 20% of the read.This week we moved on to Little Leaders: Bold Women in Black History written and illustrated by Vashti Harrison, and, even though the actual women chosen for this collection made a lot of sense, or more sense than the previous two collections, the “blurbs” felt like they were provided by Wikipedia, and the artwork seemed unoriginal, monotonous, and computer generated in appearance. The author writes that she designed them [the leaders] to be interchangeable \"because I want you, the reader, to see yourself in any one of them, and to feel their strength and possibility in you,” and that's an interesting concept, but both of my daughters yawned openly on the book and all but fell asleep on its pages.Here's my biggest beef with all three of the books: WHO is the target audience? Are we trying to get Mom to buy copies to share with her daughters? If so, then tailor the women's blurbs to inspire the interest of children. Are we hoping that Mom will buy into the premise of buying them for her daughters, but then secretly enjoy them as part of her own library? If so, then spice up these dull stories!I have had the rare pleasure of spending part of an evening with Maya Angelou, and I can tell you, it was like having a conversation with a mountain that had just sprouted eyes. My bones vibrated just from sitting across from her. This book reduces her to a page that might as well have said blah, blah, blah.I have also had the pleasure of studying Zora Neale Hurston, who grew up not far from my university in Florida, and I found her to be one of the most fascinating humans who ever lived. The woman was an absolute enigma! And, again, the text reads blah, blah, blah.I have reluctantly given all three of these books 4 stars, because I believe in girl power and I like books that promote learning, but if this girl power trend in children's books continues, the authors and illustrators are going to need to work a little harder to earn my stars."}, {"userName": "paula", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/1543634-paula", "userReview": "I have been a librarian serving kids for only 13 years (“only” because librarianship is a long-legged profession, and I have many colleagues my age who are celebrating 20 or 25 years already). So I can tell you that it was not that long ago that a little African American girl looking for someone who looked like her in the biography section had to settle for Harriet Tubman or Madam C.J. Walker. That is almost literally true.In recent years this situation has improved markedly. We have series biographies, picture book biographies, and standalone biographies of Mae Jemison, Shirley Chisholm, Rosa Parks, Nina Simone, Mahalia Jackson, Oprah Winfrey, Bessie Coleman, Edna Lewis, Josephine Baker, and more and more and more.And now this book, packed with short, snappy bios of admirable black women that are sure to inspire further research, debuts at #3 on the New York Times bestseller list.Pay tribute to the black women voters of Alabama by buying this book for the young person on your list this holiday. ANY young person, but especially the little white boy on your list. Let him grow up never thinking that black women are ever to be disregarded, talked over, or trifled with."}, {"userName": "Ms. Yingling", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/2636606-ms-yingling", "userReview": "Copy received from publisherArranged in order of when the women were born, this book gives a good summary of forty women in a variety of fields, accompanied by an attractive illustration. I found it interesting that the project started with these illustrations being created for social media during Black History Month. It was nice that some of the women were ones that many students would have heard about, but others were more obscure. The summaries include just enough information to be read as a bedtime story or to a school class, and will pique readers' interest in finding out more information about these women of achievement. I enjoyed this a lot, and have only two minor quibbles-- the downcast eyes on the illustrations don't really say \"bold\" to me, and the bibliography is lacking. A list of sources consulted would have helped when readers wanted more information."}, {"userName": "Bree Hill", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/26896300-bree-hill", "userReview": "This was such a joy. I listened to the audiobook but I’ve seen the artwork online which is PHENOMENAL so I really want to get my hands on the physical book.I think what I liked the most about this book is how the author ties each woman’s journey and story back to “through adversity” or whatever was standing her way, she still was able to accomplish whatever she did. And I think young women, grown women..women of all ages races backgrounds need to be reminded that. Absolutely loved it!"}, {"userName": "Flavia", "userReviewDate": "Dec 06, 2017", "userURL": "http://www.goodreads.com/user/show/45526328-flavia", "userReview": "Considering how few children’s books out there feature POC on the cover, that was the initial thing that drew me to this book. The next thing, was the title and how it very much ties into my goal when it comes to teaching my future children about equality for all, as well as feminism (which I suppose can also be categorized under “equality for all”…although I meant that one more for equality for all races? I’m not sure if there is specific terminology that I should be using, but if you know, please share it with me in the comments!)I will want to teach my children about compassion and strength, and I believe that all other children should be taught about these things as well. This book, therefore, I believe should be found in every household, kindergarten, school library, and public library. While it not only teaches readers about standing up for what’s right, and introducing them to a number of bold black women (out of which, I was only familiar with 4, before picking up this book), it is also well-written, and very nicely illustrated. I really like the style that was used to depict each woman, and how it stayed the same throughout. And I also found that I really enjoyed the colours, as well as how the text and images were laid out!This book looked beautiful sitting beneath my Christmas tree, and I think that all of the little humans in the world who celebrate Christmas could benefit from finding such a book beneath their tree, or in their stocking! It is my belief that this book is very important, and that we definitely need more books like this. Little humans, and grown humans alike, could stand to learn something from this book. I will be donating my copy to my local library, in the hopes that little humans can borrow and read it from there this holiday season, and for as long as the library chooses to keep it on their shelves thereafter."}, {"userName": "Stephanie", "userReviewDate": "Jan 15, 2018", "userURL": "http://www.goodreads.com/user/show/1697920-stephanie", "userReview": "I can't think of a better book to read on Martin Luther King Jr. Day - an extremely accessible book full of stories of black women making history - in sometimes quiet but always impactful ways.Harrison's adorable and iconic illustrations for each black woman in history accompany a short, reader-friendly biography of each woman and her accomplishments. Young readers to old readers can enjoy these stories of amazing women and the illustrations that make them seem real and human.I especially love that each illustration starts as a \"template\" with the famous woman's defining features created on top. It purposely creates the sensation that the drawing could be anyone, even the reader. Harrison is both respectful of all reading levels and brave about adding harder truths about some of these women. She deftly describes their history and important life events (while sometimes painful) in highly empathetic and human ways. She also makes it clear that many of these trailblazers directly influenced other important woman later in the book. It's clear the legacy that seeing and acknowledging people of all backgrounds can have on the lives of people in any age.Absolutely love it and would recommend it to anyone!"}, {"userName": "Quinn Rollins", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/6677104-quinn-rollins", "userReview": "I've read many similar books, and I sometimes shy away from something so specific (targeting a narrow group of people instead of broader), but this is too outstanding to let pass by. Little Leaders: Bold Women in Black History is a collection of 40 one-page biographies of amazing African American women. Author/artist Vashti Harrison pulls from every walk of life--literature, politics, pop culture, athletics, science--to give children a chance to see a hero they can relate to. I was most exited to see Nichelle Nichols I think -- Lt. Uhura from the original Star Trek series. Having her in a book alongside Phyllis Wheatley and Angela Davis and Ruby Bridges -- I love it. The text tells readers about their personal lives, but focus on their accomplishments and why they deserve to be not just remembered, but celebrated. The full-page illustrations are (I don't often use this word) adorable, perfectly complementing the serious text. This is a book that belongs in every elementary classroom and library."}, {"userName": "Jenny  (Mama Bear Reads)", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/44555655-jenny-mama-bear-reads", "userReview": "This was just fantastic! I learned a lot and think that this will be so helpful in teaching young children about so many phenomenal black women. The artwork was so adorable and engaging. The descriptions of the women were informative but short enough to hold a child's attention.I'm so glad I ordered this!"}, {"userName": "Luna", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/7573500-luna", "userReview": "The content, the art, how it’s written…. Basically, I loved all of it. There are so many inspiring women in this book."}, {"userName": "Daria Marshall", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/21892859-daria-marshall", "userReview": "4.5 starsI loved this so much.First off, the illustrations are freaking adorable. Like, I wish I had prints of each of them to hang up in my apartment.As with Good Night Stories for Rebel Girls, I think that everyone should pick this up. The women who's stories are shared are inspiring and incredible. I don't think I have enough words to say how awesome this was. The only reason why I took a half star off is that I wish it were longer because I'm greedy like that and want to learn more."}, {"userName": "TammyJo Eckhart", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/3713782-tammyjo-eckhart", "userReview": "We had so much fun reading this book together. The \"little leaders\" are adorable looking yet their clothing, their facial expressions, their postures, the objects they hold and interact with, and their environments were both realistic and symbolic. Sometimes before I read the one page biographical essay I'd ask \"What do you think this person did based on what you see?\" and my audience almost always guessed correctly we learned as we read. The text is lively to read and with the help of an adult, a third or fourth grader could read it herself. While entertaining, Harrison has not shied away from historical facts that address racism, sexism, economic hardish, and other important issues that even children should learn about. Yet at no time did we feel sad for long because each of the 40 women in this book was victorious in living her life fully and courageously, often in the service of others. At the end before a brief list of website, books, and recordings we can find to learn more, there is another brief list of 12 other \"little leaders\" we can learn more about. I hope that Vashti Harrison continues to put out more books because her writing and her art is inspiring for both of us to read and learn from together."}, {"userName": "Smoran8m", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/5953194-smoran8m", "userReview": "I first heard about this book from a short interview with the author Vashti Harrison on the daily show. When asked if she thought the book would be successful she answered: \"I knew black women support black women.\" I also love that the project started as an artist challenge (much like my fav artist Nuchtchas Daily Creativity). When I looked up the book on Amazon I was surprised and pleased that the hardcover was only $11, so I bought one and, on impulse, bought one for every member of my book club. (This counts as both an African American History Month/Feb present and a Women's History Month/Mar present). The book was just delightful. The artwork super-cute and the stories delightful. There were women I knew a lot about (Harriet Tubman, Rosa Parks), ones I had heard a little about ( Madam C. J. Walker, Ida B. Wells), and ones I never heard of before ( Mamie Phipps Clark, Alice Ball). On every page, I learned something new. The bios were fresh and engaging and spurred me to learn more."}, {"userName": "Elaine", "userReviewDate": "Mar 15, 2018", "userURL": "http://www.goodreads.com/user/show/52609735-elaine", "userReview": "In tune with the Bedtime Stories for Rebel Girls series, this book presents narrative summaries about the lives of amazing women with an illustrated portrait. What I adore about these portraits is that they are styled humbley, relatably, and adorable for children!"}, {"userName": "Megan", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/3942402-megan", "userReview": "I loved it. I loved each of the introductions to these amazing women and I adored all the original illustrations. Just wonderful."}, {"userName": "Monique", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/1841511-monique", "userReview": "Absolutely the best children’s book on Black female leaders. The biographical information is interesting and easy to follow. While the illustrations could be artwork in schools or homes. Love everything about this book...wish I could afford to buy 1,000 copies togive to every little girl I know."}, {"userName": "Sarah Adamson", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/24040859-sarah-adamson", "userReview": "This is an awesome book. This is a powerful and amazing yet very easy to read and comprehend book on some of the most amazing black women leaders in history. Covering everything from astronauts and jazz singers, to doctors and ballet dancers, this book will help you and your children get informed on some of history’s great names. My 8 year old got this for her birthday, read it (a bit everyday) for a week and told me I had to read it too. It is moving, simple and clear yet filled with facts."}, {"userName": "Megan", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/6086019-megan", "userReview": "Stunningly beautiful illustrations and perfect length bios of each women for reading to young kiddos to inspire them to want to learn more. LOVE THIS BOOK"}, {"userName": "Jenna Grodzicki", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/25233442-jenna-grodzicki", "userReview": "This beautifully illustrated book includes mini biographies on 40 inspirational black women in American history. Some, like Rosa Parks, are well known. Others, like Mary Bowser, I had never heard of. However, all of the women featured in this book are amazing in their own ways. I especially loved that one of my all time favorite gymnasts, Dominique Dawes, was included. Young readers will likely want to do more research on each woman after reading this book."}, {"userName": "AMY", "userReviewDate": "Feb 12, 2018", "userURL": "http://www.goodreads.com/user/show/46746637-amy", "userReview": "87 pages. This is an amazing collection of short biographies of famous Black Women who lived incredible lives in America. Great facts, well-written, nice illustrations. Additional information about other famous women at the end. I would buy for my school. Highly recommended for Grades 4-5 and beyond."}, {"userName": "Laura Paulisich", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/65506394-laura-paulisich", "userReview": "Wow❣️iL❤️VE this book and am now a fan of @vashtiharrison❣️I learned so much and am so grateful this inspiring book exists! #requiredreading"}, {"userName": "KC", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/7582369-kc", "userReview": "I am so thrilled that our library purchased this book. I loved the illustrations and each individual story. So many women I never knew of. Loved, loved, loved, this book!"}, {"userName": "mg", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/1069322-mg", "userReview": "I love the idea of this book. Vashti Harrison is clearly a gifted illustrator and has assembled some fabulous 1-page bios about well known national treasures (Harriet Tubman, Rosa Parks) and some lesser well known Black women as well. I know that she explains her rationale for having all the women depicted as \"little girls serving as stand-ins for these famous women\" and her desire for them to be \"interchangeable\" so that readers can see themselves in the images. But I simply cannot get over the fact that these bold as hell, revolutionary, daring women are depicted so demurely and referred to as \"little.\" I mean, Angela Davis with downcast eyes and the Black power fist? I weakens everything that so many of these women fought and strove for (for themselves, for women, for Black women); I think this is a serious detriment to the character of these women."}, {"userName": "Jennifer", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/6568368-jennifer", "userReview": "Illustrations are wonderful! Each leader's personality shines through every one. Some of these amazing women I knew and others I didn't. So informative & it was great to see how these women's lives intersected and influenced each other."}, {"userName": "Megan", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/8627448-megan", "userReview": "A book I would recommend all ages read. The illustrations were beautiful, and reading about these women was educational. I recognized a lot of the names, but wasn't aware of some of the things they had accomplished in their lives!"}, {"userName": "Pauline", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/186596-pauline", "userReview": "Love this volume that shares stories from every field and profession! Accessible format to give kids a 'taste' of these women and sets them up for further inquiry."}, {"userName": "Charlotte Jones", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/8943949-charlotte-jones", "userReview": "I found this book to be informative and educational and I think that, similarly to another book I read recently, because of the younger target reader, the information about each historical figure was quite limited. However, I really liked the illustration style and I think that this would be a brilliant book to share with children."}, {"userName": "Hayley DeRoche", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/7382533-hayley-deroche", "userReview": "This is such a great book to work through before bedtime with young children, and I learned along the way, too!"}], "description": "Featuring forty trailblazing black women in American history, Little Leaders educates and inspires as it relates true stories of breaking boundaries and achieving beyond expectations. Illuminating text paired with irresistible illustrations bring to life both iconic and lesser-known female figures of Black history such as abolitionist Sojourner Truth, pilot Bessie Coleman, chemist Alice Ball, politician Shirley Chisholm, mathematician Katherine Johnson, poet Maya Angelou, and filmmaker Julie Dash. Among these biographies, readers will find heroes, role models, and everyday women who did extraordinary things - bold women whose actions and beliefs contributed to making the world better for generations of girls and women to come. Whether they were putting pen to paper, soaring through the air or speaking up for the rights of others, the women profiled in these pages were all taking a stand against a world that didn't always accept them. The leaders in this book may be little, but they all did something big and amazing, inspiring generations to come.", "title": "Little Leaders: Bold Women in Black History", "url": "http://www.goodreads.com/book/show/35231671-little-leaders", "average": 4.63, "cover": "https://images.gr-assets.com/books/1509595039l/35231671.jpg", "reviews": 192, "authors": [{"url": "https://www.goodreads.com/author/show/16890089.Vashti_Harrison", "name": "Vashti Harrison"}], "type": ["Nonfiction", "Biography", "Childrens", "History", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/35231671-little-leaders", "http://www.goodreads.com/book/show/35488059-little-leaders", "http://www.goodreads.com/book/show/38496751-dream-big-little-leader", "http://www.goodreads.com/book/show/39813946-little-leaders-boxed-set", "http://www.goodreads.com/book/show/39292619-little-leaders", "http://www.goodreads.com/book/show/35297602-festival-of-colors", "http://www.goodreads.com/book/show/36039362-cece-loves-science", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}