{"ratings": 168110, "userreviews": [{"userName": "Emily May", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "All her life, she had learned that passion, like fire, was a dangerous thing. It so easily went out of control.\n4 1/2 stars. You should go into this book expecting what it is: a slow-moving character portrait filled with complex family dynamics and small-town politics. If you know what this is, like with Ng's Everything I Never Told You, and don't go into it expecting fast-pacing and high-octane drama, you will probably find this quiet read to be extremely engrossing and emotional.I have to be in the mood for this kind of read, but when I am, it packs a powerful punch. These characters are so vivid, so real, so caught up in the little fires of everyday life in Shaker Heights. There's several stories going on in here, but the book begins with literal fires lighting up the Richardson household and the knowledge that the youngest daughter, Izzy, the wild card, has disappeared. Presumably because she is guilty of the arson.Then we move back from there. We start to get a portrait of the events leading up to this dramatic fire. We see the poor artist, Mia, and her daughter, Pearl, move into town and the effect they have on all members of the Richardson family. Further back, we get the past stories of almost every character who comes into this book. It is such a rich work in which the personal stories and experiences of secondary characters play a huge part in influencing how events unfold.And, behind it all, is a court case that will affect all the characters lives. A custody battle over a Chinese baby who could be given every toy, every desire, every opportunity by her rich and white adoptive parents - but is that all? Is that enough when her poor birth mother is ready and willing to care for her? Things become very tense. The town becomes divided. And I felt an emotional wreck by the end of it, too.\nMrs. Richardson, however, could not let Izzy be, and the feeling coalesced in all of them: Izzy pushing, her mother restraining, and after a time no one could remember how the dynamic had started, only that it had existed always.\nThe Richardson family, along with Mia and Pearl, Bebe, and the McCulloughs, all pulled me into their lives. I despised a character at one point, only to find pity for them a couple of chapters later. The relationship between Izzy and her mother was a real point of interest for me. How Mrs. Richardson's fears about Izzy affected her behaviour toward her, which in turn affected how Izzy behaved. All leading to the ultimate question: was Izzy always what Mrs. Richardson feared she was? Or did Mrs. Richardson create what she most feared through her treatment of Izzy?Little Fires Everywhere is a great example of how small character dynamics can create a powerful and fascinating story. I love the empathy the author shows for all the people in this book - even the manipulative, morally corrupt and undeserving. No one is merely good or bad. And that is what makes the book so effective. Whose side am I on? I'll let you know if I ever figure it out.Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Melissa", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/9684061-melissa", "userReview": "*4.25 stars*Little Fires Everywhere is such an apt title for a novel that delves into the intricacies and angst that undoubtedly burns through some relationships—none more so than mother and daughter. At its core, this story explores the notion that being a mother doesn’t mean being perfect; it comes down to love, sacrifice and sheer will. Through her cast of captivating characters, Celeste Ng confronts the reality that haunts us all—each and every one of us is rife with cracks and flaws, no matter how well we hide it from prying eyes. That’s just life.It’s akin to pure magic when you pick up a book from an author you haven’t read before—I know, what’s wrong with me? How did I miss Everything I Never Told You?—and find yourself caught up in what can only be described as book nirvana. I had heard Celeste Ng’s writing style was incredible, but I took that with a grain of salt—merely an attempt on my part to avoid disappointment. What I didn’t anticipate was this level of character development. This level of intricate detail and the multifaceted beings I wanted nothing more than to surround myself with.I have to admit, it was Mia that started out as my least favorite of the bunch. Her artsy-fartsy, gypsy-ways came off as incredibly selfish. A mother sacrificing any sense of stability for her daughter, in an attempt to chase her next inspiration, rubbed me the wrong way. How could she not stay in one place and let her incredibly smart daughter thrive?Then we meet Mrs. Richardson who’s been hell-bent on living the life she laid out so perfectly in her mind. From most angles she has it all—steady career, lovely home, successful husband, wealth and four children. A conundrum of sorts, she’s tenacious, but still somehow oblivious. Initially, I wasn’t really sure what to make of her or her motives—was I reading more into things than I should?What binds these two very different women together is their teenage children who have their own fires burning between them and a custody battle that rocks their small town. The women end up on opposing sides of the equation, only working to further highlight their differences. The author juxtaposes these two women in many aspects—but not overtly so—and by the end, I was stunned.What struck me the most about this journey was the author’s ability to change my entire perspective—meaning, my thoughts and feelings in the beginning of the story were vastly different by the time I turned that final page. Some aspects ended on a sad note, but overall it was still a satisfying ending to what I can only describe as a fully immersive novel. I had the pleasure of reading this with the Traveling Sisters group; what a fun experience it turned out to be. Celeste Ng gave us plenty to discuss. Looking forward to the next read sisters. ♥*Thank you to Penguin Press and Edelweiss for a copy in exchange for an honest review."}, {"userName": "Deanna ", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/15662887-deanna", "userReview": "My reviews can also be seen at: https://deesradreadsandreviews.wordpress.com/“Little Fires Everywhere” is my first read by Celeste Ng, but I’m pretty sure that it won’t be my last. I could easily have read this book in just one or two sittings but life got in the way (in this case life being a glass of 7up, a knee jerk and “Nooo! Save the books!”). But once the book was dry, I picked it up again and didn’t stop until I finished the last page.Everything in Shaker Heights is planned and there are rules that residents must follow. Houses can only be painted certain colors (to ensure aesthetic harmony), garbage is never put out in front of the house, lawns must always be cut promptly, etc.The city motto says it all:\n“Most communities just happen; the best are planned”\nWhen Mia Warren and her fifteen year old daughter, Pearl rent a home from the Richardsons, a prominent Shaker Heights family – their lives will become intertwined in ways they never could have imagined.Mrs. Richardson liked to rent to people she felt were deserving of her help, people who may have had some tough turns in life. She felt it was her way of giving back. When she first meets Mia Warren and her daughter she thinks they are the perfect tenants.One of the Richardson boys, Moody is curious about the new tenants and heads over to the rental property. Moody and Pearl hit it off immediately. Moody who has never wanted for anything, is surprised at how this mother and daughter make their way. Mia can stretch a dollar (and leftover food) farther than anyone he’s ever seen. It’s not long before Moody brings Pearl home to meet everyone. Soon Pearl is spending much of her time at the Richardson home. At first, everything is fantastic. Mrs. Richardson even hires Mia to do some housekeeping and cooking at the Richardson home. But it won’t be long before the many differences between Mia and Mrs. Richardson cause a divide that will affect the two families in unimaginable ways.In some ways, I felt bad for Pearl as the nomadic life that her mother had them living would be hard on anyone, especially a teenage girl. However, Pearl also seemed to benefit from the way they lived. At first, Mia came across as incredibly selfish but it wasn’t long before I loved her. Her caring ways were evident and how she responded to the different crises that came up endeared her to me. I may not have agreed with all of her choices but I could certainly see how she would have made them.Right off the bat I was irked by Mrs. Richardson (the fact that she was rarely referred to by her first name was fitting). Mrs. Richardson was the type who wanted to be seen as someone who cared and helped others. However, you could tell right away that she kept track of all the good things she had done. And you never knew when Mrs. Richardson would want a repayment of her “kindness”. When she offers to buy one of Mia’s photographs and Mia doesn’t fall at her feet with gratitude...\n“That’s very generous of you.” Mia’s eyes slid toward the window briefly and Mrs. Richardson felt a twinge of irritation at this lukewarm response to her philanthropy. \nIzzy was a firecracker and I adored her impulsiveness and strong feelings about right and wrong. Even at ten years old, setting shelter cats free \n“They’re like prisoners on death row”\n, her refusal to conform was thrilling. Mrs. Pissers and the toothpick incident had me giggling. And I hurried to Google to search “This Be The Verse” by Philip Larkin.There was a lot going on in “Little Fires Everywhere” but I found it easy to keep up. I will say that it had a bit of a slow start but I feel the author was just setting the stage for all that was to come. And once I hit the halfway mark, I was so completely invested into all of their lives and HAD to know what was going to happen next.The additional story-line of little Mirabelle McCullough/May Ling Chow’s adoption was incredibly thought provoking and had me asking myself some hard questions. I honestly didn’t know which side I was on half the time. My head was spinning.\n “What made someone a mother? Was it biology alone, or was it love?”\nI thought that the development of the characters was fantastic. With so many characters and only so many pages, it takes skill to bring them all to life. And in my opinion; Celeste Ng did a phenomenal job. And with the many 90’s references such as Sir-Mix-a-lot, Smashing Pumpkins, Jerry Springer, and Monica Lewinsky - I was taken back to my own adolescence.This was an intriguing and compelling domestic drama. A story about motherhood, adolescence, race, rules, right and wrong, and so much more. Great characters and an interesting plot made “Little Fires Everywhere” a fast and fantastic read. Many thanks go to Penguin Press for providing a copy of this book for me to read in exchange for my honest review."}, {"userName": "Elyse", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I pre-ordered this book months ago. It arrived at 12:01am today. I've been reading non - stop.... a one- sitting read with a few necessity breaks. Here's is my problem.... I feel as if I've read this story before. I was only mildly interested in many scenes. There were parts I found trite and parts I found semi boring. Personally - I found the characters to be very one dimensional. Here's another problem I have:Yesterday I finished reading \"In The Fall They Come Back\", by Robert Bausch. I saw a lot of similarities in these two books, but this novel didn't 'wow' me nearly as much. This story 'seemed' like it had all the elements I usually love ..... The wealthy and thrifty battle it out...plus moral issues to think about ...but my heart wasn't always in it. Not sure why. It could be me. For one thing..... I spent summers in Shaker Heights .... I felt this book could have been written anywhere. Plus.... I'm not sure I appreciated some of the stereotyping of this community.BUT ....here's a small flavor of the characters you'll spend time with: 'The Richardson's family': Bill is an attorney and drives a BMW SedanElena is a wife & mom..... works for the local newspaper: 'Sun Press'. She drives a LexusTHE FOUR SIBLINGS:Lexie -senior drives an explorer- has the lead in her School play. Seems fruity & shallow at times - but is an excellent student Trip - a junior - drives a jeep - loves sports - handsome -fit --and charming Moody - sophomore- rides a bike ( bless him) - most compassionate- very bright -introspective Izzy - Freshman- considered black sheep of the bunch - feels different than others in her family. 'The Warren's: They recently moved into a rental ( a duplex) that the Richardsons own. Mia- 36 years old, single mom, artist. Mia drives a VW Rabbit. She would rather mop floors any day- quietly alone- than have to wait on customers. Pearl -15 years old - Mia's daughter - shy - honors student - Paul, my husband, is rushing me - he says RETIRE.... lol.....So.....I LIKED IT.....but..... after several great books I've recently read, I can't say I'm 'wild' about it. It was ok!!! - alright - better than OK!Worth reading! Others may love it! 3.6 stars"}, {"userName": "Julie Ehlers", "userReviewDate": "Jul 21, 2017", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "[diagnosed with a brain tumor and given weeks to live at precisely the time she’s most needed. I guess at least it’s good that she doesn’t die in a car accident on an icy road—but that’s only because another character does fall victim to that cliché a few months later. (hide spoiler)]"}, {"userName": "Maxwell", "userReviewDate": "Oct 01, 2016", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "When I read Celeste Ng's debut novel \nEverything I Never Told You\n in late 2014, I was smitten. Ng's writing was so beautiful, her characters so real, and the story so compelling. I instantly knew I would be reading whatever she put out next.Three years later and I'm happy to say that Ng has returned with just as stunning of a novel as her debut. Little Fires Everywhere is hands down one of the best books I've read this year; and just like its predecessor will be rising to the top of my yearly favorites list.I don't want to say too much about this novel because with Ng's books, I've discovered, it's best to go in anticipating very little and being surprised along the way. Because she is very good at surprises—and not the kind of plot twists you'll read in a thriller or spy novel; the kind of surprises that sneak up on you in real life and seem to tear your world apart. Her novels are domestic, but they aren't quaint. They have a raw, emotional power to them that are especially drawn out by her incredibly crafted characters. The inner turmoil is just as important as the external conflict in her stories, and that makes for a compulsively readable, yet immensely relatable read. You can empathize with so many parties in her stories, and this one is no exception. To me, these characters jumped from the pages; they have the mannerism (she's so observant, akin to Adichie in that sense) and the motivations of people you know in your own life. Mrs. Richardson's ethics and worldview are as real and as contrary as Mia's artistic sentiments. And you can't help feeling for both of them at times. That's what makes this story so good—there is no black and white, despite the obviously drawn lines between the differing characters. Ng exists in the grey, and her mission, it seems to me, is to pull you in to the grey too and think about how murky and complicated and messy life is.I'll stop gushing, but only as long as people go pick this up and read it (along with her first novel too)! Ng is surely one of my favorite living writers, and, again, I can't wait to see what she does next."}, {"userName": "Larry H", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "I'd rate this 3.5 stars. (I know, it's killing me, too.)Sometimes one of my greatest frustrations with books I read is that it is difficult for me to believe that a character would do something egregious as a knee-jerk reaction to something they don't agree with. I know, I'm reading fiction, which isn't always directly based on real life, but sometimes a character's actions are so ridiculous and ring so false that they really change my feelings about a book.Other times a character is so unlikable (although you may discover it's all an act) that they're just so off-putting, and they detract from the book's appeal.Both things happened for me while reading Celeste Ng's new book, \nLittle Fires Everywhere\n, and I'm so disappointed, because I wanted to love it. While I found much of the book simply beautiful, the plot—and one character—travel down a path that I found a little too far-fetched and irritating that it spoiled how I felt.To someone on the outside looking in, the Richardson family seems like the quintessential Shaker Heights, Ohio family—two successful and driven parents, four good-looking children, sure to follow in their parents' footsteps. The perception isn't all false—Elena Richardson, who returned to her hometown after college to raise a family, is a reporter for the local paper; her husband is a successful attorney. Their children, each one year apart, are each popular and successful in their own way, except the youngest, Izzy, who has a knack for standing out, especially if it means pushing her mother's buttons.When Mia Warren, an enigmatic, slightly bohemian artist, and her daughter Pearl arrive in Shaker Heights, and move into the Richardsons' rental apartment, the family quickly falls under their spell. Pearl, who has moved more times than she can count, always on her mother's whim, has finally extracted a promise from Mia that they will stay in Shaker Heights, and she is excited to finally be able to make friends and cement relationships instead of biding her time until she leaves town again.Pearl and the Richardsons' younger son, Moody, become close friends, although quickly she becomes a part of the family. Mia, too, in addition to working on her art, begins working for the Richardsons, becoming an unexpected confidante for older daughter Lexie, and forging a relationship with Izzy that she can't have with her mother. But Mia is also wary of the Richardsons and doesn't quite trust that all is as perfect as it seems.When a custody battle involving one of Elena's oldest friends becomes fodder for the media, everyone in town has an opinion. Elena discovers that she and Mia are on opposite sides of this fight, which causes Elena to view Mia with suspicion. Suddenly she feels the need to find more about this mysterious woman who holds her family in her thrall, and Elena doesn't realize—or care, really—about what damage the truth may cause, for everyone.\"All her life, she had learned that passion, like fire, was a dangerous thing. It so easily went out of control. It scaled walls and jumped over trenches. Sparks leapt like fleas and spread as rapidly; a breeze could carry embers for miles. Better to control that spark and pass it carefully from one generation to the next, like an Olympic torch. Or, perhaps, to tend it carefully like an eternal flame: a reminder of light and goodness that would never—could never—set anything ablaze. Carefully controlled. Domesticated. Happy in captivity. The key, she thought, was to avoid conflagration.\"\nLittle Fires Everywhere\n is a powerful meditation on motherhood and the sometimes-tenuous bond between mother and child. It's also a book about the destructive power of secrets, misunderstandings, and miscommunication, and how easily problems could be avoided if people would just say what they thought, or speak up rather than let a person roll over them. At its most poignant, this is a book about the damage that can be done by neglect or mistreatment, even when it's unintended, and how finding someone who seems to care about you can be a life-changing force.Ng is a storyteller with such quiet power. As she did in her spectacular first novel, \nEverything I Never Told You\n, she captures the routine and dramatic moments in a family's life, uncovering just how much goes on underneath the silences. While I appreciate her fearlessness in creating unappealing characters, I really was unhappy with some of her choices, which I won't reveal for fear of spoiling the plot, but they just seemed so ludicrous (and in one case, just a wee bit convenient and predictable) that one character and her treatment of others became almost one-dimensional.I've seen many glowingly positive reviews of this book, so I wouldn't let my criticisms dissuade you from reading it if it interests you. Ng is an immense talent, and I look forward to seeing what's next for her. If you do read this, I would love to talk to you after you're finished, to see what you thought about the things that frustrated me. See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Susanne Strong", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "5 Amazing Bright Shiny Stars! I would give it 100 if Goodreads would let me. Little Fires Everywhere is a novel that far surpasses any other that I have ever read.  I don't know how Celeste Ng did it. It is a brilliantly written novel with intricate, rich and wholly vivid characters whose lives are so fully intertwined you can't help but read on in bewildered awe of how Celeste Ng created these characters. My nerve endings were fully engaged on high alert from the first sentence.Shaker Heights, Ohio is an affluent town with rules and regulations like no other. Mrs. Richardson lives by them, having been raised by them and she has raised her four children (Lexie, Trip, Moody and Izzy) to abide by them as well. She rents a little apartment in Shaker Heights to Mia Warren and her daughter Pearl, who are less fortunate. Mia is a free spirited artist, who lives life to the fullest. These women have one thing in common and one thing only: they love their children immensely and they accept each other's as their own. Mia (or rather Ms. Ng) describes it beautifully: \"To a parent, your child wasn't just a person, your child was a place, a kind of Narnia, a vast eternal place where the present you were living and the past you remembered and the future you longed for all existed at once. You could see it every time you looked at her; layered in her face was the baby she'd been and the child she'd become and the adult she would grow up to be and you saw them all simultaneously, like a 3-D image. It made your head spin. It was like a place you could take refuge, if you knew how to get in. And each time you left it, each time your child passed out of your sight, you feared you might never be able to return to that place again.\" Neither live perfect lives, sometimes in fact they make grave mistakes, yet their love for their children never falters. These mothers relationships with each other, their family and everyone in town is threatened when a custody battle ensues between a friend of the Richardsons, Mrs. and Mr. McCullough, who are in the middle of adopting a Chinese American baby and a friend of Mia's, Bebe, who is the birth mother. This battle wrecks havoc on the town and causes incredible strife between the families. This novel is captivating and crazy compelling. These characters burn an indelible image onto your soul.  The character of Izzy, Mrs. Richardson's daughter had me from the beginning (kind of like Hannah from Ms. Ng's Everything I Never Told You - which I also loved). Izzy has a strength and over came odds that most children in her position wouldn't. Her triumphs made my heart soar. Somehow Ms. Ng made me change my mind about some of the characters throughout the course of this novel. In the beginning, I felt one way about two of the characters and then by the end, I did a complete switcheroo, and my feelings about them were FIERCE. Little Fires everywhere brought forth laughter and lots of tears. It is that kind of novel. I can't recommend it highly enough. It is captivating, compelling and full of heart and soul. Celeste Ng's ability to intertwine the characters and storylines was wondrous, brilliant and beautiful. I loved every second of this book.  It has now topped my list as my FAVORITE BOOK of ALL TIME. Little Fires Everywhere was a Traveling Sister Group Read and included Brenda, Norma, Jennifer, Holly, Melissa & Kendall. We all had a fabulous time reading this one together - the group discussions for this incredible read were amazing and I look forward to our next read together. For the full Traveling Sisters Group Review, please see Norma and Brenda's Blog:https://www.twogirlslostinacouleeread...Thank you to Edelweiss, Penguin Press and Celeste Ng for an ARC of this novel in exchange for an honest review.Published on Goodreads, Edelweiss and Amazon on 9.17.17."}, {"userName": "Lori", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/68050592-lori", "userReview": "So, self-identification determines if a book is YA? Based on more than 60% of the content, this is young adult material. It’s good; parts are excellent, others not so much. I liked Mia’s backstory as she became an artist using experimental photography. I thought that the custody dispute concerning “Oriental Barbie” was worth at least a star or two.A lot of the characters are clichéd. The at-home Mr. Richardson could be a cardboard cutout with excellent earning skills. He fairs a lot better before the judge. The Richardson children fit into “The Breakfast Club” well. A jock, a popular girl, a smart kid and Izzy who may well be a transgendered Holden Caulfield (thank you to my GR friend, Bill Kupersmith), but I liked her a lot more than that wretched boy. So yeah, the Richardson’s have a child for each grade in high-school. Mrs. Richardson produced four singletons in roughly as many years. While in other respects, she is a perfect match for her orderly and rule-bound community. The rapid-fire baby production seemed reckless and out of place. It is the only part of her character that jibbed with aggressively investigating her tenant and employee’s past. Opening a ‘can of worms’ and a house full of screaming babies being equally disordered and unpredictable.I don’t believe that she is meant to be likable. She approaches friendship with same calculation as Claire Underwood with a careful tally of every kindness. But, as she is central to the book, I wish she were plausible. Even if she were perfectly constructed, the story is still awfully scattered.My son heard part of the book while we were driving over the holidays. When we stopped, he would say “So” and give a one-sentence summary of the upcoming section or chapter. I don’t believe he has any preternatural gifts as plot savant. A lot of the story is pretty predictable.I have a quibble about that car. Is that the same VW rabbit Mia’s brother bought when they were teenagers? If so, how did she manage vehicle maintenance on minimum wage earnings supplemented by occasionally selling a piece of art? Twenty to thirty years of use is aging NASA spacecraft territory, but this car starts reliably, runs well over long distances, and doesn’t need any repairs. It seems oddly out of place given the careful mathematics of Bebe’s poverty.P.S. I stand corrected my son says he is too a plot savant."}, {"userName": "Angela M", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "The Richardson family lives a perfect life, planned to a T and that's what Elena Richardson, her husband and four children seem to have, at least to fifteen year old Pearl Warren. Pearl moves with her itinerant artist mother, Mia, into a rental house owned by the Richardsons in Shaker Heights and becomes infatuated with this family, their house, their life style so different from her own and is mostly infatuated with three of the teenage siblings. The reader though knows from the get go that there's no perfection here . An awful thing happens to this family and we know what it is from the first sentence but I won't give it away. The Shaker Heights motto is: \"Most communities just happen; the best are planned \" : the underlying philosophy being that everything could - and should- be planned out, and that by doing so you could avoid the unseemly, the unpleasant, and the disastrous.\" The truth is that life happens and no matter what - things cannot be avoided and what happens here defies this underlying philosophy. But this is not the most awful thing that happens in this family. For me it was the dysfunctional relationship that Elena has with her youngest daughter Izzy . Izzy reminds me in some ways of Hannah in Ng's last book, Everything I Never Told You. Unlike Hannah, Izzy is not invisible not totally ignored, but she is picked on, made fun of and seems to always be the recipient of her mother's impatience with things that are not perfect. Theirs is not the only mother-daughter relationship that Ng focuses on . There is Mia and Pearl, who move from place to place, with Pearl not knowing the reason why or who her father was. There is Bebe, Mia's coworker, and her newborn baby May-Ling that she abandons and then fights to get custody. Bebe's story at first seems secondary but it ends up being the impetus for Elena's almost obsessive search to find out Mia's past. Ng delves deep into her characters and you feel you know them inside and out even though it takes until the end to fully understand Elena and Izzy. You may not like all of them but you will understand them . This I find to be Ng's strength as a writer- how she makes us know her characters. One of the most poignant scenes in the novel, is when the Richardsons find the photographs that Mia leaves for them. She came to know them too . Definitely recommended to those who were fans of Everything I Never Told You, and stories of families who are less than perfect, which I'm sure many of us can relate to.  I received an advanced copy of this book from Penguin Publishing Group through Edelweiss.The book links are not working for me now but I'll try again later to insert them."}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "4.5 It's my first novel by Celeste Ng and even though Literary Fiction/Contemporary isn't my genre, I really enjoyed this one. I now have to pick up \"Everything I Never Told You\" which has been on my shelves for way too long!Would recommend if you're looking for a slow character driven book full of emotions!"}, {"userName": "Liz", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/4125660-liz", "userReview": "At first glance, this book seems to be mostly about teenagers, but then it struck me that it’s really about parenting. Each parent thinks they’re doing the right things in the way they raise their children. But who truly is?  Ng does a good job of bringing each character to life. Izzy is the most unique of the characters. And the relationship between Izzy and Mrs. Richardson is spot on perfect. “When it came to Izzy, Mrs. Richardson was seldom calm, and for that matter, Izzy herself never was.” There are multiple storylines here, all equally fascinating. The one that grabbed me the most was between Bebe Chow and the McCulloughs. I flip flopped back and forth between whose side I was on. The heartache of both sides was palpable. It took a while for the book to truly grab me. But once it did, it really did. The title is so apt. Not just the physical fire, but the fires that burn within the characters, especially the fire that ignited in Mrs. Richardson. It’s interesting that the author refers to Mrs. Richardson by her formal name, whereas everyone else is called by their first name. It suits her perfectly, as she is such a stickler for tradition and following the rules. This is a fascinating book with a lot going for it. Five rich stars!Update - both of my book clubs had this as their selection this month. In both cases, the discussions were great. Any clubs looking for ideas, I highly recommend."}, {"userName": "Diane S ☔", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "An author that has the uncanny ability and insight to look deep inside the workings of the often complicated relationships between mothers and daughters. Mrs. Richardson prides herself on always following the rules, believing if this is done success in life and family will follow. She has four children , but as we know saying it doesn't make it so. Mia, a single mother, has a secret, a secret that will be used to her detriment. She was my favorite character, has a better, closer bond with her daughter, Pearl, but mother's know, teenage daughter keep secrets too. A friend of Mrs Richardson, is unable to have children, but is given an opportunity that may not be hers to take.What an absolutely perfect title this was, small fires trailing these characters in their actions, words and the things they keep hidden. The way the story progresses, unravels, is brilliant, completely right. The different lifestyles, but always at heart is the question, \"Nature vs. nurture, does lifestyle matter if the love is strong?\" Unbreakable bonds, forged in many different ways. Sometimes by the time we have full realization of something important, it may be too late.This novel does something important, it makes one think, might make some open their eyes. Would be an excellent choice for a book group of woman. Much to discuss here.ARC from publisher."}, {"userName": "Jen", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "This is one of those reads that starts off as a small flame. Then just as the smoke becomes a raging inferno, the story has gotten under your skin and you've inhaled more than you thought and instead of it going to your lungs, it aims straight for the heart.It's a story of relationships - Mother daughter ones. It starts off with Mia and daughter, Pearl, who move to shaker heights which is an upscale suburban neighbourhood where life is both homogenous and idyllic. Until the adoption of a Chinese baby leaves the community divided. Is it biology that makes a parent? The old argument of nature vs nurture. Or what about decisions that are made in the heat of the moment that become life defining for a child, as regrettable as they may be, should a parent get a 2nd chance? Ng raises some tough moral questions. Ones that had me thinking and arguing in my own head of what is right, wrong and sometimes not negotiable. This one made me just want to hug my daughter a little tighter and have her recognize that my imperfections are to cushion her from the harshness life can sometimes deliver. Ng's writing is captivating. 4.5⭐️"}, {"userName": "Meredith", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/30978160-meredith", "userReview": "Intensely complex, multi layered, and intricately plotted Little Fires Everywhere is a profoundly complicated and jarring read about motherhood, freedom, and the human experience. \nWhen unconventional artist Mia and her fifteen year old daughter, Pearl, move to Shaker Heights, Ohio their lives dramatically change. Of even great significance is their impact on the seemingly perfect Richardson family. On the surface, the Richardson’s seem to have it all--perfect house, perfect jobs, perfect children (minus one), but something is missing. Living in the bubble of the cookie cutter community of Shaker Heights, their world is insular and small. Mia and Pearl’s presence shakes them to the core and opens them up to a world of new possibilities. Told through the eyes of multiple characters, this is a slow burn read with fluid changes of POV. While one of the main events occurs in the first chapter, it isn't until the end that one can fully understand the implications of \"the little fires everywhere.\"Here’s the thing--when I first started reading this, I had a hard time connecting to the characters and the plot. Several times I wanted to give up and start another book, but Ng’s beautiful writing kept pulling me back in. It wasn’t until about half way through, I felt the subtle spark of connection, and as it grew my feelings about this book grew. When I got to the end, I was simply stunned by how this book snuck up on me and overpowered my emotions. To sum up my reading experience: “And it was complicated, what had happened. It was a terribly awkward agonizingly slow, painfully intimate story that unfolded.”"}, {"userName": "Berit☀️✨Traveling Sister✨", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/38946743-berit-traveling-sister", "userReview": "5 complicated stars!🌟🌟🌟🌟🌟I have read SO many wonderful books lately, I keep thinking I can’t rate all these books 5 stars... but then I think how can I not? They all definitely deserve it! SO here I go again with another gushing review!(Currently I’m reading a book I’m not all that crazy about, so I promise a slightly negative review to come😉)What makes you a mother biology or love?This book was about the bonds between mothers and their children; The relationship between mothers and daughters in particular.... I have a daughter and of course I am a daughter, so I do realize how complicated this relationship can be, even in a somewhat stable environment....The mothers in this book were all very different from one another, but the thing they had in common is that they all truly love their children.... even if they didn’t always do a good job of showing it.... I believe all these women were so well developed as characters, and even if you didn’t agree with their actions you could understand their motivation.... this book really touched on quite a few issues, and I don’t want to mention them in this review, because I don’t want to ruin the journey for you, but it sure did make me think.... Think what would I do in that same situation? It’s hard to say, of course I’d like to think I’d always do the right thing, but then that begs the question what is the right thing? Sometimes I’m not sure if it is as clear cut as that.....The only part of this book that I had an opinion on(OK not the only thing I had an opinion on, but the only thing I’m going to share in this review), because it was very personal for me was the court case.... as I have mentioned previously I am the only biological child in a family of adoptive brother’s (I never got a sister!) And all my brothers are of a different race/ethnicity from me.... I don’t believe I could have loved my brothers anymore had they been biologically related to me, and I don’t believe they ever felt robbed of their culture.... so do I think a white family can raise a Chinese girl? Absolutely! But this is because of personal experience, I grew up in a house with cross-cultural adoption and it was a positive experience.... do I think a biological mother should be given a second chance after abandoning her baby? That I’m not sure about....*** steps off soapbox ***Looking back on this book I think I like it even more.... every character in this book was so well developed, by the end you felt as though you knew these people.... I also think the story was so well plotted how everything unfolded was perfect.... and even though the ending was quite heartbreaking, it just made the book that much better...Definitely strongly recommend! And I hope you enjoy the journey!💕 PS: I‘d love for Mia to take a photo that represented me, wonder what would be on it, a book?"}, {"userName": "Julie", "userReviewDate": "Oct 11, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Little Fires Everywhere by Celeste Ng is a 2017 Penguin Press publication. A smart, but often scathing look at entitlement coupled with the endless dynamic layers between mother and child. The Clinton era gets a sharp examination as we drop in on Shaker Heights, an ideal suburban community with plenty of unspoken rules for its financially comfortable residents. The Richardson family is the prototype of the community, with Elena Richardson embracing the lifestyle with unparalleled enthusiasm. ‘Perfection: that was the goal, and perhaps the Shakers had lived it so strongly it had seeped into the soil itself, feeding those who grew up there with a propensity to overachieve and a deep intolerance for flaws.’By contrast, Mrs. Richardson’s new tenants, Mia and her daughter, Pearl, live a free spirited, nomadic life. Mia is a photographer, who works just enough to afford the basics in life. Pearl, though, has no trouble adapting to the stable home life of the Richardson’s, practically becoming a member of the family. Things are working out well enough, until a chain of events unlocks long buried secrets, spawning a bitter custody battle, which exposes cracks in the Richardson’s perfect image, and will culminate in a fiery inferno, both physically and metaphorically. This second novel by Celeste Ng is not quite as grim or heavy as her debut, but it is every bit as provocative. I have had a hard time writing this review because the layers in this story are many, with so many themes to explore. I have worked on it for days, feeling slightly intimidated, unable to find the words that would do justice to such an outstanding novel. |This book adeptly explores hot button issues prevalent twenty years ago, between episodes of Jerry Springer and Clinton’s sex scandals, when a different set of questions were raised, such as interracial adoptions. “It came, over and over, down to this: What made someone a mother? Was it biology alone, or was it love?”I was impressed with the various contrasts presented in the book, which included the mindset of the privileged juxtaposed against those who find themselves at their mercy. Was there an exacting price for that privilege and was it worth it? I must say, the judgmental hypocrisy is astounding!! But, the heartbeat of the story is centered around motherhood. Every mother represented exposed that instant vulnerability motherhood creates. The pain of infertility and the frustrating process of adoption is examined right along with parental sacrifices and foibles and their consequences. Mia and Mrs. Richardson's children also play an integral part in the story, their roles intertwined and connected in the most ironic of ways. ‘Izzy had the heart of a radical, but she had the experience of a fourteen-year-old in the suburban Midwest.’One of the more interesting character studies is of Elena- mostly referred to as Mrs. Richardson, which I thought was a very clever way of hammering home a specific point. Her cluelessness, her arrogance, and relentless reproach is extraordinary in light of what is actually taking place.Mia, in turn, may spark a little resentfulness in Mrs. Richardson, and despite my initial puzzlement about her, and I admit I certainly questioned some of her choices, I ended up respecting her a great deal. So, as you can see, the novel is very driven by the characters, each offering a different perspective or new avenue in which to view the situation. Sometimes I felt deep empathy for one character, feeling the acuteness of their pain, but unable to choose a side. It is often heart wrenching and I found myself feeling torn on many occasions. On other occasions, I had a very hard time mustering up any real empathy for a few of these characters. The plotting was very tightly woven and on several occasions, I may have uttered an expletive out loud when misunderstandings exploded in the worst possible way, creating a mountain of tension in the process. This is a very compelling family drama, drawing out a bit of nostalgia, prompting me to take a closer look in the mirror, to put myself in the place of others before passing judgement. But, I also picked up on a bit of sarcasm here and there, almost as if the author was scoffing at some of the attitudes or the mindset of the era, although it was done so in an understated and sly way. It’s been nearly a week since I finished the book and I still find myself mulling over the many layers and angles, and thinking about the characters and the choices they made and how it all came together in the end. So, it is fair to say, this book has had an impact on me, and think it is a novel anyone who appreciates a well written, thought provoking work of fiction will appreciate. Highly recommend!! 5 stars"}, {"userName": "Elise (TheBookishActress)", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/52545435-elise-thebookishactress", "userReview": "Never in my life have I read any book, any narrative, that cared as deeply for all of its characters as this one did. This book lives in the grey area, leaving it impossible not to be invested, impossible not to love every character and cry for every character. A complete masterpiece, review to come!!✨✨✨✨✨✨audiobook loan ended 😞😞 so I guess we're checking this out from the library? fun"}, {"userName": "Lola  Reviewer", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "I felt so invested in the characters.Not at first. That’s what’s interesting. In the beginning, everyone looked the same to me. Everyone *felt* the same. I had trouble distinguishing characters from one another.But then I started learning about their pasts and began to see people in a different light. Mia Warren, for instance, is extremely secretive. She isolates herself on purpose and moves from place to place on a regular basis. She doesn’t need much. All she really needs is Pearl and her art. I only knew what everyone knew about her – which wasn’t much.So you can imagine my shock when I discovered what Mia Warren was running from. That is not what I expected. But I liked it. Sometimes we meet people who have their guards up and see how unwilling they are to share information about their lives and we think, ‘‘My God, that person is stuck-up.’’And then, suddenly, opportunity arises for us to truly learn something about them and we begin to realize that people are more complicated than that. Although, what I liked most about this book was actually the narration. The characters slowly go from zero to eight/nine as the story progresses, but the narration held my attention for the entire reading time. It was never manipulative. The subject matter is extremely delicate and controversial (whether a child should stay with her biological but poor and single mother or be handed to a rich, loving couple), and yet, I honestly considered both sides. The author never says what is right or wrong – she describes what is happening, but she doesn’t tell us how to feel. The characters do the talking and many points of view are provided so that we are not forced to feel a certain way.Even now, I’m not sure I could answer the question this book raises about the child in a definitive way. But I sure enjoyed the discussions around it. It’s a slow book, that’s true. It took me longer than I’m willing to admit to read it, but it’s a worthwhile ride.Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Carol (Bookaria)", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/1880531-carol-bookaria", "userReview": "This novel is amazing! I regret not reading it sooner.What happens when two characters with very different personalities converge? A captivating story. On one corner we have Elena Richardson, a successful, married reporter with four children who live in a well-to-do neighborhood, she has planned out carefully her life and executed it meticulously. On the other corner we have Mia Warren, an enigmatic, creative, single artist and her daughter Pearl who at the beginning of the story rented an apartment from Mrs. Richardson.Soon these two families start interacting and what follows is a journey you have to take by yourself.The story is told from different points of view and it alternates between the past and present. Celeste Ng (pronounced \"ing\") has brilliantly written this book, everything is excellent from the characters to the writing. I have become a fan.Overall, I loved this book. It is one of the best novels I've read."}, {"userName": "Dana Ilie", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/21690081-dana-ilie", "userReview": "3.7 starsCeleste Ng’s writing style wasn’t super easy to read. I feel the need to stress that Little Fires Everywhere is not a fast-paced, easy to read suburban thriller. It’s a slow-paced novel of fiction that focuses on American suburbia and middle class ethics that often requires more attention when reading to make sure you pick up on every subtle detail. All the time I read this book, I have the sensation that it was a script of an Desperate Housewives. There are not housewife in the book, but the author style, was like that, like a feeling."}, {"userName": "Maureen", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/13427823-maureen", "userReview": "Metaphorically speaking, everyone has 'little fires' in their lives - events that begin as a small spark, and have the ability to transform into a raging inferno, changing lives for ever.Shaker Heights, Cleveland is an idyllic place to live, everything has been planned to create the perfect community, but it's residents are expected to live by its many rules and regulations.The Richardson's are quintessentially the kind of family who the community of Shaker Heights was built for. Elena Richardson was brought up with these rules, and she and her husband are determined that their four children, Lexie, Trip, Moody and Izzy will live by them too. Izzy isn't exactly a chip off the old block though, and will prove to be very disruptive.The Richardson's rent out an apartment to people they feel need a helping hand, and their latest tenants are Mia and her daughter Pearl. Mia is a free spirit, an artist specialising in photography, and when Elena’s troublesome daughter Izzy becomes close to Mia, Elena finds that she's jealous of the relationship, a relationship that doesn't exist between her and Izzy. Further to this, an adoption case in the community puts Elena and Mia on opposing sides, and Elena decides to do some digging on Mia’s past, and uproots some secrets that will change everything. Oh gosh, this book explores so many issues, but for me the one that stood out was motherhood, and in particular, the relationship between mothers and daughters, from baby's early days to teenage angst. It was beautifully written, with characters so well developed I felt as if I knew them personally. I also liked the setting of Shaker Heights, a place so perfect and orderly, and yet, ultimately there is always someone who will rip up those precious rules and regulations and throw them in the garbage. Celeste Ng writes with great insight and empathy, and leaves the reader with much to think about.*Thank you to Netgalley and Little, Brown Book Group for my ARC in exchange for an honest review*"}, {"userName": "j e w e l s [Books Bejeweled]", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/68216634-j-e-w-e-l-s-books-bejeweled", "userReview": "The whole time I was listening to this book, I couldn't shake the feeling of deja vu. It finally dawned on me that Little Fires Everywhere inexplicably reminded me of a childhood favorite book called The Saturdays by Elizabeth Enright. Both books feature families of four rambunctious kids and Celeste Ng writes in a confident, animated manner that is reminiscent of Elizabeth Enright's style. The books each have more of an infectious, rather than addictive quality. It is so fun to be in the middle of these families and root for one character and then feel sympathy for another. Although this is only Ng's second book, she has an established formula that she successfully works again. Instead of starting out with a death as she did in Everything I Never Told You, this time Ng starts out with the mystery of who set the house afire and works back telling the story of tangled adult relationships and secret lives of teenagers. Also, as in her first book, there are hints of simmering racism in the comfortable suburban utopia that is Shaker Heights, Ohio.As I sit here dissecting the various themes of Little Fires Everywhere (and there are many!), the one that stands out the most to me is motherhood. What does it mean to be a mother? How much can we control the direction of our children's lives? What rights, privileges, assumptions do we make about our kids? Finally, do we actually OWN the child that is borne to us? Ng expertly explores all the complicated angles of mother and child relationships. I had been anxiously waiting for this book since the day I finished Ng's first one. I embraced that first book and held onto it, pushing it onto friends, even into hands of complete strangers. It struck me as absolutely insightful and that TWIST ending! Everything I Never Told You is a proud member of my Twister Hall of Fame at http://www.booksbejeweled.comI just don't get that overwhelming feeling of LOVE for this book. Ng is a carefully organized, brilliant writer and sometimes as a reader, I start to feel used, taken advantage of. Every minor character, every little event in the story is absolutely constructed and placed to maximum effect. And that gets a bit tiresome, I feel like Ng is telling me how to feel. However, all small grievances, it keeps me from giving it a five star rating.The audiobook performance by Jennifer Lim is one of the best I have ever listened to- and I listen a lot! I highly recommend the audiobook, I think Ng's writing is well suited to an audio."}, {"userName": "Taryn", "userReviewDate": "Sep 10, 2017", "userURL": "http://www.goodreads.com/user/show/1334938-taryn", "userReview": "3.5 Stars. Celeste Ng certainly knows how to start a story! \"Everyone in Shaker Heights was talking about it that summer: how Isabelle, the last of the Richardson children, had finally gone around the bend and burned the house down.\" The town was already on edge because of a controversial adoption case, but now the Richardsons' family drama has given them something new to talk about. What's going on behind closed doors in this perfect suburban community? How did they get to this point?\nBut the problem with rules, he reflected, was that they implied a right way and a wrong way to do things. When, in fact, most of the time there were simply ways, none of them quite wrong or quite right, and nothing to tell you for sure which side of the line you stood on.\nThe story is set in the 1990s in Shaker Heights, a planned suburban community near Cleveland, Ohio. To give an idea of the community's atmosphere, I had the Weeds theme song stuck in my head as I was reading! Rules dictate everything in the tight-knit community. There's one way to do things and little patience for those who take a different path. Many of the residents tend to judge people within the bubble of their own experiences, such as when they unfairly judge the competence of a waitress by their 9-to-5 standards. Their \"color-blindness\" allows them to be oblivious to things in plain sight, such as their own biases or the subtly different treatment of those who are different. At one point, white Lexie's black boyfriend has to explain to her how differently they will be judged individually for the same mistake. Some members of the community have a difficult time understanding that not everyone lives like they do or that there's value in different ways of life. There's also a recurrent attitude of entitlement: the feeling that those with more financial stability are more entitled to a child or Elena Richardson's entitlement to peoples' secrets and other compensation in exchange for her \"charity.\" The progressive community members mean well, but they recoil when the work of righting injustice gets too messy or rowdy. Elena Richardson is terrified that everything will spin out of control if things aren't done within the established order: \"Rules existed for a reason: if you followed them, you would succeed; if you didn’t, you might burn the world to the ground.\" Elena fears an inferno, but maybe a clean slate is what her family and community need.\nPassion, like fire, was a dangerous thing. It so easily went out of control. It scaled walls and jumped over trenches. Sparks leapt like fleas and spread as rapidly; a breeze could carry embers for miles. Better to control that spark and pass it carefully from one generation to the next, like an Olympic torch. Or, perhaps, to tend it carefully like an eternal flame: a reminder of light and goodness that would never—could never—set anything ablaze. Carefully controlled. Domesticated. Happy in captivity. The key, she thought, was to avoid conflagration.\nNg's writing captivates me so much because of her astute observations of human behavior. She has a way of capturing complex feelings and those seemingly innocent little gestures and facial expressions that are actually incredibly revealing. The omniscient narrator slips into the minds of all the characters, so we get to know all of her characters intimately. We meet the Richardson family first. Elena Richardson writes for the local newspaper. Journalism is a perfect outlet for her because she can \"do good within the system.\" The dad, a lawyer, exists in the background, but he remembers a time when Elena was passionate about changing things for the better. It's why he fell in love with her. Comfortable suburban life has quelled Elena's flame and made them complacent. My favorite part was the dynamics between the Richardson teens! Each teen has a distinct personality: warm Lexie (18), charming Trip (17), sensitive Moody (15), and self-righteous Izzy (14). I loved the scenes where we got to see each of their specific responses to an event. There were parts that I could relate to as one of four siblings, especially since the younger three are a year apart. The scene of the Richardsons watching their house burn down as they sat in birth order actually made me smile, because we still sit in that exact same configuration after three decades!\nEverything, she noticed, seemed capable of transmogrification. Anything had the potential to transform, and this, to her, seemed the true meaning of art.\nWhen Mia and Pearl (15) move into the Richardson's rental property, everything begins to change. Elena is intrigued by Mia, but uneasy with her disregard for the established order. Mia's rebelliousness awakens something uncomfortable inside of Elena that she would rather keep locked up. The Warrens have lived a completely different life than the Richardsons. While the Richardsons have a stable life in Shaker Heights, the Warrens have moved 46 times in Pearl's lifetime. It's always just been her and her mother traveling around the country in a VW Rabbit. As Pearl gets to know the Richardson teens, she wonders where all of their confidence comes from. She can't imagine what it's like to feel grounded, \"to have such a deep taproot in a single place, to be immersed in it so thoroughly that it had steeped into every fiber of your being.\" As Pearl becomes infatuated with the Richardson family, the Richardson kids grow increasingly fascinated by Mia. Rebellious Izzy becomes especially obsessed with her. Mia is the first person that makes her realize she has the power to change things.\nEverything had nuance; everything had an unrevealed side or unexplored depths. Everything was worth looking at more closely.\nFeelings and opinions can become so internalized that we forget what sparked them in the first place. People that remind us of things we are trying to forget or don't want to see can trigger an automatic revulsion. Some characters have experiences that make them empathetic (Lexie). Other characters' beliefs become more rigid because of past pain; their emotional closeness to a situation clouds their perspective (Moody, Elena). I loved the explanation for Elena's confrontational relationship with Izzy, how her \"resentment began to sheathe concern\" and \"anger is fear’s bodyguard.\" Feelings can become so permanently ingrained that it can be hard to step back and see things clearly. Sometimes a significant emotional experience is the only thing that can snap us out of our complacency.\n“Most of the time, everyone deserves more than one chance. We all do things we regret, now and then. You just have to carry them with you.”\nThe story gets off to a slow start because of the character introductions and the focus on the teenagers, but I was still completely engrossed in their lives. It really took off for me when the adoption plot starts about one-third of the way through, especially in relation to Mia's backstory. There are so many interesting questions raised: Is it biology or love that makes a parent? How important is the role of cultural heritage in upbringing? But by the end, I felt like the author played favorites with the characters. For all the focus on complexity and gray areas, sometimes it felt too simplistic. Elena got more one-dimensional as the story went on. The adoptive parents were treated with such tenderness at first, but by the time the trial rolled around I kept having to remind myself that hadn't literally snatched the child out of the biological mother's arms. I love the feeling of having my sympathies pulled in a million directions, but here I felt reflexive resistance as my sympathies were yanked to one side. The scales tipped towards Mia a little too much and my contrarian side started rearing its ugly head. Mia is often described as enlightened and empathetic, but she's just as flawed as anyone else. Mia's selfishness and hypocrisy are not as emphasized as Elena's flaws and she got off extremely easy compared to other characters. It's not that I don't understand her actions, but there were issues regarding parental rights and the importance of family bonds that I wanted to see Mia wrestle with more directly. \n\nSometimes you need to scorch everything to the ground, and start over. After the burning the soil is richer, and new things can grow. People are like that, too. They start over. They find a way.\n\nThe arrival of Mia and Pearl Warren is the spark that sets of series of little conflicts that culminates in the Richardson's house being set ablaze, but there was already plenty of fuel to feed the flames. Despite the best-laid plans, things don't always go the way we expect. Mrs. Richardson thinks she prepared her kids for life so well that they will never get into tough situations and they will always make the \"right\" decisions, but life is more complicated than that. Sometimes people don't realize how affecting the consequences of their actions will be, because of lack of experience or circumstances beyond their control. Situations are never as clear-cut as they look from the outside. There are so many instances in this book when people make snap judgments based on an incomplete picture. Uncharitable, simplistic assumptions are made when there are actually complex, relatable explanations. As I read, I was reminded of a Stephen M.R. Covey quote: \"We judge ourselves by our intentions and everyone else by their actions.\" I didn't fall in love with Little Fires Everywhere as much as Everything I Never Told You, but it's still a captivating and thought-provoking sophomore novel. I just didn't get everything I wanted from the wrap-up, perhaps because I was most interested in the adoption storyline.If you liked this book, you might enjoy The Leavers by Lisa Ko. It also deals with the complexities of interracial adoption. It was a full four-star book for me, though I must say that I preferred Mia's photography career over Deming/Daniel's struggling music career!____________I received this book for free from Edelweiss and Penguin Press. This does not affect my opinion of the book or the content of my review. It's available now!"}, {"userName": "Carol", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "3.5 Stars....my true rating. I've been putting off writing my review....and rethinking my rating on LITTLE FIRES EVERYWHERE bc it just didn't blow me away like it did so many others, and I really wanted time to think about it....What am I missing? It's just kind of a soap opera really and nothing we haven't heard before. One family with teens who make mistakes (one big one) and a busy-body mother who thinks she's better than everybody. Another mother who makes a big mistake bc of hopelessness...(yes, very sad). Two well-to-do couples who long to have a child....and another mother who continually drags her daughter around the country running from her past. Ok, I admit Mia and Pearl's story was a good one....the best of the novel actually....but overall the whole shebang was just a bit better than average for me....and honestly....forgettable.....In THE FIRST HALF, we meet some of the characters....the Richardson family, their four children, a few of their teen friends plus Mia and daughter Pearl who have just moved to town.....AND, I do know I'm in a MAJOR minority here, but Whew! I was pretty much bored throughout a good portion up to this point. I felt like I kept reading and reading without making any progress in the lives of the young adults, but as I said, that was just in THE FIRST HALF.....In THE SECOND HALF, the plot thickens and I did become more engaged. We meet a few more characters and discover secrets....learn more about Mia's past, her family, her education, her love of photography as well as her deep love and devotion for her brother Warren and daughter Pearl. We also meet the McCullough's and Ryan's who long to start a family, and a struggling immigrant mother who makes a heartbreaking decision.No doubt here, Celeste Ng is a gifted writer. Her debut offering EVERYTHING I NEVER TOLD YOU is still my favorite of her novels. LITTLE FIRES EVERYWHERE pretty much fit into the average plus category for me. I know, I know....it won the 2017 Goodread's Best Fiction Award. (inching out my personal favorite BEARTOWN) but nonetheless, my congratulations to a talented author....really! Ok, Whew! I got that off my chest!"}, {"userName": "Cheri", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "4.5 StarsShaker Heights, is a town – or rather, a community where everything was planned. The city motto: \n”Most communities just happen; the best are planned.”\nLike most planned communities, there are rules and regulations. Homes and lawns must be maintained to the standards set, garbage is collected from behind the homes, so not as to spoil the illusion of the perfect life. Paint colour on houses must be approved, and within the parameters of choices for the style of the home. \n”Everyone in Shaker Heights was talking about it that summer…”\nThe Richardson family, an important, prominent family in Shaker Heights, have four teenage children who arrived in the world one year apart; Isabelle, or Izzy, the youngest, a freshman in high school, is the one the rest of the family always seems to be shaking their heads about; Moody, a sophomore, is quiet, bright and very introspective; Trip, a junior is a girl magnet who plays sports, and is good at it; and Lexie, a senior, who is well-liked at school, and has plans for her future. The Richardson family also owns another home that they rent out, the top floor separately from the lower floor. Mrs. Richardson, has an image she likes to maintain, and part of that is helping people who she feels are deserving. So when Mrs. Richardson, Elena, meets Mia Warren and Mia’s daughter Pearl, a very shy fifteen year-old girl, she feels they will be the perfect choice for her new tenants, clearly they could use a healthy wave of her help. Mia doesn’t feel she needs her help, or really, anyone else’s for that matter, clearly Mrs. Richardson and Mia Warren are two very different women with two very different sets of priorities. Mrs. Richardson had planned her future out when she was her children’s age, or perhaps even younger. She’s succeeded in most of the ways that are apparent to an outsider looking in – providing they don’t look too closely. Her husband is an attorney, and they live in her designated neighborhood, in an appropriate house and drive nice cars, but tastefully nice. Mia, on the other hand, has wanted to be an artist her whole life, but life had more or less just happened to her and she went along for the ride. Not that it was entirely without planning, but sometimes plans need adjusting somewhere along the way, and the choices you make need to change, as well. Her life has been lived flying by the seat of her pants, navigating with the wind.It doesn’t take long for young Moody is riding his bike over to make Pearl’s acquaintance, and they strike up a friendship at once. Despite their home and income differences, or maybe because of them, Moody is drawn to their home over and over again. It isn’t long before he brings Pearl to his home to meet everyone in his family. \n”At that moment Moody had a sudden clear understanding of what had already happened that morning: his life had been divided into a before and an after, and he would always be comparing the two.”\n Another storyline weaves throughout their stories, a young Chinese woman who, unable to care for herself, let alone her infant, leaves her baby at a firehouse. A husband and wife, who have been praying for a baby to adopt, are asked if they are interested in adopting her. ”It came, over and over, down to this: What made someone a mother? Was it biology alone, or was it love?”It didn’t take very long for me to become fully engaged in this story, in the lives of these people, to become so familiar with who they were, to see each of their flaws as Celeste Ng slowly revealed more and more about these perfectly imperfect characters. The more I learned about them, the more immersed I became in this story, and I would have read it straight through if it hadn’t been for an appointment that interrupted the rest of my day. This was my first book by Celeste Ng, and although her ‘Everything I Never Told You’ has been on my TBR for too long, and reading this has made me even more eager to read it soon. I loved Ng’s storytelling, her gift of drawing me into these lives slowly, but always adding just enough to pull me in just a little more and then suddenly I realized I couldn’t imagine not having had this experience.Many thanks, once again, to the Public Library system for the loan of this book!"}, {"userName": "Holly  B", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/39749481-holly-b", "userReview": "A character driven family drama that is set in Shaker Heights, Cleveland. Shaker Heights is a planned community and to all appearances the Richardson family has the perfect life! This quiet suburb is about to unravel and the hidden motivations, lies, and secrets will be both shocking and revealing! I enjoyed the story and there were a few jaw-dropping moments! Mrs. Richardson takes in a tenant (Mia) with a teenage daughter (Pearl) who are from a different walk of life and have a mysterious past. Pearl becomes close to the Richardson’s teenage children and Mrs. Richardson’s daughter (Izzy) will become close and almost obsessed with Mia. These relationships will prove to be upsetting and devastating in many ways. Mia and Pearl ultimately set in motion a stage for some shocking and unforeseen results!Will Mrs. Richardson regret her choice of tenants or her judgement of them? Why are Mia and Pearl always moving from town to town? Do they have something to hide? Why is Izzy so drawn to Mia and why is there so much hostility between her and her own mother?I was intrigued by the characters and how their paths ultimately connected in the end. Fire destroys everything in its path and no one can control which way the flames go. An intoxicating and tragic read that left me with more questions than answers!To see the full Traveling Sisters review ...visit here.. twogirlslostinacouleereading.wordpress.comThank you to Edelweiss, Celeste Ng, and Peguin PressPublished on September 12, 2017"}, {"userName": "Nat", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/23381142-nat", "userReview": "Everyone in Shaker Heights was talking about it that summer: how Isabelle, the last of the Richardson children, had finally gone around the bend and burned the house down.WHY DID I WAIT SO LONG TO READ THIS BOOK???Fun story: I finally caved into the hype for Little Fires Everywhere when my fries nearly burned down the oven this past Tuesday. I was, needless to say, scared shitless when I saw smoke covering the kitchen...“Most of the smoke had gone, but a mugginess still hung everywhere, like the air in the bathroom after a long, hot shower.”But, the day after, when I randomly decided to read the first chapter of this book, which has its premise set around a fire, I was swept into the world of these lively characters in Shaker Heights. (I'm still mad at myself for having to go through the above, in order for me to get fully into the storyline.)Little Fires Everywhere explores the weight of secrets, the nature of art and identity, and the ferocious pull of motherhood – and the danger of believing that following the rules can avert disaster.Celeste Ng breathes such livelihood into each and every one of her characters that I can clearly imagine them in my head, so much so that I have to remind myself that they only exist in this fictional piece of work. And it works so well because the author pays close attention to the tiniest of details that I wouldn't have thought to notice at first, but then it's those features that make the story feel that more tangible.Take for example this introducing passage to the last (and the wildest) of the Richardson children:“Izzy, at ten, had been apprehended sneaking into the Humane Society in an attempt to free all the stray cats. “They’re like prisoners on death row,” she’d said. At eleven, her mother—convinced that Izzy was overly clumsy—had enrolled her in dance classes to improve her coordination. Her father insisted she try it for one term before she could quit. Every class, Izzy sat down on the floor and refused to move. For the recital—with the aid of a mirror and a Sharpie—Izzy had written NOT YOUR PUPPET across her forehead and cheeks just before taking the stage, where she stood stock-still while the others, disconcerted, danced around her.”I... love her.\nI haven't fallen under the spell of a family so entirely since I read Young Jane Young by Gabrielle Zevin. Speaking of, if you liked the characterization in YJY, you'll most likely enjoy this worthwhile read just as much. Also, A Little Life by Hanya Yanagihara is a prime example of exploring the dynamics of main and side characters and the threads connecting them all, just as this novel does so brilliantly.Celeste Ng breathes so much humanity into her characters that the everyday becomes compelling. And with each coming chapter, I became that more bewitched with these strangely compelling families.“The truth was that she wanted to study the Richardsons both when they were there and when they weren’t. Every day, it seemed, Pearl absorbed something new from the Richardson family: a turn of phrase (“I was literally dying”), a gesture (a flick of the hair, an eye roll). She was a teen, Mia told herself over and over; she was trying on new skins, like all teenagers did, but privately she stayed wary of the changes she saw.”I love how the author can capture such specific and private moments with a particular turn of phrase. These careful observations of her characters are enthralling.There's so much I want to discuss, everything from the enigmatic Mia Warren, “who seemed to make her own rules with no apologies”, to the complex and deeply intricate adoption case surrounding Mirabelle McCullough (“or, depending which side you were on, May Ling Chow”). I'll just say on the latter that the heated debate that lasted for months in their community, continued on in my head (and out loud to anyone who was willing to listen) without pause.“It came, over and over, down to this: What made someone a mother? Was it biology alone, or was it love?”The case really got my blood boiling and my head spinning, and I was so invested in the outcome of the court, that their final decision would have quite the impact on whether this introspective book was a 5 star read* or lower for me. And I see that as an immense success in my eyes because it's rare that I get this overly invested and absorbed in a storyline. The author knows how to spin a web, and I would encourage you to experience it firsthand from the book.“Something about the case had lit a spark in her, though she could not yet put her finger on it, and would not be able to articulate it for a long while.”\nI still can't fully wrap my head around all the intricate details Celeste Ng planted along the way. I truly applaud her for creating such distinct voices in each character. She played to her strength by giving the time and place to expand a character's arc to fit into the overarching theme. And thanks to their extensive background presented without any bias, even those I came to disagree with, I still understood their point of view, their raison d'être, and their vehement fight to get people on their side.“Here, she found, everything had nuance; everything had an unrevealed side or unexplored depths. Everything was worth looking at more closely.”This novel is a prime example of succeeding at creating plot and tone through its multifaceted characterization. Which is why I’m also impressed that even though the main storyline didn’t appear until halfway through the book, the author kept up our interest with expertise on all accounts. It was a pure pleasure, watching her click everything into place.All I wanted was to devour this oddly endearing book in all its glory, and in the same beat cherish it so it would last me forever.Plus, I can't stop thinking about how consumingly evocative and vivid the writing style is. The specificity behind each sentence was very well woven together both by the storyline and the character development. It was bold, it had a purpose, and it didn't feel aimless. Like this passage that paints a clear of picture how close the siblings are:“You’d think she was the mother,” their mother had said once, half in tones of complaint, half in admiration.They had their own words for things, a jargon of obscure origin: for reasons even they had forgotten, they referred to butter as cheese; they called the grackles that perched in the treetops icklebirds. It was a circle they drew around the two of them like a canopy. “Don’t tell anyone from France,” Mia would begin, before whispering a secret, and Warren’s reply was always, “Wild giraffes couldn’t drag it out of me.”I wish I could explain in words how much I love Celeste Ng's skill for capturing something so specific and addictively relatable.\nAnd another utterly enchanted passage on mother/daughter bonds that's worth the lenghty read:“It had been a long time since her daughter had let her be so close. Parents, she thought, learned to survive touching their children less and less. As a baby Pearl had clung to her; she’d worn Pearl in a sling because whenever she’d set her down, Pearl would cry. There’d scarcely been a moment in the day when they had not been pressed together. As she got older, Pearl would still cling to her mother’s leg, then her waist, then her hand, as if there were something in her mother she needed to absorb through the skin. Even when she had her own bed, she would often crawl into Mia’s in the middle of the night and burrow under the old patchwork quilt, and in the morning they would wake up tangled, Mia’s arm pinned beneath Pearl’s head, or Pearl’s legs thrown across Mia’s belly. Now, as a teenager, Pearl’s caresses had become rare—a peck on the cheek, a one-armed, half-hearted hug—and all the more precious because of that. It was the way of things, Mia thought to herself, but how hard it was. The occasional embrace, a head leaned for just a moment on your shoulder, when what you really wanted more than anything was to press them to you and hold them so tight you fused together and could never be taken apart. It was like training yourself to live on the smell of an apple alone, when what you really wanted was to devour it, to sink your teeth into it and consume it, seeds, core, and all.”I feel the truth of these words echoing inside me. And it goes to show how parts of Little Fires Everywhere made me emotional to the point of crying and they weren't even sad, just so absolutely stunning.It's been so long since a book evoked such a wide range of reactions out of me. But this multigenerational tale of family bonds, youthful romance, generational conflicts and hidden secrets had me compulsively turning page after page. I haven't felt this strongly about a book in nearly half a year (back when I read The Beauty Queen of Jerusalem by Sarit Yishai-Levi). This thought-provoking read in all its messy complexity will stay with me for a long time to come. And in the meantime, I'll be devouring all the other books the author has released so far.*Oh, who am I kidding? This book deserves all the stars in the sky.\nNote: I'm an Amazon Affiliate. If you're interested in buying\n Little Fires Everywhere, just click on the image below to go through my link. I'll make a small commission!\nThis review and more can be found on my blog."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "This book was one of the most powerful, intense and beautifully written novels that I have ever read - with the absolute best character development!This was a Traveling Sisters group read that we all absolutely gushed over and didn't want it to end! Thank you so much to Edelweiss, Celeste Ng, and Penguin Press for the opportunity to read an advanced copy of this book in exchange for a review.Review written and posted on our themed book blog Two Sisters Lost In A Coulee Reading.https://twosisterslostinacoulee.comCoulee: a term applied rather loosely to different landforms, all of which refer to a kind of valley."}, {"userName": "Kendall ", "userReviewDate": "Sep 12, 2017", "userURL": "http://www.goodreads.com/user/show/42327848-kendall", "userReview": "Celeste Ng delivers a beautifully and insightful story about two families that seem like they come from worlds apart but are hauntingly connected in ways that they can never have imagined.\"Sometimes you need to scorch everything to the ground, and start over. After the burning the soil is richer, and new things can grow. People are like that, too. They start over. They find a way.\"Shaker Heights is a town that is \"safe\" and plays by the rules. From, the color/look of perfect little houses to our successful/money making residents. Mr. and Mrs. Richardson are a couple who STRIVE to live by the rules along with their four children (Izzy, Lexie, Moody, and Trip). But, here comes Mia Warren along with her teenage daughter Pearl in this privileged neighborhood. Mrs. Richardson starts to see that Mia has a dark and mysterious past that is affecting her family. Mrs. Richardson starts to see her children being drawn to Mia and her daughter Pearl.... where things are not living by Shaker Heights's rules.Chaos erupts in this privileged and controlled neighborhood when friends of the Richardson's attempt to adopt a Chinese-American baby......things start to unravel like a spider web between Mia and Mrs. Richardson. Celeste ever so beautifully pours her words onto the pages that leaves you connecting and feeling with these characters like you will not imagine. The amount of depth and insight this author has in her characterization is amazing. Her writing is insightful, inspiring, and just down right beautiful. Have I said beautiful yet?! Celeste does an amazing job connecting and interweaving all of the characters as one. The only issues that I had with this novel are on the aspects/backgrounds of the adoption/foster care system. I am a social worker and I work with biological families and adoptive/perspective parents and the situations are definitely not how they are presented in this book. An adoption process can take YEARS!!! This made me a little frustrated and felt like the author had some biases towards siding with the biological mother more then the adoptive parents. And, not to mention the issue of culture here.... A privileged caucasian couple can't raise a baby because they're not Chinese?! I do have to say... that this almost ruined the novel for me. I think doing more research on such a sensitive topic like this is crucial. Also, I think a lot of it is ignorance on society's part because a lot of people really don't understand that stereotypes/biases can feed into their viewpoints. Overall, 3.5 stars another fun and exciting traveling sister read!! I will leave you with one of my favorite quotes from this novel \"What made someone a mother? Was it biology alone, or was it love?\"Thank you to Edelweiss for an advanced arc. Publication date is 9/12/17. For our full Traveling Sister review please visit Norma and Brenda's wonderful blog! :)https://twogirlslostinacouleereading...."}], "description": "Everyone in Shaker Heights was talking about it that summer: how Isabelle, the last of the Richardson children, had finally gone around the bend and burned the house down. \nIn Shaker Heights, a placid, progressive suburb of Cleveland, everything is meticulously planned – from the layout of the winding roads, to the colours of the houses, to the successful lives its residents will go on to lead. And no one embodies this spirit more than Elena Richardson, whose guiding principle is playing by the rules.Enter Mia Warren – an enigmatic artist and single mother – who arrives in this idyllic bubble with her teenage daughter Pearl, and rents a house from the Richardsons. Soon Mia and Pearl become more than just tenants: all four Richardson children are drawn to the alluring mother-daughter pair. But Mia carries with her a mysterious past, and a disregard for the rules that threatens to upend this carefully ordered community.When the Richardsons' friends attempt to adopt a Chinese-American baby, a custody battle erupts that dramatically divides the town and puts Mia and Mrs. Richardson on opposing sides. Suspicious of Mia and her motives, Mrs. Richardson becomes determined to uncover the secrets in Mia's past. But her obsession will come at unexpected and devastating costs to her own family – and Mia's. Little Fires Everywhere explores the weight of long-held secrets and the ferocious pull of motherhood-and the danger of believing that planning and following the rules can avert disaster, or heartbreak.", "title": "Little Fires Everywhere", "url": "http://www.goodreads.com/book/show/34273236-little-fires-everywhere", "average": 4.16, "cover": "https://images.gr-assets.com/books/1522684533l/34273236.jpg", "reviews": 16267, "authors": [{"url": "https://www.goodreads.com/author/show/164692.Celeste_Ng", "name": "Celeste Ng"}], "type": ["Fiction", "Contemporary", "Adult", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/34273236-little-fires-everywhere", "http://www.goodreads.com/book/show/34331079-little-fires-everywhere", "http://www.goodreads.com/book/show/36232831-little-fires-everywhere", "http://www.goodreads.com/book/show/36112638-little-fires-everywhere", "http://www.goodreads.com/book/show/18693763-everything-i-never-told-you", "http://www.goodreads.com/book/show/39987393-a-book-on-the-table", "http://www.goodreads.com/book/show/40010422-girls-at-play", "http://www.goodreads.com/book/show/39546639-clearing-the-bones", "http://www.goodreads.com/book/show/40038849-every-little-thing"]}