{"ratings": 29, "userreviews": [{"userName": "Bookdragon Sean ", "userReviewDate": "Sep 05, 2017", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "If anybody’s been following me for a while, they’ll know I have been trudging through this box set for over two years. The rate in which I’ve been reading them has decreased considerably as time went on. I used to review one a week, but it eventually got the point that is was a struggle to do one a month. And now I admit it, I’ve finally thrown in the towel. I managed to read 71/80 of these little books, though I’ve come to the point where the remaining nine just make me feel sad. I don’t want to read them! They are all the ones that I’ve been avoiding and life’s too short to read books that I don’t want to. I’m going to end up giving the majority of them bad reviews anyway. So I’ve decided to leave them, and put the remainder back on my shelf never to be read. That being said though, there have been some great things in this series. I completed my goal of increasing my literary awareness and finding a few authors I may never have encountered. All in all, there have been many ups and downs. So this review is a summary of my experience, highlighting the three I enjoyed the most. \n1. The Night is Darkening Around Me by Emily Bronte\n- Penguin Little Black Classic- 63“The night is darkening round me, The wild winds coldly blow; But a tyrant spell has bound me, And I cannot, cannot go.”Trapped, that’s what the speaker is: she is completely trapped. But what’s retraining her? Is it some deep corner of her conscience or is it some powerful external force? These lingering questions are reinforced in an obscure way through the poem. Firstly, she is held in place by a binding darkness; secondly, she is weighed down by the surrounding forest, and thirdly she is stuck between the sky and the earth. Something is holding her back. But, what is it? Is it her will or something more ominous? “The giant trees are bending Their bare boughs weighed with snow; The storm is fast descending, And yet I cannot go.\" As the poem progresses this develops further. Certainly, she speaks of physical restraints; however the poem evokes the distinct feeling that she doesn’t want to go. It’s not a simple case of not being able to go, but a more subtle suggestion that she doesn’t want to go. She is possibly stuck, with a complete lack of freedom, but she doesn’t entirely care as well. It’s almost like she has accepted this situation. It can even be read from the point of view that she is not in these places at all; she is somewhere else entirely: she is where she wants to be, and these monumental forces of nature cannot move her from her sanctuary. Whether this is a sanctuary of the mind, spirit or physical realms one can only speculate. Whichever way this poem is read, one thing remains certain, she doesn’t want to go nor can she go.“Clouds beyond clouds above me, Wastes beyond wastes below; But nothing drear can move me; I will not, cannot go.\" This poem is very open ended; I always love this in a poem. This was my favourite in the edition, but that’s not to say that there aren’t any other good ones in here. There are a lot of fantastic verses. ‘Death’ was also quite good. I do love the Bronte sisters. I need to read more of their works. This was a great collection of poetry, one that I’m likely to revisit. 2. A Cup of Sake Beneath the Cherry Trees by Kenko - Penguin Little Black Classic- 11\n What strange folly, to beguile the tedious hours like this all day before my ink stone, jotting down at random the idle thoughts that cross my mind\n Well, the first sentence certainly caught my attention because that’s exactly what I do with my book reviews. I sit in front of my notebook, with my pen in hand, and write the first thought that comes into my head in regards to the book. Admittedly, the train of thought is less random, but I still write down what comes to my mind. Later on, I organise it and turn it into a coherent book review. I only wish that Kenko had done something similar because this is a very random collection of thoughts. There is no perceivable ordering or any organisation. I struggled with this initially because I like things to be categorised and structured. I don’t like mess and books that are all over the place. Indeed, this edition could be read back to front or odd pages first and even numbered pages after. It could even be picked up in the middle. It is, quite literally, the idle and most random thoughts of the author. He ponders all manner of things in here. However, once I got over the lack of coherence in the writings, I did find some wisdom and perhaps even a kindred spirit.  \"It is a most wonderful comfort to sit alone beneath a lamp, book spread before you, and commune with someone from the past who you have never met\". I found myself agreeing with many of the author’s opinions. He is easy to sympathise with and relate to. He was clearly man who appreciated his books, and understood the comfort and joy that can be found within the pages of a worthy tome. He’s observations on how one should live their life are also quite accurate, at least in my opinion. He suggests that wealth should not be the measure of one’s life because it disturbs peace and tranquillity; it only leads to a corrupt mind, and cause other’s to lust over your treasure. I think in principle its sound advice, but not always in practice. Wealth can be accumulated and used benevolently, though that is quite rare. I just think at times, his thoughts sounded similar to my own. \"What happiness it is to sit in conversation with someone of like mind, warmed by candid discussion of the amusing and fleeting ways of the world……but such a friend is hard to find, and instead you do your best to fit in with whatever the other is saying, feeling deeply alone.\" I feel like the author has made many true observations that will ring true in the heart of any bookworm. He understands because, by the sounds of things, he was one once too. I’m very glad I read this, and I do recommend it to those that wish to, as Kenko put it, commune with someone from the past.\n3. The Yellow Wallpaper by Gilman\n-Penguin Little Black Classic- 42Here follows the diary of a moronic Victorian husband. >Three days before treatment: I’ve got a great idea. My wife is suffering from low mood. So I, being an extremely practical Victorian man, have decided that the best solution for the problem is to restrain her in the house. This is  clearly  a brilliant idea. Our marriage simply doesn’t restrain her faculties enough.It makes sense you see. I got the idea from the prestigious Dr. Silas Mitchell. He describing what he calls his \"rest cure\" for hysterical women, wrote, \"I do not permit the patient to sit up or to sew or write or read. The only action allowed is that needed to clean the teeth.\" At the end of six weeks to two months of such treatment, he says the women would be good as new. So I’m going to try this on my wife. Can you not see the sheer intellect behind the idea? This will solve everything just you wait and see. >1 day into treatment:I’ve restricted my wife’s freedom incredibly. I direct her every action for her own safety. She eats what I tell her, when I tell her. And she has to stay in our bedroom all day. This will soon be over; she only has a temporary nervous depression. She babbles on to me about her problems at night. I don’t have time for them. I’m a man you see. So that means respectability and shutting down any sign of emotion. I told her to go to sleep, this will soon be over. >7 days into treatment:I caught my wife writing in a journal. What an impetuous woman she is! Does she not understand that these restrictions are for her own safety? I do this because I must have a trophy wife. In public we must be seen as a successful couple with an air of respectability. She can’t be jotting down such nonsense and expressing her thoughts. I told her to stop. She doesn’t need the distraction. She needs to be well again, for my sake. >14 days into treatment:My wife has taken a turn for the worse. She barely eats and she just sleeps all day. She says she needs a vocation; she needs something to do to pass the time, and test her intellects. What silly notions. What she  clearly needs is more restriction. That’s the only way she will get over her aliment. She keeps talking about the wallpaper, says she wants the room decorated because it feel like a prison. She says it reminds her of bars. I cannot be doing with it, I told her to go to sleep. I’ve got man things to do in the morning. >30 days into treatment:My wife has gone mad. I think she will have to be locked away. I entered the room and what I beheld was sheer depravity. Such animalistic behaviour, I passed out. I could not bear the sight. The treatment did not work. I should have restricted her more. She had far too much excitement, locked in the house all day with that extremely entertaining wallpaper. I should have left her in darkness. That would have worked. Note to self- Tell Dr. Silas Mitchell of this discovery. **************************************************************The truly scary thing about this story is how real it is. This is the rest cure Victorian women were subjected to, and the journal I wrote here is the ridiculous rationale that drove it. The author of this story was actually administered this “cure.” Her own experienced informed her narrator’s perspective. It’s terrible that something like this had to be written to show how stupid these ideas were. This is a very powerful story, and this was a very stupid husband.-I’m glad I read through most of them, it’s been fun at times but so many of them weren’t to my taste. It was good to discover what I like though."}, {"userName": "Milen Kindekov", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/26068868-milen-kindekov", "userReview": "#01 - Giovanni Boccaccio - Mrs Rosie and the Priest - ***** - (29 July, 2017) Review Here#02 - Gerard Manley Hopkins - As kingfishers catch fire- *** - (05 Aug, 2017) Review Here#03 - Anonymous - The Saga of Gunnlaug Serpent-tongue- **** - (30 Aug, 2017) Review Here#04 - Thomas de Quincey - On Murder Considered as One of the Fine Arts- **** - (25 Sep, 2017) Review Here#05 - Friedrich Nietzsche - Aphorisms on Love and Hate - *** - (30 Dec, 2017) Review Here#06 - John Ruskin - Traffic - *** - (21 Jan, 2018) Review Here#07 - Pu Songling - Wailing Ghosts - ** - (28 Jan, 2018) Review Here#08 - Jonathan Swift - A Modest Proposal - ** - (15 Feb, 2018) Review Here#09 - Wang Wei, Li Bai, Du Fu - Three Tang Dynasty Poets - * - (02 Feb, 2018) Review Here#10 - Walt Whitman - On the Beach at Night Alone - ***** - (01 Feb, 2018) Review Here"}, {"userName": "MissNYix", "userReviewDate": "Jan 25, 2016", "userURL": "http://www.goodreads.com/user/show/51926621-missnyix", "userReview": "1. Hans Christian Andersen - The Tinder Box (24th Dec 2015 - 26th Dec 2015) #23 2. The Yellow Wall-Paper (13 Feb 2016 - 14 Feb 2016) #42 3. Mrs Rosie and the Priest (24 May 2016 - 24 May 2016) #1 4. How to Use Your Enemies by Baltasar Gracian (25 May - 25 July 2016) #12 5. As kingfishers catch fire by Gerard Manley Hopkins (25 July 2016 - ) #2"}, {"userName": "MissNYix", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/51854131-missnyix", "userReview": "1. Hans Christian Andersen - The Tinder Box (24th Dec 2015 - 26th Dec 2015)"}], "description": "The irresistibly collectible box set of all 80 Little Black Classics  In celebration of Penguin's 80th birthday, this box set of the 80 books in the Little Black Classics series showcases the many wonderful and varied writers in Penguin Black Classics. From India to Greece, Denmark to Iran, and not forgetting Britain, this assortment of books will transport readers back in time to the furthest corners of the globe. With a choice of fiction, poetry, essays and maxims, by the likes of Chekhov, Balzac, Ovid, Austen, Sappho and Dante, it won't be difficult to find a book to suit your mood. Little Black Classics celebrate the huge range and diversity of the Penguin Classics list - from drama to poetry, from fiction to history, with books taken from around the world and across numerous centuries.The Little Black Classics Box Set includes: Gooseberries (Anton Chekhov), The Terrors of the Night (Thomas Nashe), The Atheist's Mass (Honoré de Balzac), A Simple Heart (Gustave Flaubert), The Nose (Nikolay Gogol), The Figure in the Carpet (Henry James), The Dolphins, the Whales and the Gudgeon (Aesop), The Maldive Shark (Herman Melville), How Much Land Does A Man Need? (Leo Tolstoy), Traffic (John Ruskin), The Yellow Wall-paper (Charlotte Perkins Gilman), Socrates' Defence (Plato), The Gate of the Hundred Sorrows (Rudyard Kipling), The Steel Flea (Nikolai Leskov), The Meek One (Fyodor Dostoyevsky), Lord Arthur Savile’s Crime (Oscar Wilde), The Tinder Box (Hans Christian Andersen), To-morrow (Joseph Conrad), Of Street Piemen (Henry Mayhew), The Great Winglebury Duel (Charles Dickens), The Great Fire of London (Samuel Pepys), The Old Man in the Moon (Shen Fu), Miss Brill (Katherine Mansfield), The Communist Manifesto (Fredrich Engels and Karl Marx), How To Use Your Enemies (Baltasar Gracián), It was snowing butterflies (Charles Darwin), Il Duro (D. H. Lawrence), The Fall of Icarus (Ovid), My Dearest Father (Wolfgang Mozart), Kasyan from the Beautiful Mountains (Ivan Turgenev), Goblin Market (Christina Rossetti), Sindbad the Sailor, Leonardo da Vinci (Giorgio Vasari), As kingfishers catch fire (Gerard Manley Hopkins), Caligula (Suetonius), The Woman Much Missed (Thomas Hardy), Femme Fatale (Guy De Maupassant), The Night is Darkening Round Me (Emily Brontë), O Cruel Alexis (Virgil), Sketchy, Doubtful, Incomplete Jottings (Johann Wolfgang von Goethe), Remember, Body… (C. P. Cavafy), Anthem For Doomed Youth (Wilfred Owen), The Saga of Gunnlaug Serpent-tongue (Anon), Olalla (Robert Louis Stevenson), A Modest Proposal (Jonathan Swift), On the Beach at Night Alone (Walt Whitman), The Robber Bridegroom (Brothers Grimm), Aphorisms on Love and Death (Friedrich Nietzsche), The Wife of Bath (Geoffrey Chaucer), The Tell-Tale Heart (Edgar Allan Poe), How a Ghastly Story Was Brought to Light by a Common or Garden Butcher's Dog (Johann Peter Hebel), The Eve of St Agnes (John Keats), Circe and the Cyclops (Homer), Come Close (Sappho), Jason and Medea (Apollonius of Rhodes), A Slip Under the Microscope (H. G. Wells), The Dhammapada (Anon), I Hate and I Love (Catullus), Circles of Hell (Dante), The Life of a Stupid Man (Ryunosuke Akutagawa), Trimalchio's Feast (Petronius), Wailing Ghosts (Pu Songling), The Madness of Cambyses (Herodotus), Lips Too Chilled (Matsuo Basho), How We Weep and Laugh at the Same Thing (Michel de Montaigne), Well, they are gone, and here must I remain (Samuel Taylor Coleridge), Speaking of Siva (Anon), The Beautifull Cassandra (Jane Austen), A Hippo Banquet (Mary Kingsley), Antigone (Sophocles), On Murder Considered as One of the Fine Arts (Thomas De Quincey), Three Tang Dynasty Poets (Wang Wei), A Cup of Sake Beneath the Cherry Trees (Kenko), Mrs Rosie and the Priest (Giovanni Boccaccio), The Voyage of Sir Francis Drake Around the Whole Globe (Richard Hakluyt, The nightingales are drunk (Hafez), Travels in the Land of Serpents and Pearls (Marco Polo), The Old Nure's Story (Elizabeth Gaskell), A Pair of Silk Stockings (Kate Chopin), and The Reckoning (Edith Wharton).", "title": "Little Black Classics Box Set", "url": "http://www.goodreads.com/book/show/24611766-little-black-classics-box-set", "average": 4.41, "cover": "https://images.gr-assets.com/books/1432158376l/24611766.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/5481957.Various", "name": "Various"}], "type": ["Classics", "Fiction", "Writing"], "outlinks": ["http://www.goodreads.com/book/show/24611766-little-black-classics-box-set", "http://www.goodreads.com/book/show/23308785-best-jokes-2014", "http://www.goodreads.com/book/show/16268895-101-best-jokes", "http://www.goodreads.com/book/show/33232571-2016-on-goodreads", "http://www.goodreads.com/book/show/33642317-2017-on-goodreads", "http://www.goodreads.com/book/show/28181315-2015-on-goodreads"]}