{"ratings": 20751, "userreviews": [{"userName": "Raeleen Lemay", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "Ugh I’m not emotionally prepared for the last two volumes— — — — — — — — — — — — — — — — THIS VOLUME WAS SO GOOD.The plot is getting seriously nuts, and I'm terrified and excited to see where things go. I only have two volumes left to read, and I DON'T KNOW WHAT'S GOING TO HAPPEN."}, {"userName": "Anne", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Re-read 2015So thanks to my pal, Dan 2.0, I've had the chance not only to finally get my hands on the volumes of this series that I haven't been able to read, but also to do a re-read of the first four that I did manage to get my paws on back in the day.I had forgotten how good these suckers were!Man, Hill just takes everything and shakes it all to hell in this volume. The plot twists are just...very cool. And (this is the one great thing about losing your ability to retain information) that ending still managed to surprise the hell out of me.And if you haven't read this one yet, it'll shock the shit out of you, too.I promise.Original Review 2012I was skeptical of the Calvin and Hobbes artwork that started this volume off, but eventually it worked for me. Blending innocent art with the sinister going-ons in the plot definitely brought it up a notch.Again, this was excellent. Excellent! I can't even...And the ending? What?! How could you do that to me, Joe?! Gah! Expected publication of Locke and Key, Vol. 5: Clockworks is soon, so at least I won't have to wait too long...right?"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Apr 06, 2015", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/You guys are all aware of the fact that I’m an idiot, right? Yeah, I thought so. Just to confirm, I’m going to tell you a little secret. I accidentally started reading Locke and Key Volume 5 instead of 4 the other day. Luckily I figured out my mistake once I made it past Chapter 1 (which was a flashback). Then I started reading what I thought was Keys to the Kingdom only to find myself reading . . . \nCalvin and Hobbes? \nThese allergy meds are really something! Okay, let’s go with it. Welcome to Locke and Key Volume 4: Keys to the Kingdom Bill Watterson style . . . \nTalk about a volume with freaky fast delivery. Holy moses! There is a lot of focus on “game playing” this go around with old keys like the Giant Key, as well as performing a little memory swappage with help of the Head Key . . . \nbut there’s also the introduction of new keys like the Animal Key that allows you to . . . .\nand the Herkules-Schlüssel which grants the user super strength and the ability to handily take down any opponent . . . \nAlso in this volume, Tyler finally begins to get wise of the whole Zack situation that culminates in a tussle of epic proportions and a cliffhangery ending that makes me soooooo thankful I have Volume 5 queued up and ready . . ."}, {"userName": "Will M.", "userReviewDate": "Jun 16, 2015", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "Amazing ending! Sort of a cliffhanger, but wow I need to read the next one right away. I've said it before, but I'm saying it again, Joe Hill can fucking write.Aside from the ending, I liked volume 3 more than this. The story continues to develop but it lacked the depth that the last volume had. I am hating the shit out of Zack as the series goes on. The characters are really likable and they continue to grow on you.4.5/5 stars. Still shy of a .5 but it's almost there. I want more keys."}, {"userName": "Miriam", "userReviewDate": "Aug 28, 2015", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "The first half was disappointingly incoherent. And what was up with those cartoony-style panels about Bode, who appears to have turned from a slightly weird, sightly dumb little boy to a very weird kid who talks like a Charles Wallace baby genius?The second half got better. I was glad to see Rufus finally having a plot role. Ty got smarter (as one ideally does during the course of adolescence and after some rough experiences) and Kinsey got dumber (as one probably does after artificially removing parts of one's mind with a magic key). Sam's unexpected role continues. I enjoyed it, but definitely not up to the standard of earlier installments in the series."}, {"userName": "Trudi", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "2015 re-read: Closing in on the final two volumes and I can barely stand the tension. I have the day off work and am blissfully binging on the terrifying thrills and spectacular adventure that is Joe Hill's Locke & Key series. I'm madly in love with this wicked crazy gothic modern fairytale about a sprawling, mysterious house with forbidden secrets hiding behind locked doors and a cast of unusual keys with the power to open them. This story works not just on a fantastical level that blows all the circuits of your imagination at once, but on an emotional level where you care and worry about the characters and grip the pages white-knuckled in total abject fear for their safety. Little Bode Locke stole my heart from the opening pages of  Welcome to Lovecraft and I've come to adore the sweet, precocious brat even more as the series has gone on, gathering steam and momentum and magic along the way. Tyler and Kinsey are great older siblings acting as stabilizing forces to Bode's youthful uncontainable exuberance and transgressions. But even Tyler and Kinsey have made mistakes that have put the entire family in the worst jeopardy. Where do we go from here? What happens next?What is the Omega Key? And what lies behind the black door?Eeek! 2012 review:Outstanding!!!! I cannot wait for more! This series continues to get stronger with every installment. Since Chapter 1 \"Sparrow\" is dedicated to the great Bill Watterson, it is only appropriate that I express the extent of my pleasure in a happy dance thusly:"}, {"userName": "Calista", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/16731747-calista", "userReview": "This book moves the plot forward quickly. The first chapter has a nod to Calvin and Hobbs it appears. The art is great and it can also be gorey. In this book, ever chapter has a new key that does something. It still feels like Zack is always ahead of everything and he's going to win. Yet, Bode seems to be catching on. There was a huge cliff hanger at the end. I mean I need to find out what is going to happen. Just like with other volumes, characters die, it looks like the Locke children might get ahead and it seems that Zack is ahead. I am constantly surprised by this series. If you are into graphic novels, you should be reading this."}, {"userName": "Sarah", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/7477266-sarah", "userReview": "3.5ish stars. The start of the volume was a bit slow but it really picked up at the end. I’m really excited now to read the next volume because that ending was crazy! The illustrations were stunning as usual."}, {"userName": "Jadranka", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/12277740-jadranka", "userReview": "Misim da komotno mogu i preostala dva dela ovog serijala da ocenim sa 5* bez čitanja.Crtež i priča su u savršenom skladu, i međusobno se dopunjavaju, a svaka epizoda je bolja od prethodne.Ocena: 5+"}, {"userName": "destiny ☠ howling libraries", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/15335689-destiny-howling-libraries", "userReview": "Funny enough, given that Volume 3 was my favorite of the series so far, Volume 4 was my least favorite. There was a lot of action without dialogue that made it just feel like filler material, as well as some particularly sad events that were a little bit hard to follow through the storyline.One thing I did enjoy about this volume, however, was the opportunity it took to make fun of bigoted, racist assholes. I never get tired of that.Series content warning: violence, sexual assault, homophobia, racism, sexism, ableism. All negative views are challenged by the text, but are very present."}, {"userName": "Sam Quixote", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "Hmm, not a whole lot happens in the fourth Locke & Key book: Zack/Dodge is still monotonously hunting for the Omega Key. He targets an old girlfriend of Rendell’s (the Locke kids’ dead dad) who recognises him, and he continues to torment Rufus, the son of the woman he’s living with. Then it’s a waiting game until something resembling a plot emerges in the final act. It’s not really plot-driven - it’s not really character-driven either! Locke & Key’s “story” just kinda… floats there. Maybe this is a detail I’ve forgotten from previous books, but I don’t get why Zack - if he can change his sex on a whim - doesn’t adopt a different face from the one he’s worn for decades? You know, the one that attracts unwanted attention and damningly appears in old photos? Or why he even has a lip-ring, an easily identifiable marker? Surely everything would be easier for him if these two things were gone altogether? Amid the waiting around, there’s some clumsy social commentary on the double standard in society for whites and blacks, and some corny melodrama with Tyler’s girlfriend Jordan - the kinda crap that doesn’t happen outside of bad fiction. Joe Hill’s also just not very good at pulling off real emotions. One scene has Tyler suddenly sobbing about his dead dad that comes out of nowhere and is unexpectedly funny! Gabriel Rodriguez’s art is fine. There’s a cute Bill Watterson tribute in the first chapter where Bode becomes a sparrow, and I liked the Jester Key design. Generally his art is good. But, wow, what a lot of filler! A whole heckuva lot of watching the characters putz about doing nothing for page after page! I guess the fans of this series must really like the Locke kids for them to think this book is all that and a bag of chips? Not me. I was bored for much of it and only mildly interested once Hill decides to start doing things in the final 20 pages or so. I have the whole series so I’ll finish the remaining two books but this fourth volume is slow and uneventful for the most part - a tedious read that feels like Hill and Rodriguez milking their cash cow for as long as possible."}, {"userName": "Algernon", "userReviewDate": "Jun 20, 2014", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "The series just gets better and better. In  Keys to the Kingdom  I feel the need to remark on the daring use of unconventional storytelling and experimental graphic settings. The opening issue,  Sparrow is a particularly well executed homage to my all time favorite artist Bill Waterson and his newspaper style of small panel stories. The choice of Bode as a stand-in for the subversive Calvin is obvious to anyone familiar with the personalities of the Locke children. Here’s a gem from the mouth of the adventurous kid: @#&%!Teenagers!What the heck is wrong with them?!Just when you’re about to get a good snowball fight going, they have to ruin it by talking about ‘relationships’! Left to his own devices by his teenage siblings, Bode discovers yet another magical key, one the opens to him the kingdom of beasts. An amazing flight of fancy that ends in blood and tears as the Adversary of the Locke family is still plotting to bring them down.In the next issue,  White  Kinsey and Bode investigate the past mysteries of their father’s generation, with the help of another magical key, one that allows a person to change his/her appearance. The premise offers good material for an exploration of racial prejudice and identity issues.Issue no. 3,  February , is built on a calendar template, with each panel representing a day in the winter month. We have Tyler trying to fit in on his school’s hockey team, Bode discovering new and dangerous keys, a little highschool romance drama with Kinsey playing the rebelious girl and hesitating between the dark and hansome Zack and her geeky class mates while Tyler wins and loses his girlfriend attentions in the space of a few days. I’m starting to lose track of all the new keys and abilities among creeping sharp vines, rusty chains, mesmerizing mechanical dancers, sword wielding squirells and strength enhancing amulets. The three Locke scions find out among other things that playing around with magic and bringing their friends in on the secret can have unforeseen and painful consquences. Casualties  is using a classical comic template, I believe from the 1970’s, from some military themes series that I’m unfamiliar with. Bode is assisted here by the boy Rufus, and together they discover that their make-believe game of toy soldiers is mirroring the larger conflict between the Locke family and their Adversary. The autistic Rufus has his own magical abilities of perceiving the supernatural manifestation in the mansion, among them the ghost of Sam Lesser, still haunting the halls and corridors looking for revenge against the Adversary. Detectives , parts I and II, bring about a timely and surprising major development in the plot, so I will talk less about them. Suffice to say, I felt it was about time for some revelations and a game changer from the interesting but repetitive experiments with new keys.Overall, the quality of the writing and the graphical excellence show no signs of faltering after four albums, and I have high hopes from the following albums."}, {"userName": "Leah", "userReviewDate": "Jun 16, 2014", "userURL": "http://www.goodreads.com/user/show/15797955-leah", "userReview": "From 5 stars to 4. I still really enjoyed this but it's slightly less awesome than I remembered.6/16 2014Holy shit with the ending! Why would you do this to me Joe? Why?Wow. Just wow. If you haven't read my review of Volume 1 where I say to pick up this series and read it. Well, I'm saying it again. Read this series.When I first opened \nKeys to the Kingdom,\n I wasn't a huge fan of the childlike artwork at first, but it grew on me, and it ended up working really well with the art I'm used to with this series. The story itself though, yeah, that just keeps getting better. The plot just freaking thickens with \nKeys to the Kingdom,\n and I was holding on for dear life as this world that Joe Hill has created continued to come to life on the pages in front of me. Props to Gabriel Rodriguez for being able to create this world visually so well. It was just another outstanding, amazing, volume to this.I can't believe there's only two left to go. I'm nearing the end, and I'm frightened at what there will be when I come to the end. At this point, I just have no idea if the Lockes are going to win."}, {"userName": "mark monday", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "oooooo... the eeriest of rollercoaster rides, a rush of images, sinister vistas zooming in and out of view, unreal tableau cascading pell-mell, willy-nilly, hurly-burly: an homage to Bill Watterson, a bloody battle between birds and wolves; racial dismay and distortion in an insane asylum; a hockey loss, a greenhouse comes alive, sprouting wings, battling chains, battling squirrels, a death-tune, the end of friendships, battling teddy bears, battling friends, the worst way to win at hockey; an homage to EC Comics, soldiers in battle, a ghost with an agenda and an autistic child, a \"philososcope\"; a long-awaited confrontation, the return of a terrible tune, a terrible death, a terrible transformation... Joe Hill (brilliant writing) and Gabriel Rodriguez (brilliant art) decide to unleash everything at once and the effect is wonderfully disorienting, the carefully scattered puzzle pieces begin uniting in mad spurts, the slow pace moves into fast-forward, everything comes together, everything falls apart... my hands gripped this volume too tightly, my eyes wide, my mouth agape, my brain began to hurt..."}, {"userName": "Chad", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/25388909-chad", "userReview": "After many attacks the kids finally figure some things out just in time for a major turn in the story. The Bill Watterson tribute issue is fantastic. I love the juxtaposition between the cartoony panels and the graphic battles in the backgrounds. There are so many great panels in the February issue where they just throw away battles between the Lockes and the Dark Lady in one panel. They could really revisit these and flesh each one out into an entire issue. They are so creative. I think that's what I like the most about this series. The amount of original creativity and thought that's gone into the entire Locke and Key series. I dread coming to the end of each volume, because that means I'm one step closer to the end of the series."}, {"userName": "Gorgona Grim", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/17672459-gorgona-grim", "userReview": "Ok, ovo je genijalno, ali zaista genijalno."}, {"userName": "Andrew", "userReviewDate": "Jan 20, 2015", "userURL": "http://www.goodreads.com/user/show/800291-andrew", "userReview": "As I commented in the comments to the previous volume its very tricky to comment about a series of books unless its negatively. The problem is with this series is its quality - its just so good that one book blends in to the next. The story is seamless and so consistent, okay time may pass in the story, locations change and cast of characters alter but the artwork, storyline and even just the feel of the story feels the same. And there in lies the problem - how do I differentiate between the volumes when so far the are all so good.So there is the challenge how do I (or more likely fail to) pick out aspects of one book to the next which makes this review any different to the volumes either side of it.Well what can I say. the series is now past the half way point and as you would know from the earlier volumes the story is now heading towards its confrontations and conclusions and in Keys to the Kingdom we start to see the major shifts in the storyline start including a massive shift at the end of the book ( remember no spoilers). SO all I can say is that volume 5 was started very quickly after the ending of this one!"}, {"userName": "Becky", "userReviewDate": "Jan 18, 2011", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "Ohhhhhh snap! Shit. Just. Got. Real. This installment was chaotic and hectic, in the best possible way. I loved how Bode's playtime was drawn in different styles. It was just so appropriate and endearing, and it fit so well to each theme of his playtime, while at the same time being just as dark and grim as any of the series has been so far. I loved the February chapter, how it progresses the story via fight montages, without saying much of anything at all, just showing us fight after fight against the Dark Lady and her minions. I loved the way Tyler is stepping up as the man of the family and trying to end this shit once and for all. I LOVED the twist at the end. Soooo gooooood."}, {"userName": "Iryna (Book and Sword)", "userReviewDate": "May 27, 2017", "userURL": "http://www.goodreads.com/user/show/57236678-iryna-book-and-sword", "userReview": "4.25/5 stars Things just got whole lot of crazier! And that CLIFFHANGER?? Come on now! I only own four volumes, so now I have to go and buy the last two asap. I am trying to guess where is this insane train going, but with the way things are unfolding - anything is possible! They also touched up on some pretty important humane issues in this one, so I really enjoyed it.My WEBSITEMy INSTAGRAMMy WORDPRESS BLOG"}, {"userName": "Amar", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/13603434-amar", "userReview": "Bolesno... ali baš bolesno dobar kraj. Kao i kod prethodnika, uzivao sam u priči. Ali, ovaj put imam zamjerke. Kao prvo zamjena crteža na početku mi se nimalo nije dopalo, jer likovi nisu ni ličili na sebe. Zatim organizacija crteža je bila drugačija i to mi je malo zasmetalo. Ali ono što mi je baš bolo za oči je da je priča bila previše ubrzana, gdje smo dobili zanimljive crteže kod kojih nismo dobili mnogo detalja u scenama.Iako imam te neke zamjerke, i dalje preporučujem ovaj dio i serijal čitav.4*"}, {"userName": "Ronyell", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/1169488-ronyell", "userReview": "I have been reading Joe Hill’s fantastic “Locke and Key” series for awhile and so far, this series has been nothing but brilliant so far and I am enjoying every single story coming out of this series! The fourth volume “Locke and Key: Keys to the Kingdom” is an Eisner nominated book by Joe Hill that proves to be the huge turning point for this series as Zack Wells, who turns out to be Lucas Don Caravaggio in a new body, starts showing his true colors! “Locke and Key: Keys to the Kingdom” is a brilliant volume that will definitely turn the tides for this series!There are a total of five chapters in this volume and here are the chapters:\nChapter One: Sparrow:\nIn this chapter, Joe Hill makes a tribute to Bill Watterson’s famous comic strip “Calvin and Hobbes” by detailing a story where Bode tries to make new friends but there appears to be a key that can turn anyone into a wolf and Zack happens to obtain the key to transform himself into a wolf and attack Tyler and Kinsey! Meanwhile, Bode is able to transform himself into a bird and has crazy adventures in his bird form!\nChapter Two: White\nWhen an elderly woman named Erin Voss started acting crazy every time she is near something white, Kinsey encounters the subject of racism, while she is curious about how Erin Voss knows about her father Rendell. So to approach Erin Voss, Kinsey finds a key that allows her to change the color of her skin. But what secrets is Erin Voss hiding?\nChapter Three: February\nDuring this month, the Locke kids go through so many supernatural activities where they are attacked by various monsters. Meanwhile, the kids try to tell their friends about the keys, but they end up facing the consequences of their actions.\nChapter Four: Casualties\nWhen Rufus, Coach Whedon’s son is visited by the ghost of Sam Lesser, he finds out that Zack Wells is not all he is cracked up to be and Rufus must find a way to warn the Locke kids about Zack.\nChapter Five: Detectives\nWhen Tyler discovers something foul about Zack Wells, he goes to find out more about Zack Wells and his connection with the murders in the town. Unfortunately, Tyler will soon realize that Zack might be up to some sinister tricks that could endanger his family!Oh my goodness! Did I mention before that this series just keeps getting better and better every time I read them? The fourth volume in the “Locke and Key” series is definitely no exception to this as it serves to be a huge turning point for our favorite Locke kids! Joe Hill has once again done an excellent job at balancing the supernatural nature of this story with the everyday problems that the Locke kids have to face after the death of their father. I loved the way that Joe Hill portrayed the relationships between Tyler, Kinsey and Bode as they all care about each other and it was great seeing them protect each other from any danger that comes towards them. I also loved seeing the relationships that the Locke kids have with their friends, especially Kinsey with Jamal and Scot as they are extremely close with each other and I loved the dialogues that Joe Hill sets up between the three of them as they are extremely funny and thought-provoking to read. I also loved the tension that Joe Hill builds up with Zack Wells as it seems that his true nature is beginning the show in the most terrifying way possible (there was one scene where Zack seems to do something to a person that made me really cringe – you have to read it for yourself!) Gabriel Rodriguez’s artwork is as always truly dramatic and gorgeous to look at as all the coloring is dark which fits the gloomy feel of this story and I loved the way that the characters look semi-realistic which really gives the story a more mature feel. I also loved the way that Gabriel Rodriguez was able to portray the Locke kids as characters from “Calvin and Hobbes” in the first chapter “Sparrow” and the artwork in that chapter truly portrayed the spirit and humor that came from the “Calvin and Hobbes” comics.As with the majority of the “Locke and Key” series, this volume has extremely strong language and many violent and disturbing scenes that would cause anyone who is not used to gory images to feel uncomfortable. I have mentioned before that there was a little scene where Zack does something horrible to another character and it might disturb many readers (it definitely disturbed me a bit, although the artwork was fantastic for that scene). Overall, “Locke and Key: Keys to the Kingdom” is a brilliant volume that really turns this series to a new direction and I cannot wait to see what will become of the Locke kids at this point! Now, I am definitely excited for the fifth volume “Clockworks!”Review is also on: Rabbit Ears Book Blog"}, {"userName": "Brandon", "userReviewDate": "May 02, 2012", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "What more can I say that I haven't already said about this series? I've been singing its praises for the past 3 volumes and with this 4th installment, it shows no signs of slowing down.Rodriguez really shows off in this collection. He clearly isn't satisfied in sticking with the artwork that has made this such a great story. He takes a bit of a risk within the first chapter and transistions to a style similar to Calvin & Hobbes, which despite the darker subject matter, still works.While more than a few things happen in this volume, the story never seems cluttered and nothing feels unnecessary. The introduction of 3 more keys lead to several twists and turns as well as some pretty awesome scenes. Probably the biggest twist in the story happens near the end of this book causing me to salivate for the next release.I'm hoping that when this comes to an end (a sad day, indeed), they decide to group this into one massive trade. As of yet, there are no weak points or bad developments. In my experience, it's rare that a 4th volume is just as strong as the first. It takes a great duo (writer & artist) to pull this off. Rodriguez and Hill falling second only to Brubaker and Phillips in my mind."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "www.melissa413readsalot.blogspot.comThis one was different in a lot of ways from the other books. It was still great. Some more bad stuff happens of course and some really funny stuff with Bode.The graphics were a little different too, but they were still awesome! I loved the end with the exception of one thing but I can't say what that is... only.. one person got what was coming to them and one didn't!!!!!"}, {"userName": "Joy", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/19804648-joy", "userReview": "\"...Don't move don't move, don't move along... Stay where you are, this is the 'don't move' song...\"Highlights:More keys!Oh no, boyfriend!Finally Tyler gets suspicious!Oh no, Bode!Strange and a bit less organized than other volumes but still great. 4.5"}, {"userName": "Arnis", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/6257859-arnis", "userReview": "https://poseidons99.wordpress.com/201..."}, {"userName": "Mike", "userReviewDate": "Apr 19, 2012", "userURL": "http://www.goodreads.com/user/show/1776702-mike", "userReview": "[Sam told Rufus (coach's kid) if Zack ever goes through the doorway to the wellhouse (forced or not) he's done for. Dark Lady jumped from Zack to Bode, and Sam jumped to Zack just in time to get killed and \"case closed\". (hide spoiler)]"}, {"userName": "Tim The Enchanter", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/5654692-tim-the-enchanter", "userReview": "There is a touch of daring in this book. Without spoilers, the plot takes an unforeseen (to me at least) turn. If you have read this far in the series, you won't be stopping here and you don't need me to convince you to move on. These are the perfect comics for people who don't read comics (me again).As a side note, I really liked the tribute to Bill Watterson's Calvin and Hobbes. Throughout sections of one of the instalments, the author drew in the style of this classic comic. While this comic overall was dark, the \"Calvin and Hobbes\" sections were filled with the wit that made the latter so loveable."}, {"userName": "Edward Lorn", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "2.5 stars rounded up because ice-skate violence is the best violence.At this point I was really hoping to find out more about the keys but instead I'm beginning to feel like I'm watching a television show that doesn't know how or when it wants to wrap things up. (Can you say The Walking Dead, class? The. Walk. Ing. Dead. Good job, class. Soda pops and arsenic tablets for everyone!) Every time they need a filler issue we're introduced to a new key and BOOM! just like that we have more story, or something that resembles story progression, anyway... yay...whoohoo...FML... This volume was all over the place in the most haphazard ways. Pure chaos. No rhyme or reason beyond needing to tie up some loose ends. Thing is, these loose ends could've been tied up in a single issue. Instead of that we're given an entire season of filler. Ladies and gentlegerms, meet Scooby Doo's baby-daddy's cousin Whoopity Doo!The first issue in this volume was radical, with the birds and dogs and shit, and then everything went to hell in a flaming sewage truck. It wrapped up with a silly-as-fuck ending, but at least that ice-skate scene exists. Still, I closed the book thinking, \"Come on! How much longer are they going to prolong this ending???\" The art is still good, as is the dialogue and the writing, but the story is moving along at a snail's pace. In summation: Really thought I would like this series more than I do at the moment, which blows because Volume 3 was so goddamn good. Not sure what happened here, but I hope Volume 5 drags the story back onto the rails and we can finally progress with the story instead of filling in the blanks in the most chaotic fashion imaginable.Final Judgment: Make like a herpes-ridden cock and WRAP IT UP!"}, {"userName": "Javier Muñoz", "userReviewDate": "May 24, 2016", "userURL": "http://www.goodreads.com/user/show/47879363-javier-mu-oz", "userReview": "La cosa empieza a ponerse seria, como siempre Joe hill consigue atraparnos con la vida cotidiana de los hermanos Locke al tiempo que va avanzando en la historia principal poco a poco, dejando semillas de tramas que más tarde se explorarán o recuperando otras que se dejaron a medias. La forma de manejar los tiempos narrativos de Joe Hill me parece excelente, no se cae como en otras colecciones en la tentación de meter episodios de relleno... todos los episodios avanzan la trama principal aunque sea sólo un poco, todos los episodios muestran aunque sea pequeños detalles en la progresión de los personajes principales, los episodios individuales funcionan bien por sí sólos y al mismo tiempo se integran en la trama de una manera perfecta, así como los distintos volúmenes, muy bien pensados para que se puedan disfrutar tanto en conjunto como por separado.... esto hay guionistas de comics que no lo consiguen en toda su carrera y Joe Hill hace que parezca sencillo.En este volumen hay un personaje que simplemente muere, otros que están a punto, otro que aunque no muere se convierte en espíritu y otro que aunque muere está más vivo que nunca, llaves nuevas que se nos presentan sin demasiada ceremonia, Sam Lesser volverá a intentar jugársela a Caravaggio/Zack/dama del pozo, Kinsey demuestra que no hay que jugar con ella, giros argumentales y sorpresas por doquier y acabaremos con un cliffhanger que nos dejará con ganas de empezar el siguiente volumen según acabemos este. Es muy grande esta colección"}, {"userName": "*~Lan Lan~*", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/16088150-lan-lan", "userReview": "I am speechless! Perfection. Give me the next volume in my hands now! Or somebody get a hurting... I kid. Or am I...Uh yeah, pretty much my favourite series. Only thing wrong with it is that it only has 6 volumes and I need more in my life. I am almost done, with the fifth just coming in the mail now, and that makes me a very, very sad panda."}], "description": "Joe Hill and Gabriel Rodriguez's Locke & Key unwinds into its fourth volume in Keys to the Kingdom. With more keys making themselves known, and the depths of the Locke family's mystery ever-expanding, Dodge's desperation to end his shadowy quest drives the inhabitants of Keyhouse ever closer to a revealing conclusion.", "title": "Locke & Key, Vol. 4: Keys to the Kingdom\n      \n          (Locke & Key #4)", "url": "https://www.goodreads.com/book/show/9674335-locke-key-vol-4", "average": 4.43, "cover": "https://images.gr-assets.com/books/1377306592l/9674335.jpg", "reviews": 1211, "authors": [{"url": "https://www.goodreads.com/author/show/88506.Joe_Hill", "name": "Joe Hill"}, {"url": "https://www.goodreads.com/author/show/2751991.Gabriel_Rodr_guez", "name": "Gabriel Rodríguez"}], "type": ["Sequential Art", "Sequential Art", "Horror", "Fantasy", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9674335-locke-key-vol-4", "http://www.goodreads.com/book/show/27281364-lokot-i-klju-4", "http://www.goodreads.com/book/show/13265983-locke-key-volume-4", "http://www.goodreads.com/book/show/6587879-horns", "http://www.goodreads.com/book/show/153025.Heart_Shaped_Box", "http://www.goodreads.com/book/show/15729539-nos4a2", "http://www.goodreads.com/book/show/3217221-locke-key-vol-1", "http://www.goodreads.com/book/show/6120349-locke-key-vol-2"]}