{"ratings": 569, "userreviews": [{"userName": "Lisa", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "Well, what can I say? I doubt there has ever been an author who took “doing the legwork” more seriously, or more literally. It all starts with rage, as so often. Utterly infuriated by the Millennium Dome project, Iain Sinclair decides to WALK AROUND London, in an orbit following the M25, the London Orbital, in a counterclockwise movement, exploring the surrounding area as far as it is accessible for pedestrians:“We hadn’t walked around the perimeter of London, we had circumnavigated the Dome. At safe distance. Away from its poisoned heritage. Its bad will, mendacity. The tent could consider itself exorcised.” With different friends in several phases, over the course of two years, and equipped for the weather (most of the time), he walks and meticulously notes what he sees and hears, and adds anecdotes on people who have lived in, or passed through, the areas he explores. Blisters, lack of breakfast-serving pubs, lost umbrellas or cameras out of order are part of the adventure, just like roads that lead nowhere, rubble, trash, broken and left-behind vehicles and consumer goods. He shares stories of the rich and the poor inhabitants of Greater London, reflecting on present and past, gangsters and politicians, writers and artists, businesses and landscapes, both industrial and natural.The hyperrealistic zooming in of mostly ignored parts of London’s periphery has a strange effect on the reader, who has to slow down the pace and take in the book in the same way a pedestrian takes in the M25’s atmosphere, step by step, detail by detail, road by road.While staying in the concrete, on the concrete, Sinclair’s London-walk-mirrored-in-text turns into a fantasy of random information, added endlessly while following the traffic circling the historical nucleus of the city. The roads are connected, but form no coherent storyline, they just lead on and on, delivering details of meaningless encounters. In a way, the descriptions remind me of Piranesi’s gigantic architectural compositions: hyperrealistic in detail, scarily dystopian in content. Reality as a strange maze, leading nowhere. This certainly is not a book that can be easily consumed in an afternoon or two. It took me more than six months to work my way through it, slowly, with breaks. The author himself invites to those breaks as well, constantly looking for a good pub to relax with a pint, or to change socks. More often than not, I had to interrupt my reading to consult maps, books or photographs, as the walk around London Orbital is simultaneously a walk around London’s history as described in its literature.I am quite sure I will not follow the itinerary of the novel in real life, but it was a fascinating walk in the mind!"}, {"userName": "Lizixer", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/4679748-lizixer", "userReview": "Remember the Dome? That strange New Labour project that drew us all to it to look at big stuff. I went a couple of times. I remember having a good meal in the 'posh' restaurant there. Then it died. Now people go to see Barry Manilow and Coldplay at the O2 and all memories of the Millenium are banished.Iain Sinclair's book brings it all back. How we were on the eve of a new Millenium. Odd snippets of news remembered, anger at the developers carving up our forgotten and desolate wastelands to build their boxes and their two car carports. PFI, ecstasy, Essex before it became a tv freak show. Welcome to the end of a 1000 years.Sinclair's book is also a tribute to those fast disappearing fringes. Accompanied by artists, photographers and the the works of writers and artists with very English sensibilities Wells, Ballard, Samuel Palmer, he explores the fringes of London around the M25, a place of abandoned madhouses, empty commuter villages and weird stories. These are the bits I like best. His bottomless mine of stories, his feel for the forgotten places, his local history of social disasters of the past. He walks, he takes pictures, he observes and muses on the people of 1999 but Sinclair is also very funny. His wit is sharp, as is his dissection of modern phenomena such as malls like Bluewater. He enjoys fry ups, sausage rolls and tea from those funny little caffs by A roads. He observes with sympathy the folk that stand a little out of focus. He revels in those dark, out of the way places that you must walk through miles of mud and scrub and abandoned detritus to get to. He delights in tiny churches in out of the way villages. He writes about the bits in between the myths we weave about our towns and villages. This is a portrait of London that may not sit well with the tourist board but is inescapably a true likeness."}, {"userName": "Jonfaith", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/2327886-jonfaith", "userReview": "Tremendous. The narrative arced as a measure of validation for all the bookish types minding themselves on the margins. I cannot praise this book enough. London Orbital remains anecdotal and poetic. It has a charm and understatement. Consider the blurbs from Will Self and Russell Brand. There is a grit and presence here."}, {"userName": "John", "userReviewDate": "Aug 19, 2007", "userURL": "http://www.goodreads.com/user/show/290848-john", "userReview": "First of all: the author is brilliant. The bon mots fly faster dust motes in a tornado; to fully apprec iate them, the reader needs a *very* strong grounding in (somewhat obscure aspects of) English history and culture. I didn't get into the groove of Sinclair's style until nearly the end of this 500-page opus. Don't give up, but I don't blame those who do. Getting through this book is a similar to finishing a mental marathon.P.S. I really, really could've used at least a simple map of his route"}, {"userName": "Becky", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/2341546-becky", "userReview": "This was a real disappointment. As the title suggests, Iain Sinclair makes a trip around the M25, trying to define London by exploring it's outskirts. But his interests are morose, and his tone one dimensional. There are some interesting bits of history, mostly concerning the number of asylums and the smallpox hospitals, but generally, the trip is a real bore. I was really looking forward to this one, but it was dull as dishwater."}, {"userName": "Neale", "userReviewDate": "Oct 01, 2012", "userURL": "http://www.goodreads.com/user/show/5236138-neale", "userReview": "Iain Sinclair is a dreadful writer, and some kind of genius. He is the worst possible example for other writers to emulate, of which he should be proud.His capacity for phrase-making is extraordinary: scarcely a paragraph goes by without some sort of rancid jewel of prose. His capacity for creating satisfactory large structures is almost zero. His sense of psychogeography - of the past figured in the mundane present - is exhilarating. His obsessive return to certain themes and characters is like a dog returning to its vomit. Interesting vomit, though.I would read almost anything he writes, for the pleasure of throwing it aside in frustration..."}, {"userName": "Jen", "userReviewDate": "May 11, 2015", "userURL": "http://www.goodreads.com/user/show/21152376-jen", "userReview": "★★★★.5The M25 is a roadway that circles around London and it is generally considered to be a road to nowhere. Sinclair decides that he will walk the M25 (or paths next to the M25) through various neighborhoods and passing abandoned buildings, closed mental institutions, polluted neighborhoods, beautiful gardens and estates, and much more. Multiple \"characters\" accompany the author as he makes the walk around the entire circuit.This was a fascinating book for me but it is clearly not for everyone. Despite the fact that it took me months to finish this book, It's non-fiction and reads like a series of footnotes with some narrative thread loosely connecting the various threads. This typically is not the sort of book I would enjoy, but I tackled the book as a journey. I printed out maps of the M25 and surrounding neighborhoods and I read slowly looking up pictures of all the locations. I used to live in England up until age 12. We lived in Surrey and Sinclair described many towns I knew and I loved the amount of detail provided. Reading the book in this way over the course of months, made it an enjoyable and fascinating read. I think it will be a more enjoyable book for people who are either from London or have spent significant time in London and surrounding areas.The best way for me to describe this book is to liken it to a museum guided tour where you go from one point to the next with a group of people and stop at various locations to learn a little about each destination point and while on the way you chat with your neighbors about a variety of topics. And the sheer number of literary references are fun to read."}, {"userName": "Carmen", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/2759492-carmen", "userReview": "I started this book 2 weeks ago. Ages ago. It felt like I was the one doing the walking on the M25 around London! And yet, I thoroughly enjoyed Mr. Sinclair's British walkabout. I began with the intention that I was going to understand everything that was going on - I read the first two parts while sitting at the computer and looking at London and the M25 on Google maps, with extra windows open in Safari so I could check up on all the fast-flowing and random references that were being strewn about, but it just became too much. For the last three quarters of the book, I settled for living vicariously through Iain Sinclair's words, using my imagination to picture it, and cheering at the few tidbits of information I caught and waving like one of his dear asylum dwellers at the ones that flew over my head. It really was a fascinating book, but long and wordy and with the unfortunate tendency of putting me to sleep. Now that I'm finished I can say that it was a great experience, but one I'm unlikely to repeat in the future - unless I suddenly move to London or surrounding area and have an itch at hiking around it. Then I'll bring it along for ballast."}, {"userName": "Wayland Smith", "userReviewDate": "Mar 07, 2014", "userURL": "http://www.goodreads.com/user/show/16181797-wayland-smith", "userReview": "What a very odd book. The author decides to try and hike around the \"London Oribtal,\" the road that rings London. He wanders around with a cast of varying back up characters, and takes random side trips both literally and figuratively into the history of the areas he walks through. There's a lot of talk about pictures taken along the way, but none are included. I've read a lot of English books over the years, and I'm reasonably conversant with British slang. It wasn't enough. I have no idea what \"asylum seekers\" are, but apparently Mr. Sinclair is very concerned with them. He uses the phrase once per section at least, frequently more often. The recurring theme, if there is one, seems to be how much of the English countryside and old ways of life urban sprawl has absorbed. That's a sad note, but reasonably accurate about everywhere I've been.I can't really recommend the book. He sort of babbles at times. It was recommended to me as a classic, and I don't really see how it qualifies."}, {"userName": "Grace", "userReviewDate": "May 09, 2009", "userURL": "http://www.goodreads.com/user/show/1898325-grace", "userReview": "I found this book maddening to begin with but fascinating by the end. It makes a coherent whole with strong central themes but I'm not sure if I was bludgeoned into submission by his repetition. His insistent conservatism can be overlooked. I stopped noticing that he never used one word (clause/sentence) when he could use three. I did make a mental note never to read any book(s) he may have written around 2003/2004 - the Dome/spin caused enough outrage and I can't imagine how much he'd have to vent about some of the really bad New Labour moves..."}, {"userName": "Mark Foulkes", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/12120374-mark-foulkes", "userReview": "Thought I would put this one in as my favorite book of recent years. I cannot really rate this one higher. A total triumph of dense factual and opinionated writing packed full of theory and conjecture. Every page is packed with information that must have been backed up with research. It really fired up an an interest in psychogeography in me."}, {"userName": "Maik", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/17969415-maik", "userReview": "It takes him one fifth of the book to actually get started on the titular journey, and after some very good bits, he now gets lost again. This is so maddeningly unfocused I lost patience in dissecting the promising trajectory from the chatty sidetracks. I took the train back to the city centre after the first half of the book."}, {"userName": "Trish", "userReviewDate": "May 02, 2008", "userURL": "http://www.goodreads.com/user/show/1113281-trish", "userReview": "Really not my cup of tea. The idea is interesting - walking round the M25 - but the way the book is written, you need doctorates in about eight different subjects to understand all his allusions and literary references."}, {"userName": "Jenn", "userReviewDate": "Oct 27, 2013", "userURL": "http://www.goodreads.com/user/show/15024040-jenn", "userReview": "I like the basic premise of this. There is something mildly anarchic about walking round the entire M25 – no-one walks the M25 and you don’t see your surroundings as you drive, not even when you’re stuck in a traffic jam (which is often). It’s trampled on and devastated much of the home-counties - which is progress of a kind I suppose in our rush to become a global economy - but we’ve lost a lot along the way. And it’s true to say you only notice things properly when you walk.Nonetheless the book is way too long. I got bored somewhere between the M4 and Leatherhead and I didn’t touch it for months. In fact I wouldn’t have finished it all if it hadn’t appeared transiently on the `1001 books list’ and that would have been a pity because it contains some real gems. Iain Sinclair writes beautifully on occasion, his description of the Blue Water Shopping Centre is marvellous for instance, as are his descriptions of the area around Dartford. He has a short-sentence, modernist way of writing, sometimes very to the point, but its not suited to such a long book.He has an obsession with burger bars, lunatic asylums and the Millennium Dome. The last is not interesting at all; it wasn’t that interesting at the time of the millennium and definitely not interesting now. The asylums apparently litter the M25. The Victorians had a predilection for dumping unwanted relatives in them, being a convenient distance from London. They are certainly tragic places, but he does go on and on. And I’m not that interested in what he ate for his breakfast either come to that. So it could have done with some drastic editing to reduce it by approximately half. Still, an interesting concept, I’ll think of him next time I’m driving past Staines."}, {"userName": "Sarah Sammis", "userReviewDate": "Apr 12, 2008", "userURL": "http://www.goodreads.com/user/show/122647-sarah-sammis", "userReview": "London Orbital by Iain Sinclair is an interesting counterpoint to Mrs. P's Journey by Sarah Hartley. It is part map and part memoir of the outer fringes of London where the M25 makes its 125 mile (give or take) loop around the city.Sinclair's walk in the late 1990s was inspired by his hatred for the Millennium dome. Walking and mapping the areas around the M25 became a way to cleanse the palette. He broke the walk up into seven parts, working anticlockwise around the fringes of the highway.I enjoyed the first half of the book but as he came around the back half of his travels it became more of the same. Six hundred pages was just more time than I wanted to spend touring along the edge of the M25. The book could have been shorter with fewer asides and tangents.I think that readers more familiar with the area will find the book more interesting. Likewise, I don't know that a Londoner who had never been to East Bay would find Castro Valley all that interesting either. While it wasn't among my favorite nonfiction books I've read so far this year, I did learn a few things. I recommend this book to readers familiar with London. Readers who aren't should take the book slowly and have a map handy."}, {"userName": "Sitatunga", "userReviewDate": "Feb 07, 2013", "userURL": "http://www.goodreads.com/user/show/17228442-sitatunga", "userReview": "I'm reading it again - on the principle that one should bend to the anti-clockwise centripetal force and exorcise both the putrifying scab of the malapropic Dome (O2, Greenwich Arena, future Heritage Centre) and the appalling corporate, Companion of Honour winning rave on Hackney Marshes. That's 249 miles of tarmac and concrete, double that along the disappearing rights of way, grass-tussocked canal paths, sign-cluttered Heritage bridleways and toxic fields .... over 1000 pages of tight, lexically fecund, idea burdened paragraphs you have to read again and again ... and again; hours of furious note-taking for use in blogs or envious common rooms ...."}, {"userName": "David Hallard", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/19158000-david-hallard", "userReview": "The page-turning locomotive of Sinclair's book is a distinctive fusion of prose and poetry. Though you will doubtless be left stranded at some point by the microscopically close focus of the author's obsessions, the trick is to hang on tight and allow the text's centripetal forces yank you back on track. The body of knowledge over which Sinclair exercises a critical opinion is truly awe-inspiring, and promises much for successive readings. Excellent value for money."}, {"userName": "Guido Tenconi", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/5860371-guido-tenconi", "userReview": "Although I am italian, I speak english well enough to go through it; I know London and its outskirts enough not to get lost or to be surprised by all the obscure places he mentions; and educated enough not to miss most of his clever and cryptic references.So I am going to finish this book but Lord Almighty this bloke most definitely is the most snobbish c**t I have ever stumbled into."}, {"userName": "Darran Mclaughlin", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5897674-darran-mclaughlin", "userReview": "Good, but not as good as 'Lights Out For The Territory'. I do like Iain Sinclair and I do appreciate the originality of his writing style, but unfortunately he goes over the same territory and obsessions again and again and it gets repetitive."}, {"userName": "John Beeler", "userReviewDate": "Jul 11, 2007", "userURL": "http://www.goodreads.com/user/show/158456-john-beeler", "userReview": "It didn't take long for me to realize that this would be an overwhelmingly hard read for me, or really anyone outside of London or Britian. I gave up."}, {"userName": "Aaron", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/3156693-aaron", "userReview": "London Orbital is a confusing mess. It is an interesting idea that could have been a fascinating book but the author is too obsessed with his fellow walks and pop culture."}, {"userName": "Erica Chambers", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/3085343-erica-chambers", "userReview": "I have finally finished London Orbital. Here are the things I liked about it... Iain Sinclair is a beautiful writer. I enjoyed his passages on the history and demise of the asylums dotted around the M25, his love of Samuel Palmer etc.But Lord, this man is judgy. I thought I was the world champion of sweeping generalisations - but Iain Sinclair has me beaten hands down. I live in Dorking, so was interested to see what he would think of my area. I don't think he came into Dorking town on his walk - but did climb Box Hill. Sadly, Box Hill has put a cafe on top of itself (a servery, as he calls it...) which angers Iain Sinclair \"my feeling is that anywhere with a 'servery' is to be avoided. If you want a shop, you should find a shop. Sainsbury's (Cobham) has a better servery than Box Hill\". To me - this does sum up Sinclair's attitude... Box Hill is packed with people, who come to picnic, cycle, walk and play. All kinds of people... People that look completely out of place at the top of Box Hill, but have made the effort to be there, rather than shopping in Bluewater... (another place Sinclair spews vitriol upon) - and I say reward them with a cup of tea from the servery. Sinclair is so disparaging of Barratt housing estates (they are also not my taste) - but that doesn't make them bad places... in fact at the time of this books writing, they were an affordable option for many people. People who enjoy shopping at Bluewater or having a drink at the Harvester... People who are living perfectly content and full lives... I'm not sure what Sinclair thinks those people should be doing instead - but he certainly doesn't like the lifestyle they've chosen. (I get the feeling that if they all started becoming scholars of Samuel Palmer and Eric Gill, Sinclair would find a more obscure artist to love (can't have the same tastes as the masses...))Other reviewers have suggested taking breaks during this book. I think this is very wise. Reading this book has put me off reading any other Iain Sinclair books, which is probably my loss... but 537 pages of culturally elite worthiness is just too much in one go."}, {"userName": "John Mellby", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/5007546-john-mellby", "userReview": "I like reading about London and I so wanted to like this book. But I had to give up, about 1/3 way through.Iain Sinclair's writing is wonderful and evocative. He conjures up beautiful imagery and I cannot possibly understand. He doesn't write in sentences but phrases. And sadly those phrases include references to places, people, and bits on London trivia that I, as an American, can't understand.I read a lot of books about London and watch British TV but these references are so specific to London that they mean nothing to me (maybe nothing to anyone outside a Londoner) and so large swaths of the books are meaningless."}, {"userName": "Lysergius", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/5905580-lysergius", "userReview": "Ah, my two betes noirs, the Millennium Dome and the M25. Sinclair and his buddies set out to walk the M25 in those dark days before the Millennium. What they find on their circumnavigation is a damning indictment of Thatcherism and its successor Blairism. Mark my words no one does shithole like the Brits and this particular zone is as blighted and as exploited as it gets. From the rows of Barret boxes to the celebrity mansions it sucks!That being said Sinclair tells a wonderful tale covering not just the space around the M25 but also the time(s) in is located in. There is a wealth of historical references, arcana and down right weirdness going on here. A great read."}, {"userName": "Angela Reeves", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/40536040-angela-reeves", "userReview": "total rubbish"}, {"userName": "Thomas", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/52482799-thomas", "userReview": "In a Lonely Planet age there is need and space for a book like London Orbital, a tour guide of the M25 motorway around London in the most meticulous, often ponderous prose, full of dark pessimism and end of the world imagery. This is not a read for the easily distracted or faint-hearted. Its anal attention to detail, its insistence on superficially boring detail, its lack of a narrator who wishes to impose himself as a force of human nature, the shopping malls, building sites, graveyards, insane asylums and disused hospitals - there are times when even the most determined reader has to ask himself why he would continue, and why the author would continue walking around such apocalyptic wastelands.But if you give London Orbital time, you start to see the intentions and the purpose. You start to admire the desire to find interest in nothing, in ignoring even the most alternative of travel guides. More importantly, you start to realise Sinclair's fascination with the stories he unearths and realise the importance of unearthing such vital, living events on the outskirts of one of histories greatest metropolis. This is not an ode to the suburbs, or a critique of it. It is an attempt to link myth to the modern, the motorway to the past, England's hidden worlds with the forces that threaten to cover them with conformity and sameness.His go to references are found in the world of art and language. The imagery of HG Wells, for example, plays a big role in his depiction of the orbital world, ruins and destruction and the threat of loss. Stoker's Dracula is another, the seminal outsider invader. There is something malicious, encroaching, about the world around London as it levels and destroys the land and the life beneath it - birds killed on the road, villages erased to make airports, the continual failure of the Green Belt to rescue some of that land from the motorways clutches.Sinclair rails for 500 plus pages against American influences in real estate and shopping cities, against Thatcher and Blair, against pleasure seekers in times gone past looking for a city escape, against England's criminal hospitals and our treatment of the mentally ill.There is very little humour in here. But there is colour, art, rescue attempts, seeping through. He searches for Paradise Gardens, for green spaces in the concrete world. He describes the motorway even with loving descriptive prose, as a changing artery around London lit by sunsets and views from bridges, by drug dealers, road rage victims, commuters and artists. He looks at the inspiration on photography, painting, the written word, architecture, performance art, concept art and much more. He looks back at the mysticism and symbolism of England's past and tries to link it all together in a way that satisfies his longing for meaning.The name dropping becomes tiring. Sinclair often writes about people with the assumption that you know who he's talking about, an irritating tendency, but then it would be impossible to know it all because this is a spilling out, a flood, of his knowledge, every story, anecdote, musing that he discovered on his journey. Along the way it might have been helpful, from a human empathy perspective, to give the reader a little more of him as a person, Sinclair and the various hikers who accompany him. A little more of the physical journey, the blisters, the cafes, the act of walking. But that's not his intention. This is not a normal pilgrimage, and it's not described as such. And it's not a travel guide. Whether or not London Orbital is something you can enjoy, what it is is something very, drastically different - a new space between non-fiction and storytelling about a world that is so intrinsically and vitally part of our modern make-up but which we are too uninterested to take a deeper look at. 8"}, {"userName": "Heather", "userReviewDate": "Jan 20, 2012", "userURL": "http://www.goodreads.com/user/show/1757736-heather", "userReview": "It took me about three tries before I properly got into London Orbital, mostly due to my own state of mind but also because Sinclair's writing, which is sometimes a rush of names (of people, of places) took me a while to get used to. It's a psychogeographical enterprise, an attempt to record the effects of place on life, the way the city changes: \"Outsiders are struck by effects, shifts, that locals walking their animals, or collecting their kids from a fenced-off school, take for granted. There is a mystery at the edge of great conurbations; in the light, in places travellers have passed through for centuries\" (232). It's also a study of the liminal, the edge-places, what the city pushes out to the margins. It's based on \"tte belief that this nowhere, this edge, is the place that will offer fresh narratives\" (16). So what is on the fringes? Kennels, slaughterhouses, waste-treatment plants. 264 bridges that cross over the motorway. Secrets. Old government land. Industry or research too dirty or dangerous to be in the city, or needing the privacy of wooded land: gunpowder, bombs. Asylums, now empty, now being turned into apartments or bulldozed to make planned communities, suburbs. Canals, prompting Sinclair to quote snippets of Dickens. Houseboats with wood-stoves. The airport, \"the inscrutable geometry of Heathrow's terminal runways, hangars and car parks\" (228). At one point someone asks Sinclair what he's interested and his reply is \"poking about anywhere that wants to keep us out\" (459). In spite of/because of its denseness, Sinclair's style is appealing to me. I like how this book is full of lists, and I like how Sinclair has an eye for, to use his phrasing, \"the improvised beauty of the accidental\" (54). Like this:Dawn on a wet road. Travelling east into the rising sun; drowned fields, mountains of landfill, ancient firing ranges. Everything smudged and rubbed. With the M25 as your destination, Purfleet and Grays as staging posts. Bridge, river, oil storage tanks. The border chain of chalk quarries occupied by Lakeside, Thurrock.A high sierra of container units in rust colours and deep blues, chasms through which sunbeams splinter, wrecked double-decker buses with spider's-web windows. Junk yards with leashed dogs. The Beam rivulet and the sorry Ingrebourne meander through spoilt fields, beneath the elevated highway (a road on stilts). (46)"}, {"userName": "Ian Mapp", "userReviewDate": "Jan 03, 2014", "userURL": "http://www.goodreads.com/user/show/1598886-ian-mapp", "userReview": "Like no other book that I have ever read.I am walking the London Loop, which covers similar territory, so thought this would be an account of some of the places that I am likely to hit. However, it is not written like this.The author has the idea - walk the areas of the Capital where \"London runs out\". This is close to the M25. Its broken down into sections, working anti-clockwise. Sometimes he is joined by faces, such as Bill Drummond from KLF, other times its just him and an artist/photographer. Not that there are any pictures in the book.And then its a mish mash of recurring motifs - the dome, mental institutions, the m25 itself, gangsters. It reads very much like it was put together in stages, with no thought to previous sections. There is a lot of repetition and I am sure some themes are introduced as through the reader should know what he is referring to, when in reality, they have not cropped up before.But there are ideas here... and a lot of off them. Psychogeopgraphy looks an interesting way to travel new cities. There is even an iPhone application for it.A travel book like no other. Do I feel I know the outskirts of London any better - a little perhaps. Did the book interest, amuse and provide new ideas - definitely."}, {"userName": "Laura", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/24589943-laura", "userReview": "I started reading this book more than two years ago - it could have been five - put it down and picked it up again. it was worth the effort. I almost feel I did the walk with them. i enjoyed the sharp, unsentimental yet poetic narrative, shifting with the landscape, pulling at threads and teasing out the stories from the very edges of London. A phenomenal amount of work went into this book, it's dizzyingly dense in its references. sometimes it feels like trudging through mud, and the bleak landscape can be baffling, but sometimes there's an aha moment, where the threads float like gossamer and take flight above the landscape.I particularly enjoyed the dracula aha moment, the discovery of Carfax and the notion Stoker may have stood on that very site in creating his iconic story. overall, there's so many tantalising gems that make up the history of the m25, and it feels enriching to unearth some material from the layers, like an archaeological dig. the writing itself reveals the landscape, and the mood of its travelers and inhabitants, in a wonderfully wry and witty way, noting wherever threads intersect and drawing those threads together that are less obvious, to see what happens. it's dense reading but highly rewarding and really like nothing else I've read to date."}, {"userName": "Dovofthegalilee", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/5903731-dovofthegalilee", "userReview": "This was a book that was almost not read because of the difficulty it presented in getting into it. I pressed on and I found moments in it that I really liked which made me wonder why it didn't read well from the beginning. To me it had almost a Joycean feel to the confusion that was being presented. I would say that you have to have a really good grip on London environs, who's who in British persons and an appreciation for his style as a writer. Again there were times hat what he said resonated to me, I know for example what EastEnders is [ the tv soap] but if you don't catch all of his references the book struggles. I was surprised to see a book I had read in 2000 Rodinsky's Room to be a work that he co-authored. there are a number of references to this as well and without reading it the references are just hanging out there."}], "description": "Encircling London like a noose, the M25 is a road to nowhere, but when Iain Sinclair sets out to walk this asphalt loop - keeping within the 'acoustic footprints' - he is determined to find out where the journey will lead him. Stumbling upon converted asylums, industrial and retail parks, ring-fenced government institutions and lost villages, Sinclair discovers a Britain of the fringes, a landscape consumed by developers. London Orbital charts this extraordinary trek and round trip of the soul, revealing the country as you've never seen it before", "title": "London Orbital", "url": "https://www.goodreads.com/book/show/118186.London_Orbital", "average": 3.67, "cover": "https://images.gr-assets.com/books/1328032557l/118186.jpg", "reviews": 53, "authors": [{"url": "https://www.goodreads.com/author/show/6851.Iain_Sinclair", "name": "Iain Sinclair"}, {"url": "https://www.goodreads.com/author/show/5700515.Lain_Sinclair", "name": "Lain Sinclair"}], "type": ["Nonfiction", "Travel"], "outlinks": ["http://www.goodreads.com/book/show/118186.London_Orbital", "http://www.goodreads.com/book/show/19854468-london-orbital", "http://www.goodreads.com/book/show/819816.London_Orbital", "http://www.goodreads.com/book/show/118185.Lights_Out_for_the_Territory", "http://www.goodreads.com/book/show/2152486.Hackney_That_Rose_Red_Empire", "http://www.goodreads.com/book/show/933388.White_Chappell_Scarlet_Tracings", "http://www.goodreads.com/book/show/118193.Downriver", "http://www.goodreads.com/book/show/118192.Dining_on_Stones"]}