{"ratings": 50, "userreviews": [{"userName": "Liviu", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/1229019-liviu", "userReview": "For my just completed week-long travel to the Benelux (Netherlands, Belgium, Luxembourg) I looked through all the available guides and I finally decided on this one and the analog for Belgium and Luxembourg as they fit best my needs - as usual Rick Steeves' guides are the most entertaining in writing style but they have a potentially major flaw as they talk at length about what the authors feel are the highlights and their choices may not coincide with yours - when they do like in Spain their guide is best but when they don't like in Switzerland or here I look for other optionsWhile drier in style, the Lonely Planet was excellent as it suggested a few places I may not have considered otherwise - they have a top 10 attractions in the Netherlands and top 15 in the Belgium/Luxembourg - to start the guides, they have great geographical orientation, both with country maps, regional maps and city maps including an Amsterdam pullout and they talk about many, many places - yes shorter than the fewer places described in other guides, but enough to decide if you are interested further and today with the world on the cell phone, what is needed is awareness of a place as afterwards you can research it at leisure anywhere; the maps with numbered highlights proved extremely useful in the cities I visited (Rotterdam and Luxembourg especially as there just walking around the city and taking in the super modernistic buildings in Rotterdam and the two tiered old city of Luxembourg is an experience in itself, but also Brugge - here the whole old city is an experience so it doesn't really matter where you go, Hague - here the old city is smaller so easy to see, Utrecht and Amsterdam - this one didn't really work out for me, as big cities go being far away from Milan or Madrid, while from its museums, the Van Gogh is special but Rijksmuseum pales compared to Prado or Uffizi, though the maritime museum is cool as it has a real VOC ship one can visit - the collection itself is ok, the naval Museum of Madrid better, but the VOC ship and getting a feel for how the long voyages in the 1600-1700's went are worth the price)The other highlight of the 2 guides discussed here was the smaller places - especially for Belgium and its Ardennes region and Luxembourg and the Moselle valley - due to lack of time I didn't visit all I planned but a castle (Bouillon), a scenic drive and a few picturesque villages were all found out from the guide - and then there was the Waterloo museum and battlefield with a good description in the Belgium book (this one I would have visited without any guide mentioning it of course) Overall - excellent for my needs as they have shorter description of many places, good opening highlights and maps"}, {"userName": "Kirsty", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/56491386-kirsty", "userReview": "As ever with the Lonely Planet guides, this was splendid. It gave a wealth of things to do in Amsterdam, where we were based on our holiday, and also gave plenty of ideas for day trips in other districts. We plumped for a day in Rotterdam, and found the travel information in the book helpful. I'll always go for Lonely Planet guides; yes, they may be a little more expensive than the usual travel books, but there's a reason they're rated as the best in the world."}, {"userName": "Juliana", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/8795844-juliana", "userReview": "I used to read Lonely Planet guidebooks from the first page to the last. This time this wasn't the case. The suggestions seemed rather boring to me, there wasn't the same feeling about it that you just have to look up anything and know where to go...I felt a bit lost. And bought another tourist guide.I liked the chapter on Dutch Lifestyle. And maybe next time in the Netherlands, in another part of the country, the guide might still come in handy."}, {"userName": "Ietrio", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/40137479-ietrio", "userReview": "A tourist guide just like any other. A perishable list of phones and addresses and not much more."}, {"userName": "Johanne", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/6007226-johanne", "userReview": "Useful but the ebook was a little clunky to use"}], "description": "Lonely Planet: The world's leading travel guide publisher\nLonely Planet The Netherlands\n is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Stroll the intricate canals of Amsterdam, revel in Utrecht's nightlife or stand amid acres of flowering colour in South Holland; all with your trusted travel companion. Get to the heart of the Netherlands and begin your journey now!Inside Lonely Planet The Netherlands Travel Guide:Colour maps and images throughoutHighlights and itineraries help you tailor your trip to your personal needs and interestsInsider tips to save time and money and get around like a local, avoiding crowds and trouble spotsEssential info at your fingertips - hours of operation, phone numbers, websites, transit tips, pricesHonest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks missCultural insights give you a richer, more rewarding travel experience - history, Dutch art, architecture, landscape, cuisine, entertainment, shopping, cycling and moreFree, convenient pull-out Amsterdam map (included in print version), plus over 30 mapsCovers Amsterdam, Haarlem, North Holland, Utrecht, Rotterdam, South Holland, Friesland, Central Netherlands, Maastricht and moreThe Perfect Choice: \nLonely Planet The Netherlands\n , our most comprehensive guide to the Netherlands, is perfect for both exploring top sights and taking roads less travelled.Looking for a guide focused on Amsterdam? Check out \nLonely Planet Amsterdam\n for a comprehensive look at all the city has to offer; or \nPocket Amsterdam,\n a handy-sized guide focused on the can't-miss sights for a quick city visit.Looking for more extensive coverage? Check out Lonely Planet Western Europe guide for a comprehensive look at all the region has to offer.Authors: Written and researched by Lonely Planet.About Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves.0207Lonely Planet The Netherlands is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Stroll the intricate canals of Amsterdam, revel in Utrecht's nightlife or stand amid acres of flowering colour in South Holland; all with your trusted travel companion.0401http://media.lonelyplanet.com/onix-fe... Planet0101GOODREPRUSLonely Planet Global Limitedhttp://www.lonelyplanet.comAU04201605... AE AF AG AI AL AM AO AQ AR AS AT AU AW AX AZ BA BB BD BE BF BG BH BI BJ BL BM BN BO BQ BR BS BT BV BW BY BZ CA CC CD CF CG CH CI CK CL CM CN CO CR CU CV CW CX CY CZ DE DJ DK DM DO DZ EC EE EG EH ER ES ET FI FJ FK FM FO FR GA GB GD GE GF GG GH GI GL GM GN GP GQ GR GS GT GU GW GY HK HM HN HR HT HU ID IE IL IM IN IO IQ IR IS IT JE JM JO JP KE KG KH KI KM KN KP KR KW KY KZ LA LB LC LI LK LR LS LT LU LV LY MA MC MD ME MF MG MH MK ML MM MN MO MP MQ MR MS MT MU MV MW MX MY MZ NA NC NE NF NG NI NL NO NP NR NU NZ OM PA PE PF PG PH PK PL PM PN PR PS PT PW PY QA RE RO RS RU RW SA SB SC SD SE SG SH SI SJ SK SL SM SN SO SR SS ST SV SX SY SZ TC TD TF TG TH TJ TK TL TM TN TO TR TT TV TW TZ UA UG UM US UY UZ VA VC VE VG VI VN VU WF WS YE YT ZA ZM ZW017.76in025.04in030.67in08.796lb01197mm02128mm0317mm08.361kg03159781741798951BCLONELY PLANET (AMERICAS)US20360102Lonely PlanetTrade24.99USDUSZ", "title": "Lonely Planet The Netherlands", "url": "http://www.goodreads.com/book/show/26698359-lonely-planet-the-netherlands", "average": 3.68, "cover": "https://images.gr-assets.com/books/1445191905l/26698359.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/6980602.Lonely_Planet", "name": "Lonely Planet"}], "type": ["Travel", "Nonfiction", "Reference", "Own"], "outlinks": ["http://www.goodreads.com/book/show/26698359-lonely-planet-the-netherlands", "http://www.goodreads.com/book/show/29932118-lonely-planet-the-netherlands", "http://www.goodreads.com/book/show/31031.Japan", "http://www.goodreads.com/book/show/2042008.The_Africa_Book", "http://www.goodreads.com/book/show/12169184-5-of-usa-s-best-trips", "http://www.goodreads.com/book/show/22246008-lonely-planet-the-world", "http://www.goodreads.com/book/show/22351653-secret-europe"]}