{"ratings": 353, "userreviews": [{"userName": "Larry Bassett", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/3816725-larry-bassett", "userReview": "[It was to be our last calm. One of the biggest battles of the Vietnam War was about to be joined. By dawn of the third day, most of the marines of Charlie and Delta companies would be dead or wounded.  (hide spoiler)]"}, {"userName": "Jeanette", "userReviewDate": "Jun 27, 2014", "userURL": "http://www.goodreads.com/user/show/11869072-jeanette", "userReview": "Its style is hard to get into, as this author is not a writer. Most of it seems in a voice rather detached and stilted, from decades later than the events. And that aspect and affect dropped my interest considerably by the half way point of this book. Still, it is a very easy read, although I found that I could not linger in the Loon stand. Being of that era and prime year for nearly every male of my age that I knew to be drafted, I found some of his judgments and conclusions about who went and how they went by the drafting process completely off. In fact, I do not think it was a war fought by just the lower classes of American males at all. Now, with the volunteer army it is actually far more so a lower economic class input. Lower educational input, as well. Where I was many, many higher class or solidly middle class guys went. Did they school for awhile to think about it? Sure, they did. But did they go to Canada or have someone pay a draft board? No. They heard JFK's voice about giving back, not asking- for one thing. But beyond all that, this author was so young and is not any longer. And the letters are great but the rest is just a gloss and jump report. He has buried much of the prime thoughts and feelings I would have liked to find more of in this book. Except about Sid- and I find that a clue to how really deep he has buried the rest. His battle copy, assignment location and unit is excellent. His was a service much more toward the first than the last of this War. Yet his homecoming chapter read like a newspaper article, very detached. The soldiers coming home a couple of years later were treated far worse than just the neglect to acknowledgment or expressed appreciation or parade or handshake that he mentions. Traumatized men were spit on and called names in the airports in CA every single day. One of my friends became a type of greeter to become a barrier to this. Vietnam was a mistake built on idealism rah-rah. Today's idealism going the opposite way is worse and will lead to worse. Peace comes out of showing strength, not demonstrating apology and weakness. Human nature is pragmatic and will quickly fill any voids of power- both physical and economic."}, {"userName": "Eric_W", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/1711431-eric-w", "userReview": "A disappointing purchase and way over-priced.One of the really positive benefits of the self-publishing revolution has been the number of memoirs being published. Obviously many not polished, but interesting and of considerable historical value. Some are very good, indeed. Others less so. This one felt like a book one expects to have been self published; I looked, and was surprised to see the Random House imprint.Mclean, who was at Andover with George Bush, (of National Guard and cocaine fame,) struggled through Andover and when he wasn’t accepted by Harvard or Yale, or Stanford, was at a loss as to what to do. So he enlisted in the Marines. He was born just a month before me, so the dates brought back many memories. Getting out of Parris Island, he was sent to California for a few months to learn supply, much to his relief, but everyone in the Marines eventually wound up in Vietnam, and, sure enough, his orders for that quagmire came through.Mclean was urged to write this memoir when his wife discovered the letters he had written home over the months he was in Vietnam. The very short section, barely a couple chapters, dealing with the horrific, if futile, experience on LZ Loon, was seemingly thrown in almost as an afterthought, rather than the highpoint (or low-) of his experience, his life even. Clearly the experience of writing for him personally must have been necessary and cathartic, I hope. There is a good story in here and perhaps with a good editor, it could have been teased out. It lacked focus and at times wandered between being critical and stand-up-salute-your-flag bravado. Finding a theme was difficult. There are many other Vietnam memoirs out there that I feel are much better. And I got a little tired of hearing that Sid was dead six weeks, two days, several weeks, later. Once has devastating impact. By the fourth time, it brought a yawn."}, {"userName": "Scott Whitmore", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/8239695-scott-whitmore", "userReview": "Having finished Loon: A Marine Story by Jack McLean just a few hours ago, I was frankly at a loss as to how to start this review. Adjectives such as “exceptional” and “sublime” are accurate enough, and yet somehow do not convey the depth of my enjoyment and admiration for this memoir of a young man who left a life of comfort and privilege to enlist in the United States Marine Corps at a time when combat duty in Vietnam was all but certain.Finally, I decided to rely on my own years in uniform and go with what was always the topmost ranking a Sailor could achieve in any endeavor or performance review: Outstanding. Loon is simply outstanding.Jack McLean had a picture-perfect, upper-middle-class American childhood and adolescence. Born in the earliest wave of the post-WWII baby boom, he lived in the suburbs of New York City, learned to swim at the Y and had a paper route. McLean followed his father by attending prep school at Phillips Academy, with future President George W. Bush as a fellow student. But McLean struggled at Phillips and five years later when graduation finally came into sight he found colleges less than interested in him. That was fair, though, as he found himself less than interested in attending college right away. There was more to that decision than simply taking time off from school. There would be two issues that I would have to face should I decide not to go to college. The year was 1966. There was a draft. If you were eighteen or older, male, and of sound body and mind, it was your duty—indeed it was the law—to serve the country in the military for a minimum of two years. Second, there were my parents. I was certain that their vision for me included college—any college.— Mclean, Jack (2009-05-07). Loon: A Marine Story (pp. 15-16). Random House Publishing Group. Kindle Edition.With engaging and fluid prose, McLean brings the reader along step-for-step on his journey to becoming a Marine, from enlisting through basic training at the famed Marine Corps Recruit Depot at Parris Island and then on to Vietnam where he survived a bitter three-day fight with the North Vietnamese Army at Landing Zone (LZ) Loon. Throughout the narrative the author provides historical context for background, such as the fact he was manning the perimeter at LZ Loon the same day Bobby Kennedy was shot in Los Angeles:Robert F. Kennedy was forty-two years old. He died the following morning, on June 6, 1968. Those of us in Charlie Company who survived LZ Loon would not hear the news for another week.Many of us died that day as well.— Mclean, Jack (2009-05-07). Loon: A Marine Story (p. 2). Random House Publishing Group. Kindle Edition.Mere weeks after surviving the fight at Loon, McLean is on an airplane for home, his tour of duty complete. Just months after Loon, McLean began his freshman year at Harvard, in the process becoming the first Vietnam veteran to attend that prestigious school. Loon isn’t a military history of a battle; the details of the three-day fight at LZ Loon are vivid but somewhat unspecific — this reader suspects out of respect for the fallen. Instead, it is the story of how one boy became a Marine, and what that meant to him and about him. McLean’s journey started differently than the other men he served with in Charlie Company, but each man passed the same tests along the path to becoming a Marine and in doing so they became brothers. One year after my graduation from Parris Island, I was in Vietnam, fighting side by side with my marine brothers, when I was shot at with live ammo for the first time. During the ensuing battle and the others that followed, I was confused, disoriented, and scared to death—every time—but I was never alone. There was always another marine nearby. He also was confused, disoriented, scared to death—but he had me nearby. That was the way it worked in the Marine Corps. Together we’d figure something out. — Mclean, Jack (2009-05-07). Loon: A Marine Story (p. 59). Random House Publishing Group. Kindle Edition.For more information on the author and his writing, visit his website."}, {"userName": "Nick Vanderwal", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/52139499-nick-vanderwal", "userReview": "I did not read this book in order to publish a critique on the author's literary style or lack thereof. I am completely baffled why anyone would bother to do that. I did read this book in order to gain a perspective on the author's experience. We are/were contemporaries. I wore a different uniform and was in a nearby country. I had high school friends, two very close, several just casually close who wore his uniform and were in the same area as the author was and during the same time frame. All of them made it back but not in the best of condition. One, at least, is now gone. One is still around. The rest are god knows where. I wanted to learn what I had missed and what they had not. The author did a fine job of relating some of that to me. Thank you very much for taking the time to tell you story."}, {"userName": "Brinn Colenda", "userReviewDate": "May 15, 2013", "userURL": "http://www.goodreads.com/user/show/16959649-brinn-colenda", "userReview": "Wow! I have seen a lot of war movies and read a lot of war books...Loon ranks up there with the very best.In 1967, Jack McLean enlisted in the Marines right out of a prestigious prep school rather than go to college. The book is about the path he took at the height of the Vietnam War which took him into combat as an infantryman. McLean is an articulate and perceptive writer (having later attended Harvard) and spins a great memoir. He captures the essence (and dissonance) of what the war was like \"at the pointy end of the spear,\" where so few of us have been. All of us can read about war as history-- McLean and his Marine brothers lived war. Casualties were not just nameless faces, they were his best friend Sid, or Tom, the ultra-cool guy that everybody wanted to be like, or so many members of his tight-knit group. The rest of us will never be able to comprehend that special, peculiar bond between combat veterans...He made me feel guilty about my missions flown from the relative safety of my air-conditioned cockpit, though that was not his point.If you are not interested in gritty details of life in the foxhole, don't read this. If you are looking for military history and realism at its finest, this book is a must-read."}, {"userName": "Laura", "userReviewDate": "Apr 27, 2009", "userURL": "http://www.goodreads.com/user/show/1453181-laura", "userReview": "McLean pulls you right into the jungles of Vietnam with his memoir. It is compelling, gripping and humbling to read of the horrors of a war that was played out by our young men. No matter what you think or thought of the Vietnam War, this is a must read. The only way to sum it up is to say thank you to McLean and all of the others that answered the call to duty."}, {"userName": "John Roy Dampier", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/77360185-john-roy-dampier", "userReview": "Agenda or just ignorant...\"Lém arrested Lieutenant Colonel Nguyen Tuan with his family and forced him to show them how to drive tanks.[6] When Lieutenant Colonel Tuan refused to cooperate, Lém killed Tuan, his wife and six children and his 80-year-old mother by cutting their throats. There was only one survivor, a seriously injured 10-year-old boy.[7]Lém was captured near a mass grave with 34 civilian bodies. Lém admitted that he was proud to carry out his unit leader's order to kill these people.[8] Having personally witnessed the murder of one of his officers along with that man's wife and three small children in cold blood,[citation needed] when Lém was captured and brought to him, General Loan summarily executed him using his sidearm\"This is just one of many instances that the author gets wrong. Some of his stories, according to his contemporaries I've spoken with, are entirely fabricated. He can't even get his facts about the men who served right and simply parrots the usual myths."}, {"userName": "Patty", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/64726791-patty", "userReview": "This was a fascinating and sometimes heartbreaking book. I was born in 1954, female and pretty sheltered but I did live through this time. I have a brother who is 6 years older and I can still remember the collective family sigh of relief when the draft #s were published in the paper and we all realized his was very high and he was relatively safe. Many thanks to the men and women who went to Vietnam and served. They were treated badly when they came home. Books like this help me understand that war and that time."}, {"userName": "Allan Macmanes", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/20141132-allan-macmanes", "userReview": "Great book This was a great book of a difficult time in USA history. A very good account of what it was like to grow up 18 years old in 1967. I would like to thank the author for his service (about 50 years) to late. God bless you and all who have served and will serve our country."}, {"userName": "Pat Appel", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/63023873-pat-appel", "userReview": "It brought back to many memoriesI come to realize that I was at Parris Island in the 3rd Bn the same time as Jack McLean. My tour in Vietnam paralleled his exactly. His description of Vietnam was exactly the way it was."}, {"userName": "greg mcqueen", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/43338246-greg-mcqueen", "userReview": "Incredible leYou will always wonder why me and not the other guy enjoyed the book temper fi, you kept me up all night"}, {"userName": "HERB ZALCMAN", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/57158381-herb-zalcman", "userReview": "Great Read.I was with 3rd battalion 9 th Marines. in Vietnam in August of 67. Great book as I can relate to the authenticity and accuracy of this book."}, {"userName": "Scottnshana", "userReviewDate": "Mar 09, 2014", "userURL": "http://www.goodreads.com/user/show/10270495-scottnshana", "userReview": "\"Loon\" is short, considering it's compilation of Viet Nam experience, conveyed initially in letters home that the author had let marinate for 35 years before typing up as memoir. It is a uniquely American story--from the privileged Baby Boomer adolescence through elite prep school, with station wagons and \"Leave it to Beaver\"--right up to the moment McLean opts to enlist in the Marine Corps. There he finds moral dilemmas and the \"cooperate and graduate\" socialization of Basic Training, as well as the trepidation/certainty about the future that arrived with graduating from Parris Island in the mid-60s. I liked the way the author interwove the events affecting the war from around the world (most notably Khe Sanh and LBJ's announcement that he wouldn't run in '68) into the narrative to show how circumstances outside his immediate perspective were influencing his experience at LZ Loon. The reader is treated to the standard features of this commonly-shared bildungsroman--the R&R to Singapore, the almost-tangible divide between himself and the college students he grew up with, and the culture shock (akin to getting off the bus at Basic) of leaving an air-conditioned 707 for the breath-sucking heat of Saigon; and that's good, because these facets are just about universal in Viet Nam narratives and we need to be reminded of that. What differentiates McLean's treatment of the topic, however, is his listing the names and circumstances of everyone in his Company killed at Loon, as well as his effort to describe the solid leadership his commanders provided to those besieged there. My only gripe about this book is the dearth of maps, but that's also a standard complaint I have lately. On the whole, I found \"Loon\" to be a good account and definitely a credit to the memory of the brothers-in-arms that Mr. McLean lost. I am also very pleased that books like this one and Karl Marlantes's recent works are now available to the generation that fought in Iraq and Afghanistan; we need them."}, {"userName": "Steve Woods", "userReviewDate": "May 01, 2012", "userURL": "http://www.goodreads.com/user/show/3688618-steve-woods", "userReview": "This is a very straightforward memoir by an infantry corporal. There are no histrionics but it has none the less impact for that, it's honesty carries it. The man was no doubt a matter of fact soldier who knew his craft and simply got on with it like so many I knew. There is no crying in the beer but reading between the lines, his tour of duty cost him as it did almost anyone who saw combat there. I did not serve in the area of the country where he saw his service though having spent time in those mountains some thirty years later my hat is off to the Marines who did. It is truly hard country and they were always contending with the NVA who were never slouches in the endeavor of soldiering hard. They were no doubt the best light infantry in the world at the time. Their length of service and depth of experience gave them that.This is a book I would be happy to give to teenagers to impart to them what those not much older than they lived through in service to their country. The Marines in I Corp particularly. It leaves much to the imagination but it's not hard to get the message. Particularly telling for me was his description of coming home, still matter of fact but his sense of betrayal comes through strongly. A measured man, a measured tale from a fellow traveler through war's grim trail."}, {"userName": "Eliza", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/3490134-eliza", "userReview": "8/9/2012: \"Loon\" is fascinating as much for what it DOESN'T tell as for what it does. McLean published this memoir in 2009, about his experiences as a U.S. Marine during the Vietnam War (1966-69). He says that he leaned heavily on letters he'd written home for a lot of the narrative--which makes sense, since he's writing 40 years after the events he describes. But there is so much he glosses over; while he marvels at the horror and terror and grief he experienced, and even gives some gory detail, he also seems oddly detached from the experience. Some of that can be chalked up to the passage of time--this all happened a long time ago--but he also plainly states that he buried this shit as deep as he could when he returned to civilian life, and he's not about to dredge it up now. Some can also be chalked up to the fact that McLean is not a writer--the writing is a bit stiff and stilted--and he never professes to be. But I do wish the memoir could seem to have been more cathartic, more therapeutic for him. (Who knows, maybe it was. But it doesn't sound like it was.) He manages to tell his story without letting it penetrate the defenses he's had to build up…which makes it almost, but in the end not quite, a satisfying memoir."}, {"userName": "Luke", "userReviewDate": "Aug 28, 2009", "userURL": "http://www.goodreads.com/user/show/1452964-luke", "userReview": "I really enjoyed Loon. It's a pretty typical memoir, told from the eyes of Jack McLean who was the first Vietnam veteran to attend Harvard after serving in Vietnam. It's a very well written book. It doesn't dwell on anything too long and does a great job of mixing informative back-story with compelling firsthand narrative. Many times, memoirs get bogged down in one area of the author's history that he really wants to explore, and consequentially the entirety of his reading audience is forced to explore it with him. Not so with Loon. McLean gives us enough of his backstory (before signing up with the Marines) to help us understand who he is and why he would leave a comfortable New England society to serve in an unpopular war, but he does so with a deft touch. Moving the story along with interesting stories of his tour and helpful contextual events to help the reader see the larger picture.Loon is a relatively short read and one that I would recommend to anyone interested in the Vietnam war and its effect on our young men.Thank you for taking the time to read my review."}, {"userName": "Sheila ", "userReviewDate": "May 19, 2009", "userURL": "http://www.goodreads.com/user/show/774914-sheila", "userReview": "An very well written look at the Vietnam war through the eyes on one young Marine. I was born in the late 1960's, so was just a baby and toddler during Vietnam, but I have always been interested in this time period and in this war. Mr. McLean's book gives an insider's look at one part of this war, and shows with honesty what life was like before, during and after this time. All of our veteran's from Vietnam deserve our honor and respect, something they were not given when they returned home years ago. And all of our young men and women who are currently fighting our wars overseas also deserve our honor and respect. Their daily life serving as a soldier, both the Vietnam soldiers and the men and women serving today, is so different and so far removed from what the average American is experiencing at any given time. We need to remember the sacrifices they made and are making, and the horrors that they faced and are still now facing. Thank you for fighting for our country, Corporal McLean."}, {"userName": "booksneedcaffeinetoo", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/45170883-booksneedcaffeinetoo", "userReview": "The Skinny:A book about a Marine fighting for his life during the Vietnam War.The Fat:This book was sad. It's about the Vietnam War, so many people died and the soldiers have to consistently fight for their lives. McLean started readers off right in the middle of the action before backtracking to tell people the how and why he was in Vietnam during the war. As many other readers will say, writing is not necessarily McLean's strong point. I had to read this book for class, and overall it wasn't a bad read. It provided an additional perspective to the war in Vietnam. (Side note: this book also pairs well with the documentary Two Days in October)Not my favorite memoir, but not my least favorite memoir either. I always feel bad for judging people writing their life stories, but for this book the writing felt detached. However, as I previously stated, it showed a unique perspective of the war and its lasting effects of soldiers. ***TRIGGER WARNINGS: war, death, prostitution"}, {"userName": "Jason", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/407066-jason", "userReview": "Jack McLean's Vietnam memoir looks at his tour as a Marine at the height of the America's involvement in the war. The book is from a fairly unique perspective; McLean enlisted after prep school, taking a route that most of his classmates avoided. McLean splits his time between introspection and full-on machismo. The former lends some poignant moments to the narrative, especially near the end, as he looks back at the emotional wounds. The latter — which pops up mostly when McLean writes about his unit's action at LZ Loon — takes the form of rattling James Patterson-esque chest beating. It almost seems like McLean's terseness in the prose reflects his surroundings; that doesn't make it any easier to read, though.The whole package works in the end, though, despite the shortcomings. It might not be as good as similar books by Tim O'Brien or Phil Caputo, but it's still a good effort overall."}, {"userName": "Su", "userReviewDate": "Aug 30, 2009", "userURL": "http://www.goodreads.com/user/show/1401235-su", "userReview": "I was fortunate to receive this book as a \"first reads\" and probably would not have picked this off the bookshelf.After finishing this book, I find myself wanting to discuss what the author so eloquently writes in the last chapter.I was old enough to know what the news told me about Viet Nam, but not really engaged in what was going on in 1968. Jack McLean's account of his experiences are heartfelt and gripping. Although his descrption of the battle at LZ Loon are realistically sickening, his narrative of his return home is sobering. I would highly recommend this book-especially for high school or college classes who would benefit from a first hand account of what it was to be a Marine in Viet Nam. Thank you Jack McLean for enlightening us."}, {"userName": "Walter Stevens", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/4063345-walter-stevens", "userReview": "It covers McLean's 2 years in the Marines (1 year in Vietnam), as well as a smattering about his schooling prior (Andover) and his entering Harvard after.The writing style isn't bad - it communicates his experiences well. Given the hints he drops about how it carried this history with him form any years, I expected some coverage of that, or some reflection on the experience beyond some hints of why it may have been not a great war for the US to have jumped into. Although perhaps this is because they were losing it, despite the economic and military muscle? I understand the lack of reflection during his description of the day-to-day experiences (many of which, besides the actual action, are fairly standard military training issues.Not bad though."}, {"userName": "Timothy Griffin", "userReviewDate": "Oct 14, 2011", "userURL": "http://www.goodreads.com/user/show/6663366-timothy-griffin", "userReview": "This is one of those books you can't put down once you start reading it. It is the moving and beautifully written true story of a young man who spent a year in Vietnam in 1968 and was forever changed by the experience. Jack McLean buried his time in the USMC in the back of his mind for more than thirty years before he was able to put pen to paper. Based on his recollections and on the many letters he wrote to his family, this story is as raw and fresh as if he had written it as soon as he returned home. If you like personal war memoirs, you will love this book; if you don't care for that genre, you would still love this very human story."}, {"userName": "Brett", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/4857926-brett", "userReview": "Having been raised by a USMC Vietnam veteran, I can candidly say that Loon is exceptionally well-written for a Marine. :) Jack McLean does a great job taking you with him from the privileged Andover Academy (where he was a classmate with George W. Bush) to his enlistment, training, and tour in Vietnam. I found his description of his return home to be most poignant. To borrow a line about Vietnam from \"We Were Soldiers,\" -- “a place our country does not remember, in a war it does not understand.” It is remarkable to note the difference between the receptions our Vietnam vets received compared to what our service members today are experiencing. We owe our Vietnam vets more."}, {"userName": "Elizabeth Kilbride", "userReviewDate": "Mar 20, 2012", "userURL": "http://www.goodreads.com/user/show/2905615-elizabeth-kilbride", "userReview": "\"Loon\" is a Marine's story about his life and military career in a place called Vietnam. From his humble beginnings to the jungle of Nam, Jack McLean's riveting memoir will open your eyes. Many of his Andover classmates took a different path in life as they avoided going to war but McLean came from stronger stock and enlisted in the Marine Corps. After thirty years of suppressing his emotions, McLean looks back at the invisible wounds he suffered and the end result is worth reading about in this Marine's story. It's understandable why this book was on the New York Times Best Selling list - it's the raw real deal type of novel."}, {"userName": "Warren", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/11629163-warren", "userReview": "Excellent book about the Vietnam era. Mr. McLean isn't sure he wants to go to college right out of high school in 1966 so he enlists in the USMC. His narration of that process, boot camp and his active duty assignments, including a terse engagement at Landing Zone Loon, and his discharge make for a great read. Mr. McLean does a superb job of being concise, 240 pages, precise yet conversational as he tells his story. I would recommend this book to anyone who was of draft age in the of the Vietnam era, whether you were in the military or not. I was in the military then; I loved the book."}, {"userName": "Larry Wilcox", "userReviewDate": "Apr 11, 2016", "userURL": "http://www.goodreads.com/user/show/5505054-larry-wilcox", "userReview": "Excellent book about a boy from the famous prep school, Andover Phillips, who graduates and instead of going to the preferred Ivy League Schools, joins the U. S. Marines and goes to Vietnam as a grunt during Vietnams Tet Offensive. Fascinating story of man leaving our dimension of somewhat tranquility, robotic and non emotional to the dimension of Vietnam of complex death, sacrifice and violence and then re-enters our robotic world where no one really cares where he has been or what he has been through. It is a book of beautiful understated emotions that we vets understand as a screaming child inside with no tangible audience or empathy. Emotional and good and accurate writing."}, {"userName": "Kwoomac", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/2076898-kwoomac", "userReview": "I thought I would like thias book more. true story of a boy (18 yrs old) who enlisted in the marine corps after highschool rather than enroll in college. Unusual choice since he went to Phillips Andover (same year as \"W\") I liked the whole bootcamp experience but his descriptions of being in-country were harder to follow. Also, having read Chickenhawk prior to this, I expected more. What was interesting was comparing this author's life with Chickenhawk author's life after Vietnam."}, {"userName": "Andy", "userReviewDate": "Sep 04, 2011", "userURL": "http://www.goodreads.com/user/show/5666767-andy", "userReview": "An intimate look into the Vietnam war experience of this atypical Marine. Jack McLean was unlike many of his fellow soldiers in that he had a privileged upbringing and was on-track to attend college (in fact attending Harvard after his service). It describes his background, training and pivots around the battle for LZ Loon (1968)where two companies fought a much larger force."}, {"userName": "Keith Raffel", "userReviewDate": "Dec 16, 2012", "userURL": "http://www.goodreads.com/user/show/4785562-keith-raffel", "userReview": "Written by a college classmate of mine (whom I didn't know in college and still don't). While the rest of us freshmen were finishing up our last two years of high school, the author was in the US Marines. While we worried about SAT scores and the prom, he was concerned with dead and wounded comrades in arms. An eye-opener for sure."}], "description": "“Kids like me didn’t go to Vietnam,” writes Jack McLean in his compulsively readable memoir. Raised in suburban New Jersey, he attended the Phillips Academy in Andover, MA, but decided to put college on hold. After graduation in the spring of 1966, faced with the mandatory military draft, he enlisted in the United States Marine Corps for a two-year stint. “Vietnam at the time was a country, and not yet a war,” he writes. It didn’t remain that way for long.A year later, after boot camp at Parris Island, South Carolina, and stateside duty in Barstow, California, the Vietnam War was reaching its peak. McLean, like most available Marines, was retrained at Camp Pendleton, California, and sent to Vietnam as a grunt to serve in an infantry company in the northernmost reaches of South Vietnam. McLean’s story climaxes with the horrific three-day Battle for Landing Zone Loon in June, 1968. Fought on a remote hill in the northwestern corner of South Vietnam, McLean bore witness to the horror of war and was forever changed. He returned home six weeks later to a country largely ambivalent to his service.Written with honesty and insight, Loon is a powerful coming-of-age portrait of a boy who bears witness to some of the most tumultuous events in our history, both in Vietnam and back home.", "title": "Loon: A Marine Story", "url": "http://www.goodreads.com/book/show/5624896-loon", "average": 4.07, "cover": "https://images.gr-assets.com/books/1320541596l/5624896.jpg", "reviews": 41, "authors": [{"url": "https://www.goodreads.com/author/show/1041009.Jack_McLean", "name": "Jack McLean"}], "type": ["War", "War", "History", "Biography", "Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/5624896-loon", "http://www.goodreads.com/book/show/8449823-loon", "http://www.goodreads.com/book/show/8468266-loon", "http://www.goodreads.com/book/show/6371238-the-compendium-of-nosh", "http://www.goodreads.com/book/show/18126990-loon", "http://www.goodreads.com/book/show/9447805-glasgow", "http://www.goodreads.com/book/show/21116299-hopeless-but-not-serious", "http://www.goodreads.com/book/show/4498635-hopeless-not-serious"]}