{"ratings": 31, "userreviews": [{"userName": "GONZA", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/3954160-gonza", "userReview": "I read many novels by Gérard de Villiers, whom I think is second only to Ian Fleming considering spying novels; SAS Malko Linge has been in my life since the beginning of my adolescence and gave me many insights about politics, history and sex. This novel anyway was a little bit too slow, not particularly brilliant and mostly boring because the plot was too linear: no double games and no counterespionage to talk of, so I was sad and disappointed, but it's just because as a constant reader I saw the best of Gérard de Villiers (R.I.P.) and it's not this novel.Ho letto tanti libri di questo autore, che ritengo secondo soltanto a Ian Fleming nel contesto dei libri di spionaggio; Sua Altezza Serenissima Malko Linge é nella mia vita praticamente dall'inizio della mia adolescenza e mi ha sempre fornito parecchie informazioni sulla politica, la storia e il sesso. Questo romanzo tuttavia é decisamente troppo lento e non particolarmente brillante, per dirla tutta: noioso perché la trama non prevedeva né doppi giochi né un controspionaggio che sia degno di nota quindi ci sono rimasta male e delusa, ma solo perché come fedele lettore ho giá visto il meglio di Gérard de Villiers (R.I.P.) e questo libro non ne fa parte.THANKS TO EDELWEISS AND VINTAGE CRIME/BLACK LIZARD FOR THE PREVIEW!"}, {"userName": "Viva", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/5639948-viva", "userReview": "The only thing I miss about the Cold War are Cold War spy stories and this one brings it back. Not a historical CW novel but a modern day one of the Brits and CIA against Putin's Russia. This is a Malko Linge book. I'd never read any of this series before but it appears that he is not only an Austrian nobleman but a CIA agent too. This book is only 242 pages long and a quick read. It's got an uncomplicated plot with a satisfying ending. Perfect for a plane ride or something to while away a few hours. Almost like one of those Leslie Charteris Saint books. By the way, this is translated from French and the translation is seamless.Edit: I just read the frontispiece. It appears that the author (now deceased) has written over 200 Malko Linge novels. It's a whole series of escapist and easy to read spy stories! I liked this book and I'll probably try to find and read any of the other translated ones in this series.I got this book as a free review copy."}, {"userName": "Ross", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/2856925-ross", "userReview": "Fast paced. James Bond type of thriller. Vivid and a bit hmm \"baudy\". I enjoyed the book and plan to read another \"Malko\" novel by de Villiers."}, {"userName": "Matthew", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/12181615-matthew", "userReview": "another fast-paced thriller from de villiers."}, {"userName": "Alison", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/5127193-alison", "userReview": "I love Russian spy stuff. I can't get enough."}], "description": "A sexy, high-stakes thriller in which Malko Linge must choose between his sense of duty and his sense of honor.  At a benefit dinner in Monaco, Austrian playboy and CIA freelancer Malko Linge meets an intriguing woman, Zhanna Khrenkov, who has an unusual proposal. She will disclose everything she knows about her husband Alexei’s business, provided Malko kills Alexei’s beautiful, young British mistress. Appalled, he refuses, but then Zhanna reveals that her husband runs a ring of Russian sleeper spies operating in the United States. Naturally, Malko’s CIA handlers would love to have this information, but he feels uncomfortable killing anyone in cold blood—especially a beautiful woman.  Traveling from Vienna to London to Moscow and back, aided by his former CIA handler and sometime-lover Gwyneth Robertson, Malko strives to avoid the crosshairs of deadly assassins and—almost as dangerous—jealous lovers.", "title": "Lord of the Swallows: A Malko Linge Novel\n      \n          (Malko Linge #4)", "url": "http://www.goodreads.com/book/show/25937913-lord-of-the-swallows", "average": 3.71, "cover": "https://images.gr-assets.com/books/1453057710l/25937913.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/26376.G_rard_de_Villiers", "name": "Gérard de Villiers"}], "type": ["Thriller", "European Literature"], "outlinks": ["http://www.goodreads.com/book/show/25937913-lord-of-the-swallows", "http://www.goodreads.com/book/show/25893406-lord-of-the-swallows", "http://www.goodreads.com/book/show/28966768-lord-of-the-swallows", "http://www.goodreads.com/book/show/21481547-the-madmen-of-benghazi", "http://www.goodreads.com/book/show/22522728-chaos-in-kabul", "http://www.goodreads.com/book/show/2353521.SAS_Istanbul", "http://www.goodreads.com/book/show/9003474-sas-contre-c-i-a", "http://www.goodreads.com/book/show/23308437-revenge-of-the-kremlin"]}