{"ratings": 1481, "userreviews": [{"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "*Η εκφυλιστική ψυχεδέλεια του μυαλού*Παγκόσμια κλασικό,γοτθικό μυθιστόρημα τρόμου και σκοτεινής αλήθειας. Σατανικές αναπνοές ζοφερές και ζωογόνες. Οράματα. Παραισθήσεις. Σχιζοφρενικά δισυπόστατη παρουσία. Δολοφονίες. Κακία. Εκδίκηση παραφροσύνης. Λαγνεία. Ηδονιστική μανία. Κολασμένα συγγενικά δράματα. Τραγικές πεποιθήσεις και λεηλασίες ψυχών και σωμάτων. Όλα όσα χρειάζονται για να συντάξουμε σωστά ενα εκκλησιαστικό λεξιλόγιο απολύτως απαραίτητο για την αφήγηση μιας παραληρηματικής ιστορίας σατανικών αποχρώσεων πιθανώς, κάποτε στις αρχές του 19ου αιώνα,ίσως και πιο παλιά... Σε κάποιο μοναστήρι καπουτσίνων μοναχών,αρχίζει και τελειώνει η αφηγηματική ιστορία της ζωής του αδελφού Μεντάρ. Μια πορεία μέσα απο ανυπέρβλητα κολασμένα πάθη. Ιερόσυλη λαγνεία. Πόθους παραφροσύνης και εξακολουθητικής απόγνωσης. Μάχες ανάμεσα σε Καλό και Κακό με αποτελέσματα αδιανόητα και εκφυλιστικά καθώς τα δίπολα των αντιθέσεων δεν χαρακτηρίζονται ποτέ απο τα ιδανικά που εκπροσωπούν. Αιώνιος ανταγωνιστής και πρωταγωνιστής στο σκοτάδι αυτής της ανάγνωσης ειναι ο Σατανάς. Εξειδικευμένο το κακό που προσφέρει πάντα,μα τόσο δελεαστικό και οξύμωρο που γεννάει αμφιβολίες σχετικά με την αίσθηση του εξαγνισμού. Αναφορικά με την ευδαιμονία και την απόλαυση της ανθρώπινης ερωτικής λαγνείας προφανώς προεξάρχοντα ρόλο κατέχουν τα απαγορευμένα μυστικά και τα κρυμμένα ελιξίρια του μυαλού τα οποία με μια αποκαθηλωμένη θεϊκή επιτήδευση θεωρούνται \"διαβολικά αμαρτωλές ασθένειες\". Επομένως,ο αδελφός Μεντάρ που πάσχει απο διανοητική ανάστατωση σχιζοφρενικής διαταραχής-και κανείς δεν μπορεί να γνωρίζει τι συμβαίνει μέσα στο μυαλό του που παραληρεί μέσα στις ψευδαισθήσεις-είναι σύμφωνα με την εποχή και την επιστημονική γνώση ένας \"δαιμονισμένος μοναχός\". Ο Ε. Τ. Α. Χόφμαν γράφει αριστουργηματικά και φτάνει ως εκεί που χρειάζεται για να πάρει ο ο αναγνώστης τα μηνύματα και τα νοήματα του \"πειρασμού\"και της \"δεύτερης φωνής\" του υποσυνείδητου της ανθρώπινης οντότητας. Έχει μια σφοδρή δυναμική να κατευθύνει τα συναισθήματα του αναγνώστη προς τα εκεί που τον οδηγεί η συλλογιστική του ικανότητα και η γενικότερη στάση ζωής του. Επομένως οι απαντήσεις που τεκμαίρονται απο αιώνια ερωτήματα μπαίνουν σε μια εντελώς προσωπική αντιληπτική διάσταση. Παραδοχή και δέσμευση προσωπικών αξιών και ιδεατών,ηθικής και πίστης, απλώνονται σαν ελιξίρια σκέψης,με πολύ ακριβά τιμήματα ή με εκπτωτικές προσφορές. Και φυσικά υπάρχει άπλετη ποικιλία συλλογιστικών προϊόντων.Εξαργυρώστε χωρί φόβο σε θεούς και δαίμονες!![Αντιστρόφως ανάλογες έννοιες]. Καλή ανάγνωση!!Πολλούς ασπασμούς!!ΥΣ. *Είναι επιεικώς απαράδεκτο τέτοια λογοτεχνικά διαμάντια να μην ειναι διαθεσιμα πλέον!!"}, {"userName": "Nickolas the Kid", "userReviewDate": "Dec 27, 2016", "userURL": "http://www.goodreads.com/user/show/28908169-nickolas-the-kid", "userReview": "Το βιβλίο αυτό είναι ένα παζλ… Ο ΕΤΑ Χόφμαν ρίχνει μπροστά στον αναγνώστη όλα τα μικρά κομμάτια και τον καλεί να τα ενώσει έτσι ώστε να του αποκαλυφθεί ένα Σατανικό Πορτραίτο αλλά και να αισθανθεί τον εξαγνισμό… Η ιστορία του αδελφού Μενταρ βαδίζει πάνω στα χνάρια του κλασικού γοτθικού μυθιστορήματος. Απαγορευμένη γνώση, καταραμένοι χαρακτήρες, ανομολόγητα ερωτικά πάθη και φυσικά η αέναη μάχη καλού-κακού. Η ιστορία όλη ιστορία είναι γραμμένη υπό μορφή ημερολογίου κάτι το οποίο εξηγεί ο Χόφμαν στις τελευταίες σελίδες του μυθιστορήματος.Επίσης ο Χόφμαν καταπιάνεται και με ένα θέμα με το οποίο έχουν ασχοληθεί κατά καιρούς μεγάλοι συγγραφείς όπως ο Πόου, ο Ντοστογιέφσκι και ο Σαραμάγκου. Το θέμα του σωσία. Ο άνθρωπος που διαλέγουμε να είμαστε, φαίνεται πως αυτόματα δημιουργεί στο νου μας, έναν σκοτεινό διπλό εαυτό, τον άνθρωπο που δεν θέλουμε να είμαστε. Η σκιερή φιγούρα που μας ακολουθεί, σε όλη μας την ζωή.. Μια προσωπικότητα που αποτέλεσε το έναυσμα για το ξεκίνημα της Ψυχαναλυτικής Θεωρίας του Σιγμούνδου Φρόυντ. Ο διπλός εαυτός έχει γίνει μια εικόνα του τρόμου, όπως ακριβώς, μετά την κατάρρευση της θρησκείας τους, οι θεοί μετατρέπονται σε δαίμονες.Ο συγγραφέας εμβαθύνει μέχρι εκεί που πρέπει. Τις τελικές απαντήσεις θα τις δώσει ο ίδιος ο αναγνώστης. Ακόμα και στον καταραμένο έρωτα του Μενταρ με την Ορέλια ο αναγνώστης θα κληθεί να αντιμετωπίσει δυο αρχέγονους φόβους που προχωράν παράλληλα από την απαρχή του κόσμου…Εν τέλει το βιβλίο είναι ένα αριστούργημα το οποίο δεν υστερεί ούτε στον τρόμο. Πολλές φορές τα σκοτεινά μπουντρούμια με τις σατανικές παρουσίες κάνουν το γράψιμο του Χόφμαν ανατριχιαστικό.Απλά 5/5…ΥΓ1: Οι εκδόσεις «Γλάρος» σε καμιά περίπτωση δεν σεβάστηκαν το αριστούργημα.ΥΓ2: Υπάρχουν αναφορές στο Καλόγερο του Λούις, τον Μέλμοθ του Ματσουρίν και φυσικά στις ιστορίες του Αγίου Αντωνίου, του αγίου που αντιμετώπισε τους τεράστιους πειρασμούς και αντιστάθηκε με αντάλλαγμα το είναι του…"}, {"userName": "Matt", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/16077597-matt", "userReview": "This is the life story of the Capuchin monk Medardus, written by his own hand. When exactly the story is set is not told, probably sometime in the early 18th century. In his monastery Medardus finds a mystical bottle that contains the titular elixir of the Devil. I think I don't say too much when I tell that he takes a sip from that bottle. His further life is filled with visions, insanity, murder, sin, wickedness, lust, repentance and all of the rest the ecclesiastical vocabulary has to offer. It's not always easy for the reader to decide what is real and what only happens in the mind of the monk, because there are auditory and visual hallucinations galore in this novel. It's obviously the author's intention to leave the reader in the dark about this until the end. While reading I assumed that Medardus suffers from a degenerative mental disorder, probably something from the broad spectrum of schizophrenia. Those diseases were still unknown at the time the story is set, and were attributed to the temptations of the eternal adversary, a.k.a. the Devil. For the author E.T.A. Hoffmann however, the field of psychiatry was apparently not unknown. Therefore the scenes in which the monk goes mad belong to the strongest ones in the book. Not that strong was the unnecessary complex history of the family. Even in the end I wasn't fully able to comprehend it. Also the somewhat complicated sentence structure was something that bothered me here and there. Basically I have nothing against long sentences as long as they flow nicely which unfortunately they didn't in this case. The book was published in 1815 and I think the early 19th century German fits the rather dark story pretty well. All in all I found the book too long, but I never meant to abandon it. Is it worth reading? Yes; but with some reservations.Free version available on zeno.org\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Diana", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/4032520-diana", "userReview": "Difficult to summarise but a very fast read, The Devil's Elixirs is a psychedelic novel of the 19th century with all the elements of the Gothic genre: sinful monks, damesels in distress, madness, mystery and supernatural elements. This is the best book I've read in a while and one I'd like to read again in the future."}, {"userName": "Fernando", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/7665532-fernando", "userReview": "E.T.A. Hoffmann es considerado uno de los iniciadores del movimiento romantico en Alemania y en el mundo ya que fue en este país donde se gestó el Romanticismo y después fue abarcando a otros como Inglaterra, Francia, Rusia, Italia y Estados Unidos. El Romanticismo tuvo su explendor entre la segunda mitad y el final del siglo XVIII y todo el siglo XIX hasta la irrupción del Realismo en Francia, de la mano de Balzac, Flaubert, Stendhal junto con Zolá y De Maupassant. En Rusia tuvo su auge con Dostoievski, pero el Realismo será tema de otra reseña.Volviendo a Alemania, fueron Hoffmann, Friedrich Schiller y sobre todo el gran Wolfgang von Goethe los encargados de labrar con letras de oro las grandes novelas y cuentos románticos, acompañados de esa corriente interna que se llamó “Sturm und Drang” (tormenta e ímpetu) con el desdichado Werther a la cabeza.Una de las características principales que definen a Hoffmann fue la de establecer en sus novelas un tópico muy caro a mis sentimientos y que es la temática del doble, que además fue uno de los condimentos más utilizados por los románticos, dado que la dualidad es parte casi intrínseca de muchos personajes de este movimiento. Yo ya había leído una pequeña nouvelle escrita por él y que precisamente se llama “Los Dobles”, cuyo argumento es mucho más ameno, liviano y divertido que el que podemos leer en “Los Elixires del Diablo”, puesto que en este libro, su personaje principal, Medardus, será eje de elementos realmente perturbadores como lo terrorífico, lo grotesco, lo violento y lo misterioso. Todos ellos, juntos a su devoción religiosa, sus delirios místicos y su amor devoto por Aurelie conformarán una serie de circunstancias que marcarán su vida para siempre.El monje Medardus, cuyo nombre verdadero es Franz (Franciskus) hijo de un padre hereje y asesino y de una ferviente madre católica (he aquí doble identidad heredada), descubrirá en medio de su pacífica vida clerical de convento un elixir que le abrirá las puertas al mismo infierno y lo arrastrarán a una vida descontrolada que lo apartará del camino de Dios, llevándolo a desdoblar su personalidad en la que nada será lo que parece. A veces, su doble se le mostrará en forma espectral y en otras de manera tangible. Tendrá visiones, como la de la tentación de San Antonio, un crimen en el que se ve involucrado y la lujuria y el amor por los placeres terrenales inspirados en Aurelie lo llevarán a intentar recomponer su vida a partir de los más variados tormentos y castigos autoimpuestos, la cárcel y la lucha denodada por la redención.Hoffmann utiliza algunos aspectos del romanticismo como el titanismo, la dualidad hombre/Dios, el panteísmos en Medardus así también como elementos del gótico para los ambientes, castillos, conventos y claustros en los que se desarrolla la acción.El libro tiene todo tipo de anécdotas y relatos que forman parte del total de la obra y que llevan a que se torne un tanto tediosa su lectura, aunque sin condicionar ni disminuir la falta de interés en el lector para descubrir cómo termina la historia.Aurelie será una pieza clave en todo estos, junto con el conde Viktorin, así también como Reihold, Euphemie y Hermogen. Tal vez las distintas historias que se relatan dentro de la principal suenan un tanto repetitivas, pero son necesarias para entender como eclosiona todo al final.Creo que este libro puede haber influenciado fuertemente a Edgar Allan Poe para escribir su famoso cuento “William Wilson”, puesto que los aspectos de la temática del doble se potencia en ambos relatos con notoriedad marcada. Hoffmann sabe mantener la llama del suspense a lo largo de las 435 páginas que contiene Los Elixires del Diablo, haciéndonos pensar que en mayor o menor medida, todos tenemos una doble vida."}, {"userName": "Liz Hopps (Elizabetha)", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/4008406-liz-hopps-elizabetha", "userReview": "Me encantó, pero terminé agotada emocionalmente luego de leer la última hoja. Debo decir que es una narración agitada y febril, magnifica en su recreación onírica y desquiciada. Esta llena de un exceso genial de pasiones desbocadas,deseo insano y sensual, maldad, locura etc. Eso la hace una historia exquisitamente agobiante, con pasajes que sinceramente me dieron miedo.Realmente Hoffmann es un maestro, tanto en el estilo como en la trama. Por momentos parece una narración desordenada, pero eso le entrega aun más irrealidad a toda la historia.Si te gusta la novela gótica y de horror clásico, esto es lo tuyo.100% recomendable."}, {"userName": "Lee Foust", "userReviewDate": "Mar 12, 2017", "userURL": "http://www.goodreads.com/user/show/13984676-lee-foust", "userReview": "Western civilization--since Aristotle I guess--anyway, he's often blamed for it--has long been obsessed with meliorative/pejorative dichotomies: good and bad, right and wrong, sin and virtue, love and lust, you and me. While perhaps semi-useful in some situations of thought, it appears that the complexities of life and culture were deemed by Western culture somewhat more complex and more frequently a gradation of possibilities that a series of either/or propositions some centuries ago. I took The Devil's Elixirs, thematically, as an exploration of what happens when one tries to live such false dichotomies. No one is perfect, or totally evil, wholly a sinner or a saint: all men are of course mostly waffling or wallowing in the grey area in-between the two extremes--which are not even completely mutually exclusive concepts either. To live a false dichotomy, then, is to be split in two and you get the great occidental doppelganger narrative: Conrad's \"The Secret Sharer,\" Dostoevsky's \"The Double,\" and Hoffmann's The Devil's Elixirs. The logic seems to be that I can only be one or the other but, if I find I am, at different times, both, then there must be two of me--maybe more. Maybe it's also my models, my ancestors, my mentors--look at how many of me there are! I'm practically an infinite number of people!Evil twins, parallel narratives, and generations of characters with the same names repeating endless variations of similar stories proliferate in this wild (and wildly recounted) first person narrative of a mad (or perhaps so utterly sane he's actually telling the truth) monk named Medardus--or maybe Viktorin. Medardus not only has similar mentors and role models but a double or perhaps alter-ego or maybe he's only a similar-looking half brother. His own bifurcations get projected on the outside world as well wherein every woman he meets is either a spotless saint or a tempting demon--or both, but only in a troubling back and forth of actions and attitudes.The narrative is as crazy and disorienting as I'm making it sound, but it's also told in such a matter-of-fact and logical way that it becomes oneiric in the later modernist tradition of Kafka and Bruno Schulz. The text's abrupt weirdnesses told in such a deadpan fashion are really disarming at first. Everything that happens in the story keeps coming back around; each event gets experienced, then explained, and then sometimes re-experienced and re-explained, reviewed from other point of view, then interpreted wholly differently than what I took from the narrative's first presentation of it. The narrative is therefore crazy and engrossing and wickedly clever. Perhaps it's a bit long and repetitious, even tedious for an impatient reader, but I myself enjoyed every startling event, replay, explanation and re-explanation as part of the novel's pointed attempt to demonstrate the absurdity of absolute truth, of judgements, and of either/or logic in general. Without objective reality, everything is an endless parade of ever-changing re-evaluations, no?Of course the subtext, and I assume inspiration for this novel, is Matthew Lewis's English Gothic masterpiece The Monk. I loved this variation, however, because of it's much more philosophical theme and its explosion of the confines of the genre into something so modern--and so much weirder than any Gothic romance that preceded it. Nice to know that only Gothic, as a genre (and perhaps Sterne's satire), was able to predict the most original techniques to come of 20th century literature. Also, with its invocation of the holy icon/temptress Aurelie, The Devil's Elixirs felt like a kind of missing link between Matthew Lewis and Gerard de Nerval as his 19th century oneiric fantasies. ...this is beginning to read like a list of my favorite late 19th and early 20th century authors.I had no idea E. T. A. Hoffmann had written anything other than tales until quite recently and I'm so pleased I discovered this! Can't wait now to read his other novel which is much more highly touted than this one, The Life and Opinions of Tomcat Murr"}, {"userName": "Jonathan", "userReviewDate": "Nov 22, 2012", "userURL": "http://www.goodreads.com/user/show/4024731-jonathan", "userReview": "Wow! I've read quite a bit of Hoffmann now but I wasn't quite prepared for this. It's actually less manic than some of his short stories but it has all of his usual obsessions - identity confusion, supernatural beings, coincidences, hallucinatory ramblings, murder, lust, etc.I generally prefer his darker material such as 'the Sandman' to which this would make a good companion piece. The overriding theme though is the identity confusion over the main character. As other reviewers have noted it gets pretty confusing, though it only really gets confusing when Hoffmann attempts to 'explain' all the previous shenanigans...ha ha...he goes back several generations which all seem to involve sons, brothers, half-brothers who very often have the same Christian names. Now I realise that for some people this would be too disconcerting, however I love it. In fact whilst I was reading it I kept imagining Hoffmann chuckling to himself as he wrote it, and there aren't many books that I read where I can envisage the author having more fun writing it than the reader gets in reading it.Hoffmann wrote another story with a similar confusion over identities, called 'Princess Brambilla' but that one didn't quite work for me. The Devil's Elixirs gets it pretty much spot on. In fact, since finishing it, I've been contemplating going through it with the intention of trying to unravel the plot further, though this may not be a wise move. I've just read The Shattered Self which has a chapter on The Devil's Elixirs where the author mentions that 'Efforts to unravel the plot, to separate action from thought, or to explain rationally the tragic curse can only diminish an appreciation of the novel.'The Devil's Elixirs was originally published in two parts, then as a book in 1816. This translation was originally published in 1963 and was a joy to read. Ronald Taylor notes that there was an earlier translation from 1820s but that it was abridged. If it's the one on Project Gutenberg then I would suggest avoiding it and reading this translation."}, {"userName": "Aoife", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/3427680-aoife", "userReview": "It's not you it's me.The plot itself is quite fascinating. My mocking status-updates might not have conveyed that very well but it is a Gothic novel, you don't really ask for reason and logic in those, there's simply lots of doomed love, Doppelganger and Very Dark Secrets. However the writing-style wasn't my cup of tea. It was very...wordy. It felt like you could have cut out at least a third of it and it wouldn't have made any difference. It didn't add to the atmosphere (which was admittedly quite creepy), the characters or anything. The only result that after reading 10-15 pages my thoughts started wandering off, I missed half of the story and when there was some big reveal I was all 'What did just happen?' and had to leaf back to re-read.DNF at about 2/3 (but I did look up the end on wikipedia so...yeah I did want to know what happens next but not deperately enough to finish it)"}, {"userName": "Graziano", "userReviewDate": "Jun 25, 2016", "userURL": "http://www.goodreads.com/user/show/4122654-graziano", "userReview": "NON CI SVEGLIATE!... NON SVEGLIATE QUESTO ASSURDO MONDO MAGICO ADDORMENTATO FRA LE ANTICHE PIETRE!(798-9)(ma, cari scrittori, continuate imperituri a raccontarcelo! G.)Hoffmann approda dunque, secondo l’osservazione di Lothar Koehn, alla solitudine del romanziere, all’espatriazione trascendentale di cui parla Lukacs nella Teoria del romanzo: all’epopea di un “mondo abbandonato da Dio” in cui un’oggettivita’ sempre piu’ elusiva s’allontana progressivamente dal soggetto. (XLI, L’esilio del borghese, Claudio Magris)KREISLERIANANon tanto in sogno, quanto nello stato di dormiveglia sognante che precede il sonno (specialmente quando ho sentito molta musica), trovo una concordanza fra colori, suoni, profumi; e’ come se le tre cose venissero prodotte insieme, nello stesso misterioso modo, da un raggio di luce, per poi fondersi in un meraviglioso concerto. (44)LE NUOVE AVVENTURE DEL CANE BERGANZA Ne sono convintissimo. Tutte le donne affettate, eccessivamente colte - e sostanzialmente fredde - a partire dal venticinquesimo anno di eta’ sono mature per l’”Ospitale degli Incurabili”. (109)IL MAGNETIZZATOREE buon per voi se la natura tollera che le tiriate i veli con le vostre mani sgarbate e non punisce tanta curiosita’ mandandovi in perdizione. (135)IL VASO D’OROAl centro della camera, sopra una piastra di porfido retta da tre leoni egizi in bronzo fuso, poggiava un semplice vaso d’oro. Come vi ebbe posato lo sguardo, Anselmo non riusci’ piu’ a distoglierlo: su quella superficie d’oro tersissimo parevano muoversi, in un gioco di mille iridescenti riflessi, figure d’ogni specie… Anselmo vi scorse perfino se stesso … (200)Anselmo, - gli disse il principe degli spiriti. - Tu non hai colpa della tua incredulita’. La colpa e’ stata di un principio malefico che cercava di penetrare in te - e di inimicarti con te stesso - per la tua perdizione. Ma tu ti sei mantenuto fedele. Sii dunque libero e felice. (227) E che altro e’ la felicita’ di Anselmo se non la vita nella poesia, cui si rivela il piu’ profondo segreto della natura: la sacra armonia regnante fra tutti gli esseri? … (237)KREISLERIANA… per il musicista la visione e’ una “audizione interiore” - o piuttosto, una profonda presa di coscienza della musica la quale, vibrando all’unisono con lo spirito del musicista stesso, risuona da tutto cio’ che il suo occhio riesce ad abbracciare. Cosi’, le improvvise ispirazioni, il nascere delle melodie nella mente del musicista, si spiegherebbe con la facolta’ inconscia - (o meglio; non definibile con parole) - di cogliere la musica occulta della natura e di riconoscere in essa il principio della vita e di ogni manifestazione vitale. (303-4)GLI ELISIR DEL DIAVOLOEro colui che sembravo, e non sembravo colui che ero. In quella duplice personalita’ non riuscivo piu’ a comprendere, a ritrovare me stesso! (447)Esiste una sola creatura umana cui il meraviglioso mistero d’amore, custodito nei piu’ profondi recessi dell’animo, non si sia rivelato almeno una volta nella vita?... (527)RACCONTI NOTTURNI. L’ORCO INSABBIA.Oh, mamma chi e’ questo cattivo Orco Insabbia che ci fa sempre andare via dal babbo? Com’e’ fatto? Ma non c’e’ nessun orco, piccolo mio, - rispose la mamma; quando dico: viene l’Orco Insabbia, vuol dire solo che vi e’ venuto il sonno e non potete tenere piu’ gli occhi aperti, come se qualcuno vi avesse buttato la sabbia in viso. (654)Forse, o mio lettore, allora crederai che nulla v’e’ di piu’ stravagante e pazzesco della vita reale e che il poeta la puo’ cogliere solamente come un oscuro riflesso dentro uno specchio senza luce. (666)RACCONTI NOTTURNI. LA CASA DISABITATA.Ma che cos’e’, poi, la vita abituale?... Ahime’, e’ un eterno rigirarsi entro una cerchia ristretta, un continuo batter di naso dappertutto, un andar di piccolo passo, misurato, monotono, anche se spesso tentiamo di interromperlo con qualche virtuosistica “courbette”... (768)"}, {"userName": "Esther", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/5889098-esther", "userReview": "E.T.A. Hoffmann ist ein bekannter Vertreter des Genres „deutscher Gruselroman“ aus der Romantik und dass dieser Text aus dem 19. Jahrhundert stammt, sollte man bei der Lektüre dieses Klassikers nicht vergessen. Die Sprache fand ich teilweise schleppend: extrem lange und verschachtelte Sätze fordern dem Leser einiges an Konzentration ab. Die Handlung ist zwischendurch sehr verwirrend: es tauchen Doppelgänger auf, Halluzinationen verzerren die Realität und die verzweigten und erst nach und nach zu Tage tretenden Verwandtschaftsverhältnisse führten an so mancher Stelle dazu, dass ich mich etwas verloren fühlte.Nichtsdestotrotz ein unterhaltsamer Roman, in dem mich vor allem die Andeutung psychologischer Probleme wie Persönlichkeitsspaltung, Schizophrenie und Depression verwunderte, da ich diese im frühen 19. Jahrhundert noch nicht als „salonfähig“ eingestuft hätte. Erscheinungen Totgeglaubter oder Teufelserscheinungen werden regelmäßig so dargestellt, dass diese auch lediglich in der Vorstellung des Erzählers stattgefunden haben könnten. Die Charaktere sind trotz manch absichtlich eingebauter Verwirrung klar gezeichnet und der Leser fühlt das wiederholte Auf und Ab in der Stimmung und Einstellung des Mönches Medardus aus der Erzählperspektive der 1. Person hautnah und authentisch mit. Die ein oder andere gesellschaftskritische Passage, z. B. über das Verhältnis zwischen Bürger und Adel, über Zukunftsszenarien für den arroganten Adel, über die Konkurrenz verschiedener Brüderschaften um die Gunst des Papstes und generell über die Gefahr für jeden einzelnen, vom einfachen Mönch bis hin zum Papst, den Verlockungen von Macht und Lust zu verfallen, machen diesen Jahrhunderte alten Text auch heute noch interessant und lesenswert."}, {"userName": "Kaoru", "userReviewDate": "Dec 11, 2011", "userURL": "http://www.goodreads.com/user/show/5858928-kaoru", "userReview": "Leichte Kost war das sicherlich nicht, zumindest keine leicht lesbare, was aber trotzdem nicht heissen soll, daß die Sprache nicht schön zu lesen war. Nur muß man definitiv in Stimmung für sowas sein... und das war ich nicht immer. Was auch der Grund dafür war warum ich ungewöhnlich lange brauchte um das Buch durchzulesen. Etwas enttäuscht bin ich jedoch dennoch. Die ersten 50 Seiten sind unglaublich stark, aber was nach ihnen folgt löst leider nicht so ganz ein was der Beginn noch versprach. Die Handlung plätschert mal mehr, mal weniger vor sich hin und so manche von Nebenfiguren erzählte \"Rückblende\" kann schon sehr am Geduldsfaden reissen. Das soll aber nicht heißen, daß das Buch keine interessanten Momente mehr hervorbringt. Sequenzen wie die mit dem verrückten Friseur Schönfeld lockern das Buch immer wieder auf und halten den Leser bei der Stange. Und wenn das Ende nicht so enttäuschend gewesen wäre, dann hätte ich mich sogar noch zu vier Sternen hinreissen lassen. Aber da dem nun mal nicht so ist...Aber... joah. Schlecht ist das Buch nicht. Und es ist sehr verwunderlich, daß es bisher noch keine einzige Verfilung gegeben hat."}, {"userName": "Coni", "userReviewDate": "Jul 13, 2015", "userURL": "http://www.goodreads.com/user/show/36610729-coni", "userReview": "Un romanzo faustiano, ottocentesco, delirante e onirico.Un frate (Medardus, eh eh eh) beve un vinello antico e sclera. Perché il vino era del demonio. O forse è solo sclero così, perché è lui così.Ci sono dei momenti gustosi, ma poi ci si perde un po' in spiegoni e in vicende un po' troppo tirate per i capelli.La storia della letteratura ci insegna che questo librino è importante perché è lì a metà fra illuminismo e romanticismo e boh. Non ho ben capito perché dovrebbe interessarci oggi. Forse è perché Medardus al di là della vicenda è simbolo del disfacimento delle sicurezze umane. Boh, poi comunque ci sono infiniti riferimenti alla cultura ottocentesca, citazioni... alla fine è abbastanza meta come discorso.Direi che è invecchiato abbastanza. Sta di fatto che ho fatto un po' fatica a seguire la faccenda. Hoffmann per me si drogava."}, {"userName": "TOM", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/33757645-tom", "userReview": "Ann Radcliffe drops a tab of acid.That’s how this novel length tale from Hoffmann reads. A mad gothic romp of murder, mystery, mistaken identity, religious frenzy, mania, bizarre barbers, satanic legacies and more.Despite being nearly incomprehensible plot wise (attempting to work out the intricacies of the labyrinthine plot alongside the myriad number of characters would take you months) this is a greatly enjoyable albeit ridiculous take on the gothic novel.Apparently Hoffmann was greatly inspired by Lewis’ ‘The Monk’ which I am still yet to read. Not my favourite by Hoffmann but worth reading if you enjoy gothic literature or bizarre tales."}, {"userName": "Juan José", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/21759122-juan-jos", "userReview": "Un relato de folletín absolutamente encantador. Hay partes que dan medio miedo pero la mayoría no, esto debido a que los tiempos han cambiado desde su publicación. Una novela al estilo gótico inglés escrita por un aleman talentoso."}, {"userName": "Leah", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/39972744-leah", "userReview": "Die kompliziert verwirrend-verstrickte Geschichte eines Mönch.In \"Elixiere des Teufels\" wird die fiktive Lebensgeschichte des Mönch Medardus erzählt, der durch seine Geburt her mit einer Sünde befleckt ist und dadurch sündhaft handelt. Zugegeben, der ganze Inhalt des Buches wurde mir erst klar, nachdem ich mehrere Zusammenfassungen gelesen habe. Es ist alles sehr verstrickt und verwirrend - vor allem da viele der Geheimnisse, die sich um den Mönch Medardus sammeln, erst Kapitel für Kapitel enthüllt werden und man gegen Ende viel davon wieder vergessen hat. (So ging es zumindest mir).Faszinierend fand ich die Figur des Mönches und die Dopplung mit seinem Doppelgänger. Es war beängstigend, dass man zwischendurch vergaß, wer von Beiden die schlimme Tat begangen hat. Wenn man es erst einmal entschlüsselt hat, bringt es Spaß!"}, {"userName": "Marc ", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/39646797-marc", "userReview": "NOTA: 7'9 / 10Novelas universales, atemporales, referentes que se convierten en clásicos ineludibles por derecho propio. En una sociedad ávida de consumismo, convencida que todo está ya inventado en la literatura, no está de más mirar hacia el pasado, entender los orígenes de aquello que nos da miedo, las raíces del terror. La naturaleza humana. Y con esto nos encontramos con Los elixires del diablo, una novela del siglo XVII que explora el \"yo\" profundo de la psique humana y que hace vibrar las cuerdas del alma, hasta hacerla estremecer.Medardo es un monje atormentado por el demonio, quien le provee de una especie de pócima siniestra (siniestra teniendo en cuenta su condición de monje, naturalmente) que despierta en él una sensualidad desatada. En su huida desesperada, Medardo conocerá a otro monje, su doble, con quien se cruzará una y otra vez en sus sangrientos peregrinajes.Publicada en 1815 durante uno de sus habituales ataques febriles, E.T.A. Hoffmann consigue crear una novela donde se mezclan tintes policiales, sobrenaturales, sexuales, alucinatorios con una huella novedosa para la época que lo sepultará al éxito. Fue publicada en apenas un mes a modo de folletín, con la única intención por parte del autor de superar una penosa situación económica. Ni siquiera él presagió el éxito de su novela. Englobada dentro de la literatura gótica alemana, \"Los elixires del diablo\" se convierte en un clásico universal del género gótico por su propio peso.Se la suele definir como densa y larga, adjetivos no necesariamente negativos. Se muestra interesante aunque sus tramas se complican en exceso debido a cierta confusión. Llega un momento que no sabes si lo que narra el protagonista es realidad o un cruel sueño. La locura del otro yo, que lleva a cometer atrocidades. También surgen otros temas igual de tratados como la sexualidad, la religión, el deseo, convirtiéndose en un saco roto de aspectos psicológicos dignos de ser estudiados por el mismísimo padre del psicoanálisis.No obstante, la figura atormentada del padre Medardo supera la frontera del tiempo convirtiéndose en un personaje universal y eterno, de incuestionable valor."}, {"userName": "George K.", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/4675995-george-k", "userReview": "Πολυγραφότατος ο Ε.Τ.Α. Χόφμαν (1776-1822), έχει γράψει μεταξύ άλλων τον πασίγνωστο Καρυοθραύστη, την νουβέλα Σάντμαν και το Βίος και πολιτεία του γάτου Μουρ. Όσον αφορά τα Ελιξίρια του Διαβόλου που μόλις τελείωσα, πρόκειται για μια περίεργη ιστορία μαύρης φαντασίας και γοτθικού τρόμου, με έντονο θρησκευτικό συναίσθημα, για την οποία δύσκολα μπορώ να γράψω μια περίληψη που να βγάζει νόημα. Θα προσπαθήσω όμως: Ένας καπουτσίνος μοναχός, ο Αδελφός Μένταρ, μια μέρα θα δοκιμάσει ένα ηδονικό και άκρως απαγορευμένο κρασί, προϊόν του Σατανά, και από τότε θ'αρχίσουν τα παράξενα και επικίνδυνα οράματα αλλά και η περιπλάνηση του από το μοναστήρι το οποίο θ'αφήσει με προορισμό την Ρώμη. Αυτή η περιπλάνηση θα αποδειχτεί για τον πρωταγωνιστή μοναχό μια τρισκατάρατη και αιμοτοκυλισμένη πορεία προς το κακό και ο ίδιος θα διχαστεί ανάμεσα στον πραγματικό του εαυτό και τις σατανικές μεταμορφώσεις του. Γενικά σαν ιστορία έχει φάση, μυστήριο, σκοτεινή ατμόσφαιρα, παράξενες καταστάσεις και θα έλεγα υπερφυσικό ή/και μεταφυσικό, όμως σε μερικά σημεία μπερδεύτηκα και σε άλλα κουράστηκα από το πολύ μπλα μπλα. Δείχνει σαν βιβλίο τα διακόσια χρόνια του (αν δεν κάνω λάθος γράφηκε το 1815), μιας και σε αρκετά σημεία πολυλογεί και κουράζει με τους μεγάλους διαλόγους, όμως δεν μπορεί να παραβλέψει κανείς την ενδιαφέρουσα πλοκή και την πολύ καλή γραφή. Γενικά ένα κλασικό έργο που οι λάτρεις του φανταστικού και συγκεκριμένα του γοτθικού μυθιστορήματος οφείλουν να ρίξουν μια ματιά, εκτός και αν δεν είναι τους γούστου τους οι θρησκευτικές αναφορές και οι περιγραφές της μοναστικής ζωής."}, {"userName": "Linda", "userReviewDate": "Apr 12, 2012", "userURL": "http://www.goodreads.com/user/show/4626387-linda", "userReview": "A very strange book but fascinating. Supposedly \"the posthumously publisheed writings of Brother Medardus, a Capuchin Monk.\" Although the story starts out making sense - Brother Medarus, whose sin is tremendous pride - decides to leave the monastery clandestinely. He finds a man sleeping on a ledge above a rocky chasm and, since the man appears to be in great danger of falling, decides to help him. But did he or did he push the man over? As we find out, Medardus and the dead man look identical. Now it gets really strange. More people begin to look just like Medardus and we start to become confused as to which one is actually Medardus. For example, he takes shelter with in a forest lodge where there is a \"mad monk.\" The monk looks exactly like, you guessed it. Later in the book we find out that this monk is Medardus. How, you say, can he be both the traveler AND the mad monk? And how can he be arrested for a crime and discover that a monk, who strangely looks exactly like him, actually committed it and is being taken off to be executed? Treated as well is the question of whether madness and criminal behavior is inherited. If you like mind stretchers, you'll like this one. E. T. A. Hoffmann is known for his Nutcracker story and the tales behind The Tales of Hoffmann opera. This is NOT one of those. But it has Hoffmann's stamp. Oh, and did I mention of top of all this there is a doppelganger?"}, {"userName": "Reni", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/3423798-reni", "userReview": "Zu lang. Zu langatmig. Ein schöner Sprachgebrauch profitiert eben auch von einem präzisen Sprachgebrauch. Davon ist in \"Die Elixiere des Teufels\" aber nicht viel zu spüren. Ich verbleibe zwar ein Fan der deutschen Romantik, aber dieser Roman geht an mir vorbei. So spannend auch einige der Episoden sind, so zitierfähig einige Passagen, Bruder Medardus ist ein Protagonist mit dem ich nicht übermäßig Zeit verbringen möchte, was mich dazu treibt in diesem Falle den unnötig, kitschig ausufernden Schreibstil nicht zu verzeihen.Hinzu kommt, dass natürlich jede Szene mit Aurelie bis zum Himmel stinkt. Jeder Persönlichkeit beraubt, beschränkt auf die Vision der Verführerin, die Medardus' Wahnsinn ihm schickt, und auf die Leblosigkeit der Ikonie, die kein Eigenleben besitzt, ist diese Figur lediglich ein Mittel zur geistigen Vervollkommnung des Protagonisten. Nicht einmal ihr Gelübde, sondern erst ihr Tod, ihre entgültige Flucht vor aller körperlicher Lust, sichter Medardus das Seelenheil. Ihr gegenüber wirkt sogar die unerreichbare Dame des deutschen Minneliedes wie ein Gipfel der feministischen Charakterzeichnung.Wer genug hat von der Frau als Symbol, kann um diesen Roman getrost einen großen Bogen machen. Auf seine literaturwissenschaftliche Bedeutung sei da genüsslich gefurzt."}, {"userName": "Mel", "userReviewDate": "Dec 19, 2012", "userURL": "http://www.goodreads.com/user/show/5866692-mel", "userReview": "I started reading this month's [info]bibliogoth book on the way to Bath. It seemed totally appropriate to be reading an early 19th century gothic novel there, particularly as we were staying on exactly the same street that Miss Catherine Moreland stayed at when she first arrived in Bath. I won't say too much about the book before the meeting but I really enjoyed it. The characters seemed more developed than in the Monk and I really enjoyed the madness aspect. There were some dull moments but on the whole it was very good. Much easier to read and more engaging than other gothic novels I've read and even in translation the style was very good. I really enjoyed the idea of an unreliable first person narrator. It could have done with a little more devil and a little less princes but I'd still recommend it."}, {"userName": "pufford", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/1801804-pufford", "userReview": "I read this a few years ago, and just remembered it. Though I'm not entirely sure how I might have forgotten it... This is without doubt one of the most bizarre and disturbing books I've ever read. Which give the weirdness of many of my choices, is rather impressive!"}, {"userName": "kasia", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/48206-kasia", "userReview": "Highly entertaining in a 19th century sort of way. Maximally convoluted doppelganger/cursed family plot, super whacked out Book of Revelations style visions. Lots of fun.The more extended blog review."}, {"userName": "Lăcră Grozăvescu", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/26702584-l-cr-groz-vescu", "userReview": "Un joc de cuvinte este un drot încins în mâinile nebuniei care răsuceşte toate ideile."}, {"userName": "Raúl", "userReviewDate": "Aug 22, 2015", "userURL": "http://www.goodreads.com/user/show/30844517-ra-l", "userReview": "'Soy lo que parezco y no parezco lo que soy; soy un enigma inexplicable para mí mismo: ¡Mi Yo se ha escindido!'Königsberg, en la segunda mitad del XVIII, no solo fue una sobria y fría ciudad en la que los vecinos ponían en hora los relojes al ver pasar a Kant; parece que también albergó lo fantástico, lo siniestro, lo ominoso, en la figura de Hoffmann. Y es que aquellos dos compatriotas no podían ser más distintos. E.T.A. Hoffmann ha sido descrito como una especie de duende, un extraño juez de hábitos bastante descuidados y extraordinario talento artístico, volcado en la música, la pintura y la literatura, pero también en la criminología y las patologías mentales por (de)formación profesional, pues era el campo en el que convergían sus obligaciones de especialización laboral, como jurista, con sus auténticas inquietudes, volcadas en la psique humana. Hoffmann tenía auténtico pavor a volverse loco, y su obsesión - agudizada por el alcoholismo y la sífilis - era que ya había cruzado los límites de la locura; estudió toda la información disponible en aquel entonces sobre la materia, y hasta conoció de primera mano varios manicomios y sus huéspedes, experiencia que le ayudaría a crear, entre otras cosas, la novela que nos ocupa. En cuanto a la criminología, parece que se adhirió a cierta creencia del momento que asignaba un determinismo moral al criminal, una suerte de determinismo metafísico del mal que se transmitía de generación en generación a través de una estirpe de criminales; teoría ésta que posteriormente extendería el criminólogo Cesare Lombroso, en una época en la que la frenología era todavía una disciplina respetada en el mundo de la medicina.Por todo lo anteriormente dicho sobre su autor, y algunas cosas más, ''Los elixires del diablo'' es una novela de amplio interés. Sumemos a esto su inclusión entre los clásicos del romanticismo negro alemán y su relación directa con la novela gótica inglesa para terminar de recomendársela a todo fan del género. Hoffmann decidió escribir esta novela animado por el éxito de ''El monje'' de Lewis, al que lanza más de un guiño, en cierto momento muy explícito, a modo de broma. Y yo leí por primera vez ''Los elixires...'' justo después de ''El monje'', dentro de mi viaje a los orígenes de la literatura gótica. Pero la novela de Hoffmann, como buena novela que es, desborda las encorsetadas clasificaciones con que podemos enmarcarla, y se relaciona con temas diversos, así como acaba influyendo a autores también diversos. Dostoievski, Poe, Freud y la vanguardia expresionista son las referencias que parece que hay que apuntar. Siendo muy generosos, incluso podría anticiparse aquí la voluntad de poder de Nietzsche. A estas alturas, el lector ya puede adivinar que el plano psicológico ofrece la lectura de mayor interés en esta obra. La historia que se nos cuenta, a fin de cuentas, transcurre a través de un desdoblamiento de la personalidad (la idea del doble).Hablemos ya de su estructura y contenido. Novela folletinesca, configurada como un manuscrito o cartapacio redactado en un monasterio, y dividida en dos partes desiguales: la primera, inquietante; la segunda, más resolutiva, aunque también de menor intensidad. Un anónimo editor se encarga de armar las partes de la narración, a modo de meta-novela. La narración básica narra en primera persona la vida del hermano Medardo, monje católico. Hoffmann recoge el legado de Lewis al hacer protagonista de su pluma a un monje que también va a vivir un descenso a los infiernos, pero, a partir de esta inspiración, la creación del prusiano se alejará completamente del estilo y contenido del inglés, en mi opinión superándolo, o yo al menos disfruté más con la escritura de Hoffmann. Es como si Hoffmann hubiera usado la idea de Lewis - de gran alcance popular en la Europa de entonces, siendo ''El monje'' un auténtido best-seller - para desarrollar sus conocimientos y teorías criminológicas. La obra de Lewis parece plana en comparación, a pesar de sus geniales imágenes perversas. Lo que hace Hoffmann es explorar el pecado de manera introspectiva, en relación a la conciencia personal. En ''El monje'', el pecado se manifestaba en las obras que, sucesivamente, iban conduciendo a su protagonista a la condenación, con su encuentro cara a cara con el demonio. Para Hoffmann esto sería inconcebible, porque tanto el pecado como el mal solo existen dentro de la mente del criminal, y de ningún modo objetiviza ni personaliza al demonio; aquí el diablo habla siempre por boca del propio pecador, siendo una suerte de idea de la tentación que mueve los hilos oscuros. Frente al Mal también obrará el Bien, y ambos se batirán en la sufrida mente del monje Medardo, para luchar contra su destino funesto, escrito en ese determinismo moral del que tan difícil parece escapar. La voluntad, ayudada por la Gracia (para el que cierto personaje servirá de instrumento) son el arma del Bien. La eterna lucha maniquea se librará en estas páginas, desde las tentaciones encerradas en los muros de un monasterio hasta pueblos y cortes alemanas, pasando por un precipicio que representa cierto límite. Retomando la inevitable comparación con la obra de Lewis, quiero señalar que en ''El monje'' no hay tanto conocimiento sobre catolicismo y conventos - aunque sin llegar a los fallos de Radcliffe -. Hoffmann pretende una inmersión en esta atmósfera, y lo consigue. Y es de notar que ninguno de estos tres autores se formaron en tierra de católicos.El conjunto de la narración de Medardo tiene la característica de no ser siempre coherente con la realidad que se supone que está contando. Y es que en ''Los elixires...'', la realidad se pone en entredicho en todo momento, tanto como la cordura del propio narrador, apostando por un subjetivismo que, obviamente, hace de la primera persona un uso esencial. Realidad y ficción, cordura y locura, son estados que simplemente ocurren como el día y la noche. Lo maravilloso entra en la escena de lo vivido y se hablan de igual a igual, rompiendo con la lógica de lo racional. Esta forma de entender la narración sirve, a su vez, para incorporar de un modo interesante el tema del 'dopplegänger', que como comenté anteriormente, define 'Los elixires...'.'- ...Pero ¿dónde ha metido el señor el uniforme?- Lo he lanzado al abismo - surgió la respuesta, hueca y apagada, de mi interior, pues no fui yo el que pronunció esas palabras, emitidas involuntariamente por mis labios'.El estilo literario, unido al desigual ritmo de la narración, las oraciones llenas de subordinadas y otros recursos, consiguen que en buena medida esta novela, todavía hoy, parezca siniestra, tal y como fue recibida en su momento. Como comenta José Rafael Hernández Arias, prologuista de la edición de Valdemar a la que he tenido acceso, la forma de escribir de Hoffmann era ''más impulsiva que racional'', y aunque obliga al lector a un mayor esfuerzo a la hora de seguir el texto (incluyendo algunas extrañas incoherencias que en ocasiones no son de recibo), también ''facilita la creación de una atmósfera (...) una experiencia literaria más intensa''. Extraños personajes contribuirán también a esta extrañeza, tales como el peluquero Pietro Belcampo o la noble del castillo, sin contar con las apariciones del pintor, personaje que bien podría tener hueco en el cine de David Lynch. Y es que toda la novela podría ser un sueño de David Lynch."}, {"userName": "spacehawk", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/69320983-spacehawk", "userReview": "Die Elixiere des Teufels gehören in die Tradition des europäischen Schauerromans, der - besonders in England und Deutschland - gegen Ende des 18. Jahrhunderts und Anfang des 19. Jahrhunderts blühte und wucherte. Es ist eine \"Liebesgeschichte\" (oder \"Geschichte über verbotene Lust\"), meines Erachtens nach, welche Stellenweise doch sehr verwirrend sein kann. Man muss aufmerksam lesen und die Anmerkungen beachten, was vor allem an der Sprache liegt. Ich habe jedes mal zunächst ziemlich schleppend gewesen, bis ich mich wieder eingefunden habe. Das Leben des Vaters von Medardus fand ich unnötig und es wirkte auf mich wie ein Versuch das Buch zu verlängern. Es hatte für mich keinen besonderen Wert und war letzten Endes nur unnötig verwirrend, besonders durch die verschiedenen Namen die teilweise die selben waren, wie die der Charakter der eigentlichen Geschichte. Man hätte das alles in die Geschichte mit einfügen können, anstatt so viele Seiten dafür zu opfern. Besonders dadurch, dass die eigentliche Geschichte anschließend fortgesetzt wird und man zuerst wieder seine Gedanken sortieren muss. Ich hätte gerne mehr über die eigentlichen Elixiere des Teufels erfahren, einfach weil sie nur kurz erwähnt werden und zum Schluss nur nebenbei beim Namen genannt. Ich erkenne kaum Bezug zwischen Titel und Geschichte, während eben dieser mich dazu brachte Interesse an der Geschichte zu erlangen. Mein Dad hat mir dieses Buch geschenkt, als er es wieder gefunden hat, was der hauptsächliche Grund ist weshalb ich es überhaupt gelesen habe. Ich bezweifle, dass ich es mir jemals selbst gekauft hätte, hätte ich es im Laden gesehen. Nichts desto trotz mochte ich die Geschichte, auch wenn sie mir zu christlich war und ich deshalb veraltetes, eingestaubtes Wissen auffrischen musste um Einzelheiten besser verstehen zu können, die in den Anmerkungen nicht oder nicht ausreichend erklärt wurden. Wer gerne Klassiker liest, der wird dieses Buch sicherlich mögen. Normalerweise lese ich keine Schauerromane, noch seltener Klassiker, aber ich mochte die Mischung zwischen Liebe/Lust (tut mir leid, aber die meiste Zeit war es dann doch mehr Lust als Liebe) und Wahnsinn und es brachte mich tatsächlich dazu mich zu fragen wie es wohl weitergeht, wenn ich an einer spannenden Stelle aufgehört habe. Auf jeden Fall interessant zu lesen! Ich bereue nichts :)"}, {"userName": "The Usual", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/56007684-the-usual", "userReview": "OK, granted this is opera plot level daft, with emotional swings along the lines of love - hate - love - stab (sometimes within sentences of one another), but I rather like it. It's full-blooded, original recipe gothic, complete with family curse, virtuous maiden, a mad monk or two, and a plot that's not so much labyrinthine as a hall of mirrors. Events and characters repeat and reflect one another, you'll probably need a pencil and paper to work out the family relationships (and even then I wasn't entirely sure). If you're looking for a cosy Victorian ghost story then look elsewhere, but if you enjoy the sheer inspired lunacy of the gothic, and you're prepared to go along for the ride, then you may well like this."}, {"userName": "Helen", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/73929157-helen", "userReview": "I think that this book is absolutely extraordinary. The narrative style is fascinating! One of the best ones I have ever seen. It is a first-person narration, but the narrator sounds insane, so you never know whether he really tells the truth or not and sometimes he tells lies but he really believes them!! And if you add the fact that he is constantly pursued by his doppelgänger, the novel becomes even more interesting and full of suspense!! The German writers of the same period who wrote Gothic novels are so great! And Hoffmann is an absolute master of the genre in his country and in Europe in general during that period (early nineteenth century).I definitely recommend this novel and also The Sandman, by the same author."}, {"userName": "Leeeo-", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/69901518-leeeo-", "userReview": "Una sorta di Beautiful ante litteram, con frati, suore, santi, marchesi e conti. \"Oh mio Dio! Ma tu sei mio fratello!\", \"Oh mio Dio! Ma tu eri morto cadendo da un dirupo! ti ci ho infilato io!\", \"Oh mio Dio! Il quadro del santo prende vita!\", \"Oh mio Dio! Non posso resistere a queste tentazioni! anche se...\". Ecco, così per trecento pagine circa. E calcolate che la recensione qua sopra è venti volte più avvincente del romanzo stesso."}, {"userName": "Patrick Murtha", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/43625824-patrick-murtha", "userReview": "This classic Gothic novel about a mad monk is completely deranged, and I mean that in a good way. Don't ask too many questions, just hang on for the ride. When you finally get to the lengthy explanation of who was really who, realize that you will need a PhD in genealogy to understand it. Sample dialogue: \"You mad fools, will you tempt the providence that passes judgment on guilty sinners?\""}], "description": "Ernst Theodor Amadeus Hoffmann (1776-1822) no llegó a entrar con honores en las páginas de oro de la historia de la música, tal como anheló toda su vida; a cambio, su nombre ha quedado grabado para siempre, con letras de un extraño fulgor, en el libro de oro de la literatura universal y su recuerdo quedará asociado en la memoria del lector con el sabor agridulce de la fantasía, la alucinación, la pesadilla, la locura y, en definitiva, con el rico universo de lo siniestro y lo numinoso. Animado por la lectura y el éxito de El Monje (CD 4) (GOT 3) de M.G. Lewis, Hoffmann madura la idea de Los elixires del diablo, para poner sobre el papel en poco más de un mes -en una suerte de trance al borde de la locura- la espeluznante historia, contada en primera persona, de la vida del monje Medardo, que viene al mundo marcado por el estigma de una simiente maldita, cuyo origen se remonta a un horrible e inconfesable crimen cometido por uno de sus antepasados. Pero, a pesar de que su atormentada conciencia le conduce poco a poco hacia el laberinto de la locura, su futuro no está totalmente sellado, ya que siempre queda un resquicio de libertad que, con ayuda de la gracia divina, le permite luchar para alcanzar su salvación.", "title": "Los elixires del diablo", "url": "http://www.goodreads.com/book/show/6164307-los-elixires-del-diablo", "average": 3.86, "cover": "https://images.gr-assets.com/books/1270054204l/6164307.jpg", "reviews": 71, "authors": [{"url": "https://www.goodreads.com/author/show/7267068.E_T_A_Hoffmann", "name": "E.T.A. Hoffmann"}], "type": ["Classics", "European Literature", "Gothic", "Fiction", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/6164307-los-elixires-del-diablo", "http://www.goodreads.com/book/show/22836699", "http://www.goodreads.com/book/show/1956028.Die_Elixiere_des_Teufels", "http://www.goodreads.com/book/show/1576915.The_Devil_s_Elixirs", "http://www.goodreads.com/book/show/29546524-los-elixires-del-diablo", "http://www.goodreads.com/book/show/5133940-the-devil-s-elixirs", "http://www.goodreads.com/book/show/10034874-die-elixiere-des-teufels", "http://www.goodreads.com/book/show/30747281-gli-elisir-del-diavolo", "http://www.goodreads.com/book/show/18135010-die-elixiere-des-teufels", "http://www.goodreads.com/book/show/1956031.Die_Elixiere_Des_Teufels", "http://www.goodreads.com/book/show/18398780-gli-elisir-del-diavolo", "http://www.goodreads.com/book/show/11136807-die-elixiere-des-teufels", "http://www.goodreads.com/book/show/16090259-gli-elisir-del-diavolo", "http://www.goodreads.com/book/show/774449.Nutcracker", "http://www.goodreads.com/book/show/680596.Der_Sandmann", "http://www.goodreads.com/book/show/551454.Tales_of_Hoffmann", "http://www.goodreads.com/book/show/1436717.Das_Fr_ulein_von_Scuderi", "http://www.goodreads.com/book/show/594852.The_Life_and_Opinions_of_the_Tomcat_Murr"]}