{"ratings": 96, "userreviews": [{"userName": "Michael Pronko", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/41323313-michael-pronko", "userReview": "Losing Kei is a marvelous exploration of the confusions, tensions and joys of living and loving in Japan. I’d put it on my list of highly insightful novels about Japan for the way it explores how foreigners survive, thrive, and occasionally stumble and fall, inside Japanese society. The main character rings true to me after 20 years living in Japan, as a character doing her best in a challenging environment. She struggles yet understands, loves and loses with dignity. It’s hard to ask more of a character. Especially an expat woman in a situation that’s not always welcoming to women of any origin. The depiction of cross-cultural relationships is also spot on. It made me really squirm in recognition. The complexities of building a relationship, family and life in another culture push the story forward with sensitivity, open-mindedness and irony. Anyone interested in Japan, expats in Japan, and marriage in general will find this a great read."}, {"userName": "크리스티 (Kristy)", "userReviewDate": "Oct 15, 2008", "userURL": "http://www.goodreads.com/user/show/1208477-kristy", "userReview": "I really liked this book. It wasn't slow and it wasn't fast. It was interesting to go through the struggle with the main character and feel her emtions on losing her child and not a thing she can do about it. I thought the writing style was great. I could picture everything clearly."}, {"userName": "Bobbie  Crawford", "userReviewDate": "Dec 04, 2008", "userURL": "http://www.goodreads.com/user/show/1326467-bobbie-crawford", "userReview": "Losing Kei: A NovelWritten By: Suzanne KamataPublished By: Leapfrog PressDate: January 1st, 2008Pages: 195Format: PaperbackISBN: 978-0972898492Losing Kei is a wonderful book; this story guides the reader through a gauntlet of emotions while it reveals some distressing Japanese customs, laws and rituals. Suzanne Kamata writes an intensely-poignant novel that will tug at the heartstrings of any mother or father who reads it; Losing Kei transported me to Japan where I stayed from the beginning of the book right through to the end. The time-line alternates between Jill Parker’s current life and her not to distant past. When Jill, an American artist, marries a Japanese man and gives birth to his son, she feels truly blessed to be so fortunate. At the same time however, Jill feels intense...* Please follow the link to read the full review:http://bookreviewsbybobbie.wordpress...."}, {"userName": "Anna", "userReviewDate": "Jul 19, 2008", "userURL": "http://www.goodreads.com/user/show/1341346-anna", "userReview": "How do you choose between your child and freedom from an overbearing mother-in-law and a husband who’s not what you’d expected? In a country where foreigners have no custody rights following a divorce, how do you get your child back? Suzanne Kamata raises these questions in Losing Kei, as Jill Parker comes to terms with the consequences of her decision.Jill’s story instantly drew me in, but I also enjoyed Losing Kei because Kamata does a wonderful job showing what it’s like for an outsider to try to fit into a culture completely different from their own. And the fact that Kamata herself is an American living in Japan lends a great deal of authenticity to the story.Full review at Diary of an Eccentric."}, {"userName": "Kathryn", "userReviewDate": "Apr 04, 2009", "userURL": "http://www.goodreads.com/user/show/2056567-kathryn", "userReview": "Kamata chose a rich premise for her novel: an American woman divorces her Japanese husband and loses custody of her little boy. I am disappointed she didn't do more with it. She created a central character, Jill, who is self-absorbed, views men as her ticket to elsewhere, wallows in self-pity, and has superficial relationships with other women. In fact, Jill doesn't experience true love until she has a baby. This does not bode well for the baby . . ."}, {"userName": "Nancy", "userReviewDate": "Jul 29, 2010", "userURL": "http://www.goodreads.com/user/show/220154-nancy", "userReview": "This story had so much promise, but I felt that it fell short. Jill was naive and stupid and never really seemed to learn from her mistakes. As well, I had hoped the story would tell more about her legal battle and experiences with the court system, but instead, we had to read about her jaunts to foreign lands to see old flames. Again, so much potential, especially given recent headlines about Americans' struggles to bring their children home from Japan, but falling short."}, {"userName": "Pam", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/632523-pam", "userReview": "This book is a fast read - keeps you riveted! Tells a story about a foreign woman married to a Japanese man & what happens when the woman divorces the man with a male child involved. Great story!"}, {"userName": "Jennifer", "userReviewDate": "Aug 03, 2008", "userURL": "http://www.goodreads.com/user/show/1009790-jennifer", "userReview": "Borrowed from another reader's review, \"As with a lot of other novels by ex-pat writers, personal peeves about Japan abound. In fact, I suspect that's what drives people to write about Japan more than anything--to vent at the wacky society we live in here...In the first half of the book, her pet peeves are mixed in with plenty of 'Wow, isn't Japan strange' stereotypes...[But] while her treatment of all-things-Japanese is a bit in-your-face, it is quite accurate. I would recommend this book to anybody who is thinking of coming to Japan so that they know in advance to leave their rose tinted glasses back in their home country.\" However, as much as I enjoyed the trip down mory lane (as an expat living in small town Japan), I found Kamanta's heroine increasingly irritating. Jill chose Japan, Japan did not chooser her. She comes across selfish and short-sighted, and gives the Japanese another reason to believe that those from the West have little to no sense of loyalty and/or duty--especially to one's children."}, {"userName": "Richard", "userReviewDate": "Dec 19, 2011", "userURL": "http://www.goodreads.com/user/show/5871773-richard", "userReview": "I love Suzanne's writing. This is her first novel, set in Tokushima, Japan. Look forward to the next!"}, {"userName": "Marie", "userReviewDate": "Apr 15, 2008", "userURL": "http://www.goodreads.com/user/show/1060805-marie", "userReview": "I enjoyed reading this story about a woman living in Japan who gets married to a Japanese man and has a child together. They get divorced and she loses custody of her son, and she is bereft."}, {"userName": "Winnie Shiraishi", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/7565185-winnie-shiraishi", "userReview": "Wonderful book. A true privilege to read and review. Suzanne Kamata writes a wonderfully effective novel about lives of expat women (and foreign mothers) in Japan."}, {"userName": "Barbara", "userReviewDate": "Dec 03, 2013", "userURL": "http://www.goodreads.com/user/show/4919102-barbara", "userReview": "Loved!"}, {"userName": "Emily (Heinlen) Davis", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/3142762-emily-heinlen-davis", "userReview": "I really enjoyed this book. It was well-written and easy-to-read. The writer has such an easy style that you simply fall into the story and her great descriptions and story."}, {"userName": "Nancy", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/6879879-nancy", "userReview": "Thank you Michael Pronko for recommending this book. It was a very interesting look at an expat's life married to and divorced from a Japanese man. A good insight into the way things work in Japan. I found the characters believable, though I agonized over some of the choices they made. I really felt for the child who seemed to be the whipping boy in the whole sorry affair. He is the one who was most injured it seemed to me. This is a novel and I would be curious to find some non-fiction, like True Crime Japan, that would explore this topic further."}, {"userName": "Amateur de Livre", "userReviewDate": "Dec 12, 2007", "userURL": "http://www.goodreads.com/user/show/676855-amateur-de-livre", "userReview": "There's an old quote that says \"A mother who is really a mother is never free\". This, as any mother knows couldn't be more true and unfortunately Jill Parker finds this out the hard way in this wonderful book by Suzanne Kamata.Jill is reeling from a bad relationship, and instead of traveling to Africa, the site of her now ex-boyfriend, she decides to take a fellowship to Japan for a fresh start. She falls in love with the culture, and soon with one of its residents, Yusuke Yamashiro. They have a whirlwind romance, and decide to elope to avoid conflict with his parents. After all she is an American and probably not someone they would approve of him marrying seeing as he is the sole heir to the Yamashiro estate.Not long into the marriage, Jill finds out that she is pregnant. Even though she is thrilled at the thought of bringing a new life into this world, she is becoming less tolerant of her role in the Yamashiro household. She wants nothing more than to be able to move into a house of their own, but when a tragedy strikes the family it is soon evident that she will never be free.When young Kei is born she focuses all of her energy on him, after all he is absolutely perfect and the only thing she needs to get her through her lonely days. With a domineering yet needy mother-in-law, and a workaholic husband, he is the only thing in her life that brings her ultimate joy. But soon it is not enough and she decides that her marriage to Yusuke must come to an end. If she was aware of the laws of Japan when it comes to custody of children, she may not have chosen to do this.After doing some research I have found out some interesting facts:-Joint custody is illegal in Japan -Japanese courts do not recognize foreign custody orders J-apanese court orders for custody are not enforceable -Natural parents do not have priority in future custody changes -Discrimination against non-Japanese in granting child custody -Fathers of Children Born Out of Wedlock Have No Custodial Rights -No system to register a foreign parent's contact information -Mothers granted child custody in 80% of court decisions -Child abuse and other psychological factors are ignored in family court decisions -Adoptions are permitted without approval of the non-custodial natural parent and without approval of a court -Government officials refuse to help a parent find a child being hidden by the other parent Unfortunately I was not totally shocked by some of these statements, I just know that I sympathized to my very core with Jill, knowing what kind of fight she was in for to try and get visitation, much less custody of a son born in her husbands native land.This book is one I would recommend to anyone. It was thoroughly engaging, and gave you a glimpse of how different cultures handle something that is very common here in the US. Well done!Questions for the author:Are you a mother?Yes. I'm the mother of eight-year-old twins - a girl, and a boy. I dedicated the book to my son. What made you decide to move to Japan (I have always been fascinated with the culture myself)?I think I originally became interested in Japan through literature. I fell in love with Heian court poetry when I was studying Asian history in college. I loved the idea that courtiers communciated via verse. I also read a couple of novels while I was in college - Equal Distance by Brad Leithauser and Ransom by Jay McInerney - that piqued my interest.I had the opportunity to go to Japan for one year on a program sponsored by the Japanese government which invites young native speakers of English to assist in English classes in public schools. I renewed for a second year, and during that year I met my husband, who is Japanese.Do you miss anything about the US?I miss the wide open spaces, and I think that Americans are more tolerant of differences. I also miss libraries and bookstores full of books in English!What advice would you give new authors? Persistence is key! I wrote four novels before this one, and I've sent short stories out twenty times or more before getting them accepted for publication. I also think it's important to finish your work. At some point you might get discouraged and think that what you're writing will never pan out, but if you don't get it down, you'll have nothing to work with.Also, join a writing group. And read, read, read.A copy of this book is going to be raffled off to one lucky reader the first week in March. To enter, all you need to do is sign the comment form www.amateurdelivre.com - please include a valid email address and the book in question so I know how to contact you . Good luck to all!"}, {"userName": "Amazon", "userReviewDate": "Jul 20, 2013", "userURL": "http://www.goodreads.com/user/show/80710-amazon", "userReview": "One gloomy spring day I was searching the shelves of Seattle's Kinokuniya Books, hoping for something good to read. A paperback caught my eye and I examined it--Losing Kei, written by an American woman who lives in Japan. Always eager for another cross-cultural perspective,I took it home. It was stunning. Five years later, it still haunts me. The story of a woman fighting her Japanese husband for custody of their son is honest, illuminating, and deeply sad. The strength and authority of the writing is exceptional--especially for a debut novel. Suzanne Kamata has written much since then, but Losing Kei is a book to hunt for and savor. I'm ready for my second time around."}, {"userName": "Heidi", "userReviewDate": "Dec 27, 2008", "userURL": "http://www.goodreads.com/user/show/220757-heidi", "userReview": "Losing Kei was a good, fast read. I finished it in a little more the 1 night. I just had a hard time putting it down! It was an interesting look into family dynamics in Japan. It is quite sad how few rights mothers have in that country.I really enjoyed the main character's story and her sense of adventure. The only bad thing about the book was that is was a little on the short side!"}, {"userName": "Tracy", "userReviewDate": "Sep 30, 2016", "userURL": "http://www.goodreads.com/user/show/8021721-tracy", "userReview": "It felt as if there were multiple people writing this book. Slow and drawn out by the time I hit page 136 it switched gears and suddenly read like an adolescent would write. I wasn't really a fan of the flipping back and forth between the years either as it didn't really flow well for me."}, {"userName": "Tracy", "userReviewDate": "Jan 08, 2009", "userURL": "http://www.goodreads.com/user/show/263150-tracy", "userReview": "Recommended by Heidi. Looks good!"}, {"userName": "Josh Grisdale", "userReviewDate": "Jan 07, 2016", "userURL": "http://www.goodreads.com/user/show/48865434-josh-grisdale", "userReview": "I am not a reader but this book kept me turning pages. Things really get heart-pounding at the end - so much so that I secretly finished it while at my work desk in a half-sized browser window!"}, {"userName": "Claudette", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/21574781-claudette", "userReview": "I liked the book and got so into it, that I thought it was a non-fiction story (when actually it is fiction). The only criticism I have is the writing style, sometimes it was disjointed."}], "description": "A young mother fights impossible odds to be reunited with her child in this acutely insightful first novel about an intercultural marriage gone terribly wrong.Jill Parker is an American painter living in Japan. Far from the trendy \"gaijin\" neighborhoods of downtown Tokyo, she's settled in a remote seaside village where she makes ends meet as a bar hostess. Her world appears to open when she meets Yusuke, a savvy and sensitive art gallery owner who believes in her talent. But their love affair, and subsequent marriage, is doomed to a life of domestic hell, for Yusuke is the \"chonan,\" the eldest son, who assumes the role of rigid patriarch in his traditional family while Jill's duty is that of a servile Japanese wife. A daily battle of wills ensues as Jill resists instruction in the proper womanly arts. Even the long-anticipated birth of a son, Kei, fails to unite them. Divorce is the only way out, but in Japan a foreigner has no rights to custody, and Jill must choose between freedom and abandoning her child.Told with tenderness, humor, and an insider's knowledge of contemporary Japan, \"Losing Kei\" is the debut novel of an exceptional expatriate voice.Suzanne Kamata's work has appeared in over one hundred publications. She is the editor of \"The Broken Bridge: Fiction from Expatriates in Literary Japan\" and a forthcoming anthology from Beacon Press on parenting children with disabilities. A five-time nominee for the Pushcart Prize, she has twice won the Nippon Airways/Wingspan Fiction Contest.", "title": "Losing Kei", "url": "https://www.goodreads.com/book/show/18267677-losing-kei", "average": 3.71, "cover": "https://images.gr-assets.com/books/1382932372l/18267677.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/303669.Suzanne_Kamata", "name": "Suzanne Kamata"}], "type": ["Cultural", "Fiction", "Cultural", "Womens"], "outlinks": ["http://www.goodreads.com/book/show/18267677-losing-kei", "http://www.goodreads.com/book/show/1898104.Losing_Kei", "http://www.goodreads.com/book/show/16043238-gadget-girl", "http://www.goodreads.com/book/show/18442148-screaming-divas", "http://www.goodreads.com/book/show/31391129-the-mermaids-of-lake-michigan", "http://www.goodreads.com/book/show/2444461.Love_You_to_Pieces", "http://www.goodreads.com/book/show/6098897-call-me-okaasan"]}