{"ratings": 863, "userreviews": [{"userName": "Rebecca McNutt", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "I wish I could get lost in New York... actually not really, the place is like a maze and I'd probably get stuck forever going in circles. But it is a really beautiful city, though I've only driven through the Bronx once, and it was pitch-dark and 3:30 in the morning. Long story. Luckily the main character of this short but entertaining book uses street-wise tactics to find his way back to where he needs to be, experiencing New York's massive infrastructure and busy subway system along the way. There are lots of amazing illustrations and it's a good book to introduce younger readers to travel and the concept of self-reliance, something a lot of today's generation is seriously lacking in."}, {"userName": "Betsy", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/221050-betsy", "userReview": "While I’m aware that public transport was invented to meet the very real needs of urban commuters, when you’re the parent of a city child you can be forgiven for taking an entirely different view of things. Simply put: subways were created for the sole purpose of amusing children. How else to explain the fun maps, bright colors, and awe-inspiring bits of machinery? We already knew that kids loved trains. Now put those trains underground. That’s just awesomeness redoubled. Here in New York City a certain level of excitement about subway trains is almost required of our kids. Yet when it comes to books about the subway system, it’s often disappointing. Either it’s too young, too old, or like Count on the Subway by Paul DuBois Jacobs it gives the subway lines the wrong colors. Sure Subway by Christoph Niemann is the gold standard, but what can you offer older metro fans? Lost in NYC by Nadja Spiegelman hits that sweet spot for the 6-10 year old crowd. Visually stunning (to say nothing of its accuracy) with abundant factual information wriggled into every available crevice, you don’t have to be a New Yorker to enjoy this book (though, boy, does it sure help).When you have a father that moves your family all over the country, it can be easy to disconnect from the places you briefly live. So when Pablo enters Mr. Bartle’s class on the first day of his new school, he rebuffs cheery Alicia’s attempts at friendship. On this particular day the class is taking a field trip to the Empire State Building. Pablo learns about the subway system that will take the class there alongside everyone else, but when he and Alicia are inspecting a map on the subway he’s briefly confused and takes her with him onto the express 2 train and not the local 1. Now separated from their class, the two kids start to fight and next thing you know they have to find their way back to their classmates entirely on their own. Backmatter and a Bibliography of other subway resources appear at the end.I'm an adult so after reading this story several times you know whom I feel most sorry for? The teacher, Mr. Bartle. Here the man is, taking his class on a routine subway trip, and along the way he loses two of them at the very first stop. A common New Yorker nightmare is the idea that you might lose your child on the subway. Yet in Spiegelman and Sánchez’s hands it’s a nightmare turned into an adventure. It’s the same reason From the Mixed-Up Files of Mrs. Basil E. Frankweiler continues to be read. For children, the thought of being independent in a city as vast as NYC is as enticing as it is horrific. Spiegelman does give Pablo a native guide for the first part of his journey, but pretty soon they two are separated and he has to make his way on his own to his group. This is by no means an interactive book, but I had to withhold a scream when Pablo jumped the 7 train at 42nd Street. He’s lucky he asked for traveling advice as early as he did, else he would have ended up in far distant Queens relatively quickly.Spiegelman’s writing holds up for the most part. It’s a slim story, clocking in at a mere 52 pages which is only slightly more than your average picture book. Some of that is rounded out with the backmatter too. Filled with history and brimming with photographs, engravings, and other stunning images, Spiegelman outdoes herself with the information found there. For certain subway buffs, the info included (with sections like “Why Are There No H, I, K, O, P, T, U, V, W, X, or Y Trains?”) will be particularly pleasing. However, when we look at the story in this book by itself, it does come to a rather abrupt halt. Pablo spends the greater part of the story declaring that he doesn’t need friends. He parts from Alicia on angry terms, yet when the two are reunited they act like the best buddies in the world. I wasn’t quite sure where the switchover on this relationship occurred. Otherwise, everything seems pretty certain and consistent. Not all subway books are created equal. I remember years ago encountering a NY subway picture book where a normally elevated stop was pictured in the book as underground. Certainly the cover of this book gave me hope. It seemed to be acknowledging from the get-go that the 1 and 2 trains both stop at 96th, 72nd, and 42nd Street (we will ignore the peculiar inclusion of a “33” since we can assume artist Sergio Garcia Sánchez meant 34th Street). As it happens, Mr. Sánchez is a resident not of one of the five boroughs but of Spain. You wouldn’t know it. The New York found within these pages feels so real and so contemporary that I have difficulty understanding that I’m not going to run into the man on the street when I leave for work tomorrow morning. Artists could learn a thing or two from his attention to detail. From the color of the painted columns to the diversity of the city streets, this is indeed the New York I know and love. The design of Lost in NYC is also a delight to the eyes. Good graphic novels for children are rare beasties. Half the time you’re left wondering if the editors or artists ever took the time to look outside the standard panel format. If Mr. Sánchez feels inclined to use panels in this book, you can bet it’s a strategic decision. The very first page is almost entirely open, only settling into panels when the kids are approaching the rigid format of a school setting. As the teacher, Mr. Bartle, begins to introduce subway history, we see the characters on a massive topographic map. It’s a visual approximation of the cut-and-cover technique used to create subways in a city chock full of hardened bedrock. Once the kids go underground the panels shift to full two-page spreads, and lots of individual vertical panels like the cars on a subway train. When called upon to render the city blocks in such a way where you can see the characters all converge on the Empire State Building from different directions, the artist either shrinks the buildings and blows up the characters, or he overlaps a subway map onto a street map and you can see the kids meet up that way. Then there are the perspective shifts. The view up into the Empire State Building, a wall or two cut away so that you can get a visual sense of some of the seventy-three elevators in the building, is dizzying. I can say with certainty that even if a child were incapable of reading English (or Spanish, since this book is being simultaneously translated) they would still be able to be moved and stirred by this story.He’s also filled the book with inside jokes. I was so pleased that I took time to read the “Behind the Scenes: Sergio and the Cop” section at the back of the book. In it, Sergio describes a time he visited NYC and was photographing all the details at the 96th Street subway stop when a cop started paying a little too much attention to him. As a result, if you look in the book you can find Sergio and the cop on “virtually every spread.” Once you see it, it cannot be unseen. It also creates a kind of touching secondary story as the two go from antagonists to, finally, taking a selfie together.Accuracy in illustration, even (or should I say especially?) in fictional stories, is imperative. You have to make the reader inhabit the setting presented, and the best way to accomplish this is through rigorous research and skill. Mr. Sánchez has both and by pairing with Nadja Spiegelman he may well earn himself an Honorary New Yorker decree. Though filled to its gills with accurate Manhattan details, you don’t have to live anywhere in the five boroughs to recognize the fear that comes with having to navigate an unfamiliar public transit system. Particularly if you’re just a kid. An adventure tale wrapped around a nonfiction core of subways subways subways. What’s not to love?For ages 6-10."}, {"userName": "Allie", "userReviewDate": "Jun 17, 2016", "userURL": "http://www.goodreads.com/user/show/310857-allie", "userReview": "I read this not too long after it came out. I wasn't blown away but there were a couple of really clever frames. The Secret Science Alliance had a similar vibe, but I was a lot more impressed with that book."}, {"userName": "Alex (not a dude) Baugh", "userReviewDate": "May 13, 2015", "userURL": "http://www.goodreads.com/user/show/4449236-alex-not-a-dude-baugh", "userReview": "I guess because I am a born and raised New Yorker, I love to read books that take place in NYC, so I was pretty excited to see a book called Lost in NYC, A Subway Adventure. The premise is simple enough - new kid to the city Pablo isn't very happy about his family's latest move to NYC's Upper West Side and has a real unfriendly, resentful attitude. His first day of school also happens to be the day his new class is traveling by subway to the Empire State Building and, as with all class trips, he is assigned a partner named Alicia.Her helpfulness and his indifference help get the two separated from the class and a subway adventure begins as Alicia and Pablo try to reconnect with the rest of the class. But then Pablo gets separated from Alicia and he finds himself lost and alone in NYC, in fact the loneliest he has ever felt. Will he ever find the rest of his class and will they still be as friendly as when he first met them, especially Alicia?Along with Pablo's subway adventure to the Empire State Building, there is a lot of information including a brief history of the former world's tallest building and how the subway was build. NYC is in the midst of building a Second Avenue subway, which is an underground train and, since Manhattan is all hard shale rock, there was blasting and drilling for way too long. But it was interesting to find out about all it is all done.Lost in NYC is a great book newcomers to the city like Pablo and his family, and for anyone who wants to visit but feels intimated by the subway system. The text does a wonderful job of showing how crowded and busy the trains are and Spiegelman and Sánchez been true to the different trains lines, explaining the difference between local and express, platforms where you can change from one train to the other. And I love that they used the actual subway map as their background, not just for the inside front and back cover, but they incorporated it into the story. And many of the images give a great, realistic overview of different parts of the subway as they relate to the story.This colorful graphic novel gives a wonderful perspective of the story that should appeal to young readers whether they live in NYC or not. Sánchez drew the graphics in orange pencil and ballpoint pen, and they were digitally colored by Lola Moral. The muted colors used are a perfect counterpoint to the bright colored lines that indicate the subway routes Pablo encounters on his subway odyssey.Be sure to look at the back matter, that includes information about the authors, the beginnings of it all, including subway construction, and a bit more history about the Empire State Building Lost in NYC is a delightful graphic story about adjusting to new surroundings, a new school and making new friends, not always an easy task for young kids.New York City kids learn how to ride the subway at a young age . I was pretty young when I went on my first solo ride, going from Brooklyn to Manhattan to visit my dad at work in the Museum of Natural History, and my Kiddo rode the subway every day to school when she was at Bard High School Early College. But I can understand how people could be intimated by the NYC subway, after all there are 488 stations servicing two lines that have a total of 22 subway routes - 7 numbered and 15 lettered routes. But if you come to NYC, get yourself a metro card, a subway map and if you really get lost, any New Yorker will be more than happy to help you find your way.This book is recommended for readers age 8+This book was borrowed from the NYPL"}, {"userName": "Samantha", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/1380067-samantha", "userReview": "Part history of the New York subway system, part new kid in a big city, part seek and find, part friendship story, this book has it all. Pablo begins yet another new school and is paired up with Alicia on the class field trip to the Empire State Building. Alicia is very welcoming, but Pablo has his defenses up because he's afraid that making a friend at this new school will make it difficult when his family moves again (which he believes they will).The pair becomes separated and must use their street smarts to make it to the Empire State Building to meet up with their class. What follows is a fabulous tour of the city and a happy ending.Back matter includes info regarding how the authors approached this book, including a cool seek and find aspect detailing the artist's own experience visiting the city, a history of the subway system complete with photos and drawings, and a look at a current subway project in the works.Highly recommended read for grades 3-5."}, {"userName": "Megan", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/4780569-megan", "userReview": "I found this book really recently for a dollar at my local library. I decided to buy it because I'm a sucker for little graphic novels (especially ones set in New York City!). This tells the story about Pablo, a new student, who goes on a field trip to the Empire State Building with his new friend Alicia. This book wasn't a bestseller or anything, but for the story that was provided in it about the city (with its facts and essentially celebrating New York) and dealing with constant changes in one's life (told through Pablo's experiences), I quite liked it. It was cute and silly and for the actual intended audience of middle schoolers, it would teach them a lot about different things in New York City (specifically the subway and the Empire State Building). I also liked the little bonus story about the artist and the cop. It was fun to go through the book and find them like in \"Where's Waldo?\"."}, {"userName": "paula", "userReviewDate": "May 05, 2015", "userURL": "http://www.goodreads.com/user/show/1543634-paula", "userReview": "I am buying this book for my whole family. I am possibly flying to Spain to get the artists to sign it. I am certainly bringing it with me to Book Expo at the end of the month to get the author to sign it. I may show up at her apartment. Sorry in advance, Nadja Spiegelman. You don't know me but I am not dangerous.I am, however a giant fan of the New York subway. When I moved to New York in 1994, I was so intimidated by the train I could have cried. And when I quickly discovered that not only is it easy to figure out, but people are extremely kind when you ask for help, I could have cried again. Most New Yorkers are to some extent subway nerds - they have opinions on the art that appears in the stations, the new design of the map (it'll always be the new map to some people), and which stations are best to switch at. I love subway conversations - the subway is the common denominator for all New Yorkers. Not every city has one.And the art. Is the coolest. Wow."}, {"userName": "Diz", "userReviewDate": "Jun 01, 2017", "userURL": "http://www.goodreads.com/user/show/37254007-diz", "userReview": "I really loved the illustrations in this book. The crowded subway platforms, the teeming city streets, and the fascinating cutaways of the subway system really bring New York City to life. The story, which focuses on a child who has just moved to New York, provides an easy to follow exploration of the New York City subway system. This is a great read for kids who are interested in trains."}, {"userName": "Melissa", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/1669005-melissa", "userReview": "Nice story; great vehicle for lots of information. End notes were terrific; I just wish more of them ended up in the main text somehow."}, {"userName": "Amy", "userReviewDate": "Dec 22, 2015", "userURL": "http://www.goodreads.com/user/show/217090-amy", "userReview": "This is a fascinating look at the New York City Subway system, as told from students, Alicia (a long-time resident of the city) and Pablo (someone who's just moved to the city). This somewhat intimidating mode of travel is a necessity for millions of New Yorker's who use this to move about the city on a daily basis. On the end paper at the beginning of the book is a detailed map of the subway system. The end paper at the end shows a detailed map of the city and where the characters were throughout. At the end of the book is a brief history of the New York Subways, including names of the trains and why certain letters do not exist, in the names of the trains.On the last page of the book, we learn that this is a \"Toon Graphics\" novel. This type of story is a graphic novel where the text and pictures are both created / produced by the authors. When the authors are also the artists, they can more effectively convey their creative vision with both pictures and words. This is a great tool for visual learners, like me. After reading this once, I went back and looked at everything, again. I picked up even more information, the second time around. Hint: Look at the pictures -- there are sometime pictures within pictures. Excellent!"}, {"userName": "Jess", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/847802-jess", "userReview": "Wonderful. A decent story about friendship within a book that's a love-note and explanation of NYC, the Empire State Building, and the Subway system. The well-done illustrations deserves all sorts of superlatives. They clearly inform, show movement and city life, and are fun to look at. The sort of pages that make you go slow and think at the close--let's reread that!Visually one of the best kid graphic novels I've seen. Highly recommended."}, {"userName": "Claire Talbot", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/1452207-claire-talbot", "userReview": "really enjoyed this graphic novel - aimed at older elementary, but works for middle school or interested adults as well. Loved the facts!"}, {"userName": "tony dillard jr", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/42161646-tony-dillard-jr", "userReview": "It's Pablo's first day at his new school. He's picked a great day to start because his class are going on a field trip to the Empire State Building! To get there, Pablo's class will have to take the subway. But when Pablo accidentally takes the wrong train, can he rely on what little knowledge of the subway routes he has in order to reunite with his classmates at 350 5th Avenue? Toon Graphics has done it again with this exciting look at the Big Apple. I learned a lot about the subway from this book by Nadja Spiegelman, like why there's both routes with letters and numbers. Add some very detailed artwork by Spanish illustrator Sergio Garcia Sanchez, this book is like an educational Where's Waldo? If the name Nadja Spiegelman sounds familiar, it's cause it does. The author of Lost in NYC is the daughter of legendary writer/artist Art Spiegelman (Maus.) She clearly has inherited some of Papa's writing talents. Usually a Toon Graphics book has 2-4 pages of fun facts, activities, and other fun stuff. Lost in NYC has no less than 10 pages! Are you and your little ones planning on a trip to the Big Apple? If so, this is the perfect book to get them properly acclimated to the city's most used method of transportation. It will make that trip so much more fun and memorable."}, {"userName": "Jordan Chisholm", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/79240569-jordan-chisholm", "userReview": "This book has won no awardsAppropriate grade level(s) are 1st-5thA young boy, Pablo gets lost in NYC! This story tells his tale of adventure and his experience in the city. With the use of fun facts, maps, and photos this book allows readers to explore the city without getting lost like Pablo.I liked this book. I really enjoyed the illustrations and the fun facts and photos included. One of my favorite things I discovered about this book is that it also comes in Spanish. I know many books have this option but this book made sure it was a well known fact that there are copies in Spanish.I would use this book if I had a theme about city v. country life. It's also a good book to let children explore on their own because they may not be familiar with this format."}, {"userName": "Cheyenne Long", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/76267783-cheyenne-long", "userReview": "This graphic novel follows a boy names Pablo who is new to NYC. On a field trip, he buddies up with a girl named Alicia and they get separated from their classmates. Eventually, Pablo ends up going on an unplanned, solo adventure through NYC. He knows he needs to meet back up with his class, but ends up going on a very interesting adventure to get there! With fun illustrations and an interesting storyline, this book is a great read and also is fairly quick! I would reccommend this book for 3rd and 4th grade students."}, {"userName": "Adan", "userReviewDate": "Jul 06, 2017", "userURL": "http://www.goodreads.com/user/show/7761071-adan", "userReview": "An awesome book about the NYC subway system, designed for young readers to learn about the subway and the Empire State Building. Spiegelman's writing is crisp and clear, but Sámchez's art is amazing. He crams tons of little New York details into every page, and even weaved a small background story throughout the book featuring himself and a police officer that gets a resolution at about the same time as the main story. Just excellent all around."}, {"userName": "Miss Sarah", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/42189461-miss-sarah", "userReview": "An interesting graphic novel that follows a class on their school fieldtrip to the Empire State Building through the New York City Subway system. I would have liked a few more words and at times the movement in the pictures wasn't as clear as I'd like but it is visually stunning and tells a cute story of all the ways to take the subway to the Empire State Building. Great introduction to the Subway system and great nonfiction facts at the back. early elementary."}, {"userName": "Emilia P", "userReviewDate": "Nov 20, 2017", "userURL": "http://www.goodreads.com/user/show/76042-emilia-p", "userReview": "Definitely went and picked this up because 1) Sasha Velour who worked on editing it (as Steinberg, my high school classmate) was on the editorial team, and because we were headed to ride the rails of NYC ourselves. It was a little advanced for a 3 year old and it ended a little quickly for a grown lady, but it was cool, colorful, vibrant, and took chances without being impossibly experimental. Toon Books are often a delight in that regard. :)"}, {"userName": "BiblioBickie", "userReviewDate": "Dec 01, 2017", "userURL": "http://www.goodreads.com/user/show/27261875-bibliobickie", "userReview": "Nice fiction/non-fiction meld, including lots of cool facts about the NYC subway system. Kids getting lost is not too scary, more slapstick comedy with people on passing trains. Cool illustrations, some with the children moving through the crowd, turning up in different places in the same large panel."}, {"userName": "Jo Oehrlein", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/7367573-jo-oehrlein", "userReview": "The NYC subway, the Empire State Building, and the importance of friends and home.New student Pablo and his buddy Alicia get separated from their class on a field trip to the Empire State Building."}, {"userName": "Marion", "userReviewDate": "Dec 09, 2017", "userURL": "http://www.goodreads.com/user/show/16030-marion", "userReview": "I was excited about this because it’s by Spiegelman and takes place in NYC. I definitely enjoyed the aspects about the train and the graphics were super cool. But the characters were overly simplistic, which was a bummer."}, {"userName": "Tessa Baer", "userReviewDate": "Mar 08, 2017", "userURL": "http://www.goodreads.com/user/show/42368344-tessa-baer", "userReview": "Storyline was well done, especially for children. It was a little hard to follow at times though. It didn't seem to follow the general layout for graphic novels/comics."}, {"userName": "Jen", "userReviewDate": "May 06, 2017", "userURL": "http://www.goodreads.com/user/show/3685998-jen", "userReview": "I'm amazed at how this comic managed to make me feel so engaged with these characters in such a short period of time! Really enjoyed this!"}, {"userName": "Denise", "userReviewDate": "May 23, 2018", "userURL": "http://www.goodreads.com/user/show/612758-denise", "userReview": "I love this book.It is richly illustrated and has a great message.There's a little observational puzzle involved, too.A winner."}, {"userName": "Steph", "userReviewDate": "Jun 07, 2017", "userURL": "http://www.goodreads.com/user/show/2612079-steph", "userReview": "4.5 starsInsanely cool graphic novel!"}, {"userName": "Brigid", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/3314243-brigid", "userReview": "It's about friendship, home, adventure, and the NYC subway."}, {"userName": "Karen Goldman", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/63765474-karen-goldman", "userReview": "Bright, colorful graphics and maps. Subway map on front cover followed by short graphic novel. Includes brief history of the subway.Informational text combined with graphic novel."}, {"userName": "Mariana", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/70601829-mariana", "userReview": "Nice book. My sister read it. And she loved it."}, {"userName": "Morgan", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/7910435-morgan", "userReview": "Genre: Graphic Novel, Realistic fiction (made up characters but with a plot that could happen in real life)Target Audience: intermediate Making Connections:-Text to self: While I've never been to NYC I have been to a few large cities both in the country and internationally. Chicago has a large subway system with different rails that take you all over the city. I remember being so confused as to where to go, so I just ended up following my Dad since he was knowledgeable of the city. This past winter I spent a few days in Oslo, Norway where I used their train system daily. Luckily their system is very user friendly and I was able to use my friend for some help. But regardless I still got on the wrong train just like Pablo and I had to figure out how to get back on track to where I'm intending to go. -Text to text: While reading this story I couldn't help but think back to one of the nonfiction books I read called \"Buses in Action\". I felt like Pablo could have really benefited if he had the chance to read a book like the nonfiction one I read because it explains the public transportation system. Maybe if Pablo had built up his knowledge and read about the public transportation in NYC he might not have gotten so lost. -Text to World: This story lets children explore the subway system and get a look at what public transportation is like in a large city. I know that personally growing up here around the city of Omaha where people typically drive themselves, I have limited knowledge on public transportation. Since there are cities all over the world I believe this book is very relevant for both those who come from urban and rural backgrounds. Regardless of where we are born, most of us will experience getting lost in a city at least once."}, {"userName": "Bailey Pofahl", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/63685838-bailey-pofahl", "userReview": "Copyright: 2015Genre: I would classify this graphic novel as Fiction. Under the umbrella of Fiction I would classify this as Realistic Fiction. This story would be realistic for kids growing up in larger cities that have public transportation systems like the subway in New York City. For children who are not growing up in these sorts of cities the story can still be realistic because they can still be separated from parents or other trusted adults. Target Audience: I would likely use this graphic novel for kids at the intermediate level (3-6) because the topics of this story are pretty advanced. While I believe it is important for younger children to learn about what to do if separated from trusted adults, this graphic novel in particular would be too difficult for them to read and comprehend. Connections: *Text to Self: I can connect with the topic of this story because I was once separated from my class during a field trip. In 3rd grade my class traveled to the zoo for a class field trip. In the middle of a crowd I was separated from my class and began to panic. I believe if teachers read this book to their class before going on a big trip, and then discussed what students should do if they do somehow get separated, it would be very beneficial. I know I would have appreciated it. *Text to Text: Growing up, my mom would always read my brother and I stories about realistic situations and what to do if we ever found ourselves in one. The story that came to mind when I found this graphic novel was \"The Berenstain Bears Learn About Strangers\" by Jan Berenstein. In this book, the cubs are learning about situations in which it is and is not okay to talk to and trust strangers. Papa Bear spends the entire book teaching the cubs about strangers. I feel as though these two texts would connect to each other because they could both be used when teaching the topic of stranger danger to elementary aged kids. *Text to World: I would connect this book to the public transportation system, and the dangers that go along with them, that can be found all over the country. Some kids, especially those here in Nebraska, might not be aware of the advanced public transportation systems that are all over the country. This book would be a great opportunity to discuss these transportation systems with students and give them basic skills that could help them maneuver through the systems if they ever found themselves in situations which that would be necessary."}], "description": "Also available in Spanish as Perdidos en NYC: una aventura en el metroThe sights . . . the sounds . . . the SMELLS! New York's crowded subway system is known for many things, but being easy on a lost kid isn't one of them. When Pablo gets separated from his new schoolmates during his first field trip in New York City, he doesn't know how he'll be able to find them again. Luckily, he has a little knowledge, a new friend, and the surprisingly approachable city itself to guide his way. This story features maps, archival photos, and fascinating facts to help readers explore the subway without ever having to get caught like Pablo in the mob of Times Square. It brings all the bustle and beauty of NYC to young readers around the world.This story is also available in Spanish as Perdidos en NYC: una aventura en el metro", "title": "Lost in NYC: A Subway Adventure: A TOON Graphic\n      \n          (TOON Graphic Novels)", "url": "http://www.goodreads.com/book/show/23129979-lost-in-nyc", "average": 4.02, "cover": "https://images.gr-assets.com/books/1414003121l/23129979.jpg", "reviews": 175, "authors": [{"url": "https://www.goodreads.com/author/show/3307246.Nadja_Spiegelman", "name": "Nadja Spiegelman"}, {"url": "https://www.goodreads.com/author/show/5570238.Sergio_Garc_a_S_nchez", "name": "Sergio García Sánchez"}], "type": ["Sequential Art", "Childrens", "Adventure", "Childrens", "Sequential Art"], "outlinks": ["http://www.goodreads.com/book/show/23129979-lost-in-nyc", "http://www.goodreads.com/book/show/29885567-lost-in-nyc", "http://www.goodreads.com/book/show/28110154-i-m-supposed-to-protect-you-from-all-this", "http://www.goodreads.com/book/show/7536321-zig-and-wikki-in-something-ate-my-homework", "http://www.goodreads.com/book/show/12909353-zig-and-wikki-in-the-cow", "http://www.goodreads.com/book/show/39918834-i-m-supposed-to-protect-you-from-all-this", "http://www.goodreads.com/book/show/33985694-resist"]}