{"ratings": 404, "userreviews": [{"userName": "Hannah", "userReviewDate": "Oct 28, 2014", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "I really enjoyed this. There weren't huge fireworks in the story, but it was more of a sweet, humorous, chaste romance. I loved the rich historical detail included; it made me want to go visit someday! This is my second book from the Love Finds You series, and even though it's a tale of the girl's parents trying to marry her off, the romance is actually balanced and interesting and mostly subtle. Yes, the heroine and hero are drawn to each other; but no overly dramatic sexy attractions...rather, a deep personal attraction that feels much more realistic. Despite many obstacles, the story is believable throughout, and the writing is excellent. The secondary characters are some of the most well-drawn ones I've read about. The setting is excellently done, so I could picture each scene just as vividly as though watching a movie."}, {"userName": "Jamie", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/8586696-jamie", "userReview": "Let’s just say if I was born in any other era, I would have failed miserably. The rules of old society are ridiculous to me. I guess in some ways it isn’t much different than today in some circles, but it’s so insane to think of how many sons and daughters were married off to keep standing in social circles and society. Forget love, it was about family duty and name. I’m all about loyalty, but the back-in-the-day demands are too much for me. As Destiny’s Child would say “all the women independent, throw your hands up in the air.” (Blame that reference on the recent reunion of the R&B Girls Group of my high school days).This refreshing story by Melanie Dobson takes place in just that era. Love Finds You in Mackinac Island, Michigan was such a sweet story that I seriously enjoyed!It’s the height of the Gilded Age, but Elena Bissette’s family has lost most of its fortune. The Bissettes still own a home on fashionable Mackinac Island, and they spend summers there in hopes of introducing Elena to a wealthy suitor. Quickly tiring of the extravagant balls at the Grand Hotel, she spends her days walking along the island’s rugged coastline. There she meets Chase, a young fisherman who invites her to watch the ships from an abandoned lighthouse. The two begin to meet there in secret, hoping to solve a decades-old mystery. Meanwhile, Elena’s mother contrives introductions between Elena and the island’s most eligible bachelor, an elusive millionaire named Chester Darrington. When Elena’s two worlds unexpectedly collide, she will be in for the surprise of her life.I really loved Elena’s character. She has a free spirit and wants to do her heart tells her to do, but doesn’t completely ignore the struggle she has with her duty. She loves her family, but longs for something more than what society demands of girls her age and in her station.And was there some drama! No matter what era, you can always depend on a little scandal!So if you’re looking for an entertaining read that leaves you smiling, I say go for it with this one!booksandbeverages.wordpress.com"}, {"userName": "Alisha", "userReviewDate": "Feb 15, 2015", "userURL": "http://www.goodreads.com/user/show/1790086-alisha", "userReview": "On the surface this is one of a million \"Christian romance\" books, and I found the title almost off-putting because it seems too cookie-cutter (endless sequels could be written with people finding love in Toledo, Scranton, Des Moines, oh my!) but I gave it a chance and it turned out to be a pleasant, easy read with a likable, intelligent heroine and a few well defined side characters who mostly turn out to be flawed but redeemable. The writing is fairly natural and not strained, as sometimes happens with a period setting.I would read this author again. In fact, I probably will!** The GoodReads synopsis is inaccurate on a number of counts. Chase does not even pretend to be a fisherman, he doesn't invite Elena to the lighthouse because it's already been her private haunt for years, they're not looking for ships, they don't really talk about the \"mystery\" until near the end, and it actually doesn't matter that much to the story."}, {"userName": "Courtney", "userReviewDate": "Jan 24, 2018", "userURL": "http://www.goodreads.com/user/show/64111391-courtney", "userReview": "Melanie Dobson is a new author for me, but I thoroughly enjoyed this story and the wonderful characters that filled it. It's hard to find good, wholesome writing in the secular world that we live in; however, this story went against the odds and was truly beautiful.\"The Masquerade\" was a story that did not reflect the picture on the cover or the image that comes to mind when hearing the name. Typically when one hears about a masquerade they think about dancing and fancy masks, but in this tale that was not the case at all. This story was about a lovely young girl, looking to help her family- even if it means marrying someone she doesn't love; and an handsome gentleman, who is determined to keep his heart to himself- nobody after his family money will fool him. This novel will make you remember the cliche, 'don't judge a book by it's cover,' for that is exactly what the two main characters had done; however, like every good story, a happy ending can just be around the corner!"}, {"userName": "Dawn", "userReviewDate": "May 13, 2012", "userURL": "http://www.goodreads.com/user/show/5268629-dawn", "userReview": "Again, I’m going to start this post out with a list of confessions. First of all, Melanie Dobson is a completely new author to me. Secondly, I’ve never read one of the “Love Finds You” books before, although I am friends with a few authors who have written a some of them. And thirdly, I don’t think I’ve ever read a book published by Summerside Press. So… as always when I do such daring things, I hoped for the best and dove right in.I love reading a really good book. And I especially love reading a really good historical romance that takes place during the Gilded Age. It’s what I’ve been called to write myself and it makes me so happy to see the subgenre take off as it has in the last few years. Oh, and in case you were wondering… Love Finds You in Mackinac Island Michigan delivered on both counts. I flew through this book once I started it. I couldn’t put it down. The writing, the characters and the setting all made me want to keep reading and reading. EVEN THOUGH the hero and heroine did not meet until page 140… which was roughly about halfway through. It kind of made me impatient at times, but it did nothing to make me like the book less.It was a little creepy that the premise was much like the next book I have on the docket to write. But as always, when this seems to happen, I remind myself that a dozen writers can go about writing the same premise in a dozen completely differing ways… and that mine would be from first person point of view. I also remind myself that, since this happens often, I must be good at thinking up the kinds of stories that sell. Which is not a bad thing to consider.The only thing I would have changed about this book… besides having the hero and heroine meet so late in the book… is their amount of time together before deciding they were in love with one another. I know it isn’t impossible for two people to fall in love in two meetings that consisted of eight hours’ time, but I would have liked to see more of their time spent together. But again, this wasn’t enough to keep me from adoring the book.I will definitely be looking into reading more of Melanie Dobson’s books in the near future.I would like to thank Litfuse Publicity for giving me a free paperback copy of Melanie Dobson’s Love Finds You in Mackinac Island Michigan in exchange for my honest opinion in this writer’s review. I give this book 5 stars."}, {"userName": "Melanie", "userReviewDate": "May 12, 2012", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "Review to be posted on my blog 8/02Review on Amazon: http://www.amazon.com/review/R2Q716UU...I'm not positive, but I think \"Love Finds You In Mackinac Island, Michigan\" is the first \"Love Finds You\" book I've read. If the rest of them are as good as this one, I've truly been missing out!I loved the characters, setting, story - the whole book! It was very enjoyable and interesting to read. After reading this book, I'd love to visit Mackinac Island, Michigan - it sounds gorgeous.I found it really funny that Chase and Chester Darrington were the same man, but Elana found herself falling for Chase and dreading to meet Chester.\"Love Finds You In Mackinac Island, Michigan\" was slightly predictable, but it still held my attention throughout and, once it was finished, left me wanting more - I really loved the characters and am hoping for another book with them.This is the second book I've read by Melanie Dobson (the first being \"Refuge on Crescent Hill\") and definitely my favorite so far! I look forward to reading more of her novels in the future.I recommend \"Love Finds You In Mackinac Island, Michigan\" if you enjoy historical romances and/or \"Love Finds You\" books. It is a great one!*I received this book for free for my review. I was not required to give a positive review, only my honest opinion - which I've done. All thoughts and opinions expressed are my own.*"}, {"userName": "Angie Thompson", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/73917882-angie-thompson", "userReview": "[For example, Elena continuing to go to the lighthouse in the hope of meeting Chase--even though nothing happened between them and she felt safe with him, it was an extremely unwise choice. At the very least, she was risking both their reputations. Also, the fact that she continued to try to be around Chase while planning to marry another man was extremely irresponsible and just as bad as Parker leading Jillian on when he knew he couldn't and wouldn't marry her. Stuffy society roles aside, they were putting themselves in compromising situations and endangering other people by their carelessness.I also felt like things resolved a little too quickly at the end. I would have liked to see them talk more and recover trust gradually instead of clearing up the misunderstanding and becoming engaged in the space of a few sentences. I did appreciate the way the ladies came together at the end, though. :) (hide spoiler)]"}, {"userName": "Melissa Wardwell", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/36349727-melissa-wardwell", "userReview": "Welcome to my homeBeing a Michigan resident, it was a joy to read about our beloved Island. The love stories Crafted in this timeless setting were fitting and beautiful. I could see each place mentioned and feel each emotion written. Thank you for sharing your craft with so many"}, {"userName": "Bess", "userReviewDate": "Apr 03, 2018", "userURL": "http://www.goodreads.com/user/show/37606174-bess", "userReview": "I really enjoyed Chase & Elena's story! I was a tad confused about the what seemed irrelevant letters that popped up here and there. I guess they told their own story and the shared lighthouse. Either way, I had a great trip to the island and enjoyed my stay there!"}, {"userName": "Tina", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/1040491-tina", "userReview": "I really enjoyed this one! I especially liked the \"story inside the story\" element. I've read books like that before and it adds that special something to the storyline...almost like two books in one. ;-) A couple of surprises written in added some unpredictability to the story, as well. I will definitely read the next books in this series by Melanie Dobson!"}, {"userName": "Vera Godley", "userReviewDate": "Jul 12, 2012", "userURL": "http://www.goodreads.com/user/show/6214962-vera-godley", "userReview": "My thoughts: Get ready for a trip back to the Gilded Age when ladies were ladies and did not deviate from their ordained positions. Get ready to see the snobbery of monied class amongst themselves and most definitely toward the masses of those not so fortunate as to have expendable fortunes.Travel back to a time and era when life was gentle, slower, and gracious. But also journey into a world when marriages were made solely for the purpose of ensuring class and fortune it's rightful place.Elena is a beautiful, gracious, obedient daughter whose family fortune has nearly completely vanished and who is on the cusp of losing everything. Elena is an only child and it is up to her to marry into money to save the family. Chester is the man of the hour and the eligible bachelor whom every mother is trying to marry their daughter to. Elena's mother is trying desperately to have Elena and Chester meet in the right circumstances that present Elena as the optimum lady for Chester to marry.As obedient as Elena is to the plight that she faces in order to save hr family, she is also an entirely different person than anyone seems to know. Elena loves to escape at night into the beauty of God's creation and enjoy the wonder of Creation - especially the creation of God's stars.One such evening adventure takes her to her favorite escape hideaway - the lighthouse. While there, another arrives. A man named Chase who doesn't frighten her and who is somewhat aloof. You see, he, too enjoys God's creation and especially the stars. Elena and Chase develop a tentative, innocent relationship that exists only at the lighthouse. The beauty and quaint atmosphere of Mackinac Island in Michigan is beautifully described by Dobson as she unfolds the character of the lovely Elena and the pragmatic Chase.A shattering episode explodes and disrupts it all, each heart breaks, and they go different directions. Then more sorrow comes Elena's way. Can it all be resolved?BOOK GIVEAWAY ONLY HERE AT CHAT WITH VERA http://chatwithvera.blogspot.com/2012... - Litfuse Publicity Group on behalf of the author and publisher will mail 1 of Chat With Vera's readers their very own copy of Love Finds You in Mackinac Island Michigan. Open for USA only. Easy entries: Begins July 18 and ENDS August 8 at 12:00 Noon EDT.DISCLOSURE: I was provided a complimentary copy for the purpose of rendering an honest review from the good folks at Litfuse Publicity Group on behalf of the publisher and the author. Litfuse is also providing a free copy to a reader of Chat With Vera in the giveaway. I was not reimbursed monetarily for this review."}, {"userName": "Patricia Kemp Blackmon", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/5314062-patricia-kemp-blackmon", "userReview": "1894, Elena Bissette feels obligated to marry into wealth because she knows this is what her parents expect. Well, that is what her mother expects. Her father seems to only wish his little girl be happy with the man she chooses to be her husband.Every summer Elena and her parents go to Mackinac Island, Michigan to stay in their vacation cottage, which is really more like a mansion. Her mother is so excited for Elena to meet Chester Darrington. He is a very sought after unattached, handsome and extremely wealthy. Quite the catch. But rumors are spreading that Elena's mother is out to snag him to marry her daughter just for his wealth. Which is true. But Elena only attends all the tea parties and social gatherings to appease her mother. Elena should have been an actress because she can put on a good show of a proper lady.Now Elena would much rather wander through the woods after dark and visit the islands old lighthouse. The lighthouse gives her more of a view of the island but most of all to the stars. One day she finds a very handsome gentleman in her lighthouse and he has found her drawings. When he sets his eyes on Elena he is mesmerized by her beauty. As they spend more time together at the lighthouse their hearts recognize feelings are strong for each other. But they did not share the truth about their identities. She had no idea he was the wealthy catch her mother was after and he had no idea she was the daughter of the woman that was out to trap him into marriage that was of no interest to him. What a mess!There has been said that there is a ghost in the lighthouse. So much sorrow and tragedy is the tale about a woman and her two small children in the early 1800's during the British invasion. The woman's husband is missing and her cries for him can be felt by Elena each time she enters the lighthouse.Another interesting fact that the author provided about the island was that even to this day no automobiles are allowed on the island.Love Finds You in Mackinac Island, Michigan will be another of my favorites. The author put her talent of writing together with historical facts and wrote a wonderful novel. I must say I have never heard of Mackinac Island but after reading this book I will remember it fondly along with the characters in this book.I highly recommend this book.I rated this book a 5 out of 5.DisclosureI received a free copy of this book for review by Litfuse/Summerside. I was in no way compensated for this review. It is my own opinion."}, {"userName": "Ibjoy1953 Hannabass", "userReviewDate": "Aug 04, 2012", "userURL": "http://www.goodreads.com/user/show/5101390-ibjoy1953-hannabass", "userReview": "MY THOUGHTS ON THIS BOOKElena’s family trip to Mackinac Island this summer will be different than all of the others. This time, her mother has in mind to marry her off to the rich and famous Chester Darrington in order to save their family business. Elena has no desire to marry this Mr. Darrington, or even meet him for that matter.Chase didn’t really want to make the trip to Mackinac Island with his sister and her husband, but he did want a place to try out the new telescope that the family business was interesting in funding for the invention. One of the first things he heard upon his arrival was his hopeful marriage to this Elena Bissette. Well, he would stay as far away from Elena as possible because he sure wasn’t looking for a wife, and especially someone like her.Not knowing who each other is, Chase and Elena meet up at an old lighthouse on the Island. One in which Elena has been visiting for all of the years her family has been coming to the Island and one that Chase has just found. The attraction between the two is a sure thing, Chase liking Elena because she’s not one of the “circle” which his sister is in. And Elena liking Chase because of pretty much the same reason.In Love Finds You In Mackinac Island, Michigan, Melanie Dobson weaves a historical romance that will keep you on your toes throughout the book. The meeting and relationship of Chase and Elena was sweet and adorable at first, that is until the truth about who each was came to surface. That’s when things get touchy between the two and neither want to see each other again! But Chase’s mom had a different idea. Can she bring these two back together again? Or is Chase just too stubborn to face the real truth?This is a wonderful and sweet story that I thoroughly enjoyed. It’s one of those stories that just make you feel good after reading it. The characters are so real they feel like family and friends. I love Chase and Elena, and I love their attitude about their wealthy families. And Chase’s mom was the character that really pulled everything together. Her attitude about gossip shamed me, and one thing I took away from this book is to gossip, or listen to gossip less, and look at the positive sides of people. I really appreciate Melanie bringing this valuable lesson to her readers about this subject.I highly recommend this book for you to read and enjoy for yourself. It will make a wonderful summer read, but its not just for summer, it will make an awesome read anytime! And you sure will not be disappointed."}, {"userName": "Courtney", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/4881034-courtney", "userReview": "This is the first time that I have read a book by this author and I was pleasantly surprised at how much I enjoyed the story. I also have never read a Love Finds You book even though I have probably about 3 on my shelf currently. In this story we meet a young girl that has an obligation to marry a wealthy man to save her family from financial ruins. This scenario is probably one of my favorite settings. For some reason I am fascinated with the Victorian theme and this idea of marrying for status. I am thankful that is not a idea we support today though.There are so many things I loved about this book but probably my favorite aspect is the meeting place of the two main characters. They meet in a lighthouse and the setting just sounds so romantic and mysterious. They don't give out their real names and they meet in the dead of night! I instantly fell in love with both the hero and the heroin although sometimes I was a little irritated with Chase's behavior outside the lighthouse. Another great aspect of the book is the diary they find in the lighthouse. I wish they went a little deeper in to that story but it added a great element to everything.This book reminds me a lot of Cara Lynn James and her summer series. Both books the wealthy families all summer at some waterfront property and there is gossip, romance, and a bit of mystery to solve! There is lots of detail, history and spiritual tones throughout the book that just add to this great story! I loved the ending and the struggle the two characters faced on forgiveness, truth and grace!! Amazing example of allowing God to heal you! Even though this is my first book by Melanie Dobson, it won't be my last!! Disclosure of Material Connection: I received this book free from Litfuse Publicity Group for this review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255 : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Kathy * Bookworm Nation", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/1075341-kathy-bookworm-nation", "userReview": "I’ve been seeing these Love Finds You books all over lately and I thought this one had a fun premise so I decided to give it a try. I wasn’t disappointed, it was a charming story. I really liked the setting, and if I’m ever in Michigan again I will for sure check out Mackinac Island. Our main character Elena was pretty likable. She tries really hard to make her parents proud and to be a proper lady. But, on the inside she just wants to be free, has a love for life and is a kind soul. I also liked Chase; although he is extremely wealthy he was really down to earth and appreciated the little things in life. They both hear things about the other and start to form prejudices before they even meet. Then one night they do meet, but neither knows who the other really is. They bond over their love of astronomy. As for Elena and Chase together, I was a bit disappointed. I was about 40% into the book before Elena and Chase even meet, and then they only meet a couple of times. I just didn’t buy them falling in love. Sure they had a similar interest in the stars, but really what else? Were they really in love or just in love with the idea of escaping what was expected of them? I guess I could understand why he was upset when he found out who Elena was. But, I was upset with how he handled Elena’s attack. I mean, he never even outwardly showed concern or asked how she was. That bugged me. Since we get to see the two separately throughout the book I definitely came to like them, but I think if I could have seen them together more I would have believed in them as a couple more. Overall, I thought it was an enjoyable story. It was really well written and I felt like I took a step back into time. It was a charming story with likable characters, even the stuffy ladies. Oh, and I loved Chase’s mom Lydia! Content: Clean. An attempted rape with little detail and stopped early on."}, {"userName": "L_manning", "userReviewDate": "Nov 08, 2012", "userURL": "http://www.goodreads.com/user/show/5107412-l-manning", "userReview": "Elena wants nothing more than to be able to marry for love. She is feeling pressure to marry for money though. Her once wealthy family is now teetering on bankruptcy, and this may be her last summer in the beautiful Mackinac Island, Michigan. Elena's mother is pressuring her to try to gain the attentions of the very rich entrepreneur Chester Darrington. On an nighttime escape to her favorite lighthouse though, she meets the mysterious Chase. Chase and Elena feel an immediate draw to each other. Will Elena follow her heart or her head? This was a really sweet book. This was a great combination of history, romance, and even a little mystery. Elena is a bit \"modern\" in sensibility, and you can relate to her struggle between heart and head. The fact that she gives so much consideration to trying to meet Chester Darrington proves her devotion and love for her family. This made her struggle with her attraction to Chase even more difficult. Elena was overall a very compassionate and loving individual, and this makes you really cheer for her to get everything she wants and more. I also loved the idea that she had a place to go and be herself in the lighthouse. Sometimes I think we all wish we could have a place like that. The fact that she met Chase there made it seem even more apparent that they were meant to be.There was some side mystery with the journal that was found in the lighthouse. I admit to being the tiniest confused at the resolution of that story. I did like the way it showed the history of the island in an interesting way though. This was the perfect book to relax with. It kept my interest, and I found it to be very entertaining. Lovers of romance and history will find a lot to enjoy in this book. It made me want to check out other books in this series also, so I definitely found it enjoyable.Book provided for review."}, {"userName": "Trish", "userReviewDate": "May 24, 2012", "userURL": "http://www.goodreads.com/user/show/5938718-trish", "userReview": "Love Finds You in Mackinac Island, Michigan by Melanie Dobson is part of the Love Finds You series from Summerside Press. Each book is a standalone story set in a different town in the United States and draws on the unique character and history of each place to set the tone.As the summer of 1894 begins, Elena Bissette is standing on the windy deck of a boat that is making its way to Mackinac Island, a popular vacation spot for Midwestern society’s elite. Elena has been coming here with her family every year for as long as she can remember, but this year is different. This year the Bissette family is reeling from a series of business disasters that have left them on the brink of bankruptcy, and Elena’s mother is convinced that only an advantageous marriage between Elena and the illustrious Chester Darrington will save them.Unfortunately for her mother’s hopes, Elena is the sort of girl who is not interested in falling all over young men; she would rather sneak out at night to watch the stars from the island’s old lighthouse. And Mr. Darrington is much more interested in finding the next great invention than in being tricked into marriage by someone who is only interested in his money and place in society.Although Elena is not looking for love, it finds her in Chase, a young man whom she meets at the lighthouse. While they are watching the stars and trying to solve the mystery hidden within the diary of the previous lighthouse tenants, her mother is continuing her attempts to introduce Elena to Chester Darrington.Despite following a well-worn path in terms of both characters and plot, Love Finds You in Mackinac Island, Michigan is an enjoyable novel with a charming setting, and I found it to be a delightful diversion in the middle of a summer week."}, {"userName": "Michelle", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/369732-michelle", "userReview": "I've read a number of books by this author and have enjoyed them all. This is not my fav by any stretch, however, it's still an insightful read that includes a lot of interesting detail about the time period. I like reading about people and society during the Gilded Age. The sharing and discovery of an old diary with the mysterious ending was a nice touch. The romantic tension was light, but present. I loved the investor and invention theme in the story and the romantic lighthouse setting.I had a bit of a hard time believing the ruse, but the author made a valiant effort to have the scenario work out. I've always found the idea of marrying to keep the family finances afloat versus because you actually loved the person an interesting concept. That's probably the most common theme for this time period. I have issues with the whole stuffy Victorian theme from that time, but I'm sure there was a lot of pressure to playact your role if you were a member of polite society. I wasn't as drawn to the hero and heroine in this book as separate individuals, but every time the author put them together it kept me wanting to turn the pages. As in all of Melanie's books, there is plenty of rich detail, culture, and history in her stories. I always feel like I learn something I didn't know before when I read her books. That's probably my favorite thing about this author's stories. She educates me and does it subtly through a good story. She also has a solid spiritual thread in each of her books. This one was deeper than most, and I especially liked the healing theme of the broken relationships at the end."}, {"userName": "Brenda", "userReviewDate": "Aug 05, 2012", "userURL": "http://www.goodreads.com/user/show/754448-brenda", "userReview": "I have been a fan of the \"Love Finds You\" series for quite some time, because I always enjoy the varied settings of the story. With this one we are transported to Mackinac Island, Michigan during the late 1800's. Elena Bissette's family wealth is just about gone, but they still own their vacation home on Mackinac Island and decide to spend one last summer there with the hopes that Elena will capture the attention of Chester Darrington a most suitable match, because of his financial status. Thing is Elena has met someone whom she feels drawn to, and really doesn't want to meet Chester. Will she do as her parents wish and try and make a match with Chester, or will she follow her heart?I was totally excited to read this book. First and foremost the cover of this one really beautiful. Ever look at a cover and feel relaxed by the colors and scene depicted, well that how I felt every time I looked at this book, and while the cover really drew me in it was the story written in the pages of the book that really makes this book a true winner.This book really transported me back in time. I enjoyed the rich details of the area as well as the historical aspects of the story. One of my favorite aspects of the story happened to be the diary entries, which allowed us to glimpse the early 1800's. The characters were very well written and the author provides a few unexpected twists that really added to the plot.Historical fiction that weaves together mystery, romance as well as great setting to make this one a grandtastic read!"}, {"userName": "Naomi", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/7365303-naomi", "userReview": "What an enjoyable story about the gilded age.I could really envision the scenery on the Island and the trips to the light house in the story at night were so risky for that era.Overall a nice light read."}, {"userName": "Kati", "userReviewDate": "Jul 30, 2012", "userURL": "http://www.goodreads.com/user/show/946557-kati", "userReview": "Made me want to go back and visit Mackinac Island again ... it's been a long time since I was there."}, {"userName": "Sherri Smith", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/16981791-sherri-smith", "userReview": "I absolutely LOVED this book! After a series of not so great books by other authors, it is always a delight to stumble upon a hidden jewel on my kindle.The story is about the Bissette family, primarily Elena. Set in a time at the end of the gilded age (which was during the 1920's and 30's), they have a home on Mackinac Island and Elena fears it is their last one there. The family fortune is gone and now it is up to Elena to marry someone with money, primarily Chester Darrington.With her mother destined to marry her off to Mr. Darrington, Elena wants nothing more than just to be herself. Now that she is back on the island, she goes in the evenings back to the abandoned lighthouse she was introduced to many years before and finds solace and peace with God.One evening, she meets a young man, a stranger, who loves that she loves the stars as much as he does. A friendship on their brief meetings develops and soon love grows. Unfortunately, they both are hiding beneath a masquerade that will do nothing but cause trouble when the truth is know.This book captured my interest from the very first chapter and soon, I found myself lost within the pages wondering which direction the story was going to go. When I wasn't reading the book, I was left wondering when I could finish the book. Could I do it as I stirred the soup on the stove? The answer was yes, but I couldn't concentrate. But finally, I was able to finish the book and set it aside and immediately texted my mom and told her about it. A must read.I'm hoping there is a story out there about Jillian and her love, because my guess is that it would be just as fascinating as Elena's.I downloaded this book with no influence from authors or publishers. This was my own choice."}, {"userName": "Lori", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/11317361-lori", "userReview": "This was my first book by Melanie Dobson, and I am already thinking about reading another. Although I thought the first few chapters started a bit slowly, it didn't take long before the story completely sucked me in! There were times when I didn't want to put it down, and I hated to see it end. I really enjoyed the historical details and loved the way Ms. Dobson pulled the two storylines together."}, {"userName": "Kelly K", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/7909304-kelly-k", "userReview": "A cute story that really takes you back to the early days of life on the island. I decided to read this because I'll be visiting Mackinac Island soon and thought it would be fun to read a book set there. I felt like the ending was a bit rushed for two characters who took half of the book to meet but it was a fun and light read."}, {"userName": "Beverly", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/40886485-beverly", "userReview": "This was a perfect summer vacation read! Not only because it was set during the summer season on Mackinac Island, but also because of the joyous descriptions of revealing in creation, especially the night skies. Romance, individuals struggling to be themselves in the midst of high society's rules and expectations, mystery, history. Everything to make a good read during on August holiday trip!"}, {"userName": "Diana Maculan", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/51464984-diana-maculan", "userReview": "This book caught my attention as it takes place on Mackinac Island. I have been there myself a few times and each time is as magical as the time before. It feels like you are stepping back in time. Descriptions in the book were spot on, and history was woven in nicely. Light romance and mystery. Enjoyed it."}, {"userName": "Rachel", "userReviewDate": "May 27, 2018", "userURL": "http://www.goodreads.com/user/show/29905436-rachel", "userReview": "Very endearing storyThe plot is nothing new, not and girl meet, his their identities, and are hurt when the truth comes out. What sets this take apart is how God factors in, and how society plays, or doesn't, a role. It took me a while to get hooked, but then I wanted to know how the difficulties would be resolved."}, {"userName": "Pam Ecrement", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/51450558-pam-ecrement", "userReview": "Melanie Dobson's love stories never disappoint and this one will be no different. This one set in the beautiful setting of Mackinac Island is a delightful read!"}, {"userName": "Victor Gentile", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/2528881-victor-gentile", "userReview": "Melanie Dobson in her new book, “Love Finds You in Mackinac Island, Michigan” published by Summerside Press takes us to Mackinac Island, Michigan in 1894 and into the life of Elena Bissette.From the back cover: Love finds youAs the Gilded Age comes to a close, Elena Bissette’s once-wealthy family has nearly lost its fortune. The Bissettes still own a home on fashionable Mackinac Island, where they will spend one last summer in the hope of introducing Elena to a wealthy suitor. But Elena is repulsed by the idea of marrying for money. Quickly tiring of the extravagant balls, she spends most evenings escaping back into Mackinac’s rugged forest. There she meets Chase, a handsome laborer who shares her love for the night sky. The two begin to meet in secret at an abandoned lighthouse, where they work together to solve a mystery buried in the pages of a tattered diary.As Elena falls in love with Chase, her mother relentlessly contrives to introduce her to Chester Darrington, the island’s most eligible bachelor. Marriage to the elusive millionaire would solve the Bissette’s financial woes, and Elena is torn between duty and love.An abandoned lighthouse, a decades-old mystery and a love story. The romance between Elena and Chase and then Chester reminds me a bit of Rose and Jack from the movie, “Titanic”. Does Elena marry for love or out of duty to her family? To find out you will have to read the book. I guarantee you will not be disappointed. Even though I have never been there I have a fondness for Mackinac Island. Why, you ask. I really like the movie “Somewhere in Time” and it takes place mostly on Mackinac Island and it looks great there. “Love Finds You in Mackinac Island, Michigan” is great fun to read. Ms. Dobson has a great way of telling the story and moving it along at a nice pace. Her characters are wonderful and she gives them life and unique voices. All this and Mackinac Island also. A really enjoyable read.****Romance, Mystery and the Wonder of God’s CreationAuthor Melanie Dobson transports readers to a magical place and time to reveal God’s majestyNot only does God love to create, He also loves His creation. This is the message author Melanie Dobson hopes that her readers gain from her latest release “Love Finds You in Mackinac Island, Michigan” that combines historical romance with her trademark element of mystery.A story filled with beauty and wonder, “Love Finds You in Mackinac Island, Michigan” transports readers to a magical place and time. The story begins in the 1890s at the end of the Gilded Age, a golden era of prosperity and growth. As the Gilded Age comes to a close, the kingdoms of many wealthy industrialists begin to collapse, including the once-wealthy Bissette family who has nearly lost its fortune.The Love Finds You series from Summerside Press is a collection of novels that captures the flavor of towns and cities across the country with colorful histories. The towns become as much of a part of the stories as the characters themselves. Researching the towns in which her novels are set is the aspect of historical fiction that Dobson enjoys most. In writing Love Finds You in Mackinac Island, Michigan, she was able to explore the island that has intrigued her since her early years growing up in Ohio. “I’ve always been fascinated by Mackinac Island because I was told time seemed to stand still there,” explains Dobson. “From the moment I got off the boat, I could sense it was a magical place. There are no cars on the island so people ride bikes or horse-drawn carriages through the charming village and back into the forest. The island has been a popular vacation destination on the east coast since 1819, so it’s rich with fascinating history and lore.”If you would like to listen to interviews with other authors and professionals please go to www.kingdomhighlights.org where they are available On Demand.To listen to 24 hours non-stop Christian music please visit our internet radio station www.kingdomairwaves.orgDisclosure of Material Connection: I received this book free from Litfuse Publicity Group for this review. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Joleen", "userReviewDate": "Sep 22, 2016", "userURL": "http://www.goodreads.com/user/show/5543196-joleen", "userReview": "Based in the late 1800’s on Mackinac Island. Elena is a sincerely guileless young lady with a genuine love for God. She loves escaping the entrapment of her society, and her mother's demands for propriety, and wander up a mountain to a secret spot to spend time talking to God and to draw.But because of her father's economic problems she seems doomed to marry a successful man to keep her family from ruin. Along comes that successful man, but he's heard gossip about her, that she was a golddigger and flirt, rumors told by the woman who is threatened by Elena as her competition, and who wants to take his attention away from her.They never exactly meet as the real people that they are. There are two encounters, but neither can make out the other in one, and the other time...well, you should read the book to see the other encounter. Cute.My problem was Chase was a butthead to Elena whenever he finally knows who she is. I mean a serious butthead. He never gives her a chance. He draws a negative opinion based on gossip and that's it. He treats her like dirt. Personally I'd never be interests in someone who won't give someone a chance to explain, and then, with explanations, he's not interested enough to believe her. But I suppose if he listened to her and forgave her, a quarter of the book would disappear.Learned a lot about the island and yet it didn't sound too much like a travel guide.I'd recommend it!"}], "description": "It s the height of the Gilded Age, but Elena Bissette s family has lost most of its fortune. The Bissettes still own a home on fashionable Mackinac Island, and they spend summers there in hopes of introducing Elena to a wealthy suitor. Quickly tiring of the extravagant balls at the Grand Hotel, she spends her days walking along the island s rugged coastline. There she meets Chase, a handsome laborer who shares her love for the night sky. The two begin to meet in secret at an abandoned lighthouse, where they work together to solve a mystery buried in the pages of a tattered diary. As Elena falls in love with Chase, her mother contrives to introduce her to Chester Darrington, the island s most eligible bachelor. Marriage to the elusive millionaire would solve the Bissettes' financial woes, and Elena is torn between duty and love.", "title": "Love Finds You in Mackinac Island, Michigan\n      \n          (Legacy of Love #1)", "url": "http://www.goodreads.com/book/show/17046548-love-finds-you-in-mackinac-island-michigan", "average": 4.2, "cover": "https://images.gr-assets.com/books/1356037544l/17046548.jpg", "reviews": 78, "authors": [{"url": "https://www.goodreads.com/author/show/409350.Melanie_Dobson", "name": "Melanie Dobson"}], "type": ["Romance", "Historical", "Christian", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/17046548-love-finds-you-in-mackinac-island-michigan", "http://www.goodreads.com/book/show/13410627-love-finds-you-in-mackinac-island-michigan", "http://www.goodreads.com/book/show/36998357-the-masquerade", "http://www.goodreads.com/book/show/19222057-love-finds-you-in-mackinac-island-michigan", "http://www.goodreads.com/book/show/18143963-chateau-of-secrets", "http://www.goodreads.com/book/show/32980245-catching-the-wind", "http://www.goodreads.com/book/show/22609383-shadows-of-ladenbrooke-manor", "http://www.goodreads.com/book/show/10128390-love-finds-you-in-amana-iowa", "http://www.goodreads.com/book/show/37536458-the-runaway", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}