{"ratings": 1438, "userreviews": [{"userName": "Liberty", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/4075737-liberty", "userReview": "Mary Todd Lincoln always seemed a dour woman in the background from a historical perspective. However, this book depicts an intelligent woman prevented from achieving her full potential by conventions of the time period and circumstances. Though Lincoln would not allow her to make use of her political contacts, she could and did give input on Lincoln's ideas and speeches, in addition to providing a safe haven for him when he needed it. In spite of suffering from skull fracture as a result of a carriage accident, being tormented by society as to her status in their marriage, losing a child, and being accused of treason while Lincoln was president, she remained Lincoln's touchstone to the day he was assassinated. I took my time finishing the book, though, because I knew how it would end for these two remarkable people."}, {"userName": "LemonLinda", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/1541888-lemonlinda", "userReview": "This is a very readable novel detailing the lives of Mr. and Mrs. “President” Lincoln told from the perspective of Mary Todd Lincoln. It begins with her as a eligible young lady pursued by many in her hometown in Kentucky and continues as she travels to Springfield , Illinois where she stays with her married sister and family and where she meets Abraham. It continues with the years of their many political failures and their few successes during which she always encouraged his continuing the quest as she seemed to see his potential for leadership, in essence his destiny. And it goes into their years in the White House ending after his assassination. It also details all of the family tragedy and the national crisis years during the Civil War. It is well done and very well researched for authenticity; however, it was published first in 1954 and does at times feel a bit dated."}, {"userName": "Sherrey", "userReviewDate": "Mar 07, 2009", "userURL": "http://www.goodreads.com/user/show/1550062-sherrey", "userReview": "Irving Stone is quickly becoming a favorite author. Never a great fan of reading history just for the sake of reading it, Stone brings history to life by using the historical fiction genre and providing interesting dialogue. I didn't know much about the Lincolns when I started reading this, other than what they teach in school. It was indeed sad how Abraham Lincoln struggled with melancholy and depression, but I found it amazing how he recognized it and usually worked himself through it. Despite her somewhat brusque and often misinterpreted manner, Mary Todd was a huge part of his victories while struggling herself with loss and tragedy. A remarkable couple living and changing our world during a remarkable time in our history."}, {"userName": "Cassandra", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/10239344-cassandra", "userReview": "Interessante Leben in das so gar nicht luxuriöses Leben von Abraham Lincoln und seiner Frau."}, {"userName": "Jessika", "userReviewDate": "Jul 29, 2009", "userURL": "http://www.goodreads.com/user/show/1166992-jessika", "userReview": "Well, it took me forever to get through, but overall, I'd say this one was a 3.5 star read. For fans of Abraham or Mary Todd Lincoln, or for fans of Civil War period history, this is a great read. Mary Todd is a woman who has always been of interest to me, and being that this book is told from her perspective, it really offered insight into this woman who sadly became one of the history books' pariahs. I can't speak for everything in this book, but from what I know of some of the history, Irving Stone writes a historically accurate, yet entertaining, account of the Lincolns. I will admit, some parts of it were very dry for me, which is probably why this took me so long to read. I'm not into the politics so much, and reading about the years preceding the White House for the Lincolns was a little hard to get through. However, I very much enjoyed the beginning (which detailed the beginning of their relationship/marriage) and the end (which detailed their time in the White House). It's not a light read, but I still very much enjoyed it. I learned A LOT, and I have walked away from this book with a new perspective on the Lincolns. They really came to life in Stone's book, and I feel as if I \"know\" them much more than I have before from any history book account. And I have to say, even though I knew how the story ended, I definitely found myself tearing up--what an emotional read! A definite classic in the historical fiction world, this is a must-read for those interested in the Lincolns or in this era of history."}, {"userName": "Laura", "userReviewDate": "Jun 26, 2008", "userURL": "http://www.goodreads.com/user/show/805671-laura", "userReview": "I found this book extremely interesting. I didn't know anything at all about Abraham Lincoln's wife or children. I really enjoyed the book, even though Mary wasn't a character I loved. But it's always interesting to learn about real people and their struggles. And once you learn more of their personal struggles, you can understand their actions so much better. For any history lover, this is a must-read."}, {"userName": "Molly Jae", "userReviewDate": "Jun 11, 2009", "userURL": "http://www.goodreads.com/user/show/2409582-molly-jae", "userReview": "For some reason this was a very slow book for me to read. I get frustrated with historical fiction sometimes because I like to have the historical parts separated from the authors ideas of what may have taken place or what may have been said. I think that I prefer David McCullogh when reading history. That said, however, I did make it through the book, and felt such sorrow for the Lincoln's through all of their lives and for the nation during the Civil War years. It is interesting to review all the hatred that was exhibited towards them and compare it to how Abraham is now regarded so highly by Americans. I think it's tough to not be popular.....don't we all want to be liked by others? It seems that it was very tough on Mary. I didn't realize that her life would continue to be so hard even after his assasination. It wasn't in the book but I was curious and so continued to find out what happened to her and their children. A very sad life. Finally, I was surprised at how emotional I became when discussing this book, the Civil War and the Book of Mormon with Scott. To realize that Abraham was where he needed to be at that time and even with all his shortcomings and \"hypo's\", played a crucial role in our nation, is a testimony to me that we all have a role to play and that God is watching over us."}, {"userName": "Laina", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/1331450-laina", "userReview": "Wow- this one took me a while, didn't it? Nevertheless, I LOVED it! I love the idea of historical fiction, and this book seemed more history than fiction, which is a good thing in my opinion. However, that made the story a little less gripping, hence the long reading time. The picture this book paints of Abraham Lincoln is nothing short of breathtaking. We see his faults, his virtues, his frustrations, his failures, and his successes. I had never studied more than cold facts about what Lincoln did, but this book opened my eyes to how truly great of a man he was. Incredible.I knew absolutely nothing about Mary Todd Lincoln, and this book definitely does her justice. She has become one of my heroes. I will continue to learn more about both her and Mr. Lincoln.Do I suggest this novel? You bet! Especially to those supporting \"Abraham Lincoln- Vampire Hunter.\" Come on! This man doesn't need any more fantasies to build him up as a hero. He was one. I will forever respect and admire him, and I want everyone to read this book, so they might do the same."}, {"userName": "Jessica", "userReviewDate": "Sep 20, 2009", "userURL": "http://www.goodreads.com/user/show/717361-jessica", "userReview": "I enjoyed this book! I really liked learning about Mary Todd Lincoln and the personal issues of Abraham as well. The book also gave great political context to the situations leading up to the civil war as well, and I found that interesting as I have forgotten a lot of the history. The book really made we want to re-study that time period more. One thing I really appreciated was the attention to family dynamics; I have heard many biographers discuss Mary Todd in less than favorable light, while making Abraham out to be saint, and I felt this story was much more fair. BOTH parties had their own issues, albeit different, that greatly contributed to the troubles of the other. That being said, I love the title and the overarching theme, Love is Eternal, as it does sum up their relationship well. The book is long and can get tiresome at times, but I definitely recommend it to anyone interested in the time period, the life of Abraham Lincoln, or just relationships in general."}, {"userName": "Sally", "userReviewDate": "Mar 18, 2008", "userURL": "http://www.goodreads.com/user/show/533203-sally", "userReview": "I first read this book when I was 17 years old. I was given an old hard copy of it a year or so ago. I just finished it last week.This is the love story of Abraham and Mary Todd Lincoln. It is wonderful. I love the history that is blended into the story. It is historically accurate, as Mr. Stone used old letters and journals to create the dialog.It is a timeless love story that is especially poignant, becasue we all know how the story ended. I cried as if I had no idea what was coming.One of my all time favorites."}, {"userName": "Chandra", "userReviewDate": "Aug 06, 2012", "userURL": "http://www.goodreads.com/user/show/5357679-chandra", "userReview": "I really enjoyed this book. It gave me more insight into the lives of Mary and Abraham Lincoln. I had no idea how much they endured and went through in their lives. Even though I knew the ending, it was well enough written to make me emotional about it."}, {"userName": "Alexandra Medina", "userReviewDate": "May 31, 2014", "userURL": "http://www.goodreads.com/user/show/23807465-alexandra-medina", "userReview": "Irving Stone's book called, Love Is Eternal impacted me with its extremely love story. For example, this story is about a marriage and romance love about Mary Todd and Abraham Lincoln and how Abraham engraved his name on Mary's soon to be marriage ring. Sometimes people fall in love with the materialistic side of a guy and not with the real love that, that person has for you. I think that looks, money, or anything else matters in a guy or a girl I think all that matters is their heart and how they treat you. Some people have been hurt in the past and that is why people sometimes suffer in a relationship therefore, it is better to not pay close attention to looks from the outside but who they really are in the inside.Imagine marrying someone who you see as someone that just interests you because of their outside looks. This story talks about love, grief, devotion, and misery and it describes a romantic love story between Mary and Abraham. This book impacts people who really love a person and is there for that person at all times and it teaches a lesson in life that if you love a person very much you will be capable to do anything for them. It teaches many people a lesson because sometimes people just like to use other people because of their money and things that they have. Just imagine someone steeling your identity and finding out that it was your husband or wife how would you feel if that happened to you? Maybe just think about you being cheated on by your partner how would that feel? Well in this story Mary and Abraham's relationship and love story is all about respect between them.The author's style catches your attention because Irving describes briefly the feelings of both of these characters and how their love for each other is being expressed between this story. What I like about this book is that it this story is a love story and because many things like their life really happens in my life as well. It is not funny or humorous it is actually really serious and with much love affection put into the story it gives all its energy and sense of love throughout the whole story and throughout the characters. Yes, it gives me a sense of where this place would take place at for example, just them talking to themselves in a quiet and peaceful place. Irving's Stone's voice is like a harmony, he talks with such a calm and soft voice that makes you feel like your taking place in this story. The authors voice is unique because it this is a real love story and not all love stories make you feel part of it.Abraham Lincoln is Mary Todd's husband and he is in love with her so much, he is also going to be a president during the story. Mary Todd is in love with Abraham and is surprised when she finds out that they are getting married and that Abraham engraved his name on her wedding ring. The writer does make me believe in them as people because I know that Abraham was one of the United States president and who wouldn't be amazed and happy with their husbands name engraved on their wedding ring because everyone deserves their future. I like the characters in this story because they both are so passionate and loving towards each other and it just amazes me when there is true love like that and where they treat each other with respect. For example, this was while they first met, \"Miss Todd, I want to dance with you the worst way.\" That is where they fell in love with each other even if she was 21 and he was 30 years old age for them didn't matter what matter was their love for each other. Imagine not being able to tell everyone your getting married or invite anyone to your wedding, well this is what happened with them. Mary and Abraham did not want to have a big wedding and so they wanted to keep this surprise as quiet and simple as possible.The setting of this story takes place in Springfield, Illinois during 1839. This compares to the world i know because people once they fall in love they do everything possible to be with their loved one and they spent much time together. The author does make me feel part of the setting because this love story is like if it was happening to me. Yes, if I close my eyes I can picture the story's setting because it seems so calm how it is just them two in their own little place alone together loving each other throughout the days. Imagine being with your loved one right at this point or just seeing the feeling of you getting married like wouldn't you feel like it is only you two in the world, I would feel that way and I wouldn't pay any attention to the out world and the people. Imagine just being with your loved one and sitting right next to each other on a bench in the park wouldn't you feel loved?Mary and Abraham met once Mary moved to Springfield she then met Abraham and they went out on date. They got engaged but then broke up for sometime but went back together and so Abraham bought her a gold ring and engraved some words on the ring and some of the words where \"Love Is Eternal\". None of them wanted a big wedding so they decided to have a quiet ceremony at the home of Reverend Charles N. Dresser and the Episcopal minister. Lincoln after the wedding purchased a home which was Reverend's home. About 30 of their relatives did show up to the wedding because of Reverend so it wasn't too quiet at all after all. A week after the wedding Lincoln wrote a letter to his friend talking about legal matters and how his marrying was a matter of profound wonder to him.Like I said before this book has it's own unique type of story and no this cannot be connected with any other story or book because each story is unique in their own way and this book is based on a real story and that is what makes it seem unique and realistic. Yes, this book relates to current events or issues because things like this still happen in real life and there is many people who still act like this with their loved ones. Yes, this book does relate and connect with me on a personal level because I have been trough something like this before where I just want to spend time with the person I love and don't want to leave sides with. Just imagine being with someone that you truly love and you want to be with at all times, or maybe just wanting to be best friends with them so you can get all the advice in the world that you'll needing.I recommend this book to those people out there who are in love and who have a soft and caring heart. I think this book will be great for people who are having difficulties in their love life or in their relationship. I also recommend this book to anyone in the world who beliefs that true love doesn't exist to them because I am sure that if you read this book you will fall in love and you will soon realize what love really is and how it can be find the right way trough someone that you feel is the right one for you. Just imagine being with someone that you love with all your heart and that you are willing to spend a life time with, just you two..."}, {"userName": "Janice Robinson", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/64468506-janice-robinson", "userReview": "This was a pretty good book. I was already knowledgeable about Mary Todd Lincoln's life, so there was nothing new to me and I didn't learn anything, but I didn't expect to. It did a good job of ascribing motivation to that behavior of Mary's that seems extreme and unflattering to her, although of course her motivations in this novel are speculations and not historical fact. Speculations in an historical novel are perfectly fine. My one big problem with this book: Throughout, Lincoln is referred to as \"Abraham\" and Mary calls him \"Abraham\". Other people in the book also call him \"Abraham\". In reality, once he reached adulthood, nobody called Abraham Lincoln either Abraham or Abe. Men always called him \"Lincoln\", women called him \"Mr. Lincoln\" and Mary called him either \"Mr. Lincoln\" or \"Father\". She never ever called him \"Abraham\". I know it seems weird to us now that a woman would call her husband \"Mr.\" followed by his last name, but it was common in Victorian times. This was a well-researched book, and research would have apprised the author of this, so I don't understand why the author didn't discover this and write the book accordingly It was jarring to me. Otherwise, a good book."}, {"userName": "Melissa", "userReviewDate": "Sep 29, 2017", "userURL": "http://www.goodreads.com/user/show/4188079-melissa", "userReview": "Love is Eternal is historical fiction and tells the story of Abe & Mary Lincoln through Mary's eyes. It tells of the time from when they met through his assassination. Mary was a complex woman, with a goal of living in the White House from a very young age. She was at times enchanting, supporting, shrewish and driven. Abraham Lincoln is always shown as such a big character that Mary is often overshadowed, but she was very much involved in both his political and personal life. While I know this book isn't 100% accurate it was interesting to see how there life evolved from when they met through to the Presidency. They had extreme lows and highs emotionally throughout there lives and I thought they were portrayed well in the book.I will admit, I was ready for the book to be over well before it was. There were parts that dragged and it is a politically based story and politics can become a bit of a dull read. Overall though I enjoyed the book and the incite into Mary Todd Lincoln. I had hoped to see more of what became of her after the president died but that would be my only real complaint."}, {"userName": "Owilcox", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/68082916-owilcox", "userReview": "This story showed a whole new side of Abraham Lincoln! He is way different in the book then I thought he would be. It was a story that showed how hard he tried to do the best he could. It was a more challenging read, but I would read it again."}, {"userName": "Sherri Scoffield", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/617170-sherri-scoffield", "userReview": "Out of print - found a used copy. Story of Mary Todd Lincoln. Very much enjoyed. ‘May I more graciously accept MY small trials.’"}, {"userName": "Stephanie", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/1608655-stephanie", "userReview": "Liked this but not as much as other Lincoln books"}, {"userName": "Lucinda Vinoski", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/77016719-lucinda-vinoski", "userReview": "Excellently written. Presents Mary Todd Lincoln in an entirely new way. She was the polish on that \"Rough Diamond\"."}, {"userName": "Poiema", "userReviewDate": "Jun 15, 2010", "userURL": "http://www.goodreads.com/user/show/1524767-poiema", "userReview": "At first glance, Mary Todd and Abraham Lincoln seem ill-matched: she, the elegant daughter of wealth and society, and Abraham the homely son of a poor frontiersman. But the two things they held in common were enough to cement their lives together in matrimony, namely a shared literary interest and an unabashed political ambition.Mary enjoyed a truly classical education, some of it obtained surreptitiously when she sought out the tutorship of a man who was headmaster of a private boys' school. She mastered classical literature and languages while other girls her age were sewing a fine seam. All her life she remained an avid reader and lover of the arts.Abraham, however, did not have opportunity to sit under learned scholars but his similar thirst for knowledge drove him to self-education. Philosophy, Burns, poems of despair such as Holmes' \"Last Leaf,\" and other classics all became fodder for his mind's ravenous appetite. He repeated things aloud to himself to fix them in his mind. He read to himself, to Mary Todd, and to his children. In the darkest days of the Civil War, when no man or woman could share his sorrow and perplexity, he drank deeply of Shakespeare's tragedies and the Bible, especially the book of Job.The self education of this man produced something of a rarity: a political-poet. His succinct, well chosen words were always penned to be spoken to an audience, and in some cases his words proved absolutely spell-binding. Lincoln's \"lost speech\" was so profoundly moving that the journalists laid down their pens, listening as if entranced. If the literary magnet was what drew their minds together as one, it was the fire of political ambition in their bellies that cemented the relationship between Mary Todd and Abraham Lincoln. Since Abraham was subject to bouts of \"hypo\", which today would probably be diagnosed as manic depression, Mary's ambition was strong enough to carry them both. Without her, he may not have been able to sustain the effort that was required to rise to the top of the political barrel.Mary would pay dearly to promote her husband's political career. In the early days of their marriage, she was home alone with two small children for extended periods of time as Lincoln rode the circuit as a lawyer. When he did arrive home, her loneliness was sometimes painfully extended as she had to wait out Abraham's bouts of \"hypo.\"  \"His friends were saying, 'Poor Abraham Lincoln, married to Mary Todd'...If they knew the full facts, if they had to live with him, might they not rather say, 'Poor Mary Todd, married to Abraham Lincoln'?\"The saving grace: the ability to re-engage in companionship and camaraderie after such absences had ended. Mary and Abraham seemed to be able to pick up where they had left off each time, to repair the disjointedness and to move forward. \"Would you keep me company?\" seems a simplistic remedy to marital loneliness and yet it is so effective. Visits to country clients, shared visits to wounded soldiers, a carriage ride in the country---none of these moments shared between Mary and Abraham seem significant in themselves. Each is a slender thread, but the accumulation of many threads creates a tightly woven bond of unity, one that can survive even a civil war.Engraved on the wedding ring that Abraham slipped on Mary's finger were the words \"Love is Eternal.\" Irving Stone chose those same three words as the title of his biographical novel of Mary's life. It is a sympathetic novel, one that elevates Mary above the usual caricature of an ego-centric, materialistic, shrew. She was a complex woman, a woman who endured the tragedy of losing two sons and several brothers. She was not always able to bear her tragedy with grace, nonetheless she was a faithful spouse and I believe her love for Abraham Lincoln survived the fires of affliction. Her story is poignant and instructive."}, {"userName": "Jina Howell-Forbes", "userReviewDate": "Mar 21, 2013", "userURL": "http://www.goodreads.com/user/show/15331514-jina-howell-forbes", "userReview": "This book amazed me. I didn't take US History is college, so my knowledge of the Lincolns comes from High School, and the few things I've heard or read occasionally. I always heard that Mary Lincoln was silly and vain. I'd heard that she spent money irresponsibly, and made Abe miserable.Instead, the picture of Mary painted by this book is of a highly educated person who had southern manners who used both those things to assist Abe.It is true that she sometimes spent more money than she should have, but she did it from an honest belief that she was making things better for her husband, whom people saw as a backwoods bumpkin. She used her education to help Abe as well, whose formal education was extremely limited.It is also true that she suffered from severe depression and migraines, but so did Abe, and he is seldom blamed for his behavior the way she is.Finally, what I didn't know, and I beleive that few others know either, is that Mary suffered a severe head injury after being thrown from a carriage a year or two before Abe was shot. Her erratic behavior during that time period sounds like classic Traumatic Brain Injury aftermath to me. I actually feel bad that I didn't know all this before and thought so badly of Mary without cause. I'm glad she's dead, so she doesn't have to know how badly she was treated by history books. She was a very complex woman, and I'm grateful to know more about her."}, {"userName": "Alicia", "userReviewDate": "Jun 09, 2016", "userURL": "http://www.goodreads.com/user/show/877481-alicia", "userReview": "Great biography of Mary Todd Lincoln, from her courtship days until the death of Abraham.“She must always remember that: love ebbed and flowed, now rich and shining, now shabby and disconsolate. One must survive the bad in order to realize the good. Therein lay the miracle of love, that it could eternally recreate itself. She must always be dedicated, no matter what the years held, what the hardships or disappointments, the sorrows or tragedies: she must come through them all, through the most violent and frightening storms; for at the other end, no matter how long it might take or how dark the passage, one could emerge into clear warm sunlight.” -p. 123Wisdom from Abe Lincoln: \"An ugly man stands upon his own merits; nature has done nothing for him, and he feels he must labor to supply the deficit by amiability and good conduct. A pretty man, on the contrary, trusts his face to supply head, heart, and everything.\" -p. 132\"'Our form of government is the nearest to perfection of any I know of in the extent to which it represents and protects the masses. The government is the people's: it's in their hands to make or mar... our Union is the bedrock of our beings; destroy that and you destroy the last great hope on earth.'\" - Abe Lincoln -p. 158"}, {"userName": "Jenn", "userReviewDate": "May 29, 2008", "userURL": "http://www.goodreads.com/user/show/1043650-jenn", "userReview": "This is a great historical fiction book. It gave a good look at both Mary Todd Lincoln and Abraham Lincoln. They had many struggles and it is amazing what he was able to get accomplished. She was a very strong personality, quite a snob that did a lot of things just because she wanted to. It was amazing to me how many times he lost the race before winning the presidency. I was happy for the history lesson considering I thought the Civil War started to emancipate the slaves when in reality it was to protect the union (shows you how much I paid attention in history class). I wonder how differnt America would be if the South had won and become thier own nation. While reading the book I had a bonus to be able to go visit the home across from Ford Theater where Lincoln died while I was visiting DC it made it even more enriching, unfortunately Fords Theater was closed for renovation. I gave it 4 stars because it was long and a little boring at times."}, {"userName": "Catherine", "userReviewDate": "Aug 04, 2014", "userURL": "http://www.goodreads.com/user/show/3492124-catherine", "userReview": "I liked this book because I learned a lot about the lives of Abraham Lincoln and his wife, Mary Todd, and I also learned more about the Civil War. Irving Stone cited a lot of sources, including personal letters written by members of the Lincoln family, close friends, and politicians. I felt like he definitely did his homework, so I felt like a lot of the story must have been true to life. I felt so sad for the Lincoln's as they had children die, other family members die, political failures, illnesses, and some financial troubles. The book is told from Mary Todd's perspective, so I learned more about her than anything else. She really went through a lot and I know later in her life she kind of lost it, but I can't judge her, especially after finding out all she dealt with in her life. At times the book was hard for me to read because I either didn't understand the political references or I just felt so sad for Mary Todd and Abraham Lincoln. It was definitely worth the read, though."}, {"userName": "Ashley", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/954908-ashley", "userReview": "A really amazing read about Mary Todd and Abraham Lincoln told from her perspective. I learned so much about both of them. I had no idea her aristocratic political southern upbringing and her ambitions for the White House (Stephen Douglas courted her too). And one of the things I love about historical novels is knowing the outcome of events (they will get married, he will be president, he will emancipate the slaves, he will be shot) but discovering how the dots connect. And there were plenty of dark days in their lives when I would have despaired a positive outcome if I didn't already know the history. A good, true story of enduring trials, rising above circumstance, standing for the right, and love conquering all. A little dense at times, but it would make a great book club discussion book."}, {"userName": "Judith", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/4366180-judith", "userReview": "Love this historical fiction book. Both Abraham & Mary have to deal with their temperaments & all that life gave to them. They demonstrated tremendous strength & courage. Abe from the frontier & Mary from Kentucky aristocracy show us how opposites can attract. And how tempers can rise. These were hard primitive times. And Mary demonstrated excellent home skills & needs for her family. She cared for Lincoln in nurturing and verbal communication which he so needed. I'm so tired of hearing of the madness of Mary! For what she endured & especially all of her losses, its a wonder she was not left in the asylum. This is a fine book. And if you're interested in the Lincoln's, you should read it."}, {"userName": "Gabby", "userReviewDate": "Apr 06, 2008", "userURL": "http://www.goodreads.com/user/show/1061368-gabby", "userReview": "My favorite book!Great quote:\"A wave of almost unendurable happiness swept over her. Long ago Abraham had said, 'Love is eternal,' and she had thought, if one can live that long. Well, she had endured.She must always remember that: love ebbed and flowed, now rich and shining, now shabby and disconsolate. One must survive the bad in order to realize the good. Therein lay the miracle of love, that it could eternally re-create itself. She must always be dedicated, no matter what the years held, what the hardships or disappointments, the sorrows or tragedies: she must come through them all, through the most violent and frightening storms; for at the other end, no matter how long it might take or how dark the passage, one could emerge into clear warm sunlight.\" -- p.34"}, {"userName": "Dr.J.G.", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/52346722-dr-j-g", "userReview": "He was from a family in log cabin and educated due to his mother's concern and care, she from a wealthy family with relatives in Illinois and Kentucky both, and they met when she was being courted by the man who would be his rival in politics as well, a man of her class and far more acceptable to her family on the whole. But Mary Todd found Abraham Lincoln far more intriguing and challenging, and in spite of his lack of social skills (recall the famous true story about her telling him that he had said he wanted to dance with her in the worst possible way) she accepted his proposal. He went on to make history, and was assassinated soon; she did not remarry, even though it would be not merely possible but desirable to her relatives, and lived with the legacy."}, {"userName": "Joy H.", "userReviewDate": "Apr 01, 2011", "userURL": "http://www.goodreads.com/user/show/1259216-joy-h", "userReview": "_Love Is Eternal_ (1954) by Irving Stone4/1/11:I read this book a long time ago. It was about Abraham Lincoln and Mary Todd Lincoln. I remember that I liked Irving Stone's historical fiction. I've probably read several other books by him but I have no record of them.I just came across a mention of Stone's historical novel, The President's Lady: A Novel about Rachel and Andrew Jackson (1951). Sounds familiar. I'll have to keep that book in mind."}, {"userName": "Bonnie", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/174703-bonnie", "userReview": "I read this book many years ago and I was so impressed by the depth of the personal story of a historic character (Abraham Lincoln). I didn't realize then what a historical novel really was all about and I took the entire book as accurate. Still today, it is one of my most favorite books and Irving Stone is still a favorite author.Update: I am rereading this book after 50 plus years. It's the one I am taking to the mountains 07/18/2009.Finished reading again. Can't believe I plowed through this as a 12-year-old. Irving Stone's writings are so detailed and the result of so much research. This is only my 3rd book of his."}, {"userName": "Vanessa", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/1954421-vanessa", "userReview": "At the start of this book, I was totally convinced that I, too, could totally have fallen in love with Lincoln. Then he turned all emo and depressed and I was glad I didn't have to deal with his shit like Mary Todd did. (Seriously though, on a scale from 0 to \"kneeling during the anthem\", how unamerican is it to crush on a long-dead but much-revered US president?)Unfortunately, the further I got into the book, the more amorphous my dear Mr. Lincoln became. He seemed reduced to only two things: brooding or speaking in political aphorisms, and it leaves me wondering if this portrayal is truly honest, or merely yet another work of patriotic mythmaking."}], "description": "A biography of Mary Todd Lincoln and Abraham Lincoln", "title": "Love is Eternal", "url": "http://www.goodreads.com/book/show/158417.Love_is_Eternal", "average": 4.03, "cover": "https://images.gr-assets.com/books/1325816815l/158417.jpg", "reviews": 132, "authors": [{"url": "https://www.goodreads.com/author/show/12833.Irving_Stone", "name": "Irving Stone"}], "type": ["Historical", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/158417.Love_is_Eternal", "http://www.goodreads.com/book/show/2858417-ewig-ist-die-liebe-mary-und-abraham-lincoln-ihr-leben-ihre-liebe-und-i", "http://www.goodreads.com/book/show/12398148-love-is-eternal", "http://www.goodreads.com/book/show/22215609-love-is-eternal", "http://www.goodreads.com/book/show/1321831.Love_is_Eternal", "http://www.goodreads.com/book/show/321552.The_Agony_and_the_Ecstasy", "http://www.goodreads.com/book/show/79834.Lust_for_Life", "http://www.goodreads.com/book/show/158413.The_Origin", "http://www.goodreads.com/book/show/148417.The_President_s_Lady", "http://www.goodreads.com/book/show/79852.The_Passions_of_the_Mind"]}