{"ratings": 6300, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "When I first started this I wasn't sure if this is one I would like. The writing was good so I continued and am so glad I did. This is a wonderful story, a devastating one and a timely one. Two women, one Soli, illegally in the US, went through so much to get here, not an easy trip. The second a young Indian woman, Kavya, who wants desperately to have a child. Married to Rishi, they have been trying without success. Two women, one little boy named Ignacio, who will steal your heart and wrap it around your little finger. Never really realized what the undocumented go through, how they have to live when they are caught and before they are deported. The author notes that the immigration laws are those of 2013, but that little has changed. This is a book full of love and heartbreak, of struggle and fear. These two women want this child and how this plays out is the story. There is no bad in either, no evil, just wanting the best for this little boy. Informative and an agonizing look at the deportation process and the undocumented experience. I think sometimes we tend to forget to look at people as people, who want the same things we do but often find insurmountable barriers in their way. A wonderful and emotionally challenging story.ARC from publisher.Publishes, January 10, 2017"}, {"userName": "Angela M", "userReviewDate": "Dec 18, 2016", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "This really timely story is a heartbreaking one about an undocumented young woman, Soli, who takes risks for hopes of a better life, risks which were more dangerous than she ever imagined as she leaves her family in Mexico to make her way to the US. Soli's story is told in conjunction with the alternating narrative of a young couple of Indian descent, Kayva and Rishi who want desperately to have a child but are not successful in their attempts to conceive. They are ultimately connected by a baby boy named Ignacio. It's difficult to write about this without giving too much of the story away but suffice it to say that this story grabbed me from the beginning. During this past election with a big focus on immigration and whether to deport undocumented people, one of the things that I found very difficult to imagine was separating US born children from their parents who may be deported. This is a gripping story that will keep you interested to the end waiting to see what happens to these desperate people and this beautiful, little boy . Difficult to say how lucky he was , but definitely worth reading.I received an ARC of this book from Penguin through NetGalley and Edelweiss."}, {"userName": "Elyse", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Boy.....this is a timely - heartfelt book!!!!! Kudos to the author!!! Kayvan had moved to Berkeley eighteen years earlier for college. She graduated, traveled, became a chef, and married Rishi. After nine months of trying to get pregnant with no success -they were looking into adoption. Their plans took a detour when they became foster parents to a little boy - a toddler named Ignacio. They hoped to adopt him. Solimar Castro Valdez makes plans to meet her cousin in Berkeley. She needs to make it across the border from Mexico. Her cousin tells her that she has a place to stay and a job for her when she arrives. The journey is traumatic. Soli arrives in bad shape -- filthy- exhausted - abused - and pregnant. Against all advice from her cousin-- she refuses to abort the baby. She wants to keep her child. Problems and struggles increase. Soli is an illegal immigrant and she is in a detention center facility about to be deported back to Mexico. She wants her child. Two mothers love Ignacio. Two mothers want him as their permanent son. Issues get raised - lives intersect. This story is EXCELLENT. It's also sad - and frustrating. It's easy to see that there is no easy answer. Many immigrant children face uncertain futures --- and its no different for Ignacio. I don't want to give this story away --but it will pull at your heartstrings--as it's easy to see all points of view -- all in the name of Love. A terrific book club pick. An important discussion book as it feels very realistic. Thank You G.P Putam's son, NetGalley, and Shanti Sekaran."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Dec 23, 2016", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "[of the sideline ones like the three men who brutally rape a woman in the desert, the coyotes who extort money and abuse the people they offer their services to, and the stereotypical hateful guards at the holding facility mistreating those awaiting deportation (hide spoiler)]"}, {"userName": "Jill", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/2228181-jill", "userReview": "The heartbreaking journey of two women, bound by the love of a baby boy, was so NOT a book I wanted to read. It sounded like a potboiler romance…that is, until I actually started it and didn’t want to come up for air. The writing was so mesmerizing, the situation so poignant and the characters so authentic that I found myself staying up past my self-appointed bedtime to read “just another page.”There are two key characters here: Kavya, daughter of Indian immigrants, who has always taken control of her own life…until she is unable to conceive a child. She and her techie husband Rishi struggle with the emotional ravages of infertility. The interwoven story focuses on Soli, an illegal Mexican immigrant, who, after risking her life, ends up at her cousin’s doorstep in Berkeley, unexpectedly pregnant and determined to keep her baby son. The author doesn’t keep us in suspense very long. Soli is arrested and her son, born on American soil, is taken over by the state of California, where he ends up in the custody of foster parents Kavya and Rishi. Neither are villains; both women are good-hearted and striving to define what it means to be a mother. My sympathies kept shifting from one to the other, knowing that each woman was emotionally invested in the little boy.I finished this powerful book at a particularly fortuitous time, when a hard-hearted demagogue heads our country and is targeting law-abiding immigrants who simply want a chance to survive and raise their own children in peace. Soli’s journey as an illegal immigrant and her horrendous treatment by government officials and in the detention center brought tears to my eyes and it is based on a true story. Anyone who paints all immigrants with a broad brush must read this revelatory novel. And anyone who believes, as I do, that there is no such thing as an illegal human should read it to0, and revel in its themes of identity, fertility, motherhood and growth."}, {"userName": "Jennifer", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/9420458-jennifer", "userReview": "\"She'd learned the lesson that all women learn sooner or later. If there was something to be done, she'd have to do it herself.\"\"There is a beast in all of us. Only the worst things can bring it ripping through the human veneer.\"This is one of the most powerful books I have read so far this year. While the title is \"Lucky Boy,\" I'm not sure that anyone in this timely novel could be considered \"lucky.\" Young and naive, Solimar (Soli) Castro-Valdez leaves Mexico on a wing and a prayer in hopes of a better life in California. She has only a vague understading of the system, and believes that a cousin who lives in the US will help her establish her new life. Before even reaching the border Soli meets with heartache and disaster, and, unknown to her at the time, a child in her womb. Simultaneously, author Shanthi Sekaran introduces the reader to an upwardly mobile Indian-American couple named Kavya and Rishi. Educated and talented, they are living the American Dream, except that they are struggling with infertility.This heartbreaking book is told through alternate lenses: Soli's and Kavya/Rishi's as we see Soli give birth to a son, Ignacio; get arrested and held in a detention center for illegal aliens; and witness Ignacio go into the care of Kavya and Rishi.This book stirred my emotions and has inspired me to learn more about the deportation process as well as the rights aliens have regarding their American-born children. 4.5 stars (which I may end up rounding up to 5)Thank you to G.P. Putnam's Sons and NetGalley for a galley of this book in exchange for an honest review."}, {"userName": "Vikki", "userReviewDate": "Dec 11, 2016", "userURL": "http://www.goodreads.com/user/show/11294629-vikki", "userReview": "I felt such a wide range of emotions reading this book that it is hard for me to write a review that will make others understand why it meant so much to me but here we go... The two main characters in this book are woman who feel like they are not enough and desperately love the same child, and use their love for this child to get them through some very rough times. Soli left her small town in Mexico because she was the only one her age left and she felt like she could be more in America than she could ever be at home. You go through the horrors that you know happen to women as they try to get into the US illegally but don't want to think about. She meets the love of her life and the father of her child and loses him in a cruel twist of fate. She get a job as a house cleaner and nanny to a family in Berkeley, CA but is caught by the police and is separated from her child while awaiting her fate in a detention center where more things that you know happen to women in these center but also don't want to think about happen. Her child, Ignatius, goes to the Reddy's, an Indian family who has been desperately trying to have a child of their own to the point where it is destroying themselves and their relationship. The child who they call Iggy pulls them together slowly. Ultimately there is a legal battle for the child between the natural mother and the adoptive family. I was not aware that US born children with parents in detention centers could be placed for adoption due to a legal system that does not work with the parents to get them legal representation for family court or even allow them to go or call into court hearings. I thought the children were deported with the parents but this is not always the case. You are rooting for the Reddys and Soli because they are both so likable and you want their pain to stop but in the end you know both cannot have the child. This book broke my heart and opened my eyes to the pain that many people are going through that I would have never experienced or even realized people were going through. And isn't that what books are suppose to do, put you in someone else's shoes? I would definitely recommend this book to everyone. I gave this book 5 out of 5 stars on Goodreads. I received a free advanced copy of this book from Penguins First to Read Program for review consideration."}, {"userName": "switterbug (Betsey)", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/2843912-switterbug-betsey", "userReview": "If any readers are skeptical that vibrant, tingling, page-turning storytelling can also be literary, I’m convinced that LUCKY BOY could change your mind. Saturated with ethical questions about maternal love, privilege, boundaries, and the immigrant experience, the story tells itself without any authorial interference. Hard questions have no soft answers, and the reader, while adventuring through morally complex lines and barriers, will surely be exhilarated and full of empathy for all the primary characters. There are no easy outcomes to knotty disputes of immigration and the undocumented worker, as well as the foster care system and questions of class and standing. When a child is involved, the heart demands authority over statutes that are buried under benevolence. What we have is a tale bursting with humanity that traverses the invisible borders of the law, morality, and mercy that both connect and divide us from each other. There are borders and boundaries, and then there are immigrants and the law. But, when it comes to maternal love, that love IS the law, and there are no boundaries in the heart that can be imposed by the courts.Privileged Indian American Berkeley couple Kavya and Rishi Reddy are in their mid-thirties and childless. Kavya, especially, is envious of couples with children, pregnant women, and those that effortlessly conceive. They begin a process of obtaining a child with a desperation that is exclusively understood by the barren and single-minded. Solimar “Soli” Castro Valdez is a nineteen-year-old from a poverty-stricken village near Oaxaca. Her anguish resides in the unending hope of a better future somewhere else—and that somewhere else is America. What she entails to cross the border is both courageous and harrowing, but not without a pause in terror to find love.All three of these main characters are motivated by desperation and moved by certainty—the surety of their hearts that sometimes defies the law and ethics. What they would do for a child they love is limitless, unquantifiable, and borne on their own determination of their desire, their sense of right that supersedes external and murky morality defined by others. You can read the blurb on the book for content of plot, although I would suggest coming into it cold with no preconceived notions or plot-spoilers. Therefore, I am withholding from too much notation of the plot. Although it is close to 450 pages, I read this unputdownble book at a rapid pace, not wanting to tear myself away. What a fine balance between plot and theme, events and reflection. And Rishi’s job, as an air quality engineer, provides witty and scintillating extended metaphors. Attempting to create a room of “pure” air for his company (and to impress his boss, now married to Kavya’s childhood friend, who she always envied) is almost absurd. His goal is to create an invisibly bordered room of non-toxic, flawlessly healthy and breathable air. It blends impeccably with the theme of manifest borders and systematic laws that are supposed to be created for the good of its citizens, but also can run roughshod over families and the nature of love and bonds.“Air quality data was clear and quantifiable. It could be summoned and charted. Children and wives could not. Acceptance couldn’t be graphed. Nor could love.”In the meantime, Soli is attempting to navigate life as an “illegal.” It isn’t just the border of Mexico and America, but also what she will be willing to do to get what she wants. She is at a disadvantage being poor in a rich country, but now she has a reason to fight and win under any circumstances. She’s a scrappy girl with resources, despite her lack of money, education, and fluency of English. You root for her determination and empathize with her, as well as Kavya and Rishi, whose privilege obscures an underlying despair. Eventually, these characters will be fighting the same fight, each certain of their rightness.Invisible and indivisible, cleaving and cleaving (the same words with opposite meanings)—the narrative will pull you on both sides of an argument, while pushing you to new frontiers of emotion while you witness human truths that parallel ideology and undermine the law."}, {"userName": "Ace", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/23405868-ace", "userReview": "[rape and miscarriage are two that immediately come to mind. The Mexican woman in particular is put through the ringer in this book. She is a young adult when she is gang raped whilst trying to cross the border to the US and the reader does not have much opportunity to distance themselves from emotional impact of this incident. Later when she is trying to escape from yet another situation she finds herself in, she is repeatedly raped then allows herself to be continually repeatedly raped in order to try to gain an advantage for herself in the future. (hide spoiler)]"}, {"userName": "Rachel León", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/21291796-rachel-le-n", "userReview": "Sekaran has woven a rich compelling story here. The novel juxtaposes two women's lives--one a middle class woman living in Berkeley, the other a poor undocumented immigrant. The latter leaves Mexico on a dangerous journey which leaves her pregnant with limited resources. Ultimately both women want the same things--the immigrant's baby. The story tackles several issues--immigration, rape, adoption, and foster care. I work in foster care so inauthenticity in such storylines is a true pet peeve of mine, but I thought Sekaran handled it well. There were instances that were different from the state laws in Illinois where I live, but I know they can vary from state to state and it didn't seem inaccurate, just different from what I know. Overall Lucky Boy is a beautiful portrait of the complicated relationships that develop when families become intertwined through the foster care system."}, {"userName": "Marjorie", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/32379875-marjorie", "userReview": "This is a beautifully written novel about motherhood. Kavya is an Indian American woman who is married to Rishi. Her deepest longing is to have a child. She feels she’s failed at so many things in life and this is something else that she has failed at as she’s been unable to have a child. She and her husband begin to talk about adopting. Soli is a young woman living in Mexico who longs for a better life. She manages to illegally immigrate to America but her high hopes fall apart when she learns of her pregnancy.I loved each of the characters in this book and felt their desires and fears right along with them. The author has written a deeply compassionate novel about motherhood and parenting that truly touched my heart. The book is a timely and eye-opening story, too, about immigration but the main heart of the book lies in the love these two women have for a little boy named Ignacio, known to one as Iggy and to the other as Nacho. The story isn’t really a new or unique one as the struggle of adoption is a well-known topic but the author’s talent brings such insight into the minds and souls of these characters, which makes this a very special reading journey. I found the book to be completely engrossing. It’s quite a long book at almost 500 pages but it never dragged for me and I never tired of it for one minute. I hated to part with the characters at the end of the book and would have loved to continue reading about them.Highly recommended.This book was given to me by the publisher in return for an honest review."}, {"userName": "Rachel Watkins", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/2173746-rachel-watkins", "userReview": "Oh, my heart. LUCKY BOY is exactly the type of book that needs to be read and discussed given the ongoing global public conversation regarding immigration. Ignacio is indeed lucky to be loved so fiercely by his two mothers. Sekaran's debut is beautifully written. Highly recommend."}, {"userName": "Carole", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/7630646-carole", "userReview": "I liked this story of Soli, a young girl who leaves Mexico for a better life in America. On her way she meets Checo, and ends up pregnant as she arrives in the States. Her cousin helps her find a job cleaning for a wealthy family in Berkeley CA. She delivers a baby boy named Ignacio Across town, a young couple are trying unsuccessfully to conceive. When Soli and her cousin are caught by immigration, baby Ignacio is sent to foster care. Rishi & Kavya bring the baby into their home and grow to love him as their own. I found I was torn between the 2 Mothers who loved the little boy, and it was hard to choose who should keep him. A relevant story in today's time, one I'd recommend."}, {"userName": "Rincey", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/278339-rincey", "userReview": "3.5 stars"}, {"userName": "madamereadsalot", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/20699215-madamereadsalot", "userReview": "3.5Trigger Warnings will follow towards the end, as they are quite spoilers. If you feel like you need TW's, definetly check them out, if you don't want to be spoiled though, don't read until the end.This was one heavy read for me. It literally took me several months to finish. I only could read in small doses, because this book was really depressing me and also triggering some of my own insecurities. (About creating a family. Though my problems lie elsewhere, but some of the usual phrases by especially the mother of one of the main characters, were really bugging me. They are sentences I get to hear by some of my family members over and over again as well, regarding a woman's 'one true responsibility': bear a child into this world.The story follow's two perspectives (actually theee,but I'll count the married couple Rishi and Kavvya as one perspective for now. Kavvya really wants to have a child. After several failed tries, she and her husband Rishi decide to adopt. The book follows their journey.Then there is Solimar. She flees from Mexico as a non registered to Anwrica. We follow her starting from Mexico over the border to America. Reading about all of her struggles and what she had to experience was really not easy. Once in America, Soli is pregnant and bears a cute little baby boy called Ignacio. Due to circumstance and a system that seems to be against Soli no matter what she does or tries, Ignacio ends up in Kavvya's and Rishi's custody. I feel like the book, no matter with whom Ignacio wouldhave ended up, would have felt unfair. There seemed to be no 100% right choice for anyone to take. This got my feelings worked up and in a mix of relief and sadness and anger, I closed the book. I couldn't decide whether I was ok with that ending. Reading the Afterword, made me understand, that there wasn't one correct outcome. That is life I guess. Sometimes you get hurt and it is unfair. The writing in itself was sometimes very lengthy and slowly progressing. Still it didn't feel boring. We just follow the story in a slower pace and the story builds up for both perspectives. We get to know the struggles and heartbreaks of both sides and thus build up understanding and empathy towards both sides. I think it was not only intentional by the author, but also necessary to make the reader feel what they'll surely feel at the end. The book definetly left me with very mixed feelings. And it is not my usual read and tbh, not a book I'd pick up again very soon. Not because I disliked it, but because it just felt to confusing for my own emotional state at this moment in my life. Trigger Warnings:Rape, Miscarriage, physical abuse, death, racism, abduction."}, {"userName": "Susanne Strong", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/4514828-susanne-strong", "userReview": "My heart is broken. And many tears were shed. Lucky Boy is a gut wrenching, soul searching novel by Shanthi Sekaran that keeps a tight grip on you and won't let go until long after you've read it. This story is about two women: mothers, who love the same little boy. But only one can will be able to keep him when all is said and done. And who is to say what's fair, what's right or wrong, when a little boy's life and when love is at stake? Soli is an illegal immigrant from Mexico and she is also the birth mother of Ignacio \"Nacho.\" While living in Berkley, CA, she gets into trouble with the law and loses temporary custody of her child.Kavya, becomes Ignacio \"Iggy's\" foster mother, along with husband, Rishi. Kavya and Rishi love and are able to provide good a life for Iggy, one in which he won't want for anything. For years, Kavya and Rishi struggled to have a child and had come close to giving up when they found Iggy. Their lives are close to perfect; Soli's however, has fallen apart. But she will stop at nothing to be reunited with her child. This leads to the age old question of which home is in the best interest of the child. The author, Shanthi Sekaran, did not make this plight an easy one. But boy, did she make us invest in it. Her storytelling is masterful, her words, beautiful. Further, all of the characters in the novel are extremely rich, well written and full of heart. While I felt that a bit of the novel was extraneous, all in all I absolutely love it and wished it never had to end. I will say, that for me personally, I was upset at the book's resolution and wish it had ended differently. My feelings on this however, did not detract from the loveliness of the novel. This book would be perfect for a book club or anyone who loves great literary fiction. 4.5 stars. Thank you to NetGalley, Penguin Group, Putnam and Shanthi Sekaran for an ARC in exchange for an honest review. Published on NetGalley and Goodreads on 11/20/16. **Will be published on Amazon on 1/10/17."}, {"userName": "Lynne", "userReviewDate": "Dec 20, 2016", "userURL": "http://www.goodreads.com/user/show/17408049-lynne", "userReview": "Outstanding writing about the disastrous state of our immigration system as told through the eyes of an immigrant. This was very thought provoking to me. Considering the title; I'm left wondering is it really so? Thanks to NetGalley for the ARC."}, {"userName": "Lorilin", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/5887880-lorilin", "userReview": "Soli Valdez is eighteen and desperate to leave Mexico. Bored with the day-to-day monotony of her quiet existence, she’s ready for an adventure. So she makes a plan to meet up with her older cousin who lives in Berkeley, California. If she can just make it across the border, her cousin assures her there will be a job and a place to stay waiting for her.Soli does make it to California, but not before enduring, well, a lot. When she finally arrives at Silvia’s doorstep, she is dirty, beaten, abused…and pregnant. Silvia demands Soli abort the baby, but Soli refuses. Nine months later, her son, Ignacio, is born, and Soli is happy–still existing precariously, but absolutely in love with her son.Thirty-something Kavya Reddy, on the other hand, is not so happy. Sure, her life is stable and fulfilling in some ways. She’s married to a man she loves, and she has a dependable job. But she’s desperate for a child and unable to get pregnant. Even after months of fertility treatments, nothing. Finally, when she can take it no longer, she and her husband, Rishi, decide to pursue adoption.It’s at this point that the lives of the two women intersect. Kavya and Rishi are ready to begin the process of adopting a baby girl, when Kavya spots toddler Ignacio at the adoption center. She feels a connection with him immediately and asks about fostering him. Despite being warned by the adoption agency that Ignacio’s mother–currently locked in a detention facility for illegal immigrants about to be deported–is very motivated to regain custody of her son, Kavya and Rishi end up taking Ignacio home with them. As you might imagine, this does not deter Soli from getting her child back one bit.I loved and hated this book. I felt about it the same way I felt about The Language of Flowers: it is so exquisitely written, but also ruthlessly, unbearably sad. Honestly, about 100 pages in, when I understood where things were going, I had to put the book down for a couple days. I just wasn’t ready emotionally to go there, you know? The things Soli goes through… Kavya, too… And poor Ignacio caught in the middle… To be so powerless is an awful thing.Throughout the book, I felt for both women. Author Sekaran spends so much time developing their backstories, motivations, and perspectives–Ignacio isn’t even born until page 176!–that I ended up caring for Soli and Kavya deeply, equally. It’s a real testament to Sekaran’s writing abilities that I had no choice but to empathize with both sides. Even the ending, though sad, felt whole and satisfying to me. It wasn’t tidy or unrealistically cheery, but it made sense and honored the characters and the story perfectly.Ultimately, this is a beautiful book–rich and layered and complex. I think it’s destined to be a book club favorite.ARC provided through Amazon Vine.See more of my book reviews at www.BugBugBooks.com."}, {"userName": "Gerard Villegas", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/34487436-gerard-villegas", "userReview": "This is one of those books that I couldn't put down. Lucky Boy is family saga involving two different woman of separate socio-economic and cultural backgrounds. The first is illegal Mexican immigrant Solimar \"Soli\" Castro who is pregnant and makes a harrowing journey across the California border and into the city of Berkley. The other is Kavya Reddy of Indian descent who struggles with infertility. Both their paths cross when Soli is jailed for fraud and illegal immigration leading for Kavya and her husband Rishi to adopt Soli's son Ignacio \"Iggy\" which turns into a bitter custody battle between the couple and the mother.Taking elements of the film Raising Isiah, the novels Brit Bennett's The Mothers, and M. L. Stedman's The Light Between Oceans, Lucky Boy contains various themes from motherhood, the influences of parenting, culture, xenophobia, socio-economics, and even the hot topic political debate concerning immigration.Author Shanthi Sekaran does a really good job with presenting two contrasting lives that diametrically opposite of one another. Soli is from an impoverished background and sees coming to America as an escape from her dreary life. However, her suffrage and the difficult struggles she forced to endure only fuels her bitterness. Still, her son Iggy provides the only good thing in her life despite all the hardships she had to face. On the other side, Kavya has led more of a charmed life as she is married to a successful husband and a good career. Despite the pressures faced upon her by her culture and her overbearing mother, she still longs to have a child of her own and adopting Iggy fulfills that dream.The sacrifices of motherhood is a constant within in the book. First from Soli who suffers during her incarceration but still holds up hope of reuniting with Iggy and second, from Kavya who is wants to be the perfect mother unlike her own. Each side is flawed and the author does showcase this which becomes a good question to ponder to whom Iggy should rightfully stay with. Even with the realistic ending, there is still that lingering question and truthfully, neither side appears to be in the best interest of the child. Again, this is a great book to meditate over.I would have rated it five stars but I found that the book could easily be trimmed a bit. Some of the parts concerning Kavya's and Rishi's friends and social circle a bit redundant and really didn't help much in the storytelling. Certainly, the presentation of Kavya's controlling mother was significant in shaping who she is as a person but again I found myself more fascinated by Soli's story than the couple.Still, this is a wonderful book to recommend for Book Clubs!"}, {"userName": "Dorie", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/16912659-dorie", "userReview": "This book is so timely with all of the immigration issues that our country is facing right now, this novel couldn’t have come out at a better time.For me this book is personal in several ways. First of all my father was an immigrant from Mexico 70+ years ago when he had to have a sponsor and a job in this country and learn English to gain citizenship. He from Oaxaca city in Mexico and I just visited there 2 years ago.One of my daughters has gone through 3 years of infertility work ups culminating in 4 failed in vitro attempts. I have been with her through all of the struggles, frustration, heartbreak, etc that goes with infertility.This book is very well researched and well written. The characters are fully developed and there is much attention to detail. I felt as though I was riding with Soli Castro as she made her very harrowing trip to the United States. She is pregnant by the time she reaches her cousin’s home and works as a housekeeper and sometimes nanny for a wealthy couple who have chosen to “look the other way” and employ her even though they know she is illegal. She has the baby, Ignacio, and falls in love with him instantly only to have him taken away when she is sent to a detention center before deportation. When Soli and her cousin are detained it is through a fluke accident that they are found to be illegal.The other main characters are Kavya and Rishi Reddy, who have spent all of their savings on infertility treatments which have just led to frustration and heartbreak. They have decided to pursue adoption and this is when our “lucky boy”, Ignacio is placed in foster care. They have quite a long time with him in which they are deeply in love with the little boy and have high hopes of adopting him. They are headed for heartbreak.The author states that “U.S. immigration policy is in a continual state of flux. This novel refers largely to policies which existed in 2012-2013. As of this reading, immigration law has largely remained unchanged and more than five million children in the US have at least one undocumented parent.”Though at times this book is very sad it is definitely a worthwhile read. I felt the characters were very believable and relatable and I think anyone would appreciate this beautifully written book. I think it would be a good choice for a book club with many timely topics to discuss.Thank you to the author and publisher for an ARC of this book."}, {"userName": "Kathleen", "userReviewDate": "Jan 08, 2017", "userURL": "http://www.goodreads.com/user/show/891502-kathleen", "userReview": "If John Gardner is to be believed, then there are only two plots in all of literature: \"A person goes on a journey\" and \"A stranger comes to town.\" In her sweeping, deep and strikingly compassionate second novel, \"Lucky Boy,\" Shanthi Sekaran weaves these two elemental narratives with emotionally arresting aplomb.One of the novel's paired protagonists, 18-year-old Solimar Castro-Valdez, or Soli, bravely sets off on the fraught journey to cross the border from Mexico to the United States, only to arrive without legal permission and unexpectedly pregnant. Her parents pay a smuggler to help her leave her tiny, forlorn village, Santa Clara Popocalco, because it \"offered no work, only the growing and eating of a few stalks of corn,\" and because she \"wanted California, and she wanted it badly enough that anyone who threatened to take it away … would have to be ignored.\"The other protagonist, 35-year-old Kavya Reddy, decides that — in spite of possessing a beautiful Craftsman bungalow with her husband, Rishi, as well as a satisfying a remunerative career as a chef — she needs to embark on the journey of motherhood for her life to feel complete. The daughter of Indian immigrants, she feels such intense cultural and personal pressure to reproduce that sometimes, amid her struggles with fertility, \"She vaguely and irrationally worried that the infant supply would be tapped out by other lucky women — that in the great heavenly handout, no babies would be left for her.\"In Berkeley — where Soli ends up at the home of a cousin, Silvia, who claims to be \"high-tech\" and \"doing well,\" and where Kavya and Rishi make their home — the stranger who ends up bringing their lives irrevocably together is Soli's new and unanticipated son, the lucky boy of the novel's title.To call him lucky is not an ironic gesture on Sekaran's part, but it's also not an uncomplicated one. Much of the book's conflict hinges on how fortunate he is to be loved fiercely by two women — his mother, from whom he is taken when she winds up in an immigration detention center after a traffic stop, and Kavya, who fosters him, intending to adopt him and make him her own. Sekaran's handling of this situation, though humanistic and ultimately uplifting, does not oversimplify or sugarcoat the wrenching difficulty of such a situation.Soli becomes \"Alien 127676\" in the detention camp, where \"Prisoners slept head to toe, and at night, they shivered.\" Meanwhile, Ignacio, her \"Nacho,\" becomes \"Iggy\" in the home of Kavya and Rishi, who have been duly warned that \"there's a chance — a good chance\" that his mother will return for him and that \"long-term placement here is not a certainty.\"Topical and timely, but thankfully neither pedantic nor preachy, Sekaran's book invites the reader to engage empathetically with thorny geopolitical issues that feel organic and fully inhabited by her finely rendered characters.Because of the way Sekaran examines the vagaries of economic inequality and the messiness of love in addition to the intricacies of immigration and adoption, \"Lucky Boy\" would make a promising pick for a book club. The circumstances feel well-researched, but Sekaran never lets that research get in the way of what is, at its core, a gripping story.The sentences themselves are beautiful too, as when she writes: \"Why did people love children that were born to other people? For the same reason they lived in Berkeley, knowing the Big One was coming: because it was a beautiful place to be, and because there was no way to fathom the length or quality of life left to anyone.\"And while the book certainly is, as Gardner might have it, about journeys and strangers, above all it is about vicissitudes of luck comforting and unjust, good and bad. Sekaran offers her audience the opportunity to consider chance itself — the accidents of circumstance we don't want to acknowledge as defining our fates, preferring instead to insist we are the ones in control."}, {"userName": "Barbara", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/11701608-barbara", "userReview": "In writing this novel, author Shanthi Sekaram was inspired by a news report of an undocumented Guatemalan woman who was attempting to regain custody of her son who was being adopted by his foster parents. She was interested in the motivations of both parties; she wanted to understand both parties.Sekaram is a first generation American whose parents were fortunate to find a workable way to live legally in the USA. The plight of undocumented immigrants are an interest to her; she sees her life as lucky in that her parents possessed skills and were from a country that the USA prefer. The politics of undocumented immigrants are an important issue to her.In this story, a young Mexican girl, Soli, goes through horrendous conditions to get illegally into the United States. Her destination is Berkley, CA because she has a cousin who is documented and successfully living there. Once in Berkley, Soli realizes she’s pregnant. The reader learns of the sad health resources that are available to immigrants. Soli’s life as an undocumented worker is exhausting. Soon after her baby boy is a year old, Soli unwittingly gets involved in a traffic incident that exposes her to the authorities. Her son is taken away from her, placed in social services, as she is remanded to immigrant detention.Kavya and Rishi are first generation Americans whose parents emigrated from India. After undergoing heart wrenching fertility issues, they decide to adopt a child. Once they learn the cost of a private adoption, they realize they can’t afford it after the expensive fertility treatments. They decide to go through the foster care system, and become foster parents interested in adopting. Soli’s son becomes their ward. They fall immediately in love with the boy.Sekaran does a fabulous job creating endearing characters. The reader sees both sides of the issue; it’s heart breaking. Sekaran also illuminates the horrors that many undocumented immigrants go through to get to the USA. She shows how these people just want to work and live their lives in peace. She also studied the laws that govern these children of undocumented workers. In general, the judge that resides the case generally determines the rights of the undocumented.I highly recommend this timely novel as one that exemplifies immigrations issues, especially for those immigrants who want to be part of the country, and the difficulties posed to them to be documented. The story also shows the emotional issues of those foster parents who deeply love their children under their care and believe they are the best choice for the welfare of the child/children. This would be a fabulous book club read."}, {"userName": "Erin Glover", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/8037048-erin-glover", "userReview": "That dark hole of infertility that brings a rollercoaster of emotions, makes couples question the meaning of life, threatens marriages, and brings then steals hope invades Kavya and Rishi’s lives. Of Indian descent, Kavya’s mother reminds her that adoption would dirty the bloodline. As they struggle with their limited choices, they compare themselves to another Indian couple, Preeti Patel and Vikram Sen who also live in Berkeley, California. Preeti Patel is Kavya’s childhood friend and their parents are best friends. Preeti was always a little better than Kavya, especially when she gets pregnant. Sen started his own company and made a fortune. He is also Rishi’s boss and Rishi’s idol. But Kavya learns Preeti is not who she thought she was. She does not have it all. And Rishi begins to question his idol’s morals.As Rishi questions Sen’s morals, he questions his own. Infertility challenges the couple’s liberal beliefs. They wonder if love can change what they know to be morally correct. This is the central issue of the novel. In a parallel world, an 18 year old Mexican emigrant named Soli hops the deadly train nicknamed La Bestia continuing her journey to the US. Hopping this train is considered too dangerous for women, but she demonstrated her courageousness on an earlier leg of the journey so the young men allow her to accompany them. Not all of them make it.She eventually knocks on her Aunt Sylvia’s door in the US, having arrived after considerable difficulty. She manages to land a good job with a nice family, this connection becoming critical to her survival. Her life is going well though she hopes for more.Then, a single error leads to denial of her most fundamental human rights by the US government. By coincidence, her path crosses with those of Kavya and Rishi. The trajectory of their lives forces each of them to question their core beliefs.The story is engrossing. I kept turning the pages because there was plenty of tension. I read all 469 pages in two days. The writing was crisp. Sekaran didn’t use any literary tricks—there weren’t dozens of symbols to figure out at the end. Instead, she used beautiful metaphors and similes. However, it could have been shorter. Sekaran spent too much time detailing Kavya’s dark obsession with everything child-related. Perhaps she meant to do this. Perhaps infertility is obsessing."}, {"userName": "Megan Tristao", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/6924236-megan-tristao", "userReview": "Ughhhh book hangover. I read more than 400 pages yesterday. Then I frantically tried to finish on the train this morning but had to slow down to savor the last few pages because I realized I didn't want it to end. This is one of my new go-to reading recommendations.My review/blurb for the San Jose Public Library blog: \"I'll admit I picked this book up because I loved the cover (yes, I totally judge books by their covers), but now I can't stop recommending it to everyone I know. This beautiful novel follows two parallel stories in nearby Berkeley: one of an undocumented Mexican immigrant and the other of a middle-class Indian couple struggling with infertility. This book is especially relevant given the conversations around immigration in today's America, but I would recommend it anyway based on the engaging storytelling, vibrant setting and well-developed characters. You might have an opinion about who is wrong and who is right, but as the publisher declares, 'There are no bad guys in this story.'\""}, {"userName": "Lynn", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/15265939-lynn", "userReview": "This is the story of Ignacio, a little boy born to Soli, an undocumented immigrant from Mexico and being cared for in foster care by Kavya and Rishi, who are unable to have children of their own. All the adults love him deeply and want to raise him as best they can, which makes him a very lucky boy.But Soli ends up in an immigration detention center facing eventual deportation, and Kavya and Rishi want to adopt Ignacio, who is a US citizen. They can offer him a good life in the US, but Soli is his mother and wants him back, and there is no evidence that she is a bad mother, just in the US illegally. The characters are all very well portrayed, if not all sympathetically. They all have faults, some more than others. I had a hard time relating to Kavya. She seemed too self absorbed and entitled. I’m surprised she even wanted to be a mother. It meant putting someone else’s needs first and that just didn’t seem to be in her nature. I had much more sympathy for Soli, although she made a lot of mistakes along the way, many due to her naïveté. Some she did just to survive. Rishi eventually comes into his own, but for a big part of the book, he is just a reflection of Kavya. I loved Ignacio!You get a good feel for Berkeley, rural Oaxaca, Mexico and the horrors of Soli’s trip north. The sense of place is palpable in this book. This is a very timely read, given the state of our immigration problems and the current issue of children being separated from their parents. No parent should have to go through this if no abuse or neglect is suspected. Just being from another country is no reason to lose your children. I had flashbacks of the Elian Gonzales (?) fiasco when the US tried to keep a child from being returned to Cuba even though he had a family living there. Americans can be so smug about their superiority that they lose sight of the fact that natural families have the right to raise their own children. Who are we to say what is best for a child, when there is family available, especially a parent? We need to get over the fact that while we may be able to offer more “stuff”, the natural parent’s rights should prevail. (And this is coming from a former child protective social worker.) Commentary over. All that said, I would recommend this book."}, {"userName": "Muggleboooks", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/33082112-muggleboooks", "userReview": "The moment Julia (from PRH International) introduced the book to us, I knew that Lucky Boy is not my cup of tea, but somehow I wanted to read something that is out of my comfort zone.  Thank you Penguin Random House International for giving me an opportunity to read and review Lucky Boy by Shanthi Sekaran in exchange of an honest review. Lucky Boy is one hell of a strikingly beautiful novel, wherein two main characters were introduced.  Soli  , am illegal immigrant from Mexico who got involved with some guys, and found herself pregnant. She is the birth mother of Ignacio \"Nacho\". Since she's an illegal immigrant, she got into trouble with the state's laws. Soli temporarily lost custody of her child. Then meet  Kavya  , and her husband  Rishi  , Ignacio's foster parents. Kavya and Rishi had a hard time trying to make a baby, they were so close to having one, but all their hopes fell when the baby lost its heartbeat. They tried and tried and almost gave up, until Ignacio \"Iggy\" entered their life. Kavya treated him as her own, gave him a life that is close to perfection. However, only one mother can have Ignacio. Tell me how to stop all these feelings? The novel is full of hard reality facts. Subject matters are of importance. Immigration, parenthood, issues that are prevalent in this generation. Also, though the book did not focus on this particular aspect, rape issues were present. The book was set in a familiar place, but funny how the people aren't. There were different beliefs, personalities, values and characters. Even if the book did caught my interest, I can't help but notice the flatness of the author's writing style for the first 30 pages. Good thing that it happened to impressively improve along the way. I was too invested to the lives of the two mothers, but going close to the resolution, the story started to bore. I lost interest. Everything happened to be predictable. And the only thing that keeps me reading is the fact that I know the importance of this book, and that I am rooting for a surprisingly different ending. BUT, the ending left me upset, disappointed. Overall, Lucky Boy is definitely a compelling and promising book. One that is full of love and at the same time it will leave you conflicted."}, {"userName": "Viv JM", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/4243437-viv-jm", "userReview": "4.5 starsThis feels like a very timely book, dealing as it does with issues of immigration in the United States. It tells the story of two different women, from very different socio-economic backgrounds. There is Soli, a young woman from Mexico, who risks all to cross the border into the United States. At the other end of the spectrum is American Kavya, the daughter of Indian parents, college-educated and comfortably well off. The first half of the book moves relatively slowly as we get to know the characters, while the second half deals with how their lives intersect and I don't want to say too much about this as it would give too much of the story away.I thought this book was beautifully written, thought-provoking and more than a little heartbreaking. It is definitely a story that will stay with me a long time, and one that gives us a very empathetic and human lens to look at immigration policies and their effects on people's lives.Highly recommended."}, {"userName": "Jody Sunderland", "userReviewDate": "Nov 24, 2016", "userURL": "http://www.goodreads.com/user/show/7618217-jody-sunderland", "userReview": "An amazingly, well written novel, that will have you thinking about it long after you have read the last page. I couldn't put this book down and found myself thinking about it even when I wasn't reading it. Also as a mother, this book touched me on so many levels and found myself pulling for both mothers in the story. No matter what the outcome was , I think I would have questioned if this is really the best thing for the boy. I loved this book and I definitely put it in my top 10 books read this year!I received an advanced reading copy from Penguin Random House's First To Read program in exchange for my honest review."}, {"userName": "Cathy Branciforte", "userReviewDate": "Sep 12, 2016", "userURL": "http://www.goodreads.com/user/show/2749367-cathy-branciforte", "userReview": "I really enjoyed this book,...could not put it down......I couldn't decide how I wanted it to end, since I loved all of the characters and couldn't pick one side to root for. It was beautifully written and I was completely drawn into the lives of both sets of parents, and as I would go through each alternating chapter I would be hoping that that particular parent would \"win\" in the end, except in this story no one really wins. I think this would be a great book club selection, as there are so many things that could be discussed, sadly, most without a right or wrong. Highly recommend!Thanks to G.P. Putnam and Netgalley for the opportunity to read an advance digital review copy!"}, {"userName": "Jaclyn Crupi", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/13323030-jaclyn-crupi", "userReview": "This is a book that reaches into your chest and clamps onto your heart and then proceeds to toy with it until finally ripping it out and jumping on it. It's a little much. I seek out immigrant stories but this one never transcended the tragic set of circumstances it described. Great writing though. Truly great. My favourite books like this in recent times would have to be The Book of Unknown Americans, The Fortunes and Preparation for the Next Life."}], "description": "A gripping tale of adventure and searing reality, Lucky Boy gives voice to two mothers bound together by their love for one lucky boy.Solimar Castro Valdez is eighteen and drunk on optimism when she embarks on a perilous journey across the US/Mexican border. Weeks later she arrives on her cousin's doorstep in Berkeley, CA, dazed by first love found then lost, and pregnant. This was not the plan. But amid the uncertainty of new motherhood and her American identity, Soli learns that when you have just one precious possession, you guard it with your life. For Soli, motherhood becomes her dwelling and the boy at her breast her hearth. Kavya Reddy has always followed her heart, much to her parents' chagrin. A mostly contented chef at a UC Berkeley sorority house, the unexpected desire to have a child descends like a cyclone in Kavya's mid-thirties. When she can't get pregnant, this desire will test her marriage, it will test her sanity, and it will set Kavya and her husband, Rishi, on a collision course with Soli, when she is detained and her infant son comes under Kavya's care. As Kavya learns to be a mother - the singing, story-telling, inventor-of-the-universe kind of mother she fantasized about being - she builds her love on a fault line, her heart wrapped around someone else's child. Lucky Boy is an emotional journey that will leave you certain of the redemptive beauty of this world. There are no bad guys in this story, no obvious hero. From rural Oaxaca to Berkeley's Gourmet Ghetto to the dreamscapes of Silicon valley, author Shanthi Sekaran has taken real life and applied it to fiction; the results are moving and revelatory.", "title": "Lucky Boy", "url": "http://www.goodreads.com/book/show/29430055-lucky-boy", "average": 4.14, "cover": "https://images.gr-assets.com/books/1460908703l/29430055.jpg", "reviews": 1103, "authors": [{"url": "https://www.goodreads.com/author/show/1779547.Shanthi_Sekaran", "name": "Shanthi Sekaran"}], "type": ["Fiction", "Contemporary", "Adult Fiction"], "outlinks": ["http://www.goodreads.com/book/show/29430055-lucky-boy", "http://www.goodreads.com/book/show/34474885-lucky-boy", "http://www.goodreads.com/book/show/34502102-lucky-boy", "http://www.goodreads.com/book/show/4215418-the-prayer-room", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}