{"ratings": 134, "userreviews": [{"userName": "Catherine", "userReviewDate": "Aug 23, 2010", "userURL": "http://www.goodreads.com/user/show/3282244-catherine", "userReview": "I received this book as an ARC.Reflecting back on this book a few words keep repeating in my mind. Confused. Complicated. Why??? I couldn't figure out the point to it all. Did it really have to be so hopelessly complicated? We're following Aria, Cort, Yuri, and Babette in the story. At one point or another we get a POV from each character. Each one of those characters is unlikeable. Aria was innocent and naive and insanely easy to manipulate. Cort was ashamed of being a werewolf and came off as really repressed. He also manipulated and lied to Aria throughout most of the book. Yuri plotted with Cort to play Aria and then had another plot on top of that plot! Babette plotted with Yuri but then also plotted to thwart him. Do you see what I'm getting at here? Everyone was plotting, and more often than not, an event or person would thwart part of the plan and then they had to skew the plot even more. The outside characters would plot against the main characters-who were already plotting to escape those outside characters-while the main characters plotted against Aria. But all the main characters weren't on the same page so they were also busy plotting against each other and then plotting to make sure that they weren't discovered. Confused? I was. Through it all, Aria just hung around like a dumb cow waiting to be taken to the butcher shop.The writing in this book was really odd. I can't put my finger on what exactly this author does differently, but it results in a very distant experience for the reader. The way it's written seems to emphasize the fact that you are an outsider reading a book. I, personally, like to feel a little bit more caught up in the story. It was even more pronounced in the love scenes, by the way. This book strongly reminded me of the \"old school\" romance style. Minus the rape, that is. The events felt overwhelming and it seemed like the heroine never came out on top. She wanted to run free as a werewolf and didn't care about the life they kept trying to convince her was better. Her opinions of, and acceptance of, her previous circumstances seemed to be looked down on and scorned even at the end. It was frustrating, because I wish that Aria would have once told them to screw it and went and did what she wanted. But no...she fell in love and automatically decided that love made ignoring her wants and needs worth it. Like I said, it reminded me of the older romances. It also didn't help that strong emphasis was placed on how innocent and naive and trusting Aria was. I don't think I'll read anything else by this author. Even if I was willing to take a chance on liking the next set of characters better, I don't think I would ever search out this style of writing again. I like my third person view to be more absorbing."}, {"userName": "Laura the Highland Hussy", "userReviewDate": "Aug 25, 2010", "userURL": "http://www.goodreads.com/user/show/2043222-laura-the-highland-hussy", "userReview": "I received this book as an ARCThis book was quite a mess. I've only read one other book by Susan Krinard- Touch of the Wolf- but this was not only very similar, but not as well written.The main premise of this story is that a female werewolf named Aria who has to hide her true identity, is being taken to America from her small Austrian town. Her guardian Franz knows everything, but has yet to tell Aria anything. He has kept her hidden away from the world in a cabin in the mountains allowing her to run wild. However, once in New York, Franz is killed and all of his papers and money are stolen, so Aria still knows nothing other than her family is in San Francisco. So she takes a train to San Fran and gets kidnapped by some less than above board men.Enter our hero Cort. Beauregard Cortland Renier originally of the Louisiana bayou wins Aria at a poker game. He recognizes her as a female werewolf, and saves her from an awful fate. Thus begins the pack of lies Susan Krinard tries to feed us.Her book was so unnecessarily complicated it is unreal.Cort's friend Yuri recognizes Aria's eyes and sees her as lost relative to a wealthy family in New Orleans. He convinces Cort to go along with his plan.Meanwhile, Aria feigns amnesia for no reason I could figure out. Then Yuri and Cort bring in Babette, a former whore and the most famous madame in NOLA who is now a respectable widow in Denver. Babette's job is to train Aria the half wild wolf-girl to act like a lady a la My Fair Lady. Next the connection to the Renier family in New Orleans is kept from Aria and it becomes very like the movie Anastasia. It is my belief that Susan Krinard must have watched an Audrey Hepburn marathon before getting the idea for this book.During all this weird lying and plotting behind everyone's backs, we have a Duke from the old country who is trying to stage a coup and usurp the royal throne back in that tiny country near Austria. So he wants Aria. But even the Duke has an alias.Every character here had ulterior motives and plots that WERE COMPLETELY UNNECESSARY!! The plot could have carried on without all of the misconceptions and lies and half-truths. It was a sloppy job of trying to write an intrigue into the romance.Once everyone is done double-crossing and backstabbing each other, they end up in New Orleans where everyone is treated poorly. Cort at one point courted the beautiful daughter of the NOLA Reniers, Madeleine, but she accused him of forcing her and had her male relatives beat the crap out of him. She never then insulted Aria and Cort, and we, the readers, are just to take it?! Really? It was frustrating that Susan Krinard never gave us any resolution with any part of that, or with the bad guys. They were conveniently dead. No suffering, no finding out they were wrong, just dead with a tidy bow on top for the poor reading to just roll over and believe. Then everyone was double-crossed again, and might I add that it was out of left field! It not only didn't flow, but added to the irritating mess that I call Luck of the Wolf by Susan Krinard."}, {"userName": "Sandra Dagg", "userReviewDate": "Apr 07, 2015", "userURL": "http://www.goodreads.com/user/show/13054860-sandra-dagg", "userReview": "I have just finished this book, and once again, a very enjoyable story. Not a 5 star story this time, but that's only because, for some reason, the characters didn't grab me quite as strongly as the ones in the previous stories did. I think I balked at the hero's continual refusal (in his mind) to believe that he was being duped by someone he wanted to believe was not all bad. He was smart, too smart I think, to fall for the other man's lies as often as he did. That is my only negative comment, otherwise, as I said, another great read!"}, {"userName": "Marilyn", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/4770510-marilyn", "userReview": "I have enjoyed this book like I have enjoyed all her wolf books.Look forward to more!!!!! :))))))))))))))))))))"}, {"userName": "Janice Rose", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/39689423-janice-rose", "userReview": "A good first in a series!I enjoyed this story. The plot jumped around a great deal, with name changes, secrets emerging, and the lead female seemed more lost than I was. It did level out at times and all was revealed in the end. There are some really well-developed characters to be enjoyed! Happy reading!"}, {"userName": "Wenj", "userReviewDate": "Oct 19, 2010", "userURL": "http://www.goodreads.com/user/show/3262412-wenj", "userReview": "Review provided by Black Lagoon Reviews:Luck of the Wolf by Susan Krinard is filled with calculated manipulation, betrayal and deceit while keeping the whimsical story of a budding romance alive and well. Melded wonderfully with a story that seems like it should be straight out of a fairy tale, I was enthralled with the world that was brought to life in these pages.As this was my first time reading Krinard’s work I started out a little skeptical that the romance would keep me interested. However, I was soon put at ease because the plot is very intricate with layers of secrets and deceits that are continually being stripped away, thus slowly revealing the true nature of the characters. This added a nice suspense to the novel because you are never really sure at any given time what any of their true motives are throughout the story. I really enjoyed this aspect; it added a depth with the ever increasing plot-within a-plot scenarios that played out well against the more enchanting backdrop about a far away European kingdom, its murdered king and queen, and their missing daughter. It was also interesting to see how that would play out against a more menial mystery about a missing girl from a prominent New Orleans werewolf clan. Not to mention how any of this tied back to the main characters that seem so separated from these events. All in all I was really captured by the complexities and how all the threads tied into a nice bow at the end that left only a few unanswered questions.I also loved the complexities of the characters themselves. From the main characters to the secondary characters they all have a unique history and voice as well as hidden agendas and secrets. First impressions are often misleading in this respect and the true provence of the characters is slowly revealed to the readers over a long span which leads to some shocking discoveries in the long run.Like I said, first impression are often misleading in this book and mine of the main character Aria is no exception. There is a weakness and naiveté about her at first glance and I began the story thinking she could only play the victim, hiding behind strong male leads, and while to some extent that was true, she comes to demonstrate an iron will and a stubborn disposition that was remarkable. She is a free spirit who unabashedly says whatever is on her mind, but is continually made to believe that she should be demure if she is to fit into ‘polite society’. Through her we see the hypocrisy of the time and come to love her inner defiance. She is quite a rational and intelligent female character who follows her head and her heart instead of bending to the whims and manipulations of others. This in itself conflicts greatly with her often childlike representation and we are forced to accept the woman behind the mask of innocence.Cort is likewise an interesting and complicated character. He grew up in a rather deprived part of the Louisiana swamps outside of New Orleans and after being ‘put in his place’ by the wealthy New Orleans clan he struck out on his own determined to return one day a true gentleman, both polished and civilized. He is ashamed of his dual natures choosing to ignore the werewolf inside of him, feeling it to be something barbaric and unclean. However, he comes to doubt this new sense of self when he meets Aria. She embraces that part of herself as well as luxuriating in her own less than extravagant up bringing. He is constantly conflicted between these two worlds as his head and his heart vary greatly in their desires. However, despite this inner tumult he is a devoted and loyal friend to those around him and has a humble charm that is appealing even when his stubbornness gets the better of him.Between these two, the chemistry is also wonderfully written. There is a rhythm to it with constant ebbs and flows that keep the reader on edge hoping to see the them finally come to their senses and embrace the love that we see so clearly. Constantly I was ensnared by the change of moods in the characters in this respect, eagerly waiting for the moments when they let their shields down and gave in to their inner desires.The writing style was also quite enjoyable. I loved the voices of the characters as well as the fluidity with which Krinard was able to switch point of views. It was nice being able to see inside the heads of the various characters and get a sense of them and the motives that drove them. She did a marvelous job making it an effortless change on the part of the reader and I was left not having to think about the change of tone or pace because I was instantly aware of the part I was reading. Therefore it was merely enlightening and interesting instead of tedious and annoying as most books can be when they institute this particular device. Overall, I really enjoyed this novel. While Historical Romance is not my typical genre I was really drawn into the story and intrigued by the characters. The slight addition of a paranormal twist making the characters werewolves was a definite plus for me, however I was left feeling it could have been explored a little more thoroughly. That said I definitely recommend this novel for any fan of the genre!"}, {"userName": "Kathy", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/382146-kathy", "userReview": "1882 - Cort Renier - wereworlf, born in the Bayou, fell in love with a rich Renier, she didn't want to marry him, he left his family, with the help of Yuri Chernikov he learned to be a gentleman and to supress his 'wolf', lucky at cards. Aria - orphaned, raised in near isolation in the European mountains, near fictional Carantia. She is strong, she is free, she knows nothing of culture, and little of humans. her parents were king/queen of Carantia and made great strides in modernization and equality between were and humans. political intrigue led to their sending twins - one daughter secretly to be raised in the wild, and the other to their extended American family in New Orleans, where she was kidnapped at the age of 12 and not seen again. They were murdered, an ineffectual cousin took the crown and the country went backward again. At 18, Aria's guardian takes her to America, but is killed before he can connect her safely with her family... she makes it to San Francisco, and is finally duped, drugged, and taken as the prize in a nefarious card game. Cort is playing in the card game, and feels the need to win/rescue her...And the intrigue for 200 pages... Cort wants revenge on the New Orleans' Reniers, and agrees with Yuri (wanting a get rich quick scheme) who recognizes her as the royal heir he helped kidnap 8 years earlier (not knowing she was actually the twin) to educate her to be a lady and return her for a reward to the Reniers. Cort's emotions become entangled - both in what he feels for her and for what he left behind... ARia loves him, but withholds the truth..and finally, he comes to her rescue - he returns to his family - her family wants her back to their country... she must go - he agrees to go with her ... ahhhhh"}, {"userName": "Once Upon a Twilight", "userReviewDate": "Oct 13, 2010", "userURL": "http://www.goodreads.com/user/show/3515991-once-upon-a-twilight", "userReview": "I was so excited to dive into this book as it's a completely different plot then what I'm used to reading. s i began reading though, I just could not keep up with the dialog. The story was all over the place and very confusing. The storyline was hard to follow and did not have a reason to it. I could not understand the reason behind Aria faking the amnesia and why Cort was changing his opinion of her so that he can hide his affection for her. I think it was just very infuriating how naive and dumb this character was made to be. Overall, I just think this book could have been a lot better.This story begins with a gentlemen named Franz who is the guardian of Aria who is a werewolf. They live in a small town in Austria, where she is free to roam around the mountains. However, whenever she ask her family, Franz denies her that information. Franz know everything about this werewolf and has just told her that they are on their way to America, San Francisco to be exact. But while in New York Franz gets killed and all his paperwork and money are stolen, leaving Aria alone ans not knowing anything about her family or her true identity. Here's where Cort comes in. He's a Beauregard Cortland from Louisiana who wins Aria at a poker game and saves her from a horrible fate. review link: http://www.onceuponatwilight.com/2010..."}, {"userName": "Jennifer Monzon", "userReviewDate": "Oct 06, 2010", "userURL": "http://www.goodreads.com/user/show/4211572-jennifer-monzon", "userReview": "I was so excited to dive into this book as it's a completely different plot then what I'm used to reading. As I began reading though, I just could not keep up with the dialog. The story was all over the place and very confusing. The storyline was hard to follow and did not have a point (reason) to it. I could not understand the reason behind Aria faking amnesia and why Cort was changing his opinion of her so that he can hide his affection for her. I think it was just very infuriating how naive and dumb this character was made to be. Overall, I just think this book could have been a lot better. This story begins with a gentleman named Franz who is the guardian of Aria who is a werewolf. They live in a small town in Austria, where she is free to roam around the mountains. However, whenever she asks about her family, Franz always denies her that information. Franz knows everything about this werewolf and has just told her that they are on their way to America, San Francisco to be exact. But while in New York Franz gets killed and all his paperwork and money are stolen, leaving Aria alone and not knowing anything about her family or her true identity. Here's where Cort comes in. He's an Beauregard Cortland from Louisiana who wins Aria at a poker game and saves her from a horrible fate."}, {"userName": "Sylvia", "userReviewDate": "Feb 08, 2012", "userURL": "http://www.goodreads.com/user/show/4937657-sylvia", "userReview": "Luck of the Wolf by Susan Krinard. ( Historical Werewolf # 7).This book is set in Victorian times and is about a girl/werewolf being raised by an old man from when she was a baby in a remote location. When she is 20 year old and with no knowledge of her parents or family, because the old man does not want to tell her,they set out on a journey from Europe to San Francisco and eventually to New Orleans to re unite her with her family. In the process the old man is killed and with him all the knowledge of who she is and why she is meeting her family now. She is rescued from an unpleasant situation by another werewolf, who has his own motives for helping her. There is mistaken identity, villains, double cross and a happy ever after ending. This is the first book I have read by this author.It was an Ok story, but I felt the story could have done with some better editing. This reader did not buy the story that an immature 20 year old werewolf/girl brought up in the wilderness would be able to fool anyone in Victorian Society to believe she was a Society Lady with only a short amount of time to learn the basics."}, {"userName": "Steph", "userReviewDate": "Aug 30, 2010", "userURL": "http://www.goodreads.com/user/show/2142019-steph", "userReview": "Luck of the Wolf\n had a decent beginning introducing us to a female werewolf, Aria di Reinardus. Upon the death of Aria's guardian, Frantz, she finds herself alone, naive and the prize in a poker game. The man that \"wins\" her is Cortland Renier. He's attracted to Aria. She is claiming to have amnesia ... things get a bit confusing from the point on unfortunately. Cort's friend, Yuri, recognizes Aria. He believes she just may be the missing heir to the throne of the Catarinia Werewolf Empire. He comes up with a plan to \"trade\" her back.I had hoped that, even with less than favorable reviews, this would be a decent read. As I mentioned, it started out ok, but eventually it was harder and harder to continue on. I couldn't understand the need to have Aria fake her amnesia or why her guardian, Frantz, would keep her so sheltered.I have not read any other books by Susan Krinard, but I am aware of other paranormal romance series she's written. This book has not turned me off the author, just this book in particular.Thank you to NetGalley and Harlequin for the opportunity to read this book free-of-charge."}, {"userName": "Clint Griffon", "userReviewDate": "Apr 17, 2014", "userURL": "http://www.goodreads.com/user/show/30597989-clint-griffon", "userReview": "Werewolves. Revolutions. The shock of a nineteenth-century American city to a rural European girl. False identities within false identities. Court politics, rival houses, lost princesses. A commoner risen to the upper class, and a rogue Baron. The etiquette of civilised life, and the honesty of the wilderness. Love crossing social barriers, and loyalty to family and country pitched against romantic love. Greed, revenge, lust, love and honour, battling within one heart.There is certainly no shortage of good ideas in this historical supernatural romantic thriller. It's overloaded with them, but while one or two are used effectively in the story, the others just don't have justice done to them by the text, but float around without being satisfied. Despite that, the book seems to go on a bit too long. Either it needs to be simplified, or else structured, with some of the dramatic tensions being resolved before the end, leaving others to get the attention they deserve. As it is, it is just not under control, and I found it quite unsatisfying, in spite of its many strengths."}, {"userName": "Beverly", "userReviewDate": "Apr 12, 2011", "userURL": "http://www.goodreads.com/user/show/3730979-beverly", "userReview": "My thoughts:This was a good story and I enjoyed reading it.The author builds some decent characters, an interesting storyline, and puts it all together pretty well.Good or bad - I fell in love with Cort Renier from the start. I wasn't thrilled with Aria and her secret keeping - I guess I understood it for awhile, but at some point - LONG before he knew the truth - she should have told the truth!Cochrane is the kind of bad guy you love to hate! Yuri is nasty in almost all circumstances! I do love that part of the plot. The shifter aspect of this story is different from most shifter stories, as most find it unappealing and wrong to shift. The whole \"Upper class\" thought pattern is wrong in so many ways for me. Although this was not my favorite shifter story - I will pick up the sequel, if one comes out, just to see if Cort can get over his uppity, society issues and what happens after they go home to his family."}, {"userName": "BBMoreB ~", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/4948179-bbmoreb", "userReview": "This is the 7th book in Susan Krinard's 19th century werewolf series. I haven't read the first 6; so this was my first exposer to this author. I struggled in the beginning to follow the characters, each character seemed to have several names (the heroine was called Aria, Anna, Lucienne Alese and some I probably missed), - this along with all of the twists & turns it overwhelmed the story. The author had a great plot that included all of my favorite things: deception, backstabbing with a twisted romance tossed in but, I often felt confused. This is not a relax and read; to put it down and pick it up - meant I had to often backtrack to orient myself in the story. I do plan to follow up with this series; start back at the beginning with Touch of a wolf & move through them, just not at this moment."}, {"userName": "Paranormal Romance", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/22904875-paranormal-romance", "userReview": "An outcast werewolf turned gambler 'wins' a drugged woman one night in a game of poker and, after discovering her to be his kind, hashed a plan to pose her as the lost girl from a powerful family. The girl, who pretends to have amnesia agrees to this, knowing full well she's not this lost girl but still wants to know her family. The girl is passionate, innocent, and in love with her inner wolf- she's everything the man isn't. The romance, though present, was very muted-at least on the males side. You never really got the sense that he's truly in love with her, though it's clearly plan he cares very deeply for her-there seemed to be a disconnect there for me."}, {"userName": "Nina", "userReviewDate": "Apr 21, 2011", "userURL": "http://www.goodreads.com/user/show/3723963-nina", "userReview": "I've got to admit, I bought this book on a whim and was dubious whether I would actually like it. I was actually disappointed in reading it. There's something about the style of writing that I just don't like and the plot was not intriguing enough to draw me in. I kept reading it, hoping it would get better but to no avail. Others may enjoy this style of writing and author, but I think I'll pass on reading any more. The writing felt too clumsy to me and at times the plot too forced."}, {"userName": "Vicci", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/1134768-vicci", "userReview": "Review Available at: http://www.nightowlromance.com/nor/Re...“Luck of the Wolf” by Susan Krinard is a tale of scheming, betrayals and deceptions surrounding uncovering the mystery of a kidnapped princess of a prominent New Orleans Werewolf family."}, {"userName": "Melissa", "userReviewDate": "Mar 27, 2012", "userURL": "http://www.goodreads.com/user/show/7327191-melissa", "userReview": "I enjoyed that, glad there are 2 more of her books on my shelf ^_^"}, {"userName": "Michele bookloverforever", "userReviewDate": "Mar 31, 2011", "userURL": "http://www.goodreads.com/user/show/4530043-michele-bookloverforever", "userReview": "boring. weak willed, need to be saved princess. conflicted former bad boy saves her."}, {"userName": "Rida", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/3197646-rida", "userReview": "Only 3 stars simply because the story did not appeal. This book is no less well written than any of the others in the series."}, {"userName": "Danielle", "userReviewDate": "Nov 18, 2015", "userURL": "http://www.goodreads.com/user/show/33325328-danielle", "userReview": "On to better stories"}, {"userName": "SF_Reads (Mod)", "userReviewDate": "Oct 03, 2010", "userURL": "http://www.goodreads.com/user/show/148680-sf-reads-mod", "userReview": "Here's my review http://literarysluts.com/?p=1096"}], "description": "Branded an outcast by the noble branch of his werewolf clan, Cort Renier had come to San Francisco seeking fortune—and revenge. What he found was a mysterious beauty who could not—or would not—reveal who she truly was. At first glance she seemed vulnerable and afraid, like so many girls caught up in the debauchery of the city's whiskey-soaked gambling dens. But one look into her stunning turquoise eyes and he knew he'd found the winning hand.Aria di Reinardus had reasons of her own for concealing her identity, but Cort's kisses were more than enough to convince her to go along with his plan to transform her into a missing heiress and return her to her \"family.\" But they were not the only ones with secrets to keep and vengeance in mind, and they were about to discover that some destinies couldn't be outrun….", "title": "Luck of the Wolf\n      \n          (Historical Werewolf #7)", "url": "http://www.goodreads.com/book/show/8236952-luck-of-the-wolf", "average": 3.46, "cover": "https://images.gr-assets.com/books/1348233547l/8236952.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/17063.Susan_Krinard", "name": "Susan Krinard"}], "type": ["Romance", "Romance", "Fantasy", "Historical", "Shapeshifters"], "outlinks": ["http://www.goodreads.com/book/show/8236952-luck-of-the-wolf", "http://www.goodreads.com/book/show/9725050-luck-of-the-wolf", "http://www.goodreads.com/book/show/10695515-luck-of-the-wolf", "http://www.goodreads.com/book/show/13698226-luck-of-the-wolf", "http://www.goodreads.com/book/show/1103961.Touch_of_the_Wolf", "http://www.goodreads.com/book/show/1103965.Prince_of_Wolves", "http://www.goodreads.com/book/show/1103982.Chasing_Midnight", "http://www.goodreads.com/book/show/1103963.Once_a_Wolf", "http://www.goodreads.com/book/show/1054073.Bewitched", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/11781578-lover-s-leap", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/36685093-the-unimaginable"]}