{"ratings": 285, "userreviews": [{"userName": "Cindy", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/13364874-cindy", "userReview": "Good, lov the main character. not sure they would end up in bangkok. but it is entertaining. the \"game\" is sick, frightening to think possible. will continue to read addition bks from this author. different, not typical mysteries"}, {"userName": "Michelle Boston", "userReviewDate": "Nov 22, 2017", "userURL": "http://www.goodreads.com/user/show/41917689-michelle-boston", "userReview": "Worth the read, Triads galore in this book. Got the next one lined up for a read."}, {"userName": "vicki cummings", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/57257401-vicki-cummings", "userReview": "Lumping park reviewExciting and fast moving read book 1 and 2 in a day now starting 3.Characters so interesting and exciting.Great reading!"}, {"userName": "L.A.", "userReviewDate": "Sep 05, 2014", "userURL": "http://www.goodreads.com/user/show/4055856-l-a", "userReview": "Posted first to Blog Critics as Book Review: 'Lumpini Park' by Ty Hutchinson. The thrill of the chase refers to the adrenaline rush that comes from certain dangerous situations. This is sometimes sought as in the adrenaline junkie, but is also involved in some cases with the high stakes game of murder. In Lumpini Park by Ty Hutchinson, his character, Abby Kane, is hot on the chase of a sadistic game playing team, which leaves dead bodies throughout the world. Having found the most recent killers she knows there is more at stake for the kingpin, the one responsible for building the game is still at large and the time and place of the killings has only moved venues. Bangkok, Thailand is where she finds the next kill is going to be, yet her biggest issue is how to work with, and in her case around the local policing of that area. Yet now the case becomes even more deadly, the killer is already roaming, looking for the perfect kill, and Abby is no longer faceless. She is now in the cross hairs of this elite group of killers, and with no jurisdiction she is unsure who to trust. She must decide if this is the one where she walks away, or if she goes in with her usual style and bravado. Without her usual backup, she is also on the leaderboard of the game, moving up and bringing herself into danger in a way she had not anticipated. Can Abby learn to trust the local police force or do they have their own agenda where she may just fall victim to their own internal strife. She has to make a decision and for her there is only one. She must find the king pin and end the game, there is no other option. Hutchinson continues his series with his exciting character in the form of Abby Kane. Gritty and gutsy she is also chocked full of countering characteristics that come out in unique ways. At each dilemma you see more of her development, and find her faults to give her even more character. There is vulnerability but a rock solid strength that keeps you guessing on her decisions. Lumpini Park takes us into a world very different from our own, and Hutchinson brings Thailand to life in an intriguing way. If you enjoy suspense and thrillers you will find this a great addition to your library. Even with the danger you will find it packed with Hutchinson’s unique humor. If you have read any of the other Abby Kane thrillers this will top of your list. This is a must have read for the mystery aficionado."}, {"userName": "Jim", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/7627123-jim", "userReview": "Another fantastic high voltage Abby Kane suspense thriller from author Ty Hutchinson, \"Lumpini Park\" , delivers with a bang. FBI Agent Abby Kane is reunited with SFPD detective Kyle Kang to continue to be the \"Carlson's\" investigating the world wide \"Murder Game\". In part 2 of trilogy, \"Lumpini Park\", Abby and Kang are sent to to Bangkok Thailand to \"Play\" on in the game. Abby and Kang have to coordinate with local detective \"Artie\" to help guide them within the city, and watch their backs. It seems 19 teams are still playing this crazy \"Murder Game\" world wide. Picking up the next leg as the Carlson's proves to be extremely dangerous and harrowing for Abby. The local big boss of Bangkok's Chinatown underworld already knows Abby and Kang are not the Carlson's. The \"Creeper\" is dispatched to play the game and take out the \"Carlson's\" in Bangkok. Just packed with end to end action sequences and some fantastic dialog this book sizzles. I thought it was the best of the Abby Kane series so far to date. The characters are built so well it's easy to picture Abby and Kyle Kang as real people. The other characters as well were incredible. The conclusion has some pretty good twists to prep for the final book in trilogy. Once again a 5 star out of a possible 5 stars for Ty Hutchinson's \"Lumpini Park\". Author Hutchinson has found a pretty good formula with the Abby Kane Series. If you haven't read any of this series you are really missing out. I'm off to star final book in trilogy as soon as possible. Hopefully author Ty Hutchinson continues to develop more Abby Kane novels. Check them out ! A very enjoyable time reading to be sure."}, {"userName": "Bill Thibadeau", "userReviewDate": "Apr 06, 2014", "userURL": "http://www.goodreads.com/user/show/5326089-bill-thibadeau", "userReview": "I have read everything Ty has published for the simple reason that he writes engrossing stories. The stories and characters have much more than just a single dimension which, in my case, makes me want to keep reading. In fact, I read Lumpini Park in two evenings and lost some sleep over it.I liked that the setting for this book was in Bangkok. The author was able to convey the seedy nature of that town and its' underbelly. Having been in the far eat in my younger years, I can say that what Ty has written is real.A warning of sorts: Ty has crafted this book in a way that will \"get you\" at the end and ensure that you read the final book in the series. I know that I am now anxiously awaiting the next in the series. First Darby and now Abby. I wonder where the future will lead this fine author.I have a pet peeve relating to the rating choices on most review sites. I like how LibraryThjing has the ability to rate 1/2 stars. In this book, I really liked it and would rate it 4.5 stars. Perhaps there are people that don't want to give the full 5 stars so the authors end up with a lower rating. It would be nice if Shelfari (my personal favorite), Goodreads, and Amazon allowed a 1/2 star rating regimen.In summary, if you aren't reading Ty Hutchinson, you need to start now!"}, {"userName": "Sandy Wallace", "userReviewDate": "Oct 23, 2016", "userURL": "http://www.goodreads.com/user/show/31586265-sandy-wallace", "userReview": "The Game of Murder ContinuesIn this second book in the \"Chasing Chinatown\" trilogy, FBI Agent Abby Kane and San Francisco Detective Kyle Kane travel to Bangkok, Thailand to continue their search for the mastermind that has teams killing their way across the globe in a psychotic game of murder. As they learn more of how the game works by pretending to be the team they stopped in Book 1 (Russian Hill), they become the hunted by another player in the game and the local game master.Aided by a Thai police detective, they set up a sting operation, but there are traps and surprises awaiting them. As in the first book, the author builds on the relationship between Abby and Kane and also provides the reader with a real sense of the culture of Bangkok.I only gave this book four stars because it wasn't quite the adrenaline rush as the first book. To be fair, the first book laid out the ingenious plot (which is hard to top) and this one continues the plot the reader already knows. That said, it is well plotted, the action doesn't lag and the reader is well set up for the final book in the trilogy. So, job well done and worth reading. I'm officially a fan and I'm off to read Book 3."}, {"userName": "Stephanie Wolf", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/4418700-stephanie-wolf", "userReview": "Continuing on the trail of the Chasing Chinatown murder game, Abby is determined not to end her part just because they caught the killers in San Francisco, but her superiors are not in agreement with her. That is, until more murders are appearing somewhere else on the globe.This time Abby and her partner from San Francisco are sent to Bangkok. The only way to find out who is the mastermind of this sick game is to continue playing the game. Abby is persistent in discovering who is behind this and shut down this awful game and stop the killings of innocent people. That’s when things get interesting.As always, the suspense will keep you reading until the end, then wanting more. More dead bodies and more questions. Does Abby ever find the mastermind? While the deaths are not any conventional murder, the descriptions are graphic enough to visualize without going over the top. Ty has done another great job of twists and turns while keeping the suspense going, while mixing in relationships and trust."}, {"userName": "BMR, MSW, LSW", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/780663-bmr-msw-lsw", "userReview": "Abby again takes too many reckless chances. She gets out of it, of course, because she's the protagonist. I like her less and less, the further I get in the series.Now, I'm just finishing the books to see what happens."}, {"userName": "Steve", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/609437-steve", "userReview": "3.9"}, {"userName": "Patricia", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/20756479-patricia", "userReview": "GreatseriesI've gone from book one to book three non-stop. Fast interesting cultural knowledge. All around fun Read. Would recommend for a rainy weekend."}, {"userName": "Uwe", "userReviewDate": "Jul 05, 2016", "userURL": "http://www.goodreads.com/user/show/9267001-uwe", "userReview": "Still a very good story and the characters are pretty good too ......It was fun again, looking forward to number three ! Go Abby Go !"}, {"userName": "Karri", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/5035899-karri", "userReview": "ready for #3"}], "description": "Winning means killing. Sickos around the world are playing a deadly game, and the body count is climbing. In the second book of the thrilling Chasing Chinatown trilogy, FBI agent Abby Kane hunts the man behind the sadistic challenges the only way she knows how: by playing the game and moving up the bloody leaderboard herself.Abby arrives in Bangkok, Thailand, where she discovers a killer is already roaming the Big Mango looking for his next grand kill to win the game. As Abby is pulled further into the world of deadly play, the dynamics of the game suddenly change. Out of her jurisdiction and unsure of who she can trust, Abby is faced with two choices: walk away or die.", "title": "Lumpini Park\n      \n          (Abby Kane FBI Thriller #4)", "url": "https://www.goodreads.com/book/show/21420511-lumpini-park", "average": 4.15, "cover": "https://images.gr-assets.com/books/1394595594l/21420511.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/4823576.Ty_Hutchinson", "name": "Ty Hutchinson"}], "type": ["Action", "Suspense", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/21420511-lumpini-park", "http://www.goodreads.com/book/show/21863953-lumpini-park", "http://www.goodreads.com/book/show/18752773-russian-hill", "http://www.goodreads.com/book/show/25834997-contract", "http://www.goodreads.com/book/show/34829885-suitcase-girl", "http://www.goodreads.com/book/show/16091473-corktown", "http://www.goodreads.com/book/show/11304992-chop-suey"]}