{"ratings": 2569, "userreviews": [{"userName": "Jeffrey Keeten", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/3427339-jeffrey-keeten", "userReview": "”There is only so much a man can take before he gives in, before he breaks every tattooed oath and does everything---absolutely everything---he thought he would never do. For eternal loyalty is inhuman and betrayal is human.”\nThe Sam Worthington and Victoria Hill Scottish Gangster version of Macbeth (2006) is my favorite Macbeth and probably the closest cinematic version to this novel.Inverness.1970s.Setting: Run down industrial town with toxic air and poisoned earth. Crime is high as more and more of the population becomes addicted to an illicit drug called Brew, made in a witch’s caldron. (I know, heavy, right?) Hecate is the drug lord who, behind the scenes, manipulates everything. Duncan is the police commissioner. All Hail Duncan.He is honest, and if given a chance, he will lead Inverness back to a happy better life. So it all begins with a promotion that is given to a man named Macbeth. He is the head of SWAT, but they want to move him up to head of Organized Crime. It is a job that (Mac)Duff, his longest friend, has coveted. The decision is based off the fact that everyone in positions of power have come from the well educated, upper classes. Macbeth comes from the lower classes and was once completely strung out on Brew. Hecate, always one to sense opportunity, dispatches the witch Strega to Macbeth to share a prophecy with him. Hecate knows that Macbeth is the very guy he has been looking for to derail Duncan. ”The only person more predictable than a junkie or a moralist is a love-smitten junkie and moralist.”Macbeth is love-smitten, indeed, with the lovely woman who calls herself Lady Macbeth. She has fiery red hair, elegance, and flair that makes men go weak in the knees. She owns the casino in town, but her ambitions go way beyond controlling gambling. She thinks Macbeth should listen to the prophecy and become police commissioner, but why stop there? Why not mayor, as well?All Hail Macbeth.\n\nDouble, double toil and trouble;Fire burn, and cauldron bubble.\nMacbeth must become someone else, someone he fought, conquered, and left bleeding in the gutter of his past. ”He had to become that other Macbeth, the one he had buried so deep, that crazy flesh-eating corpse he had sworn he would never be again.” To be that man, he needs brew. He needs brew, sliding like silver snakes through his bloodstream, to give him the courage/cowardice to kill Duncan. ”Is this a dagger which I see before me?”Ambition achieved and yet unearned creates anxiety. Who can rest easy on the bones of their enemies when they weren’t truly their enemies, but good men more deserving? As Macbeth does more and more to friends who know too much and to those who simply stand in his way, ”Red feathers were stuck to the walls around them;” paranoia becomes his constant companion, and his weaknesses become more evidence . He is on a collision course with Duff, who becomes the only man who has a chance to stop him. All Hail Duff?Out of all the plays that I’ve read by William Shakespeare, Macbeth is my favorite. I haven’t read them all so I do reserve the right to change my Shakespeare affiliation as I work my way through the Bard’s amazing contribution to English Literature. It turns out to be a terrible alliance, due to the fact that Lady and Macbeth spur each other’s ambitions which, once achieved, turn out to be hollow and too highly priced. The greed for power is strong, and like a drug, people can start to want more, always chasing the feeling of that high when they first triumphed. Inexplicably, I’ve always liked Macbeth. I find myself, whether it is a play, a movie, or this novel, rooting for him even though he isn’t really that likeable. I see the promise in him that is overcome by the evil in him. I’m always hopeful that some writer or movie producer will pull him back from the brink and set him down on a path to be the man I know he could be. Of course, redemption is not the theme of the play, nor of any movie or book starring Macbeth. He must be consumed by his own guilt and insecurities. He must ultimately be destroyed by the weight of his misdeeds. There are ghosts, witches, and playful uses of characters. Seyton is transformed into some creature beyond the pale of human understanding. Everything I’ve read says that Shakespeare never intended the name Seyton to infer that he was Satan, but where the Bard may have let the opportunity flitter away in rewrites, Jo Nesbo did not. Nesbo certainly has fun with the characters. Caithness, a Scottish nobleman in the play, is cast as a woman in this novel, the lover of Duff. Hecate is a witch in the play, but becomes a male drug lord in this novel. Nesbo stays reasonably close to the original plot. \nI loved the 2015 version of Macbeth starring Michael Fassbender.I’m really impressed with the first volume I’ve read in the Hogarth Shakespeare series. Hogarth was the original press owned by Leonard and Virginia Woolf. Next on my list will be Margaret Atwood’s retelling of The Tempest. The others in the series are Tracy Chevalier retelling Othello, Gillian FLynn retelling Hamlet, Howard Jacobson retelling The Merchant of Venice, Edward St. Aubyn retelling King Lear, Anne Tyler retelling The Taming of the Shrew, and Jeanette Winterson retelling The Winter’s Tale. If they have not commissioned your favorite play yet, stay tuned. This novel was a bloody blast. I set aside all other books to focus on reading it over the weekend and found it, frankly, invigorating. Shakespeare made into a page turner. If you wish to see more of my most recent book and movie reviews, visit http://www.jeffreykeeten.comI also have a Facebook blogger page at:https://www.facebook.com/JeffreyKeeten"}, {"userName": "Amalia Gavea", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/56789747-amalia-gavea", "userReview": "‘’A seagull swept in over Fife through the silence and moonlight under a cloud-free night sky. Below, the river shone like silver. On the west of the river- like an immense fortress wall- a steep black mountain rose to the sky.’’\nWithout any prologue and lengthy introductions, I must tell you that this book is a masterpiece. It has the status of a classic, the making of a novel that will defy time. Nesbø took the masterpiece by William Shakespeare and elevated it to new heights. If you follow my reviews, you know that I have two obsessions: Wuthering Heights and Macbeth. I never thought I’d say that another writer would come to rival the greatness of the Scottish Play but there you have it. Sacrilege verified.Nesbø sets the action in Scotland, during the 70’s and we are transported into the fickle, cruel world of casinos, the drug ‘’market’’ and the universe of high crime. Everything is masterfully crafted to reflect Shakespeare’s world. Macbeth is the head of the SWAT unit, Lady is the owner of a quality casino, Banquo is Macbeth’s mentor. The Norse Riders gang is the main rival and Hecate is the mob boss who appears to move the strings and direct the characters’ fate. See what Nesbø did there? I think you do and I tell you it is a marvelous stance. He shows how Fate arms Macbeth’s hand and the sequence of events is immediate. The consequences unavoidable and irreversible.\n‘’The king of hearts and the queen of spades. That evening they met under an evil moon.’’\nAs in the original material, the finest scenes are the ones between Macbeth and Lady. Dare I say that their relationship in Nesbø’s retelling is even more fleshed out and poignant? Well, I do because it’s the truth. If you love this frighteningly alluring couple in the Bard’s play, you will fall head-over-heels for them in this novel. Macbeth is perfectly drawn. He’s slightly more malicious and ruthless than his Shakespearean counterpart but this is to be expected given the setting and the direction of the story. Because of Hecate's brew, Macbeth’s visions start early and they are striking. The depiction of his guilt and the emotional toil of his actions, his steady descent into despair, his surrendering to his fate is a devastating process to read and knowing the outcome makes it even worse, it makes it even more powerful.\n‘’I sleepwalk in the darkest night without hurting myself.’’\nLovely Lady...She is brilliant, as fascinating and dangerous as the Queen of Scotland. And do you know what I enjoyed the most? The fact that in Nesbø’s version, Lady is a powerful woman who has come into her own without taking orders and sh...from men. She is more experienced, more intelligent than Macbeth. Their relationship is balanced and loving yet, she doesn’t need him to define her as a person. She is not ‘’his’’ queen, she is a woman who has forged herself through fire and steel and takes responsibility of her own choices. And in this version, she is granted a number of redeeming qualities that are absolutely absent in the original play.\n‘’Sleep no more. Macbeth is murdering sleep.’’\nI cannot say much because spoilers are lurking. Even though we all know the original story, Nesbø has created quite a few twists and turns that forbid me to say much. It’s a joy to be able to recognise the exact scenes from the Bard’s play, the monologues and the famous quotes within the context of Nesbø’s story, to pinpoint the parallel lines between the two works. The bleak atmosphere of Scotland, the fact that most of the action takes place during the night, the frenetic 70’s vibe mirror the spirit of Macbeth to perfection. I didn’t expect such a successful adaptation of Shakespeare’s quotes into contemporary language without sacrificing their beauty, their impact, their significance. So major congratulations to Don Bartlett for the translation from the original Norwegian. The interactions are as solemn and as natural as they can be and the prose is rich in a distinct, dark Nordic beauty.Naturally, I knew of Nesbø but I’ve never read any of his novels. I didn’t let my expectations rise too much prior to reading this but to say that I was pleasantly surprised is an understatement. Nesbø took the Nordic heritage and the dark Scottish setting and remained faithful to the original source. Without presuming to be equal to the Bard, full of respect and obviously aware of the tremendous responsibility, he created a work that would make William Shakespeare proud. So, read it, dearest friends. This is the best retelling of Shakespeare’s work that we will ever come to know in our time…\n‘’I owe it hell on earth.’’\nMany thanks to Penguin Random House, Hogarth UK and NetGalley for the ARC in exchange of an honest review,My reviews can also be found on https://theopinionatedreaderblog.word..."}, {"userName": "Debra", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/5032725-debra", "userReview": "\"You’re a better man than me, Macbeth.\"Jo Nesbo's Macbeth is his contribution to the Hogarth Shakespeare Project. This book started slowly for me. Which is funny because the book opens to action but nevertheless it was S-L-O-W. There is a lot going on all at once and there are a lot of characters with their own agendas. I found I put this book down a lot in the beginning and turned to other books but kept coming back to this one. As I said I struggled in the beginning of this book as it was slow, but it didn't stay that way. This Mash up of Nesbo and Shakespeare was quite entertaining. After the first couple of chapters I was hooked. This book kind of snuck up on me. If you struggle in the beginning of this book as I did, stay with it, it's worth it as Nesbo unleashes his re-telling of Macbeth as only he can! It's gritty, dark and addictive (once you get past the beginning).\"It’s never what you want to do, but what you have to do.\"Set in the 1970's, this book focuses on a police force attempting to shed its drug problem. A dangerous drug lord named Hecate has high connections in the city and will use them to get what he wants - absolute power. He is manipulative and clever. Macbeth is a man with demons. He has addiction issues and is prone to violence and paranoia. He also just so happens to be the head of the SWAT team. Hecate's plan involves manipulating Macbeth while putting him in a position of power. Hecate also owns one of the two casinos in the rainy industrial town which serves as the setting for this book. The other casino is owned by Macbeth's girlfriend, Lady.\"A last desperate act which, seen from the outside, is a sacrifice, but which deep down you hope will be rewarded with the forgiveness of your sins and opening of heaven’s gates.\"A drug bust goes wrong at the beginning of the book and Macbeth and Duff, his childhood friend need to clean up the mess. It's not long after that drug bust when power, greed and guilt come into play. Ambitions can and do get the worst of people in this book. In one way or another various characters owe others debts and call them in. Soon greed, ambition, corruption, backstabbing, lies, murder, love, guilt and the need to be the top dog in the city get the best of many characters.Nesbo puts his personal touches on Macbeth focusing on political ambition, greed, murder, and police procedures and corruption. I thought Nesbo’s re-telling was clever, entertaining and intelligent. Nesbo's Macbeth was well written and well thought out. I can’t imagine how much work it took to write such a re-telling. I think he pulled off the re-telling brilliantly. I believe fans of Shakespeare's Macbeth will appreciate this book and also people who have not read Shakespeare's Macbeth will enjoy Nesbo's re-telling. In other words, I do not believe you need to be familiar with the original work to enjoy this version.Thank you to Crown Publishing and NetGalley who provided me with a copy of this book in exchange for an honest review. See More of my reviews at www.openbookpost.com"}, {"userName": "Paromjit", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/38610813-paromjit", "userReview": "Jo Nesbo, with his Scandi-Noir credentials, reinterprets Shakespeare's Macbeth within the provinces of a police force in the 1970s in a bleak declining town riven with gang warfare, drug addiction, corruption and all other manner of darkest deeds and where little differentiates the cops from the criminals. This novel mostly follows the trajectory of the original play, albeit in a suitably blood drenched and twisted fashion. Nesbo gives us a tale of ruthless political ambition, betrayal, treachery and murder, with a mesmerising and compelling antihero in the ex-drug addict, Macbeth, as the head of the heavily armoured SWAT team with a troubled past from which he was rescued by Banquo. The Police Commissioner is none other than Duncan, with Malcolm as his deputy and Duff heads the Narcotics unit. Recently promoted after a policing debacle, Macbeth has a skill and penchant for daggers despite the armoury of weapons at his disposal. There is an intense, heavily atmospheric, menacing setting of a rain sodden anarchic town, infested with a dense, poisonous, and ominous mist providing the perfect background to the rivers of blood that are unleashed in Macbeth's path to power.The manipulative Hecate is a drug lord serving up the addictive and lethal crack like 'brew' that so many need and cannot exist without. His 'witches' seduce the insecure power hungry Macbeth with the prophetic promise of the highest office of Police Commissioner, providing he leaves the drug business alone. Macbeth is egged on by the casino owner and his love, Lady, but needs to partake of the 'brew' to access the murkier qualities of his younger self to find the courage required to stab Duncan in his sleep, whilst laying the blame elsewhere. Macbeth succeeds beyond his wildest dreams, but all is not well. The delusional Macbeth's life begins to unravel at a startling rate with the rising tide of the dead as he descends into a drug fuelled psychotic haze of paranoia and hallucinations where everyone is suspect and a threat that has to be eradicated. If you are familiar with the play, then you will be aware of where all this is heading, although not quite perhaps in the way you might expect. Nesbo succeeds in providing us with a thrilling version of a contemporary reworking of Macbeth, which is one of my favourite Shakespeare plays, having first studied it at school. However, if you are in search of a tale that is anchored in reality, then you are doomed to be sorely disappointed. To get the most out of this retelling, you will need to suspend your disbelief on a number of occasions. I have seen many versions of Macbeth in a variety of settings through the years, Nesbo's Macbeth stacks up well with the best of them. It had me reading as fast as I could, desperate to find out how it all ends. Highly entertaining and providing you are not a purist, highly recommended. Many thanks to Random House Vintage for an ARC."}, {"userName": "Carol", "userReviewDate": "Dec 31, 2017", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "What a cast of ruthless psychotic killers! Is anyone NOT a cold blooded assassin in Jo Nesbo's reimagined take of Shakespeare's MACBETH? Is there even a hero to root for? Well, you'll have to read it to find out. Having not experienced the classic myself, I have nothing to compare to, but will surely be reading it sooner than later. My interest is now peaked!DARK and DEADLY from start to finish, I could not believe the betrayals....the backstabbing....the threats....the blackmail....the corruption, or the NUMEROUS egotistical power hungry political types. No human, regardless of age, is exempt from murderous annihilation....so beware, some parts are pretty tough to take.I did have my ups and downs with this novel. At times, it felt a bit long and wordy, but then Nesbo would throw in another bizarre character type or development and I was hooked again.As the story begins, it's raining....it's ALWAYS overcast and rainy in the small polluted town of 6,000. There's a wasteland of industrial factory closings and no jobs....except in the two rivalry casinos or law enforcement....or unless, of course, you're a drug lord or dealing junkie.AND NOW, after 25 years, corrupt Police Commissioner Kenneth is finally dead, and it seems everyone is vying for his job or others that will become available bc of anticipated change....thus the battle for power begins. Who can clean up the town? Is there a savior?Just remember, no one can be trusted in Nesbo's MACBETH and there's much going on here....lots of strange characters to follow. I have not even made mention of the Norse Riders, the mysterious Lady Macbeth, other worldly beings (that took me by surprise)....or the ending, hehehe, but enough said already. If Nesbo is your man, you have a little patience, and you're in the mood for a treacherously creative tale, you'll like this one.Many thanks to NetGalley and CROWN PUBLISHING for the ARC COMING APRIL 10, 2018 in exchange for my review."}, {"userName": "Matt", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "First and foremost, a large thank you to NetGalley, Jo Nesbø, Hogarth, and Crown Publishing for providing me with a copy of this publication, which allows me to provide you with an unbiased review.Contributing to the Hogarth Shakespeare collection, Jo Nesbø has created a modern retelling of the Bard’s Macbeth. Set around 1970, the story opens with a police raid on a local gang running narcotics. When the authorities bungle things exquisitely, leaving blood and bodies scattered around the clubhouse, heads must roll within the police force. During the shake-up, Macbeth is brought on as the new head of Organised Crime, set to turn his men into a respectable arm of the force. Learning of her husband’s new position, Lady Macbeth encourages her husband to continue his climb, which is further supported by a high-level crime boss, Hecate. During one of Macbeth’s visits to Hecate, three substance-altered prostitutes foresee Macbeth’s rise to the position of Chief Commissioner, at the top of the entire police force. With a number of officials ahead of him, Macbeth is unsure how he will accomplish this, happy to run Organised Crime for the time being. Lady Macbeth can see a clear path to the top and knows her husband has it in him, if only he will bend the rules to better his chances. She convinces her husband to murder the current Chief Commissioner and frame another official, which he agrees to do while under the influence of narcotics. From there, one murder begets others to cover-up the trail being left. Even when the sought-after position is achieved, neither Macbeth or his wife are satisfied. However, their paranoia force more cover-ups and the need to constantly look over their shoulders. It would seem that power is the most addictive drug of all, one that cannot be sated by a simple snort or needle. Might the rise to power lead to a devastating crash into oblivion? Nesbø weaves quite the tale, using the framework Shakespeare made famous, providing his fans and those who enjoy the Bard’s work quite a great story. Hogarth did well picking Nesbø to explore this dark tale. Nesbø has quite a dark side when writing for his adult audience, though is also well-versed in creating police thrillers that keep the reader engaged. Some love his writing—as well as the darker side of crime that emerges from the narrative—while others find his work too dense to enjoy, as it is not easily digested. I found myself straddling both camps here, though was able to forge ahead when I gained enough momentum (and time to read!). Macbeth is, of course a central character in the piece and Nesbø does a wonderful job portraying this man as someone who is in touch with his passions, but soon becomes swept up by all the power that is laid at his feet. One can only presume that it is the influence of his power-hungry wife and the influence of narcotics that led him down such a difficult path, one that would be paved in gold, only to reveal tarnished brass by the end of the book. Other characters emerge to support and block Macbeth’s climb to power, adding depth and flavour to the narrative, including those who see Macbeth for the corrupt leader he becomes. The story is strong and ties nicely into the original narrative laid out over four centuries ago. Using the same characters and most of their fates, Nesbø stays true while also modernising the story in an effective manner. Fans of Shakespeare will surely find their own weaknesses, but in an effort to entertain effectively, Nesbø is spot-on with his storytelling. Mixing short and longer chapters, the reader is able to develop a connection to the story and its characters, as long as a steady momentum is kept. As with all Nesbø pieces, the translation does not take away from the power of the message found within and, if anything, provides an even stronger piece.Kudos, Mr. Nesbø, for another excellent piece of writing. While your style is an acquired taste, those with the patience for it are surely in for a wonderful adventure. Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Barbara", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "3.5 starsThe Hogarth Shakespeare project invites current writers to update Shakespeare’s plays, setting them in modern times with modern characters. \"Macbeth\" by Jo Nesbø is a retelling of Shakespeare's play \"Macbeth\", which was set in the Middle Ages. The original story centers around a high-ranking Scottish military leader named Macbeth who - urged on by his ambitious wife Lady Macbeth - secretly murders the King so he can take the throne. Afterwards, the usurper becomes a murderous tyrant who orders the death of anyone who opposes him or threatens his power. I'll admit that - to refresh my memory before reading Nesbø's book - I watched the 2010 movie \"Macbeth\" starring Sir Patrick Stewart and Kate Fleetwood. *****Nesbø's retelling of Macbeth, set in the early 1970's, substitutes the police department of a downtrodden European city for the Scottish royal court. In Nesbø's story, Macbeth is the head of a SWAT team who - persuaded by his girlfriend Lady - murders the police department's Chief Commissioner to take over his position. Macbeth then engineers the death of anyone who suspects him of murder or endangers his position. Macbeth, in a magnificent feat of self-delusion, asserts that his ultimate goal is to clean up the city, wipe out corruption, and help the people - many of whom are addicted to a cocaine-like drug called 'Brew.' Unknown to Macbeth, however, his ascension to Chief Commissioner - as well as his ongoing ambitions - are being covertly manipulated by a major drug lord/drug manufacturer called Hecate.....who wants Macbeth in his pocket. In fact Macbeth himself soon becomes addicted to 'Brew'.....and later to an even stronger drug called 'Power.' (LOL)Macbeth has no loyalty and no conscience. Early in the story Macbeth orders the death of Banquo, a father figure who took Macbeth in when he was a homeless teenage addict.....and cleaned him up. Later on, Macbeth sends his henchmen to wipe out Duff, a steadfast friend from childhood who saved Macbeth from a child predator in their orphanage. No evil is too base for Macbeth, who's ultimately responsible for the murders of numerous men, women, children.....and a baby. Though Macbeth's depravity is off the charts, he stoically claims that - in the long run - 'it's for the public good.'All manner of things are seen in this book, including: ghost appearances; witches; spying; double dealing; gambling; drug snorting; a motorcycle gang; gatling gun massacres; sleepwalking; adultery; a demon; and more. There's a wide variety of action and intrigue....and even a bit of seduction and romance. Overall, Nesbø's book (more or less) faithfully follows the trajectory of the original play, so - if you're familiar with that - you'll have an idea of what happens. Jo Nesbø is the best-selling author of the 'Harry Hole' detective series - about a troubled, alcoholic Norwegian cop whose cases always involve gruesome murders. Thus, it's natural for Nesbø - who seems very familiar with the politics of law enforcement - to set his updated \"Macbeth\" in the environs of a police force.Nesbø's tale is well-written, compelling, and held my attention throughout. That said, the book feels overlong - with so many murders and battles that they feel repetitive. Moreover, the continuous treachery and barbarity becomes hard to stomach (for me).Nevertheless, I'd recommend Nesbø's \"Macbeth\" to readers who enjoy Shakespeare; the Hogarth series; and/or thrillers. It's well worth reading. Thanks to Netgalley, the author (Jo Nesbø), and the publisher (Knopf Canada) for a copy of the book. You can follow my reviews at https://reviewsbybarbsaffer.blogspot...."}, {"userName": "Phrynne", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "I always think Macbeth is one of the most memorable of William Shakespeare's plays. It has some of the most quotable quotes and outstanding characters. Who can forget Lady Macbeth washing her hands over and over, and that great scene on the moor with the three witches and the cauldron. Well Jo Nesbø takes all that and the rest and makes it into the best book!However it is not a light read. There are many long, descriptive passages and the characters frequently dwell at length on their own particular ambitions or failures. To counteract this there is a heap of action, more murders than you can count, and the constant references to the original play which are just so well done.I loved the setting of a dark, depressing northern industrial town. I admired the way Jo Nesbø managed to weave things like the witch's prophecies into his tale, especially the one about Birnham Wood. That was amusingly clever. I liked the way he kept each character so close to the way Shakespeare wrote them in mannerisms and ambitions even when he changed their gender!I liked it all very much. In fact I am enjoying this whole Hogarth series very much. Looking forward to King Lear next:)"}, {"userName": "Jaidee", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/17295672-jaidee", "userReview": "2.5 \"hazy, lazy, Tarantino \" stars !!!Like a Tarantino film this has blood, gore, lots and lots of action, hot babes, strong dudes and kept you entertained from beginning to end. I am not sure that this is what I wanted from a re-telling of Macbeth. I found this book lazy and hazy. Characters that had no depth, cheap psycho-babble explanations and tons of conveniences that would just pop up to carry the quick plot along.On a beach this might be great fun but as a modern adaptation of a masterwork I found it severely lacking !!Yes I liked it, yes I really did but I cannot in good conscience give it more than 2.5 stars !I will give Nesbo another go at some point but I wished he had worked much harder on this one."}, {"userName": "Emma", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "This is a brutal, blood soaked reimagining of Shakespeare's classic play. And when I say there's some death in it, I seriously mean it, once the book gets going you'd be forgiven for thinking there might not be anyone left by the end. Of course, if you've read Macbeth, you know how at least three of the characters end up (everyone always remembers the main three). Still, that does nothing to negate the constant sense of danger that pervades the book, the who's-next paranoia such as that felt by Game of Thrones readers/viewers. My paperback copy of this is even red-edged, exacerbating the feeling that real blood might well start seeping from the pages at any moment.However, it does has a slow start, and more than that, there are some issues with either the writing or the translation that separate the reader from the story and characters in some way. I wanted to like this one and I was worried. Then suddenly you realise you've gone from 'this is hard work' to being so involved you're barely noticing anything but the momentum of the plot and wondering just how crazy this is going to get. Answer: very. It's deliciously dark right to the end. Macbeth starts out a SWAT team leader in a dank and decaying 1970s Scotland, while his Lady runs the most opulent casino in town with a mixture of intelligence and cunning; yet their schemes aim much higher. The whole place stinks of corruption, full of backstabbing, personal vendetta, and ambition at all costs. As with the original, it is a masterful take on human psychology: the physical, emotional, and intellectual damage done by the relentless acquisition of power. This modern version adds addiction to the mix, effectively quickening Macbeth's decline into immorality and psychosis. While Macbeth falls, his childhood friend, Duff, rises, his character particularly well developed though the book, evolving under pressure as he is asked again and again to analyse his own principles. Each person is constantly challenged, the reader seeing the extent to which their choices reflect or reject their personal morality, such as it is.... It is exceptionally well done, the reimagining fitting perfectly with the themes of the original while offering insights and more than a little fun to the contemporary reader. Copy via Bookmarks reader panel."}, {"userName": "Kostas Papadatos", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/26165640-kostas-papadatos", "userReview": "Άθελά μου έπεσα σε κριτική γεμάτη σποιλερ. Την επόμενη φορά που θα διαβάσετε ένα βιβλίο και θέλετε να εκφράσετε την αποψή σας, να είστε πιο προσεκτικοί. Δεν έχω διαβάσει Σαίξπηρ, έίναι ανάγκη να αραδιάζετε ορισμένοι όλη την πλοκή?"}, {"userName": "Anna", "userReviewDate": "Apr 09, 2018", "userURL": "http://www.goodreads.com/user/show/18202588-anna", "userReview": "ΠΡΟΣΟΧΗ! Για την κριτική του βιβλίου θεωρώ ότι γνωρίζετε πως ο Μακβεθ είναι μια τραγωδία του Σέξπιρ όπου οι περισσότεροι ήρωες σκοτώνονται με τραγικό τρόπο και πως ο ομώνυμος ήρωας τρελαίνεται. Για τηλεοπτική μεταφορά προτείνω Φασμπέντερ-Κοτιγιάρ (και ξερό ψωμί). ένα εκπληκτικό re-telling της γνωστής ιστορίας από τον μάστερ του αστυνομικού θρίλερ... ανατριχιαστικές περιγραφές και πολύ πετυχημένα δοσμένη η παράνοια του ομώνυμου ήρωα... εκπληκτικός και ο ρόλος των υπόλοιπων ηρώων σε ένα βιβλίο 600+ σελίδων που διαβάζεται μονορούφι!Update: Έχοντας συνέλθει ελαφρώς από το πασχαλινό κατσίκι, το τσουρέκι και το σοκολατένιο αυγό (δεν μου πήρε η νονά μου, μόνη μου αγόρασα - ένα bitter κι ένα γάλακτος) και το συνεχόμενο διάβασμα-μαραθώνιο-ούτε-εκκλησία-να-ήταν, συνεχίζωΟ Μακβεθ στο ρόλο ενός αστυνομικού που ανέρχεται στην ιεραρχία από εκεί που δεν το περιμένει και ξάφνου χάνει τη γη κάτω από τα πόδια του: επηρεαζόμενος από την αγαπημένη του Λαίδη νομίζει ότι αυτός θα σώσει τον κόσμο, σκοτώνει όποιον νομίζει ότι του στέκεται εμπόδιο και απειλεί θεούς και δαίμονες, προκειμένου να φτάσει στο σκοπό του, ο οποίος μακάρι να ήξερε και ο ίδιος ποιος είναι....Από τα ονόματα όσοι ξέρετε την ιστορία του Σαίξπηρ μπορείτε να καταλάβετε το ρόλο των ηρώων, όπου νομίζω ότι όλους τους έχει δέσει στο σήμερα και στην ιστορία πάρα πολύ ωραία. Ναρκωτικά και διαφθορά της αστυνομίας είναι από τα θέματα που ο Νέσμπο χειρίζεται τέλεια ούτως ή άλλως, ενώ - προς μεγάλη του χαρά - αυτή τη φορά πρέπει να ξεκάνει ένα ολόκληρο αστυνομικό τμήμα και κάποιες αθώες οικογένειες μαζί!!! Προσωπικά βρήκα πιο εμπνευσμένη μεταφορά χαρακτήρα τις τρεις μάγισσες. Επίσης, επειδή είχε γίνει κάποια σχετική συζήτηση τις προάλλες σε κριτική μου για τον Ράνκιν, εδώ έχουμε ΣΚΩΤΙΑ (δεν ονομάζει την πόλη, κάπου δίπλα στο Φάιφ είμαστε, αλλά και το Εδιμβούργο εκεί κοντά είναι) και ΣΥΜΜΟΡΙΕΣ και ΜΕΓΑΛΟ ΑΡΧΗΓΟ ΤΟΥ ΕΓΚΛΗΜΑΤΟΣ. Εδώ που ο Νέσμπο συναντάει τον Ράνκιν για μένα λοιπόν!!Και τέλος, σπόιλερ-που-δεν-είναι-σπόιλερ: Αφήνει υπονοούμενα για συνέχεια στο τέλος!!!!!!"}, {"userName": "Sandy", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/24770184-sandy", "userReview": "When I was in high school, I was that weird girl in your english lit class who actually liked Shakespeare. The Hogarth Shakespeare project gave 8 authors a chance to recreate one of the Bard’s classic plays & when I heard Jo Nesbo was taking on MacBeth, I had to read it. And he’s done a remarkable job.It’s a daunting challenge. After all, we already know who did what & how it ends. But Nesbo has given it a modern facelift by turning it into a dark, violent tale of cops vs criminals set in an unnamed city drowning in drugs & corruption. Poor old Duncan is the shiny new Chief Commissioner of police while MacBeth heads up the SWAT team. Other familiar names have been assigned to characters on both sides of the law, their roles staying true to the originals. I won’t dwell on the story except to say this is decidedly bloodier than “the Scottish play”. But there are several things that make it work. First, the setting. Nesbo vividly describes his city & it’s a pretty bleak place. Relentless rain, dark streets full of skeletal junkies & rusted out factories litter the landscape. Now add in cops & politicians who have been bought & paid for by the rival drug gangs that rule the city. The result is a grim & gripping read that practically oozes moral decay. And that of course is the point. Shakespeare wanted to shine a light on the psychological & physical ramifications for those who seek power for power’s sake, how ambition without morality leads to carnage. He also distinguished between the sexes. Not that women can’t be just as reprehensible. It’s just their methods that differ. In this story, MacBeth’s wife may not care to actually get her hands dirty but she’s more than capable of inciting violence with well chosen words whispered in the right ears. Nesbo has nailed the themes & even sneaks in symbolic moments such as blood that won’t wash off. What I found most startling is how relevant something written over 400 years ago still is. But then all you have to do is read the news to find modern examples of his characters. It’s not an easy read but Nesbo pulls it off with style. The only negative for me was the abundance of long descriptive passages that stalled mounting tension at times. As always, the wonderful Don Bartlett has done an outstanding job of translation. Recommended for fans of Shakespeare and/or gritty crime drama. If you’re keeping track of this series, next up is Gillian Flynn of “Gone Girl” fame taking on “Hamlet”."}, {"userName": "Abby (Crime by the Book)", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/45237578-abby-crime-by-the-book", "userReview": "Full review to come! For now, find my top 3 reasons this book belongs on your 2018 TBR here: http://crimebythebook.com/blog/2017/1...HOLY COW. This book is freaking brilliant. It’s a dense read to be sure - but that is NOT a flaw. In fact I think that’s necessary in order to capture the moral complexity of Shakespeare’s play. This book has action thriller scenes, political machinations, and Nesbø’s trademark superb character development. I loved it!!!"}, {"userName": "Menia", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/48412114-menia", "userReview": "γι'αυτό και ο κύριος Νέσμπο είναι ο κυρίαρχος του παιχνιδιού, ακόμα και στο retelling σαρώνει!buddy-reading με την Geo <3 brace 2018 για την τετράδα με βιβλία με όνομα στον τίτλο"}, {"userName": "Skorofido Skorofido", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/50712289-skorofido-skorofido", "userReview": "Το ό,τι θα βαριόμουνα τη ζωή μου διαβάζοντας Νέσμπο ούτε στα πιο τρελά μου όνειρα… αλλά ποτέ μην λες ποτέ τελικά… βαρέθηκα τόσο πολύ τη ζωή μου που μέρες λιβάνιζα τις τελευταίες 50 σελίδες γιατί ειλικρινά δεν έβρισκα κανένα λόγο να τις διαβάσω…Δεν ξέρω αν ήταν αριστουργηματική ιδέα ή απλώς η εύκολη λύση όταν υποφέρεις από το σύνδρομο της λευκής σελίδας, το retelling μιας all time classic σαιξπηρικής τραγωδίας, εν προκειμένω του «Μάκβεθ». Θέλοντας προφανώς να πετάξει από πάνω του για λίγο ή πολύ δεν έχει σημασία τον Χάρι Χόλε (αυτό είναι η ευχή και η κατάρα των πετυχημένων sequel ηρώων, να παγιδεύουν τον ίδιο τον δημιουργό τους), ο Νορβηγός συγγραφέας δοκιμάζει κάτι άλλο, πάντα στα πλαίσια του νεσμπουκικού περιβάλλοντος, αστυνομικοί καλοί και κακοί, αίμα πολύ αίμα, διαφθορά, ναρκωτικά, μια πόλη σε παρακμή.Ο Νέσμπο πατάει ακριβώς πάνω στ’αχνάρια του Σαίξπηρ, χρησιμοποιεί ακριβώς τα ίδια ονόματα στους ήρωες του, τα ίδια πάθη και λάθη, δημιουργεί ένα ‘ευφάνταστο’ εύρημα όπου η εξουσία – το αιώνιο ναρκωτικό, πλέκεται με τον κόσμο των dealers, των junkies κι ενός νέου ναρκωτικού στην πιάτσα, του ‘φίλτρου’.Το βιβλίο δεν κατάφερε να με κερδίσει ουδόλως και στίβω το μυαλό μου να καταλάβω το γιατί. Κατέληξα στους εξής πεντακόσιους πιθανούς λόγους:1. Αίμα, πολύ αίμα, σελίδα και σκοτωμός και δολοφονία, χωρίς όμως λόγο και αιτία (έτσι – έτσι – έτσι να ‘χαμε να λέγαμε)2. Η πόλη που συμβαίνει το όλο στόρυ, είναι μια πόλη βγαλμένη από τη φαντασία του συγγραφέα, με τους δρόμους της, τα στενά της, τα καζίνο της και το δήμαρχό της, δίχως όνομα… κι ακριβώς επειδή δεν ήταν πραγματική, δεν μπορούσα να την κάνω εικόνα, έφτιαξα μια εικόνα δυστοπική, ζοφερή και τρομακτική που μου ταίριαζε μια χαρά σ’ένα μετα-αποκαλυπτικό θρίλερ μα όχι σε τούτο το στόρυ. Δεν μπόρεσα να εμπλακώ…3. Πολλά, πολλά μα πάρα πολλά ονόματα, ιδίως στις πρώτες 100 σελίδες, που το μυαλό μου έγινε αχταρμάς και δεν ήξερα τι διάβαζα – ποιος είναι ποιος, ποια η θέση του στην Ιεραρχία, ποιοι είναι οι κολλητοί και ποιοι οι εχθροί4. Η εξέλιξη του Μάκβεθ και της Λαίδης του, πως από άνθρωποι που ενδιαφέρονται για την πόλη τους εν μια νυκτί μεταμορφώνεται σε paranoiacs επειδή μεθύσανε από την εξουσία, τόσο χαζά δομημένη που θα την δικαιολογούσα μόνο σε πρωτοεμφανιζόμενο συγγραφέα5. Αυτή η τριγωνική μετάφραση από νορβηγικά – αγγλικά και στο βάθος ελληνικά, χαθήκαμε αδέλφια στη μετάφραση (μου έλειψε το spirit)6. Και εν τέλει, I really didn’t understand, what the fuck βιβλίο ήταν… αστυνομικό δεν ήταν (αφού δεν υπήρχαν άγνωστοι δολοφόνοι να τους κυνηγάνε οι αστυνομικοί, να ψάχνουμε κι εμείς οι κακόμοιροι να τους βρούμε), ψυχολογικό δεν ήταν (γιατί δεν υπήρχε καμία λογική για τις πράξεις των ηρώων), αισθηματικόν δεν ήταν (εντάξει μην μου πείτε για τον έρωτα – εμμονή του Μάκβεθ)… μόνο επιστημονική φαντασία στο μυαλό του Νέσμπο ήτανε…Με το ζόρι πιάνει τη βάση γιατί είναι Νέσμπο και δεν πάει στην τσιγγάνα μου καρδιά να τον καταβαραθρώσω… αχ! πολύ φοβάμαι πως οι παλιές αγάπες σύντομα θα πάνε στον παράδεισο!"}, {"userName": "Joseph", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/1281880-joseph", "userReview": "I have heard quite a bit of praise for Jo Nesbo in the past and saw this as a chance to evaluate the author. I loved the setting and the descriptions. 1970s gritty is perhaps my favorite setting for fiction. I grew up in the 1960s and 70s in a very gritty city myself. I really like the start of the book but after a while, the Shakespeare seemed forced into the story. It was like the story and the Shakespeare were fighting each other for dominence. I could not fall into the story."}, {"userName": "Gary", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/15055195-gary", "userReview": "I am already a fan of Jo Nesbo novels so was probably always going to get round to reading his contribution to the Hogarth Shakespeare project where current writers are invited to update Shakespeare’s plays, setting them in modern times with modern characters. If I am completely honest it did take me a while to get fully submerged in this one. The story is set in the 1970's with the Police force trying to eradicate it's serious drug problem. Macbeth is the head of the SWAT team and he has addiction issues of his own and faces a drug lord named Hecate, who has connections and sees himself manipulating Macbeth.This is an interesting experiment and although you don't need to be well educated in the original Shakespeare version I found it added to the intrigue and interest.A book that gets better the more you read.I would like to thank Net Galley and Random House for supplying a copy of this novel in exchange for an honest review."}, {"userName": "Dave", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/35045983-dave", "userReview": "For several years now, modern authors, acting under the auspices of the Hogarth Shakespeare Project, have reimagined Shakespeare's classic plays some 400 years after he wrote them. Before reading this book I was entirely unfamiliar with either the Hogarth Project or any of Nesbo's books. Let me be entirely frank when I say that Nesbo hit a grand slam with this amazing noir-filled literary masterpiece. For those who know MacBeth, it's all here from the grimy foggy moors to the haunting dreams to the three witches of prophesy to the deaths escalating till there's few left to the Lady MacBeth washing her bloody hands over and over again till they are scraped raw. But the genius of Nesbo's work here is that, even if you put Shakespeare aside, it's a powerful feast of dark gritty crime fiction, delving into waves of power-hungry madness, guilt, betrayal, and loyalty. From the very first pages setting the stage in this stagnating old industrial town where the harbor is filled with rotting carcasses of rusty freighters to the back alleys filled with drug addicts desperate for their next fix, this book is tremendous. There's biker gangs and casinos and SWAT teams and a scramble for leadership in a rotting corrupt police department. Every page is chock full of depth and meaning. The first Nesbo book I ever opened, but absolutely not the last. Many thanks to the people at Crown Publishing for providing an advance copy for reviewing."}, {"userName": "Αλκιβίαδης Βασίλειος", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/63175943", "userReview": "Αιματηρό! 😜 Δυνατό! 😎 Καταιγιστικό! 😎 Και διαβάζεται μονορούφι! 🚔🚔 Ένα βιβλίο με κινηματογραφική δράση, με ιδιαίτερους και καλοδουλεμένους χαρακτήρες, ζωντανούς διαλόγους, και την απολαυστική πινελιά του NESBO! 🚔😎😜🚔Το συστήνω ανεπιφύλακτα !!! 😎🚔😜"}, {"userName": "Dennis", "userReviewDate": "Nov 18, 2017", "userURL": "http://www.goodreads.com/user/show/67496521-dennis", "userReview": "Joe Nesbø's \nMacbeth\n is a standalone retelling of William Shakespeare's Macbeth with a modern day, Joe Nesbø crime fiction spin that we all love and respect from the Stephen King of police drama novels. The novel starts sets the stage in the 1970s, in a destitute, crime and drug ridden town in rural Norway, where the townsfolk are ruled by addiction. Both drug ring leaders, Sweno and Hecate, are the supreme leaders of the organized crime and drug power in the town. Another ruler of the town is Lady, who owns and operates the town's casino, Inverness. After a successful crime bust, Macbeth is promoted to the Head of the Organized Crime Unit. Through manipulation and the thirst for power, the shift of balance in the crime force is completely descended. If you are a lover of William Shakespeare or the New York production of Sleep No More, I encourage you to check this story out.My ratingI am giving this story right down the middle 3 stars out of 5 and I'll tell you why. Although I'm not the biggest Shakespeare fan, I do enjoy Macbeth and was excited to pick up this retelling. I have broken down reasons why Joe Nesbø's upcoming book gets a right down the middle review for me.1. The characters in this story are very similar to Shakespeare's story. Mainly, most of the characters are named exactly as their original counterparts, which at first was interesting, but then sort of bored me. I've read other retellings where the cast of character slightly deviate from the characterization in their original work and it has worked astoundingly for me. It allows the reader to not guess the next steps of each character and also not be bored by a story that they've read or heard already. It keeps the reader engaged, focused, and confused (but in a good way!). This was my main concern about this story and I felt the need to get that out there first before getting into the good stuff.2. In contrast to the character originality, the story presented to us is uniquely defined and was masterfully done. Rather than the story be about royals and servants, this retelling involves crime units and drug lords–still interconnecting the main themes that you come to expect with this story: manipulation, power, greed. These centralized themes are portrayed perfectly from the moment you crack open the book, until the final chapter. Human behavior can be it's own worst enemy.3. This was my first read by Jo Nesbø, but everyone I know has been raving about him for a long time so I figured, let me start off with a standalone and see what I thought. Jo Nesbø is truly an artist when it comes to creating the picture with words. I could picture exactly what Nesbø was describing and it was incredibly captivating for me. He can uniquely describe a setting better than most authors I've come across lately, and that is a skill that can't be taught My final thoughts: If you've never read Macbeth or absolutely loved it, pick up this book! If you're hesitant because you know what happens already, or want something a little more original–maybe sit this one out. Retellings can be difficult to review, because everyone has a different emotional attachment to the story being reenacted and I truly believe that this story will also be polarizing. Macbeth will be released in April 2018. I was provided an advanced copy in exchange for my honest review."}, {"userName": "Stephen Collins", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/47521763-stephen-collins", "userReview": "JO NESBØ the Norwegian Thrillar writers new book is one of not a sequal to Harry Hole. You have two choices here to read this as some people will a great crime book or go down the second road which is what this book is. A new series of authors each writing a book separate from each other but all based on plays by The Bard William Shakespeare's plays called The Hogath series -The Tempest, Othello, Hamlet,The Merchant of Venice, King Lear, The Taming of the Shrew,The Winter's Tale & here Macbeth by Jo. We have Chief Commissioner Duncan, Duff, Banquo you be laughing out loud or cringing as here the names if love Macbeth the Scottish Play because here we have Fife too.  But this must been very difficult to do to drug crime book & then place it into the world of Shakespeare without spoiling it to be able to have a here the dark Gothic Bloody murder of The Thain of Cawdor into the modern world of NESBØ yet still keep to a shadow of the plot. Only thing of course is if know the end of the play if stays on track you could know the end of book ? The other thing I love about this book is that unlike other books in the series NESBØ has NOT changed the Title so if truly love The Unlucky Play Don't say ...........Mac...... Not since the first Hole set in Australia has NESBØ set a book outside of Norway this of course is set in Drug Gothic Scotland in Inverness & Fife. Macbeth has in the play along with his wife no Christian names So Lady Macbeth here is just Lady a casino owner who Whisper's in his ear. Kill the King! We have few people that are not in the play or had no name but in a book have too.But after seeing Orsen Wells version of the play or late great Henry Irving who often was famous for \"changing the plot\" to make him more heroic this just as good. I have seen other modern versions of both Macbeth ,Hamlet, Lear, Othello,Jules Cesar with an all black cast & Lear with Maggie Smith in the role. So this no different As this 1970s book progress it gets more & more brutal & you wonder why he set it in Scottish atmosphere when it is more like the Gangs of New York in the roaring twenty's than Scotland .You also know that it cannot end well because it is based on the play but that is not what it is about not book with goody too shoes ending no lovey divvy sloppy ending here.This tradition of Transform of Macbeth a tragedy of Scotland"}, {"userName": "Γιώτα Παπαδημακοπούλου", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/8568177", "userReview": "Τα τελευταία χρόνια έχουν κυκλοφορήσει αρκετά retellings κλασσικών βιβλίων και παραμυθιών τα οποία, επί του πρακτέου, δεν αποδείχθηκαν ιδιαίτερα πετυχημένα. Σε προσωπικό, τουλάχιστον, επίπεδο, με απογοήτευσαν οικτρά, με το ένα να είναι χειρότερο από το άλλο. Όταν, λοιπόν, έμαθα πως θα κυκλοφορήσει το \"Μάκβεθ\", η πρώτη μου σκέψη ήταν πως το να πει κάποιος από την αρχή μια ιστορία που έχει γράψει ένας εκ των κορυφαίων συγγραφέων της παγκόσμιας λογοτεχνίας, ο Shakespeare, δεν είναι απλά ρίσκο, αλλά κάτι σχεδόν αδιανόητο. Και όμως, ο Nesbo, απέδειξε πως όχι μόνο γίνεται, αλλά και πως το αποτέλεσμα μπορεί να προκαλέσει ρίγη ανατριχίλας και έναν ενθουσιασμό που δεν είμαι σίγουρη αν κάποιος άλλος συγγραφέας θα μπορούσε αν βρισκόταν στη θέση του.Σ' αυτήν την σύγχρονη εκδοχή ενός των εκ των πλέον κλασσικών έργων της παγκόσμιας λογοτεχνίας, συναντάμε τον επιθεωρητή Μάκβεθ -ο οποίος είναι πρώην τοξικομανής, εκτός των άλλων- που, μαζί με την ομάδα του, επιτυγχάνουν να ξεσκεπάσουν μία απ' τις μεγαλύτερες σπείρες εμπόρων ναρκωτικών και να οδηγήσουν στη σύλληψή της. Η μεγάλη αυτή επιτυχία θα του αποφέρει την αναγνώριση που ο καθένας θ' αποζητούσε στη θέση του, δόξα, μεγαλεία, χρήματα, μα και τον σεβασμό όλων όσων βρίσκονται γύρω του. Όμως, παρά που φαινομενικά έχει τα πάντα, η παράνοια τού χτυπά την πόρτα, αρχίζει να πιστεύει πως μόνο εκείνος μπορεί να σώσει τον κόσμο και πως ακόμα δεν έχει κατακτήσει ό,τι του αξίζει, και όλα αυτά μαζί τον οδηγούν σ' έναν δολοφονικό κι αιματηρό κατήφορο από τον οποίο δεν υπάρχει επιστροφή.Θέλω να πιστεύω πως η πλειοψηφία των αναγνωστών έχει διαβάσει το κλασσικό έργο του Shakespeare, ή αν δεν το έχει κάνει, πως γνωρίζει, με τον έναν ή τον άλλον τρόπο, την κατάληξη αυτής, που δεν είναι άλλη από ένα λουτρό αίματος βουτηγμένο στην φρικαλεότητα και στην παραφροσύνη. Πάνω σε όλα αυτά βασίζεται, λοιπόν, ο Nesbo, και σεβόμενος απόλυτα την πυρήνα και τον ηθικό άξονα της πρωτότυπης ιστορίας, την αφηγείται εκ νέου τοποθετώντας την σ' ένα πιο σύγχρονο σύμπαν, χωρίς, όμως, ν' αλλοιώνει τους χαρακτήρες ή το βαθύτερο νόημα της ιστορίας, αλλά δίνοντάς του μια άλλη διάσταση, προσαρμοσμένη περισσότερο στα σημερινά κοινωνικά, ηθικά, ανθρωπιστικά πρότυπα, με τον μοναδικό εκείνο τρόπο που ο ίδιος ξέρει και που υπηρετεί εδώ και χρόνια ολάκερα τόσο πολύ καλά.Ο Μάκβεθ του Shakespeare, ως χαρακτήρας και προσωπικότητα, είναι από τους πιο ενδιαφέροντες που έχω συναντήσει ποτέ, μα και απ' τους πιο πολυδιάστατους. Είναι ένας \"ήρωας\" που αντιπροσωπεύει τον ορισμό της τραγικότητας, που γίνεται ολοκληρωτικά έρμαιο των παθών και των εμμονών του. Έτσι ακριβώς είναι και ο Μάκβεθ του Nesbo, που θεωρεί πως βρίσκεται στο απυρόβλητο και πως οι πράξεις του δικαιολογούνται απόλυτα και πως κανείς δεν μπορεί να τον κρίνει γι' αυτές. Απαιτεί την ηθική του δικαίωση, όχι γιατί κάπου βαθιά μέσα του αντιλαμβάνεται το τι πραγματικά συμβαίνει, αλλά γιατί πιστεύει ακράδαντα πως το αξίζει, καθώς οι πράξεις του συμβάλλουν στην ανύψωση του δικαίου και της κοινωνικής ηθικής που χρειάζεται να γίνει θύμα της βίας προκειμένου να επιστρέψει στο σωστό μονοπάτι. Όμως, στην πραγματικότητα, κατά πόσο ισχύει κάτι τέτοιο; Ποιος είναι σε θέση να κρίνει ποια ζωή έχει αξία και ποια όχι; Ο Nesbo, χωρίς να επέμβει στα ψυχογραφήματα των βασικών ηρώων της πρωτότυπης ιστορίας, αλλά εμβαθύνοντας ακόμα περισσότερο σ' αυτά, σκιαγραφεί πρόσωπα και μέσω αυτών καταστάσεις στις οποίες οι ίδιοι μπλέκονται, είτε ηθελημένα είτε άθελά τους. Με απόλυτο σεβασμό στο έργο του Shakespeare, αλλά προσθέτοντας σε αυτό τη δική του, γνώριμη, χαρακτηριστική πινελιά, καταφέρνει να δημιουργήσει, ίσως, το καλύτερό του έργο μέχρι σήμερα. Άλλωστε, όπως έχει αποδείξει στη μέχρι τώρα λογοτεχνική του πορεία, ξέρει πολύ καλά πως ν' αφηγηθεί μια ιστορία βουτηγμένη στη βία και στο αίμα. Και τοποθετώντας την μέσα σ' ένα τόσο παρανοϊκό πλαίσιο, μα και βλέποντας μέσα από τα μάτια ενός διαταραγμένου ανθρώπου που δεν αντιλαμβάνεται πως όταν θυσιάζεις οτιδήποτε για να φτάσεις στην κορυφή, μόνο να πέσεις απ' αυτήν μπορείς, με τραγικές συνέπειες, νομίζω πως φτάνει στο ζενίθ του, καθηλώνοντας και παρασύροντας ακόμα και τον πιο απαιτητικό αναγνώστη. Ο Jo Nesbo στα καλύτερά του!"}, {"userName": "Janelle", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/20742472-janelle", "userReview": "Thank you so much Crown Publishing for providing my free copy of MACBETH by Jo Nesbo - all opinions are my own. This book is EXACTLY what it says it is: a really well done retelling of Shakespeare’s Macbeth with a modern crime twist. As soon as I started reading, I recognized Nesbo’s signature writing style with graphic descriptions and phenomenal character development. I am not going to lie, it’s a big, dense book. And even though I read fast, it took me a bit to hit my stride, but I loved it! Set in a tired, dark industrial town in the 1970’s, Nesbo’s MACBETH focuses on the town’s ceaseless drug problems and corruption. Inspector Macbeth is head of the SWAT team and has a tendency towards violence and paranoia. A dangerous drug lord by the name of Hecate uses his high connections to the city officials to manipulate Macbeth and will stop at nothing to get his way. Enter Lady, Macbeth’s true love, who owns one of the foremost casinos. What follows is a story of greed, power, ambition, murder, and madness. My absolute favorite aspect of the book is that it stays true to the classic. This could not have been easy, but Nesbo manages to pull it off flawlessly! I loved that I was able to recognize both Shakespeare and Nesbo in this book. The dark and gritty styles mesh perfectly together. I could not get over the clever and brilliant way Nesbo retold one of the most famous plays ever written. As I was reading, I could picture every detail, every mannerism. I could hear the blackjack cards hit the table because I was right there. That is the pure genius that is Nesbo. I am a lifelong, forever fan of William Shakespeare and I am happy to say Nesbo’s homage is nothing short of excellent."}, {"userName": "Kyriakos S Kyriakou", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/12986978-kyriakos-s-kyriakou", "userReview": "4,9/5 Loved it! Nesbø knows how to write breathtaking scenes! And share also some messages to mankind! “Να παίξεις στο έργο όσο καλύτερα μπορείς, αρπάζοντας τις χαρές και τις απολαύσεις που έχει να σου προσφέρει η ζωή όσο διαρκέσει; Ή να αφήσεις το σημάδι σου, να αλλάξεις την πορεία των πραγμάτων, να κάνεις τον κόσμο λίγο καλύτερο προτού αναγκαστείς να τον αφήσεις; Ή μήπως να αναπαραχθείς, να δώσεις στην γη καινούργια μικρά πλάσματα, καλύτερα από εσένα, με την ελπίδα ότι κάποτε οι άνθρωποι θα γίνουν οι ημίθεοι που νομίζουν ότι είναι;” - Μάκβεθ - Jo Nesbø"}, {"userName": "Dimitris Passas", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/19705183-dimitris-passas", "userReview": "Μετά την απογοήτευση που μου προκάλεσε η ''Δίψα'' σκεφτόμουν ότι εάν ο Jo Nesbø δεν δοκιμάσει να ανανεώσει τόσο την θεματολογία των μυθιστορημάτων του όσο και να αλλάξει σε μεγάλο βαθμό την αφηγηματική του πρακτική, πολύ γρήγορα θα χάσει τα σκήπτρα του ''βασιλιά'' της αστυνομικής λογοτεχνίας, καθώς παρότι έχω διαβάσει και αγαπώ όλα τα βιβλία με ήρωα τον Χάρι Χόλε, με λύπη διαπίστωνα την καθοδική -ποιοτικά- πορεία τους τα τελευταία χρόνια. Έτσι, αμέσως μου κέντρισε το ενδιαφέρον η είδηση ότι πρόκειται να διασκευάσει ένα θρυλικό έργο της παγκόσμιας δραματουργίας, το ''Μάκβεθ'' και να αναμέτρηθεί με ένα από τα ιερά τέρατα της ευρωπαϊκής σκέψης, τον Γουίλιαμ Σέξπηρ. Το αποτέλεσμα ήταν να σπεύσω να εξασφαλίσω το ebook (kindle) και να πέσω με τα μούτρα στην ανάγνωση με την πρώτη ευκαιρία.Δεν πρόκειται να γράψω διθυράμβους για τον ''Μάκβεθ'' του Νέσμπο, αν και σίγουρα είναι ένα βιβλίο που περιέχει τα καλά στοιχεία της γραφής του Νορβηγού σούπερσταρ, δηλαδή πυκνή και εξελισσόμενη με κινηματογραφική ταχύτητα πλοκή, χαρακτήρες που βρίσκονται στο μεταίχμιο ανάμεσα στο καλό και το κακό, πολλές και επιτυχημένες ανατροπές στην ιστορία και όλα αυτά που έχουν καθιερώσει τον Νέσμπο ως ενός εκ των κορυφαίων συγγραφέα αστυνομικών ιστοριών.Όσον αφορα την καθαυτή ιστορία, ο Νέσμπο μεταφέρει χρονικά το έργο στην δεκαετία του 1970 στο Φάιφ της Σκωτίας και ο Μάκβεθ είναι ο αρχηγός της ειδικής αστυνομικής ομάδας ελευθέρων σκοπευτών (SWAT) που πείθεται από την ερωμένη του Λαίδη, που εδώ είναι ιδιοκτήτρια του καζίνο της πόλης να σκοτώσει τον έντιμο γενικό αρχηγό του σώματος, τον αστυνομικό διευθυντή Ντάνκαν. Ο Νέσμπο κρατάει ανέπαφο τον κορμό και το φινάλε της πρώτης έκδοσης και το Φάιφ σκιαγραφείται ως μια πόλη παραδομένη στην διαφθορά και τη λύσσα για έξουσια σε πολιτικό, και οχι μόνο, επίπεδο. Παρόλαυτα ακόμα και όσοι είναι εξοικειωμένοι με το πρωτότυπο δεν θα χάσουν το προνόμιο της έκπληξης, καθώς ο Νέσμπο πειραματίζεται και ανατρέπει όχι τόσα που θα διάβρωναν την υφή του σεξπηρικού ''Μάκβεθ'' αλλά όσα είναι απαραίτητα για να κρατήσει ζωντανό το ενδιαφέρον του αναγνώστη.Σε γενικές γραμμές οφείλω να πραδεχτώ τον Νέσμπο για την τόλμη του να καταπιαστεί με ένα τέτοιο θρυλικό κείμενο, όπως και την απόπειρα να δοκιμαστεί σε κάτι διαφορετικό απ' ότι έχει κάνει μέχρι σήμερα. Το βιβλίο δεν είναι τέλειο, καθώς κάποιοι από τους χαρακτήρες μοιάζουν μονοδιάστατοι και η ύπαρξή τους έχει ως μοναδικό σκοπό την εξυπηρέτηση της πλοκής, κάποιες σκηνές δράσης είναι υπερβολικές και δοκιμάζουν τα όρια του περίφημου ''suspension of disbelief'', ωστόσο αυτά δεν είναι ικανά να αλλάξουν την αξιολόγηση της συνολικής εικόνας που είναι θετικότατη.Συνίσταται ανεπιφύλακτα στους πιστούς του Νέσμπο και των καλών αστυνομικών ιστοριών."}, {"userName": "Evi", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/31086125-evi", "userReview": "Σύνοψη: Ο επιθεωρητής Μάκβεθ και η ομάδα του αναλαμβάνουν να ξεκαθαρίσουν την υπόθεση σύλληψης εμπόρων ναρκωτικών σε μια μικρή πόλη που πνίγεται από το έγκλημα και τη διαφθορά. Χρήματα, εξουσία και σεβασμός θα του ρθούν απλόχερα από κάθε κατεύθυνση. Αυτός όμως ως πρώην τοξικομανής θα ξεφύγει και θα χάσει κάθε έλεγχο παρασέρνοντας μαζί του μια αλυσίδα ανθρώπων και θυμάτων. Ένα συγκλονιστικό retelling του γνωστού Macbeth βαμμένο με τη φλογερή πινελιά του Jo Nesbo. Ένα θρίλερ που βασίζεται στο σαιξπηρικό έργο και πάει ακόμη παραπέρα βυθίζοντας τους χαρακτήρες του στη φρικωδία του αίματος και της παράνοιας. Θα σας πω την αμαρτία μου. Χωρίς να έχω διαβάσει πολλά retellings στη ζωή μου και μαθαίνοντας για την κυκλοφορία του Μάκβεθ σκέφτηκα \"μα φτάνεται ο Shakespeare;\". Ωστόσο με το που το έπιασα στα χέρια μου, ένιωσα να ταυτίζομαι με τους ήρωες. Βρέθηκα να διψάω για εξουσία, να εθίζομαι για αίμα.. Έτοιμη να πουλήσω την ψυχή μου σε όποιον δίνει περισσότερα..Η πλοκή αναφέρεται σε μια υπόθεση διαφθοράς στα υψηλά κλιμάκια της αστυνομίας. Η αστυνομία μιας πόλης που δεν αντιδρά στη διαφθορά. Η πόλη που όσο κι αν βρέχει, ποτέ δεν καθαρίζει. Ο Μάκβεθ αποτελεί έναν τραγικό χαρακτήρα, μια μαριονέτα στο έρμαιο των παθών του, υλικών και ψυχικών. Παρακινείται να ηγηθεί, να φτάσει στην κορυφή. Εθίζεται στα ναρκωτικά και τη δύναμη, το πιο ισχυρό ναρκωτικό. Παραληρεί από ικανοποίηση στην ψευδαίσθηση ότι βάζει την πόλη στη σωστή τροχιά. Ο Μάκβεθ εκτελεί και χαμόγελα, διψάει και πίνει, αμαρτάνει και απαιτεί συγχώρεση. Όμως αργεί να κατανοήσει πως όταν σκαρφαλώνει κανείς, δεν έχει επιστροφή. Προορισμός του θα είναι η κορυφή ή η άβυσσος. Ως και την τελευταία σελίδα του βιβλίου ο αναγνώστης αναρωτιέται για το ποιον του κεντρικού ηρωα. Τελικά, είναι ένας ταπεινός υπηρέτης του λαού ή ένας σκλάβος των επιθυμιών του; Υπάρχει η εικασία πως αυτό που κατέστρεψε τον Μάκβεθ είναι τα καλά του στοιχεία, η έλλειψη σκληρότητας. Αλλά πείτε μου εσείς, γινόμαστε κάτι που δεν είμαστε; Αυτό που βίωσα ήταν μοναδικό. Σας έχει τύχει να μη θέλετε να ανακαλύψουν το δράστη απλά και μόνο για να προλάβει αυτός να εκτελέσει όσο το δυνατόν περισσότερες κακές πράξεις; Δώσατε ποτέ αμνηστία σε θανάσιμα εγκλήματα, γιατί εξωραίσατε τα κίνητρα; Εγώ ναι. Και ξέρετε γιατί; Γιατί είχα την ελπίδα πως η αχαριστία που καταδεικνύει τον ήρωα και η ατιμωρησία που απολαμβάνει αυτός κάποια στιγμή θα περιέλθουν στα χέρια της θείας Δίκης! Πως η συμφορά που θα τον βρει θα είναι μεγαλύτερη, επειδή αργεί να έρθει. Το εντονότερο συναίσθημα του βιβλίου ήταν η χαιρεκακία. Των ηρώων. Επειδή χαιρόντουσαν με τις συμφορές που προκαλούσαν. Του ίδιου του συγγραφέα τολμώ να πω, που έβαλε τους χαρακτήρες του βιβλίου του να βυθιστούν στο βούρκο της μάχης και να περιμένουν από την αγάπη να τους εξαγνίσει. Στον αναγνώστη. Που ζητά απεγνωσμένα κι άλλο αίμα στις σελίδες και μετά ως άλλος παράλογος θεός να επιτρέψει στον ήλιο να ανατείλει για να συγχωρήσει αυτούς που πάλι θα αμαρτήσουν..Διαβάστε το!"}, {"userName": "Roman Clodia", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/56111743-roman-clodia", "userReview": "The combination of Shakespeare's Macbeth and Nesbo' s dark brand of crime writing should have been a match to die for - but somehow this novel just doesn't work for me. The most successful of the Hogarth series (and imitative adaptations and appropriations more generally) take the Shakespeare text as their starting point but invest the appropriating text with a life of its own: that's what made Atwood' s Hag-Seed: The Tempest Retold and Jacobson' s Shylock Is My Name both so wonderful - they do innovative and creative things with the originary text, they don't simply retell the story in another form, time and place. The intertextual points of contact are surprising and meaningful - and the interrelationships add weight and insight to both Shakespeare and the modern retelling.Nesbo, on the other hand, seems overly wedded to Shakespeare's Macbeth, simply displacing the plot and characters into a 1970s grim Scottish town where the height of ambition is to be Police Commissioner. There are no surprises here, and the original play feels shoehorned awkwardly into this revised setting. Hecate is now a master-criminal, Lady a casino owner, and Birnam Wood becomes a ... steam engine named Bertha Birnam! This sense of bathos permeates the book: everything feels too simple and superficial ('He had to become the other Macbeth, the one he had buried so deep, the crazy flesh-eating corpse') with too much being 'told' to us: 'he was courageous and a ruthless man of action, but he had failings that could prove costly. A lack of evil.' The occasional quotation, usually paraphrased, from Shakespeare simply isn't enough to give this much-needed depth. Macbeth is a relatively short play; this is over 500 pages and feels it - what was taut and thrilling becomes drawn-out and plodding: did we really need the back story of how Macbeth and Lady first met, for example? More importantly, the characters here are unconvincing in psychological terms: I just didn't believe that this Macbeth could be so easily bullied into a murder he does not want to commit, for example.So not one of the more successful Hogarth Shakespeares for me - but plenty of other reviewers have loved it.Thanks to Hogarth for an ARC via NetGalley."}, {"userName": "Φίλιππος", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/59249586", "userReview": "Τελικά δεν ξέρω αν είναι καλύτερο να ξέρεις την υπόθεση του έργου του Σαίξπηρ πριν ξεκινήσεις αυτό το βιβλίο ή όχι...🤔Από την μία, απολαμβάνεις να βλέπεις ότι ο βασιλιάς της σύγχρονης αστυνομικής λογοτεχνίας έχει \"πατήσει\" καλά πάνω στο πρωτότυπο έργο και έχει κάνει μια υπέροχη διασκευή, αλλά από την άλλη χάνεται η μαγεία γιατί έχεις ένα τεράστιο σπόιλερ και ξέρεις την κατάληξη! Όπως είπα και νωρίτερα, το Μάκβεθ του Nesbo είναι μια καταπληκτική διασκευή του σαιξπηρικού Μάκβεθ, τοποθετημένο σε μια πόλη της Σκωτίας κάπου στο 1970. Ένα βιβλίο με καταιγιστική κινηματογραφική δράση, αγωνία (για όσους δεν ξέρουν το αρχικό έργο), με καλοδουλεμένους χαρακτήρες, ωραίους \"σαιξπηρικούς\" διαλόγους και την ιδιαίτερη πινελιά του Nesbø! Άκρως απολαυστικό! Βαθμολογία : 9.5/10"}, {"userName": "Rincey", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/278339-rincey", "userReview": "3.5 starsSee me talk about this briefly in my May wrap up: https://youtu.be/47JHKR_6JAs?t=7m35s"}], "description": "He’s the best cop they’ve got. When a drug bust turns into a bloodbath it’s up to Inspector Macbeth and his team to clean up the mess. He’s also an ex-drug addict with a troubled past. He’s rewarded for his success. Power. Money. Respect. They’re all within reach.But a man like him won’t get to the top.Plagued by hallucinations and paranoia, Macbeth starts to unravel. He’s convinced he won’t get what is rightfully his. Unless he kills for it.", "title": "Macbeth\n      \n          (Hogarth Shakespeare)", "url": "http://www.goodreads.com/book/show/33952851-macbeth", "average": 3.49, "cover": "https://images.gr-assets.com/books/1507978598l/33952851.jpg", "reviews": 615, "authors": [{"url": "https://www.goodreads.com/author/show/904719.Jo_Nesb_", "name": "Jo Nesbø"}, {"url": "https://www.goodreads.com/author/show/2737734.Don_Bartlett", "name": "Don Bartlett"}], "type": ["Fiction", "Mystery", "Mystery", "Thriller", "Retellings"], "outlinks": ["http://www.goodreads.com/book/show/33952851-macbeth", "http://www.goodreads.com/book/show/36054494-macbeth", "http://www.goodreads.com/book/show/35792226-macbeth", "http://www.goodreads.com/book/show/38327546", "http://www.goodreads.com/book/show/35248008-macbeth", "http://www.goodreads.com/book/show/9572203-the-snowman", "http://www.goodreads.com/book/show/465226.The_Redbreast", "http://www.goodreads.com/book/show/3522419-nemesis", "http://www.goodreads.com/book/show/498389.The_Devil_s_Star", "http://www.goodreads.com/book/show/1991039.Flaggermusmannen", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}