{"ratings": 225, "userreviews": [{"userName": "Ryan", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/12425329-ryan", "userReview": "I have a few reasons for beginning to review the children's books that I read to my son. I'll eventually forget how most of them are. Also, children's books are extremely expensive, and I'm sure people come to Goodreads all the time to get recommendations before they waste money. Finally, I'm behind on my reading goals and need to pad my numbers! /shameless Anyway, my son absolutely LOVES this book. He is 16 months old and it is the first and only book he calls for by name. The refrain is rhythmic and fun and will appeal to kids much older than my boy. It is the first book in which Dylan agreed to have his lyrics interpreted, and its success has paved the way for three more wonderful books that my son also loves. But this one remains heads and shoulders above the other three. I'd rank it six stars if I could simply to put it above the fives I would rank those.In Man Gave Names, the reader is bombarded with bright colors and dozens of creatures of all shapes and sizes. The book tells how early Man may have seen the creatures of the world, described them, and named them. It will appeal to fans of Bob Dylan, of course, but also to animal lovers and those who enjoy and/or prefer biblical children's stories. It comes with a CD of the song, in case that would sway you. It contains a nice note from the illustrator about the song and his inspiration, and there is a list of 170 animals that your little guy or girl can try to find.Obviously, I love the book, but much more importantly, my son absolutely adores it."}, {"userName": "Jeremy", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/7659636-jeremy", "userReview": "Great illustrations, fun rhymes, clever ending, Bob Dylan music. Kate and I enjoyed saying \"Uh, oh!\" at the end. We played the track over and over again, and the girls had fun dancing to it."}, {"userName": "Candace", "userReviewDate": "Sep 08, 2010", "userURL": "http://www.goodreads.com/user/show/3082444-candace", "userReview": "This book is beautifully illustrated, but the story/song is also fantastic. It's the Bob Dylan song (that many are familiar with!) and it comes with the CD with the song on it. It's actually a children's CD that I don't go crazy listening to after the 500th time! And trust me, we have probably really listened to it 500 times! My kids love it! I put it in and the first time they just dance around. Then the second time they sit and look at the gorgeous pictures in the book. And then, they usually play it about 10 more times before taking a break. They read the book alone as well. Well, they just look at the pictures since they can't read, but soon they will have it all memorized and can at least pretend to read it! I can say that as a parent this book is perfect. I can read/sing it to them pretty quickly and the illustrations are beautiful and you find new animals every time. Like I said, the CD isn't annoying (who doesn't like Bob Dylan?!) and I don't go crazy listening to it over and over. The book can keep the kids entertained by itself if the CD were to break. This has been THE BOOK for the past week since it arrived on our front porch. We got other books too but this is the one they are so focused on they haven't even paid attention to the others! I have the new edition illustrated by Jim Arnosky. I didn't even know about a previous edition but looking through reviews it becomes apparent that there was one!"}, {"userName": "Suzanne Moore", "userReviewDate": "Jan 01, 2012", "userURL": "http://www.goodreads.com/user/show/2127114-suzanne-moore", "userReview": "I have to say I loved this song before it became a picture book. It is a fun song to sit around and sing with friends. The song was originally recorded on Bob Dylan's \"Slow-Train Coming\" album, and is included as a single on the disc that comes with the book. Colorful illustrations accompany Dylan's clever rhymes about how man(Adam) thought up names for all the animals. I read it with seniors at the nursing home and had them singing along. Then I gave the book to my grandson (Dylan Ray) and he learned it pretty quick. The catchy beat is contagious and will soon have readers joining in. The ending comes rather abrupt, as the last animal isn't mentioned by name. Even without the art, one could name the animal (clue: reptile) who slithers by a tree near a lake ....."}, {"userName": "Andrea", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/2547231-andrea", "userReview": "The art was really good. But the words and the images didn't match. A mountain goat isn't exactly a male sheep. Although they look so much alike I might be the one mixing up the image and the name."}, {"userName": "Peacegal", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/3078602-peacegal", "userReview": "Fun, goofy interpretation of one of Dylan's more humorous songs. Kids will no doubt be making animal sounds and interpretations when listening to this one. I didn't especially appreciate that the the passage about naming the bull ended with a bull facing down a matador in front of a cheering audience. Vegan parents will also want to note that the man sees milk dripping out of the cow, \"but doesn't know how.\" Er, the same way (and reason) any mammal makes milk."}, {"userName": "Brigette Robicheau", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/52175270-brigette-robicheau", "userReview": "The illustrations are stunning and finding animals at the end of the book was a fun surprise"}, {"userName": "Joy Lane", "userReviewDate": "Oct 02, 2016", "userURL": "http://www.goodreads.com/user/show/19922726-joy-lane", "userReview": "the song is nearly 4 minutes longAR 1.8 and 0.5 pts"}, {"userName": "Baby Bookworm", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/58232346-baby-bookworm", "userReview": "This review was originally written for The Baby Bookworm. Visit us for new picture books reviews daily!Hello, friends! Today’s book is a brand new addition to our home library, Man Gave Names To All The Animals, written by Bob Dylan and illustrated by Jim Arnosky, a children’s book tribute to the 1979 song by Dylan.Using the lyrics of the titular Dylan song, we are brought into a world of wonderful wild animals, each page bursting with creatures of all shapes, sizes and types. Pages that feature the song’s chorus are a menagerie of animals, with each verse introducing us to a new animal and showing what name man has chosen for him.Honestly, I had mixed feelings about this one. This is one of Dylan’s more repetitive songs, which naturally makes the book repetitive as well. That might be fine for reading aloud if you can sing the tune, but then you have to know the tune to sing it (the book does include a CD of Dylan’s original recording, but I hadn’t had a chance to listen to it before reading the book to JJ). And while the intricate and lifelike animal art is lovely, it frankly overshadows what is a rather simple song, and it doesn’t always quite match up: sure, a highland cow is a cow, but it looks like a yak; a boar could technically be a pig, but not quite; and a mountain sheep looks far more like a goat to a young reader. The length is fine, and JJ enjoyed it for the most part, but I did notice her becoming frustrated when she couldn’t easily identify the animals within the massive groups on the pages. It also has a confusingly abrupt ending that stops the narrative literally mid-sentence. Overall, it’s a gorgeous book, and if you love intricate animal art and/or are a Dylan fan, a must-read. But while JJ may get more out of this one as she grows, for now, we were underwhelmed.Be sure to check out The Baby Bookworm for more reviews!"}, {"userName": "Kyle Turck", "userReviewDate": "Jan 26, 2013", "userURL": "http://www.goodreads.com/user/show/16606168-kyle-turck", "userReview": "Man Gave Names to All the Animals is one of the coolest books I have ever had the chance to read. Bob Dylan's poetic musical stylings supply the words for the book, but it is definitely all brought together through the eyes of the illustrator, Jim Arnosky. The book itself takes the lyrics from the classic Dylan song from the title, and Arnosky delivers some of the most vivid paintings I have ever seen, creating an entire world full of animals of all types. While the words of Dylan alluded to more of a farm setting, the illustrator goes in a different direction and transports you into a jungle, where the \"normal\" pigs, cows and sheep take on an entirely new look and feel. The book itself plays out just like the song does, with that last animal slithering away before being given its name...I would recommend this fan to EVERYONE interested in children's literature. Not only does introduce children to a wide variety of animals from around the world, but it also gives music fans a chance to share the work of a legend with the youngest of audiences. This would be great to use in an early elementary classroom (K-2), especially when partnered with the song itself, but can be appreciated pretty far on down the line from there."}, {"userName": "Christy Bennett", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/59496663-christy-bennett", "userReview": "1. None2. B-23. Jim Arnosky paints vibrant, realistic animals in their habitats to illustrate Bob Dylan's song, Man Gave Names to All the Animals. The lyrics to each verse describe a legend of perhaps how a particular animal may have been named and rhyme in a way that by the end of the verse, children can guess what animal Bob Dylan is describing. The last verse ends abruptly, where children can jump in and enthusiastically shout out the last animal described based on the former rhymes.4. Growing up an avid Bob Dylan fan, I was happily surprised to discover this song when my oldest daughter was small. Whenever we would here it's percussion introduction, she would jump up to dance and sing along. The bright, colorful, and detailed illustrations compliment Bob Dylan's lyrics beautifully. 5. This text would be perfect to accompany a unit on wild animals of the jungle, grasslands, prairies, etc. It would also serve well as an example of how rhyming can help lead the reader to jump ahead and predict what will come next."}, {"userName": "Art", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/16346692-art", "userReview": "Of the five Dylan songs that transformed into illustrated storybooks for children, this is the only one with two very different editions. Three and a half stars. This one, from 2010, is far superior to the earlier one, of 1999. If you want to share Dylan music with the young kids in your life, try the best two in the series: If Dogs Run Free and If Not for You. And when you do, play the songs while reading the book, which will double your pleasure and experiencing the tunes the way Dylan intended."}, {"userName": "Mirissa Holbrook", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/38799299-mirissa-holbrook", "userReview": "I had never heard this song before reading this book, but I instantly fell in love with the artwork that the illustrator used. I loved how all of the animals were Africanized, so that the cow was more of a Yak, etc. It really made the book feel cohesive as well as just being so beautifully done. I quickly got the hang of how the song was structured, but I still didn't have a tune in my head, unfortunately. If I wasn't in class, I would've looked up the song on YouTube and read along with him as he sang, but I didn't really have that option. When teaching with a music book, though, I would definitely have the song playing while I showed the pictures of the book, especially if it was a song that most of my students didn't know."}, {"userName": "Alexander", "userReviewDate": "Aug 21, 2013", "userURL": "http://www.goodreads.com/user/show/23289459-alexander", "userReview": "I absolutely LOVE this book! I made my mommy read it to me like 6 times one day. The pictures are so crisp and beautiful that it's a feast for my little eyes. When I get old enough, I'll be able to sing and read the chorus along with my parents. The coolest thing is it's like a scavenger hunt. Every page has a dozen or more animals on it and it's fun to identify them. Some of them are weird! (I mean really, what's a purple gallinule?)The was Mr. Dylan's first children's book, and I'm glad it was so popular because two more were made with a fourth coming out soon! This edition came with a CD. I hope his new one does, too, because we don't have it!"}, {"userName": "Mekenna Price", "userReviewDate": "Nov 04, 2014", "userURL": "http://www.goodreads.com/user/show/34898000-mekenna-price", "userReview": "This book has got the whole package! It has beautiful illustrations to accompany all of the lyrics. When I first read this book, I did not know the tune. But the book had a CD at the very end! It was very helpful. The lyrics are easy for children to understand and be entertained at the same time. I loved it! I think you could teach this song to anybody; there is no age limit. I did not learn this song when I was young, but I can see that it could help children. It can encourage them to realize different characteristics and facts about animals. It also encourages their imagination and that is important to their growth!"}, {"userName": "Lily", "userReviewDate": "Feb 27, 2012", "userURL": "http://www.goodreads.com/user/show/4347126-lily", "userReview": "Read this book a few years back and I used it for a project in musical education. It's funny how you change and appreciate things looking back. I think my review was different because my children were not at an age to appreciate this book. This book is great and brings the Bob Dylan song to life. The illustrations are great too. You can sing and read it at the same time, which incorporates music into story time. I also used the book to introduce them to Bob Dylan and we talked about folk music. My kids really love this book."}, {"userName": "Stacy Renee  (LazyDayLit)", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/6146346-stacy-renee-lazydaylit", "userReview": "This book jumped out at me from the shelves and when I saw it was from singer/songwriter Bob Dylan it immediately went to the top of our stack. The animal illustrations are amazing! I loved pointing out each animal to my little one. The best part of this book was the accompanying CD of Bob Dylan singing the words to the book. My daughter loved it! She sat quietly, leaning on my leg as I read/sang along and when it was done, she urged me to play the song and read the book to her 4 more times! I definitely see us reading it again and again in days to come!"}, {"userName": "Steve H", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/1180746-steve-h", "userReview": "Dylan gets credit for writing this, but really it's just the lyrics to a song he wrote in 1979 that have been realized in drawings by Jim Arnosky. Arnosky's imagined animals are much wilder than the simple cow, bull, sheep, pig, snake, and bear that I imagined. Also, Arnosky includes an additional 165 or so animals that you can look for. There's a sort of checklist in the back in case you need to know what you're looking for. Nice illustrations. Kind of bland poetry if there's no melody."}, {"userName": "Krista the Krazy Kataloguer", "userReviewDate": "Jan 30, 2012", "userURL": "http://www.goodreads.com/user/show/316102-krista-the-krazy-kataloguer", "userReview": "Bob Dylan's lyrics, about how man named all the animals, are accompanied by Jim Arnosky's delightful illustrations of animals, animals, and more animals, all of which are listed at the back of the book, with a challenge to the reader to find them all. Non-Christian readers may not understand why the story ends abruptly with the snake. The book is accompanied by a CD of Dylan singing the song, which I didn't listen to. Nice choice for a Sunday school classroom read."}, {"userName": "Dee", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/1454409-dee", "userReview": "Now what did you think I would think? I loved it! Beautifully illustrated with over 170 animals to identify. It comes with a cd so you can sing along with ubiquitous Bob. Beautiful book and I like this cover so much more than the other one I have seen."}, {"userName": "Dotty", "userReviewDate": "Oct 29, 2011", "userURL": "http://www.goodreads.com/user/show/128471-dotty", "userReview": "I'm reading picture books in preparation for a discussion in Grace Lutheran Adult Forum tomorrow on the creation as portrayed in children's literature. So many cool books and this is one of them. Get to read the book while you listen to Dylan sing the song!"}, {"userName": "KidsFiction Teton County Library", "userReviewDate": "Sep 16, 2010", "userURL": "http://www.goodreads.com/user/show/3658109-kidsfiction-teton-county-library", "userReview": "J CD Book Short DylanKay gives it 5 starsThe illustrations are fabulous!!!! Jim Arnosky asked Bob Dylan if he could create pictures for his song \"Man Gave Names to All the Animals\" and he gladly agreed. We are all the better for it. Enjoy."}, {"userName": "Morgan Sommers", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/27420307-morgan-sommers", "userReview": "I thought that this was an interesting story/song, but I thought it would be a great one to read to describe animals! I thought that the pictures in it were fantastic! They were very well done and they were what helped me stay interested in this book!"}, {"userName": "Sarah", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/1261756-sarah", "userReview": "It's probably something like a sin for me to say I don't really care for the words too much (I mean, I love Dylan but I just don't get this) but the illustrations are absolutely beautiful. I could stare at this all day. Gorgeous."}, {"userName": "Loryn Tindall", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/38758839-loryn-tindall", "userReview": "This book had some excellent illistrations to describe the words. It was a simple book, but explained a little about animals and includes an animal search activity at the end. It would be perfect for children learning their animals and sounds."}, {"userName": "Dee", "userReviewDate": "Feb 17, 2009", "userURL": "http://www.goodreads.com/user/show/1454409-dee", "userReview": "Now what did you really think I would think? I loved it! I even sang along with it. Beautifully illustrated book by by Jim Arnosky and written by the ubiquitous Bob himself! The book also included a cd (so you can sing along too). The book has over 170 animals that you can identify. Beutiful."}, {"userName": "Kecia", "userReviewDate": "Oct 20, 2016", "userURL": "http://www.goodreads.com/user/show/36030-kecia", "userReview": "I think children will have fun trying to find all of the animals. The illustrations are beautiful. I wasn't crazy about the writing but I think kids will have fun with it."}, {"userName": "Magila", "userReviewDate": "Jul 12, 2013", "userURL": "http://www.goodreads.com/user/show/3341092-magila", "userReview": "2.5"}, {"userName": "Rani", "userReviewDate": "Jun 16, 2016", "userURL": "http://www.goodreads.com/user/show/8916827-rani", "userReview": "Tap your feet and clap your hands to the rhythm of the song and welcome the critters as they get named."}, {"userName": "Miri", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/4430576-miri", "userReview": "I don't really care for the song, but the illustrations in this book are great and every kid loves a book about animals."}], "description": "Whimsical and witty, “Man Gave Names to All the Animals” first appeared on Bob Dylan's album Slow Train Coming in 1979. Illustrator Jim Arnosky has now crafted a stunning picture book adaptation of Dylan's song that's a treat for both children and adults, with breathtaking images of more than 170 animals plus a CD of Dylan's original recording.The revered musical legend rarely allows his songs to be illustrated, and Arnosky has done the song proud with a parade of spectacular creatures ready to receive their names-until the surprise ending, when children get to name an animal themselves!", "title": "Man Gave Names to All the Animals", "url": "https://www.goodreads.com/book/show/7719823-man-gave-names-to-all-the-animals", "average": 3.96, "cover": "https://images.gr-assets.com/books/1328768784l/7719823.jpg", "reviews": 40, "authors": [{"url": "https://www.goodreads.com/author/show/8898.Bob_Dylan", "name": "Bob Dylan"}, {"url": "https://www.goodreads.com/author/show/101610.Jim_Arnosky", "name": "Jim Arnosky"}], "type": ["Childrens", "Music", "Animals", "Poetry", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/7719823-man-gave-names-to-all-the-animals", "http://www.goodreads.com/book/show/417912.Man_Gave_Names_to_All_the_Animals", "http://www.goodreads.com/book/show/22928661-man-gave-names-to-all-the-animals", "http://www.goodreads.com/book/show/14318.Chronicles_Volume_One", "http://www.goodreads.com/book/show/132025.Tarantula", "http://www.goodreads.com/book/show/761271.Lyrics", "http://www.goodreads.com/book/show/14319.The_Essential_Interviews", "http://www.goodreads.com/book/show/132053.Lyrics_1962_1985"]}