{"ratings": 312, "userreviews": [{"userName": "Paul", "userReviewDate": "Nov 11, 2013", "userURL": "http://www.goodreads.com/user/show/11410830-paul", "userReview": "A Modern Day ClassicThis was a wonderful read by Mary Glickman that was an absolute pleasure to read and that reminded me very much of the classic To Kill a Mockingbird. Marching to Zion may take its name from the hymn and end with two of the characters eventually entering Zion but this is a carefully constructed novel that covers a span of 20 years that examines relationships between black and white, Negro and Jew. Relationships that were forbidden then and to some extent not accepted by some now and all based on historical fact. From the labour/race riots in St Louis through to the Great Depression, the flooding of the Mississippi to the outbreak of war in Europe.Mags Preacher is a poor country girl that sets off for the big city of St Louis to make her way in the world, who has the luck to find a guide in Magnus Bailey who helps her find lodgings and in turn a trade at the funeral home owned by the Mr Fishbein, a European Jew who lives about with his daughter Minnie. Mags falls in love with his employee George McCullum, they get married and she is pregnant when he is killed in the race riots. Magnus Bailey and Fishbein move Mags back home to be with her family. They are moving on to Memphis to start a new life, and it becomes obvious to most that Minnie is in love with Magnus but they cannot be together due to each others’ colour which is not acceptable in the south of the 1920s. He rejects her and goes away so as not to be found Minnie searches for him and does not come out of it well. It would be this forbidden love that drives the story forward.It would be so easy to give away the bulk of the story as it is such a brilliant tale that has been told by Mary Glickman, she is a fantastic story teller an art that is often forgotten. The characters are three dimensional real and faced with real dilemmas with no easy choices an excellent examination of American ideals in the early 20th century and how nobody was really free from the shackles of ages past. This really will become a modern classic."}, {"userName": "TAMMY CUEVAS", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/2662412-tammy-cuevas", "userReview": "In 1916, Mags Preacher, an African-American young woman from the rural South, arrives in St. Louis hoping to learn a trade to better her future. There, she finds employment at Fishbein's Funeral Home and meets her husband-to-be. When Mr. Fishbein saves Mags' life, she leaves St. Louis with Mr. Fishbein and his young daughter, Minerva, whose mind was unbalanced when her family was killed in a pogrom in Eastern Europe. After Mags is reunited with her family, the Fishbeins and Magnus Bailey move on to Memphis. Minerva has always been in love with Magnus and cannot see that in the Jim Crow South of the early 20th century, their relationship would only end in grief. Marching to Zion is a story told in parts. The first part of the story features Mags and her life in St. Louis amid the race riots and discrimination of the time. We are also introduced to the Fishbeins and their tragic history. In the second part of the story, which makes up the majority of the novel, we follow the Fishbeins and Magnus Bailey as they travel together and separately. The racism of the time toward African-Americans and Jews is explored as the interracial couple seek a safe haven in which to live without fear.This is the first novel by Ms. Glickman that I have read, but will not be the last. Marching to Zion is one of the most gripping novels I have read in quite some time.5 starsDisclosure of Material Connection: I received this book free from the publisher through the NetGalley book review bloggers program. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing thisin accordance with the Federal Trade Commission’s 16 CFR, Part 255  : “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Susan", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/823903-susan", "userReview": "I think this is my favorite Mary Glickman novel yet...and I've loved all three. Marching to Zion tells the story of Minerva or Minnie Fishbein, a young woman with fiery red hair who lives in East St. Louis with her father, the owner of a funeral parlor in the black part of town. Minnie and her father escaped a pogrom in Eastern Europe and find refuge in East St. Louis until a group of bandits riot, killing and looting for days. Thanks to Fishbein's business partner and right hand man, Magnus Bailey, father and daughter live and are safely taken to Memphis, where they try to start anew.As Minnie grows up, she and Bailey fall in love. She sees no problem with their relationship, but as much as he wants to be with Minnie, he knows it will never work. In 1920s and 30s Memphis (or anywhere else in the US), a relationship between a black man and a white woman often ended up with a death or two. So Bailey leaves and breaks Minnie's heart. She sees no choice but to search for him. But soon after she runs away, she's brutally attacked. Minnie's life will never be the same again. She becomes lost to her father and to Bailey, the only two people who love her. What follows is thrilling story of betrayal and redemption. The characters in this book are human and sympathetic. I rooted for Minnie and Bailey throughout the book. Mary Glickman, as always, does a great job of portraying the South in the 1920s and 30s. Her first two books in this series featured biracial relationships with Jewish men and black women, but Marching to Zion does the opposite and centers around the relationship of Minnie and Bailey.I am sad to see this series finish with this book, but can't wait to see what Mary Glickman will come up with next!"}, {"userName": "Christoph Fischer", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/13998364-christoph-fischer", "userReview": "“Marching to Zion” by Mary Glickman is a wonderful and sad story about interracial realtions in the 1910s and 1920 America. It follows a cast of Black and Jewish characters and illustrates their life at the edge of society very well. Race Riots in St. Louis are being seen by the Jewish funeral director Fishbein, who has his own memories of pogroms is one of the best scenes in the book.The characters however are far from being generic or reduced to their racial function. They are all fleshed out with great own troubles and spirits. They make for an intriguing and engaging cast to see us through their fateful journey through those times and stay with you long after you finished the book.An impressive and moving story."}, {"userName": "Rebecca Foster", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "I found this historical novel disappointingly tedious and melodramatic. It was billed as a romance between a white Jewish woman and a black man in early twentieth-century St. Louis, but the first third of the text focuses on a different character entirely. The descriptions of main characters Minerva Fishbein and Magnus Bailey and the development of their romance felt rather rudimentary, though I liked the funeral home setting. The only character who stood out for me was Minerva’s father, Fishbein, “the saddest man in the world.” His tragic history in the German-speaking Eastern European pogroms of the late eighteenth century was the most memorable aspect of the novel for me.On this evidence I wouldn’t try anything else by Glickman without a personal recommendation."}, {"userName": "Davida Chazan", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/3193744-davida-chazan", "userReview": "During the early part of the 20th century, despite slavery having been long over, equality was still far in the future, especially when it came to interracial couples, and even more so if one of them was Jewish. Read my review of this unusual and fascinating novel here http://drchazan.blogspot.com/2014/08/..."}, {"userName": "Judie", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/10820707-judie", "userReview": "MARCHING TO ZIONMary Glickman\tThe dedication of MARCHING TO ZION by Mary Glickman concisely tells the theme: “For the lovers, their arms around the grief of the ages.”\tTaking place primarily in East St. Louis and Memphis between 1916 and 1936, the book tells the story of relationships between races and religions with the focus on those between blacks and whites. Mary Glickman hides philosophy in the narrative as she has her characters discuss how experiences, both individual and group, influence how people react to various situations.\tThe story began in 1916 when Mags Preacher arrived in St. Louis from the small, country home where she grew up. Self-taught, she decided to become a hair stylist because most women want to look attractive and will pay for someone to help them achieve that goal. There was no one in her community providing that service to black women and she thought she could learn the trade through an apprenticeship. With the help of the dapper Marcus Bailey, she found a place to live and then a job at a mortuary where she met the other employee, George McCallum, who was also black. The funeral home was owned by Mr. Fishbein, a Jewish immigrant who lived upstairs in the building with his daughter, the beautiful, red haired beauty Minerva (Minnie) who had a horrendous temper. Mags is the primary character in the first section of the book. \tShe found life in the big city much different than life at home. Racial segregation, while not established by law, was prevalent because of entrenched custom. \tEventually, she was able to find her niche. Mags and George marry and have a daughter. They loved each other deeply and tried to fulfill the other’s expectations. “She looked up at her husband in the way she had, full of admiration and trust. It seared his heart when she looked at him that way. On occasion, he gave detailed opinions on subjects he barely knew about, because he could not bear to disappoint her and risk lowering himself in her eyes. This time, he was sure of his answer.”\tThe remainder of the book focuses on Bailey, Minerva, and Fishbein\tFishbein immigrated to St. Louis after a tragic life in Russia. A decent man, when he and Minnie arrive in St. Louis, Bailey carried Minnie down the gangplank when her father was having difficulty maintaining his balance while holding her. Minnie looked at him and said, “Der shvartser has grine oygn.” Fishbein replied, “Der mensch has grine oygn.” He immediately taught her to respect people for their actions not to label them because of their skin color.\tHe never forgot his personal history. Hearing the outbreak of a riot, Minnie asked her father what it was and he said, “A pogrom.” “What is a pogrom?” she asked. He responded “A festival of evil. \t\tThe story got more complicated when Minnie fell in love with Bailey. He was reluctant to follow through even when he began to reciprocate her emotions because of their age difference and, more important, the racial divide. He left suddenly without explanation which threw Minnie into a massive downspin. \tBailey observed the way different people dealt with tragedy. Fishbein wondered if the tragedy that befell his people was the result of him disobeying one of the Ten Commandments, then thought, “But this is selfish, isn’t it? To think that a world of suffering rains down on a multitude because of my sin.”\tBailey “didn’t fixate on his own people’s miseries from the day they were captured in Africa and sold into slavery. He figured there was enough misery around day to day. Why wallow in the past? But Jews. If Fishbein were anything to go by, the past was their world entire.”\tBailey considered moving to Paris, where several notable black Americans like Josephine Baker and Langston Hughes had settled thinking he found a way for a better life. Fishbein disagreed. \"When any man is in a fever like this, the thought, a fever of delusion, it’s dangerous to argue.” \t\"Magnus spoke of golden exile, but Fishbein knew better. There was no such thing. Exile was a ripping up, a tearing away, a flight from one set of evils to another.\" Fishbein recognized the continuing racism in the world: \"Magnus Bailey’s people whose chains of iron had been loosed but never removed.\" Later, he would think of emigrating to Palestine as a way to have a better life.\tAnother character, Dr. Willie, thought Bailey was a threat in the pursuit of another woman, “vowed revenge against the usurper Magnus Bailey. He was a small enemy, to be sure, but a large enemy can be turned to friendship when mutual gain is at stake, while a small enemy festers everlastingly looking for his chance.” He also had set ideas about a woman’s place. “That’s the trouble...with a woman of independent means. They did things out of principle rather than need, which robbed a man like him of leverage.\"\tMARCHING TO ZION is the story of several tragedies as it tells the stories of simple people trying to survive in an often hostile environment. Most of it is realistic, if shocking at times. How Minnie reached her career choice isn’t clear though the reasons for her temper tantrums is explained. The relationships among the characters, as well as the characters themselves and the situations they encounter, are complicated but explained.\tThe author has a somewhat unique writing style. Her sentences tend to be long, sometimes convoluted, but are understandable without having to reread them. She doesn’t use quotation marks. Many of the characters speak with an accent but she indicates that by the judicious use of occasional words or phrases or incorrect verb tense. I received an advance copy of this book from Goodreads First Reads."}, {"userName": "Gabby", "userReviewDate": "Nov 12, 2013", "userURL": "http://www.goodreads.com/user/show/8912618-gabby", "userReview": "Marching To Zion by Mary Glickman begins with the story of Margaret Preacher, \"Mags\", who is a country girl and unfamiliar with big city sights. She has never been inside much less seen a building 5 stories high, and she is in awe of the differences between where she was born and raised as opposed to where she now finds herself. She got to the city by hitching a ride on the back of a milk truck where she managed to fit herself among the canisters. What she wants to do in this new and bigger place is borrow money so she can learn to do hairdressing for black women, and after she has the knowledge she needs, she'll be able to open her own store. A chance meeting on the street with Magnus Bailey, a kind of entrepreneur of the day, was a real stroke of luck. She'd like him to loan her $100 so she can get started learning her trade. She offers Magnus 10% of her profits until the loan is repaid, and Magnus would get 10% of her profits for 6 months beyond that. Instead of loaning her the money she needs to start her business, Magnus gives her $10 and sends her to a rooming house where she can get reasonable lodging. Magnus believes she will be able to find a job and earn the $100 she needs.After several job interviews that did not pan out for her, Mags decides to apply for a job at a funeral parlor. George McCallum was the man in charge of most of the services the funeral home offered, and Mags was very impressed with how good George made the bodies look. She wanted him to teach her how to do that. Eventually Mags and George realize they love each other, so they marry, and both their lives are peacefully happy both at work and at home. Unfortunately, things change.The St. Louis riots take place followed by an outbreak of the Spanish Fever, and it becomes necessary for Mags to pack up the people who are family, whether or not they are related by blood, and move them all back to where Mags came from. Mags has a cousin, Aurora Mae, who lived in a place known as the Stanton House. Mags decided to stay there, but the former owner of the funeral home, Mr Fishbein, his daughter, Minerva, and Magnus Bailey continue their travels heading toward Memphis.From this point the stories of each of these people take turns none of them would have expected. Minerva has always been a troubled girl, and as she ages, she only becomes more and more unsettled as she cannot get what she wants for herself. It is at this point that the subjects of race and heritage become highly important to the characters in this story. Each of them deals with prejudice that ultimately affects their destiny. It is also at this point that the unfairness of such petty, by today's standards, differences lead to tragic consequences. Glickman does a superb job of letting the reader know exactly what the repercussions of being both Black and Jewish meant in this time frame, and it is heartbreaking. There is no level playing field for any of these people, but only one of them may be able to overcome what seems like an impossible, unsolvable burden. I labeled this book as a historic novel along with other tags, because Glickman has included some important historical events in her narrative. These events, such as the St. Louis Riots do not normally get much if any special attention in history books, and that is an unforgivable oversight. Glickman cleverly, through characters I had come to deeply care about, told the story from a deeply personal side of how this one event changed the lives of so many people. And the hardest part to accept is that this event never had to take place at all. I also was unaware that the answer to racial problems for people in this country could be resolved by going to Europe. This country was founded upon the right of freedom, yet a huge portion of the population could never have that unless they left the country committed to providing it. The same holds true for religious freedom. That was available so long as the person seeking such freedom was of the \"correct\" religion. Only for Jews the option of going to Europe posed larger difficulties than staying in the US did. While Glickman has addressed very heavy, important issues in her book, she did it all through very likable, very human characters. Nothing was so heavy handed as to appear one-sided. I thought Minerva, or Minnie, was such a good case in point. For me she embodied the stress and unfairness of the time in which she lived. Her fate was troubling.I received an ARC of this book from Open Road Media in exchange for an honest review. That in no way influenced my rating of 5 Stars for this book. In fact, I'd have given the book more stars if possible. Read it - it's that good."}, {"userName": "The CurvyJones", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/1003704-the-curvyjones", "userReview": "I had a difficult time with this book. The story jumps from Mags to Magnus and then Minerva, back to Mags, to Aurora then back to Minerva. Such a huge cast of characters, all needing to tell their story. It begins interestingly enough, with a young country girl arriving in the big city with a dream. We meet Magnus, who runs a number of businesses with Fishbein, a Jew who owns, among other pursuits, a funeral home. Mags gets a job there, falls in love, has a child. Her husband is killed in a riot. Fishbein, his daughter Minnie, Mags, her child and Magnus all leave town. What follows is what seems like an odd wandering through time and Tennessee. Magnus discoveres that Minnerva(Minnie) has fallen for him. He runs from her with a lie. She discovers the lie, is terribly hurt by it and as a result runs off to become a prostitute and runs a highly favored house of il repute. At some point in the book Magnus realizes that he actually loves Minerva and runs off to find her, however having entrapped himself with Aurora, has to sneak around and make his way back to Minnie.There's a lot of time building up this illicit relationship and then it is... shall we say resolved... in a mere paragraph. I often feel like authors spend so much time avoiding a sagging middle that the end is an abrupt point at which the story simply drops off a cliff. Then things get all tied up and everyone's all better. As a point of grammatical contention, I get that some authors think the omission of quotation marks is artistic or symbolic or meaningful, but is such a distracting, horrible new trend and I really, as a book reader, would like it to stop. It pulls me right out of the story when I have to read a sentence twice to figure out if it's dialog or exposition. I'm trying not to let that weigh my decision to rate this book as three stars. A story of unrequited love between a Jewish woman and a black man sounds perfect on paper. I didn't relish the execution. I was furnished a copy from the publisher via Netgalley."}, {"userName": "Beth ", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/721785-beth", "userReview": "Mary Glickman’s MARCHING TO ZION is not a continuation of her excellent ONE MORE RIVER, although MARCHING does again involve one character, Aurora Mae, and both books are historical fiction. MARCHING is a standalone novel.MARCHING TO ZION is mostly about a white Jewish girl/woman and a black man who are doomed for, obviously, racial reasons. But the book doesn’t begin with their story. It begins in 1916 with Mags Preacher, a black woman, who finds work at a funeral home and eventually marries her boss, the director there. The owner of the funeral home is a Russian Jew with a daughter who nowadays would be put on Ritalin. But they seem to be minor characters in a story about Mags.Then the story shifts. Now it concentrates on that daughter who should be on Ritalin, Minerva, and a black man, Magnus, who befriended her and her father from the time they got off the boat and entered the United States. The shift is smooth, somewhat like when a news broadcaster shifts from weather to hard news. Still, it was a shift even though Glickman doesn’t leave Mags and her story entirely.This is an unusual structure, to begin with one story and shift to another. I thought it was a deliberate technique, the first story a sort of introduction to the second. It worked that way for me. But the shift could also signal Glickman’s accidental brain freeze and then her decision to take this in an unplanned direction. But the second story works in part because it is Glickman’s style to tell it from the various viewpoints of other characters. Readers learn their stories and may even care more about them than Minerva and Magnus.Safe prediction: there won’t be a sequel. This book does not lend itself well to one.But my hope is that Mary Glickman becomes a more recognized author. And I think it’s another safe prediction that she will. Her digital marketing manager sent me this advanced reader’s copy, and this is my honest review."}, {"userName": "Stephanie", "userReviewDate": "Aug 12, 2015", "userURL": "http://www.goodreads.com/user/show/3953927-stephanie", "userReview": "Marching to Zion was a page-turner for me. It's not plot-driven, really, but the character development really kept me involved in the story. I liked all of the characters in this story that examines racial and religious relationships and prejudice in Missouri and Memphis, in the early 1900s. At the centre of the novel is a white Jewish immigrant and his daughter, as well as a charismatic black American man, the three of whom have a long, rich, and complicated history, and are trying to map the direction of their future, if they can manage one together. I was sad to see that a character I really enjoyed, Mags, took a backseat in the novel after the first few chapters, but was heartened to learn that another black woman character, Aurora Mae, is a central character in another of Glickman's novels. Similar to a friend's review, I cannot pinpoint exactly what I loved, beyond the characters, but I did much enjoy Marching to Zion."}, {"userName": "Peter Riva", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/5374960-peter-riva", "userReview": "Sometimes an author breaks with tradition - you know the type of thing, in America we expect to have action and a definite main protagonist in the first 5 pages... that sort of dumbed-down reading profile.Mary Glickman breaks the mold. In this story you need to adsorb every page-turning nuance of the characters she writes about. Why? Because they are ALL compelling. The story is an adventure, it is a true history re-enactment, it is a tragedy, it is dramatic, and in the end there is hope where none, really none, should have or could have existed, yet it is there, that glimmer of hope in the outcome and offspring redeemed, saved, cherished. Cherished is, for Mary Glickman, an adjunct, an off-spin of love. Love on steroids. Now that's worth reading!"}, {"userName": "Maufran", "userReviewDate": "Sep 18, 2013", "userURL": "http://www.goodreads.com/user/show/5927555-maufran", "userReview": "A very fine novel, full of wonderfully interesting characters with a strong storyline. Highly recommended."}, {"userName": "Korey", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/10036631-korey", "userReview": "Great premise, torturous execution. I never would have finished it (and to be honest I did some skimming) if it hadn't been short. I hated how this was structured, how it artlessly jumped around, and the writing leeched all the inherent drama out of the story. The whole book is written in the most dry, uninvolving way. I never cared about these people or was interested in them. This is one of those books that begs your attention to wander because your phone or the scenery outside the window or even a blank wall is much more compelling. Also, writers who don't use quotation marks when writing dialogue should lose their contracts and never be allowed to write professionally again. It's so annoying. I told myself a while ago I would never read another book that did this but I relaxed my standard because this sounded so intriguing and I wanted to try a new author but it was a constant irritant."}, {"userName": "Nancy", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/979447-nancy", "userReview": "An unsettling look at the bigotry in the United States even when persecuted people come here to find solace. Jews, African Americans and the poor are often victimized rather than helped. An unsettling story of how these people help and hurt one another as they try to find a place called home."}, {"userName": "Gail", "userReviewDate": "Dec 15, 2013", "userURL": "http://www.goodreads.com/user/show/691748-gail", "userReview": "I received a review copy of this book.This is a story filled with tragedy from start to finish. The chief protagonists: Minerva, a Jewish girl whose parents were murdered in a Russian pogrom and who has been taken in by Mr Fishbein who is weighed down with the misfortune of losing his entire family in the same catastrophe. They have come to America and settled in St Louis, where his business running a funeral home in a black neighborhood seems to be prospering. Magnus Bailey, a black up-and-coming, charming, somewhat hucksterish business associate fascinates young Minerva. What appears to be a teenage crush transforms into a lifelong love as St. Louis race riots breaks up their home as they all flee--eventually to Memphis, where the plot rolls very eventfully on. There are numerous lesser characters, some of whom are given the time they deserve, but others who are introduced and somewhat developed only to be used as tags to move the plot along.This is very eventful novel which takes its characters from 1916 to 1936 and though some very dramatic circumstances. I occasionally felt that some of the important and emotional plot features should have been dealt with more carefully and at more length. While the main characters are well developed and their lives explored in full, there are other characters who are given some importance, particularly Mags, who open the story very charmingly, but them mostly fades from our view. That said, Marching to Zion is still still a gripping, though tragic, story."}, {"userName": "Merle", "userReviewDate": "Feb 03, 2014", "userURL": "http://www.goodreads.com/user/show/3179954-merle", "userReview": "March to Zionby Mary GlickmanIf you grew up here in the United States you invarilably learned about the war between the states, plantations, and slavery. March to Zion takes us through the time period in this country from 1913 - 1936. Mary Glickman introduces is to some wonderfully colorful characters, from Mags Preacher who leaves the backwaters of Tennessee to find her fortune in the big city, St. Louis, to Magnus Bailey who also has found a flashy style that helps him escape his past. The other main characters are Fishbein, an elderly Jew, who has escaped the pogroms of Europe bringing a daughter Minerva to America to find freedom and happiness. We have all also have heard that African Americans did not have racial equality in the South all through the early 1900s. There were separate neighborhoods and even separate entrances to buildings. But many of us may not have known that life in United States was not always easy for Jews either. There was quite a bit of anti-semitisim. As we follow the lives of Fishbein and the people who swirl around his Funeral Home and in and out of his life, we see how being Jewish and interacting with people of color affects his and Minerva’s lives.Historically acurate, March to Zion takes us through the events of the race riots of 1917 of East St. Louis, in which an outbreak of labor- and race-related violence caused between 40 and 200 deaths and extensive property damage. Then the Flood of 1927, and the Stock Market Crash of 1929. Glickman shows us how all these catastrophies affected the people in the South."}, {"userName": "Susanw", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/1088296-susanw", "userReview": "Mary Glickman's, Marching to Zion, takes us to a very interesting time period in American history, post WWI to the mid 1930's. While the book shows the struggle of African Americans, it also shows the plight of Jews in this time period. The added twist here is the forbidden love of a white Jewish girl and an African American male.A large cast of characters might be the sign of a very creative and descriptive author, but I did find that this large cast were not handled smoothly. Many, whose stories I would just become invested in, were then dropped or left me wanting to know much more about them. The first character introduced, Mags, we follow as she moves to the big city, finds a job, finds a husband, has a child and then lives through a traumatic event. All in the first 50 pages, then her character is dropped as the 'real' story starts. Mags isn't seen again till the very end of the book. Many of the story lines build then just trail off, until concluded with a one sentence wrap up later. This can be unsatisfying for a reader. The main love story, build and builds, only to come to a very dramatic climax in one short quick paragraph. Far to quick the primary characters of the book to be concluded. While an interesting time period, that she depicted very well and that isn't written about enough, and an interesting plot line, that could have been much more, I felt this book was good, but didn't succeed in being all it could."}, {"userName": "Mel", "userReviewDate": "Nov 02, 2013", "userURL": "http://www.goodreads.com/user/show/3894624-mel", "userReview": "Marching to Zion is tragic,and violent. Still, an enjoyable read. Mary Glickman knows how to tell a story. It was a little misleading. Margaret \"Mags\" didn't play a huge part in the book. I wish she did. Her character wasn't fully developed. It didn't read as a love story to me. Magnus and Minerva (aka Minnie, aka Lil Red) didn't seem in love as they did obsessed. They were not nearly as careful as they should have been. Even if she was a prostitute. It was a dangerous time for anyone thought to have had romantic feelings for a Black person (and the Black person in question). I don't know if I cared for either character. Minerva having fits (of rage?) The author tried to paint her as having a disorder (She did watch her family get murdered in the pogrom that killed Mr. Fishbeins whole family). Magnus just seem tortured. Roaming all over the country. He also seemed like the only Black person not scared to death of what him and Minerva felt for each other. I did like Fishbein's character. He was written as sad (and who wouldn't be? After what he went through?). But also as a fair, good person. The story tried to show how both Black and Jewish people were treated during that time. The characters of Pearl and Aurora Mae were also not big pieces of the story but I am looking forward to reading the authors other book in which Aurora Mae makes an appearance. Sad and abrupt (but probably fitting for the time) ending."}, {"userName": "Nicole Means", "userReviewDate": "Jan 28, 2014", "userURL": "http://www.goodreads.com/user/show/12683156-nicole-means", "userReview": "There are a few reasons I ranked this book 4 stars. First, the author does not really develop the characters to a point that they are likable. Sure, I empathized with the characters, but I felt no real connection to any of them! Second, the author virtually omits Mags, whom I thought based on the jacket cover, was a major character in this story. She does not develop this character nor her daughter who was born in tumultuous times. The author alludes that the daughter grew up cold because of incidences surrounding her infancy, but we never learn about this baby's future. Finally, and this is trivial, but the author does not use quotation marks when separating the character's dialogue. I just found it annoying, and I had difficulty delineating between conversations and inner thoughts.However, these slight irritants did not stop my captivation with the narration. I found myself thinking of this book quite often and staying up into the wee hours of the night to read it. I enjoyed the story, although it saddened me until the very end. The author did not create perfect characters, but she did a great job of humanizing the impact of hatred and cruelty on society."}, {"userName": "Sandra", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/17411885-sandra", "userReview": "The story opens with Mags Preacher coming to the big city to fulfill her dreams. The first person that Mags meets is Magnus Bailey. He helps her get a start, and she eventually ends up working at a funeral home owned by Mr. Fishbein. He and his strange daughter are the first Jews she has ever met. Her opinion of Jews changes when Fishbein saves her life during the race riots of 1917. As a matter of fact, lots of her ideas and circumstances change.However, the story is primarily about the unusual relationship between Bailey and Fishbein’s strange and dangerous daughter. And it is not only the fact that Bailey is black and Minerva is white that makes their relationship different and dangerous during this time in history. From the race riots of 1917 and through the depression, their relationship changes. Is there hope for these two to have a life together?This book was exciting and kept my attention. The characters were very well developed, and I cared about them. This is a sad historical fiction.I was given a free copy of this book in exchange for an unbiased review."}, {"userName": "Amy", "userReviewDate": "Jan 18, 2014", "userURL": "http://www.goodreads.com/user/show/14340518-amy", "userReview": "Marching to Zion is not one tragic love story but several all rolled into one very sad book. Whether losing their spouse to the pogroms in Estonia or the race riots of St. Louis, every main character in this book loses the person they love in a horrifying way.In spite of that, I thoroughly enjoyed this book. It showed me a small glimpse of what life in the early 1900's would be like for a black man in love with a white woman, a Jewish man whose entire family was slaughtered, or a woman on her own who is entirely helpless. I love all of the characters in this book. I cried at all that they suffered and rejoiced for the small triumph for 2 of the characters at the end, hoping that life in Israel will be as kind to them as they deserve.I don't want to tell you the entire plot of the book. If that's what you want, you can read the Amazon summary or another review. I'm just going to tell you that if you can handle reading a book that is full of tragedy and sadness, read this book. If you're looking for a light beach read, this isn't it."}, {"userName": "Jennifer G", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/32093728-jennifer-g", "userReview": "I really didn't think this book was going to be that good. It seems strange that I would read a book that I had such low hopes for, but I was in a rush at the library and didn't want to leave without a book for the week.It turns out that I really liked this book. I can't put my finger on what it was that I liked so much. It might have been the writer's style; it might have been the unique story. But I definitely liked the book and would recommend it.The main characters in the book are either white and Jewish, or black. The book is set back in time from 1916 to 1936, and follows the characters as they struggle with racism and hardship. Yet the story isn't all doom and gloom, and maintained my interest until the last page."}, {"userName": "Pamela", "userReviewDate": "Aug 04, 2014", "userURL": "http://www.goodreads.com/user/show/5807970-pamela", "userReview": "This one is high on my list. The story was well-told with multiple narrators with distinct voices. The writing held my attention, and there were plenty of themes for book club discussion: Society's rules, hatred, resilience, bad fortune, dignity, interracial relationships, and the imprinting of first love.This book made me think of the big and small betrayals people commit in the name of love and/or passion, the way we delude ourselves and use each other, and the ways in which we work hard (and often fail) to honor our commitments to people with whom we have soul-connections. This story also shined a spotlight on how money corrupts love, how it drives men to evil acts."}, {"userName": "Rachel", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/6069769-rachel", "userReview": "As a fan of Mary Glickman's previous novel, it was fun to revisit familiar characters (like Aurora Mae) and settings (the south before and after the Great Flood). However, in Marching to Zion, I just really didn't get her character of Minnie and found it hard to relate, feel empathy, and root for her and Magnus (like I did with Aurora Mae and Bernard in One More River and Jackson and Katherine in Home in the Morning). Nevertheless, an interesting, highly readable novel, with a totally surprising and unexpected ending, that I recommend especially if you read and enjoyed her others. However, I still like Home in the Morning the best!"}, {"userName": "Sharie", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/6750553-sharie", "userReview": "Hx Theme: combination of race relations and anti-semitism; very well intertwined and comparedI love how the focus winds from character to character, without feeling like you've abandoned the first one.Excellent and appropriate ending. But don't expect this to be a feel good novel.I really struggled with the lack of quotation marks throughout. I often had to reread to figure out if something was said or thought. I want to enjoy the story without getting bogged down in whether it was proofed correctly."}, {"userName": "Vicki", "userReviewDate": "Mar 26, 2014", "userURL": "http://www.goodreads.com/user/show/880701-vicki", "userReview": "I really liked how this book started out, but then it left the main character and started following another one, and eventually left that character to follow the next. They were all inter-related, but it was just weird. It also lost a lot of steam as it went along, and I started losing interest. I stuck with it, mainly to see if it ever got back to the original character and it really didn't although she was mentioned. Kind of a sad ending in a depressing book."}, {"userName": "Karen", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/5769960-karen", "userReview": "This was an enjoyable if not strange read. Anyone who believes in romance will not love the ending, those inclined to Karma will understand at once. Marching to Zion is very prophetic, it's lack of punctuation at times is confusing but adds to the rush of emotion it produces. This novel says a lot about the ideal of freedom, it's boundaries, and illusion. Glickman has won me with her syle, and I'll certainly be reading her first two novels Home in the Morning and One More River."}, {"userName": "Diana", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/2603601-diana", "userReview": "Marching to Zion is a little strange, as it starts about one person, who then disappears and three seemingly minor characters become the entire plot. But once the book settled into the main plot it is a story that you feel invested in. The characters are vivid and real and Ms. Glickman both devastates and satisfies you with the ending."}, {"userName": "Holly", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/418084-holly", "userReview": "I wanted to like this book very much. In fact I liked some of it quite a bit. In the end, the characters I most cared about turned out to be side characters in the story and the focus was one characters I couldn't stand who made stupid choices. And I didn't like the ending.All in all though, the writing is quite good, and I'd be willing to read more from the author."}], "description": "The forbidden, tempestuous, and tragic love story of a beautiful Jewish immigrant and a debonair black man in the South during the early twentieth centuryMags Preacher, a young black woman with a dream, arrives in St. Louis from the piney woods of her family home in 1916, hoping to learn the beauty trade. She knows nothing about Jews except that they killed the Lord Jesus Christ. Then she begins working for Mr. Fishbein, an Eastern European émigré who fled the pogroms that shattered his life to become the proprietor of Fishbein's Funeral Home. By the time he saves Mags from certain death during the 1917 race riots in East St. Louis, all her perceptions have changed. But Mr. Fishbein's daughter, the troubled redheaded beauty Minerva, is a different matter. There is something wrong with the girl, something dangerous, something fateful. And it is Magnus Bailey, Mags' first friend in the city, who learns to what heights and depths the girl's willful spirit can drive a man.Marching to Zion is the tragic love story of Minerva Fishbein and Magnus Bailey, a charismatic black man and the longtime business partner of Minerva's father. From the brutal riots of East St. Louis to Memphis, Tennessee, during the 1920s and the Depression, Marching to Zion is a tale of passion, betrayal, and redemption during an era in America when interracial love could not go unpunished. Readers of Mary Glickman's One More River will celebrate the return of Aurora Mae Stanton, who joins a cast of vibrant new characters in this tense and compelling Southern-Jewish novel that examines the price of love and the interventions of fate.", "title": "Marching to Zion", "url": "https://www.goodreads.com/book/show/17912858-marching-to-zion", "average": 3.56, "cover": "https://images.gr-assets.com/books/1382416990l/17912858.jpg", "reviews": 51, "authors": [{"url": "https://www.goodreads.com/author/show/4414147.Mary_Glickman", "name": "Mary Glickman"}], "type": ["Fiction", "Historical", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/17912858-marching-to-zion", "http://www.goodreads.com/book/show/18342211-marching-to-zion", "http://www.goodreads.com/book/show/9532894-home-in-the-morning", "http://www.goodreads.com/book/show/26174848-an-undisturbed-peace", "http://www.goodreads.com/book/show/12809963-one-more-river"]}