{"ratings": 6586, "userreviews": [{"userName": "Araz Goran", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/32779601-araz-goran", "userReview": "واحدة من أكثر الروايات التي أستمتعت بقرائتها وأنا منغمس تماماً في أسلوب كالفينو الهادئ البسيط , غير المتكلف في سخريته والتي كانت بمثابة جوهر الرواية، كالفينو يستخدم أسلوب فنان, يرسم رواية على هيئة قصص متعددة تتخذ من فصول السنة عنواناً للوحتها لترسم في الواجهة مشهداً طريفاً وسخرية لاذعة تنتقد الحياة العصرية الجامدة والمعيشة الإستهلاكية للمجتمع وعصر الآلات والضجيج والصخب ..ماركو فالدو يتمرد على أسلوب الحياة ذاك، يفر من جحيم العالم المادي القاسي ، يحاول أن يقتبس من البساطة فناً جديداً لحياته بأدوات بسيطة تطغى عليها سذاجة مُرة وعفوية ناضجة , تحاول أن ترسم صورة الإنسان الحالي المحاصر بين أنياب الحياة الجديدة الموحشة...إنه ليس تلاعب بالواقع بل هو هروب من قفص حديدي جامد صنعته لنا الحياة الجديدة، أسلوب العيش ببساطة, العودة إلى أحضان الطبيعة والإنسانية، جسدها كالفينو بـ رواية-قصصية بديعة للغاية.."}, {"userName": "Algernon", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "Calvino has been on my radar for a long time, and I think I made a good choice in picking Marcovaldo for a first try. This is a small book, but it has a big heart. The stories are set in the poverty ridden early 1950's and follow up to the relative abundance of the 1960's. The immediate connections that spring to mind are the grand masters of Italian neo-realism: de Sica in \"The Bycicle Thieves\", Fellini in \"Amarcord\" and \"Roma - Citta Apperta\", Visconti in \"Rocco and his Brothers\" or \"White Nights\". Going further afield, similar explorations of the condition of the less fortunates members of society, I could mention Truffaut or Kurosawa in their contemporary films. What they share with Italo Calvino is the poetry angle, \"diamonds in the rust\" and all that jazz, the hope that springs eternal when you are down and the only way is up. If we take the quote by Thoreau about \"the mass of men that live lives of quiet desperation and go to the grave with the song still in them\" , it becomes clear that Calvino has taken this singing responsibility upon his shoulders, as he follows his Marcovaldo in his ordinary dreams of improving his life by outsmarting the system and in his stubborn perseverence to keep trying despite countless defeats. The book could be classed as comedy, the kind that made Chaplin famous for getting us to laugh and cry at the same time at the tragic clown who walks into the sunset with his too short, patched pants and his oversized shoes. Subtitled \"Seasons in the City\", this collection of 20 short stories is tied together by the protagonists and the setting: Marcovaldo is a handyman (unskilled worker) in a big city, burdened by low pay, a querulous wife and six children. His background is not explicitly given, but he must have been born somewhere in the countryside and transplanted to the concrete jungle of big city. Witness his eternal fascination with nature: This Marcovaldo possessed an eye ill-suited to city life: billboards, traffic-lights, shop-windows, neon signs, posters, no matter how carefully devised to catch the attention, never arrested his gaze, which might have been running over the desert sands. Instead, he would never miss a leaf yellowing on a branch, a feather trapped by a roof tile; there was no horsefly on a horse's back, no worm-hole in a plank, or fig-peel squashed on the sidewalk that Marcovaldo didn't remark and ponder over, discovering the changes of season, the yearnings of his heart, and the woes of his existence. The first story sets the tone and the format for all the rest: the alienation of living in the big city, the poverty, the sudden glimpse of an opportunity for improvement (in this case a row of mushrooms appearing in the gutters of a tramway station), the enthusiasm and the impulsive action ( To Marcovaldo the gray and wretched world surrounding him seemed suddenly generous with hidden riches; something could still be expected of life, beyond the hourly wage of his stipulated salary, with inflation index, family grant and cost-of-living allowance.), followed by the Irony of Fate when his plans are crushed by the steamroller of Reality. From free-of-charge mushrooms, to a quiet night sleeping on a park bench, trapping birds on rooftops or stealing rabbits from a hospital, bee venom or sand baths treatments for arthritic pains, excursions in search of clean air or clean fish - everything poor Marcovaldo plans turns to dust in his hands. His children are not excluded from the family curse, I especially liked the one story when his older boy runs from home to spend a summer in the mountains with a herd of cattle. For all his poverty and bad luck, Marcovaldo is not a revolutionary, he doesn't plan to overturn the social order and he doesn't rant about the general injustice of life. Mostly he is sad and tired, his dreams mostly trivial and his moments of happiness cheap and fleeting. Here's an example: He is sitted on a bench by an avenue, near the place where he works; since his house is far away and to go there at noon costs time and tram tickets, he brings his lunch in the box, bought for the purpose, and he eats in the open air, watching the people go by, and then refreshes himself at a drinking fountain. If it's autumn and the sun is out, he chooses places where an occasional ray strikes; the shiny red leaves that fall from the trees serve him as napkins; the salami skins go to stray dogs, who are quick to become his friends; and the sparrows collect the bread crumbs, at a moment when no one is going past in the avenue.As he eats, he thinks: \"Why am I so happy to taste the flavor of my wife's cooking here, when at home, among the quarells and tears, the debts that crop up in every conversation, I can't enjoy it?\" I found it easy to identify with the main character, not only because I'm a big fan of the Italian school of cinema: I grew up in a big industrial town, playing around construction sites and unfinished appartment blocks, craving a green park or a holiday by the seaside, alternatively freezing in winter and stifling hot in summer:  In every human presence Marcovaldo recognized sadly a brother, stuck like him, even in vacation time, to that oven of cooked and dusty cement, by debts, by the burden of the family, by the meagerness of his wages.  . Like him, I sought refuge from reality in the magic of the silver screen :  For anyone who dislikes his home and finds it inhospitable, the favorite refuge on cold evenings is the movies.  . As an Easter Egg for filmgoers, Calvino inserts in one of his stories a homage to one of the most famous cuts from  La Dolce Vita  , making Marcovaldo hold the lights for the filming of a scene with a diva splashing in a fountain at night.As summer follows spring and winter follows autumn and Italian economy slowly gathers steam, Marcovaldo moves from a basement room to a rooftop one, acquires a motorcycle and starts going to the movies or to the supermarkets. The tone of the stories changes slightly, to a more overt condemnation of consummerism, city alienation and inequality: billboard signs that hide the stars and keep the family from sleeping, supermarkets full of products they can't afford and yet couldn't help coveting, Christmas holidays marketed to death, free samples of shady products that they don't really need, luxury restaurants with restricted access, and so on. But through all these stories of woe and sadness, Calvino manages to find a glimpse of beauty, a lyrical touch, a good word or a kind gesture. His development as a writer was also evident as I progressed through these seasons in the city, starting with stark, elegant neo-realism and later flirting with magical realism, supra-realism, urban fables and a few closing paragraphs that are an allegorical poem of the fight between light and darkness, life and death. Simply beautiful.I guess I'll have to read now my other two books by him that are waiting on my shelves :  Cosmicomiche  and  If On a Winter Night a Traveller. [edit for spelling - 2016]"}, {"userName": "Heba", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/68150924-heba", "userReview": "...في المدينة ..حيث المباني العالية ..المداخن السوداء ..الغبار يتخلل خيوط الضوء التى تتسرب من النوافذ..حركة المرور الخانقة وضجيج الاصوات المختلطة تلك الحياة الشاحبة التى مهما حاولت أن تُغرق شوارعها بالأضواء واللوحات الاعلانية الملونة إلا إنه يبقى وجهها حزيناً باهتاًً ..بين كل هذا الأزدحام \"ماركوفالدو\"\" الذي يعيش وزوجته وابناءه الستة في غرفة واحدة يستطيع ان ينسل من حياة المدينة  يبحث عن جمال الطبيعة ويستجضرها في مخيلته أو ماثلة أمام عينيه بين أورقة المدينة حتى وإن واجه الكثير من المواقف الساخرة والموجعة في الوقت ذاته وبالرغم إن جميعها كانت تبوء بالفشل لكنه لم يتوقف يوماً عن البحث يستدعي دوماً لوحة مقتطعة من الطبيعة حيث الجبال العالية ..التلال الخضراء ...العشب النديّأشجار الكستناء المتلألأة تحاصر الجداول الصغيرة التي تداعبها النسمات الرقيقة كان يحدق في السماء حيث القمر الفضي يظهر تارة وأخرى يختبىء وراء السحب البيضاء ويبحث بعينيه عن النجوم الصغيرة التى تتدلى من السماء لتهمس بالأحلام المنسية وكأن الكاتب المبدع\" إيتالو كالفينو\" أراد أن يرسل رسالة صغيرة من الطبيعة حيث جمال البساطة والشفافية إلى المادية حيث التعقيد والضبابية"}, {"userName": "David", "userReviewDate": "Jan 11, 2013", "userURL": "http://www.goodreads.com/user/show/6971227-david", "userReview": "Italo Calvino is always fun to read. While Marcovaldo does not have the Borgesian or post-modern tropes of Invisible Cities or If on a winter's night a traveller, it is a heart-warming collection of brilliantly crafted stories, the pinnacle achievement being the lovable naivete and inventive imagination of the titular Italian, Marcovaldo. The whimsy and lyricism of Calvino's prose is worthwhile enough to embark on the too-short modern voyage of this short book, though it has much else to offer as well.The character of Marcovaldo is a man caught between two abysses. He lives in a northern industrial city of Italy in the postwar 1950's through 1960's (though the particular city is never mentioned, and likely is an imagined city, I imagined it as loosely based on the industrialized city of Turin) which bridged the eras of poverty with economic boom. Marcovaldo is the lovable-loser, a character trope very popular in post-modern/post-modern fiction, as a break with the great thinkers and heroes of previous literary movements and from the classical characters of Hamlet, Odysseus, etc. He works at a shipping firm, doing menial work which he does not enjoy but which puts meager food on his family's table. He has a wife and five children which share his whimsy and naivete, though they are much more accustomed to the modern world in which they live. Marcovaldo is torn between the world of beauty which he feels is impossible in city life, the beauty of nature and of romantic notions, and the world, the reality, which constantly makes demands on him, awakes him rudely from his reveries.\nThis Marcovaldo possessed an eye ill-suited to city-life: billboards, traffic-lights, shop-windows, neon signs, posters, no matter how carefully devised to catch the attention, never arrested his gaze, which might have been running over the desert sands. Instead he would never miss a leaf yellowing on a branch, a feather trapped by a roof-tile; there was no horsefly on a horse's back, no worm-hole in a plank, or fig-peel squashed on the sidewalk that Marcovaldo didn't remark and ponder over, discovering the changes of the season, the yearnings of his heart, and the woes of his existence.\nEach story represents a short aphoristic anecdote, taking place in one season of one of the five-years encompassed in the collection (spring-summer-autumn-winter). Most stories are very short, and every one is charming in a whimsical if not magical way. A number of the stories stand out to me after having finished: Marcovaldo dreams of sleeping out beneath the stars, among nature, but after sneaking out with his pillow, he is held at bay by an arguing couple, then is distracted by a traffic light, the smell of a cabbage truck, etc. until he finally can get to sleep only to moments later be woken at dawn. Another story has him jealously hoarding the secret of some wild mushrooms growing along the road, only to find another has discovered them as well - he relents and invites everyone to join in picking them, only for everyone to get sick from the poisonous fungi. Marcovaldo's romantic imagination is constantly foiled by the reality in which he lives. Where he sees fresh, wild mushrooms he finds poisonous ones, where he sees a river surfeit with fish he finds them poisoned by an upstream paint company, a mountain escape is the grounds of a sanatorium, the romantic sleep beneath the stars: no sleep at all.There are two layers to the message of Marcovaldo: on the one hand, Marcovaldo is representative of a flawed view of the world, and the unhappiness and disappointment inherent in unreasonable attachment to the past, or out of reach ideals. Sometimes I wish I had been born in 1900, gone to literary salons and fashionable soirees, rode in hansom cabs. But that is an overly romanticized vision of a past era, and era gone. And it is gone because the world I live in now is better, much more accommodating, far fairer, and people in general are better off. Sure I may never know what it's like to collect love letters in a small gilt-rim cigar box, or go to an illustrious debutante ball and gossip in the corner beside a girandola mirror, but on the other hand, t-shirts are so much more comfortable than those starchy collared shirts and breast-coats, so, there's that. While Marcovaldo's attachment to a natural world which is far beyond the city limits, and beyond his practical grasp, he is never disheartened, and that is what makes him so lovable. He is a fool, but a very lovable fool.On the other hand, there is a tension between the advantages of industrialization and the beauty and benefits of naturalization. Calvino is far from supporting an unindustrialized world, one without cities, one made for the Marcovaldos of the world; but he is also condemnatory of the excesses in industrial cities: pollution, traffic, waste, blind consumerism. The character of Marcovaldo is deliberate in his ridiculousness, but so are the many citizens of the silly city somewhere in Northern Italy. Those who resist industrialization seem as ridiculous as those who violently support it. Calvino sees it as an inevitablity, though one which requires a better balance. Cannibalistic consumerism infringes on the natural beauty, but it is capable of a beauty of its own, and the urban images which Calvino fills these pages with illustrate that potential beauty.\nMarcovaldo went back to look at the moon, then he went to look at a traffic light, a bit farther on. The light flashed yellow, yellow, yellow, constantly blinking on and off. Marcovaldo compared the moon with the traffic-light. The moon with her mysterious pallor, also yellow, but also green, in its depths, and even blue; the traffic-light with its common little yellow. And the moon, all calm, casting her light without haste, streaked now and then by fine wisps of clouds, which she majestically allowed to fall around her shoulders; and the traffic-light meanwhile, always there, on and off, on and off, throbbing with a false vitality, but actually weary and enslaved.\nThe city has a coldly modern art to it, a \"false vitality\" - it is art, it can only imitate life. To Marcovaldo there is not value to this false beauty, it is unnatural and mechanical. But Calvino's descriptions of it show that though it does not fit the ideal, there is some art to be had in the man made world. Man is like the traffic light in the city, morning:on, evening:off, in to work then back to home, enslaved to routine, chained to the consumerism which drives him. The city is not an ugly place, but rather is the prison of a stifling life. Marcovaldo, for all his dislike of the city, is not an unhappy man, though he is plagued by modern troubles, and though he is constantly made the fool of his own gambits, he is a many happy in his childhood-in-middle-age. He has not lost the innocence of youth, not lost that vitality or winsome hope for adventure, invention, imagination. Though Calvino supports a sojourn in nature, he does not completely condemn the world which is reality, the world with winking traffic lights. More important that escaping the city is escaping routine, being spontaneous, being enthusiastic, loving life for what it has to offer and not grudging it for what it lacks."}, {"userName": "George K.", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/4675995-george-k", "userReview": "Βαθμολογία: 9/10Αυτή η μικρή συλλογή είκοσι διηγημάτων αποτελεί την πρώτη μου επαφή με το έργο του Ίταλο Καλβίνο. Το βιβλίο το αγόρασα χθες μαζί με το \"Οι πρόγονοί μας\" (είναι ένας τόμος που συγκεντρώνει τρία βιβλία), ενώ εδώ και αρκετό καιρό έχω δυο από τα πιο πολυδιαβασμένα έργα του, το \"Αν μια νύχτα του Χειμώνα ένας ταξιδιώτης\" και \"Τα Κοσμοκωμικά\". Μιας και πήρα την απόφαση να γνωρίσω επιτέλους αυτόν τον συγγραφέα, σκέφτηκα ότι το συγκεκριμένο βιβλιαράκι θα ήταν το ιδανικότερο ξεκίνημα. Πόσο πολύ το ευχαριστήθηκα! Από την πρώτη κιόλας ιστοριούλα είχα κατασταλάξει στη βαθμολογία που θα έβαζα στο βιβλίο: Πέντε αστεράκια! Ο τρόπος γραφής του, η μαγεία που κρύβεται πίσω από την κάθε πρόταση, οι περιγραφές του, η όλη ατμόσφαιρα παραμυθιού, η εναλλαγή των εποχών, τα ανθρώπινα μηνύματα... Είναι ένα βιβλίο αστείο και συνάμα μελαγχολικό, πέρα για πέρα ανθρώπινο, γεμάτο εικόνες και συναισθήματα. Όλες οι μικρές ιστορίες έχουν κάτι να πουν, κάτι να δείξουν, ειλικρινά δεν βρήκα ούτε μια που να μην μου αρέσει έστω και ελάχιστα. Κάτι μου λέει ότι θα τον λατρέψω πραγματικά τον Καλβίνο..."}, {"userName": "Vonia", "userReviewDate": "Nov 19, 2015", "userURL": "http://www.goodreads.com/user/show/5204784-vonia", "userReview": "I actually really liked this one, more than I expected. This is my second from Italo Calvino, and although this is a far difference from \".... If on a Winter's Night a Traveler\", it was almost as great, in different ways. Nice to find an author than can write well in multiple genres/styles. \"Morcovaldo\" [\"The Seasons in the City\"] is a collection of vignettes, connected but separated by seasons and time. \"Marcovaldo is an unskilled worker in a drab industrial city in northern Italy. He is an irrepressible dreamer and an inveterate schemer. Much to the puzzlement of his wife, his children, his boss, and his neighbors, he chases his dreams, but the results are never the expected ones.\" I especially liked that Morcovaldo was a realist, even a pessimist, as opposed to the typical Panglossian. Like me, he does not have the easiest life; after years enduring this, he has understandably become bitter at times, somewhat cynical. The important thing, however, is that every so often he has a unique ability to notice the small things in life; to zoom in on a small beauty in his surroundings and allow it to bring him as well as those around him great happiness, even if it is only temporary- until work the next day. Like me, he may not be what is defined as 'happy\" overall, but definitely can be \"distracted\" to have frequent, significant periods of temporary happiness. Which is sometimes all we can do. My favorite vignettes were: Park Bench Vacation [He sleeps on one on a summer night when he tried of the crowdedness of his own place with his wife and children. Alas, various mishaps prevent him from getting any sleep at all. Had a few laughs. Almost Charlie Chaplin style.] The Lunch Box [Wonderful, eloquent, tangible, descriptive personification with his lunch box/bento box. Includes more than visual; explores the nostalgia, as well as the meaning behind it (his wife makes it with love every morning for him.)] The Wrong Stop [Mesmerizing descriptions of seeing the city as if it came from a dream; Morcovaldo has recently seen a film delivering the beautiful scenery in Calcutta. Amidst the thick fog in his own country, he begins to see, in the nothingness, the beauty- all in his mind's eye. What do you know, at the end of his trip, he accidentally boards a plane leaving for Calcutta.] Morcovaldo at the Supermarket [Along with his family, they discover that it is inescapable to follow the movements exhibited by the richer, more successful class shoppers, as they are drawn to various products, ever more than they intended. Ask desire Marcovaldo's extreme lack of funds. As they float in the blue called denial, it is not until the supermarket closes that they magically find their way out, forced to pull themselves away from the items in the cart, resisting like magnets.]"}, {"userName": "Sandra", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "C’è una leggera brezza, un vento che viene da lontano, in cielo una luna splendente e Venere lontana, da sola, che esplode di luce; il vento si trasforma, diventa violento e strappa le foglie dagli alberi, le fa volteggiare mescolate con la pioggia, tanta acqua che ridà vita alle piante, fa crescere funghi e alla fine il vento conduce le foglie verso l’arcobaleno. Sono le ultime giornate di autunno, arriva l’inverno, la neve ricopre il mondo esterno e gli dà una forma strana, diversa, si crea una realtà difforme, un sogno che è fantasia. Qui vive Marcovaldo, che cammina sempre con il naso per aria, in compagnia della meraviglia e della curiosità per ciò che lo circonda, e con lui il lettore volteggia tra la musicalità dello stile e le invenzioni fantastiche, sempre con storie avventurose soffici e ovattate, delicate come seta, in cui le avventure si concludono con tragicomiche disavventure: perché l’avventura è vivere col naso per aria guardando le bolle di sapone o l’arcobaleno, le vespe o le beccacce, i gatti o un coniglio che scappa sui tetti; la disavventura è un lavoro da operaio, una famiglia da sfamare, una moglie che si lagna sempre, i debiti, la grande città industriale inquinata e già rovinata dal consumismo imperante, la malattia. Forse il libro non è più attuale come all’epoca in cui fu scritto, oltre 50 anni fa, ma…non è forse vero che siamo tutti dei Marcovaldo?"}, {"userName": "qwerty", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/26568024-qwerty", "userReview": "Είναι μια σειρά από όμορφες ιστορίες που τις θυμάμαι με μια γλυκιά νοσταλγία. Είναι παιδικά παραμυθάκια που η αξία τους έγκειται στην απλότητά τους και στην έλλειψη επιτήδευσης στο ύφος. Αυτό είναι που μου άρεσε στον Italo Calvino, αυτό ακριβώς που μαρτυρά και το μικρό του όνομα. Αυτήν τη γλυκιά απλότητα που βρίσκει κανείς συνήθως σε ιταλικά καλλιτεχνικά δημιουργήματα, είτε αυτά είναι συγγράματα, είτε ταινίες. Με τον ίδιο τρόπο που μόνο ένας Ιταλός θα μπορούσε να συλλάβει το σενάριο για την ταινία \"Η ζωή είναι ωραία\", μόνο ένας Ιταλός θα μπορούσε να γράψει τέτοια διηγήματα ανάλογης ομορφιάς.Λάτρεψα το χαρακτήρα του Μαρκοβάλντο, την αφέλειά του και την αγαθότητά του. Με γοήτευσε η αγάπη του για τη φύση και με συγκίνησαν οι προσπάθειες εύρεσης της φύσης έστω και σε αυτές τις πολύ μικρές εκφάνσεις αυτης σε μια μεγάλη και χαοτική πόλη. Όλα αυτά τα καμώματά του μου δημιουργούσαν ένα χαμόγελο στα χείλη στη διάρκεια της ανάγνωσης, όχι μόνο επειδή κάποια από αυτά είναι αστεία, αλλά επειδή αβίαστα χαμογελά κανείς διαπιστώνοντας την αφέλεια και τον αυθορμητισμό στα καμώματα ενός μικρού παιδού.Το πιο πιθανό, λοιπόν, είναι ότι όχι μόνο ένα παιδί, αλλά και όποιος κρύβει μέσα του ένα παιδί μπορεί πολύ εύκολα να αγαπήσει αυτό το βιβλίο."}, {"userName": "arcobaleno", "userReviewDate": "Jun 06, 2012", "userURL": "http://www.goodreads.com/user/show/9951082-arcobaleno", "userReview": "Ma esiste ancora la natura?\nVenti racconti uniti dallo stesso protagonista: un uomo semplice con una famiglia numerosa e una vita grama. Ma Marcovaldo è un sognatore con un cuore di bambino: trova la bellezza e la poesia nelle piccole cose, quelle nascoste dal caos cittadino e invisibili ai più. I racconti affascinano per l'atmosfera sospesa da favola, per la magia, per la tenerezza e la malinconia, per la capacità di fermarsi a guardare le foglie che cadono, uno spicchio di luna, un arcobaleno dopo la pioggia."}, {"userName": "Mohamed Al", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/2837640-mohamed-al", "userReview": "إيتالو كالفينو قاصّ بسيط!لا تعني البساطة هنا أنّه ساذج، أو سطحي، أو جاهل.فالبساطة يمكن أن تكون جميلة، وجميلة جدًا كتلك التي يمارسها كالفينو في هذه المجموعة القصصية التي قد يصنفها البعض بأنها قصص موجهة للأطفالوالبساطة ليست مرادفًا للسهولة، فالذين يكتبون قصصًا وروايات للأطفال يعرفون ما أصعب أن يكون الإنسان بسيطا عندما يواجه الأطفالكالفينو، قاص بسيط جدًا، أقولها وأنا أدرك أن البساطة مصدر قوّته وإبداعه"}, {"userName": "Arwen56", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/9615245-arwen56", "userReview": "Non sono una estimatrice di Calvino, ma a Marcovaldo sono davvero affezionata. L’ho letto a scuola, la prima volta, accompagnata, nel mio procedere, dal puntuale, quieto e preciso commentare della mia insegnante di letteratura italiana delle medie. Grande donna. La persona giusta al posto giusto, mi sento di dire. L’ho ripensata spesso. Credo di doverle molto in termini di amore per la letteratura. Temo sia ormai morta, ma non ho modo di sapere cosa ne sia, oggi, di lei. La ricorderò sempre con grande affetto, perché è stata, senza alcun dubbio, uno dei riferimenti più importanti nella mia vita scolastica. Tornando a Marcovaldo, è un libro che non posso definire “bello”, letterariamente parlando, ma che ha un suo fascino. Questo strano personaggio, un po’ ingenuo, un po’ malinconico, un po’ favolistico, ci racconta di cosa sia l’insoddisfazione. Non ambisce, no, a fare rivoluzioni, a cambiare le cose, a rivoltare la vita. Ci racconta delle sue inquietudini, che, a volte, sono quasi un nulla … impalpabili come ali di farfalla. E’ inadeguato, Marcovaldo, a vivere, però vive. Subisce, ma è sempre pronto a ricominciare. Non si sa da dove venga, né, esattamente, dove voglia andare. Ma intanto viaggia. Non so se, leggendolo ai giorni nostri, sia ancora possibile trovarne la magia. Non ha effetti speciali da proporci, né risposte precise al “male di vivere”. E’ anche parecchio “datato”, direi. Però la scrittura è impeccabile. E’ riposto nel mio cuore come quelle vecchie fotografie in bianco e nero, ed un po’ ingiallite, che ti ricordano un tempo ormai scomparso. E che, quando le guardi, sorridi."}, {"userName": "mai ahmd", "userReviewDate": "Aug 06, 2013", "userURL": "http://www.goodreads.com/user/show/7154074-mai-ahmd", "userReview": "أعتبر هذه القصص القصيرة دروسا في بساطة بنية السرد وثراء الفكرة وتوظيف بنية الأماكن يصف الأماكن بأهمية تثير الإنتباه يعطي الفطر دوره في الحكاية الفطر هو الأرض هو حياة يقترب من واقع الإنسان البسيط .. كالفينو ينتقد المجتمع وطريقة المعيشة والحياة الإستهلاكية التي تستنفذهم وذلك بطريقته الساخرة المحببة كنت أقرأ كالفينو بجذل ولو أعدت قراءة القصص من جديد سأقرؤه بنفس الشعور هذا كاتب خلق لي السعادة أثناء القراءة أحببته وبحثت عن مؤلفاته"}, {"userName": "John", "userReviewDate": "Feb 11, 2008", "userURL": "http://www.goodreads.com/user/show/870152-john", "userReview": "Here's a book I knew I would like the minute I held it in my hot little hands. For one thing, it's short - 120 pages, fairly large print. For another, it's symmetrical - 20 stories, 5 for each season of the year. And finally, having read one story from it in a seasonal collection already, I knew it was both magical and sarcastic, a combination as golden as snide and abstract are shit. (Ok, it could be argued magical and sarcastic and snide and abstract are po-tay-to and po-tah-to, but let's not split hairs here.)It took me three weeks to read Marcovaldo, because almost every story made me want to go back and read it again, not because it was hard to understand but because I wanted to experience the reading of it again. This is truly a book to savor. Some of the short stories (none are over 10 pages, most clocking in under 5) are merely funny in a subtle way, like \"The Wasp Treatment\" and \"The Lunch-Box.\" Some, like \"The Forest on the Superhighway\" and \"Smoke, Wind, and Soap-Bubbles,\" are caustic commentaries on industrialized society. Others - \"The Good Air\" and \"The Wrong Stop\" come to mind - are visceral, haunting journeys of Marcovaldo, a man who wants to see through the churning gears into a natural world that he's never seen except in fancy, and his family into a consumer culture they don't understand but charge dutifully into. Some reach almost terrifying levels of dementia, when the line between romantic idealism and harsh reality blur with Marcovaldo and his already-jaded family stuck at the borderland - see \"A Saturday of Sun, Sand and Sleep\" and \"Marcovaldo at the Supermarket.\"And then there are \"The Moon and GNAC,\" \"The Rain and the Leaves,\" and \"Santas Children,\" the centerpieces of the book which do all of these things. All three come toward the end of the book, after the tone, setting, and characters have been subtly put into place. They have a few things in common - all have a conflict between the family unit and corporate culture, with the same winner each time; they each reflect an urbanization of myth, with neon lights and potted plants replacing cosmos and beanstalks; and each presents a subtle, heartbreaking moral judgment on the society they are set in and the losses man has swallowed in achieving it."}, {"userName": "Neva", "userReviewDate": "Mar 30, 2014", "userURL": "http://www.goodreads.com/user/show/2604564-neva", "userReview": "Като се замислих как да определя това, което е направил Калвино, докато е правил \"Марковалдо\", се сетих за последното изречение от една книга, която обожавам: \"Трябва да се обича\". Не \"не би било зле да се обича\", \"препоръчително е...\", \"може...\", \"случва се...\", а \"трябва\". Марковалдо знае. Освен това: и аз като него моментално виждам гъбите, оглеждам се за съзвездията, лежа по пейките, ръся есенни листа, говоря си с котките и обичам мозък пане."}, {"userName": "Кремена Михайлова", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/7907888", "userReview": "[Все пак ще разкажа за неизбежната победа на бетона над тревата и в нашия квартал: огромната поляна отсреща, на която бягаха кучета и деца преди 15 години, вече е голяма детска градина без достъп за „външни“ субекти – жалко, но какво да се прави, има градски деца и нужда от детски градини. Огромната поляна под терасата ни, на която също играеха кучета и деца, сега е поделена между сив паркинг и модерна детска площадка (след като преди мястото при дъжд се превръщаше в кални кратери със седмици, месеци дори) - жалко, но какво да се прави, всеки иска да живее в града и се увеличаваме, имаме коли и деца със съвременни изисквания, не сме и Амстердам, Мюнхен или Осака, за да има повече велосипеди. Май сме като в Италия през 60-те години на миналия век...(Заради всички тези промени дори детето ми възкликна: Последното място от детството ми изчезна – „лоста за тупане на килими“, около който играеха децата на сянка под огромна липа, но на разнебитен асфалт – сега сложиха гладки плочки; защо не, липата си е там – все по-голяма, бадемът на новата шарена площадка си е там – все по-зелен).  (hide spoiler)]"}, {"userName": "Uyuyan Adam / Engin Türkgeldi", "userReviewDate": "Nov 27, 2017", "userURL": "http://www.goodreads.com/user/show/4639990-uyuyan-adam-engin-t-rkgeldi", "userReview": "\"Marcovaldo ya da Kentte Mevsimler\"de, doğadan kopan sıradan kentlinin hikayeleri anlatılıyor. Doğadan ayrı düşen Marcovaldo, bunun getirdiği mutsuzluğun pençesinde kıvranmakta ve bir çıkış yolu aramaktadır. Her öyküde, sıkışıp kaldığı kent yaşamından kaçmanın, doğa ile temas etmenin yolunu bulmaya çalışır. Bazen bir tramvay yolunda biten bir mantarda, bazen işyerinde büyütmeye çalıştığı bir bitkide, bazen de bir parktaki bankta sabahlamakta arar çareyi. Bu çabaları çoğu kez hüsranla sonuçlanır. Kent, insanı kuşatmış, yutmuştur bile. Doğa Marcovaldo için artık bir seraptır sadece. Daha acısı ise Marcovaldo’nun çocuklarının, doğayı, onu özleyecek kadar bile tanımıyor olmasıdır kanımca.Calvino benim en sevdiğim yazarlardan. Marcovaldo ise, onun öne çıkan eserlerinden biri değil bana kalırsa. Daha çok ilkgençlik çağına yazılmış, sade, eğlenceli, yer yer didaktik, edebi oyunlardan uzak, kolay okunan ve kısa bir öykü derlemesi. Kitaptaki dil de, kurgular da oldukça basit. Yine de kitapta Calvino’ya özgü bazı anlatımlar ve anlar var ki, insan ne olursa olsun okuduğuna değdiğini hissediyor."}, {"userName": "Tsvetelina Mareva", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/38037688-tsvetelina-mareva", "userReview": "Поредното бижу в поредицата за кратки разкази на любимото издателство Жанет-45 с великолепния превод на безупречната Нева Мичева. Сборникът с разкази ни среща с чаровния неудачник Марковалдо и многочисленото му семейство, който всекидневно се бори с неволите, дълговете, сивотата на големия град и еднообразната си работа. Въпреки абсурдните ситуации, в които изпада, печели симпатиите с по детски наивния си и чист поглед към света. Очароват го привидно обикновени и незначителни неща като гъбите, поникнали в оскъдната трева на спирката, луната, закривана от рекламно пано, саксиеното растение на работното място. Човекът, откъснат от природата, крачещ ден след ден сред бензинови изпарения, бетон, небостъргачи и синтетични материи. Познато, нали? А е писано през 60-те год. на миналия век. Много топли и трогателни истории, с които Калвино ме спечели и се нарежда до любимия Будзати. Разказът \"Луна и няк\" е един от най-силните, които съм чела изобщо. Калвино и Будзати открих и опознах благодарение на Нева Мичева, за което много ѝ благодаря."}, {"userName": "Matthew", "userReviewDate": "Nov 20, 2009", "userURL": "http://www.goodreads.com/user/show/1648411-matthew", "userReview": "I was trying to write about cold weather. Since I was struggling, I set down my pen and opened this book and was amazed to read this:\"Cold has a thousand shapes and a thousand ways of moving in the world: on the sea it gallops like a troop of horses, on the countryside it falls like a swarm of locusts, in the cities like a knife-blade it slashes the streets and penetrates the chinks of unheated houses.\"There! Simultaneously familiar and new. That is how it is done, Calvino. No wonder I read you with such delight!Here is the beginning of another story in this book:\"The city of cats and the city of men exist one inside the other, but they are not the same city.\"What a marvelous opening! You are a joyful writer Calvino, because you never fail to be excited by common things."}, {"userName": "عبدالله ناصر", "userReviewDate": "Nov 17, 2014", "userURL": "http://www.goodreads.com/user/show/7480307", "userReview": "كالفينو يكتب قصصاً كاريكاتيرية بطريقة مذهلة حيث يقوم بسرد حكايا ماركوفالدو الذي ينتمي للطبقة الكادحة و يعمل في مدينة صناعية دأبت على قضم كل ماله علاقة بالطبيعة في الوقت الذي يحاول جاهداً المحافظة على روحه البسيطة"}, {"userName": "Aslı Can", "userReviewDate": "Dec 19, 2017", "userURL": "http://www.goodreads.com/user/show/33590272-asl-can", "userReview": "Yine klasik biçime daha yakın bir İtalo Calvino kitabı. Tatlı, rahatsız etmeyen bir fakir edebiyatı tadı var Marcovaldo'nun başından geçenlerde. Ya İtalo'nun yazdığı her şey bana şekilde güzel geliyor ya da İtalo'cuğum Calvino yazdığı her türün hakkını veriyor. Buna karar verebilmek için okumakta en çok zorlandığım tür olan ve bilerek sona bıraktığım otobiyografik yazılarını okumayı bekliyorum."}, {"userName": "Mevsim Yenice", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/67914616-mevsim-yenice", "userReview": "Calvino'nun tarzını çok oyuncu, zorlama ve yorucu bulanların (hemen söyleyeyim ben onlardan değilim, Calvino deyince saygı duruşuna geçenlerdenim) seveceğini düşündüğüm, Calvino'yla barışmalarını sağlayacak, sade, akıp giden, keyifli kısa öykülerin bulunduğu öykü kitabı. Marcovaldo, şehrin gürültüsünden, koşuşturmasından, zorluklarından ve onun getirisi olan uykusuzluk, huzursuzluktan bıkmış, sessizliği özeleyen bir romantiktir adeta. Mevsimler geçer, şehir dönüşür, sesler değişir ama romantiklik bakidir. Ben yine de Calvino'nun Calvinoluk yaptığı metinleri yeğliyorum."}, {"userName": "Angelina", "userReviewDate": "Nov 12, 2017", "userURL": "http://www.goodreads.com/user/show/267307-angelina", "userReview": "Марковалдо, симпатичният неудачник, който вижда света през други очи и някак си успява да намери малки пъстри прозорчета насред сивите стени и еднообразието. Марковалдо, който умее да цени малките радости - шепата гъби, поникнали кой знай как до спирката, любимата пейка в близката градинка, пухкавия нов сняг, звездното небе нощем, саксийното растение за което се грижи всеки ден. Марковалдо, с когото непременно трябва да се запознаете, особено когато Нева Мичева толкова се е постарала да ни го представи в целия му скромен блясък.Това беше една много приятна първа среща с Калвино и със сигурност няма да бъде последната."}, {"userName": "Edward", "userReviewDate": "Oct 07, 2015", "userURL": "http://www.goodreads.com/user/show/12933866-edward", "userReview": "Oh dear, this one was not good. The book is a series of \"amusing\" sketches featuring the hapless Marcovaldo, each drawing for its comedy from a piece of obvious and terribly cartoonish irony. In one story, a hungry Marcovaldo obtains some free mushrooms ... but they turn out to be poisoned! In another, he starts treating people for rheumatism through the use of wasp stings... but his practice is overrun by wasps! In yet another, Marcovaldo steals a rabbit which he looks forward to eating... but the rabbit turns out to be poisoned! You get the picture. Whatever other charms this book may have, they are eclipsed by the truly inane plots."}, {"userName": "Emmapeel", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/8674526-emmapeel", "userReview": "Da piccola piangevo spesso per cose che gli altri consideravano poetiche o divertenti, tipo il circo, i film di Charlot o i fumetti di Paperino. Con Marcovaldo andò allo stesso modo: troppo forte l'aura di povertà, le minime vicende da umiliati e offesi, quel sentore di cavolo bollito e stanzette stipate di figli con il bagno in fondo al ballatoio che trasudavano da ogni pagina. Mi disperavo per le sue disavventure, sentivo il peso di quell'ingiustizia esistenziale, avrei voluto salvarlo da quella città orribile e grigia piena di rumore, picchiare il vigile, la padrona di casa, il caporeparto, il commendatore e gli altri prepotenti che lo vessavano quotidianamente. Insomma, io questo libro l'ho odiato a pugni stretti, come solo sanno fare i bambini. Maledissi la maestra che ce l'aveva appioppato e tutti quei piccoli bugiardi leccaculo che scrivevano chebellomarcovaldo! nei temi, mentivano e lo sapevo. Speravo di rileggerlo con gli occhi della saggezza, del disincanto e della maturità ma purtroppo le reazioni sono state identiche ad allora, con l'aggravante che nel frattempo i commendatori sono ormai praticamente estinti (un po' anche i capireparto, a pensarci bene). Adesso esco e vedo se riesco a picchiare almeno un vigile."}, {"userName": "Patty", "userReviewDate": "Nov 16, 2010", "userURL": "http://www.goodreads.com/user/show/4542936-patty", "userReview": "Ci sono libri che van bene a 10 anni così come a 40. Marcovaldo è uno di questi.Leggerlo è stato come scorrere le immagini di tavolette di fumetti, quelle di tanti anni fa. Anche i nomi dei personaggi delle 20 novelle sembrano appartenere ai fumetti di un tempo lontano: la moglie Domitilla, il vigile Tornaquinci, il capo-magazziniere Viligelmo, il dottor Godifredo... una galleria di personaggi buffi e reali, a metà strada tra il mondo reale e quello fantastico. Fiaba e realtà si intrecciano sapientemente nella scrittura leggera e veloce di un grande maestro qual è Calvino. Ogni novella inizia con buffo disincanto, come una favola per bambini, per finire poi con un melanconico umorismo che fa riflettere.C'è tutta la vita in Marcovaldo: la povertà di un manovale che non riesce a sfamare la sua numerosa famiglia, il delirio del \"divertimento\" di massa, la corsa ipnotica al consumismo, l'incapacità di adattarsi al nuovo mondo urbano ostinandosi a cercare la natura anche dove mai potrebbe esserci, le prepotenze dei capi...Vita, filosofia, temi importanti, ma trattati con una leggerezza e una competenza stilistica raffinata ed elegante che fa di Calvino uno scrittore morale, mai moralista o ancora peggio propagandista, proprio come afferma Alberto Asor Rosa: \" Lo scrittore morale non si pone il problema di dire qual è il bene e qual è il male.(...) Per me lo scrittore morale è quello che si limita a suggerire dei comportamenti e ad additare una linea di condotta.\"La prima pubblicazione di Marcovaldo risale alla vigilia del Natale del '63 con le bellissime tenere illustrazioni di Sergio Tofano, celebre illustratore de \"Il Corriere dei Piccoli\", anche se parte dei racconti erano già usciti con L'Unità. Nel '72 a dei ragazzi di scuola media Calvino rispose così:\"Mi chiedete se Marcovaldo sono un po' io. Direi di sì, ma il fatto strano è che ho cominciato a sentirmi simile a Marcovaldo dopo aver scritto il libro. Quando lo scrivevo credevo che fosse un personaggio un po' buffo un po' triste ma molto diverso da me. Col passar degli anni invece...\""}, {"userName": "Annette", "userReviewDate": "Mar 27, 2008", "userURL": "http://www.goodreads.com/user/show/422244-annette", "userReview": "dear italo calvino,i would like to be able to live in this time and place that you are writing from. i would like to be able to know what it was like to be living in a place that was still struggling to reconcile the modern with the rural. i would like to understand what it was like to live poorly in a place and time like that. maybe it would not be that different to live that way today. but moving to the heart of the matter, i want to know if marcovaldo is a sympathetic or comical character. i feel that you are criticizing the faceless and mechanical nature of city life, that you are trying to show the difficulty of living as a poor citizen in the city. however, it seems you are continually laughing at your poor hero for his idealization of the idyllic. every time he attempts to go beyond what his means allow him in his cramped tenement life, every time he tries to show his children something outside of the flashing signs and smoke filled skies that are all they are able to relate to, something goes horribly wrong. but something goes horribly wrong in such a terribly funny manner that i can't help but wonder who's side you're on? is this a critique of the society or the dreamer? of mechanism or idealism?it seems unfair that i should get such pleasure out of the sorrows of marcovaldo, the wretch. he only wants something better from life than he has been given. so why, oh why, did you have to make him so small, so humorous? i should not complain. i love every moment and word. i can both pity and laugh at marcovaldo without feeling too badly about myself. but i do tend to wonder, just what are you playing at?and as if to respond, i found the following quote from calvino regarding his writing\"\"My working method has more often than not involved the subtraction of weight. I have tried to remove weight, sometimes from people, sometimes from heavenly bodies, sometimes from cities; above all I have tried to remove weight from the structure of stories and from language.\""}, {"userName": "Anastasia", "userReviewDate": "Nov 18, 2016", "userURL": "http://www.goodreads.com/user/show/55368121-anastasia", "userReview": "20 μικρές ιστορίες, κάθε ιστορία διαδραματίζεται μία διαφορετική εποχή και θίγει ένα διαφορετικό ζήτημα, μία διαφορετική πλευρά της αστικής ζωής. Όλες μαζί συνθέτουν έναν συνολικό προβληματισμό σχετικά με την ένταξη του ανθρώπου στο σύγχρονο αστικό τοπίο και τη σχέση του με τα απομεινάρια φυσικού στοιχείου που βρίσκονται διάσπαρτα στις αστικές δομές. \"Μα υπάρχει ακόμα η φύση; Η φύση που βρίσκει είναι περιφρονητική, παραμορφωμένη, έχει συμβιβαστεί με την τεχνητή ζωή.\" (σελ.9) Παρά τις απάνθρωπες, αφιλόξενες συνθήκες που επικρατούν ο Μαρκοβάλντο δε σταματά να ονειρεύεται...να πλάθει κόσμους και εικόνες από ειδυλλιακά τοπία και μέρη που δεν έχει συναντήσει ποτέ. \"Το βλέμμα του Μαρκοβάλντο έψαχνε ολόγυρα αναζητώντας τη γένεση μια διαφορετικής πόλης, μιας πόλης από φλοιούς, λέπια, σβόλους και νευρώσεις κάτω από την πόλη της μπογιάς, του κατραμιού, του γυαλιού και του σοβά\" (σελ.124)Στοιχεία κωμικά εναλλάσσονται και συνδυάζονται με διακριτικά στοιχεία φαντασίας. Πολλά τμήματα της ιστορίας δεν προσδιορίζονται ακριβώς, δίνοντας τη δυνατότητα στον αναγνώστη να συνθέσει από την αρχή εικόνες και εντυπώσεις με βάση προσωπικές εμπειρίες και βιώματα. Ο λόγος είναι απλός, λιτός, κυλάει εύκολα και ευχάριστα. Κατάλληλο και ιδανικό για κάθε ηλικία!\"...όμως ο Μαρκοβάλντο ένιωθε ότι το χιόνι ήταν φίλος του, ένα στοιχείο που έσβηνε το πέτρινο κλουβί όπου ήταν φυλακισμένη η ζωή του.\"\"...βρισκόταν στην κατάλληλη κατάσταση για να ονειρευτεί ξύπνιος, για να προβάλλει μπροστά στα μάτια του, όπου κι αν πήγαινε, μια ταινία χωρίς διακοπές σε μια οθόνη χωρίς όρια\""}, {"userName": "Ariya", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/11818463-ariya", "userReview": "เหมาะจะเป็นหนังสืออ่านตอนว่าง กินขนม ตบยุง นั่งบีทีเอส หรือไม่ก็นั่งแกร่วรอนัด ทั้งเนื้อหาก็ชวนให้ขำได้ หึๆ ตลอดเวลา และบางครั้งก็จิกกัดเหลือร้ายจนขำไม่ออก เมื่อต้องอ่านเจอการปะทะกันระหว่างคนกับคน คนกับกาลเวลา และคนกับระบบ ที่บางครั้งฝ่ายแพ้ก็มักจะเป็นคนโง่ที่ต่อสู้จนถึงหยดสุดท้ายเสมอ อีกอย่างที่ชอบเป็นพิเศษ คือการบรรยายรายละเอียดของเมือง ผู้คน บรรยากาศ การกระทำต่างๆ ของตัวละครในชีวิตประจำวัน ไม่ว่าจะเดินไปไหน กินอะไร ทำอะไร ซึ่งล้วนแต่เขียนด้วยสำนวนแบบที่ชวนให้นึกถึงเมืองปลายทางของคนอ่าน ทั้งๆ ที่อยู่กันคนละภาษา วัฒนธรรม แต่พฤติกรรมและการกลืนกินของเมือง และคนในเรื่องก็แสบ และชวนหัวได้พอๆ กัน"}, {"userName": "Tariq Alferis", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/20030537-tariq-alferis", "userReview": ".ايتالو كالفيانو يكتب قصصًا واقعية هزلية مضحكة فهو يقفز كبهلوانيّ من حكاية إلى حكاية اخرى، ماركوفالدو أصبح من الشخصيات الروائية المفضلة، البطل الساخر الذي يعرينا بمواقفه وكأن أحداث قصصه نحن أبطالها وان اختلف المكان و الزمان .."}, {"userName": "Kirstin", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/30037960-kirstin", "userReview": "Beautifully written moments from the life of the comically-tragic character, Marcovaldo. A pretty, perfect book. Read it when you're sad. It will make you feel better."}], "description": "Marcovaldo is an unskilled worker in a drab industrial city in northern Italy. He is an irrepressible dreamer and an inveterate schemer. Much to the puzzlement of his wife, his children, his boss, and his neighbors, he chases his dreams-but the results are never the expected ones. Translated by William Weaver. A Helen and Kurt Wolff Book", "title": "Marcovaldo", "url": "http://www.goodreads.com/book/show/18929.Marcovaldo", "average": 3.89, "cover": "https://images.gr-assets.com/books/1439670966l/18929.jpg", "reviews": 413, "authors": [{"url": "https://www.goodreads.com/author/show/155517.Italo_Calvino", "name": "Italo Calvino"}, {"url": "https://www.goodreads.com/author/show/6921.William_Weaver", "name": "William Weaver"}], "type": ["Fiction", "Short Stories", "European Literature", "Classics", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/18929.Marcovaldo", "http://www.goodreads.com/book/show/25532045", "http://www.goodreads.com/book/show/17570882", "http://www.goodreads.com/book/show/2392096.Marcovaldo_ovvero_Le_stagioni_in_citt_", "http://www.goodreads.com/book/show/24673748", "http://www.goodreads.com/book/show/925299.Marcovaldo_ovvero_Le_stagioni_in_citt_", "http://www.goodreads.com/book/show/6944821-marcovaldo-ovvero-le-stagioni-in-citt", "http://www.goodreads.com/book/show/34532867", "http://www.goodreads.com/book/show/18272605-marcovaldo-ya-da-kentte-mevsimler", "http://www.goodreads.com/book/show/2856358-marcovaldo", "http://www.goodreads.com/book/show/10347702-marcovaldo-ovvero-le-stagioni-in-citt", "http://www.goodreads.com/book/show/32095643", "http://www.goodreads.com/book/show/6171066-marcovaldo", "http://www.goodreads.com/book/show/374233.If_on_a_Winter_s_Night_a_Traveler", "http://www.goodreads.com/book/show/9809.Invisible_Cities", "http://www.goodreads.com/book/show/9804.The_Baron_in_the_Trees", "http://www.goodreads.com/book/show/59780.Cosmicomics", "http://www.goodreads.com/book/show/174465.Il_cavaliere_inesistente", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}