{"ratings": 17227, "userreviews": [{"userName": "Chris", "userReviewDate": "Sep 24, 2009", "userURL": "http://www.goodreads.com/user/show/2764185-chris", "userReview": "This is one of the best books I've ever read. A remarkable attempt by Jack London in dissecting a person's evolution of being as they happen upon the path of enlightenment. Martin Edin (M.E.--a hint at the author's identification with the hero?) is a roughneck sailor who is blinded and transformed by the inner and outer beauty of a woman he meets, but this is just the beginning. Looking into her eyes he caught, \"glimpses of the soul, and a glimpse of his own too.\" His former mode of being had come to an end.Throughout the story his journey is chronicled as an intellectual and moral advance that conducts him from the dark haunts of his former 'cave' of a life, and gives entrance into a world of truth and love that was too white hot in radiance for the sleepy bumps he used to call his eyes. He educates himself through a personal track of reading books (indiscriminately at first, but in time becoming more direct and intentional), and soon he soars above even his erudite peers in his apprehension of philosophy and scientific verities. \"And so you arise from mud, Martin Edin,...and you cleanse your eyes in a great brightness, thrusting your shoulders among the stars...and wresting highest heritage from all the powers that be.\"He mounts to a dizzying height of cultural development and cerebral prowess...yet he ultimately finds himself engulfed in loneliness and emptiness. He had opened the windows of the cramped quarters of his former existence, and having completed his trek of this new world he discovered, he finds that it is hermetically sealed from all outside life and anything that could possibly make him happy again. He had found truth, but lost love...and he finally wrestles with the decision about what to do with it all. His answer will shock you."}, {"userName": "Simona Bartolotta", "userReviewDate": "Dec 10, 2016", "userURL": "http://www.goodreads.com/user/show/5312173-simona-bartolotta", "userReview": "\"Of course it was beautiful; but there was something more than beauty in it, something more stingingly splendid which had made beauty its handmaiden.\"It is astounding how long it took for me to digest this book -and I say this in nothing but praise. Honestly, it's not like I'm sure the process is completed; I tend to believe the best books are the ones you never wholly digest, the ones that keep nagging at your mind for weeks, months, years, forever, too, if that is what it takes. And the best books are, also, the ones that, lo and behold, turn out to be but little mirrors of yourself - and more often than not, very much to your own dismay, shame, embarrassment and a tiny, timid ember of inner joy.For me, Martin Eden was both.Meet young Martin Eden: a sailor, a commoner, an illiterate, a Mr Nobody, were it not for one thing: his boundless, painful sensitivity to beauty. Martin Eden can be described as naive in many (almost any) respects, but not this. He may not be able to give a cultured, sophisticated definition of what art is or is thought to be, but he just knows. He would say that he just knows it in his guts, though he wouldn't be able to elaborate further than that. He uses a metaphor that I took to heart immediately, probably because I find it not only strikingly to the point, but also poignant, smeared with sadness, and that was what stuck; it goes, \"Dogs asleep in the sun often whined and barked, but they were unable to tell what they saw that made them whine and bark. He had often wondered what it was. And that was all he was, a dog asleep in the sun.\" I think we're all, a little, like dogs asleep in the sun. Martin Eden aimed at the stars, sought to express the inexpressible, to strip humans of their own skin; but aren't we all a little like Martin Eden, like that slumbering dog, every minute of our life? I, for sure, feel like that constantly. I constantly feel like I've got tons of things to say, and never manage. And it's frustrating, so terribly frustrating. But I guess I learned to live with that, with our never-ending communicative stalling, with beating around the bush, with being close but never really there. Yes, I feel this is a good definition of what Martin Eden is: close but never really there. He is one of \"the legions of toil\", a \"hoodlum\", but he does not conform: he is too aware and awake, almost criminally so (there is a reason if his family, or part of it, almost disowns him). But even later, after he becomes a learned man, a famous writer, when he is finally allowed into the upper classes, he cannot ignore that he doesn't belong there either, as if he still hadn't got out the last bit of dirt from under his nails, or rather, as if the fact that they didn't have any, had never had any, could never, ever sit well with him. I know London didn't intend for him to be idolized, and I'm not idolizing it (obviously, or what I'm saying wouldn't have sense at all) but I see myself in him. I see myself and you and you and all, and I see myself projected in him as the minuscule Titan I am in my mind. Did London intend for this? I can't tell, but I certainly thank him for Martin Eden.\"Saints in heaven -how could they be anything but fair and pure? No praise to them. But saints in slime -ah, that was the everlasting wonder! That was what made life worth while.\"I loved this book beyond words, and that is why I won't shame it further by attaching more of this senseless blabbering to it. It's sad and terrible and asphyxiating (in my mind it is Martin Eden; or, The Cage) and wide-ranging, and it's a masterpiece. So my request is: treat it kindly, even if it won't do the same to you. It simply doesn't know any better."}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Oct 07, 2010", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "757.\tMartin Eden, Jack London, first published 1909تاریخ نخستین خوانش: پنجم ماه دسامبر سال 1984 میلادیعنوان یک: مارتین ایدن، نویسنده: جک لندن؛ مترجم: ا. دوس‍ت‍دار، نشر: تهران: علمی، چاپ نخست سال 1335، چاپ دوم 1347 هجری خورشیدی»، در 294 ص، شابک: ندارد عنوان دو: مارتین ایدن، نویسنده: جک لندن؛ مترجم: محمدتقی فرامرزی، نشر: تهران: تندر، چاپ نخست 1362، چاپ دوم 1368، هجری خورشیدی؛ در 414 ص. شابک: نداردعنوان سه: مارتین ایدن، نویسنده: جک لندن؛ مترجم: محمدتقی فرامرزی، نشر: تهران، دنیای نو، چاپ نخست سال 1387 هجری خورشیدی، چاپ دوم نامشخص، چاپ سوم سال ‬1389 هجری خورشیدی، چاپ چهارم سال 1392 هجری خورشیدی، در 494ص.، شابک: 9789641720034؛عنوان چهار: مارتین ایدن، نویسنده: جک لندن؛ مترجم: فریدون حاجتی، نشر: تهران، آرمان، چاپ نخست سال 1354 هجری خورشیدی، در 218 ص.، مصور. شابک: ندارد عنوان پنج: مارتین ایدن، نویسنده: جک لندن؛ مترجم: فریدون حاجتی، نشر: تهران، دبیر، سال 1389 هجری خورشیدی» در 128 ص.، شابک: 978-600-5955-37-8 موضوع: داستانهای آمریکایی - قرن 20 میلادینقل از متن: «تو را به خاطر آنچه هستی، آنچه بودی و حتی به خاطر راه­هایی که پیموده­ ای دوست می­دارم». پایان نقلمارتین ایدین، داستانی از زندگی ملوانی ست از قشر فرودست جامعه. جوانی که از یازده سالگی به دنبال نان دویده، درس را فراموش کرده، به زندگی کارگری خو گرفته، ملوان شده و نوعی از زندگی بی قید را تجربه کرده، به دریا رفته و با پول بازگشته، چند ماه در خشکی سپری کرده، و باز سفری دیگر را آغاز کرده البته آنگاه که پولش ته کشیده است. علاقه­ ی بسیار به خواندن کتاب و شعر دارد، هر کتابی را که به دست آورد، می­خواند. رویدادی او را با «روت» دختر یک خانواده از اشراف آشنا می­کند. «مارتین» دل در گرو عشق می­نهد، و تلاش دارد تا پایگاه اجتماعی خویش را دیگر کند. جهشی کند از قشر فرودست به فرادست، به همت عشق. در این تلاش آموزگارش «روت» است. اما روح سرکش «مارتین» را نگارش است که آرام می­کند. می­داند که نویسندگی برای او نان نمی­شود. داستان زندگی ادامه می­یابد. کار می­کند و می­خواند و می­نویسد. به دریا باز می­گردد، رختشوی میشود، و به فروش داستانهای خویش می­پردازد. بخت اما با او یار نیست. با آنارشیستی به نام «برسیدن» آشنا می­شود، عقایدش تغییر می­کند و هدفش نیز. «برسیدن» او را نصیحت می­کند که به دریا بازگردد، کار بدانجا می­رسد که جدایی از «روت» را، از او می­خواهد. می­گوید: «زنی بزرگ و بی­قید را برگزین، زنی که به زندگی لبخند می­زند، و مرگ را به سخره می­گیرد، و تا جایی که از دستش برآید به عاشقش عشق می­ورزد. چنین زنانی وجود دارند، و تو را، به اندازه­ ی هر یک از این دست پروردگانِ بزدل بورژوازی، خواهند پرستید». ص 348،. «برسیدن» او را با گروهی آشنا می­کند، که بی قیدی را، به لذت بورژوا بودن فروخته­ اند. مارتین، دیگر همان مارتین سابق نیست، اما همچنان عاشق «روت» است، اما از هر آنچه «بندهای بورژواری» می­خوانند، نفرت دارد: «از انسان­هایی که دانش­شان را به گور سپرده ­اند»، و «بدون خواندن یک نقد، یا اصل مطلب، به صرف بودن از طبقه­ ی بالاتر، خود را محق در نظردادن می­دانند». در این گیرودار سخنهایش در یک جمع سوسیالیستی دردسرساز می­شود، و برای مدتی «روت» را از دست می­دهد. در همان روزهاست که «برسیدن» هم می­میرد. تنها می­ماند، اما بخت دوباره به او روی می­کند، و کتابهایش به فروش می­رسند. مارتین منزجر از بورژواها، خود را در آن طبقه می­بیند، دست از نوشتن برمی­دارد. اکنون با سئوال بزرگوارتری روبرو شده، و باید پاسخش را بیابد، از خود می­پرسد: «انسان­هایی که امروز او را از خود می­دانند، در سال­های فقر و بدبختی او کجا بودند»، و ادامه ی داستان همین سئوال است. مارتین ایدن اثر ماندگار «جک لندن» است شاید خودنوشتی از زندگ خودی ایشان باشد، «جک لندن» این اثر خود را خواسته یا ناخواسته، تقدیم به تمام کارگران می­کند، از دیدگاه او، آن­ها تنها کسانی هستند که: «بودن برایشان معنای متفاوت از منفعت دارد، و زندگی را با لذت و در سختی می­گذرانند، ...». ا. شربیانی"}, {"userName": "Tugba", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/67137298-tugba", "userReview": "Hayatımın en etkileyici romanlarından biri artık o. Tek kelimeyle muhteşem.İnsan hayatının gidişatını değiştirebilecek güce sahip bir karakter Martin Eden. Anlatım o kadar başarılı, içerik o kadar güzel ki. Konu, verilen zaman döngüsü içerisinde ustalıkla işlenmiş. Martin Eden'in hayatını -onunla birlikte- yaşıyoruz adeta. Son kelimesine kadar doyuran harika bir edebiyat örneği. Özellikle sayfa 320'lerden sonra resmen tutuldum kitaba. Ne desem ne yorum yapsam kitabın da yazarın da hakkını teslim etmiş olamam. Dilim, sonun da etkisiyle ancak bu kadar dönebiliyor şu anda. Ben geç okudum ama en nihayetinde okuduğum için çok mutluyum. Okumayan kalmasın lütfen. Sevgilerimle,T."}, {"userName": "Ahmet Kara", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/31091102-ahmet-kara", "userReview": "Benim bir romanda ilk aradığım, kelimelerin ve dilin ustalıklı kullanımıdır. İyi anlatımı kurguya yeğ tutarım. Bazı arkadaşlarım “fazla mekanik” bulsalar da, bu bende böyledir. Martin Eden, Jack London’ın ilk okuduğum kitabı oldu. Hikaye baştan sona sürükleyiciydi. İtiraf etmeliyim ki, hem kitabın baş kahramanı Martin Eden’ın zorlu yaşam mücadelesi hem de romandaki lirik aşk hikayesi daha kitabın ilk sayfalarından itibaren beni kendisine kilitledi, son cümleye dek soluksuz takipte kaldım. Ama işte dedim ya kelimeler/dil önemli diye, doğrusu başlarda, belki kitabın ilk üçte birlik bölümünde yazarın dili bana biraz basit, yavan geldi. Bu belki de kitaba bir Dostoyevski romanı sonrasında başlamış olmamdan kaynaklanmıştır, bilemiyorum. Ama sonrasında, nasıl olduğunu benim de tam anlamadığım bir şekilde, dildeki o basitliği sevmeye başladım. Daha doğrusu, o basitlik dediğim hadiseyi sonraları sadelik/yalınlık olarak görmeye ve bu yalınlığın kitaba harika bir akıcılık kattığını düşünmeye başladım. Yazar kitapta zaten okuyucuyu kendisine kilitleyen cinsten nefis iki hikaye yakalamış (bir kişisel gelişim hikayesi artı bir de nefes kesen bir aşk hikayesi), dolayısıyla bu hikayeleri öne çıkarmak amacıyla kullandığı dili özellikle süper-akıcı tutmuş gibi hissettim. Zaten bir noktadan sonra kurgu, dil, anlatılan hikaye hepsi birbirinden beslenmeye başlıyor.Uzun lafın kısası, büyük keyifle okuduğum bir roman oldu. Herkese tavsiye ederim."}, {"userName": "Dagio_maya ", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/69893331-dagio-maya", "userReview": "\"Accidenti, le normali recensioni sono più nauseanti dell’olio di fegato di merluzzo\" E cosa dire di Martin Eden?Un guerriero, un combattente che dalla feccia della società s'insinua nel mondo borghese prima con ammirazione e poi con disprezzo.Come il nome del protagonista palesemente suggerisce, questa è la storia di una battaglia (Martin!) alla conquista del paradiso terrestre(Eden!).E' l'imbarazzo il primo ad introdursi: una porta si apre ed un mondo, fino ad allora, sconosciuto si spalanca davanti agli occhi del ventenne che odora di mare e cammina dondolando come si trovasse a solcare gli oceani anche sulla terra ferma.L'incontro con la pallida e fragile Ruth, la scoperta della gioia del Sapere e un bisogno impellente, urgente che sboccia di colpo: scrivere! La vita di Martin Eden è destinata a cambiare. \"Chi sei, Martin Eden? chiese all'immagine riflessa nello specchio quella sera tornando in camera sua. Si osservò a lungo e con curiosità. Chi sei tu? Che cosa sei? Qual è il tuo posto?Considerato uno dei libri arrabbiati della letteratura americana, mette in scena una dura condanna del mondo borghese come grande espressione di falsità ed ipocrisia. Industriali, banchieri, politici: nient'altro che sfruttatori che non sanno realmente vivere.Ma la penna s'intinge nel vetriolo entrando anche nelle stanze del mondo editoriale: \" Sciacalli e arpie\"!I rapporti veri, genuini li si trova tra i socialisti che vivono reclusi ai margini della città. Al centro c'è l'individualismo dei borghesi che si esprime nelle speculazioni e sopraffazioni economiche e l'individualismo filosofico a cui Martin Eden si abbarbica scoprendo le tesi di Herbert Spencer come chiave per spiegare l'esistenza tutta. E così' Martin si ritroverà tra le mani una moneta che deciderà il suo destino: da un lato il successo dall''altro il fallimento...” Che cos'era? Sembrava un faro. Ma no: era nel suo cervello quell'abbagliante luce bianca. Essa brillava sempre più splendida. Seguì un lungo rombo: gli parve di scivolare lungo una china infinita, e in fondo in fondo sprofondò nel buio. Solo questo seppe. Sprofondava nel buio. E nel momento stesso in cui lo seppe, cessò di saperlo.”"}, {"userName": "Ubor Metenga", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/2113063-ubor-metenga", "userReview": "- Henüz Martin'le tanışmadıysanız okumayınız. - Bilirsiniz Ruth Morse, Martin Eden'ı kendi kalıplarına sokup cemiyetine dâhil edemeyeceğini anlayınca kendi \"temiz\" ve \"soylu\" hayatına dönüp keyfine bakar, Martin ise dünyanın tüm arka bahçelerini gördüğü, sefaletle dolu birkaç aydan sonra, kendisinin de hiçbir zaman anlam veremediği bir şekilde, defalarca kez reddedilmiş yazılarının vasıtasıyla hatırı sayılır miktarda paraya ve üne sâhip olur.Martin'in parası ve şöhreti dillere düşünce, önceden sırt çeviren, kendisine işçi sınıfının bir artığı gibi bakan Morse ailesi ve avanesi, Martin'e büyük alaka göstermeye başlarlar. En yoksul zamanlarında bir dilim ekmeğe muhtaç kalan Martin, önemli adamların akşam sofralarında baş köşelere buyur edilir, önceden fikirleri aşağılanırken, şimdi dalkavuklar ağzından çıkan her kelimeyi not etmektedir. İşte bu günlerin birinde, Martin'in yazarlık peşinde koşmasının boş bir hayal olduğunu düşünen, sigortalı bir işe girip, normal insanlar gibi meslek sahibi olması gerektiğine inanan Ruth, yayıncıların peşinden koştuğu, bir paragrafı için günlerce dil döktüğü Martin Eden'ın kapısını çalar. Sefaletin eşiğinde bıraktığı adamı, üne ve paraya kavuşan Martin Eden'ı geri istemektedir. Martin'e yaklaşır, elini omzuna koyar ve ardından da Martin'e sarılır. Martin eden, Tahiti'nin yakışıklı berduşu, bu sıcak girişimi geri çevirmenin bir kadın için son derecek onur kırıcı olacağını düşünür ve incitmemek adına karşılık vererek, parası ve mesleği olmadığı için vaktiyle kendini yüzüstü bırakıp giden Ruth'a sarılır. Martin Eden, ince düşünceli roman kahramanları denince akla gelenlerden biri - belki de birincisi - okyanus diplerinin nâdide incisidir."}, {"userName": "Banu Karayel", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/54905203-banu-karayel", "userReview": "Tereddütteyim; şimdi bu kurgu \"entellektüel tekamül\" e bir güzelleme miydi değil miydi? Bu marazi aşka ve karaktere duyulan büyük beğeni, sırf amaca ulaşmak yolunda kullanilan aracın kitaplar olması sebebi ile mi? Hayır ben kitabin bitiminde \"cehalet mutluluktur\" dedim de... :))"}, {"userName": "Onur Uslu", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/47730332-onur-uslu", "userReview": "Martin Eden kitabı 2 ay boyunca sindire sindire okuduğum, her okuyuşumda beni kendi dünyasının sınırları içerisine hapsetmiş, kitabın kapağını her kapattığımda kısa bir süre bile olsa Martin Eden'ı düşünmemi sağlayan çok özel bir kitap. Martin Eden karakterini okumak, hayat içerisinde bambaşka bir tat bırakıyor sizde. Son derece özgün... Tabii onun yaşadıklarına benzer şeyler yaşamış insanlar için bu özgünlük bambaşka bir boyut oluyor. Toplum içerisinde birkaç sınıf atladıktan sonra hiçbir şeyin hayal ettiğimiz gibi olmadığını hatta aksine eskiyi özlememize yol açtığını anlatıyor bir yandan. Diğer yandan aşkın ne kadar doğru olabileceğini sorgulatıyor, yükselmek için yapılan fedakarlıkların en sonunda neye değebileceğini vurguluyor, hayatın hem umut dolu yüzünü hem de hissiyatsız tarafını tarifsiz şekilde aktarıyor.Martin Eden karakteri, okunması ve öğrenilmesi gerekilen bir karakter çünkü hayatın zorluklarından yukarılara tırmanan insanların yaşadığı o derin hissiyatı kendi nezdinde harikulade bir şekilde sunuyor. Martin Eden'ı istediğiniz yerde referans alabilirsiniz, onun hayata bakışını kullanarak sizi anlamayan insanlara kendinizi ifade edebilirsiniz, onun aşka olan tutkusunu sizin aşık olduğunuz insana yansıtabilirsiniz, onun fedakarlıklarını kendi fedakarlıklarınıza bağdaştırabilir, onun hissizliğini onunla beraber paylaşabilirsiniz. Martin Eden çok boyutlu bir karakter ve inanılmaz zengin. Bu sayede her insan onun bir parçasından tutup koparabilir gibi geliyor bana.Bu kitabı okurken bazı seçimleri çok dokundu bana. Bazen onunla beraber oldum, onu destekledim, onun daha mutlu olmasını istedim, onun başarılı olabileceğine inandım; bazense onun karşısında oldum, onun felsefesine karşı çıktım, onun inatçılığını eleştirdim ve beni üzmesinden nefret ettim. Bazı cümleler çok etkiledi beni: Hayatı boyunca sevgi açlığı çekmişti. Sevgiye hasretti. Varoluşunun temel talebiydi sevgi. Ama hiç sevgi görmemiş ve zaman içinde katılaşmıştı. Sevgiye ihtiyaç duyduğunu fark etmemişti bile. Şimdi de bilmiyordu. Sadece sevginin nasıl ifade edildiğini görmüş, yüreği hoplamış ve ne kadar güzeli yüce ve muhteşem bir şey olduğunu düşünmüştü. Bazı cümleler yalnız olmadığımı hissettirdi: Onlardanmışçasına sahte davranışlar içine giremezdi. Bu kisve başarılı olamayacağı gibi kendi doğasına aykırıydı. Sahte ve içtenliksiz davranışlara yer yoktu onda.İnsanlarla tartışırken beni onlardan uzaklaştıran sebebi hatırlattı: Şu güneşin altındaki hiçbir sebep sadece türdeşlerim çoğunluk olarak onu beğeniyor veya beğenmesi gerektiğine inanıyor diye o beğeniyi benim de taklit etmemi gerektirmez. Hoşlandığım ya da hoşlanmadığım şeylerde modayı takip edecek değilim. Çaresizliğimi tattım, istediklerimin neden gerçekleşmediğini öğrendim, insanlara rağmen yapılan fedakarlıkların nasıl sonuç verdiğini hatırladım. O kadar çok şey öğrendim ki bu kitaptan ne anlatsam, ne aktarsam hepsi laf ebeliği olur çünkü Jack London size zaten anlatmış. Kitabı okumadan önce bu kitabın benim için çok özel bir anlamı vardı. Kitap boyunca bu anlamın ne olduğunu bilmiyordum. Sadece bir sebep için okuduğumu biliyordum. Nitekim kitabın sonuna gelince bu sebebin ne olduğunu kavradım. O, Martin Eden'ın hissettiklerini bana aktarmaya çalışmıştı yıllardır... Ve bense bu kitabı şimdi okuyabildim. Nitekim onun aktarmaya çalıştığı bu sözleri aslında o zamanlar bilmiş olsam dahi Jack London'ın kaleminden bir kez daha görünce (öyle bir olgunlukla aktarmış ki!) daha da sersemledim. Ve üzüldüm. Çünkü hayata olan bakış açımdan öütürü hâlâ kabul etmiyorum bu sonu. Genel olarak ama herhangi bir kitap için konuşursak, bir kitap benim için ancak böylesi ölümsüz bir sonla bitebilirdi. Evet, iki ay sürdü bu kitabı bitirmem ama iki ay boyunca acele etmeden tane tane tattığım bu kitabın keyfini tamamiyle yaşadım. Belki de bazı kitaplar zaman istiyordur, ne dersiniz?"}, {"userName": "Werner", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/903390-werner", "userReview": "In my combination review of The Call of the Wild/White Fang, I made the comment (echoing a common critical axiom) that London. like some other Naturalists, was better at portraying animal characters than human ones. That judgment was based on a prior reading of five of his novels and a number of short stories. But after reading this novel, it's a judgment that has to be substantially revised; there are no animal characters at all here, and his job of characterization is outstanding. To be sure, the title character has a lot of London himself in his background and personality; but they aren't clones of each other, and the other important characters are vitally real as well.This is straightforward general fiction in the Realist-Naturalist tradition, set mostly in the author's native stamping grounds of San Francisco and Oakland, just across the bay. Published in 1908 (eight years before London died), it draws heavily on his own life experiences to tell the tale of a smart, but ignorant and uncultivated young seaman from a poor family, with no particularly noted talents except brawling and drinking. But when he rescues a wealthy lawyer's son from an altercation with some waterfront toughs, this leads to an introduction to their family --and a powerful crush on the beautiful and cultivated daughter of the house, Ruth. In turn, this propels him into a determination to better himself intellectually and socially, in order to make himself worthy of her, in her eyes and his own. This program takes the form of self-education through reading, especially in the public library and, eventually, a determination to become a writer himself. (Readers who know anything at all about London's life will recognize significant similarities, except that London had no Ruth-equivalent in his own life.) What results from this determination is the substance of the novel.London was one of the greatest storytellers of his generation, and he tells an always absorbing story here. But it's a well-tailored vehicle for serious ideas. Among the areas he explores are the real meaning of love (and its difference from infatuation, etc.); the need to be true to your own deepest aspirations and sense of yourself, not what others tell you to be; and the profound social injustice of that day, with its artificial class divisions and exploitation of the poor by the rich. (And the differences between 1908 and 2017, in those respects, aren't as great as we tell ourselves they are.) His portrayal of the superficiality and hypocrisy of the literary world is scathing (and also far from dated). And he also draws a painfully accurate picture of how few human beings actually use the minds they're endowed with to really look at the world around them with curiosity, to think for themselves and think about some things more basic and important than money and the minutia of daily living; and how many are content to go through life with no more curiosity or thought than cattle, and to distrust or resent anybody else who doesn't. (Despite our dissimilarities in many other ways, I could relate to Martin profoundly on that level, and it raked up childhood memories.)The most central thematic concern here, and probably THE central concern of London's own mind, however, is the inherent conflict between early 20th-century Socialism, with its cooperative ethic and its Utopian dream of conflict-free human brotherhood, vs. the supposedly \"scientifically-proven\" view of life as a Darwinist evolutionary project driven by eternal struggle between the fit and the unfit, in which the order of the day is every dog for himself, to drive evolution to the next rung of the ladder by pushing the inferior to the wall. London was a committed Socialist, and also a committed Darwinist --as with many wholly self-educated people, the first ideas that fell into his relatively fallow mind were embraced uncritically and took up unshakeable root-- but he faced the contradictions between the two, and was hag-ridden by the fear that the dream of Socialist Utopia might be doomed by Nature. Unlike London, Martin rejects Socialism and embraces the Social Darwinist individualism of Spencer and Nietszche --but he argues with Socialists and has a Socialist friend, and is haunted himself by natural human sympathy for the supposedly \"unfit\" and \"inferior\" peons of the class he was born into, which includes friends and family members.While the author has a good vocabulary, the diction here is simpler than that of the first half of the 19th-century --intelligent, but not stilted; any serious reader today could read it with no problem. The occasional passing use of the term \"nigger,\" usually in the authorial narrative voice though from Martin's viewpoint, however, is a problem; these instances could be counted on the fingers of one hand, but they're still offensive. (The Darwinism of that day, which shaped both London and his protagonist, was of course openly racist; we can see echoes of this 30 years later in the writings of H. P. Lovecraft, who couldn't afford college and also substituted self-education by reading, as well --though his racial language isn't quite as insensitive as London's.) We have to, IMO, take a \"warts-and-all\" view of this novel as a product of its time and place. Readers who insist on having a happy, feel-good read, too, should be warned that this isn't one; I think it's an important and in significant ways a rewarding novel, but it's not an upbeat one. But with those caveats, I think a case could be made that while this isn't London's most popular novel, it is in many ways his masterpiece."}, {"userName": "Amaranta", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/34720769-amaranta", "userReview": "“Era un lavoro bello e finito.”Per tutto il libro non ho fatto altro che pensare: come può un uomo come Martin, forza e potenza allo stato puro, innamorarsi di una come Ruth, piegata ai voleri di una famiglia borghese e senza volontà? Può perché deve. Perché lui ha fame d’amore e scopre negli occhi di lei la possibilità. Martin è un uomo di mondo, ha viaggiato fino ai confini della terra nonostante sia giovane, ama la vita, le donne, è forte e il lavoro non lo spaventa. Eppure è negli occhi di lei che trova di che dissetarsi di quella sete che non ha requie. E non è per migliorare se stesso che comincia a studiare ma perché sa di poterlo fare, di essere capace di arrivare dove altri sono arrivati. La sua è una tacita sfida: raggiungere l’impossibile. Ruth non ha mai amato Martin. Ha amato il suo riflesso negli occhi di lui, quel fuoco che la sua pelle emana nel suo mondo di gelo e compostezza. Lui è un soffio di aria nuova, è come una spugna che assorbe conoscenza, e vorrebbe plasmarlo a suo modo. Ma qualcosa va storto. L’allievo, ancora una volta supera la maestra, e va oltre. E quell’abisso che prima li divideva a favore di Ruth adesso si ribalta. Martin non viene più compreso perché è arrivato ad un grado di conoscenza che va oltre quella gretta piccola borghesia di cui lei fa parte. Il suo studio disperato, una volontà di ferro, il credere fermamente in se stesso senza mai cedere fanno di lui quasi un superuomo, la sua è volontà di potenza, come dice Nietzsche, che tende a superare se stesso continuamente. Scrive, non ha di che mangiare ma scrive. Non ha come coprirsi, ma scrive. Perde i suoi pochi beni più volte impegnati ma continua a scrivere, in un delirio febbrile che a tratti lo rende pazzo agli occhi degli altri. Martin è un uomo capace di tutto. E lo dimostra al mondo. Ma il prezzo della conoscenza è altissimo per lui, senza scampo.  “ Aveva navigato in terre lontane, troppo lontane per ritornare. Era deluso da tutto. Si era trasformato in un estraneo.” . Il gelo che prima avvolgeva Ruth diventa parte integrante della vita di Martin adesso. E’ un marinaio di cultura, che non può più stare con i marinai, e non può vivere con i borghesi. E’ un pesce fuor d’acqua e se ne rende perfettamente conto. Il libro ha una profonda spaccatura. Un prima solare, in cui tutto è luce, conoscenza, bellezza, musica che incanta e in cui Martin si inebria senza pensieri fra una macchia di ciliegia e un pomeriggio al sole. E un dopo. Come una nota stonata che suona lenta, malinconica, bassa che lo avvolge in pensieri tristi, dolorosi, faticosi.  “Era senza mappa nè timone e non aveva alcun porto da raggiungere. Abbandonarsi alla deriva, vivere il minimo indispensabile, era proprio vivere che lo faceva soffrire … la vita lo infastidiva e lo annoiava e il tempo era una vera tortura”  E’ come se Martin bruciasse in un soffio il suo “ tempo vitale” con quelle giornate spasmodiche passate sui libri, quelle nottate insonni, e adesso non ci fosse che un corpo vuoto senza più forze. La vita lo vuole fino alla fine. Ma la sua volontà è più forte. https://www.goodreads.com/photo/user/..."}, {"userName": "Coloma", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/33957182-coloma", "userReview": "MAGNÍFICO. Es un libro tan especial y maravilloso que me cuesta describir las bellísimas sensaciones que me ha creado. En muchas ocasiones he leído con un nudo en la garganta, de tanta emoción que creaba con sus palabras. Cuestionando la sociedad, la política, la cultura y la propia vida en sí, esta historia es esencial.London es MUCHO más que Colmillo Blanco (genial libro también, por supuesto); Jack London es un grandísimo escritor y contador de historias y, desde hoy, uno de mis favoritos sin duda. Seguiré y seguiré con él.Leed Martin Eden, por favor ❤"}, {"userName": "Sergey Vologin", "userReviewDate": "Dec 05, 2013", "userURL": "http://www.goodreads.com/user/show/4613851-sergey-vologin", "userReview": "Так жалко, что в итоге общество превратило сильного яркого человека в ленивца, человек сгинул , а все эти люди, которые участвовали в его сломлении, дальше живут Это меня больше всего бесит - общество постоянно тебе говорит как делать , но оно быстро о тебе забывает, когда все идет плохо . Так было и когда он писал книги, так и в конце жизниСложно все выразить словами, Но столько вещей знакомых в книге встретилось, и ко всем мыслям я пришел самИ удивительно что я не первый кто борется в голове с этим проблемами , причем книга написана около 100 лет назад и выражает то, что копилось в людях давно !Даже моментами вспоминаю себя - до вуза постоянно чем то занимался, писал стихи , песни , увлекался разными вещами , серьезно любил , а теперь ?Не было ни одного незнакомого ощущения, которое испытывал мартин. Вот все действительно жизненно , и это наверное даже успокаивает . В книге все это систематизированно и описано, а у меня в голове это просто каша мыслей, и я уже думал я просто больнойКороче, в этом году много хорошего прочел, но эта книга для меня книга года , если не больше. Столько цитат не выписал никогда , столько знакомых чувств для меня не описывал никто из писателей. Буду читать Лондона дальше , хотя изначально книга тяжело шлаЭту книгу надо давать читать людям в 18-19 лет, и смотреть на реакцию - если они узнают себя в Мартине, согласны со всем - молодцы, они на правильном пути . Если они ничего не понимают - это очередные зомбированные обществом люди."}, {"userName": "Nesli", "userReviewDate": "Aug 25, 2015", "userURL": "http://www.goodreads.com/user/show/17852948-nesli", "userReview": "Martin Eden, okuyucuyu kendisiyle birlikte büyüten bir karakter. Büyümenin pek de matah bir şey olmadığını ve hayattan ne beklendiği ya da hayatla ne yapmak istendiği konusunda yaşanılan karmaşanın normalliğini anlatış şekliyle sizi yatıştırıyor ancak zamanın insandan götürdüklerini de çok canlı görüntülerle vererek korkutuyor da."}, {"userName": "Sarah", "userReviewDate": "Aug 02, 2012", "userURL": "http://www.goodreads.com/user/show/4496242-sarah", "userReview": "Okay, first I will discuss what I really did like about this book.Alright, when I first started reading it, I was very touched by the loving connection that the main character (Martin Eden) had with Ruth. It was very sweet, and at times it reminded me of my own relationship with my boyfriend, which made it endearing and all the more special to read. Jack London wrote of how Ruth would feel relieved from her studying at the university to see Martin, and how his presence rejuvenated her and gave her a better sense of being. I really really loved that. But, I was aware of the premise (Martin Eden: a guy struggling to become an accomplished and famous writer), so I quickly brushed away the idea of it being a love story, and I was totally cool with that! To be perfectly honest, though, the EARLY relationship between them was the only part of the book I was really fond of, which happened to be only like the first 100 pages.As the story progressed, Martin started to annoy me, and the plot became very redundant and, frankly, it bored me. I just..I think what Jack London lacks in this novel is the ability to make the reader (maybe I shouldn't generalize, so we'll just say me) feel any sort of connection with the characters. I did mention, however, that initially I did feel related/connected to Martin and Ruth's relationship, but later it felt very unfulfilled. It may seem like I'm just bashing this book..I promise you, it's not a bad read. It's just..well, I feel indifferent. I know what Jack London was trying to accomplish, and that's why I granted it 2 stars instead of 1. I get it. The struggling writer who works so hard and so long to achieve his dream, only to find that fame and fortune is not all it's cracked up to be. It's just...alright, I'm going to say it: it's cliche. Especially the ending. I don't know. I'm wasn't pleasantly surprised or anything; I knew it was coming. Blah.The writing is beautiful (another reason I couldn't bear to give it 1 star), and London is a genius at transfixing you with his words--but, that can only take you so far. The story was lacking, in my opinion."}, {"userName": "Esma Tezgi", "userReviewDate": "Mar 03, 2016", "userURL": "http://www.goodreads.com/user/show/29297440-esma-tezgi", "userReview": "Martin Eden son zamanlarda okuyup en çok sevdiğim, beni edebi anlamda tatmin eden ve kalıcı izler bırakan mükemmel bir kitaptı. Şimdiye kadar okumadığım için hayıflanıyorum ama olsun çok güzel bir zaman denk geldi, yazarın diğer kitaplarını da bir an önce okumaya çalışacağım. Martin Eden kesinlikle okunmasını tavsiye ettiğim bir kitap oldu, umarım okumuşsunuzdur ya da okur beğenirsiniz.Ayrıntılı yorum; Yorum Atölyesi'nde"}, {"userName": "Sümeyye Kip", "userReviewDate": "Jul 23, 2016", "userURL": "http://www.goodreads.com/user/show/54037618-s-meyye-kip", "userReview": "Bu kitap hakkında sayfalarca yorum yazabilirim aslında. Ama mümkün olduğunca kısa tutmaya çalışacağım. Jack London okuma isteği ve arkadaşım Esma’nın önerisiyle başladım bu kitaba. İyiki de başlamışım diyorum. Kitapta baş karakter martin Eden’ın hayatı, sevinçleri, hayalleri, tutkusu, aşkı konu alınmış. Kitap bir yönüyle aşk romanı gibi görünse de ve başlarında ciddi bir aşk romanına hazırlansanız da, aşk teması kitabın ana fikrini ortaya çıkarmak için kullanılan bir araçtan öteye gidemiyor. Kitapta Martin Eden’in aşık olduğu anda başlayan yazarlık tutkusu ve bu uğurda insanlara, sevdiği kıza ve inanmayan herkese verdiği mücadele konu alınmıştı. Bu kaleme alınırken aynı zamanda o dönemin toplumu, burjuvaların dışarıdan en aydın gözüken boş yaşantısı, basmakalıp fikirleri, insanları etiketleyen bakışları ve sınıf ayrımları eserde öyle iyi dile getirilmişti ki bir nevi o dönemin şartları hakkında birçok şey öğrenebileceğiniz, burjuvalığı yakından tanıyabileceğiniz öğretici bir eserdi aynı zamanda. İnsanı düşünmeye sevk eden felsefik yönü de vardı. Aşk, burjuva hayatı, yazarlık, felsefe hatta bir miktar da politika ile harmanlanmış çok kaliteli bir eserdi. Kitaptaki dil, betimlemeler o denli güzel ve akıcıydı ki onun güçlü bir kalemin elinden çıktığı çarçabuk anlaşılıyordu. Daha ilk sayfalarda diline hayran olarak okudum. Öyle güzel tasvirler vardı ki birçoğunu alıntılamadan duramadım da.  Kitapta en hoşuma giden yerlerden biri ise insanı olduğu gibi tüm gerçekliği ile ele almasıydı. İnsanların bencilliği, üne-paraya olan düşkünlüğü, sahtekarlıkları, sığlıkları kitabın ana fikirlerinden biriydi. Kitapta verilmek istenen en güzel mesajlardan biri de son sayfalara serpilmiş insanların gösterişe olan düşkünlüğü ve etiketlerdi. Bir insanı o olarak ve o olduğu için sevmeden bambaşka kalıplara girdikten sonra ona değer verenleri anlatıyordu. İnsanı içi dünyasına doğru bir yolculuğa çıkarıyordu. İlk başta bambaşka bir tema ile başlayıp kitabın sonuna kadar insanı farklı farklı düşüncelere sevk eden bir yönü vardı. Kitapta Martin’le birlikte umutlandım, Martin’le birlikte savaştım, insanları onun gözüyle sevdim, insanlardan onun gözüyle nefret edebildim. Karakterde bazı yerlerde kendi iç sesimin yankılarını duydum. Empati kurmaktan çok daha öteye geçtim. Sonu da her ne kadar son sayfalara doğru ne olacağını sezinlemiş olsam bile yine de şaşırtıcıydı. En azından sonundaki basit ve tek kelimeyle açıklanabilecek bir olay yazar tarafından öylesine güzel kurgulanmıştı ki, sonu bile benzer sonlardan çok daha etkileyici olmayı başarabildi. Üstelik Martin’in yazarlık mücadelesi anlatılırken bu kadar iyi anlatılmasının ardında Jack London’ın hayatından esintiler hissettiğimi de es geçmeden söylemem gerekiyor. 470 sayfaya yakın bu eserde bu sayfaların çok ötesinde insanlık için mesajlar gizli aslında. Günümüz dünyası burjuvadan farklı olsa da günümüz dünyası ve insanlarını da yansıtan bir eser olduğunu düşünüyorum. Belki de günümüzde “markacılık” o dönemde olmadığı kadar had safhada bile olabilir. Kitapta meselenin okul ve eğitimden, diploma ve sertifikalardan değil insanın kendini eğitmesinden geçtiği bambaşka bir cehalet ve eğitimli insan portresi de çıktı karşımıza. Her yönden dolu dolu bir eserdi. Mutlaka okunması gerektiğini düşünüyorum."}, {"userName": "Chrissie", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "Most of Jack London's books are about nature and life in the wild. This is not! It is said to be a semi-autobiographical novel. The setting is San Francisco at the turn of the 20th century. The central protagonist, Martin Eden, first a working-class seaman, is at twenty now struggling to educate himself and become a writer. He has fallen head-over-heels in love with Ruth Morse. Martin has been invited to her home by her brother because Martin had saved his life. Martin and Ruth are of completely different classes and backgrounds, but an attraction is there. She begins tutoring him and from there their relationship develops. The conversations between the two are cute. They made me smile. He knows nothing of proper etiquette. She is naive, albeit three, four years his senior. His strength, vitality and richness of experiences have an undeniable attraction to her. He is drawn by her knowledge and a deep-seated physical attraction. He reasons he will educate himself and will in so doing make himself worthy of her. Her parents are of course not pleased. We watch how their relationship develops and the changes that occur in each of them. The novel is more than a love story; it is a character study. It is a study of Martin’s path toward becoming an author, the development of both his writing abilities as well as his philosophical and political views.Martin is very much of an individualist, and where this leads him is what you will think about. That London was a socialist and yet Martin Eden an individualist is not incongruous if one considers how the book ends.I was caught up in the tale. One vividly feels an author’s struggle to get that first book into print and what an author must go through to become acknowledged! After success is achieved, how does one feel then? Bliss or anger? Or does one feel deceived?The writing varies from being strong and direct to wordy and overblown. This can perhaps be explained by the transformation that takes place in Martin.I do feel the story should have been tightened. Each step/event in Martin’s life conveys a message and explains why he thinks and does what he does, but each is drawn out a little bit too long.The audiobook I listened to was narrated by Andrew Garman. I think he did a truly fantastic job. First of all, it is easy to follow and read at a perfect speed. What is remarkable is Garman’s ability to capture the mood of disparate events - the excitement of intellectuals debating, a brawl or the flirtatious banter between Ruth and Martin. The tone of an educated bourgeoise, a drunk, a laundry worker in a hotel, or an immigrant woman struggling to make ends meet are all perfectly captured.I am certainly glad I read this, and I do recommend it to others. One views Jack London with very different eyes knowing that he has written this book too, so very different from all his others."}, {"userName": "Monica", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/69991689-monica", "userReview": "Non si può rimanere indifferenti di fronte alla vastità di questo romanzo.Libro fortemente autobiografico che affronta temi quali l'integrazione, l'evoluzione sociale e culturale di un semplice marinario che, per amore di una donna, decide di migliorarsi e rendersi accettabile ai suoi occhi e a quelli della sua famiglia.La determinazione è molto forte in Martin Eden, è il fulcro di tutte le sue azioni, terminata quella, come una candela che si spegne lentamente, termina anche ogni sua spinta vitale, ogni emozione.La sua scalata inizialmente sembra un po' forzata, recuperare anni di studio rubando ore di sonno alla vita sembra essere una un'impresa puramente chimerica, il passaggio dall'ignoranza alla superbia rende il tutto ancora più stridente agli occhi di chi legge, pensieri fugaci subito dimenticati con il procedere della lettura quando tutto sembra diventare plausibile.Ruth, la giovane donna di cui si invaghisce, la sua prima insegnante, come una moderna Frankenstein sembra guardare impotente la sua creatura, plasmata a suo gusto, sfuggirle di mano ed ergersi libera al di sopra di tutti loro, colti e bigotti benestanti.La fame di sapere, la necessità di scrivere, spingono Martin ad una febbrile necessità di espellere tutto ciò che ha appreso ed elaborato. Privo di freni inibitori non esita ad esprimere il proprio pensiero, anche a rischio di denigrare coloro che prima ammirava. Iniziano mesi di duro lavoro, più mentale che fisico, un lavoro non riconosciuto e sminuito che lo spinge sull'orlo dell'indigenza e dell'emarginazione.Quando leggi un libro e il suo personaggio inizia ad insinuarsi nella tua vita come una persona reale, quando nella tua quotidianità inizi a chiederti, più spesso del normale, \"cosa farebbe Martin adsso?\", beh allora capisci di avere fra le mani un grande libro.Le vicende di Martin Eden mi hanno costantemente ricordato quelle di Kerouac, di lui si dice che  si addormentò ubriaco e si svegliò famoso quando ormai tutto il suo interesse era andato scemando nell'indifferenza e nella noia.Così Martin Eden assapora il retrogusto del successo arrivato troppo tardi, con amarezza scopre l'ipocrisia delle persone che aveva desiderato compiacere, con apatia cerca la solitudine e l'oblio.Leggendo il libro mi sono ritrovata ad augurargli la fine scelta come unica via di fuga, salvo poi rimanere scioccata nel leggere le ultime drammatiche e agghiaccianti pagine. Così tu ti elevi dal fango, Martin Eden, e purifichi il tuo sguardo in una grande luce, e ti sollevi fino alle stelle, facendo quel che tutta la vita hai fatto, uccidendo in te \"la tigre e la scimmia\", e lottando per la conquista della più grande eredità di tutte le forze dell'universo."}, {"userName": "Açelya", "userReviewDate": "Jul 31, 2016", "userURL": "http://www.goodreads.com/user/show/58045056-a-elya", "userReview": "Gerçekte bir kitap karakteriyle tanışma hakkımız olsa, tanışmak isteyeceğim ilk kişi Martin Eden olurdu. Jack London, ustalığını kişi tasvirlerinde de gösteriyor ve mükemmel bir Martin portresi çiziyor gözümüzde.. Onu seviyorum ve bu beni mutlu ediyor. Mutluluk ulaşılmazın hazzı değil midir zaten? Martin için de bu böyleydi. Ruth'a tutkuyla bağlıydı çünkü ona ulaşmak zordu. Ama ulaştığında ve gerçekleştirmediği bir amacı bile kalmadığında anlıyor yaşamak için de amacının kalmadığını... Hayatı çekilir kılan bu hedefler silsilesidir. Kimilerini gerçekleştirip daha büyük hedefler peşinde koşmanın doyumsuzluğu, kimilerine ise ulaşamamış olmanın hırsıyla koşulur hayat yolunda. Ama yolu tamamlayanların sayısı pek azdır. Kimisi ise sonun aynı hiçliğe çıkacağını bildiği için başlamadan sonlandırır. Hayat garip, hangisinin daha iyi olacağını kim bilir. Belki gerçek mutluluktur cahillik."}, {"userName": "Hussain Hamadi", "userReviewDate": "Jul 13, 2016", "userURL": "http://www.goodreads.com/user/show/22979218-hussain-hamadi", "userReview": "سوف أقوم بتقييم الرواية على قناتي \" مع كتاب\" لاحقا يسعدني مشاركتكم واشتراككم على القناة"}, {"userName": "Sandra", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/11916501-sandra", "userReview": "“Volli, sempre volli, fortissimamente volli”Questo è il ritornello che mi ha aleggiato in mente mentre leggevo questo romanzo bellissimo, il cui finale è tanto bello quanto sconvolgente. Non anticipo nulla, solo che pochissimi libri mi hanno fatto tanto male come le ultime pagine di Martin Eden, altro che un pugno allo stomaco. Sono stata indecisa sulle stelle, perché arrivata a un certo punto stavo cominciando ad annoiarmi, forse una maggiore brevità mi sarebbe piaciuta di più, ma, facendo una considerazione finale, penso di dargli il massimo della valutazione sia perché il finale è magnifico, sia perché le tematiche toccate da London sono così tante ed importanti, e oltretutto trattate con una scrittura semplice e trascinante.Perché quella frase di Alfieri? Perché come lo scrittore piemontese si fece legare alla sedia per non distrarsi dallo studio, così il giovane Martin, grazie al fortunato incontro con Ruth, giovane studentessa universitaria che lo introduce nella sua famiglia in cui si coltivano le arti, è nutrito da una forza di volontà titanica, una ostinazione così forte ad elevarsi dalla sua condizione di marinaio ignorante per farsi una cultura, da passare notti insonni sopra i libri dopo aver lavorato duramente durante il giorno, leggendo quanto più possibile, e scrivendo immenso materiale tra racconti, poesie e saggi. L’amore per la Bellezza (anche se Martin si illude che sia l’amore per Ruth, nata in una ricca famiglia borghese, ad alimentare l’energia interiore che è il motore della sua volontà) e per l’Arte lo esaltano, lo fortificano e lo spingono sempre oltre, a volersi misurare con coloro che gli sono superiori per ceto sociale, fino a giungere alla triste evidenza che la convinzione in lui radicata secondo cui la superiorità sociale si accompagni con la superiorità intellettuale è del tutto errata: il mondo che lo circonda, i ricchi borghesi americani che frequenta, le riviste letterarie cui spedisce i suoi scritti, i giornalisti, i direttori dei giornali sono tutti un gregge di perbenisti, che confondono la cultura con la prosopopea di vuote e superficiali conoscenze basate solo su luoghi comuni. Come è sostenibile il conflitto tra la personalità prepotente di Martin, consapevole della sua superiorità, nutrita di profonde conoscenze e rinforzata dall’esperienza della vita vera, fatta di sacrifici, fatiche, sconfitte e lotte cruente, con la società arida e cinica che lo circonda, che si basa sull’etica capitalistica del “più guadagni più vali”? La fama, il successo editoriale ed i soldi mostrano impietosamente a Martin quanto grande sia la sua solitudine e quanto il cammino da lui intrapreso con travolgente entusiasmo sia stato solo un’illusione. La soluzione finale è quella cui lo scrittore ha preparato il lettore gradualmente, accompagnando le riflessioni del protagonista a mano a mano che le illusioni sul riconoscimento del valore dell’arte cadono miseramente, ma non avrei immaginato che fosse descritta in tal modo, perfetto affinchè il motto “volli, sempre volli, fortissimamente volli” che era nella mia testa dall’inizio riaffiorasse ancora una volta: perché Martin Eden è forza di volontà fino alla fine."}, {"userName": "Aslı Can", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/33590272-asl-can", "userReview": "Cidden insana nüfus ediyor."}, {"userName": "Aprile", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/8294931-aprile", "userReview": "Volere è potere, ma…  Complicato scrivere qualcosa a proposito di Martin Eden, Jack London è stato così esaustivo. La storia si dipana seguendo uno stretto ordine cronologico ma si sente l’intervento continuo del narratore che, per voce di Martin, commenta con il senno del poi i fatti, le azioni e anche i pensieri ... (continua) Complicato scrivere qualcosa a proposito di Martin Eden, Jack London è stato così esaustivo. La storia si dipana seguendo uno stretto ordine cronologico ma si sente l’intervento continuo del narratore che, per voce di Martin, commenta con il senno del poi i fatti, le azioni e anche i pensieri più reconditi del protagonista e quelli meno reconditi di chi entra in rapporto con lui, li fa confluire in vari quadri rappresentativi che mirano a supportare la sua tesi. Grande Bildungsroman che – arrivato al suo apogeo – non trova altra soluzione che la distruzione di tutto ciò che è stato sovrapposto strato dopo strato. Lo studio matto e disperatissimo di Martin ha come esito la sua misantropia dovuta non ad un senso di superiorità senza motivazione, ma alla realizzazione del fatto che le persone che lo circondano, il mondo borghese ‘acculturato’, non ha realmente metabolizzato le informazioni derivate dall’istruzione, ma queste sono rimaste in superficie, ripetute meccanicamente, non vissute, non messe a frutto perché non comprese da persone che si adeguano a standard che non vengono mai messi in discussione da teorie personali. Contro questo parlare e pensare in generale combatte Martin. E’ disgustato dal fatto che solo la ricchezza economica alla fine raggiunta sia valida a renderlo degno agli occhi del mondo borghese che non esita a rincorrerlo dopo averlo scacciato, non rendendosi neppure conto che in tal modo si umilia. Martin si chiede spesso come gli uomini della società bene – alla quale guardava con ammirazione quando era ambizioso ma ignorante – abbiano potuto sprecare l’opportunità – per loro facile, dato che possedevano i fondi per crearsela - che l’istruzione dà, si chiede dove abbiano potuto nascondere le loro nozioni dato che appaiono così ottusi e pigri al ragionamento. Crolla un mondo, aveva sempre ritenuto che l’opportunità di studiare risultasse consequenzialmente nella capacità di comprendere e ragionare con mente propria. Ma così non è. Si sente attorniato da gente superficiale e piena di sé. Al tempo stesso, i suoi vecchi compagni di mare, che non disprezza perché incolti ma veri, non possono più essere il suo mondo, Martin è cambiato, il gusto della birra è cambiato ora che ha assaggiato lo champagne. Vive in un limbo, solo Brissenden è degno di rispetto, però soccombe alla sua lucidità e consapevolezza estrema prima che Martin possa arrivarci egli stesso: nulla di ciò che potranno mai scrivere sarà apprezzato per il suo valore intrinseco, non verrà compreso, saranno solo perle ai porci. La consapevolezza di non poter trovar pari, porta Martin a cercare nuovamente il mare. Il raggiungimento della formazione chiede un pegno, bisogna pagar salato per la crescita, aprire gli occhi fa male ma si può accettare e proseguire cercando con il lanternino le anime affini. La condivisione non è frequente, ma è possibile. Martin è troppo stanco per farlo, la sua forza di volontà si è esaurita quando combatteva contro la fame per un ideale."}, {"userName": "Giulia", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/34398690-giulia", "userReview": "Mi sono presa un po' di tempo per scrivere qualche riga su questo libro. Ci ho messo un mese per leggerlo cosa insolita per me, ma alla fine non ho potuto dire che non fosse un capolavoro. La storia non è delle più avvincenti, e da qui la mia lentezza nel leggerlo e nemmeno delle più felici ma mentre la leggevo ho sentito che era REALE, che il sudore sulla fronte di Martin, i suoi sogni le sue speranze, l'ottimismo, le notti insonni, le delusioni dovevano essere stati vissuti da qualcuno come lui che ha lottato disperatamente, per amore di una donna non degna di lui o, come mi piace credere, per amore di se stesso, per diventare un santo che si è elevato dal fango, un vero miracolo. Lo stile narrativo è una cosa angelica inutile spenderci parole."}, {"userName": "Esrafurkanyigit", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/53277239-esrafurkanyigit", "userReview": "Bir roman kahramanı ile tanışma imkanım olsaydı bu martin eden olurdu kesinlikle!"}, {"userName": "Ezgi", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/33926495-ezgi", "userReview": "Diğer Jack London kitaplarına kapıyı açtı. \"Her şeyin derinine inen bir insan; ama derinliklerde gördüğü şeyler onu öylesine korkutmuş ki bunları hiç görmediğine inandırıyor kendini. \" Oda Yayınları /s. 207"}, {"userName": "Rosanna ", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/38531653-rosanna", "userReview": "Finale splendido! ...e triste e realistico e inevitabile..."}, {"userName": "Haktan", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/29938415-haktan", "userReview": "Klişe mi olacak bilmiyorum ama yine de söyleyeceğim: Bu kitapta kendimden çok şey buldum. Jack London bu romanında tesadüfen dahil olduğu bir burjuva yaşamının büyüsüyle ve tabii aşkının da etkisiyle denizleri bırakıp şehir hayatına uyum sağlamaya çalışan, kendini yetiştirmeye, yazar olmaya kararlı bir işçinin hikayesini anlatıyor. Taşradan büyükşehire 'büyük adam' olmaya gelmiş biri olarak, Martin'i kendime oldukça yakın hissettim. Heveslerini ve hayal kırıklıklarını ben de tecrübe ettiğim için kolayca hikayeye dahil oldum ve zevkle takip ettim. Romanın konusunun sıradan olduğu söylenebilir. Sınıf ayrımı, üst sınıfın alt sınıfı küçümsemesi, alt sınıfın ezilmişlik hissi ve üst sınıfa karıştığında üstün bir yanlarının olmadığının hatta eksiklerinin bulunduğunun fark edilmesi vs.. İşte bu sıradan sayılabilecek mizansene karşın oldukça keyifli, önemli sosyal ve insani tespitler barındıran çarpıcı bir kitap. Özellikle son bölümlerde kitap bende bir terapi etkisi yarattı çünkü Martin tam da benim duygularıma tercüman oldu. Şu an bir Mariposa bulup yolculuğa çıksam mı diye düşünmekteyim.. Bence okunmaya değer bir kitap.Not: Kitabın otobiyografik öğeleri, içinde geçen yazar ve kavramları öğrenmek ilginizi çekerse İş Bankası yayınlarından çıkan basımını tavsiye ederim. Çevirmen üşenmemiş 145 tane not ekleyerek kitabı daha iyi anlamamıza yardımcı olmaya çalışmış."}, {"userName": "Simona", "userReviewDate": "Oct 17, 2013", "userURL": "http://www.goodreads.com/user/show/6222130-simona", "userReview": "La meta vale il viaggio? E' la domanda che si pone Martin Eden, l'alter ego di London. Ma chi è Martin Eden? Martin Eden è un marinaio dalla vivida intelligenza, un uomo che ha solcato i mari di ogni porto, un uomo che, anche grazie all'ossessione e alla passione amorosa che nutre verso Ruth, una giovane rampolla dell'alta borghesia, vuole elevarsi e far parte della società e del mondo a cui lei appartiene. Un romanzo di grande intensità, di grande verità. La storia di un uomo, un piccolo eroe dei nostri tempi, che, riesce finalmente, dopo molte rinunce e ostacoli a realizzare il suo sogno, diventando uno scrittore di successo, ma rimane disgustato dal mondo a cui ambiva, scoprendo che non è tutto oro ciò che luccica. Un uomo che va incontro al suo fallimento, alla delusione e alla disillusione, a un mondo privo di scrupoli, un mondo che lo porterà pian piano alla distruzione e alla lenta morte interiore dei suoi sogni e delle sue speranze."}], "description": "The semiautobiographical Martin Eden is the most vital and original character Jack London ever created. Set in San Francisco, this is the story of Martin Eden, an impoverished seaman who pursues, obsessively and aggressively, dreams of education and literary fame. London, dissatisfied with the rewards of his own success, intended Martin Eden as an attack on individualism and a criticism of ambition; however, much of its status as a classic has been conferred by admirers of its ambitious protagonist.Andrew Sinclair's wide-ranging introduction discusses the conflict between London's support of socialism and his powerful self-will. Sinclair also explores the parallels and divergences between the life of Martin Eden and that of his creator, focusing on London's mental depressions and how they affected his depiction of Eden.", "title": "Martin Eden", "url": "http://www.goodreads.com/book/show/3779513-martin-eden", "average": 4.4, "cover": "https://images.gr-assets.com/books/1348768551l/3779513.jpg", "reviews": 865, "authors": [{"url": "https://www.goodreads.com/author/show/1240.Jack_London", "name": "Jack London"}], "type": ["Classics", "Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/3779513-martin-eden", "http://www.goodreads.com/book/show/929782.Martin_Eden", "http://www.goodreads.com/book/show/19201861", "http://www.goodreads.com/book/show/23358155-martin-eden", "http://www.goodreads.com/book/show/23674006-martin-eden", "http://www.goodreads.com/book/show/27230063-martin-eden", "http://www.goodreads.com/book/show/35893032-martin-eden", "http://www.goodreads.com/book/show/20887385-martin-eden", "http://www.goodreads.com/book/show/24439232-martin-eden", "http://www.goodreads.com/book/show/35477859-martin-eden", "http://www.goodreads.com/book/show/22041039", "http://www.goodreads.com/book/show/9671484-martin-eden", "http://www.goodreads.com/book/show/15710194-martin-eden", "http://www.goodreads.com/book/show/9669053-martin-eden", "http://www.goodreads.com/book/show/18741365-martin-eden", "http://www.goodreads.com/book/show/1852.The_Call_of_the_Wild", "http://www.goodreads.com/book/show/43035.White_Fang", "http://www.goodreads.com/book/show/37677.The_Call_of_the_Wild_White_Fang", "http://www.goodreads.com/book/show/43049.The_Sea_Wolf", "http://www.goodreads.com/book/show/43037.The_Call_of_the_Wild_White_Fang_and_Other_Stories"]}