{"ratings": 53, "userreviews": [{"userName": "Lakshmi C", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/7678185-lakshmi-c", "userReview": "This book is a great addition to the YA Paranormal genre. Marvin was easy to relate to, he had more problems than the average teenager and was trying to cope on his own.What I liked : 1 MarvinHe was a teen who had a lot of trouble on his hands. He inherited the ability to see the dead but viewed it as a curse. His personal life was messy and he had no support system. He had the tendency to say the wrong thing at times which made him endearing. 2 StellaShe was suffering from amnesia, which makes both Stella and the reader clueless at first. She was funny and interesting, a great partner for Marvin. When you finally learn about who she was, its shocking and things take a dangerous turn.3 PawnbrokerThe concept was interesting - where a person could get rid of his memories and nightmares. The act sounds reasonable but the consequences were horrible. 4 MoghadorThe author has described the town really well. You can picture a dark, evil town, crawling with spirits and covered in fog. The setting dominates the story, takes you into unfamiliar territory and builds tension. What I didn't like : 1 Inconsistent pacingThe introduction to Marvin's world was perfect. You learn about why Marvin is the way he is, which helps you understand him. Suddenly the pace slows to such an extent, it would make a tortoise proud. After that, it's fast again, with everything falling into place conveniently.2 GhostsMarvin ignores the ghosts because they need him to deal with their unfinished business. But none of the ghost characters were developed, which seemed a bit odd to me.*The Graveyard Issue* Someone would wonder why Marvin seeks refuge in the graveyard, as there are lots of spirits waiting for him there. I think Marvin used the graveyard as a safe place, where he could ignore the dead and get away from the living.I received this ARC in exchange for an honest review"}, {"userName": "Tammie", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/3506989-tammie", "userReview": "I received a copy of this book from the author in exchange for a review.Even though Marvin's Curse isn't a very long book, just over 200 pages, I was impressed with how the author was able to make me feel a connection to Marvin and the rest of the characters. I knew who they were with very little description. The story was original and captivating and I was sucked into it pretty much from the beginning. I'm not sure if this is a stand alone or if there will be a sequel. It would work either way, but I would love to read more about Marvin and Stella."}, {"userName": "Clair", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/3333119-clair", "userReview": "Disclaimer: A digital copy of the book was provided by the author in exchange for an honest review.A little over a year ago, I read Kendare Blake's excellent Anna Dressed in Blood. Only a few months ago, I read its less-than-stellar sequel, Girl of Nightmares. I bring up these two books because that's what Marvin's Curse reminds me of the most – boy meets girl, but the girl is a ghost who must deal with the trappings of Hell. However, while Cas in Anna Dressed in Blood was well-rounded, and Anna was a nice girl who could become extremely terrifying, Marvin and Stella... eh...Marvin is supposed to be a kid with a lot of issues. His father died recently, and seemed to be replaced immediately with a new stepfather, who wanted them all to uproot to a new house to make the transition easier. Marvin attends a special school, has been in therapy, takes medication, and he has the particular burden of being able to see ghosts, who usually try to attack him. Or at least make him listen to their woes. Oh, and the new house overlooks a graveyard.After an argument with his parents, Marvin storms outside to find a girl his age hanging around in the graveyard. She carries all the hallmarks of being one of the spirits that bother Marvin every waking moment, but for some strange reason, she has no memories whatsoever. The only clue to her backstory is a business card for a pawnbroker's shop in the realm of Moghador, which happens to have a gateway right in that very graveyard. Marvin resolves to help Stella regain her memories, and also keep the truth away from her. However, it turns out that Stella may have a lot to do with Moghador, and that mysterious pawnbroker's.One of the strengths of Marvin's Curse is its main character. Marvin is initially presented as angry and lashing out for little reason, but soon enough the pieces start to fit together. He may be irrationally angry at his stepfather, and may lash out at anyone or anything that comes too close, but this behaviour makes sense for somebody who's in the second stage of grief, since it's hinted that Marvin's father only died recently. Ever since his father's death, Marvin's been able to see ghosts and spirits, and for somebody who's only just getting over a death, having ghosts surround you and describe how they can't pass on and want to use you as a sponge for all their negative feelings would suck. Believe me, I'd be a bit angry as well.As Marvin progresses through Moghador and learns about the dark secrets surrounding Old Kedigan's shop, he does actually grow as a character. Sure, he still has a short fuse, but he learns that his behaviour sometimes has consequences, and that he has to start taking responsibility. His father's ghost is still around and wants him to take up the family business. The men on Marvin's father's side are all spiritual mediums, and the baton always passes down to the next son. The ghost of his father hasn't passed on yet because he wants to see if Marvin will be alright with his new gift. Stella, on the other hand, is merely okay. She starts off as a confused young woman in a graveyard who decides the designer label in her jeans is as good a name as any. (Stella McCartney, for the curious amongst you.) She gets more and more clues to her identity as the mystery unravels, but I wouldn't say she's the most dynamic character I've ever seen. Stella's still very similar to her first appearance even by the end of the book, and hasn't really learned anything. Well, she's learned about how she died and how she came to be abandoned in the graveyard with no memory, but she hasn't grown as a character in a meaningful way. You'd think learning about all the bad stuff that's happened to her would affect her personality in some way, but it really doesn't. Stella by far has the most terrible things happen to her, but there's no real outward show of these things affecting her. Except yelling: “You pig!” or “You monster!” at Old Kedigan or another demon once in a while, she mostly stays the same. She sees innocent people dying in Moghador, is hit with the revelation that she had some part in it, learns the full extent of the horrors the villain partakes in, and how much he hates Stella that he dragged her into death with him. You know, things that would really shake your foundations.Alright, I'll stop there because I'm repeating myself, but I did find Stella a bit of a weakly-written character. Marvin learns and grows on his journey, and Stella doesn't. The only real thing I can recommend about Stella is that she gets in a mildly funny line once in a while and argues with Marvin like they're a married couple.Another negative is just how juvenile the prose can be at times. This is Debra J. Edwards' first YA novel, and the dialogue and prose just aren't up to scratch for what realistic teenagers would be saying. Real teenagers don't always communicate in snarky quips. Nor should the prose make these silly little asides in the name of comedy. Nine times out of ten, in every single book I've read, a snarky aside is about as jarring as a terrible pun. The equivalent of a boxing glove sprouting out of the page and knocking you for six.Along with snarky asides, there are moments where exclamation points are used rather unnecessarily. Whenever I read a book that has a sudden exclamation point, like: “I saw a figure coming out of the front door. It was Bobby!”, it makes me feel like I'm reading a novel for very young children. So, when Marvin's Curse had a few of these moments (and it did – I unfortunately lost my notes (blame my computer) for how many there were in the first 100 or so pages and got tired of highlighting every time I noticed one), it kind of took away from the reading experience.'Marvin took a deep breath... then another. In his sweaty hand was the St Christopher, quite ironic given where he was. He clutched it tightly as he took a third and final gulp then burst through the doors taking up position in the middle of the room adopting a stance not dissimilar to Peter Pan!' (Page 152)'The chain swung out, the silver catching the light. Go to sleep, damn you![…]THUMP!A large brick by all accounts!'(Page 155)'This man was as wide as he was tall!'(Page 155)'“Oh, that figure,’ said Marvin’s dad, dreamily. ‘She reminds me of your mum...”'Marvin squirmed and shuddered. Too much information!'(Page 195)There's also some really iffy dialogue here and there. Thankfully, it's only really towards the end, but it really cheapens the novel when the villain sounds like some laughable cartoon character who goes: “Mwahaha!” and “This cannot be! You have defeated me!”, whilst the protagonists spout: “You're my father? No! No! That cannot be! That's impossible!” and “How could you!?”For example, check out some of Old Kedigan's last words:‘A twin! I longed for a son. TWO boys they said. Liars! Then on arrival, one dead, one alive. Not a son, just YOU!’(Page 187)‘You know that when you died, I did cry... with relief!’(Page 190)While Old Kedigan never came across as very intimidating to me (since he just seems to be a bitter old man who screams and rants rather than doing anything threatening), I was expecting something rather good out of the ending to Marvin's Curse. Heck, I'd stuck around for a long meandering plot cul-de-sac in which Marvin and co., make a futile attempt to break into his warehouse and steal back some stolen memories. There's quite a few mentions of Old Kedigan even allying himself with a few demons, the most powerful of which being a figure known as Erasmus Flint. Where is Erasmus Flint after Moghador has been released from Old Kedigan's control? He doesn't do anything. He just stands around whilst all of the wayward souls he had in his thrall find their way towards the light. It's not even out of a change of heart or anything like that. Real intimidating, eh?If you are looking for a quick, easy jaunt through a YA paranormal novel, you could do much worse than Marvin's Curse. It has its odd charm here and there, but unfortunately it's let down by some deficiencies in the writing and dialogue, along with a rather unconvincing villain and a less-than-stellar (no pun intended) ending. 2/5.(This review is also available on my blog: http://nessasky.wordpress.com/2013/09...)"}, {"userName": "Victoria Limbert", "userReviewDate": "Aug 10, 2013", "userURL": "http://www.goodreads.com/user/show/8569235-victoria-limbert", "userReview": "Marvin hates that his gift in life is to commune with and help the dead; a gift that passes from father to son for generations. His dad is forced to stay in spirit form to teach his son how to use his gift....though Marvin belies its a curse....before he can move on to the afterlife. Marvin misses his dad terribly and doesnt get along with his stepdad. Like any normal teenager he rebels, runs off and refuses to use his gift to help people. Marvin has had a rough life.Everything changes whem he meets Stella McCartney, a young female ghost who has lost her memories and adds many humourous moments to the book. Marvin wants to help her, but it means using his a Gift he has been trying to ignore for a long time. Seeking her memories from a ghostly market situated beneath an Angel in a graveyard, marvin and stella are thrown in to an adventure of evil spirits, demonic encounters and a twisted tale of murder, lies, secrets and slavery. I really felt for Marvin when he was rebelling and missing his dad and seeking peace from ghosts who needed him to finish their business so they could 'cross-over'. Not only does he lose a dad but gains an unwanted gift. When he starts caring for Stella and helping her, Marvin really begins to grow up and see the good he can do for those who cant move on. The ending of this book was emotional and sweet.All in all a very good read and an enjoyable storyline.*recieved in exchange for honest review*"}, {"userName": "Sandy Grassini", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/14286745-sandy-grassini", "userReview": "I really did enjoy this book since I do love the paranormal genre. This book was a little different for me because I've never read about ghosts or spirits. It was different for me therefore enjoyable since it took me outside the norm. If you want to get away from real life for awhile, this is a book to read. How does a 17 year old boy cope with the fact that he can see spirits? He feels its a curse that was handed down to him when his father died. His father tries to assure him its a gift, but Marvin feels otherwise. This is a gift that has been handed down from generations. The book doesn't go into any detail on how their family got the curse/gift.  His mum and step dad move into this house, and behind the house is a cemetery. He visits the graveyard and is surprised when he is not bombarded by spirits. There is 1 spirit, a girl named Stella. She has no memory of her life and she doesn't know she is even dead. Marvin treads lightly when speaking with her. He normally doesn't go out of his way to help spirits, but he feels differently towards Stella. This story brings you to another realm to the gateway to hell to try and find Stella's memories. I loved how the book ends, but I won't spoil it for you. This book is good for YA who enjoy paranormal stories. I give this book 4 stars and I look forward to reading future books from this author."}, {"userName": "Emiliee Wadsworth", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/22281883-emiliee-wadsworth", "userReview": "I decided to not read this book until after I finished my exams, because after having a free preview of the first 5 chapters, I knew that I wouldn't be able to stop reading it. I felt in the mood to read a good book however, as a break from revision, so I went for it. Having read other books by the author I knew I was in for a treat.I was unable to put it down. It was so gripping I read all of it in one sitting. The book is such an original story. Though there are thousands of books in the same sort of genre, I have never heard of anything like this book. It was so unpredictable the whole time, and I love that in a book. Every time I turned a page, I found something new which allowed me to piece more of the story together. Debra Edwards has the ability to make the reader feel as though they are inside the book with the characters, feeling the same feelings that the characters do, and this enables a real emotional connection with the book. I really connected with the main characters, and actually sobbed at some points. I would thoroughly recommend this book to any one. I think it would be impossible to read the book and not be extremely pleased that you did so! It's quite rare to find a book that grips you so much that you can't put it down until you finish it but that is what this book did to me!"}, {"userName": "Satarupa", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/5382110-satarupa", "userReview": "I got this book from the author, free of cost, in exchange of an honest review from my side.Firstly I would like to thank Debra J. Edwards, author of Marvin's Curse for giving me this opportunity of reading and reviewing this book.This is an awesome book with a totally unheard of story line and plot where a physic teenager falls in love with an unique ghost. I loved the concept of the dark world and all the fighting scenes that spiced up the story. Stella is cute and she didn't know that she's dead and all and Marvin and Stella falls in love after Marvin meets her at the graveyard.The description of the dark world is really vivid and totally liked the writing style of the author. The suspense that the author kept till the end is remarkable and the slow revelation of many unanswered questions and the twists and turns with which the story is laced was really great to experience.I liked the new take in the paranormal romance genre and enjoyed it thoroughly.All in all a great read and totally deserves a shot so go for it and find out more about this unique love story and the horrors of the dark world.I would like to thank Carrie, the moderator of Lovers of Paranormal group for giving me this opportunity as well!"}, {"userName": "Lauren", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/11837256-lauren", "userReview": "This is a story about Marvin, a young man who can see ghosts, and is quite troubled in life. This isn't your classic ghost story, this is a story about finding redemption and closing open chapters of your life. I found the story line quite unique and interesting and absolutely loved Marvin. Hopefully there is going to be a second book where we find out if Marvin can repair his home life and what happens with Stella aka Rose. If you believe in ghosts or love a happy ending after a heck of a journey than give this book a read."}, {"userName": "Oliwia Bryk", "userReviewDate": "Aug 17, 2013", "userURL": "http://www.goodreads.com/user/show/18046890-oliwia-bryk", "userReview": "3 stars Marvin was just a normal teen until recently. His father died. His mom got a new boyfriend. They moved house. Oh and he can see and talk to spirits. Marvin has the 'gift' of communicating with spirits. His father had it too. Having the 'gift' is bad enough but then Marvin's mom decides to move to an old house, by a graveyard. His father says the gift is special but Marvin wants to get rid of it. After a fight with his mom boyfriend Marvin goes to the graveyard and sees a girl,Stella. Stella is a spirit but doesn't realise it. She can't remember anything. Her memories have been pawned. They now have to make their way to Moghador and get her thoughts back. After she gets them she remember that she was the Old Kedigan's (pawntucker) assistant. She remembers all the bad things she's done. The Old Kedigan is planning to own all the souls in Moghador The place where all the ghosts that can't go to heaven go. Will Stella redeem herself? Will Marvin help her? Will the Old Kedigan succeed? What I think about it:Okay so this book was like boring but the plot wasn't bad, just poorly written. It was frustrating because like Stella and Marvin didn't have a relationship when it was like JUST FUCKING KISS AND STOP BEING 5 YEAR OLDS. I mean like they did kiss but not enough. It was so frustrating its unbelievable. And I didn't get why Marvin's dad didn't tell him about this gift before. Now some positive stuff Marvin was really kind to Stella and it was sooo cute (the perfect moments for kisses that didn't happen). A lot happened. There's a lot of ass kicking. So overall its like a half good half bad book."}, {"userName": "Bruce Ashkenas", "userReviewDate": "Sep 06, 2016", "userURL": "http://www.goodreads.com/user/show/36634431-bruce-ashkenas", "userReview": "Marvin is miserable. The seventeen-year-old lost his father in an auto accident and to make things even worse, his mother remarried within several months the paramedic who failed to save him. Then Marvin found out he received a 'gift' from his dad, the ability to talk and see spirits, dead people. This 'ghost whispering' was passed down in the teenager's father's family but Marvin thought it was a curse. To further make things worse the new step-dad moved the family to a house which backed up on a cemetery, so Marvin had plenty of opportunity to be miserable in the midst of dead spirits.\tThen, while moping around in the graveyard Marvin meets Stella, a girl the teenager recognizes as dead. But Stella has lost her memories and doesn’t remember dying. Marvin finds himself liking the sixteen-year-old, discovering an empathy he hadn't known he possessed. He leads Stella on a quest to regain her memories, recovering his humanity in the process. The path leads them to a village of the damned beneath the cemetery and Stella's father, who rules the dead town and enslaves the spirits by stealing their memories. This is a sweet story with plenty of paranormal action."}, {"userName": "Johnnie-Marie Howard", "userReviewDate": "Aug 07, 2013", "userURL": "http://www.goodreads.com/user/show/12058564-johnnie-marie-howard", "userReview": "well it was defiantly different in some many ways.I've seen the show Ghost whispers lol and this was my first time reading a book about ghost whispers well besides the shadow falls series. It was nice to just read about one thing. I really liked how Marvin finally decided to change, he didn't think of his gift as a curse anymore which was kinda sweet. Sucks that he did fall for a ghost girl, but he did get to hang out with her and his father again which was really awesome.It was a very quick read it was good, some parts i though were some what confusing like how Marvin's dad died? what happened to have Marvin get the gift in the the first place ,we all know he got it from his dad but how did the family get it? Also what was his dad's name I looked back and looked back in the book trying to figure it out he became a huge part in the story and I didn't have a name just Marvin's Dad.I really enjoyed that it all happened in a graveyard gave it a more spiritual feel to it, also the fact that it was about the in between place what goes on there. I enjoyed the story!! Was well written, kept the pace really good, didn't slow down or go to fast was just right."}, {"userName": "Lorraine Carey", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/5661003-lorraine-carey", "userReview": "Marvin’s Curse will surely take the Young Adult world by storm! It truly is a whirlwind of intriguing adventure at every turn. You can’t but help fall in love with Marvin, the young teen psychic who has all the makings of an abnormal teen, and although he suffers from a family tragedy he is deeply disturbed by his gift. He is deeply drawn into a very strange world of the Paranormal by a mysterious girl who leads him to find an amazing discovery of a dark underworld.With great vivid descriptions you feel as though you are right there in this dark and evil town. Here he will become a hero and find love with a very special ghost.Debra Edwards knows how to capture the eerie tale of the Paranormal and entwine great heart warming scenes here. I felt myself, laughing, crying and not being able to put this one down. She’s got lots of tricks up her sleeve in this one.This was a very smooth read, and as a Children’s Reading Specialist, this would be at the top of my list.I hated to see this one end, and I hope to see Marvin continue on in a sequel."}, {"userName": "Julie Smith", "userReviewDate": "Sep 11, 2016", "userURL": "http://www.goodreads.com/user/show/57579364-julie-smith", "userReview": "Marvin is a teenage boy with all the teenage problems plus one - his 'curse'. The main characters are fairly well rounded. This book was not for me, but I think young adults will love it"}, {"userName": "Lorraine Carey", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/5661003-lorraine-carey", "userReview": "Marvin's Curse will surely take the Young Adult world by storm! It truly is a whirlwind of intriguing adventure at every turn. You can't but help fall in love with Marvin, the young teen psychic who has all the makings of an abnormal teen, and although he suffers from a family tragedy he is deeply disturbed by his gift. He is deeply drawn into a very strange world of the Paranormal by a mysterious girl who leads him to find an amazing discovery of a dark underworld.With great vivid descriptions you feel as though you are right there in this dark and evil town. Here he will become a hero and find love with a very special ghost.Debra Edwards knows how to capture the eerie tale of the Paranormal and entwine great heart warming scenes here. I felt myself, laughing, crying and not being able to put this one down. She's got lots of tricks up her sleeve in this one.This was a very smooth read, and as a Children's Reading Specialist, this would be at the top of my list.I hated to see this one end, and I hope to see Marvin continue on in a sequel."}, {"userName": "Caldwell Publishing", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/55932289-caldwell-publishing", "userReview": "This was a very interesting read. I loved the plot, including the wee twist at the end. I'm a sucker for mundane-seeming objects or situations that turn out to have paranormal purposes—like a pawn shop you visit to forget your life. I was really engaged with the mystery of who Stella was, and it certainly kept me reading.There were some aspects of the novel, however, that I didn't overly enjoy. I found the author's writing to be a bit clunky at times, though not necessarily bad. There were situations that were written quite well—the setting of Moghador, for example—but parts of the dialogue were lacking for me. I also didn't really relate to the character of Marvin. He was a bit of brat, and right off the bat I was on Team Ghost. He did grow as a character though, so I began to like him a bit more as the book went on.All in all, a solid and entertaining novel!*I received a free ARC in return for an honest review*"}, {"userName": "Billie Jo", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/8112839-billie-jo", "userReview": "Marvin's Curse is a terrific read from start to finish. I liked that the author mixed a great ghost story with the hardships of being a teenager. With this story you get tons of suspense, mystery and a touch of romance that keeps you interested throughout the course of the story. This will be a great addition to anyone's reading list teen or adult. The characters are all very well developed and the story line is true to life and believable.Marvin's character just pulled at my heart-strings. He's dealing with the loss of his father and is angry and hurt,then on top of everything else he finds out he can see and hear ghosts, which he hates at first but comes to accept eventually.Overall this was a very well written story and I enjoyed reading it. I would love to see more of Marvin in the near future and hoping for another installment. Job well done Ms.Edwards!!!! * I received a copy of this book in exchange for an honest review*"}, {"userName": "Ramona Plant", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/31375582-ramona-plant", "userReview": "I truly enjoyed this paranormal \"ghost\" story. It is quite different from ones I have read so far. Debra has a pleasant writing style with a good pace. The plot is well developed and keeps you reading on.Marvin is a very likable character. He is struggling with his current life and how to deal with this \"gift\" he received. Marvin continuously grows in this story and develops into someone who does the right thing, just because it is the right thing. Stella is a nice addition to the story and is adds well to the story.All in all I really enjoyed this book and read it in almost one sitting, curious to what happens next.I have received this book from the author for an honest review. (LoP, Lovers of Paranormal)"}, {"userName": "Jada Ryker", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/22078661-jada-ryker", "userReview": "Imaginative Young Adult Paranormal/Horror BookMarvin's life couldn't get much worse. He lost his father. He gained a stepfather. His stepfather has forced the family to move. The house is hideous, located next to a graveyard, and it smells. Of old, dead people.Marvin's father still visits him as a ghost. He encourages his son to use his inherited ability to see ghosts. Marvin just wants to be a normal boy.Debra Edwards' Marvin's Curse is a great paranormal/horror book for young adults. The characters are engaging. Ms. Edwards captures teenage angst, and adds her own brand of the paranormal."}, {"userName": "Carol", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/8231030-carol", "userReview": "GIFT? CURSE?The family of a rebellious teenaged boy moves to a less expensive home. The only problem is that he can see, hear, and converse with the dead -- and the new house is right next door to a cemetery. And so his troubles begin. Toss into the mix the pesky ghost of his father, a girl who confuses her name with a brand name, and a pawnbroker who collects memories and souls, and you have a YA paranormal book filled with twists and turns.In Marvin’s Curse, Deborah J. Edwards has created a fun read with a most satisfactory ending.***I received this book free of charge, in return for an honest review.***"}, {"userName": "Sophie", "userReviewDate": "Sep 16, 2016", "userURL": "http://www.goodreads.com/user/show/28597993-sophie", "userReview": "Great premise but missing the x factor.I was really looking forward to reading this book, as the outline sounded great. Although the plot was interesting, unfortunately in the end I was left with a feeling of disappointment.While enjoyable enough, the writing was slightly over descriptive in places for my taste and just generally felt a bit clunky. The pacing again was mostly ok but occasionally seemed to run away a little or slow down too much. The language also seemed a little simplistic for a YA audience.I feel the author does have promise and I could be tempted to read another of her books in the future, but this one didn't do it for me."}, {"userName": "Natasha du Plessis", "userReviewDate": "Aug 28, 2016", "userURL": "http://www.goodreads.com/user/show/47187803-natasha-du-plessis", "userReview": "I'm an adult that loves reading YA books. Marvin's Curse did not disappoint as I also love reading what happens to people and where do they go to after dying. Marvin received his ability to see and talk to spirits when his dad passed away, he does not see it as a gift but rather a curse. I loved the way in which Debra describes everything she brings each scene vividly to life. I sped through this book and could not wait to see what happens next. I loved the characters and hope that there is more to come of Marvin and Stella.If you are into reading Paranormal YA then I would recommend Marvin's Curse.Thanks to Debra and TBC for the copy in exchange for an honest review.#TBConFB"}, {"userName": "Louise Johnson", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/44564088-louise-johnson", "userReview": "When Marvin's Dad died, Marvin's inherited his gift of seeing and sensing spirits. Although Marvin being young thinks of it as more of a curse, but after meeting a girl who seems to have lost her memories Marvin's decides he wants to help her. He soon realise's that it is indeed a gift not a curse. I was sent this book to read in return for my honest review. Even though it's probably more for young adults, I found I still very much enjoyed it. It is very well written. It has an great storyline, and the characters are modern. There's a few twists in the storyline which makes it exciting and keeps you intrigued. Definitely worth a read if you enjoy paranormal stories."}, {"userName": "Barbara Rauch", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/21505053-barbara-rauch", "userReview": "A teenage girl who has no memories and does not know she’s a ghost. Row after row of little wooden drawers filled with jars of memories, dreams, nightmares or a lost soul’s very essence kept by the pawnbroker in a gateway to Hell. A teenage ghost whisperer who leads an army of spirits to the rescue. These are the features of this really good scary story ! The author provided me a copy of this book in return for an honest review. I can truly say that I enjoyed this book and will be looking for this author’s next one.I will never look at “Press here” in the same way again"}, {"userName": "Yohanna", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/15805233-yohanna", "userReview": "I received a copy of this book in exchange for my honest review.When I first started reading the book, my thought was Ghost Whisperer, only a younger version. My next thought was Sixth Sense.It is a unique story line and it kicked in my imagination. The scenes were detailed and descriptive enough that the author took me there. This is a book I would recommend. I love and strive to find books that ignite my imagination and this definitely did that.Read this book, you won't be disappointed. I wasn't :)"}, {"userName": "D. Messing", "userReviewDate": "Aug 24, 2016", "userURL": "http://www.goodreads.com/user/show/55109666-d-messing", "userReview": "***** I received this ARC for free from TBC on FB in return for an honest review *****This book was fun on so many levels! Take typical teenage angst, add in a ghost dad and suddenly inherited paranormal gifts and it makes for one entertaining read! Made me laugh and roll my eyes regularly with a beautifully heartwarming ending. Loved it and can't wait to check out other works by this author!"}, {"userName": "Malinda", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/22349841-malinda", "userReview": "In this story we follow Marvin a young man who has a special gift. He can see and talk to spirits. I could relate to Marvin with some of the emotions he deals with after losing his father. With each turn of the page we watch Marvin grow from a boy into a young man. The characters and story are all very well developed and believable. The only downfall for me was it was over too quickly. I look forward to reading more from Edwards."}, {"userName": "Susan Angela Wallace ", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/41727319-susan-angela-wallace", "userReview": "Marvin's Curse By Debra J Edwards is a ghost story. How would you handle the dead?This was a really enjoyable read with brilliant characters. I loved ed how he could go where the ghosts went too. I loved how he helped Stella the spirit in the end. I would highly recommend this book. 5* for sure. Thanks to tbc on fb for the arc. #tbconfb."}, {"userName": "Gillian", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/39107301-gillian", "userReview": "I really like the plot. It's so unique. I never expected that the story will go like that. I don't want to be a spoiler, so I will not elaborate the parts that I love about the novel. I will really recommend this to my friends."}, {"userName": "Bridget McKeown", "userReviewDate": "Aug 31, 2016", "userURL": "http://www.goodreads.com/user/show/51869661-bridget-mckeown", "userReview": "It's been a while since I've read any YA and have to say I enjoyed this one. The main character, Marvin comes across exactly as he should - a grieving and mixed up young mad who can see and talk to dead people. It's well paced and an easy read."}, {"userName": "Michelle Tolmay", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/21451729-michelle-tolmay", "userReview": "A brilliant read, loved the story of Marvin and Stella, such fantastic characters. The story was captivating and once I started I found it very hard to put it down."}], "description": "How would you handle the dead? After losing his dad, 17 year old Marvin finds he can see and talk to the dead, an inherited 'gift'. Bonus, you might think, but Marvin hates it. It makes him different and he just wants to be 'normal'. He meets Stella in the graveyard that backs onto the house he's just moved into. 'My name is Stella, Stella McCartney. It says so inside my trousers.' (!?!)A mysterious business card reveals that Stella has lost her memories and all signs point to Moghador, a gateway to hell where a pawnbroker holds the answers. And Stella is DEAD! She just doesn't know it... yet!", "title": "Marvin's Curse", "url": "http://www.goodreads.com/book/show/18115238-marvin-s-curse", "average": 4.21, "cover": "https://images.gr-assets.com/books/1372096214l/18115238.jpg", "reviews": 39, "authors": [{"url": "https://www.goodreads.com/author/show/3145540.Debra_J_Edwards", "name": "Debra J. Edwards"}], "type": ["Paranormal", "Fantasy", "Mystery", "Childrens", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/18115238-marvin-s-curse", "http://www.goodreads.com/book/show/18074186-marvin-s-curse", "http://www.goodreads.com/book/show/7068807-aggie-lichen", "http://www.goodreads.com/book/show/21002880-aggie-lichen-pilp-collector---hero-required", "http://www.goodreads.com/book/show/7068809-arty-s-revenge"]}