{"ratings": 25466, "userreviews": [{"userName": "Madeline", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"Order the fucking fish on Monday.\"Although Medium Raw isn't, technically speaking, a sequel to Anthony Bourdain's first collection of restaurant industry-related essays, it's definitely a companion volume - to the point where if you read Medium Raw without first having read Kitchen Confidential, you're not really getting the full experience. Kitchen Confidential was a brash, cranky, profanity-filled collection of essays detailing the ugly ins and outs of the restaurant industry and the people who make a living from it, and even the positive essays were still brimming with piss and vinegar. One of the most quoted essays from the book explains why you should never order fish on a Monday, so it's a good indication of how much Bourdain's worldview has changed since Kitchen Confidential. The crankiness is now tempered with weariness, and a resigned irritation (mostly directed at himself) that so many people have held him up as some kind of all-knowing expert on the restaurant industry. If Kitchen Confidential is a bitter, ultra-boozy triple IPA, Medium Raw is a cask-aged stout - still strong, still bitter, but complex and well-aged. In fact, I think the thesis of Medium Raw can be best summed up by this single line by Bourdain: \"I'm through being cool.\"A lot of Medium Raw has Bourdain holding a critical lens to his previously-fast-held beliefs, and re-examining with the benefit of hindsight and decades in the industry. In addition to wearily telling his readers to just \"order the fucking fish on Monday,\" he also spends a chapter discussing the concept of \"selling out\" and how it's stupid to hold yourself to some kind of high moral standard when it comes to endorsement - if selling frozen food on infomercials is what keeps your restaurant open, you do it, and you do it with a smile. Medium Raw also presents us with a Bourdain who is, if not nicer, then at least more willing to live and let live. He still has nothing but contempt for Sandra Lee, but a chapter where he endlessly snarks on Alice Waters ends with him warmly and genuinely singing her praises. (Of course, this is immediately followed by a chapter explaining why a certain food critic is, in no uncertain terms, a total douchebag. Tigers can't change their stripes)It's not all backtracking and reflection - Bourdain also takes us through the history of the Food Network and how it's changed over time, and how the company became a profitable business model (Food Network Magazine is one of the few print magazines left that's still profitable), but did this at the expense of the chefs who founded the network. He also reflects on his career, and how he's ultimately stumbled into this career. Another really good chapter has Bourdain delving into what he tells people when they ask him whether they should go to culinary school, and it manages to be both intimidating and inspiring. The boldest aspect of Medium Raw, however, is when Bourdain puts his ego aside entirely and admits, simply, \"I am not a chef.\" It's true - Anthony Bourdain hasn't been in a working kitchen for decades, and he doesn't hesitate to admit that there are thousands of infinitely more talented people working in the culinary world, and that his fame is only partially built on his abilities in the kitchen. But we don't read Anthony Bourdain's books because he's a great chef. We read his books because they're written with a clear, engaging voice, and because he knows how to tell a great story, and has plenty of great stories to tell. (Also, if you can, try doing what I did and listening to this as an audiobook - hearing Bourdain himself tell the stories in this book is half of the appeal)Anthony Bourdain is right -he's not a chef. He's a writer. And thank goodness for that."}, {"userName": "RandomAnthony", "userReviewDate": "Jul 31, 2010", "userURL": "http://www.goodreads.com/user/show/721021-randomanthony", "userReview": "I like Anthony Bourdain in part because he admits the mini-empire he’s created is a good paying gig and he feels fortunate to have landed it. Bourdain’s a paradox in that his street-level authenticity is one of his strengths but, at the same time, he admits he’s loaded and gets all the privileges associated with his celebrity. While he self-depreciates with the best of them he’s also not nearly off the cuff, I think, as he’d like his fans to believe. He’s like a less-frantic Klosterman except with more talent and knowledge of his field. And he recognizes authenticity, however staged, makes good writing and television. If you were to put him, say, on Rachel Ray’s show, even after he’s slammed her in print, he could both talk with her courteously and impart the idea that he’s not buying into the Food Network entertainer concept while he’s on her very show on that very network. That’s a rare skill.Now that Bourdain’s done the food memoir (Kitchen Confidential), the travel book (A Cook’s Tour), and the articles/outtakes collection (The Nasty Bits), I was skeptical of Medium Raw because I’m not sure about what else he could write without re-treading easy literary marks. Medium Raw, however, is successful for fans (I think I’ve seen every No Reservation episode and have admitted to a Bourdain man-crush) but probably less effective as an introduction to Bourdain’s work unless you’re a food culture person, in which case you’ve already heard of Bourdain.The book reads as a collection of nineteen essays mostly about cooking, restaurants, the media, etc. The only essays that don’t work at all are the obligatory “I have a daughter and I have to be a grown up now” essay and an unnecessary “where are they now?” summary of Kitchen Confidential characters. Bourdain’s background knowledge is his secret weapon. He’ll toss around culinary terms I’ve never heard and name-check chefs, restaurant critics, etc. like a fantasy football junkie trading wide receiver stats. He’ll remind you he’s done his time in the kitchen trenches. He rips Alice Waters (some famous hippy chef from California, I guess) a new asshole for offensive comments about people who say they can’t afford organic food but also admit he’s glad she exists. He’ll eviscerate another food critic for taking shots at his friends instead of aiming the crosshairs directly at him then follow with a mash-note describing a guy especially talented at cutting fish. And he’ll admit that bad cooking and lame food shows make him unreasonably angry. Some of the targets (e.g. vegetarians) are old Bourdain news, and he writes more for people who follow restaurant culture than ever before but I, who doubt I’ve ever been to a fine dining restaurant in my life, could follow along pretty well. Fans will recognize names and places (Ruhlman, Les Halles) from the Bourdain factsheet. Medium Raw may be a “fans only” book, really, but the essays embody enough of the Bourdain spirit to make reading fun and worthwhile, like a strong album from a band you really like, rather than an easy-money revisiting of slam-dunk themes. I think Bourdain has finally figured out he’s not going to crash and burn anytime soon. He’s here to stay and with that knowledge can write from an “I’m here and there’s nothing my detractors can do about it so I’m going to write about what I want” rather than a “I’m probably going to fail so fuck it, I’m writing about what I want” perspective. That subtle difference is important to Medium Raw. Anthony Bourdain is dead. Long live Anthony Bourdain."}, {"userName": "Stacey", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/399175-stacey", "userReview": "Anthony Bourdain. I like his show and I like the way he writes. He has a no holds barred way of writing about what he thinks. Medium Raw is like a string of rants. Great material here on how he feels about certain chefs(good, bad, new, and seasoned) and especially the Food Network. I didn't understand his grievance with Food Network since that's where he started, but I get it now. He writes a little about his travels and how humbling it is to be fed in some places where there is almost nothing. No matter what he thinks about the food he is always grateful and,yes, he would like more of what they're serving. He mentions Kitchen Confidential throughout and that's where I found him 17 years ago. I have a special spot for it on my book shelf. It's time for another read."}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "I have mixed feelings about this book. On one hand, I really liked parts of it. I loved hearing Anthony Bourdain narrate the story, which he did expertly. All those years of talking on TV have taught him to how to deliver lines flawlessly, and it shows. It's just like listening to him on TV, which made it easy, fun listening. I also laughed at some of his stories, really enjoying Tony when he feels his most real and down and dirty. However, parts of the story also annoyed me a great deal. I live in the NYC area, and though I'm not a foodie in any extreme sense, I've been to many of the high-end restaurants in Manhattan and I'm familiar with a variety of \"star\" chefs. Even still, I was clueless about the majority of chefs that Bourdain casually name drops. You need to be an insider, or someone who is a Chowhound and foodie-news devotee to really get all the references. For a book marketed to the general population, it was a little too \"clubby\" for my tastes. Bourdain is a strange mix of hating snobbery while being really snobby... and he knows it. He constantly exists in this dichotomy of wanting to be a New York diner cook and being so wealthy and privileged that his wife (now ex-wife) can fly solo at the drop of a hat to eat at Alinea in Chicago just to see why he didn't like it. Alinea starts at $200 per person before alcohol, I might add, and that is for the most basic menu.Mixed feelings about this book, but a skilled narration and an, at time, amusing set of stories."}, {"userName": "Barbara (The Bibliophage)", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/3932962-barbara-the-bibliophage", "userReview": "Medium Raw is a great book for a foodie like me. I'm a fan of Bourdain's and especially enjoyed listening to the audiobook since he's the narrator. Every curse word is uttered with terrific emphasis, and he never pronounces anything related to the restaurant business incorrectly. But it's not all about any angry guy telling you about the people who piss him off. Bourdain talks about the relationships people have with food today, and what they pass on to their kids. More directly, he thinks parents who don't teach kids to cook are doing them a great disservice. I couldn't agree more. “Everyone should be encouraged at every turn to develop their own modest yet unique repertoire—to find a few dishes they love and practice at preparing them until they are proud of the result. To either respect in this way their own past—or express through cooking their dreams for the future. Every citizen would thus have their own specialty. Why can we not do this? There is no reason in the world. Let us then go forward. With vigor.”Bourdain also is very clearly a citizen of the world, not just New York City or the United States. He made me want to go to Hanoi and have Pho there. In the meantime, I'll probably go grab a bowl from my friend's noodle shop very soon.He talks about cooks and the career of a chef or cook. I especially appreciated the essay about Gustavo, who preps about 700 pounds of fish every day at Le Bernardin in Manhatten. Gustavo is from the Dominican Republic, and has an impeccable work ethic. Bourdain convinces the boss to let him buy Gustavo a dinner - the full tasting menu - at Le Bernardin, something normally prohibited. That he wanted to do this makes me love Bourdain just a little more. This is the advice he gives that I wish someone had told me 30 years ago: \"If you’re twenty-two, physically fit, hungry to learn and be better, I urge you to travel – as far and as widely as possible. Sleep on floors if you have to. Find out how other people live and eat and cook. Learn from them – wherever you go.” A fun, food-related read!"}, {"userName": "Will Mclaughlin", "userReviewDate": "Nov 22, 2012", "userURL": "http://www.goodreads.com/user/show/8541117-will-mclaughlin", "userReview": "An image of Tony Bourdain has been carefully cultivated by publishers, producers and Bourdain himself; this punk rock loving, hard drinking, two pack a day sacred cow killing rebel who suffers no fools and and takes no bullshit. Look no further than the cover of this book which features Bourdain staring out imperiously while handling the pointiest end of a knife. And to a certain extent the image is earned. But Medium Raw shatters that image in many ways. The standard Bourdain tropes are here: Alice Waters is a villain, James Beard society is bullshit, Alan Richman is a cunt. He continues to eviscerate carpetbagging parasites who continue to profit off of the food that he holds holy. But a much different Bourdain emerges in this book. Too much focus is always given to his \"bad boy\" image without balancing it out with the sound logic and empathetic reasons he has for giving the people/institutions shit. Just as an example, yes he calls Alice Waters a villain, but not just to slaughter an eminence grise. She has the hubris to suggest Obama appoint her to a special committee to address America's eating habits when she hasn't voted since the seventies. And she dreams of an America where everyone is a farmer of some sort. But he's also incredibly complimentary of her skill, intellect and social graces. A really different Anthony Bourdain comes out here.He's a very sentimental, loving husband and father. A good and loyal friend to those who share his passions. He's very frank about his limitations as a chef and very humble about the company he's been thrown in with. He fully admits that he's out of his league when he gets put on panels with guys like Ripert and Boloud. He dances with his daughter in day care. And he's very frank and apologetic about the collateral damage he may have done in Kitchen Confidential. This is a stand up guy who deserves to be read and treated as more than the cardboard tough guy punch out the media has made him out to be. The only disappointing thing about the book is the very fact that it follows Kitchen Confidential. It's like Weezer following their first album with Pinkerton; it was a fine album, but it was all about the travails of being a successful rock star. KC was so great (at least to people like me who used to work the line) because it transported you to the reality of that world. Most of what people see of kitchens and chefs is what they see on Top Chef or Chopped. You don't see the egos, the tensions and the overall seductive, sybaritic lifestyle that comes with working in the restaurant industry. There's not a ton of that here. Unless you're already a well known chef who is invited to be a judge on guest panels or you do a lot of international fringe traveling, there's not a ton to identify with here. Also there's a seeming hypocrisy afoot. The second chapter of the book, Bourdain talks at great length about how he refuses to license his name for his own line of cookware or refuses to let someone just slap his name on a restaurant for the marquee value. Yet I received this book as part of a cooking class called Anthony Bourdain's Mastering The Basics at the Sur La Table chain of kitchen stores. There's a chapter where he mentions a couple of things that we cooked in the class very briefly. But no real recipes. The recipes we made seemed pretty sanitized with an occasional \"ass\" or \"shit\" thrown in to make it sound like his voice. So I don't know if this was something done without his knowledge or if he gave up a valued principle.I met Chef Bourdain briefly back in NYC at Siberia Bar. A nice, genuine but reserved guy. We didn't get to talk a bunch or become best friends. But reading this book feels like sitting down and having a great conversation with a guy who's lived an amazing life."}, {"userName": "Juliet Doubledee", "userReviewDate": "Oct 01, 2010", "userURL": "http://www.goodreads.com/user/show/4350318-juliet-doubledee", "userReview": "Chalk one up to Anthony Bourdain once again, as he presents a witty and insightful view of the culinary world. In \nMedium Raw\n Bourdain discusses the changes that have taken place in the subculture of chefs and cooks, the restaurant business, and in his own life during the ten years since her banged out his mega best selling book, \nKitchen Confidential\n.Bourdain admits no longer can he call himself \"chef\", especially after filming an episode of \"No Reservations\" in which he went back to his old stomping grounds at Brasserie Les Halles, and once again worked his station for a day. This episode it is a definite reminder, \"ya never can go back\", as he finds his knees and joints no longer willing to accept the abuse of constant bending to get into the low-boy refrigerator, and his aging eyes unable to read the requests sent to his station because of fogged glasses or grease streaked lenses.\nMedium Raw\n discusses the transformation he has gone through, from angry journeyman cook to globe-traveling professional eater/drinker and how it has brought him in contact with some of the top creative minds in the food world (Eric Ripert, Thomas Keller, Ferran Adrià, Fergus Henderson, Marco Pierre White, and Mario Batali) praising them for their love of ingredients and cutting edge development of new dishes. He apologizes for remarks about Emeril Lagasse and Bobby Flay, explaining that he now has a better understanding of what they have gone through to reach the level they are at as TV celebrity chefs. Also, he explains why he has serious disdain for food demigods like Alan Richman, Alice Waters, and Alain Ducasse.Unlike previous books he has written which were very direct with liberal use of profanity and sexual references, the reader gets a feeling that Bourdain has accepted his new role and is embracing a \"kinder, gentler Tony\". Could this be the result of fatherhood? In fact, my favorite chapters in the book deal with the relationship he has with his 3-year-old daughter and how it has changed his outlook on the world. No longer is he the rebel who does as he pleases, trading his leather jacket for a more \"fatherly\" look, making sure his behavior doesn't land him on any celebrity websites, and not being embarassed to be seen dancing with her and her little friends. But again Bourdain is Bourdain, as he points out how he is teaching his child to see American fast-food culture as he does... as the enemy. Telling her that Ronald McDonald \"has cooties and stinks like...poo\".If you are a \"foodie\", enjoy seeing and hearing his opinion as a judge on \"Top Chef\", would like to find out about the man behind \nKitchen Confidential\n, or just want to see why everyone is talking about him, you will definitely enjoy this book."}, {"userName": "Lauren ", "userReviewDate": "Jun 16, 2010", "userURL": "http://www.goodreads.com/user/show/1291915-lauren", "userReview": "Oh Tony! you have so much to offer: pithy observations, thoughtful commentary on a host of subjects... and then you devolve into talking shit about (almost) everyone. Sure, that's some of your charm - you say it like it is, you snark, you are lovingly curmudgeonly - but a few times in reading this book that I just skipped ... and skipped over few chapters. Too much bad jou jou with all the mud-slinging. You had some great tales to tell: island hopping with the \"old money\" crazy girl, teaching your daughter about the evils of fast food, Changology, in the kitchen and the dining room with Justo the Dominican... and hell, I even read and got something out of your lambasting of vegetarianism (although I have to say, you seem to miss the point entirely... and you didn't change my mind: I eat vegetarian food AND while you may \"hate\" my kind, I still have an odd and inexplicable affection towards YOU) especially your note to your \"friend\" after your harrowing trip to Beirut. ...and I really could have done without the final essay on the roomful of famous chefs eating the threatened species of French bird... irresponsible, selfish, and wrong is what it really is... but I digress.That being said, I will still watch your show, and read your books and articles. I think it is your unique blend of joie de vivre that keeps reeling me in - you are so damn passionate about your food and your travels. And I get that. I am too. I just prefer my pho with vegetable broth and veggies We can still agree that it is one of the most amazing foods on earth.Tenuously yours,L"}, {"userName": "Greg", "userReviewDate": "Jan 10, 2010", "userURL": "http://www.goodreads.com/user/show/359659-greg", "userReview": "I'll admit it--I'm not much of a foodie, and I've never been a close follower of Anthony Bourdain. I've seen a few great episodes of \"No Reservations,\" but I've never gotten around to reading Kitchen Confidential. There's no doubt, however, that the man can write. Fans will undoubtedly salivate over Medium Raw, a book that is less a linear narrative and more a series of essays, some of them personal (about his new family life, for instance) but most of them taking aim at the modern food world: the double-edged sword that is Alice Waters; a look inside the ever complex mind of chef David Chang, which almost reads like a New Yorker profile; the precariousness of the restaurant business in post-meltdown America; the highs and lows of the Top Chef winners and losers; a chapter of Bourdain's favorite meals that he's had around the world--truly some of the most fantastic food porn penned in recent memory; and a chapter called \"Alan Richman is a Douchebag,\" a spectacular takedown of the food writer and critic. Of course, there's plenty of scathing prose throughout, and enough jabs to delight even the most seasoned Bourdain fans. But each chapter is part of a larger conversation Bourdain's having with himself, and he always returns to the implication of the question that ties the book together: Why, today, does it matter to cook well?"}, {"userName": "Alex", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "\"How long that sort of douche-oriented economy survives is questionable.\"Not my favorite of Bourdain's books. He's really mastered this weird little game he plays where he starts off by savaging one celebrity chef or another and then backtracks utterly, excusing all the things he just hated on and concluding that they're not so bad after all.What fun is that?Bourdain at his best has something worthwhile to say about the importance of food and the value of embracing different cultures through eating with them. But maybe just watch a few episodes of No Reservations instead of this."}, {"userName": "Dave", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/1662545-dave", "userReview": "By now, pretty much anyone with an interest in popular culture, food or books knows who Anthony Bourdain is. With his wildly successful debut nonfiction title, Kitchen Confidential, Bourdain burst onto the literary scene with an acerbic, profane and hilarious voice all his own. Lambasting the industry he made a career in for 28 years while at the same time baring his own addictions and shortcomings, Bourdain rightly became a darling of the very people he tore apart. He translated this success into a series of television shows that centered not on his cooking skills but rather his love of travel, exploring and experiencing other cultures through their food. In the process, he transcended both the genre and the medium. Ten years latr, if anyone wondered whether this level of success would mellow Bourdain, Medium Raw is another emphatic \"Fuck no!\" to that question. In a series of loosely connected essays, Bourdain continues to marshal his considerable storytelling skills to disembowel the current state of gastronomy, laying out on the cutting board the celebrity chefs, the heroes and villains of the industry, the bloggers, tv show hosts, rich bitch ex girlfriends and media CEOs, all the while poking and prodding at the ridiculous(Alice Waters' hypocritical \"slow food\" dinners for which she trucks in food from 6 hours away and flies in chefs from across the country) and the status quo(ripping to threads the entrenched GQ food critic Alan Richman, where Bourdain starts the essay calling Richman an asshole and culminates with him calling the man a cunt).Bourdain obviously revels in his ability to inflame his critics. Case in point: his opening salvo, a lush, nearly pornographic account of a furtive dinner he attends with other chef celebrities where he's served the decadent and illegal ortolan bunting (an ancient French peasant dish that consists of a fattened endangered baby bird drowned [literally] in licquer. In an elaborate and ritualistic dinner, the chick is eaten whole, headfirst, organs, bones and head intact and with the diner's head shrouded by a napkin, to savor the aroma and it's said, to hide one's face from God.) Or take his withering attack on vegetarianism and veganism, in the form of a venomous email to a friend, rightly questioning his friend's (and by proxy, the movement's) prioritizing animal suffering over human suffering. In the process, he skewers the Hindu veneration of the cow which often results in the animals wandering hungrily into cities and devouring plastic bags, dying slow painful deaths as the indigestible plastic winds its way through the beast's digestive system.Despite the in your face punk bravado of Bourdain's prose, his credo is ultimately a down to earth humanism that shines through all his essays. Take his piece about Justo Thomas, the fish butcher of the Michelin starred fine dining establishment, Le Bernardin. Bourdain spends a day at work with the older immigrant worker as he dresses and preps 700 pounds of fish to Eric Ripert's highly exacting standards. So impressed by Thomas' skills and work ethic is Bourdain (always quick to extol the virtues of the unsung toiling masses behind the scenes in every restaurant, from the local taco joint to the French Laundry) that he treats the man to dinner at Le Bernardin. This is an especially touching part of the book, showing both the compassion and the camaraderie Bourdain feels for those whose work he admires. Though never apologizing for his success or wealth, Bourdain obviously respects those who make a pittance and could never afford to eat where they work.It goes without saying that this is not everyone's osso bucco. If you're thin skinned and cling particularly hard to a dogma that Bourdain opposes, you probably already dislike this book and the man himself. If you cringe at Bourdain's easy and prolific use of even the most reviled profanities and obscenities, don't bother opening the book at all. If you pale at frank references to hard drug use by a recovered drug abuser who unapologetically still gets hammered on a regular basis, this book is not for you. If you have a problem with a sensual enjoyment of food that borders on- and often drunkenly stumbles into- the hedonistic, look elsewhere.But if, like me, you crack the book knowing exactly what to expect, you'll find yet another reminder why Bourdain enjoys the success he does. His wit and intelligence are matched only by his obvious adoration for his subjects: food, those who make it and those who enjoy it. There are a few spots that drag a little, a few points Bourdain makes a little too emphatically. But knowing Bourdain's penchant for excess, is this really surprising? In the end, as with the most satisfying meals, the last bite leaves you longing for more despite feeling done for now."}, {"userName": "Shannon", "userReviewDate": "Feb 25, 2010", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "Book: ★ ★ ½Narration: ★ ★ ★ ½I love watching Bourdain's TV shows. I especially love it when he's a judge on Top Chef. I also love to read when he blogs about the show too. For some reason though, his books end up being sort of mediocre. I only got through half of Kitchen Confidential before I gave up and moved onto something else. I keep telling myself I'll come back to it someday, but I'm really not sure I will. I ended up listening to this book on audio, and I think that might be the way to go when it comes to this type of book. At least, for me.Bourdain is funny, crude, and tells it like it is, although at times some of the insider stories get a bit boring when you don't know the people or restaurants he's talking about. I found myself at times spacing out on chapters where he talked about notable chefs that I had never heard of. I guess this is to be expected since I've never have or never will be in the food industry. I watch a lot of foodie TV though, so I knew who Eric Ripert, Wylie Dufresne, and Thomas Keller where. He spends a whole chapter on a food critic that I had never even heard of though. And then he also gets the reader caught up on people from Kitchen Confidential, which I hadn't finished and had no idea who he was referring to, but that's my fault I suppose.I particularly loved the sections where he talked about The Food Network and Top Chef. I really enjoyed his descriptions of his meeting with Sandra Lee, or \"the Hell Spawn of Betty Crocker and Kathie Lee,\" as he's referred to her. I'm not sure how comfortable I am about him apologizing for ripping apart Rachel Ray and others, because I enjoy his surliness. I guess that once you reach a certain age, and after you have a kid, you lose a bit of that anger.I'm glad he narrated this book; it was a good listen, albeit boring in parts, but definitely worth the time."}, {"userName": "James Thane", "userReviewDate": "Aug 26, 2010", "userURL": "http://www.goodreads.com/user/show/3483907-james-thane", "userReview": "Ten years after his surprising best seller, Kitchen Confidential: Adventures in the Culinary Underbelly, Anthony Bourdain has perhaps mellowed a bit, but happily only a bit. In Medium Raw: A Bloody Valentine to the World of Food and the People Who Cook, the former chef turned-critic and global traveler surveys the current state of the food and restaurant world.As always, Bourdain is witty and profane, and he rarely pulls a punch as he takes on topics ranging from the Food Network, to the fast food industry, and to several of the biggest names in the culinary world today. In the process he traces the arc of his own career over the last decade, which has seen him rise from being a chef with fairly modest credentials and the writer of a couple of unsuccessful mystery novels to something of a megastar.Even those who pay little or no attention to food and to the food industry will almost certainly enjoy this book, simply because Bourdain is an excellent writer--irreverent, engaging, and funny as hell, even when he's being serious."}, {"userName": "David", "userReviewDate": "Jun 29, 2010", "userURL": "http://www.goodreads.com/user/show/1820655-david", "userReview": "There are some great moments and typical entertaining chapters by Tony in this one...but there are also some moments that don't grab you. The wit is always there to urge others to read this still, as I would recommend."}, {"userName": "Meredith", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/5402629-meredith", "userReview": "I enjoyed this audiobook; maybe not as much as Kitchen Confidential, but Bourdain really knows how to write! This felt less like a memoir and more like a collection of essays with some life stories thrown in, but I'd definitely recommend the audiobook."}, {"userName": "Jenn Ravey", "userReviewDate": "Nov 25, 2012", "userURL": "http://www.goodreads.com/user/show/6903121-jenn-ravey", "userReview": "I am not a foodie. I am the exact opposite of a foodie. I don’t plan out restaurants when I travel. I love food; however, I’m one of the pickiest eaters you’ll meet. But I love love love Anthony Bourdain and his show No Reservations. I guess because, unlike some foodies, he genuinely seems to enjoy what he eats – without reservation.Medium Raw is just what you’d expect from Bourdain: a series of rants, raves, and love notes to the food, its industry, and its people, and I loved every second of it. The essays range from his thoughts on the unexpected success of Kitchen Confidential, to his storied past and his more domestic present.Most of the time I was out of the loop when Bourdain discusses famous chefs, restaurants, and meals, but I never once felt patronized or excluded. Bourdain loves food in the way I love books, talking about certain dishes as transcendent, and damn, even if it included some random thing I would never eat, I was tempted as I flipped the pages.Obscene in the best of ways, heartfelt, and yes, raw, Bourdain’s writing is a treat to read, and if you are at all interested in the man or what he loves, you will absolutely want to own a copy of this one."}, {"userName": "jenn", "userReviewDate": "Feb 10, 2012", "userURL": "http://www.goodreads.com/user/show/83042-jenn", "userReview": "Man, I have the worst role models. Whatever. I love this guy.I listened to this as an audiobook, which was fun - though I'm so used to Tony's voice right now, I don't think I missed much by reading Kitchen Confidential: Adventures in the Culinary Underbelly on my Kindle. Narration aside, I think Medium Raw: A Bloody Valentine to the World of Food and the People Who Cook is a better book. Tony names names this time around, and most of his subjects are well-known nationally or internationally, as opposed to just part of the NYC food scene. He also goes beyond his personal experience and takes on a lot of foodie and non-foodie topics (i.e. tasting menus) in a way that really resonated with me, even though I don't work in a restaurant."}, {"userName": "Vegantrav", "userReviewDate": "Aug 16, 2010", "userURL": "http://www.goodreads.com/user/show/834122-vegantrav", "userReview": "Anthony Bourdain is notorious for his loathing of and snide comments about vegetarians and vegans, so why would I, a strict vegan, be reading his new book?I like Bourdain. I like his writing style, his attitude, and his sense of humor. And I do take a gossip’s perverse enjoyment in reading all the nasty comments he makes about the other celebrity chefs and cooks that he hates.Additionally, I really enjoyed his first book, Kitchen Confidential, which was a great, authentic look, from an insider, at the restaurant business. It reminded me of all the time I spent working as a server and a bartender trying to earn enough tips to pay the bills in college and graduate school.In his latest book, Medium Raw, Bourdain continues to entertain, but this book is more about his life since he quit his job as a chef at Les Halles and focuses more on the foods and restaurants and cuisines that he loves with a good measure of attacks on his enemies as well as reflection upon where his own career has brought him.One thing that still frustrates me, though, is that Bourdain continues to fail to grasp the basic reasons why those of us who are vegan have eschewed animal products. In this book, he gives three main arguments for his dislike of vegans: 1. Vegans won’t eat all of the wonderful foods that other cultures have to offer. He comments frequently that he thinks it is very rude and ungrateful to travel to other countries and refuse to eat their cuisine. This is a very weak argument: when most vegans travel, they aren’t going into people’s private homes and eating but are rather eating at restaurants, and so they don’t have to even place themselves in the situation of refusing the hospitality of their hosts. Moreover, this critique fails to give sufficient credit to the people of other countries for being understanding of the vegan lifestyle: most people, in my experience, are not at all offended when I decline to partake of meat or other animal products, and when I explain my reasons for being a vegan, they readily understand, and I don’t see why people in other countries would not be equally as understanding. 2. Bourdain seems to think that we vegans consider all animals to be the equivalent of pets, and he speaks passionately about his own love for cats and dogs, and so, he says, he thinks he can, to a degree, understand the vegan/vegetarian position. But he is wrong: most of us who are vegans are vegans for ethical reasons. We don’t think of cows and chickens and turkeys and pigs as pets. We think of them as sentient creatures who can and do suffer, and their suffering is, from our perspective, immoral. Since we humans can live without eating animal products, we believe that we should refrain from eating them and thus reduce animal suffering. Our position as vegans is thus one that grows from our moral belief that we should do what we can to reduce animal suffering; it has little, if anything, to do with seeing all animals as the equivalent of domestic pets. 3. Bourdain argues strongly that there is a great deal of human suffering in this world, and so he thinks we vegans are wrong to focus on animal suffering. This argument is absurd. Most vegans, myself included, are far more concerned about human suffering than animal suffering. Just because we are concerned about animals does not mean we cannot also be concerned about humans: there is no “concern reservoir” in us that runs dry if we spend too much time caring about animals. Speaking for myself (and I know many vegans feel the same way), I find a charitable commitment to helping other humans to be one of my primary moral duties, and I also find helping end animal suffering also to be very important. The latter is actually much easier than the former because, to be a good vegan, all I have to do is not eat animal products, which is very, very easy to do, and thus I find that being a vegan does not in any way detract from my commitment to helping my fellow humans.All things considered, while Bourdain would probably call me an annoying vegan, I still love his prose and his insulting, sarcastic commentary, so I really did enjoy this book."}, {"userName": "Lena", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/220791-lena", "userReview": "It's been ten years since Tony first wrote Kitchen Confidential, his snarky, foul-mouthed exposé/memoir about the restaurant industry in New York. A lot has happened to Tony since that book was published, and a lot has happened to the American food scene as well. Medium Raw is a collection of essays in which Tony muses in his traditional, foul-mouthed tone about the good, the bad and the ugly in both of those arenas.Those who enjoy Tony's particular blend of sharp insight, food passion and colorful language will find much to please them here. Tony once claimed in an interview he hasn't learned a thing about writing since publishing KC; that he wrote like he talks then, and he writes like he talks now. It's true, but the thing about Tony is that he's so damned interesting to listen to that his occasionally rambling style remains one of his charms.Medium Raw covers a number of food-related topics, from discussions of his personal experiences to analysis of some of the major players in the American food scene today. It was tantalizingly shocking to hear Tony go after grandmotherly Alice Waters of all people, whom he agrees with on many issues but whose visible hypocrisy in major areas he sees as damaging to the overall cause. The gloves really come off when Tony uses his pages to launch the next salvo in what is clearly an ongoing personal war between himself and food critic Alan Richman. Prior to reading that chapter I had no idea who Mr. Richman was, but I'll certainly never forget his name now.Though Tony can be virulent in his criticism, he is equally lavish in his praise of those he admires, and he spends significant portions of the book talking about his food heroes - people like David Chang, who are making profound and dramatic changes to the fine dining scene in America. But an entire chapter devoted to an unknown Hispanic man who is the virtuoso of fish prep at Le Bernadin reflects Tony's unwavering appreciation for those who do the much-harder-than-it-looks work of preparing reliably fantastic food under brutal conditions, day in and day out.As much as I enjoy reading about food, however, it was the chapters in which Tony spoke of the intersection between food, his unexpected success, and his personal life that touched me the most. His frank discussion of a suicidal phase he went through after the end of his first marriage in 2005 is written with his trademark blend of snarky anger seasoned with an ample dose of gallows humor. It becomes clear early on, however, that, while Tony still has plenty to be angry about despite his mega success, much of that anger has been refocused on behalf of his young daughter. An unexpected chapter in which he lambasts the factory system of meat production that has e coli infections on the rise is tinged with the very real fear of a parent who has a child he desperately wants to protect. And when it comes to shielding his child from the Evil Empire of McDonalds, Tony has no qualms about fighting dirty. His chapter on the psychological warfare techniques he and his wife use to quash any nascent interest their toddler may develop in Ronald and his friends is absolutely priceless. As someone who has come to know and love Tony over the years through KC and his show No Reservations, I really enjoyed this book. If you've never heard of Tony, though, I'm not sure how accessible this book will be, and would probably recommend starting with Kitchen Confidential."}, {"userName": "Adam", "userReviewDate": "May 25, 2014", "userURL": "http://www.goodreads.com/user/show/1884982-adam", "userReview": "Alright, the rating's pretty generous. But the chapters on David Chang, meat, and the rich alone make up for the book's faults. There are other great moments, too.But about the rich people. I've been around some decent rich people, but there's this thing that seems to happen with either the ultra-rich or those who look up to the ultra-rich that is just fucking unbelievable. These loathsome fucks are so consumed with concern about showing the world that they have taste that they never bother developing taste in the first place. Do not associate with the very rich. They will drag you to the worst cocktail bar in the city and to the worst restaurant with the shittiest service and the most abhorrently overwrought food. I do not just mean that these aren't my kinda spots. These places are as close to an approximation of hell as I can imagine.And the rich are cheap at the wrong goddamn times. They won't pay for an exquisite Manhattan made to the highest standards, featuring not only the absolute best whiskey and vermouth you can get, but also just the right touch of delicious deviance from the IBA recipe. But they will pay for a shitty vodka martini to accompany the stunningly expensive monstrosity of a \"salad\" they're eating that seems to consist almost solely of those triple-washed greens you can get at any fucking supermarket. Ludicrous amounts of just the most tasteless vinaigrette weigh the greens down, ruining anything that might have been good about the thing. Voila: \"salad.\" Side note: nobody should pay for a vodka martini, or ever drink such a thing. A martini is gin and dry fucking vermouth, end of. If you really want to, for some incomprehensible reason, drink a combination of vodka and vermouth, have the common decency not to sully the name of the great, beautiful martini while you're at it. When not torturing you, they will talk about social justice while exhibiting the vilest, most unjust behavior and tendencies. It is humanity at, very nearly, its worst. These people only care about what they're supposed to like. They seem to have no opinions and no views and no understanding and no knowledge of their own. They're hipsters without the slightest semblance of hipness. I mean, can you imagine?What I'm getting at is Bourdain captures all this very well in the book's most enthralling chapter, but with much more lucidity and many more amusing and tragic anecdotes. It's the kind of thing I like Bourdain for, the reason I've been mildly obsessed with the man for the past year or so. The chapter's both sad and funny, but not funny-sad. The most appalling thing about it is, as Bourdain points out, the people who run this fucking world aren't just evil. They're the same people who will pay $25 for a plate of badly prepared lentils on a resort island demonstrably shittier than the many others in near proximity to it. I mean, the stupidity beyond the evil. Dunno what else to say. The guy makes superb television shows. This is a way less obnoxious, more sensible memoir than Kitchen Confidential is, but it's also too much of an apology for that book and too much of a follow-up."}, {"userName": "Melissa", "userReviewDate": "May 31, 2010", "userURL": "http://www.goodreads.com/user/show/528350-melissa", "userReview": "Let’s get this out up front: The F bomb is ABUNDANT in Anthony Bourdain’s Medium Raw. It’s how he has made a living – first as a foul mouth chef, now as a foul mouth TV travel host. The F Bomb is so copious that if it were buck-shot loaded into a shot gun and fired at the book, all you would have left hanging from the spine was a few tattered pages that looked a lot like Swiss cheese. But if you have read his first book, Kitchen Confidential, or followed his TV show, you would know this – so I was prepared for battle when I cracked the cover on his most recent rant, restaurant subculture tell-all, memoir.In essay style – Mr. Bourdain takes on every known enemy from Food Network, to Alice Waters (the Mother Theresa of the organic, sustainability food movement) to Ronald McDonald himself. He gives us background into the secrets of Top Chef (but not as much as I would have liked!). He talks bluntly about protecting his daughter from the chicken nugget, his suicidal moments following the end of his first marriage and tasting menus at 4 star restaurants. But his most brilliant chapter/essay is My Aim is True – about Justo Thomas, who is in charge of preparing all the fish for Le Bernardin – Chef extraordinaire Eric Ripert’s celebrated restaurant. In exquisite form, Mr. Bourdain, takes us through the a “day in the life” of Justo as crates of every known type of fish must be filleted, scaled, deboned, and precisely portioned out for the various chef’s preparations. It is like a seafood symphony what this man is able to accomplish. And at the end, Mr. Bourdain does something that proves he isn’t as hard-hearted as he appears to be.I sheepishly admit I like Mr. Bourdain’s snarky, snide, comic, vitriolic, commentary. I love is show and loved KC. This book, however, seemed like much of the same – and even I – who was prepared for the language, grew weary of reading yet another expletive.So, if you are interested at all in reading this book – I would recommend (much against the publisher’s orders) finding yourself a big comfy chair at Barnes & Noble (or your book store du jour) pulling a copy from the shelves and reading the chapters entitled Lower Education, I’m Dancing, and My Aim is True. You’ll be spared many of the Fbombs, but left with some of the most emotional and best writing of the book."}, {"userName": "Bryce", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/2205083-bryce", "userReview": "I’d recently made reservations for the fried chicken dinner at Momofuku Noodle Shop, so I felt undeniably smug while reading this book. “I’m going to a David Chang restaurant!” I thought “I’m part of the scene Anthony Bourdain’s talking about!” Well, not really. I’m a fairly proficient home cook. Sometimes, I’m downright impressive. I try to buy good ingredients and I’m not afraid to experiment. I go to restaurants regularly, sometimes very good ones. But I’m not a “foodie.” And I’m definitely not up on the dining “scene” in NYC. Oh, but I want to be. I want the 20 course chef’s tasting menus. I want the wine pairings. I want to be up on the insider gossip. And all that is why I think I preferred this book to Kitchen Confidential. KC was about Bourdain himself; his past, his rise to infamy, his struggles and his life. Medium Raw is about the world of restaurants and cooking, as filtered through Bourdain’s experience. Some chapters were illuminating and brilliant. “My Aim is True” was a particular favorite of mine. It’s about a man who slices fish at a high end restaurant, but does it brilliantly. Does it with grace and art and consciousness. Bourdain brings this man to life and makes me respect his role and his skill, even though I’d never ever thought about the job of slicing up fish before. “Heroes and Villains” was another great chapter, about Bourdain’s personal heroes and villains in the food industry. “I’m Dancing” was just a sweet love note from a father to a daughter. Some chapters were disappointing. Bourdain can be a spectacularly selfish and angry oaf, but he appears to have mellowed a bit between Kitchen Confidential and this book. The chapters that failed were the ones where Old Anthony reared his head. “The Rich Eat Differently Than You and Me” being one such chapter. I learned a lot from this book. One, that the people involved in haute cuisine are as ridiculous, petty and vain as in any other public-facing industry. But, too, I learned that the art and theory and luck and self-reflection involved in being a part of that industry are a beautiful thing. And while I will definitely be taking Bourdain's advice NOT to become a chef, I will appreciate my Momofuku experience all the more thanks to this book."}, {"userName": "Joe", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/93909-joe", "userReview": "This is the sort of book I buy when I become overloaded with literary novels, and then, a few chapters in, become so impatient with the writing and style that I angrily speed read clumps of pages, unable to let any book go, no matter how silly it becomes. Fortunately, the best of Bourdain can justify this passive-aggressive self-flagellation; his stories remain first rate, and he has an ability to describe, not food, but the pleasure of eating food, with unbeatable allure. The two chapters that stand out are \"The Rich Eat Differently from You and Me\", in which Bourdain chronicles his torrid affair with an insane and insanely wealthy woman in the Caribbean after his first marriage breaks down, with a few culinary adventures along the way, and \"Lust\", a catalog of ten insanely indulgent eating experiences around the world. They're what Bourdain does best: in the first case, the rollercoaster, too-crazy-not-to-be-real memoirs of Kitchen Confidential, and in the second case, a populist paean to local food that mirrors his addictive television show. A chapter on David Chang shows hope for a new direction for Bourdain, describing the world's more outrageous chefs with the same flair he has for outlandish food. But the filler in-between these standout chapters makes for a strong argument that in the age of Kindle, some books should be shorter and less expensive. Bourdain did not have enough A-list material for a hardback, but obviously his agent insisted. The least offensive material grates like a friend obsessed with telling you over and over about how annoying his job is. But at his worst, Bourdain transposes his insecurities onto his readers. He may start seeing four star meals in terms of what type of shit he will take at their end, but there's no reason to slather that twisted view onto a captive audience when it so obviously stems from his own exhaustion and boredom rather than real insight. An unhinged rant about vegetarians fittingly closes the book; at that point in the night, you'd tell your friend he's had enough, and escort him to his cab whether he's ready to go or not."}, {"userName": "Marthe Bijman", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/13110348-marthe-bijman", "userReview": "Ever since I first saw Anthony Bourdain on TV, skidding to a halt in his pointy-toed boots in the intro to “No Reservations”, I’ve been meaning to read his books. Much has been said about them – particularly about his 2000 début “Kitchen Confidential”, described as shocking, wild, anarchic etc. Since those days Bourdain has changed from L’enfant Terrible of the food industry into its Elder (but not entirely decorous) Statesman. “Medium Raw” is everything “Kitchen Confidential” is not. His writing style has segued into a poetic, stream of consciousness food-rap, with the raves and rants downplayed. But like the title suggests, it’s still raw, occasionally rude stuff, and reads like it’s straight from his mind to the printed page, with no stops for editing in between.Bourdain’s writing sounds exactly like his voice-over in his TV series – typically a flow of words, lyricism interspersed with intermittent crude asides “… a perfect bowl of Hanoi Pho is a balanced meeting of savory, sweet, sour, spicy, salty, and even umami – a gentle commingling of textures as well: soft and giving, wet and slippery, slightly chewy, momentarily resistant but ultimately near-diaphanous, light and heavy, leafy and limp, crunchy and tender. There – and nearly not there at all. Were this already not enough to jerk a rusty steak knife across your grandma’s throat, empty her bank account, and head off to Hanoi, consider the colours…”If you have to pick, read chapter 19, “The Fish-on-Monday Thing”. Apart from some advice which is too terrible not to be true, the opening lines give the clue of why “Medium Raw” is different and better than “Kitchen Confidential”: he describes his first memoir as a hurried, enraged, disgorging of sentences. Bourdain has matured, so has his writing style – he’s not so angry any more. But he still has definite issues with the industry, he is still painfully direct and he still does not tolerate poseurs. As far as I’m concerned: Vive L’enfant Terrible!"}, {"userName": "Brendan Monroe", "userReviewDate": "Jul 06, 2016", "userURL": "http://www.goodreads.com/user/show/22409011-brendan-monroe", "userReview": "If \"Kitchen Confidential\" was a Porterhouse (the \"king\" of steaks) then \"Medium Raw\" is a very good T-Bone. It's been ten years since the publication of the aforementioned \"Kitchen Confidential\" and Bourdain is flying high. Having gone from lying in bed awake at night with a constant fear of eviction, Bourdain now has a very successful TV show and has featured prominently in guest spots on such acclaimed shows as \"Top Chef\". Life is good.Though he wrote other books during this ten-year period, \"Medium Raw\" is the legitimate sequel to the book that started it all. Anthony Bourdain spends a significant amount of time here addressing reader comments about \"Kitchen Confidential\" along with giving us an update on where the chefs, owners, and other restaurant workers that featured in it are now. While Bourdain doesn't come off as angry as he did in \"Kitchen Confidential\", he's still got some things to get off his chest. Perhaps my favorite part of this book is the chapter directed against food critic Alan Richman of GQ. The two men clearly loathe one another (read Richman's response to Bourdain's chapter on him, here: http://www.villagevoice.com/restauran...), but I have to side with Bourdain, especially when a supposedly respected food critic like Richman admits openly (in the linked interview, above) that the only reason he went to Les Halles was to get Bourdain back by writing a savage review of his former restaurant (Bourdain had previously nominated Richman as \"Douchebag of the Year\").All said, this is a worthy follow-up to \"Kitchen Confidential\" and a must for all Bourdain fans. Let's hope he keeps it up."}, {"userName": "Tina", "userReviewDate": "Oct 02, 2012", "userURL": "http://www.goodreads.com/user/show/13328947-tina", "userReview": "This is the third book I have read by Anthony Bourdain. Another Thumbs Up rating – he never disappoints. Bourdain goes off on rants about subjects close to his heart – obviously the food industry, covering everything from celebrity chefs, Food Network, traveling and people in general. You know, the idiotic things people do that have you just shaking your head.One example – he is at a book signing for Medium Raw and fans of Kitchen Confidential (young fans I may add) drop off joints of marijuana or packets of coke, discreetly slipped into Bourdain’s belongings. Really? Common sense takes a day off.He makes it clear the days of drug use and abuse are long in the past and it concerns him that some fans of Kitchen Confidential focus on the partying aspects.Oh, and his diatribe on Alice Waters is priceless. The way he writes you can hear him speaking to you. Not the perfect sentence structure but ordinary conversational style writing.The sections where he talks about his daughter, the chapter “I’m dancing”, clearly tells where his head is now. His priorities. This is another honest memoir where he takes full responsibility for any past mistakes with alcohol, drugs, business dealings, etc. and moved on to a better life. I loved this book. More at my site Novel Meals: http://novelmeals.wordpress.com/2012/..."}, {"userName": "Clare", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/68514-clare", "userReview": "I both love and hate Anthony Bourdain. \"Poor little rich boy\" keeps running through my head as I read his words. And talk about food snobbery? God forbid you aren't interested in eating some endangered species little bird - head, feet and everything else - chomping down in ecstasy on little birdie bones! Bourdain veers back in forth in his admiration/hate for other chefs. Sometimes he hates the person but admires their ability so much that he tries hard to give them their due.Bourdain's language is crude and offensive but nobody could say that he isn't being himself. I would bet that he talks just the way he writes. He makes little noise about his cocaine and heroin problems but as a substance abuse counselor I think they may have impacted his life in far greater ways than he lets on. I'd like to hear more about that He seems to be able to drink prodigiously. I kept wanting to pee reading his book. How many drinks can one person imbibein a single evening??In spite of my criticism, I enjoy reading Boudrain's rants, raves, and musings about the work of food/cooking/chefdom. I learn new things with each new book he publishes and that is important to me. Keep going, Anthony. Educate us poor souls who have to eat regular food from the (gasp!) supermarket and who would never eat an endangered species of anything."}, {"userName": "Anna", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/3915017-anna", "userReview": "Entertaining as in how expected.It's been a long time since Kitchen Confidential, and Bourdain has grown up quite a bit. Yet he's still sufficiently angry to at least entertain you.Yet Medium Raw is a good title. Not just how he likes his steaks, but also for the writing. Some parts were medium and some more raw than the others. The more medium and elaborated parts included e.g. what has changed since Kitchen Confidential was published (like the Monday fish thing. Go ahead, order it, it's ok now). The rawer parts would include the many pages of elaborate namedropping about who Bourdain likes and who he doesn't like and the long whys for the likes of dislikes, the many mentions of how Eric Ripert is still his best friend, and how his wife did this and that. But there is also the food porn, and I spent two nights until way too late giggling at his descriptions of some food here. Not the quarter in a dime other food Famous People, bloggers, reviewers etc who at best would describe caribou testicles or anything else exotic that might find its way to their chopsticks as merely \"earthy and nutty\", but way more porn than that. Bukkake aftershots as part of the description of a failed shuffle? You got it (although bukkake was spelled wrong).Two nights up until nearly 4 AM giggling at the food porn parts of the book? I don't think I could justify just 3 stars for just that."}, {"userName": "Lara Beers", "userReviewDate": "Jan 03, 2011", "userURL": "http://www.goodreads.com/user/show/244270-lara-beers", "userReview": "Anthony Bourdain is anything if entertaining. One of my favorite people to watch and to read. In this long awaited follow up to the mega hit \"Kitchen Confidential\" the TV star and admittedly retired chef, gives additional perspective on himself when the book launched his career and personage into the spotlight. It was inspiring and heartening to learn that he was a musty 44 year old when the book hit. Nice to know that when you think your dreams are dead and you are over the hill, miracles still do come true. I think why I and so many others are do drawn to his writing is that his style is very approachable. He writes how he talks, so you feel as if he were across the bar with you. You are getting the inside scoop, no bullshit and no filter. He tells it like it is and that's really refreshing in these days of Ken Follet literary flourishes and painstakingly puffed-up wordiness. It doesn't hurt that his topics are pretty interesting too - famous chefs and restaurants, food porn that leaps off the page making you want to to run down the street and eat anything close to what he is describing. International travel, back-stories and gossip from Top Chef, the Food Network and it's evil minions and the whole foodie industry. Bravo Bourdain, bravo. Keep it coming."}, {"userName": "Dean", "userReviewDate": "Mar 04, 2012", "userURL": "http://www.goodreads.com/user/show/4777876-dean", "userReview": "Most food celebs of Bourdain's stature would be content to rest on their laurels and take the easy road to nirvanaville - but Bourdain being Bourdain decides to crank up the volume, exceeding even the screeching levels of his incendiary 'Kitchen Confidential' in this no-holds barred diatribe of things that Bourdain finds right and (mostly) wrong in today's food scene.Reading through this book is like sitting with Bourdain and his closest chums in an after-hours watering hole while he unleashes his thoughts and rips apart various culinary luminaries that are typically regarded as untouchable (Alice Waters, Alan Richman, Thomas Keller, Alain Ducasse, etc). His thoughts are extremely insidery, frank and lucid and his commentary cuts straight to the bone even if you're not familiar with most of the sacred cows in question.Of course, a fair portion of the book is dedicated to things that Bourdain has deep appreciation and fondness for such as Vietnam, Fergus Henderson and David Chang - but the raw, candidness of Bourdain's head-space is really what we came for and yes, he does deliver in full yet again."}], "description": "A lot has changed since Kitchen Confidential. For the subculture of chefs and cooks, for the restaurant business as a whole—and for Anthony Bourdain. Medium Raw explores those changes, taking the reader back and forth—from the author’s bad old days—to the present. Tracking his own strange and unexpected voyage from journeyman cook to globe travelling professional eater and drinker, Bourdain compares and contrasts what he’s seen and what he’s seeing, pausing along the way for a series of confessions, rants, investigations, and interrogations of some of the more controversial figures in food. Always returning to the question: “Why cook? “ Or the harder to answer: “Why cook well?”Beginning with a secret and highly illegal after-hours gathering of powerful chefs he compares to a Mafia summit, the story follows the twists and eddies through subjects ranging from:• “The Friends of David Chang” an incredibly undiplomatic discussion with (and peek into the mind of) the hottest, most influential chef in America.• “Don’t Ask Alice”: Alice Waters. Good . . . or Evil?• The Big Shake Out: The restaurant business in post economic meltdown America. How it’s changing. How it might change even more.• And, Heroes and Villains. (With a few returning favorites.)", "title": "Medium Raw: A Bloody Valentine to the World of Food and the People Who Cook", "url": "http://www.goodreads.com/book/show/40409969-medium-raw", "average": 3.74, "cover": "https://images.gr-assets.com/books/1528321636l/40409969.jpg", "reviews": 2188, "authors": [{"url": "https://www.goodreads.com/author/show/1124.Anthony_Bourdain", "name": "Anthony Bourdain"}], "type": ["Nonfiction", "Food and Drink", "Autobiography", "Food and Drink", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/40409969-medium-raw", "http://www.goodreads.com/book/show/7324659-medium-raw", "http://www.goodreads.com/book/show/33313.Kitchen_Confidential", "http://www.goodreads.com/book/show/86856.A_Cook_s_Tour", "http://www.goodreads.com/book/show/40136.The_Nasty_Bits", "http://www.goodreads.com/book/show/40137.Anthony_Bourdain_s_Les_Halles_Cookbook", "http://www.goodreads.com/book/show/375894.No_Reservations"]}