{"ratings": 69515, "userreviews": [{"userName": "Emily May", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "[The use of a crazy murderous genderqueer character leaves a bad taste. Perhaps it would not have been quite so bad if LGBTQIA persons had received some other kind of representation in the novel. As it was, however, it had the same effect as a black murderer in an otherwise white novel would have - i.e. not a good one. (hide spoiler)]"}, {"userName": "Patrice Hoffman", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/5405898-patrice-hoffman", "userReview": "There seems to be no shortage of the troubled hero who's family are brutally murdered in the worse way. Yes, these characters make for an interesting story... at first. It's no secret that this hero can often be redundant, boring, and overdone. David Baldacci attempts to break this mold by introducing us to Amos Decker with an unusual ability to remember everything. I mean EVERYTHING!Memory Man begins with Decker, then a detective, stumbling upon the brutal, senseless murder of his brother-in-law, wife, and daughter. After this devastating time, Decker slowly tries to begin his life again as a private detective. Long gone are the days on the Burlington police force... that is until a man named Sebastian Leopold confesses to the murder of his family. As if that isn't enough, there seems to be new murders and massacres that all point to having something to do with Amos Decker. There seems to be a cat and mouse game the the other players in this novel can't keep up with. Honestly, I couldn't keep up either. Memory Man is a fast moving title, but it also seemed a little too fast and under developed.Before I get into what I didn't like about this novel, I will say that I consider myself a fan of David Baldacci although I've only read one other novel by him. I was especially excited to begin reading Memory Man. It begins in graphic detail of a heinous murder which is always a plus. It also provides insight into the mind of a man who has decided to choose between life and death after his world is taken away from him. For the first few chapters I was engrossed in Amos Decker's story. Baldacci gave the tortured hero more depth than others. Sure, he's socially awkward, emotionally detached, and pretty much struggling to hold things together. What's remarkable about Amos is that after being a delivered a career-ending blow to the head in the NFL, he \"suffers\" from hyperthymesia. For those who wonder what that is here ya go: It's a near-perfect recall of one's personal or autobiographical past. Imagine never forgetting a thing that happens to you. Like Monk says, it's a gift and it's a curse.Yes, Amos Decker is interesting but not interesting enough to ignore that the other characters in this novel, besides the maniac on the loose, are totally forgettable. They struggle to keep up with Decker and it's painfully obvious. While Decker deciphers clue after clue (yes I know they were intended for him), it is so annoying that no one else can provide much insight. They just seemed to be going along with the motions and following Decker's lead. Since it seems this is the beginning of another recurring series, I want more of a reason to continue to invest my time in this series. This novel did none of that. I expected way more from Baldacci.In conclusion, I wasn't too impressed with Memory Man but it wasn't awful. I would definitely read more by David Baldacci but I need more from his characters in the next Amos Decker novels. I understand there was a need to lay down the foundation for this tortured soul, but... if memory serves me correctly, I know Baldacci has better in him. Copy provided by Grand Central Publishing via Netgalley"}, {"userName": "Bibi", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "Classic Baldacci and a wonderful start to the Decker series. On to the next book."}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life.4 Stars!This ended up being a book that I liked quite a bit but I didn't love it. I have never read any of David Baldacci's work which is actually quite surprising since I have been a big mystery thriller reader for a very long time. Even though I had a hard time getting into the story initially, this book really kept me guessing. I must admit that I tried really hard to figure out the direction the story was going. There was a lot of excitement packed into this story.Amos Decker is an incredibly interesting character. His uniqueness really drives the entire story. Amos spent about half a minute as a professional football player. He was hit so hard by another player in his first play that his heart stopped and his brain was forever changed. Amos cannot forget anything. His ability to interact with other people has also been altered so he doesn't always behave as you would expect. Amos's ability to remember every detail and every moment helps him solve crimes in a way the other detectives cannot. He was an excellent detective until his family became the target and his life fell apart. He is called in to help as a consultant on a school shooting in his town. Amos is able to help connect the pieces of the puzzle together as the story takes one twist after another.I think that this book did a lot of things really well. The characters were interesting. I found myself wondering how difficult it would be remember ever detail of my life. Everyone has things that are best forgotten. All of the characters were flawed which made them seem more realistic. The pacing of the story was perfect. I found that I had a very difficult time setting the book aside at some points because I just had to know what happened next. The main issue that I had with this book is that some of the plot twists were unrealistic. I like to try to figure out how the pieces fall together every time I read a mystery. I had no clue with this book because some of the twists ended up being rather improbable, at least in my mind. Everything did end up fitting together in a rather exciting and interesting manner so this is really a minor concern for me.I would recommend this book to fans of mystery thrillers. This is a smartly written novel that sets a wonderful basis for a new series. I definitely plan to continue with this series and would like to read some of David Baldacci's other books in the near future.I received a copy of this book from Grand Central Publishing via NetGalley for the purpose of providing an honest review."}, {"userName": "Alex is The Romance Fox", "userReviewDate": "Sep 26, 2015", "userURL": "http://www.goodreads.com/user/show/6663962-alex-is-the-romance-fox", "userReview": "Whew…this was pretty intense!!Memory Man is the 1st book in David Baldacci’s new thriller series and introduces one of the most offbeat characters, Amos Decker, whose injuries suffered in a football game ended not only his career but also resulted in him developing hyperthymesia and synesthesia disorders, which gives him the ability to see time as pictures, able to count in colors and to forget nothing in his head.Coping with these abilities as best he can, his life is shattered when his wife and young child are brutally murded for no apparent reason. Unable to deal with his grief and desolation, he resigns from the police force, living in the streets and barely making a living as a private PI, not caring about his appearance…grossly-overweight, disheveled, lonely and heartbroken, living day by day.When a man confesses to the murder of his family, Amos Decker is determined to get involved. Within a few days following the confession, a mass shooting and massacre at the local high school that he had been one of the students, he’s asked to help in the investigation by his former partner, Detective Mary Lancaster, who is in charge of both investigations. An unexpected breakthrough links both of the killings of his family and the school.The information of Amos side-effects from his injuries, which I had never heard about, made some interesting reading. How he processed his thoughts and findings in his head was riveting stuff. Although there was a lot of repetition about it which I skimmed over a few times. Pretty scary when we watch how Amos deals with everyday things in his life…he almost lives in a world of his own! One minute he and Mary are discussing something and he stops and walks away without saying a word to her.The story moves pretty fast, from one place to another, finding people connected to Amos’s life…because we soon find out that both the crimes have something to do with him. I also found some parts of the plots and some of the characters, especially who the villains turn out to be, a bit far-fetched and tad unbelievable.I enjoyed this book but I felt it was a bit too long. And I am certainly going to read the next in the series."}, {"userName": "Phrynne", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "My first ever David Baldacci book and what a good one it was! I sat and read it all in one day because it was basically unputdownable. The main character who is an ex cop is made extra interesting in that he is a savant and has the ability to remember everything. This of course is a great asset in a murder enquiry and by the end of the book our ex cop is looking forward to much greater things. This is marked as book one in a new series and I look forward to reading the next one. I also intend to make time to read a lot more of this author's books."}, {"userName": "PattyMacDotComma", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "[In my Kindle version, at 39%, Decker sits at a bar with Sebastian Leopold, and Baldacci writes:“Leopold picked up his drink and took another sip. ‘I don’t really drink. But this is good.’”At 82%, Baldacci writes that Decker is telling the FBI agent that they should search international databases for matches. When asked why, Decker says:“’ Because I remembered something wrong. And now I just remembered it right.’Decker put his phone away. ‘I don’t really drink. But it’s good.’ An American would say that all the time. But no American would say, ‘I don’t really drink. But is good.’In fact, Leopold might have actually said, ‘ist good.’  (hide spoiler)]"}, {"userName": "*TANYA*", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/29049556-tanya", "userReview": "Wow!!! Amos Decker is the man!! Riveting from beginning to end. I must move on to the next book in this series."}, {"userName": "Suzanne", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/4852457-suzanne", "userReview": "This book was so entertaining! I actually went ahead and put the rest of the series and also the Will Robie series on hold at my library to pick up tomorrow. I was so into this book that last night I didn’t want to stop reading to go to bed, but had to. I could not predict the way this book would unfold, which I love in mysteries. Amos Decker is an intriguing character with a great supporting cast. I hope this series continues to be as interesting as this first book. So cannot wait to go get to the library to get the other books and another Baldacci series!My quick and simple overall: loved this book. It was intriguing and not predictable like so many other mysteries and thrillers."}, {"userName": "Jonetta", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/4876540-jonetta", "userReview": "Originally posted on The Book NymphoI opted to start this book without first reading the premise so I won't summarize it here. It begins with one shocker and doesn't really let up throughout the entire story.There are several events that are seemingly unconnected but logically should have some relationship. Amos Decker, a man who has an unfailing memory, is assisting the investigation and all you can do as a reader is follow along and try to keep up. This was one of the few times where I failed to figure out the villain and the motivation.Decker isn't your conventional private investigator and his history is pretty rough. You may not like him but you'll be fascinated with him. I'm definitely signing up for the next book in this series.Two narrators were used to handle all characters, separated by gender. I'm normally used to transitions only for changes in point of view. Here the narrators switched whenever their characters had dialogue. Initially it was awkward as it seemed as if they recorded their roles separately. It took a bit to adjust but eventually I settled in. I also loved the dramatic emphasis using music from time to time. It made it feel like a live performance.I really enjoyed this story, the mystery, suspense and Amos Decker. The audio performance, though different, enhanced my reading experience. This is a strong start to what promises to be a very good series. 4.5 stars(I received an ARC from the publisher in exchange for an honest review)"}, {"userName": "Ed", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/4643472-ed", "userReview": "Reads like it was thrown together over a long weekend and phoned-in with stretched out scenes and cartoon-like characters jumping the literary shark in a \"been there, done that\" serial killer hunt. I liked the authors' last book \"The Escape\" very much but this book #1 of a new series read like it was written by someone else entirely."}, {"userName": "Monnie", "userReviewDate": "Apr 29, 2015", "userURL": "http://www.goodreads.com/user/show/6277675-monnie", "userReview": "What could be better than a new series by a favorite author? Answer: A little bit better story. Don't get me wrong, though; I enjoyed this one and absolutely will read the next one, and the next one, etc. But I was hoping for a WOW! kick-off, and it fell short (if only a tad).The hero of the series is a big guy named Amos Decker, a former police detective and football star in Burlington. As with most characters like this, Amos comes with baggage - loads and loads of it, in fact. First off, his glory days were cut short on the very first play he attempted as a member of the Cleveland Browns pro football team (I'm from Ohio and a big fan, BTW); he took a hit that curtailed his promising football career and very nearly left him dead.He survived, but not without very unusual after-effects; he has become an \"acquired savant,\" with hyperthymesia. More simply put, he is one of two handfuls of people who remembers every single moment of every single day and can call any one of them up at will (if you watched TV's \"60 Minutes\" show back in 2010 or the \"Unforgettable\" series starring Poppy Montgomery, you know what I mean). Decker's condition is even more rare, though, because he also has synesthia abilities - meaning he is able to associate colors with people and objects. Accompanying all this is the loss of much of his ability to connect emotionally with other people.Those rare abilities may seem like a good thing - and they certainly can be helpful to a police detective - but for the most part they're a liability because there's no way to get the memories out of his head (seeing them in living color as well does nothing to improve the situation). But he manages to get by until a couple of decades later when he gets hit with a blow that nearly kills him again: The grisly murders of his wife, young daughter and his wife's brother in their home. The killer isn't caught, and Decker heads into a downward spiral that takes him to the depths of despair - homeless and living on the streets.Just as he's beginning to put his life back together some 16 months after the murders, there's a major turn of events as a man turns himself in and claims to be the killer of Decker's family. Couple that with a mass shooting at the local high school, and local law enforcement officials call on Decker to help (working with his former partner Mary Lancaster).In large part because he's forced to call up old memories he's managed to push below the surface of his brain (insofar as possible), Decker is a reluctant participant in the investigation - which, thanks to the school shooting, grows to include the FBI. But when it begins to appear that all the tragic events may be somehow related, the two cases take on even more significance and the rush to get to the truth becomes more of an all-out run.And for the most part, it's a thrilling chase. If I have a complaint, it's that there is an over-abundance of repetition. Granted, given the nature of Decker's affliction, everything plays out in his head over and over and over; but reading it over and over bordered on the tiresome. Besides that, some of the details of how the school shootings were carried out seemed to cross the line of real-life possibility. Still, this book definitely set the stage for further development of this character, and I'm looking forward to the next installment."}, {"userName": "Skip", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1389748-skip", "userReview": "Wow. Baldacci has a knack for excellent thrillers/characters. His protagonist (Amos Decker) was a marginal pro football player, whose career ended on his first play when he was KO'd, literally scrambling his brain, resulting in perfect memory and synesthesia. He becomes a successful detective, but his family is killed, destroying his life. Then, there is senseless slaughter at the local school, and Decker is asked to help, only to find the same gun was used in both incidents. Decker is aided by his former partner and an aggressive reporter to help solve the crimes. The big reveal is stunning and quite creative."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "I have read books by David Baldacci that I hate and books by David Baldacci that I like greatly. This one falls into the latter category. While the slightly contrived ending almost caused me to go down to 4 stars I decided that the book over all is a 5. I like it.So what do we have here? Our hero (Amos Decker) is a man who can forget nothing...really, absolutely nothing. Well, at least not since he was hit by another player in his first pro football game. He died twice on the field and when he awoke he remembered everything and suffered from a form of Synesthesia.Still it made him an exceptional police officer and then detective for years, until his family was murdered. Then he simply collapsed losing everything and becoming homeless after leaving the police department.We will follow Amos through the twists and turns of his life as the unsolved crime of his family's deaths turns out to be tied in with a recent horrific crime.Amos is an excellent character and I hope we see Mr. Baldacci write more about the character. Like the TV characters Monk or Robert Goren we have a man who doesn't function with the mass of humanity as \"expected\". Emotions don't register the same way, his brain works like a finely tuned memory bank and he makes connections others just...don't.So, maybe a low 5 but a 5. I like it, recommended."}, {"userName": "Paul O'Neill", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/17331573-paul-o-neill", "userReview": "I'm loving a good thriller these days. With so many thrillers out there I'm spoils for choice. This was definitely one of the best I've read yet. This had me gripped from the start. The main character, Amos, is unique in the fact that he can remember everything. You'd think that detective work would be easy with this but it is still challenging for him. Memorable side characters, strong plot and excellent writing. I will be reading more Baldacci very soon."}, {"userName": "Michael", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/4086118-michael", "userReview": "A great beach read, a thriller to get your sluggish blood rushing. The tale features Amos Decker, who got brain damage as a football and suffers a rare condition that makes it impossible for him to forget any experience. And what he most would like to forget is memory of coming home from his job as a police detective and finding his wife and daughter slaughtered. After nearly two years of a downhill slide into homelessness and poor self-care, he finally is back at work as a private detective. When he learns that someone has turned himself in with a confession to the murders, Amos can’t help getting in the middle of the case again, casting doubt on the person’s direct involvement. Soon his old captain gets overwhelmed with a mass shooting incident at the local high school and taps Decker as a consultant. Working with his old partner, Decker soon learns that the new murders are connected to that of his family and for some reason he is being targeted in multiple ways.The characters are great, the pacing and surprises are well orchestrated, and the puzzles Decker solves are satisfying to experience. It was also a pleasure to behold his progression toward greater humanity, which is especially hard since the brain damage makes it harder for him to experience empathy or feel the sympathy of others. And having perfect memory does not make his a genius at inference and deduction like a Sherlock Holmes. He still has to stretch hard to interpret what he experiences or see through subterfuge of the enemy. His condition is a bit of a gimmick and the scheme behind the school shooting and the twistedness of his foe are a bit implausible, but I was more than willing to take the ride through all the surprising turns in this tale."}, {"userName": "Rajan", "userReviewDate": "Jan 26, 2016", "userURL": "http://www.goodreads.com/user/show/11662595-rajan", "userReview": "My rating is 4.25 stars. It is a very good thriller and mystery. A real page turner and engrossing. I love David Baldacci better than Patterson and Cornwell. The premise of the novel is a mental condition called hyperthymesia which relates to near-perfect recall of one’s personal or autobiographical past. The hero of the novel can not forget anything and it plays in his head like a DVR no matter how old the memory is. Baldacci starts it from here and takes you on an amazing ride.The macguffin in this novel is the motive of villain in killing Amos Decker family and subsequent shooting in school and kills.[In fiction, a MacGuffin (sometimes McGuffin or maguffin) is a plot device in the form of some goal, desired object, or other motivator that the protagonist pursues, often with little or no narrative explanation]. Once you can make peace with that you will enjoy this book thoroughly. The hero Amos Decker is a troubled soul whose family is killed brutally. He goes into depression and leave police force. He was a footballer who took a nasty hit which led to a mental condition which does not allow him to forget anything. This is more a curse than boon. Then there is a mindless shooting in his own school and 7 people are killed. Nobody knows how the killer entered or exited the school. He is asked to consult and he reluctantly agrees. Later on when it is found that the same gun is used in both his family and school killings he becomes resolute in finding the killer.The pace is unrelenting and Amos keep finding new leads. You also feel the pain of everybody involved and this all lead to a satisfying climax. Everything is explained in the end except maybe why Special agent Laffertty was killed. Highly recommended. Some excerpts:\"I am Amos Decker. I’m forty-two years old and look at least ten years older (on a good day, of which I haven’t had one in four hundred and seventy-nine days), and feel at least a century older than that. I used to be a cop and then a detective but am no longer gainfully employed in either occupation. I have hyperthymesia, which means I never forget anything. I’m not talking about memory techniques where you can teach yourself to remember things better, like the order of a pack of cards using association tricks. No, with me it’s just a turbocharged brain that has somehow unlocked what we all have but never use. There aren’t many but never use. There aren’t many hyper-Ts—my shorthand—in the world. But I’m officially one of them. And it seems my sensory pathways have also crossed streams so that I count in colors and see time as pictures in my head. In fact, colors intrude on my thoughts at the most random times. We’re called synesthetes. So I count in color and I “see” time and sometimes I also associate color with people or objects. Many people with synesthesia are also autistic or have Asperger’s syndrome. Not me. But I no longer like to be touched. And jokes don’t really register with me anymore. But that may be because I don’t ever intend to laugh again. I was once normal, or as close as humans get to that state. And now I’m not.\"\"This “gift” came to me when I was all of twenty-two years old. I was a middling college football player who walked on to an NFL team carrying only fair ability, but a ferocious chip on my shoulder. I stepped on the field for the first game of the season after playing my butt off during the preseason and surviving the final cut. I’m on the kickoff team. My job is simple: Sacrifice my body to create mayhem and holes in the return team so other guys can make the stop. I run my ass down the field. I’m about to make mayhem. I’m running so hard that snot is flying from my nose and spit from my mouth. I’m being paid more money than I’ve ever made in my life. I aim to earn it. I’m about to lay some dude out, stone cold out. And that’s all I remember. Dwayne LeCroix, a rookie out of LSU, was five inches shorter and fifty pounds lighter than me but apparently a force to be reckoned with, because he laid me out on that field with a hit I never saw coming. The dude blew me up, as they say in the NFL. He would be out of the league in four years with both knees devoid of cartilage, his left shoulder pared down to nothing but bone on bone, and his bank account overdrawn. He was currently residing in a max prison in Shreveport for crimes committed against his fellow humans, and he would die there one day either soon or distant. But on that day he walked away, fist pumping and sauntering like the cock over the hens, while I lay on the field unconscious. And after that collision nothing for me would ever be the same. Not a damn thing.\"------“You can’t arrest someone for thinking about committing a crime.”“No, and sometimes that’s more a curse than a blessing.”----\"The PD said smoothly, “A confession that he is now recanting. Mr. Leopold is bipolar, went off his medications, which resulted in some unfortunate emotional distress. He is now back on his meds and his reason has returned, hence his passing the psych exam.” The lawyer held up some documents stapled together. “And then there’s this. Permission to approach?”--------“Savants, autistics, Asperger’s, synesthesia, and hyperthymesia.”“Hyper what?”“Thymesia. In Greek, hyper means ‘excessive,’ and thymesia translates to ‘memory.’ Put ’em together and you get me. True hyperthymesia really relates to near-perfect recall of one’s personal or autobiographical past. I have that, but I also can’t forget anything I see, read, or hear. Perfect recall of, well, everything. I had no idea my brain was that big. But I apparently use more of it than most, but only because I got my ass handed to me on a football field.” “And synesthesia?”“I see colors where others don’t. In numbers, in places and objects. My cognitive sensory pathways apparently also got melded from the hit I took.”------“But I guess there were a lot of positives. I mean, a perfect memory makes school and work pretty easy.”He looked back up at the building. “Do you like yourself?”“What?”“Do you like the person you are?”“Well, yes. I mean, I could exercise more and I have yet to find the right guy, but yeah, I like who I am.”“Well, I liked who I was too. And now that person is gone. Only I didn’t have a choice in the matter.”Her face fell. “Right. I didn’t really think about that.”“And it would be nice to be able to forget some things. People do, you know. Want to forget some things.” “Decker, even someone with a normal mind would never be able to forget something like what happened to your family.”“But I remember every single detail of it, in the color blue. I will never forget any of it, even exactly how I felt when I found the bodies. Not until the day I die. For me time does not heal, because my mind no longer allows for the passage of time to dull my memories. They are as vivid today as the day it happened. It’s like a picture that never, ever fades. Some people can’t go back? I really can’t go forward.”“I’m sorry.”He turned to look down at her. “I can’t process sympathy anymore,” he said. “I used to. But not anymore.”------Lancaster eyed with disdain the stripper, who was in the process of shedding her skintight Catwoman costume.“Amazes me what gets young men excited.”“It’s the same thing that’s always gotten them excited,” said Decker absently. “Pretty women in the process of taking off their clothes.”"}, {"userName": "Dianne", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/1401819-dianne", "userReview": "SEE COMMENT ADDED----->I can’t say that this is a new series by David Baldacci because the book lists it as a standalone, but the author would be a fool NOT to make this a series. It would be fresh and exciting with a ton of fascinating, quirky, hyper-smart characters. And with a mind like Mr. Baldacci’s and using this book as an example, the plotting and mysteries would be mind-boggling.Added comment ----> This is the start of a new series.As trite as this is going to sound, this book had me riveted from the very first chapter and glued to my chair for the rest of the book. I haven’t read anything by this author in a very long time and I am very sorry that I haven’t kept up with him if this book is anything to go by.The story-line was a unique one for me, as is said in the book description - Amos Decker could never forget anything. Not since dying twice the very first time he stepped onto a professional football field and into an extremely violent collision with another player. He ended up with hyperthymesia and synesthesia (and I did have to look these up just to satisfy myself that they are real conditions of the brain!). Now he is a cop or more precisely a Detective for the town of Burlington and one night he enters his home and things will never be the same for him again…even more so than when he died twice.16 months later -When something terrible happens at the town’s high school, Amos is called in by the police department to aid in this new case and from here Amos can try to put some of his life back together. I have to admit for a little while I was worried about whom exactly the murderer was. I was hoping that the author didn’t pull a Stephen King (The Dark Half). But I was wrong thank goodness, and when I found out the who and the why of it all, I was flabbergasted. The last couple of chapters are real eye-openers and will show you just how this book just screams to become a series. Actually, since the last chapter does set this up to be a series, so I hope the author does get the chance to do so.This book actually gives you something to ponder; more than just the mystery…you may walk away wondering what YOUR life would be like if you could never forget the minutest detail of your life and all that passes by you.You may finish this book, but as odd as this may sound, this book isn’t finished with you.*ARC supplied by publisher."}, {"userName": "Freda Malone", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/6938113-freda-malone", "userReview": "Wow, where do I start? Amos Decker. A former pro football player, hit so hard by the other side that he died, twice! The results, a mind that can’t forget anything, no matter how trivial. He uses it to his advantage and becomes a cop, a detective and thrives tremendously. Gets married, has a child and then tragedy strikes. His family is murdered and he can’t forget it. Much like DVR playing over and over again. The emotions come with it, making his grief feel like it happened yesterday. He loses everything, his house, his job, friends and almost his sanity. But the memories are still there, every little detail of his life after the hit. Until someone comes forward and confesses to the murder of his family. Then a mass murder, a shooting at a school. Decker’s former partner has asked for his help and he realizes these two crimes are connected and he must find out who is playing this mastermind of a game with him. Countless clues are available to him but to connect them, he must use his DVR of a mind to connect the dots, solve the puzzle and follow the leads. The killer is two steps ahead of him, leading to more clues. It was planned, premeditated, knowing what he would do next. Wow, interesting, and mind blowing crime mystery with clues that I would have never guessed. The suspense was killing me! I struggled with the name Amos Decker throughout the whole book but it didn’t annoy me enough to stop reading. Now why couldn’t the writer come up with a better sexier name? HUH? All the characters were awesome! The clues are remarkable and highly complex but I figured out a couple of them so it was quite fun to exercise my brain. I’ve read a lot of David Baldacci’s novels and I have to say, this one hits the charts! The right amount of everything and then some. I highly recommend it. Now if I can just get used to the name Amos Decker, I’ll fall in love with him just like I did with the Will Trent series by Karin Slaughter. Exceptional, creative, mind blowing, creepy, sick and awesome!! I just hope I don’t have nightmares."}, {"userName": "kartik narayanan", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/4070035-kartik-narayanan", "userReview": "Memory Man is the best serial killer mystery I have read after Silence of the Lambs, with which it shares common elements It has an excellent plot whose resolution I could not figure out until the end of the book. I was totally riveted till the end."}, {"userName": "Judy Collins", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/11063006-judy-collins", "userReview": "A special thank you to Grand Central Publishing and NetGalley for an ARC in exchange for an honest review.   Top 50 Books of 2015 Best Audiobook (tie), Best Baldacci Novel to date, Best new series (Amos Decker).David Baldacci is at the “top of this game”, with his 30th novel, delivering a riveting and absorbing new series. MEMORY MAN  a flawed offbeat hero-Amos Decker, drawing you into his world of tragedy, loss, and complexity for hours of mind-blowing intensity. With a mix of crime, cop procedural, medical, psychological, and a multi-layered mystery thriller page-turner, you cannot put down--until you reach the words, “for just a little while.”Amos Decker  would forever remember all of their violent deaths in the most paralyzing shade of blue. He would never be free from it. The night when his life changed. Former Detective Amos Decker had been on a stakeout, driving home and walks in to his worst nightmare. Red. Blood. He discovers first a knife, second a gun; his brother-in-law, Johnny, throat split from ear to ear; his wife, Cassie, a single-entry gunshot in her forehead; and lastly, his precious daughter, Molly-not quite ten years old, death by strangulation. With nothing left. He cannot stay. His family is gone. He stares at his muzzle, ready to end his life, as he was not there to protect his family. As he stares at his muzzle ready to end his life, to die, and join his family; however, for some reason unknown even to him, Amos Decker does not pull the trigger and calls 911.  In the months to come, he loses the house to foreclosure, as they were barely making the payments with his and Cassie’s salary. On his paycheck alone it was impossible. He tried to sell it; however, no one would buy a house covered in blood. He lived in an apartment for several months, then a motel, a friend’s couch to a homeless shelter, to a cardboard box in a Walmart parking lot, when he reaches rock bottom. Cassie and Molly would be ashamed. So he cleans himself up with some odd jobs and moved into the Residence Inn and hangs out his PI shingle. Amos has not had a simple life. A four-year-college football player, a professional for short stint, keeping fit as a cop and later a detective. A big, towering athlete, he was the only person from his hometown of Burlington ever to go pro. But his career ended before it had a chance to begin. On his very first play, a violent helmet-to-helmet collision knocked him off the field for good, and left him with an improbable side effect—he can never forget anything. Amos Decker’s life changed forever—twice.From that moment,  Decker's brain shifted and he lost the ability to forget. The entire world became a myriad of colors and memories that he could easily access. With his new abilities, he's the perfect candidate to become a police detective. He can visit a crime scene once and walk through it over and over again in his mind, and he can remember verbatim testimony by a witness or suspect. Decker has hyperthymesia, an extremely rare condition that makes him unable to forget anything. Two decades after suffering the hit, the blow-- Decker's life is once again unraveling, with the murder of his wife, young daughter and brother-in-law. Months later, no suspects,  and no one had been arrested for the murders of his family. A trail grown cold, and the odds of solving the case and catching the killer had dropped to near zero. He had left the police force, as he could no longer push paper, when he cared about nothing, except for “one thing”. Their deaths had to be connected with what he did; after all, he had put hundreds of people away over the years and some were out of prison now and they could have found him for revenge. But there was no scrap of evidence. No trial, No execution. His fault, His guilt.Now, fifty pounds overweight, a bum knee, and a soft gut. However, he has never been normal since the “hit” the only thing he had never remembered. Ironically, since it was the catalyst for his “never forgetting” anything else. And even the national news felt the need to document the violence done to him, on YouTube. All he had done to deserve the folderol of attention was to die on a football field, not once, but twice. He could have been written up in scholarly journals and there could have been media and money, but he had not seen himself as a prodigy. He had seen himself as a freak and no longer able to watch sports. He was just a machine and some prick was taunting him, the monster who killed his family and and now could they be turning their rage on Mansfield High School? Three years later, Decker discovers a man has turned himself in to the police and confesses to the murders, and he comes up with a brilliant plan. (Loved this part). He pretends to be an attorney to get into the cell. He has talents and gifts and he will use them to uncover the truth. He has learn the truth - Is this the monster who killed his family? Too many holes in his story. This cannot be the man, but why is he confessing? In addition, at the same time another tragedy occurs in the same town of Burlington. A high school shooting.What comes next is an intense fast-paced action mystery suspense  of connecting the past, a football career, the time when he was recovering from the hit, a police career, a new school shooting, an army base - all of which may be connected to his family’s murders, and a decade-old plan of evil, murder, and revenge. Some awesome characters contribute for some added human dynamics with Decker’s former partner, FBI agent, a reporter, and a fellow cop.Wow, I have read almost  every Baldacci series: John Puller, Will Robie, King & Maxwell, The Camel Club, The Shaw Series, and his many standalones, each being unique; however, MEMORY MAN  is captivating, from page one (My favorite). The author brilliantly sets up his character; he is humble, troubled, flawed, worn down, homeless and sharp. He can assist the authorities in ways no one else can. He had it all, and lost it all. Amos' tenacity, his gift, and his drive to find the killers, a humble hero on his journey to redemption – cleverly plotted. Amos Decker  is a stand-out character leaving fans anxiously awaiting a second book, (let’s hope), as this one is just too damn good to be a standalone. I literally dropped my other ARCs, planning to read this one for a few hours; did not stop until I reached the end. Having already pre-ordered the audiobook, before receiving an advanced reading copy, had the double pleasure of enjoying both fascinating versions. As always, Ron McLarty and Orlagh Cassidy  delivers an outstanding performance!If for some reason (cannot imagine), if you have never read David Baldacci, MEMORY MAN is a perfect place to start--your journey to being an avid fan, like the rest of us!Can't wait for  THE LAST MILE  Amos Decker #2, Coming April 26, 2016.  Judith D. Collins Must Read Books"}, {"userName": "Barbara", "userReviewDate": "Apr 27, 2015", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "3.5 starsBurlington police detective Amos Decker spiraled into despair when his wife, daughter, and brother-in-law were brutally murdered 15 months ago. He quit the police force and became homeless before moving into a cheap motel and becoming a private detective. Once a football player, the 6' 5\", 350 pound Decker is seriously out of shape. He has a unique ability, however, acquired after a massive hit ended his football career. Decker sustained a brain injury that gave him hyperthymesia - a complete, detailed memory of everything he's ever seen or experienced. As the story opens Detective Mary Lancester, Decker's old partner, tells him a homeless man named Sebastian Leopold has confessed to murdering Decker's family. Decker, posing as an attorney, manipulates his way into the jail to talk to Leopold. The homeless man, who appears to have mental problems, claims he killed Decker's family because the detective dissed him at a 7-Eleven. Just when Decker is sneaking into the jail to speak to Leopold a mass shooting occurs at local Mansfield High School, killing a number of staff and students. Because he was an excellent detective Decker is asked to consult with authorities on the Mansfield High School murders. He uses his extraordinary memory to help the cops and FBI search for the high school shooter and to look into Leopold's bogus-sounding confession. Decker uncovers one clue after another in the mass shooting case, which turns out to be an intricate plot that has a connection to the murder of Decker's family. Along the way Decker, a socially inept loner, has some hostile interactions with an FBI agent and a newspaper reporter who want his cooperation. Eventually, though, Decker manages to work with others on the investigations. This is a well-written, engaging, fast-paced mystery that kept my attention as the actions and motives of the perpetrator were exposed. My biggest problem with the plot is that both Decker - and especially the FBI - seem too slow on the uptake in unraveling some of the clues. Without giving away any spoilers I'll just say that, in real life, the FBI would probably have exposed/understood some clues well before Decker had his 'aha moments'. This may be necessary for the story's plot but it doesn't ring true. Moreover, given the motive, I would have expected the perpetrator to do some things quite differently. Still, the book kept my interest from beginning to end and I would read more books about detective Decker's exploits. I'd recommend Memory Man to mystery fans.You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Jim", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/695116-jim", "userReview": "Quite a twisty plot & a hero with a neat difference that was well narrated. Decker's memory & its side effects make for an interesting story all on their own. Trying to solve a very complex, well thought out mass murder makes it even better. Unfortunately, it was repetitive I often drifted off & almost quit listening. The same points & phrases were told over & over. If the book had been half the length, I would have given it at least another star, but I doubt I could go to 4 stars because there were too many places where the plot seemed convenient, not as well thought out as they should have been. Also they were totally unknowable by the reader.Some mysteries aren't meant to be solved by the reader, but others lean that way. This one seemed to most of the time, but then Amos would walk off without telling anyone anything & Baldacci would pull something out of thin air to make the most of his remarkable memory. It got as old as the repetition since it was telegraphed so well.It looks like Baldacci started being published about 20 years ago & did mostly stand alone novels. Now he's doing series & writing as if he's paid by the word. I detest padding. I gave one of his books 3 stars, another I quit reading, & now this is getting 2 stars. I'll have to try one of his older standalones to really decide, but I don't think his writing is for me."}, {"userName": "Kasia", "userReviewDate": "Jun 14, 2015", "userURL": "http://www.goodreads.com/user/show/8024272-kasia", "userReview": "Mary Lancaster is the dumbest police partner for Amos Decker Baldacci could've ever created. I'm half way through the book and Mary Lancaster did not utter a single one coherent sentence. She just sits there hopelessly in the background of the story and ask idiotic questions! Someone please give her one spare brain cell! I hope she dies soon or gets fired or something. Story overall is good but someone's got to go. Me or Mary? The answer is no brainer(!)"}, {"userName": "Lewis Weinstein", "userReviewDate": "Jun 27, 2015", "userURL": "http://www.goodreads.com/user/show/2231715-lewis-weinstein", "userReview": "The first criterion for a 5***** rating is whether I wanted to keep reading; I really wanted to keep reading this one. The 2nd is whether I cared about the main character, which I did, despite his many serious flaws. Amos Decker is fascinating, and several other characters were also quite interesting. The plot line is a little stretched, but generally holds up, with some surprises along the way. The main strength of the book, however, is how Baldacci portrays what goes on inside Decker's seriously disturbed brain. Some reviewers objected to the repetition but I thought that was one of the main strengths of the book."}, {"userName": "Ali", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/4853490-ali", "userReview": "Great ReadDavid Baldacci is a great story teller. His characters are always interesting. This was a great story despite Amos Decker losing his family. I'm looking forward to reading the next book in this series."}, {"userName": "Gary ", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/27528763-gary", "userReview": "This book s far better than the others I have read by this author. It gripped me throughout. I had difficulty putting it down. Amos Decker is a great character, and the atmosphere,plot, and pace was exactly what I look for in a book. This is the best book I have read in a long time."}, {"userName": "Matt", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "Another new Baldacci series, as fresh as many of his past collections. Amos Decker has suffered much in his four decades but steered himself away from disaster. A football accident left him with a number of neurological conditions: razor-sharp mental acuity, photographic memory recall, and grapheme synesthesia (less glamorous than the run-of-the-mill superhero). While conditions proved somewhat helpful during his time as a police officer, it also hindered him socially, akin to those with Asperger's. Arriving home one night to find his family slaughtered, Decker detached from all he knew and blended into the world of the homeless. A man's confession to the murders gives Decker some hope of closure, however faint, while the rest of the force handles a school shooting. Issues with the confession leave Decker wondering if there are others behind the murders, using this man as a pawn. His time on the force remembered, Decker helps piece together some key aspects of the shooting, whose randomness disintegrates the more Decker explores. Leading the team across the country, Decker soon learns that both sets of murders may be interconnected and that he may know the killer, without knowing how. A powerful new thriller series that tackles neurological issues and medical anomalies, Baldacci finds new ways to refresh his writing and keep readers wanting more.Baldacci has had a productive career, penning numerous thrillers which have climbed the bestseller lists around the world. He is a fan of series writing and seems to know just when to choose the road not taken, before his characters get stale and the readers turn away. With the introduction of another series, readers can look forward to some fresh ideas and angles of approaching similar cases. Amos Decker brings a flavour I'd most likely find in one (or two) of the Camel Club members, rejuvenating one of Baldacci's earlier and highly successful series. The writing style is fresh and the humour as dry as ever, with a few teachable moments to leave the reader a little smarter when all is said and done.Kudos, Mr. Baldacci for your wonderful addition to the mystery and thriller genre. I look forward to seeing what Amos Decker has in store in the years to come.Like/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/"}, {"userName": "Lisa Jameson", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/449544-lisa-jameson", "userReview": "What a disappointment. I have read most of his books...this one was a big disappointment! Amos Decker is a former NFL player turned cop. A hit on the head that ended his football career also altered his brain in such a way that he has a photographic memory. His wife and family are brutally murdered and Amos falls apart...until someone shows up at the police station 16 months later to claim responsibility for their deaths.The story has promise, but ended in a clustered mess. The perpetrator who commits truly hideous crimes against him and other innocents was a victim! He ends up taking responsibility for the brutal murder of his family because he used a \"trigger\" word?!!!!! Seriously, wth?! If you want an honest thriller that isn't a pandering mess? Read Brad Thor. This one isn't worth your time."}, {"userName": "Steven Walle", "userReviewDate": "Sep 25, 2015", "userURL": "http://www.goodreads.com/user/show/37850168-steven-walle", "userReview": "I enjoyed this book. David Baldacci takes us through a complicated ceries of murders. The detective who is handling the case suffers from a brain injury from his days in the NFL. He died twice on the field and when he was revived for the last time he was a completely changed man. He now suffers from something called Hyper Thymaside which means is unable to forget anything he experiences and an other disorder which causes him to see things in colors and numbers. While dealing with this he must figure out who is responsible for the murders of his family and a mass killing at a local highschool.Baldacci keeps you at the edge of your chair and ready to turn page after page to see what happens next. Enjoy and Be Blessed.Diamond"}], "description": "Amos Decker's life changed forever--twice.The first time was on the gridiron. A big, towering athlete, he was the only person from his hometown of Burlington ever to go pro. But his career ended before it had a chance to begin. On his very first play, a violent helmet-to-helmet collision knocked him off the field for good, and left him with an improbable side effect--he can never forget anything.The second time was at home nearly two decades later. Now a police detective, Decker returned from a stakeout one evening and entered a nightmare--his wife, young daughter, and brother-in-law had been murdered.His family destroyed, their killer's identity as mysterious as the motive behind the crime, and unable to forget a single detail from that horrible night, Decker finds his world collapsing around him. He leaves the police force, loses his home, and winds up on the street, taking piecemeal jobs as a private investigator when he can.But over a year later, a man turns himself in to the police and confesses to the murders. At the same time a horrific event nearly brings Burlington to its knees, and Decker is called back in to help with this investigation. Decker also seizes his chance to learn what really happened to his family that night. To uncover the stunning truth, he must use his remarkable gifts and confront the burdens that go along with them. He must endure the memories he would much rather forget. And he may have to make the ultimate sacrifice.Memory Man will stay with you long after the turn of the final page.", "title": "Memory Man\n      \n          (Amos Decker #1)", "url": "https://www.goodreads.com/book/show/23153154-memory-man", "average": 4.05, "cover": "https://images.gr-assets.com/books/1421788503l/23153154.jpg", "reviews": 4718, "authors": [{"url": "https://www.goodreads.com/author/show/9291.David_Baldacci", "name": "David Baldacci"}], "type": ["Mystery", "Thriller", "Fiction", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/23153154-memory-man", "http://www.goodreads.com/book/show/25697900-memory-man", "http://www.goodreads.com/book/show/25198296-memory-man", "http://www.goodreads.com/book/show/23153227-memory-man", "http://www.goodreads.com/book/show/24356703-memory-man", "http://www.goodreads.com/book/show/23153156-memory-man", "http://www.goodreads.com/book/show/24350614-memory-man", "http://www.goodreads.com/book/show/15159.Absolute_Power", "http://www.goodreads.com/book/show/15158.The_Camel_Club", "http://www.goodreads.com/book/show/12849385-the-innocent", "http://www.goodreads.com/book/show/11007587-zero-day", "http://www.goodreads.com/book/show/204276.Split_Second"]}