{"ratings": 186887, "userreviews": [{"userName": "mark monday", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/131922-mark-monday", "userReview": "this book has a lot of fans. that makes some sense. magazines are certainly very popular, and this is magazine writing at its most polished. Berendt knows how to create an atmosphere. he knows how to describe things in a style that is careful, subtle, and enfused with a deadpan but rather mischievious irony. he can certainly describe the way a rich man's house looks - so well that you could then describe it to someone else as if you've been there. characters are sketched with an expert's hand - using a combination of physical details and the telltale mannerism or two - \"objective\" but rather sympathetic. the mystery at the heart of this novel is an absorbing one. and the book's central figure - the maybe-a-murderer - felt like he was an iteration of the film JFK's Clay Shaw, as played in an unusually fancy style by Tommy Lee Jones. which i liked, at first.so why only 2 stars? well, it is polished magazine writing. it does not transcend, it does not delve deep. there is the slow but increasingly annoying realization that Berendt sees our anti-hero as a kind of social peer, which for some reason really bothered me. who knows, maybe i just automatically hate the rich & parasitic. Berendt writes about a whole gallery of characters, all characterized briefly but adroitly, and eventually i realized i was reading a classier version of a tourist-eye's view of Southern grotesques, a drive-by tour of weirdos. how aggravating! who knows, maybe i just automatically empathize with the weirdos and am annoyed by the normals. and then there is the sad fact of THE LACK OF BLACK PEOPLE WHO COME ACROSS AS REAL PEOPLE. yes, they are there (several) but for the most part they are part of the gallery of grotesquerie. this novel takes place in a part of the country that has a huge black community and i found the lack of this demographic - even ones who, i suppose, Berendt would consider non-grotesque - to be perplexing and troubling."}, {"userName": "Taylor", "userReviewDate": "Apr 24, 2007", "userURL": "http://www.goodreads.com/user/show/32865-taylor", "userReview": "Note, February 2014: I was just rereading this review, and FUNNY STORY, I moved to a small town. Not so much a big city person as I had originally thought...Original review, circa 2007: I love this book to the point where I don't even really know what to say about it, because nothing I can say about it will be good enough to explain just how incredible this book really is.After reading this book, I had to restrain myself from booking a flight to Savannah. It makes you want to be there, it makes you want to know the people, it makes you want to pick up and find a place just like it so you can move there. I am a city person through and through, but this book made me want to move to a small town. The characters are so remarkable, so interesting that you can't believe they are real people. This books makes you proud to be a human being as much as it makes you laugh at our ridiculousness.A NOTE ABOUT THE MOVIE: don't see it before you read the book. (but if you have seen the movie and haven't read the book, please read the book because it's so much better.) while the movie essentially leaves no doubt about the actual account of the murder that it focuses around, the book does not. and the book is also not nearly as centered around Jim Williams as the movie is."}, {"userName": "Richard Derus", "userReviewDate": "Jan 27, 2012", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "BkC7)Delicious, shimmering prose. Wonderful story. Savannah really should give Mr. Berendt a pension.Well now, I have to dim my searchlight to a streetlight. Still think it's good but now, well, now I can't see past the one-hit-wonderness to the glories I once took for granted.Rating: 3.75* of fiveThe Publisher Says: Shots rang out in Savannah's grandest mansion in the misty,early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else. Midnight in the Garden of Good and Evil is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic.My Review: Bored Manhattanite journalist realizes, back in the 1980s, that lunch at a trendy restaurant costs more than air fare to a sexy Southern retreat (those were the days!) and the resulting experience was more lasting. So John Berendt becomes a commuter to Savannah, Georgia, which is the American Bath for sheer physical prettiness, though quite a lot hotter.Being a good journalist, he meets everyone worth meeting, and being a gay man, meets the entire A list of gay life in this small city in record time. Then he stumbles into an amazing story of murder and skulduggery among the social elite as the elite intersects with gay and gay-for-pay culture.Along the way he talks to every single interesting person in Savannah and builds a word-picture of its typically Southern hierarchical social scene. As The Lady Chablis, an African-American drag queen would say, \"Flawless!\"Not exactly flawless, but wonderful. Southern characters abound, including the old root woman who introduces Yankee John to the world of the haints and spirits and loa that Southerners, even the Babdiss ones, are aware exists, even when they scream and rail about it as evil, wrong, bad...well, they do that about sex too, and with as much effect.Cemetery dirt is a powerful ingredient in the sympathetic magic the old root women practice. Where it comes from, that is whose grave it was, matters, as do many other factors, and Yankee John reports with wide-eyed fascination on the entire experience of getting involved in the magical universe to help an accused murderer.The end of the story is, very sadly, the end of a single book career. The City of Falling Angels notwithstanding, this is Mr. B's one book. Fortunately, it's a very good one. Unfortunately, it's the only one. And so I ding a half-star off for literary incomplete pass. But it's a helluva read!\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "VictoriaNickers", "userReviewDate": "Mar 26, 2013", "userURL": "http://www.goodreads.com/user/show/18761799-victorianickers", "userReview": "One of the best 'true crime' book I have ever read. Every inch of the story is fascinating. It reads like a novel. I actually had to keep reminding myself that it was, in fact, a true crime book. From the very first chapter I felt drawn in. I immediately wanted to go to Savannah and see it for myself. So often in true crime books the characters are a little flat. Berendt was really able to make them come to life. His writing made the whole city come to life. His ability to infiltrate the seemly exclusive Savannah society and do such an awesome character study was amazing. The personalities in the book are so bizarre and fantastic. It is almost hard to believe that they all live in a small city together. It had almost the same Southern society vibe to it as Time to Kill. The focus was not so much on the crime but rather the mesh of characters are interwoven into the plot (if I can call it that). In to my re-read pile it goes! Just found out that it's a movie with Kevin Spacey. Wonder if it's on Netflix?"}, {"userName": "Annet", "userReviewDate": "May 28, 2008", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "Extraordinary story and characters, slow read, some parts for me were a bit hard to get through, that's why four stars and not five. A classic though. Loved it. Now I want to go to Savannah too....Another early review of mine coming up... how times flies.Oh my, I loved this book!"}, {"userName": "Jonathan Ashleigh", "userReviewDate": "Mar 22, 2017", "userURL": "http://www.goodreads.com/user/show/33737465-jonathan-ashleigh", "userReview": "The writing was great, the story was led into in an interesting way, but the trial was trivial and so were many characters that were introduced in the first half of the book. But, I liked reading about them anyway and, while the book came together well in the end, the whole thing wasn’t cohesive. That said, I feel like I should have more good things to say about a book I enjoyed reading so much."}, {"userName": "Lena", "userReviewDate": "Oct 11, 2007", "userURL": "http://www.goodreads.com/user/show/220791-lena", "userReview": "There was a lot of hype around this book a few years back, but in this case I think it is actually deserved. For one, Berendt is a skilled writer who understands how to tease a compelling story out of the material he’s working with. And, oh, what material! The true-crime mystery at the center of the book—whether the social-climbing, closeted gay antiques dealer shot his lover in cold blood or self-defense—is interesting enough, but Berendt decorates that story with outrageous character portraits of Savannah’s very oddball residents. Whether he’s discussing the quirky, old-South rituals of the Married Women’s Card Club or the disturbed local genius who may or may not be plotting to poison the town’s water supply, Berendt kept me so engaged I relished every moment. Be wary of the movie version of Midnight, though. Good actors, bad adaptation. If you like the book, however, you may want to watch it just to see the notorious drag queen play herself. Sometimes, truth really is better than fiction."}, {"userName": "Adam", "userReviewDate": "May 07, 2007", "userURL": "http://www.goodreads.com/user/show/37501-adam", "userReview": "This was a decent book. There was a lot of mood, of which I'm a big fan. The characters all had the potential to be very interesting, but unfortuately, they weren't developed. That's not to say you don't spend a lot of time with them, or find out anything about them, it's just that you don't really give a damn. The book is written by a magazine journalist who ends up living on and off in Savanah, GA for eight years to investigate and chronicle a murder and it's trials. This book is more or less one long magazine article, detailng the events, and lives, but never really giving you sympathy for any of the characters. It does a fine job of keeping the mystery of whether Jim Williams really did the deed a secret, but in comparison to In Cold Blood by Truman Capote (which I'm reading currently) this is not worth the effort."}, {"userName": "Tea Jovanović", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Ova knjiga je jedan od meni najdražih prevoda, i žao mi je što film nije pomogao knjizi... Naime, knjiga obiluje živopisnim likovima, a Klint Istvud je u svom filmu samo načeo te likove, a nijednog nije u potpunosti prikazao... Ono što je posebno interesantno u vezi s ovom knjigom jeste to da je ona potpuno promenila život učmale Savane u Džordžiji... Gradić koji ne voli promene, koji ne voli savremene tekovine, odjednom se našao pod najezdom turista koji su se tu sjatili posle čitanja ove knjige... Bila je veliki hit krajem prošlog veka... :)"}, {"userName": "Amanda", "userReviewDate": "Jul 11, 2008", "userURL": "http://www.goodreads.com/user/show/1219253-amanda", "userReview": "Murder, gullah, drag queens (these are a few of my favorite things . . .) There's probably not much I can say about this book that hasn't already been said, but that won't stop me. I saw the movie when it first came out and loved it, but just never got around to reading the book. I thought that the entire book would be about the murder trial of Jim Williams, the prominent Savannah antiques dealer accused of murdering Danny Hansford (with whom it was rumored he was having a sexual relationship). While a generous portion of the book is dedicated to the details of Williams's four trials, the book is much more than that. This is a collection of stories about the people and history of Savannah--some of it true, some of it embellished, and some of it flat-out fabricated. The characters are eccentric, but likable (particularly The Lady Chablis--the foul mouthed drag queen who has labeled herself \"The Grand Empress of Savannah;\" she's by far my favorite character, followed by Minerva, the fascinating practitioner of voodoo). And, while I knew he was probably a scoundrel, I also liked Jim Williams, who insisted on continuing to live in Savannah because \"it pisses off all the right people.\" There was a lot of discussion at book club as to whether this should be classified as fiction or non-fiction. Here's my verdict: who cares? If the story is entertaining and well told, whether or not it's 100% factual shouldn't make a whit of difference to anyone who is looking to be entertained. It should also be said that the cover art for the book is perfect. The bird girl of Bonaventure Cemetery stands there like Savannah itself, prim and old-fashioned, holding out both good and evil--head cocked in curiosity to see from which bowl her citizens will take.Cross posted at This Insignificant Cinder"}, {"userName": "Montzalee Wittmann", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/32532051-montzalee-wittmann", "userReview": "Midnight in the Garden of Good and Evil: A Savannah Story by John Berendt is a weird story about even weirder people! I would be gone from that town soooo fast. What creepy people! With the strange people you knew the murder mystery would be just as creepy, but not good. Easy to figure out that Jim and Danny were lovers right away. Why hide it in this town? You have a man that only puts make up on one eye, a man who walks an invisible dog, a man that hordes enough poison so he can at sometime kill everyone, and a transvestite dating a man. These are the sane people! I wasn't impressed with the writing, the plot, or the mystery. His weird characters were weird but that was it. Not my kind of book."}, {"userName": "Phrynne", "userReviewDate": "Feb 26, 2015", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "I found this one a struggle. Several times I stopped and looked the title up again on Goodreads to make sure it really is non fiction. Surely all those weird characters could not really have existed in one place. Surely there must have been a huge amount of artistic licence going on. The court cases themselves rang true but ended up not being a major part of the book. Two stars because the author writes well. My struggle to read it was based purely on disbelief and not at all on the quality of the book. Disappointing."}, {"userName": "Jess ❈Harbinger of Blood-Soaked Rainbows❈", "userReviewDate": "Dec 06, 2011", "userURL": "http://www.goodreads.com/user/show/7125124-jess-harbinger-of-blood-soaked-rainbows", "userReview": "3.5 stars rounded up to 4B is for BerendtRead a book with antonyms in the titleSo I just realized that I totally forgot to review this one.....idiot moment #85749\nFor me, Savannah's resistance to change was its saving grace. The city looked inward, sealed of from the noises and distractions of the world at large. It grew inward, too, and in such a way that its people flourished like hothouse plants tended by an indulgent gardner. The ordinary became extraordinary. Eccentrics thrived. Every nuance and quirk of personality achieved greater brilliance in that lush enclosure than would have been possible anywhere else in the world.\nThis is probably one of the best nonfiction tales I've read in quite awhile. In fact, many times I felt like I was reading a novel. Berendt's writing style is comfortable, approachable, and conversational; everything I want in a narrative nonfiction book. The characters were so interesting and dynamic, and the setting is SAVANNAH for crying out loud. Each idiosyncratic and vivid identity depicted within these pages seems like something out of a novel, so I loved loved loved that they all are, in fact, real, living, breathing human beings who lived in Savannah when this book was written.From an eccentric gay antique dealer who may or may not have murdered his young, redneck, playboy lover in cold blood to a beautiful trash-talking drag queen (my personal favorite of the bunch) to a mysterious and slightly loony voodoo priestess to a penniless womanizing philanderer, these characters were all extremely memorable and were my favorite part of this book. The setting of Savannah, a character in itself, was perfect and made me want to plan a trip there soon.Where this book lost me a bit was the long and detailed murder trial of Jim Williams. It was oddly thrown in halfway through, and while I enjoyed knowing what would happen, it was written as the principal story among all the other stories, and the one I found the least interesting. So I was a little disappointed that it took up the most real-estate. I needed more of Chablis and her fierce attitude, Joe Odom and his pretty but naive fiancee, Mandy, and Minerva's voodoo. I would have taken 300 more pages of their stories.The real bits, the pieces of factual information I gained about Savannah's culture and history were an added bonus to the story, but the magic of this is in the characters. Read this book for them. They are better than most fictionalized people you will ever meet."}, {"userName": "Maxwell", "userReviewDate": "Jul 26, 2015", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "The perfect mix of character study and courtroom drama, Midnight in the Garden of Good and Evil paints a fascinating picture of Savannah, Georgia. It's a moody, atmospheric novel that draws you in with its exquisite descriptions and eccentric cast. There are aristocratic snobs and drag queens, punk rock teens and possibly murderous millionaires. It all sounds a bit too good to be true--based on a series of real events from the 1980's-- and maybe it is. But nonetheless, it's wildly entertaining and compulsively readable. I'd recommend the audiobook because there are a few slow moments that I might not have been motivated to read had I been reading it in physical form. Fans of the podcast Serial might enjoy this one for it's court aspect, with the added bonus of some zany and memorable characters. 4 stars"}, {"userName": "Jacob Overmark", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/41670556-jacob-overmark", "userReview": "We are going South, Deep South … and here we like to keep them things as they always were, when our fathers fathers fathers build Savannah. After all this are the 80-ties and we may have heard of the outside world, but we´re not gonna go there!Yearh, there may be an alarmingly high murder rate, but it´s nothing to do with us decent people, we have our country clubs, our yacht clubs and our good ol´ money in the bank. So, getting into the social life of Savannah is no easy job. Either you are ol´ money or you are very well connected, it´s going to be a steep climb to the top layers of society. But, hard work and skills and not least a rare talent for the antiquity business gets Jim Williams there. Everything passing through the hands of Jim Williams seems to turn into a success. That is until … seemingly, a murder takes place in Mercer House and there is only one obvious suspect, Jim Williams. Friends and foes alike are now witnessing the months up to the trial which will determine if Jim Williams is a cold-blooded murderer or an innocent man, only guilty of defending his life, and even the social interest dwindle some in Savannah, the readers are following the next 8 years with trial and retrials. John Berendt chronicles Jim William´s life over the span of 8 years, but not only that.We are also given a comprehensive guided tour of Savannah, it´s history, architecture, demographics, sports and a lot of celebrity gossip. From the coffee shop to the diner to the jazz club and various churches and the all black “introduction ball”, we get to know the charismatic, eccentric and downright weird people of central Savannah.Are there no “ordinary people” around? Certainly, but John Berendt pays them a little less attention as there are so many colorful characters eager to play a role in the story.We will meet Lady Chablis, the drag queen, Minerva, the voodoo mistress, William Glover who walks the non-existent dog which entitles him to an allowance. There is the former lawyer, fallen on hard times and the in-high-demand black lady who cooks heavenly. Not to mention the guy with the most poisonous substance outside Russia who occasionally dreams of poisoning the whole town – btw his sometimes lady friend was a glamorous ad model in Life in the 40-ties and 50-ties, not so glamorous anymore.Now you think this is made up, it cannot possibly be true that so many out-of-the-ordinary characters are all in one place. I don´t know, but all persons in the “faction” are built on real people, I guess Savannah is extraordinary in that aspect.Apart from changing sequences a bit here and there, the book describes the actual events and John Berendt does this with great skill.It is “True Crime” before the genre was invented, and it does not follow the recipe of the genre. Instead, John Berendt is providing us with so much background material that the local tourist board ought to thank him. They do not though, if you take a guided tour of Savannah today, Jim Williams – and John Berendt are not mentioned, only Mercer House. A solid 5 star experience, in a genre I really did not expect to find so riveting. Bonus info: The title alludes to the hoodoo notion of \"midnight,\" the period between the time for good magic (11 pm to midnight) and the time for evil magic (midnight to 1 am), and \"the garden of good and evil,\" which refers principally to the cemetery in Beaufort, South Carolina, where Dr. Buzzard, the husband of Minerva, the folk-magic practitioner who figures in the story, is buried. It is over his grave that Minerva performed the incantations to ensure a more successful result in the retrial for the case of Jim Williams."}, {"userName": "Jake", "userReviewDate": "Aug 24, 2011", "userURL": "http://www.goodreads.com/user/show/1821338-jake", "userReview": "\"Midnight in the Garden of Good and Evil\" is ostensibly about the macabre truths that lie behind Savannah's gentile facade. As you might expect, these are of a distinctly Gothic nature. Imagine a travel guide written by Tennessee Williams. We are invited to marvel at some familiar grotesques: the homosexual in a smoking jacket, the socialite drunk at noon, the young hustler with a Red Camaro, the outrageous trannie, the witch doctor. All of this is presented with a light touch, even as the parade of anecdotes transitions to an expose of a celebrated murder case. It makes for a fun read, and it's easy to see why this book reinvented the Savannah tourist scene and stayed on the best seller list for five straight years. But as with Capote's \"In Cold Blood\", it's interesting to explore exactly where this memoir diverges from the truth- what lies hidden behind the narrator's engaging facade? Berendt comes across as a good-natured everyman, a writer newly settled in town, just taking a look around. Of course, he was a good deal more than that: the famous ex-editor of New York Magazine, and more importantly, perhaps, a gay man. This background explains his easy entree into the life of Jim Williams, the anti-hero of the book. Rich, handsome, secretive, and gay- a man not too dissimilar from the narrator: He was tall, about fifty, with darkly handsome, almost sinister features: a neatly trimmed mustache, hair turning sliver at the temples, and eyes so black they were like the tinted windows of a sleek limousine - he could see out, but you couldn't see in. We were sitting in the living room of his Victorian house. It was a mansion, really, with fifteen-foot ceilings and large, well-proportioned rooms. A graceful spiral stairway rose from the center hall toward a domed skylight. There was a ballroom on the second floor. It was Mercer House, one of the last of Savannah's great houses still in private hands. Together with the walled garden and the carriage house in back, it occupied an entire city block. If Mercer House was not quite the biggest private house in Savannah, it was certainly the most grandly furnished.Much has been written about Berendt's many elisions and emendations of the strict truth: the way he rearranged the timeline of the murder at the center of the book to narrate it in the first person, the \"degaying\" of the murder victim, the changing of names and invention of composite characters. This is all worth thinking about, but I'm more interested in a different class of distortions: what hidden biases does a rich, gay northerner bring to a description of the South?First, there is the previously mentioned delight in the grotesque. This is a tendency of all northern authors to reduce people in the South to types. Berendt does some of this, and while the reduction makes for good story-telling, you can't help but wonder what kind of truth it leaves out of the picture. Second, as a white northerner, the author has little access to the Black culture of the city- and apart from a short chapter about a Black cotillion, the only Black faces we see in the story are trannies, witch doctors, and servants. This probably misses some deeper truths about the city. Finally, as a wealthy gay man, Berendt's sympathies seem clearly biased towards Jim Williams, with whom he shares more than a little in common (Berendt currently lives in a mansion on the Upper West Side decked out not-too-different than Williams' house in Savannah.) How does this change his story? I'm not sure- but it would probably be better if he addressed it himself when he was writing it.So what are we to make of all of this? Capote's \"In Cold Blood\", despite its flaws and half-truths, told a profound story of human nature and the depths to which people can sink. \"Midnight in the Garden of Good and Evil\" tells an entertaining story about the degree to which you can beat a murder rap if you have a house filled with a couple of million dollars worth of antiques. That doesn't mean it's not worth your time: it's just not as important a book as its fame would suggest."}, {"userName": "Laura", "userReviewDate": "Jun 12, 2010", "userURL": "http://www.goodreads.com/user/show/900147-laura", "userReview": "Just arrived from Finland through BM.What a pity this book ended. I must find a way to visit this beautiful city of Savannah. The story is about the trial of Jim Williams, a Savannah's socialite and an international antiques dealer, crazy by the famous Faberge eggs, which was accused of the murder of Danny Handsford. After had discovered that a super-saver fare to Savannah cost the same as an entree in a Manhattan restaurant, the author spent eight years fitting between these two cities. In this way, his travelogue is intertwined with Williams' story that have been tried four times in a middle of a legal battle. A remarkable piece of work by John Berendt and I am looking forward to read more books by this author. Below, some wonderful houses in the Victorian District in Savannah: Williams’ Mercer house, Lee and Emma Adler House and The Hamilton-Turner house mentioned to this book. \n\n\nBut what about the Bird Girl Statue? According to Wikipedia, \"only four statues were made from the original plaster cast. The first went to the Massachusetts garden. The second was sent to Washington, D.C., and is now located in Reading, Pennsylvania. The third was purchased by a family in Lake Forest and has never relocated. The fourth and most famous statue was bought by a family in Savannah, Georgia, who named it Little Wendy and set it up at her family's plot in Bonaventure Cemetery in Savannah, Georgia.\"A film adaptation of Midnight in the Garden of Good and Evil in 1997, directed by Clint Eastwood, where Kevin Spacey played the role of Jim Williams."}, {"userName": "Shawn", "userReviewDate": "Nov 27, 2016", "userURL": "http://www.goodreads.com/user/show/21117192-shawn", "userReview": "4.5 starsI was psyched to read this, and I'm so glad I wasn't disappointed! The writing is atmospheric and cinematic, and the author does such a great job capturing the voices of the various characters he encounters, with all their quirks and eccentricities. The whole book is perfectly enjoyable and fascinating, but the second half definitely feels a bit stronger than the first, simply because it becomes more focused rather than each chapter centering around a different character the author encounters.Definitely a new favorite!"}, {"userName": "Fuchsia  Groan", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/14848732-fuchsia-groan", "userReview": "Desde que John Berendt publicó Medianoche en el jardín del bien y del mal en 1994 el libro se situó durante años en la lista de best sellers de no ficción del New York Times. Además, el aumento de los visitantes de la ciudad de Savannah (Georgia) fue notable desde ese momento, y es que no es para menos: en la primera parte de la obra tenemos una crónica social brillante de esa pintoresca ciudad sureña, atractiva por su historia, su arquitectura y sus habitantes, plagada de cotilleos, de pequeñas historias algo inconexas pero interesantes sin duda. En la segunda mitad nos adentramos en el crimen que dio origen al libro y en el posterior juicio, que ya conocía por la brillante película de Eastwood.Desde luego la obra es difícil de clasificar, como dice la sinopsis, a medio camino entre la novela de viajes, la crónica social, el trabajo periodístico e incluso el thriller (aunque a quien vaya buscando esto último le digo desde ya que este no es su libro). Y esta mezcla es quizás lo que menos me ha gustado, aunque como narrador no haya nada que criticarle a Berendt, al dar vida a la historia a mí me ha costado un poco introducirme en ella al lado de los personajes, brillantemente presentados y descritos, por los que me he interesado y he buscado información, pero que no he visto vivos (la mejor, sin duda, Lady Chablis, que se interpretó a sí misma en la película)."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "I first read this book some 15 years ago, after being lent it by a friend.I now have my own copy. It is a book I go to every few years for a visit. And I must be due for another visit sometime soon."}, {"userName": "Karen", "userReviewDate": "Oct 18, 2007", "userURL": "http://www.goodreads.com/user/show/255879-karen", "userReview": "Although I enjoyed it, I think this book could have been much better. The first half is largely a series of character studies, and the second half is essentially a true-life crime novel. Unfortunately I grew dangerously bored with the first half, and as the mystery unfolds, I grew annoyed that many of the characters introduced in the first half really have little play or impact on the rest of the book. The murder mystery itself is an interesting story but is very anticlimactic. While the book is nonfiction, and in that sense rather remarkable that the author experienced these people and events, I perhaps would have liked the author to instead written a much more compelling fictional work inspired by Savannah and the circumstances included in the book."}, {"userName": "Madeline", "userReviewDate": "Mar 21, 2012", "userURL": "http://www.goodreads.com/user/show/111921-madeline", "userReview": "\"An idea was beginning to take shape in my mind, a variation of my city-hopping weekends. I would make Savannah my second home. I would spend perhaps a month at a time in Savannah, long enough to become more than a tourist if not quite a full-fledged resident. I would inquire, observe, and poke around wherever my curiosity led me or wherever I was invited. I would presume nothing. I would take notes. Over a period of eight years I did just that, except that my stays in Savannah became longer and my return trips to New York shorter. At times, I came to think of myself as living in Savannah. I found myself involved in an adventure peopled by an unusual assortment of characters and enlivened by a series of strange events, up to and including murder. But first things first.\" Man, it must be great being John Berendt. He can just decide, seemingly on the spur of the moment, to move to another state or country and spend years living there, apparently doing nothing except wandering around meeting all the weird locals and writing stories about them, which he then cobbles together into a loosely-connected narrative and publishes for lots of money. I am extremely jealous of this. (and, on the off chance that John Berendt is reading this review: Mr. Berendt, consider this my application to be your sassy young assistant. Can we go to Prague next?)When I saw the movie version of this book, I had a hard time believing that it was based on a nonfiction book. Surely real life could never work out so perfectly: a big-city writer moves to a close-knit Southern town full of eccentric rich people, and then one of those eccentric rich people shoots his gay lover after an argument that no one witnesses, leaving a suspicious crime scene and even more suspicious circumstances. Also there's a Voodoo priestess and a drag queen, because why the hell not. Even after finishing the book, I still have a hard time believing that Jim Williams actually existed, that he actually shot his lover, that he actually spent eight years in and out of court trying to prove that he didn't plan to murder anyone, and that at the end of his ordeal he died suddenly in the same room where he shot the man, in the same place he was standing when the original argument occurred. Surely you can only make this shit up, can't you?Midnight in the Garden of Good and Evil is a fun read. The characters are endlessly quirky and odd, the events Berendt witnesses have to be read to be believed, and the murder mystery that the book revolves around will delight any detective novel fan. Even Berendt himself emerges as a minor character in the story - even though he refrains from giving his opinions of the events or people described, he's a constant presence in the story, describing his conversations and actions as if the book really is just a fictional account narrated in first-person. Many of the book's chapters, it should be said, don't relate at all to the murder mystery, but they were so interesting it didn't even bother me. (perhaps I should have read this book before trying Berendt's newest book, The City of Falling Angels, because I remember being frustrated that more chapters didn't relate to the Fenice fire - but then again, they weren't as good as the stories in Midnight)And Now A Note on the Movie: I won't say it's better than the book, but it's a pretty good adaptation. Jude Law was a great choice for Danny, as he's a perfect mix of sexy and unstable, and Kevin Spacey was very well cast as Jim Williams. Two gripes only, and they relate: the character of Mandy in the book is a minor one, and although she's blonde in the book, mentions that she was Miss BBW Las Vegas - so not the skinny blond piece portrayed in the movie. Also, she and Berendt's character are never even close to romantically involved in the book because, as I learned from another review, John Berendt is gay. I really really wish they had kept this detail in the movie (or rather, added it, since Berendt makes no mention of his own sexuality in the book) because first it would have eliminated the stupid romance subplot, and also because it would have put John Cusack's interactions with Lady Chablis in a much more interesting light. But we can't have everything."}, {"userName": "ALLEN", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/58158333-allen", "userReview": "One advantage of bringing fresh eyes to an old town like Savannah, Georgia, is that the newcomer can cross social, racial, religious and economic lines with relative ease, and reporter John Berendt made the most of it in this bestseller. Midnight is a penetrating look at Coastal South culture that is zestily written and a hell of a lot of fun to read. While I enjoyed the ensuing movie very much, I like the book even more because it can take more time doing its job -- basically following a very bemused New York reporter (Berendt) around in search of answers to a controversial murder, as he crosses paths with Uga the \"Damn Good Dog,\" meets Luther the \"fly man,\" gets special permission to visit the Married Women's Card Club, learns about the hustler who was \"the good time not yet had by all,\" dabbles in hoodoo, and of course makes the acquaintance of Lady Chablis, who had to tape her \"Thing\" down before she appeared in public. And for all the eccentricity, you'll actually learn a lot about Savannah!The book under review, which is not to be confused with \"AFTER Midnight in the Garden . . . \" by a different author, is worth seeking out specifically. Used copies are plentiful, too, even in hardcover."}, {"userName": "Petra", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/1733683-petra", "userReview": "This book is chalk full of eccentric and sometimes amusing people. Savanah's architecture and lifestyle are introduced. In all, Savanah sounds like a lovely city. I really enjoyed the martini ritual when visiting the grave of Conrad Aiken and his tombstone.After the descriptions of Savanah and it's loveliness, though, the rest of the book fell a bit flat. The people mentioned were eccentric.....but not all of them were part of the crime or the investigation. They were added purely for entertainment; they played no part in this story.The crime was glossed over, it felt. Very little was told of the investigation or findings. What came out in court seemed sloppy and disjointed. Also, the author himself admits to have \"taken certain storytelling liberties, particularly having to do with the timing of events\". Huh??!! That's as sloppy as the police work & investigation that occurred. A true crime story where the events have been altered?! All in all, an entertaining enough read but without depth and one shouldn't consider this non-fiction. It's a fictionalized account of a crime. I'm glad I read it and also glad that I can now put it aside."}, {"userName": "Amy", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/4059160-amy", "userReview": "The embodiment of \"Truth is stranger than fiction\". Great read."}, {"userName": "Angela", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/126714-angela", "userReview": "This book was worth a read for the sheer entertainment value. It's less of a story and more of a brilliant, hilarious--and mostly true, as I understand it--character study of a collection of Savannah residents between roughly the mid-70's and mid-80s. In it we meet an eccentric lawyer, a glamorous drag queen, a voodoo witch, a dodgy socialite-cum-antique dealer, & many others. At the heart of the book lies the mystery of what really happened to Danny Hansford, a young man with a rough reputation who ends up with a bullet in his chest.Definitely one of the most unique books I've ever read, and extremely entertaining. I'm not usually much for character studies but I enjoyed this one & I can see why it's become a classic."}, {"userName": "Thomas Strömquist", "userReviewDate": "Jul 02, 2014", "userURL": "http://www.goodreads.com/user/show/32669562-thomas-str-mquist", "userReview": "John Berendt's well-known (non-)fiction work is the story of a murder. But it really isn't, it is actually more of a masterfully told story about a number of people in Savannah and the place itself. I just love this author's narrative and the first time I read the book I did it in a couple of long sittings, due to the fact that I couldn't bring myself to put it down. If you for some reason would not want to invest the time in this book, watch the great (and sadly underrated) movie! Then read the book."}, {"userName": "Paul", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/11951948-paul", "userReview": "Savannah, Georgia is the oldest city in the Deep South; beautiful and unique it is full of neat squares, shaded cobblestone streets, parks, and historic buildings. But in the 1980’s the city was gripped by the events that happened in Savannah's grandest mansion very late one night. Was the death of Danny Hansford, a male prostitute, murder or self-defence? In this narrative, Berendt introduces us to the place that is Savannah, as well as the characters of the time that made this such an entertaining place to live. We meet the Lady Chablis, a transgender drag queen and dancer, Minerva the voodoo priestess, the well-heeled ladies of the Married Woman's Card Club and the man at the focus of the story, Jim Williams. He was tried four times for the murder of Hansford, three times in the city before the final trial elsewhere in the state. Berendt builds a picture of the city as much as the people, and you get a sense of the magnificence of the houses and the people. He builds the tension magnificently, bringing to life the society that really didn’t know what to believe as the trials were underway. He highlights the undercurrent of tension between black and white, this is the deep south after all, and how Williams was able to move at all levels of society.It is very well written and even though it isn’t far short of 400 pages, took very little time to read. I liked the way he wrote about the characters and made the city feel so real, but there were flaws. But even though it was non-fiction, I felt that there were too many embellishments and it felt more like fiction at times. It has made me want to visit the city though as it feels very atmospheric."}, {"userName": "Mario MJ Perron", "userReviewDate": "Jun 22, 2015", "userURL": "http://www.goodreads.com/user/show/26991877-mario-mj-perron", "userReview": "This is an addendum to a previous review. I love this book!I've been in love with the story ever since watching the movie, which is a stand alone version of this story. The enchanting consistency between them is the cornucopia of eccentric characters living in the story... and, according to the author, actually living in Savannah at the time he lived there. Yes, it's a true story, with only a few names and dates changed. Well, for me this makes it even more enchanting. I've wanted to visit Savannah for years and never made it a priority. Now I know why. I'm disturbed by the possibility that the place could never live up to the richest descriptions contained in this, one of my all time favourite books. Even more so now, that I read the final chapters lamenting the seemingly inevitable changes of modernization on the time capsule culture portrayed as Savannah. On the other hand, I could take the Lady's advice and just experience it... as she says: \"Spit in a bucket, Mother####it!So sit back, pour yourself a tall cool drink and get sweaty with the cast of personalities.Did I say I Love This Book?!?"}, {"userName": "Deborah Edwards", "userReviewDate": "Sep 04, 2008", "userURL": "http://www.goodreads.com/user/show/1377720-deborah-edwards", "userReview": "If you can read this book and not want to immediately hop a plane to Savannah, Georgia, then I do not know what to say to you. I read this book several years ago (and even remember reading a huge chunk of it in the laundromat and another huge chunk of it outside the same laundromat, which had closed up but I could not stop reading), because it was pretty much surgically attached to my hand the entire time. Berendt brought these eccentrics to life in a way that made the entire culture mesmerizing and almost endearing. A really unfortunate film was subsequently made of the book and was a complete and utter failure in its attempt to grasp what Berendt knew early on. This is not a story about people, not a film about secrets or oddities, voodoo or murder. This is a love story between the author and the town of Savannah, herself, a town that ultimately becomes the most important character in the book, and Berendt fleshes it out in a way that still leaves me feeling like I have been there when, in fact, I have not. Oh, but I will..."}], "description": "A sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city has become a modern classic.Shots rang out in Savannah's grandest mansion in the misty, early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt's sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman's Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the \"soul of pampered self-absorption\"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else.", "title": "Midnight in the Garden of Good and Evil", "url": "https://www.goodreads.com/book/show/386187.Midnight_in_the_Garden_of_Good_and_Evil_A_Savannah_Story", "average": 3.91, "cover": "https://images.gr-assets.com/books/1427166915l/386187.jpg", "reviews": 7160, "authors": [{"url": "https://www.goodreads.com/author/show/4952.John_Berendt", "name": "John Berendt"}], "type": ["Nonfiction", "Mystery", "Crime", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/386187.Midnight_in_the_Garden_of_Good_and_Evil", "http://www.goodreads.com/book/show/7360.Midnight_in_the_Garden_of_Good_and_Evil", "http://www.goodreads.com/book/show/17876788-pono-u-vrtu-dobra-i-zla", "http://www.goodreads.com/book/show/846883.Midnight_In_The_Garden_Of_Good_And_Evil", "http://www.goodreads.com/book/show/9669412-medianoche-en-el-jard-n-del-bien-y-del-mal", "http://www.goodreads.com/book/show/1002542.Midnight_in_the_Garden_of_Good_and_Evil", "http://www.goodreads.com/book/show/12786.The_City_of_Falling_Angels", "http://www.goodreads.com/book/show/10644370-my-baby-blue-jays", "http://www.goodreads.com/book/show/15225233-savannah", "http://www.goodreads.com/book/show/3597.The_Complete_Adventures_and_Memoirs_of_Sherlock_Holmes", "http://www.goodreads.com/book/show/67653.Paula_Deen_s_Kitchen_Classics", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}