{"ratings": 12, "userreviews": [{"userName": "Betty", "userReviewDate": "Aug 11, 2008", "userURL": "http://www.goodreads.com/user/show/769551-betty", "userReview": "Friends \"go the extra mile\" with loyalty and love!Miles to Go, written by talented author Laurel-Rain Snow, is a story about love and loyalty ... about family foibles, husbandly humiliations, and female friendship--friendship that lasts a lifetime! But above all, it's a story of smart, strong, independent women, average women who have to make it on their own ... or not make it at all.This exciting, complex story starts in 1970 when two friends, Lindsay and Gia, are California college students, doing what kids did in those days: protesting the Vietnam War, arguing philosophy and politics, advocating women's liberation. They lived in an old Victorian in Sacramento that attracted political activists, and the place soon became a mini-commune.Although these students were at the tail-end of the hipster subculture, a youth movement that began in the U. S. in the early sixties and spread around the world, they inherited some of the culture and ideas of the hipsters ... a word that was later shortened to hippies and \"coined\" by San Francisco's beloved columnist, the late Herb Caen. And just as that term survived, these women survived, living through tumultuous political and personal times.Lindsay and Gia become good friends with another member of the commune, a lovable artist named Rainbow. Although they get separated by life, Lindsay and Gia remain close, with Rainbow coming back into their lives later. The three are there for each other through thick and thin ... thin being more prevalent than thick at times, thanks to chemical dependencies, rebellious children, husbands, ex-husbands and other faulty relationships. Each woman has her secrets, but Rainbow has the deepest, darkest secret of all.When college ends, Lindsay and Gia--filled with idealistic ambition and youthful passion--plan to go out and change the world, eagerly anticipating the future. But as life has a tendency to derail the best of plans, something happens to Lindsay that changes her entire life. She gets married and settles into domesticity, while Gia's career as a Sacramento lobbyist takes off.As the story spins off in multi-directions with dramatic twists and turns, the reader will keep turning pages, eager to find the answers to these questions: What happens to Lindsay that changes her plans? What's the problem with her first husband? Her second? What happens to detour her daughter? Why does her son's first love disappear only to intrude into their lives later? How does Rainbow's problem get exposed? And why does her relative \"take up\" with one of Lindsay's exes? Will these friends solve their children's problems and fulfill their own life-long dreams of helping other women? And will they find the true love and happiness they seek for themselves?After all their struggles, readers will rejoice in these women's career advancement: Lindsay, the main character, eventually becomes a high-level social worker, Gia, an attorney, and Rainbow, a popular Northern California artist, of course.Laurel-Rain Snow has penned a compelling story with such well-developed characters you will feel as though you know them. These women are so realistically portrayed you'll recognize them in your own family, whether your daughter, your sister, mother ... or even your grandmother, depending on your age. They are THAT real, with problems we all face at one time or another. In addition, Ms. Snow's text is clean, crisp and flows smoothly, pulling the reader along with ease ... through one exciting scene after another.Miles to Go is the fourth in a series of novels by Laurel-Rain Snow. These books are not a continuation of this story; each can stand alone, with some of the characters in other books. She also has a popular short story, Family Values, posted on Amazon Shorts. I read the short story to get a sense of Laurel's writing voice before splurging for the book. After reading the short story, I couldn't wait to read more from this gifted writer.If you would like an entertaining reading adventure along with some life lessons, I recommend this book. (The cheerful, colorful cover is perfect for this novel.)Reviewed by: Betty Dravis, 2008author of: 1106 Grand Boulevard"}, {"userName": "Babs", "userReviewDate": "Oct 11, 2010", "userURL": "http://www.goodreads.com/user/show/1970552-babs", "userReview": "I won this book from the author and glad I did. This book is in a series, but you can read out of order as they do not continue the story so to speak. The characters are very believable as anyone can relate to them. They take care of themselves they don't need anyone to rescue them."}, {"userName": "Laurel-Rain", "userReviewDate": "Aug 10, 2008", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "California, 1970: flush with idealistic ambition and youthful passion, best friends Lindsay and Gia are preparing to graduate from college. With their history of radical student activism, they're determined to make their mark on a country divided by the Vietnam War. Life rarely goes according to plan, however, and they soon find themselves juggling love and motherhood with careers and dreams that seem always just out of reach. They cling to their friendship through it all, relying on one another for the wisdom, laughter, and support that sustain them. Spanning nearly thirty years, Miles to Go offers an insightful look at the enduring friendship between two extraordinary women. This is a book that I started in the eighties, put aside, and then picked it up after getting my first computer. Even so, I then went on to write four other novels before publishing Miles to Go, which came out as my fourth published novel.I think that my reluctance to release it had to do with it being the one story closest to my heart...except, of course, for the soon-to-be released Web of Tyranny! On July 24, 2008, \"Miles to Go\" was featured as Cool Book of the Day at this link:http://www.coolbookoftheday.com/categ..."}, {"userName": "Patty", "userReviewDate": "Sep 10, 2008", "userURL": "http://www.goodreads.com/user/show/1511952-patty", "userReview": "Time warp? Flashback? Not quite either, but an interesting read so far."}], "description": "California, 1970: flush with idealistic ambition and youthful passion, best friends Lindsay and Gia are preparing to graduate from college. With their history of radical student activism, they're determined to make their mark on a country divided by the Vietnam War. Life rarely goes according to plan, however, and they soon find themselves juggling love and motherhood with careers and dreams that seem always just out of reach. They cling to their friendship through it all, relying on one another for the wisdom, laughter, and support that sustain them. Spanning nearly thirty years, Miles to Go offers an insightful look at the enduring friendship between two extraordinary women.", "title": "Miles to Go", "url": "http://www.goodreads.com/book/show/4018086-miles-to-go", "average": 4.42, "cover": "https://images.gr-assets.com/books/1279405919l/4018086.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/1185466.Laurel_Rain_Snow", "name": "Laurel-Rain Snow"}], "type": ["Autobiography"], "outlinks": ["http://www.goodreads.com/book/show/4018086-miles-to-go", "http://www.goodreads.com/book/show/11426452-miles-to-go", "http://www.goodreads.com/book/show/5099856-embrace-the-whirlwind", "http://www.goodreads.com/book/show/4567653-web-of-tyranny", "http://www.goodreads.com/book/show/2703924-chasing-stardust", "http://www.goodreads.com/book/show/3405345-an-accidental-life", "http://www.goodreads.com/book/show/21842263-interior-designs"]}