{"ratings": 45653, "userreviews": [{"userName": "Joshua Guest", "userReviewDate": "Dec 24, 2012", "userURL": "http://www.goodreads.com/user/show/5808354-joshua-guest", "userReview": "Okay, so the idea is fine, and usable, and easy to explain to others, and pretty simple. I was about to give this book a one-star rating because I was so irritated with Dr. Dweck trying to shoehorn her idea into every single success story in the history of humanity and basically saying that her theory was the best explanation of that success. Conversely, every failure could have been averted but for a change in mindset. It was the Fixed mindset that caused the Chicago Cubs to never win a World Series. If only they had the Growth mindset, like the Yankees, they would win more World Series.Dweck may be too in love with her own ideas to realize that she oversells the usefulness of her theory to the extent that the portion that is actually workable seems underwhelming after cutting away from her salesman-like puffery. However, Mindset still serves as a useful supplement to a change manager's library. Its principles are serviceable to the manager, the parent, the spouse, the student, and the teacher. Just don't mistake it for a panacea."}, {"userName": "Mark", "userReviewDate": "Apr 26, 2012", "userURL": "http://www.goodreads.com/user/show/8614711-mark", "userReview": "Here is a message to anyone close to me who may over hear me saying, 'I must read that popular psychology book ...', at some point in the future. Don't let me forget how vapid and uninspiring this book was. Please remark: 'don't forget about Mindset Mark!' Let me try and save you some time by summarising (not sure if this qualifies as a spoiler, I guess not): it is bad to think your skills and knowledge are limited. This represents the fixed mindset. Rather, it is good to think to yourself: if I work hard at things, I will be amazed by what I could achieve. This accords with the growth mindset. Actually, that is a little unfair, there is one more point worth mentioning. If you have children, as I do, then: try to avoid rewarding achievement more than effort. Because rewarding effort encourages development of the growth mindset. How is it that these simple nuggets of truth can be passed on in the space of a goodreads review, whereas Ms. Dweck requires an entire book?"}, {"userName": "Cerealflakes", "userReviewDate": "Nov 18, 2011", "userURL": "http://www.goodreads.com/user/show/579294-cerealflakes", "userReview": "I keep hearing educators praising this author and, specifically, this book. Maybe she's better in person. I found this book trite. It was very repetitive and full of cherry picked stories pulled out just to prove her obvious conclusion. Are there really people who think that if you go into something with a negative attitude it won't affect the outcome? She goes to the extreme with the positive attitude stuff, though. I just don't buy that anyone can do anything if they just try hard enough. Not trying guarantees you won't do it, but trying really hard doesn't mean you will. Lots of people try hard for years to get into the Olympics and they don't. It doesn't mean that they didn't work as hard as someone who did. The author also inserted herself pretty aggressively into this book. Her story about tears streaming down her face at the wonderfulness of Italians was too much. This book is dated enough that her stories of the greatness of Tiger Woods is pretty funny. I found Malcolm Gladwell's Outliers to be a much better book about a similar topic."}, {"userName": "Michael", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/1112254-michael", "userReview": "Excellent book. This one sounds like a typical self-help book, but it's a real find. The author is a pyschology researcher at Columbia, and her book is filled with insights and illustrations regarding the differences that a fixed mindset vs. a growth mindset can have when applied to business, parenting, school, and relationships. Her research has been highlighted in many venues, including an excellent book on parenting titled Nurture Shock. I give it 5 stars because I can see so much of myself in the book's description of the fixed mindset. The book's message spoke to me and the mindset I've adopted in some areas of my life. I'm particularly prone to the \"Effort Gone Awry\" scenario where I would work hard, but not with a growth mindset (i.e., one associated with the love of learning). Rather, I'd be working hard to prove myself to others. I worked hard to have achievements that would validate my self worth and adopted identity. The downside is that you end up being unwilling to take risks or face tough challenges (if you fail, your self worth goes down). Also, you end up running yourself ragged and being stressed out because you're afraid of losing the approval of others if you don't succeed.I find the growth mindset fits very well within a Christian perspective as our life in God needs to be always one of continual growth -- \"higher up and deeper in\" as C.S. Lewis would say. The fixed vs. growth mindset isn't the whole story, but it's an important part of the puzzle in helping us better understand how our minds work. I like the diagram on p.245 that I believe sums up the message of the book.Fixed Mindset:-E.g., Intelligence is staticLeads to a desire to look smart and therefore a tendency to...Challenges: avoid challengesObstacles: get defensive or give up easilyEffort: see effort as fruitless or worseCriticism: ignore useful negative feedbackSuccess of others: feel threatened by the success of others=> As a result, they may plateau early and achieve less than their full potentialGrowth Mindset:-E.g., Intelligence can be developedLeads to a desire to learn and therefore a tendency to...Challenges: embrace challengesObstacles: persist in the face of setbacksEffort: see effort as the path to masteryCriticism: learn from criticismSuccess of others: find lessons and inspiration in the success of others=> As a result, they reach ever-higher levels of achievementThese basic questions are also helpful in developing a growth mindset.I need to continually ask myself:-What are the opportunities for learning and growth today? For myself? For the people around me?As I think of opportunities and form a plan, I need to ask:When, where, and how will I embark on my plan?As I encounter difficulties, I need to ask:When, where, and how will I act on my new plan?And when you succeed, ask yourself:What do I have to do to maintain and continue the growth?"}, {"userName": "Maede", "userReviewDate": "Mar 01, 2017", "userURL": "http://www.goodreads.com/user/show/28210578-maede", "userReview": "تأثیر این کتاب روی من عجیب بود. مخصوصا اینکه چیز جدیدی به من نمی گفت. چیزهایی رو می گفت که من همیشه می دونستم ولی خوندن این کتاب بهم نشون داد که همیشه ناراضی بودم چون این هارو می دونستم و هیچوقت برای خودم عملی نکردماز موقعی که هشت سالم بود با بچه های ضعیف تر کلاس ریاضی کار می کردم و با همه ی کودکیم اعتقاد داشتم که اگر بیشتر تلاش کنند می تونند. نمی دونستم چرا برای خودم هرگز این کار رو نکردمهمیشه به تلاش اعتقاد داشتم و هیچوقت اونجور که باید تلاش نکردم. خودم رو که بیشتر شناختم دیدم که از ترس شکست فرار می کردم. اینکه یا باید اول باشم یا هیچ چیز نباشمتمام کاری که این کتاب کرد روشن کردن و باز کردن فکر های خودم بود و اینکه باعث شد به طور جدی به تغییر روش فکر کنم. به کنار گذاشتن این فکر که من دیگه خراب کردم، دیره، کار از کار گذشتهبه خاطر این کتاب به فکر فرو رفتم که کمی به این وحشت قضاوت شدن و انتقاد شدن غلبه کنمکتاب تکرار زیاد می کنه، زمینه های مختلفی رو بررسی می کنه و شاید بیش از حد مثال میزنه ولی در آخر فقط یک چیز رو میگه طرز فکرت رو عوض کن، هیچ خصوصیتی ثابت نیست، این تویی که باید با تلاش به خواسته هات بررسی. نه اینکه فوق‌العاده و خاص به دنیا بیای، باید بشی و اگر نیستی فقط تقصیر خودتهامتیاز کتاب به خاطر تاثیرش روی فکرم بود و اینکه هرجوری نوشته شده موفق شد این کار رو بکنه95.12.12"}, {"userName": "Jamie Doerschuck", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/5564496-jamie-doerschuck", "userReview": "I think a lot of people who rated this book highly must have had a \"fixed mindset\".I think this book was a waste of money, personally. The tone of the book is very repetitive and annoying. Essentially people with a growth mindset are better than people without it in every possible way. If you have a fixed mindset you'll have lower grades in school, be unhappier, die earlier, be fatter, (be more likely to) never get married, make a bundle less money, you name it! It reads more like fear mongering than actual research, rattling off a list of everyone's most basic fears \"But if you listen to me, Carol Dweck, all of your dreams and more will come true!\".I also don't recall Dweck listing many references to any of her research, you're just supposed to take her stories at face value \"Because I'm a researcher!\". Mindset offers a lot of words with little substance. I will admit that I haven't finished the book, and I don't plan to. Dweck's tone really just grated on my nerves, and I don't feel I gained anything useful from reading what parts of the book I read. I can't imagine anything more useful coming to light at the end."}, {"userName": "Kirsten", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/8599907-kirsten", "userReview": "Let me preface this review by saying that my boss made me read this book, because, apparently, reading assignments are something that I should have as a 5th year PhD candidate. Not only that, but I'm pretty sure no one should require me to read a shitty waste-of time self help book.Let me save you the money and the aggrivation: The point of this book is (admittedly) not terrible, but it could be summed up real fast. Here you go, you're welcome.Often, people see their abilities as 'fixed' and this attitude stops them from working to better themselves, turns out that if you work hard and keep the right can-do attitude, that you can accomplish more than if you think you're doomed to be a particular skill level forever. There are examples of this all around you.Boom. Done. But no. What you get with this book is an endless diatribe. Hey, you remember that thing that happened in history? Where X person did Y thing that turned out to be good/bad? Well, if it was bad, it was TOTALLY because they had a fixed mindset. If it was good, it was 100% because of their growth mindset. This is true of literally any example in history ever no matter how poorly researched it might be. Michael Jordan? SURE THING. That guy from that one business that went bad? WHAT A FIX MINDED DUMBASS. Bethoven? Duh. Seriously, I don't think I have ever read something so repetitive and belabored in my life. Sure, lady, you make a good point: People shouldn't limit themselves. Maybe give it a break after about 15 pages and I think it would probably be plenty.Also, Bitch, if you tell me that I wouldn't be depressed if I just had a better attitude about it, I'm going to be upset and lose faith in your credibility. Seriously, kids, don't waste your time on this. And if your boss tells you to read it, don't bother, just read this helpful review again."}, {"userName": "Otis Chandler", "userReviewDate": "Mar 19, 2007", "userURL": "http://www.goodreads.com/user/show/1-otis-chandler", "userReview": "Recommended in Stanford Magazine and by Guy Kawasaki.A very useful book about the growth mindset. Essentially, the book makes a case that those people who look at everything they do in life as a learning opportunity are much more successful. I think where this comes into play most often is when we face a setback, or a failure. Whether thats getting rejected from something (a job, a team, etc), messing up at work, having your boss yell at you, losing at something, getting laid off, making a bad bet, etc - most of us have many setbacks in our lives. How we deal with those is incredibly important. If we let the setback define us, we might think we aren't talented after all, and lose confidence. If on the other hand, we look at it as something we can learn from, we improve as a person.I came at the book as it was recommended to me as being good for parents. My daughter is only 1.6 years, but already she is learning fast. The book recommends praising our children's efforts, instead of their results. Telling them they are \"amazing\", and \"smart\" is so easy to do, but if you do that their whole lives they won't succeed when they get to the real world. What you want is to encourage a learning attitude. This quote sums it up: \"So what should we say when children complete a task—say, math problems—quickly and perfectly? Should we deny them the praise they have earned? Yes. When this happens, I say, “Whoops. I guess that was too easy. I apologize for wasting your time. Let’s do something you can really learn from!\"Looking at life as a constant challenge is fun. And you can't fail at a personal challenge! Here is a great mental imagery technique the book mentioned when you are doing something you are bad at:\"Picture your brain forming new connections as you meet the challenge and learn. Keep on going.\"Another interesting bit was how people at the top of their game can get caught up in a fixed mindset. You see this in sports all the team - the champion team from last year thinks they can cruise through this year, doesn't work hard, and suddenly they are losing a lot. It's so hard to maintain the edge. John Wooden puts it best:\"I believe ability can get you to the top,” says coach John Wooden, “but it takes character to keep you there.… It’s so easy to … begin thinking you can just ‘turn it on’ automatically, without proper preparation. It takes real character to keep working as hard or even harder once you’re there. When you read about an athlete or team that wins over and over and over, remind yourself, ‘More than ability, they have character.'\""}, {"userName": "Stark", "userReviewDate": "Dec 27, 2008", "userURL": "http://www.goodreads.com/user/show/1472086-stark", "userReview": "This is probably all i really need to hear out of this book, but i will read the whole thing anyway. there are two mindsets. fixed and growth.Believing that your qualities are carved in stone -- the fixed mindset -- creates an urgency to prove yourself over and over. If you have only a certain amount of intelligence, a certain personality, and a certain moral character -- well, then you'd better prove you have a healthy dose of them. It simply wouldn't do to look or feel deficient in these most basic characteristics. ...I've seen so many people with this one consuming goal of proving themselves -- in the classroom, in their careers, and in their relationships. Every situation calls for a confirmation of their intelligence, personality, or character. Every situation is evaluated: Will I succeed or fail? Will I look smart or dumb? Will I be accepted or rejected? Will I feel like a winner or a loser?...There's another mindset in which these traits are not simply a hand you're dealt and have to live with, always trying to convince yourself and others that you have a royal flush when you are secretly worried it's a pair of tens. In this mindset, the hand you're dealt is just the starting point for development. This growth mindset is based on the belief that your basic qualities are things you can cultivate through your efforts. ...Do people with this mindset believe that anyone can be anything, that anyone with proper motivation or education can become Einstein or Beethoven? No, but they believe that a person's true potential is unknown (and unknowable); that's its impossible to forsee what can be accomplished with years of passion, toil, and training.\"a person's true potential is unknown (and unknowable)\" i feel like those words contain so much freedom for both those who have been made crazy by high expectations in their upbringing, and put down with low ones. it is not a knowable thing, what your potential is, anyone who told you they knew, it was a lie, and you have nothing to prove and nothing to hide? what a relief"}, {"userName": "SJ Loria", "userReviewDate": "Aug 09, 2013", "userURL": "http://www.goodreads.com/user/show/826429-sj-loria", "userReview": "Watered down and scientifically not that accurate (grit is a part of conscientiousness - see studies below), welcome to education's favorite book!Here is my two sentence summary of this book (best spoken in kindergartner teacher voice): There are two kinds of people in the world, people who believe things are fixed, others who believe they can change through hard work and effort, so believe in the ladder and success will open in front of you! Hooray you are a special snowflake that can grow!Heavy on the inspirational stories and antidotes, light on the data to support some of the arguments and essentially void of the how to. I agree that the right attitude, one that embraces struggle and hard work in order to increase your talents (which are not fixed, but fluid), helps you succeed in life. But it's about putting ideas into action. This book offers very little practical advice or steps one can take in order to do so. I think most people, after reading this, get that warm fuzzy feeling that wow, this makes sense! But then that fades, and life resumes, and it's just a book on the shelf. Maybe even a companion book to put this idea into action to train the elephant in you (thanks Happiness Hypothesis).Ultimately, success requires the right attitude but also the sweat to make it happen. And this doesn't really offer practical steps on how to make it happen. There ain't no short cut.Studies that debunk this book:http://communityconnectors.ohio.gov/P... (read the abstract page one)"}, {"userName": "Amir", "userReviewDate": "Jun 07, 2015", "userURL": "http://www.goodreads.com/user/show/49415231-amir", "userReview": "Mindset is definitely a must-read book that has the capacity to have a profound impact your life as an individual, business leader, teacher or parent by opening your eyes to different mindsets one can have or induce to others specifically if you possess a fixed-mindset.The downside of the book i would say the examples or sending the message sometimes gets too repetitive but not boring though.I highly recommend this book to every one whether you want to open your world to new possibilities and strength through having a growth-mindset or you want the same thing for your business, students or children."}, {"userName": "Alex", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/5868753-alex", "userReview": "Another book that attempts to build upon the research of Anders Ericsson.The way I read it, I would break the book into 3 parts:Part 1: How people fail because they don't have the right mindsetPart 2: How people success because they have the right mindsetPart 3: You could also call this part 2a - it basically deals with children and success in school, home, etc.The first part of the book was the worst. Its case after case of \"this person tried to succeed and failed because he didn't have the right mindset\". Great. So what was the right mindset? She doesn't tell you. How do you obtain it, or get into that mindset? She doesn't tell you. She tells you whats wrong without explaining WHY it is wrong, etc. She sorta reserves that for the next part of the book. Also, there is no form. Its kind of a rambling, unorganized mess. You read it and are wondering \"Ok, this person failed, that person failed. They didn't have the right mindset. Do you mind explaining to me what the right mindset ACTUALLY IS? How a bout how do *I* get the right mindset so I can avoid all this?\" Some of those questions never get answered.The second part of the book has all these success stories, and she tells you that they were successful because they had the right mindset. She delves slightly into what the right mindset is, but there really aren't a new revelations here. And she never tells you how to get into that mindset. IOW, there is nothing in the book about motivation (intrinsic or extrinsic). There is nothing about background and upbringing or lessons learn earlier in life. There is no compare and contrast with the first part of the book to bring things into a proper context.IOW, shes not teaching you about mindset, shes just telling you. Thanks. Its like describing to someone how the piano is played vs actually giving someone lessons.If you are interested in this type of material, check out Geoffry Colvin's \"Talent Is Overrated\" and Matthew Sayid's \"Bounce\" - preferably in that order. Read it and you will see all that this book is missing. And though Colvin's book can get dry at time, it still has forward movement, and ideas build upon previous ones, and things are explained very well. All things that this one is lacking."}, {"userName": "Becca Van Tassell", "userReviewDate": "Mar 13, 2014", "userURL": "http://www.goodreads.com/user/show/5048121-becca-van-tassell", "userReview": "It's pretty bad when after 15 pages, I want to fling a book away in disgust. But I kept reading. (Okay, it turned into skimming pretty quickly). And it DIDN'T GET BETTER. I've read several thoughtful and interesting pieces of journalism lately referencing the general thesis of this book that were really thought provoking. But the book itself is just empty tripe and cliches, without adding any content of interest to bolster the general idea that it's more important to foster a growth mindset over a static mindset in people, so that they can better cope with and adapt to situations in which they are not just naturally talented. I'm actually very sympathetic to this general idea, but the book was just terribly written, and in fact made me wonder if I should rethink my agreement with her. Here is just a small sampling of ridiculousness that is within the pages of this book:- A section is literally begun with the words \"Since the dawn of time.\" Your average ninth grader should be aware that this is a terrible idea.- An extensive summary of the movie \"Groundhog's Day\" is given as support for a theory of psychology.- Half the book is filled with \"interesting trivia\" that suggest that people who begin stupid can work hard and be AMAZING!!! For example, did you know people thought Einstein was slow as a child?! - Yes, everybody knows that piece of faux-trivia. And it's not even true - real evolutionary psychologists believe that Einstein's brain was larger than average in areas that encourage spatial reasoning and an intuitive grasp of numbers. (Steven Pinker told me that in _The Blank Slate_. After about three pages of this book, it was not hard to decide which author I find more credible.)- So many ridiculous cliches (introduced as ARGUMENTS and EVIDENCE) that it would be impossible to catalogue them all. This book is practically an encyclopedia of phrases like \"nothing ventured, nothing gained!\" and \"if at first you don't succeed, try, try again.\"- The explanations of the research projects that created these \"findings\" make it obvious that you cannot trust these results. For instance, they presented kindergarteners with a test that they said was \"very important.\" Before administering the test, they asked followup questions of the five year olds: \"Do you think this test will measure how smart you are?\" and \"Do you think this test will measure how smart you will be as a grown-up?\" Almost all of them said yes, except for one five year old I am certain is fictional, who responded \"No way! Ain't no test that can measure that!\" If you ask a FIVE YEAR OLD an extremely leading question who has been given no information, you are almost guaranteed to get a shower of \"yes!\" answers. The fact that they didn't immediately display suspiciousness toward researchers and critically deconstruct their questions is evidence of nothing. At best, it's evidence that children respond to leading questions and/or don't listen and think very deeply or carefully when asked leading questions.- There is one section that is full of reports about \"genius children\" to suggest that some of them turned out well (the ones who still applied hard work) and some who didn't (because they just rested on their natural proclivities). All of these stories feel impossible to believe the way they are presented. The author read a book once that told a story about a four month old baby who asked his parents \"Mom and Dad, what are we eating for dinner tonight?\" This is third-hand, not cited, and completely un-credible. (Even if a baby was genius enough to speak in full sentences at four months old, he cannot eat solid food yet, so why on earth does he care what they are making for dinner?).In short, this might be the worst book I've ever read. Before reading it, I was very persuaded by its premise. After reading it and discovering that at least this explanation of the thesis is the opposite of convincing, I will approach all writers who accept this theory with a huge degree of distrust and suspicion."}, {"userName": "Thomas", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "Great overarching concept, lackluster execution. In Mindset, Professor of Psychology Carol S. Dweck discusses the difference between a fixed mindset and a growth mindset. The fixed mindset focuses on immovable measures of achievement and ability, such as the idea that everyone is born with a certain amount of unchangeable intelligence. The growth mindset advocates that everyone can improve themselves in any area of life through hard work. Dweck argues that we should adapt the growth mindset because it aids in parenting, academics, relationships, and more.As a Psychology major I learned about growth and fixed mindsets in my classes, and it was cool to see Dweck apply the concepts to several different areas, such as sports, marriage, and politics. However, I wish she had done more with her main argument: instead of delving deeper into the psychology behind the mindsets, it felt like she stayed at the surface level of her ideas and applied them to a wide range of interesting yet repetitive anecdotes. She could have connected growth and fixed mindsets to mental health, stereotype threat, feminism, or an assortment of other topics that would have strengthened the thesis of her book.After 276 pages, I did not feel like I learned anything new. It's not like anything Dweck wrote was wrong or bad, but I could capture her main argument and share it with people just by having them read an article or two, as opposed to this entire book."}, {"userName": "Johnny Trash", "userReviewDate": "Aug 08, 2012", "userURL": "http://www.goodreads.com/user/show/1724904-johnny-trash", "userReview": "This is a book which the administrators in my organization are reading. I am reading it as well, though I'm not an administrator. I am only on page 43 but I already have dismissed the ideas and the author as superficial. Written in a casual style (the author states in the introduction: \"A little note about grammar. I know it and I love it, but I haven't always followed it in this book. I start sentences with ands and buts. I end sentences with prepositions. I use the plural they in contexts that require the singular he or she. I've done this for imformality and immediacy, and I hope that the sticklers will forgive me.\"Well, I have a hard time forgiving that when this had to pass through professional copy editors (it's published by Ballentine). But even worse is the informality of the anecdotes and conclusions.Her thesis is that there are two types of people in the world, those with a \"fixed mindset\" and those with a \"growth mindset.\" The former believe that their intelligence and ability are \"fixed\" and there is no opportunity to become smarter or more able. So why try. Do what you are already good at and avoid situations where you might possibly fail or do worse than expected. Growth-minded people believe that failure is an opportunity to grow.That's it. There's the book. Fluffed up with superficial renderings of true life stories and supposed quotes from the author's research subjects.While the author has 239 footnotes at the back of the book, backing up her statements, her stories come off as simplistic to the extreme. The most disturbing example so far is that of the late chef, Bernard Loiseau. The author claims he committed suicide because he had a fixed mindset and could not accept that his restaurant lost a \"star\" in the leading restaurant guide in Europe. \"...the director of the GaultMillau (the restaurant guide) said it was unimaginable that their rating could have taken his life. But in the fixed mindset, it is imaginable. The lower rating gave him a new definition of himself: Failure. Has-been.\"It's striking what counts as failure in the fixed mindset. So, on a lighter note...\"Here the author has taken a complex situation and reduced it to \"guy killed himself because he was one of my two types of people in the world.\" And then blythely moves on to \"a lighter note.\"A quick look at Wikipedia shows that there was more to the story than that. There were known factors such as debt. And any thinking person would tell you there are other underlying factors that could have been involved such as clinical depression, bi-polar disorder, possibly drug or alcohol abuse, childhood abuse or neglect issues, the list goes on. The point is, the author chose to simplify in a way that simply makes her point.I'm still reading this book because it makes me actually angry and I feel I need to review it for my administrators to let them know my thoughts."}, {"userName": "Tanja Berg", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "I bought this book last year, but didn't get around to it. While reading something else recently, it referred to this one and I decided to give it a go. The basic premise is that \"the view you adopt for yourself profoundly affects the way you lead your life.\"\"Believing that your qualities are carved in stone - the fixed mindset - creates and urgency to prove yourself over and over. If you have only a certain amount of intelligence, a certain personality, and a certain moral character - well, then you'd better prove that you have a healthy dose of them. It simply wouldn't do to look or feel deficient in these most basic characterstics.\"\"The growth mindset is based on the belief that your basic qualities are things you can cultivate through your efforts. Although many people may differ in every which way - in their initial talents and aptitudes, interests or temperaments - everyone can change and grow through application and experience.\"I've done some soul searching on myself, because I can certainly be angst-ridden and defensive. However, no matter how terribly I've failed, I have always tried again. I am a firm believer that there is no such thing as talent, only practice. It wasn't just Malcolm Gladwell who convinced me of this. I went to an elite highschool. We were all told we were smart, but that that would not put us through - only effort would. The growth mindset cultivated in my class led to many remarkable achievements. I had already cultivated good study habits, and these saw me through. I was more interested in learning than in being the best - the latter would have been futile in the group I was in anyway.The psychology classes of those highschool years taught me about IQ tests and the difficulty of measuring such a thing because of biases. It also taught me that most of the things measured could be learned. The IQ tests I have taken prove as much. I excel at langauge, anagrams, visual patterns and numbers - these are things I have practiced. I suck at logic. I never really attempted to learn it in the theory of knowledge classes either, but I could have and could still.When I was appointed my first management position, I read. When I got more responsibility and felt overwhelmed, I went back to part-time school and took a semester of work and organization psychology. This also involved some very specific things around Norwegian employment law, in addition to learning more about how people react to different situations. These classes were incredibly helpful. If I had had a fixed mindset, I would probably not have put so much effort into learning how to be a better boss having believed my traits and talents fixed. But I'm not done, and I never will be - there are always more things to learn.Lately I've become better at recognizing destructive thought patterns and tweaking my reactions. This is cognitive psychology, something this author doesn't seem to hold high in regard. However, the cognitive psychology I have been reading focuses much on behavior. If you want to live a more healthy lifestyle, start behaving like you are. Get your ass out of the sofa. And so forth. I find that the cognitive approach and the growth mindset go hand in hand.When things go to hell, don't take it personally but do accept personal responsibility for it. Learn what you can, move on and do better next time. Take it from me, the biggest screw up contain the biggest potential lessons.There is no talent. There is only effort and practice."}, {"userName": "Justin Tate", "userReviewDate": "Jul 04, 2017", "userURL": "http://www.goodreads.com/user/show/23082940-justin-tate", "userReview": "This is as simple as it is revolutionary. Should be required reading for parents and educators, but everyone can benefit--even if you aren't really on the prowl for 'success'. What I love most is that the concept will improve yourself, but even if you struggle to change your mindset from 'fixed' to 'growth' you can instill benefits on others by praising work rather than talent.If you've ever praised someone for being 'smart' or destined to be the 'next Mozart' or a 'natural' you'll realize that you've inadvertently wrecked havoc on their psyche. As victims of this type of praise, you'll learn how to change your mindset after being damaged. Of course the book is much more than that, but those segments were the most life-changing for me. The 'growth' and 'fixed' mindset concepts extend to every aspect of life and, unlike many self-help books, it's not necessarily something that's common sense. This IS revolutionary. Check it out!!!"}, {"userName": "David", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/5253695-david", "userReview": "A bit long-winded at times, but well worth reading. The repetition could be frustrating, but the reinforcement was likely beneficial. I'm starting to see the growth and fixed mindset all around me, especially in other books I'm reading and movies I'm watching, and it's fascinating to realize how important this shift in attitude is to my approach to the world."}, {"userName": "Jonathan Karmel", "userReviewDate": "Feb 09, 2012", "userURL": "http://www.goodreads.com/user/show/7198893-jonathan-karmel", "userReview": "I read the first few chapters but then ended up skimming the rest. I absolutely agree with the author that it's better to have a growth mindset than a fixed mindset. It just seemed like the author made the point and then kept repeating it over and over again. I did think it was valuable to apply this principle to relationships (chapter 6); it's nice to have someone confirm that good relationships are a lot of hard work and that if a relationship requires a great deal effort that does not mean that you failed to find your true love.While having a growth mindset is a prerequisite to success, I don't personally think changing your mindset is the greatest impediment to success. I think a lot of people believe they could succeed, but they feel like they lack the motivation and energy to make the effort to do things that are really difficult. They feel like they should do things but then feel guilty about not doing them. By the way, I'd be interested to know how the author squares her theory with the section of the The Feeling Good Handbook by David Burns that explains why you should stop “must”-erbating. It seems like a person who tried to take Dweck's advice to heart would spend a lot of time feeling like they \"should\" be doing things to grow, and might also feel awful that they are not actually doing all of the things that they feel that they should be doing.Also, many, many people are constantly making a tremendous effort to grow but still feel as if they are failing. They are in fact expending effort ineffectively and are extremely frustrated. Is the problem for most people really that they do not have a growth mindset, or rather that they just can't figure out exactly what they need to do to grow?"}, {"userName": "Filipa", "userReviewDate": "Oct 11, 2015", "userURL": "http://www.goodreads.com/user/show/4459767-filipa", "userReview": "Second reading: 25 February 2016 - 5 March 2016. Reread this wonderful gem, confirming the fact that this book really is a game changer. This rereading also confirmed that this is one of the books that will accompany my growth throughout different phases of my life. I believe it will accompany for the rest of my life, actually. It has pressed me to recognize the areas in which I had a fixed mindset and those in which I had a growth mindset and it has helped me change my view in the areas I had that fixed mindset.I was already able to see the difference in my behavior from the first reading to the second. In some instances (before that first reading) I reacted with a fixed mindset but now in my second reading I noted that in some of those instances I have already made some changes and I can manage to react with a growth mindset. This second reading was useful to see what has already changed in me, what still needs to be changed but most importantly, how to maintain those changes throughout my life. That's why I believe this book will be a life-long companion of mine, because it'll always help me with my personal development. I will definitely reread many more times. An essential reading. First reading: 11 October 2015 - 26 October 2015 This book is a game changer, I loved everything about it. It is one of those books which I will have to revisit over and over again and still learn something with it."}, {"userName": "Kressel Housman", "userReviewDate": "May 07, 2008", "userURL": "http://www.goodreads.com/user/show/575806-kressel-housman", "userReview": "The flap copy on this book promised it would be \"a great book that will change your life.\" That certainly raised my expectations, and I'm happy to report that I wasn't disappointed.The premise of the book is the basis of cognitive psychology: what you believe affects your whole life, so if you can change your beliefs, ie, your mindset, you can change your life. This book characterizes two mindsets, the fixed and the growth-oriented. The fixed is the more common one because that's what society tends to drill into us. Natural talent necessarily brings success. If you're talented, you shouldn't have to work hard, and if you fail, then you just weren't as talented as you thought you were. The growth mindset is the opposite. Hard work is more important to success than talent, and when you fail, you just have to plan a better strategy for success. The book goes on to show applications of both mindsets in sports, business, relationships, education, and parenting. And the stories cited paint human portraits. My favorites were the contrast between fixed mindset John McEnroe vs. growth mindset Tiger Woods. And I'm not even into sports! It didn't matter; the point is the psychology.The author acknowledges that it's not easy to rid yourself of the fixed mindset. But since reading this book, I'm vigilant on myself. And most of all I try and remember its most important lesson: if at first you don't succeed, try, try again."}, {"userName": "Amina", "userReviewDate": "Jul 17, 2017", "userURL": "http://www.goodreads.com/user/show/5079848-amina", "userReview": "2.5☆First, the concept was good, the first chapters were great but then the I found the book to be very repetitive, it could have been written in about 150 pages, and a little bit judgmental, sometimes even a bit hard on the people with the fixed mindset."}, {"userName": "Minwoo", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/37219419-minwoo", "userReview": "I feel like the criticism this book gets is an exhibit of fixed mindset. Simple concept, yes, but universally applicable. Definitely left a profound impact on how I think and see the world, and I would like people around me to have read it. So five stars."}, {"userName": "Mike", "userReviewDate": "May 26, 2008", "userURL": "http://www.goodreads.com/user/show/1187470-mike", "userReview": "Carol Dweck’s Mindset: The New Psychology of Success is based on a deceptively simple—yet powerful—premise. The central distinction she draws here is directly relevant to any of us interested in teaching leadership. According to Dr. Dweck (a Stanford psychology professor), each of us adopts one of two mindsets about life: the fixed or growth mindset. People with fixed mindsets tend to see human potential as static and finite; people with growth mindsets see human potential as more dynamic and elastic. Obviously, those who believe that leaders are “born, not made” subscribe to the fixed mindset. Those of us sharing the gcLi’s core philosophy—i.e. that leadership can be taught—fall into the growth mindset camp.\tWhen Dr. Deak compares neurological pathways to rubber bands, she invokes the growth mindset. Similarly, when a leadership scholar like Professor Ron Heifetz of Harvard distinguishes adaptive from technical leadership, his distinction implicitly entails growth vs. fixed mindsets too. Over the long haul, the more successful athletes, teachers, spouses, coaches, professionals and entrepreneurs naturally tend to manifest beliefs and behaviors characteristic of the growth mindset. Few of us are bound to enjoying playing or working for coaches or bosses with fixed mindsets. Dweck’s book is full of cautionary examples of those sorts of leaders (from the likes of the Enron executives to coaches like the mercurial—perhaps infamous—Bobby Knight).\tThese memorable, illustrative anecdotes are one of the signal strengths of Mindset. Many readers of this sort of literature are already well familiar with the process-oriented, growth-minded approaches of perennial champions like Michael Jordan or long-tenured UCLA basketball coach John Wooden. Both these remarkable competitors managed to achieve outstanding success in the win-loss column over long careers. But both considered winning merely an inevitable byproduct of their zealous pursuit of athletic excellence and their willingness to outwork their opponents. Seeking constant growth and improvement in their own teams’ abilities were Wooden’s and Jordan’s primary focus. By manifesting their growth mindsets this way, they were also able to accomplish unparalleled productivity and victorious results—but almost as an afterthought or matter of course.\tDweck and other similarly minded leadership scholars believe that leaders emerge naturally in organizations that prize learning and manifest pervasive growth mindsets. Her dichotomy also recalls James MacGregor Burns’s seminal distinction between “transactional” and “transforming” leadership. Transactional leaders—according to Burns—simply “exchange valued things” with their followers. They have a sort of quid pro quo arrangement, in which everyone’s needs and wishes get served despite possibly finite resources. Operating out of a growth instead of fixed mindset, by contrast, transforming leaders seek to enlarge the size of the relevant pie. Burns’s transforming leaders use mutual engagement between them and and their followers to enhance their collective potential, thus raising the possibilities for all.\tDweck closes her analysis by pointing out that we each can choose which mindset we embody from moment to moment. Her final chapter, for instance, offers a sort of self-guided workshop or tutorial one might follow to work on changing one’s primary (default) mindset. By showing how many contexts in which mindsets profoundly affect one’s experiences, prospects for success, satisfaction in life, or the quality of one’s relationships, Dr. Dweck offers her readers a simple, broadly significant insight."}, {"userName": "Roslyn Ross", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/3745545-roslyn-ross", "userReview": "1) The author begins by going on and on about how important she is and how important her ideas are. Which made her sound insecure, and let me know right off the bat that she does not trust me to read her ideas and determine for myself whether they are good ideas or not. 2) In the beginning she also announces her ideas as one more panacea. One thing that is the cause of all problems. This made it hard to take her book seriously at all.3) Her idea of fixed and growth \"mindsets\" is NOT a new psychology, it is the concept of self-esteem by a new name. Or rather one character trait of people with high self-esteem and low self-esteem. She wouldn't know this though, since her only knowledge of the self-esteem movement comes from pop culture dumb-downs and are inaccurate. She makes some statements about \"the self-esteem movement\" that she means as insults but for someone who has actually read quite a bit about it, just confirms that she has never actually read a single thing by Nathaniel Branden and has no idea what he meant by self-esteem. 4) Her idea of fixed and growth \"mindsets\" is also similar to the concept of securely attached and insecurely attached individuals. (I would say that attachment style is another aspect of self-esteem.) Again, since she is the classic psychologist that apparently does not read what her fellow psychologists are writing, she has no idea. She thinks she has discovered something new and different.5) That being said, thinking in terms of growth is great! And I think her book would be a help to many people.6) BUT keep in mind that this is a dumb-down. She doesn't really examine the issues at hand and develop a full theory, she just comes up with some fun words and takes an entire book to explain something she could have written a 1 page paper on.7) \"Growth mindsets\" are fascinating to me. Why some people feel \"right\" in life and others feel not-good-enough no matter what they do fascinates me. This issue is tied, not just to our psychology, but to the WAY we think, it's tied to how our brains form concepts and abstractions, it's tied to our repression of our own fear of death--our attempts to control life, it's tied to religion and our ideas of \"good\" and \"bad.\" It's tied to our culture and the messages we get in school and in the media, regardless of how we were parented. It's tied to our ideas about \"the pursuit of happiness\" and altruism. It's possibly tied to IQ. It's definitely tied to drugs--everybody has something they use to repress their strong feelings. This is a subject I have read hundreds of books on and I have found no real answer but plenty of panaceas! I too have noted that some people seem to take life lightly and others carry the weight of the world on their shoulders. Many psychologists (I think) are the latter and spend their lives trying to figure out how to be more like the former. They write these books trying to understand the light people and come up with all kinds of theories. And they're all a little helpful or at the very least interesting. That's this book: a little helpful.If this is a subject that interests you, skip this book and read: Happiness, a history by McMahon, Introduction to Objectivist Epistemology by Ayn Rand, and The Disowned Self or The Six Pillars of Self Esteem by Nathaniel Branden"}, {"userName": "Soheil", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/75570253-soheil", "userReview": "این کتاب یکی از تکان دهنده ترین کتاب هایی هست که تو زندگیم خوندم؛کتاب راجع به دو طرز فکر-یکی متکی بر استعداد های ذاتی انسان و دیگری متکی بر تلاش و پشتکار انسان- صحبت میکنه و با ذکر آزمایشات و مثال های مختلف از افراد مشهور و موفق تاریخ، بیان میکنه که مهم دونستن و بزرگ جلوه دادن \"استعداد\" چقدر میتونه مخرب باشه؛در واقع بیشتر به این مقوله میپردازه که \"استعداد\" اونقدری که ما فکر میکنیم تاثیری در رسیدن به موفقیت نداره و صرفا تلاش و پشتکاره که یک فرد رو در هر زمینه ای(حتی اگر بی استعداد باشه) به موفقیت میرسونه.مثال هاى متعددى از اشخاص برجسته براى فهم بيشتر موضوع وجود داره و نويسنده موضوع رو در جنبه هاى مختلف زندگى اعم از محيط شغلى و خانوادگى و سازمانى و... بررسى ميكنه.به هر کسی و با هر سن و سالی شدیدا پیشنهاد میکنم کتاب رو مطالعه کنه،ازون کتاباییه که نگرشتون رو دگرگون میکنه."}, {"userName": "Saeed", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/12085734-saeed", "userReview": "حرف این کتاب این است که دو نگرش وجود دارد یکی نگرش رشد و دیگری نگرش سکون، به این صورت که انسان باید همیشه رو به رشد باشد و کسی به یک باره و بدون زحمت یک قهرمان و سوپرمن نمی شودنویسنده در ستایش رشد و بالندگی مطالب زیادی گفته است، چیزی که من از این کتاب یاد گرفتم این است که خود من نیز تا حدودی قبل از خواندن این کتاب نگرش استاتیکی نسبت به مسائل داشتم، مثلاً زمانی که می خواستم وارد رشته ی جدید و محیط جدیدی که قبلاً چیزی از آن نمی دانستم بشوم ، همیشه ناراحت بودم که چرا من بهترین نیستم، نویسنده معتقد است که همیشه این اتفاق می افتد، شما استعداد یک باره و انفجاری نسبت به مسائل ندارید، شما به خاطر این اینجا هستید که رشد کنید و یاد بگیرید که اگر همه چیز را از قبل می دانستید و بلد بودید جایگاه تان مسلماً به عنوان استاد آن رشته بود نه به عنوان یک دانش آموز یا یک بازیکن ورزشیاگر معلم هستید این کتاب را بخوانید با خواندن این کتاب از آموزش هیچ یک از دانش آموزان ضعیف تر کلاس سر باز نمی زنید زیرا اگر این گونه هستید به فرآیند آموزش و یادگیری دانش آموزانتان آگاه نیستیدمطلب جالب دیگری که نویسنده در این کتاب اشاره میکند در زمینه ی ازدواج است که اگر بدنبال همسری رویایی هستید شاید سخت بتوانید آن را پیدا کنید و این شاید از نگرش استاتیکی شما نشئت می گیرد ولی اگر تغییر نگرش دهید و به این موضوع و باور برسید که هر انسانی توانایی تغییر و بهتر شدن دارد و ازدواج می تواند وسیله ای برای رشد دو طرف باشد، شاید زندگیتان به خوشبختی نزدیک تر شودلازم که ذکر کنم این کتاب کتابی است برای انسان هایی که عاشق رقابت هستند برای ورزشکاران که به دنبال اول شدن هستند و من خودم به شخصه خیلی این حجم از شور رقابت تویه کتاب را دوست ندارم انتقادی هم به کتاب دارم این است که انسان ها باید واقع بین باشند، درست که رشد در همه ی زمینه ها با تلاش برای همه ی انسان امکان پذیر است ولی این تلاش باید در زمینه ای صورت بگیرد که نقطه ی قوت آن فرد را نیز شکوفا کند، مثلاً فرض کنید یک فردی که 170 سانتی متر قد دارد درست است که با فداکاری از قسمت های دیگر زندگیش و تلاش زیاد بسکتبالیست حرفه ای می شود ولی این فرد هنوز هم نفر اول آن رشته ی ورزشی نمی تواند باشد تا زمانی که فردی با 2 متر قد با همان مقدار فداکاری و تلاش (و یا شاید کمتر) در آن رشته وجود دارد"}, {"userName": "Neil Lynch", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/4664225-neil-lynch", "userReview": "Walt Disney once said the best way to get something done is to stop talking about it and do it. Such a simple sentiment ought to be a no-brainer; and yet, how often have we let opportunities slip through our grasp because of the way we think, what we believe, or what we uphold as valuable?In MINDSET, Carol Dweck shares her research on that particular part of the brain and how it affects the way we live our lives and approach our goals. Using powerful examples, Dweck shows how too much praise of a child's intelligence or making too much of an employee's innovation can be just as bad as saying too little or nothing at all. She goes on to show how just a simple change in the way we think about the brain - in the way we THINK! - can make us lovers of learning and more resilient in the way we approach our lives, our work, our education - even our relationships!I worked at GE during the Jack Welch years, so it's not at all surprising to see him extolled here as a mindset model. Welch was a tough boss, but he was always hardest on himself. He was a straight shooter who owned up to his mistakes, actively sought to improve the way he did his job, and always - perhaps because he had come up through the ranks himself - went back to the employees, whom he considered to be the experts, for input and advice on how to make the company a better place.MINDSET is nothing new to me. Dweck's down-to-earth presentation of it here, though, is a welcome refresher and an inspiring read. Suffering from mindset? This book's for you!"}, {"userName": "Karen ⊰✿", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/8460201-karen", "userReview": "The idea of a \"growth mindset\" is a simple one, but quite profound for many people who have grown up believing that talents and abilities are \"fixed\". A growth mindset is possessed by those who believe that their most basic abilities can be developed through dedication and hard work.Not sure where you sit? You can take a questionnaire here: https://mindsetonline.com/testyourmin...Because it is such a simple concept, I found the book a bit repetitive and I think it could have benefited from more around how to develop and change your fixed mindset, rather than continually trying to prove why having a growth mindset is better.I recommend this book to anyone interested in self development, who is a teacher/trainer, or has children!"}, {"userName": "Sergei_kalinin", "userReviewDate": "Oct 24, 2013", "userURL": "http://www.goodreads.com/user/show/6536893-sergei-kalinin", "userReview": "Очень хорошая книга по саморазвитию! Пожалуй, одна из лучших за последние годы. Идея вроде бы проста: у каждого человека есть установка на рост ИЛИ установка на данность. Преобладающая установка определяет, будем ли мы меняться/учиться/личностно расти или нет. Вопрос проработан в книге очень хорошо, и заставляет ка следует задуматься над собой :)Мега-рецензия в моём блоге: http://s-kalinin.blogspot.ru/2013/10/..."}], "description": "Now updated with new research — the book that has changed millions of lives.After decades of research, world-renowned Stanford University psychologist Carol S. Dweck, Ph.D., discovered a simple but groundbreaking idea: the power of mindset. In this brilliant book, she shows how success in school, work, sports, the arts, and almost every area of human endeavor can be dramatically influenced by how we think about our talents and abilities. People with a fixed mindset — those who believe that abilities are fixed — are less likely to flourish than those with a growth mindset — those who believe that abilities can be developed. Mindset reveals how great parents, teachers, managers, and athletes can put this idea to use to foster outstanding accomplishment.In this edition, Dweck offers new insights into her now famous and broadly embraced concept. She introduces a phenomenon she calls false growth mindset and guides people toward adopting a deeper, truer growth mindset. She also expands the mindset concept beyond the individual, applying it to the cultures of groups and organizations. With the right mindset, you can motivate those you lead, teach, and love — to transform their lives and your own.", "title": "Mindset: The New Psychology of Success", "url": "http://www.goodreads.com/book/show/40745.Mindset", "average": 4.05, "cover": "https://images.gr-assets.com/books/1436227012l/40745.jpg", "reviews": 4459, "authors": [{"url": "https://www.goodreads.com/author/show/217172.Carol_S_Dweck", "name": "Carol S. Dweck"}], "type": ["Psychology", "Nonfiction", "Self Help", "Education", "Business"], "outlinks": ["http://www.goodreads.com/book/show/40745.Mindset", "http://www.goodreads.com/book/show/15758148-mindset", "http://www.goodreads.com/book/show/5494321-mindset", "http://www.goodreads.com/book/show/1307582.Mindset", "http://www.goodreads.com/book/show/13614924-mindset", "http://www.goodreads.com/book/show/36433680", "http://www.goodreads.com/book/show/18714036", "http://www.goodreads.com/book/show/419952.Self_Theories", "http://www.goodreads.com/book/show/20928491-the-secret-to-raising-smart-kids---hint-don-t-tell", "http://www.goodreads.com/book/show/9744815-succeed", "http://www.goodreads.com/book/show/2106182.Handbook_of_Competence_and_Motivation_First_Edition", "http://www.goodreads.com/book/show/24547453-appraising-the-human-developmental-sciences"]}