{"ratings": 221, "userreviews": [{"userName": "Lauren Hiebner", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/62852864-lauren-hiebner", "userReview": "A short story by Michener, he describes the bullfight culture in Spain. He reveals the spiritual influences both good and bad pitting the Catholic Church against the Gypsies of Tirana. I can relate having been in Seville, in the church of Tirana, and having attended bullfights. There is something majestic and mystical about bullfights. This was a fun read with a surprise at the end."}, {"userName": "Chelsea", "userReviewDate": "Mar 27, 2007", "userURL": "http://www.goodreads.com/user/show/41012-chelsea", "userReview": "The 26 drawings by American matador, John Fulton are an added bonus."}, {"userName": "Laura", "userReviewDate": "Oct 28, 2008", "userURL": "http://www.goodreads.com/user/show/1620374-laura", "userReview": "An interesting story about a ranch owner's mystic relationship with his bulls and his dedication to restoring honor to his family in this Spanish tradition."}, {"userName": "Juliet Kelty", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/70761437-juliet-kelty", "userReview": "One of the few Michener books that I could read in less than a decade. I tried to read 2 other books of his and though I like his perspective, they are incredibly slow going. This one was far less painful. Not a topic I’d expect to be into at all ... but he drew me in.Definitely worth the read."}, {"userName": "Bill Currie", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/3156026-bill-currie", "userReview": "Not only a beautiful study in bull fighting, it provided the cultural significant tied to both religion and mysticism. The story had such depth of legends of both bulls and matadors. A connection between both of them and displayed through the formal ritual of centuries long observance."}, {"userName": "Christopher Ramsay", "userReviewDate": "Jul 14, 2017", "userURL": "http://www.goodreads.com/user/show/43760083-christopher-ramsay", "userReview": "Short story (103 pages) about bull fighting in Spain. A little bit out of my normal interests, but worth the time."}, {"userName": "Inger Faherty", "userReviewDate": "Sep 26, 2017", "userURL": "http://www.goodreads.com/user/show/1819878-inger-faherty", "userReview": "Slow moving, awkward narration style. Too much background, not enough story."}, {"userName": "Suzanne Keetch", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/10706338-suzanne-keetch", "userReview": "This was a short read, but very interesting. I feel like I know much more about bullfighting than I ever did before and may even want to attend one day."}, {"userName": "Robin", "userReviewDate": "Sep 26, 2010", "userURL": "http://www.goodreads.com/user/show/1798704-robin", "userReview": "A friend loaned me this book because she knows I like James Michener. After witnessing a bullfight in Spain when I was young, I had to agree with Tom Lehrer that, “I hadn’t had so much fun since the day…that my brother’s dog Rover…got run over…” I suspected that there was more to bullfighting than met the eye, even though such a sight will never meet with my eyes again. I was fairly successful at laying aside my prejudices to enjoy this short (for Michener) book.Simple yet beautiful two-color line drawings compliment the text. Illustrator John Fulton portrays the world of bulls and bullfighters so well that it is no surprise to learn that he is an American matador based in Seville.Michener speaks in first person, casting himself as an American sports journalist on assignment. His descriptions of the styles and personalities of the four most popular matadors and his own relationship with the bull rancher are intriguing. His enthusiasm for the sport is obvious, and though his language is not extremely graphic, he does not sugar-coat the more brutal aspects of bullfighting. **spoiler alert!**Michener tells a tall tale of an old rancher, Don Cayetano, formerly among the most famous of bull breeders, producing bulls that fought bravely and honorably in the ring. Don Cayetano’s reputation had slipped throughout the years, and he prays to the Virgin Mary to restore quality to his bulls and honor to his family name. Even as he prays, his nemesis Lazaro Lopez, the cowardly gypsy matador, who seeks to dishonor the bulls, also prays, and their conflict drives much of the plot.I was enjoying the book quite a bit but really did not like the ending. If Hollywood ever makes this a movie, they will change that."}, {"userName": "Lynn Alan Heath", "userReviewDate": "Sep 11, 2016", "userURL": "http://www.goodreads.com/user/show/4569364-lynn-alan-heath", "userReview": "I usually like James Michener even though his books may have something I disagree with (Chesapeake begins with the assumption that evolution is fact, if I remember the book correctly). Miracle In Seville is filled with Catholic false doctrine. Not only that, but there is some Bible quoting that is just inaccurate quoting (the Scriptures do no where say that \"Jesus had resurrected and risen to heaven\" nor do they call Mary \"the mother of God\"). I was disappointed by such a lacks regard for the Bible."}, {"userName": "Alex Teixeira", "userReviewDate": "Sep 27, 2009", "userURL": "http://www.goodreads.com/user/show/2780857-alex-teixeira", "userReview": "I recently wanted to buy a copy of this book for a friend and discovered that here in the United States, the book is out of print, though you can still find \"new\" copies in a few places. An American journalist travels to Seville on assignment and he's to report on efforts a rancher is making to revive his once-proud line of bulls. But the story discovered goes deeper into life's mysteries as it shakes the newspaperman's skepticism and opens his eyes to the wonder of faith.I have the hardcover illustrated edition and It's a magical little book."}, {"userName": "Shannon", "userReviewDate": "Dec 29, 2013", "userURL": "http://www.goodreads.com/user/show/4886312-shannon", "userReview": "Normally I go to great lengths to avoid any book described as an \"epic saga\" (a typical description of a Michener novel), but Michener's writing is so compelling that I am willing to read something that would normally bore me to death. In this case, the topics of bullfighting, gypsies, and veneration of Mary hold little appeal for me, but Michener made them interesting. And I'm glad he wrote a book I could finish in four days!"}, {"userName": "David E.", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/43492051-david-e", "userReview": "Overall I enjoyed the book, and the way it painted such moving and ultimately tragic characters in a short and simple tale. It's a quick read and although I found the \"miracle\" to be something of a disappointment, the joy in this book is getting to the climactic end as opposed to the end itself. Even the characters you are suppose to hate emerge as surprisingly complex by the final pages, quite an accomplishment for a novella of 107 pages."}, {"userName": "Ron", "userReviewDate": "Apr 12, 2012", "userURL": "http://www.goodreads.com/user/show/8717740-ron", "userReview": "A relaxing few hours of reading about Matadors & bull fighting in Spain.As I was wondering around Newport Beach's Main Library looking for something that I have not read, I was surprised to find a book by James Michener of only 107 pages. Although not an epic like his other books, this was captivating and brought back memories of my visits to Spain.The ink sketches by John Fulton are excellent and add to the character of the book."}, {"userName": "Karen Jett", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/2437434-karen-jett", "userReview": "Since James Michener passed away, I have been saving this book as there are so few of his books I haven't read...I liked having one on my bookshelf waiting for me.I enjoyed this book as it is a delightful and fanciful story. But, having read most of what Mr. Michener has written, it is more of a short story than a book. So, if you've ever wanted to try reading James Michener but were afraid of the size of his books, this is a good place to begin."}, {"userName": "Rosie", "userReviewDate": "Jul 01, 2016", "userURL": "http://www.goodreads.com/user/show/14910908-rosie", "userReview": "Bull fighting explained - how the bulls are bred and raised and the pride of their strength and honor.The author meets up with the breeder, Don Cayetano Mota, and understands how he believes in his bulls and sometimes is one with them. The actions of the bull fight are explained with honor. Excellent short book."}, {"userName": "Kelly", "userReviewDate": "Sep 19, 2008", "userURL": "http://www.goodreads.com/user/show/846465-kelly", "userReview": "Michener told the story of three bull fighters, their etiquette in the ring, and their technique to kill. It also shares the experience of a bull breeder who watches his bulls fight in the ring courageously or humiliated by the matador."}, {"userName": "Mike", "userReviewDate": "May 19, 2008", "userURL": "http://www.goodreads.com/user/show/1110009-mike", "userReview": "Probably Michener's shortest work, but still very strong by my standards. It says anyone who can attend Holy Week in Spain should do so -- you never know what you're missing by not being there. It could be quite a lot."}, {"userName": "Jackie", "userReviewDate": "Jul 27, 2016", "userURL": "http://www.goodreads.com/user/show/14437478-jackie", "userReview": "What I really liked about this book was the beautiful binding, the pages, and the illustrations. The ink was a brown, and every page was a wonder to read. I saw there is a second volume to this book, so I will find that in hardcover as well."}, {"userName": "Janet", "userReviewDate": "Jul 15, 2010", "userURL": "http://www.goodreads.com/user/show/1865679-janet", "userReview": "Story wasn't that good but it did have some interesting information about bullfighting in Spain"}, {"userName": "Mark Vargo", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/5122735-mark-vargo", "userReview": "Classic Michener style, though very short by his standards. I am not generally fond of mystical conclusions, but when the title is \"Miracle in Seville,\" I suppose I cannot complain."}, {"userName": "Gaynelle Gilbride", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/28075877-gaynelle-gilbride", "userReview": "Great book, I found this book at a book sale and found it to be amazing with the history of raising bulls and the events behind this. Great book read and learn from."}, {"userName": "Katie", "userReviewDate": "Mar 17, 2016", "userURL": "http://www.goodreads.com/user/show/53699165-katie", "userReview": "Enchanting book. It made me miss Seville and its Holy Week so much. Great illustrations, too."}], "description": "James A. Michener, one of the world's most popular authors, returns to Spain, the setting of his bestseller Iberia, with this magical novel of Seville at Easter time -- a season of splendid pageantry, thrilling bullfights, and deep piety. And, of course, miracles.An American journalist is in Seville on assignment. He is to report on efforts the rancher Don Cayetano Mota is making to revive his once-proud line of bulls. But the story Shenstone discovers goes deeper into life's mysteries as it shakes the newspaperman's skepticism and opens his eyes to the wonder of faith. To return his bulls to honor. Don Cayetano Mota prays to the Virgin Mary, and he takes on Herculean acts of devotion during the solemn celebrations of Holy Week. Convinced that his prayers will be answered, he endures his bulls' humiliation in the ring and the taunts of the arrogant matador Gomez. But Gomez, too, has a powerful woman on his side -- his sister, a Gypsy fortuneteller. Foreseeing the danger her brother faces from a Mota bull, Magdalena is determined that in the bullring her brother will prevail.Robert Vaughn is known to television audiences around the world for his portrayal of Napoleon Solo in The Man from U.N.C.L.E. His other television credits include the miniseries Inside the Third Reich, The Blue and the Grey, and Centennial. He has appeared in more than 75 films, including The Magnificent Seven and The Towering Inferno.", "title": "Miracle in Seville", "url": "http://www.goodreads.com/book/show/472772.Miracle_in_Seville", "average": 3.59, "cover": "https://images.gr-assets.com/books/1365739907l/472772.jpg", "reviews": 24, "authors": [{"url": "https://www.goodreads.com/author/show/7995.James_A_Michener", "name": "James A. Michener"}], "type": ["Fiction", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/472772.Miracle_in_Seville", "http://www.goodreads.com/book/show/10148232-miracle-in-seville", "http://www.goodreads.com/book/show/787209.Miracle_in_Seville", "http://www.goodreads.com/book/show/12658.Hawaii", "http://www.goodreads.com/book/show/12657.The_Source", "http://www.goodreads.com/book/show/133430.Centennial", "http://www.goodreads.com/book/show/12661.Chesapeake", "http://www.goodreads.com/book/show/12663.The_Covenant"]}