{"ratings": 387873, "userreviews": [{"userName": "Kate", "userReviewDate": "Nov 05, 2007", "userURL": "http://www.goodreads.com/user/show/182422-kate", "userReview": "'Misery' is a gruesome story of torture with blood, guts, and a psychopath. It's a well told tale, the characters are well developed and the fact that there are only two of them never gets boring. It's a real page turner, in fact I finished it tonight after getting off the subway on the platform before I walked home. But, this book is more than just a thriller, just like King is more than just a pulp writer.I read an article by the ever optimistic and cheerful Harold Bloom in college about how dismayed he was that young people like Stephen King so much. All the literature crtics I've read hate King and it seems like it's just because people actually enjoy reading his work. Yeah, Bloom, I said 'work' just like I would about Tolstoy's 'work' because Stephen King as damned hard worker. Think of all the books he's churned out over the last few decades. I'd like to see Harold Bloom show enough imagination to write fiction instead of just criticizing it all the time.I'm actually new to Stephen King's fiction. I've read a few of the essays and articles he's written and a really great graduation speech he gave at UMaine awhile ago in which he extolled the virtues of our mutual home state, but this is only my 3rd novel by him. I like this guy, and I know why too. It's not just because he makes me scream and I have a hard time putting his books down, it's because King loves writing. He has a real and self-aware relationship with what it means to be a writer. He knows he's not Tolstoy or Faulkner, he doesn't try to write that way. He knows how to tell a good god damned story and he has a passion for it. I appreciate his self awareness as a writer and the fact that he ackowledges how difficult the whole process is while not making us feel like he's somehow superior because he's figured out how to do it.In 'Misery' it's almost like we get to watch King write this story. He doesn't just set us up for a crazy story and watch us discover things about his characters, it feels like he actually comes with us and makes the discoveries at the same time we do. That's what makes a good storyteller. And I don't give a damn if Bloom likes him or not."}, {"userName": "Kemper", "userReviewDate": "Sep 22, 2007", "userURL": "http://www.goodreads.com/user/show/405390-kemper", "userReview": "Honestly, who among us hasn’t gotten frustrated with their favorite writer and felt like holding them prisoner while forcing them to write the exact book that we want?Well, don’t do that because it would be wrong! What kind of twisted freaks are you people?!?Paul Sheldon is a best selling author who just ended his popular series of romance/adventure novels by killing off the lead character, Misery Chastain. After finishing a new novel at a Colorado resort Paul has a car accident and awakes to find that his legs have been shattered, but that he’s been saved by his self-proclaimed number one fan, Annie Wilkes. Unfortunately, Annie turns out to be more than just a little crazy, and when she learns that Paul killed Misery in the latest book she demands that he write a new one that brings back her favorite character. Held captive by a madwoman, Paul is almost helpless to resist the physical and psychological tortures she uses to get her way while insisting that it’s really for his own good.This book seems eerily prophetic of King’s career in some ways. Uncle Stevie hadn’t yet frustrated readers of his Dark Tower series with long delays between books, and yet he absolutely nailed the self-righteous fury of a fan who feels somehow cheated out of what they deserve. You gotta think that later on King worried that he had some version of Annie out there just waiting to chain him to typewriter to finish DT. He was also years away from suffering his own enormous physical trauma after being hit by a car, but he still makes you feel every agonizing moment that Paul suffers from his accident and at Annie’s hands. Like Paul, King would also have the experience of returning to writing being a matter of overcoming physical pain but also finding it to be a way to escape it.One of King’s biggest strengths is that he knows the power of a good story, and this plot serves him well by really letting him dig into that. Annie’s obsession with Misery is something that probably almost every reader can relate to, but what’s really interesting is how Paul’s need to tell the story becomes just as compelling as Annie’s threats. The set-up lets Uncle Stevie explore the whole notion of just why we gotta know what happens next as well as the rules that make it a satisfying resolution or a cheat.I could make a pretty solid argument that this is King’s best book. He was very much at the peak of his powers here, and either the simple two person structure of the story or good editing kept this at a normal novel length. That’d become a rarity in his bloated books after this, and it does feel like King at his most disciplined. In Annie Wilkes he crafted a character worthy of being included in a Villain’s Hall of Fame, and he makes good use of her as a figure who can be terrifying, sometimes tragic, and weirdly humorous at times. However, I’m not saying it’s my favorite King book. (Probably The Stand or the last Dark Tower hold that honor.) Why wouldn’t his best book be the one I enjoy most? Because he did just too good of job on making us feel Paul’s pain. Sure, this is a book about a man who suffered a terrible accident and then found himself brutalized at the hands of a psychopath so it makes perfect sense that Uncle Stevie would want us to ache along with Paul. Yet, it’s very hard to spend an entire book with a main character who is almost always at some level of agony without feeling worn down by it. It’s necessary for the plot, but it also makes it a slog at times.So it's definitely among King’s best, but it's also one I haven’t read it nearly as many times as some of his others because it’s simply too damn tough to get through at times. Still it’s a 5 star ride if you grit your teeth and keep reading as Paul keeps on writing."}, {"userName": "Dan Schwent", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "To celebrate completing a novel, writer Paul Sheldon goes on a champagne-fueled drive in the Rocky mountains. He winds up in a near fatal car crash, but never fear. He's rescued by Annie Wilkes, his #1 fan...I watched the film version of Misery in those antediluvian days before Goodreads, hell, before the Internet, and decided to finally read the novel when it showed up on my BookGorilla email one day. It was $2.99 very well spent.Misery is a tale of obsession, addiction, and obsession. I wrote \"obsession\" twice but it's a such a big theme I thought it was justified. Annie Wilkes is obsessed with her favorite series of books starring Misery Chastain, written by that dirty birdie Paul Sheldon. Paul is obsessed with finishing the book Annie has demanded of him and probably addicted to writing. Also to codeine.I've said it before but I'll say it again. If Stephen King wasn't addicted to scaring the bodily fluids out of people, he'd be a literary writer of some renown. The guy can flat out write. Just because he cranks out a best seller more often than most of us go to the dentist doesn't mean he's the real deal.The scariest horror stories are the ones that could actually happen and Misery is one of those. Who among us hasn't had visions of being held captive when driving through a remote locale? Annie is so much more than the scene-chewing maniac she could have been. She has dimension and believes she's in the right, which is the mark of a great villain. Her background is very fleshed out and my heart sank as I learned her past along with Paul. How the hell was he going to escape that monster?Paul's journey is painful, both to him and to the reader, thanks to King's skill. I had to make sure my foot was still attached a couple times. Annie puts him through hell and he finally gives her a taste of her own medicine but the ending is far from happily ever after.As is usually the case, the book was a notch better than the movie. I've been easy with the 5's this year but I'll give this one a cockadoodie 5 out of 5 stars just the same."}, {"userName": "Stepheny", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/7091879-stepheny", "userReview": "My whole life people have had a hard time handling my obsessive passionate personality. I don’t ever just like things- I’m either completely enamored with it or not all that interested. It’s just how I was made. My obsession with Harry Potter is seen as “excessive” and I’m constantly made fun of for my fondness of it. I get asked “aren’t you a little old for that” almost regularly and I have given up trying to respond because I really don’t feel it necessary to explain myself to anyone. I am also ridiculed for my obsession with Stephen King. I find his writing to be nothing short of amazing and people who aren't fans of his just think he writes “that horror and gore crap”. Surely a serious reader can’t be a King fan. According to a lot of people I know it works the same way when flipped around- a King fan cannot be a serious reader. Well, I will tell you I am both. I am a King fan  and and a serious reader. But, I’m not always a serious reviewer. For you all I have compiled a list. This list is my defense:\nReasons Why I’m NOT the Real Life Annie Wilkes\n1.) I would never harm Stephen King in any way, shape or form. Not intentionally anyway- I may accidentally harm him by tripping over my own feet in a rush to get to him and crash into him causing him to fall through a window. Or I might tackle him from behind in an attempt to hug him fiercely. I might even bite him just to see if he’s real. BUT I would not hurt him.2.) I have never killed anyone. (I think legally I am required to say that…)3.)I don’t have an unlimited supply of any type of narcotic. I have a cousin who’s a doctor, but he’s of the Straight and Narrow variety. 4.) I don’t have…..\t\t\t lapses in my thoughts.5.) I understand the severity of an addiction and understand fully that King has struggled with it in his past, therefore I wouldn't get him hooked on a painkiller to make him completely dependent on me.6.) I wouldn’t want to have Stephen King in my home. Don’t get me wrong, I have a beautiful home, but his house is way fucking cooler. I mean- gargoyles on a wrought iron gate that looks like a spiderweb?! HOW fucking awesome. 7.) Being that I want to be in his house so bad, I would just like to sneak in a back window and hide in a cupboard and live in his house without him knowing for as long as possible. I’d sneak a shower in his shower, smell his clothes, lie on his side of the bed, lick his typewriter…you know those kinds of things. 8.) I want to be friends with Stephen King- not make him fear for his life. I think if he were to meet me he’d be completely charmed by my glowing personality and welcome me as one of his own by saying: “Welcome to the family, kid!” or something along those lines.9.) I’d order take-out instead of making him eat all that soup in the event that he was in my home. We could eat Chinese food while watching old horror flicks together. BFFFL.10.) My final point- my name is Stepheny, not Annie, so I can’t be her.All around this was a great read- you should totally check it out.And for the record, Stephen King, you have nothing to be afraid of. Signed,Your Number 1 Fan."}, {"userName": "Julie", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/5211606-julie", "userReview": "Two Sundays ago our family experienced a rather harrowing emergency situation. I'm thrilled to report that tragedy was averted; I'm less excited to share that my arm was broken in the process.A broken arm is a perfectly acceptable price to pay for a whole family, but it is also a painful pain in the ass. And, because I'm a classic overachiever, I broke my arm in the “most painful way possible,” and I have been relegated to bone broth, limited mobility (to prevent the need for surgery) and left handed, one finger typing (damn it!).As my convalescence began (10 long days ago), I found myself not only in pain and discomfort, but surprisingly more and more weepy as well. Melancholic, I believe they call it. So not my norm. A chipper friend quickly became flustered by my new, dark voice and demeanor and contributed that she bring me some “upbeat romantic comedies and light, humorous reads from the library.”“Fuck that,” I cheerfully responded. “I'm reading Stephen King's Misery.”Misery, in case you crawled out from under a rock or were just born, is one of Mr. King's most famous novels. Though I am a devotee of the King (and a total literary snob, by the way), I have always avoided his “horror” novels. I had assumed a “been there, done that,” attitude with Misery, having watched the movie. But, I'm so happy I finally read it. As usual, the book is an entirely different experience.The basic premise, without any overt plot spoilers is this: A 42-year-old, twice divorced novelist named Paul Sheldon, who has become famous for a series he created (but loathes) called Misery, finishes a new manuscript (in a hotel about 15 minutes from my house!), and celebrates his original, not Misery related writing achievement by drinking copious amounts of champagne. He mistakenly heads out, drunk, into a winter storm and badly crashes his car on a mountain road near the fictional town of Sidewinder, Colorado.Paul is badly injured. Left on his own in the storm, without immediate medical attention, he'd have most likely died. Lucky for him, a former nurse discovers his recently crashed car, brings him home and nurses him back to consciousness. When Paul “wakes” to his new reality, he is grateful to the nurse, the indomitable Annie Wilkes, but he is terrified and confused when he sees his mangled legs. Why hasn't she called for help?Turns out Annie's a real psychopath. She's his “number one fan,” and no outside help will be needed for Paul's poor legs, which are pointing every which way but loose. Mr. King introduces us to Annie:She was a big woman who, other than the large but unwelcoming swell of the cardigan sweater she always wore, seemed to have no feminine curves at all—there was no defined roundness of hip or buttock or even calf below the endless succession of wool skirts she wore in the house (she retired to her unseen bedroom to put on jeans before doing outside chores). Her body was big but not generous. There was a feeling about her of clots and roadblocks rather than welcoming orifices or even open spaces, areas of hiatus.Paul quickly realizes he's “in a jam,” but he also mistakenly believes himself to be in the worst mental and physical pain of his life: There comes a point when the very discussion of pain becomes redundant. No one knows there is pain the size of this in the world. No one. It is like being possessed by demons. (I hear you, Paul!).It doesn't take Paul long to understand that the current pain he's in is child's play compared to what will come. He's barely begun his journey with Annie before he recognizes that she was a woman full of tornadoes waiting to happen, and if he had been a farmer observing a sky which looked the way Annie's face looked right now, he would have at once gone to collect his family and herd them into the storm cellar.But Paul doesn't have family. Not really. He's got 2 ex-wives, no kids, no siblings, and parents who are only mentioned in the past tense. He's a loner, a lonely writer who wonders if anyone out there will even care enough to conduct a search for him.And here's the meat for me: I fell in love with him. Paul's sadness, his journey, the span of his suffering and grief are so tenable, so credible, too. We go deep into his psyche, learn his foibles and flaws and get taken along on some keen writing lessons, too.Mr. Sheldon quickly earned a place in heart as my second favorite “King character” (second only to Jake Epping from 11/22/63.So, you may be wondering. . . how gruesome does this get? Gruesome, but only one scene made me truly sick to my stomach.And, you may be wondering. . . Five stars, Julie? Really? Is it really that good? Yes. Other than one cheesy lag in the middle, when the reader gets taken down Memory Lane, and most of Annie Wilkes's backstory is too conveniently spoon-fed to us, it's that good.It's not 11/22/63, and it's not Lonesome Dove, but storytelling doesn't get much better than this, nor does it need to.(Entire review typed with the pointer finger of my left hand.)"}, {"userName": "Nayra.Hassan", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/44531801-nayra-hassan", "userReview": "و لماذا لم نخطف د.تامر ابراهيم ليكمل لنا ثلاثية \"الذي لم يمت\"؟ فالاعوام تمر و تمرو لماذا لم نخطف د.احمد خالد توفيق لنعيد رفعت اسماعيل للحياة؟.. .فقد كان يؤنسنا حقا و لماذا لم يخطفوا ارثر كونان دويل ليعيد شرلوك هولمز للحياة؟ فهو من قتله لمزاجه الخاص😈لاننا عاقلين طبعا  منذ ان افاق بول شيلدون على انفاس تقتحم جهازه التنفسي قسرا برائحة الفانيليا و الشيكولاته ..أدرك ان احلى ايامه قد مضت إلى غير رجعة ..فهل من الممكن ان تعيش بسلام بعد ان قابلت\" انى ويلكوكس \"؟ فلتتامل جيدا تلك الممرضة الممتلئة البشوشة و ركز في لون السائل الذي تحقنك به ..فقد تكون حقنتك الأخيرة 💉ميزرى هي رعب دفين لدى كل مؤلف شهير تغريه الاجزاء المتعددة..احذر فقد تودي بك إلى حتفك ..ستصبح كلمة: اكتب هي كابوسك المقيم ستظل اني ويلكوكس اغرب بطلات كينج و تتربع مع مهرج\"الشيء\"على القمة فهي : المعجبة رقم واحد. .لقب ساحر لولا اصرارها المرعب على أن يعيد كاتبها بطلتها المفضلة للحياة .و لو بخطفه و احتجازه و تكسير ساقه مرارا🙈 و ما خفي أكثر بكثير..من السهل ان يتحول هذا النمط من الروايات ثنائية الشخصيات إلى مسرحية مملة و لكن ليس هذه المرة ..جاءت الرواية كمطاردات مرعبة لن تنشر ابدا لتوم و جيري🐱🐀اابي رجل علم رزين لا يهوى السينما و لكن يكفي \"فيلم ميزري \"فخرا انه الفيلم الوحيد الذي تابعه بحماس تفاعلى لم يتكرر ابدا. .و هو بالفعل في جودة الرواية"}, {"userName": "Will M.", "userReviewDate": "Jul 13, 2014", "userURL": "http://www.goodreads.com/user/show/20408288-will-m", "userReview": "*I just watched the movie and I can safely say that the book was 100x more enjoyable for me. I didn't like the changes that they did, but the cast was spot on. Couldn't ask for a better Paul and Annie. -------------After the two month hiatus from Stephen King, I promised myself that I'm not going to let the fact that he's my favorite author, affect my rating of whatever book of his I'm reading next. I think I've proven myself before by giving Wizard and Glass a 2-star rating, even if it was damn hard. I'm very straightforward when it comes to wasted time because of reading a horrible book. Misery is not one of those books. Misery is one of those I'd recommend it to everybody I know kind of books.I'm not going to dwell much on the summary, because it sucks when spoilers ruin one's book experience. I've had a few encounters with spoilers, and honestly that's the real reason why I haven't read Stephen King's \"It\" yet. I already know the secret/mystery to it, but I'm getting a first edition hardbound copy of it though, so I'm reading it soon. Anyway, back to Misery. To keep it short, it's all about Paul Sheldon, the writer, being held captive of the crazy psycho Annie. She's obsessed with him, but that's not the only reason why she did those crazy things. She's just normally cock-a-doodie in the head.Just like most of the King novels I've read, the main epitome of greatness lies on the characters. King has the gift of creating characters that would leave a mark. They're just so well developed that you'd learn to love them one way or another. Paul was quite similar to Louis Creed from Pet Sematary. His writer characters are quite similar in a few manners but they still have great qualities of their own. Paul exuded a genuine personality in this novel. It was hard not to like him because his panicky behavior right from the first ten chapters already made me like him a lot. Right till the end, he remained true to his character. Annie on the other hand was completely terrifying. I love psychological thrillers, but Stephen King managed to incorporate a huge amount of horror in the genre. Annie was not just scary, but she gave me a phobia. A phobia of crazy psychos capable of doing what she did in the novel. I liked her, despite all the craziness, because she delivered what she was supposed to in the first place. In the psycho thriller genre, the crazier and scarier the better. King can write anything he wants.Aside from the characters, I really liked the violence. Annie didn't hold back, she did crazy gut wrenching things. I've read and seen worse of course, but the things she did were still quite scary. Because it seems to fit the situation well, and hopefully you guys reading this used to watch spongebob, all I can say is \"MY LEEEEEG\".5/5 stars. Like I said in the first part of my review, I was not biased when I rated this a 5. This novel deserves no less. It was amazing and I can't believe I've only read this now. I'm highly recommending this, but be warned that you might lose a few nights sleep. Pet Sematary was still a bit scarier that this, but Misery gave a different kind of scare because it didn't have that supernatural element that I knew was not going to happen in Sematary. Misery felt real because there might be an Annie waiting to kidnap me like that. King can give you different kinds of scare, and all of them are equally terrifying. One of those King novels I plan on reading again in the future."}, {"userName": "AMEERA ", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/32325414-ameera", "userReview": "4.75i can tell this my favourite book of Stephen king so far"}, {"userName": "Flor", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/55277703-flor", "userReview": "Horrorosamente GENIAL.!! 😱😱😱Directo a la lista de mis libros favoritos .!! Me ha encantado y a la vez me ha hecho sufrir de miedo, angustia y tensión desde el primer capítulo hasta el último.Tuve pesadillas dos noches seguidas...Estoy convencida de que los libros que generan tantos sentimientos en el lector merecen muchas estrellas.!!Me gustó mucho el guiño que hace el autor a “El resplandor”. Stephen describe tan bien a los dos personajes de esta novela, que por momentos me olvidaba que estaba leyendo y me sentía igual de atrapada que Paul en la habitación de huéspedes. En cuanto a la villana, Annie Wilkes ha despertado en mi un odio infinito y va a ser muy difícil que la olvide. Espero que si no lo han leído se animen y que lo disfruten tanto como yo .! Saludos.!!"}, {"userName": "Raeleen Lemay", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/3452652-raeleen-lemay", "userReview": "Read for Popsugar's 2018 Reading Challenge #13: A Book that is Also a Stage Play or a MusicalThis was super great! It was suspenseful, and the characters were very vivid. The whole thing was bogged down a tiny bit by the book-within-a-book bits (I'm not as big of a fan of Paul's writing as Annie is lol) and it was less gory than I was expecting, but other than that it was fantastic! Definitely one of my favorite Stephen King books that I've read so far (It is still my favorite at the moment.)"}, {"userName": "Natalie Monroe", "userReviewDate": "Oct 16, 2011", "userURL": "http://www.goodreads.com/user/show/6688207-natalie-monroe", "userReview": "Misery was my first ever Stephen King novel.There I was, an impressionable 14-year-old girl drunk on romances with none-fade-into-black sex scenes. Then my favorite English teacher recommended I read Misery. \"Your life will never be the same,\" he said.He was right.Misery is about the kind of fan that loves their chosen celebrity a little too much. Like the man who shot John Lennon. Or stalkers that drive to Miley Cyrus's house with a bouquet of roses and a foam finger. The odd buttons that spoil a fandom. In this case, Paul Sheldon was rescued from a car crash by his number one fan, Annie. She loves his books, so when she finds out Paul killed her favorite character in the latest installment, she gets a little... upset.But no matter, she has the brains behind the masterpiece right here! Paul is going to bring his character back from the dead for one last encore or she'll get upset again. And you do not want to make Annie upset.You scared yet?King's writing has a way of putting you directly in a character's shoes. Only he can make the abhorred third-person into first-person, so you're there with Paul every second of the way. You feel his terror when he realized his caretaker is not quite right in the head. You feel his pain from drug withdrawal. You feel the resignation of burning your only first-draft manuscript in order to obtain said drugs. \n“The work, the pride in your work, the worth of the work itself...all those things faded away to the magic-lantern shades they really were when the pain got bad enough.” \nThe shame. The rage. The hate.This is horror at its finest. One human imprisoned in a house by another. No cheap jump-scares. No bloody gore factor. No dime-store costume. This is nail-your-balls-to-the-wall psychological shit, and damn if you don't lie awake at night wondering if the dark shape in the corner is Annie with a chainsaw in hand. So come along with me, dear Constant Reader. And be King's number one fan."}, {"userName": "Trudi", "userReviewDate": "Aug 12, 2008", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "[One of the things I love about Annie is that she's not just \"crazy as a shit-house rat\". King writes her with real depth and nuance. Like Paul, we can see who she might have been if the chemicals in her brain were balanced, or her childhood was different, or all the other permutations that contribute to madness were absent. One of my favorite scenes in the novel is when Paul discovers Annie's \"Memory Lane\" scrapbook, a collection of all her murders. I love that singular moment of pure, crystalline terror when Paul realizes what he's really up against. How deep her sickness really goes. How twisted her mind really is. (hide spoiler)]"}, {"userName": "Vitor Martins", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/5000720-vitor-martins", "userReview": "Devo começar dizendo que esse foi o primeiro livro da minha vida que me fez sentir MEDO REAL OFICIAL™Esse, sem dúvidas, é um livro intenso. Logo nas primeiras páginas eu já me senti completamente preso e desesperado para saber como a história iria se desenrolar. Quanto mais eu lia, mais eu me envolvia com os personagens e, mesmo quando eu fechava o livro, não conseguia parar de pensar na Annie. Por vários dias encarei o livro no meu criado mudo antes de dormir e simplesmente não tinha CORAGEM de pegar pra ler. Desculpa, mas sou cagão mesmo. Annie Wilkes é uma das personagens mais complexas, imprevisíveis e doentias que eu já li. Ouvir a história pelo ponto de vista do Paul, sem saber do que sua fã número é capaz, e ver aos poucos ela ir passando dos limites foi uma experiência inesquecível. Intercalei a leitura do livro físico com o audiobook e ouvir a narração de Misery deixou tudo com um tom muito mais sinistro. A narradora é excelente e enquanto eu escutava o livro no ônibus, minha mão suava frio, minha perna tremia e minha garganta ficava seca. Uma delícia, rs. Além do plot principal sobre uma mulher louca, obcecada por seu autor favorito, Misery tem várias camadas mais profundas. Toda a questão sobre fã x ídolo que o Stephen King levanta nessa história, nos faz pensar muito sobre como as pessoas reagem hoje em dia quando seu livro preferido não termina do jeito que elas esperavam. Ameaças de morte pelo Twitter, ataques em massa contra autores/músicos/artistas etc, mostram que existem muitas Annies por aí e isso é, ao mesmo tempo, fascinante e assustador. Depois dessa leitura, Stephen King segue sendo um dos autores que mais me instigam e o meu interesse por seus livros só aumenta!"}, {"userName": "Ron", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/43881851-ron", "userReview": "Update 1/8/17:There’s crazy, and then there’s the Mommy, I’m scared crazy. Annie is that second one. She’s the one you don’t want to cross - in any way. Ticking time bombs are called ticking for a reason. At some point, they’re going to go off. But Annie’s like a wasp compared to the honeybee because she’s the bomb that can explode, and explode, and explode. Poor Paul Sheldon. He didn’t even get the chance to avoid the crazy that is Annie. ”I’m your number one fan!” My ass.Movie confession. Yes, I‘ve seen it. Great flick, but at some point since then I’ve learned to read the book first. For Misery the order was reversed. Not a horrible thing to do, especially when the movie is a good one. But while reading, James Caan continued to flicker in and out of my mind as Paul Sheldon. Same thing for Kathy Bates/Annie Wilkes. Again, not a bad way to picture characters. I simply prefer a clean slate. Although the faces from the movie were clear, the details I remembered were not. Excepting a few scenes. I mean, some things cannot be forgotten. Sledgehammer anyone? So imagine my surprise when that oh-so-horrific moment arrived in the book. Slightly, yet completely different! I literally wanted to scream, “NO Annie please!” along with Paul. Oh, the pain. It was palpable.Misery is among King’s best. It’s also shorter than most. Condensed is the feeling. He still meanders with some tangents, but doesn’t dilly-dally for long before coming back for another blow to the senses. I will not be able to look at this book in the future without feeling a visceral response traveling directly to my legs.------------------------------------------------------------------------------1/7/17You're the dirty bird Annie Wilkes, and this is for you: \"I want to look her straight in the eye and tell her what a cheap, lying, no good, rotten, far flushing, snake licking, dirt eating, inbreed, overstuffed, ignorant, blood sucking, dog kissing, brainless, dickless, hopeless, heartless, fat assed, bug eyed, stiff legged, spotty lipped, worm headed, sack of monkey shit she is!!! Halleluah!! Holy shit!! Where's the Tylenol??\"Ok, so those were Clark Griswold’s famous words from Christmas Vacation. I thought they fit Annie to a tee."}, {"userName": "Mario", "userReviewDate": "Dec 04, 2014", "userURL": "http://www.goodreads.com/user/show/16628840-mario", "userReview": "The reason authors almost always put a dedication on a book, Annie, is because their selfishness even horrifies themselves in the end.Goodbye sleep and hello Annie!I'm certain that my favorite book by King will always be Pet Sematary, but this book came pretty close to changing my mind. And just like I'm sure that Pet Sematary will always be my favorite, I'm also sure that Misery one will always remain my second favorite. I honestly don't know how King does it. This is, without a doubt, the most disgusting and the hardest book I've read so far. And I loved every second of it. (does that make me a weird person? probably)Now about the book...Meet Annie Wilkes, a nice old woman who likes to read (just like all of us), but who also has a hobby of capturing and torturing her favorite author (unlike all of us... at least I hope). Annie is one of those character that will definitely pay a visit to me in my dreams. She's even scarier than crazy Jack Torrance. (Wouldn't the two of them make an excellent couple?!) But on the other hand, we have Paul Sheldon. And, unlike Annie, he became my favorite King's character. Even though Annie made this book interesting, I loved hearing from Paul's POV. In my opinion, he as a character was even more interesting than Annie. And in the end, I'm just going to say that if you love King (or you're just a horror fan in general), but for some reason still haven't decided to pick up this book yet, do it. You definitely won't be disappointed. This is King at his best."}, {"userName": "emma", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/32879029-emma", "userReview": "a list of things this book was:- disgusting- disturbing- a quick read, surprisingly- really fond of using sexual assault as a metaphor (cool cool cool)- harmfully stereotypical in terms of race (the Africa references/setting)- harmfully stereotypical in terms of gender (so much man-goes-to-work woman-stays-home)- honestly just pretty hateful toward women??- all for using the n word without blinking, apparentlya list of things this book was not:- scary- all that great of a read for mebottom line: i guess i get the stephen king appeal. but, uh. NOT A FAN.-----------PRE-REVIEWokay, stephen king. time to show me what all the fuss is about.(in other words: this is my first stephen king book and i'm ready to scream in fear)"}, {"userName": "Carol", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "[pre-op procedure that was not included in the movie (hide spoiler)]"}, {"userName": "Dannii Elle", "userReviewDate": "Sep 27, 2017", "userURL": "http://www.goodreads.com/user/show/44487975-dannii-elle", "userReview": "This is King at his best. He takes a totally innocuous subject - an ardent fan, a typewriter, a bedroom door, anything at all - and infuses it with horrifying elements ordinarily reserved for more supernatural spectres. The reader is then thrust down a rabbit hole full of ill-ease, second-guessing, and the knowledge they will never be able to trust anything again when they return to the real-world, at the novel's close, breathless and with an entirely new outlook on life."}, {"userName": "Vane J.", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/19590155-vane-j", "userReview": "You know those times in which you love a book, love it so so much you also start loving the author, and then you promise yourself you’re going to read more of his/her works until you finally declare yourself to be one of their fans? I do, and I bet Annie Wilkes did too.There’s a series of books I love with all my heart and soul – you already know which it is. Well, the thing is, not long ago I reread it, and I went… a little crazy over the head. I got damn obsessed about it (I still am) and I couldn’t think about anything else. Everyone in my family knew something was wrong with me, and they thought I was insane, but boy, nothing will ever compare to how Annie Wilkes is with her favourite author.You see, she’s Paul Sheldon’s Number One Fan: She has read and loved everything he has ever written. Maybe she even fancied herself the luckiest person in the world when he had an accident – she happened to be there at the right moment and saved his life. The big problem is that Paul had just killed (in his most recent novel) the beloved character Misery aaaand Annie was not happy at all, so she forces him to write Misery’s Return at his life’s expense.Annie Wilkes managed to make me feel both scared and angry at the same time. Scared because the woman was damn crazy. She had violent fits from time to time, and you could never predict what she was going to do… out of “love” for his favourite author, but especially for her favourite character from his books. It was damn disturbing to see the things she was capable of doing.But the reasons why she made me angry were more prominent. They can be summarized in two.#1: Poor Paul.Not because of the threats or the mangling – it was because of her supposed “love.” Paul reminded me too much of Arthur Conan Doyle and his hatred towards his famous character Sherlock Holmes, so when she forced him to revive Misery, my heart went immediately to him: There’s nothing worse than feeling like the one thing you love is a chore. Besides, the damned wretch made him burn the only manuscript for a book in which he put his heart and soul! If that’s not enough to hate her, then I don’t know what is.#2: She’s just like one of those blasted self-righteous, narrow-minded GR trolls.Oh, yes, she is! Like when she told Paul how he had to write his books, how she thought he was not doing it the right way, how the book was going to be better, how she couldn’t accept some of Paul’s ideas, how she fancied hers were the only correct ones… everything leads to a troll! You know, those that usually appear in your negative reviews and tell you how wrong you are… oh, damn! I hate them and Annie!***But she’s still a great character. Just like all of Stephen King’s. Speaking of which… God, what a great writer he is! The story always flows effortlessly, with the perfect pace and even better writing. Never was I bored, and never did the narration feel tedious. It was perfect.What I’ve yet to do is watch some of the movies based on his books. I’ve read plenty of them, but never has it occurred to me watch the movies – some of them are even classics of the cinematographic world!Of course, it’s probable you have already read this book, but it will not harm if I recommend it. It’s the perfect read for creeptober. But beware of the kind of fangirl you become! Because you know…Ha! Well, if all fangirls were that way, I don’t think there would be as many writers as they are at this moment. Worry not, my friends. I’m the only one who suffers with my obsessions. The people I admire are safe and sound from my insanities.____________________________________Pre-review (October 11, 2015)Now I understand why people were so afraid of me and my obsession with The Monstrumologist series: They probably thought I was a 2.0 version of Annie Wilkes.Also, because these memes are epic:Worry not, uncle Rick, I won't do that to you!Review to come."}, {"userName": "Becky", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "This book was selected for my bookclub's January group read... Well, we were originally talking about reading Dolores Claiborne, but I suggested something with a more wintry theme, since it is winter and all. (I love reading according to the weather. It's more immersive to me to read books that take place in winter, when it IS winter, and I like that.)Anyway, so Misery. Man, it's been years since I read this book, and I forgot how much there was to it that was NOT the hobbling bit. The movie has actually caused that scene to take on something of a life of its own in pop culture terms... It's even used in a cockadoodie DirecTV commercial, for Pete's sake. That's when you know it's mainstream. But, I shall let you in on a not-so-secret secret... I had never seen the whole movie until this past Sunday. My parents bought the movie when it came out (my mom was a big King fan back in the day) and I got to the hobbling scene, and I was traumatized, and that was it for me for... 20mumblemumble years or so... Never finished it. I just don't like broken bones, probably BECAUSE of the hobbling scene... and well... it's kinda the point, right?. I know, I know... You're like \"Who likes watching a guy get his ankles shattered with a sledgehammer??\" Probably not many people, but, what I mean is... while a normal person might cringe and be upset by it for a while... for ME, it will linger on and on... haunting my edge-of-sleep moments indefinitely. I even covered eyes and ears when I watched the movie on Sunday to make it past that scene, since this time I knew it was coming, whereas my innocent child-self had no idea of the trauma she was about to witness. I find it interesting that the filmmakers found DUAL ankle shatterings to be less traumatic than the scene in the book, which only affects one foot. To me it has always been the opposite and I have no trouble reading about the amputation and cauterization, but... as we just recounted above, have serious issues with the movie's version. Though, I guess they are right. It's less permanent than the hobbling in the book, that's for sure. But... some things are just never supposed to BEND certain ways!! *shudder* Ugh... Let's move on before I never sleep again. Let's chat about Annie, because she's really why we're all here. Annie is such a fascinating character to me. I can't say that I like her character, though everyone knows that I do love me some bad characters, but I do find her fascinating. She has her own moral code, and her own way of living that doesn't quite fit into society's standards. Had Paul Sheldon not decided to drive drunk (blizzard or no), she probably would have gone on quite some time on her semi-secluded little farm, with just her animals. She was quite scrupulous in taking care of them, and her home, and so without the wrench in the plot, things would have gone on as they had presumably been going... nobody bothers her, she doesn't bother anyone else.But Paul DID drive drunk, in a blizzard, and by all accounts should have died there with two frozen leg pretzels. Thank goodness that Annie was passing by. It BOTHERS me that Paul gets a complete pass on the fact that he was drinking and driving when he crashed. Sure, he might've crashed anyway - road conditions in the mountains can get really bad, really fast... but if he hadn't been drinking too, he might have had the sense to know better than to KEEP driving in those conditions. So it bothers me that he never acknowledges this fact at all as the cause of his personal misery. Not once, not even in all of his self-awareness about his newly acquired back-monkey, Novril brand pain pills. He would much rather blame it on the weather, and the woman, than on his own bad choices. OK, sorry, derailed a bit there... coming back to Annie in 3... 2... 1: I do not think that anyone, whether they drove drunk or not, should be subjected to such a punishment as being saved and nursed by the likes of Annie Wilkes. That's a bit much... but at least Paul was rescued. So that's better than being dead, yeah? Probably, Annie really was just being a good samaritan, a Do Bee... and seeing that she had then rescued her favorite author had to seem to her like some sort of divine offering. I don't think that she had any plans for how it would go, but my guess is that she was hoping that, as happens in romance novels sometimes, the hero saves the victim from certain death, and when the victim regains consciousness and realizes what has happened, they fall in love, and there are fireworks and sunshine and fairysprinkles... So, of course she was in for a rude awakening when the first things he wanted to know was why he wasn't in a hospital and when could he go to one. I think, in Annie's mind, the hospital is now part of the vast enemy network against her, and I think she truly never would have thought about taking ANYONE to the hospital, even if it was just some Joe Schmoe. Probably, if it was a random Joe, and they were as badly injured as Paul was, she'd just have quickened their journey to the afterlife, and moved on with her chores. I loved and feared her steadfast nature. Once she decides something, right or wrong, she's going to do it. There is no stopping her, no pleading, no compromising, it's just going to be done. I wanted to know so much more about her than the little clippings that we got from her self-curated Memory Album... I want to know what happened to her in her childhood to make her the way she is. If nothing did, I find that even more terrifying. She is a terrifying woman... all the more because of how long she was able to carry on the facade of normality before anyone ever questioned her. I also found it super fascinating how paranoid she was, but at the same time completely hiding it in all the ways that mattered to Paul. Just when he thinks he's gotten away with something, she's there to show him that she sees all, and knows all, and should never, ever be underestimated. In the same vein, I asked one of my bookclub friends who is a medical professional how likely it is that Paul would have gotten as addicted to the codeine-based Novril as he did, and he said, \"Without a doubt, she hooked him on purpose, right from the start.\" Which makes perfect sense, when spelled out that way, of course. Legs can heal (if they're allowed to anyway), but an addiction... that's the gift that keeps on giving to someone who likes to control and vindictively cause suffering when displeased. One more thing about the movie, and then I will move on. Kathy Bates was perfect as Annie Wilkes, duh, of course, but I do wish that the movie had allowed for more of her quirks. The blank, \"going away\" stare, maybe her Laughing Place, her suspicions, and more specifically, her suspicions as direct cause for the punishments she gives out. I feel like, much with Kubrick's version of The Shining, they just made her crazy, and that was enough. But it's the nuance, the escalation, the little things that matter, at least to me. OK, so, Paul, aside from his less than stellar life decisions, I actually thought did the best he could with what he had to work with. Too often, in these kinds of stories, the victim refuses to \"play along\" with the perpetrator's demands - whether or not they make sense. Not Paul. He knew he was in trouble very quickly, and immediately started Survival Mode: Don't Rock The Boat. Sometimes it was not something he could help, and sometimes he took a gamble and rocked the hell out of it, but for the most part, I can't say that I'd have done a whole lot differently than he did.Finally, it's pretty easy to see this book as an allegory for King himself. At the time that King was writing this, pretty early in his career, he had already gotten pretty heavily into drinking and drugs. And, he had already formed a pretty vociferous fanbase. Though he had not, yet, created series characters that were so well loved as Misery Chastain (Roland Deschain had only just met Eddie and experienced 'astin' and 'tooterfish' a month before Misery's release), it is still a lot of pressure for a young author with numerous bestsellers under his belt already, to feel the constant droning whine of his fans wanting more... The pressure of delivering on their expectations, the pressure of not writing a flop... Well, I'm guessing. I don't know how King felt. Maybe he always had 73 ideas in his head and a golden hand to write them down with... but if it were me, I would feel it, and feel sort of trapped. Anyway, 1986-1987 was an incredibly prolific period for King. IT was released in September of 86, and then The Eyes of the Dragon in February 87, then The Drawing of the Three in May, Misery in June, and The Tommyknockers in November. I wonder how his Constant Readers would have reacted to that year. It must have been like Christmas every quarter. Maybe that year was the equivalent to him shoving burning book pages in Annie's mouth at the end, huh? You want it? Take it. TAKE IT ALL. I hope you choke. Or... maybe not. Maybe the guy just like writing stories. Could go either way. :P"}, {"userName": "Edward Lorn", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "Misery was the second Stephen King book I ever read. This was very shortly after Dolores Claiborne. I came across Misery much the same way I did Dolores Claiborne - through my mother's subscription to the Stephen King Book Club. The big difference here was, my mother knew about me reading Misery. She had already read the novel (her buddy Andrita had loaned her the book when it first came out in 1987), and figured I was of an age (fourteen) where I wouldn't be too terribly scarred by the events of the book. There's nothing sexual about Misery, and for the most part, very little foul language. The violence is rather extreme, but we all know that bad words and intercourse are much worse than chopping people up, right? Anyway, back in the days before the interwebs, the Stephen King Book Club worked like this. They would start your membership by sending you King's newest novel. After that, they'd start sending you his old books in order of publication until a new book came out, and then they would send you the new one. After that, back to the old books. By the time Dolores Claiborne came out, Mom was all the way up to Misery. (By the way, I'm chronicling this nonsense because I will probably forget all this shit in a few years. I don't plan on rereading this man's entire library again before I shuffle off this mortal coil, and I would like to have these reviews to look back upon later in life. My apologies if I'm boring you to death. Where was I...)Misery is one of my favorite King novels because it deals with writing and the writing process. And, next to The Shining, it's one of the best denouements he's ever written. I read the book long before I ever saw the movie, and, truth be told, I hated the movie for a long time. Kathy Bates's performance is exceptional, but the differences in the book and the film pissed me off. I didn't like the old sheriff character, and I missed the Lawnboy scene. Now here's where shit gets interesting. The book takes place in Sidewinder, Colorado, which is the town nearest the site of the fire-gutted Overlook Hotel. Obvious connection is obvious, right? Well what about the mention of the Beam? Anyone catch that? Here's the exact quote: \"And unless his assessment of Annie Wilkes was totally off the beam, that meant she had something even worse in store.\" Well, there you have it, sports fans. Even Misery comes back to the Dark Tower. In summation: I've come to appreciate the movie for the well-made film that it is, but the book, as per usual, is still leagues better. It's a darker, bloodier creature than its cinematic sister, and that's probably the reason I like it more. No denying it, I'm a gorehound at heart. That hobbling scene, friends and neighbors... *shivers*"}, {"userName": "Diane", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/279256-diane", "userReview": "Another Stephen King classic! A friend had warned me that the book Misery was more graphic than the movie version, and he was right. Usually I try to avoid violent books, but I'm glad I read this one because I appreciated the character of Paul Sheldon, a writer who gets held hostage by his Number One Fan, Annie Wilkes. I liked Paul's comments about the publishing business and the craft of being a writer — some of it felt like an early version of King' excellent memoir On Writing.I've only read a fraction of King's total catalog, but he has such a distinct style — mixing comedy and horror and smartassery — that several times while reading Misery I thought, \"Only King could have written that.\" The other remarkable thing about this book is the nice trick King pulls with his story-within-a-story, creating sections of a romance novel Paul was forced to write for Annie. Overall, I highly enjoyed this thriller and would recommend it.Favorite Quotes\"Writers remember everything...especially the hurts. Strip a writer to the buff, point to the scars, and he'll tell you the story of each small one. From the big ones you get novels. A little talent is a nice thing to have if you want to be a writer, but the only real requirement is the ability to remember the story of every scar. Art consists of the persistence of memory.\"\"There's a million things in this world I can't do. Couldn't hit a curve ball, even back in high school. Can't fix a leaky faucet. Can't roller skate or make an F-chord on the guitar that sounds like anything but shit. I have tried twice to be married and couldn't do it either time. But if you want me to take you away, to scare you or involve you or make you cry or grin, yeah. I can. I can bring it to you and keep bringing it until you holler uncle. I am able. I CAN.\" \"As always, the blessed relief of starting, a feeling that was like falling into a hole filled with bright light. As always, the glum knowledge that he would not write as well as he wanted to write. As always the terror of not being able to finish, of accelerating into a brick wall. As always, the marvelous joyful nervy feeling of journey begun.\""}, {"userName": "Rola", "userReviewDate": "Mar 01, 2011", "userURL": "http://www.goodreads.com/user/show/3873816-rola", "userReview": "بخصوص التقييمأعطى للرواية الأصلية لستيفن كينج خمسة نجوموللمترجم أربعة نجومولدار النشر فيما يختص بالطباعة ثلاث نجوم فقطو سوف أفرد تفصيليا أسباب تقييمى هذا إن شاء الله-----------------تحديثأما عن ستيفن كينج فحدث و لا حرجروائى بارع هو و استطاع ان يحبس أنفاسي حقا ... بل و يشعرنى بجميع آلام بول النفسية و الجسدية فى كل مرحلة عاشها خلال الرواية الرواية ممتعة إلى أقصى حدو كما قلت فى أثناء تقييمى خلال القراءة أنا أعشق الفيلم حقا و كاثى بيتس فى دور آنى كانت أكثر من رائعةمخيفة إلى أبعد حد و صادقة و ما توقعت أننى سأستمتع بالرواية كونى على علم بالأحداثو لكن العكس تماما هو ما حدثفالرواية بها أحداث مختلفة قليلا عن الفيلم مما جعلنى أتابع الصفحات بشوق لا حد لهو قد أمسك ستيفن كينج بتلابيب القصة جيدا و جعلها مشوقة بما يفوق حد أى رواية تدور أحداثها فى مكان واحد و أبطالها المتميزون و التى تدور بينهم احداث القصة هم فقط \"بول و آنى\"أى لا تعدد فى الشخصيات مما قد يبعث على الملل فى العادة و لكن ليس فى هذه الرواية.هذا عن المؤلف ؛أما عن المترجم فأعطيه أربع نجمات فقط كما ذكرت سابقا و ذلك لعدة ملاحظات، لا أدرى حقا هل هى ملاحظات قارئة عادية ام لأننى عاملة بالمهنة ؛\" الترجمة\" :بالطبع المترجم هنا قدير للغاية و بالطبع بفوقنى خبرة و لكن،،،أول ملاحظاتى كان اسم الرواية :الإسم الأصلى للرواية هو \" ميزرى\" و هو ما ترجمه المترجم \" بؤس\"بالطبع لا جدال عن معنى الكلمةو لكن فى ظنى فكينج أراد إسقاطا بإسم الرواية على بؤس البطل بول و البطلة آنى بالإضافة إلى بطلة روايات بول شيلدون البائسة أغلب الأوقات والتى تسمى \" ميزرى تشاستين\"و ربما كان من الأفضل لو أطلق على الرواية \" ميزرى\"ثم أفرد هامشا فى صفحات الرواية الأولى عن إسقاط الكاتبفلو لا يعلم القارئ الكثير عن الرواية الأصلية لاحتار لماذا اختار المؤلف اسم \" بؤس\" للروايةالملاحظة الثانية فى احد فصول الكتاباستشهد الؤلف ببضع سطور من رواية جون فاولز \"the collector\"و هى المعروفة عربيا باسم\"جامع الفراشات\"و تمت ترجمتها بالفعل عربيا تحت هذا المسمى و اشتهرت بهأما المترجم فترجم كلمة \" the collector\"\"هاوى للجمع\" فكان يجب على المترجم تحرى الإسم العربى الشائع لدى القراء العرب المستهدفين لقراءة ترجمته للرواية حتى لا يختلط عليهم الأمر.و أخيرا و ليس آخرا،عن طباعة الكتاب ،فقد اختارت المطبعة خطوط متعبة جدا للعين فى بعض فصول رواية ميزرى و التى تأتى كرواية داخل رواية، حيث أن البطل مؤلف بطبيعة الحال.الخط كان متعبا جدا للعين و دعانى إلى تفويت السطور و عدم متابعة فصول ميزرى هذه كما ينبغى.هذا هو رأيى كاملا و أظنه أكثر مما يلزم:)"}, {"userName": "Leo .", "userReviewDate": "Oct 12, 2017", "userURL": "http://www.goodreads.com/user/show/71478086-leo", "userReview": "Wow! Imagine having a nasty car accident and being rescued by your number one FAAAN!A fan who happens to be a complete lunatic. This book is gripping. An accomplished author killing off his main character because he is stuck in a rut. Held prisoner by his number one fan. Many times he tries to escape and gets mutilated and hobbled. Coerced into writing his novel and not to dare finish the character off. Drugged and tied to a bed. What a book. Also a film starring Kathy Bates and James Caan. Good film but not as good as the book. I did not give it five stars because King has written better ones but, most of his work is 4+ stars🐯👍"}, {"userName": "Srividya", "userReviewDate": "Feb 17, 2016", "userURL": "http://www.goodreads.com/user/show/27599745-srividya", "userReview": "I am always on the lookout for books from different genres, written by different authors and usually manage to find some good ones from everyone’s shelf. With King, I simply loved the first two books, namely, The Shining and The Green Mile. However, this one was a drastically different experience. To say that I didn’t like it would be obvious but what’s more important is that I was alternately irritated and bored while reading the book. It had everything in terms of the premise to make it a wonderfully taut and thrilling book but sadly it lost both in the execution. In short a great premise done to death by writing that resembled a movie script and a bad one at that. I know that I am disappointing a lot of King fans as well as fans of this book by saying this but truly King’s mastery of words and narration doesn’t really shine through in this, which really makes me sad.Let’s start with the premise – Annie Wilkes is Paul Sheldon’s self acclaimed number one fan. Annie Wilkes is a wild psychotic for whom reality exists only as long as it is vis-à-vis her own self. Paul Sheldon is an acclaimed writer who has written a series, which is quite popular with people, including Annie, who loves that series. Paul meets with an accident and Annie takes care of him or so it seems. What follows is a series of horrifying gory stuff that only thriller/horror movies are made of. The premise is really interesting – a former nurse and number one fan keeping her beloved author restrained within her home and making him write a book for her. One can almost imagine the atrocities that a psychotic person would impose on the other and yet there is that tangible tension of trying to come to terms with how far Annie would go and what would Paul’s reactions be. Insofar as this is concerned, I think the book really managed it beautifully, both in keeping it thrilling and suspense worthy, especially in the initial part. However, somewhere in the middle the story slackens and becomes monotonous and pretty predictable to the point of being ridiculous even. You don’t need to read a lot of books or even watch a lot of movies to guess what would happen in such a situation and how the author or the director would take it forward. This was the book’s first negative point.The characters form the second reason for my negative review – Annie, when she was introduced was someone I thought would be a formidable antagonist. She had the guile of an innocent babe and the terror of a dangerous villain, but like the plot she went from being dangerous to plain ridiculous. Annie’s character was pretty much one dimensional or in some cases there is an added other dimension but she doesn’t feel real. Her actions are predictable (that word again!) and quite gory but it doesn’t have the underlying sense of menace that a good antagonist should have. Her state of mind as well as her actions are too obvious. While the author has made her a little crafty, he makes it so obvious that as a reader you already know what is going on in her mind. What bugged me most was the fact that the author didn’t give Annie any depth. There was no back story other than a few lines, no explanation as to why she was doing or did what she did and finally there was no craftiness or slyness in her scenes, all of which made for a dull read for me.Similarly, Paul was again shown in a unidimensional manner, with his writing and his pain being the only emotions that we see from him. His character, however, despite being unidimensional displays quite a lot of emotions, ranging from anger, rage, depression, disappointment, hatred, excitement, exhilaration, courage and also submission. This should ideally make him a well-rounded character and the truth is that I preferred Paul to Annie in terms of characterization but the drawback in this was that Paul was again too obvious. There was no mystery or thrill that such characters usually have. It is an endless pattern of hurt and remorse, which culminates into a grand finale of sorts that was so obvious that one knew about it even before reading it. The writing, at least according to me, was not really that good either. If this had been the first book that I was reading in the thriller genre or if it was my first book ever, I would have enjoyed it. However, it isn’t that way and sadly for me the writing was too jerky in places and lacked tension in the latter half. Having read two other books by King and having loved both, especially for writing, I felt that this was a let down, a major one at that. The writing was perfect for a movie script and I personally feel that the movie would be much better than the book, a rare case at that, nevertheless it had enough tension and suspense to make a great movie. However, when it comes to reading a book, it felt completely off, to the point of being ridiculous instead of gory and horrifying. I know a lot of King fans and fans of this book will be disappointed by this review but I have to be honest to myself and the honest fact is that I found this book to be okay. Somewhere in the middle, I had toyed with the idea of giving it a 3 star rating but that was again shot down by later events. So this will remain a 2 star book for me. However, I urge readers not to go by my rating and to experience it yourself. It could just be the case of me and not the book!"}, {"userName": "Paul", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/36511432-paul", "userReview": "Crazy good. Thriller with psychotic sprinkles."}, {"userName": "Melissa Chung", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/17703155-melissa-chung", "userReview": "This book took me a full month to read. It's not very long, however the story within is so horrifying I could only read the words in bites. A nibble here, a nibble there. Not only is this book a 5 star read, it has so much about writing in it, you could actually learn a thing or two about the hardships of writing and what to do when you are stuck. I absolutely loved this story. Not only for the terror it brought, but the educational factor. I mean, Paul Sheldon wants to be a great writer. He hates writing Misery, his romance series because it's fluff and not GREAT stuff. He wants people to feel something while reading his books or so he thinks.Anne Wilkes is by far the scariest villain King has ever written. At least as far as I have read from his many works. I thought The Shining was the scariest book to date. Jack Torrence is a scary guy, a crazy man with an axe. When you read 'The Shining', you know that Jack is being possessed by the hotel, to be that way. He loves his family. Doesn't want to hurt them. The voices of the hotel make him do bad things. They tell him to kill. Anne Wilkes, well, she was rotten from the get go. She doesn't need The Overlook to make her do the bad things. All the dirty birds to that for her. Those brats! Those cockadoodie's make her kill because they are in existence and they are all out to get her. Misery takes place in Colorado a little north of Sidewinder. I love that King's books traverse the same universe. I love that his characters are connected my threads as thin as hairs. Sidewinder is the town you by pass on your way to the Overlook Hotel. Anne Wilkes mentions how the hotel burned down about six years ago and how the caretaker went mad. Those subtle references to the books already written by King is always so fun to read about. Paul Sheldon also talks about the Constant Reader, his many fans. How they know when he is being truthful or not in his writing. They are so perceptive to slight differences in his story, that they call him out on it. Stephen King also talks about his Constant Readers. He calls us the readers of his books, Constant Readers, because we are willing to wait and devour anything he puts out. This is a bit off topic, but I'm also currently reading Song of Susanna, book 6 in the Dark Tower series and in the back of the book he has diary entries. These talk about his Constant Readers and how he would get hate mail because he wasn't producing The Dark Tower books quick enough. How they didn't like a certain ending. I find this fascinating. Paul Sheldon is of course a part of King. We are seeing the real struggles. Paul is alive in this story because the author is able to put real feelings that he has experienced into him. The writing process is incredible. I am in awe.So what is this famous story about? I have not yet seen the movie, but I'm going to go out on a limb and say it's slightly different at least the most famous scene is different from the movie. The breaking of the ankles with the sledge hammer and the piece of wood. That doesn't happen in the book. It's slightly different, more horrifying. I was anxious to read that part and continued to be fearful until I passed that scene. Again, what is the story about you ask? Well it's about an author named Paul Sheldon who one night in a snowstorm gets in a car accident. The one to save his life is his number one fan, Annie Wilkes, and boy is she a dirty bird. She of course keeps him as a human pet and what she wants more than anything is for Paul to resurrect her beloved Misery from death. Paul did away with his romance series titled Misery. He wants nothing more to do with it. However, Annie has other ideas and in order to keep the goddess at bay he writes her book. It's the best damn book he has ever written. What we want to know is...what will become of Paul Sheldon.Great, great read."}, {"userName": "Brandon", "userReviewDate": "Oct 08, 2014", "userURL": "http://www.goodreads.com/user/show/3214163-brandon", "userReview": "Acclaimed novelist Paul Sheldon, badly injured in a car accident, is held captive by deranged super-fan Annie Wilkes. A former RN, she vows to aid him back to health until he’s well enough to make the trek to a hospital. However, it’s on one condition; he write a new novel featuring his signature character Misery Chastain - just for her.Outside of the legendary Randall Flagg, Annie Wilkes has to be the most terrifying villain King created. Mentally unbalanced and completely unpredictable, she’s everything you want in a horror novel “bad guy”. Driven by an insane goal, to see Misery Chastain resurrected from the dead and once again placed into the literary world, Annie will do anything to make sure Paul Sheldon “makes it right” with a novel written just for her. If Paul decides to make this process difficult, well, she has ways of making him write.Having not seen the classic 1990 Rob Reiner film, I went into Misery blind. I knew next to nothing about the story other than Kathy Bates taking the Oscar for best actress and that very famous “wooden block scene”. If you think that was hard to watch, try giving the book a read - things get graphic and Annie’s punishments are downright brutal.Seeing as Misery - for the most part - is a two person show, King writes both characters with a tremendous sense of depth. These are two characters who are far from cookie cut-outs of the “heroic” protagonist and the “crazy” antagonist. King kept me guessing right up to the very end, wondering what would happen - would Paul kill himself? Would Annie kill him and then herself out of desperation? Would Paul kill his captor and escape? I honestly didn't know - which was fantastic.After a particularly brutal finale, in which King blew my mind with the sheer ugliness of it all, he’s still intent on scaring the crap out the reader. Lesson learned - King isn't truly finished until the book is closed. Misery is loaded with suspense and despite the story taking place over a period of several months, a sense of absolute urgency is constantly at the forefront. King should teach classes on pacing alone.Also posted @ Every Read Thing."}, {"userName": "Mary JL", "userReviewDate": "Apr 15, 2009", "userURL": "http://www.goodreads.com/user/show/1734736-mary-jl", "userReview": "You may have seen the movie or you at least know the story. So, you think, why read it? Well, first the book differs somewhat from the move and goes into more depth. Since there are only really two major characers, Anne Wilkes and Paul Sheldon, her captive writer, King can delve into their characters at length--and he does.I personally feel this is one of Stepehn King's strongest books. I particulary find it horrifying because it is a bit more possible that some of his books. I don't really believee in vampires or haunted cars--but I do believe in pyschotic, dangerous people like Anne Wilkes--the newspapers are full of such unbalanced persons."}, {"userName": "Hayley Stenger", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/63277467-hayley-stenger", "userReview": "AAAAAAAAAAHHHHHHHHH! I had forgotten how terrifying Stephen King was earlier in his career. Yes, I was scared. Yes, this was a bad book to read for a rainy, sick day.No, I do not regret reading it."}], "description": "Paul Sheldon, un celebre scrittore, viene sequestrato in una casa isolata del Colorado da una sua fanatica ammiratrice. Affetta da gravi turbe psichiche, la donna non gli perdona di aver \"eliminato\" Misery, il suo personaggio preferito, e gli impone tra terribili sevizie di \"resuscitarla\" in un nuovo romanzo. Paul non ha scelta, pur rendendosi conto che in certi casi la salvezza può essere peggio della morte...", "title": "Misery", "url": "http://www.goodreads.com/book/show/24757297-misery", "average": 4.13, "cover": "https://images.gr-assets.com/books/1422602612l/24757297.jpg", "reviews": 7514, "authors": [{"url": "https://www.goodreads.com/author/show/3389.Stephen_King", "name": "Stephen King"}, {"url": "https://www.goodreads.com/author/show/4415389.Tullio_Dobner", "name": "Tullio Dobner"}], "type": ["Horror", "Fiction", "Thriller", "Suspense"], "outlinks": ["http://www.goodreads.com/book/show/24757297-misery", "http://www.goodreads.com/book/show/10614.Misery", "http://www.goodreads.com/book/show/534679.Misery", "http://www.goodreads.com/book/show/1479366.Misery", "http://www.goodreads.com/book/show/27877139-misery", "http://www.goodreads.com/book/show/233681.Misery", "http://www.goodreads.com/book/show/3232394-misery", "http://www.goodreads.com/book/show/21806284-misery", "http://www.goodreads.com/book/show/9492488-misery", "http://www.goodreads.com/book/show/8130685-misery", "http://www.goodreads.com/book/show/7018504-misery", "http://www.goodreads.com/book/show/843489.Misery", "http://www.goodreads.com/book/show/10633736", "http://www.goodreads.com/book/show/20619710-misery", "http://www.goodreads.com/book/show/11588.The_Shining", "http://www.goodreads.com/book/show/149267.The_Stand", "http://www.goodreads.com/book/show/43615.The_Gunslinger", "http://www.goodreads.com/book/show/10592.Carrie", "http://www.goodreads.com/book/show/10644930-11-22-63", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}