{"ratings": 163, "userreviews": [{"userName": "Diane S ☔", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "From Tom Franklin's potent introduction , stating the grim statistics that haunt Mississippi's denizens, and of course the title itself, the reader is made fully aware that these stories will be about the downtrodden. Those who live in trailers, drugs, drinking, often their own worse enemies, hooking up with the wrong people, casual sex etc. Franklin also mentions the many fantastic authors who have come from this state, those in the past. and those in the present, maybe because of the many colorful characters they have to draw from.So some of these stories are from familiar names, Ace Atkins and I loved his story, Combustible, William Boyle, Megan Abbott, Michael Kardos and relative newcomer, Michael Farris Smith, whose story Magnolia was one of my favorites. Another one that sent chills down my spine and make me think twice about where I stop for gas or a restroom is the story, Pit Stop by John M Floyd. Though in this one the heroine manages to have a relatively normal life with a nice twist thrown in. Some of these stories will just be going along but end with an unexpected bang. Where did that come from? So I enjoyed these, a few more than others but actually an amazing grouping of stories from many great or soon to be great southern authors.ARC from Librarything."}, {"userName": "Lauren", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/7852584-lauren", "userReview": "What you need to know about this is that it's a collection of Southern noir edited by Tom Franklin, and also Megan Abbott and Ace Atkins have stories in it, as do a lot of other great writers who fall later in the alphabet. Akashic won't rest until every corner of the country has an anthology exploring its more desperate residents, and its Mississippi installment is particularly great. (Side-note: hey, Akashic, Kentucky has meth and horse racing, great ingredients for both modern and classic noir. Just saying.)Mississippi Noir sports a nice combination of plot-driven stories and mood pieces. I'll go on record as saying that Southern regional writing is some of the most gorgeous writing there is, so the moodier and more ambiguous stories here proved to be my favorites. Megan Abbott's \"Oxford Girl\" is a lush ballad retelling that takes what could be cheap and predictable news fodder--a romance between a frat boy and a sorority girl that ends in murder--and invests it with depth and a kind of heightened sensuality and mysticism; Lee Durkee's \"My Dear, My One True Love\" does the same thing with a man who seems to always date \"crazy women.\" There are sparer stories here that really work for me, too, like Ace Atkins's modern YA rural noir \"Combustible,\" which also takes on a familiar story, but which achieves its resonance by piling on specificity. It has maybe the best sense of place in the whole collection. I also really loved Mary Miller's ambiguous, unstable \"Uphill,\" which opens a brief window up into one couple's complicity in a crime that they don't have to see through to the end, and Michael Kardos's \"Digits,\" a horror story about a creative writing class where the students grow in skill and profundity as they start lopping off their fingers.There are stories here that don't quite work for me, as can be expected in any anthology, but the overall quality is very high. In some cases, the setting seems incidental, but it's remarkable how reading a location-themed anthology cues you in to the smaller ways place shapes characters and stories, from the way the backgrounds of the students in \"Digits\" to the lack of economic opportunity in \"Uphill\" to the flooding in \"God's Gonna Trouble the Water.\" You wouldn't think a noir collection would work as tourist advertising, but I found myself drawn to Mississippi after reading this: Franklin's selections sell it as a place where profundity grows like a weed and storytelling comes naturally."}, {"userName": "Faith", "userReviewDate": "Nov 23, 2016", "userURL": "http://www.goodreads.com/user/show/17430801-faith", "userReview": "I had noticed the \"noir\" collections of short stories from this publisher for awhile and decided to try one. It was the name of Tom Franklin that drew me to this collection, unfortunately I wasn't paying enough attention to notice that he didn't write any of the stories, just the introduction.The collection is very uneven. Some of the stories were good, although none rose to the level of great. Many more were so slight that I wondered why they were published. The stories were a melange of tough kids, bad step fathers, sudden violence, murders and drug dealers. Also, it appears that pinky removal is a \"thing\" in Mississippi. I did enjoy \"Most Things Haven't Worked Out\" by William Boyle in which a 15 year old boy is befriended by a new woman in town. The boy \"got broken by being so close to kindness.\" I thought that \"Digits\" by Michael Kardos was interesting and creepy, but I didn't understand it. A dissertation on crazy women \"My Dear, My One True Love\" by Lee Durkee was different and entertaining. Unfortunately, none of the stories will stick with me.I received a free copy of the e-book from the publisher, however I wound up listening to the audiobook borrowed from the library."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I get the point of these stories, and feel like they just aren't for me. I'm sensing that I can also abandon the copies I own of Boston Noir and Haiti Noir if it's more of the same. It sounds crazy but the violence got repetitive, to the extent where it felt like the point of each new story. And that in itself grew boring. I guess I like my violence to be part of a richer landscape."}, {"userName": "Viv JM", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/4243437-viv-jm", "userReview": "It's difficult to rate an anthology because obviously some stories appeal more than others. However, I did find the overall quality of the stories in this collection to be very good, and I would definitely try more in the \"Noir\" series."}, {"userName": "Chris", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/5772062-chris", "userReview": "An interesting collection of stories with something for everyone who enjoys rural noir. My favorites were \"Jerry Lewis\" by Jack Pendarvis and \"Cheap Suitcase and a New Town\" by Chris Orfutt, but there are others that could leap out at me on a different day in a different mood. \"Digits\" by Michael Kardos is kind of stuck in my head, for better or worse."}, {"userName": "Nicola Mansfield", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/1682713-nicola-mansfield", "userReview": "3.5/5A mixed-bag of contemporary stories taking place in Mississippi. Averaging out to a solid 3.5 stars.1. Combustible by Ace Atkins - An abused girl gets back at her stepfather. Short good read with a dangling ending. (4/5)2. Lord of Madison County by Jimmy Cajoleas - Wow! I don't even know how to start. This is about rich, white kids. The main character hooks up as a drug dealer out of boredom, fakes getting Jesus, bags the pastor's daughter and ends up in very serious trouble with his supplier. A hardcore story but in the end it's about the pastor who really does practice what he preaches. (5/5)3. Losing Her Religion by Rachell R. Smith-Spears - Heavy duty story of a woman who gives up everything for the married man who has just broken up with her. Powerful writing. (5/5)4. Most Things Haven't Worked Out by William Boyle - Fantastic! A rip-roaring exciting read. A crime you could say, but it's about two people who were abused as kids and how they were ruined, one by hate and one by kindness. A very poignant ending. Complex, interesting characters. (5/5)5. Uphill by Mary Miller - Nothing really happens in this story. A woman with a penchant for loser boyfriends tells about her current situation and ruminates on her past and future. Pretty boring. (2/5)6. Boy and Girl Games Like Coupling by Jamie Paige - Very short. Narrated by the boy, it's about the moment a girl learns she's dating a psychopath. (3/5)7. Oxford Girl by Megan Abbott - Brilliant. I loved this story! The narrative switches back and forth between a college couple starting with the girl finding out she's pregnant. Then they each tell the story of their relationship from the beginning to the dark, dark end. (5/5)8. Digits by Michael Kardos - This is really creepy and I loved it until the end. A college English professor notices that students in the class are missing fingers. It's a great creepy story but ends suddenly and I didn't get it. I still don't get it. I would have given it a five but my rating is reduced because don't like stories to leave me bewildered. (3/5)9. Moonface by Andrew Paul - A man recounts an event from his youth when he caused someone's death. OK. (3/5)10. God's Gonna Trouble the Water by Dominiqua Dickey - This is a sad story but has a redemptive ending. A white boy and black girl have a four-year-old daughter. The boy wants nothing but them to be a family, while the girl knows they can ever have a normal life together because of their colour. The boy steals his little girl every now and then to get her mother to come to him. This time, he takes her on the night of a big storm and it's the last time he does. Very good. I love the narrative voice. (5/5)11. My Dear, My One True Love by Lee Durkee - This is very short, a few pages. So briefly, a man narrates his attraction to crazy women. The ending was as I expected. Not bad. (3/5)12. Hero by Michael Farris Smith - Just ok, not much really happens. About a boy who doesn't talk and his abusive father narrated by the next door neighbour who takes day labour jobs and has a large psychic-for-hire wife. (2/5)13. Pit Stop by John M. Floyd - On a road trip, a mother tells her daughter about the time she was attacked by a serial killer. A really good story that had me riveted. Only problem is that the ending was disappointing. (3/5)14. Anglers of the Keep by Roger Busby - A melancholy tale of a dying man whose daughter has arranged a lung transplant for him. The man tells his secrets to his ex-son-in-law on the journey to the clinic. (4/5)15. Jerry Lewis by Jack Pendarvis - A guy has a mysterious encounter with a dangerous woman. Short and kind of dumb. (2/5)16. Cheap Suitcase and a New Town by Chris Offutt - A lonely woman waitressing in a town she recently moved to gives a much younger waitress some advice and then moves on. I don't get the point of this. Boring. (1/5)"}, {"userName": "Sam Sattler", "userReviewDate": "Jul 30, 2016", "userURL": "http://www.goodreads.com/user/show/8300581-sam-sattler", "userReview": "Mississippi Noir is the latest collection of dark crime stories in the long running series of similar titles from Akashic Books, and it's another good one. The first hint of what to expect from the book's sixteen stories comes in the blunt opening paragraph of Tom Franklin's two-page introduction:\t\"Welcome to Mississippi, where a recent poll shows we have the most corrupt government in the United States. Where we are first in infant mortality, childhood obesity, childhood diabetes, teenage pregnancy, adult obesity, adult diabetes. We also have the highest poverty rate in the country.\tAnd, curiously, the highest concentration of kick-ass writers in the country, too,\"And judging strictly from the number of writers who make their homes in Oxford, the claim about \"kick-ass writers\" might very well be true. (But sadly, so are the other ones.) This Mississippi-based story collection features the work of a few familiar names, such as Ace Atkins, writers newly-come to the genre, and even a couple of writers being published for the first time. As is always the case with the Akashic books in the series, the sixteen stories are divided into four thematic sections with tiles that give a clue to the type of story housed there: \"Conquest & Revenge,\" \"Wayward Youth,\" Bloodlines,\" and \"Skipping Town.\"As it turns out, my three favorite stories come from three different sections of the book: \"Lord of Madison County,\" by the first-time-published Jimmy Cajoleas, \"Oxford Girl\" by the already well-known Megan Abbott, and \"Pit Stop\", by veteran writer John M. Floyd.\"Lord of Madison County\" tells of a seasoned teenaged drug dealer who has stumbled upon the best way imaginable to hide the truth about himself - he pretends to be a Jesus freak interested only in spreading the word of God among his peers. When, predictably, the young man learns that, not only is he nearly as smart as he thinks he is, but that bigger, badder criminals are all around him, things do not go particularly well for him and his preacher's-daughter girlfriend.\"Oxford Girl\" takes the rather unusual approach of adopting its plot from an English ballad dating back to the 1820s. The old ballad tells the story of a young woman who is brutally murdered by the man she believes she is going to marry. The short story cleverly cites verses from one version of the old song as the story about two University of Mississippi students unfolds along eerily similar lines. There is one key difference, however, that makes the story especially effective - unlike the song, which is narrated by the killer, the story's narrator is the murdered girl.And then there's \"Pit Stop,\" a story that likely would have warmed the heart of Alfred Hitchcock. In this one, a young woman is telling her little girl a story from her past, the one in which she encountered the infamous \"Night Stalker\" who killed several women along Mississippi's Highway 25. An abundance of false leads and misdirection - along with plenty of clues that point to the Stalker's true identity - make this one a fun and satisfying read.Bottom Line: Mississippi Noir meets the high standard set by it predecessors in this Akashic Books series."}, {"userName": "Sheryl", "userReviewDate": "Jun 15, 2016", "userURL": "http://www.goodreads.com/user/show/1771463-sheryl", "userReview": "I adore southern fiction and “Mississippi Noir” did not let me down that is for sure. Mr. Franklin did a wonderful job of putting these stories together. He had established authors as Ace Atkins as well as lesser-known authors who did an excellent job. I look forward to reading more of their work in the future. I’m a huge fan of “ Noir” books and this publisher has released several to choose from.I would like to thank Akashic Books and Edelweiss for providing me with an e-galley of this book for my honest review."}, {"userName": "Carla", "userReviewDate": "Aug 20, 2016", "userURL": "http://www.goodreads.com/user/show/7965254-carla", "userReview": "I'm a HUGE fan of short story collections and this didn't disappoint. There are some well respected authors stories, and some I've never heard of. All stories however are of the \"southern\" variety. If the intro by Tom Franklin doesn't grab you, nothing will. I've never heard until now of the \"Noir Series\" by Akashic, an independent publisher. I am making it my mission to read ALL of in the series!"}, {"userName": "Patricia", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/2048748-patricia", "userReview": "Recommended by Amazon, has \"noir\" in the title, how can I go wrong? As it turns out, this is a collection of spine-chilling stories set in Mississippi, suspense of the most suspenseful kind, nothing paranormal, all real life kinds of noir. Nor was it what I expected of Mississippi; these dark stories are very up to date and many focus on adolescence and young adulthood. The problems are very current; the resolutions often jarring."}, {"userName": "Melody", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/9373633-melody", "userReview": "Not for me. Did not finish."}, {"userName": "Doug", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/5415079-doug", "userReview": "Short stories. These stories were a great companion on a trip through Mississippi. Places like Parchman Prison and Jackson come alive, and kids of people get whacked. Good times"}, {"userName": "Joy", "userReviewDate": "Jun 12, 2017", "userURL": "http://www.goodreads.com/user/show/7279983-joy", "userReview": "Very uneven collection. A couple stories were great, most were of middling quality, a couple were simply awful.\"Anglers of the Keep\" was a fantastic story, but was more in keeping with the southern gothic tradition than noir. It was sad and melancholic, but hit all the right notes. It reminded me a of a Bobbi Ann Mason story.For a middling to good story, \"Moonface\" hit the right notes as a noir confessional.On the lower scale of okay, there's \"God’s Gonna Trouble the Water\". It had a good Romeo/Juliet plot with the right characters and a great setting. But it was far too cliched - the writing was mediocre with unrelated details and plodding dialog.On the awful end of the scale was \"Oxford Girl\". This was, by far, the worst story in the book. Strangled and overwrought. Told in archaic, ridiculous language that pulled me straight out of the story and left me rolling my eyes. Nobody talks like that. Nobody. Damn, that story was awful. That one is going to stay with me for a long, long time as a horribly written story."}, {"userName": "Joe", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/28212036-joe", "userReview": "Unusually for this series, a lot of the best stories in this collection did not give me a particularly strong sense of place. But there's a lot of captivating and insightful writing within, touching on how people get through the day living unhappy lives through no fault of their own and no hope of anything changing; on our powerful and poisonous desire to be the main character of every story around us; on guilt and mortality; and on the sacrifices required by the creative process. (There's also two damn good, if not especially original, simple crime tales.)Wouldn't be the first Akashic Noir book I'd hand someone, but if you liked some of the others you're going to like this."}, {"userName": "KayG", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/2329201-kayg", "userReview": "My reaction to these was spotty, as can be expected with short stories by different authors. Overall though, it was a good read. However, be forewarned that these are dark, creepy, icky, gross, vulgar ..... as expected with noir, but these are more so than usual. These aren’t for everyone, and weren’t in particular for me. But if you run across the book, pick it up a few moments and read the brief foreword by Tom Franklin. It is wonderful!I listened to this audiobook on Hoopla. It used many different narrators, but overall, it was excellent. But please, please, narrators: learn to pronounce Biloxi as the natives do! It’s bill-uhx-ee."}, {"userName": "Woody Chandler", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/1026784-woody-chandler", "userReview": "Another quick read, reinforcing my thinking that there was something about Beirut Noir that just did not engage me. I spent some time in Meridian, MS as well as a visit to Lazy Magnolia Brewing so I had an idea of the living circumstances in that part of our country. As other reviewers have said, not all of the stories were of equal quality, but when taken as a whole, it was a worthwhile read. Back to the library tomorrow to see what has come in."}, {"userName": "Beverly", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/38224907-beverly", "userReview": "My first read in the Noir series which I never knew existed, so... that's exciting. I am a fan of Chris Offutt's writing since Kentucky Straight so when I saw he contributed I had to read him. Also I love short stories and most in Mississippi Noir were entertaining... and a couple were downright frightening. Powerful and solid efforts by a variety of writers. Great quick read, a guilty pleasure."}, {"userName": "Sandra", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/8882805-sandra", "userReview": "In truth this was more of a 2.5 for me, I doubt more than five of the sixteen stories really resonated, a frequent and probably unavoidable occurrence with anthologies. but it will bear re-reading and possibly familiarity will breed further enjoyment."}, {"userName": "Robert Barnes", "userReviewDate": "May 25, 2017", "userURL": "http://www.goodreads.com/user/show/51870793-robert-barnes", "userReview": "This is a nice collection of short stories."}, {"userName": "Amy", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/16946077-amy", "userReview": "The stories varied widely in quality and style, but overall, I enjoyed this slice of life in Mississippi. Lots of down-home darkness, but what would you expect from a book called Mississippi Noir?"}, {"userName": "Andy", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/1075683-andy", "userReview": "3.5 stars - As with most short story anthologies, some tales are better than others. I can highly recommend those by Ace Atkins, Jimmy Cajoleas, Megan Abbott, Michael Kardos and Robert Busby."}, {"userName": "Catherine Mincy", "userReviewDate": "Jan 07, 2018", "userURL": "http://www.goodreads.com/user/show/7116896-catherine-mincy", "userReview": "Excellent, balanced collection. Several old favorites here, along with some new authors i will be reading more of soon."}, {"userName": "Teresa Smith", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/14060736-teresa-smith", "userReview": "Few good stories, but over all a very \"dark\" and strange book. Would not recommend."}, {"userName": "Ella", "userReviewDate": "Jan 03, 2017", "userURL": "http://www.goodreads.com/user/show/1024284-ella", "userReview": "Some hits, some misses. Almost all depressing and bleak."}, {"userName": "Tonstant Weader", "userReviewDate": "Aug 11, 2016", "userURL": "http://www.goodreads.com/user/show/2050909-tonstant-weader", "userReview": "I am a long-time fan of the Noir series from Akashic Books and just finished their most recent release Mississippi Noir that came out earlier this month. Mississippi as a state is a fount of great literature, including some of my favorites like Eudora Welty and William Faulkner. It is also a state rich in the mystery genre with settings perfect for suspense. It’s not wonder, then, that this anthology is a standout in an excellent series.Tom Franklin organized the stories in four sections, the first has stories of conquest and revenge. The second features wayward youth, the third is called Bloodlines with some of the most painful stories and the last section is called Skipping Town. The stories are often grim, tragic and heartbreaking, but not always. The last story, “Cheap Suitcase and a New Town” is even kind of hopeful…kind of.Mississippi is a powerful presence in most of the stories, not just the landscape, but the grinding poverty and the pernicious racism are a backdrop to many of the stories.I disliked one story, “Oxford Girl” by Megan Abbott. I would like to forget that story. It was, however, well-written. Like all the other stories, it was emotional powerful and wrenching. I disliked it on a deep level, in part because it reflects a truth about misogyny, about men who kill women simply because they feel that’s their right as men. I can’t deny the art, what I really hate is the reality it represents.I loved “God’s Gonna Trouble the Waters” by Dominqua Dickey. It was fascinating, a story of multi-generational secrets and the power they have, but also a story of love and redemption. William Boyle’s “Most Things Haven’t Worked Out” broke my heart. “I got broken by being so close to kindness.” Is there a sadder sentence?I loved Mississippi Noir and recommend it highly. It gives us entrée to the variety and vitality of Mississippi, not just from the dirt roads of entrenched poverty but also the wide streets of suburbia and middle class ennui. If there is a common element, it’s a directness, the simplicity of telling a story that we need to hear.I received an e-galley of Mississippi Noir from the publisher via Edelweiss. Check out the Akashic Noir series at Akashic Books.https://tonstantweaderreviews.wordpre..."}, {"userName": "Michael", "userReviewDate": "Jun 27, 2016", "userURL": "http://www.goodreads.com/user/show/1301028-michael", "userReview": "My review appeared on July 27, 2016 edition of Library Journal:As editor Franklin (Crooked Letter, Crooked Letter) observes in his introduction, Mississippi is the perfect setting for the latest volume in Akashic's long-running noir series. The pronounced social conditions that make the Magnolia State ripe for noirish exploration—political corruption, infant mortality, the highest poverty rate in the nation—recall a saying from Franklin's Alabama upbringing: \"Thank God for Mississippi; otherwise we'd be at the bottom of everything.\" Divided thematically into four sections, these 16 stories share some common denominators: doomed love (\"There was a girl in all of this,\" says the narrator in Andrew Paul's \"Moonface\"), often fatal decision-making, and revenge. As always, established authors (Megan Abbott, Ace Atkins) share space with promising newcomers (Jimmy Cajoleas, Dominiqua Dickey), but the collection struggles to break out of its tonal rut. The most memorable pieces take the definition of noir beyond the expected: William Boyle's \"Most Things Haven't Worked Out\" is reminiscent of the gothic fatalism in Flannery O'Connor's stories, while Michael Kardos's \"Digits,\" about a writing teacher whose students come to class with fewer and fewer fingers, veers into Shirley Jackson territory. VERDICT Despite some standouts, this is not one of Akashic's stronger efforts. Purchase only where this series is popular or of regional interest.Copyright ©2016 Library Journals LLC, a wholly owned subsidiary of Media Source, Inc. Reprinted with permission."}, {"userName": "Virginia Campbell", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/2333268-virginia-campbell", "userReview": "\"Mississippi Noir\" starts off with a bang with a short story from one of my favorite authors, Ace Atkins. His \"Combustible\", kicks off part one--\"Conquest & Revenge\"--of this anthology of Southern Crime Noir from sixteen top suspense writers. The other three sections are \"Wayward Youth\", \"Bloodlines\", and \"Skipping Town\". Completing the roster of terrific talent are: William Boyle, Megan Abbott, Jack Pendarvis, Dominiqua Dickey, Michael Kardos, Jamie Paige, Jimmy Cajoleas, Chris Offutt, Michael Farris Smith, Andrew Paul, Lee Durkee, Robert Busby, John M. Floyd, RaShell R. Smith-Spears, and Mary Miller. The stories may be short, but they deeper they go, the darker they get. The darker the story, the more addictive the writing becomes. These awesome authors have the \"Southern twang thang' down just right, and that adds an irresistible touch of flavor of these torchy tales. I highly recommend these \"Noir\" collections from Akashic Books. Once your check out their list of titles, you won't be able to stop with just one. Review Copy Gratis Library Thing"}, {"userName": "Sugy", "userReviewDate": "May 21, 2016", "userURL": "http://www.goodreads.com/user/show/5695416-sugy", "userReview": "I got this book as a giveaway from Akashic Books (thanks ya'll!)I hadn't read any of the other books in their noir series but was attracted to this one because it was written by writers affiliated with my home state and about places in said state. I wasn't sure what to expect but this book started off with a bang and did not let up! It was a great mix of short stories - some stories left you wanting more and some left you with more questions than answers. All of the stories left you wondering how crazy the world is and could be. Definitely recommend to lovers of short stories, fiction, historical fiction, or anyone else who loves going \"did that really just happen?\"."}, {"userName": "Susie James", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/9572491-susie-james", "userReview": "\"Mississippi Noir\" could almost have the word, \"redneck\" inserted descriptively -- a mixed bag of short stories, all of course written in the dark themes. Some seemed products of creative writing classes, and some have a bit more complexity, confidence, polish, intrinsic value ... I especially liked one set in Grenada in 1936; another also linking time and place as a mother stops at a roadside store while taking her children to Franklin, Tenn., to visit her sister-in-law...."}], "description": "Akashic Books continues its groundbreaking series of original noir anthologies, launched in 2004 with Brooklyn Noir. Each story is set in a distinct neighborhood or location within the geographic area of the book.Brand-new stories by: Ace Atkins, William Boyle, Megan Abbott, Jack Pendarvis, Dominiqua Dickey, Michael Kardos, Jamie Paige, Jimmy Cajoleas, Chris Offutt, Michael Farris Smith, Andrew Paul, Lee Durkee, Robert Busby, John M. Floyd, RaShell R. Smith-Spears, and Mary Miller.", "title": "Mississippi Noir", "url": "https://www.goodreads.com/book/show/31017207-mississippi-noir", "average": 3.61, "cover": "https://images.gr-assets.com/books/1505698680l/31017207.jpg", "reviews": 37, "authors": [{"url": "https://www.goodreads.com/author/show/125736.Tom_Franklin", "name": "Tom Franklin"}], "type": ["Short Stories", "Fiction", "Mystery", "Anthologies", "American"], "outlinks": ["http://www.goodreads.com/book/show/31017207-mississippi-noir", "http://www.goodreads.com/book/show/27131485-mississippi-noir", "http://www.goodreads.com/book/show/30986097-mississippi-noir", "http://www.goodreads.com/book/show/7948230-crooked-letter-crooked-letter", "http://www.goodreads.com/book/show/17349083-the-tilted-world", "http://www.goodreads.com/book/show/214340.Hell_at_the_Breech", "http://www.goodreads.com/book/show/367625.Poachers", "http://www.goodreads.com/book/show/385530.Smonk"]}