{"ratings": 2901, "userreviews": [{"userName": "Vanessa", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/44569697-vanessa", "userReview": "This was a pleasant, short read but nothing too extraordinary. This is the first of the Miss Julia books by Ann B. Ross that I have read, and it can be read as a standalone, but I feel like it's best to read them as a series. There was a good deal of flashbacks/recaps of prior events, and I got kind of lost in those sections, wanting the story to move more quickly. Nonetheless, this was still enjoyable, and I loved several of the characters because they felt so real. Miss Julia was so entertaining, and Sam, Hazel Marie, Little Lloyd, and Lillian were all very endearing."}, {"userName": "Debbie", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/4191554-debbie", "userReview": "Miss Julia can't help but make me smile. She has such a great heart, sometimes it just takes a while to get past her huge ego. I want to warn all readers....read this series in order, otherwise you'll wonder \"What was that about?\""}, {"userName": "Joyce", "userReviewDate": "Sep 19, 2016", "userURL": "http://www.goodreads.com/user/show/6137080-joyce", "userReview": "I have read the previous 6 books in the Miss Julia series that preceded this one and did not enjoy this one quite as much---therefore, the reason for 3 stars. In this novel, Julia remembers back to how things were when Little Lloyd and his mother Hazel Marie first moved into her home---especially that first Christmas and how much they have added to her life. Although there is another plot by her scheming uncle Vernon Puckett to keep Hazel Marie from having access to Little Lloyd's inheritance, this plot line lacked the spunky spirit shown by Miss Julia in previous novels. It felt like more of a rehash of the past than some new adventure she was getting into."}, {"userName": "Anne Hawn Smith", "userReviewDate": "Apr 29, 2010", "userURL": "http://www.goodreads.com/user/show/2393446-anne-hawn-smith", "userReview": "This book is entertaining, but a the back flash of Christmas is a little confusing. I was listening using an audiobook and I wasn't sure if it had been recorded wrong. Nevertheless, it was entertaining as are all the books in the series.When Hazel Marie's dastardly uncle comes back, he wrecks havoc with the household. He is bound and determined to prove that little Lloyd is not Wesley Lloyd's son and not heir to the Springer money. No one can figure what he has up his sleeve, but it causes the usual angst and turmoil. While Miss Julia has the help of Sam, she ends up providing the solution to the problem with the help of Lillian's secret."}, {"userName": "Judy", "userReviewDate": "Oct 22, 2012", "userURL": "http://www.goodreads.com/user/show/3131238-judy", "userReview": "This is my first Miss Julia. I love the way the author takes a character, Miss Julia, with oodles of flaws (snobby, out-of-touch with the real world) and grows her into a loving, generous person.I doubt if I will listen to any other books in this series because there is so much recapping of previous stories it would drive me batty. In this case, being my first of these books, it was helpful...but I would tire of it after my second, third, fourth books, etc."}, {"userName": "Snap", "userReviewDate": "Oct 20, 2011", "userURL": "http://www.goodreads.com/user/show/2995611-snap", "userReview": "I really enjoy the Miss Julia series. Some really good Southern humor and Miss Julia is an older woman ... someone I can relate to with my advancing age!"}, {"userName": "FangirlNation", "userReviewDate": "Jun 25, 2017", "userURL": "http://www.goodreads.com/user/show/48546466-fangirlnation", "userReview": "Miss Julia Stands her Ground is another fun addition to Ann B. Ross’s delightful series. Hazel Marie has settled in as part of the family, with Miss Julia's working hard to get Hazel Marie and Little Lloyd accepted by the members of the church community. Then Sam, Miss Julia's husband, hears from the cousin of Hazel Marie who kidnapped Little Lloyd in the first book. Brother Vernon Puckett, a self-styled preacher, has come up with claims that Little Lloyd is not the son of Miss Julia's late husband but rather another man she was seeing at the same time. Determined not to allow Brother Vernon Puckett from getting his way, Miss Julia and Sam work to find the truth and keep Little Lloyd from losing his inheritance.Read the rest of this review, more reviews, and other wonderful, geeky articles on FangirlNation"}, {"userName": "Sherrill Watson", "userReviewDate": "Aug 02, 2016", "userURL": "http://www.goodreads.com/user/show/26093561-sherrill-watson", "userReview": "Julia is in her 70s; formerly married to Wesley Lloyd Springer, now married to Sam, a former ('cause he's old) lawyer. It seems Little Lloyd isn't Wesley Lloyd's child according to Hellfire Preacher Brother Vernon Prickett. so Julia has to tell Hazel Marie that because of her brother they might have to disinter Wesley to get DNA evidence. 30 chapters later she's still trying to do that (!). Meanwhile, Little Lloyd has endeared himself to her and to us, and so has Hazel Marie Prickett. Hazel has her ways, as does Miss Julia, with different personalities, with an undercurrent of Southern Presbyterian [or Baptist?] in this small town life. Why Sam wound up with Julia makes no sense, but oh well."}, {"userName": "Dawn King", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/12339777-dawn-king", "userReview": "The adventures of Miss Julia is captured by Ann B. Ross in this popular series. While this is not high literature, I thoroughly enjoy the situations that Miss Julia finds herself in. She is like a madcap Angela Lansbury careening through her small southern town trying to please everyone while dealing with her many personal crazy friends and relations. These are hilarious and often you can't put them down. I don't know why they never made this into a comedy series."}, {"userName": "Katherine", "userReviewDate": "Dec 21, 2016", "userURL": "http://www.goodreads.com/user/show/2837258-katherine", "userReview": "The Miss Julia novels are certainly not great literature but they are lighthearted and they make me laugh. This one turned out to be the perfect holiday read because in it Miss Julia reminisces about her first Christmas with Little Lloyd and Hazel Marie; it was heartwarming and sweet and a lovely reminder that Christmas is truly what you make of it."}, {"userName": "Heidi Burkhart", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/16095582-heidi-burkhart", "userReview": "The is my favorite of the Miss Julia books. There is a flashback to the first Christmas that Hazel Marie and Little Lloyd spend with Miss Julia. Miss Julia's heart had hardened over the years, but it is Little Lloyd who melts her heart and gives her the ability to be compassionate again.So enjoyable to listen to the audiobook version!"}, {"userName": "Beth Yeary", "userReviewDate": "Apr 06, 2016", "userURL": "http://www.goodreads.com/user/show/19215233-beth-yeary", "userReview": "As usual, Miss Julia blows everything out of proportion when Brother Verber returns. I don't see why her and Sam don't file a restraining order against the jerk,"}, {"userName": "Bobbie Ann", "userReviewDate": "Sep 06, 2010", "userURL": "http://www.goodreads.com/user/show/1465287-bobbie-ann", "userReview": "Read by Cynthia Darlow. Pleasant, simple. Brother Vernon Puckett challenges paternity of young Lloyd."}, {"userName": "T", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/6078471-t", "userReview": "While I did like the flashback to Christmas, I did not find this particular book riveting. I did skip over a few pages when I realized the type of party Miss Julia was hosting."}, {"userName": "Christy", "userReviewDate": "Oct 26, 2017", "userURL": "http://www.goodreads.com/user/show/5467696-christy", "userReview": "Ann B. Ross's most recent novel, Miss Julia's School of Beauty, was a New York Times extended bestseller, with more fans drawn to Miss Julia's adventures every outing. Miss Julia Stands Her Ground finds our steel magnolia looking forward to many peaceful and happy years with her new husband, Sam. But she still has plenty to worry about. When Hazel Marie's troublemaking uncle, Brother Vernon Puckett, comes back to town, he claims to have conclusive proof that Little Lloyd is not the son of Miss Julia's late, philandering husband Wesley Lloyd Springer-a fact to which Miss Julia would have gladly subscribed a few years back. But that was then, before Miss Julia's life revolved around Little Lloyd, before that magical holiday when he became the apple of her eye.With DNA testing the only possible way to settle the dispute, Miss Julia shudders at the thought of exhuming her dead husband's body. But her housekeeper Lillian has a few souvenirs of Wesley Lloyd's life tucked away that, though a little creepy, might just be the key to ending the whole ugly mess. Another hilarious adventure, Miss Julia Stands Her Ground confirms what we know in our hearts-family is always thicker than blood."}, {"userName": "Rosemary", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/4723954-rosemary", "userReview": "Trouble comes to Miss Julia's house when Hazel Marie's uncle Vernon tries to get control of Little Lloyd's trust fund by claiming Miss Julia's late first husband Wesley Lloyd Springer wasn't really Little Lloyd's father. In these days of DNA that's quite easy to prove or disprove, so to give a bit more meat to this book, a large chunk of the middle is a flashback describing Miss Julia's first Christmas with Hazel Marie and Little Lloyd. I enjoyed this instalment but not as much as some of the others."}, {"userName": "Karenbike Patterson", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4193521-karenbike-patterson", "userReview": "If you want something truly mindless to listen to while your husband is recovering from heart surgery then this is your book. Miss Julia is an opinionated, willful southern woman (who asks her new husband \"Oh Sam, what should I do?\") whose truly awful husband of 45 years has died. Julia takes in his mistress and her son by this bozo. This is so comically stereotypical that you'll think it was written in the 50's - including the black servant with the slow drawl. I guess we are supposed to admire Miss Julia for living her Christian principles. It was pretty far fetched to say the least."}, {"userName": "Linda", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/2558245-linda", "userReview": "She stood her ground!There's only one more Miss Julia book I have to read but I would say that so far this is my favorite!Hazel Marie's uncle shows up again trying to cause trouble. This time he claims that Little Lloyd is not Wesley Lloyd Springer's son and he has someone to back his claims. If you know Miss Julia, then you know she doesn't take this news lightly or sitting down!!"}, {"userName": "Pat", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/3445432-pat", "userReview": "What an enjoyable read. Families ALL have problems, some more than others. Some find ways to sort them out, other do not. In this book problems are sorted, solutions found and life becomes better. I will have to find more of her books!!!"}, {"userName": "Nancy Haddock", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/6233405-nancy-haddock", "userReview": "Miss Julia defends her family against all odds again, and succeeds is routing the evil preacher. Lots of action in these books, and the characters are such fun!"}, {"userName": "Nancy", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/1030601-nancy", "userReview": "In this episode, through a series of flashbacks Miss Julia catches us up on how Hazel Marie and Little Lloyd came to be such a treasured part of her extended family. Lovely Christmastime story."}, {"userName": "Beverley Lombardi", "userReviewDate": "Nov 17, 2017", "userURL": "http://www.goodreads.com/user/show/38698033-beverley-lombardi", "userReview": "Cute and cozy story. Audio reader was good."}, {"userName": "Harry Addington", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/11826426-harry-addington", "userReview": "Wonderful"}, {"userName": "Chris", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/3596097-chris", "userReview": "I needed a light book after all the heavy reading I had been doing and my friend Mary Kay suggested these books. A light hearted southern book. It reminded me a bit of Miss Marple."}, {"userName": "Leslie", "userReviewDate": "Sep 17, 2015", "userURL": "http://www.goodreads.com/user/show/5774735-leslie", "userReview": "Now that Julia's marriage is firmly legal, Little Lloyd's paternity gets called into question. The aspersion-casting culprit is none other than Brother Vern, aka Vernon Puckett, Hazel Marie's uncle. If you like plot surprises, DO NOT read the book jacket; it's a plot spoiler. One thing I like a lot about this book is Julia's reminiscences about Christmases Past: first those with the odious, miserly, stingy Wesley Lloyd, then her first Christmas with Hazel Marie and Little Lloyd. These chapters give us valuable glimpses into what she became under Wesley Lloyd’s spirit-crushing influence, and what she became without it.Through the flashback we discover how Miss Julia’s brittle exterior finally began to crack and her frozen-over center to soften. We learn why the cream of Abbotsville society found it in its best interest (pun not intended but highly appropriate) to include Hazel Marie in their social circle. We see Miss Julia’s progression in her feelings for Little Lloyd, and get a bit teary when he recaptures for her the true spirit of Christmas. Now we know why she cherishes him. And now we know that nothing will change how she feels about that little boy, no matter what.One thing I criticize is an amateurish carelessness about the book's timeline. In the space of just a few days, Ross whipsaws us from what should be late September to early December. That alone would have warranted a three-star rating in my view, since that is so basic, but the flashback redeems it.Read more in my Miss Julia blog at http://bit.ly/1KzWrZI."}, {"userName": "Linda", "userReviewDate": "Apr 20, 2016", "userURL": "http://www.goodreads.com/user/show/1638879-linda", "userReview": "This may be my favorite of the series so far. It's near Christmas when Miss Julia (a lady of a certain age) finds out from her new husband that her late husband's illegitimate son might actually have a different father. However, since Miss Julia has come to love Little Lloyd and his mother as the family she never had, this news devastates her.She and her husband Sam determine the best course of action is to keep this a secret and work it out on their own. Fate intervenes of course and 1/4 of the book takes us in a flashback to Miss Julia's 1st Christmas as a widow and her 1st Christmas with Little Lloyd and his mother, Hazel Marie. It is very telling, moving and answers a lot of questions about the unusual family.The subplot is that forces inside her church want to stir up trouble by nominating Miss Julia to be the first woman to sit on this particular congregations Session.Sometimes Miss Julia comes off a bit ridiculous and ungrateful. In this book, she's right on point and her evolution is what makes her a worthwhile heroine to enjoy over multiple books."}, {"userName": "Carolee", "userReviewDate": "Mar 10, 2008", "userURL": "http://www.goodreads.com/user/show/605519-carolee", "userReview": "This is a \"must read\" for mature women and all those that wish to understand them. Miss Julia is a lovely southern belle in comtemporary times. She is widowed from a disappointing long term marriage that continues to haunt her into her new marriage. Miss Julia is the perfect southern, Christian woman; so forgiving and suuportive of all the people that her deceased husband used and discarded before his sudden death. His rich estate left Miss Julia carefree except for the fatherless son that fortuitously appears, and the unscrupulous minister whose church stood to inherit all and leave Miss Julia out in the cold. You will chuckle all the way through this read as Miss Julia, the typical helpless southern bell, out wits, out smarts, and \"out-Christians\" all the gossipy townsfolk and the money hungry minister."}, {"userName": "Jgrace", "userReviewDate": "Jan 20, 2016", "userURL": "http://www.goodreads.com/user/show/801479-jgrace", "userReview": "Miss Julia Stands Her Ground – Ann B. Ross3 starsMiss Julia has a problem. She must prove that Little Lloyd is without doubt the biological child of her late husband while preserving the reputation of the boy’s mother Hazel Marie. I love the cast of characters and the ridiculous situations they find themselves in. Hazel Marie’s passion party had me laughing out loud. I’m a Yankee who married into a Southern family and there are personalities here that I recognize. This is not great literature, but I found Miss Julia’s strong moral sense a relief after reading Witches of Eastwick.This was my first Miss Julia book although I'd bought several of them to give to my mother. Stands her Ground is the 6th book in the series. I didn't have much difficulty following the plot or getting to know the characters as Miss Julia seems to do a great deal of reminiscing."}, {"userName": "Karen", "userReviewDate": "Mar 29, 2015", "userURL": "http://www.goodreads.com/user/show/4183997-karen", "userReview": "I always enjoy Miss Julia, but this one was particularly fun to listen to. The author gives us a glimpse into Miss Julia's life before Hazel Marie and Little Lloyd came into so it's evident how much they've changed her. Also, when the question of Little Lloyd's parentage comes up, she is ferocious in defending Hazel Marie and taking on Brother Vernon Puckett (Hazel Marie's uncle). However, the funniest and most surprising event is when Emma Sue Ledbetter (the minister's meek and obedient wife) goes after Brother Vern with a purse full of hundreds of pennies - it's priceless. A wonderful addition to those of us who are Miss Julia fans."}, {"userName": "Sandy", "userReviewDate": "Mar 15, 2011", "userURL": "http://www.goodreads.com/user/show/4501769-sandy", "userReview": "Book #7 in the series. It starts out with the delightful humor of the first one, but about midway the author decides to take a lengthy flashback that breaks the rhythm and tension of the plot. It almost felt like Ross decided to fill in some holes that she wished had been included in the first few books. The resolution was a bit too neat and the idea that Hazel Marie would stand up to a man lying about her character but NOT stand up to the man trying to take her son away from her was preposterous. Still has some good laughs in it, despite these weaknesses."}], "description": "The feisty Miss Julia returns to set things right in her seventh hilarious adventure Miss Julia has charmed and captivated fans of humorous Southern tales through six rollicking novels, and now, in \"Miss Julia Stands Her Ground,\" she faces her most daunting challenge yet. Hazel Marie's troublemaking uncle, Brother Vernon Puckett, has just swept into town and questioned Little Lloyd's paternity. Suddenly Miss Julia's late husband's estate is up for grabs, and it's up to her to prove that the boy's claim is legitimate. In another hilarious and heartwarming caper, Ann B. Ross proves that a little spunk and Southern charm go a long way.", "title": "Miss Julia Stands Her Ground\n      \n          (Miss Julia #7)", "url": "http://www.goodreads.com/book/show/8051614-miss-julia-stands-her-ground", "average": 4.07, "cover": "https://images.gr-assets.com/books/1355047795l/8051614.jpg", "reviews": 148, "authors": [{"url": "https://www.goodreads.com/author/show/43948.Ann_B_Ross", "name": "Ann B. Ross"}], "type": ["Fiction", "Womens Fiction", "Mystery", "American"], "outlinks": ["http://www.goodreads.com/book/show/8051614-miss-julia-stands-her-ground", "http://www.goodreads.com/book/show/575393.Miss_Julia_Stands_Her_Ground", "http://www.goodreads.com/book/show/10859805-miss-julia-stands-her-ground", "http://www.goodreads.com/book/show/3770303-miss-julia-takes-a-stand", "http://www.goodreads.com/book/show/6653131-miss-julia-stands-her-ground", "http://www.goodreads.com/book/show/1560501.Miss_Julia_Stands_Her_Ground", "http://www.goodreads.com/book/show/77520.Miss_Julia_Speaks_Her_Mind", "http://www.goodreads.com/book/show/614727.Miss_Julia_Meets_Her_Match", "http://www.goodreads.com/book/show/668554.Miss_Julia_Takes_Over", "http://www.goodreads.com/book/show/668553.Miss_Julia_Hits_the_Road", "http://www.goodreads.com/book/show/668555.Miss_Julia_Throws_a_Wedding"]}