{"ratings": 31316, "userreviews": [{"userName": "Emily May", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Absolutely gripping. The subject matter is one close to my heart, but after reading this and Krakauer's Under the Banner of Heaven, I'm starting to think he can make any subject interesting with his emotive and engaging writing style. Who knows? Maybe I can even get myself interested in mountaineering and tackle Into Thin Air or Eiger Dreams.We shall see.Anyway, Missoula: Rape and the Justice System in a College Town is extremely horrifying. I followed a number of the cases the author writes about but I didn't know the extent to which law enforcement failed the rape victims at the University of Montana. Most people know that it is hard to prosecute in rape cases (the ol' \"he said/she said\", etc.), but what is especially astounding here is how much evidence was ignored by detectives and how interviews were conducted that assumed blame toward the victim and innocence toward the accused. Krakauer draws directly from interview transcripts to show how reluctant police were to prosecute accused rapists, even when they actually did have a good amount of evidence against them. Police refused to speak to key eyewitnesses, disregarded DNA and blood evidence, and one prosecutor later testified at a UofM hearing that the victim was \"fuzzy\" as to whether she gave consent, even though the interview transcript shows the victim clearly stating she said \"no\" and \"stop\" multiple times.The book offers a deep criticism of a system that puts the desire to win cases before the desire for justice, and the desire to protect the future of suspected rapists over the desire to protect further young women from being raped.Informative, accessible and powerful. An important subject tackled by a truly fantastic writer. Blog | Facebook | Twitter | Instagram | Youtube"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Rape in unique. No other crime is so fraught with controversy, so enmeshed in dispute and in the politics of gender and sexuality.This book is not an easy read. It is however a book that should be read. It really should be required reading in high school and early college years. Not just for the boys either. Girls need this book too.I wish I could do this book justice in a review. I just don't think I can encompass it well enough. Just read this book people. Even if you hate the way Jon Krakauer writes it still has a message that needs to be read.Krakauer focuses on the Missoula area, that does not mean that these stories are limited to that area. It was just the area chosen to focus on what is a epidemic that needs stopped. Several women are focused on in this book. Some of their stories involve the fact that they had consumed alcohol before their rapes. They may have known their rapists. They might even have engaged in some foreplay with these guys. Does that mean that when they said no that their NO wasn't as valid as that woman on the street being jumped by that unknown guy that is raping her? Hell no.\nThen when the woman does work up the nerve to actually tell someone that she was raped. She gets a trip to the clinic for a forensic rape test.For the next four hours I was essentially raped all over again. I had to stand completely naked on a white sheet and let a nurse brush my entire body to collect evidence that might contain his DNA. (Victim's Name) most private recesses were probed, combed, swabbed, photographed, and intensely scrutinized by strangers.Victims have to be interviewed by police officers who always ask \"Do you have a boyfriend?\" They have to make sure the victim is not in fact someone that cheated and is using this as an excuse for their loved ones.You're just being a slut. You're fucking other guys, and you're trying to cover that up by saying you were raped.Then the public trial of the victims. In one case a lawyer for the guy had a woman's roommates interviewed and her house watched. There is even a female prosecutor in this book that declined filing criminal charges on one male and then testified in his behalf at the college. Even though there was a taped confession that he did rape the female in question.This book shook me. I'm sitting her even writing the review with chill bumps on my arms. HOW DO WE STOP THIS????Changes need to be made so that when a female or male comes forward with a rape claim that they aren't treated like crap. We need to change the fact that most rapes don't even get reported. Changes need to be made and talking about it and getting upset enough to make our voices heard. I'm the mom of both boys and girls. I'm just completely gutted by this culture that's story is told in this book. \nBooksource: Library"}, {"userName": "Petra X", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "[if the cap fits ;-) (hide spoiler)]"}, {"userName": "Roxane", "userReviewDate": "Jul 21, 2015", "userURL": "http://www.goodreads.com/user/show/1151637-roxane", "userReview": "Short review: Ban MenLonger review: Horrifying look at rape culture at work in Missoula, MT, but also applicable everywhere. The first half of the book is much stronger. The second half is basically court transcripts. I would have liked to see more synthesis, and author insight. At the very end Krakauer is also like, \"I had no idea it was this bad and that so many women were raped and now I know,\" and it was kind of strange but I guess it was also honest. What really struck me in this book is how it stated what so many of us already know--there is little justice to be found where rape is concerned and we have a A LOT of work yet to do."}, {"userName": "Alicen", "userReviewDate": "Mar 31, 2015", "userURL": "http://www.goodreads.com/user/show/126060-alicen", "userReview": "I will read anything Krakauer writes. This book, in particular, is both powerful and necessary. As he writes: \"rather than being the nation's rape capital, Missoula had an incidence of sexual assault [in 2010] that was in fact slightly less than the national average. That's the real scandal.\""}, {"userName": "Alex Daniel", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/10360599-alex-daniel", "userReview": "All right, I'm going to be an asshole.That's really the only way this will come off, isn't it? How can I explain that, while I believe that the subject matter is incredibly important, disturbing, and heart-wrenching, that the book itself doesn't live up to the task? I love Jon Krakauer's work. What I love most about his writing is the way that he uses very specific narratives to talk about, and to illustrate, a much broader point. In INTO THE WILD, he wrote about one man's purposeful isolation, and how that reflects on all of our desire to similarly escape. In UNDER THE BANNER OF HEAVEN, he wrote about two men's brutal killings, and how that reflects on fundamentalism gone dangerously awry. For MISSOULA, the objective seemed clear enough: by telling the tale of 2-3 women who were victims of sexual assault, he'd talk more broadly about how the justice system is broken.And in some ways, Krakauer pulls this off. When he does pull back to look at society-at-large, the book works wonderfully. The information here is devastating. Krakauer is wise to pull much of his quotes from Judith Herman's excellent TRAUMA AND RECOVERY. When Krakauer talks about these issues, and how importantly they are, he does so deftly and sensitively while never losing sight of the magnitude of the problem. But I found that the individual narratives of the women were often bogged down. Most of the information about these individual stories are court proceedings, and much of our time in this book is spent with transcripts about what was said in court. I understand that this keeps the book's veracity high, but it doesn't make for great reading. Ultimately, there is a lot to like about MISSOULA. It's scary without being sensationalist, and Krakauer's clear-eyed approach is difficult with such a sensitive topic. I hope that people read the book and are inspired to check out TRAUMA AND RECOVERY. Even if they don't, I think it'd be impossible to walk away from this without some sense of indignature towards our sexual and judicial culture."}, {"userName": "Jamie", "userReviewDate": "Apr 22, 2015", "userURL": "http://www.goodreads.com/user/show/1546297-jamie", "userReview": "This is a painful, frustrating, teeth-grinding, angst-inducing, trigger-filled must read.For those who think Krakauer is picking on Missoula, or out to tarnish the image of a whole community, get over it and read the book. In the end he praises the University of Montana (where my daughter goes to school) for their improvements, he lauds the Missoula police, and highlights a weak spot for victims of sexual assault in the local justice system--the County Attorney's office. Will those in charge of prosecuting rapists actually improve their atrocious record of doing so? We can only hope."}, {"userName": "Jen", "userReviewDate": "Apr 03, 2015", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "This narrative shocked me; enraged me; then frightened me. Krakauer exposes a rape culture that resides in the University of Missoula, Montana. Rape is the most under reported, prevalent violent crime against women and often committed by men whom they are acquainted with. This looks at 3 specific cases where the accused are football players. No more than 20% of rapes are reported. Why? Just look at how they are adjudicated. The victim re-victimized and traumatized physically through the collection of evidence and emotionally through the retelling to school officials, police, lawyers. Their own lives being scrutinized, smeared. The accused regarded as heroes; icons; untouchables; holding a sense of entitlement; impunity; immunity. Krakauer debunks the rape myth that victims are drunk, promiscuous, or sending mixed messages. Stats reflect this to be an issue of a much larger scale. It’s an epidemic in the U.S.I’d like to think being in Canada this doesn’t happen here. I’d like to think that as my daughter prepares to embark on her university education in less than 12 months. But that’s a fallacy. The reality is: rape is real and more prevalent in these communities where victims know their assailants. We need to be more compassionate and supportive of these victims who are courageous enough to come forward. We need to be advocates and also ensure our young men know what’s right, what’s wrong and what is NOT ok. EVER. 4*"}, {"userName": "Tom Mathews", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/22063432-tom-mathews", "userReview": "At the end of almost every audiobook the narrator comes on and says “We hope you have enjoyed this audio presentation of insert title. This morning when I got to the end of Jon Krakauer's latest book, and heard that, I had to laugh. No, I did not enjoy Missoula: Rape and the Justice System in a College Town. It is an excruciatingly painful book to read or listen to. It describes, in living Technicolor, several gut-wrenching sexual assaults and the years of psychological torment that the victims of those assaults must endure. In addition, it spotlights shortcomings in our criminal justice system that only exacerbate the torture and suffering these victims experience.As painful as this book is to read, though, I believe that it is one that everyone should read. There are too many myths and misconceptions about rape that need to be corrected. When we hear the word rapist most of us picture some stranger in a ski mask breaking into an apartment armed with a knife. While such assaults do happen, 80 percent of rapes are perpetrated by people the victim knows and trusts. Of all the cases discussed in this book, the rapist was always considered a trusted friend by the victim. Another myth that is commonly held is that if a girl is really being raped, she will scream, fight, and do everything in her power up to and including risking her life, to resist. When police, prosecutors and juries believe that acquaintances can’t be rapists or that submission signifies assent, it is easy to see why rape is the most underreported violent crime on the books.I could say more. I want to say more but I feel that if I started writing, I would not stop until I had a review that was longer that the book I am reviewing. I do want to point out one important thing which Krakauer made clear. This book did not focus on Missoula and the University of Montana because more rapes take place there than elsewhere. In truth, the rate for reported sexual assaults at the University of Montana is actually slightly less that the average. The book shone a spotlight on Montana to show what the situation is like everywhere.FYI: On a 5-point scale I assign stars based on my assessment of what the book needs in the way of improvements:*5 Stars – Nothing at all. If it ain’t broke, don’t fix it.*4 Stars – It could stand for a few tweaks here and there but it’s pretty good as it is.*3 Stars – A solid C grade. Some serious rewriting would be needed in order for this book to be considered great or memorable.*2 Stars – This book needs a lot of work. A good start would be to change the plot, the character development, the writing style and the ending. *1 Star - The only thing that would improve this book is a good bonfire."}, {"userName": "Elyse", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "A powerful examination of the realities of rape on college campuses ( Missoula in this book), is just frickin TOO HIGH!!!!The stories in Missoula are gut wrenching... details after details... Is it any wonder justice is hard to come by...More rapes go under-reported than 'any' other crime? A crime which leaves life long scars. If the 'big crimes' on college campuses of 'under-reporting' were stealing.... ( which happens too), the victim would feel angry, invaded, and a range of other emotion...but usually not have the same life long emotional haunting scar. ....So hopefully Jon Krakauer's book is making a difference for change....We need not only talk to our young daughters about rape- sexual assault, verbal pressures, problematic relationships or situations they may find themselves in... but to our sons...our young men. Young men damage woman's lives, their families lives, and themselves. Hopefully this book will be a contribution to all college campuses... A need for more prevention and support systems. California recently passed the first-ever bill to define sexual consent on college campuses:The Affirmative Consent Law....\"YES means YES\". A person's silence or passivity in the face of sexual advances cannot be taken as consent. Rapist won't be exonerated because their victims were too intoxicated, or immobilizedwith fear or shame, to articulately refuse. We need to change culture expectations so that sex is something people engage in when it is equally desired not a goal that someone strives toward regardless of the situation. An important aspect of this book is dispelling any misconception of a rapist profile. The non-stranger- entitled athlete....has gotten away with crimes long enough...A must read book... 'Disturbing as Hell'! Yet... Hopefully we will see more rape cases successfully prosecuted..... more victims come forward and not let fear stop them from reporting their story right away. Better yet....may rape substantially decrease on all College campuses and for all women....men too."}, {"userName": "Amanda", "userReviewDate": "Feb 10, 2015", "userURL": "http://www.goodreads.com/user/show/7355058-amanda", "userReview": "Jon Krakauer's books occupy a special place on my shelves and in my heart. They're dog-eared, marked up, creased, stained, frequently reread, and often contemplated. His gift for connecting an unusual event with deeper social and psychological truths is a hallmark of his writing that sets it apart from any other I've read. I was enthusiastic when I first heard the subject of his next book; I knew he was someone who could deconstruct the current media chaos and distill it into a reasonable, insightful, balanced examination of the issues beyond the headlines. I never, ever in a billion years thought I would give Missoula a two-star review. I never thought I would use words like \"tedious,\" \"underdeveloped,\" \"half-assed,\" and \"officious\" to describe the work of a man whose prose is so compelling he made what was essentially a glorified rant required reading. I tried to engage with this book, but I finished it feeling that it was an overly verbose, self-important procedural that ultimately didn't accomplish much more than the university and courtroom hearings recounted in the book: it gave survivors of sex crimes a much-needed forum to share their experiences, but no meaningful justice or resolution. All of the pieces for a classic Krakauer send-up were right there, sometimes touched on, but never significantly discussed. Rape is a major problem, and we have to stop victim-blaming and making excuses and address the context, implications, and reasons for that reaction. I was waiting for him to use these women's experiences to talk about why society seems to define consent differently than the law, the role of alcohol in the university lifestyle, whether victims have an obligation to report, why we still act like the creepy guy in a van is the person most likely to attack you, what responsibility universities should have for their students' lives outside of the classroom, whether the criminal justice system is even the place for victims and perpetrators to find justice... I could go on forever. While Krakauer provides several examples of how this terrible phenomenon happens, he barely delves into why it happens, and that's the conversation that desperately needs to be separated from the bullshit. Krakauer was the best person to write a book on sexual assault in the twenty-first century – not because he's a man and we need a man to tell us how to feel, but because he's a high-profile author whose work draws significant attention; because he openly acknowledges that he was largely ignorant on this topic, too, and learns along with his audience; and because parsing the headlines and snap judgments, dissecting the research, history, and context, and then drawing out the ugly truths we have to confront is what he does best. It doesn't surprise me someone would write an officious book about a complex cultural problem, but it surprises the hell out of me that it was Jon Krakauer."}, {"userName": "Iris P", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "Missoula: Rape and the Justice System in a College Town\nJon Krakauer is an American writer best known for his writings about the outdoors\"Missoula: Rape and the Justice System in a College Town'' is a brutally honest, absorbing piece of investigative journalism that chronicles several alleged cases of \"non-stranger\" rape that occurred in the college town of Missoula, Montana, between January 2008 and May 2012. While I found some of the book's descriptions of sexual assaults highly descriptive and at times difficult to read, they are also almost clinical in the way they are depicted. I imagine these passages might be more difficult to read by anyone who has daughters specially if they are attending college. But this level of detail seemed necessary in order to convey the horrendous nature of rape and its terrible physical and psychological consequences.Several of these cases involved players from the University of Montana footbal team and like it's the case in many of these college towns, footbal is king and their players are revered and enjoy an almost semi-god status.Although the town was unofficially designated by the media as \"America's Rape Capital\", Krakauer explains that unfortunately what happened there it's not an aberration but rather falls well within the normal sexual assaults statistics of most college towns in America. Krakauer embeds several quotes by some feminists bloggers and activists, but this is not a feminist manifesto. It's a well researched book written for and with a mainstream audience in mind. The author's clear intention is to educate and shed light into an issue that many of us don't understand or rather don't talk about: college campus date rape. And this is to me the most important goal the book accomplishes.Missoula, which was originally scheduled for a fall 2015 release, was rushed into publication after the infamous Rolling Stone December 2014 article that depicted an alleged gang rape at the University of Virginia was thoroughly debunked and retracted creating a real public PR nightmare for the magazine's editors.On a recent interview with NPR Krakauer said \"The Rolling Stone fiasco really discouraged me,\" \"(We thought) it'd be a good time to show this book; that… the overwhelming majority, you know, of victims do not lie about rape.\"There are several layers on this book, on one level it describes the roles played by several of the town institutions, The University of Montana, The Missoula Police Department and the Missoula County Attorney's Office. The \"cast of characters\" is so large that the book includes a Dramatis Personae addendum that lists the names of the people involved in these stories. It's safe to say that some of the characters come out unmistakably depicted as the villains of the story.Experiencing first hand the blatant hostility and lack of sympathy police officers, detectives and prosecutors show towards sexual assault victims was to say the least, disturbing and disheartening. You can see how these condescending attitudes serve to perpetuate the stigma that surrounds women that come forward after being sexually assaulted.Both the Missoula Police Department and the Missoula Attorney's office mishandled so many rape cases that it prompted the Department of Justice (DOJ) to open an investigation, creating a legal and political and legal firestorm between the DOJ and local officials that lasted several years.Missoula recounts the stories of three main female characters, two of them were raped while they slept or were slipping in and out of consciousness. All of them knew their attackers (one of them knew him since 2nd grade). In some cases they had willingly gone to bed with their attackers but had said no to sex. Out of the three cases, two went to court, only one of them received jail time.A good portion of Missoula is dedicated to explaining the often misunderstood psychological reactions victims of rape frequently display. Rape is a deeply emotional, intimate and devastating experience and many of the responses women showed during and after a sexual attack can seem to most confusing and contradictory. It's not rare to find that rape victims are unable to call for help during or after an assault, give a car ride to the rapist or don't want to reach out to the authorities or even go to a clinic.The author explains that this is a defense mechanism the victim uses in an attempt to retake control of her life and her body. If you act as if nothing happened, perhaps you can make this horrible experience go away.The cornerstone of the American criminal justice system is that a defendant \"is innocent until proven guilty\", but Krakauer posits that the system loads the deck more heavily against sexual assault victims than victims of most other crimes. Rape is probably the only crime where the burden of proof is mostly put on the victim.Time after time these young women described how they often faced highly inappropriate questions such as: How were you dressed? Did you drink too much? Did you call for help? Did you fight back? These line of questioning is pretty common and frequently used by police officers, prosecutors and defense lawyers during the investigation and trial processes.The implication is of course that most women that accused men of rape were indeed the ones that instigated the attack. The proverbial \"she was asking for it\".Such injustices pervade “Missoula” as Krakauer shows a system that fights accusers at every step in the process and holds women responsible for the actions of the men who rape them.The Research the Rape, Abuse & Incest National Network (RAIN) shows a different story thought.Here are some statistics on rape:* Only 2 to 8 percent of reported rapes turn out to be false.* 9 out of 10 victims of rape are female.* 82% of rapes were perpetuated by a non-stranger.* 68% of Sexual assaults are not reported to police.* 98% of rapists will never spend a day in jail.* Every 107 seconds an American is sexually assaulted.* About 1 out of 6 women will be a victim of rape at some point in their lives. Source: https://www.rainn.org/statisticsThe book also debunks some well known myths about rape such as:* Any woman could prevent rape if she really wanted to. No woman can be raped against her will.* Rapists are easy to spot. They are abnormal perverts. Only insane men rape women.* Rape is an impulsive act, an uncontrollable act of sexual gratification.* Once a woman has consented to sexual relations in the past with a man, she cannot be raped by that man in the future.* Some women deserve to be raped because of the way they dress, act, etc. They cause a man to “lose control.”* Women say “NO” when they really mean “YES”.Krakauer acknowledges that there are cases in which men have been wrongly accused of rape, he specifically mentions the case of the three Rutgers Lacrosse players who in 2006 were falsely accused of rape by a woman the students had hired as a stripper as a prime example of these occurrences. Indeed he recognizes that accusing someone of sexual assault needs to be \"handle with great care, because to be labeled a rapist carries an indelible stigma as well as a permanent criminal record ...\"But I think there's little doubt that Krakauer's sympathies understandably lie with the young female characters of these stories, as I mentioned to a Goodreads friend the other day there are issues like these where I believe we are in need of more passionate voices willing to bring attention to them.Perhaps the most moving part of Missoula for me was to learn that the motivation for many of these women going to the authorities was to make sure that their assailants were punished and would not rape again. It takes a lot of courage for any woman to out herself as a rape victim, particularly in these times of non-stop sensationalized cable news and social media and specially when your assailant happens to be the town's football hero.I also think it's important that this book was written by a male writer, too frequently men have been conspicuously silent on this issue.Last year President Obama became the first sitting US president to utter the words \"sexual violence\". We need more men to speak out against this horrible, widespread crime."}, {"userName": "Caroline ", "userReviewDate": "Apr 29, 2016", "userURL": "http://www.goodreads.com/user/show/3236194-caroline", "userReview": "***NO SPOILERS***Common rape fallacies:1) Many women “cry rape.” 2) Many rape victims are the ones who choose not to charge and prosecute their rapists. 3) Most rapists don’t know their victims. 4) Most rapists are punished.If you think the United States is one of the most forward-thinking countries when it comes to this monstrous crime, if you think police do everything in their power to protect rape victims, if you think most people understand rape in general, you’d be sorely mistaken, and you are meant to read this book. Drawing on rock-solid research, renowned investigative reporter Jon Krakauer expertly tore apart every myth surrounding rape and covered so much more in this crucial work of nonfiction. He began by putting a human face on a crime that affects a mind-boggling number of women (and men, but Krakauer focused on women) by opening with the story of one rape victim, then deftly moving on to a handful of others. Missoula’s hook is immediate, and thanks to Krakauer’s signature fluid writing, this book reads like an engrossing work of fiction; read the first few pages of chapter one and just try to set this aside.He chose Missoula, Montana very deliberately. It’s a typical college town, and Krakauer wanted to highlight the widespread epidemic of campus rape. Additionally, Missoula in particular has been hit especially hard by allegations of campus sexual assault and rape. Finally, and an absolutely essential point, this is a town whose residents are thoroughly enraptured by the University of Montana football team, the Grizzlies. (In fact, the fandom is so impassioned and their loyalty so blind and all-consuming that the town is lovingly dubbed “Grizzlyville.”) All rape victims--not just those in college--rarely see justice served, but Krakauer’s decision to home in specifically on college football–obsessed Missoula couldn’t have worked more perfectly to underscore a horrifying general truth. Quite simply, it is this: if your rapist happens to be beloved, expect the worst from the criminal justice system--and scathing, inexorable torment from the public. Woe to the Missoula victim whose rapist happens to be a revered “Griz.” Krakauer presented staggering statistics that no doubt will enrage and stun most readers to the core and painted a damning portrait of the criminal justice system. The crime is disgracefully handled almost across the board, and that is a crime in itself. So many of these failures could be prevented if the complexity of rape, and victims’ often counterintuitive responses while being raped, were genuinely just understood. By the end, there’s one thing Missoula has made abundantly clear: extensive education on rape is desperately needed, for all. As things stand now, in supposedly enlightened 2016, much of the public and far too many police officers and lawyers remain disturbingly misinformed. It must be stated that because Missoula addresses shortcomings in how the criminal justice system handles rape, it’s focused on a handful of victims. Given the topic, it has to be. This is not to say, however, that it’s biased. The other side didn’t get the short end of the stick; very much on the contrary. Every little fact was included. Both sides were depicted fully. Court transcripts were presented verbatim. All research was meticulous to a fault. Like all of Krakauer’s books in recent years, Missoula is investigative. Krakauer’s ability to remain dispassionate is one of the things that makes his writing so wondrous. Don’t shelve Missoula on the to-read list and allow it languish alongside that forgotten book you shelved in 2008 and the “should-read” classic you know you’ll never read. The time for this book is now. Bonus: Following is a very short article about campus rape. Specifically, it concerns, “a campaign called ‘Unacceptable Acceptance Letters,’ [which] is an imagining [in video form] of what it would look like if colleges owned up to the problem of rape on their campuses--and how they’re failing to address it--right off the bat.” Please read (and watch). http://mic.com/articles/141247/here-s...Update: 5/27/16. Shades of Missoula: \"Baylor University Demotes President Kenneth Starr Over Handling of Sex Assault Cases\"Update: 6/9/16. Judge sentences Stanford University student who raped unconscious fellow student to just six months in jail because \"a harsher penalty would have a 'severe impact' on the aspiring athlete\": http://www.cnn.com/2016/06/07/opinion...Update: 3/25/17. \"Nearly 15% of female undergraduates at UT Austin report being raped\": https://www.theguardian.com/us-news/2..."}, {"userName": "Thomas", "userReviewDate": "May 21, 2015", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "With the atrocity of the Stanford swimmer rapist case blowing up in the news, I feel like I could not have read Missoula at a more relevant time. Jon Krakauer does a great job highlighting the flurry of rapes that took place in the college town of Missoula at the University of Montana. His extensive and meticulous research shines as he delves into the convoluted intricacies of prosecuting rape in our legal system and the horrible trauma survivors experience as a result of rape. While Krakauer focuses a bit more on legal proceedings in the second half of the book rather than providing in-depth, original analysis, he compensates by referencing the brilliant \nTrauma and Recovery\n, a book which everyone should read.I hope Missoula serves as a launching point for further, deeper discussions of sexual violence, gender, and toxic masculinity. Instead of asking irrelevant questions about what victims wear or drink, we should ask what we have done as a society to raise men who have such little respect for women and who commit such violent crimes. Yes, I recognize that people who do not identify as men also rape, but the overwhelming evidence surrounding male violence overall just terrifies, angers, and saddens me. We should encourage conversation around deconstructing toxic masculinity instead of policing female behavior, by teaching men to act with compassion, not cruelty. For further reading in that vein, see \nThe Will to Change\n by Bell Hooks, \nSelf-Compassion\n by Kristin Neff, and \nThe Lost Art of Listening\n by Michael Nichols.This book just marks the beginning. We need more feminists - those who understand and will not stand for rape culture - in the legal system, in universities, in everywhere, really. We need to question why we glorify male athletes even when they act in such awful ways. We need to construct a culture that prevents sexual assault, by raising men who will not perpetuate the crimes of Missoula and universities nationwide."}, {"userName": "Maureen", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/5535795-maureen", "userReview": "****WARNING**** - to all of my GR friends who read my reviews, this is not going to be a typical review for me- it simply cannot be. Krakauer has given voice to a subject that is extremely personal to me - I was a victim of sexual assault and as Krakauer points out, to not be believed is almost worse than the assault itself. As to the book- brilliant- mother-effing brilliant. Anyone (Kirsten Pabst) who wants to claim that this book provides a one-sided view of a complicated issue- well you can just go pound sand. Although brutal to read and teeth-grindingly frustrating, Krakauer did an exemplary job of providing a balanced, albeit painful, account of the disgraceful situation existing in Missoula. Sadly, I do not think this period has come to an end. With Pabst now serving as Missoula County District Attorney, there is no way the ignorance and lack of compassion in that office is going to be remedied when you have the chief offender at the helm. If there is not a recall election already being planned, there certainly should be. Ms. Pabst is a monster. I never knew that \"see (c) you (u) next (n) Tuesday (t)\" started with a K, but Pabst has changed that perception for me. She is a disgusting piece of work and a horrible human being. If Missoula wants to be represented by this bitch, then that is all I will ever need to know about that back-water, knuckle-dragging, cesspool of a town. The last thing I have to say to this contemptible piece of shit, is Karma is a nasty bitch and I cannot wait until she comes back to bite you in the ass. To the victims who so bravely shared their stories with Krakauer, my sincerest apologies for what you were put through. I bow to you in awe for your courage, grit and fortitude to stay the course. I wish grace and peace for you and the healing you so rightly deserve. To Krakauer, bravo fine man! You have again shown that you are a writer of integrity and fearlessness. The truth always comes out and I am honored to be able to read the same from your pen. To everyone...this is a MUST READ book - if you are a woman, if you have a daughter, a sister, an aunt, a mother- you must read this book and raise your voice in collective outrage over the treatment of our fellow sisters. Godspeed."}, {"userName": "Eve", "userReviewDate": "Jan 15, 2016", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "“Rape is the most unreported serious crime in the nation.”Wow, the author’s note mentioned that some portions of this book would be hard to read, and I did find that to be the case. Krakauer takes the high rate of reported sexual assaults in college towns, and hones in on the small college town of Missoula, Montana. Between 2010 and 2012, he introduces us to half a dozen cases of rape and sexual assault. Some made national headlines, as several members of the college football team were implicated. To the victims’ surprise, the allegations divide the town and many of the town folk take sides with the accused.Before any of the cases even make it to sentencing or trial, the victims are treated as perpetrators and/or culpable for their attacks by the police department. The county attorney refuses to prosecute most of the cases for fear of losing, to add insult to injury. The few victims that get that far, have their characters dissected and discredited in court. Jordan Johnson, one of the accused (also quarterback on the football team), and his defense lawyers made my stomach hurt. Such stupidity. I’m glad Krakauer wrote this controversial book; the victims finally got their side of the story across. It’s so sad that every year brings a greater decline in common decency in society. A good, but emotionally charged read. Highly recommended."}, {"userName": "Esil", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/3643764-esil", "userReview": "In Toronto, we are currently being inundated with news of the trial of Jian Ghomeshi. He was a radio personality on Canada's public radio who was dismissed last year after stories surfaced about assaults involving many women. From the get go, he claimed that he was into rough sex and that the women had consented. Ultimately, charges were laid in relation to assaults on three women, and the trial has just finished this week. Every day for the past two weeks, we have been bombarded with information about attacks on the complainants' credibility -- endless focus in cross-examination on their post alleged assault contact with Ghomeshi. While the trial was going on, I listened to the audio version of Missoula, in which Jon Krakauer focuses on a number sexual assault cases in Missoula, Montana. In combination, this made for a pretty bleak picture of the challenges involved in seeking convictions in cases of non stranger sexual assault. Having said that, Krakauer does an excellent job. He portrays the women with compassion. He provides helpful social science information that dispel a lot of myths and give a lot of context to the reactions of victims. But in the end, he paints a discouraging picture for any women wanting to pursue criminal charges. Much like the conduct of the Ghomeshi trial would be very discouraging -- even if he is ultimately found guilty.A note to potential readers: There are graphic descriptions of the assaults, but they are not extensive and they are limited to descriptions in fairly clinical terms. What makes this book difficult and emotionally wrenching is the aftermath for victims. But this is an important issue and Krakauer's book is an important contribution to the topic."}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Jun 13, 2016", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "If I were to be asked what is my most inconsistent position, my greatest double-standard, the dissonance which keeps cognitively challenging me, it would be my stance on prison and sexual assault. First off, I am horrified by our modern day equivalent to slavery, sympathize deeply with inmates (especially, but not limited to, nonviolent inmates), and wish we had a better way. A better mental health care system, vastly expanded social services, educational and vocational programs for those who get caught up in the legal grind, proper healthcare, dramatically reduced sentences, no jail time for drugs or solicitation or any other victimless crime, reintegration efforts on a massive scale, etc. Voting rights, ffs. Life sentences destroy hope, which destroys the person. The death penalty is uncivilized, revolting, and should have been globally obliterated centuries ago. I feel sheer revulsion for the fact that sexual assault in prisons has been accepted-not-accepted as some kind of just punishment, this apparently horrifyingly under-prevented tragedy which keeps on keeping on as a product of willful disregard at best. I don't want anyone to be sexually assaulted, not even sexual predators.At the same time, when I hear about things like the Stanford case, my unmediated response is \"Lock that monster up forever. Swallow the key and shit it out in the deepest hole you can find.\" Now, I still don't want him to be violated (because violation in that way is dehumanizing and can be worse than just murdering someone in certain cases), but I also don't want him just pouncing around with his sense of machismo entitlement, ruining more beautiful people's lives. Basically, the issue seems one of ideals vs. current realities. Our problematic polarities of masculinity and femininity have created a predator/prey dynamic which falls outside the realm of the reform that is within our grasp at this present moment. When a person goes on a serial killing spree, it is easy enough to say \"That person is crazy, that person needs help.\" Of course, that is also the product of rampant masculinity, but in conjunction with a very clear mental impairment. When a pack of football-playing wolves go hunting women like sport, drugging and raping them like the pieces of excrement in this book do just for a bit of fun on the weekend, for notches, for bro-points, it is something else entirely. It is a societal wound, a bigger thing than one insanity. It doesn't feel like something you can remedy case-by-case, because these fuckers are the Hydra. But I am also just rationalizing my own inconsistencies.I guess I just feel like, until we as a culture decide to move forward with progressive approaches to crime-prevention and gender equality, of teaching our society that no one is of greater or lesser value than the next one, the only thing we have to possibly prevent spoiled shitbags from stalking the sea of young ladies like a pack of piranhas is the deterrent of incarceration. Or at the very least, we could treat all criminals in the same shitty way, even if they happen to be rich caucasian athletes. Please don't let them get raped in prison, though. Rape sucks. That was kind of the point."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This is not an easy read. I read it slowly, partly because of the difficulty of the content, partly because I read it in pockets of free time at work. In the conclusion to Missoula, Jon Krakauer writes:\"...I was angry with myself for being so uninformed... I resolved to learn what I could about [rape.] I did a lot of reading, and sought out rape survivors who were willing to share their stories. Writing this book was an outgrowth of that quest. As the scope of my research expanded, I was stunned to discover that many of my acquaintances, and even several women in my own family, had been sexually assaulted by men they trusted. The more I listened to these women's accounts, the more disturbed I became. I'd had no idea that rape was so prevalent, or could cause such deep and intractable pain. My ignorance was inexcusable, and it made me ashamed.\"To which I am trying to hold back a *facepalm.* At least he stopped, at least he listened, at least he learned. And then focused in on the college town of Missoula, MT, because of the attention it received in the early 2010s for several rape cases. Early on in the book, Krakauer demonstrates that while the media afforded this specific location with a lot of attention, adding urgency in dealing with the cases (some of the time), the statistics in Missoula are not in any higher than anywhere else in the United States. Sexual assault, or \"sexual intercourse without consent\" as it is defined in Montana, is prevalent, and often unreported. \"Only between 5 percent and 20 percent of forcible rapes in the United States are reported tot he police; a paltry 0.4 percent to 5.4 percent of rapes are ever prosecuted; and just 0.2 percent to 2.8 percent of forcible rapes culminate in a conviction that includes any time in jail for the assailant. Here's another way to think about these numbers: When an individual is raped in this country, more than 90 percent of the time the rapist gets away with the crime.\"Unfortunately a look at the cases Krakauer focuses on demonstrates on why so many people do not report. Many people in the system blame victims for rape in ways victims of other crimes would never be questioned. Professionals from police to university administrators to the DA seemed to buy into the rhetoric of false claims and refusing to see it as a problem. Krakauer points to the flaws in these particular cases, but also to the pain and trauma experienced by the people who report, are exposed in the media, are forced to relive their experiences in testimony, and still may not see justice.Krakauer also attempts to untangle stereotypes about rape, particularly those surrounding false claims, and how frequently a person is raped by someone they know and trust (and what that does to your psyche) compared to \"stranger\" rape. Because of my role on campus, when I was in the middle of reading this book I attended a workshop led by David Lisak, and returned to the next chapter to find him as an expert witness on trauma and sexual assault in at least one of these cases (elsewhere in the book he is quoted on his research into serial rapists, numbers I know from his presentation, which I hope I will remember to add to this review when I have my notes in front of me.) From the title, I was expecting more of this book to be about Title IX and dealing with sexual assault on college campuses, but it is really about how the criminal justice system handles these kinds of crimes. I suspect this is because it is easier to gain access to criminal proceedings than academic disciplinary hearings. He does refer to academic hearings, particularly in how the requirements for conviction differ from being found \"responsible\" at an institution."}, {"userName": "Whitney Atkinson", "userReviewDate": "Nov 21, 2016", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "3.5 starsThis would have been 4 stars but it got very dry near the end. I loved how informative this is and for the most part is was very impactful and dark and an important read, but the legal process took up a huge chunk of this book and although I know it's important to understand how the justice system works in order to perceive its corruption, I had to skim some of those parts. However, I thought the women's stories were very brave and I hope this book doesn't scare people away from reporting rape because this was infuriating and it made me want to march to Missoula to protest a few of the people there who repeatedly and vehemently supported the rapists."}, {"userName": "Carol", "userReviewDate": "Apr 21, 2015", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "What an excruciating eye-opener! If you do not trust authorities now, reading this true account of the numerous unreported crimes and sexual assaults on a Missoula, Montana college campus will not improve your confidence.The statistics are baffling and the procedures deplorable not only for the University of Montana, but the Missoula Police Department and Missoula County Attorney's Office as well who all failed to do their jobs. It is a shame that politics and football games became the greater issue.Although sometimes repetitive, a very informative read!"}, {"userName": "LeeAnne", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/4058534-leeanne", "userReview": "Just saw this: Breaking News BAYLOR University lawsuit alleges during a 4 year period, 31 football players committed:* 52 acts of rape* 5 gang rapes* 2 or more gang rapes by 10 or more players at one timeread more here: http://www.dallasnews.com/news/baylor...MISSOULA: RAPE AND THE JUSTICE SYSTEM IN A COLLEGE TOWNBy John Krakauer***********FIRST: A \"MUST READ\" ARTICLE*********** Vanderbilt University football players video recorded themselves gang raping an unconscious female student: http://www.dailymail.co.uk/news/artic...Some quick stats and info on rape:* 1 in 4 women in college today are victims of rape * 90% of all college rapes are acquaintance rape, not stranger rape.* 96% of rapes are never reported * 97% of all rapists walk free, facing no consequences for the violent felony they committed.* The strongest predictor of future behavior is past behavior. Most rapists will and do rape again, and again, and again - until caught and stopped. * A small number of repeat offenders are responsible for a very large number of rapes in our communities. * Police and prosecutors are overly-preoccupied with “weeding out false rape accusations” so they place the burden of proof on the victim and treat the rapist as the victim.* False rape accusations are extremely rare (2%) The court proceedings portion of this book left me reeling in disgust and shock. Most notable, a repulsive, vile woman named Kristen Pabst. Kristen Pabst was a very big contributor to the Missoula rape epidemic. Kristen Pabst is a criminal who should be in prison. Kirsten Pabst (above) was a prosecutor for the D.A. in Missoula. She has a very long track record of going above and beyond to keep rapists out of jail in the Missoula community so they are free to rape again and again. Kirsten Pabst's job was to decide which rape cases would and would not get prosecuted in court. Out of 92 reported rapes in the tiny college town of Missoula, not one single rape case was ever prosecuted! 92 reported rapes and not one was prosecuted! WTF!?Then.... ONE rape case is finally brought to trial, no, not by Kristen Pabst, but by the University of Montana. So, guess what Kristen Pabst does? She quits her post as a prosecutor and she volunteers to testify FOR the rapist! That rapist just happens to be Jordan Johnson, THE star quarter-back on the University of Montana football team. Kirsten Pabst volunteered to testify and defend a rapist in court despite the following:1. Kristen Pabst never bothered to even speak to the rape victim. This act violates a Montana law requiring prosecutors to consult with rape victims. This was completely ignored though. 2. The victim fired a text to her roommate within 5 minutes of the rape that read, “Omg, I think I might have just gotten raped. he kept pushing and pushing and I said no but he wouldn’t listen…I just wanna cry…omg what do I do!”3. The victim's roommate was an eyewitness to the victim's sobbing and breaking down in emotional trauma4. The victim had visible bruises and other injuries to her arms and head.5. Kristen Pabst's testimony portrayed this victim as a silly, vengeful bimbo who was desperate for attention and fame. (Attention and fame... for being raped??? Seriously?)Guess what happened? Kristen Pabst won her case! Kristen Pabsts favorite rapist was acquitted! After Pabst helped set a rapist free to rape again and again and again, she immediately gave up being a defense attorney and was welcomed back with open arms into the District Attorney's office. WHAT TO DO IF YOU ARE EVER RAPED OR SEXUALLY ASSAULTED?1. Get to a safe place as soon as possible.2. Do NOT let being drunk or stoned stop you from reporting the sexual assault. Rape is a felony and a crime, no matter what your state of mind was at the moment of the crime. 3. You may consent to sex and then withdraw that consent. No still means no, at ANY point and time. If you were too impaired by alcohol or drugs, consent cannot be given. It's never OK for someone to take advantage of you because you are impaired by drugs or alcohol. 2. Do NOT wash or shower! Do NOT wash or dispose of any clothing! Please!!! No matter how much you want to, do NOT do it. There is probably hair, blood or semen on your body and clothes that must be used as evidence. 3. Go straight to a hospital, health centre or an emergency doctor.4. A doctor should examine every part of your body to find and collect samples hair, blood or semen. This is called the forensic examination and it is an important part of the police investigation to gather medical evidence of the crime.5. After receiving medical attention, report the sexual assault to the police station nearest to where the rape took place. Do this as soon as you can (no less than 3 days) so that there is a stronger chance of finding proof of the attack and of catching the rapist. 6. You can still report a rape within 20 years after it happened.7. Call a friend or family member to accompany you and support you when go to the police to make a report. 8. Keep the name and contact number of the police officer in charge of your case. Get your police case number and write it down. You are also entitled to a copy of the statement you make to the police.9. If you fear retribution or intimidation from the rapist(s) DO tell the police, so they are aware of this. Request that the rapist(s) NOT be released on bail.10. Ask for pamphlets or booklets on rape. Get the number of a local counselling service to give you further support and advice. For your own safety, you must receive the following treatment from a doctor:* The Morning After Pill (MAP) within 72 hours to prevent pregnancy* An HIV test and antiretroviral treatment within 72 hours to prevent HIV infection. You will have to go back for follow-up visits to the doctor, for further HIV tests, and will have to take tablets every day for 28 days to do this effectively. * These treatments are not effective after 72 hours but other treatments may be available to you if you do fall pregnant or contract an STI.Remember, you have choices! You can exercise your rights, even though during the rape your rights were taken away from you. Take back your power to choose! There are people who will support you in doing that."}, {"userName": "Debbie \"DJ\"", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/12620745-debbie-dj", "userReview": "Huh? Oh Goodreads, I did write a review for this. Why are you in my currently reading? Well, from what I remember now, I really loved this one. This book follows three different cases in Missoula, all involving the city's god-like football team, and the women they raped. What I liked most was the focus on how society often looks at the woman's actions. Was she drunk, did she actually say no? Oh, and yes, it is rape if a person is unconscious. I also liked how the woman's actions after a rape are scrutinized. One gave her rapist a ride home. I learned through these pages that trauma causes what may seem like bizarre actions, but are very typical. I think this book will help a lot of rape victims, as the shame felt after an assault (especially if drinking) is not the victim's. It belongs to the rapist. I cannot remember the statistics now, but most rapes are committed by someone who is known and often trusted. Also, the amount of rapes actually reported is minuscule. I do not mean to leave men out here, as obviously men are raped as well. This book just happens to focus on three women in college settings.I know my earlier review posted, but is no where to be found, so please forgive the double review here. One last thing about this book. It is very detailed, mostly in all the police and university procedures. It was news to me that a prosecutor decides if the case has merit. Many do report, but police do not prosecute. A must read on this one."}, {"userName": "Perry", "userReviewDate": "Apr 23, 2015", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "Alarming, Infuriating and Disheartening (especially for father of two 17-year-old daughters heading to college next fall)[Oct. 19, 2016]University of Montana in MissoulaMontana Grizzlies college football team, Member, NCAA Division I, Football Championship SubdivisionMISSOULA is Jon Krakauer's thorough and enlightening examination of the paramount, yet largely publicly opaque, problem of rape on college campuses nationwide (mainly by acquaintances). JK takes a narrative look at the specifics (many times graphic) of several uncharged rape cases in Missoula, Montana, caused by the willful disregard by local law enforcement and public prosecutors of victims and their sexual assault allegations against male students (primarily athletes) at the University of Montana, who bungled and/or botched disciplinary actions against the accused.Convicted rapist: Grizzly running back Beau Donaldson pleaded guilty to rape in 2012 and was sentenced to 10 years in federal prisonThe first and last name of the public prosecutor, Kirsten Pabst, are now near \"fighting words\" to many feminists and rape victims' advocates. She dropped charge after charge after charge against probably a dozen male U of M students (again, mostly athletes) over a period of a few years. The overwhelming bias became so blatant, she would even refuse to interview some victims, \nnotwithstanding\n significant outside pressure subsequently brought to bear by the feds threatening and carrying out an investigation into civil rights violations by the University and the County. My blood started boiling toward the end of this book.Former Missoula County Attorney Kirsten Pabst called Jon Krakauer's allegations 'inaccurate, exaggerated, and unnecessarily personal'The worst part is that University of Montana is not an anomaly. I can only do so much to help protect my two teen daughters when they go off to college next fall. I worry."}, {"userName": "Snotchocheez", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "Motivated by a close friend's acquaintance rape, Jon Krakauer's decidedly victim-centric account of a string of rapes at the University of Montana at Missoula in the late 2000s through 2013 is a compelling, well-researched look at the factors that comprised this \"epidemic\". We learn that the rates of sexual assault and rape at U of Montana are not much different than other colleges and universities across the nation. As is the case nearly everywhere, so many victims opt not to report the crime that it's impossible to calculate exact statistics. The matter is compounded in Missoula County by a systematic refusal from the attorney's office to prosecute sexual assaults/rapes for a \"lack of evidence\". Also, because much of the economy in Missoula is driven by the successful Grizzly football team, and several of the rapes highlighted in Krakauer's account were perpetrated by players on the football team, there was a significant backlash against the accusers by the locals loyal to their heroes.In painstaking detail, Krakauer exposes a systematic failure of jurisprudence that, while tough to stomach, is impossible to ignore. Yeah, it's more than a little muckrakey, but there's plenty of lessons to be learned here that may aid in the way acquaintance rape is perceived and proactively addressed, not just in Montana but everywhere."}, {"userName": "Matthew", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "The scenarios discussed in this book were well researched. If you are looking for a book that gives an unbiased view of all sides of the rape issue, this is not it; this definitely focuses on the victim and the tendency of the law and society to side with the attacker (I am not giving my opinion as to whether that is good or bad, it just is so I thought I would mention it). For me, Krakauer has written some great books and some frustrating books. This leans toward the frustrating side mainly because of the repetition of facts throughout the book.I would only recommend this book to people who are into non-fiction where lots of facts, figures, and research are cited. I also warn that the details are rather graphic. With all that in mind, though, I did find it very interesting and eye opening on a subject that luckily has not really affected anyone close to me (that I am aware of)."}, {"userName": "Diane Yannick", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/1253673-diane-yannick", "userReview": "I was astounded that John Krakauer was capable of writing such a lousy book. I understand the need to put a national spotlight on acquaintance rape, the rape culture of colleges, the attitude of student athletes, and the unwillingness of many officials to hear women's voices. Krakauer reinforced statistics about how many rapists are never held accountable (90%) and how many women actually do lie about being raped (less than 10%). I realize that Missoula was used as a typical college and that he did not try to generalize but rather to zero in on specific cases during a 4 year period at the University of Montana. BUT this town, this topic and these people deserved a more unbiased story. He chose to reinforce many stereotypes-- predatory football players corrupt officials, and cheerleader type girls. Even when the victim wasn't quite sure she had been raped, Krakauer completely sided with her. Alcohol consumption was a huge contributing factor in the rapes yet not delved into at all. I found this book to be tedious and uninspired. None of the victims came to life in any meaningful way. The rapists were all painted with the same brush. Part of the problem for me is that the author relied heavily on monotonous, repetitive transcripts of the court hearings, which he quoted excessively. He spoke with the victims but was, with one exception, unable to interview the rapists. His answers are very evasive when asked whether he spoke with city officials or police. In one contentious interview, he admits to confirmation bias. NO kidding. This book was rushed to publication after the Rolling Stone magazine messed up their rape story and is in dire need of editing. One of his conclusions is about young women being vulnerable when \"negotiating the fraught transition from girlhood to womanhood\". Oh yuck. I have read every other book by Jon Krakauer and this is the first time I've been disappointed."}, {"userName": "Dawn", "userReviewDate": "Feb 14, 2015", "userURL": "http://www.goodreads.com/user/show/4848337-dawn", "userReview": "\"When an individual is raped in this country, more than 90 percent of the time the rapist gets away with the crime.\"Read this book.I read this book because Jon Krakauer. A good reason, but there are so many more reasons to read this book.On a personal note, this was an incredibly painful read for me. No book or movie or tv program has ever affected me this strongly. I always thought trigger warnings were pretty much bullshit. I don't anymore, as I sit here with this just-finished book on my lap, tearful, depressed, angry, nerves a-jangling and wondering if I'll be able to sleep tonight. But I am not sorry I read it.My notebook is full of pages and pages of passages and statistics and reactions to this book. And I could go on and on and on sharing them with you, but I'll keep it short(ish). You should read the book yourself.If you think women fabricate or exaggerate rape accusations for attention or because they regret their behavior, you need to read this book. If you think the law enforcement and court systems in our country give rape victims anything even close to a decent opportunity for justice, you need to read this book. If you think that you don't know or love anyone who has ever been a victim of rape or sexual assault by someone they know and trusted, you need to read this book - and then you need only to look around you. We are many and we are much closer than you think."}, {"userName": "Julie Ehlers", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/2120450-julie-ehlers", "userReview": "I attended Catholic school for grades 7 through 12, so I was just in time for “sex education” Catholic-style, which basically consists of letting you know that nothing is permitted: no masturbation, no sex outside of marriage, no gay sex (obviously), and, even within church-sanctioned heterosexual marriage, no birth control. Back then, the nuns and priests seemed to think it was a given that all the girls wanted to wait until marriage, and there was no acknowledgment that we might have any sexual desires of our own that we were dealing with. The boys, on the other hand, were assumed to be raging masses of hormones who would always want to be doing it. Our job, as girls, was to prevent them from having their way with our virtue. I distinctly remember Sister Marie Pauline saying to us girls, “You are going to have to be the one to put on the brakes and say ‘no.’ A boy can’t do that.” A boy CAN’T do that, she said. So in other words, even though we, as females, have no sexual desires to speak of, whatever happens, we are somehow responsible for the whole thing. That’s a pretty neat trick, getting us to believe that. Looking back, this was terrible preparation for having the healthy sex life that everyone (even Catholics) deserves, but it was great preparation for the actual world, where somehow women really ARE responsible for everything that happens. You see this in fundamentalist countries where women have to stay covered at all times because men allegedly can’t control themselves. And you see it in supposedly secular cultures, where what a woman is wearing, where she goes and what time it is when she goes there, what she drinks, what she says at any time, and whether she happens to fall asleep or pass out can all lead to her being responsible for her own sexual assault. This is another message women get at a young age—we’ve all gotten long lists of things we should and shouldn’t do if we want to avoid being raped: Don’t talk to people you don’t know. Don’t get drunk around other people, even people you know. Don’t leave your drink unattended. Don’t walk alone late at night. Don’t dress provocatively. Carry a whistle. Carry pepper spray. Carry mace. Seem confident. Don’t seem distracted. Lace your car keys between your fingers to form a makeshift brass knuckle (wonder how well that would work?). Meanwhile, for a long time there seemed to be no corresponding lessons for young men regarding seeing women as human beings and respecting their boundaries. Even now, when some colleges give date-rape workshops at freshman orientation, it’s safe to say not everyone takes it as seriously as they should.Of course, if you’re a woman, you can follow every guideline perfectly and still get raped, and when you do, there are going to be people who blame you. Many people seem unwilling to believe that a man (despite the uncontrollable sexual desires we all seem to agree they have) would actually rape a woman, but many of us apparently find it extremely easy to believe not only that a woman brought it on herself, but also that, even if the woman is a decent, responsible human being they’ve known for years, she would have no problem falsely accusing someone of a serious crime and going through the entire resulting legal ordeal. As a culture, we continue to put all the responsibility on the woman. Indeed, one of the most frustrating things about our rape culture is that women are not united about this the way you’d think we would be. There are clearly plenty of women out there who feel that if they, personally, have never been date-raped, the women who say they have been must have done something, been irresponsible in some way, that allowed it to happen. Combine this with the fact that few men seem willing to call out egregious behavior in other men, and it’s no wonder this issue never goes away.All of this has been written about over and over and over again, in many, many books and articles—but never by Jon Krakauer. One of Jon Krakauer’s many gifts as a writer and reporter is to make you feel what he wants you to feel. When I read Into the Wild, I became so upset by the idea of someone being completely alone and knowing they were going to die that I had to hide the book when I finished it. After I finished Into Thin Air, I vividly recall feeling a bizarre, inexplicable anxiety and having to talk myself back into believing everything was OK. I’ve read several books about rape, many of which contain stories just as upsetting as the ones detailed here, but I don’t think any of them brought me to tears the way this one did. If anyone can change the way we, as a culture, feel about rape and about women’s sexuality, it’s probably Jon Krakauer, so maybe this book is some kind of hopeful sign. I wonder why I still feel so pessimistic."}, {"userName": "Char", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/6581119-char", "userReview": "I listened to this book on Audible Audio. I found it to be disturbing and upsetting. At times this was a difficult book to listen to. What these women went through, and were  put through ,was disgusting. No wonder so many rapes are not reported, most especially in towns or schools where sports are all they have and the accused are star athletes. Being examined for a rape kit is like being raped all over again. To have the families of the accused and the accused themselves badmouthing rape victims and rallying the support of the community AGAINST the victims was the worst part of this book for me. Luckily, one of the rape victims actually had the rapist on tape, admitting what he had done. If not for that, she would have ended up like the other main victim in this story-badmouthed and avoided socially, while her rapist walked free.Contrary to popular opinion, not all rape claims are lies. Not every woman lies so that her boyfriend won't find out she cheated. Not every woman lies to attract attention and have some drama in her life. (I cannot even believe that some people argue that, knowing what these women have to go through.) This book is full of statistics and at times, the reading is a little dry. I felt that the second trial portions went on a bit too long and for that, I deducted one star. Other than that, I think this book should be mandatory reading for all women, but most especially for women of college age. Protect yourself, ladies, it's a harsh world out there."}], "description": "11 hours, 51 minutesFrom bestselling author Jon Krakauer, a stark, powerful, meticulously reported narrative about a series of sexual assaults at the University of Montana ­— stories that illuminate the human drama behind the national plague of campus rape Missoula, Montana, is a typical college town, with a highly regarded state university, bucolic surroundings, a lively social scene, and an excellent football team — the Grizzlies — with a rabid fan base.  The Department of Justice investigated 350 sexual assaults reported to the Missoula police between January 2008 and May 2012. Few of these assaults were properly handled by either the university or local authorities. In this, Missoula is also typical.  A DOJ report released in December of 2014 estimates 110,000 women between the ages of eighteen and twenty-four are raped each year. Krakauer’s devastating narrative of what happened in Missoula makes clear why rape is so prevalent on American campuses, and why rape victims are so reluctant to report assault.  Acquaintance rape is a crime like no other. Unlike burglary or embezzlement or any other felony, the victim often comes under more suspicion than the alleged perpetrator. This is especially true if the victim is sexually active; if she had been drinking prior to the assault — and if the man she accuses plays on a popular sports team. The vanishingly small but highly publicized incidents of false accusations are often used to dismiss her claims in the press. If the case goes to trial, the woman’s entire personal life becomes fair game for defense attorneys.  This brutal reality goes a long way towards explaining why acquaintance rape is the most underreported crime in America. In addition to physical trauma, its victims often suffer devastating psychological damage that leads to feelings of shame, emotional paralysis and stigmatization. PTSD rates for rape victims are estimated to be 50%, higher than soldiers returning from war. In Missoula, Krakauer chronicles the searing experiences of several women in Missoula — the nights when they were raped; their fear and self-doubt in the aftermath; the way they were treated by the police, prosecutors, defense attorneys; the public vilification and private anguish; their bravery in pushing forward and what it cost them. Some of them went to the police. Some declined to go to the police, or to press charges, but sought redress from the university, which has its own, non-criminal judicial process when a student is accused of rape. In two cases the police agreed to press charges and the district attorney agreed to prosecute. One case led to a conviction; one to an acquittal. Those women courageous enough to press charges or to speak publicly about their experiences were attacked in the media, on Grizzly football fan sites, and/or to their faces. The university expelled three of the accused rapists, but one was reinstated by state officials in a secret proceeding. One district attorney testified for an alleged rapist at his university hearing. She later left the prosecutor’s office and successfully defended the Grizzlies’ star quarterback in his rape trial. The horror of being raped, in each woman’s case, was magnified by the mechanics of the justice system and the reaction of the community. Krakauer’s dispassionate, carefully documented account of what these women endured cuts through the abstract ideological debate about campus rape. College-age women are not raped because they are promiscuous, or drunk, or send mixed signals, or feel guilty about casual sex, or seek attention. They are the victims of a terrible crime and deserving of compassion from society and fairness from a justice system that is clearly broken.", "title": "Missoula: Rape and the Justice System in a College Town", "url": "https://www.goodreads.com/book/show/24870085.Missoula_Rape_and_the_Justice_System_in_a_College_Town", "average": 4.07, "cover": "https://images.gr-assets.com/books/1423514302l/24870085.jpg", "reviews": 4519, "authors": [{"url": "https://www.goodreads.com/author/show/1235.Jon_Krakauer", "name": "Jon Krakauer"}, {"url": "https://www.goodreads.com/author/show/4462217.Mozhan_Marno", "name": "Mozhan Marno"}, {"url": "https://www.goodreads.com/author/show/44554.Scott_Brick", "name": "Scott Brick"}], "type": ["Nonfiction", "Crime", "Audiobook", "Feminism", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/24870085-missoula", "http://www.goodreads.com/book/show/24911006-missoula", "http://www.goodreads.com/book/show/24984508-missoula", "http://www.goodreads.com/book/show/25852817-missoula", "http://www.goodreads.com/book/show/25828220-missoula", "http://www.goodreads.com/book/show/25430260-missoula", "http://www.goodreads.com/book/show/1845.Into_the_Wild", "http://www.goodreads.com/book/show/1898.Into_Thin_Air", "http://www.goodreads.com/book/show/10847.Under_the_Banner_of_Heaven", "http://www.goodreads.com/book/show/2936415-where-men-win-glory", "http://www.goodreads.com/book/show/1897.Eiger_Dreams", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}