{"ratings": 1925, "userreviews": [{"userName": "Carol", "userReviewDate": "Jun 09, 2017", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "E-galley generously provided by Houghton Mifflin Harcourt, Edelweiss and Author, Amy Stewart for an honest review. To be published September 5, 2017.The Kopp Sisters are back in this new historically based romp. There’s just enough spunk to rank this series above a cozy but vanilla enough for readers seeking a gentler read. Constance Kopp, Deputy Sheriff, has her hands full this outing with her female prisoners accused of dubious crimes by a relentless prosecutor resulting in their lockup at the Hackensack jail. As matron of her charges, Constance finds unique ways to bring about prison reform and justice. Her personal challenges involve her sister Fleurette’s desire to join a traveling theater group of China Dolls, and Norma’s overbearing involvement in both her sister’s lives. Miss Kopp’s Midnight Confessions can be enjoyed on its own but don’t miss the prior two, as they are also delightfully outstanding. The Kopp Sisters Series is smart, well researched fiction with characters that have earned their place in my reading heart. Regarding the actual Kopp Sisters, Amy Stewart has included Historical Notes and Sources for fact checking of history and events."}, {"userName": "Linda", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "Irons bars. Jingling jailhouse keys. A shiny badge and a hidden gun.Constance was not a woman who was troubled by the idea of shoving a man.......Have mercy! The Kopp Sisters are back in the third book of this rough and tumble series by Amy Stewart. Constance, a newly appointed sheriff's deputy in Hackensack, New Jersey, is like the snap and pop that you get out of a freshly chewed chunk of bubblegum. Quick and clever, she knows only too well the daily barricades placed in front of women as the tides flow closer to World War I. Constance's duty involves being the matron of the female section of the jail. And in this era women have such sculpted crimes of their own: waywardness, co-habitating without marriage, suggestiveness, and refusing to stay under her parents' roof. The judge usually threw the book at her with a long stay in the confines of a reformatory with a soiled reputation and smudged records. And marriage in the future? As Tony Soprano would say: \"Forget about it!\"But Constance has her hands full with the likes of sixteen year old Minnie Davis. Minnie has slammed the door on her family home with a loud bang and taken to residing with Tony Leo who keeps a fake marriage license application in his pocket. It appears that tantalizing Tony will slip between the cracks and Minnie is looking at spending time in that afore-mentioned reform school.Constance is going to get in the middle of this cracklin' case for sure. But our lady deputy will have her hands full with a family matter sizzling like hotcakes on a stove. Ironically, youngest sister, Fleurette, with starry-eyed dreams of being on stage runs away with a traveling theater show. Both Constance and sister Norma are shocked. Norma will be hot on Fleurette's trail with Constance hiding her own 6 foot frame in confined phone booths in hotel lobbies. And what's to become of Fleurette?Amy Stewart has raised the stakes in this one with more humor, shady life styles of the time period, and multi-layered storylines. Stewart has based her story on the real-life Kopp sisters' characters while adding a few embellishments along the way. The author's notes at the end of the book are rich with interesting details. Although the ending was a tad abrupt, it leads the reader to believe that there's a wide open door with more to come in the lives of these sizzlin' sisters. And we'll certainly stay tuned for more Hackensack adventures.I received a copy of this book through NetGalley for an honest review. My thanks to Houghton Mifflin Harcourt and to Amy Stewart for the opportunity."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "I love this series for the strong female characters, particular Constance the lady cop (technically in this book she is the deputy sheriff) who is big and strong and smart and doesn't fit nicely into a phone booth or a trolley bench. You can enjoy the story by itself, but I think it is most remarkable knowing how much of this is based on historical fact. Amy Stewart has done her research, from the characters to the scenarios to the legal situation. Young women are thrown in jail because their moral characters are in question, when it is more that they have decided to leave their parents' home and are daring to work and live alone. But they don't have many rights or access to counsel. Constance Kopp has been assigned to work directly with the women in jail, and is able to help them and advocate for them. Then her youngest sister leaves without permission to pursue her career on the stage, and her sisters are confronted with their beliefs.I received a review copy of this from the publisher in exchange for an honest review. It lingered on my Kindle for a while and came out in the meantime, in early September 2017."}, {"userName": "Connie", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Set around 1916 with World War I looming, this historical novel has a strong theme of righting the injustices done to young women. Constance Kopp, a deputy sheriff, was in charge of the women in the Hackensack, New Jersey jail. Young women were arrested for waywardness when they left home without their parents' permission to seek jobs in the city. The women could not afford defense attorneys and faced a possible sentence to years in a reformatory. Constance stepped up to the plate, investigating the charges and the women's home situations, and fighting for their rights.Her younger sister, Fleurette, also reached age 18 and left the Kopp's home to work in a vaudeville show. Constance's emotions are torn--she's worried about her safety, but knows it's time to let Fleurette follow her dreams.Constance has been the subject of newspaper stories since it's unusual for a woman to do police work. Letters with proposals of marriage come from all over the country, adding humor to the book, since the men are looking for a tough workhorse rather than promising love and romance.The Kopp sisters and many of the other characters were real people who lived in the early 20th Century. The author's note in back gives the reader some interesting background history."}, {"userName": "Cindy Burnett", "userReviewDate": "Aug 26, 2017", "userURL": "http://www.goodreads.com/user/show/2445617-cindy-burnett", "userReview": "I LOVED this book! I just cannot say enough good things about it. The characters are simply outstanding – many of them based on real people – and so much fun to read about. Constance is my favorite, and Amy Stewart has graced her with so many fabulous and often cleverly hilarious lines. In Miss Kopp’s Midnight Confessions, the author has created two plot lines that dovetail together perfectly. In her role as a female deputy sheriff in 1916, Constance is grappling with young independent women being charged with waywardness and moral depravity simply because their parents do not want them leaving home. Sadly, the penalty for such charges was quite steep with many of these poor souls ending up sentenced to years in a reformatory where conditions were brutal and even at times sterilized (how horrific is that?!?). Constance works to protect these women and find solutions that will benefit the women charged while pacifying their parents. Meanwhile, Constance’s youngest sister Fleurette is eager to set out on her own and tests Constance’s beliefs that young women should be allowed to leave home and pursue their own dreams. The conflict between the two story lines is set up perfectly and plays out authentically and at times comically.One of my favorite subject matters is the U.S. entertainment industry in the 1910’s through the 1940’s. I was delighted that early vaudeville was included in Miss Kopp’s Midnight Confessions and loved learning about May Ward. I spent considerable time looking up pictures of Ward and her “girls” and really enjoyed that portion of the story. I also loved the references to Edith Wharton, Birth of a Nation, and the Callot Soeurs and the subsequent inclusion of the true life details in the Author’s Note. Stewart has clearly researched both the time period and Constance Kopp’s life very extensively, and the result is quite an outstanding book.Miss Kopp’s Midnight Confessions is a must-read for any mystery and/or historical fiction lover. I didn’t read the first one, I liked the second one, and this third one is absolutely fantastic. Thanks to Houghton Mifflin Harcourt for the ARC in exchange for an honest review."}, {"userName": "Megan", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/4824487-megan", "userReview": "The Kopp sisters are back in Stewart's third book and it was delightful ! Now that Constance has finally earned her deputy sheriffs badge, she is ready to make some \"kick ass history\" and that she does ! I really wouldn't mind if this series went on & on & on, it's that enjoyable!! 4.5 Stars"}, {"userName": "Rachel", "userReviewDate": "Jul 18, 2017", "userURL": "http://www.goodreads.com/user/show/3965659-rachel", "userReview": "I'm starting to wonder if Girl Waits with Gun was a one-off stroke of brilliance. I loved the first novel in this historical fiction series based on the life of one of the first female deputy sheriffs in the U.S., but its sequel, Lady Cop Makes Trouble, didn't quite live up to the high bar Stewart had set for herself. I had higher hopes for Miss Kopp's Midnight Confessions at first, but I think I ultimately wanted to like this more than I did.The premise of this novel is the most interesting to me of the three. Set in 1916, just before the U.S. entered World War I, women are having to take up the slack of men who are leaving to go abroad - taking factory positions and leaving the house more often to aid war efforts. This was a difficult pill for some of these young women's parents to swallow, and many of them reported their daughters to the police for wayward behavior, which is an interesting and frustrating piece of history that I ended up learning a lot about. I just wish the narrative had been on the same level as Stewart's impeccable research.While I was initially prepared to praise this novel for having more narrative cohesion than its two predecessors (the cases that Constance is investigating end up dovetailing with her personal life), I thought the execution was somewhat unwieldy. One of the characters does something that I felt was solely for the sake of furthering the plot, and really incongruous with her characterization. And while I enjoyed spending more time with Norma and Fleurette than we had in Lady Cop Makes Trouble, the relationship between the three sisters - easily the best thing about the first novel - always felt rather secondary to whatever else was going on.I loved the new characters who were introduced, Edna especially, and I enjoyed reading about her time involving herself in the war effort. But I still thought that there were too many subplots here, and the way it all came together in the end was a little ham-fisted.It's more of a 3.5 than a 3, and certainly an improvement on Lady Cop Makes Trouble. But I'm still waiting for Stewart to really tap into the magic that she was able to achieve with Girl Waits with Gun. I'm undecided if I'll continue this series if Stewart writes more. On the one hand, I'm rather invested in Constance Kopp at this point, but on the other, I have a nagging feeling that this series peaked with its first novel.Thank you to Netgalley, Houghton Mifflin, and Amy Stewart for the advanced copy provided in exchange for an honest review."}, {"userName": "Pamela", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "Miss Kopp's Midnight Confessions: Absolutely as fabulous as the first two books in the Kopp Sisters' series. SIMPLY MARVELOUS! I loved it! Cover to cover, everything in between. Amy Stewart, I tip my hat to you! Not only are your historical crime procedurals a delight to read, they are respectably written with genteel decorum, evenly paced, sociologically interesting, era/historical enlightening, feminine empowering and celebratory. Plus, they are never gimmicky or sensationalized. And they're oh so compulsively enthralling. This installment centered around the Mann act - also commonly referred to as the 'White Slave' law. Basically, a crime bill that sought to 'protect' women from human trafficking, prostitution, and participation in immoral acts with or without their consent. The good, the bad, the misused and abused elements surrounding this bill. In part: parents could have their daughters arrested and locked in reformatories or asylums simply for leaving home and/or becoming employed outside the home without their approval. Oh, but not on Constance Kopp's watch, if she can help it. She's one gentle giant - a force to be reckoned with when it comes to the jailed girls under her jurisdiction. She's bound and determined to shake up the apple cart of the Mann Acts uses and abuses to set a few wrongfully interned jail birds free. And here's where I myself must crow. Earlier this month I won a Kopp in a Box prize pack from Knopf and author Amy Stewart for the Lemon Grove Library Book Club! It included: a copy of the first in series: Girl Waits with Gun, temporary tattoos, period paper dolls of the Kopp sisters, coloring posters w/pencils, signed book covers AND.....HERE'S THE BEST PART: Amy Stewart will Skype with us during our December book club meeting. SUPER EXCITING! If you enjoy historical fiction and crime procedurals featuring strong women characters - REAL WOMEN OF DISTINCTION from the pages of history - get on board with this series. The book titles are actual headlines from Ms. Kopp's days in law enforcement. Highly recommended, respectable, enlightening, enthralling great reading. FIVE ***** Women of Distinction, Historical Fiction, Crime Procedurals - of EXCELLENCE!!! ***** STARS"}, {"userName": "Stephanie Anze", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/27117957-stephanie-anze", "userReview": "\"Kopp is always a cop, no matter where she goes and what she does. Isn't that right, Sheriff?\"Constance Kopp has just been officially named the first female Sheriff's Deputy of Hackensack, New Jersey. Having been working alongside Sheriff Heath since her case against Henry Kaufman, this is quite a novelty. Among her main duties is to be matron of the female sector of the jail. Deputy Kopp is troubled to constantly receive girls and women on charges of waywardness and moral depravity. Roughly translated: they left home and their parents/guardians do not approve or they are paying for a mistake that their male counterparts are easily absolved of. Without intending to, Deputy Kopp becomes an advocate for these women. The real test, however, is at home. Her youngest sister Fleurette has dreams of being a performer and no one, not even her Deputy sister, is going to stop her.Having read the previous two books, I can confidently say I love this series and even more so because they are based on real events and people. Constance Kopp, despite her hard work and achievements, still does not get the recognition she deserves and all because she is a woman. Sheriff Heath is one the few that publicly endorses her, hence why he names her deputy. Constance is aware that women get a subpar deal because she manages the female sector of the jail and many, do not deserve to be there. While this book was not as dynamic as the other two, the focus sure is one that caught my eye. Deputy Kopp has inmates reported by parents that simply disliked the fact that they left home to work and be independent. There was little to no represention for these women. If convicted (and they were more often than not) they were sent to a home for \"troubled\" girls. Morality laws were the rage at the time. Constance became their voice and did manage to come to aid these girls. Her believes, though, were to be challeged by none other than her sister Fleurette. A vivacious 18-year-old that has aspirations of traveling with the theater, she was the one that really was going to test how much Contance believed in what she preached.I like that this installment included more of the other two sisters, Norma and Fleurette. No Kopp sister conformed to society and each has such a distinct voice and strong personality. Norma, in particular, is described as heavily opinionated and stubborn. While Fleurette was more impulsive and realxed. I would not want to be caught on Norma's badside, that all I will say about that. The narrative had humour and levity as well as a more thoughtful prose thanks to the interactions between the sisters. I wanted to learn more about the Kopp sisters but liitle seems to be available. I did learn that Constance lost her job when Sheriff Heath stopped being sheriff and there seems to be no further information of what she did after that. Regardless, her contributions to the law and and women are something to be admired. And even if her career was short-lived, it was incredible. I am glad that Stewart brought her story to the forefront, where it definitely deserves to be."}, {"userName": "Jackie", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/13492013-jackie", "userReview": "Awesome! I adored book 1, gobbled book 2, but book 3 is quite the standout. I love that the sisters are more developed and Stewart's eye for historical detail. If you've only ever read her nonfiction (if you haven't, you should), you know the author is a wonderful storyteller, fiction gives her an even wider stage. This novel is absolutely delightful.*Disclosure: I work for HMH, but I do not review HMH titles unless I feel extremely strongly about them as a reader. They have to be something special if I'm going to review them. This is one of those very special ones."}, {"userName": "DeAnn", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/5299664-deann", "userReview": "This is such a fun series based on true characters. It's quite a history lesson on how women used to get arrested for \"morality\" - leaving home to find work and mom wants her daughter back at home to help with housework -- or living together before marriage. The way women are treated is marginally better today! I love to read the exploits of Constance Kopp and the end is so great with Amy Stewart's historical notes. This is just the book/series to read when you need a break from heavy/dark fiction."}, {"userName": "Susan Johnson", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/5172713-susan-johnson", "userReview": "I am enjoying these Kopp Sisters books more and more. This is the third in the series and based on the real life of Constance Kopp, the first deputy female sheriff in New Jersey. This book is set in 1916 and women do not have the right to vote yet. It reminds us that we have not even been able to vote for a hundred years. This story involves the local authorities locking up young women in reformatories if they decide they don't want to live at home any more (even after 18) and hand off every cent of their paychecks to their families. They often work at low paying and back breaking factories for less than a man because as one girl was told, \"You don't want to take away money from a man who is supporting a family, do you?\" Of course this is a struggle that continues to this day. Constance decided this is horrible and starts helping young women who have left their homes to make a life for themselves. Her sister, Norma, is quite an eccentric and is working on a project to get the White House to use carrier pigeons to carry messages. Fleurette, Constance's supposed sister but actually is her daughter, leaves home to join a dance troupe and makes Constance practice what she preaches. I love this series and a look at the life women lived 100 years ago and how little or far we've come. I especially like it because it's based on a real person and everything sounds so authentic and real. This was a joy to read. Thanks to Net Galley for a copy of this book."}, {"userName": "Karyl", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/1462387-karyl", "userReview": "This was another excellent installment in the Constance Kopp series! I really enjoyed that Stewart moved a little outside the Kopp family for the plots woven together in this book, though at the same time, I missed the charming back-and-forth between the sisters that was so much an integral part of the first book. Even though I realize that Edna Heustis's situation is meant to show Constance that it's time to let Fleurette fly the nest, I found it a little difficult to swallow that Constance would have stepped back quite so much. I feel as though she would have perhaps found a happy medium. That said, I enjoyed the side plots to this story very much. It's important to remember that we women haven't had the vote for even 100 years yet, and that parents and husbands could have women and girls locked up (in prisons, in insane asylums) for no better reason that they didn't obey, or that they may have wanted something better for themselves. We women have so much more freedom today. I can't imagine calling the police on my daughter when she's 18, living on her own and providing for herself, simply because I wanted her back home with me.I really hope that the New Jersey newspapers of the early 1900s have more stories on Constance Kopp because I'd love to see this series continue, especially through the First World War and afterward, with all the social changes that came about. I also want to learn more about Edna Heustis and whether she's able to continue to influence Minnie in a positive way.Highly recommended."}, {"userName": "Hobart", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/4084033-hobart", "userReview": "★ ★ ★ 1/2 (rounded up)This originally appeared at The Irresponsible Reader.--- Without meaning to slight Girl Waits with Gun or Lady Cop makes Trouble, this is the best constructed novel in this series. There's a unity of theme, stories that complement each other, and a level of (honest) introspection from the characters that we haven't seen before. That said, I don't think I enjoyed it nearly as much as I did the others. So it's a little bit of a trade-off.We are treated to three stories of young women, one sixteen year-old and two eighteen year-olds, who leave home for various reasons. They all want something more than they can have at home -- meaning, a job, excitement, freedom, and maybe something more. One girl did everything right, but sill was arrested for waywardness. One was pretty foolish, and did some illegal things, but was really arrested for the foolish mistake. The third was Constance's little sister, Fleurette. Constance went to bat for all three -- interceding with the law (when applicable), with family (when she could), trying to give them the ability to live the life they wanted to -- and each of them pressed Constance's ability, job and standing as she did so.While this is going on, Constance is making headlines across the nation -- making her both a distraction to her friend the Sheriff, as well as a voice for social change. I know she regrets the former, and I'm not convinced she relishes the latter. If she had her druthers, I think Constance would prefer just to do her job and be left alone. But she is learning how to use her notoriety -- or at least her relationship with members of The Press -- to help her accomplish her goals. Constance begins to come to terms with some very unfortunate realities of her life, and begins to grasp what the future may hold for her, both professionally and personally. In some way (I think), she thought she could keep the life she had and just add on her job on top of it. But between her fame, the time she spends away from the home, Fleurette's aging and getting ready to leave the nest, and everything else going on around the sisters, that's no longer possible. Her old life is gone, and the new one is too in flux for her to get a handle on it. Assuming that there are more Kopp Sister novels to come, watching Constance figure out what her life will be -- and hopefully she gets a hand in shaping it -- will be the key to the series as it progresses.On the whole, this one didn't work as well for me as the previous books did. But several of the individual elements I found compelling and wanted more of -- I wish we got more of the story about Edna Heustis (I don't need to know what happened over the rest of her life, I just want a clearer picture of the next few months) or her roommate. I'd have liked more interaction between Constance and her boss -- we just didn't get enough of them -- and an honest conversation about the future would've been nice. I did think the ending of the Fleurette story was handled perfectly -- I don't think I'd change a thing about that whole storyline, really. Still, this novel was somehow less than the sum of its parts, for me -- but I can easily see where I'll be in the minority for thinking that. I'm not saying I didn't enjoy it, I just should've enjoyed it more.Strong characters, some strong themes (ones you usually don't see in Detective fiction), and a tumultuous time period (for several reasons) combine to deliver another satisfying entry in this series that'll please existing fans and probably pick up a few more.Disclaimer: I received this eARC from Houghton Mifflin Harcourt via NetGalley in exchange for this post -- thanks to both for this."}, {"userName": "Vicki", "userReviewDate": "Mar 02, 2017", "userURL": "http://www.goodreads.com/user/show/1592696-vicki", "userReview": "Constance Kopp is not like most women. It is 1916 and she is one of the first female deputy sheriffs in the country. And when she is dealing with her female charges at the Bergen County Jail, Constance questions the conventional thinking of the times. The story focuses on two young women who left home for varying reasons, ended up working in factories, and were brought to the jail on vague “morality” charges that could keep them locked up for years. But Constance is not willing to give up on these young women. As she investigates and tries to find a reasonable way to get each one released, a personal drama within her own family becomes intertwined with their cases. Constance and her sisters are independent-minded and richly developed characters in this fascinating fact-based historical series. But it is Constance’s quiet power and perspective on the subject of justice that really shine in this latest novel from the talented Amy Stewart.Many thanks to the publisher for allowing me to be an early reader."}, {"userName": "Ampersand Inc.", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/16575304-ampersand-inc", "userReview": "This is the third and final book in the Kopp sisters adventure stories. Set in 1916, Deputy Sheriff Constance Kopp comes to the rescue of young women who have been locked up in her jail on alleged morality charges. Constance is the only person who will stand up for their rights. But her modern beliefs are tested when her youngest sister Fleurette secretly runs off and joins a travelling dance company. Readers will really enjoy this light-hearted detective story."}, {"userName": "Shomeret", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/1842352-shomeret", "userReview": "Miss Kopp's Midnight Confessions is the first of Amy Stewart's Kopp Sisters series that I've read. I didn't feel that I needed an orientation to the Kopp Sisters that wasn't provided by Amy Stewart in this book. So for me Miss Kopp's Midnight Confessions could stand alone.I really liked Constance Kopp's intervention to restore freedom to young women who had been condemned as \"wayward\". This is based on the concept that women are property who couldn't have aspirations or ambitions of their own. This idea had persisted for centuries and was widely believed in 1916 when Miss Kopp's Midnight Confessions took place.Readers who are interested in early 20th century law enforcement, and how it impacted women who'd been stigmatized as \"wayward\" will be interested in reading the latest Kopp Sisters novel. For my complete review see http://wwwbookbabe.blogspot.com/2018/..."}, {"userName": "Josh", "userReviewDate": "Nov 14, 2017", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "Miss Kopp's Midnight Confessions is a cozy historical crime fiction (think cozy mystery without the mystery).Despite being the third book in the series, Miss Kopp's Midnight Confessionals reads well as a standalone. The main characters come with baggage but there's enough backstory included in the present day setting that the reader doesn't feel lost with what's happened in the previous books. Constance is an interesting character and the author ensures she gets page time not only in relation to the passages involving the crimes but also in her personal setting, notably when her daughter runs away to join a stage show and the ensuing hunt to track her down. I did like the somewhat humorous aspect to this side show. Set in 1916, the book provides insight into the laws of the time which seem ridiculous by modern standards, in particular two cases of young women who are charged for waywardness, incorrigibility and moral depravity. Whilst not much happens in this space from a crime perspective, the book delivers on character and charm. My rating: 2.5/5, it was ok. I found the book more interesting than entertaining but that's more to do my reading tastes rather than the book itself."}, {"userName": "Poppy fairy ", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/18322003-poppy-fairy", "userReview": "I loved this blue cover. After reading Girl Waits With Gun I just had to read Miss Kopp's Midnight Confessions. Following the true story of Constance Kopp, one of America's first female deputy sheriffs and her two remarkable sisters. The part I liked the best was what was in a paper. THE LADY SHERIFF RIGHT ON THE JOB NEW YORK Constance A. Kopp, the lady sheriff bustled into police headquarters last night and said she had a warrant for a man for white slavery and wanted assistance of the New York authorities.Constance, Norma, and Fleurette Kopp were real people. The books are based as much as possible on the real events in their lives. I loved the way that Amy Stewart does rely on fiction to fill in the gaps in the historical record. I wanted to know more about the Kopp's sisters so I visited Amy Stewart's website. For anyone who like to read more about the Kopp's sisters visit amystewart.com"}, {"userName": "Jeimy", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/9310118-jeimy", "userReview": "My wife and I disagree about this one. My three stars are due to the likable cast of characters, but plotwise, I found this one lacking. It felt like it was designed to teach readers about how morality laws affected women, instead of to entertain us with the Kopp sisters' antics."}, {"userName": "Moloch", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/4540522-moloch", "userReview": "[della moglie dello sceriffo (hide spoiler)]"}, {"userName": "Karen", "userReviewDate": "Oct 15, 2017", "userURL": "http://www.goodreads.com/user/show/41376337-karen", "userReview": "I received this from netgalley.com in exchange for a review. Book 3 of the Kopp Sisters find Constance in the middle of another delicate situation. She is outraged to see young women brought into the Hackensack jail over dubious charges of waywardness, incorrigibility, and moral depravity. Constance uses her authority as deputy sheriff, and occasionally exceeds it, to investigate and defend these women when no one else will. I wanted to like this more but I didn't enjoy this book as much as the first two, the sisters were more of the subplot than what the subplot was. 3.25 ☆"}, {"userName": "Martina", "userReviewDate": "Mar 13, 2017", "userURL": "http://www.goodreads.com/user/show/4330908-martina", "userReview": "Enjoyable read. I do like the characters in this series. This outing deals primarily with the concept of 'wayward girls' in which parents or others could report a young woman if she wanted to leave home to work or live on her own, despite the reasons the girl may have had to leave. It's 1916 and American 'boys' are training for overseas fighting and many want to assure that they will not be weakened by contact with bad girls! There is almost no one who will speak for or stand up for these girls. Enter Miss Kopp, who confronts the issues from three points of view in this story. Amy Stewart takes real people and real events and weaves them in to fascinating stories. I'd want Constance Kopp on my side if I were in trouble!Earlier: Yaay! #3 in the Kopp Sister's series by Amy Stewart is now available. I've so enjoyed these books. Got in the queue for the ebook from Overdrive and downloaded it today. Must read NOW!"}, {"userName": "Carol", "userReviewDate": "Aug 05, 2017", "userURL": "http://www.goodreads.com/user/show/14035448-carol", "userReview": "I received an advance copy from the publisher via Netgalley in exchange for an unbiased review.Another solid addition to the series! I highlighted so many passages where Constance sets about applying logic and human compassion to the unjust, sexist laws of the time. One oddity: My chapter 29 was a blank page followed immediately by chapter 30, so I'll be interested to read what appears in the final version."}, {"userName": "Chris Mara", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/54731819-chris-mara", "userReview": "This was a rather fun, easy, light hearted book. There are two other books in this series; this one is #3. I have not read the other two and I don’t know if it really matters because this one read pretty well on its own. This is predominantly a true, historical story with some fictional fluff added in. There are 3 main characters:Constance - our heroine - New Jersey’s (and the Nations’) first female deputy sheriff. As expected during that time period of the early 1900’s, women in law enforcement were rarely given a badge, a gun, authority or equal pay as a man. She is, what the book calls “a large woman,” which is 6 feet tall in height, about 180 lbs. and she is not afraid to physically take down a male perp. Constance has been given some policing/legal challenges with “errant” women that have been brought in on various charges. At that time, it was not unheard of for parents contacting the police to bring their runaway daughter home, or for them to be arrested for “waywardness,” or being incorrigible. They could be arrested for indecent dress or “carrying on with men” or keeping late hours. It was very common for parents to report their daughters to the police when they became defiant, ran away, or became too headstrong for them to manage. The police would locate, bring them in to either be returned to their family or to a reformatory facility. At a reformatory facility, they would be held until the age of 21. When released, they would essentially be worthless of themselves, to family, and to society. If it was a criminal act, they would be tried and charged as guilty and sentenced accordingly. Norma - Constance’s sister - a frumpy, oddly dressed woman with a brusque manner and a protective soul. She is an “in your face,” take charge kind of person; she has a sharp tongue and has an innate protectiveness of Fleurette, perhaps even more so than Constance, who has her matronly police work taking up her time. Fleurette - the “secret” young daughter of Constance, but played off to all as a sister to Constance and Norma. Fleurette dreams of auditioning for a renowned dance troupe that comes to town and when that actually happens, a series of events occur that pulls in Constance and Norma. Constance tries to keep a level head, Norma is like a big old dog after a bone; she thinks there’s something sinister going on and that Fleurette has been kidnapped. Despite Fleurette sending a goodbye note after she left and other update notes, Norma thinks she is sending secret code messages home that she’s in trouble. Constance tries to keep her job responsibilities top of mind back at the precinct; the values that she fights for and believes in for these accused women that get sent her way, clouds her actions and thoughts when it comes to dealing with Fleurette’s surprise family departure. Her daughter had left home in a similar fashion as some of the “wayward” women and we see the dilemma of what to do, what to do, now that it’s her own child. We come across some women in the book who truly are criminals and others who are just looking to get out of a bad situation at home or out of a relationship, or just want to have a carefree, jolly good time, not hand over all their earnings to their parents, etc. Constance goes above and beyond for them in her line of questioning, speaking to the judge, following up on leads, even staying overnight in a cell. Constance has a very good work and personal rapport with her Sheriff which if she didn’t, I doubt she would never be able to have done the things that she did. She has his support and understanding all the way which is extremely unusual for a woman, for that time period. I was not sure if I would like this book or not - I just snatched it off the library shelf and dropped it in my bag without too much thought. The cover looks a little like an old fashioned Agatha Christie Miss Marple book. I did enjoy it! It was rather cozy and enlightening and a good story overall."}, {"userName": "Barbara", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/11701608-barbara", "userReview": "This is the third novel by Amy Stewart about Constance Kopp, America’s first woman Deputy Lady Sheriff. It’s the third historical fiction novel that Stewart uses actual facts about Kopp. Stewart uses the many newspaper sources to write her story, as Kopp was great fodder for newspaper writers at that time. The newspaper sources are the bones of Stewart’s story, and her fantastic creativity fills the story. This can be read on it’s own, although it’s a third in a series. Great series are those in which the reader can read each one independently of each other.In this novel, it’s 1916 with the backdrop of WWI. Also at the time in New Jersey, where Kopp works, and in New York there is a political push on purity and morality. At the time, families were using the court system to tame their women, be it daughters, wives, or sisters. Constance Kopp is responsible for the women prisoners in her Hackensack jail and is generally outraged at the questionable charges of waywardness, incorrigibility, and moral depravity that her prisoners are charged with. She spends some of her time investigating the charges and thereby helping to get the women released from the doubtful charges. Stewart uses documented jailed women in the novel. What’s more, Steward delves into reformatory schools for girls and the hopelessness for those girls who get stuck there. Stewart proves that she researches this time period and deftly uses facts.Constance is one of three Kopp sisters, and Stewart writes them delightfully. The sisters’ personalities add so much fun to the novel. This is an enjoyable read that has the reader in that time period, while allowing the reader to savor one of the best female protagonist in historical fiction."}, {"userName": "George", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/1021218-george", "userReview": "LIGHT AND ENTERTAINING“Young women were being locked up for months, and possibly years, over offenses that amounted to little more than leaving their parents’ home without permission, or carrying on with an unsuitable man.” (Kindle Locations 173-174)[Full disclosure: The following is a 99.9% ‘cut-and-paste’ of my review of this writer’s earlier novel, ‘Lady Cop Makes Trouble’. It applies.]Amy Stewart’s ‘Miss Kopp’s Midnight Confessions’ (Kopp Sisters, #3), is an historical novel based on real people and actual events. It is a quick and easy, quite entertaining, read with an ‘old timey’ feel. Love the characters and the crazy situations they find themselves wrapped up in; and most especially like the, personally familiar, locale of northern New Jersey/NYC.Recommendation: An especially good Book Club selection.“I’m sure I don’t have to tell you that the primary sources of moral decay in this country are the theaters, the dance halls, and the saloons.” (Kindle Locations 3221-3222)Houghton Mifflin Harcourt. Kindle Edition, 384 pages; 4,644 Kindle Locations"}, {"userName": "Mark", "userReviewDate": "Feb 23, 2018", "userURL": "http://www.goodreads.com/user/show/216284-mark", "userReview": "Another delightful page-turner from Amy Stewart, based on the real life adventures of Constance Kopp, one of the first female police deputies in the nation. In this installment, Constance takes on the growing problem of throwing women in prison on morality charges.In her first case, she rescues a young factory worker whose parents have filed charges of \"wayward behavior\" against her for no other reason than the fact that she left home without permission. Constance finds a sympathetic judge and wins gratitude from the worker. The second case is more complicated, because the local prosecutor, who loathes Constance (and vice-versa) has used the Mann Act, which prohibited men from taking women across states lines for immoral purposes, to go after a 16-year-old girl trying to escape a hardscrabble life with unloving parents, and who entices a young gambler from New York to take her down to the city on a riverboat. She ends up with a fake marriage certificate and a penurious life in a walkup in New Jersey, which is where she is living when she's arrested.In the meantime, Constance's grumpy sister Norma, who takes care of their farmhouse, is becoming even more disagreeable and lonely, and her youngest sister Fleurette (and she is more than a sister) finally seizes her chance at an artist's life and freedom by signing on as a seamstress with May Ward and her Dresden Dolls, a touring vaudeville group.Looming over America during this novel is World War I and America's impending entry into the fray, and one of the characters, the young factory worker whom Constance helped, becomes dead set on going to France to work as a volunteer.There are really no whodunits in this book or even straightforward crime investigations. What you do get are vivid characters, long overdue changes in the Kopp family and a piercing look at the struggles women went through to be independent, to avoid moral censure and to fight for their rights, years before women's suffrage was enacted.A series that just keeps on getting better."}, {"userName": "Catherine", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/5202393-catherine", "userReview": "feels good to read something that isn’t medieval spanish poetry 😍"}, {"userName": "Brittany Casteel", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/8577028-brittany-casteel", "userReview": "I've enjoyed every book in this series and this was no different. I enjoy historical fiction and the strong female characters make for an enjoyable read."}], "description": "The feisty, fiery Kopp sisters are back in another unforgettable romp by international bestseller Amy Stewart.Deputy sheriff Constance Kopp is outraged to see young women brought into the Hackensack jail over dubious charges of waywardness, incorrigibility, and moral depravity. The strong-willed, patriotic Edna Heustis, who left home to work in a munitions factory, certainly doesn’t belong behind bars. And sixteen-year-old runaway Minnie Davis, with few prospects and fewer friends, shouldn’t be publicly shamed and packed off to a state-run reformatory. But such were the laws — and morals — of 1916.Constance uses her authority as deputy sheriff, and occasionally exceeds it, to investigate and defend these women when no one else will. But it's her sister Fleurette who puts Constance's beliefs to the test and forces her to reckon with her own ideas of how a young woman should and shouldn't behave.Against the backdrop of World War I, and drawn once again from the true story of the Kopp sisters, 'Miss Kopp’s Midnight Confessions' is a spirited, page-turning story that will delight fans of historical fiction and lighthearted detective fiction alike.", "title": "Miss Kopp's Midnight Confessions\n      \n          (Kopp Sisters #3)", "url": "http://www.goodreads.com/book/show/33413882-miss-kopp-s-midnight-confessions", "average": 3.75, "cover": "https://images.gr-assets.com/books/1487313949l/33413882.jpg", "reviews": 407, "authors": [{"url": "https://www.goodreads.com/author/show/34893.Amy_Stewart", "name": "Amy  Stewart"}], "type": ["Historical", "Mystery", "Fiction", "Historical", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/33413882-miss-kopp-s-midnight-confessions", "http://www.goodreads.com/book/show/34688871-miss-kopp-s-midnight-confessions", "http://www.goodreads.com/book/show/34330557-miss-kopp-s-midnight-confessions", "http://www.goodreads.com/book/show/23719378-girl-waits-with-gun", "http://www.goodreads.com/book/show/6106482-wicked-plants", "http://www.goodreads.com/book/show/16277245-the-drunken-botanist", "http://www.goodreads.com/book/show/28114478-lady-cop-makes-trouble", "http://www.goodreads.com/book/show/9845802-wicked-bugs", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}