{"ratings": 4405, "userreviews": [{"userName": "karen", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "so, apparently, THERE IS A WHOLE BACK-MATTER SECTION of this book with a refresher-list of CHARACTERS and THINGS THAT HAPPENED in the first two books. it is not as complete as it could be - you are still going to have to sort out the whole jarvis/jasper/jayden situation yourself, but THIS MIGHT HAVE BEEN USEFUL FOR ME TO KNOW BEFORE i read the whole 600-plus page book. had i been reading a \"regular\" book, there is a chance i would have flipped to the back of the book and said \"AHA!\", but e-books are just not designed to have exciting hidden treasures at their end. so i am telling you this now, in case you are in the same boat i was in and you have no idea what is going on. CHECK THE BACK!!you're welcome.now that's that out of the way.so, yes - do visit the helpful reader's guide at the end of this book, because bick has a lot of confidence that you will have remembered everything that happened in the first two books and ignores the fact that an entire year has elapsed between their release dates full of other, equally complicated books. and she is not gentle to your failing memory.this is all woe and whining that i covered in my review for Shadows but it does deserve to be reiterated, because phooo! she sure does write thick books - thick in pages and thick in detail and actions, and it took me about 300 pages to find my bearings.but even though i frequently felt confused and cursed with forgetfulness, that doesn't mean that i wasn't enjoying it for those first 300 pages. this is a tremendously violent book. and i like tremendously violent books. and i remembered enough that even in those instances where i was doing the \"huh?\" thing, i was still really digging the story and the characters.bick is great in that she doesn't write down to her audience. there is so much detail in terms of weapon-capabilities, medical details, and military strategy, that it makes the story seem more plausible than it might otherwise, and even though i got lost in a few of the action sequences, i know that this is another one of my readerly-weaknesses and not a fault of her writing, which is, again - very very thick. plus - bonus: several near-drowning sequences, and like the second book, one involving ice which is something that kills me every time.her characters are equally complicated. they aren't all heroic or noble; they suffer from self-doubt and fear, and even though many of them are very strong and have skills beyond what regular people have, there are completely believable explanations for their special knowledge and specializations, so you never feel like they are unrealistic. there is a difference between superheroes and people with training.she doesn't wrap everything up as far as what the root cause of the situation in the books were, but she cheekily skirts the issue a few times, saying something like \"well, if this was a book, thus-and-such would happen now, but it's not, so…\" but it doesn't read cop-out, it just reads \"this is the part of the story i am telling.\"i think the ending is perfect. it is a great blend of hope and realism and ambiguity, and i didn't find it unsatisfying at all, despite it ending on a shadow rather than a spotlight.there's not a lot more i can say - this is one of those books that if you have read the first two, you will probably read the third one, and i think it is a really strong conclusion to the trilogy. i cannot be more informative without spoiling. i love the sensitivity with which she treats her characters while still being totally willing to kill 'em off if need be. it is a difficult balance to achieve, but she succeeds completely.read it."}, {"userName": "Shambhawi P.", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/8936537-shambhawi-p", "userReview": "DNF at 38%Life is too short to read bad books and everyone is annoying the fuck out of me.Here's the thing.I really enjoyed Ashes - for most part. It was a cool post-apocalyptic novel about Alex, Ellie and Tom surviving in a fried zombie infested world.Then Ilsa J Bick tried to turn it into a stupid dystopia. And with that story arc I really lost my interest. Shadows was no better. It was almost to worse with many different story arcs from different characters' point of views and none of them seeming to tie up.So I expected everything to come together cleanly in Monsters. I expected to learn more about the original EMT that fried the world along with all of the different arcs tying up together. I expected to read more about Alex and Tom and their subtle but should have been powerful relationship that I was promised since the first book. I wanted Ellie back. And I also wanted that disgustingly gory way of storytelling that actually keptme from DNFing Shadows.I only got the gore. And without a proper story to back it up it was more of the same and not enough in itself to hold my interest. And the other stories were dominating over Alex and Tom's stories and I couldn't care any less about Peter or Chris. Ashes trilogy was supposed to a particular type of book - but it tried to incorporate so many elements in it that it was neither here nor there.Monsters was the worst of the lot.So, I didn't finish it.1 StarThis ebook was provided to me by the publishers via Edelweiss in exchange of an honest review"}, {"userName": "Mogsy (MMOGC)", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/4379514-mogsy-mmogc", "userReview": "This is going to be less of a review, and more of a list of my thoughts on why I just couldn't get into this book. I try generally to finish every book I start because I'm way too obsessive-compulsive not to, but I have to say it was so tempting to put this one aside. I did end up finishing it, but not without much zoning out and skimming.- I remember really liking Ashes, the first book of this trilogy. It was, in my opinion, a zombie survival story done well. We had a great beginning, an intriguing cause of the disaster in the form of the mysterious \"Zap\" that started it all and turned everything upside down. I liked the main character Alex and how she met up with Tom and Ellie, I wanted to see more of them and what they would do to make it through the apocalypse. - But somewhere along the way, this zombie survival story became bogged down with too much character drama. Alex used to be the main focus, which was fine with me; I liked her and her whole backstory about her illness and the death of her parents. But ever since Rule came into the picture, Alex started showing up less and less; other characters I didn't care for were getting more attention. There were way too many players involved already, but Monsters added even more. - This book really could have been edited down further, with a lot of filler cut out. I heard it was originally around 800 pages long, but even now at around 600, there's still too much exposition and unneeded detail, like aimless dream sequences and a lot of redundant repetition. - I did not like how it seemed the author felt every chapter needed to end in a cliffhanger. It very quickly became unbearable when we would follow one character's perspective, stop at a point of suspense, go to follow another character in a very different place, stop at a point of suspense for them, and repeat this pattern back and forth. This excessive ping-ponging between perspectives was even more tedious when all of it would sometimes happen within the same chapter.- No big picture, no explanations or answers to questions. We don't get to find out more about the Zap, the Changed, or any of the other strange things that have been happening to our characters. The action scenes felt thrown in perfunctorily whenever we needed a break from the soap opera drama.- Disappointing end to a trilogy that really started out quite strong. I'd really hoped for it to pick up, but instead, it spiraled further away from the spirit of what made me like the first book so much. I think the departure had already started happening at the end of Ashes, but it only got worse in the second. I didn't like the direction in which the series was headed in Shadows, and I liked it even less in Monsters."}, {"userName": "Annette", "userReviewDate": "Sep 19, 2013", "userURL": "http://www.goodreads.com/user/show/8853519-annette", "userReview": "I was so excited for the conclusion to the Ashes Trilogy. But after spending four days reading Monsters I must confess I'm mostly disappointed.The plot is so all over the place, and there are so many characters and different story lines that I'm going to direct you to the Goodreads summary instead of my usual summary.Monsters was just too long. It took me four days (that's unheard of, for me) to read the almost 700 page tome. And I just didn't think it needed to be. There was so much detail and repetition. Going over what weapons everyone has, and which one would be best (over and over again) is just one example. I just felt Monsters could do with one more good edit (and I read the ARC, so we can hope...)There was nothing to help you get back into the story and remember each character's situation and position at the end of Shadows. And there's so many different groups of characters. I eventually figured it out, but I still got confused. Oh, and then when I got to the END of the book, there's a cast of characters and where they were at the end of Shadows. Don't you think that should be at the BEGINNING???The POV switched constantly and abruptly. We don't get to spend enough time in each POV before we are switched to another. The is particularly true when both Alex and \"another character\" are fighting the Changed in two different places. We get just a page or two and then are switched back and forth. It was like whiplash and as a literary technique, fell short.And, to top is all off, I didn't like the direction the plot took. I can't say too much about this but to say I didn't like how much depended on what was going on \"in their heads.\" You know what I mean if you've read it. This is merely a personal opinion, though, and you may really enjoy this unique plot.I was excited to see how it all wrapped up. At times, I thought about giving up, but there were enough exciting things happening to keep my interest. Monsters had some really tense and thrilling parts. The story was good, and I enjoyed revisiting the characters (the ones I could remember.)I don't know how to recommend Monsters. I think if you are invested in the series, you have to go for it. It sounds like I really didn't like it -- I did, but it was just long and because of the other problems, it seemed even longer.I'm still a Bick fan. I'm ready to read her next book -- I already have it."}, {"userName": "Delee", "userReviewDate": "Dec 27, 2012", "userURL": "http://www.goodreads.com/user/show/6168268-delee", "userReview": "[image error]"}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Mar 24, 2014", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "This book is Monster sized.I didn't think I was going to finish it anytime soon. Not that it drags because it does not. The story keeps you moving through it-there's just so much information to the characters and what they have gone through. Ms. Bick does wrap up her trilogy well though. She doesn't leave you hanging with questions unasked.Her characters have wrapped me up in their stories. I do have to say though starting this book there was a period when I was totally confused. I had forgotten what had taken place in previous books, even though it had not been that long since I had read them.Alex, Tom and even Ellie managed to become some of the characters that will stick in my mind for some time. Even the bad guys in these books show that they have glimpses of humanity. The only gripe I have with the book is that there is no flipping way the characters could survive the trials that they go through, but then I just let go and said what the heck. Just enjoy it. The book does end well with questions that you have to figure out for yourself."}, {"userName": "Sophie", "userReviewDate": "May 04, 2013", "userURL": "http://www.goodreads.com/user/show/20011429-sophie", "userReview": "OH.MY.GOD... This book was so absolutely amazing that I can't even find the words to describe it.Through the course of only three books, Ilsa has taken me on a journey I will never forget, and made me fall in love with truly inspiring characters. This book was so intense, so detailed and so carefully written that I was left completely breathless.I love how Ilsa has made all the characters (who, most of them, we're complete strangers before the EMP blast) connected in so many ways. For example Chris just happens to find Ellie (the little girl Alex was so desperate to save), Tom knows Weller who had met Alex, Tom was with Mellie and she turns out to be Finn's sister. All these small details, connecting all of the characters, building up to the breathtaking finale when all of the main characters come together in Rule.And the ending... It's killing me! (In a good way). I'm not one to cry over books too often but, boy, I cried like a baby during the last part of the book, The Long Walk, when Chris and Ellie scattered the ashes of their loved ones over the waterfall. I'm not sure what I cried over more; the death of some beloved characters, or the fact that the book (and this stunning series) was coming to a close. And the very last part of the book, with Alex and Simon, had me wanting more! I needed so badly to know whether he picked up that chocolate bar or not, but I also love how Ilsa has allowed the reader to picture the ending in the way they desire it to be.Thank you Ilsa J. Bick for one of the most beautiful, enthralling, and inspiring series I have ever read. I will never forget this amazing journey."}, {"userName": "Rachel Webb", "userReviewDate": "Jan 07, 2013", "userURL": "http://www.goodreads.com/user/show/6743217-rachel-webb", "userReview": "The Final book in the Ashes trilogy; about zombiesThe only word I can think to describe my reaction to this book is disappointment. The first book in this series is one of my favorite zombie novels of all time. That's no exaggeration. Then the second book (Shadows) came out and I was disappointed in it, but I gave Bick the benefit of the doubt because the second book is usually not as great and is just a hurdle we have to get through to get to the final book. This 800+ page book lived up to it's name at least. It was a monster, not only in size, but in content. The imagery was often times disgusting, which I expected and I could get past it, but the jumping around from viewpoints got really old really fast. You would think that Alex, Tom, and Ellie would be the main focus since that's who the whole first book was about and we also got the majority of their viewpoints in Shadows, but no. I felt like Monsters was more from everyone else's views, especially Chris. Who cares about Chris? His backstory is just plain weird, not chosen by his grandfather to live in Rule, instead left behind with an abusive father, but still ended up in Rule anyway. If you ask me, he got a better deal. Look at what happend to his twin Simon! Then the whole thing with Lena and the weird connection with Peter where they talked to each other inside a different world created by their minds??? WTF. I still don't get that.Let's move on to the whole why are the Changed evolving and how did they get that way. NOT A CLUE. I still have no idea why some pulse went off that killed the majority of the adults, spared some kids, and changed others to zombies. It have something to do with frequencies, radio waves and brain charges, but who can be sure what exactly it is. There's nothing definitive that I can grab onto and if someone adkes me straight out how did the zombies come to be, I couldn't give a straight answer. There is something important about people who have brain tumors, were terminal, or have cancer, but not really sure what. Alex's brain tumor seemed to come alive and make her want to be with Simon/Wolf instead of Tom (unacceptable) and that ending just made me want to throw the book across the room. (Maybe if it had been smaller and wouldn'thave put a crater in the wall, I would have thrown it.) What happens if Wolf at the end takes the candy (because he feels like a nut?)? Does that mean he and Alex can be together, after she just had sex with Tom? Or that he is now back to human even though he still smells like rotting flesh? The frustration rolling off me is insane and maybe that's what Bick wants is us to think about it forever and be mad at her. IDK. It's really aking me not want to read her next series in case she frustrates me again with that one. Reccommended? I suppose if you read the first 2 then yes read it, but if you haven't started the series then no. Spare yourself."}, {"userName": "Sarah", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/22026596-sarah", "userReview": "“A word of advice, sweetheart: when you're at the brink; when it's a choice between what's safe and what might be better, even if what's best is also scary, take a chance, honey.”This was a weird series for me. I'm not even sure why I read this book, because I didn't like the second book at all so I was pretty sure I wouldn't like this one either. But I actually really enjoyed the first book and I guess I just wanted to know how the story ended. The series started out as a pretty good dystopia in the first book, with a damn badass female main character who kicks ass, which I loved. Probably the main reason why I couldn't enjoy these books so much was the fact that it quickly turned into some kind of zombie apocalypse story, which was waaay too gory and brutal for me. So be warned, this is not for the faint-hearted, I actually had to skip so many passages because it was just too much brutality. There was a lot of action going on, it literally never slowed down even a bit, so despite its monstrous size, it was still a very fast read. (probably also because I skipped all the gory scenes which basically make up half of the book lol)Another problem I had with the series was the overwhelming amount of POVs. It changed almost every chapter and the chapters are really short, so you just couldn't get into one characters view, before it changed to a totally different setting and story line. So that was really off-putting for me. The characters were alright I guess. I liked some, hated some and didn't really care for others but again, there were just way too many main characters.And then there's the ending. It did wrap up the story quite well, but still left some things open and I'm one of those people who just. don't. like. these kind of open endings. So while I actually enjoyed the first book in the series, it just got worse from the second book on. It was totally fast paced and action packed, but I guess all the gore was just not my cup of tea. But if you want to read a book that basically describes all the gory scenes in The Walking Dead in every damn detail then this is the book for you."}, {"userName": "Patry Fernandez", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/21837756-patry-fernandez", "userReview": "En realidad 4,5*Reseña completa -> http://thewordsofbooks.blogspot.com.e...«Nadie puede evitar contemplar lo monstruoso, porque el horror está emparentado con el asombro.»De las mejores trilogías que he leído y pasa a ser de mis favoritas con un final a la altura de lo que la historia pedía."}, {"userName": "Elena", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/5622667-elena", "userReview": "[ did Wolf save Alex? Is Chris alive? Is Lena changing? Is Tom going to fight against Rule? Will Ellie appear again? What about Peter? (hide spoiler)]"}, {"userName": "Devon Ashley", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/5127275-devon-ashley", "userReview": "[Something going on in each of their heads, whether it was cancer or chemical or electrical, wasn't normal, and they therefore weren't changing. Monsters was about all the different crap going on inside their heads, and it left me utterly confused for the longest time, and I think that's why this novel gave me such a headache. (hide spoiler)]"}, {"userName": "Julia Graf", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/5266827-julia-graf", "userReview": "This was without a doubt the BIGGEST disappointment of the year so far for me!! After having raved about and absolutely loved the first 2 books in this trilogy, I was beyond stoked to finally read the conclusion. I never expected it to be such a let down.First of all, I spent the first third of the book utterly confused. I remember it being difficult in book 2 to remember all the characters and plot lines, but somehow I got into it again. But this one was impossible! I even went to the author's website to read the little cliff notes on book 2, but still - I was utterly lost on so many characters. Why would the author put the cliff notes at the very END of the book instead of at the beginning??? Who does that??This was the major downfall of the book. Whereas the first book had a strong focus on 3 characters, and the second book introduced some more - this installment just completely lost the narrative with way too many voices. There were so many characters that all the narratives seemed very static and flat. I had no clue what drove or motivated the characters to do anything and there was absolutely no character arc or development. Most of the people the author discussed, I just didn't care about them at all or I couldn't even remember who they were. Bad sign. There was nothing memorable about them that distinguished the different voices. They all sounded exactly the same.Also, I've never read a book where there is so many drawn out action scenes, yet somehow - nothing really happens!! This book was just so long and the ongoing struggle was way too drawn out. There isn't really any meaningful resolution at the end to make the struggle worth it. No \"Aha\" moment at all. I began skipping entire pages of narrative because it didn't serve to move the plot along, at the end entire chapters because I just wanted to get through it. The constant ending of chapters on a cliffhanger, and then switching to another character - this ping pong effect lost its suspense very quickly and just became totally irritating. Especially because it was obvious all the main characters were going to survive anyway so the cliffhanger endings to every chapter were totally superfluous and unsuspenseful.I think Bick should have cut out at least half of all the characters and instead focused on the ones we had come to care about - Alex, Ellie, Tom and Chris. The rest, I honestly didn't give a crap about if they lived or died. So many names, so much irrelevance.Also, I didn't really understand Alex's brain tumor. Was she a Changed, was she a zombie, what the heck was that attraction to Wolf? I'm still totally confused. Go go push push - come again? WTF.Such a shame. This could have been one of my all time favorite trilogies, but the last book was just a huge fail in my eyes."}, {"userName": "Juan Vorágine", "userReviewDate": "Jun 30, 2016", "userURL": "http://www.goodreads.com/user/show/44431166-juan-vor-gine", "userReview": "Un muy buen final para una trilogía diferente dentro del género juvenil y que ha ido a más con cada libro.Reseña completa: http://voragineinterna.blogspot.com.e..."}, {"userName": "Olivia", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/19832836-olivia", "userReview": "Please don't let Tom die!!!! they have to end up together!!!"}, {"userName": "Nicole Olivier", "userReviewDate": "Sep 16, 2013", "userURL": "http://www.goodreads.com/user/show/24004184-nicole-olivier", "userReview": "Please do not read this if you have not read all three books yet.Ok where to start... (This is kind of my review for the whole series)Well ever since I got one chapter into the first book I was hooked. I read ASHES about six times in one year because I needed my Tom, Ellie, and Alex fix while I waited for the second one to come out. Alex is the perfect character. She is fierce and strong with that personality that draws you in but like the real people in this world she has flaws. She isn't super woman, she makes mistakes and has to fight through self conflict. Now Tom... Tom is my kind of guy. I love the whole wounded soldier personality about him. He is the guy that you just bite your lip till it bleeds in anticipation for him to come charging in and beat the crap out of the people who hurt his woman. He is a loving guardian. Someone who can hold up Alex and Ellie when they want to fall and vice versa when he needs a shoulder to cry on. Ellie is the innocence of the group. She is annoying and stubborn, but also sweet. Together these three make up a little makeshift family that work very well together. The author gets you so attached to them in the first half of ASHES then rips them apart and it makes you want to scream and then keep on reading, desperately waiting for them to come back together. Even though that is what kept me going it is also when the book kind of lost me. All of that time Alex is in Rule I'm just thinking about Tom and Ellie and why she isn't out their searching for them(not to mention their was like no fight scenes. Just a lot of talk). Also it was confusing. So many new characters to keep up with and they were characters that I had a hard time getting attached to because I was so focused on the original three(four including sweet Mina :) Then came Chris. At that time I really didn't care for the guy and was worried their would be a love triangle but thankfully it did not come to that. Anyway don't get me wrong I loved the entire book but that last part was so frustrating, and that's probably why I got so attached. The story was challenging me and making me mad. I figured if a story could do that to me then it was a good one.Now the second book has to be my least favorite, but it was still very good. At first I was a little annoyed about how it jumped between so many different people. All I wanted was to know Alex's story. I just wanted her point of view and could care less about the rest. But then I understood. Without all of the other story lines I would have been so lost. There would be no way the author could give you all of that information with just one character. Not to mention after seeing the world through their eyes I began to get attached to people like Chris and Peter. You got a chance to see their true thoughts and personalities and learn their secrets. Yes that was great and all but even with all the jumping back and fourth the book was slow. Not a lot of excitement. This book was more about giving you information, filling in some of the holes and building up questions that lead you into the third book. SHADOWS was very frustrating because of that. But it was still very good.Book three was just... EPIC! It was indeed mind blowing. There was a wonderful mix of action, survival, and problem solving. After the second book I had adjusted to having the multiple point of views and I enjoyed it a lot more. It was still hard to keep up with all the characters and everything that was going on but I was ok with that(it just gives me a reason to reread). Anyway this book revolved on 4 stories. You have Ellie and Chris, Peter and Finn, Tom, and Alex and Wolf. Yes their was some others in there but those are the main ones. The author did a wonderful job and keeping me drawn in(as always). I can be reading about Chris one minute and then the chapter ends leaving my mouth hanging open in shock while it moves on to Tom's story and then Tom's ends with a cliff hanger and I don't get back around to what happened to them until several chapters later and it is just insane! But I love it! Even though all of the characters are not interacting they are all connected. They all have some knowledge about the other and they are all trying to figure it out. It makes it seem as if they are so close to each other. So close it makes you frustrated that they haven't found one another yet. But that is what makes the ending oh so good! As you read you realize that all of those characters are heading toward the same place and your just anticipating that moment when they meet. And meet is what they do. All of them collide into one epic finale. That moment is just so wonderful. Chris has rescued Peter and found his long lost twin. Alex has found Tom and Ellie is waiting for them. What a relief. Now the very end was well... wow. You would think it would be a great happy ending. Alex, Tom, and Ellie finally together. But the author doesn't reunite them with a bunch of hugs and kisses which I like. After al the trauma, pain, sorrow, and horror you can't expect everything to just be ok. Alex is still going through self conflict and looking at life with dark and pained eyes. I wanted so badly for things to be like the beginning of the first book(and I just wanted more Alex, Tom, and Ellie time. More of those moments like when Alex kissed Tom for the first time). But it did end good and I was satisfied with how the relationships between all the characters ended. The legitimate ending however left me stunned. I remember reading it and screaming WHAT! That's it?! How could Ilsa do this to me?! It wasn't a bad ending or sad it was just unexpected and that is why this series has drawn me in. That's why I love these books. I love all of the surprises, all of the shock. It left open a lot of questions still. There was no answer to what really happened. Was it a EMP? Why exactly did only kids change and why were people like Alex spared. No answer to what is going on with Chris and why he came back to life. No answer to Alex. No explanation on why she has that super smell or how she can jump behind the eyes of the changed. Even though it sucks it makes sense. There is no way the characters could have figured those things out so they just have to move on with it. Sadly we do to. But it is all good. I love the books and hope that other people get and chance to read it and I hope they enjoy it like I did."}, {"userName": "Jen (The Starry-Eyed Revue)", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/4659650-jen-the-starry-eyed-revue", "userReview": "Monsters and I got off to a bit of a rocky start.  Having been a year since I read \nShadows\n and a year before that that I'd read \nAshes\n, I'd forgotten quite a bit.  Even with Ilsa's handy dandy refreshers (So You Read ASHES a Year Ago & So You Read SHADOWS a Year Ago), I still felt like there was more about this world than I was remembering.  Re-reading my reviews for each book didn't help either, since I try to refrain from spoilers in my reviews.  I just knew that there were things I'd already figured out in the last book that I couldn't for the life of me remember!Add to that that this book is 821 pages long, and well, I was having a very difficult time immersing myself in this world once again.  There was plenty of action and danger and still all of that intrigue as to whom to trust and how far to trust them, but it was A LOT to take in after being away from this story for so long.  So, if there's a chance you've forgotten anything about this series, I wholeheartedly suggest a re-read.  I wish I'd had the time to do that myself.  It might not have taken as long for me and the book to hit our stride.But, gawd, once my head was back in this story, I couldn't put it down.  I'm not going to lie:  there are about a gazillion characters and points of view to keep track of in this series, and it's even worse in this final installment.  So, if a story told from multiple perspectives that shift in the middle of chapters isn't your thing, this may not be the series for you. Fortunately for me, I love multiple POVs.  I love the versatility of the third person omniscient point of view especially.  As the reader, you're the only one who truly knows every aspect of the story and you can tie all of the pieces together before any of the characters.Unless you're reading this story, that is.  As with the other books in the series, Monsters keeps things unpredictable. Getting one question answered only brings on a slew of other questions.  Nothing is ever what it seems in this story, including the characters and their motivations.I wish I could say that this \"zombie\" novel is unlike any other post-apocalyptic novel I've ever read.  Oh, it definitely has its own merits, but considering the sheer volume of zombie/post-apocalyptic fare I've read over the last few years, I feel that they all have one thing in common, one thing at the core of each story that compels me to keep reading them.  And it's not the blood and gore or the creepy factor, though I don't mind that.  No, if you really look at the heart of every post-apocalyptic tale, they're all about the human condition, what we're willing to do to survive and just how much we can withstand before we reach our breaking point. Of all the zombie novels I've read, I think this series showcases that facet best because you get to witness it from so many differing perspectives, and everyone handles a crisis differently.Of course, even with it's similarities to other zombie books, there is one big difference:  the zombies in this series aren't zombies.  They are regular humans that have Changed.  They didn't die and come back to life as zombies are wont to do.  When the EMP hit in the first book, almost everyone falling in a certain age range just...changed.  They weren't themselves anymore and they suddenly liked the taste of human flesh.  There's some neuroscience-y stuff in there that I don't care to go into, nor do I fully understand, but it affects everything and everyone in this series.There are the crazies who want to build an army out of the Changed.  There are those who want to hole up in a settlement of their own making and forget the rest of the world exists.  Then there are those who simply want to survive, to make some semblance of a new life for themselves now that the world has gone to pieces.  And then there are the Changed who are something...more.I loved Alex and Tom and Ellie -- the three original characters from the first book -- but I think Simon/Wolf fascinated me the most.  His story was just coming to light in the last book, but after learning everything in Monsters, I believe he might be the toughest survivor of them all, pre-EMP and after.  And I can't believe his story still isn't finished.  I'm a big supporter of the open-ended conclusion and leaving the reader to determine how things really ended, but I also really need to know if there's more of a resolution to this character's story ARC, especially where Alex is concerned.Monsters was probably the most intense book of the three, which is saying quite a bit.  It left me breathless and in tears and desperately wanting to know more.  I know 821 pages is daunting, but I encourage you to read this unforgettable story, starting from the beginning with Ashes.  If I remember correctly, that installment is told singularly from Alex's POV and should give you a great feel for the authenticity of the series and how well researched it is.If you're a fan of zombie or post-apocalyptic novels, I probably don't have to convince you to read this series.  However, if you're one of those opposed to the gore and horror of this type of novel, I implore you to look past all that and give these books a chance.  Look to the heart of the story, instead, and see that it's actually a pretty beautiful (and brilliant) story of human survival.  And, hey, all three books are out now, so you can read them back-to-back and avoid all of those memory issues I ran into.  ;0)  Also, all three of these books were 5-star reads for me, if that helps.  :DThanks to EgmontUSA and Edelweiss for providing a copy for review!This review can also be found at The Starry-Eyed Revue."}, {"userName": "Josiah", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/1914201-josiah", "userReview": "Mystery, cruelty, and psychotic ambition swirling around the town of Rule finally reach their climax in this third book of the Ashes trilogy, and the finale is anything but quick. Monsters is six hundred eighty pages of dense, heavily detailed action and more minor plot twists than I can keep straight as the main characters regroup after the underground mine detonation at the conclusion of Shadows to figure out what's next now that most of the Chuckies (or \"Changed\") are dead. Threats to human life are no less numerous or ghastly than before, but the endgame is drawing near, and soon the ultimate battle for survival will commence.  \"Hate makes you feel more powerful, like you can keep yourself pumped, so you put one foot in front of the other, thinking that you're going somewhere even if all you're doing is looping the same movie over and over in your head.\" —Tom, Monsters, PP. 534-535 Having hooked up with a group of other Spared teens and kids, Ellie and her dog Mina aren't in imminent danger when they come across Chris Prentiss lying in the snow, bleeding heavily and on the brink of death. The spiked trap sprung at the end of Shadows dealt him several mortal wounds, and there may be nothing Ellie or her new allies can do to save him. In another nearby area outside of Rule, Tom continues grieving over Alex's presumed death. When she fell back into that mine and its rising floodwaters as Tom was forced to move on for the sake of the kids under his protection, Alex's odds of survival dropped to practically nil, and Tom can't forgive himself for leaving the love of his life to die just moments after they reunited for the first time in months. But Tom can't get too wrapped up in his grief; he has kids to take care of, kids like Luke (age fourteen) and Cindi (twelve) who care about him and rely on Tom's military expertise to keep them out of harm's way. He can't quit on them now. Alex is alive, however, having narrowly escaped the flooded mine where Tom had to leave her. Working as best she can with the motley crew of Changed teens who were the biggest threat to her in Shadows, she moves toward Rule at the same time Tom and his kids and Ellie and her friends are on the way there, unaware of each other's presence. While Rule's Council of elders was a primary villainous entity in Ashes and Shadows, sadistic Vietnam vet Elias Finn emerges as far worse, torturing any young person he gets his hands on and somehow manipulating the Changed under his command to commit more heinous acts than ever. They, too, are marching on Rule, where a battle for freedom and security is poised to begin. Who will survive the terror of a war that could make everything up to now pale in comparison? How many of our favorite characters will perish in the struggle?  \"To name is to recognize. It is to gain access and control. Things are much scarier in the dark, where they are formless, than in broad daylight.\" —Finn, Monsters, P. 440 All our main characters have grief to work through, but it's not easy under the conditions generated by the EMP that plunged the world into anarchy. Psychological lesions that cause constant pain are as hard to overcome as chronic physical ailment. \"How could you get past a splinter that had worked into your eye and scratched deeper every time you blinked?\" It's not as simple as \"getting over it\" when the pain is agonizing and won't stop digging in deeper. As vulnerable as connecting with people in the EMP's aftermath has made her, though, Alex knows these bonds are what keep her sane and alive, for the sake of the few left that she loves in this crazy, perverted new world. \"She might still be lost if not for Ellie and Tom and Chris. Even Wolf. All those connections led her out of those woods, from a very black place, and pulled her from the brink of a leap where there was nothing and no one waiting but death.\" The terminal malignancy in Alex's brain had her ready to end her life, but her newfound post-Zap family is too precious to let go of that easily. There's more life to be lived together if they can survive Rule, and Alex thinks back on something her now deceased father told her about moving toward an uncertain future. \"A word of advice, sweetheart: when you're at the brink; when it's a choice between what's safe and what might be better, even if what's best is also scary, take a chance, honey.\" That's the only way to know you've lived the fullest life possible, in the real world or an apocalyptic disaster scenario. Take the risk and see where it leads. Life might just have a pleasant surprise left even after you'd given up hope. Ashes is far and away the best book of this trilogy, in my opinion. I guess I'd rank Monsters barely ahead of Shadows because of a few touching goodbye scenes at the end, and Jasper the ten-year-old pyrotechnic is an interesting new character. Ashes turns out to be a much different trilogy than book one would have you think, but I believe that first volume is worth your time. Thank you, Ilsa J. Bick, for some compelling reading."}, {"userName": "Teri", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/4989035-teri", "userReview": "Let me start by saying my son and I are huge fans of this series and I mentioned these books at http://teripolen.com/2013/01/16/would.... It's been about a year since the second book, Shadows, came out, so I was glad Monsters included a cast of characters (there are many secondary ones) and summary of who's where and doing what at the end of the second book. Unfortunately, that part began on page 673, when I was already finished with the book. Had it been in the first few pages of the book, my reading experience would have been tremendously improved.I'm glad I finished this series, although I feel like the original storyline got lost along the way. The first book, and to some extent the second, focused more on Alex and her situation, how far she'd go to survive and protect her loved ones, the decisions she made, and discovering her limits. Monsters had so many varying POV's that it was hard to keep up at times. The action sequences carried on for pages, especially in the first several chapters. It quickly became tedious reading about a fight scene that seemed to go on for hours. Typically, action scenes are designed to make the reader want to keep reading, being unable to put down the book. In this case, it just make me skim through the pages to see what happened when it was finally over.Although the second book left me feeling as if a love triangle between Alex, Tom, and Chris would be the focus of the third book, it was practically nonexistent, and for that, I was grateful; however, the relationship between Alex and Wolf left me scratching my head and was never really resolved.The ending of the book was ambiguous and left many unanswered questions - Who was behind the EMP's? Why were some spared and what was their purpose? Why had some of the Changed held on to part of their humanity while others hadn't? - just to name a few. Some of the mysteries from the first book that held my attention were never solved and left me very frustrated.The book was well-written, but really could have been shortened by 200 pages or so and focused more on the primary characters instead of the numerous secondary players. I would also strongly suggest moving the character and previous book summaries to the front of the book instead of the back.This review is based on a digital ARC from the publisher through NetGalley."}, {"userName": "Pixie", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/4034936-pixie", "userReview": "(Technically 4.5 stars, but since I can't rate half stars at GR, I rounded up here! =D)You can see this full review at my blog, The BookaholicNow I have come to the conclusion of the Ashes trilogy. I am saddened by this. I kept my pacing timed so that I could savor the finale. Obviously, you’re gathering from these sentences that this trilogy is a favorite. I don’t think I’ve loved a set of books so deeply in years. And maybe that’s saying something. It stacks against my love of Vampire Academy, Harry Potter, Daughter of Smoke & Bone, Hunger Games, and Wicked Lovely. It’s on my shelf of life-long favorites and there to stay. I have to admit, though, that this conclusion had bumps in the road and this was where I had no problem with my own pacing goals. These bumps caused me to get a little bored during some moments, to be honest, and some areas I felt like it may have been too much of an info-dump or too much unnecessary detail to just add more pages to the already long (821 pages to be exact) installment. A small issue, but something I thought to mention nonetheless. Readers who don’t like multiple characters and/or several character view points, might possibly be turned off yet again. To remind you of Shadows: it’d been written the same way, changing up from the way Ashes had been (Ashes having been generally in only or mostly Alex’s POV). However, once again, I adore this style. I love love love the multiple characters and getting to see what is going on with each one after I’ve come to know them. Particularly because Bick gives them life and personality. She makes me loathe some. She makes me love some. One character, that I shouldn’t name because I’m trying to avoid spoilers in this review, is a character that made such a unique impact on me I’m likely to remember that one for the rest of my life. There’s really so much more I’d like to ramble on and on about but I’m afraid to give away even the tiniest spoiler that those who’ve read even Ashes and Shadows might not appreciate. Shadows had left off with lots of unanswered questions as to character situations, etc. and if I so much as to mention particular scenarios in Monsters, it could give something away unfortunately. Ack. It’s always so hard to refrain from just gushing about books like a starry-eyed fanatic when you really want. The love. THE FEELS IT GIVES ME. The details are fantastic. It feels like I’m reading and watching a movie right in front of me. After I finished, I was even internally asking “Why can’t these be movies?!” Yes, it gets graphic and gory and like with the last two books I probably cried more for the animals when there was any mention of that (these are zombie-like creatures, so keep it in mind that there is a good deal of death--animal and human--at times) because I always have a soft spot when it comes down to loss of animals in a book or movie. Ack. But the gore in the long run, the “zombies”… it’s not the deep part of the story. There are messages throughout… about humanity and life… and they’re heavy, and make you really think. At the beginning, it’s an immediate go into the action from the end of Shadows. So if it’s been some time since you’d read the books, you might want a quick little refresher if your memory isn’t quite up to speed with it. That’s another thing I did enjoy… I wasn’t bogged down by a lot of beginning repetitive info that can tend to be tossed in with some series installments. I feel like something like that shouldn’t usually be worried about, and just to go right into the action/story of that installment in most cases. Obviously if the reader is picking up that installment, they’d read the others, am I right? Ha! K, mini rant over. :P Where I felt the start had been strong and propelled me through well over half of the book (until I hit a few various ‘bumps’ as mentioned above), I found the ending on the weak side--a tad disappointing to be the ending to the trilogy--and left me yelling at the book for MORE. Even though I know I won’t get more. Sad. I still had to take half a star because of the ending though. My biggest reasoning was that the buildup of the big ending didn’t have quite the KA-POW as I’d expected. Lot of tension. Lot of action to get the suspense and excitement built, but when it came to it at the end, it was over so fast. And then some other things felt open-ended, leaving me to thoughts. And I can’t sit here and voice them or ask questions because there would be spoilers! Ah! Otherwise it would’ve been a straight 5-star read. Which would’ve been my first full 5-star set. Ever. (Ashes and Shadows were both rated at 5) No big, of course! It’s still one of my most highest-rated, and I’m usually telling everyone I know to read the books, even when it’s not their thing. =D Oh goodness. You see? You see what these books do to me?! I can’t stop talking once I start. I love them. 　This is one pre-apocalyptic/post-apocalyptic thrill of a ride \nI’ll never forget.\n<3Pixie"}, {"userName": "Rayne", "userReviewDate": "May 10, 2014", "userURL": "http://www.goodreads.com/user/show/5374178-rayne", "userReview": "Almost 700 pages! And I'm done! Well... not quite. I still have to rate it and maybe write a bit of a review. Whatever. I'll sort out my feelings for this one later. For now, I'll just rejoice for a while on the fact that I finally finished this freaking series with this mammoth of a book appropriately named Monsters. I'm done. I'm free. Praised be the gods of YA."}, {"userName": "Jennifer", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/2850786-jennifer", "userReview": "The Good: Sadly, nothing.The Bad: I've never read a trilogy that started out so flipping amazing and ended so unbearable that I almost couldn't even bother finishing it. I loved Ashes. Raved about Ashes. Shadows wasn't good, but I soldiered on. Sometimes middle books just don't work for me. I still had high hopes. Monsters was nothing short of atrocious. I just feel so let down by this trilogy. Everything that was wrong with Shadows was just amplified in Monsters. The pace was meandering. The book was super long and it just didn't need to be for what the plot entailed. It felt as though the story was sacrificed for the sake of descriptive writing. As every characters thoughts and feelings were described in painful detail, more often than not - nothing was actually happening. It was like time was constantly standing still for personal reflection. And then if there was action, it was overly explained. I do not need to know every eye twitch of every character involved in the scene. I don't. It's overkill and sucks all the tension and excitement out of the moment."}, {"userName": "Lesincele Viaja gracias a los libros", "userReviewDate": "May 16, 2016", "userURL": "http://www.goodreads.com/user/show/14422831-lesincele-viaja-gracias-a-los-libros", "userReview": "Volumen final de la trilogía. Son 800 páginas pero me ha mantenido pegada a sus páginas toda la lectura. Me han encantado los personajes, las escenas más duras y como se ha ido resolviendo todo. No le doy las cinco estrellas porque me han quedado bastantes dudas que me hubiera gustado saber y que el final fuera algo más cerrado."}, {"userName": "Belle Sabattin", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/33852257-belle-sabattin", "userReview": "Esta saga debería traer la advertencia: NO BUSQUES ZOMBIES AQUÍ.¿Por qué?Porque no es una historia de zombies como tal, y la verdad, es que en algún momento mientras avanzaba con esta historia eso me molestó mucho, ya que técnicamente HAY zombies, pero a la historia no le importa mucho y tampoco le importa explicarnos qué está pasando, es más bien, como si el mundo se estuviera yendo a pique y nosotros estuviéramos viendo una miniserie. Esto para mi, no fue nada satisfactorio, aunque es probable que se haya escrito así a propósito, después de todo, se pasará algo similar (Por favor que nunca pase) solamente tendríamos una muy limitada perspectiva, tal como sucede en este libro y tendríamos que sobrellevar todo sin la cantidad de información a la que estamos tan acostumbrados poder acceder fácilmente.Esto no quita que hay mucha entretención, adrenalina y suspenso. Pero, por lo mismo, no soportaba las inmensa cantidad de descripciones: del bosque, las hojas, el clima (Ya tenía muy claro que hacía mucho frío y todo se congelaba). Entonces, estabas en medio de una escena en que todos iban a morir, explotar o que sé yo, y comenzaba un enorme párrafo para describir la habitación o el paisaje... eso no me gustó nada de nada (soy muy ansiosa, por cierto). Esto le quitaba mucha emoción a todo.Por estas razones mis 3 estrellas y aún estoy pensando que quizás debí darle solo 2, pero después de todo es una historia bastante original... aunque me siguen molestando muchas cosas, como el poco esfuerzo, por parte de la escritora, de darle una explicación a todo."}, {"userName": "Emma", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/10517179-emma", "userReview": "[Alex wanted to split from Tom again after 550+ pages of them NOT BEING TOGETHER. DO YOU LOVE HIM OR DO YOU NOT?! (hide spoiler)]"}, {"userName": "Sarah", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "(Source: I received a digital copy of this book for free on a read-to-review basis. Thanks to Egmont USA and Edelweiss.)This is book 3 in the ‘Ashes’ series, and picks up where book 2 ‘Shadows’ left off.**Warning – some unavoidable spoilers for books 1 and 2 ‘Ashes’, and ‘Shadows’.**Alex is stuck in the mine which has just exploded; time is running out if she wants to survive.Tom blames himself for Alex’s death, and vows to kill Chris if he ever meets him.Chris is pinned beneath an iron spiked tiger trap and death is imminent.Peter is Finn’s prisoner and is faced with a choice to eat human flesh or die.Will the monster in Alex’s head finally kill her or will she drown in the mine? Will Tom kill Chris, or will he already be dead from the Tiger trap? What has happened to Lena? And will these kids ever meet up again?This book was pure action right from the start. A riveting, adrenalin fuelled, crazy journey from start to finish.Let’s start by saying that this book itself is a monster, at over 800 pages it took me hours to get through, but thankfully it was hours well spent!This book started out right where book 2 left off, and was literally life-or-death moment, after life-or-death moment, after life-or-death moment. The story alternated between Alex, Chris, Tom, Ellie, and Peter, so we were really living several stories, and each had their own problems in the chuckie-infested cesspit that was this dystopian America. Every time one disaster was averted, another was upon us, and this was one hell of a crazy ride!I did feel that this high-adrenalin stuff petered out towards the middle of the book, but we were still left following the different characters, and hoping that somehow they would find their way back to each other. The body count kept on piling up, and things looked bleaker and bleaker, and yet more problems arose. Funnily enough I wasn’t expecting the paranormal storyline that arose in this book, as it seemed that someone had developed the ability to telepathically control some of the chuckies, which did seem a little out-of-place, but thankfully the high-octane stuff made up for this.The ending of this story was fitting, and I liked how although not everything was wrapped up and tied with a bow, we were given hope that things would work out okay.I do think that this has been an amazing trilogy, and a wonderful dystopian/zombie story, and I will definitely be reading this author’s next book!Overall; an adrenalin filled finale to this amazing dystopian trilogy.8.75 out of 10."}, {"userName": "Ning", "userReviewDate": "Oct 30, 2013", "userURL": "http://www.goodreads.com/user/show/7012990-ning", "userReview": "I really really really wanted to love this book! Ashes was amazing, and Shadows was pretty good. I fell in love with Alex, Tom, Chris, and Ellie and I wanted them to all have a happy ending. But Monsters was needlessly long. I tried really hard to be interested, but I was bored a lot of the times. I don't think I've ever skipped so much of a book before. The biggest drawback of this book is the action. Action? Why? You ask. Don't we want action in our books? But I don't need to know EVERY SINGLE DETAIL!! I don't need to read four to five pages of a fight against Chucky, or a all out gun-fight! This is not a movie script. Not every move have to be scripted out. The action was fun the first two times, but when every fight is drawn out move by move, I can care less, so yeah, I skipped probably half of the book. Another thing that slowed this book down is all the thinking and hypothesizing. All the time Alex trying to figure out her monster, Tom with his monster, the dreams with Chris and Peter. Honestly, I didn't need all that. I already love those characters. Just get to the end! Oh, and the way every chapter ended pretty much on a cliffhanger. Cliffhangers are a good ploy for a few places, but when they're everywhere, they lose their effectiveness. I also didn't care for all the other POV, such as Greg, or Peter's. Greg's was a nice way to see what was happening at Rule, but other than that, didn't care. I felt bad for Peter, but I disliked him from the beginning so it was hard to care for him after my first impression of him. Overall, this book could've been amazing. This series started amazingly and just kind of went downhill, culminating in this disaster. If you really want to know what happens, basically just skip to about 80% and that's when all the meaningful action actually starts."}, {"userName": "Kevin", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/9593601-kevin", "userReview": "The conclusion to the Ashes trilogy where teenagers inexplicably turn into people-eating monsters and thank goodness it's finally over. I loved the opening of this trilogy, Ashes. It was intense, full of post-apocalyptic action and had a trio of great main characters you cared about. Then the characters got sidetracked in this weird town and it didn't end. The second book, Shadows, just delved into more weird stuff and introduced these odd factions. The series still had great moments, so I kept reading.Monsters finally came out and I mainly picked it up to see how things ended. Ug. It still had some good moments and some intense action, but so much junk. The plot for this series just derails through the countryside, getting hung up on these other group of characters and old histories for no good reason. It distracts from the three main characters in the original. Nevermind the weird military guy who's doing unexplained testing and trying to control the monsters. It just doesn't hold together. The absolute worst part is how many times the book kept saying 'if this were a movie or a book…' as if we weren't reading a book. The author used it to justify not explaining anything, used it to justify certain action scenes, used it to justify a lack of a love triangle, and on and on. Once is cheesy enough, but multiple times? Like so many other teen trilogies, this one should have ended with the first one. It would have been brilliant. Instead it falls to pieces and relies on weak and desperate justifications. In the end I give it two stars instead of one because I was hooked enough to read to the end."}, {"userName": "Sue Moro", "userReviewDate": "Jan 29, 2015", "userURL": "http://www.goodreads.com/user/show/4677076-sue-moro", "userReview": "Although I very much enjoyed Ashes, the first book in the series, I felt the series went downhill from there. The second book introduced way too many characters to keep track of and I honestly didn't really care about any of them. The three main characters get separated mid-way through Ashes (book one), and do not re-unite until the very end of Monsters. This frustrated me so much! Monsters is a huge book, well over 600 pages! The author does include a list of characters and where they are and what happened to them after book two, Shadows, at the end of the book. That was somewhat helpful, but not to anyone who didn't look at the end first. Luckily I did, but even then, there were so many characters there that I couldn't keep track of them once I began reading Monsters. I think the book could have been cut in half. Most of it is repetitive. The people eaters, known as Chuckies, attack, then they attack again, and again, and again. Our characters are constantly under attack, or in danger, or being tortured. It just got to be too much! Honestly I couldn't wait for the end, and then the reunion was just sort of \"meh\". It's really too bad, because I enjoyed the characters and story so much in the first book."}, {"userName": "Catherine Abbott", "userReviewDate": "Sep 27, 2013", "userURL": "http://www.goodreads.com/user/show/22540537-catherine-abbott", "userReview": "This book was quite gripping and very hard to put down...but boy was it dark . The action was so unrelenting the characters went from one disaster or fight scene to another. There was no moments of peace for the characters to stop and just enjoy being together even for a moment. Perhaps a true reflection of what it's like to be in a state of war but from the reader point of view I needed a break from all the fighting for a bit more humanity and tenderness between the characters. Far too many characters were killed off so that it became like one of those horror movies where you are waiting to see who will be the last woman or man standing.What was with the ending I found it very unsatisfactory and did not really understand what was happening with Alec. It did not feel like the end of a trilogy but more like the beginning of something new. I did like that you got to know more about the lives of some of the characters before the event. Would only recommend to someone who likes their books full of blood and gore."}], "description": "The Changed are on the move. The Spared are out of time. The End...is now.When her parents died, Alex thought things couldn't get much worse-until the doctors found the monster in her head.She headed into the wilderness as a good-bye, to leave everything behind. But then the end of the world happened, and Alex took the first step down a treacherous road of betrayal and terror and death.Now, with no hope of rescue-on the brink of starvation in a winter that just won't quit-she discovers a new and horrifying truth.The Change isn't over.The Changed are still evolving.And...they've had help.With this final volume of The Ashes Trilogy, Ilsa J. Bick delivers a riveting, blockbuster finish, returning readers to a brutal, post-apocalyptic world where no one is safe and hope is in short supply.A world where, from these ashes, the monsters may rise.", "title": "Monsters\n      \n          (Ashes Trilogy #3)", "url": "http://www.goodreads.com/book/show/15947841-monsters", "average": 3.73, "cover": "https://images.gr-assets.com/books/1372185588l/15947841.jpg", "reviews": 552, "authors": [{"url": "https://www.goodreads.com/author/show/143691.Ilsa_J_Bick", "name": "Ilsa J. Bick"}], "type": ["Young Adult", "Horror", "Science Fiction", "Horror", "Apocalyptic"], "outlinks": ["http://www.goodreads.com/book/show/15947841-monsters", "http://www.goodreads.com/book/show/17162435-monsters", "http://www.goodreads.com/book/show/17620858-monsters", "http://www.goodreads.com/book/show/18530620-monsters", "http://www.goodreads.com/book/show/29863204-monstruos", "http://www.goodreads.com/book/show/18421752-monsters", "http://www.goodreads.com/book/show/9975679-ashes", "http://www.goodreads.com/book/show/11320138-shadows", "http://www.goodreads.com/book/show/12083233-drowning-instinct", "http://www.goodreads.com/book/show/13449631-white-space", "http://www.goodreads.com/book/show/7811598-draw-the-dark"]}