{"ratings": 1678, "userreviews": [{"userName": "Maja (The Nocturnal Library)", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/4551536-maja-the-nocturnal-library", "userReview": "It’s no secret that I love urban fantasy more than any other genre out there, and I love it even more when urban fantasy flirts with horror just a little bit. I discovered the Edie Spence series entirely by accident, really enjoyed Nightshifted, the first book, and now I’m happy to report that the second book didn’t diminish my love for it in the least.I think what people like most about Edie is that she’s just a regular woman, very non-heroic and plain. She works her night shifts at the hospital, gets conned over and over by her addict brother and pushed around by the supernatural community. She has no lasting relationship, no real friends, and her bond with her family is tenuous at best. One can’t help but feel compassion for Edie and her sad, quiet life, but there are times when she seems just a bit too passive. I like reading about regular people in unusual circumstances, and I don’t necessarily want them to be fearless or heroic, but resourceful would be nice. Edie is often just a pushover, for her brother, her co-workers, the mysterious Shadows and the entire supernatural community, especially the vampires. She gets involved in their business in very odd ways, they get her to do their dirty work with just two words of flattery and then keep her in the dark and fail to protect her from things they brought to her doorstep. \nI pulled on my scrubs and all the silver that I currently owned. Between my belt, bracelet, and badge – which might warn me a second or two before any attack –I’d give myself even odds on surviving for five seconds once I was outside my door. Five whole seconds, although not necessarily painless ones.\n In Nightshifted, Edie took it upon herself to save a vampire child, and now that vampire child, Anna, asks her to be some kind of Ambassador, involves her in things Edie doesn’t even begin to understand, and then just disappears without protecting her in any way. There were times when I wanted to yell at Edie to grow a spine, but there would be no point. She is who she is.\n\"You can't just leave anyone. It's one of your biggest virtues, and one of your worst flaws.\nEdie is constantly surrounded by grotesque creatures she relentlessly takes care of, even when it’s not her job to do so. As I said in my opening paragraph, I love it when urban fantasy flirts with horror, and Cassie Alexander balances the fine line between the two wonderfully. Sure, some of the descriptions might turn your stomach (they did mine, and I’m not exactly a delicate flower), but this is what sets the series apart and I really like it.At this point, I’d hate for Edie to find a steady relationship and then get her act together and become less pathetic (harsh words, Maja, harsh!). I don’t want a man to fix her life, that would be even more pathetic. I want her to find her own footing, start taking care of herself and then maybe get into a serious relationship, preferably with Asher. I like Asher for her, and I have a feeling he wouldn’t just abandon her like Ty (although he did give me reason to think otherwise). He’s charming and attractive and, you know, definitely NOT a zombie. I’ll keep my fingers crossed. What I really wanted, but didn’t get from Moonshifted was a stronger story. The first half was essentially plotless, or at the very least directionless. So many things were happening at once, and at the same time, nothing was happening at all. I still couldn’t clearly outline the plot for you, nor do I wish to try. For the first 80%, Moonshifted suffered from the worst case of Second Book Syndrome I’ve ever seen, but at least it ended with a bang. Hopefully, the next book, Shapeshifted, will be a bit more exciting in that regard."}, {"userName": "Angie", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/50378-angie", "userReview": "Originally reviewed here @ Angieville.You'll remember my excitement upon discovering Cassie Alexander and Nightshifted--her fabulous urban fantasy debut. I loved everything about it, from the killer cover to the hard-working, conflicted protagonist inside. When I realized the sequel was set to be published just a few months later I was, well, over the moon. Go on. Raise your hands. I know I'm not the only one who waits (with barely concealed ill grace) a year for each new installment in her favorite series. It can be a hard wait. I understand why, and I am nothing if not extremely grateful for everything that goes into the writing and publishing processes. But it can be a hard wait. That's why two in one year? Such a treat. That said, the closing events of Nightshifted were portentous to say the least. And I was pretty anxious about where Edie would be (and in what condition) when I found her next, who would be around to help her, and who . . . would not.Edie Spence isn't fresh off the shelf on the Y4 ward of her county hospital anymore. She's earned her stripes and is even approaching tenuous friendships with her fellow seasoned nurses. It's been months now since her cringe-worthy induction into life as a nurse for the undead (and every other supernatural creature that comes their way) and Edie is still rattled by the fallout. Indebted to powers she'd really rather not name and struggling to define her unwanted role in local vampire politics, she's less than pleased to find herself holding vigil over a werewolf alpha in a coma. Edie was on the scene when he was attacked and soon every wolf in the pack is banging down her door looking for clues. This includes a wolf by the name of Lucas who stands to inherit the alpha mantle should the old man not pull through. Lucas is a bundle of contradictions and Edie is 99.9% sure she should keep her distance. But when her home is attacked and the vampires become involved, there is little she can do to stay removed from the action.Edie is nobody's fool and I love her for that. With the possible exception of her brother, she has very few blind spots. She does her best to avoid disaster scenarios. She really does. Unfortunately, her world has teeth and seems to be supremely uninterested in cutting her a break. That's not to say that she's without her share of foibles. But even when she's making a clear mistake, she remains fully cognizant that it is her choice and that she is making it. Usually to fend off something even darker, for which I can rarely fault her even as it fills me with concern for her and the bleakness that surrounds her. Edie is flawed and lonely and allergic to asking for help for herself and I am incredibly fond of her. Witness a couple of reasons why (taken from my uncorrected ARC):\"I introduced him to my parents, Edie. I thought he was the one.\"I didn't know what to say. I didn't think I'd ever felt like that. I'd stood on the edge of The Oneness before, and maybe peeked into the valley below, but I'd never made the final jump. I'd learned that if you thought of people as disposable, it hurt less when they disposed of you.Her heartrending frankness hits me every time.Asher met me at the door, looking like the Asher I knew best. Olive skin, dark hair, dark brown eyes. He took one look at me, and then past me at Gina, still slumped over in my passenger seat. \"You want to put her in a spare room, or a spare bathroom?\"\"Someplace with a lot of tile.\"He followed me out to my car, and we retrieved her. Gina kept murmuring things that sounded sad, while Asher helped me help her down his entry hall. We made it up the stairs together, and I arranged her inside a claw-foot tub while Asher went to get extra towels. I sat on the toilet beside her, petting her hair, and Asher returned to lean against the wall.\"Do I want to know what happened?\"\"Girl meets were-bear, girl falls for were-bear, were-bear says if you love me you'll let me bite you, girls says good-bye.\" I wished I had an IV start kit and a banana bag--IV fluids with vitamins and minerals--right about then. We could've set her impending hangover straight in no time.Asher's eyebrows rose high up his forehead. \"I meant at your house.\"Alexander graces this novel with the perfect amount of humor and horror. Edie's life is awash in gray. Worn down by her relentless job, her succubus of a brother, and the demands of the paranormal, she's acutely wary of any scraps of happiness that float her way. I understand her caution, especially given how she's been burned in the past. But I can't help but hope for her, too. I enjoyed her interactions with the her fellow nurses (Gina in particular) and the local weres (Lucas in particular) immensely. And her encounters with the elusive Asher fill me with alternating glee and uncertainty. I choose to view these tentative forays as harbingers of the hope she deserves. My concerns and hopes aside, MOONSHIFTED absolutely shone in the sequel department, extending my affection for the characters, while introducing new angles to sink my teeth into. It also possesses one humdinger of a climax. I was swept away in the force with which it built and the raging rush to the finish. I'm more attached to Edie than ever. This is urban fantasy of the highest order. However will I survive the wait for book three?"}, {"userName": "Rachel the Book Harlot", "userReviewDate": "May 04, 2014", "userURL": "http://www.goodreads.com/user/show/4702450-rachel-the-book-harlot", "userReview": "3.75 stars"}, {"userName": "Kara-karina", "userReviewDate": "Oct 17, 2012", "userURL": "http://www.goodreads.com/user/show/5427067-kara-karina", "userReview": "4.5/5Despite oh so very deceiving synopsis, Moonshifted is not about choosing sides or men. Just like Nightshifted, it is a constant attempt of one lonely human with a big heart to survive among scary supernatural forces. That's it.Nurse Edie doesn't have any superpowers, she is not particularly pretty, especially working night shifts (Edie, I know how you feel. I don't like the look of myself in the mirror after a week of night shifts too) and she doesn't have awesome powers of deduction. In other words, she is normal just like us. An overworked, young health worker with no life and desire to help at the most unfortunate moments.Edie barely escaped a vampire trial in Nightshifted, and she gets right in the middle of werewolf power games when a truck hits a werewolf king of her city. On the other hand her vampire friend Anna asks her a big favour and Edie can't refuse little girl she saved once before...Now vampires hustle her and some odd zombie-like werewolves are trying to eat her, and she is tired of being the one who solves all the mysteries, and it's Christmas and her sofa has bad blood spots on it, and her parents are coming for dinner. It's too much, it's too dangerous, and again she is way over her head...I love that I felt for Edie so much, that the author could make us feel her constant fatigue, desperation and desire to just get it over with and have some sleep.Moonshifted is a better, stronger book than Nightshifted. Edie carves her own way, not necessarily traditional for urban fantasy heroines but that's what so good about this series. You really don't know what awaits around the corner. Highly recommended for all urban fantasy fans, medical professionals and night shift workers around the world. :)"}, {"userName": "Cathy ", "userReviewDate": "Dec 30, 2012", "userURL": "http://www.goodreads.com/user/show/1526945-cathy", "userReview": "[A man says, \"I'm going to take you like I own you,\" and she didn't run as fast as she could? And she said she didn't know who she'd see fucking her if she looked back, him or the wolf, and she didn't want to know. That's pretty darn racy for urban fantasy. (hide spoiler)]"}, {"userName": "Kristin  (MyBookishWays Reviews)", "userReviewDate": "May 19, 2012", "userURL": "http://www.goodreads.com/user/show/3491365-kristin-mybookishways-reviews", "userReview": "You may also read my review here: http://www.mybookishways.com/2013/06/...Moonshifted starts up pretty soon after Nightshifted leaves off, with Edie still recovering from a very nasty vampire attack. Her heart is still smarting after her lover, Ti, takes off to who knows where. So yeah, Edie’s not in a great place, but when she witnesses a hit and run right in front of her hospital, she has little time to think about herself when she’s trying to keep a man from bleeding out in the street. Soon, Edie finds out that the victim is the alpha of the local werewolf pack, and now the pack is in turmoil. If he doesn’t survive, all hell could break loose. Edie has also been asked to be Anna the vampire’s Ambassador of the Sun, which Anna insists is only a ceremonial role, and only for one night, but Edie is dubious. She can hardly say no, but it doesn’t mean she won’t dread it. Oh, did I mention Dren shows up claiming Edie owes him for the loss of his hand and takes to following her? It doesn’t stop there, guys. The hits just keep coming for Edie. Asher, shapeshifter and former lover, comes back into her life, there’s a hot werewolf that’s paying lots of attention to her, vampire and werewolf wars, then there’s the whole matter of Gideon, Anna’s protector, which is kind of a gross/awesome/wonderful highlight of the book. Trust me on this one. If I tell you (and I so want to tell you), it will ruin it, but you’ll love it. Oh, and she has to do Christmas with her family, including her addict brother. See? Told you Edie had a full plate!I was delighted with Nightshifted but I was kind of blown away by Moonshifted. Cassie Alexander has brought the awesome with a layered narrative that positively crackles with tension. Edie is tough, but she doesn’t seem to know it, which is what I love about her, and I keep hoping she’ll find someone to make her happy, but hers is not an easy life, and she certainly doesn’t have an easy job. In short, her life is not all that conducive to romance, but like I said, I remain very hopeful. You’ll meet old favorites from Nightshifted and some new ones that are wonderful and you’ll be left with a pretty jaw-dropping ending. The author not only takes urban fantasy to new and exciting places, but she also adds in horror and even SF elements that make this series even more unique. My review of Shapeshifted is coming up soon, and if you’re like me, you’ll want to move right on to it after finishing Moonshifted. You won’t be disappointed. This is one of my favorite new UF series, and a standout in a somewhat saturated genre. Don’t miss this one!"}, {"userName": "Jen", "userReviewDate": "Jan 02, 2016", "userURL": "http://www.goodreads.com/user/show/12797140-jen", "userReview": "[was shunned for destroying all of the blood reserves. Asher told her that the shunning is for everyone, \"including shapeshifters.\" So what does this mean for Jake and her job on Y4? Is she essentially fired? (hide spoiler)]"}, {"userName": "Carolyn F.", "userReviewDate": "Nov 05, 2012", "userURL": "http://www.goodreads.com/user/show/2624012-carolyn-f", "userReview": "The previous romance that grossed me out is a memory so I was able to read this book without cringing and actually ended up enjoying it more than the first book probably for the same reason. Edie does find some quick romantic entanglements but nothing long term so far. Big changes at the end of the book!!!"}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Nov 11, 2013", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "K so I'm seriously loving Edie Spence. This book is totally different from the first one and if she's working towards so overall goal it's not apparent at this point. Oh, there are overall themes--weres hate vampires, vampires hate weres, shadows are assholes, etc., but there's not some great unification objective or something.In fact, Edie has no super powers whatsoever. That's right, in a world of supernatural creatures, Edie Spence is not a supernatural. She's H-U-M-A-N. She's had some brushes with changeover type situations, but none of them stick.In addition to being human and still sassy, she's quirky and hilarious. Whether she's talking about snozzberries tasting like snozzberries or Grandfather blacksmithing himself a cyborg, she doesn't make me cackle, but she's got \"wry grin\" down.Speaking of Grandfather, he might just be one of my all-time favorite secondary characters. He's kind of like a no-english speaking poltergeist version of Zee (Siebold Adelbertsmiter). So yeah. The ending would have ticked me off if the next book wasn't already out, but it is, so I'm not gonna complain. All Edie needs now is a steady guy and a definitive mission."}, {"userName": "Sarah", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/4096145-sarah", "userReview": "4.5 stars - Even better than the first!{This review was originally published on Clear Eyes, Full Shelves.}Cassie Alexander's debut novel, Nightshifted, was one of the more memorable and creative urban fantasies I've read in a long time. Needless to say, I was thrilled to get my hands on an early copy of Moonshifted, Nightshifted's fast-paced and riveting sequel.[Note: I have made every attempt to avoid spoilers for Nightshifted. Read my review of that book Read my review of that book here.]Moonshifted picks up shortly after the events of Nightshifted, in which nurse Edie Spence finds herself embroiled in a terrifying battle with supernatural creatures, barely escaping with her life. Edie is still a nurse on Y4, the secret ward for paranormal beings of all sorts, as part of a deal to save her brother from addiction. She's still broke, she's still lonely and she's still self-destructive. The only thing that's changed is that she's started to form connections with her follow Y4 indentured health care workers, all of whom have a story about why they're trapped in a dead end job caring for the paranormal.Floor Y4 catered to the supernatural creatures that no one else knew about: werecreatures in their mortal phases, the daytime servants of the vampires, the sanctioned donors of the vampires, and shapeshifters that occasionally went insane. And sometimes zombies, whom nurses occasionally dated, with poor outcomes. At the thought of my now twice-dead love life, my urge to make small talk chilled.While on her lunch break with one of those co-workers, Edie witnesses a man being struck by a hit and run driver. Except the man isn't actually a human--he's a werewolf. Edie and her coworker save the werewolf, but it lands her in the position of caring for the werewolf who's in a coma on Y4. Meanwhile, in the midst of this, Edie's also roped into further involvement with Anna, the teenager vampire she saved in the previous novel. It's not long before the injured man's werewolf pack descends on the ward and Edie finds herself entangled in an internal conflict within the pack, and with her interesting piqued by Lucas, who is in line to becoem pack leader, should Edie's patient die.Edie tries to remain level-headed within the chaos swirling around her, but once her apartment is ransacked by vampires, she has no choice by to align herself with Lucas in order to save herself.This is why I like this series and Edie's character so much: she does what she has to do, even when the choices are terrible.Despite that Edie is in a pretty lousy situation, she's very aware of herself and the impact of her actions. Even when she makes bad choices (as in the first novel with her self-destructive behavior related to men), there's awareness about the potential for really bad things to happen. I’d just pledged my help to a teenage-looking but hundred-year-old vampire whom I knew had a temper and a half. There was no way this could end badly, right?This is refreshing considering that in so much urban fantasy--and even more so in its cousin paranormal romance--the female leads don't have a tremendous amount of agency, nor do they suffer the consequences of their actions and decisions. For Edie Spence, consequences are a daily reality. “Can your friend in the friend zone make a friendly suggestion?”“Certainly.”“This time. For real. Get the fuck out of town.”I bit my lip and looked at the hardwood floor. “I still need my job to protect Jake, Asher.”“He looked pretty clean to me.” “Yeah, he’s good at that.” I put my hands up to my head and ran them through my hair. “There’s just never any guarantee it will last.” “You know, some people who knew you might say your life was worth a little more than his.” I lifted my head up and glared at him. “Asher—” “You’re a nurse, you help people, you give back to the community—you pay taxes. What does he do?” “He’s my brother—” I protested. “A lot of people start off life with siblings. But when you die, you die alone.” I inhaled and exhaled a few times. “I’m not ready to give up on him yet.” “I bet. It’s fun feeling needed, until it gets you killed.”But that's not to say Moonshifted is all serious and angsty. Because Edie's finally making connections with other people (besides her ne'er-do-well brother), the humor that was present in the first book is even more pronounced in the sequel.I thought about asking him for inappropriate things— then briefly remembered the naked men I’d just seen and Gideon’s parts at home. I really didn’t need any more random genitalia in my life, and Gina and I needed to go.Particularly fun is Edie's growing closeness with Gina, a coworker from Y4, who has paranormal problems of her own.“Let me get this straight. You were dating a were . . . bear?” She nodded sorrowfully, her face cradled against the side of the porcelain bowl. “I have to ask. Were there any brightly colored insignias on his chest? Like a rainbow, or an ice cream cone?” “What?” she said, peering up. “You know. Like a Care Bear.” “Fuck you, Edie.” She closed her eyes, like that would make me disappear. “I’m just saying that if I were dating a were- bear, I would carefully check him over for any lame tattoos. Like of candy canes. Or sunshine.” “Fuck you and fucking were-bears.” She snorted.Moonshifted raises the stakes for Edie in the next book, Shapeshifted, and because of the events at the climax of Moonshifted, I can't even begin to guess where this series is headed. (Incidentally, I would not characterize the ending as a \"cliffhanger,\" because the story in Moonshifted is resolved, but Big Things happen at the end which left me internally screaming that I want Shapeshifted NOW!) I'm particularly curious how Edie's relationships (both with her friends from Y4 and her maybe-something with Lucas, the werewolf leader) will play out, given that her life is in such tumult.Alexander is ruthless with Edie, never really giving her a break and pushing her to the point that I wonder how she'll find a way to be happy and \"normal.\" Things look bleak for Edie, and I wonder what other obstacles will be thrown into her path--and if a certain zombie will return. Naturally, I cannot wait to follow her journey. Cassie Alexander's Edie Spence series, along with Jenn Bennett's  Jenn Bennett's Arcadia Bell books, stand out among a sea of new urban fantasy series as distictive, creative and as striking the right balance between action and character drama. If you're a fan of urban fantasy and your not reading both, you're missing out. FNL Character Rating: Tyra ColletteDisclosure: A review copy was provided to me by the publisher.Initial reaction:Can I have book three now, please? Good grief, poor Edie."}, {"userName": "Fangs for the Fantasy", "userReviewDate": "Feb 18, 2013", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "Edie Spence, nurse on Y4, the secret floor of County Central Hospital where the supernatural are treated – the vampires, the werewolves and, in the past, even zombies and dragons. She doesn’t have nearly enough time, especially with the holidays coming up, and even less money hence her taking overtime during the holidays in the hope of more money to pad her rapidly disappearing paycheck.That in itself would be exhausting, but that’s before the king of the werewolves gets run over in a hit and run right in front of her. He’s badly injured to the point of death and even the medical professionals on Y4 can’t raise the dead – but the werewolf politics should he die (and the accusations that fly) are dangerous things to get in the middle of.And then there’s Anna, the vampire she preciously helped and even considers a friend. She has a job for Edie as she prepares to found her own vampire house, a job that requires her to keep a ceremonial knife safe.Whichever is the cause – werewolf or knife –people start trying to kill her, ransacking her home and even risking the wrath of the shadows, the hospital’s mystical protectors, to get at her. And to make matters worse, her drug dealing brother is digging himself into trouble, her parents are coming for Christmas dinner and she has a German Ghostly Cyborg eating her electronics.That was immense fun. I liked the first book, Nightshifted, and found it interesting and pretty entertaining, but Moonshifted is head and shoulders above it. With the beginning of this world introduced, we’re now running with this story in all directions and nearly everything is pretty much excellent.The world building is incredible – there has been such a lot of research that has gone into the various supernatural lores that are relevant in this book – including the 101 ways to make a werewolf which is drawing on some really obscure legends that I had to re-look up and I thought I was pretty overwhelmed with shapeshifter legends already. The way the vampires work, the way the werewolves work – they’re all really really deep and with their own separate twists that add a lot of originality to the story; concepts like the werewolves’ shorter life span (which makes so much sense when described) and the vampire shortage not of human blood, but of actual vampire blood since it takes so long for them to produce. All of these add wonderful new facets to old myths and legends and a completely new spin on everything.But along with the mystical world building which is wide open and growing, there’s also the powerful realities of being a nurse. I love books when the protagonist has a profession and I’m left thinking “this author has worked this job” because it’s so real, they’ve either worked it or really put some sterling effort into making it real. John Hartness does it, Diana Rowland does it and Cassie Alexander certainly does it. It’s not glamourised, it’s not sugar coated and it’s not clean – but the nitty gritty of nursing is there, the good and the icky, the sheer value and importance of it coupled with how undervalued and difficult it is. It’s a really good depiction and makes the entire series so much stronger and more real because of it.What is best about both of these elements of world building is that they’re used appropriately. There’s no massive info dumps and no long monologues. It is shown rather than told, what we need to know is revealed in as much detail as we need to know it. It’s completely restrained and leaves me hungry to know more – like what exactly the Consortium, and Meaty, actually are for one! everything feels natural because the knowledge is presented in a realistic fashion without every leaving us floundering.And the story is fun – it intertwines excellently with Edie’s life but her life doesn’t stop because of it. This is something else I love about this book, in a lot of Urban Fantasy it feels like the protagonist can just put their entire lives on pause while they deal with the plot of the book. Edie isn’t like that – she has a job, she needs money, she even needs the desperate holiday overtime. She can’t just not take those extra hours because the plot has been dropped on her, life goes on. And it’s not just her job – she has family she can’t just drop because dramas are happening, she had her brother and his issues, she has her parents coming round for Christmas Dinner. She can’t cancel all this – and she has to clean up the flat ready for them – just because she has plot drama! Life goes on! Perhaps most impressive to me is Edie’s friend’s – they have their own lives, their own issues and that isn’t subsumed because of Edie’s plot issues. Charles has a thing with werewolves, he’s not setting that aside because Edie is having problems. Gina has relationship drama, Edie can’t just ignore it because of plot reasons – he’s Gina’s friend, she owes it to her to be supportive. Edie can’t just refuse Anna’s plea because it would be convenient to do otherwise. This is such a change from so many urban fantasies where friends just exist to support the protagonist.But aside from twining nicely with both the world building and Edie’s life, the plot is fascinating. It’s excellently paced and written, even with those elements blended into it, the book continues moving forward and never has slow periods. Even Edie having to go buy a couch cover just fits so neatly and adds to the book, these mundane tasks all add something, all develop something and help highlight the relationships without long monologues or info dumps. The mystery behind the injured werewolf king is a curious one. From the beginning I realised that the accused was clearly not the person behind it – it was too obviously a red herring – but I didn’t even remotely predict who was actually behind the attack nor how it all came together with werewolf and vampire politics interlinking. It was really well done, all made sense, and all was a complete surprise. On top of the mystery, the actions scenes, when they arrive, were well written and had that perfect balance of pace versus description.Read More"}, {"userName": "Ashley ", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/5862536-ashley", "userReview": "I liked this one better than the last one. Edie seems to have smartened up a little bit, the brother was less annoying, the plot made more sense (ish). And there was less Grandfather, but it a WEIRD Way."}, {"userName": "Laura", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/9481759-laura", "userReview": "I liked the plot in this one much better than the plot in the first book. However, I find myself growing weary of the way the supernaturals constantly coerce and con Edie into doing things for them without giving her any explanations or choices in the matter. Then, when the shit hits the fan, they never seem to have her back and she's left to pick up the pieces all on her own. Some of this is Edie's own fault. She has an abundance of do-gooder tendencies and she seems to be a bit of a doormat at times. She's also constantly being taken advantage of by her ex-junkie brother, he's the reason she had to take the crappy low paying job in the first place. In exchange, the powers that be, so to speak have promised to keep him clean. Their method, is to simply take away his ability to become high, no matter what he shoots or smokes. I can understand Edie's need to save her brother keeping her under their thumb. What I can't understand is her constant gullibility in helping the rest of the supernatural community, the ones that have nothing at all to do with her brother or the bargain she made for him. Her brother, although he can't physically obtain any type of high, still retains his shifty untrustworthy ways and tends to walk all over Edie, preying on her sympathy, stealing from her and pawning her things etc..I am so ready for Edie to have some type of screaming breakdown. Enough is enough for crying out loud.Then the ending. I didn't quite understand it, I mean I know what happened. Edie took drastic measures to prevent something happening which might have had devastating consequences. No one thanks her of course, not at all. She ends up being shunned, by the baby vampire queen she is constantly saving. This might have been a blessing in disguise because the vampires are total shits for the most part, but it applied to the entire supernatural community. This I didn't understand. I never read any explanations or had any indication that the vampires were in any position of authority over the weres, shapeshifters, zombies and all the rest, much less the shadows, those controlling the hospital who are keeping at bay the addictions of Edie's brother Jake.This was a huge disappointment to me. I am quite tired of vampires consistently being at the top of the food chain. Especially when there are so many possibilities out there in paranormal land."}, {"userName": "Kit", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/2781023-kit", "userReview": "In all honesty, I'd rate this book just a shade above crap, that is if you're considering it within the realm of a published novel with even a hint of literary merit. If, by chance, you're interested in sub-par porn with an needlessly and poorly executed elaborate plot, then this is the book for you! Seriously, I'm disappointed. The first book wasn't exactly a mind-blowing pieces of literature either, Alexander is certainly not a Dickens, but it was fun and entertaining. The main character was a strong woman, mildly promiscuous, but not slutty, and then Moonshifted happened.The interesting werewolf/vampire dynamic, though elaborated upon in the next book, did not draw me further into the book's universe. I had wrongfully predicted after reading the first book, that I would be interested in the following two, but as it turns out, I no longer have plans to read the third installment. The main character was a total slut in this story, and practically owned up to it. I can assure you, I am no prude, but books like this, where the protagonist seems to have an implicit goal to have kinky sex with a member of every present species in the series before it ends, is part of the reason that the Urban Fantasy genre gets a bad rap. It is becoming a stereotype that I abhor.Also, if an author is going to obviously add a character into the story in order for them to conveniently save the main character, it needs to be done tactfully. It must also not be overused. This is the second time that Alexander has done this. The first instance was Asher, who then played a similar role in the second book as the first, and then the second example was the bear-shapeshifting boyfriend, who had only a tentative attachment to the main character. No doubt Alexander employed this method so that the reader \"wouldn't see it coming\".My intelligence has been insulted. This kind of writing is painfully formulaic and reminiscent of -shudder- Stephanie Meyer. And yet even Meyer employed strategic symbolism. Moonshifted reeks of amateur mimicry, to the point that I've read fanfiction more original than this. My advice, don't read this book, and if you don't believe me, that's fine, go rad it and then afterwards regret having wasted precious moments of your life."}, {"userName": "All Things Urban Fantasy", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/2732683-all-things-urban-fantasy", "userReview": "Review Courtesy of All Things Urban FantasyWhere NIGHTSHIFTED, the first book in the Edie Spence series setup Edie’s crazy life and hospital job, MOONSHIFTED expanded on the danger and supernatural consequences of Edie’s actions as a nurse in the Y4 wing of her hospital. The first book focused heavily on vampires and, while they are featured in MOONSHIFTED I was excited to see my favorite supernatural creatures, werewolves, be the focus of this book. Their introduction and the plot surrounding the issues of werewolf pack leadership really helped increase the scope and detail of the world Edie exists in.The pacing in MOONSHIFTED is quick and the writing is sharp. I especially appreciated the balance maintained between humor and horror as too much of one could have soured the book. There were instances where the gory descriptions of characters needed some levity to maintain the lighter tone of this series.Edie really feels relatable as she consistently makes mistakes and errors in judgement and has to face the consequences of her decisions with intelligence, wit, and some help from her friends. Its almost ridiculously amusing how she tries to stay out of trouble yet every attempt she makes to stay safe brings more supernatural problems to her door…MOONSHIFTED is an excellent continuation of what is fast becoming one of my must read series and it ends on a huge cliffhanger that has me waiting impatiently for the next book in the Edie Spence series, SHAPESHIFTED, coming out June 4, 2013.Sexual Content: graphic sex scene"}, {"userName": "Stacy", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/3864002-stacy", "userReview": "Edie would do anything for those she cares about and that is how she ended up being a nurse in Y4. MOONSHIFTED picks up right where NIGHTSHIFTED ended and is full of action, fantastic characters and situations that will make you want to kick some bad guys were it counts. When Edie and her coworker witness a hit and run outside of the hospital while on lunch break they jump in to help. Not only does the patient end up being someone that belongs on Y4 but his presence is the cause of most of the problems in MOONSHIFTED. This series has been really easy to fall into. The world is fun and full of interesting characters and situations. The heroine Edie is not only human but is new to the paranormal world. She makes friends easily and is really easy to like. After her zombie boyfriend left to save his own butt Edie is feeling alone and left behind. She has a few different romantic interests in book 2 and I honestly liked both but I don't see anything major happening between any of them anytime soon. I really hope zombie man doesn't return though. I would have to rip off one of his arms and beat him over the head with it or something. I was truly shocked with some of the situations that were thrown at Edie in MOONSHIFTED. She tends to handle things with her head held high with her allies by her side.What is up with the ending? What a twist and what a mess after all Edie has been through and sacrificed. We all know that something will happen in book 3 to bring her back into the fold but I cant imagine what that will be. This is a great series to get lost in."}, {"userName": "Beth Cato", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/8706020-beth-cato", "userReview": "I was provided this Advance Reader Copy by the publisher.Alexander begins this book with the same brisk action and unique perspective that made the first book, Nightshifted, so enjoyable. Alexander is a real-life nurse, and brings that realism to her urban fantasy featuring a nurse working on Y4, the top-secret paranormal creature wing of the hospital. There are a gazillion urban fantasies out there right now, and for me that touch of medical realism is what sets this series apart and makes it an engrossing (and sometimes gross!) read.The plot and pace are well-woven here. Edie must balance paranormal shenanigans at work, paranormal shenanigans outside of work, and the urge to save the junkie brother. The only thing I find irksome is Edie's habit of one-night stands. She had to have some kind of personality flaw, I know, but it makes me feel like staging an intervention for her.Also, this book deserves an award for 'most creative use of an MRI machine.'I read a lot of urban fantasies. I've tried to follow a number of series, only to drop them by the wayside. This series--free copies or not--is one I will continue reading. It pleases the fantasy-lover and layman-medical-geek in me alike."}, {"userName": "Krystal Johnson", "userReviewDate": "Jan 14, 2013", "userURL": "http://www.goodreads.com/user/show/14207960-krystal-johnson", "userReview": "Moonshifted is the 2nd book in the Edie Spence series and I LOVED it!! It was such a fun read. The story became more indepth and the ending was unexpected. The ending did what an ending in a series should do....make the reader excited to continue the story. In this novel, we see Edie continuing her dangerous nursing job on y4 the top secret, supernatural floor of the hospital. She witnesses and hit and run while she is on a break that results in a were-war. Edie is in the middle of werewolves, vampires,shadows, daytimers, and even a shapeshifter for good measure. As if that wasn't enough this story takes place around the holidays so you know what that means.....family that doesn't know anything about the supernatural world that Edie has been thrust into. I felt like Alexander really hit her \"writing groove\" with this book it was a much smoother read than part 1 and I would definately recommend it. I will be checking out part 3 when it comes out."}, {"userName": "Lesley", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/4204126-lesley", "userReview": "Moonshifted, sadly, is not as good as its predecessor. The plot of the first book was tight and suspenseful, whereas the storyline in Moonshifted is rather confusing and disjointed. The first installment also had a surprisingly sweet romance that provided some relief from the grimness of the rest of the book. Now that's gone, replaced by a mess of romantic entanglements that don't really do anything for the story. The writing is not as polished, and the whole final quarter of the book felt slapped together, complete with overly dramatic dialogue, moments that were supposed to be emotional but weren't, and rushed explanations that didn't completely make sense. To be clear, I didn't hate this book. In fact, there were parts of it I really enjoyed! But in comparison to the first book, Moonshifted was a bit of a letdown."}, {"userName": "Archer", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/2933557-archer", "userReview": "Great book, started it last night and was half way done before I knew it."}, {"userName": "Ward G", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/45857404-ward-g", "userReview": "This outing had a lot of plot threads running through it.Which to me, makes for better reading.As long as the writer does not lose sight of them.A lot happening in Edie's world.Multiple points of interest, different groups. (Vampires/ weres and others.)Some good story here.Yet again main characters slutty side springs up.Another in detail one night stand.So after two books, multiple lovers or interests.Some readers may enjoy that area.I do not mind it to some extent.Yet same time, not looking for in depth adult chapters either.Other than that a decent and enjoyable read."}, {"userName": "Dark Faerie Tales", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/2766672-dark-faerie-tales", "userReview": "Review courtesy of Dark Faerie TalesQuick & Dirty: Enjoyable main character and world but the plot left me a little confused.Opening Sentence: “Who knew a Code Silver isn’t when an old-timer tries to beat you with their walker?” Charles said as he double-looped his scarf around his neck.The Review:The second novel in Cassie Alexander’s Edie Spence series, Moonshifted, begins with Edie witnessing a hit and run accident. A few months have passed since the events of Nightshifted, Edie has since healed up and returned back to work as a nurse on the Y4 floor of her hospital. Y4 is the secret wing that treats supernaturals and those close to them. Thankfully, Edie and her colleague Charles were the first on the scene of the man hit and run so when they realized he was a werewolf they quickly worked to get him under control and to the Y4 wing.Edie Spence is probably the most unremarkable woman in an urban fantasy series. She doesn’t have anything special that she brings to the plate except for the fact that she is a human that knows about the supernatural. She doesn’t come off as overly pretty, she’s a few pounds overweight but not obese by any means, she doesn’t have a “wow” factor but for some reason, the supernatural is drawn to her. This may come off as harsh but I’m just trying to explain how she is the plainest Jane but down to earth girl in this supernatural world, although she has no problem with cussing and the occasional one night stand. As a third shift nurse she is pretty much a loner, she really only hangs out with her co-workers at work and making friends with the occasional supernatural who gets thrown into her life. In a way I really enjoy the normalcy of Edie because when her life gets turned upside down, it really goes haywire in a way that is often so terrible it is funny. Edie is also a really nice person at heart; whenever someone is in pain or just needs someone to listen to them she is always there, often neglecting something that could be good because she can’t leave someone behind.Moonshifted was a crazy book in that there were several storylines going on at once. The plot was pretty much shrouded in secrecy and didn’t make much sense until the end and even then I still have some questions. The werewolves are undergoing a shift in power while the vampire Anna is making a bid at becoming leader of her own house. There almost seems to be a civil war amongst the two groups while Edie is getting attacked by those on both sides. This novel really does find Edie being rescued a lot by her supernatural “friends” or her calling for their help. She doesn’t really get herself out of any scraps except for one that I can really think of.So far I have really enjoyed how this series is really different from other urban fantasy novels. Anna is a different type of vampire; the wolves have terrible life spans; Shadows control and hide the existence of the supernatural from humans; and the shapeshifter changes into humans not animals, although there were no zombies in this novel as opposed to Nightshifted.I don’t think it is necessary to have read Nightshifted before reading Moonshifted. It could be read as a standalone but I don’t really recommend it. It is easier to understand some of the characters and the Shadows with some more background. And you’ll definitely want to read the next novel with the way this one ended. No cliffhanger here but I don’t know how Edie will survive without help.Overall, not an entirely perfect novel but I enjoyed the flawed Edie and the world that she lives in. I can’t wait to see what is next for her in Shapeshifted.Notable Scene:He looked over to me, and the shadows in the room made his eyes glow copper, like an animal’s in the night. “Don’t worry. I won’t hurt him. He’s already as good as dead.”He patted Winter’s chest again and came back toward the door. Instead of passing me, he grabbed my shoulders and spun me sideways to press me against the room’s wall, pinning me there. To call for help would be humiliating at best, injurious at worst. I remembered Charles’s story about weres saying they didn’t know their own strength afterward, and completely believed him.I squeaked out, “How were the fights?” like a normal conversation with him would be possible now.His face an inch away from mine, he said, “Easy.”He kissed me like he owned me. My head was pressed against the wall behind me, and his tongue ran deep inside my mouth. He only pulled back to tease, his hot breath gentle on my lips, before kissing me again.Half of me wanted to leap outside my skin and run away, or scream. The other half wanted everything else from him, here, now, forget propriety, forget the disgusting hospital floor.He planted his hand against my mouth so I couldn’t scream, and licked up the side of my face. His other hand trailed down my body outside my thin cotton scrubs, stroking my breast, diving between my legs.“You still want me,” he said, finally letting me go.I wiped his spit off my cheek. “People often want what they can’t have.”FTC Advisory: St. Martin’s Press/Macmillan provided me with a copy of Moonshifted. No goody bags, sponsorships, “material connections,” or bribes were exchanged for my review."}, {"userName": "Niquie", "userReviewDate": "May 20, 2017", "userURL": "http://www.goodreads.com/user/show/23868392-niquie", "userReview": "3.5The action was intense and the cyborg was cool and creepy.The ending seems abrupt, like the author wanted to reboot the series for some reason."}, {"userName": "The Book Tart", "userReviewDate": "Nov 21, 2012", "userURL": "http://www.goodreads.com/user/show/7731875-the-book-tart", "userReview": "I LOVE this urban fantasy series by Cassie Alexander! I stumbled upon her debut novel , Nightshifted,late last spring and I devoured it in one gulp.  I've been counting down the months and then the days for the sequel to be released. *Kermit flail* It's here! It's here!OK, do you read urban fantasy? Do you like stories with paranormal elements? What if the paranormal creatures aren't all sparkely or even very nice for that matter? Still game? Then come meet Edie and fall in love.The heroine of these stories is Edie Spence and she's a nurse. She's funny and snarky and brave and stupid and smart and courageous. She just feels real. She makes some decisions without thinking everything through... just like I would. She works hard and tries to do the right thing even when the situation is extremely murky. I connected with her and have been on her side since the beginning.I was immediately drawn into Edie's world. It's very familiar, in fact Edie had no clue of the supernatural until it was brought to her attention in the first novel. We are taken on a journey with her as she gets sucked deeper and deeper into the underworld... And it is UNDER. She took a job working in the sub-basement of her hospital to provide nursing for supernaturals who need medical attention. She works on Y4 because she made a bargain with The Shadows. They saved her brothers life and now she works with the paranormals in the basement. The Shadows protect the hospital because they feed on the fear and suffering and it's a good feeding ground. Edie got a crash course in this new world in Nightshifted and is still trying to come to grips with her discoveries from that adventure.In Moonshifted, Anna, the vampire Edie befriended in the first story, needs Edie to stand with her in an important ceremony. Anna entrusts Edie with a special knife that she needs her to bring to the initiation ceremony on New Year's Eve. Edie recognizes how serious this is to Anna and says she'll do it, even though she's giving up the opportunity to make holiday pay working that night. ;) I adore Edie's way of looking at the world, she's very pragmatic and snarktastic and she acknowledges that this might not be the best idea.\"I'd just pledged my help to a teenage-looking but hundred-year-old vampire whom I knew had a temper and a half. There was no way this could end badly, right?\"Edie was right to be concerned. She really just wants to go to work and go home to get some sleep! But events keep conspiring against that dream. There's vampires and werewolves who are trying to interfere with the ceremony. Therepack leaderred packleader among her patients to care for. There is an extra shift on the above ground floor to handle. And there's her family and Christmas to deal with and the fact that they are spending Christmas dinner at her house and she needs to cover the blood stains on her couch and she doesn't have a dining table! She has a lot on her plate. On top of all that she's mourning the loss of her boyfriend and going from the hope of being an \"us\" back to just a \"me\". Plus she's majorly sleep deprived. I love her spirit and her persistence and determination in the face of all these challenges.I really enjoy the author's writing style. Some of the descriptive passages made me stop and re-read them again so I could capture the visual. Like this one \"The sun was almost gone, just a dull pressing lightness, like the beginning of a migraine, hiding behind thick clouds.\" And the medical scenes? Yep, you can see the blood and almost smell the gore. You can feel the life pulse through this novel.Here are a few more of my favorite lines...♦ “Let me get this straight. You were dating a were . . . bear?” She nodded sorrowfully, her face cradled against the side of the porcelain bowl. “I have to ask. Were there any brightly colored insignias on his chest? Like a rainbow, or an ice cream cone?” “What?” she said, peering up. “You know. Like a Care Bear.”♦ “You know. I got stabbed by vampires. My zombie boyfriend ditched me on his way out of town. did sort of thing.”♦ \"I didn’t know what to wear to a vampire party, so I decided to be comfortable. More jeans, and a bulky sweater. I put my silver bracelet on,\"♦ \"If in the future you have a choice between blatantly warning me about possible death, versus vaguely warning me in a smug fashion, please go with the former.\"I highly recommend Moonshifted if you are interested in a fast paced urban fantasy with mystery, mayhem, family drama, secrets, sex, lies, politics and a very human, very relatable, protagonist who faces the supernatural and doesn't back down or give up!I am eagerly waiting for the 3rd book, Shapeshifted in June of 2013. I need more!(((hugs))) KatThe Queen of Tarts*eARC provided by NetGalley for review*But I purchased this book in print for my keeper shelf :)"}, {"userName": "Nina", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/10944935-nina", "userReview": "InhaltEdie Spence, immernoch Krankenschwester auf Station Y4 (der Station für Vampire, Werwölfe und alles übersinnliche), hilft dieses Mal auf der Station für Werwesen aus. In ihrer Mittagspause wird sie Zeugin wie ein Mann von einem Laster überfahren wird und eilt sofort zur Hilfe. Zu zweit bringen sie den Verletzten schließlich ins Krankenhaus und schließlich wird ihnen klar, dass sie niemand geringeren als den \"König\"/Rudelführer der Werwölfe vor dem sicheren Tod zu retten versuchen... Edie vermutet einen Mordanschlag und erneut ermittelt die mutige Krankenschwester auf eigene Faust!Fazit\"Night Shifted\" Visite bei Vollmond ist der zweite Band der Night Shifted Reihe von Cassie Alexander. Wie schon Band 1 ist dieser Roman sehr außergewöhnlich geschrieben und bringt endlich mal frischen Wind in die Fantasy-Szene. Anders als andere Romane beschränkt sich dieser nicht auf eine Spezies sondern das ganze Buch hindurch werden alle möglichen Formen von fantastischen Wesen angesprochen, zu Hauptfiguren gemacht, in die Geschichte mit einbezogen und vorgestellt. Das ganze wirkt sehr erfrischend, spritzig, spannend und interessant, die Charaktere sind durch die Bank weg sehr tiefgreifend und hintergründig und die Geschichte nimmt so manch spannende Wendung. Band 2 konnte mich noch ein Stück weit mehr faszinieren als Band 1, überzeugt er doch mit seiner spannenderen Geschichte und neuen Charakteren, die die alten jedoch nicht ersetzen sondern wunderbar in das Geflecht der bestehenden Figuren mit eingesponnen werden.Man erfährt noch mehr über die Krankenschwester Edie, kann tiefer in ihre Gedanken- und Gefühlswelt eintauchen und lernt sie im Gesamtbild viel besser kennen. Der Charakter des Gestaltwandler Asher taucht vermehrt auf, bildet sich mehr zu einem der Hauptcharaktere und wird ein ganzes Stück sympathischer, der Leser wird dazu gebracht ihm Vertrauen entgegenzubringen - man muss ihn einfach mögen. Edies Bruder Jake taucht ebenfalls des öfteren auf, seine Drogensucht scheint zwar besiegt doch dieses Mal handelt er mit einer geheimnisvollen Substanz die sich Luna Lobus nennt und noch einige Geheimnisse birgt...Jake macht im Gegensatz zu den anderen Figuren kaum eine Entwicklung durch, er bleibt immer wieder derselbe - was ihn zu einem beständigen Charakter macht, der auch in jedem Roman vorhanden sein sollte. Mir persönlich ist der gute Mann dann aber doch etwas suspekt, ich bin mir nie sicher in welche Schublade ich ihn stecken soll und diese Einstellung änderte sich den ganzen Roman über nicht mehr. Die Figuren von Anna und Sike lernt man ebenfalls besser kennen und trotz ihrer gefährlichen, etwas seltsamen Art verspürt man doch eine gewisse Sympathie, besonders da sie sich trotzallem als loyale Partner erweisen - die Geschichte um die beiden, die mitunter zur Hauptgeschichte gehören begann schon in Band 1 und wird hier weiter ausgeführt. Sehr suspekt war mir dann aber doch die Gestalt des Großvaters, bzw. die des Guideon - irgendwie waren mir die \"Vorgänge\" dieser \"Personen\" dann doch etwas zu weit hergeholt und überstiegen stellenweise einfach meine Vorstellungskraft. Mir persönlich blieben um diese/n Charakter(e) zuviele Fragen offen und ich hoffe fast ein bisschen, dass sich das im dritten und abschließenden Band der Reihe dann doch noch etwas klärt.Die Werwölfe rückten in diesem Band besonders in den Vordergrund, meiner Ansicht nach eine sehr gute Idee, vorallem da in Band 1 die Vampire dominierten. Die Werwölfe wurden sehr gut und glaubwürdig beschrieben, man konnte sie schon fast vor sich sehen, sie riechen und spüren. So manches Mal entgleiste meine Fantasie tatsächlich soweit, dass ich mich in dieser Welt wiederfand und sie einfach spüren wollte - fast als müsste ich nur die Hand ausstrecken und nach ihnen greifen.Eine Liebesgeschichte tritt dieses Mal nicht auf, lediglich das ein oder andere Beziehungs-Drama von anderen Protagonisten bzw. Techtelmechtel von Edie. Dies stört jedoch nicht den Fluss der Geschichte, man muss ja schließlich nicht immer eine Liebesstory dabei haben, sofern die erotischen Szenen trotzdem passend eingebaut sind - was in diesem Roman durchaus der Fall ist. Blutig ist es aber nach wie vor - alles andere wäre schließlich auch langweilig. ;-)Band 1 \"Medizin um Mitternacht\" sollte man unbedingt gelesen haben, ansonsten werden viele Beziehungen und Verbindungen nicht klar und die Geschichte erscheint unvollständig da zuviele Hintergrundinformationen fehlen. Der Roman \"Visite bei Vollmond\" wurde flüssig und in gut verständlicher Sprache verfasst, die Kapitel sind ausreichend lang und die Schrift ist groß genug gewählt. Die Wortwahl finde ich sehr gelungen, die Autorin schreibt mit Witz und schafft es auch in spannenden Situationen immer die Spannung aufrecht zu erhalten."}, {"userName": "LilyElement", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/5639357-lilyelement", "userReview": "Moonshifted is book 2 in the Edie Spence series. I read book one awhile back and enjoyed that the leading lady is a human nurse dealing with a bunch of paranormal beings. I wound up grabbing the audiobook of this installment from the library and I'm so glad I did. This time around we're dealing heavily with the werewolves and a bit about vampires. And man Edie Spence manages to always get in trouble.Edie Spence is a nurse in the Y4 wing of the hospital, her floor handles all the paranormal beings that humans know nothing about. While out with a coworker they see a man get hit by a car and find out he's a werewolf. After rushing him back to their floor of the hospital and stabilizing him they find out he's not just any werewolf, he's the alpha of the local pack. There is a power struggle going on amongst the werewolves and Edie is smack dab in the middle of it all. She's having to pick which side to trust but has no proof that it's the right choice until possibly too late. If that's not enough, she's also dealing with the vampire she helped save in book one as well as issues with her brother.Moonshifted was a delight to read and I cannot wait to get my hands on the next book. It does leave off where the series could have ended so I had to look up immediately to see if there was another book. I'm glad there is since I can't seem to get enough. It's really refreshing to read an Urban Fantasy book with a human character dealing with paranormal beings. I feel like most of the books in this genre have a paranormal being as the leading character and they wind up being super powerful by the end of the series. I do like how this installment revolves around the werewolves, with some vampire action on the side. It helped get a firmer grip on the paranormal aspects of the series since book one was about the vampires. All in all, this was a solid addition to the series and I'd recommend it to anyone looking for a good Urban Fantasy read."}, {"userName": "Blood Rose Books", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/6216782-blood-rose-books", "userReview": "This is the second novel of Cassie Alexander's Edie Spence series. You will need to read the first book, Nightshifted, before this one as the first book sets up where Edie's life is, with her world, work and relationships.In the second book Edie not only has to worry about the Vampires but the Were have also come to call:Y4 nurse Edie Spence is just looking forward to getting back to work after surviving a vampire attack, she expects things to just get back to normal; Well as normal as working with paranormal creatures can be. When Edie witnesses a hit in run that just happens to involve the leader of the wolf pack, Edie does everything to help him survive but things are looking very grim. This starts a battle for not only the power within the pack but also with the paranormal within the city and all the targets seem to be posted on Edie's back as she now has connection to both. Edie doesn't know how she is going to survive attacks on all fronts especially to top it all off Dren is back and he is looking to settle a debt with Edie as she cost him his hand and his hound. With no one to trust or rely on, Edie better watch out everything in her life is about to be tested to the extreme and only time will tell if she can survive it all.This book is another easy read like the first, which is sure to entertain but I feel like this series is going to be more for those who like paranormal romance than those who just want the paranormal genre. I do not think that this book is as good as the first. I found that this book was not as funny as the first book and lacked the action that occurred within the first book. I think it took about half of the book before there is really any sort of action and for the mystery aspect within the plot to actually start, so I was often left wonder okay when is it going to get good, when is everything going to start. However, I will say the mystery and action within the second half of the book was really good and interesting, I just would have liked it to be more constant throughoutI still really like Edie as a character. She has complex relationship with everyone around her in both the normal and paranormal world. I question whether she is actually able to have a normal relationship, possible the closest one is with some of the people at work that seem to be developing but when you work on Y4 how normal can those relationships be. I love that Alexander keeps Edie as human as possible, and it does not seem to be anything that is going to change. Having Edie be human and it appears with no plans to change that, is what sets this series apart from other books in the paranormal genre where the human either end up as food, or have some form of power(s). It's nice to have the human aspect stay constant and it is funny how that it the unique characteristic within this series.I'm not sure what changed in Alexander's writing style but I found that there was a lot more sex in this book than the first one and all of a sudden Edie is very sexually charged/promiscuous. I know in the first book there was talk and one sex scene, I just found that in this book every paranormal male that Edie ran into she all of sudden wanted to sleep with them. I just found this counter to what Edie was like in the first book or at least Alexander began to expand on the scenes sex now. I do not think that this book was as good as a first and that there was just something missing overall in the book, I think that those who liked the first will also enjoy this book if they like more of the paranormal romance genre. I will continue to reading this series as I personally like Edie and her attempt to stay human at all costs, which is very refreshing, but I do not think that I will continue reading if the sex turns into something like the Laurell K. Hamilton Anita Blake series did.Enjoy!!!"}, {"userName": "Kristie Elston", "userReviewDate": "Dec 25, 2013", "userURL": "http://www.goodreads.com/user/show/4414132-kristie-elston", "userReview": "Originally reviewed at Dark Faerie Tales: http://darkfaerietales.com/review-moo...Quick & Dirty: Enjoyable main character and world but the plot left me a little confused.The Review:The second novel in Cassie Alexander’s Edie Spence series, Moonshifted, begins with Edie witnessing a hit and run accident. A few months have passed since the events of Nightshifted, Edie has since healed up and returned back to work as a nurse on the Y4 floor of her hospital. Y4 is the secret wing that treats supernaturals and those close to them. Thankfully, Edie and her colleague Charles were the first on the scene of the man hit and run so when they realized he was a werewolf they quickly worked to get him under control and to the Y4 wing.Edie Spence is probably the most unremarkable woman in an urban fantasy series. She doesn’t have anything special that she brings to the plate except for the fact that she is a human that knows about the supernatural. She doesn’t come off as overly pretty, she’s a few pounds overweight but not obese by any means, she doesn’t have a “wow” factor but for some reason, the supernatural is drawn to her. This may come off as harsh but I’m just trying to explain how she is the plainest Jane but down to earth girl in this supernatural world, although she has no problem with cussing and the occasional one night stand. As a third shift nurse she is pretty much a loner, she really only hangs out with her co-workers at work and making friends with the occasional supernatural who gets thrown into her life. In a way I really enjoy the normalcy of Edie because when her life gets turned upside down, it really goes haywire in a way that is often so terrible it is funny. Edie is also a really nice person at heart; whenever someone is in pain or just needs someone to listen to them she is always there, often neglecting something that could be good because she can’t leave someone behind.Moonshifted was a crazy book in that there were several storylines going on at once. The plot was pretty much shrouded in secrecy and didn’t make much sense until the end and even then I still have some questions. The werewolves are undergoing a shift in power while the vampire Anna is making a bid at becoming leader of her own house. There almost seems to be a civil war amongst the two groups while Edie is getting attacked by those on both sides. This novel really does find Edie being rescued a lot by her supernatural “friends” or her calling for their help. She doesn’t really get herself out of any scraps except for one that I can really think of.So far I have really enjoyed how this series is really different from other urban fantasy novels. Anna is a different type of vampire; the wolves have terrible life spans; Shadows control and hide the existence of the supernatural from humans; and the shapeshifter changes into humans not animals, although there were no zombies in this novel as opposed to Nightshifted.I don’t think it is necessary to have read Nightshifted before reading Moonshifted. It could be read as a standalone but I don’t really recommend it. It is easier to understand some of the characters and the Shadows with some more background. And you’ll definitely want to read the next novel with the way this one ended. No cliffhanger here but I don’t know how Edie will survive without help.Overall, not an entirely perfect novel but I enjoyed the flawed Edie and the world that she lives in. I can’t wait to see what is next for her in Shapeshifted."}, {"userName": "Angela Carr (Under the Covers Book Blog)", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/4119085-angela-carr-under-the-covers-book-blog", "userReview": "Review also posted at Under The Covers Book Blog “Edie Spence series is for sure one of the best UF books around.” ~Under the CoversMoonshifted is the second installment of Edie Spence series. Ms. Alexander delivered another well written and engaging story. She managed to make this book even better with a more detailed but complex plot. I devoured it in about two and half days which is big for me considering I’m a slow reader.Edie continues to get her nursing experience working at a secret unit called Y4 where her patients are of the supernatural kind. If you read Nightshifted (book1), you know that Edie is a special nurse. She is a patient advocate and she goes above and beyond her duties. She is good at what she does and can handle high stress level situations. Well, she definitely proved that here when chaos occurs at her work as well as her personal life.The world building is more in-depth in this installment. Ms. Alexander definitely widened the world, it’s not just limited to the patients in Y4 but even beyond the hospital walls. Edie is more involved with the faction of vampires’ and the wolves’ hierarchies during the overturn of leaders. Along with the caring for a patient who happens to be the Alpha of his pack; she also promised to be responsible and be a part of a vampire coronation ceremony. Both factions are involved in a power struggle that is of course brewing into war. Edie just finds herself in the midst of all the chaos. I’m telling you, they all seem to flock to her for help. While she does well with this type of chaos, I can’t say the same for her love life.She still doesn’t have one. After her zombie boyfriend left her she just can’t seem to shake him off. Not that she doesn’t have any choices, in fact, she has two good candidates. Asher, a sexy shifter is at her beck and call. And Lucas, a wolf up for the Alpha leadership position is also very interested. It’s frustrating to see her attraction for them but not able to give a relationship a chance. I mean, both men are super sexy, very powerful and did I mention sexy? I just totally disagree with her sleeping around and I can’t wait for her to give love a chance. *Preferably with Asher*Edie’s co-workers, her brother and even her mom were fun to read about. They are so easy to love or hate (as far as her brother goes). Ms. Alexander is obviously knowledgeable about nursing care but what awes me is her incorporation of it into a paranormal world. It was really cool to see how protocols are handled when your patients are supernaturals. Ms. Alexander ended this book with a bit of a cliffhanger. There were some decisions that seemed final and I’m curious to see how she will pull Edie out of that situation.I enjoyed every bit of this book. The plot is very intriguing, full of action and a good amount of smexy. Edie Spence series is for sure one of the best UF books around.*ARC provided by publisher"}, {"userName": "Miki", "userReviewDate": "Sep 29, 2013", "userURL": "http://www.goodreads.com/user/show/6101808-miki", "userReview": "This Review was first published on my blog Lecture toute une AventureMy opinion:  To start with the positive, i greatly enjoyed the plot in this book, the fact the werewolves were predominant could help ^^ but i enjoyed it and getting Bear-weres was more than interesting. Thanks to Gina and Lucas we learn more about how weres are mad, how it can be transmitted in this universe. So after focusing on vampires in book1 now it’s on were, going progressively is a good idea in my opinion since there is a lot to learn and like Edie we get it slowly. I also really enjoyed finding Asher back, still the same. He is really a good back up for Edie and I would love if she was more grateful to him. She is interested partly but she fears him and not being sure which appearance is real is disturbing for her… I can get that but only to a point. I mean he is oki when she needs help but she has difficulties to consider him as a friend…and when she does she still has reservations, not fair.Anna was also a character I was pleased to see even more that she is perfectly coherent with how she was described in Nightshifted. In book 1 I has a small preference for grand father , and he didn’t disappoint me in this one except for a detail… i admit the mixing with Gideon was surprising and it’s still surprising but i thought he was there for Edie, now he is with Anna since Gideon is part of her house…. Edie get left behind so i wonder where his loyalty lies and I’m a little afraid.The rhythm is not too fast even if we do get lot information at the same time, the action is fast paced and Edie takes time to start thinking about consequences and everything that’s happening around her… but she is still strong willed and quite selfless, trying to help everyone. Oh and we get to see the superior of the shadows and i loved that part…So after so many positive elements why not an higher score? I’m fed up with Edie’s love life if we can call it that. I mean in book one she has a one night stand with a shapeshifter the she is in a relationship with a zombie… so far i can accept but then because the said zombie left she jump on a were and nearly try to start again with Asher….and when she does she is crying after. Oki she is a grown adult woman, yes she can have needs but a new supernatural creature each time? Worse: one that could start a change and she won’t be human… yes she doesn’t know all the specifics since she was interrupted in her chat with Gina but still she is a nurse so she should know better and sleeping around isn’t something i agree with so her behaviour on that part didn’t sit well with me at all. So if you want a good urban fantasy, different creatures, some steamy scenes a great plot and don’t mind an heroine like Edie, this book is a more than enjoyable reads.Score: 3,5/5Disclaimer: All opinions are my own and no compensation was received in exchange for this review"}], "description": "Check in to County Hospital’s secret ward—where paranormal activities lead to medical emergencies for one tireless nurse…After surviving a brutal vampire attack, Nurse Edie Spence is ready to get back to work—attending to supernatural creatures in need of medical help. But her nursing skills are put to the test when she witnesses a hit-and-run on her lunch break. The injured pedestrian is not only a werewolf, he’s the pack leader. And now Edie’s stuck in the middle of an all-out were-war…With two rival packs fighting tooth and nail, Edie has no intention of crossing enemy lines. But when she meets her patient’s nephew—a tattooed werewolf named Lucas with a predatory gleam in his eye that’s hard to resist—Edie can’t help but choose sides. The question is: can she trust this dangerous new ally? And can she trust her own instincts when she’s near him? Either way, Edie can’t seem to pull away—even if getting involved makes her easy prey…", "title": "Moonshifted\n      \n          (Edie Spence #2)", "url": "https://www.goodreads.com/book/show/13539457-moonshifted", "average": 3.81, "cover": "https://images.gr-assets.com/books/1334629255l/13539457.jpg", "reviews": 178, "authors": [{"url": "https://www.goodreads.com/author/show/4517253.Cassie_Alexander", "name": "Cassie Alexander"}], "type": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Shapeshifters"], "outlinks": ["http://www.goodreads.com/book/show/13539457-moonshifted", "http://www.goodreads.com/book/show/15792749-moonshifted", "http://www.goodreads.com/book/show/15884858-moonshifted", "http://www.goodreads.com/book/show/13049984-nightshifted", "http://www.goodreads.com/book/show/12905583-nightshifted", "http://www.goodreads.com/book/show/15831550-shapeshifted", "http://www.goodreads.com/book/show/17376132-deadshifted", "http://www.goodreads.com/book/show/17566943-bloodshifted", "http://www.goodreads.com/book/show/31327589-dark-ink-tattoo-book-1"]}