{"ratings": 94, "userreviews": [{"userName": "Melinda Evaul", "userReviewDate": "Sep 07, 2011", "userURL": "http://www.goodreads.com/user/show/5053082-melinda-evaul", "userReview": "Lynn Dean paints an excellent picture of post Civil War heartache. Eliza and Jake strive to recover from their individual losses and find each other through clever twists of irony. Dean's true-to-life characters embody the spiritual lessons faith and forgiveness through adversity. “More Precious Than Gold” portrays the hardships of the west and the fortitude of pioneers who forged into wilderness lands seeking new beginnings. Lynn Dean gives us a tender love story along with the reality of people living in a sin filled world. When Eliza faces the challenge of a physical and emotional journey into new territory, she becomes a woman with the strength and courage to ultimately forgive God and those who brought tragedy to her family. Don't miss Dean's colorful characters who leap from the pages of this beautifully written and historically accurate novel."}, {"userName": "Grace", "userReviewDate": "Feb 14, 2012", "userURL": "http://www.goodreads.com/user/show/1223317-grace", "userReview": "After loosing her Mother then her fiance in the war Eliza leaves her father, the only family she has, and heads out west to start a new life. She plans to live with her Uncle and Aunt and spend time with her favorite cousin who she feels will help her work through her grief. Then Eliza suffers loss once more as she finds out her cousin died while giving birth to a baby girl. Eliza stays in Colorado to help out her Uncle and Aunt while he recovers from an accident. Then she meets Jake her cousin's widower and becomes good friends with him but is she betraying her family while they are still grieving themselves. As she and Jake become more than just friends he reveals a secrete that may destroy their relationship forever. Will Eliza be able to forgive as she has been taught and love Jake or will her fear and bitterness cause her to loose yet another soul?Post civil war days when times were hard and sin was prevalent. During the days when others journey to the west in hopes of starting a new beginning. As Eliza goes on this physical and emotional journey across the wilderness will she have the courage to stand strong and forgive man and God who she feels have let her down through the years? Will she find that maybe her new destiny includes helping others and not just starting over herself. You don't want to miss this novel of pioneer days and the love and faith that kept them strong."}, {"userName": "Lynn Dean", "userReviewDate": "May 31, 2012", "userURL": "http://www.goodreads.com/user/show/9911226-lynn-dean", "userReview": "This is my own book, so of course I loved it (though Book 2 in the series, Stronger Than Mountains, will be even better)!Though this story has a strong romantic thread, it is a true historical, weaving together actual events and characters through the eyes of a fictitious heroine to show how people can forgive and heal even when they have been the victims of great wrongs."}, {"userName": "Nike Chillemi", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/3279807-nike-chillemi", "userReview": "Eliza Gentry seeks to find her purpose, or God's purpose for her. First her mother died than her betrothed was killed in the Civil War and her faith was shaken.I felt the story got off to a bit of a slow start but that may have been unavoidable as the author has to set up a certain scenario which will play out later. Eliza's preacher father stands against racial prejudice in the Waco, TX and is seen by many as a northern sympathizer. Texas had sided with the south in the Civil War. With Union soldiers patrolling Waco and tensions running high, he sends Eliza to live with her aunt for safety sake.The pace picks up when Eliza arrives in New Mexico where it seems life can be just as harsh as she'd experienced before. The author paints an excellent picture of the lawlessness of the early west. As a historical suspense writer, I appreciate what had to be voluminous research on the author's part."}, {"userName": "Terri Harr", "userReviewDate": "Jan 21, 2012", "userURL": "http://www.goodreads.com/user/show/5227214-terri-harr", "userReview": "I got this book on my new Kindle because of the reference to the Sangre de Cristo mountains. I fell in love with those mountains in Colorado. The part of them in this story are actually in New Mexico. This was a wonderful book. The characters are great. This is a book about loss and starting over. God sees our whole lives from start to finish but we can't see how certain things are going to work for good like He can. It is also a book about how we can be a light to others in the world. We can make a difference even if it is just planting a small seed. God can use that small seed and bring it into full bloom."}, {"userName": "Krisi Keley", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/3994950-krisi-keley", "userReview": "Wonderful action/adventure historical romance! Full review coming soon."}, {"userName": "Pat Dyer", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/7527639-pat-dyer", "userReview": "One of the best books I have read."}, {"userName": "Tiffany Wacaser", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/905125-tiffany-wacaser", "userReview": "I definitely enjoyed this book, though its strengths were balanced by its weaknesses.More Precious Than Gold tells the story of a young Texan woman, Eliza, who struggles with the aftermath of the Civil War. Her fiance had been killed in the war and she feels lost and without purpose. Her father who is a pastor convinces her to move to New Mexico to live with her aunt and uncle so she can rebuild her life. In New Mexico, she's confronted the reality of gold mining town, a little boy who suffers physical and emotional abuse from his father, and challenges which test her courage, faith, and strength. There is a sweet love story.Strengths: I like how the author portrayed the struggle of Eliza to rebuild her life and seek for purpose and meaning in her life without a husband or children, both of which she desperately wishes for. Eliza struggles with her faith and wants to be faithful and trusting in God. The characters were well-developed. Genuine grief and joy are portrayed convincingly. Perhaps one of the greatest strengths of the book is how Eliza, at great risk to herself, seeks to help others. The sub-plot of helping a young Indian/white boy is compelling and interesting. Weaknesses: The love story itself is tender and sweet. However, the author creates a series of coincidences that are too over-the-top to believe and aren't convincing, and only serve to weaken the love story. I found Eliza's constant attempts to rationalize how God has a hand in every aspect of her life unconvincing. Perhaps that runs counter to my own beliefs about how choice operates. I don't think God always intervenes in matters of life and death and allows things to happen because we are mortal and make choices and then have to live with the consequences. That said, I do believe that God can and does turn sorrows and tragedy into blessings if we allow Him to do so and are humble. However, my own contrary opinions aside, I imagine the average LDS reader wouldn't be bothered by this.The love story felt rushed in that Eliza's new love had barely been a widower for 8 months. But I'm willing to cut a little slack for the author in this one because while it did seem rushed, it wasn't entirely unbelievable. And finally, the title of the book is just a cliche. When finishing this review Goodreads pulled up other books with the same title and the list was just a little too long. But this may or may not be the fault of the author.This book is solid but not remarkable."}, {"userName": "Sabrina Guthrie", "userReviewDate": "Oct 01, 2015", "userURL": "http://www.goodreads.com/user/show/9935988-sabrina-guthrie", "userReview": "A truly inspirational read. God proves that even through tragedy, life can be filled with many riches. This was a tragically beautiful story filled with heart ache, war, prejudice, but most importantly forgiveness. It was an amazing love story about starting over. A truly awesome read."}, {"userName": "Phil Evaul", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/32067275-phil-evaul", "userReview": "This is a good read. Lynn's characters are believable and real. Her story moves along and develops those characters. We become acquainted with - friends with her characters. The historical setting is accurate, thanks to Lynn's careful study of Texas history."}, {"userName": "Linda", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/2558245-linda", "userReview": "I enjoyed this book very much. When I read Christian fiction, I prefer stories that are more realistic. For me, this is one of those books."}, {"userName": "Helen Haste", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/10943821-helen-haste", "userReview": "I read half of this. Got far to slow and could see it was going to end up been a romance."}, {"userName": "Becky", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/11874572-becky", "userReview": "Wonderful story about starting over after great heartache and God's grace and love."}, {"userName": "Shelby Stafford", "userReviewDate": "Jul 20, 2012", "userURL": "http://www.goodreads.com/user/show/2543446-shelby-stafford", "userReview": "Three and a half stars"}, {"userName": "Melody Cox", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/16879913-melody-cox", "userReview": "This is a good read. It is well-written and held my attention throughout"}], "description": "NOW ALSO AVAILABLE IN PAPERBACK! The bullet that killed Eliza Gentry's fiance shattered her dreams as well. Clinging to her battered faith, she heads west to escape her grief and runs headlong into the man who caused it. Tall and headstrong, Eliza expected to remain an \"unclaimed treasure.\" Devastated in the wake of the war, she sets out for New Mexico's Sangre de Cristo mountains in search of peace and new purpose but finds that the western frontier is a wild place where former enemies--Yankees and Rebels, Freedmen and Indians--square off in the quest for land and gold. Eliza must confront her prejudices and fears, and Jacob Craig embodies that conflict. The mountain man wins her trust with his gentle strength, but he harbors a secret. As a Union sharp-shooter, he met her fiance on the field of battle and cost him his life. Eliza must learn that she will not find purpose or peace anywhere until she finds in God a faith more precious than gold. A real ghost town comes to life in this award-winning story of love, forgiveness, and the sovereignty of God.", "title": "More Precious Than Gold", "url": "https://www.goodreads.com/book/show/12329684-more-precious-than-gold", "average": 4.07, "cover": "https://images.gr-assets.com/books/1337934373l/12329684.jpg", "reviews": 16, "authors": [{"url": "https://www.goodreads.com/author/show/4607067.Lynn_Dean", "name": "Lynn Dean"}], "type": ["Christian Fiction", "Romance", "Historical", "Romance", "Christian"], "outlinks": ["http://www.goodreads.com/book/show/12329684-more-precious-than-gold", "http://www.goodreads.com/book/show/17785421-home-sweet-hole---a-folio-of-feasible-fantasy-floor-plans", "http://www.goodreads.com/book/show/34934809-stronger-than-mountains", "http://www.goodreads.com/book/show/20102081-home-sweet-hole", "http://www.goodreads.com/book/show/29873865-how-to-raise-a-hero", "http://www.goodreads.com/book/show/23690789-nabbing-saint-nickolas"]}