{"ratings": 520, "userreviews": [{"userName": "Shana Festa", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "I'm a total Shawn Chesser geek. I'm not ashamed of it! He writes incredibly exciting and action-packed novels. His latest release in the Surviving the Zombie Apocalypse series, Mortal, delivered as expected.Mortal is full of action and likable characters. His story line is well thought out and gripping. Well into the series, Chesser wastes no time with introductions or build up. Because, frankly, it's already there. his books end in such a way that readers are left with no choice but to read new installments to find out what comes next. Mortal starts with a bang...or rather, a crash. The helicopter containing a small military team goes down in a graveyard and (the men that live through the crash) must get back to base.Chesser's work is less outright zombie horror and more strategic. A game of Risk, anyone? I know zip about the military. But Shawn's expertise in that area makes it easy to slide into the action. Just call me General Monster!There were moments in Mortal that had me downright laughing. His use of a character named Lieutenant Ben Dover. As soon as I saw the name, I lost it. I gave him a little golf clap for having the balls to use it. I was literally rofl'ing over here. I rated Mortal four stars. I still love the series, but it felt as if something was missing. One big battle, some more shock and awe. Don't get me wrong, Mortal was still full of great action, but there could have been more. Maybe I'm just being selfish because I have expectations solidified from his previous work. Does it change my opinion of the author? Nope. Does it make me question if I will read future books in the series? Hell no. I'm all in!bookie-monster.com"}, {"userName": "Paddy", "userReviewDate": "Dec 20, 2013", "userURL": "http://www.goodreads.com/user/show/10709177-paddy", "userReview": "Book 6 in the series and still the action keeps coming thick and fast. Not a book that would make a lot of sense without reading the story from the beginning, but a good reason to do so! As ever the characters in this series are struggling to survive a zombie apocalypse and ever step forward they make means two steps back. It's a gripping story that I have found so hard to put down. Danger in every imaginable form comes at them relentlessly in the form of the walking dead, bandits and a megalomaniac that wants to own the USA.The main good guys are living in Schriever air force base where the latest President, government and armed services that are still alive have grouped.They are trying desperately to find a cure to the disease that has caused the living to turn into gut munching zombies. As ever when man really needs to band together there're those that are just interested in their own agenda making life on the road a very dangerous place even if you've found a Ford F650 to drive! Simply unputdownable, and I can't wait for the next installment"}, {"userName": "Nate", "userReviewDate": "Jan 01, 2014", "userURL": "http://www.goodreads.com/user/show/11050710-nate", "userReview": "The idiotic finale of the prior book sets the stage for much of Mortal. I struggled through the Draper chapters, taking frequent breaks due to my lack of interest in the that storyline and lost empathy for its characters. Meanwhile Brook & Raven's story back at the base offered a sharply contrasting experience, though nothing particularly happened except Brook starting to grate on nerves in a Real Housewives sort of way. Eventually the Eden location came into focus and piqued my interest. I'd give that story 3 stars so far. But overall I didn't care for 2/3 of this book. The good news is things leave off in a way that gives me hope the series will get back on the right track again in Warpath. After already investing the time reading 6 books in the series so far, I may give that a try."}, {"userName": "Wade Newman", "userReviewDate": "May 06, 2014", "userURL": "http://www.goodreads.com/user/show/11692226-wade-newman", "userReview": "Excellent continuation of the \"Surviving the Zombie Apocalypse\" series. Shawn Chesser demonstrates his ability to entertain you with his knowledge of military operations and intricate plot regarding a post apocalyptic USA fighting both a Zombie outbreak and a hostile takeover from a rogue organization. The Hero's in the story are real life and passionate about protecting family and country. Great read for anyone both military and civilian."}, {"userName": "Jessica Kong", "userReviewDate": "May 20, 2015", "userURL": "http://www.goodreads.com/user/show/12752266-jessica-kong", "userReview": "Mortal, the 6th installment to Surviving the Zombie Apocalypse by Shawn Chesser, is a sad one. Not as sad as when Mike died, but my heart went out to those who lost their lives in this book. I think you all may agree with me. Why do zombie authors love to torment us readers by killing off our favorite characters? And why do we, as readers, continue to read their books? Because like Shawn Chesser, they are great storytellers. And we are suckers for a great horror story. :)"}, {"userName": "DONNA j hALL", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/27044692-donna-j-hall", "userReview": "Great storyI have read a lot of zombie stories this series reminds me of the walking dead I would recommend this book to everyone"}, {"userName": "Kevin Nunn", "userReviewDate": "Mar 10, 2016", "userURL": "http://www.goodreads.com/user/show/53583301-kevin-nunn", "userReview": "Same as the first 6 books. They are great and I want to read them all."}, {"userName": "Maggie4072", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/27760078-maggie4072", "userReview": "Always love Shawns books! When I have finished one, I cannot wait for the next one, they do not come fast enough!"}, {"userName": "Vicki", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/5273859-vicki", "userReview": "It was really good , Like I said before love this whole series. I was disappointed in one thing . I thought it was the last book in the series, and I did not like the way , this one ended !"}, {"userName": "Chrystal Roe", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/26215058-chrystal-roe", "userReview": "ExcellentLots of scary action takes place in this book. Our friend Cade has some serious problems and cuts it way close a time or two."}, {"userName": "Michele Heeder", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/17107776-michele-heeder", "userReview": "Great story, well written. Spoiler, we lose some people we care about. As usual from Shawn, we have a hell of a cliffhanger ending."}, {"userName": "Lori Franklin Hopkins", "userReviewDate": "Apr 08, 2014", "userURL": "http://www.goodreads.com/user/show/28093908-lori-franklin-hopkins", "userReview": "Another great installment from Mr. Chesser. A good, solid read in the world of Surviving the Zombie Apocalypse! This is a great series and cannot wait to read the next one!"}, {"userName": "David Colenutt", "userReviewDate": "Dec 30, 2013", "userURL": "http://www.goodreads.com/user/show/16549379-david-colenutt", "userReview": "Great book, can't wait for the next one."}, {"userName": "Wilson E. Stevens Sr.", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/2224191-wilson-e-stevens-sr", "userReview": "Continued to be a good series. This book was better than the last book, so I gave it a 5* rather than a 4*. Thinking of going back and changing the last book to a 3*, but will leave it for now."}, {"userName": "Mark Kearney", "userReviewDate": "Dec 18, 2013", "userURL": "http://www.goodreads.com/user/show/13378996-mark-kearney", "userReview": "Great book in a great series say no more"}], "description": "Edited by Monique Happy Editorial Services 114,000 words. Approx. 456 pages. Mortal, book 6 in the Surviving the Zombie Apocalypse series picks up right after \"Allegiance: Surviving the Zombie Apocalypse\" left off. Warning Spoilers Ahead. Outbreak Day 16: With an estimated ninety-nine percent of the United States population having already succumbed to the Omega Virus and reanimated to form roving hordes of flesh-eating monsters, two groups struggle against long odds to survive the zombie apocalypse. Returning from a mission to secure the brain power necessary to replicate an antiserum that has successfully brought one Omega infected man back from the brink of death, the stealth helicopter carrying Captain Cade Grayson and his small team of Delta Force operators responsible for successfully pulling off the daring feat goes missing. And fearing that the helo has gone down in the zombie infested countryside, somewhere near Pierre, South Dakota, life or death for the men may depend on a decision made by Major Freda Nash five hundred miles away. Will she send all available resources to search for the missing Ghost Hawk and the eight men aboard? Or will she be forced to weigh on the side of mankind and shift the focus solely on seeing that the aircraft carrying the scientists rescued from the NML, Canada’s counterpart to the Centers for Disease Control in Atlanta, makes it safely back to Schriever Air Force Base where it originated from? Meanwhile, awaiting Cade’s return at Schriever AFB, Brooklyn Grayson and daughter Raven are making final preparations to leave Schriever for a compound near Eden Utah when a man in uniform shows up on their doorstep, unannounced, and bearing awful news. Simultaneously, four hundred miles northwest of Schriever at the Eden compound, Logan Winters and his brother Duncan along with a group of survivors newly arrived from Jackson Hole struggle to adapt to living with the threats posed by the insatiable dead as well as a group of marauders hell bent on taking everything they hold dear. Come along and find out who is mortal and who survives to fight another day.", "title": "Mortal\n      \n          (Surviving the Zombie Apocalypse #6)", "url": "http://www.goodreads.com/book/show/19544561-mortal", "average": 4.4, "cover": "https://images.gr-assets.com/books/1501746172l/19544561.jpg", "reviews": 16, "authors": [{"url": "https://www.goodreads.com/author/show/5095036.Shawn_Chesser", "name": "Shawn Chesser"}], "type": ["Horror", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/19544561-mortal", "http://www.goodreads.com/book/show/24533815-mortal", "http://www.goodreads.com/book/show/23338453-trudge", "http://www.goodreads.com/book/show/24810926-a-pound-of-flesh", "http://www.goodreads.com/book/show/22597115-warpath", "http://www.goodreads.com/book/show/23338452-soldier-on", "http://www.goodreads.com/book/show/23173847-in-harm-s-way"]}