{"ratings": 29, "userreviews": [{"userName": "Amanda", "userReviewDate": "Aug 25, 2017", "userURL": "http://www.goodreads.com/user/show/5493315-amanda", "userReview": "I really enjoy learning about Lincoln and his family. I liked this book because it really focused on Mary Todd Lincoln. It shared her story from the time of their difficult courtship until her old age. Instead of portraying her as crazy like a lot of books do. This one took a lighter approach and tried to show things from her point of view."}, {"userName": "Pamela", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "If ever there was a book that deserved consideration of republishing, exciting fans of literary-quality historical fiction, it would be \"Mr. Lincoln’s Wife” by Anne Colver. I can think of several friends who would enjoy reading this enthralling and insightful fictionalized biography of Mary Todd Lincoln, but considering it was published in 1943, then again in 1965, it might be a challenge acquiring an affordable copy in good condition. But it would be certainly worth the attempt. “Mr. Lincoln’s Wife” opens in Springfield, Illinois, 1837, to a family dinner hosted by Elizabeth Todd Edwards, where the reader is immediately privy to the powerful influences of Todd women from Kentucky - women who are known to be strong, tenacious, outspoken trend-setters lording over social graces, fashion, household decorum, and the bolstering of their husband’s status and careers. And it is also humorously plain to see that Elizabeth is the Todd matchmaking monarch, especially when it comes to her younger sisters. Mary Todd, however, doesn’t cozy to Elizabeth’s emblematic matchmaking. She wants no part of Mr. Edwards or any other upper-echelon trophy on her dance card. To Elizabeth’s horror, Mary becomes fascinated with the gangly, homely, backwoods speaking, gadabout Mr. Abe Lincoln. And no matter how much Elizabeth tries to sway Mary otherwise, Mary won’t budge an inch. Nothing or no one is going to stand in Mary’s way of getting what she wants – not even the lackadaisical, socially inept and slow-to-commit Mr. Lincoln himself. Of course, most Americans and many history buffs abroad know that Mr. Lincoln (a then practicing attorney) eventually came around and married Miss Mary Todd in 1842, where they lived in Springfield for a spell and had four children. Then in 1861 Abe became the 16th president of the United States – a president renowned for the Gettysburg Address and Commander in Chief of the Civil War. And then sadly, April 14th 1865, while enjoying a theatrical performance by Mary’s side at Ford’s Theatre, President Lincoln was assassinated. However, those are just cold hard facts. The fullness of life is in the complexities of emotions and details of living. From birth to death, life is a series of highs and lows: Exuberance of possibilities - Pain of rejection – Love – Parenthood – Loneliness – Pride of accomplishment – Heart wrenching grief – Stigmatizing prejudice – Satisfaction - Fear of failure – Jealousy – Humility of defeat – Exuberance in winning – Crush of death. Yes, it is the expressing of these emotions and life details comprising the life of Mary Todd Lincoln, and capturing the full essence of time and place, through Anne Colver’s astute humanistic pen that makes “Mr. Lincoln’s Wife” such a phenomenal captivating story. A five star Top-Pick - Recommended to tenacious connoisseurs of exceptionally written historical fiction."}, {"userName": "Edith", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/1532818-edith", "userReview": "Published in 1943, this story of Mrs. Mary Lincoln is kindly and compassionately told. Many pertinent details of the Lincoln story are missing, but I think it was the author’s intent to relate her version in light brushstrokes, and as such, it is well done. My husband’s term for it is ‘soft history’. What this book does really well is whet my appetite for more...more detailed information and analysis of the Lincoln saga. Just recently I got to choose a few books from my late father’s library and this was one of them. He picked up old books from flea markets all of his life and many of them show the wear and tear from readers of the past. These aged books excited him more than any brand new volume ever could. I’m kind of like that myself and prefer a used book over a brand new book any day. My guess is that he didn’t read this book completely through though, because he preferred hard core history, the kind of reading that only the most serious student of the past will tackle. Still, it has his beautiful flowing signature on the dedication page which delights me no end and I hope that someday his great-granddaughters will read it."}, {"userName": "Judith Hall Simon", "userReviewDate": "Jan 02, 2017", "userURL": "http://www.goodreads.com/user/show/30759404-judith-hall-simon", "userReview": "This is historical fiction written on the young adult level, but that does not detract from this engrossing story of understanding the wife of Abraham Lincoln. The last three chapters are especially heart-wrenching as she deals with being committed to an insane asylum by her son."}, {"userName": "Paul Parker", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/4716815-paul-parker", "userReview": "I really enjoyed this. I read Abraham Lincoln, Vampire Hunter and then found this book on the give away pile at the library and figured it would be a nice follow up. I love reading about Lincoln."}, {"userName": "Wyyknot", "userReviewDate": "Oct 18, 2009", "userURL": "http://www.goodreads.com/user/show/101672-wyyknot", "userReview": "Mr. Lincoln's wife by Anne Colver (1943)"}, {"userName": "Jo Ann", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/227587-jo-ann", "userReview": "I read, with delight, this old, 1943 edition of this book about Mary Lincoln. Really liked it!"}, {"userName": "Greg Collver", "userReviewDate": "Jun 12, 2009", "userURL": "http://www.goodreads.com/user/show/2413543-greg-collver", "userReview": "Good."}, {"userName": "Cindy", "userReviewDate": "May 16, 2010", "userURL": "http://www.goodreads.com/user/show/1888098-cindy", "userReview": "This was a wonderful look at a very misunderstood woman. The poor I read about her the more vulnerable she appears and I have no doubt she loved her husband and her family. Good read."}], "description": "The courtship, marriage, and widowhood of Mary Todd Lincoln. A fictionalized biography: 1839 - 1881. Copyright Registration: A 173099Copyright notation: \"The end-paper is a portion of a letter from Mary Lincoln to a friend in Washington in June, 1865. It is reproduced through the courtesy of the Pierpont Morgan Library, New York.\"", "title": "Mr. Lincoln's Wife", "url": "http://www.goodreads.com/book/show/23595495-mr-lincoln-s-wife", "average": 3.93, "cover": "", "reviews": 9, "authors": [{"url": "https://www.goodreads.com/author/show/239093.Anne_Colver", "name": "Anne Colver"}], "type": ["Military History", "Fiction", "Childrens"], "outlinks": ["http://www.goodreads.com/book/show/23595495-mr-lincoln-s-wife", "http://www.goodreads.com/book/show/2983212-mr-lincoln-s-wife", "http://www.goodreads.com/book/show/423967.Bread_and_Butter_Indian", "http://www.goodreads.com/book/show/3061525-bread-and-butter-journey", "http://www.goodreads.com/book/show/3061523-florence-nightingale", "http://www.goodreads.com/book/show/7784328-borrowed-treasure", "http://www.goodreads.com/book/show/2034659.Abraham_Lincoln"]}