{"ratings": 4935, "userreviews": [{"userName": "Jenna", "userReviewDate": "Nov 22, 2015", "userURL": "http://www.goodreads.com/user/show/38727943-jenna", "userReview": "This fever dream of a book took me on a heck of a vivid road trip, which is pretty impressive considering I read it during a blizzard and my most significant actual journeying consisted of short trips to the kitchen to procure drinks and blizzard snacks like Valentine's Day peanut M&M's. I love a good communes-and-cults book, am fascinated by members/characters' quests for belonging, meaning, explanations, family, origin stories, and stories of where and how we'll all end up in the end. This book has all of this, in spades; there are cults within cults and virtually every character is questing for all of the above. This tangled web of questing characters, as intricate as a map of meteorite crash sites scarring the earth (something that's in the book), creates a kind of crazy, frozen lakey, Upstate New York Gothic Vortex into which the reader is sucked like a vulnerable, emancipated, aged- out orphan seeking refuge (also a book reference).Of course, where you have questing vulnerable humans, and cults and communes, you also have con men and women, traveling snake oil seance-holding salesfolk whose livelihood involves controlling others and keeping them in thrall. So again, given that cults and communes are abounding here, never outside a collection of Flannery O'Connor stories have you ever seen such a collection of various and sundry fictional con artists of various stripes, some nobly antiheroic, some deserving of at least some antipathy, and some seemingly downright cloven-footed.Samantha Hunt herself is a crafty con artist of an author who maintains a very delicate balance of keeping things juuuuust mysterious and intangible enough so that you really do feel lost in space for much of the time you're reading the book, but also grounds and specifies and humanizes everything juuuuust enough so that you are invested in the outcome and keep forging through, in the grip of suspense to discover whatever may be there whenever you may be fortunate enough to emerge through the shadows and into the other side. And what ends up being there is pretty crazy on one hand, and pretty traditional on the other hand, and all thoroughly acceptable by the time you get to that point, having been so well prepped - might we even say subtly, slowly indoctrinated - by Hunt throughout the preceding pages."}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Jun 19, 2016", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "This got fairly kooky at the end, a little woo-woo, a whee bit whacked, and one very important mystery was very obvious to me the whole time, but for a good bit, this book was kind of saving my g.d. life all the same. A young woman and her aunt just felt like run-ang, but the young girl was pregnant, so they walked instead. For a long time. Strange happenings happened strangely. In an alternate timeline, kids grappled with life on a cult-y farm for wayward children before taking off with a charming con artist to live life in the big, open world where mysteries forever abound and wonders reach as far as the eye can see and...shit. Oh, and you fund this by exploiting other people with dead children by talking to their \"spirits.\" Ah, the romance of the road! Bandit life! Plots merge and things happen. I'm not sure why, but it was absolutely what I needed in the midst of a hard-ish time. Anyway, it was pretty good."}, {"userName": "Amanda", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "This was brilliant. Was it a ghost story or a dream or a con or.... well you'll just have to decide that for yourself. If you don't like ambiguity in your endings you won't like this one but if you do this is a gem. Lot's of authors use the alternating chapters/timeline but Hunt's execution is perfect if somewhat unsettling. It was very easy to get lost in which timeline you were in."}, {"userName": "Ron Charles", "userReviewDate": "Dec 16, 2015", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "The historical and the fantastical entwine like snakes in Samantha Hunt’s fiction. Her first novel, “The Seas” (2004), caught the tale of a mermaid who loved an Iraq War vet. “The Invention of Everything Else” (2008) screwed time-traveling gizmos onto a story of the inventor Nikola Tesla. And now, her new gothic novel, “Mr. Splitfoot,” germinates in the loamy soil of religious fanaticism.From her home in the Hudson Valley, Hunt must have soaked up the spirit of New York’s dark woods, which have long been fertile ground for revelations. Remember, it was here, in the Empire State, that. . . . To read the rest of this review, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Sarah", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/1309716-sarah", "userReview": "I loved The Seas. I very much liked The Invention of Everything Else. This one, in my opinion, was just alright.It certainly has its moments: striking, poetic, revelatory moments...I'm just not sure they're worth all the pubic hair, dirty pickup trucks, and gratuitous inventory of every last item in every last room in staccato, present tense prose. And, yes, we're all very aware of backward hicks and religious zealots. No need to keep informing us of them. I found the mystery engaging but a bit too contrived: Mystery for its own sake.I feel like every other book that comes out, lately, is some variation of this book. Yet someone must want to read it, since writers keep writing it, publishers keep publishing it, and buyers keep buying it.Kids today and their literature. *shakes cane*"}, {"userName": "Althea Ann", "userReviewDate": "Jun 29, 2015", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "Ruth and Nat are two teenagers stuck in a religious group home in upstate New York. Unsure what they'll do when they turn 18 and 'age out' of the Love of Christ! facility, Ruth is ready to consider desperate measures to find some kind of future for herself and her best friend. An option turns up when the two meet a traveling con man, Mr. Bell, who suggests that they start profiting off Nat's reputed ability to speak to the dead - one he's so far only used to scare and entertain the fellow foster kids at the home. Mr. Bell also comes from an unusual religious background, we learn - his father was the leader of an apocalyptic cult. Is this commonality of experience the reason he's drawn to Ruth and Nat, or is there a different agenda behind his seeking them out?Intercut with Ruth & Nat's story is one that unfolds some 20 years later. Cora is a seemingly ordinary young woman with a normal job and life. She knows that her mother didn't have a good childhood, but those foster homes and abuse seem very far in the past. But when her boyfriend reacts very, very badly to the news that Cora is pregnant, an emotional crisis point is reached. Just at that moment, Cora's enigmatic but long-idolized Aunt Ruth appears. Refusing or unable to speak, Ruth leads Cora on a long walk through New York State, with no known destination.I picked up this book because of the comparison to Kelly Link, but I didn't quite feel the similarity there. Rather, I felt that this book was very much written in the style of a great deal of contemporary post-apocalyptic lit-fic. It's not apocalyptic (although there is that apocalyptic cult), but the way it is written makes modern life feel apocalyptic. The fact that all the characters are alienated from modern society (either emotionally or through forced isolation) contributes significantly to this, as does the narrative's occasional tips into the realm of the bizarre. The themes of the book are also ones that are present in much of the post-apoc genre.I liked the book, and moreover, appreciated that it was very well-crafted. I didn't emotionally love it, however... perhaps just because of the high unpleasantness quotient.Many thanks to HMH and NetGalley for the opportunity to read. As always, my opinion is solely my own."}, {"userName": "Ace", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/23405868-ace", "userReview": "A complex and layered 'ghost' story, Ruth and Nat live in an orphanage (run by a complete religious nutter and alcoholic) called The Love of Christ. A cruel and hunger ridden childhood brings these 2 kids eventually into the hands of a conman who uses Nat's 'channeling' skills to make some quick cash from unsuspecting and quite gullible customers who believe Nat can talk to their dead relatives. As the kids travel along the country channeling the dead, another storyline is developing with Ruth's niece Cora. In some parts quite spellbinding, they trek across America to find something that Ruth wants Cora to see. Fantastic read, a bit gruesome and I didn't see the end coming at all!Thanks to Little, Brown and Netgalley."}, {"userName": "Ioana", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/1721356-ioana", "userReview": "Samantha Hunt is a poet of the most insightful, lyrical, soul-wrenching order. I am simply blown by the ways in which she strings words together- truly, as one of her characters puts it at one point - challenging the \"tyranny of fiction\". I am no poet myself so I am not going to pretend that I can write an analysis or otherwise render Hunt's style. What I can say is that, as a practical-scientifically minded person who teaches math for a living, I absolutely crave the soulfulness, joy/melancholy, ecstasy, sensuousness of the artistic... spirit (?), embodied so holistically in this work. Of course, to me, math is art, but that's not usually how I practice it (ah, standardized testing, Common Core, etc, etc, inane quantitative measures of intangible things). So in my \"spare time\" such as it is during the school-year (no children yet, which is why I still have some), I try to inspire (inhale, motivate myself) what creative energy I can (usually by reading fiction). This is one of those books that amply and even overflowingly fills the well depleted by my profoundly non-artistic day-to-day existence. Reading Mr. Splitfoot, I am fully immersed in a chaotic but attuned, blunt and melodious, simple yet so profound soup/dance/game/orchestra of words. Words that, in their at times discordant ways, birth an illusion (reality?) that is more true than most things I encounter in my daily trudging. This book is a hauntingly resonating, masterfully written artistic masterpiece.But it is also so much more than that, for the perspectives it presents, for the setting and content. Or perhaps, this work is art because of the ways it approaches the eternal questions (what is meaning? death? being a mother? told through the fevered dream-like narrative of an ex-cult member/family). A critic somewhere wrote that Hunt writes \"from the margins\". Indeed - this is not a story that takes place from within the comfort of that which most of us take for granted: a caretaker (or mother), a home, a steady job/income, a more or less \"typical\" way of interaction with the world around us. It's the story of abandoned children, well-meaning but religiously deranged individuals, \"unnatural\" (unconventional) attachments, con-men, people doing everything to survive, and others trying to make meaning after deeply troubled childhoods.For me, the content and perspectives were much needed jolt out of my insanely undeserved comfortable existence (the job, the cats, the house, the car, the food supply, the safety and comfort). If you've seen Winter's Bone, the mood Hunt builds is a bit like that. Not quite the same, but I haven't read or encountered anything like Mr. Spitfoot before, so it's difficult to draw parallels. It's just so ... quintessentially out-the-mainstream, marginalized American (American gothic, according to critics). And yet, despite, or perhaps because of, the characters' outsider-status, Hunt's writing helps us understand our own quests, troubles, ghosts, desires so much more clearly than we would if we were observing our self-imposed system from the inside.I absolutely LOVED this book to pieces, but although I would highly recommend it to everyone for its educational and artistic power, I couldn't guarantee that you will enjoy this - I would only hold some kind of hope. A bit like how I wave my hands around excitedly about math in class; while I win some converts every year, to many more of my students I am probably just the crazy math teacher. This book is not for everyone, and you may find it frustrating, especially since, as I mentioned, it's not written in a conventional style (basically, a poem in narrative form), and in general challenges all conventions through its characters, the setting, perspectives, etc. If you like your stories to stand on solid ground, I am just the crazy person waving my hands around right now. But, to each his own - life is awesome because each one of us basks in a different light."}, {"userName": "Linda", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/440212-linda", "userReview": "This was an impulse read and also a page-turner! The layout of the novel with chapters going back and forth between two women and time-periods made it very easy to read \"just one more chapter\". The story is classified as horror, but I'm not sure I would put it in that genre, but there are definitely other-worldly elements, ghosts and trying to figure out what is real or not. And the book just got better as I neared the end."}, {"userName": "Sandra", "userReviewDate": "Dec 17, 2015", "userURL": "http://www.goodreads.com/user/show/25936805-sandra", "userReview": "A weird and very odd story, dealing with two narratives in the past and present day.In the first, we learn of Ruth as an orphaned child, situated in the home of the overzealous and religious Father, where she grows up together with Nat. To entertain themselves they 'speak to the death', bringing horror to some of their fellow orphans. After meeting the mysterious Mr. Bell, they find a wider audience, making some money in the hope of escaping their Love of Christ! home. Years later, Cora is living a life in this digital age where everything needs to be shared online, \"if we don't post it, it never happened\". Then one day Ruth turns up and whisks her niece on an adventurous walk to an unknown destination.Cora barely knows her aunt, having met her only once at the age of 11, and being infatuated with her ever since. \"I liked my mother fine, but Ruth was like being close to thunder. And then Nat. Lightning.\" Since Cora is in need of change in her life, she goes along without protest.A ghostly and supernatural undertone can be felt throughout the story. With a religious fanatic and an apocalyptic cult and its leader thrown in, it all felt a bit too unreal. As the reader, you are not sure what exactly is going on, and where and how it all fits together. Characters felt unattached and thus the reader too. It is an interesting story though, and readers who like their thrills to be a little bit unearthly, will definitely enjoy this. Review copy supplied by publisher through NetGalley in exchange for a rating and/or review."}, {"userName": "Rebecca Foster", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "“All stories are ghost stories,” Samantha Hunt proclaims in her quirky third novel about the crossover between motherhood and mysticism. In a dual storyline that takes in fundamentalist cults, unlikely mediums and a pregnant woman’s pilgrimage, Hunt asks whether one can ever believe in the unseen. Mr. Splitfoot has the offbeat charm of Scarlett Thomas’s work. While the plot ultimately feels like a bit of a jumble, its vision of unexpected love and loyalty remains compelling. “The End’s always coming,” but it is how one lives in the face of brutality and impending extinction that matters.See my full review on the \nPittsburgh Post-Gazette\n website."}, {"userName": "debra", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/7002034-debra", "userReview": "I don't know how to rate this. This was an engaging, somewhat surreal and suspenseful story that was related in a split account linking past and present. The narrative contained many interesting disparate, mysterious characters and themes. I assumed, incorrectly, these elements would eventually come together into a cohesive whole. Upon completion, however, I realized that I was supposed to reflect on the enigmatic significance of random details and discern the similes, metaphors, symbolism,and whatever else they were supposed to be representative of. My reaction was a very predictable \"WTF, I don't care enough to analyze and propose possible meanings and discussions about thisshit nope sticking with shit, and another WTF and a GTFOH\" for emphasis. Hence, my dilemma in choosing a star rating."}, {"userName": "Amy", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/727334-amy", "userReview": "Wow. I just don't think I can capture, in words, just how much I loved this novel. I have never read anything quite like it. I never completely knew what was happening but I could NOT put it down. It's weird and strange and nutty in all the best ways! The structure of the book - alternating chapters with two different narratives - make the book feel unsettling in some ways. You know they will come together but you have no idea how or when. The world that Hunt creates is mesmerizing and odd and wonderful. I don't typically like not knowing where I'm going when reading but if the writing is good enough, I can go along with the ride. And boy, did I go along with the ride on this one. SO. DAMN. GOOD. Someone described this as a 'fever dream of a book' and I think that is such a great description of this one. There are some startling and poetic moments in this novel. I think it's probably not for everyone but I highly recommend it. Especially if you enjoy great literary fiction ... this is literary fiction that knocks it out of the park!"}, {"userName": "sappho_reader", "userReviewDate": "Jan 23, 2016", "userURL": "http://www.goodreads.com/user/show/17068912-sappho-reader", "userReview": "If this book had a soundtrack I imagine it would be early Tori Amos jamming hard on the piano in angst and melancholy similar to her Little Earthquakes. Reading this was a psychotic head trip into the obscure: lunatic religious cults, spiritual con artists, and a ludicrous road trip. It's part Fight Club with the popular culture references and NOS4A2 with the creepy overtones, but mostly it was the humor that struck me. I loved the dual narrative and how they both intertwined at the end. Basically I loved everything.The best blurb ever from the back cover:\"I get the chills. Is it a true story? Is it a sad story? It's what people want. It has a lot of good energy and people, people will like it. It's intriguing because a person will know there's something two-sided. It's a good one.\"Charlotte Bronte (speaking through a medium)"}, {"userName": "Julianne (Outlandish Lit)", "userReviewDate": "Jul 09, 2015", "userURL": "http://www.goodreads.com/user/show/9581745-julianne-outlandish-lit", "userReview": "4.5Mr. Splitfoot was an incredible read that kept delivering beautifully thought out strangeness. This is a perfect book for #weirdathon in March, if you're looking for potential reads. If you dig cults or Carl Sagan at all, read this. I continue to think about this wildly original story, and I'm now kind of obsessed with Samantha Hunt.Some highlights from my video chat/review with Shaina Reads:Shaina: There’s a cult. There’s some weird magical realism. And it’s a love story.Julianne: Sort of.Shaina: Sort of. And there’s like weird sci-fi elements.Julianne: I don’t even know how to begin explaining why this book is good. Like it seems impossible to put into words.Shaina: I mean it’s impossible to put into words partially I think because a lot of the words we use would be very big spoilers.Julianne: Yeah.Shaina: But it just draws you in and you’re really - I mean you don’t know what’s going on but you’re kind of happy to not know what’s going on. You’re happy to like go along for the ride.Julianne: You know that it will be revealed. You know you’re not going to be let down, because there’s too much random weird shit going on. You’re like ok this is going to connect in some way and I really want to see what she’s going to do with it. Ya gotta have faith. Full review with video: Outlandish Lit"}, {"userName": "Perry", "userReviewDate": "May 17, 2016", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "A Bohemian Brew [posted originally May 17, 2016][3.5 stars, boost to 4 for debut]Defying simple description, this might best be described as a gothicly picaresque coming-of-age novel, with distinct avant-garde elements of the supernatural, grotesque, skate punk, cult, funk, flim-flam, dirty girl romance, celtic folk metal, occult, horror and the surreal.Or, that it's a strange stew brewed up by a bohemian witch, just awaking from a nap at the credibility gap."}, {"userName": "Alex Andrasik", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/7696083-alex-andrasik", "userReview": "This book is amazing. Parallel storylines tell of love, loss, birth, death, faith, mothers and daughters, sisters, damaged people, subtle monstrosity, and an epic journey through upstate New York (hi, Lackawanna!), told in meaty, refulgent prose. Each story in its own timeframe marches inexorably toward a deadly confluence. Buy this book when it's available!"}, {"userName": "Latasha", "userReviewDate": "Feb 26, 2017", "userURL": "http://www.goodreads.com/user/show/8253900-latasha", "userReview": "this book isn't what I thought it would be. I thought it would be a period piece but it isn't and that's ok. it's a great story but once you sit and think about what your hearing, it's really messed up. I enjoyed the story a lot but I never saw that end coming."}, {"userName": "Abbie | ab_reads", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/53055819-abbie-ab-reads", "userReview": "Another 4.5 stars, this one was just so much fun yet unexpectedly sad in parts! I just had some timeline issues. Full review to come!"}, {"userName": "Lisa Hall", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/2499700-lisa-hall", "userReview": "This is one of the strangest books I've read in a long time, and also one of the most addictive. Although I wasn't too sure whilst I was reading it if I was enjoying it, I couldn't put it down, and have since come to the conclusion that I LOVED it. It's a very strange story, with some very strange characters - a boy who claims to be able to speak to dead people, a cult leader, a man with no nose after it rotted off through leprosy, all linked together with a girl who doesn't speak. It sounds weird, it is weird, but it was a strangely beautiful read with a truly magnificent ending, one that I wasn't expecting that I kept thinking about long after it was finished.If you like something a little bit out of the ordinary, and are happy to try something different, then i highly recommend this book - it doesn't fit in any specific genre for me, but I found it really beautiful and unusual - it's either going to sink without trace or be a massive, massive hit."}, {"userName": "Book Riot Community", "userReviewDate": "Feb 16, 2016", "userURL": "http://www.goodreads.com/user/show/33447134-book-riot-community", "userReview": "Ruth and Nat grow up in a group home run by a religious fanatic. Nat pretends to speak to the dead family members of the other kids in the home, or so he says, and before they can age out of the system, a mysterious con man named Mr. Bell takes their show on the road for those willing to pay. Flash forward a number of years, and Ruth, grown up and mute, insists her niece follow her on an uncertain trek across the state of New York. What are they running to or from? The multiple perspectives come together beautifully to reveal the haunting conclusion as Ruth’s past meets her present. — Andi Millerfrom The Best Books We Read In January: http://bookriot.com/2016/02/01/riot-r..."}, {"userName": "Krista", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/4729639-krista", "userReview": "[And this is where my metaphor of the cd case comes in: Although we understand that Ruth is only pretending to be psychic, the reader believes that Nat is channeling Mr. Splitfoot, but that's revealed to be a lie. So there's nothing supernatural here, BUT WAIT: In the second timeline, Ruth was a ghost all along, trying to make things right from beyond the grave. Is that a delightful ending or a cheat? It didn't work for me (hide spoiler)]"}, {"userName": "Michelle", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/32535119-michelle", "userReview": "Samantha Hunt’s Mr. Splitfoot has been labeled as gothic, horror, magical realism. Like the many intersections that pervade this work – Ley Lines, constellations, reality, life and death – there is no one word that can summarize this book.Although Mr. Splitfoot has been billed as a ghost story, it is as much a story about cults, religious fanaticism, and the schemes of con-artists, but more so I would say it is a story about motherless children and childless mothers.\n“There’s sacrifice, antagonism, rebellion, obsession, and adoration, but no properly complex word for what’s between a mother and a daughter, roots so twisted, a relationship so deep, people suffocated it in kitsch and comfort words to pretend it’s easy.”\nSplit into two different timeframes, one of young Ruth and that of Cora, all of the main characters in Mr. Splitfoot - Ruth, Nat, Cora and Mr. Bell - are on journeys that extend from reality into fantasy and blur the lines between life and death. All are driven by the need for this mother-child relationship. “How does she know herself without a mother?” In the first storyline Ruth and Nat are troubled teenagers living in a commune-like group home run by a despicable charlatan who uses religion to abuse the kids as he manipulates the foster care system for his financial gain. The “sister” pair devise a plan to escape Love of Christ! foster home before they age out and are separated forever. The alternative storyline reunites Ruth with her niece Cora who is facing a troubled pregnancy. Mr. Splitfoot can be defined as a love story – one that transcends time and space, reaches over the barrier of death and embraces imperfection.“Perfection scribbled out or the imperfection that makes you, me, anyone, perfect and complete because it includes the truth of our mortality.”"}, {"userName": "Taryn Pierson", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/13977687-taryn-pierson", "userReview": "A weird little ghost story with a love story in it. Or is it a love story with a ghost story in it? A ghostlove story. Anyway, it’s dark and atmospheric, playful and warmer than you think it’s going to be by the end. I could see the creativity and achievement in it, but after I finished it, I just kind of shrugged and moved on to the next book on my list."}, {"userName": "Sue Dix", "userReviewDate": "Feb 02, 2017", "userURL": "http://www.goodreads.com/user/show/6321978-sue-dix", "userReview": "I expected a freezer worthy story but this doesn't live up to that category. I am puzzled and rather disappointed and I can't believe that I finished this book. Some might like it, but it was not my cup of tea. I read it for a reading challenge, so I guess that's why I bothered to finish it."}, {"userName": "Badseedgirl", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/20662786-badseedgirl", "userReview": "[ Cora and Nat to hook up in the end. I really feel that is what happened. Cora made a point of saying that there was not much age difference between them in a throw away line when they meet at the lodge, just saying. (hide spoiler)]"}, {"userName": "Clare T.", "userReviewDate": "Oct 27, 2017", "userURL": "http://www.goodreads.com/user/show/15600508-clare-t", "userReview": "This was a spooky audiobook I listened to on my rides to and from home and college. It was very creepy, not in a \"spooky\" way, per se, but just the gist of it itself. These orphans are raised by an overbearing, abusive pastor. Ruth, one of the children, ends up taking her pregnant niece on an adventure, and the two worlds intertwine slowly, and secrets come out.The ending was creepy and sweet at the same time! A good book."}, {"userName": "Scott Southard", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/7323076-scott-southard", "userReview": "Today on WKAR I took on the new literary fiction and ghost story by Samantha Hunt. Check out my take on Mr. Splitfoot.You can listen to my review here: http://wkar.org/post/book-review-sama...If you would rather read my review, you can do so below.–Book Review: Mr. Splitfoot by Samantha HuntEverybody loves a good ghost story. And Samantha Hunt definitely delivers in her creepy new book, Mr. Splitfoot. This is a tale where orphans talk to the dead, scary cults promise answers to life’s mysteries, and the only certainty anyone can hope for at the end is death.At the heart of the novel is the story of Ruth. She is an orphan who has been abandoned by the system and lives in a foster home run by a religious zealot. Ruth is homeschooled, learning only what her foster parents teach her about the outside world. When her fellow orphan Nat begins telling people he can speak to the dead, Ruth pretends she can too. With the help of a con artist named Mr. Bell, they begin charging people who are desperate to reach lost lovers, children and parents. The sessions begin with Nat speaking in tongues, followed by brief messages and random words. As soon as the sessions are done, the three escape with their ill-gotten fortunes.The other main character in this modern gothic tale is Ruth’s niece Cora. She is hiding a pregnancy from the disturbed father of her child. His name is Lord and he promises to steal the baby once it is born and abandon it on the steps of a hospital. One day her Aunt Ruth shows up at her house and silently beckons Cora to follow her. Ruth doesn’t explain anything to Cora, but her niece follows her without asking any questions. The two women move from small town to small town, trying to avoid the ghosts from their past. But everyone they meet along the way seems to have a ghost story of their own. From random strangers they meet on the road to the hotel workers who claim their rooms are full of dead people, Cora and Ruth never seem to lack for supernatural companions.What propels the narrative in Mr. Splitfoot is the feeling of hungry desperation. The characters are each seeking something, whether it’s answers or money or peace of mind. That desperation adds an eeriness to the work and leaves a reader wondering if anyone can truly be trusted. It feels like there is something always hidden behind the smile.One thing that made this book stand out is that the ghosts aren’t confined to a specific location. In most horror stories, you can find the monsters holed up in one spot or stuck to some cursed object. But in this novel, the ghosts are all around us. The feeling of unease extends beyond the creepy basement of a haunted house. It permeates the entire world.Like most ghost stories, Mr. Splitfoot does come with a surprising plot twist, and this one left me kicking myself that I didn’t see it coming. It’s not often that happens for me, and it’s one of the reasons I loved this book. Luckily, I didn’t lose any sleep over it, but the inventiveness of this tale will certainly haunt me for days to come."}, {"userName": "Michael", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/4015835-michael", "userReview": "Ruth and Nat are orphans living in what could only be described as a crazy cult. Many years later, Ruth’s niece Cora finds herself pregnant. Ruth appears after years thought lost, but she cannot speak. She leads Cora on a mysterious mission, but where is she going? Mr. Splitfoot is an attempt at a contemporary gothic novel by author Samantha Hunt.I picked this book up from the library for a number of reasons. I wanted to see a modern take on the gothic novel and I was interested in the cult-like plot. This book sounded like something I would really enjoy. But sadly I felt like Samantha Hunt just tried to do too much in this novel and nothing really came together as expected. I felt let down by the book and my only consolation was the fact I borrowed the book from the library instead of spending money on it.Granted there is a lot of interesting elements within Mr. Splitfoot and by a more experienced writer this could of have been a beautifully layered novel. There is a touch of mystery, the gothic, the absurdity and horror elements to be found in the book. I felt like Hunt piled together every great idea she had and tried to pack it into the novel. This left me feeling like she had started so many threads but never actually finished them. The satirisation of religion, or the southern gothic cult, and the mystery or the coming of age story are all really good ideas. There are so many good ideas but at some point you need to stop cramming in ideas and focus on how they work together.Mr. Splitfoot is an example of why I should never listen to hype. I think it is an entertaining read and there is a little bit of everything. However I wanted more depth, more exploration. I like the ideas the book presents but then it did nothing with them. I felt like this was just sloppy but for someone wanting a thrilling plot, this novel might work. I know I have very different taste in literature to the norm; I just need to remind myself not to fall for hype.This review originally appeared on my blog; http://www.knowledgelost.org/book-rev..."}, {"userName": "Jeffry", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/50940587-jeffry", "userReview": "With Mr. Splitfoot, Samantha Hunt perhaps creates a new genre: Upstate New York Gothic. Reminiscent of writers like Katherine Dunn, Kelly Link, Sharma Shields, and Flannery O'Connor, Hunt's novel is part ghost story, part thriller, part mother/daughter drama, and part road trip narrative. Some might classify the genre of this book as Slipstream or New Weird, and I think both are appropriate. The novel is tightly plotted with alternating chapters between the past and present that become increasing intertwined as the plot progresses. This mirrors one of the central themes: the impact of the dead upon the living whether we believe in the supernatural or not. Though Hunt's style is similar to the writers mentioned above, her voice is also distinct and she produces some grotesque and provocative imagery minus the intentional disjointedness seen in the work of other New Weird writers like Link. Hunt unsettles the reader through her voice and imagery while crafting a plot that moves with the pace of a classic ghost story or thriller. Her fresh take on the road trip trope in American literature is particularly noteworthy as well."}], "description": "A contemporary gothic from an author in the company of Kelly Link and Aimee Bender, Mr. Splitfoot tracks two women in two times as they march toward a mysterious reckoning.Ruth and Nat are orphans, packed into a house full of abandoned children run by a religious fanatic. To entertain their siblings, they channel the dead. Decades later, Ruth’s niece, Cora, finds herself accidentally pregnant. After years of absence, Aunt Ruth appears, mute and full of intention. She is on a mysterious mission, leading Cora on an odyssey across the entire state of New York on foot. Where is Ruth taking them? Where has she been? And who — or what — has she hidden in the woods at the end of the road?In an ingeniously structured dual narrative, two separate timelines move toward the same point of crisis. Their merging will upend and reinvent the whole. A subversive ghost story that is carefully plotted and elegantly constructed, Mr. Splitfoot will set your heart racing and your brain churning. Mysteries abound, criminals roam free, utopian communities show their age, the mundane world intrudes on the supernatural and vice versa.", "title": "Mr. Splitfoot", "url": "http://www.goodreads.com/book/show/29065258-mr-splitfoot", "average": 3.66, "cover": "https://images.gr-assets.com/books/1455145376l/29065258.jpg", "reviews": 825, "authors": [{"url": "https://www.goodreads.com/author/show/190905.Samantha_Hunt", "name": "Samantha Hunt"}], "type": ["Fiction", "Horror", "Fantasy", "Gothic", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/29065258-mr-splitfoot", "http://www.goodreads.com/book/show/23719481-mr-splitfoot", "http://www.goodreads.com/book/show/25876042-mr-splitfoot", "http://www.goodreads.com/book/show/30075444-mr-splitfoot", "http://www.goodreads.com/book/show/35017330-mr-splitfoot", "http://www.goodreads.com/book/show/1238101.The_Invention_of_Everything_Else", "http://www.goodreads.com/book/show/31702762-the-dark-dark", "http://www.goodreads.com/book/show/332768.The_Seas", "http://www.goodreads.com/book/show/35150761-a-love-story", "http://www.goodreads.com/book/show/17874102-the-yellow"]}