{"ratings": 324, "userreviews": [{"userName": "Pamela", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/20048096-pamela", "userReview": "“She was turning in a slow circle, surveying the thick forest around her, when once again, she felt something strange. Not a chill this time, but a noise. And not even a noise so much as an absence of noise in the way that birds grow quiet when a predator nears . . . Mary tensed . . . She stood there listening when suddenly she heard a series of high-pitched sounds . . . The hair lifted on the back of her neck. Someone was up here, playing a fiddle.”Mary Crow is a level headed down-to-earth attorney who’s known as an extremely bright and fierce legal opponent. She doesn't back down and she doesn't spook easily. But her current case might be the exception. The Appalachian region is ripe with Cherokee spirit-legends and Irish/Scottish ghost stories, but Mary is certain the old ‘Fiddlesticks Cabin’ isn't haunted. Creepy, oh yes! Repugnant - that too. But haunted? No. Whoever murdered and maimed Lisa Wilson (the former governor’s daughter) is definitely a living breathing individual, albeit a very deranged one, but certainly not a ghost. Mary's highly educated/esteemed raptor client, Nick Stratton, isn't guilty either – though the bulk of circumstantial evidence along with the former governor’s ball-busting-vengeance demands an indictment that says otherwise. Unfortunately, the clock is ticking, in more ways than one. The fiddlers play on. Not only is the victim’s father cracking his political-prowess whip, a vicious tabloid reporter is out to ruin Mary’s reputation and possible career. Then too, Mary’s family life is caught in another sort of cross-hairs – with her stepchild’s welfare hanging in the balance. From the hollows and backwoods south of Asheville, to the red earth land of Oklahoma, this is one heck of a great mystery/suspense ride - my first by Sallie Bissell, but not my last. Bissell does a remarkable job portraying regional nuances, emotionally-charged and spine-tingling atmospheres, and she gives credibility to well-developed diverse characters.Aside from a bit of crass language and minor lewd references, I thoroughly enjoyed “Music of Ghosts.” It’s regionally distinct, tightly-written, realistic, plausible and engaging. I’m delighted to have found this Appalachian-noir legal whodunit at my local Friends of the Library Bookstore, in perfect condition - a win-win for me and my community."}, {"userName": "Thing Two", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/3722823-thing-two", "userReview": "I always enjoy reading about Mary Crow. Music of Ghosts is another in a series of legal thriller/murder mystery with a Western Carolina flair. Some predictable bits, and parts where I yelled \"don't go outside alone you simpleton!\" Nothing earth-shattering, but good writing and good fun to read."}, {"userName": "(Tori-Smexybooks) smexys_sidekick", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/3094317-tori-smexybooks-smexys-sidekick", "userReview": "Originally posted at http://smexybooks.com/2013/04/review-...Favorite Quote: “Sometimes you have to go away. Then you can come back new.”When Mary Crow promised her longtime lover that she would no longer handle criminal cases, she never expected a murder to land at her front door. When the daughter of a prominent politician is found fatally victimized and her boss is charged with the crime, Mary is placed in the intractable position of proving his defense even though she knows it could cause her to lose everything that matters to her.As Mary divulges deeper into the crime, she finds herself embroiled in a centuries old mystery that stems from a similar murder that occurred 1958 and a ghost story that still haunts the Appalachians surrounding her town. She is also having to deal with personal issues when her lover and his nine year old daughter return from a court ordered visit with her grandparents changed and suddenly acting cold towards her. With the help of the local sheriff’s fiancée and friends from her time as a prosecutor, Mary will learn the hard way that blood is thicker than water and often times the ghosts of our pasts are never truly laid to rest.Music Of Ghosts is the fifth installment in Sallie Bissell’s Mary Crow series. A suspenseful mystery series whose protagonist, Mary Crow, is a Cherokee lawyer whose penchant for trouble follows her around like a shadow. Even if you haven’t read the first four, the story line’s crisp clean lines and smooth telling allows for instant comprehension and immersion. Heavily character driven with a multitude of twists and turns, lore inspired mystery and suspense builds slowly, intertwining with an on going deeply rooted romance that is not without its own drama.Set in a small mountain town of North Carolina’s Pisgah County, legend and lore winds together to give us a well written personal glimpse into small town life and the reservations and prejudices that often come with it. I enjoyed meeting Mary and seeing the effort she has made to conform her life to the expectations of her lover, Jonathan Walkingstick. An intelligent and admirable woman, she has sacrificed so much of herself to be with him. A decision she didn’t make lightly nor does she regret. My heart broke for her when Jonathan places his own needs and wants above hers and isn’t there when she needs him most of all.The secondary characters round out the storyline and further encourage the appeal of this story. Offering up a smattering of humor and eccentricity, I found myself engaging with them all. Everyone has a place in the story, be it large or small, and isn’t used as unnecessary filler. Bissell cleverly uses this small town appeal and eccentricity to keep us on our toes as we are given various clues to both mysteries while keeping our villain hidden right before our eyes.The ending is an action packed finale that answers all our questions and wraps up the mysteries nice and neat. Mary’s personal life doesn’t wrap up as neatly and we are left with more questions than answers. Hopefully Ms. Bissell will not wait eight years to write book six.Ms. Bissell’s Music of Ghosts is a enjoyable suspense thriller that will appeal to all readers who enjoy the thrill of a good small town mystery with a strong engaging female protagonist.Overall Rating: B"}, {"userName": "Diane S ☔", "userReviewDate": "Feb 25, 2013", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "3.5 North Carolina, the hollers of the Appalachians, their myths and folklore and fiddle music make up the story in this new novel featuring Mary Crow. Enjoy this series quite a bit, it is well written, has a wonderful leading character in Mary Crow, who is a Cherokee and a lawyer. Good combination of story-line and personal life, both which are very interesting. Love the setting and it is described so well one can picture themselves in the place and time. Good mystery and a good solid series. Oh and I found out something I did not know about the author. She was the ghostwriter for the children's Saddle Club series."}, {"userName": "Rhonda", "userReviewDate": "Feb 08, 2013", "userURL": "http://www.goodreads.com/user/show/955320-rhonda", "userReview": "4 STARSMusic of Ghosts (Mary Crow, book 5)This is my first Mary Crow novel that I have read. The characters are well defined and I had no idea of where the story was going in her personal and professional life. The drama was going till the end. Some of it I did not like but hopefully thier will be another book out soon. The Suspense held up for me. I did not guess who the murder was or how.Once I started reading I did not put the book down till it was done. I liked the story and look forward to reading more Mary Crow stories in the future. Mary Crow is a lawyer, who helped her county get a sports park built. Mary was at the grand opening ceramony and she was worried that her family did not come for it. They did. Mary lives with her boyfriend Jonathon Walkingstick and his nine year old daughter. They have been together for years. This past month since they got back from a month visit with his daughter's grandparents at court order visit they both had changed toward her. Mary is afraid Jonathon has found someone else while he was gone.The day before the sports park opened a bunch of collage interns at raptor rehab center went up to camp at a old haunted house back in the country. One of the girls was then murdered up thier. The Sherrif went up to the murder scene instead of welcoming the Governor of North Carolina for the ribbon ceramony. He found out that Lisa was killed and had carvings all over her body. Lisa was also a daughter of a former North Carolina Governor. He now had a high profile case on his hands. Mary Crow no longer did murder cases because Jonathon had asked her not to while his daughter lived at home. When things were falling apart in her personal life Nick Stratton asked her to represent him. She took the case. Mary unraveled it piece by piece while waiting for her own personal life hang in the balance with the help of good friends she found the answers.I have the feeling that a lot of Mary's friends have been in earlier books. I know I would like to read them sometime in the future. If your a Mary Crow fan I think you will like this. If you like mysteries that keep you guessing this will be a good one to read.I was given this ebook to read and asked to give a honest review in return from Netgalley.04/08/2012 PUB Midnight Ink ISBN9780738735849 384 pagesDescription below taken off of Netgalley.comAn Appalachian ghost legend scares up a grisly murderDeep in the Appalachian woods stands the old Fiddlesticks cabin, the scene of a bloody double murder from decades past. Supposedly haunted, it attracts young thrill seekers hoping to hear the killer’s ghostly fiddle music. One such visit ends tragically when a college student is strangled to death — her flesh mutilated with bizarre symbols. The victim is Lisa Wilson, daughter of a former North Carolina governor. The ball-busting politician will eat Pisgah County for breakfast until someone is convicted. Evidence leads to the indictment of Nick Stratton, the handsome raptor specialist who was Lisa’s boss and not-so-secret crush. Attorney Mary Crow, a county native with blood ties to the Cherokee nation, agrees to defend Nick. Did he do it, or is there a deranged mountain killer with a taste for pretty girls on the loose?"}, {"userName": "Chanel", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/5140994-chanel", "userReview": "Another all nighter......excellent...."}, {"userName": "Linda", "userReviewDate": "Mar 05, 2015", "userURL": "http://www.goodreads.com/user/show/3485057-linda", "userReview": "Music of Ghosts, featuring attorney Mary Crow, is a perfect mix of Southern Gothic, modern day crime and a bit of romance. This is the only one of the Mary Crow series that I have read thus far but I will certainly be reading others to catch up! Mary is an attorney in Pisgah County, North Carolina who is trying to balance her professional and personal life. She lives with Jonathan ( a member of the Cherokee nation) and is helping to raise his daughter Lily. However, Lily's maternal grandparents are fighting for custody and Mary's personal life is in chaos. Soon her professional life becomes complicated when an acquaintance is accused of murder.Hidden away in the nearby Appalachian woods sits an abandoned cabin where years ago a man nicknamed Fiddlesticks murdered his wife and her lover. Though Fiddlesticks was convicted and executed for the crime, many locals still think they hear his fiddle playing and steer clear of the abandoned cabin. When a group of college students interning at the Pisgah Raptor Rescue Center decide to spend the night in the cabin and try to record the eerie fiddle music and ghost, one of their group is found brutally murdered. Lisa Wilson, the victim, is also the daughter of a former North Carolina governor which complicates the life of local sheriff (and friend of Mary Crow), Jerry Cochran. The ensemble of characters are well drawn and the reader is deftly brought up to speed in case you are new to the series. Much local color and history enhance the murder mystery, the clues fairly divulged and the solution believable and satisfying. Music of Ghosts will keep you in suspense to the end, then send you looking for another of the Mary Crow books."}, {"userName": "Angela Risner", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/9972516-angela-risner", "userReview": "This is the first novel of Sallie Bissell's that I've read, and I have to say, I'm hooked! I'm only ticked, because the rest of the series is not available in eBook format. Normally I don't read a series out of order. When I first started reading this book, I hemmed and hawed about whether or not I really wanted to order the rest of the series in printed format. But as I continued on, I made the decision that I wanted to read the entire series. So the first four books are on their way here. In this book, attorney Mary Crow, who has made a promise to her domestic partner, Jonathan that she won't work on murder trials anymore, finds herself helpless when the grandparents of her step-daughter sue Jonathan for custody. If you've read the series, you know the back story there. Mary is the person to whom they object, so she has to step aside while Jonathan and the grandparents duke it out in Oklahoma family court. When the murder of the daughter of a former governor takes place nearby, Mary finds herself drawn to defend the accused man, which reignites her love for being a trial attorney. For not knowing the series, I thought that it was fairly easy to pick up on some of the history with the characters and to find them engaging. Still, I look forward to going back to the beginning of the series and learning the full history. I think Mary (at least in this book) is a great character. She's smart and her responses to situations are realistic. Jonathan leaves me wanting, but this is my only introduction to him as a character, so that may change as I read the rest of the series. If it's worth me ordering the printed editions to read the rest of the series, you know it's good stuff. Highly recommend."}, {"userName": "A Book Vacation", "userReviewDate": "Mar 06, 2013", "userURL": "http://www.goodreads.com/user/show/3558850-a-book-vacation", "userReview": "To see my full review:http://wp.me/p1jhaj-2S4This mystery novel was a ton of fun to read. I really enjoyed getting to know all the characters, especially as Bissell deeply fleshed them out for her readers. This is my first Mary Crow novel, though it’s number five in the series, and what I really enjoyed was that this is a stand alone novel in which we get to know Mary Crow very well, regardless of whether we’ve read the other novels. While I do love series novels that build off of each other, I also really enjoy the stand alone, and was very happy to see that this was the case with the Mary Crow novels.Bissell opens The Music of Ghosts with a bewildering murder, thrusting readers into the chaos as we watch and learn about Lisa Wilson and the events leading up to her untimely demise. I really liked the way Bissell did this as, truth be told, I wasn’t really a fan of Lisa, but I was interested in her and her friends, and their sleuthing of the abandoned Fiddlesticks cabin piqued my interest from the very first page. With Lisa out of the way, the novel moves quickly into a case of whodunit as the five surviving members in the cabin, as well as the others who had contact with Lisa throughout the summer, become prime suspects. Enter Mary Crow. Struggling with her own set of problems and her promise to never take a murder case, Mary must decide whether or not to follow her gut and, in so doing, brings about the demise of some, including former relationships, and the triumph of others.This novel is a rollercoaster ride of emotions, focusing on Mary’s heartbreak, Jerry’s murder case, Nick’s innocence, and the very real possibility that someone very near to the Fiddlesticks murders is exacting their revenge. Bissell kept me guessing the whole time."}, {"userName": "Laura", "userReviewDate": "Oct 25, 2013", "userURL": "http://www.goodreads.com/user/show/908657-laura", "userReview": "This was an incredibly interesting story that grabbed me from the first chapter. This is the fifth book in the series but the first one I’ve read. It’s the type of book where it might be helpful to have read the other books to get more of the history, but she does a good job of summarizing previous storylines so you aren’t lost. There are two storylines in this book though, which I found a bit distracting but it didn’t detract from the overall quality. One storyline follows the main character Mary Crow and her live-in boyfriend Jonathon Walkingstick and his daughter Lily. After he took her to visit her grandparents they returned sullen and quiet. It turns out he is being sued by her grandparents for custody. In the other story, we have a girl murdered outside a reportedly haunted cabin where she and her friends were staying the night. She had strange symbols carved into her body, which leave the sheriff puzzled and her former governor father angry and looking for blood. They rush to arrest a man who protests his innocence and is then represented by Mary Crow. I liked the various voices telling this story to get everyone’s point of view, it adds an extra dimension. If you are looking for a new series to read or really enjoy a good mystery, stories about the Appalachian mountains, I’d recommend these books."}, {"userName": "Pam", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/3684954-pam", "userReview": "When a group of young interns vow to spend a night in the haunted Fiddlesticks cabin, one of them does not survive the night. Lisa Wilson, the daughter of a prominent politician, is lured out of the cabin by mysterious fiddle music. Her body is found the next morning with strange symbols carved all over it.Mary Crow takes on the case even though she promised her boyfriend that she would not do murder cases. As she explores the facts in the case, each new revelation about the original Fiddlesticks case, pulls her into a complex web. As she is being pulled deeper and deeper into the case, her boyfriend, Jonathan, is being pulled in another direction with his daughter. At first, I thought that Music of Ghosts, might be more of a horror novel, with their being actual ghosts, but it soon shown itself to be a murder mystery with plenty of twists and turns along the way. In addition to the murder mystery, the relationship between Mary and her boyfriend Jonathan is explored in detail. I didn't realize that there are other Mary Crow books when I started this book, I will not hesitate to read others."}, {"userName": "Space Out With Sci Fi in June The Haunted Reading Room", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/7302570-space-out-with-sci-fi-in-june-the-haunted-reading-room", "userReview": "Review of Music of Ghosts by Sallie BissellA Mary Crow Mystery5 StarsI had read an earlier mystery in the Mary Crow series some years back, and enjoyed it very much. I also found myself totally engrossed in “Music of Ghosts,” Sallie Bissell’s newest entry in this series. Mary Crow is a Cherokee attorney, a former prosecutor, who for the past seven years has lived on a mountain in North Carolina’s Pisgah County and practiced civil law. She made a promise seven years ago to her life partner and long-term love Jonathan Walkingstick, not to practice criminal law. But now, the coed daughter of a former North Carolina governor has been murdered, an odd script carved all over her body, near an infamous, supposedly haunted cabin, the scene of two murders back in 1958. Sallie Bissell delineates the Appalachian landscape and its people, both Caucasian and indigenous, with a deft brush, and brings the area vividly to life. Reading this novel was like following the characters around, experiencing their events and emotions. I’m definitely making it my goal to catch up on the books in this series I’ve missed.I reviewed a complimentary e-book copy via NetGalley."}, {"userName": "Mae", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/3154609-mae", "userReview": "This novel is Book 5 in the Mary Crow series. I won this novel from Goodreads FirstReads program and thought that I may have to read the first four to understand the one I just received. However, this book stands alone, although I will be reading first four as soon as I can get my hands on them! This book packs the perfect amount of thrills and page-turning to keep you reading until the last page. There are many things to enjoy--I loved the short chapters, quick pacing and that there are several different characters working on solving the mystery who actually interact with one another. Mary Crow is a really likeable character whose storyline nicely balances her personal and professional lives in a realistic way that make you care about her. Bissell also gives us insight in the other character's private lives and makes even minor characters relatable and interesting. This is definately a book to curl up with during a thunderstorm!"}, {"userName": "Megan", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/597779-megan", "userReview": "Another new series I discovered through this year's Malice Domestic conference: the Mary Crow series. \"Music of Ghosts\" is the fifth one in the series but I didn't feel lost not having read the earlier ones. This contemporary series is set in rural North Carolina and centers around Crow (an attorney). The mystery starts with the murder of a former North Carolina governor's college-aged daughter. Killed in an old cabin in which a heinous double-homicide occurred decades before, local lore factors heavily into the investigation. The plot was complex and wove in a personal story line involving Crow's long-time boyfriend and his young daughter, a music tradition indigenous to Appalachia, and Cherokee lore. While this was a little grittier than I was expecting, I found the story compelling and would read earlier books in the series based on this one."}, {"userName": "Christel", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/16782252-christel", "userReview": "I received this book for free through Goodreads First Reads. Thanks for allowing me the opportunity to review this. I started this book the other night, stayed up late and fought sleep to keep reading. I wanted to see where not only the solution to the murder went, but all the subplots, too. This was a richly imagined plot, and I didn't expect it to go where it did. Set in North Carolina, it mixes Appalachian and Cherokee lore and customs. The characters have full lives, and I cared to find out what happened to them. There is a lot of romance and friendship as well as the mystery. Though the 5th in the Mary Crow series, I was able to fill in a lot of back story and not feel lost as with some other series, so it worked as a standalone which I appreciate."}, {"userName": "Natalie", "userReviewDate": "Nov 09, 2013", "userURL": "http://www.goodreads.com/user/show/4936267-natalie", "userReview": "Scene: Fiddlesticks cabin - the horror stage of a ghastly double murder. Years later it is the creepy hangout for college and high school students looking for a spooky thrill. Until Lisa's body is found, brutally slaughtered and carved with strange symbols. Nick Stratton, Lisa's boss becomes the #1 suspect, but his lawyer, Mary Crow, isn't so sure, and neither is the Sheriff. Things don't add up. Mary is dealing with her own personal problems. Her boyfriend, Jonathon, is going through a custody battle and his relationship with Mary might cause problems. Meanwhile, the Sheriff is trying to deal with Lisa's father, the ex-governor. This was a good mystery novel. The characters felt real and the story had a good pace. I liked the subplots."}, {"userName": "Addison Public Library", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/28563981-addison-public-library", "userReview": "Deep in the Appalachian woods stands the old Fiddlesticks cabin, the scene of a bloody double murder from decades past. Now the haunted cabin lures young thrill seekers who hope to hear the killer's ghostly fiddle music. When a group of college students comes to call, Lisa Wilson--the daughter of a former North Carolina governor--is tragically murdered, and her flesh is mutilated with disturbing symbols. Law enforcement is confounded by a smart killer and the old taboo of the legend. JLCheck out this book today!"}, {"userName": "Caroline", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/4156648-caroline", "userReview": "This book was a long time in coming. I simply can't understand why SB is not more popular. I think her publishers is not pushing her to the right crowd. She should be along side Chelsea Cain, and early LKH. Mary Crow is not some frilly, little thing and I think that SB is worthy of hanging with the big guns for real. her novels are excellent, every time, start to finish. Does anyone remember that series about two brothers who were rock climbers, one was a lawyer, one kind of a criminal? Those novels were great! Where is the guy? who knows! but I think that Sallie is right up there with Nevada Barr and should get a lot more recognition."}, {"userName": "Elizabeth Kennedy", "userReviewDate": "Sep 29, 2015", "userURL": "http://www.goodreads.com/user/show/23606512-elizabeth-kennedy", "userReview": "This was an exciting book! I have never read one of Sally Bissell's books before and I appreciated that even though this was my first journey into the world of Mary Crow, I was completely captivated. It was easy to understand what happened in previous books and to truly care about what happened to her and Jonathan, to the accused criminal and the poor, tortured victim. This is what I want books in a series to be like- good on their own if someone like me happens to pick them up thinking that the story sounds good. I will definitely be reading more of this series, in fact I have \" Call the Devil by his Oldest Name\" on my to be read stack."}, {"userName": "Molly", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/101007-molly", "userReview": "(2.5) Am reading various \"ghost\" stories stored on my Kindle to get in the mood for Halloween. This was a decent mystery, which is hard to come by, though I was conscious of it being a part of a larger sequence. There is a custody suit in the book that applies to the narrative of the protagonist, and I think I was more interested in the singularity of the book--the haunting, the whodunnit, etc."}, {"userName": "Jiniece Goodman", "userReviewDate": "Apr 12, 2013", "userURL": "http://www.goodreads.com/user/show/19353905-jiniece-goodman", "userReview": "Sallie Bissell's fifth novel in in her Mary Crow series was definitely worth the wait! Even if you haven't read any of her previous books, \"Music of Ghosts\" easily stands strong by itself and sucks the reader in with intoxicating suspense. Ms. Bissell's well-defined characters become treasured friends and frightful enemies that will leave you longing for more. \"Music of Ghosts\" has all the elements to make for a very sleepless, page-turning night!"}, {"userName": "Jaime Stevens", "userReviewDate": "Oct 02, 2014", "userURL": "http://www.goodreads.com/user/show/12583190-jaime-stevens", "userReview": "After reading the previous book Legacy of Masks, which has even my favorite in this series, so this book wasn't as thrilling as the previous . I have enjoyed every book in this series and recommended to several people. Sallies books are easy to read and follow. I accidentally started reading the most current book in this series and stopped to read this one. I'm excited to finish the next book! I hope I can find some thing else that is written as well as this series."}, {"userName": "Amy", "userReviewDate": "Jan 24, 2014", "userURL": "http://www.goodreads.com/user/show/60908-amy", "userReview": "A number of years have passed since we last read about Mary and Jonathan. As always, these books are so engaging and I honestly can't put it down. And as always, things tie up a bit too quickly for me. I'm so glad I read the previous books first before diving into this one, being that the back story is huge when it comes to Mary's home life with Jonathan and Lily. I'm very interested in what will happen in the next installment."}, {"userName": "Becky ", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/6813590-becky", "userReview": "I loved this story! Such a rich plot with so many interesting sub stories that I couldn't stop reading. I really like the main character, Mary Crow, such an interesting character with so many depths. Warm, caring, passionate but strong. Good, strong story that keeps you hooked and guessing. A must read in my book and one I'll read again, hence the five stars."}, {"userName": " Doris Powell", "userReviewDate": "Dec 04, 2013", "userURL": "http://www.goodreads.com/user/show/8316953-doris-powell", "userReview": "I really like this series. Mary Crowe, the protagonist, is very likable. I also like the setting in the North Carolina mountains. Ms. Bissell writes a very good novel. I would recommend reading the novels in the order that they were written. I didn't, so I have had to order two previous books to understand what is going on better in her last book."}, {"userName": "Dave", "userReviewDate": "May 23, 2013", "userURL": "http://www.goodreads.com/user/show/4394470-dave", "userReview": "This was the 1st book of the \"Mary Crow\" series that I have read. I really do feel that I would have enjoyed this one better, if I had read the other books first. Most reviews say it's a stand alone, and maybe it is. But I did feel like I was missing out on some things. The mystery is a good one,and that kept me going. The other plots? Not so much..."}, {"userName": "Holly Lu", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/7619114-holly-lu", "userReview": "one of the authors I rediscovered while packing books. mostly set in NC, main character is Cherokee--well-drawn & suspenseful--bit of a slow less-engaging opening sequence but then pulled back to mary crow & dilemmas of intimacy & relationship."}, {"userName": "Susan", "userReviewDate": "May 25, 2013", "userURL": "http://www.goodreads.com/user/show/6991218-susan", "userReview": "Sallie Bissell has done it again. This is another book that I could not put down. I love Mary Crow's character. I am excited about the next Mary Crow book to see if the relationships can be mended."}, {"userName": "Rachel", "userReviewDate": "Jun 20, 2013", "userURL": "http://www.goodreads.com/user/show/4807885-rachel", "userReview": "I won a free copy of this book through first-reads.I really enjoy a good murder mystery book, and this was no exception. It kept me on the edge of my seat the whole time. And I found the ending surprising. It was definitely enjoyable and I hope to read more of the Mary Crow books in the future."}, {"userName": "Nancy Adams", "userReviewDate": "Oct 28, 2013", "userURL": "http://www.goodreads.com/user/show/5185479-nancy-adams", "userReview": "I waited a really long time for this 5th installment in the Mary Crow series. I was not disappointed. It's a great spooky mystery and I look forward to seeing how Mary's life continues in the next book!"}], "description": "Deep in the Appalachian woods stands the old Fiddlesticks cabin, the scene of a bloody double murder from decades past. Now the haunted cabin lures young thrill seekers who hope to hear the killer's ghostly fiddle music. When a group of college students comes to call, Lisa Wilson - the daughter of a former North Carolina governor - is tragically murdered and mutilated with disturbing symbols.Pisgah County sheriff Jerry Cochran is in hot water when the ball-busting politician shows up, threatening to tear the county apart in search of his daughter's killer. But Nick Stratton - the handsome raptor center specialist and Lisa's boss - is in even hotter water when evidence points to him as the prime suspect. As Nick turns to attorney Mary Crow for help, it's up to the Pisgah County native to discover the truth. Did Nick do it? Or is there a deranged mountain killer on the loose?", "title": "Music of Ghosts\n      \n          (Mary Crow #5)", "url": "http://www.goodreads.com/book/show/23262346-music-of-ghosts", "average": 3.81, "cover": "https://images.gr-assets.com/books/1411409817l/23262346.jpg", "reviews": 50, "authors": [{"url": "https://www.goodreads.com/author/show/282646.Sallie_Bissell", "name": "Sallie Bissell"}], "type": ["Mystery", "Native Americans"], "outlinks": ["http://www.goodreads.com/book/show/23262346-music-of-ghosts", "http://www.goodreads.com/book/show/15862125-music-of-ghosts", "http://www.goodreads.com/book/show/17625488-music-of-ghosts", "http://www.goodreads.com/book/show/18716067-music-of-ghosts", "http://www.goodreads.com/book/show/507624.In_The_Forest_Of_Harm", "http://www.goodreads.com/book/show/702214.A_Darker_Justice", "http://www.goodreads.com/book/show/507620.Call_the_Devil_by_His_Oldest_Name", "http://www.goodreads.com/book/show/529363.Legacy_of_Masks", "http://www.goodreads.com/book/show/18126445-deadliest-of-sins"]}