{"ratings": 27237, "userreviews": [{"userName": "Carol", "userReviewDate": "Aug 21, 2012", "userURL": "http://www.goodreads.com/user/show/7668522-carol", "userReview": "[ she is absolutely, positively 100% guilty, guilty, guilty!!! And I still cannot believe all the clues Philip destroyed, but then.....thankfully, it did not matter in the least. (hide spoiler)]"}, {"userName": "Elyse", "userReviewDate": "Jun 06, 2017", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "I started reading Daphne du Maurier just this year.....a 2017 *du Maurier* newbie! The first book I read was \"The Scapegoat\", then \"Rebecca\", then \"The Flight of the Falcon\".....and this morning I finished \"My Cousin Rachel\". \"My Cousin Rachel\", is Daphne du Maurier's 3rd highest rated book. \"Rebecca\" is rated as the #1 popular favorite-- followed by \"Jamaica Inn\" as the #2 most popular. I won't be surprised with a new movie of \"My Cousin Rachel\", soon, if this book takes the #2 popular spot soon. Regardless 'which' Daphne du Maurier book one chooses to read... the reader has NO QUESTION ABOUT THE AUTHORS TALENTS. SHE CAN TELL A STORY LIKE NOBODIES BUSINESS!!! Since there are 17,462 Ratings on Goodreads - 1, 638 reviews- with an overall rating of 3.9 on Goodreads ..... rather than write another traditional review-- I'm going to write a little letter to three characters in this story and one dog.  Dear Ambrose,  I'm sorry your life was cut short. I'm happy you experienced romantic-soulful love....but again, I'm sorry it was cut short. I'm sorry you suffered just before you died - sounded like you were in excruciating pain physically- and mentally. What I'm most sorry about though - disappointed - is the way in which you raised Philip. I don't think you did him any service. He idolized you - was dependent on you emotionally- spiritually - mentally - and even physically in ways. You feed him 'your' opinions and judgments about women.... which was basically they weren't needed in your lives. Given the size of your estate - and the many servants you hired - it would have made sense if some of your employees were men and some women. But.... you made sure that all servants in the house, including the Gardner we're all men. How dare you project your views so rigidly upon this innocent boy. You molded him his life -- not just sheltered it - but actually spoon feed him your beliefs. Shame on you for doing that. After you died.... Philip didn't have a healthy sense of 'self'. He was left alone in the world --- a younger clone of 'you'. But that didn't even work.... did it?? As Philip begins to discover he might not have known you as well as he thought. Well, Ambrose.... what is done is done. Philip had to figure things out on his own --- which isn't SO BAD..... it's something we all must do, but in the best of all world's - you might have done things a little different by him while he was in your care. Bottom line: Philip had some problems - you must have foreseen these showing up sooner or later...... AND..... Philip loved you. You loved him.Rest In Peace Ambrose!! Dear Philip,  Oh, how I worried for you. At times I adored you - other times I wanted to scream at you: \"WAKE UP\"!!!! Your life was so small you couldn't even see how much it had stifled you. I did respect your authentic struggle between feeling jealous of Ambrose and Rachel's happiness in their new marriage--- and your guilt for having such feelings. You were being real and honest with yourself - facing 'what's so'. You weren't blaming anyone - or lashing out negatively against anyone just because of your own negative feelings. Philip you became mysterious to me once you turned 25 years old-- as if your birthday was THE LAUNCH you had been constructing -preparing for - your entire life. I wasn't sure who you were any longer. I not sure you knew either. It looked like you were acting out impulsively to me -- in ways that perhaps Rachel might do.....but I don't think so, Philip. I actually don't think either - you or Rachel ever acted impulsively. I think you were both playing a master chess game. I am sorry you lost Ambrose. I'm sorry you lost him the way you did. I was sorry that you hurt. I was very sorry for your loss of Don ( your doggie). I found it somewhat interesting that right after Don died the first thought that ran through your mind was noticing that Rachel was caring for you - for the first time perhaps - more than Ambrose. You seemed to deny your 'own' feelings for your loss as Don, saying to Rachel, .....\"Don did not suffer\". I was thinking ....\"like hell\". If you had something fall on 'your' head..... could you really say.... \"oh I didn't feel a thing\"? You were so in chanted by Rachel at that moment, Philip, your dog who had been with you your entire life took a second seat. What a fool you were! I don't think you really meant to do any harm.... yet I thought you were a insensitive..... like a child.....you were a little narcissistic about yourself. And why? You were woman- starved your entire life! I was hoping that he would just go f#%k your brains out! You needed time to catch up with 'growing yourself up'.You certainly didn't need to even consider jumping into a marriage at age 25 as a virgin man! It was your own fault if Rachel had you tied by her little finger. NOTE..... for friends who have NOT read this book.... I HAVE GIVEN NO SPOILERS AWAY!!!! None! Dear Rachel,  Oh my dear woman..... aren't you the enchantress--mischievous aren't you? Bossy-endearing?......\"Philip, Go to Bed\"! How funny! I did like that line you said a 'few' times. I was wondering why you didn't just say, \"come to my bed\".... but I knew why really....( he would have)....you were not 'that' foolish! You had better strategic moves, didn't you? Oh..... and how you familiarize yourself with the estate and stories after stories about Philip from Ambrose. Plotting were you? You could seem so delicate. The entire staff adored you....you were quite brilliant at being you. You had me believing in your thriftlessness--your unpolishedness. But you were actually quite skilled and sophisticated ....... You had a natural masterly authoritative way about yourself. Tears included. I'm not sure I fault you though --- Philip and you 'both' played a dangerous game with the hearts of love - money - and -control.  Dear Don, I'm sorry you died so suddenly. You were 15 years old. I loved when you snuggled near the fireplace with Philip..... Rest in peace, Don! You were a treasure in this story. The REAL WINNER .......goes to Daphne du Maurier....she knows how to develop characters - how to spin a story - how to involve the readers ...... A+ Oops... we don't grade these books - do we?/! - we rate them! 5 stars!!!"}, {"userName": "Marita", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/17415449-marita", "userReview": "Philip Ashley, the narrator of this story, reminds me of a big, sulkily pouting baby who is always ready to throw his toys out of the cot. Tall and good looking he might be, but he is thoroughly unlikeable. He is self-centred, peevish and jealous. And Philip is naïve and foolish. ‘Mine, mine mine’ is the order of the day. Even when he gives handsomely it is for an ulterior motive. He frequently behaves boorishly, and he has a cavalier attitude towards his childhood friend, Louise. When he forgets an appointment with her because his mind is on matters which please him more, he lies to her about the reason for making her wait in vain. He dismisses her as being of no interest to him (fair enough), but he is happy enough to turn to her for advice when he is stymied. Louise is no fool, though. She notices what goes on around her, and she is sensitive to his mood and feelings. Enter Philip’s cousin Rachel, widow of cousin Ambrose Ashley who had raised Philip as a son. Unlike Philip, the charming Rachel knows exactly how to handle or manipulate people. Philip soon finds himself completely out of his depth with her. Philip admittedly knows nothing about women, and she perplexes and fascinates him. Rachel is a complex character, and just when we think we have a handle on her we learn something new about her, and she continues to be an enigma to the very end of this novel. Daphne du Maurier is a master story teller, but her characters are also fully rounded individuals. The story itself, which I won’t recount, builds and builds in tension from the moment of Ambrose’s departure for Italy, and subsequently with Philip learning about the existence of his cousin Rachel and then her eventual arrival at his home. Besides being a cousin and beloved Ambrose’s widow, who is she exactly and why is she here? Why and how did Ambrose die? Did Rachel have a hand in his death? Once arrived, the tension eases as Philip sets aside preconceived ideas and he and Rachel get to know each other better. Then there are little discoveries which again start ramping up the tension. A hint here, an incident there, and suspicion continues to mount as do other passions such as infatuation and jealousy. The arrival on the scene of the somewhat dodgy Italian, Rainaldi, doesn’t improve matters. The ambiguity as to Rachel’s innocence or not is retained to the very last word, but we do see several sides of Rachel, and not all of them are pretty. When things go awry, it seems that even the weather colludes:\n”The bluster that should have been in February and March had come at last. Gone was the mellow warmth of the past weeks, the smooth sea, and the sun. Great clouds with dragging tails, black-edged and filled with rain, came scudding from the west, and now and again with sudden bursting fury emptied themselves as hail. The sea was a turmoil in the western bay. In the fields on either side of the road the gulls screamed and dipped in the fresh ploughed earth, seeking the green shoots fostered by the early spring.”"}, {"userName": "PorshaJo", "userReviewDate": "Jun 04, 2017", "userURL": "http://www.goodreads.com/user/show/5464046-porshajo", "userReview": "I loved this story! It reminded me so much of Rebecca, both have that gothic atmosphere, the bit of romance, the slow moving story that builds such tension, and the dimwitted main character. I thought briefly this might even surpass Rebecca as my favorite, but how can you top 'Last night I dreamed I went to Manderley again'? Though not too shabby here with 'They used to hang men at Four Tunings in the old days'.My Cousin Rachel tells the story of obsession. Philip is a young gent, who is grieving over the loss of his cousin, who also raised him, Ambrose. Ambrose was recently married to his cousin Rachel and became quite ill and died. Now Rachel goes to Cornwall to return the belonging of Ambrose to Philip, and the two finally meet. Oh there is jealousy, deceit, and such an obsession in this wonderful tale. I don't want to tell anymore as to give anything away. Just read this one and decide for yourself about cousin Rachel. Is she evil or not?I listened to this one via audio and the narrator was awesome! Jonathan Pryce, the actor, adds so much to this story, building the tension even more as he reads this tale. If you are a fan of audios, I highly suggest this one. I loved every minute of this and the tension and suspense went right to the end. A top read and top audio for the year, and a new book to add to my favorites and list of those I would enjoy a re-read."}, {"userName": "Hannah Greendale", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend. Du Maurier wields her audience like puppets, deftly stringing readers from truths to untruths in ways both delightful and maddening."}, {"userName": "Michael", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/65909643-michael", "userReview": "This was a buddy-read with James (Jay), author of Watching Glass Shatter, and I'm so happy we read this. I'd rate it 4.5* just to distinguish it from Rebecca, which gets the full five.The book actually began a little slowly for me, and it felt almost discombobulated, as if DuMaurier were shuffling toward the storyline. But then Rachel appears and everything clicks masterfully into gear. DuMaurier expertly conjures a brooding, ambiguous atmosphere, and from the very beginning we wonder about this bewitching woman who seizes our narrator, young Philip, in the grip of her Italianate charm. The fact that she may have been responsible for Philip's guardian's death is something he dismisses with the enthusiasm of the young, until....Plot summaries abound, and I won't add to them here. The language of the book is utterly beguiling, those languid fluid sentences sweep us through the plot and make us take notice of all sorts of subtleties: the cut of a dress, the gleam of an eye, the inflection of a voice, and of course the natural world in all its infinite variety: \"The wind of the day before had blown itself up-country, taking the rain with it, and at noon the sun had broken through and the sky was clear. There was a salty brightness in the air, lending a zest to walking, and you could hear the running swell of the sea as it broke upon the rocks fringing the bay.\"Once I got past the first few pages, I felt myself in the hands of an expert storyteller. The plot moved through its gears with precision, and even when I knew or sensed what was coming, it was a sublime pleasure to see DuMaurier spin it out, taking her time, building suspense so perfectly. Oddly enough, though, it was the very expert nature of the narrative that makes this book, for me, slightly less interesting than Rebecca. Rebecca has always seemed to me almost Sui generis, and it enchanted me equally yet surprised me more; it seemed more complex and difficult to pin down, a narrative of almost infinite slipperiness and ambiguity. My Cousin Rachel, by contrast, is less layered and more straightforward, even though it has its own twists and turns and beautiful ambiguities. Still, this is a book that will reside with me for some time and one that I'll no doubt return to, if only to see and admire how DuMaurier handles a certain aspect of plotting or character, how she masterfully drops her clues into the narrative stream, how she keeps the pages turning, knowing exactly when to slow down and admire a landscape, and when to speed us through. This is a thoroughly pleasurable book, and one that I highly recommend."}, {"userName": "Julie", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "My Cousin Rachel by Daphne du Maurier is a 1952 publication. This version is the 2013 Little, Brown and Company publication. A scathingly wicked masterpiece-This book has a very heavy atmospheric quality that drew me in right from the start. In fact, I was so transfixed, I put aside everything else and gave myself over to its allure. Phillip Ashley was raised by his cousin, Ambrose, a confirmed bachelor. They are content with their arrangement, and with Phillip’s role as heir to Ambrose’s legacy. However, Phillip’s complacency is upended quite unexpectedly when Ambrose travels to Florence, meets ‘our cousin, Rachel’, a woman with a connection to their family, and immediately falls under her spell.  In a shockingly brief period of time, Ambrose goes from wedded bliss to death, leaving Phillip furious with Rachel, suspecting her of contributing to his cousin’s demise in some way, shape, or form. But, when Rachel shows up at his doorstep with Ambrose’s belongings, Phillip too finds himself enchanted by Rachel and soon forgets all about his earlier jealousies and suspicions. Until…I have several books in my collection written by this author, but the only one I’ve read is, ‘Rebecca’,When this book began to recirculate due to a motion picture and a ‘great library reads’ promo, my interest was highly piqued. Finally, I managed to work it into my schedule, but I wish I had discovered this gem sooner! This book has so many layers, yet it progresses slowly, adding sinister nuances, bit by bit, until I found myself helplessly trapped in the author’s, oh so clever web before I knew what had happened, maybe a bit like Phillip, eh?This book combines Gothic mystery, strong feminist undertones, psychological mind games, vanity, guilt, and suspicion, which nearly made me delirious with delight. But, it also left me with a plethora of theories and speculations. Is Rachel guilty… or was it really Phillip? Or was she Innocent? Both? Was Phillip just a pawn in Rachel’s master plan? Did Phillip needlessly destroy his life? While I would ordinarily feel extreme frustration with an author for this open- ended conclusion, in this case, it’s exactly what makes this book a classic. Written back in 1952, the book was a little ahead of its time, although some may have only taken it at face value. Nevertheless, here we are in 2017, still talking about it, still pondering on its mysteries, analyzing, and theorizing about it, which is a testament to the author’s talent and genius. This book was practically tailor made for my reading tastes, so naturally, it gets five big stars!!"}, {"userName": "Jean", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/19300421-jean", "userReview": "[The ambiguous ending here is a favourite device of Daphne du Maurier. In an interview from 1977, she was asked, \"In My Cousin Rachel, was Rachel good or evil?\" and she replied, \"Lots of people have asked that and, to tell the truth, I don’t know. You see, I was Philip when I wrote the book ... When one is writing a novel in the first person, one must be that person.\"Interesting, isn't it? And you have it there from the horse's mouth. (hide spoiler)]"}, {"userName": "James", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/7365405-james", "userReview": "Why This Book\n\nAfter reading Rebecca several years ago, I placed My Cousin Rachel, another of Daphne du Maurier's famed novels, on my To Be Read (TBR) shelf. Earlier this year, a Goodreads buddy, Michael, and I were chatting about various books when we decided to do a buddy read together, selecting this wonderful Gothic edition. We were both interested to see if it lived up to the hype and how it compared to the author's other words. We agreed on early March and got to it this week. I've only started doing buddy reads in the last few months, but they are quite fun... I recommend them.\n\nApproach & Style\n\nI purchased the Kindle Reader version from Amazon to read on my iPad. It contains ~350 pages and took me four days to read. The novel is written in first person point of view and told from the perspective of Philip Ashley, a 24-year-old English man set in a somewhat unknown time, but likely the early/mid twentieth century given some of the details in the background setting. The language is intense and full of amazing imagery and astounding descriptions.\n\nPlot, Characters & Setting\n\nThe novel centers around the Ashley family. Philip's parents die when he is less than a year old, but his cousin Ambrose raises him in their England home. At some point years later, Ambrose unexpectedly marries a widow named Rachel who is half-Italian and grew up in Tuscany. It's an odd pairing, as she has a bit of a reputation for husband-hunting and spending lots of money. After ~2 years, Ambrose mysteriously dies and Rachel disappears. Philip is distraught, but searches for her in Italy. Rachel eventually shows up in England looking to meet her pseudo-stepson, and that's when the story really begins to get interesting. There's an air of darkness concerning Ambrose's death--was Rachel involved? She has a suitor of sorts who follows her from Tuscany--yet both claim there is nothing but friendship. Philip intends to crucify his cousin Rachel after reading a few letters from his late cousin, Ambrose; however, things take a surprising turn when more secrets are revealed and there's a bit of romance developing in the background. Add in a few traditional English families, an inheritance upon Philip's 25th birthday, and a possible proposal to/from a neighboring family... and you've got quite a Gothic story unleashing it's power on you.\n\nKey Thoughts\n\n1. du Maurier truly engages the reader with lyrical and ethereal descriptions of everything going on in the story. You will feel like you are sitting at a table in the house watching everything occur around you. The super-fine details are what challenge your intellect to decide what is real and what is not.2. As a plot, it's classic -- did she or didn't she kill him? But here's the interesting part... that question hardly ever comes up in the book. It's not a mystery in terms of researching the past to see if murder actually happened. It's entirely psychological in the relationship between Philip and Rachel... where you listen to the words or what isn't said, think about whether you trust either of them... and in the end, you just wish you could have spoken to Ambrose yourself to get the answer.3. I went back and forth multiple times deciding whether I liked Rachel and Philip as characters and as human beings. Humanity and kindness are huge themes in this novel. Attitude and disinterest are also keen to make themselves present within the relationships. Sometimes I wanted to throttle both, other times, the tenderness was admirable. The last few chapters truly push the envelope in terms of engaging more doubt before there is a final reveal.4. While reading the first ~75 pages, I was also editing my novel. I had on my 'writer glasses' and couldn't stop analyzing the word choice in du Maurier's initial chapters. It was disconnected and hard to attach myself, too. I also found a few words that were repeated a couple of times on the same page (a pet peeve for me in my own writing) and after the third or fourth, I slapped myself and realized it wasn't important. 99 amazing words on every page and 1 every so often that didn't work. That's way too high of a percentage to ever get stuck! Stick with it past that initial 15% mark and you're in for quite an intellectually stimulating ride.5. If you love Italy or the quintessential proper English culture and decor, you will enjoy this novel. The only thing that bugged me from time to time was not really knowing enough about Philip prior to meeting Rachel, so I could form a strong enough opinion on who he was as a person, i.e. before he became mesmerized by his cousin Rachel.6. My favorite part of the whole book... Philip ALWAYS refers to her as 'My cousin Rachel' until a certain event changes their lives... then she simply becomes 'Rachel.' The meaning of the novel is hidden in that ever-so-small alteration in their relationship and future.\n\nSummary\n\ndu Maurier is quite skilled at creating scenery, characters, and undetermined truth. We really never know who to believe, even in the end. But it works. Whereas Rebecca was a stronger plot, I think My Cousin Rachel pushes the envelope more in terms of who should we believe. Either case, I really enjoyed the read, especially discussing it with Michael, who is an author you might want to take a look at (new book coming out in April '18).  I plan to review the author's bibliography this summer to see if there's another potential novel of hers I'd like to read. Overall, I'd give this 4+ stars as I really enjoyed it, but there was some repetition and missing pieces so I couldn't quite knock it up to a 5-star rating."}, {"userName": "Carol  ꧁꧂ ", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/25867535-carol", "userReview": "[ Rachel was a heartless gold digger who poisoned the two men (hide spoiler)]"}, {"userName": "Iris P", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "My Cousin Rachel★★★ 3 ½ StarsIf you haven't read this novel yet here's a short synopsis from the book blurb:\n\nOrphaned at an early age, Philip Ashley is raised by his benevolent older cousin, Ambrose. Resolutely single, Ambrose delights in Philip as his heir, a man who will love his grand home as much as he does himself. But the cozy world the two construct is shattered when Ambrose sets off on a trip to Florence. There he falls in love and marries - and there he dies suddenly.Jealous of his marriage, racked by suspicion at the hints in Ambrose's letters, and grief-stricken by his death, Philip prepares to meet his cousin's widow with hatred in his heart.Despite himself, Philip is drawn to this beautiful, sophisticated, mysterious Rachel like a moth to the flame. And yet . . . might she have had a hand in Ambrose's death?\n\n***********************************************I suppose it is only inevitable that, once you read your first novel by an author, you find yourself comparing the subsequent ones to that first experience and, even subconsciously, hoping to replicate it. In this case, my reaction might be heightened by the fact that the one novel I'd read by Daphne du Maurier was probably her magnum opus, Rebecca. I certainly enjoyed My Cousin Rachel and found it to be highly readable and engaging, but in my opinion, it lacks the elegance, intensity and clever structure of Rebecca.After finishing the book, I learned how much of an influence the Brontë sisters had in Du Maurier's writing and, as you read Rachel it's easy to recognize that effect.It's been a few years since I read Jane Eyre but in many ways, this book reminded me a lot of Charlotte Brontë's famous gothic tale. Both novels use a first person point of view and share an evocative atmosphere as well as a profound sense of foreboding that permeates throughout the narration.Du Maurier was brilliant at building a feeling of apprehension that gradually envelopes the reader and, by the time you realize it, you are so wrapped in the story that the only way to get out of that \"trap\" is seeing the book to the end. Most of the novel revolves around the mystery behind Rachel's motives: Is she the proverbial black widow? Is she truly looking out for the much younger Phillip or exploiting his naiveté? So, villain or not, that is the question. The ambiguity surrounding her character felt at times a little too manipulative, but I appreciate the clues Du Maurier drops, which keeps you invested in the story. Ultimately, the conclusion while not exactly surprising certainly seemed fitting. What kept me from completely getting lost in the narrative was the character of Phillip, which I found rather immature and someone who seemed to be permanently carrying a chip on his shoulder. After Ambrose leaves for Italy, Phillip is somehow capable of managing a large estate and taking on all sorts of responsibilities and yet he behaves like a sophomoric teenager around \"his cousin Rachel\". His puppy love and overly dramatic attitude would be expected of a 15-year-old, not so much a 25-year-old man. So yes, I am a bit disappointed with this book but I still thought it was a pretty compelling read if for nothing else because I'm still mystified by Rachel. Was she a cold-hearted schemer? An overly ambitious seductress? A product of her upbringing and environment? Just a complex woman with her share of virtues and flaws? All of the above? Du Maurier certainly resists to give us an ending with simplistic answers and moral certitude. Which is why I think this novel remains so fascinating to so many readers: the mystery of Rachel is never quite unraveled.The audiobook, which is beautifully narrated by British actor Jonathan Pryce, gets 5 stars!"}, {"userName": "Diane Barnes", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/7262060-diane-barnes", "userReview": "Wow, did Daphne du Maurier ever know how to tell a story! I read \"Rebecca\" a couple of years ago, more to fill in a gap in my reading history than for any other reason, but it was a riveting gothic suspense novel, and worthy of it's classic status. I bought \"My Cousin Rachel\" at the same used book sale, and just now got around to it. My word, I think it's even better. It combines a naive and arrogant young man with a worldly \"cousin\", who had been married to his uncle for a short time, until his untimely death brings his widow to England. The story builds slowly, with suspicions gathering in the mind of the reader, until (in my case, at least) you are screaming at Phillip on every page, \"DON'T BE SO STUPID, OPEN YOUR EYES FOR PETE'S SAKE.\" Well, but the ending! Was I, the reader, wrong? Was Phillip wrong? Who was Rachel, really, and what was she thinking? Did my cynicism and suspicion lead me down the wrong path, or was I too quick to jump to judgement? These questions will haunt me for a while.As I said, this woman knew how to tell a story."}, {"userName": "María", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/17754092-mar-a", "userReview": "[¿Lo hizo? Supongo que nunca lo sabré, aunque no soy amiga de las casualidades. Y si Philip se hubiese guiado por sus instintos, quizás tampoco lo sería. ¿Rachel mató a sus ex maridos? ¿Su adicción al dinero y el despilfarro la hicieron capaz de asesinar? Si es así, muero de la pena por ella. Un vacío tan grande en el alma, no se llena con vestidos ni con muebles caros. Pero, ¿y si solo era una mujer exigiendo su libertad? ¿Y si su belleza y sus maneras enamoraban a cualquiera? Quién sabe... De ambas formas, amo a Rachel. (hide spoiler)]"}, {"userName": "Marilyn C.", "userReviewDate": "Jun 30, 2017", "userURL": "http://www.goodreads.com/user/show/8170584-marilyn-c", "userReview": "\"She has done for me at last, Rachel my torment\" The question that you will be asking yourself when you finish this book \"Did she...or didn't she?\" My Cousin Rachel was my first book by Daphne du Maurier and I thought it was brilliant! Written over 75 years ago, this story has such a timeless feel to it. The way du Maurier slowly builds the suspense and mystery was masterful, layer upon layer right up until those final shocking chapters. The characters of the mysterious Rachel and the spoiled and pompous Philip are so cleverly written that you start to question your opinion of them as the story ends. I listened to the audio version of this story and I thought Jonathan Pryce was an excellent narrator. This was my longest audio to date but this story was so captivating I really didn't feel the 11 plus hours of listening time. This book and audio is deserving of 5 huge stars and going right onto my favorites list!"}, {"userName": "Misfit", "userReviewDate": "Oct 23, 2008", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "Did she or didn’t she? That is the question that will keep readers on the edge of their seat until the final twists on the very last pages. Phillip Ashley was orphaned at a young age and raised in 19C Cornwall by his older cousin Ambrose. Health issues force Ambrose to spend time in warmer climates and he meets and marries a distant cousin Rachel, the widowed Countess Sangaletti. A cryptic note arrives from Ambrose hinting at being poisoned and Phillip heads to Florence to find Ambrose dead of a brain tumor (so the doctors say.....) and Rachel disappeared, with Rainaldi her close friend and “financial advisor” handling her affairs.Phillip heads home and as rightful heir takes over running the family estate, but constantly broods on his hatred of Rachel and builds an image of her that is completely different when he comes face to face with her. Instead of the murdering she-devil he's built up in his mind, Phillip doesn't quite know what to make of this tiny, elegant and very enigmatic cousin of his. Rachel weaves herself into the lives of Phillip making herself indispensable to the household until Phillip finally finds himself in love with her and forgets his prior suspicions. Phillip realizes his majority at his 25th birthday and he presents Rachel with what Ambrose would have willed to her if he had lived long enough to sign a new will. At that point everything changes between Rachel and Phillip and ………Well I’m not going to tell you, read it for yourself. This was a fabulous read that had me gripped from the very first page and kept me guessing until the very end (actually she still keeps you guessing but you have to read it for yourself to find out why). There’s a good reason Du Maurier is considered the master of romantic suspense. Highly highly recommended. 5/5 stars."}, {"userName": "Dem", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/2752994-dem", "userReview": "3.5 Stars Having loved Rebecca I wanted to read another novel by Daphne Du Maurier and My Cousin Rachel was next on my list and delighted to say that it doesn't disappoint and has a certain , je ne sais quoi about it that had me intrigued.Written in 1951 this novel is a mystey-romance style novel that is as compelling today as it was back 65 years ago.Anbrose and Philip run a country estate on the Cornish coast and live a harmonious bachelor lifestyle in an all male household. Ambrose develops a few health problems which force him so spend his winters in a warmer climate where he meets and falls in love with \"his cousin Rachel\" but is Rachel the beautiful delicate angel we are presented with or is there more to Rachel than meets the eye.There is lots of tension in this Gothic style novel and the mystery surrounding Rachel unravels slowly. The writing is vivid and characters well drawn. I loved the fact that du Maurier allows the reader to interact in the story to as you have to read this one carefully and on completing a lot is left up to the readers interpretation.An enjoyable read and I am looking forward to my next novel by Daphne du Maurier."}, {"userName": "Kim", "userReviewDate": "Nov 15, 2011", "userURL": "http://www.goodreads.com/user/show/4542979-kim", "userReview": "To think that just a few short months ago, I was under the impression that Daphne du Maurier only wrote one novel worth reading, the splendid Rebecca. I could not have been more wrong. My Cousin Rachel is a wonderful read. A psychological thriller, the novel is set in 19th Century Cornwall and in Florence. The narrator, Philip Ashley, falls in love with – or rather, becomes obsessed with - his cousin’s widow, Rachel, who may or may not be a murderess. The development and consequences of Philip’s obsession are at the heart of the novel. There is so much to admire about this work. Firstly, there is the beautiful descriptive language in which Maurier evokes the natural beauty of Cornwall and the drama of Florence. Secondly, there is the superb use of a male first person narrator, who reveals things to the reader of which he is himself unaware. Thirdly, there is the fascinating ambiguity of the characters and the narrative. While Rachel’s character and actions are open to question and interpretation, so is Philip’s reliability as a narrator. Overall, this is a gem of novel. It is easy to read and hard to put down, a totally engaging page-turner which gives readers plenty to ponder at the end. Contemporary thriller writers could learn a thing or two from Daphne du Maurier. Another enjoyable buddy read with my friend Jemidar."}, {"userName": "Phrynne", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "My first reading of this book and unfortunately I did not like it as much as I like Jamaica Inn and Rebecca. I found it to be much too long drawn out and I was never able to become attached to either Philip or Rachel. Consequently I was indifferent to the eventual outcome, not being worried about what happened to either of them.I was intrigued by the ending though. It is left totally to the reader to decide whether Rachel did it or not, an unusual way of concluding a book! Obviously the book is well written. This is Daphne du Maurier after all. I did enjoy reading it but to me she has written better novels:)"}, {"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Jan 25, 2011", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "There is a mystery at the heart of this story, but it's mostly about unrequited puppy love in the extreme. I spent almost the entire book thinking don't do it, Philip, don't do it!, but he's a lovesick fool, and hardheaded to boot. I felt so sorry for Louise Kendall throughout the story. She's such a dear girl and loyal friend, and too decent to butt in when she ought to. I don't really know how to feel about Rachel. If I had a younger man gaga over me like that, I can't say I wouldn't take advantage of it in some way, although I'd be a lot more honest and open. Dame Daphne is the tease of all teases, stringing you along throughout an entire book thinking things are one way, then zapping you at the end with a big twist that places the entire story in a new light. She does the same thing in Rebecca, which I think is the better of the two books because it has a more sinister edge. If you care to delve a little deeper, you'll see that both stories are also about lack of communication and the assumptions made simply because people fail to ask the right questions or speak forthrightly. I know this isn't much of a review with regard to plot or characters, but I'm hesitant to review du Maurier for fear of giving something away that will steal something from another reader's enjoyment. Every little detail I discovered along the way was something I was glad no one had shared with me ahead of time. If you love old-fashioned storytelling and you're a reasonably patient reader, you'll enjoy My Cousin Rachel for all the lovely little details and skillful mind manipulation."}, {"userName": "Natalie Richards", "userReviewDate": "Jun 20, 2017", "userURL": "http://www.goodreads.com/user/show/11247707-natalie-richards", "userReview": "I finally finished! Life just kept getting in the way of my precious reading time. This book is sheer perfection from the gorgeous writing to the slow, almost unbearable building of tension. I`m left with questions and unusually for me, as someone who likes all the ends tied up, I really don`t mind! I loved it."}, {"userName": "Enchantress  debbicat ☮", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/12436728-enchantress-debbicat", "userReview": "Incredibly good! Full review to follow. Going on my top 10 list today. Wow!!!My Review: (May 30, 2017)This is now my favorite Daphne book so far. It does come quite close to Rebecca, which was my fave DM. book until this one. Like Rebecca, it is a mystery-romance and first published in 1951. I read this as a buddy read and enjoyed the discussion, which likely enhanced my reading pleasure. I can hardly wait to see the movie June 9, 2017. A little wiki note I found interesting is that the story has it's origins in a portrait of Rachel Carew at Anthony House in Cornwall, which du Maurier saw and took inspiration. Philip Ashley is the narrator of the novel. He is a young and sheltered young man of 24. He is orphaned at age 7 and raised by his uncle Ambrose on the Coast of Cornwall. The setting is primarily on a large estate owned by Ambrose in Cornwall. Philip looks up to and greatly admires his uncle. They are quite close. Philip has one female friend, Louise. Other than that he has not really been around women and is a novice in their ways. Ambrose has to travel due to health reasons and writes home that not only has he met a distant cousin of theirs in Florence, but, he actually has married her and has no plans to return to the estate in Cornwall. Philip is none too happy to hear of this news and is restless and discontent. He is jealous of Ambrose's new wife and suspects something is not right. We begin to wonder that too. Philip gets other correspondence that causes him to believe that Rachel is actually plotting against Ambrose. Then, Ambrose dies! Philip believes Rachel has murdered him. Rachel goes to visit her dead husband's estate and Philip. She is so beautiful, charming and kind....and as much as Philip wants to hate her and distrust her..even seek revenge against her ..he finds himself becoming quite infatuated with her, falling under her spell. She is all he thinks about and while there is a significant age gap, he becomes smitten with her. I don't really want to give away anymore of the plot. Most know it...but, if not I wouldn't want to ruin it. I did go into it knowing the ending because I had seen an old black and white 1952 movie version of the book by Henry Koster. I truly enjoyed the way the novel played out. The suspense, the nail biting, the slow burn, the insanity at times, the cat and mouse game, the mysterious charm of Rachel. Did she do it???? I listened to the audio book and the actor who narrated it was superb. I highly recommend the audio version. I do own an old used bookstore copy..which I may read some day. It's suspense at it's best. I loved everything about it. The ending is super clever and we had a great discussion about it. I wish I could say more...but, I'd better hold off. If you have not read this, you are in for a treat. It is Daphne at her best. And I have not read a better gothic. This book is pure pleasure to me. I think Rachel Weisz is going to be amazing as Rachel in the upcoming movie."}, {"userName": "Sarah", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/18894476-sarah", "userReview": "I read Daphne Du Maurier's book \"Rebecca\" and fell in love with it. I read online that \"My Cousin Rachel\" had a similar feel as \"Rebecca\". So I decided this was the one to buy. I didn't think it would live up to Rebecca, but I was mistaken. It has the same dark, mysterious atmosphere to it, the same kind of wonderfully developed characters and a great storyline that captivated me from beginning to end. I read somewhere that the Kindle version which I read, was shorter than the original version. I haven't checked that out totally, but now I think I might have to reread at a later date. Not a problem.This emotional novel should most definitely be put in the category of one the greatest classics of all time. It displays the strength of love as a Englishman, Philip, will do anything to get love in return from an Italian woman, Rachel. The reader becomes deep into the story as the plot thickens as a result of the the book's realistic theme. The reader is desperately trying to discover the truth about Rachel until the end when a shocking event occurs. I did enjoy My Cousin Rachel, however, Rebecca is still my favorite of the two. The thing about this book is that once you read it, you will have more questions than when you started!! Is Rachel the sweet, innocent angel she seems to be? Flirty, but naive? Or is she a calculating, evil temptress, who only uses men for her personal gain? And what about Philip? Is he driven mad by jealousy and obsession? Or is there something else at work? The ending is anything but straightforward, and the reader is left to his own to answer these questions. The mystery surrounding Rachel unravels slowly, but in such a way as to keep you on the edge of your seat. This novel is a mix between mystery novel, dark Gothic and gender war, which were woven with clear description and provoking dialogue. Full with paradox and irony but not too full blown. Each character was well drawn: background, personality, way of life (vivid description of Cornwell), and mystery. The ending is superb. I love this authors writings, and the older classics. A lot more than I thought I would. I highly recommend"}, {"userName": "Teresa", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/541416-teresa", "userReview": "3.5Rebecca is on a booklist that my real-life reading buddy and I are using as inspiration. I felt no desire to reread Rebecca, so we decided on this because I’ve been seeing it ‘everywhere’. I didn’t realize ‘everyone’ has been reading it because of a new film version. The novel is ripe for filmic interpretation—and not only because Du Maurier writes cinematically, with rich descriptions of lights, shadows and close-ups. I haven’t seen any of the movies based on the book, yet I can imagine the film versions too are ripe for (re)interpretation.The story holds much ambiguity, even as to the time period, though judging by external clues, it’s certainly the 19th century; but when exactly is unknown. This ambiguity likely reflects anxieties about women in the time period Du Maurier was writing in (it was first published in 1951). Everything is seen through the eyes of the young male narrator. He is inexperienced, immature and unseeing, as he himself attests to a couple of times. His moral touchstone is his godfather’s daughter, a childhood friend he ignores when her common sense and perspicacity aren’t convenient. He is no match for the older Rachel, who has her own agenda and an allure that is foreign to the experience of anyone in this English village. Despite some repetition, the pacing of the novel is exquisite, enough to make you forget some implausibilities. It’s a breezy read with a serious subtext."}, {"userName": "Daniel Balici", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/45736197-daniel-balici", "userReview": "My Cousin Rachel is the third novel written by Daphne du Maurier which I chose to read following my experiences of reading Jamaica Inn and Rebecca about three years ago. One thing I truly appreciate about this author is her outstanding ability to combine romance with mystery in a beautifully written literary work. In My Cousin Rachel the mystery derives from the complicated eponymous female character Du Maurier masterfully crafted. It lingers from beginning to end. I have constantly doubted Rachel's intentions and wondered whether her signs of attachment towards Philip were genuine, whether she had intentionally caused Ambrose's death, whether her alleged desire for wealth took precedence over everything else. This classic book is a marvelous read because it leaves you with many unanswered questions, even though the ending might appear more conclusive than the great open ending of Rebecca."}, {"userName": "Bam", "userReviewDate": "Mar 25, 2016", "userURL": "http://www.goodreads.com/user/show/5922426-bam", "userReview": "\"There are some women, good women very possibly, who through no fault of their own impel disaster. Whatever they touch somehow turns to tragedy.\" Rachel, it seems, is one of those women.Set in England in the early nineteenth century, My Cousin Rachel is a master work of gothic romantic mystery. Young Philip Ashley has been raised by his cousin Ambrose since infancy. Their household is entirely free of female influence--not even a cook or maid is there to intrude on their days of peaceful manly pursuits. The house, they are told, smells like a kennel and nothing has been changed or improved for many a year. As he grows older, Ambrose is warned by his doctor to seek a warmer clime for the winter months for health reasons. He leaves the running of the estate in Philip's hands. One year he chooses to go to Florence, Italy, where he happens to meet a beautiful young widow named Rachel, who it seems is a distant cousin. To everyone's shock, he marries her, and more shocking yet, is dead not many months later. Before his death, Ambrose sent some cryptic letters to Philip that seem to suggest Rachel may have been poisoning him. Is this the truth or merely the ravings of a man dying from a brain tumor? Philip at first is prepared to hate her and seek revenge. But when she arrives in England, she is beautiful and charming and he is soon totally infatuated. When he himself falls deathly ill, he becomes suspicious. She couldn't possibly be so evil, could she? Because Philip is so naive and utterly clueless about women, he can be so irritating at times! But the sudden twist at the end makes the reader realize that Philip has been an unreliable narrator all along. And yes I, as a cynical mature adult, fell for it completely. Daphne du Maurier has been one of my favorite authors since reading Rebecca as a teen and I'm amazed it took me so many years to read this novel. I've also read her books The Birds, made famous by Alfred Hitchcock, and The House on the Strand--both very good. Now it seems I'm off on a new kick: I have started a biography of du Maurier, Manderley Forever, and plan to read Jamaica Inn very soon."}, {"userName": "Duane", "userReviewDate": "Apr 01, 2014", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "My like for this novel was muted because of my dislike for Philip Ashley, the young protagonist. He was an immature 24 year old with a perceived arrogance, a sense of entitlement, and a jealous streak to top it off. Granted, his isolated upbringing contributed to this, but still it was a little tiring after 350 pages.Rachel, the novel's namesake and the center of attention for young Philip, has her share of faults as well which helped drive Philip to distraction. The famous movie line, \"What we have here is a failure to communicate\", fits this pair perfectly.After all this negativity I guess you think I hated this novel. Well, not so. Du Maurier developed her characters perfectly to fit this mysterious story of misguided love, misunderstood intentions, and kept the reader in doubt, if not suspense, until the end. And speaking of the end, I'm still not sure about what happened and what it meant.Even though I gave Rachel and Rebecca both 4 stars, I think I liked Rebecca a little more."}, {"userName": "Jennifer", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "My Cousin Rachel is a mystery/psychological thriller novel written in 1951 by Daphne du Maurier. It's dark, mysterious, suspenseful, psychological, snarky, funny, and will likely leave you with lingering confliction about what all has transpired. This is not a who-done-it per se, but rather a story about whether there was a crime committed in the first place. This character-driven plot has plenty of reason for suspicion, along with an ending that left me jaw-dropped, but outside of the entertainment factor, I believe the writing has layers of meaning and purpose as well. Although this book has been recently adapted to film (for the second time), I had to remind myself that it was written close to 70 years ago, in which a story about a woman such as Rachel was likely a risk. Not because of her perceived character, but because she was developed as a woman capable of setting into motion a chain of events that allowed her considerable and individual wealth (thus power), and she functioned impulsively and independent of men without known consequences. Her character's confidence allowed her the use of perceived witchcraft and her sexuality (gasp) in a time when this was not acceptable...and when I speak of Rachel, I'm actually speaking of Daphne du Maurier who wrote Rachel (the feminist, innocent or murderous as she may be) into existence. Again, I am reminded of the brave and genius fiction writers of times past and am excited to add another posthumously to my must-read list. Just because it's not a new release or on the New York Times best seller list doesn't mean it's not incredibly worthy to be recognized again and again, hopefully for another 70 plus years.My favorite quote:\"I could not believe it possible that a girl I knew and trusted could have so damnable a mind, and speak—that was the greatest hell—with so much logic and plain common sense to tear apart another woman like herself.\""}, {"userName": "Katie Lumsden", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/8190907-katie-lumsden", "userReview": "A really brilliant book - I loved the atmosphere and the physiological complexities of the characters, and it was intensely gripping throughout."}, {"userName": "Maria Espadinha", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/20749430-maria-espadinha", "userReview": "A Minha Prima GiocondaEm Daphne du Maurier, é notória alguma  predilecção pelo jogo das aparências.Já tivémos ocasião de o observar, brilhantemente urdido, em Rebecca, e eis que a façanha se repete nesta \"Prima Raquel\":Há uma morte que parece homicídio, mas terá sido?...E Rachel?Quem será esta mulher carismática?Uma calculista caçadora de fortunas que não olha a meios para concretizar  fins?!Ou uma mulher mundana, cujo maior pecado é uma irreverente paixão pela vida?....Daphne du Maurier escreve uma história, susceptível de ser reescrita por quem a lê!A ambiguidade impera nestas páginas, erguendo um vidro manchado entre nós e a narrativa.E o trabalho de limpeza é nosso, se é transparência que almejamos!...A verdade não nos é servida a pronto numa bandeja.Não!...Na bandeja só encontramos ingredientes, e a verdade seremos nós a confeccioná-la!... ;)Existem pistas disseminadas ao longo do texto, a partir das quais será possível intuir uma verdade.Porém, uma análise meramente racional carece de provas concludentes.Eu confesso que optei pelo trilho da intuição, pois tinha forçosamente, que dar com a verdade! ;)Todavia, não sei se o veredicto alcançado, sobreviverá a uma ulterior releitura (este é daqueles livros, que será de todo impossível não reler)!...- E tu, Raquel querida?!...- Que contas?- Afundas-te com o fardo da culpa, ou flutuas com a leveza da inocência?!...- (Silêncio Prolongado)- Bem!... Forças-nos a desistir, então!...- Esperem!... Esperem!...- Os lábios parecem estar a mover-se! :)- Oh, não!... - Por favor!...- Esse sorriso é que não!...Retratada, \"A Minha Prima Rachel\", daria uma excelente sósia da Gioconda ;)"}, {"userName": "Nastassja", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/7734134-nastassja", "userReview": "Actual rating: 3.5 starsHow soft and gentle her name sounds when I whisper it. It lingers on the tongue, insidious and slow, almost like poison, which is apt indeed. It passes from the tongue to the parched lips, and from the lips back to the heart. And the heart controls the body, and the mind also. Shall I be free of it one day? In forty, in fifty years? Or will some lingering trace of matter in the brain stay pallid and diseased? Some minuscule cell in the bloodstream fail to race with its fellows to the fountain heart? Perhaps, when all is said and done, I shall have no wish to be free. As yet, I cannot tell.My Cousin Rachel is my first Daphne du Maurier novel I decided to read in preparation for this year's movie adaptation starring stunning Rachel Weisz and charming Sam Claflin.From the first sight, My Cousin Rachel looks like a very clever psychological thriller. Philip Ashley - our MC and narrator of the story - is raised by his beloved cousin Ambrose who is Philip's moral model in everything. But their idyllic life is interrupted when Ambrose abruptly marries his distant cousin Rachel from Italy. Some months later Philip starts to get letters in which Ambrose accuses his new wife of trying to poison him, and soon he dies. Philip is wrecked by suspicion: was it the tumor in Ambrose's brain that killed him or was it his cousin Rachel, and Ambrose was right to suspect her? The thing with this book is that from chapter one we already know how the story ends. The ending does not matter here: the journey does. The author plays with readers cat and mouth game, never really answering the worrisome question: was Rachel actually the femme fatale or was she the victim of false accusations? We are given both versions and free to decide the answer for ourselves. I must admit I am still undecided with the answer. From one side, Philip who adored his cousin and was overcome with jealousy after his marriage and later obsessed with Rachel, does not seem to be a reliable narrator, but, at the same time, we have enough clues to presume Rachel was the black widow who dispensed of men, when they no longer held any value to her. As we are looking at Rachel through Philip's eyes, we are never given her authentic portrait, only the image the hero has of her, and this one, again, is quite obscure, mixed with obsession and madness that consequentially lead to tragedy. Daphne du Maurier is very smart with words and her every description of characters and their motives is forked: you can see whatever you see, but the truth is always elusive.But from the other side, My cousin Rachel is a very feminist novel. Again, the author likes to play coy with her readers. In this seemingly male world of Ambrose with his chauvinistic and misogynistic beliefs he bestowed upon Philip while raising him to be his mirror image; they even look alike. From early years Philip was mostly surrounded by men, with no female servants in the house, and his cousin's low opinion of women and hardened bachelor view on life had shaped Philip's perception of women as well: he, at first, sees Rachel as witch who enchanted and then poisoned his cousin. After he himself falls in love with her, Philip's feelings are borderline obsessive. He seeks to control Rachel through physical power and money, the same way Ambrose was controlling her. It doesn't cross Philip's mind that even if she was the culprit, it might've been her way of defending herself from men. And in both cases Rachel's independent, whimsical at times, character does not yeld to any men, no matter how hard they try to own her, she always seems a little distant and cold. Maybe, because Rachel is beautiful and free spirited she was doomed to endure and suffer in life, or, maybe, because of these qualities she was the femme fatale who controlled and dispensed of men the same way they were trying to use her. Again, we'll never know who Rachel was, we can only choose a side we prefer more.Question: if you read the book, did you think Rachel was guilty or was she merely a victim? Daphne du Maurier's writing is exquisite like dark chocolate melting on your tongue and leaving a bittersweet aftertaste. How very atmospheric and dark her words and lines are, from page one they make you shiver with anticipation and dread of upcoming tragedy you know is unavoidable. Daphne du Maurier is a queen of suspense! All in all, My Cousin Rachel is a complex and multilayered novel. When you think you have your answers, there's a new layer with a new perspective. It's a story of loyalty and passion and human nature, sprinkled with exquisite language and bittersweet aftertaste. Highly recommended!"}], "description": "From the bestselling author of Rebecca, another classic set in beautiful and mysterious Cornwall.I threw the piece of paper on the fire. She saw it burn ...Orphaned at an early age, Philip Ashley is raised by his benevolent older cousin, Ambrose. Resolutely single, Ambrose delights in Philip as his heir, a man who will love his grand home as much as he does himself. But the cosy world the two construct is shattered when Ambrose sets off on a trip to Florence. There he falls in love and marries - and there he dies suddenly. In almost no time at all, the new widow - Philip's cousin Rachel - turns up in England. Despite himself, Philip is drawn to this beautiful, sophisticated, mysterious woman like a moth to the flame. And yet ...might she have had a hand in Ambrose's death?", "title": "My Cousin Rachel", "url": "http://www.goodreads.com/book/show/5604250-my-cousin-rachel", "average": 3.94, "cover": "https://images.gr-assets.com/books/1348634336l/5604250.jpg", "reviews": 2962, "authors": [{"url": "https://www.goodreads.com/author/show/2001717.Daphne_du_Maurier", "name": "Daphne du Maurier"}], "type": ["Classics", "Mystery", "Historical", "Romance", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/5604250-my-cousin-rachel", "http://www.goodreads.com/book/show/50239.My_Cousin_Rachel", "http://www.goodreads.com/book/show/19520435-my-cousin-rachel", "http://www.goodreads.com/book/show/18869970-my-cousin-rachel", "http://www.goodreads.com/book/show/11300065-my-cousin-rachel", "http://www.goodreads.com/book/show/30130805-my-cousin-rachel", "http://www.goodreads.com/book/show/23126018-mi-prima-rachel", "http://www.goodreads.com/book/show/27108770-my-cousin-rachel", "http://www.goodreads.com/book/show/162543.My_Cousin_Rachel", "http://www.goodreads.com/book/show/19007510-my-cousin-rachel", "http://www.goodreads.com/book/show/34431455-my-cousin-rachel", "http://www.goodreads.com/book/show/36284709-a-minha-prima-rachel", "http://www.goodreads.com/book/show/17899948-rebecca", "http://www.goodreads.com/book/show/18869967-jamaica-inn", "http://www.goodreads.com/book/show/84573.Frenchman_s_Creek", "http://www.goodreads.com/book/show/18869972-the-house-on-the-strand", "http://www.goodreads.com/book/show/18869985-the-birds-and-other-stories", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}