{"ratings": 619, "userreviews": [{"userName": "La La", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/17265997-la-la", "userReview": "First and foremost this story, the way it is written, will not hold the interest of a Middle Grade reader. There was too much extraneous matter and redundancy of thoughts in the MC's head that just wanted to make me scream, OKAY I GOT THAT ALREADY! Plus there were inconsistencies like the baby being almost two years old and two days later it says he is almost four years old. The MC uses the names of items she would not know like flip-flops and sequins. She has vivid memories of adult conversations she heard when she was two years old? Understanding adult vocabulary and situations? Also the bouncing back and forth between the current time and environment to the past, which at times I don't think was chronological, was confusing for me, even as an adult reader. At about the 60% mark the situations needed to bring the story to conclusion became ridiculous. I was approved for an eARC, via Edelweiss, in return for an honest review."}, {"userName": "Wendi Lee", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/30649545-wendi-lee", "userReview": "4.5 starsZylynn was born into a cult. All she knows is Father Prophet, his teachings about Mother God, and the strict rules of her compounds. She endures periods of starvation and\"pinging\" (standing against a fence while the other kids throw rocks at her backs and legs) for the glorious day she turns 13. A week from her 13th birthday, Zylynn is taken away from the cult by a man who calls himself her father. She moves in with his wife and three kids, and is overwhelmed by the soft bed, the colorful clothes, and the refrigerator brimming with food. No one here is going to throw rocks at her for eating, or for asking questions. But will she be able to overcome what she's experienced?This is a middle grade book, and a brave one at that. Caela Carter writes about Zylynn and her cult with gentleness and honesty. It would easy to turn Zylynn into a caricature, but she's nuanced and three-dimensional. And her new family is so refreshingly solid. Her stepmother is a rock immediately, and while it takes a while for her to warm up to her father, he's also a good, albeit flawed man. Even if you're not a fan of MG books, I recommend you read this book."}, {"userName": "Katie", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/1710785-katie", "userReview": "[therapy and the possibility that it'll be a lifelong thing (hide spoiler)]"}, {"userName": "Mehsi", "userReviewDate": "Mar 22, 2016", "userURL": "http://www.goodreads.com/user/show/6720768-mehsi", "userReview": "When I heard about this book, and saw what it was about, I just knew I would read it. I have been interested in reading about cults, especially from the inside, or at least for the perspective of a character that is in one, or just got out one. The character from this book, named Zylynn, has been in a cult since she was born. So you can imagine that when, at age 12 almost 13, she is suddenly put outside of it, and dumped in the hands of her father, she is totally terrified, and fears that she will be in the darkness forever. That she won't have a chance at light, love, and God. That alone broke my heart. And as the book continues and we find out more and more about Zylynn, about the cult, about what happened there, my heart broke further. Poor Zylynn, poor people in there. Manipulated, and much much more. :( The book is written between the now and the then. We see Zylynn struggle with her new life, trying to escape so she can be at the ritual that will determine her future with the cult. She doesn't dare to speak, for fear for letting in the darkness. She stores food, she is wary of anyone not from her cult, she is even afraid of the food, thinking it will just be removed before she knows it, or that there is not enough in the end (seriously, that just pained me so much, to see such a small child be wary of food, wondering when it will leave, scrounging and keeping it hidden). And then there is the then. We learn about the cult, about days of hunger, about suspicious stuff happening, about the doctrine that is being stomped into the minds of the children, of the adults. We see rituals happen, we see happiness, and sadness. It took me a bit to get used to the format, it was clearly marked when we were going into the past, but it still was a bit jarring. I was just getting warmed up to the now, and then we would be brought to the past.As the book continues you can see a change in Zylynn, not a big one, she is still highly keen on escaping/running away, but you can see that she is more accepting of her circumstances, that she is becoming more happy. My heart broke for her though when she found out several things, and also near the end. Gosh, I cried. :(In the past you can also see a change. It becomes more and more clear that this cult is wrong, bad, not right. Sure, you could also see that from the get-go, but I feel that as the book progresses you see more wrongness seeping out.I loved the father, and I loved his wife (stepmother for Zylynn). They were so supportive, they tried so hard, they fought for Zylynn, and I was just cheering for them. They truly are amazing people. Their kids (and thus halfsiblings for Zylynn) were sweet and I loved how they accepted Zylynn, sure they were wary, but they did try to involve her with things. Especially the little girl.I also loved that other girl, a friend of Zylynn, she was really sweet and I loved her attitude. How even in the cult she never lost hope, and never stopped trying to do her own thing. The ending was sad, one filled with twists and turns (especially for Zylynn), but also one with hope for a good future. And I cried during several parts (not only sad tears, but also happy tears).This book will break your heart, this book will bring you to tears. This book is amazing, and I would highly recommend it to everyone.Review first posted at http://twirlingbookprincess.com/"}, {"userName": "Jenni Frencham", "userReviewDate": "Apr 08, 2016", "userURL": "http://www.goodreads.com/user/show/6906412-jenni-frencham", "userReview": "Carter, Caela. My Life with the Liars. Harper Collins, 2016.Zylynn has always lived with the Children Inside the Light. She's eagerly anticipating her 13th birthday, less than two weeks away, when she is taken Outside and forced to live with her father and stepmother. She knows she can't trust a word they say - she's been told they are Liars - and she is determined to return to the compound before her very important 13th birthday, when she will go through the Ceremony and become an adult. But her father and stepmother's kindness is wearing down her walls. They let her eat as much as she wants and she gets to wear colors and have her own possessions. Will she be strong enough to return to the Light, or will she miss her Ceremony and live in Darkness forever?I love stories, real or imagined, about people who escape strict religious cults. This particular book is aimed more at a middle grade audience, and our protagonist is much younger than the typical 16-year old escapee from other books. She's confused because she only knows what she's been taught in the cult, so she does things like sleep with the lights on, hoard extra food under her bed, and refer to her parents by their first names. She doesn't know about wearing clothes with colors, or what an iPad is, or what it feels like to ride in a car. She tries desperately to return to the compound, to the things she finds familiar, but there's a pull in the novelty of things like strawberries, a room of one's one, and love. I love that this story is told from Zylynn's point of view. We see her confusion and struggle over living in this strange, new world. We see her desperation to return to the compound, and the love and patience of her family. When Zylynn hoards food, her stepmother puts it in containers for her, but leaves it under the bed where she had it, even though it is rotting. No one turns off her light at night while she sleeps because she is used to sleeping under bright lights. I read this book in one sitting, which is something I very rarely do. Recommended.Recommended for: middle grade, teens, fans of religious cult storiesRed Flags: kids in the cult are neglected and starved, they are punished with what I'll have to call \"mild stoning\" [yes, with rocks, but little ones],Overall Rating: 5/5 starsRead-Alikes: The Giver, Watch the Sky, Devoted, The Sacred Lies of Minnow Bly, A Good Courage"}, {"userName": "Amy", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/2487858-amy", "userReview": "My 5-star rating is less for literary merit and more because it's hard to find a book that scratches that simple, short, fast-paced and yet creeptacular itch for upper middle grade literature. Think of MY LIFE WITH THE LIARS as a cross between immersive world-building dystopian books like The Giver and The City of Ember and the story of somebody adjusting to a new family like in One for the Murphys.Zylynn has grown up in a religious cult on a collective compound As the story begins, through some confusion that isn't fully revealed to the reader until the end, she is transplanted to the outside world with a strange family.Zylynn has been taught to believe that the outside world is filled with lies and Darkness, but slowly Zylynn begins to question exactly how Dark this outside world is, given that her host family has been able to feed her three meals a day and gives hugs to each other.Through flashback, it is revealed how abusive this religious cult is... we're talking starvation, stonings, and forced tranquilizers, as a start. Despite these flashbacks and the comforts of the outside world, Zylynn is determined to make it back to the compound so that she doesn't miss her all-important Ceremony for her thirteenth birthday.Adult readers won't find many plot surprises in this book, but younger readers may be amazed at some of the truths revealed along the way. Developing readers might have a hard time parsing the flashback scenes and understanding some of the conventions of the cult that aren't spelled out explicitly. Highly recommended for late sixth grade and above."}, {"userName": "Tamara", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/1126715-tamara", "userReview": "Never dreamed of reading a kid's book about a religious cult...and I really liked it. The author did a great job of keeping up the intensity and suspense. Sad due to all the lies she's been told. And even sadder all the trust issues Zylynn experiences because of the lies. Super sweet story of love, lies and truth."}, {"userName": "Andrea", "userReviewDate": "Sep 17, 2015", "userURL": "http://www.goodreads.com/user/show/4844200-andrea", "userReview": "This review was originally posted on my book review blog, The Overstuffed Bookcase.My Life With the Liars was like a breath of fresh air. I had just read a few books that I really didn't love, but within the first few pages, I could tell My Life With the Liars was going to be different. Immediately I was captivated. This voice was unique, different not only because it's a Middle Grade novel but also because of the subject matter and just because of this compelling character of Zylynn.I'm not religious myself, but I'm so drawn towards books about cults and I think this book tackles that subject in such a unique and poignant way. Because this is told from the point of view of Zylynn, who has grown up within the cult and is now being taken out of the cult, we get to see her eyes open as she experiences the world in a way that sheds light on what we all take for granted. There are also flashbacks to her time in the cult, for readers like me who really want to see that aspect.I also really loved the fact that in so many movies, I've seen scenes where adults are trying to communicate with a child who has been hurt or abused in some way, and the child often won't speak or behaves in what seems like an erratic way. And when this happens, we usually see the adults' points of view: their exasperation, their passion for helping the child, their perseverance to get through to the child in some way, or their cry of defeat when they feel like their efforts are fruitless. Yet in My Life With the Liars, we see these scenes from Zylynn's point of view. We know why she hesitates when people try to communicate with her. We understand why she is extremely wary of the things she is given, and why she hoards food and is so protective of her belongings. We see the exasperation and the confusion in the faces of the adults around her, but we get her point of view, and it becomes more about her, and her troubles, and not about the adults and their efforts. I can't really explain how much I LOVED this aspect of My Life With the Liars.My Life With the Liars was an extremely compelling, quick moving story that kept me up reading for hours. I'm a super slow reader and I read it in one day. I'm also not a big crier and yet it turned on the waterworks. It was full of these interesting moral dilemmas and fascinating characters. So, in case you haven't figured it out yet, let me tell you my rating for My Life With the Liars by Caela Carter: 5 huge stars. I'll definitely have to check out some of Caela Carter's other books.Disclaimer: I received a copy of this book from the publisher, via Edelweiss, in exchange for my honest review. I was not compensated in any other way for this review."}, {"userName": "Scott Fillner", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/52395337-scott-fillner", "userReview": "This book had me mesmerized and curious from the beginning. I caught myself on numerous occasions starting questions to myself like ..what just, how did, what is, why aren't they...???? It was maddeningly (not sure that is a word but anyway) frustrating and exciting at the same time. Then I came to the realization that Caela Carter had done it! She had immersed my in such a unique story and had my curiosity in overdrive.This book will generate SO many discussions and questions, will definitely lead readers to discover truths of their own. If you are an upper MG reader, than this may just very well be a book for you."}, {"userName": "Julie", "userReviewDate": "Apr 09, 2016", "userURL": "http://www.goodreads.com/user/show/2079573-julie", "userReview": "This is a book for middle-grade readers, but the first few chapters of My Life with the Liars were very confusing even for this adult (who DVR's Dateline and 48 Hours). It is a story about a girl who is rescued from a cult, but as she sees it, she has been kidnapped and exposed to a dangerous outside world. The author does a good job of writing in this young victim's voice, and the reader can (almost) see how this kind of brainwashing works. This book should be classified as a \"thriller\", IMHO. Spooky."}, {"userName": "Jessie", "userReviewDate": "May 10, 2016", "userURL": "http://www.goodreads.com/user/show/15863625-jessie", "userReview": "Very eye opening, interesting read. To understand how a cult works and sucks people in is intriguing. Zylynn was a likable protagonist that you rooted for from the beginning hoping she would realize the lies and deception coming from the Inside. Her thoughts and coping mechanisms were so sad. I'm sure the author portrayed these thoughts accurately to those that have survived an experience such as Zylynn's. This book piques my interest about cults. Hoping to find more books like this one."}, {"userName": "Jeff Raymond", "userReviewDate": "Jul 25, 2017", "userURL": "http://www.goodreads.com/user/show/32271-jeff-raymond", "userReview": "A truly heartbreaking piece of fiction about a girl stuck in a cult compound and her attempt to escape. I don't know what it is about cult books that get me, but this one is pretty well done on a whole and provides some real page-turning moments throughout. I really enjoyed this read, and I think it probably has a lot of appeal for kids and adults both."}, {"userName": "Maggie", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/1221903-maggie", "userReview": "I was captivated from the very first page and the end made me cry (which I know surprises exactly no one). SO GOOD!"}, {"userName": "Eva", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/46416856-eva", "userReview": "Obviously incredibly written but also incredibly disturbing and sortof making me feel paranoid hours after I finished it. Part of me is horrified it's shelved in the children's section even though there's nothing actually age-inappropriate."}, {"userName": "Sandy", "userReviewDate": "Sep 14, 2015", "userURL": "http://www.goodreads.com/user/show/5913149-sandy", "userReview": "“Curiosity is the greatest evil.” Citizens were given a set of rules to follow so choices would not have to be made. Reading was not an option, for reading promoted inquiry, an opportunity to expand their minds and Father Prophet Rules prohibited this. Stay within the Light and your rewards will be great. Zylynn finds herself in the Darkness with Louis and knows she has only 10 days to return to the Light. She has heard stories of this Darkness and it chills her to out alone amongst it. It becomes her mission to return to her home in the Light. She feels that the less that she speaks the more she knows Father Prophet will be pleased with her. Louis claims to be father and inside this Darkness he says, she has a mother and siblings waiting for her but Father Prophet and Mother God have already claimed those titles for her. Zylynn’s world was sheltered and closed-off inside the Light; Father Prophet controlled his flock of followers. Zylynn was told about the Darkness, how it was full of Liars and how the Light could not save them from their anguish. His followers knew that they must be inside the Light by their thirteenth birthday or they were doomed. Zylynn had ten days to find her way back to the Light before her birthday or she would forever be living in torture, forever living in terror, forever living in the Darkness with the Liars.I was hooked immediately upon reading the first chapter of this novel. It wasn’t a horrendous or gruesome novel dealing with the cult; it dealt more with mind control. Zylnn was taken to Father Prophet’s compound at small age, she knows no other life. When she enters the Darkness, she doesn’t know how to interact in her new environment. Her whole life she has been governed by rules and now she has no direction and she feels lost and alone. I found myself screaming, “Give her some rules! Give her boundaries!” as she needs to feel safe and secure. I loved while she was emerging into her new environment and learning about it, her vocabulary words from the Light came into play. Inserting them into her new world, she attempted to comprehend what was occurring. As the days go by, she begins to enjoy some of “dangers” from the Darkness and I could feel the sway in Zylynn’s tone. How can this be? All these years she was warned about the dangers and now living amongst them, she is finding some of them enjoyable and wondering if she could take some of them back with her to the Light. Zylynn thoughts turn to Jaycia, the girl who left the Light and didn’t turn before her 13th birthday, will Zylynn be like her or will she get home to the Light and be safe before her birthday? What actually happened to Jaycia, for Zylynn misses her and loved her. I thought this novel was a great read before but now as I turned the page, this novel throws Zylynn into an emotional twister. Zylynn gets the answer to her question but it’s not the answer that she wanted to hear. Sometimes though, that is how it is. I really wanted a different ending; I liked everything leading up to the conclusion but the ending itself, not so much."}, {"userName": "Kate Puleo Unger", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/23343505-kate-puleo-unger", "userReview": "My Life with the Liars is a wonderful middle grade novel. I don’t usually review middle grade books on this blog (reserving those for my other blog, Mom’s Radius), but since I read this book out of my own interest and not as a mom, I thought I’d share it here. I loved this book!Zylynn was raised in a cult. Right before her 13th birthday her father breaks her out, but Zylynn doesn’t know he’s her father. She doesn’t know much of anything about the normal world. She’s desperate to get back to the Children Inside the Light before she turns 13 and is cast out to the darkness forever.This first-person narrated book is so well written. It’s amazing to think about all of the things that Zylynn would not know being raised in a cult. I couldn’t put this book down. It was just so fascinating. I love books dealing with extreme religion, but this book is by far the best that I have read.I was a little frustrated with her father and his wife because I didn’t feel like they did a good job explaining anything to Zylynn. I can see why that was done. It would have made the book resolve too quickly if they had explained things, but as a mother it was hard to read about their poor parenting.Other than that one issue, this book was flawless. Middle grade fiction doesn’t always appeal too me, but this book wasn’t at all “dumbed down.” It’s very intelligent and insightful. It would spark great conversation with children and adults alike. I highly recommend it.http://opinionatedbooklover.com/revie..."}, {"userName": "Chelsea Couillard-Smith", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/2111938-chelsea-couillard-smith", "userReview": "An engrossing read that will have middle graders hooked from page 1. Zylynn is days away from turning 13 and the ceremony that will test whether she is worthy of Mother God's love when her biological father appears to take her into the Darkness and away from the Children of the Light. Life outside the compound is confusing with lots of choices and few rules, and all Zylynn can think about is making it back to the compound in time for her ceremony. But as days pass and her new family begins to worm their way into her heart, will Zylynn choose to stay with the Liars or return to the only home she has ever known? Zylynn's reactions to a world that she has been taught is fundamentally evil are carefully balanced to show her naivete without ignoring her age and her realistically teenage confidence in right vs. wrong. The plot moves quickly, with frequent flashbacks to her life in the compound, and Carter does a nice job of making both narrative strands engaging, parceling out details slowly to keep readers intrigued. The resolution is satisfying and empowering for Zylynn, allowing her to reach a point of understanding and a place where she can begin to ask the questions she has been suppressing for so long. That said, Carter never really delves below the surface - characters are pretty much as they appear, and larger questions about faith and the culture of consumption are never addressed with any complexity. Still, the intriguing premise should make it a good candidate for booktalks, and most young readers will enjoy the ride."}, {"userName": "Tracy", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/12349233-tracy", "userReview": "I loved this one. I was worried that it would be too controversial for the age group, but the other did a great job of just sticking to issues that would be of concern to middle graders, and at the same time, showing just how much Zylnn missed of everyday life by being sequestered from general society. I was riveted."}, {"userName": "Chris", "userReviewDate": "Apr 03, 2016", "userURL": "http://www.goodreads.com/user/show/2048508-chris", "userReview": "This was a WOW book for me, at the end. As an adult. I'm not sure how kids will relate to it. But I sure would like to find out!"}, {"userName": "Xander ForeverBookish", "userReviewDate": "Feb 25, 2016", "userURL": "http://www.goodreads.com/user/show/6990466-xander-foreverbookish", "userReview": "My heart. I've been thinking about this book all day."}, {"userName": "Helena Taylor", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/27088271-helena-taylor", "userReview": "Cults are fascinating to me. This book was a page turner as I read to learn more about Zylynn and the Movement."}, {"userName": "Kerrie", "userReviewDate": "Apr 28, 2016", "userURL": "http://www.goodreads.com/user/show/5082967-kerrie", "userReview": "Interesting topic that you don't see in middle grade fiction--cults. I wanted to love this book but it was too repetitive at times. I get why the repetition is there, but it wore on me after a bit."}, {"userName": "amalie", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/53697844-amalie", "userReview": "this was really interesting and I thought the characters were all really well written!"}, {"userName": "Elizabeth", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/725130-elizabeth", "userReview": "Catherine loved this and compared it to The Giver. I can see why she said that. I enjoyed reading it."}, {"userName": "Amiah Corp", "userReviewDate": "Nov 28, 2016", "userURL": "http://www.goodreads.com/user/show/47885412-amiah-corp", "userReview": "It was a really weird book, not really what I was expecting."}, {"userName": "Susan", "userReviewDate": "Jun 29, 2016", "userURL": "http://www.goodreads.com/user/show/14699083-susan", "userReview": "3.5"}, {"userName": "Kelly Thielen", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/6077470-kelly-thielen", "userReview": "Zylynn lives inside the Children Inside the Light Compound. She is just 10 days away from her 13th birthday, the day when she will become a Woman of the Light. Now she is with the Liars. A man she's never met before came and took her away from the light. He said to call him \"Dad\" or \"Louis\" if she preferred. He whisked her away in his car, taking her from Father Prophet and Mother God, as well as the only life she's never known. The lights are not always on here. It makes her nervous. She's used to being hungry, but food is plentiful here. No matter what, she knows she needs to find her way back to the compound before her 13th birthday. If she doesn't, she will never be able to come back. And yet, she really likes the feeling of having enough food, and wearing clothes in pretty colors and hearing her younger siblings laugh and play. But even with all of that, she is desperate to return home and she'll do almost anything to get back there before it's too late."}, {"userName": "Liz", "userReviewDate": "Jun 10, 2017", "userURL": "http://www.goodreads.com/user/show/971950-liz", "userReview": "Unusual subject matter for middle readers, but it was a compelling read I couldn't put down and finished in less than 24 hours. The main character, Zylynn, struggles to find her place in \"Darkness\" after her father rescues her from the Children Inside the Light cult. Just ten days from her thirteenth birthday, Zylynn must return to the cult and \"Father Prophet\" before sunset on her birthday or she will be banished to the Darkness (the outside world) forever. Even though the subject matter is rather dark, it is presented in an age appropriate way that doesn't sugarcoat the truth of what happens within a cult and the difficulties cult survivors have embracing the reality of what they've suffered. This would make for great discussion in an ELA class about beliefs, family, and what it means to belong."}, {"userName": "Charlotte", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/50429708-charlotte", "userReview": "The main character is an almost 13 year old girl named Zylynn. She was born and raised in a cult. She was brainwashed to believed she had no mother, only Mother God. No father, only the Prophet. She was starved and physically abused by having stones thrown at her legs for punishments. Punishments are as ridiculous as eating to much oatmeal. Her real mom lives in the cult to and abides by its rules. Her father does not. I really don't know much about cults, but this sounds twisted enough to pass. I'm not sure as middle school kids would read this, some parts are pretty redundant. I have to admit the middle of the book was pretty boring for me, but the end was okay."}, {"userName": "Angie", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/18005887-angie", "userReview": "Interesting view of the inside of a religious cult from the perspective of a young woman who's fully convinced she belongs there. When she's removed against her will by an outsider trying to save her from the organization's control, she feels she's being abused. The book reveals the progression of her psychological state as she slowly regains perspective and control of her life. Not perfect, but kept me engaged to find out how she ultimately fared. Helps the reader understand how different the world can look from another perspective, and how people's world views can influence their actions."}], "description": "Perfect for fans of Mockingbird and Counting by 7s, Caela Carter’s middle grade debut is a story of one girl’s strength and courage as she decides who she is and what she will believe in.Behind the white-washed walls of the compound, life was simple. Follow the rules, “live in the Light,” and all would be well. Zylynn was excited to turn thirteen and begin the work of bringing others into the light, to save them from the liars and the darkness of the outside world. But when she is taken away by a man who claims to be her father, Zylynn is confused and desperate to return to her home.Zylynn resists her new life—until she finds small comforts like shampoo, the color pink, and strawberries. But as her thirteenth birthday approaches, Zylynn must make a difficult decision—to stay with the enemy or find her way back to the light. And neither may be what it seems.", "title": "My Life with the Liars", "url": "http://www.goodreads.com/book/show/25817346-my-life-with-the-liars", "average": 4.03, "cover": "https://images.gr-assets.com/books/1435964902l/25817346.jpg", "reviews": 136, "authors": [{"url": "https://www.goodreads.com/author/show/5154098.Caela_Carter", "name": "Caela Carter"}], "type": ["Childrens", "Realistic Fiction", "Young Adult", "Contemporary", "Religion"], "outlinks": ["http://www.goodreads.com/book/show/25817346-my-life-with-the-liars", "http://www.goodreads.com/book/show/25743812-my-life-with-the-liars", "http://www.goodreads.com/book/show/25845098-my-life-with-the-liars", "http://www.goodreads.com/book/show/12439950-me-him-them-it", "http://www.goodreads.com/book/show/18594344-my-best-friend-maybe", "http://www.goodreads.com/book/show/30531524-forever-or-a-long-long-time", "http://www.goodreads.com/book/show/26795703-tumbling", "http://www.goodreads.com/book/show/38739564-one-speck-of-truth"]}