{"ratings": 23, "userreviews": [{"userName": "Christoph Fischer", "userReviewDate": "Jun 29, 2013", "userURL": "http://www.goodreads.com/user/show/13998364-christoph-fischer", "userReview": "I was lucky enough to receive an ARC copy of \"My Lost Cuba\", a great piece of fiction and historical fiction as that. It is depicting beautifully and dramatically the Batista dictatorship and the change to the new regime in the late 1950s.The book establishes a set of characters and their personal experiences of the country, its politics and economy. Mike, the young man who returns from the US to look after his fragile father, is particularly interesting as his perspective has an added outside angle, while the rest of the family all have their own perception.This is a wonderful and bitter sweet family saga - rounded up perfectly by the epilogue at the end; a insightful historical account of the times and events and a well written and moving story.Highly recommended."}, {"userName": "Nicole Rhaven", "userReviewDate": "Nov 30, 2013", "userURL": "http://www.goodreads.com/user/show/13692439-nicole-rhaven", "userReview": "I was fortunate to win this book.It was simply incredible. Learning about life in Cuba and the inner beauties it has to offer. It follows a young man who returns from America to visit his father. Who then realizes what he was missing."}, {"userName": "Sharon", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/1120957-sharon", "userReview": "What a delightful read. Learning about other cultures and people is one of my favorite things and, although this book is fiction, it's also based on part of the author's life. The people of Cuba in the 1950s were charming and interesting. Readers will learn something about sugar farming and raising cattle and show animals. Wealthy Cuban families kept household help and farm help, and their lives are intertwined with those of their employees. Before Castro, this was Cuba -- serene, family-oriented, productive, religious, and getting scarier. Some of the history of Cuba during this time comes to life as it affects real families. This family saga, set during increasingly changing times, is lovely and heartbreaking, since nearly everyone in the book had to leave their homeland once Castro came to power. Enjoy this family's years of sweetness and togetherness, their hard work, their ethics, loves, joys, sorrows, and their beloved homeland. Books like this need to be written. The author kindly included a personal note that seemed special and will remain with the book."}, {"userName": "Hopsnbarley", "userReviewDate": "Dec 01, 2013", "userURL": "http://www.goodreads.com/user/show/6319877-hopsnbarley", "userReview": "I received this book in a Goodreads giveaway. Thank you to the author for providing an opportunity to read his book. I have been to Cuba three times and absolutely love it. I was excited to read a book from this time period which would provide both history and a story. I enjoyed the read from the perspective of it being set in Cuba. Some of the references were of places I have been and that was real connection - brought things to life. And it was amazing to compare how the people lived back in the 50's compared to now. The story, for me, was not as enjoyable. It was somewhat slow and for a piece of fiction I would have liked a bit more excitement, intrigue...something to continue to grab my attention as the setting alone could not do that. For those who have travelled here or always wondered about Cuba, this book is a neat way to have a brief introduction to the country of long ago."}, {"userName": "Aileen Laughlin", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/24405441-aileen-laughlin", "userReview": "I won my copy of My Lost Cuba from Goodreads.com. It is set in Cuba during the last year of the Batista dictatorship, but while the political climate forms the backdrop to the story,it is not truly a political novel. It is rather more of a loving depiction of a nation and a culture told through the experiences of the well-off Rodriguez family, and particularly the family's son, Mike Rodgriguez. Mike returns to Cuba to take over the family ranch, leaving graduate studies in the USA. His love for the land and his family, and his relationships with workers and friends, form the core of the story. The land is as much a character in the storyline as any of the human characters. The descriptions of pre-Castro society, of a vanished way of life in Cuba, made the book highly interesting to me."}, {"userName": "Lynn", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/3027890-lynn", "userReview": "This novel didn't strike me as memorable. It begins in 1958 when Batista's reforms seem to oppress more residents in Cuba and the poor are faced with being poorer. A large wealthy plantation owning family suffer the blunt and watch little by little as revolution overtakes the country. Mike, the main protagonist, interrupts his study for an MBA in Miami to help his father Don Miguel, run the farm. I felt I should have empathized with these characters and I didn't. Their heavenly paradise was held up by many poorly paid workers who did not get their due, even in this novel."}, {"userName": "Pauline Neuwirth", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/9999387-pauline-neuwirth", "userReview": "I'm thrilled to say that I just finished reading MY LOST CUBA, a historical novel set in Cuba during the last year of Batista's reign. I have to say, I didn't want it to end! For me it was the perfect blend of family saga and political intrigue. The author did a wonderful job painting a picture of a nation in transition as experienced through the colorful characters he has crafted. If you are fascinated by this culture, as I am, you will really enjoy MY LOST CUBA"}, {"userName": "Peter Giorno", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/15429006-peter-giorno", "userReview": "I won my copy of My Lost Cuba from Goodreads.com a beautiful, emotional, well written account of life in Cuba under the Batista regime. A story of a young man, his old father, fighting with his feelings and getting caught up in the political turmoil that has over-run this island nation. Celso Gonzalez-Falla has written a wonderful story, and who better knows those times than the author himself. I highly recommend this book as a must read."}, {"userName": "Rachel", "userReviewDate": "Nov 10, 2013", "userURL": "http://www.goodreads.com/user/show/16118685-rachel", "userReview": "Such a neat story and a learning experience of what Cuba is about and how it has changed over the years."}, {"userName": "Tony Parsons", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/23831252-tony-parsons", "userReview": "having several Cuban friends I luv 2 listen 2 them & read about their former country"}, {"userName": "Xondra Day", "userReviewDate": "Dec 21, 2013", "userURL": "http://www.goodreads.com/user/show/5100591-xondra-day", "userReview": "*Copy via Goodreads First Reads*Though there is definitely a decent story there I couldn't get into it. Thanks to the author for offering the copy for review."}], "description": "Dramatic history, lush scenery, and a colorful cast transport us to the time of Cuba's turning point - the late 1950s  Set against the tropical landscape of Cuba's countryside and the glamour of 1950s Havana, this moving story of Cuban life at a pivotal time in the country's rich history will resonate with anyone who has experienced the loss of family or homeland. It is 1958, the last year of Fulgencio Batista's dictatorship. Mike, the son of Don Miguel, a wealthy land owner and rancher, is summoned home from his MBA studies in the United States because of his father's failing health. Still recovering from the loss of his wife, Mike's return is an immediate tonic for Don Miguel. Caught between his family obligations and his desire to pursue his own dreams, Mike quickly finds himself succumbing to his father's desire for him to take over the responsibilities of running the family ranch. As Mike settles back into the life he was groomed for, Don Miguel, reinvigorated, spends more and more time socializing in Havana. Changes are happening everywhere. The government is encroaching on civil liberties and social and political upheaval is in the air. There are rumblings about Castro's guerillas organizing in the mountains. On the ranch, long-time employees of Don Miguel resent the changes that Mike is making, setting the stage for a confrontation that change the lives of everyone involved. With evocative language, vibrant characters, and explosive history My Lost Cuba pull us into fascinating time and place-. It is a memorable family saga, love story and political tale.", "title": "My Lost Cuba", "url": "https://www.goodreads.com/book/show/18086453-my-lost-cuba", "average": 3.57, "cover": "https://images.gr-assets.com/books/1396830558l/18086453.jpg", "reviews": 11, "authors": [{"url": "https://www.goodreads.com/author/show/7137547.Celso_Gonzalez_Falla", "name": "Celso Gonzalez-Falla"}], "type": ["Historical", "Fiction", "Travel", "Love"], "outlinks": ["http://www.goodreads.com/book/show/18086453-my-lost-cuba", "http://www.goodreads.com/book/show/33793684-la-cuba-que-perdimos", "http://www.goodreads.com/book/show/39105811-the-beauty-of-lines"]}