{"ratings": 1491, "userreviews": [{"userName": "Christy", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "5+ stars!!! \n\n“The hardest thing is love, with no expiration date, no qualifiers, no safety net. Love that demands acceptance of all things I cannot change. Love that doesn't follow a plan.”\n\nMy Oxford Year by Julie Whelan is a real gem of a book! It took me by surprise in the best way! I’ve listened to many audio books narrated by Ms. Whelan (she is an amazing narrator) and I’m happy to report that her writing is amazing as well. I listened to this in audio, it was narrated by her of course, and if you haven’t read yet, I have to recommend you experience this book via audio. It was made to be listened to over being read, in my opinion. Ella Durran is a 24 year old American who is out of the country for the first time. She is a Rhodes Scholar who is studying in Oxford. On top of that, she has just been offered a job to work on a potential presidential candidate's campaign. Her future is promising and the world is her oyster. Her first day in England, Ella meets Jamie. Their meeting left me with a huge grin on my face. Jamie Davenport isn’t a professor, but he’s helping out by teaching a literature class. And it’s a class Ella happens to be in. These two have such a connection, they can’t seem to stay away from each other. They decide just for the time that Ella is in England, they will be together. No strings. Then, as things always seem to do, the feelings between them start to change. The problem with this is that things are even more complicated than what they seem… \n\n\"And if you’re not surprised by life, then what’s the bloody point?”\n\n\u2028Ella and Jamie. Gah! I adored them both. Jamie is charming, sweet, and swoony, and Ella is witty, intelligent, and sharp. I loved them both, and even more, I loved them together. Along with the two main characters, there were a slew of wonderful secondary characters that made the story that much more interesting. When I saw in the blurb that this book was recommended for fans of JoJo Moyes and Nicholas Sparks, I knew it was a book I had to read. It’s a smart book that’s full of humor, charm, and of course- feels. You’ll be happy to know I didn’t cry like a baby while reading this, I may have shed a few tears, but overall, I found this uplifting and heartwarming. It was a touching story, and one that will stay with me. I give this book a full 5 stars and recommend to all lovers of romance and coming of age stories. And remember- listen to the audio if you get the chance! It’s fantastic!"}, {"userName": "Astrid - ☆Vanilla & Spice Books☆ ", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/7420520-astrid---vanilla-spice-books", "userReview": "You know how our expectations are sometimes too high? Or, you expect something completely different and get something else and it's even better than what you were anticipating? It's the best feeling when a book does that. My Oxford Year surprised me, it totally blindsided me. Although I read the blurb it kind of slipped that it was compared to JoJo Moyes and Nicholas Sparks. Anyway, let me tell you about this sparkling little gem that is My Oxford Year.When Ella arrives in Oxford, jetlagged and, you know, a little freaked, the way you are when you are alone in a foreign country, her first encounters with Jamie leave her riled up, annoyed and...a tiny bit intrigued. When she finds out that he will be her professor for the term she doesn't see good things in their future. But a chance run-in on a night out in town is a complete game changer and this is where the fun starts.\n\n    And if you’re not surprised by life, then what’s the bloody point?\n  \nJamie and Ella are both highly intelligent characters. It's not just that the author says so, no, the way they talk to each other, the banter, their long conversations about poetry, Julia Whelan shows us that these are super-smart people. Their weapon of choice is a sharp tongue that can cut deep. Mostly used in humor though, I loved their witty retorts and comebacks so much and it's a testament to the author's own intelligence and wit. I want to be BFFs with Julia Whelan.Jamie has this wonderfully dry humor that so resonates with me. He is kind, brave and endearing with his little quirks and I fell head over heels in love with him. He is the kind of complicated that makes a man charismatic. He is a contradicting mix of calm and storm and his tenderness is heart-achingly sweet.  Jamie is unforgettable and will always hold a special place in my heart. Ella from Ohio is his American equivalent. There was one situation I felt my face getting red from anger because Ella acted cruelly but she came through in a big way so she had my forgiveness in the end.Their connection is made of dislike and explosive chemistry from the get-go but these are equals on the battlefield of words. The combative basis of their relationship morphs soon into respect and affection, then love.\n\n    The hardest thing is love, with no expiration date, no qualifiers, no safety net. Love that demands acceptance of all the things I cannot change. Love that doesn’t follow a plan.\n  \nThis author describes Oxford in vivid pictures, I could see Ella ride her bike through the streets of this charming town. Her description is a love declaration for Oxford.Ella's journey is one of soul searching and while you watch Jamie and Ella growing into the best people they can be this book forces you to look at your own life. It invites you to do your own soul searching to become a better version of yourself. My Oxford Year will stay with me for a long time, my heart still constricts when I think about it. Julia Whelan intersperses a ton of humor so that the sadder parts don't feel depressing. I really appreciate that - I love my angst but I don't want to be overwhelmed with it. The story ends with a message that we all should take to heart - live today, live and love like there is no tomorrow. Life isn't about goals and targets, it's about the way to them and how you get there. And that your goals can change.\n\n    I came to Oxford looking for a Once-in-a-Lifetime Experience. I chose to experience a lifetime.\n  \nWith its intelligent prose and witty banter this book will go on my top-favorites-2018 - shelf. It made me feel, laugh and think and I can't wait to discover what else Ms Whelan has in store for us readers.On a related note: I just read that Sam Heughan and Melissa Benoist have been cast as Jamie and Ella - I'm in heaven. If you want to know more about Julia Whelan and her brand of humor read this \"interview\"."}, {"userName": "Rachel Reads Ravenously", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/14514998-rachel-reads-ravenously", "userReview": "3 stars This is a book that’s been getting a lot of great buzz, a lot of my book friends really loved it and I’ve been hearing good things all around. I was a fan of Julia on the show Once and Again and I had the pleasure of meeting Julia at another author event for a book she narrated and she’s absolutely lovely. All those things combined, I was very eager to read this book and really wanted to love this book and I had high hopes. And while I didn’t love it, I enjoyed it and I think this was a really great debut from this author. There were a lot of moments when we as readers were supposed to feel a lot, and I felt a bit like a sociopath in those moments because I didn’t really feel anything and I knew I was meant to. Plus, a lot of the dialogue and some of the vocabulary was way above my head and I felt, well, unintelligent at moments while I was reading this book. I think Julia Whelan is a fantastic writer, I think she delivered a very interesting and engaging story. I also think a lot of readers will love this book and I while I didn’t love it, I will be recommending it quite a lot because I think many of my friends and close ones would really enjoy this story.Fans of Taylor Jenkins Reid, Jojo Moyes and Sally Thorne, this is your next book to pick up! A copy for review was provided by the publisher via Edelweiss Follow me on ♥ Facebook ♥ Blog ♥ Instagram ♥ Twitter ♥"}, {"userName": "Christie«SHBBblogger»", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/6650940-christie-shbbblogger", "userReview": "[HFN (hide spoiler)]"}, {"userName": "Carole (Carole's Random Life in Books)", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/5892196-carole-carole-s-random-life-in-books", "userReview": "This review can also be found at Carole's Random Life in Books.Honestly, this was fantastic! I just really loved everything about this delightful story. I know Julia Whelan from her work as a narrator so I was really curious about this book as soon as I saw it. I decided to give it a try simply because of my curiosity and didn't really know much about the book beyond my guess that it would be about someone spending a year at Oxford (nothing gets past me). This book is really so much more than that and I must say that I had such a good time reading this book.Ella is at the center of this story. Ella is from Ohio and has just made it to England to study at Oxford on a Rhodes Scholarship. To make things even better, she gets a call offering her a position to work on a presidential campaign just as she makes it to England. Things are looking up for Ella. She soon realizes that things are a little different at Oxford than she expects but she is making friends. One of her classes is being taught by the same man she had a run-in with at the fish shop on her first day in town. I do think that this a book that will really be best to go in as blindly as possible so I am going to be careful not to include any spoilers in this reviews.I really liked Ella. She is so driven to do well with everything she attempts but it quickly becomes obvious that she will have to make a few adjustments to succeed at Oxford. She was just such a strong character and I found her very easy to relate to. I really liked her more and more as the book progressed and thought that she grew dramatically as a character. Jamie was also great. He was more of a mystery to me at the start of the book but as I continued reading, I really fell in love with him. He was such a great guy and I thought he compliments Ella very well. This story made me think, it made me feel, and it even made me laugh. This book was such a joy to read. When I started reading, I thought that this was going to be one kind of story and then things changed and by the end of the book I was reading something totally different. I loved the fact that this book went in such an unexpected direction kind of like life tends to do. I would highly recommend this book to others. Julia Whelan has proven that she is not only great narrator but that she is also a wonderful writer. I am so glad that I had the opportunity to read this story and can't wait to read more of her work in the future.I received a digital review copy of this book from William Morrow Paperbacks via Edelweiss.Initial ThoughtsI loved this this. Not really sure on the final rating right now. It is either 4 or 5 stars from me but I will need to think about it a bit so I will go with 4 for now. I really didn't know a lot about this book before reading it besides the fact that it would be about someone spending a year at Oxford (nothing gets past me). It was so much more than that. It was a delight in the end. I have loved Julia Whelan's narration in the past and it looks like I enjoy her writing just as much."}, {"userName": "DJ Sakata", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/18344018-dj-sakata", "userReview": "Favorite Quotes:His voice is so melodious, so low and soothing, it should be accompanied by choral music. Everyone else looks very British about it, like this is where fun comes to die.“Given the lovely turn of your figure, it’s quite gratifying you’re not one of those dreadful American girls who subsist entirely on lawn clippings and glacier water,” Charlie says. My mouth is too full of scone to reply. He has this ability to go still, as if he’s stopped breathing. Like a vampire. Which makes me realize I’m not breathing. She also holds a fan. Like, an actual fan. Like it’s Gone With The Wind and she’s about to tap someone flirtatiously on the shoulder with it. She drips money like a leaky faucet.My Review:I adored this delightfully crisp and eloquent book; it pleased me and did so in a cleverly amusing and intellectually stimulating manner. I greatly enjoyed the thoughtful and well-chosen quotes and poems that started each chapter, which provided just a little taste of what was to come. Julia Whelan is a master wordsmith with graceful and elegant wordplay. My Oxford Year was written from the first person POV of Ella, an endearing and wholly relatable character that I instantly connected with. I quickly fell into Ella’s vortex and enjoyed hitchhiking in her head and was loath to leave her and her new friends behind. The storylines were unique, relevant, and expertly crafted. Ms. Whelan’s writing was nimble, flawless, lushly detailed, and a felt like a long awaited gift. I will most likely be stalking her listings as long as I have functioning brain cells."}, {"userName": "Jamie-leigh Haughn", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/17182207-jamie-leigh-haughn", "userReview": "Oh. My heart!! This book took me through every emotion I posses. I initially thought it was a light contemporary book, easy summer reading. Then... half way through the book we get a serious plot twist that I wasn't expecting and from that moment on it took me on a roller coaster of feelings! The characters are well developed and perfectly imperfect, I loved Ella as a main character and Jamie just gave me all of the best love interest vibes. I felt so connected to each of their lives, which isn't always an easy thing to do. Characters make or break a story for me and in this case they definitely made it. I wasn't super invested in many of the side characters and felt they were more of a filler than a benefit to the story, with the exception of Jamie's parents who I loved (Mainly his mother). If you enjoyed books like Me Before You by Jojo Moyes and Second Chance Summer by Morgan Matson, then I believe you will enjoy this book! Just be prepared for the feels!! I highly recommend this book!!"}, {"userName": "Eliza", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/15220898-eliza", "userReview": "★5 STARS★For American, Ella Durran, attending Oxford University on the prestige Rhodes Scholarship is the culmination of years of hard work and determination. The idea was born during a tumultuous period in her adolescence so she fully intends to embrace this incredible experience and opportunity of a lifetimeHer visions of her first experiences in Oxford do not include a near miss with a local and his car, but alas that’s exactly what happens. Off to a false start, she hits refresh with the heady anticipation of her first day of lectures. She soon finds herself choking in the shock when standing in for her lecturer for the next year is none other than the local from the night before. He’s just as handsome and smug as she remembers, and with a reputation to match as she finds out from her newfound friends.As an astute student the criticisms she receives from her piece of writing are hard to swallow, but more so is the way he challenges her thinking and permission she doesn’t give herself to feel. It’s an exchange that affects them both, bringing with it insight that scratches the surface of the many lessons they will teach each other.What begins as a deceptively heart-warming tale and exploration of a new city becomes heartfelt story with depth and unfettered emotion.My Year in Oxford is the wonderful debut from Julia Whelan.The love story stole the show but it has a wonderful supporting cast in the backdrop of Oxford along with the hilarious and lovable cast."}, {"userName": "Melanie", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "ARC provided by HarperCollins in exchange for an honest review.Blog | Instagram | Twitter | Tumblr | Youtube | TwitchBuddy Read with Paloma ❤"}, {"userName": "Renee", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/12732363-renee", "userReview": "*6 stars*Still gobsmacked, need to process before writing a coherent review."}, {"userName": "Kate Olson", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Thanks to the publisher for this finished copy for review purposes!Let's start with what I loved, shall we? I LOVED the Oxford setting and everything about the descriptions about Oxford life. I loved the pubs, Ella's friends, all of it. Seriously, that alone gets 5 stars from me!Now, for the hmmmmm. I wasn't blown away by the romance and while it was touching, I felt like I should have been moved MORE??? I'm not sure why and how, but I was left feeling like it was fine, a middling 3. Okay, now for the part I'm really conflicted on. Everything is saying that this book was optioned for a major motion picture, but in the afterword of the book, the author goes into detail about the ACTUAL process. As in, there was already a screenplay written by someone else, she got hired to add to it because of her own Oxford experiences, and then wrote this book based on that screenplay. So, in that sense, I'm just not sure of the originality of all of it?Bottom line: If you want a light romantic read set in England, grab this one. If you are looking for a similar heartwrencher like ME BEFORE YOU by Jojo Moyes, I wouldn't say this compares on that front."}, {"userName": "Sheyla ✎", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/4627974-sheyla", "userReview": "\"Love. That’s my choice. \"\nIf you read the blurb, then you know this is going to be a tear jerker at some point. How you might say? Jojo Moyes and Nicholas Sparks names are mentioned in it. That's enough, don't you think?Yet, I must have missed it since I wasn't prepared. \nWhat I can say about My Oxford Year without spoiling it for you? I will tell you that I loved it. Yes, at some point I was crying. It was inevitable. But, at the end of the day, I was pleasantly surprised by it.My Oxford Year has a great cast of characters, a budding romance and a BIG unknown. A perfect trifecta for this romance reader. As the novel begins, we meet our heroine Ella Durran who has recently arrived at Oxford. She's doing one year abroad studying English Lit. Just when she gets there, she receives a phone call, the next possible candidate to the presidency needs her help but Ella doesn't want to let go of her dream of Oxford. She offers to help from overseas instead. She knows that come June 11th, she'll be back in the States and hopefully as part of this candidate's new team. On the same day, still jetlagged, she meets Jamie Davenport, a \"posh brat\" who makes a terrible impression on her despite being incredibly attractive. Not soon after, she learns he will be her professor for the term. In the beginning, Ella is not sure what to do about it but once again, she wants to do the Oxford thing, just like she promised herself when she was a teenager. Jamie Davenport has a reputation with the ladies. From the gossip Ella can gather, he doesn't do long-term relationships. But, Ella is not worried, is not like she likes him, right? And even if she finds him attractive, she won't let her heart dictate her future. She lost once and that was more than enough. Life has a funny way of messing with people's lives. In spite of both, Ella and Jamie who start with not wanting anything serious will learn that love has no boundaries and can't be contained. As I said earlier, the characters in this novel were fascinating. Ella and Jamie were both smart, funny and honest. Their philosophical discussions, as well as their love for poetry, help them become closer to each other. They got one another and I was so happy for them until the twist hurt my heart. \n\"I chose to experience a lifetime.\"\nAs for the secondary characters, Ella's friends were all so cool. I wanted to be friends with them myself. They were a good support system for Ella. They took her under their wing not too long after arriving at Oxford and showed her the ropes.One last thing. My Oxford Year is going to be a movie which is great news. I won't have to wait long to see Sam as Jamie. Cliffhanger: No 5/5 FangsA complimentary copy was provided by William Morrow in exchange for an honest review.MrsLeif's Two Fangs About It | Facebook | Twitter | Instagram"}, {"userName": "Liza Wiemer", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/3152001-liza-wiemer", "userReview": "I went into this novel knowing that it would have a Jojo Moyes Me Before You feel, so I was ready to fall in love and have my heartbreak. I loved it! I loved this story. Julia took me along and I totally got into the Oxford experience from classes to walking the streets to eating fish and chips to drinking beer. I fell in love with Ella and Jamie. What a couple! Loved them from that first moment they came on the page together. I loved watching their relationship develop, and even though they tried to hold back, love trumps all!For me, this was a novel about living life to its fullest, embracing the gifts you've been given, and cherishing whatever time a person has on this earth.I'm a romantic, and this hit all the cylinders for me! Highly recommend for those who love to have their heartstrings pulled!PS. Julia Whelan is one of my absolute favorite audiobook narrators. I hope she narrates her own book, because I will listen to it! Also, I am under the impression that it will be a movie. I sure hope so!"}, {"userName": "Sandra Cortez", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/9988899-sandra-cortez", "userReview": "“He can be the boy I journeyed to the end with” swoon, I loved this one hard. *** a little forewarning *** for my fellow Americans the verbiage is very English so don’t read this on a brain fog day. Haha. Did you know valise means suitcase. But seriously it’s so good! I was not fully vested until 100 pages in but then finally, I felt. Felt so much. I’m not a crier with books but these words touched my heart. And I will cherish Ella and Jamie Davenport and the lessons they taught me. I also can’t wait for more from Julia Whalen. Highly recommend."}, {"userName": "Jessica", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/4844580-jessica", "userReview": "The moment I heard that this book was going to be made into a movie starring Sam Heughan, I HAD to read it. The story itself sounded right up my alley as well. A romance in Oxford between an American and her new professor? Yes, please! Ella Duran has always dreamed of studying at Oxford. When her dream finally comes true, she can't believe she gets to spend a year studying literature. What she doesn't expect is to get the opportunity to work for a political campaign and make the changes in America that she's worked so hard for. When she meets her infuriatingly gorgeous professor who happens to be the man who spilled all over her shirt the night before, she doesn't know how she'll survive the course. But one nights leads to a heartbreaking relationship that changes Ella's life forever. Going into this one, I had the expectations of a book that was like Me Before You, a book I absolutely LOVE. Knowing that, though, kind of spoiled my enjoyment of the novel. I was just waiting for the bomb to drop and the clues to that bomb just seemed a little too obvious. And while I absolutely loved the main character of Me Before You, Ella was not really all that likable to me. I just could not connect with her and was so confused when Jamie and her first got together. She was so drunk that she had no recollection of the night and the night was never explained. But it seemed like she knew what happened? I had to reread the section and still have no idea how their relationship even sparked into what it was. With the romance, it was hard for me to connect with that as well. Their relationship happened way too fast and it was the cliche \"no real feelings\" relationship that obviously was going to blossom into love. The pacing was just a little off to me. Ella was getting her master's at Oxford, but aside from the very beginning, we barely saw her going to class and she only referenced \"working on her thesis\" but never actually went into detail. Seeing as this book is supposed to be about a girl studying in Oxford, she didn't do any real studying...That being said, though, I definitely think this will translate really well into a movie. As a book, it wasn't really for me, but I am excited for when it hits the big screen!"}, {"userName": "Jaime Arkin", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/5293701-jaime-arkin", "userReview": "3.5 stars.... My Oxford Year wasn’t quite what I was expecting … not in a bad way. I promise that this sentence will make more sense as you read. When I looked at the cover I was expecting a fluffy coming of age romance with a bit of drama. And essentially that’s what it is, but it is also something of an emotional rollercoaster of a read. Obviously the summary kind of gives you some clue as to the drama about to unfold, but apparently I missed the clues going in, so when the “big thing” is revealed I was a little … surprised? I think that’s the best word to use.I’m a fan of Julia Whelan’s narration on my audible titles and when this book hit my radar I was immediately intrigued by the idea that she also writes books so I got a copy in my hands as quick as possible. Plus the idea of this story set in England at Oxford was a bonus! Ella Durran has known since she was 13 that she was going to be at Oxford someday, and receiving a Rhodes Scholar is the way she makes that happen. She will enjoy this once in a lifetime opportunity, then she will turn around and go home and become the sweetheart of politics as she’s been planning for years. As she arrives in London, she’s presented with the opportunity to work on a rising star’s political campaign - her solution – she’ll attend Oxford and work the campaign from across the pond and when she goes home in June she’ll have a job waiting for her., but honestly that whole part of the story felt kind of out of place for me. I get it.. it gave her a reason to have to go home when her Rhodes is up, but it just felt like a mash-up of reasons why she ultimately was going to leave instead of a part of the actual story. I liked Ella… I did. There were a few things about her personality that grated on me, but overall she’s a completely relatable character if a little.. bland. I kind of wanted to know her better and I think that is probably the one complaint I have about her specifically, I just wanted to get to know her more, which you would think the story is told from her POV would help with. Some pretty major revelations are touched on throughout, but then quickly relegated to a minor blip in the story and really didn't allow me to get that much-needed information I like in order to 'bond' with a character..I get the why of it throughout the first part of the story … the relationship that she embarks on with Jamie is supposed to be just a ‘friends with benefits’ type of thing – completely surface, so there's little revealed amongst each other, but Ella didn't really share any of her background with her newfound friends either, so how are we meant to get to know her? Plus Jamie and Ella aren’t going to get attached because there is no future, but that really makes it hard to become invested in their lives too, both together and apart. Whelan kind of breezes past 6 weeks of a 'relationship' where they are unwittingly falling for each other, and we don’t get to see or experience any of it other than the few interactions in the early stages and we're just supposed to accept that the bond they have formed is deeper than either intended.I liked Jamie… I did. (this sounds familiar) He totally comes across as this carefree guy who doesn’t have a care in the world when we first meet him and I kind of loved the first interactions he had with Ella. But then these things start happening and I started feeling another way about him… okay I was angry because WHY IS HE LYING ALL THE LIES?? Then I felt guilty when I found out why he was lying and then I was mad at Ella for being mad and it wasn’t pretty because then she did a thing and I was like WHAT IS WRONG WITH YOU… I was confused about how I was supposed to feel. Obviously, Jamie has his reasons, but I felt that through the rest of the book he's constantly making decisions based on how it will affect Ella rather than how it will effect him, and if ever there is a time to be selfish, it's when your life is on the line. So that all kind of made me mad, plus there is this huge drama with Jamie's father that really doesn't make sense until a certain part of the story, and I'm sorry to say it, but I'm on his side I think! Honestly, I was kind of emotionally spent when the big “life-changing” secret that Jamie had is revealed and you still have about 1/3 of the book left. So while the first part was lots of light-hearted making friends, having uncomplicated sex, drinking in pubs and just all around fun, the last part of this book really drags you down from that, and it’s such a huge change in tone from the first part that it kind of affected the rest of the read for me.I’m not saying that that is entirely a bad thing, but it was just not what I was expecting when I started and so I was caught off guard by all these feelings I suddenly was having. One of the things I absolutely loved was Whelan’s knowledge of England and Oxford and that showed in all her descriptions. I felt like I was experiencing it for the first time right alongside Ella. I love books set in England, I vicariously live through characters who get to travel internationally so that was a huge bonus in reading this.I also thought the way that Whelan wrapped up the story was wonderfully done. Without giving anything away it was a nice way to end it and leave it up for reader interpretation and imagination to determine what came next for both Ella and Jamie. Fans of Jo Jo Moyes will definitely enjoy this one, and if you don’t mind a little heartbreak and sadness with your Women’s Fiction (and who doesn’t really?) Definitely get this one in your hands and give it a go!"}, {"userName": "Meg - A Bookish Affair", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/1132408-meg---a-bookish-affair", "userReview": "\"My Oxford Year\" is a great story about ambition and romance. Ella has always been ambitious and she has dreamt of becoming a Rhodes scholar and going to the storied Oxford University for years and years. Now she finally finds herself there only to have another opportunity at home that could set her on a fast track to become one of the top picks to run political campaigns. Ella wants it all and she thinks she can handle it. Can she chase both dreams and a romance on top of it all?I was drawn to this book because I love books about strong characters, especially strong female characters. Ella definitely fits into this category. Whip smart, she is super sure of herself and is never afraid to take the biggest leaps in life. I really liked seeing how she handles both a great program at Oxford and a political campaign. It's not always pretty but she works so hard! She would be annoying if she weren't so darn likeable. I was rooting for her throughout the book!Oh, and I have to mention the romance. Ella bumps into Jamie and has an utterly embarrassing first encounter where they both seem to dislike each other but it is just well-disguised chemistry. It's not the most original story line ever but the author does a great job of making it fresh and giving the reader butterflies! I know I had them throughout the book.I really enjoyed this one! It was a fun read!This is a very smart romance"}, {"userName": "Catherine McKenzie", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/2796203-catherine-mckenzie", "userReview": "Well, any book that makes me cry (on an airplane!) deserves 5 stars! What a great debut from audio book narrator Julia Whelan. An American in Oxford meets an interesting group of Oxonians and a dreamy Scott named Jamie. But all is not as it seems in this romantic comedy--there's great literature, a keen eye for detail and some thoughtful introspection. Can't wait to read what she writes next."}, {"userName": "Ginger at GReadsBooks.com", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/4345315-ginger-at-greadsbooks-com", "userReview": "With a strong opener, I was really into this novel. Then something happened & I’m left feeling a little “meh” about it all. I wish I could put my finger on it, but something overall just didn’t satisfy me the way I was hoping it to. This saddens me because I was really into it for the first half. Guess you can’t love everything you read!"}, {"userName": "Ari.reads", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/3765270-ari-reads", "userReview": "This is the kind of book you talk about until you find another that meets its equal. The kind you beg others to read, to cry over, to hope they adapt it into a movie. The kind that inspires you to go on an adventure, make new friends & fall in love.•❝But if you love someone, and are loved by someone, you might find forever after. Whatever and wherever that is.❞•I absolutely loved this book and will probably be talking about this book for a while.•-I listen to the audio version of this book and bought it right after because I knew it was one you should keep in your bookcase. Easily my top 10 favorites."}, {"userName": "Bex | TotallyBex.com", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/37774641-bex-totallybex-com", "userReview": "Amazing. Outstanding. Wholly unexpected. Just wow.[full review to come!]"}, {"userName": "Jaime Fiction Fangirls Book Review", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/11053918-jaime-fiction-fangirls-book-review", "userReview": "When I first came across this book and saw the comparisons to novels by JoJo Moyes and Nicholas Sparks I admit, I was a little nervous to read it. I love ugly cry books but I tend to be hesitant to read them for obvious reasons. However, I just couldn’t seem to pass up the chance to read this one. I am so thankful that I went ahead and agreed to give it a chance use it easily made it on my best of 2018 shelf. First we need to discuss the setting of Oxford and the detailed picture that the author paints for readers. I fell in love with a place I never really thought much about before. The history, the culture and the quaintness, I couldn’t help but have my interest piqued. I won’t even pretend that I didn’t spend hours googling Oxford when I was finished with this book. Above and beyond the author’s ability to paint such a clear picture of Oxford and the little details that could only come from someone who experienced life there, was the way in which she wrote such complex, yet relatable characters. Intellectuals intimidate me. I envy ambition and brilliance and as a coping mechanism I often dismiss these types as snooty, stuck-up and cold. I won’t even pretend that in the beginning of the story I wasn’t worried that I would write both Ella and Jamie off as exactly these types. I’ll happily admit that I deserve a smack to the head because of course I fell in love with their brilliance and ambition, because they were both so much more than that. Ella from Ohio is one of the strongest, smartest and most selfless heroines I’ve met. Even as she struggled with all of the twists and turns that life was throwing at her during, what was supposed to be, her last hurrah before she settled into her political career back home in the states, she remained surprisingly level-headed, brave and steadfast. Then there is Jamie. Where do I even begin with him? His first appearance in this story left me less than in love with him for sure, but as the story went on and we got to see the varying sides of him, it was impossible not to be infatuated with him. A little bit arrogant but a whole lot sexy and smart, this man knew his Tennyson and was a pure romantic at heart. There is something about a man who doesn’t just speak of putting other people first but who consistently does it, despite the heartache he might be causing himself. It was this true selflessness that made Ella and Jamie’s story even harder to read. There will be tears. Some of them are good tears though! I would be remiss to leave out my love of the secondary characters in this story. While I really enjoyed the spunk and character of Charlie and the quiet reserved, yet colorful Maggie my favorite of all of Ella’s friends was Tom. He was a riot, though frustratingly oblivious, or possibly even just hesitant to proceed with what he knew and/or felt. I couldn’t get enough of him. This story was so much more than I expected but everything I never thought I wanted it to be. Heartbreaking, uplifting, and beautiful, this book is one of my favorites of 2018 and worth every tear I shed. *I received an ARC from Edelweiss for voluntary review"}, {"userName": "Teresa", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/15654040-teresa", "userReview": "I went from being mildly interested in some day reading this book, based on it being written by a favorite audiobook narrator, to being kind of anxious and nervous to read it, to just diving straight in and devouring it. I started this book on audio, since Julia herself narrates it, but soon enough, I was reading the book just because it was faster. Julia Whelan is as good a writer as she is a narrator. Her prose, her ability to make you feel part of the book, adding emotion and depth, it was quite the journey for me. I have always loved books that take place in older, intellectual college settings. It was clear the author had been to and loved Oxford. I felt a part of the early fun with pubs, stuffy college settings, meeting new friends (lots of great secondary characters), before this took on a more serious and deep tone. The coming of age, self-discovery, the way the uncertainty of life is always with us, was captured beautifully by the prose. I look forward (hopefully) to more from Julia."}, {"userName": "Antonella", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/56920971-antonella", "userReview": "[There is cancer and dealings with loss. Happy end but until when that kind of thing.I don't like that kind of surprises in a book (hide spoiler)]"}, {"userName": "Danielle", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/71306758-danielle", "userReview": "*Thank you to Harper Collins/William Morrow Book for sending me a finished copy to read & review.*This book was a sweet and funny and heartbreaking story. It follows Ella as she crosses the pond to obtain her Rhodes at Oxford. She has been working on this path since she was a teenager. After a less than stellar first meeting, Ella finds a connection with her English literature professor Jamie. The fling develops into something more when Ella learns about Jamie's secret. Ella faced with an impossible position - turn her back on her new home and love, or return to the US to follow her political dreams.This book kept me turning pages way past my bed time. I felt fully invested in the relationship between Ella and Jaime. I wanted to see what choice Ella would make regarding her future. This book gave me \"Me Before You\" vibes and was perfect for my \"chick-flick\" loving soul."}, {"userName": "Evelyn", "userReviewDate": "Mar 11, 2018", "userURL": "http://www.goodreads.com/user/show/23348900-evelyn", "userReview": "Thank you to goodreads and the author. I won an ARC of My Oxford Year!It's taken me a few days to mull over the book. I knew the author from the many (many) audio books Julia has narrated. And I have to say she is one of my top favorites. I will listen to the books she's narrating based on her alone. So with that being said, I have to say I was really disappointed with this book. It took me a really long time to read this book. I just had no motivation to want to read it. Clearly, it took almost a month to read.In the back of the book it states that this book was based on the original screen play of Allison Burnett. OK, so this isn't your original idea? And they wanted someone who went to Oxford to rewrite the story, basically. Yea Julia for going to Oxford! Also it says the book is 352 pages and my book was only 329 pages with acknowledgements. Am I missing part of the story?Phew, now that the technical is out of the way let's talk about the book, shall we?It was all over the place. First, its about a girl who has dreamed since she was a teenager she wanted to go to Oxford. (That's a good goal) Then we find out she is heavy into politics and she is only here in Oxford (On a Rhodes scholarship) to fulfill this dream of going but in one year she is going back to get on the campaign trail in the US.There was tiny bits here and there to check off a list of oh I gotta talk about Oxford. I wasn't a fan of the quotes at the beginning of each chapter. The rest of the book was typical cliches of we gotta have the gay friend, the nice friend, the party friend, etc..and she dumps them for this guy who states, I don't want a relationship I just want to sleep with you. She goes back to her friends when she gets the I need space let's take a break. Ladies, are we done with guys like that? Ain't nobody got time for that. If you feed the bad behavior you'll only get bad boys. Are you with me? It was during the break from the F-buddy we explore the way of life during her year there. Different foods, drinks, customs...etc.Throughout the book she takes phone calls to help a campaign back home? That was just weird. It didn't jive with rest of the book. Where is this book going? Are we studying at Oxford and this about her year there or is Oxford just a backdrop to this campaign job? But wait, it gets even more confusing! She dumps friends/political job/school all to take care of this sick boyfriend dying of cancer. (OK, she didn't dump them in the river but they became the back burner and now it's about nothing above and a sad cancer book) At this point I had to get a dry erase board out and start drawing out what was happening.Big picture, this was the American version of Me Before You and it didn't work. You're telling me a girl who is that educated and has a focus/goal, is going to throw it all away over a \"dying rich\" dude? We all know, if this man didn't have the money her ass would be like well I gotta go study now. Even though, it's pointed out she wants to pay for her own stuff (eye roll).I think this review is making about as much sense as this book. It's all over the place and we are all barely hanging on till the end.The author wrote a great speech about motivating to follow your campaign dreams and don't give up! Yea girl power! But the protagonist herself did the opposite, wtf?Can someone write a female protagonist who knows what she wants and is not going to lose herself over a guy. You know the girlfriend we all have who starts dating someone and can't return a text until they breakup. Clearly, I didn't go to Oxford. And a publisher is not dying to put my words out to the world. I really wanted to like this book. It's me not wanting to read about a girl who gives it all up over a boy."}, {"userName": "MaryannC.Book Fiend", "userReviewDate": "May 16, 2018", "userURL": "http://www.goodreads.com/user/show/3808308-maryannc-book-fiend", "userReview": "A charming, rather touching read about young 24-year old Ella Curran who was selected as a Rhodes Scholar to Oxford where she hopes to experience all that she can during her year abroad but against her better judgement begins to fall for her professor's assistance."}, {"userName": "Angie", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/50378-angie", "userReview": "Originally reviewed here @ AngievilleI'll confess this beautiful cover is what initially drew my eye. It's just a book I wanted to have on my shelf aesthetically. But even before I saw the cover, I'd heard of this title. It's as though it's been floating around in the ether for awhile now, what with a major motion picture already being in development. Truthfully, that level of advance hype gave me pause, as did the implied titular time constraint. Something about it fairly screamed, \"Unplumbed depths of pain lurk beneath this charming cover.\" I was wary. But some gut instinct kicked in, encouraging me to give this one a chance. I am so very glad I did. The novel is an adaptation of an original screenplay (a fact I found out after turning the final page), and I sat with that for awhile sussing out how I felt about it. In the end, I don't think it really alters my experience with this text. I've formed my own primary relationship with it here. I'm also looking forward to seeing the film and giving that experience its due.Ella Durran is literally standing in the London customs line about to embark on her dream year at Oxford when her phone rings. On the other end of the line is a job offer she can't refuse, working on the presidential campaign for a candidate she genuinely believes in. But Oxford has been the goal for as long as she can remember, so Ella (being the savvy contender that she is) strikes a deal. She'll be available day or night, working remotely from Oxford until the duration of her Rhodes scholarship ends, whereupon she will return to Washington, D.C., her future literally laid out before her. And it seems like the perfect plan. Until the idyll suffers a seismic shift in the form of a seemingly innocuous (if incredibly unpleasant) encounter with an obnoxious man in a chip shop. The momentary blip turns into a long-term nightmare on the first day of classes, when the man from the shop turns out to be none other than Jamie Davenport, Ella's literature lecturer. Not only do they not see eye to eye on the subject of condiments, they seem to differ on everything under the sun, beginning and ending with the literature they both love and just why and how it forms the fabric of life. Before long, they can't seem to leave each other alone in or out of the lecture hall. And it's becoming more and more difficult to remember a time before they sparred in quiet pub corners, to say nothing of that seemingly distant point when it will be time to leave.Some of the larger buildings have huge wooden gates that look as if they were carved in place, a fusion of timeless wood and stone that steals my breath. Maybe those doors lead to some of the thirty-eight individual Oxford colleges? Imagining it, dreaming of it all these years, doesn't do it justice.I look skyward. Punctuating the horizon are the tips of other ancient buildings, high points of stone bordering the city like beacons.\"The City of Dreaming Spires,\" I murmur to myself.\"Indeed it is,\" Gavin says in my ear. I'd forgotten he was still on the line.That's what they call Oxford. A title well deserved. Because that means, before it was my dream or Seventeen magazine girl's dream, it was someone else's dream as well.It was that last line, right there at the end of the first chapter that sank me. It captured perfectly my feelings the moment I stepped off the coach and started my own wander in Oxford. The layers upon layers of dreams and knowledge and wanting fairly suffused my soul that October day. It came as no surprise, then, that I felt fully involved from that moment on in Ella's time among those hallowed halls and lanes. The lovely bit is that Whelan's writing strikes an appreciable balance between the inherent lightness and untroubled nature of a 24-year-old young woman on her first real adventure in a foreign country and the nuanced depth of that woman's dedication to forging a better world using every carefully honed skill she possesses. The love for literature (most particularly Ella's love for  Middlemarch) that forms the foundation of Ella and Jamie's bond also serves to anchor the story. And you likely knew the second I mentioned Middlemarch that this book and I would get on. But predilections aside, I cannot fail to mention a moment in which Ella makes an observation on Dorothea Brooke that rang so true for me, it took my breath away. It is echoed once more at a pivotal moment in the novel to exquisite effect, and it has lingered with me ever since. Fifteen minutes after leaving Sophie in the filthy bathroom, I'm standing at Jamie's door, sopping wet and no longer calm. That vanished when I turned off Banbury Road onto Norham Gardens, my wet clothes chafing with every step, the wind wrapping my hair around my face and throat like clingy fingers. In its place, single-minded, near-homicidal rage.We were better than this, Jamie and I. We weren't much, maybe, but we weren't this. This cliché. This statistic. This sadly predictable inevitability. As Jamie had said in our first tute, \"We're the clever ones. We're Oxonians.\"This is not the way the clever ones end.\"I'm sorry. About everything, okay? I should have realized you weren't―\"\"No, please. Stop right there. You feel bad, I feel bad, but we will not plague each other with guilt. It's an absurd emotion, reserved for those who we fear might feel less than they ought.\" He looks in my eyes. \"You and I, we carry on. If we stop, it is to only catch our breath. Well, breath caught.\"It's that way with them. And it's that way with me. I love how direct these two are. I worried so much, as I could feel the weight of the untenable situation they found themselves in starting to close in ever tighter. While reading novels of a somewhat similar bent, I often find myself feeling hounded by the heavy hand of the author as the whole thing crosses over into the kind of emotional manipulation I detest. And while the nature of the conflict flirted with the edges of my tolerance, it never crossed over for me. It's the genuine and subtle exploration of the written word that held me with Ella and Jamie, that held them with each other, when the inevitable darkness comes to call. And call it does. Far earlier than I expected, even going in as prepared as I thought I was. But it is okay. I repeat, it is okay. Because words are the bridge. The accumulated words of the centuries that fold in around us to let us know we're not alone. Bridges of all sorts are important in this lovely novel. Bridges formed by our family, the past, our combined failures, and our dreams. But always by words."}, {"userName": "Kristen ", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/2932454-kristen", "userReview": "[ I liked that the ending was left open. Less heart wrenching than Me Before You, but that's okay. I can pretend happy miraculous things.I know you're not supposed to quote an ARC, but I can't help it. I loved these two quotes:Losing someone is hard enough. But death without the process of dying is an abomination. It takes nine months to create life; it feels unnatural, a sin against nature, that the reverse shouldn’t also have its time. Time to let go of the known as we take hold of the unknown.I came to Oxford looking for a Once-in-a-Lifetime Experience. I chose to experience a lifetime. (hide spoiler)]"}, {"userName": "Ellen at Book Bellas", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/10000471-ellen-at-book-bellas", "userReview": "\"I’ve only felt love like this once in my life, and I can’t bear to think of it right now.\"Wow!! I cannot believe this is Julia Whelan's debut novel. Smart, funny, sexy and very engaging, 'My Oxford Year' transported me to England and I can't stop thinking about Ella and Jamie! I can tell from the first page of a book whether it will be a favorite of mine. This story has that \"it\" quality that engaged me from the very first page. I could not get enough of this story! From the fabulous description of Oxford to the exploration of the customs of the university, to the exploration of the British class system, this book has it all! But at its heart it is a lovely and honest and modern romance. Ella arrives at Oxford as a Rhodes scholar, one of the few Americans at her college. After a \"meet-cute\" with Jamie Davenport, as luck would have it, he is the teaching assistant for one of her classes. Of course they like each other immediately, but Jamie's playboy reputation precedes him and he makes it clear to Ella that he will never want a lasting relationship. Which is fine for her, too, because she has a fantastic job waiting for her when she returns to America at the end of the school year.\"And then let’s say, just for argument’s sake, a decade later you meet this guy and he’s unlike any guy you’ve ever met before, except for one thing: he doesn’t want to be in a relationship. Which is just peaches ’cause neither do you. For you two, relationships are like decaf coffee: What, exactly, is the point? So you ease into it.Sometimes you catch him looking at you and the floor of your stomach drops out like a carnival ride. It’s not lust; lust you could understand. It’s appreciation. It comes with a nearly imperceptible smile when he looks at you and he thinks you can’t see him. It’s the appreciation that separates him from all the other boys you’ve been with. It’s the appreciation that makes him a man. And, in turn, you appreciate the hell out of him. For all of it.\"Aaaah Jamie. He's brilliant, humble, wealthy, and scholarly. Ella is smitten. But still determined to leave Oxford come June, which she has made very clear to Jamie. The joy of this very funny and intelligent story is that neither one of them, for all their planning, could ever see what life had in store for them. \"You never thought you were a sexual being. You could always take it or leave it. You realize now that this isn’t true. You don’t want to blame the other men you’ve been with, but suffice to say, what you did with them shouldn’t even be called sex. It’s like hanging a Monet next to some doodle from kindergarten that didn’t even earn a spot on the refrigerator. Is it all art? Maybe. But you’ll take the Monet.\"This is absolutely one of my favorite books so far this year. Julia Whelan has an eye for detail that is a joy to read! And the supporting cast of characters are all richly drawn and very real. This is a beautiful, poignant story that should be on everyone's must-read list! AND it's been optioned to be made into a movie with none other Sam Heughan attached to the project. The ending and the Epilogue were PERFECT and I cannot recommend this book highly enough. \n\"Stay, Jamie. If you can, if you want to, please choose another time. Choose to stay. Choose to stay with me. Stay with me and I’ll stay with you.\"\nFavorite quote:\n\"And if you’re not surprised by life, then what’s the bloody point?\""}], "description": "Major Motion Picture Already in Development with Temple Hill EntertainmentSet amidst the breathtaking beauty of Oxford, this sparkling debut novel tells the unforgettable story about a determined young woman eager to make her mark in the world and the handsome man who introduces her to an incredible love that will irrevocably alter her future—perfect for fans of JoJo Moyes and Nicholas Sparks.American Ella Durran has had the same plan for her life since she was thirteen: Study at Oxford. At 24, she’s finally made it to England on a Rhodes Scholarship when she’s offered an unbelievable position in a rising political star’s presidential campaign. With the promise that she’ll work remotely and return to DC at the end of her Oxford year, she’s free to enjoy her Once in a Lifetime Experience. That is, until a smart-mouthed local who is too quick with his tongue and his car ruins her shirt and her first day.When Ella discovers that her English literature course will be taught by none other than that same local, Jamie Davenport, she thinks for the first time that Oxford might not be all she’s envisioned. But a late-night drink reveals a connection she wasn’t anticipating finding and what begins as a casual fling soon develops into something much more when Ella learns Jamie has a life-changing secret.Immediately, Ella is faced with a seemingly impossible decision: turn her back on the man she’s falling in love with to follow her political dreams or be there for him during a trial neither are truly prepared for. As the end of her year in Oxford rapidly approaches, Ella must decide if the dreams she’s always wanted are the same ones she’s now yearning for.", "title": "My Oxford Year", "url": "http://www.goodreads.com/book/show/35068830-my-oxford-year", "average": 3.95, "cover": "https://images.gr-assets.com/books/1507326527l/35068830.jpg", "reviews": 361, "authors": [{"url": "https://www.goodreads.com/author/show/2939944.Julia_Whelan", "name": "Julia Whelan"}], "type": ["Romance", "Contemporary", "Fiction", "Womens Fiction", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/35068830-my-oxford-year", "http://www.goodreads.com/book/show/36639505-my-oxford-year", "http://www.goodreads.com/book/show/35820405-my-oxford-year", "http://www.goodreads.com/book/show/39650737-my-oxford-year", "http://www.goodreads.com/book/show/139987.The_Snow_Queen", "http://www.goodreads.com/book/show/32620332-the-seven-husbands-of-evelyn-hugo", "http://www.goodreads.com/book/show/26025580-the-grownup", "http://www.goodreads.com/book/show/19288043-gone-girl", "http://www.goodreads.com/book/show/22817425-nora-roberts-the-witness-whiskey-beach-2-in-1-collection", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}