{"ratings": 400, "userreviews": [{"userName": "Nancy Oakes", "userReviewDate": "Mar 08, 2015", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "The very long version is  here; otherwise read on. If you're looking for an average haunted house novel with ghosts and ghoulies and things that go bump in the night, do not look here. What you get in Nazareth Hill is a great story where the supernatural provides a backdrop for an intense psychological examination of a man as he sinks into his own madness. Sadly, he drags his daughter right along with him. I don't understand the negative reviews of this novel -- some people didn't find it scary enough, some thought it was too long and too clunky in terms of how Campbell writes. Okay, each to his own, but I found it exceptionally frightening on a very human level. And while I'm a huge fan of the author's short stories, he manages to keep the tension not only flowing but also building throughout the entire length of this book. A lot of authors I've read can't make that transition and do it well, but in this case, I was hopelessly lost in this story until the ending. Actually, the ending was what I found not so great about this novel, but for me it's usually about the journey anyway. I have zero qualms recommending this book."}, {"userName": "Andrea", "userReviewDate": "Mar 26, 2007", "userURL": "http://www.goodreads.com/user/show/32607-andrea", "userReview": "A father and daughter move into a building that once housed a mental institution and the former occupants wreck havoc on the new tenants. This is one of the scariest books I have ever read. There were a couple of passages that frightened me so badly, I had to put the book down. The setting is divinely creepy and the characters are interesting and well-developed."}, {"userName": "DeAnna Knippling", "userReviewDate": "Aug 10, 2017", "userURL": "http://www.goodreads.com/user/show/3166570-deanna-knippling", "userReview": "Laboriously, the crazy, abusive father is crazy and abusive. Too bad, a haunted house makes things even worse, the end. I didn't find this one fun at all, skimmed. It was one awkward, at first emotionally then physically abusive scene after another. Just...no."}, {"userName": "Heidi Ward", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/4751840-heidi-ward", "userReview": "[Amy's adventures with the first floor in particular were spellbindingly awful for me  (hide spoiler)]"}, {"userName": "Emily Crow", "userReviewDate": "May 02, 2016", "userURL": "http://www.goodreads.com/user/show/23080450-emily-crow", "userReview": "[The real \"horror\" of this tale is how no one is willing to believe Amy, and the more she tries to convince people, the crazier she sounds. (hide spoiler)]"}, {"userName": "Rebecca McDowell", "userReviewDate": "Jan 29, 2013", "userURL": "http://www.goodreads.com/user/show/1896957-rebecca-mcdowell", "userReview": "Drawn out, garbled prose leading to a bummer conclusion. I simply didn't enjoy reading it. It took too long for me to figure out what the author was trying to say - it may be an issue of personal taste, but I found his writing style cluttered and difficult to follow. I believe other people have had the same problem.The two other main issues I had:1. Too many characters (and too much time spent describing people who didn't matter); and2. Unrealistic characterization. I realize he was trying to make a point, but I have difficulty believing the girl would've been treated the way she was by the others in the apartment. The people in this book were like caricatures of sitcom idiots with the daughter as the only voice of reason.Not interested in his other work at this point."}, {"userName": "Tammy", "userReviewDate": "Nov 13, 2009", "userURL": "http://www.goodreads.com/user/show/2546530-tammy", "userReview": "I have become spoiled by fast-paced thrillers. Novels like Nazareth Hill remind me to stop and feel the dread. toward the end of the read, I literally had my jaw drop in horror y"}, {"userName": "Pam Baddeley", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/42764850-pam-baddeley", "userReview": "This is the story of the disintegration of a relationship between father and daughter, and its descent into insanity and horror, with supernatural elements woven in. I found it rather a disappointment after some of Campbell's other novels, especially since the setting - a block of flats created from the derelict remains of an old building which had a past as offices and before that a lunatic asylum - and the cast of newly arrived flat owners did have potential. However, the involvement of the other characters is perfunctory and they hardly figure at all in the story.The behaviour of the sixteen year old daughter who is aware of the psychic disturbances in the building is characterised well, with the allowance that this was written well before the use of internet, mobile phones etc, so her attempt to research the history of Nazarill, as the building is known, has to rely on secondhand bookstalls and the willingness or otherwise of a history teacher. But the father's disintegration as he becomes increasingly like an abusive former governor of the asylum comes across as so over the top at times, it cannot be taken seriously. Even at the time this book was written it is also unlikely that every adult - with the exception of someone who runs an \"alternative\" shop and is soon encouraged to leave - demonises the girl for using the odd rude word and approves of her being beaten.The ending is truly horrific, but inevitable given what has gone before, although there is a slight ray of hopefulness in her ultimate fate. But if the ghosts of former inmates were looking to her for release from their imprisonment, it seems unlikely that they would terrorise her in the way they do. That, and the attempt to shoehorn too much into the story - the former inmates were also descendants of witches who used to worship on the hill where the house is built - rather muddles the story, so for me this only merits 2 stars."}, {"userName": "Lisa *OwlBeSatReading*", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/4695379-lisa-owlbesatreading", "userReview": "Aah, that was so good!The House on Nazareth Hill is a creepy and nostalgic story that is an absolute must for fans of slightly cheesy, traditional style horror.Ramsey Campbell's narrative style reminds me of James Herbert, who is responsible for my love of the horror genre as I read The Dark when I was knee high to a grasshopper, and it hooked me right in. That's where my horror journey started and I've never looked back.Initially, this had a slow start, with lots of character development and description, but once it got going, this dark and eerie tale *seeped into my mind and stuck like dusty cobwebs in a dark, unknown corner.On occasions, there was serious overuse of the word 'rebuke', it just kept coming again and again which was a tad irritating, but other than that (and the slow start), this was a really great read.It's cool to read a story where there's no mobile phones, everyone has a VCR player, and books and the library is the 'Google' equivalent to finding out about the mysterious past of Nazarill.Overall, a highly entertaining and spooky read which tapped in to a lot of my personal fears, particularly spiders....! Recommended for lovers of traditional horror, where the sinister and cheesiness combine without too much eye~rolling by the reader.4 stars out of 5, only lacking in full marks due to the first 100 pages being a little bit slow, *like wading through a pool of congealed blood with your socks off, feeling each minced body part squelch up between your toes!(*my rubbish attempts at describing the 'feels' like the author!)"}, {"userName": "Lindsey Albright", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/13240317-lindsey-albright", "userReview": "I really enjoyed this story. I don't think it's one I'd ever read twice, but I did like it. I struggled through some characters' perspectives and found myself at constant internal conflict over my opinion of a few of them. I can't honestly say that I actually liked any of them completely. Personally, I just didn't know what to feel while I was reading, other than aggravation and distress. The reason that this book didn't get five stars is because this is a review from what I experienced and what I experienced was a struggle mixed with yearning for more story. Even at the end, my mind was telling me how awesome it would be for certain perspectives to be continued at some later book, all while being up set for reasons that I don't want to spoil for future readers.This book does deserve five stars. If I were far more fair and judged the book for it's writing, I would give it five stars. The writing is terrific - suspenseful yet detailed. There were scenes that made me uncomfortable to be in dark hallways and rooms for a while. Well, far more uncomfortable that I usually am. I just wanted to scream at the characters, all of the characters, but each of them has quite a bit of depth.I wasn't very keen on most of the names in the story, but I could see why they were chosen. They were nice choices, but I felt like some were very on-the-nose and others were very plain. The setting was lovely and easy to fall into. Everything was just detailed enough to paint a picture for me. It was also really fun to read to the point where certain themes really tie everything into a nice bow on top of a very pretty package. I couldn't manage to give this one five stars though because I can't see myself picking it up for a second read through. It was well worth the first read and I would recommend it to anyone that enjoys psychological thrillers or horror novels. I just can't deal with the fact that reading it made me want more and made me grumpy about everything at the exact same time."}, {"userName": "George", "userReviewDate": "Sep 13, 2008", "userURL": "http://www.goodreads.com/user/show/947535-george", "userReview": "Will someone tell me what I’m missing about Ramsey Campbell? I’m being serious here. I haven’t been able to finish one of his novels yet. I tried to read his newest, “Grin in the Dark,” which features an evil clown that unleashes a nameless evil on the world. Stephen King did the same thing a thousand times better when he wrote “It,” and at the time he was coked out of his mind.Anyway…Nazareth Hill came highly recommended by a fellow librarian who also happens to be a horror connoisseur. I figured it would be good. It wasn’t. Here’s my review: the story starts slowly and builds to a grisly, sadistic end which any discerning reader can see coming from the first chapter. People talk about Ramsey Campbell like he’s the Bill Shakespeare of the horror genre. If that’s true the horror genre is in trouble. Horror writers seem to have a love-hate relationship with literary fiction, which either stems from a chip on the shoulder or an inferiority complex. Campbell has a style that I’ve heard described as both psychological and poetic, phrases I’ve heard used to describe writers of literary fiction. To me it comes across as padded, as in – get to the point, please. Yes, the phrase ‘spider house’ is poetic; yes, you do spend lots of time describing your characters’ inner thoughts & feelings. Give yourself a cookie! I have to say that I think Campbell’s short stories are very good; maybe it’s because they’re short. But I just don’t get his novels."}, {"userName": "Grainne Rhuad", "userReviewDate": "Mar 08, 2013", "userURL": "http://www.goodreads.com/user/show/1196171-grainne-rhuad", "userReview": "I .can see why this book received so many poor reviews on Goodreads. It is terribly unweildy, taking forever to get to the point, and that is in nearly every paragraph. However, it was hard for me to hate it because the IDEA, the story was so compelling to me. I'm going to say, it was tedious to read at times. Okay, most times. It left me feeling some how less intelligent. As if me not connecting and diving in was my fault. But then I reminded myself of my book enjoyment rule. \"If there is a good story and people would rather do anything but read, it is the story teller's fault. Bottom line;The idea snd the story is quite good. The execution leaves much to be desired."}, {"userName": "Sara Gould", "userReviewDate": "Jul 31, 2012", "userURL": "http://www.goodreads.com/user/show/3741118-sara-gould", "userReview": "Nazareth Hill es una historia que pende de un hilo, y es el par de sustos que consigue darte en las primeras páginas de la novela. A partir de ahí, es un simple no-lo-leas; con una escritura/traducción horrible, una trama que a pesar de parecer original resulta cansina, unos personajes malos y un final que no lleva a ninguna parte. Sí que da miedo, sí. Pero no por las causas deseadas.Puedes leer la reseña completa (hecha por una yo furiosa) aquí: http://geckobooks.blogspot.com.es/201..."}, {"userName": "Kirsten", "userReviewDate": "Mar 15, 2008", "userURL": "http://www.goodreads.com/user/show/821868-kirsten", "userReview": "A chilling story... As a child, Amy was afraid of the old building on the hill, called Nazerill by the town's inhabitants. Now, at fifteen, she and her father have taken up residence in that same building, which has been converted into luxury apartments. But the house on the hill holds dark secrets, and they are worming their way to the surface..."}, {"userName": "Teri", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/1350044-teri", "userReview": "Pretty good horror novel. Campbell does a great job of building the suspense throughout the novel. The relationship between the father and daughter is fascinating. And the ending will blow you away!"}, {"userName": "Sarah", "userReviewDate": "Jan 21, 2008", "userURL": "http://www.goodreads.com/user/show/810263-sarah", "userReview": "This guy's books are fabulously written and one of the few authentically scary authors out there... so much so that I actually don't recommend reading him. Pleasurable disquietude that has too much disquietude and not enough pleasure. Sorry, ramsey!"}, {"userName": "Ignacio Senao f", "userReviewDate": "Jun 08, 2015", "userURL": "http://www.goodreads.com/user/show/23594750-ignacio-senao-f", "userReview": "Abundancia de palabras sin objetivo. Ramsey tiene una fama no merecida, tan sólo dada por su prematura escritura y charlas con Howard y Lovecraft."}, {"userName": "Thomas Burchfield", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/3349160-thomas-burchfield", "userReview": "Ramsey Campbell is one of my favorite authors in any genre for his exquisite prose style which imbues everyday life with ferocious menace in the same intense fashion that Vladimir Nabokov imbued everyday life with brightness and magic. There's really no one like him in his skill at turning the world inside out through his black magic prose and his portrayals of loneliness and alienation ring true. Like the great VN, he is truly \"trippy\" as he twists reality around to make us see it all a little differently.That said, though, I've found his best work to be in short fiction, less so his novels: take NAZARETH HILL, which contains much of what makes Campbell so fabulous and a lot of what doesn't. NH is full of beautiful prose and den with atmosphere but it's an often ungainly book: It opens by dumping over a dozen characters out on the table in one long paragraph and then leaving the poor reader to sort through them (I had to dog-ear the page so I could keep the characters sorted.)The narrative often bogs down. Campbell has close links with the great ghost story writer M.R. James, but often--especially here--he's more like Henry James: ornately detailed to the point where the novel is swamped with obfuscation. The book sometimes chokes on its prose, especially toward the end with the final confrontation between father and daughter. It only breathes in the last two chapters.Another unique Campbell trick is how he handles dialogue: his characters are intensely vulnerable and lonely--loneliness is one of the author's major themes--and so stricken that they can barely talk to each other and when they do, it's in the most indirect, roundabout way. Even offering a cup of tea can lead to a deadly unpleasantness. Rarely ever do they lay their cards on the table. It's a brilliant idea, but in execution things plunge into deep awkwardness. Campbell's people communicate in such a roundabout way, that they don't sound convincing at all, even as morbidly shy and inarticulate types. There's got to be a better way of showing how people *don't* talk to each other!I've liked other Campbell novels better, such as ANCIENT IMAGES and THE DARKEST PART OF THE WOODS. This one for me, though, fell short."}, {"userName": "Robert", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/27379209-robert", "userReview": "This is a great horror novel. It's quite frightening in spots, but Campbell manages to sustain a sense of dread and intense oppression for most of the book's 384 pages."}, {"userName": "Dennis D.", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/1452657-dennis-d", "userReview": "Creepy on multiple levels. I’d give it 3.5 if I could!"}, {"userName": "Miguel Navarro", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/39129720-miguel-navarro", "userReview": "Lo dejo a la mitad, la redacción y la traducción son infumables."}, {"userName": "Flibbertygibbit", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/10665904-flibbertygibbit", "userReview": "I have such mixed feelings about this book. At times, it felt like a true chore to read. It probably could have used some heavy editing to trim its somewhat considerable fat, and there were parts where the pace dragged to the point that slogging through it felt more like homework than leisure. Sometimes I find Ramsey Campbell's prose a little impenetrable or clunky. Occasionally, I have to read certain sentences more than once to make sure I understand what they were intended to communicate.That said, years later, this novel still haunts me. This book is terrifying at times. Images from it flashed in my mind literally every night when I'd turn out the lights, for god knows how long after I read it -- many, many months, at least, maybe even more than a year. Campbell expertly builds up suspense until the horror hits you with a sense of urgent intensity. When the characters are at their most frightened, you will be scared silly right there with them, heart in your throat. The ghosts that haunt his story are drawn almost too vividly, and are some of the scariest spooks I've ever encountered in any novel.What's more, this book concludes with a hell of an emotional punch. There's more than just ghosts to scare you. The depiction of the deteriorating relationship between the central father and daughter characters is wrenching to behold. The ending is unexpectedly powerful, and even... beautiful.So if you try to tackle this novel, be warned, it will be tedious at parts. It may also take up residence in your head for a long time afterward. I'm not sure I'll ever reread it, but I'm sure I'll never forget it."}, {"userName": "Lisa (Harmonybites)", "userReviewDate": "Oct 22, 2010", "userURL": "http://www.goodreads.com/user/show/2596042-lisa-harmonybites", "userReview": "This one took a while for me to get into, I almost stopped at fifty pages where nothing had happened yet but a truly boring tenants meeting However, the setting of modern Northern England as written by a British writer had an inherent fascination for me. Nazareth Hill is where witches once danced and where an insane asylum once housed them after witch hunts went out of fashion--and there are strange happenings going on there--ones witnessed by several people, particularly a fifteen year old girl, Amy Priestly. She's a typical teenager, in ways I could imagine being maddening if I were her parent: body piercings, shaved head, plays loud music, smokes marijuana, pigsty of a room, sullen and uncommunicative; her father has good reason for concern. Yet the core of the horror of this book is how easily isolated and vulnerable Amy is, to his authority as a parent since she's not yet of age, as he becomes increasingly controlling and prey to a zealous religious mindset that may be influenced by the dark forces surrounding them. The tension between them and suspense becomes more and more unbearable to take as a reader, especially in those last hundred pages. Particularly hard for me to read, since I do find frustrating the kind of story where no one believes the protagonist. This was well-written, literate, with characters that felt all too real--although be warned, it's also brutal and heartbreaking."}, {"userName": "Chris Cangiano", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/16055227-chris-cangiano", "userReview": "Ramsey Campbell's novels are always rather hit-or-miss affairs for me. I either find them terribly entertaining or deadly dull, unfortunately for my tastes, Nazareth Hill falls decidedly in the miss category. He starts with a sound idea, a block of luxury flats into the frame of an old mansion on the site of a former insane asylum, and explores the way that past sins come back to haunt the present occupants. One of my main problems with the way the story is presented is that the pace is not merely measured, it is in fact quite glacial - I felt at times like shaking the book and telling it to get on with things. Campbell again uses the book to explore his frequent theme of the way in which the presence of mental illness (an fear of its recurrence) affects family life, but the characters are all so unlikable and they act in ways so far divorced from the way real people act that it was hard to care about their fates . Ultimately the story just didn't engage me, which is a shame because as always Campbell has written some inventive and disturbing scenes of unease and horror for me they were just too few and too far between and too diffuse."}, {"userName": "Karyl", "userReviewDate": "Apr 14, 2010", "userURL": "http://www.goodreads.com/user/show/1462387-karyl", "userReview": "I bought this book on Andrea's recommendation. Besides, it was only a dollar. Even if it wasn't my type of book, I was only out a dollar. I didn't really read too much of the covers till I typed it into Goodreads and noticed that Andrea had rated this as one of the scariest books she's ever read. Knowing that she's a Stephen King fan, I was scared out of my wits to try to read this book. In fact, I very nearly didn't. But I put on my big girl panties and waded in.That said, I didn't find this book particularly scary. But I don't think it was because I'm any more brave than anyone else. This book just didn't get into my head, the way a thriller should do. I did think it was creepy and well-written, with a well-developed plot and good character development. The problem is, the story line somehow missed sinking its teeth into me. Perhaps I'm missing something. I think it's well worth reading because even though it wasn't particularly scary to me, I still wanted to devour this book and find out what was going to happen next."}, {"userName": "Peter Greenwell", "userReviewDate": "Oct 25, 2016", "userURL": "http://www.goodreads.com/user/show/5021956-peter-greenwell", "userReview": "Not one of Campbell's better efforts. It starts out a bewildering mess, being introduced to a dozen or so characters who subsequently have zero or almost to do with the story. Halfway through the novel, it picks up and boy, does it ever. It's page-turning stuff, but why did a reader have to wade through a bunch of inconsequential padding first?Trimmed of about a third the volume, and the meaningless first few chapters excised, this book would've been a five star effort, like The Hungry Moon was - which didn't tangle itself with pointless plot threads and insignificant characters.Oh well. To quote a platitude, you take the good with the bad. You get lavish servings of both with this book."}, {"userName": "Craig Herbertson", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/4292658-craig-herbertson", "userReview": "This is a horror tale of the gradual oppression of a young girl which works at a number of levels. Campbell is skilled writer so as one would expect it is well plotted with more characterization than the average horror tale. The book is ripe with metaphors and similes - perhaps too rich for the average horror fan and to my mind it would have benefited from a ruthless editor who could easily cull thirty or forty pages to no detriment of the book. It was difficult in the concluding chapters to identify with the principal oppressor or the potential saviour of the beleaguered heroine. The first two thirds built up a lovely tension which seemed to peter out rather than flower. All in all, if you are in the right mood it will carry you along with it."}, {"userName": "Sarca", "userReviewDate": "Mar 18, 2012", "userURL": "http://www.goodreads.com/user/show/8241018-sarca", "userReview": "I had never read anything of Ramsey Campbell's before, so I had no idea how or what he wrote. I found this book, was interested in the synopsis, and that was that. I can say that I have never been so bored out of my mind by a book written in the horror genre in my whole life. The prose was hard to get into, and, if memory serves, the synopsis on the back of the book was far removed from the story I was reading. I gave the book up and lent it to a friend who also felt the same. Maybe his short stories are better?"}, {"userName": "Aras", "userReviewDate": "Mar 09, 2010", "userURL": "http://www.goodreads.com/user/show/614857-aras", "userReview": "This might have been a decent read if it was half as long. The extremely one-dimensional characters were its undoing. A short list of evil people: the religious, authority figures, anyone working in an office, old people. The good: people who have multiple facial piercings, do drugs, ride around in psychedelically painted vans. I thought I was maybe being oversensitive, but then came the part where her father's co-workers, who otherwise seem to simply be normal people at a small-town insurance office, start openly encouraging him to beat her."}, {"userName": "Valerie", "userReviewDate": "Dec 01, 2007", "userURL": "http://www.goodreads.com/user/show/645956-valerie", "userReview": "Okay. I'm not a reader of horror/suspense fiction and happened across this book as a random pull off the library shelf. It seemed mildly intriguing, but I honestly couldn't make it more than 50 pages into it. The story was sloooow and the dialogue awful! I can't even describe the inane conversations of the characters. And the 'apartment security meeting' was the end of it for me. Explain to me why a man in an apartment building would call his neighbors together at random, suggest forming a watch/guard schedule with no apparent reason, and all the neighbors would agree."}], "description": "\"A rebellious teenager's tense relationship with her father liberates fearsome monsters of English history. Amy Priestly has always dreaded 'the spider house, ' as she privately calls the abandoned Nazareth Hill monastery. When she and her father, Oswald, move into an apartment in the newly gentrified 'Nazarill, ' her fears are reinforced by the building's gloom--crawly things seem to crouch in its shadowy hallways. Worse, her father is becoming increasingly tyrannical\".--\"Publishers Weekly\".", "title": "Nazareth Hill", "url": "https://www.goodreads.com/book/show/32470.Nazareth_Hill", "average": 3.57, "cover": "https://images.gr-assets.com/books/1388838256l/32470.jpg", "reviews": 49, "authors": [{"url": "https://www.goodreads.com/author/show/18253.Ramsey_Campbell", "name": "Ramsey Campbell"}, {"url": "https://www.goodreads.com/author/show/4662136.Daniele_Bonfanti", "name": "Daniele Bonfanti"}], "type": ["Horror", "Fiction", "Novels", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/32470.Nazareth_Hill", "http://www.goodreads.com/book/show/20095319-nazareth-hill", "http://www.goodreads.com/book/show/16093667-nazareth-hill", "http://www.goodreads.com/book/show/20334077-the-house-on-nazareth-hill", "http://www.goodreads.com/book/show/930141.Nazareth_Hill", "http://www.goodreads.com/book/show/28492553-nazareth-hill", "http://www.goodreads.com/book/show/930142.The_House_on_Nazareth_Hill", "http://www.goodreads.com/book/show/218637.The_Hungry_Moon", "http://www.goodreads.com/book/show/32462.Alone_With_the_Horrors", "http://www.goodreads.com/book/show/1771074.Cold_Print", "http://www.goodreads.com/book/show/362904.Ancient_Images", "http://www.goodreads.com/book/show/201588.The_Doll_Who_Ate_His_Mother"]}