{"ratings": 6514, "userreviews": [{"userName": "Zoë", "userReviewDate": "Dec 18, 2017", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "4.5/5"}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "Middle Grade is NOT my genre. I'm usually always disappointed but I keep trying just in case... and this book made it worth it! I mean... there's literally a giant talking cat!I'll continue the series!"}, {"userName": "Mary Urban", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/6935002-mary-urban", "userReview": "Great. Now I have to wait with bated breath for my Hogwarts letter AND Wundrous Society invitation to arrive? One was hard enough, two is just unfair."}, {"userName": "Lola  Reviewer", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "4 1/2 stars. This could be the beginning of a new series phenomenon. What do you say, Jessica Townsend? Are you ready for it?Morrigan Crow was born to die on her eleventh birthday. She is cursed. But an invitation to the elusive Wundrous Society changes her destiny. She needs to pass challenging trials that will determine if she has it in her to be part of something bigger than herself and join the elite group. But everyone seems to have a talent, something that makes them… magical. Except her. Will she find it before it’s too late? Either she becomes part of the secret organization, or she dies. Jessica Townsend knows what readers want. She knows we need to be hooked and surprised and mystified. Being hooked is easy, as the world building is special, like a cake with multiple layers. You think you’ve tasted it all, only to discover there are more hidden flavours.I’m one for competitions, so the trials had me going. They are extremely concealed, until it’s the right time to disclose what the children will need to do. Having read the book, I can tell you they are not predictable, hence the surprising factor. As with any book, if we already know everything, there is little use to keeping on reading. The characters have secrets. The Wundrous Society itself is a mystery. Even now, I feel as if I’ve only been privy to 5% of its mysteries, at most. I don’t know if it’s a sort of school or spy society…It’s killing me, of course, but it’s also making me die to pick the sequel up, which is the ideal reaction after finishing a book. Jessica Townsend did that to me. It’s when you’re ready to cry at the idea of a book not having any sequels that you know it made its mark on you. Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Melanie", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/3030788-melanie", "userReview": "I read this so slowly, and I kept having to put it off for other books, but I ended up loving this more than I have words for! RTC probably next week, but hopefully sooner! (Life is hectic currently, friends!) <3Blog | Instagram | Twitter | Tumblr | Youtube | TwitchBuddy Read with Sue & Lourdes! ❤Readalong for the BooktubeSFF Awards which is being hosted by:🌑 Samantha from Sam's Nonsense🌒 Frankie from Frankie Reads🌓 Kaitlin from Kitty G🌔 Rachel from Kalanadi🌕 Thomas from SFF180🌖  Connor from Connor O'Brien🌗 Sam  from Thoughts on Tomes🌘 Chelsea from TheReadingOutlaw🌑 Elena from Elena Reads Books"}, {"userName": "Riley", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/23179211-riley", "userReview": "me: i don't really like middle gradeNevermoor: hime: talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before"}, {"userName": "Phrynne", "userReviewDate": "Feb 14, 2018", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "The Trials of Morrigan Crow is one of those middle grade children's books which is still perfectly readable by adults who like fantasy. I loved it.Jessica Townsend introduces her magical world by saying little but showing lots - just the way it should be done. There's a wonderful talking cat and a hotel which creates itself according to the resident's needs and desires. There are dragons and dragon riders. There are witches and people who can perform amazing tasks. And there is much more!All of the characters are delightful especially Jupiter and Hawthorne. Morrigan Crow herself shows tremendous promise of good things to come in future books. The story is excellent and is complete in this book but with plenty of hints about what is to come.And all of this was well written, nicely paced and thoroughly enjoyable. Five stars for this first episode in the series and I look forward to much more."}, {"userName": "Brenda", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/2337007-brenda", "userReview": "Born as a cursed girl destined to die on the night of her eleventh birthday, Morrigan Crow was resigned to the fact that it was her fault whenever things went wrong. But as the hours crept toward midnight, Morrigan was rescued – whisked away in an unusual vehicle by a total stranger. Jupiter North was her saviour, and patron, and their arrival in Nevermoor, a magical place which had Morrigan enthralled, felt like a dream.Hotel Deucalion was to be her home; it was where Jupiter lived – in fact he owned the charming hotel – and also where the Magnificat, Fenestra resided as head of housekeeping. Fen was a grumpy cat, but she had a heart of gold if one could find it in all that fur. But it was the news that Jupiter expected Morrigan to participate in four tough trials over the coming year, to the end of joining the Wundrous Society, a prestigious and coveted group of people in Nevermoor, that terrified Morrigan. Five hundred children would enter – only nine would be chosen. But though Jupiter told her she was safe in Nevermoor, she wasn’t sure she was. The black-smoke hounds would be baying for her if she failed – her terror was never far from the surface.Nevermoor, first in the Nevermoor series by Aussie author Jessica Townsend is absolutely, breathtakingly brilliant! Fantastical, clever, imaginative, magical – I was riveted, unable to put it down. The author is destined to go a long way in my opinion – and this is her debut! I love the cover – the look on Morrigan’s face as first one, then another leapt from the building with their special umbrella after uttering the words “Step Boldly”. I was thrilled to see book two will be released in 2018! Can’t wait to catch up with Morrigan, Jupiter and the rest of the Nevermoor family! Highly recommended.With thanks to Hachette AU for my copy to read and review."}, {"userName": "Anne Goldschrift", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/13592607-anne-goldschrift", "userReview": "Oh mein Gott, ich LIEBE dieses Buch!!! ❤❤❤"}, {"userName": "Sara (sarawithoutanH)", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/7397330-sara-sarawithoutanh", "userReview": "Ok, I'm gonna have to rethink my \"I don't like middle grade\" stance. This was beautiful and perfect and I need the next book ASAP. It's so creative and special and I just can't find enough nice things to say about it."}, {"userName": "Ian", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/6703235-ian", "userReview": "There is more than just a little of Harry Potter in this book and I still don't quite know what I think about that. I love the world the author is creating, but those similarities make me uncomfortable. Having said that, The Trials of Morrigan Crow is a debut and I guess debut novels often reflect the author's influences. And the story really is magical. I believe 20th Century Fox have snapped up the movie rights to it already after only one book."}, {"userName": "Amber Robertson", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "THIS REVIEW AND OTHERS FEATURE ON MY BLOGR A M B L EA big thing about me is that I love middle grade. Percy Jackson is one of my favourite series ever and I adore Harry Potter. So, with Nevermoor being marketed as ‘Harry Potter meets Alice in Wonderland’ I was pretty excited, obviously. When I went to buy the book the lady who served me told me how the author had grown up and went to school in an area I had lived during my younger years. My mum actually taught at the swimming pool that is next to the high school of the author.That’s all irrelevant though. I was just really excited to read this, especially after all the marketing I saw for this book. Thankfully, it wasn’t a letdown. This is a wunderous (little book joke) book that kept me gripped every page. It was magical and it was hilarious. It has the magic elements from Harry Potter and the humour from Percy Jackson. I was stifling giggles every other page. It was honestly a shock since the main character is eleven in this book.There are of course tropes featured throughout this book, but I believe they’re executed well and in a way that leaves you giggling. It’s important to take into consideration that this is a middle-grade novel, and a lot of my readers I presume are out of that age bracket so this book isn’t exactly targeted towards you. Whenever I read books like Nevermoor I’m always careful to picture I am one of my younger cousins reading this.I really think this book will be the next Harry Potter. Big claim, but it truly is the Harry Potter of the upcoming generation. I may be a tad bias though, the author is Australian and I’m doing my best to support Australian authors!P L O TMorrigan Crow is cursed. That may seem like an exaggeration, but nope, she is straight up cursed. Ultimately meaning that any shortcomings that happen to anyone in her particular town are blamed on her almost instantly. In addition, her father tends to treat her quite terribly due to the amount of money he has had to pay in order to right Morrigan Crow’s wrongs.The thing with cursed children though is that when their 11th birthday rolls around they die. It’s pretty damn morbid. Morrigan’s 11th birthday is fast approaching when it is suddenly her time up, a bit early too. Thankfully, at the right moment, an offer appears and an opportunity within a quirky man named Jupiter. Jupiter takes her to Nevermoor and has given her the opportunity to fight for a prestigious position in The Wunderous Society.The plot was crazy. Honestly, there wasn’t a dull moment. I found it paralleled Percy Jackson in that way. I read a few reviews saying that was similar to Harry Potter, but there were certain parts of Harry Potter I personally found dull. Nevermoor never had me once feeling that way! The twists and turns that Jessica Townsend managed to incorporate left me shocked and having to lift my jaw from the ground.C H A R A C T E R S#M O R R I G A N C R O W Morrigan Crow, our main character, was damn hilarious. The girl didn’t know when to hold her tongue and came out with the most hilarious things. I am basically speechless with how much I enjoyed her character. I really found her similar to Percy Jackson (I know the book isn’t even compared to Percy Jackson in the marketing, but oh well) with her snark which I definitely enjoyed since I’m just itching to do another Percy Jackson re-read.Her reactions were so genuine as well. Her childlike glee and confusion were very well written, if not a tad obvious due to the book being a debut. I am honestly so excited to see how she ages and grows throughout the series, especially since we’ll be seeing this particular series on the big screen soon.It is important to remember throughout the book that she is eleven and that her decisions may seem childish because…well…she’s a child. Super shocking, I know.O V E R A L LOverall, this may not be the book for you but you may have a young child in your family who is just getting into chapter books and this is the book for them. Pick it up as a Christmas present for them and maybe give it a quick scan, you may be surprised by how much you actually enjoy it!"}, {"userName": "Monica", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/748566-monica", "userReview": "Oh man this was so charming and so much fun! I loved the world, the characters, and all the twists and turns. Definitely a new favorite series."}, {"userName": "Carolyn", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/19559507-carolyn", "userReview": "Such a clever, imaginative novel that will delight readers young and old. Full of magic and wonder (or more correctly Wunder), it tells the tale an 11 year old girl, Morrigan Crow, whisked away from a repressive life where her death is impending and foretold, by a delightfully quirky red haired man, Captain Jupiter North, who illegally smuggles her into the magical world of Nevermoor which runs on a magic called Wunder. He has recruited her as a candidate for the Wunderous Society. All she has to do is beat 491 other candidates in a series of trials to be selected as one of nine to be admitted to the society each year. While she waits to take the trials she lives in the fantastic Hotel Deucalion owned and run by Jupiter and a magical, talking giant cat celled Fenestra. The hotel is constantly adapting itself to please its residents. All sorts of delights and discoveries await Morrigan and her new friend Hawthorne, a trainee dragon rider, marred only by dark tales of the evil man called the Wundersmith who has been banished from Nevermoor. An utterly delightful debut novel from a talented writer!"}, {"userName": "Mollie Reads", "userReviewDate": "Dec 30, 2017", "userURL": "http://www.goodreads.com/user/show/29089878-mollie-reads", "userReview": "Wowwww. I have no words. Definitely a 2017 favorite and may be my all-time favorite middle grade. Truly stunned by how perfect this book was. I need more!!!"}, {"userName": "Tanja Voosen", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/5464546-tanja-voosen", "userReview": "Das Buch war nicht komplett perfekt und es gab 2-3 Dinge, die ich nicht so gerne mochte, aber insgesamt eines der besten Kinderbücher, das ich gelesen habe. So eine Mischung aus Harry Potter, die Chroniken vom Anbeginn und Anastasia McCrumpet - also verrückt, originell, witzig, mit viel Herz und abenteuerlichen Elementen. Ich hab das Lesen sehr genossen und freue mich riesig auf den zweiten Band! Die Geschichte solltet ihr definitiv im Auge behalten, wenn ihr sie noch nicht kennt!"}, {"userName": "Carolyn  K.", "userReviewDate": "Nov 06, 2017", "userURL": "http://www.goodreads.com/user/show/19831039-carolyn-k", "userReview": "What in the world... Jessica Townsend's Nevermoor: The Trials of Morrigan Crow had garnered an exceeding amount of praise and recognition throughout news articles, catching my attention as well. From the film rights already sold to a 7-figure deal between major publishers and even being likened to Harry Potter (I mean no I didn't buy it of course, but c'mon don't we readers all get hopeful that the next big thing is finally here?) Nevermoor ignited so much buzz on the web that I had to see for myself if this novel was worth the hype. Most unfortunately, it wasn't. Not even close to it. How to describe Nevermoor? A mash-up of Mary Poppins, Harry Potter, and Hotel Transylvania. I use the Harry Potter card carefully. It is not thrilling, sophisticated, and creative as Harry Potter. I say Harry Potter only because there were similar aspects like how Morrigan is a \"cursed child\" and grows up being very lonely and feared/hated by others. And there are plenty of other scenes that are reminiscent of Harry Potter, which isn't a bad thing, but only is if it feels redundant and unoriginal. Now, I say Marry Poppins because Jupiter North is Marry Poppins much in masculine form. Period. And lastly, I say Hotel Transylvania because Halloweenish characters appear throughout the novel. I cannot express enough how utterly disappointed I am. Nevermoor did not wow me, amaze me, entertain me, impress me, or even amuse me. It did not do the very thing news articles, Goodreads reviewers, and blurbs relentlessly promised: to wow me and us readers. It was a long, jarring flop. Morrigan Crow was one dimensional. She always feels like the background, experiencing everything from afar and not keen to make her own decisions nor ask questions when she needs to. She's not independent nor strong-minded. Jupiter North once again is Mary Poppins. Eccentric, warm hearted, and a mentor to Morrigan. Now, the story lacks conflict and tension. And I've seen and loved plenty of children's novels that have those essential aspects. So the whole book from beginning to end felt like a long, exhausting, and taxing read. It literally drained the energy out of me. The writing wasn't anything special. I believe the writer doesn't know how to write figuratively. It was extremely dry, plain and unoriginal. It didn't help that the main character was almost always in a drab and gloomy mood. Another issue about this book is that the relative location of the characters in a scene isn't described thoroughly. For example, there was a scene where Morrigan went into the elevator with Jupiter, but all of a sudden there were a bunch of people with them and Martha the maid was there. And this happened consistently. Or supporting characters were not described very thoroughly in detail like their physical appearance and personalities. And they felt like placeholders, not unique or charming in any way. It was sometimes very frustrating. Another biggie problem was how the conflicts were solved. Goodness! Trial after trial, Morrigan smoothly passed through all including the climax of the novel by slim needle hole of luck that she'll easily pass through. It was strange and upsetting. None of it felt believable. It didn't support or enrich Morrigan's character. Because she slipped through so easy in all of these \"daring and difficult\" trials and other conflicts, the conflicts didn't feel like conflicts at all. Overall, this novel did not meet up with all the hype. It's actually really mediocre. I still cannot understand how so much praise was given to this novel. There wasn't a deep meaning or theme within the book that could outshine the slow paced, dull plot. This is just a typical children's novel that is easily forgotten."}, {"userName": "Schizanthus", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/52870273-schizanthus", "userReview": "⚠️ Warning: Unpopular Opinion Ahead ⚠️I was so excited about this book but unfortunately I’m in the minority here and couldn’t make it past 36%. There were too many obvious nods to other books so I ended up feeling like I was reading a list of the author’s favourite things. Amongst others, it was as if I were rereading  Roald Dahl,  Harry Potter,  Mary Poppins,  Alice’s Adventures in Wonderland, and possibly rewatching a Gilmore Girls episode, but all mashed up and distorted.I keep going back to it and can’t move on from where I left it. If I ever manage to finish this one I’ll update my review and will grovel to the author for forgiveness if I wind up loving it. At this point though, I just can’t try any more.Thank you so much to NetGalley And Hachette Children’s Books, Australia for giving me the opportunity to read this book."}, {"userName": "Billie", "userReviewDate": "Jul 12, 2017", "userURL": "http://www.goodreads.com/user/show/3915342-billie", "userReview": "Books are constantly being compared to Harry Potter, but rarely do they capture that same sense of charm and discovery and wonder on first reading. I'm not going to say that Nevermoor reaches quite those heights, but it comes really, really close and seemingly without trying. Like a Dahl-ian heroine, Morrigan Crow is unloved and unappreciated by her family because she is a supposedly \"cursed\" child, destined to die at midnight on Eventide and bring bad luck and misfortune to those around her until she does. Just before the moment she is supposed to die, she is swept away to Nevermoor by the mysterious Jupiter North, who has chosen her to be his candidate in the trials to choose new members of the Wundrous Society. Her adventures find her living in a hotel which adapts to its guests and mingling with a cast of delightfully eccentric characters—friends and enemies alike. Full of mischief and magic, friendship and fantasy, secrets and surprises, heroes and villains and those who may be neither or both (including a dwarf vampire vampire dwarf), this first entry in the Nevermoor saga is sure to captivate and delight readers of all ages."}, {"userName": " Li'l Owl ", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/48372551-li-l-owl", "userReview": "It's taken me a while to decide how to review this audiobook. Here's what I've come up with. The Trials of Morrigan Crow by Jessica Townsend audiobook, narrated by is honestly the best book in this genre I have ever listened to! I am so glad I decided to listen to the audiobook rather than read it as I could never have imagined all the inflections and individual voices and accents that each character was given by narrator Gemma Whelan! 5★'sFurther information about narrator ratings can be found at the bottom of my profile page. https://www.goodreads.com/user/show/4...I'm not going to summarize it for you as there are plenty of descriptions to go around. I'm just going to give you a list of some of the words that come to mind when the book came to an end. \nFun. Amusing. Hilarious. Exuberant. Scintillating. Dazzling. Charming. Enchanting. Ingenious. Fascinating.\nThere were many times that I laughed out loud, sometimes until my stomach began to ache and I had to pause the book! This is a real gem! There are plenty of frightening, sinister, and harrowing parts of the story, too, that brought about a sense of danger, anxiety, and foreboding that I experienced along with Morrigan! I made myself listen to this audiobook slowly because if I hadn't I could have easily sat and listened to the entire book in one sitting! More than that, though, is that I just didn't want it to end! Waiting for the next one in the series is going to be excruciating! Fortunately it's coming out in October, 2018!I absolutely know that I will be listening to The Trials of Morrigan Crow again. Many, many more times and never get tired of it! You may think I'm exaggerating but for me, I can't say enough how much I loved and adored this audiobook! Bottom line, all I can really say is LISTEN TO the audiobook The Trials of Morrigan Crow by Jessica Townsend, narrated by Gemma Whelan! YOU WILL NOT BE DISSAPOINTED!I would like to send a special thanks to my very good friend, Brenda, for introducing this book to me. It would have been a big miss if I hadn't known of it. Thank you, mate!"}, {"userName": "Kelly (Diva Booknerd)", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/11177071-kelly-diva-booknerd", "userReview": "Miss Morrigan Crow, daughter of the illustrious Chancellor Corvus Crow will not be mourned as she passes for she has brought misfortune and calamity to the shire of Jackalfax. Morrogan Crow is a catastrophic young lady that has been condemned as unfortunate, spreading hullabaloo and pandemonium throughout the community. On the eve of the Sixteenth Age of the Wintersea Republic, Morrigan receives an intriguing invitation extended by Jupiter North and The Wundrous Society. Her survival and Nevermoor awaits.The Trials of Morrigan Crow is a fantastical, wondrous and whimsical adventure. Eleven year old Morrigan Crow is an unfortunate child and the origin of mayhem who will come to pass on the eve of Eventide. Morrigan is a wonderful young lady, intelligent and whimsical although resignated to accept responsibility for Jackalfax's outrageous predicaments. On the even of Eventide, Jupiter North offers Morrigan salvation, accompany him to Nevermoor to compete in the Wundrous Society tournament. Morrigan is sceptical but intrigued nevertheless and steps boldly into the enchanted world. Throughout the narration, we discover Morrigan is a young woman who has never known a sense of belonging. Her father has remained cold and distant while the citizens of Jackalfax believe Morrigan to be a blight upon their community. In Nevermoor, Morrigan is considered to have entered illegally and the authorities are determined to send her home.Jupiter North is a mysterious, bearded man and a member of the prestigious Wundrous Society. Jupiter is the proprietor of the distinguished Hotel Deucalion, a debutante Patron and Morrigan's guardian. A remarkably diligent man, Jupiter is an integral aspect of Nevermoor and often called abroad on official business. The Hotel Deucalion is home to a wonderfully, eclectic assortment of characters. Fenestra the talking Magnificat, Jack the sullen nephew of Jupiter and a vampire dwarf throughout the wondrous and fantastical floors, the smoking room with scented vapour to ignite the senses, the hall of shadows where imagination will run amok.Competitor and friend Hawthorne is a delight. He and Morrigan become inseparable friends and a tremendous support throughout the competition. The Wundrous Society tournament consists of four stages to assess the children of Nevermoor. Shenanigans are inevitable with hundreds of competitors in contention, deception and terribly treacherous children determined to be victorious. Darkness descends over Nevermoor when the villainous and unpleasant Wundersmith inconceivably is causing pandemonium. Despite being banished.The Trials of Morrigan Crow is whimsical and atmospheric, the epitome of fantastical and imaginative fairytales. Delightfully written and a breathtaking debut from author a Jessica Townsend.Diva Booknerd"}, {"userName": "rachel • typed truths", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/17290119-rachel-typed-truths", "userReview": "The Trials of Morrigan Crow was a magical middle grade story that I know will enchant a whole generation of readers. I went into this story with incredibly low expectations since I rarely trust hype (especially when it comes from publisher-driven marketing) but I fell in love with this world. It was just so whimsical and clever; a blend of Flitterwig and The Paper Magician. Townsend has a natural knack for atmospheric world-building and I loved all the little touches woven effortlessly into the storyline. The Hallowmas and Christmas scenes definitely stick in my mind. They gave me all the warm fuzzy feelings that Christmas at Hogwarts does. The story itself kept me engaged. I flew through this story in no time, despite its length. It was suspenseful and fun, and the pacing was fantastic. I never wanted to put it down. The cast was also completely lovable. Despite having a focus on friendship and a prominent m/f best friend relationship, there was no romance. Thank God! Morrigan was the tiniest bit on the underdeveloped side and I do wish she had had a tiny bit more oomph to her. The secondary characters were such standouts that it didn’t really make much of a difference, though. I absolutely adored Jupiter. I love found family stories so his relationship with Morrigan made me desperately want to reach into the story and give them a giant bear hug. Overall? I was so pleasantly surprised by how much I enjoyed this story. I haven’t been able to stop thinking about it since I finished it and cannot wait to see where the series will go next. Review based on an unfinished review copy and may be subject to change."}, {"userName": "Kate Forsyth", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/3237560-kate-forsyth", "userReview": "I was sent a proof copy of The Trials of Morrigan Crow by the publisher, Lothian Books, as part of a massive publicity drive promising a magical and captivating children’s fantasy novel. The back of my proof copy lists all the advance buzz this book has garnered – publishing rights sold in 28 territories, film rights pre-empted by 20th Century Fox, a ‘multiplatform marketing and publicity campaign like never before.’ I, of course, love children’s fantasy. It’s one of my favourite genres to both read and to write. And I was interested to see if the book lived up to all the hype.The first line is: ‘The journalists arrived before the coffin did.’The opening scene then shows a black-clad man, Chancellor Corvus Crow, reading a statement to a mob of journalists in which he announces the death of his daughter Morrigan and assures them all that – now she is dead – there is ‘nothing to fear.’ Then Chapter One begins, three days earlier, with Morrigan discovering the kitchen cat was dead and that, as usual, she was being blamed. Morrigan is a cursed child, thought to bring trouble and misfortune everywhere she goes. She was born on Eventide, and so is pre-destined to die at midnight on her eleventh birthday – which is only three days away.Luckily Morrigan is rescued on the eve of her death by an enigmatic man named Jupiter North with fiery red hair and a taste for elegant but brightly coloured suits. He whisks her away to Nevermoor, a world in another dimension, and allows her family to think she is really dead. Here she must take part in a series of trials in order to win a place in the Wundrous Society. If she fails, she will be sent back to her own world where nothing but death awaits her. The comparison to Harry Potter is inevitable, and indeed Jessica Townsend has a great deal of the humour, whimsicality and excitement of the first few books by J.K. Rowling. Anyone who has read as much children’s fantasy as I have will recognise many of the tropes Jessica Townsend employs – the unwanted child, the mysterious curse, the hidden world, the secret enemy, the dangerous competition … Jupiter North reminded me of Willy Wonka, the magical umbrella flight parroted Mary Poppins (please forgive me the bad pun), while the battle between Saint Nick and the Yule Queen had strong echoes of the rather startling appearance of Father Christmas in The Lion, the Witch and the Wardrobe. Does it matter? Not a bit. The Trials of Morrigan Crow is brimming over with imagination and fun. Morrigan is a wonderful heroine – dark, moody, and wry – and the unfairness of her situation makes her very easy to empathise with. The story gallops along, and the setting is wonderfully vivid. I can understand why the movie rights have been sold. The scenes are all brilliantly cinematic and the characters – while undeniably one-dimensional – are also fresh and vital. A wonderfully assured debut from a young Australian author, The Trials of Morrigan Crow sparkles with zest, wit and inventiveness."}, {"userName": "K.", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/5663034-k", "userReview": "Trigger warnings: shitty parenting4.5 stars. I actually picked this up at work last year and read the first couple of pages before realising that I was 100% not in the mood to read a middle grade book (I'd just finished rereading all of Harry Potter). This time around, however? I was hooked. It's magical and utterly fantastical from start to finish. The world is beautifully painted, the characters are delightful, and I felt for Morrigan and her terrible parenting situation. My one gripe here is that the constant comparisons to Harry Potter meant that I was LOOKING for similarities and any time I found them, I sighed a little. So shout out to the publisher for not letting this stand on its own merit. Which it totally could have done. Still, this was great from start to finish and I'm very much looking forward to the next one."}, {"userName": "Roy", "userReviewDate": "Dec 04, 2017", "userURL": "http://www.goodreads.com/user/show/38117634-roy", "userReview": "Read this in a sitting. Love it. Its been marketed as the next Harry Potter. I think thats unfair as it's only similarity is that they both have main characters who get exposed to a hidden part of their world. Morrigan Crow is a girl who seems to be cursed and on the strike of midnight will be dead. Fortunately a man by the name of Jupiter North whisks her away to Nevermoor where the fun and trials begin. Wonderful imagination, great fun characters and original plot. I feel like this will be a series kids and adults will devour for years to come. Yes its YA or even younger but I do believe adults will find it a great read. Has great messages and themes throughout which adults would love but kids would gain from reading this. Cannot wait for the next in the series."}, {"userName": "Драгана", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/14055385", "userReview": "Ako se po prvoj pročitanoj knjizi godina poznaje, ovo će biti jedna fantastična godina! Prilično sam skeptična kada na knjizi piše \"za ljubitelje Hari Potera\", ali ovaj put su bili potpuno u pravu! Sve vreme čitanja sam imala slične one leptiriće u stomaku, koje sam imala pre dvadesetak godina! Nemojte misliti da je ovo neka kopija knjiga o mom omiljenom čarobnjaku, osim što je i ovo priča o prijateljstvu, porodici (koja nam nije krv) i zlom Čudovnjaku. Uvek sam imala problem da pišem o knjigama koje su mi se dopale, sve što bih rekla je divna je, divna je, divna je! I to je sve što ću za sada reći ❤️"}, {"userName": "Rachel (Kalanadi)", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/17810287-rachel-kalanadi", "userReview": "This was tons of fun and I really liked the characters. I imagine this is compared to Harry Potter all the time, but it's definitely doing its own thing too."}, {"userName": "Michael", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/5143619-michael", "userReview": "When it comes to hype the debut novel by Aussie author Jessica Townsend is right up there. With comparisons to a certain boy wizard a-plenty and a film deal, this debut is riding that train all the way. Thankfully this is a story that deserves all the buzz it is getting and more in what is charming and magical reading that is an early contender for my book of the year.Morrigan Crow is a little girl who due to being born on an unlucky day is cursed. Blamed for all the misfortune were she lives Morrigan lives an unhappy existence and due to her curse will die at midnight on Eventide. Consigned to her fate, Morrigan will be shocked when a mysterious man named Jupiter North appears wanting her to join him back to the magical city of Nevermoor.This is a place like no other featuring Hotel Deucalion, that seemingly has a life of its own, the giant Magnifi-cats and the mind-bending Wunderground transport system that gives the world a mystical quality. To be a part of the prestigious Wundrous Society Morrigan must complete four trials as she is pitted against hundreds of talented children. Will she overcome her doubt and discover her true talent or knack as it is called in Nevermoor or will she face the humiliation of fail and have to return home to an uncertain future?In a way Nevermoor: The Trials of Morrigan Crow does have the same cliches that dog many a children's fantasy read with samey plots and similar characters, but due to some brilliant plotting, quirky humour and a main protagonist who is both courageous and vulnerable we have a glorious adventure full of magic that will appeal to anyone who loves creative storylines and I for one can't wait for October when the second book is released."}, {"userName": "Trudie", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/4617856-trudie", "userReview": "Ah, I really don't know which way to jump on this one. Do I do another rant about the insidiousness of the marketing machine pushing works by debut authors, hoping to discover another J.K Rowling ? ... I could but I won't.The first thing to note is I am not the target audience for this particular book and that while I like Harry Potter I am not fanatical about it. I found this one, at best, quite pleasant, a fairy floss of a children's book, with charming characters, giant cats, brolly-rail and an arduous series of TRIALS -just like in all good fairy tales. The strength here lies in the characters and in certain clever imaginative elements. What didn't work was the world building, or rather world-explaining. I really dislike having to accept another book with a single Voldemort-like evil man and a world that appears to run on a Philip Pullman-like \"Dust\" phenomenon called Wunder. It seemed vague, it seemed lazy. I can't decide if the author is paying some kind of homage to all the books she enjoyed as a child, or if she is earnestly trying to write the next Harry Potter but the similarities are pretty glaring and this book suffers by the comparison.However, this is a solid debut, writing-wise, and I would imagine little readers will love this and unlike me, will not be trying to compare it to superior books they likely have not yet read. ( This is all sounding like a grumpy lady reading a children's book, so it's back to books for my age group now ;)"}, {"userName": "Tabea Vanessa", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/65270909-tabea-vanessa", "userReview": "Wow! That was really something.First of all I want to address the „Harry Potter“ comparison this book constantly seems to get. This is in absolutely no way Harry Potter. Don’t compare it to the greatest and most successful book series ever. It has a different world, a different plot, different characters and different writing. If you loved Harry Potter, it will not automatically mean that you will love Nevermoor. What it does have though is the feeling. The feeling you get when you first open a Harry Potter book and read the first sentences. The first hours when you discover a character in such a magical world that is so precious and special and you just know it will stay with you for the rest of your life. The feeling I thought I would never ever get in my entire life because I read Harry Potter 20 years ago and nothing ever came close to giving me this.Nevermoor is exactly that. You read the first pages and you know it’s something special. It’s one of the „Once in a generation“ adventures that you will never forget. It is so incredibly creative. The world building is divine. While you get an intense amount of information, it feels very naturally integrated in the writing. The wonderful characters experience a lot of things for the first time as well so it’s easier to follow. And my is the world fantastic!! I don’t even know how to describe it. The characters are funny, smart, flawed, scared, lonely, everything. And so well developed. The writing was, next to the world, my favorite part though. Oh how I loved the dry sarcasm! I laughed out loud countless times. In public. On a train. In Berlin. I don’t care, this book had hilarious discussions.I cannot recommend this book to you highly enough. It is everything I never knew I needed."}], "description": "A cursed girl escapes death and finds herself in a magical world - but is then tested beyond her wildest imaginationMorrigan Crow is cursed. Having been born on Eventide, the unluckiest day for any child to be born, she's blamed for all local misfortunes, from hailstorms to heart attacks--and, worst of all, the curse means that Morrigan is doomed to die at midnight on her eleventh birthday.But as Morrigan awaits her fate, a strange and remarkable man named Jupiter North appears. Chased by black-smoke hounds and shadowy hunters on horseback, he whisks her away into the safety of a secret, magical city called Nevermoor.It's then that Morrigan discovers Jupiter has chosen her to contend for a place in the city's most prestigious organization: the Wundrous Society. In order to join, she must compete in four difficult and dangerous trials against hundreds of other children, each boasting an extraordinary talent that sets them apart - an extraordinary talent that Morrigan insists she does not have. To stay in the safety of Nevermoor for good, Morrigan will need to find a way to pass the tests - or she'll have to leave the city to confront her deadly fate.", "title": "Nevermoor: The Trials of Morrigan Crow\n      \n          (Nevermoor #1)", "url": "http://www.goodreads.com/book/show/34219873-nevermoor", "average": 4.43, "cover": "https://images.gr-assets.com/books/1518550365l/34219873.jpg", "reviews": 1653, "authors": [{"url": "https://www.goodreads.com/author/show/16727429.Jessica_Townsend", "name": "Jessica  Townsend"}], "type": ["Fantasy", "Childrens", "Childrens", "Young Adult", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/34219873-nevermoor", "http://www.goodreads.com/book/show/33276673-nevermoor", "http://www.goodreads.com/book/show/38464252-fluch-und-wunder", "http://www.goodreads.com/book/show/35560263-the-trials-of-morrigan-crow", "http://www.goodreads.com/book/show/34219898-nevermoor", "http://www.goodreads.com/book/show/36577609-the-trials-of-morrigan-crow", "http://www.goodreads.com/book/show/37783301-isku-enje-morigan-vrane", "http://www.goodreads.com/book/show/35902133-nevermoor", "http://www.goodreads.com/book/show/36260006-wundersmith"]}