{"ratings": 36412, "userreviews": [{"userName": "Angela M", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/4685500-angela-m", "userReview": "I don't know why I didn't give this 5 stars to begin with but I have now . Every once in a while a character comes along that leaves that indelible mark on my heart that will make me think about them for a long time and think that if this were a real person, I'd want them in my life. Captain Jefferson Kyle Kidd (Kep-den) is one of those characters as is Johanna (Chohenna). It's 1870 in Texas and after his service in the wars, he's a News a Reader going from town to town reading the news of the day to anyone who will pay a dime to hear it. A widower with two grown daughters, this is his life until he takes on the challenge of escorting ten year old Johanna to her surviving relatives 600 miles away. Johanna has lived with the Kiowa Indians for four years after they kidnapped her and murdered her family . So this becomes an arduous journey with this little girl who speaks no English and is defiant in keeping her identity as a Kiowa. It becomes more than just a journey of the miles but one of emotions from Johann's fear and the Captain's doubts until a bond forms and they become friends, then like a grandfather and granddaughter, and partners against the loathsome men they meet along the way. I held my breath at times , cried and laughed as it becomes a journey of the heart. I really don't want to say much more because I urge you to read this beautiful story yourself. The writing and the story held me from the beginning to the end. This will most certainly be one of my favorites for the year and once you read this book it will become clear why it has been nominated for The National Book Award. Kudos to Paulette Jiles.  Thanks to William Morrow/HarperCollins and Edelweiss."}, {"userName": "Will Byrnes", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/1526851-will-byrnes", "userReview": "The Latest News and Articles from the Major Journals Of The Civilized Word Captain Jefferson Kyle Kidd Will Read a Compendium From Selected Newspapers At 8: 00 P.M. At The Broadway Playhouse\nCaptain Jefferson Kyle Kidd is in his early 70s. He sports a shock of white hair as evidence, but possesses a commanding stature and presence that make him seem years younger. Kidd makes a living as an itinerant newsreader. He visits places far removed from civilization, in this instance northern Texas, and reads to the locals newspaper items from around the world. No internet in 1870. Just as the news today has to take care about stepping on toes, Kidd must employ a keen sense of the crowds who come to hear him for ten cents a pop, informing his decisions on what stories might delight and educate and which ones might prompt a riot. He has begun to find his life thin and sour, a bit spoiled. While making his rounds he is approached by Britt Johnson, a freighter (materials hauler), and his crew. Britt (who appears in other Jiles work) leads him to a ten-year-old girl. She is unnervingly still.  I am astonished, he said. The child seems artificial as well as malign. And thus begins a beautiful friendship. Paulette Jiles - from Harper Johanna Leonberger had been abducted four years earlier, at age six, when a Kiowa raiding party slaughtered her parents and sister. She had been taken in by Turning Water and Three Spotted, regarding them as her real parents. She speaks Kiowa but no English. Her aunt and uncle had offered a considerable sum for her to be found and returned. Britt took care of the obtaining part, but a black man transporting a young white girl to southern Texas, where the end of slavery was not entirely accepted, seemed a risk too far. Kidd obliges and takes on the task of restoring the girl who calls herself Cicada to her biological family.This is a road trip of self-discovery, or some sort of discovery. Kidd slowly tries to gain Johanna’s trust, no mean feat, and see her safely home. There are challenges along the route, of course, brigands, morons, white slavers, unfriendly natural elements, the usual. What is magical here, and I do mean magical, is the growth in friendship between the old man and the young girl, as she slowly sees his kindness and wisdom and he sees her strength, intelligence and character. The language Jiles uses for expressing Johanna’s growing grasp of English is distilled delight.The other great treasure to be found here is the portrait of a time and a place. A frontier with an actual front, during the transition from Native American control to ouster by Europeans. Jiles offers a compelling look at the challenges faced by the invading whites (hostile locals, for one), without turning a blind eye to the challenges faced by the dispossessed people. She also offers appreciation for the culture from which Johanna had been taken. Jiles uses a few methods to mark the trail the unlikely pair follows. Birds are used liberally, as are descriptions of local landscape and fauna. You are there. The color blue is applied frequently, but I do not know if that is for a particular purpose. You’d better call United Van Lines. You will be moved. It was all I could do to keep from sobbing aloud on the G train on an autumnal (finally) early morning in November. Maybe I could pretend it was the cool air that raided the car whenever doors opened at each station that was making my eyes leak. Yeah, I’m gonna go with that. But for those of you short on ready excuses, you might want to finish this book at home. Tissue box locked and loaded.So, not only is this book information-laden with period detail, not only is this book incredibly moving, but it is written with surpassing beauty and sensitivity. It is truly amazing that News of the World weighs in at only a little more than 200 pages, at a word count of about 56K. Don’t be fooled. This is definitely a case where size does not matter. I have no doubt that NotW will find its way onto 2016 top ten lists aplenty, meriting consideration for major awards, and deservedly so. For me, at least, this is the first GREAT book of the 2016. Don’t miss it!Publication Dates ----- 10/4/16 - hard cover-----6/20/2017 - trade papeReview posted - 12/3/15 =============================EXTRA STUFFThe author’s personal websiteA Wiki page on \tthe KiowaJiles recommends The Captured by Scott Zesch for a closer look at the experience of returned captives/ September 15, 2016 - News of the World is named to the long list for the National Book Award. Congratulations!October 6, 2016 - News of the World is named to the short list for the 2016 National Book Award for Fiction - Brava!October 12, 2016 - a dazzling review by Janet Maslin in the NY TimesNovember 14, 2016 - News of the World is named to the KIRKUS list of the Best Historical Novels of 2016An Aside – As with Sweet Girl and True Grit this book features an older man trying to help out a young girl. I am aware of no particular category for this, so will offer up a suggestion. SMYF, pronounced “smiff” (cockney for Smith?) for Senior Male Young Female. I know it might conjure inappropriate associations with other acronyms of a sexual nature, but it was the best I could come up with. Sometimes words fail me. I am open, very open, to something better. It wouldn’t take much. Help me out here, folks. Please. If there isn’t a better title for what is certainly a sub-genre of the road-of-self-discovery type, or the bildungsroman, I’m not an oversized Mic. SMYF no more. With Sandra's rec in comment #1, I am throwing my support behind OMYG, unless someone comes with something even better."}, {"userName": "Brina", "userReviewDate": "Oct 29, 2016", "userURL": "http://www.goodreads.com/user/show/2933855-brina", "userReview": "It is 1870. Reconstruction era Texas is governed by a combination of outlaws and bandits and bordered on by Native Americans. Enter Captain Jefferson Kyle Kidd. A veteran of three wars, he uses both his position as a war hero and Texas' isolation from the rest of the country to travel around the state giving readings of the News of the World. Such commences Paulette Jiles short yet poignant novel. While giving one of his readings in Witchita Falls, Kidd encounters Britt Johnson, a freed slave. Johnson has with him ten-year-old Johanna Leonberger who had been held captive by the Kiowa tribe for the past four years. The puppet government issued a fifty silver piece for whoever returns her to her family near San Antonio. Johnson suggests Kidd because he is familiar with terrain and because he raised daughters. Although content as a widower, Kidd could use the money and after little deliberation agrees to transport Johanna home. Johanna, however, believes she is a Kiowa. Having lived with them for the past four years, she has adopted their way of life and forgotten the English and German she was raised with. On their journey, Kidd is entrusted with teaching Johanna how to live like a proper white girl all over again. It is through these interactions and traveling in close quarters in a covered wagon that their relationship grows. Johanna little by little learns to trust Kidd, earning him the title of Kontah (grandfather). Over the course of their trip, she even attempts to speak a rudimentary English. Jiles is a new author for me, but in this novel she has reminded me why I love historical fiction. She has taken a little talked about time period- post reconstruction Texas- and created memorable characters within that framework who I will think about for awhile. Additionally, through Kidd's readings and their encounters on the road, we are given the important news stories of the time, allowing this story to contain a larger historical framework. Although Jiles may be a new author for me, she has written other novels and a memoir, mainly about post Civil War Texas. News of the World has been short listed for the National Book Award and is deserving of the honor. I have read many powerful novels which came out this year, and News of the World is in the upper echelon. A powerful story with memorable characters, I highly recommend this novel to those looking for a good story."}, {"userName": "Jen", "userReviewDate": "Jan 14, 2017", "userURL": "http://www.goodreads.com/user/show/27709782-jen", "userReview": "Magnificent. I was rendered speechless upon finishing. Needed time to dry my tears and gather my thoughts.What an adventure this was to read.Captain Kidd is a seasoned man who reads the world news to towns and village folk in 1870. An ambitious illusion he has created in the hopes of bringing peace - at least for a few minutes - to the civil war torn Texans.Now at the ripe age of 72, he has been given the daunting challenge of returning a 10 year old girl to her family after having been kidnapped for 7 years by the Indians. What transpires is a journey through Texas and an endearing relationship that develops between Kidd and Jo-Hanna.Thank you GoodReads for this terrific win in GR Giveaways. It's a beautiful hard copy with deckled edges. 5*****"}, {"userName": "PirateSteve", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/46000051-piratesteve", "userReview": "Try not to mourn the demise of Penelope and Amelia. \"Iss the song and the sigh of the willy\" and laff-ter is so good for the soul. Weather you measure time with a gold watch or the click, click, click sound of a broken wheel... Spend as much time as possible with someone that you love, someone that you trust, someone that you can trust with your love.And that's what Captain Kidd and Johanna the savage have done. If we are lucky, it all comes quickly between those people so deserving of it. May it be that way with you."}, {"userName": "Elyse", "userReviewDate": "Dec 18, 2015", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "The year is 1870. The Civil War has ended. \"News of the World\" is a heartfelt story. A young 10 year girl, Johanna, gets introduced to Captain Kidd, in Wichita Falls.Their relationship together - and their journey together is genuinely beautiful!The author, Paulette Jiles wrote this story with so much depth, and passion, it takes your breath away. This story will restore your faith in historical fiction - should you ever have had any doubt about this genre. Captain Kidd, an aging war veteran - of several wars, sold his printing business in San Antonio, Texas, after his wife died, bought a horse to use as his transportation....then travels around the state of in Texas. He reads the the newspapers from city to city -- for a dime. The towns are small...news travels slow.He is offered $50 to bring Johanna to her only remaining family near San Antonio. ( an aunt an uncle). Johanna has already seen extreme malice in her young life. The Kiowa tribe killed her parents, and sister, when she was 6 years old, then captured her. Johanna's pulled away to live with the Kiowa tribe - knows no English and only speaks Kiowa. In her own way..this lost child, and somewhat a wild rebellious child, needs to find a way to survive - rebuild a life and find her own place in the world. Captain Kidd is wants to keep her safe. Their travels are rough...even dangerous..traveling 400 miles south. I worried for both Johanna and Captain Kidd, and not only because of the difficulty they faced, but emotionally. They were both brave and humble, and impossible not to love them both! A vibrant beautiful story -real characters of the old west...exquisitely written. Thank You very much to the HarperCollins Publishers for mailing me a copy of this novel. The physical book -size in my hands- and gorgeous book cover completes the experience of the words within. Lovely!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Nov 29, 2017", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I would never have read this book if it wasn't for one of my groups pick for a badge. I thought it was really sweet. The story of a man and a little girl. Bittersweet and brought a tear to my eye. A happy tear. Enough said. Mel 💕"}, {"userName": "Candi", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/3639005-candi", "userReview": "\"He had the appearance of wisdom and age and authority, which was why his readings were popular and the reason the dimes rang into his coffee can. When they read his handbills men abandoned the saloon, they slipped out of various unnamed establishments, they ran through the rain from their firelit homes, they left the cattle circled and bedded beside the flooding Red to come and hear the news of the distant world.\"Seasoned war veteran Captain Jefferson Kidd traverses post-Civil War north Texas reading the news to a people eager for communication with a world from which they seem so far removed. 1870s Texas is a land of outlaws, tribal warfare and governmental instability. Once a spirited husband, father and contented owner of a printing press, Captain Kidd is lately feeling a bit dissatisfied with life perhaps. \"A slow dullness had seeped into him like coal gas and he did not know what to do about it except seek out quiet and solitude.\" All that changes when he is given a $50 gold piece in exchange for returning a Kiowa captive to her San Antonio relatives. Life becomes anything but peaceful and solitary as Captain Kidd begins a 400-mile journey through Texas with Johanna, his ten-year-old charge. This will be no easy task as Johanna, who was orphaned and kidnapped by the Kiowa at the age of six, remembers nothing of her former family, her language or her culture. She is now wholly Kiowa. My heart ached for this little girl who had been torn from those she considered family not just once, but now twice in her short lifetime. She yearns to return to her people, the Kiowa. She cares not at all for the white man’s world. \"She was shouting for her mother, for her father and her sisters and brothers, for the life on the Plains, traveling wherever the buffalo took them, she was calling for her people who followed water, lived with every contingency, were brave in the face of enemies, who could go without food or water or money or shoes or hats and did not care that they had neither mattresses nor chairs nor oil lamps.\"Not one to shirk responsibility, despite any misgivings he may have, Captain Kidd meets the challenge head-on and what follows is a journey that will make you laugh and cry, and will set you on the edge of your seat with apprehension for the dangers these two may encounter along the way. We learn so much about the Captain as he muses on his life as a soldier, as a husband, and as a father to his now-grown daughters. I admired this man as he tried to overcome the language barrier and develop his own special communication with Johanna. Their interactions with one another are so very touching. Johanna will need to place her trust in this man who is now all that she has in this world as she travels through this treacherous landscape without the protection of her tribe. Much is revealed about the truly honorable character of the Captain as we read about his interactions with the various people he meets along the way and as he continues to deliver the news in order to earn a dime-a-head.News of the World is historical fiction at its finest. Learning about the condition of Texas after the Civil War and getting a glimpse of the world at large through the Captain’s readings are just two reasons why I enjoyed this so much. I loved this book for the excellent storytelling ability of Paulette Jiles, for the sense of adventure, for the feisty spirit of Johanna, and most of all for the truly memorable and endearing Captain Kidd. I highly recommend this one!\"Maybe we just have one message, and it is delivered to us when we are born and we are never sure what it says; it may have nothing to do with us personally but it must be carried by hand through a life, all the way, and at the end handed over, sealed.\""}, {"userName": "Diane S ☔", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "This book dang near broke my heart...... but in a good way and solely due to the authors expertise in creating two wonderful characters with a unique relationship. captain Kidd, travels Northern Texas as a news reader, in post Civil War, Texas. He is offered a tidy sum to deliver a young girl who was captured by the Kiowa Indians when she was six, the rest of her immediate family killed in the raid.. Now ten she is traded back and needs to be returned to her aunt and uncle, her only surviving relatives. Johanna, wants only to be returned to her Indian tribe, her adopted Indian parents and remembers little about her early life.So they travel together, four hundred miles, and a relationship unlike any other is formed. Endearing, adventurous, descriptive writing, amazing dialogue, much humor, all the things that make a novel so good. The Captain doubts the wisdom of returning Johanna, but he is an honorable man and this is his charged duty. But is that the wisest decision? So this is what we keep reading to find out and along the way we meet many scoundrels, heroes and people who judge without understanding. Just one of those fantastic stories that the reader can't help but take to heart and have a great time along the way.ARC from William Morrow publishers."}, {"userName": "Annet", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/1166369-annet", "userReview": "To comfort himself and slow down his mind he thought of his time as a courier, a runner, and Maria Luisa and his daughters. Maybe life is just carrying news. Surviving to carry the news. Maybe we have just one message, and it is delivered to us when we are born and we are never sure what it says; it may have nothing to do with us personally but it must be carried by hand through a life, all the way, and at the end handed over, sealed. Beautiful, beautiful book! Tender and poetic, emotional. Great story, beautifully written, great characters, Captain Kidd ('Kep-dun'/Kontah) and the young girl Johanna, captured by the Kiowa Indians and freed, and their trip through the dangerous territories of US after the Civil War to return Johanna to her relatives, and being witness to the growing and loving bond between the old man and the young girl, it deserves a big 5 stars. Brought tears to my eyes and yes... when that happens.... it's almost certainly a five star ;-). More to follow and... highly recommended. Deserves book of the year title of Goodreads in the history category for sure!Note: just went in to vote and see it isn't in the shortlist history any more, such a pity, bit sad about it actually...."}, {"userName": "Iris P", "userReviewDate": "Jan 12, 2017", "userURL": "http://www.goodreads.com/user/show/2641948-iris-p", "userReview": "News of the World★★★★★ 5 Stars!*******************************************Once in a while readers of fiction can hope to experience this series of fortunate events:\n\nA friend recommends a great book ➜ Your mindset happens to be ideal for said book ➜ You love the story = Literary bliss ensues!!\n\n It is a little hard to admit that I almost allowed my preconceived expectations get in the way of discovering this remarkable novel. Let's just say that News Of The Word, a novel marketed as a \"western\", was definitely not at the top of my TR pile this year. So first of all, allow me to humbly acknowledge how very mistaken I was! (On that note, I big shout-out to GR friend Karen for persuading me to read this, thanks Karen!)It is undeniable that we are currently living in deeply divided political times in America, but Reconstruction Texas, the historical setting of this novel, certainly helps to put that notion in context. Texas in the 1870's is a place of anarchy, the state is once again out of the Union as the old quarrels between former Confederates and Yankee Republicans rage on.The place is not only divided but pretty much lawless. If you are traveling in one of the state's treacherous roads is difficult to know who's friend or who's foe. Danger lurks from anyone and any place.At 72, Captain Jefferson Kyle Kidd, a widow and a veteran of several wars, is living a relatively quiet life. He has found a creative way to make a living, one that combines his love for the printing press and his interest in keeping abreast with the news of the world.These days when we hear the term \"news aggregator\" we probably think of websites like BuzzFeed, The Huffington Post or The Daily Beast. But who knew this was not an internet creation? Captain Kidd is a professional reader, a sort of aggregator of news, or at least the 19th-century version of it. He travels through Texas and finds people willing to pay a dime to hear him read from newspapers describing current events from around the country and the world. But the quiet, solitary life the Captain has been living takes an unexpected turn when Britt Johnson, a free black man, asks him to deliver a 10-year-old white girl to her relatives in San Antonio. Johanna Leonberger has been rescued from the Kiowa Indians who four years earlier, kidnapped her and killed her immediate family. Having been so young when this event took place, she has completely forgotten the English language and assimilated the dialect and customs of the tribe.The trip to San Antonio is a dangerous undertaking, as there are raids happening all over the country and plenty of travelers have lost their lives. Captain Kidd is hesitant at first, but he ultimately accepts the mission to bring the girl to her family. Besides, he had spent years in San Antonio after marrying into one of the city's oldest families. He speaks Spanish fluently and understands the culture. He knows these people well.The Captain uses part of the fifty-dollar gold piece he received to finance the trip to buy a spring wagon. The idea is to make the long journey from Wichita Falls to San Antonio as comfortable and as safe as possible.The trip and adventures that follow are gripping and dramatic, but for me the most memorable passages are those that describe how Captain Kidd and Johanna find ways to communicate with each other, an impulse initially born out of their need to survive, but later a reflection of the authentic bond that comes to tie the unlikely pair. The brilliance of this novel is, I think, the contrasting effect of encountering such an honorable, kind hearted and humble protagonist as Captain Kidd is, against the backdrop of the very harsh world he inhabits. He is a hero, but he is an unassuming one. As a reader of fiction, I am all for exploring stories with morally ambiguous characters but once in a while, it feels good to know, unequivocally, who the good guy of the story is. At around 210 pages News Of The Word is a pretty short novel, but its characters are indeed larger than life.*********************************************\nAudio Book Review\nIf you that have been listening to audio books for a while there's a good chance you've listened to something narrated by Grover Gardner. Gardner is a first-rate narrator and it shows on his unforgettable performance here."}, {"userName": "Larry H", "userReviewDate": "Mar 20, 2017", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Definitely 4.5 stars, maybe slightly more.Yeah, I'm late to the party on this one.I'm man enough to admit I didn't read this before now because I was misinformed. For some reason I mistakenly believed this book was another story which veered closely to \nTrue Grit\n—you know, cantankerous old man becomes the protector of a young-but-tough girl, and hijinks and friendships ensue. Having read the book, and seen both versions of the film, and also read a pretender or two, I really wasn't enamored of reading another similar story.While there are perhaps a few similar elements, Paulette Jiles' \nNews of the World\n is a story all its own, full of heart and beauty and simplicity and tenderness, and even a little poetry. It totally took me by surprise and I loved nearly every minute of it.1870. The U.S. is starting to recover from the damages wrought by the Civil War. Captain Jefferson Kyle Kidd, a veteran of two wars (the first when he was just a teenager), is now an elderly widower, a former printer who now spends his days traveling throughout Texas, reading newspapers from all over the world to paying crowds anxious and interested to hear about what is happening both in places they know and places they might only have imagined. He is careful, however, to steer away from any news of Reconstruction and the Confederacy, knowing how it will inflame tempers.While in one town, he is offered a job—and a $50 gold piece—to bring a young girl who had been taken from her family four years before by a band of Kiowa raiders. Her family was killed, but she survived, and was taken in to the Kiowa family, raised as one of them. But such things cannot be, and when she is recaptured, it is decreed that she should be returned to her closest living relatives, an aunt and uncle near San Antonio.For 10-year-old Johanna, the only family she really knows are the Kiowa Indians who raised her, and she cannot understand why she has been taken away from them. She doesn't appear to know English, refuses to wear shoes or act in a \"civilized\" manner, will not eat with a fork and knife, and tries to find any opportunity to cross the river and hopefully return home.But as Kidd and Johanna travel through Texas, finding themselves in danger more often than they care to count, and trying to find common ground, the two begin building a relationship of sorts, with Kidd trying to find empathy for this young girl whose life has already been turned upside down twice, and by dint of his job, he will be party to this happening a third time.\"More than ever knowing in his fragile bones that it was the duty of men who aspired to the condition of humanity to protect children and kill for them if necessary.\"As they draw closer and closer to San Antonio, and an uncertain fate for Johanna, Kidd is torn\u0097he knows at his age, a widower living alone has no place raising a child, especially one so traumatized by life as Johanna has been. But can he really let her go, after he has become the only person she trusts and can communicate with? And if he doesn't deliver her to her aunt and uncle, does that make his as much a kidnapper as the Kiowa?I've really simplified the plot of this book, but it is such a lovely story. Have we seen elements of this type of story before? Certainly. But even if you have suspicions of how the plot will unfold, and those suspicions may prove correct, Jiles' tells such a beautiful story, and has created two immensely memorable characters, characters which warm the heart and stay in the mind.—What struck me about this book is that Jiles was able to create a little bit of tension at every turn, which made the story move even a little faster, and she imbued her descriptions of their surroundings throughout their journey with such evocative imagery, it was lyrical, even poetic. I was fascinated by Kidd's reading the news to people—it's the first time I've ever heard of that happening.I am not generally a fan of historical fiction, but this book really worked for me. If you're not one of the people who already has taken this book to your heart, add it to your list, because these characters will make you smile and, perhaps even cry a little.See all of my reviews at http://itseithersadnessoreuphoria.blo...."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jul 09, 2016", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "The Civil War is just ending and Captain Jefferson Kidd is traveling through Texas reading the newspapers to people. He won't read them local news because everyone gets riled up and the shooting might start. He tells the stories of what is going on in Europe and other countries. He is offered a 50 dollar gold piece from someone he trusts to take a 10 year old orphaned girl to her relatives. She had been taken by the Kiowa when she was six years old..so she is a tad bit wild to everyone's eyes.So begins the adventure of a road trip in a wagon across Texas.These characters. Wow. Captain Kidd is the older cranky sort of man that is perfect in this type of book. I completely had him pictured in my head.\nThen Joanna-full of spunk for a ten year old. Her character is now one of my favorite children ever in a book.Their journey includes a \"Ten cent shootout\" that was perfection.\nThis book is a small thing, but the author does an amazing job of putting so much into the story that you don't feel short changed at all.\nBooksource: I received a copy of this book from the publisher in exchange for a review."}, {"userName": "Lyn", "userReviewDate": "Apr 29, 2017", "userURL": "http://www.goodreads.com/user/show/5253785-lyn", "userReview": "A very good book.Paulette Jiles 2016 novel about a traveling news reader in 1870 who comes across a child needing to be brought home to her family in the semi-wilds of northern Texas was a gem. Good enough to garner a National Book Award nomination and five stars from this very stingy reviewer.Captain Jefferson Kyle Kidd, a septuagenarian veteran of three wars in the 1800s, is living out the last years of his life traveling from town to town reading from newspapers to dime paying audiences on the frontier. Many of his listeners have never been to far off places like Boston or London or Rome but they can hear more or less current news from Kidd and can envision the places he describes in his rich and cultured narration. Kidd eschews reading from local papers and purposely avoids being dragged into parochial politics; his readings are of an escapist quality but are nonetheless journalistic and true.Kidd is approached by freed black men who have been tasked with returning a ten year old who was recently freed herself from captivity by the Kiowa. When the Captain asks why they do not themselves make the trip south and claim the reward money, he is given the explanation that a young white girl in the company of black men would invite more trouble than the promised gold.Thus begins a journey for the two lost souls – the elderly but dignified and still very capable Kidd and the young Johanna, who was taken from her German immigrant parents as they were killed by her captors and then four years later taken from this home. Jiles uses the psychology of the Native American captive to bind her readers into empathy with the girl and with Kidd, and with the unusual but inseparable pair they become.Jiles’ narration is crisp and erudite and there is no surprise to learn that she was first a poet before she took to expanding her prose into novel length (though this is a bantam weight 209 pages and sparingly composed). Jiles has crafted this journey for the two, ostensibly to return Johanna to her aunt and uncle, into a morality play about friendship, society, civilization and loyalty. One of the most poignant scenes is when Johanna picks up a knife and appears likely to scalp a fallen combatant but is gently admonished by Kidd citing that such acts are impolite and not done.With a setting and themes that will invite comparisons with Charles Portis’ 1968 novel True Grit and John Fords 1956 film The Searchers starring John Wayne, Jiles has given us a modern classic and a demonstration of the lean and hungry power of the literary western.Highly recommended."}, {"userName": "Norma * Traveling Sister", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/41400192-norma-traveling-sister", "userReview": "What an emotional journey this book took me on!  I am absolutely spent after reading this novel!NEWS OF THE WORLD by PAULETTE JILES was a uniquely written historical fiction novel that takes you on a 400-mile long adventurous and sometimes dangerous journey across the state of Texas in 1870 after the American Civil War.Reading this book via e-book THE COVER and TITLE did not come into play for me as it was chosen solely to be read on the recommendation of my sister, Brenda.  Although, I do find both the cover and title to be extremely fitting for this book. The CHARACTERS, 71 year old respectable Captain Jefferson Kyle Kidd who travels Texas to read the NEWS OF THE WORLD to a paying audience and scared, lonely, and unsettled 10-year old Johanna who is learning to cope in her new surroundings. Through the kindness and goodness of Captain Kidd they form a relationship that bonds them together by love, trust, responsibility and understanding.PAULETTE JILES delivers an impressive and descriptive story here that was at times a little hard for me to read, as I found the pacing a little bit slow at times. For me living out in the country on a ranch and having a real cowboy as a husband this book took me to places that were familiar to me and have learned about through the stories that were shared to me by my husband and his family.  I really liked Captain Kidd’s description of the people who are called “cowboys”, an “occupational speciality”.  I shared that one with him…..lol What I particularly loved about this book was THE ENDING as it was one of those books for me that made me realize that everything I just read was absolutely beautiful.To sum it all up it was an endearing, steady-paced, and an easy read with a very satisfying ending. Would recommend!!All of Brenda & my reviews can be found on our Sister Blog:http://www.twogirlslostinacouleereadi..."}, {"userName": "Duane", "userReviewDate": "Jan 07, 2017", "userURL": "http://www.goodreads.com/user/show/24389390-duane", "userReview": "Excellent historical fiction. A 2016 National Book Award nominee. Setting-- Texas Territory just after the Civil War.Captain Jefferson Kyle Kidd is a veteran of 2 wars, now he makes his living traveling the small towns of the North Texas Territory reading the news of the world from the nations leading newspapers. He charges a dime a head, and the people flock to hear anything about the world outside their small communities. But then he is given the task, for a 50 dollar gold piece, to deliver a young girl to her relatives in San Antonio. A white girl captured by the Kiowa Indians after they massacred her parents; she was 6 years old. Now at age 10, after having been rescued by the Army, she has no memory of her previous life; not family, not language, nothing. What transpires in this beautifully written book is the story of their journey, the danger and hardships they endured, and the trust, respect, and friendship that developed along the way. Two characters, so beautifully conceived and developed, and so likable, they make reading this book an absolute pleasure."}, {"userName": "Julie Christine", "userReviewDate": "Feb 20, 2017", "userURL": "http://www.goodreads.com/user/show/1213607-julie-christine", "userReview": "As a freelance editor, I read and review manuscripts and query letters of aspiring novelists hoping to find the key to the padlocked gate of publishing. Time and again, I try to steer their query letters away from eager focus on the urgent themes of their work and toward the story itself. Authors can get so caught up in the necessity of their own narratives, the takeaway—what they want the reader to learn and know about the world—forgetting that their only real task is to tell a good story. If they can do that, the themes will present themselves and live on their own merit. Tell us a good story. That's all you need to do. Simple, right? Ah, but there's the rub. For it takes considerable skill, courage, and focus to know your story, your characters, and your intent well enough to see the true narrative within the myriad details of research and weight of ego. And then to render it with wonderful prose. When I read a novel as exquisitely crafted as Paulette Jiles' News of the World, I want to gently press it into these writers' hands and say, This. This is your guide. This is storytelling perfection. The book's glorious simplicity is in the premise: it is 1870 and 71-year-old Captain Jefferson Kyle Kidd, a widower and veteran of two wars, makes his living as a news reader. He travels from town to outpost in North Texas, reading news of the world aloud in dance halls, taverns, theaters—whatever he can rent for an evening, for a few coins an ear. While in Wichita Falls, he's offered a $50 reward by a friend, Britt—a free black man—to return 10-year-old Johanna to her relatives outside San Antonio. So, what we have here is the classic Hero's Journey storyline: protagonist must get from Point A to Point B and the plot is what happens to him along with way. But what of the conflict? Never fear. The author layers on the conflicts with the skills of a French pâtissier crafting a delicate, melt-in-the-mouth croissant. The complication is this: captured by Kiowa Indians four years earlier in a raid that left her immediate family dead, Johanna has transformed into a Kiowa child. Only her blonde hair and pale skin reveal she is anything but 100 percent Kiowa. She no longer speaks English, or more accurately, German-for her birth family is part of the German immigrant population that settled in Texas Hill Country in the 1830s. But this extraordinary novel is so much more than its plot. This is a story of two misfits at either end of their lives, brought together by happenstance and tragedy who bond during an epic journey through an unsettled land. It is novel of place and of a very particular point in history. It is a few years after the end of the Civil War, but hardly an era of peace. Captain Kidd brings with him news of the ratification of the Fifteenth Amendment, granting black citizens of the United States the right to vote. Texas is still very much the Wild West, and Jiles captures the grit and heat, the awesome threats and beauty of this massive state. Paulette Jiles is a writer of prose and poetry and her reverence for language makes for breathtaking sentences: “Above and behind them the Dipper turned on its great handle as if to pour night itself out onto the dreaming continent and each of its seven stars gleamed from between the fitful passing clouds.”RIGHT? Gah. Swoon.I fell hard for the Captain and his fierce, vulnerable ward, Johanna. My boyfriend came down the stairs Saturday morning just as I was turning the final pages of the book to find me in a puddle. My tears weren't necessarily because of something that happens at the end (no spoilers here), but because this book came to an end. That's how wonderful it is. It hurt to read the words The End.The inspiration for the novel came from historical accounts of whites captured as children by Native American tribes who struggled, and in many cases failed, to readapt after their \"rescue\", some less than a year after their capture. They had wholly integrated into their Native families and cultures, finding something perhaps inexplicably complete about tribal life that could never be recaptured once reunited with their birth families. Although it is only February, I am certain News of the World will appear in my 2017 list of Best Read. All the stars."}, {"userName": "Cathrine ☯️ ", "userReviewDate": "Jul 28, 2016", "userURL": "http://www.goodreads.com/user/show/22600410-cathrine", "userReview": "5★My reception and rating may be biased as the subject matter in this one is close to my heart and I have read a fair share of non-fiction works in common as well. I was pleased to see in the end remarks the author’s endorsement of the very excellent book The Captured: A True Story of Abduction by Indians on the Texas Frontier.Accept for the minor complaint that I am not a fan of absent quotation marks, this is as near to reading perfection as I can get. I loved how she wove these fictional characters into a tale which brought to life this place and time in North American history. What I really loved even more was the lyrical, spare, and compassionate prose she employed. It so beautifully speaks to the heritage and lifestyle of the native tribes with its words solidly planted on the earth. Simple, direct, without guile—just like Johanna and her Captain Kidd."}, {"userName": "Perry", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/6354112-perry", "userReview": "A Bonding JourneyA sweet tale, without author-processed chemical additives, i.e., a truly touching tale, without the sentimentality I've seen some authors try to jam down our throats in recent books. The novel is accessibly written with prose just as forceful and colorful as the verbose Faulkner/McCarthy while being both more cinematic and more lyrical. It's somewhat reminiscent of Papa Hemingway with the moral complexities, but it's also about family and honor and commitment, in a lawless Texas of the 1870s.The two main characters are a 70+ year old news reader and a frightened, but courageous, well-drawn 10-year-old girl who spent the last 4 years as part of the Kiowa tribe of the plains that captured her after killing her Alsatian German-speaking parents and sister. The trip to return the girl to her family in San Antonio, Texas, is about 2 weeks: a vivid adventure, at times humorous, at others haunting and compelling, and always a pleasure as we get to see a special bond form between this old man whose family has all moved away from him and this young girl who has now been taken from two families in her brief 10 years.Portrait of Kiowa tribal members"}, {"userName": "Linda", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/9472704-linda", "userReview": "\"There was no method by which he could explain anything to her but she did not need explanations. Often enough they had faced the howling, striving demons of the open plains: hunger, tornadoes, scarlet fever. She didn't need to be told anything except that there were enemies in pursuit and she had already figured that out.\"A Texas reality in 1870 faces Captain Jefferson Kidd. The seventy year old war veteran gazes upon the aftermath of brother against brother. Reconstruction is a word best left to those who ill-define it. A nebulous term at best. Bridges blown up, non-existent railroads, roads almost impassable, and no public money to rebuild. And where, just where, is the satisfaction in all that?But Captain Kidd scratches out a bare existence. He's lost his printing press business and has taken to the road going from town to town reading the news in public gatherings for a mere dime apiece. \"Maybe we have just one message, and it is delivered to us when we are born and we are never sure what it says.\"At one point he is offered the task of delivering a ten year old orphan girl who was captured by the Kiowa when she was six years old. His distant destination would be to an aunt and uncle in Castroville. Johanna Leonberger witnessed the brutal deaths of her family. She has become totally immersed in the Kiowa way of life. No signs of her previous life seem to exist nor any signs of who actually does exist behind those tragic eyes.What transpires throughout this book is the sharp emphasis on the realities of Man's proclivity for pure evil. But that propensity is also softened greatly by the curve and bend of genuine kindness and goodness. You will experience both inclinations through the beautiful prose of Paulette Jiles. There is the shocking jolt of brutality in her storyline and, at the same time, the irregular seam of tenderness dabbled out in uneven waves.Both Captain Kidd and Johanna seek the lost treasure of self-identity. The devastation of war and the horror of the Indian raids have affected them in unspeakable ways. Jiles takes you on their treacherous journey and reveals the historical strains of the time period in the process. Jiles writes with brilliance and you almost taste the dust of the trail with each word.I highly recommend this book for those who have an inclination towards historical fiction. And yet, it speaks to all of us whose heads turn in the direction of well-defined, raw and real characters. No wonder that News of the World is a National Book Award Nominee for 2016. Believe me, this is a treasure of a book."}, {"userName": "Robin", "userReviewDate": "Apr 17, 2017", "userURL": "http://www.goodreads.com/user/show/36555254-robin", "userReview": "This is a dear story, told in a wild time in history in areas where no one seems to be 'in charge', and people live by whatever they decide is law. In this time, Captain Kidd shows that honour and honesty are still alive, and that the fate of a 10 year old girl is still important.1870's Texas: a place where most anyone is armed and ready, when many still meet violent ends despite the end of the Civil War, and when a guy can make a living reading newspapers aloud. That's what widowed, roaming Captain Kidd is doing when he takes on the task of transporting 10 year old Johanna to her next of kin. The catch, and what you'll find out just by reading any review or blurb is, this girl has spent much of her childhood raised as a Kiowa, the tribe who murdered her parents and held her captive for four years. She has limited English, and is unused to European clothing, food, and social customs.The trip is dangerous, and challenges 72 year old \"Kep-dun\" physically but also morally, as he struggles with the obligation of the promise he made, and the right thing to do by this very special, vulnerable girl. The way forward becomes increasingly foggy as their connection and friendship grows.The story is easy to read, driven by a cinematic quality that was constantly playing in my mind's eye. The characters are captivating and pluck at your heartstrings like a harp. I marvelled over how Kidd chose the news stories he read aloud strategically, depending on where he was and what the political hot buttons were. I was fascinated at the permanence that the four years with the Kiowa had on Johanna's identity. I enjoyed the story very much, despite the ending, which had a fast-forward quality that felt a little too tidy, over simplified and rushed. I'd rather the author write more about it, rather than summarize so neatly. But overall - this is a lovely book that is deserving of its accolades."}, {"userName": "Phrynne", "userReviewDate": "Jan 25, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "Firstly thank you to a number of Goodreads friends who recommended this beautiful book. I am so glad you did and so glad that I followed your recommendations and read it myself.As far as I am concerned this book is as near perfect as you can get! I loved Johanna to bits, Captain Kidd too, as they travelled together through the wild west, dealing with all the many threats that came to bear on them. And then that ending - how can you get better than that:)The book is short but very, very sweet. The characters are the kind who get into your head and stay there. The writing is magical. The story is delightful.Just read it yourself! You will not be sorry:)"}, {"userName": "Cheri", "userReviewDate": "Dec 04, 2015", "userURL": "http://www.goodreads.com/user/show/106692-cheri", "userReview": "NOW AVAILABLE!!There is no corner newsstand to get the latest news in print for the people that Captain Jefferson Kyle Kidd is wont to visit, remote areas. He brings them the news, his selections varying on the mood of those he reads to. Ever careful to avoid riling up opposing political opinions in these circumstances, Kidd, in his early 70s, still is a presence that warrants attention. As the story begins, Kidd is in northern Texas, reading to those who attend and drop their dime in the bucket to hear the news from around the world. He is approached in this northern Texas town by Britt Johnson, who convinces him to take a wisp of a child, ten-year old Johanna Leonberger, back to her family. Four years earlier Johanna had been abducted during a Kiowa raid and has now been “rescued” from the Kiowa. Offering Kidd a sum he can’t refuse, Kidd somewhat reluctantly changes plans to bring young Johanna back to what remains of her family. Johanna speaks no English. She’s standing so still she seems almost imaginary, with her pale skin and white blonde wispy hair. Her face a wall of emotion. She wants to go home, to the only one she really knows, really remembers. To her parents Turning Water and Three Spotted, where she is called Cicada. Home.During their journey, Captain Kidd carefully seeks to establish trust with Johanna, a trust he feels necessary in order to give her comfort, and thereby ensure she arrives safely home. He’s raised girls of his own, he senses her fears and hesitations with him, and he knows, as well, that others returned from captivity have never really acclimated to living inside walls, yearning for the way of life they’d known. He teaches her, little by little, the things she’ll need to know in this life she was born into. Manners. English words. She balks at eating with a fork, but is eager to be able to communicate. Little by little he sees a smile. Little by little trust grows. It’s a long, and arduous journey. In the wagon he’s bought for transporting them, they can stop and rest, but being ever vigilant, knowing the potential for trouble, for generally unsavory characters. There’s been flooding along the route to add to the difficulty of the journey. Jiles does a wonderful job immersing the reader in the time and place, 1870, not all that many years after the end of the Civil War; Texas then was nothing like it is now, Dallas was a small town. More time spent in the wagon bouncing around with not a thing in sight other than the endless horizon. More time spent there than in any town of any size. Jiles wonderfully conveys the surroundings, the way of life, the complexities of this time; it is all brought to life with Jiles’ entrancing prose. Gaining Johanna’s trust slowly and early leads to a gradual change. The stoic child he first met blossoms little by little. It’s a lovely thing to see these two bond together, bound by whatever fairy dust has enchanted their emotional journey. The physical journey, however, has a few bumps here and there. Maybe more than a few tense moments. A wonderful story about Home and Family. What our hearts recognize as home, who our hearts recognize as family. Pub Date – 4 October 2016Many thanks to William Morrow, Edelweiss and to Paulette Jiles for providing me with an advanced copy"}, {"userName": "Carol [Goodreads Addict]", "userReviewDate": "Jul 02, 2016", "userURL": "http://www.goodreads.com/user/show/10717098-carol-goodreads-addict", "userReview": "News of the World is by Paulette Jiles. This book was generously provided to me in exchange for an honest review by Harper Collins Publishers.I want to admit up front that I don’t usually read historical fiction. This book was definitely outside of the norm for me. It has been receiving high ratings from other readers so I decided to give it a try. Although at times I could find myself fading when there was a lot of history, the characters won my heart.Captain Jefferson Kidd is seventy one years old. He lost his wife, has raised two daughters, fought in several wars. It is 1870, a few years after the end of the Civil War and the country is still in turmoil. The Captain travels the country and for a price of ten cents each, he rents out large rooms and reads the news to anyone wanting to listen. This is how he makes his living. It is at one of his readings that an acquaintance of his asks for his help. He has a little ten year old girl that was taken by the Kiowa when she was six. He has rescued her but the little girl remembers nothing of her life before. In her mind she is a Kiowa. The little girl needs to be returned to her surviving family, an Aunt and Uncle. The trip would take three weeks and would be dangerous. He will pay the Captain $50 to deliver the girl.The Captain is hesitant to take on such a huge responsibility. It is evident that the girl is wild. But he does accept the job. Along the journey his gentle way with her slowly settles her and they grow attached. They encounter danger and share joy. It was shocking to me the things that people of that time had to worry about, the danger they had to endure to survive. It is so foreign to anything we know now. But one thing is the same and that is that there are good people and there are bad people. There are people with blackness in their hearts who seek little ten year old girls for vile reasons. And little Johanna is lucky enough to have the Captain to protect her. Together they are a force to be reckoned with. As their bond strengthens, the idea of returning her to her relatives becomes more and more painful. But this is what he was paid to do, it is the right thing to do, isn’t it? I did enjoy this book, it was a quick read. I loved the ending. If you enjoy historical fiction then you will most likely love this."}, {"userName": "Julie", "userReviewDate": "Dec 31, 2016", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "News of the World by Paulette Jiles is a 2016 William Morrow publication. News of the World is another book on a list of award nominees I’ve worked my way through in the last days of 2016.This may be one of my favorites on that list, due to the historical details provided about my home state of Texas. I am familiar with every place on the map Captain Kidd visited or described in his journey across the state. In 1870, during the reconstruction period of Texas, law and order was random and loose. The dispute over land with the Native Americans erupts in violence, with kidnapping of American women and children becoming a common practice.  Ten year old ‘Johanna’ was kidnapped at age six by the Kiowa tribe. But, now, at age ten, she’s been sold and left behind by the only people she appears to have any feelings for, or memory of.Her plight comes to Captain Kidd’s attention while he travels across Texas, reading the ‘news of the world’ to crowds of people who pay him a dime a head for his services. He is offered a fair price to take ‘Johanna’ back to her only remaining family. Along their long and treacherous journey the seventy-plus year old Captain Kidd forges a bond with young ‘Johanna’ and she eventually learns to trust him due to his patience and kind treatment of her.This relationship is at the heart of the story and is what will stick in my mind when I think of all the many layers of this short, powerful novel.“Loss of reputation and the regard of our fellow persons is in any society, from Iceland to Malaysia, a terrible blow to the spirit. It is worse than being penniless and more cutting than the blades of enemies.”The contrast between good and evil jumps off the pages as brutality and the evil intentions of men are outweighed by good, honorable men, like Captain Kidd. The psychological effects ‘Johanna’ endured as a result of her kidnapping is puzzling and there are no pat answers. What happened to her during that four year span of time that caused her to forget everything she had known before, including her own native language and the ability to use utensils while eating.  Her heart remained with the Kiowa tribe for reasons that simply cannot be fully explained. This part of the story is heartbreaking and I do think I will take the author’s advice and check out the recommended reading material she listed at the end of the book for insight into the psychology of those captured by Native American tribes. The writing here is simply amazing, the intricate details of the landscape and of the characters bring the story to life with its vivid imagery. Wars and conflicts have followed us all through history, and they always leave behind vulnerable victims, who are forever changed and no matter how well intentioned we are, those impressions may never really leave them. Sometimes all one can do is the right thing and let things develop from there, which is what Captain Kidd ultimately had to do.  While Johanna’s story is sad and poignant, as well as thought provoking, her character deeply touched me and I think I will always remember her.This short novel packs a pretty big punch, and is definitely worth the time, even if you don’t usually read westerns or historical fiction. 4.5 stars"}, {"userName": "Sarah", "userReviewDate": "Jan 19, 2017", "userURL": "http://www.goodreads.com/user/show/18894476-sarah", "userReview": "One of those rare books that restores one's faith in humanity. When a man's word stood as enough. I was disappointed when I first opened the package and saw that it was a small book in comparison to others. But not the message inside. We need more men like Captain Kidd.Captain Kidd is paid to take a young captive Kiowa back to her people. In this case, her aunt and uncle. He doesn't really want to, she tries to escape, and after traveling across Texas a bond forms between them.I absolutely loved the character development and the land they crossed made me miss Texas more than I already was. The author has written this historical fiction novel with great attention to detail. I loved having the map to follow their journey.Intriguing ! Touching ! Unexpected Ending I recommend to anyone"}, {"userName": "PattyMacDotComma", "userReviewDate": "Jul 18, 2016", "userURL": "http://www.goodreads.com/user/show/1128612-pattymacdotcomma", "userReview": "4.5★Captive children, feral children, neglected children, incarcerated children, abused children, slaves. I have accidentally (or serendipitously, maybe) met all of these in my books over the last few weeks. The child in this book was 10-year-old Johanna, a German-American girl captured four years earlier by a Kiowa tribe when they murdered her family. Except for her fair colouring, she looks and behaves as a Kiowa. She’s dressed in a deerskin shift with feathers in her hair and “had no more expression than an egg.” This takes place in 1870, shortly after the American Civil War, and the Kiowa have decided to sell her back. Her relatives have offered to pay someone to bring her home, and Captain Kidd reluctantly agrees. He is an elderly widower who makes his living by travelling around small outposts, reading from an assortment of newspapers.We learn a bit about Kidd’s work as a military runner, carrying messages and maps. Like the pony express without the pony? He loved the independence and importance of the job, and it feels natural to him to travel the countryside now, carrying the news of the world. After the horrors of the Civil War “he had come to think that what people needed, at bottom, was not only information but tales of the remote, the mysterious, dressed up as hard information. . . the listeners would for a small space of time drift away into a healing place like curative waters.”Curated news = curative waters? This is what Facebook does—affects the public mood by choosing what we’re likely to see first online. He curates his presentation by choosing articles that shouldn’t stir up old rivalries in the audience. “Captain Kidd read carefully and precisely. . . He had the appearance of wisdom and age and authority, which was why his readings were popular . . . he took them away to far places and strange peoples. Into mystic forms of thought and the structures of fairy tales.”He can control a crowd, but has no idea what to do with this rebellious child who won’t talk and who struggles constantly to escape. She’s a wild child with no memory of English or how to eat with a knife and fork. She’s completely disrupted his comfortable routine of staying in local establishments, eating well, and enjoying a hot bath and a warm bed. Instead they make camp in miserable wet weather. He doesn’t understand her, but an Irish couple he knows spends an evening with them, camped in a barn this time. Doris has seen the Irish orphans of famine who move from family to family, never belonging. The author says in her note at the end of the book that she thinks Doris explains best why these children never really settle.Doris gives Johanna a doll and watches Johanna prop it up and speak to it in Kiowa.“’She’s like an elf. She is like a fairy person from the “glamorie”. They are not one thing or another. . . The doll is like herself, not real and not not-real. I make myself understood I hope. You can put her in any clothing and she remains as strange as she was before because she has been through two creations.. . . To go through our first creation is a turning of the soul we hope toward the light, out of the animal world. God be with us. To go through another tears all the making of the first creation and sometimes it falls to bits. We fall into pieces. She is asking, Where is that rock of my creation.’”There is a lot of excitement – it isn’t all dry philosophy! After crossing raging rivers and moving further from the Kiowas, Captain Kidd and Johanna begin to communicate. They fight off bandits together and have some hair-raising (almost literally) encounters. At one point, the captain lays out some clean travelling clothes.“It was forty miles of rough country . . . and were they to be killed and scalped their bodies would be found bloody but spruce.He broke down the .38, cleaned it, reassembled it. He made a list: feed, flour, ammunition, soap, beef, candles, faith, hope, charity.”There is so much to enjoy in this book – the characters of course—and the story itself, which shows how frightening life was then, never sure who or where your enemies were. The captain’s philosophy and reminiscences are thought-provoking, especially this, when he’s smelling the mesquite and the palms as they enter an area he’s remembering from thirty years ago.“It would stay with him always as everything you ever did stayed with you, every horse you ever saddled, every morning he awoke with Maria Luisa beside him . . . always there like a tangle of telegraph wires in the brain where no dispatch was ever lost, what an odd thing, an odd thing.”Indeed, it is an odd thing, and Jiles has described perfectly how old memories can appear unexpectedly with the slightest provocation. She’s terrific, and so is this book. Three of the other books I referred to in the beginning are:Into That Forest by Louis Nowra about two young girls lost in Tasmania and “adopted” by Tasmanian Tigers, based on a real incident (not in Tasmania).https://www.goodreads.com/review/show...Select Short Fiction by Charles Dickens, the master storyteller of street urchins, the poorhouse, and Newgate Prison.https://www.goodreads.com/review/show...All Day: A Year of Love and Survival Teaching Incarcerated Kids at Rikers Island by Liza Jessie Peterson is what's happening now with kids who don't belong.https://www.goodreads.com/review/show...Then there is the opposite problem in Australia with the Aboriginal Stolen Generation, Aboriginal children with white parentage were snatched from their mothers and taken to institutions to be trained as domestic and farm workers. Unlike Johanna, many of these kids mourned their birth families forever, but that's a diatribe for another day!"}, {"userName": "Marita", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/17415449-marita", "userReview": "Texas, 1870.“He must have been out of his mind. Senile dementia. But he had promised.” So thinks Captain Jefferson Kyle Kidd after he accepts (for a price) the task of returning a ten year old girl to her aunt and uncle in Castroville near San Antonio. Johanna, the girl in question, had at the age of six been captured by the Kiowa during a raid in which her immediate family had been killed. Now, with her past forgotten, she is well and truly Kiowa. “She seemed to be about ten years old, dressed in the horse Indians’ manner in a deerskin shift with four rows of elk teeth sewn across the front. A thick blanket was pulled over her shoulders. Her hair was the color of maple sugar and in it she wore two down puffs bound onto a lock of her hair by their minute spines and also bound with a thin thread was a wing-feather from a golden eagle slanting between them. She sat perfectly composed, wearing the feather and a necklace of glass beads as if they were costly adornments. Her eyes were blue and her skin that odd bright color that occurs when fair skin has been burned and weathered by the sun. She had no more expression than an egg.” Captain Kidd expected it to be a challenging journey; he wasn’t mistaken.It is a novel in which we see a very special relationship develop between a 71 year old man and a ten year old frightened, traumatised, defiant young girl. Both are interesting characters. Kidd once had a printing shop: “He loved print, felt something right about sending out information into the world.” He has since become an itinerant news reader, travelling from town to town with a bundle of newspapers from which he reads to audiences at a dime a head. With his beautiful reading voice “Captain Kidd read carefully and precisely. His eyeglasses were round and rimmed in gold over his deep eyes. He always laid his small gold hunting watch to one side of the podium to time his reading. He had the appearance of wisdom and age and authority, which was why his readings were popular and the reason the dimes rang into the coffee can.” “And now he took them away to far places and strange peoples. Into mythic forms of thought and the structures of fairy tales. He read from the Philadelphia Inquirer of Dr. Schliemann’s search for windy Troy somewhere in Turkey. He read of the telegraph wires successfully laid from Britain to India, an article in the Calcutta Times forwarded to the London Daily Telegraph, a technological advance that seemed almost otherworldly.” “To finish, he read of the unfortunate Hansa crushed in the pack ice in its attempt on the North Pole, the survivors rescued by a whaler. This was proving the most popular as he could see by the small gestures of the audience; they bent forward, they fixed their eyes upon him to hear of undiscovered lands in the kingdoms of ice, fabulous beasts, perils overcome, snow people in furry suits.” But he is smart enough not to read local newspapers or get involved in local politics. And the 71 year old soon to be 72 is not beyond casting an appreciative eye on a much younger widow…There is adventure with goodies and baddies galore, and also plenty of humour. Kidd has to concern himself not only with physically protecting the girl, but he has to deal with bigotry, ignorance and worse. But it is that beautiful relationship between the elderly man and the young girl which is the essence of the story.###I find the omission of double quotes (“...\") around direct speech rather disconcerting."}, {"userName": "Karen", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/12851291-karen", "userReview": "Oh my, Captain Jefferson Kyle Kidd, such a wonderful man, loved him!! He had fought in two wars starting at the age of 16. Now at 71 yrs old he is paid to bring 10 year old Johanna back to her relatives after her recovery from the Kiowa Indians who had captured her 4 years early and had killed her family. Johanna only knows the way of the Indians now and has lost the English language. The Captain has a long and dangerous journey ahead, and while on this journey, he, a former printer, reads the newspapers and makes stops in various cities to read the \"news of the world\" to folks in gathering places for 10 cents a head. The relationship that develops between the Captain Kidd and Johanna is beautiful. I loved this book!"}, {"userName": "Margitte", "userReviewDate": "Jan 20, 2017", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "Captain Jefferson Kyle Kidd, a seventy-two-year old veteran of the Civil War, travels through Texas in the early 1870s and organizes his own road show in which he delivers news from all over the world to the small hamlets and towns. In Wichita Falls he is asked to take a ten-year-old girl to her surviving family 400 miles south in San Antonio, after her parents and her little sister were murdered in an Indian raid of their farm. Johanna herself was abducted by a band of Kiowa Indians but four years later rescued by US troupes.So begins a journey of friendship, loyalty and endurance that is established when they have to face many dangers and challenges on the road and nothing comes easily. It's an agonizing process. For both of them the journey is destined to be a new beginning, but as they arrive at Johanna's family, the captain has to face a decision he did not anticipate. This is an incredibly touching story. Historical fiction with a touch of curmudgeon charm. Perhaps it can be called a mellow, relaxing, informative, read? Just what the doctors ordered. Descriptive and picturesque. Colorful and adventurous. Emotionally stirring. The book has ±250 pages - a good sized, fast moving wonderful tale.Just great!"}], "description": "National Book Award Finalist—Fiction\nIn the aftermath of the Civil War, an aging itinerant news reader agrees to transport a young captive of the Kiowa back to her people in this exquisitely rendered, morally complex, multilayered novel of historical fiction from the author of Enemy Women that explores the boundaries of family, responsibility, honor, and trust.In the wake of the Civil War, Captain Jefferson Kyle Kidd travels through northern Texas, giving live readings from newspapers to paying audiences hungry for news of the world. An elderly widower who has lived through three wars and fought in two of them, the captain enjoys his rootless, solitary existence.In Wichita Falls, he is offered a $50 gold piece to deliver a young orphan to her relatives in San Antonio. Four years earlier, a band of Kiowa raiders killed Johanna’s parents and sister; sparing the little girl, they raised her as one of their own. Recently rescued by the U.S. army, the ten-year-old has once again been torn away from the only home she knows.Their 400-mile journey south through unsettled territory and unforgiving terrain proves difficult and at times dangerous. Johanna has forgotten the English language, tries to escape at every opportunity, throws away her shoes, and refuses to act “civilized.” Yet as the miles pass, the two lonely survivors tentatively begin to trust each other, forming a bond that marks the difference between life and death in this treacherous land.Arriving in San Antonio, the reunion is neither happy nor welcome. The captain must hand Johanna over to an aunt and uncle she does not remember—strangers who regard her as an unwanted burden. A respectable man, Captain Kidd is faced with a terrible choice: abandon the girl to her fate or become—in the eyes of the law—a kidnapper himself.", "title": "News of the World", "url": "http://www.goodreads.com/book/show/25817493-news-of-the-world", "average": 4.1, "cover": "https://images.gr-assets.com/books/1440342988l/25817493.jpg", "reviews": 5938, "authors": [{"url": "https://www.goodreads.com/author/show/70102.Paulette_Jiles", "name": "Paulette Jiles"}], "type": ["Historical", "Fiction", "Westerns", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/25817493-news-of-the-world", "http://www.goodreads.com/book/show/27473760-news-of-the-world", "http://www.goodreads.com/book/show/32600737-news-of-the-world", "http://www.goodreads.com/book/show/25858378-news-of-the-world", "http://www.goodreads.com/book/show/399395.Enemy_Women", "http://www.goodreads.com/book/show/6098570-the-color-of-lightning", "http://www.goodreads.com/book/show/467316.Stormy_Weather", "http://www.goodreads.com/book/show/17349213-lighthouse-island", "http://www.goodreads.com/book/show/1076133.North_Spirit", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}