{"ratings": 1571, "userreviews": [{"userName": "Ben Alderson", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "OMG WOW! this is a new favourite dystopian for me! I LOVE IT AND NEED THE SEQUEL!"}, {"userName": "Andie ", "userReviewDate": "Nov 06, 2015", "userURL": "http://www.goodreads.com/user/show/30510075-andie", "userReview": "***A hidden gem! Excellent start to a very promising series! ***I absolutely loved this book! I was a little hesitant to read this because I have read and loved so many other dystopians that comparing them to each other is inevitable. But I'm happy to report that while there are some small similarities, New World: Rising stands on its own! I was captivated from page one and ended up finishing it in a day. This is an excellent beginning to a very promising series. In this new world, the Earth as we know it has been destroyed leaving only two separate societies. First, we have Tartarus which houses 5 savage tribes. Tartarus is a harsh and brutal city where every day you must fight for your life. Then there is the Sanctuary, which is built up to be some sort of Utopia. Our protagonist, Phoenix was born into the Sanctuary but left for Tartarus with her parents at a young age. But she belongs to neither society. Phoenix is now 16 and has been on her own for the last 6 years. She's witnessed the murder of her parents and has had to learn to survive all on her own. She's a loner and trusts no one, trusting anyone could cost you your life in this dangerous world. I loved Phoenix! She's an extremely smart and resilient girl, tough as nails but still shows humanity in a world that seems to be lost of it. After seeing a little girl being hunted down by the vicious tribe that murdered her parents, Phoenix finds herself breaking her own codes and stepping in. In the aftermath, she is thrown into a hidden third society of people who have their own goals in mind. Here with these new people, Phoenix finds sweet, gentle, but tough when needed, Triven. There is a bit of romance between these two but it doesn't overpower the survival story like a lot of other dystopians have done and for that I am grateful! Phoenix struggles with wanting to be a part of this society and belonging but it's foreign from everything she's ever known and it's a constant battle for her to stay in these hidden walls. But one thing is for certain, she will do whatever it takes to survive! I love finding hidden gems and this is one of them! Wilson has an incredible storytelling ability and was able to build this vivid, gritty world that was completely believable, all the while keeping my heart racing and my mind guessing. It was fast paced and continued to get more exciting as the book went on. I can't wait to pick up the next book and see where the story and these amazing characters go from here!"}, {"userName": "Jennifer Wilson", "userReviewDate": "Nov 13, 2014", "userURL": "http://www.goodreads.com/user/show/33785602-jennifer-wilson", "userReview": "Well... I wrote it, so of course I love it. Shameless I know but every author should be proud of their work. It contains a little piece of his/her self and let me tell you it takes a lot of work to accomplish a dream, so be proud!"}, {"userName": "Taylor Knight", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/12627819-taylor-knight", "userReview": "New World: Rising is definitely one of the best dystopia reads that I've come across in a long time!It was fast paced and interesting. I loved the writing and the characters were awesome. There was some tropes that come along with YA dystopian but I didn't mind it. The world building was pretty great. There was some info dumping in the beginning but that didn't really matter because the world that Jennifer Wilson created was so interesting. Phoenix is a really cool main character. She's independent, self aware, and really smart.Overall, I read this book in just a couple of sittings because it was so fact paced and I really enjoyed it. I'm starting book two really soon because I can't wait to see what happens next. If you love dystopian books, please pick this book up because it's great."}, {"userName": "Emma Giordano", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/30604861-emma-giordano", "userReview": "4.5 stars!! I really loved this book! It's the kind of dystopian that gave me a lot of positive nostalgia to when I was first in my crazy dystopian obsession (i.e. The Hunger Games, Divergent, Legend). And books that can remind me of the good memories I've had reading similar books are always a favorite! I was bored at absolutely no point during the book, constant action and when there wasn't an exciting chase/fight scene, there were some really interesting moments showing great character dynamic between everyone in this story. I'm so happy I was sent a copy by OfTomes and I will have a larger but still as honest review on my channel soon, but New World Rising was fantastic and I can't wait to read book two!!"}, {"userName": "Sarah Churchill", "userReviewDate": "Feb 08, 2015", "userURL": "http://www.goodreads.com/user/show/18321322-sarah-churchill", "userReview": "SO MANY unanswered questions... I guess I'll be getting book two!New World: Rising does follow the 'Dystopian Formula' (as I am now calling it), tropes any dystopian fan will know and expect, but then it is a tried and tested formula for a reason - it works and we keep coming back for more. What makes a dystopian a winner is the world building. I loved the dark, brutal grittiness of the New World. I would have liked to have seen more of some of the characters within it, but I have future installments for that too.The main character, Phoenix, really worked for me. Strong, independent, intelligent, but also aware of her need for affection even if she loathes it. Then there's Mouse. I want to care for Mouse myself! There's a lot more to this mute little girl that's still to be revealed, and that's my biggest draw to book 2!Recommended for a fast paced quick read with a gritty edge."}, {"userName": "Casey Ann Books", "userReviewDate": "Dec 08, 2014", "userURL": "http://www.goodreads.com/user/show/4018158-casey-ann-books", "userReview": "I think with any dystopian novel we all know where we stand. There are certain elements and frameworks that are always in place, and its then the world that’s built around it that makes it what it is. Here we have Tartarus, which even the name I love, because of its Greek Mythology connections - it was used as a prison for the Titans. And that’s exactly what it was for everyone that was there, a prison, a trap...an underworld. I loved the idea of the division and one that is so closely connected, the Sanctuary, held up in its grandeur, and unknown to everyone outside it and Tartarus, forced the survive whatever the cost. The setting became more realistic to me, and you can almost imagine yourself scurrying across rooftops. As ever, time for a bit of cover love! The green pops out at you, and the city itself is really implicit and feeds the imagination (unless I just have a really vivid imagination) and the way Phoenix is drawn into that is great. For me it has that old America, Gotham sot of vibe, and I hope a similar style is kept on the next books. The inclusion of diary drawings, made it feel a little like a diary, and it was great that I actually had a point of illustration from the get go so characters formed in my head, without having to adds reams of description, and leaving us to get on with the action. As with most hero’s or heroines , there is a dark and troubled past and phoenix is no different, and this is used to bring a strength and independence to her character, and it was nice that we could see her use this, both on her own and as part of a group. Her character was able to build walls and break them down, and that whole on the edge kind of feeling as to what she would do kept a good game going. It was also good to be able to see the split in these worlds, from her independent lifestyle to being part of a ‘society’ and how the characters operated within them. I do hope we get to explore some of the briefly mentioned characters, like the Healer, later on.In a lot of ways, phoenix and the rest of the characters, from Arden to Maddox and Triven were set in specific ways of their convention, and this gave it a level of predictability. They were good characters that played their parts, but it felt like I knew their parts early on. That said, there was a lot in here, and some of the ccharacterizationsand the short swift retorts used made the dialogue flow really nicely, gave it a good pace and broke up the dark overhang, so there were some great comical moments when I was laughing along.And then there was Mouse...who was my favourite character! What was beautiful about her character was the way she interacted and influenced others without even talking. I had such a high level of care for her, that I could empathise, and feel the same as Phoenix did toward her as I read along. She made you laugh and cry, and ohh and aww, and that was a very powerful tool in this book. It made it more than just another fighting story, it gave it real heart. Though there was enough action to please all as well.As with many dystopian books I’ve read, it’s left it on a cliff-hanger, which is soooo annoying! Not in a bad way, but more of in the ‘I really want to know what happens next, why isn’t this book longer’ sort of way, which is a hard emotion to convey in one facial expression! I want to know more about the place and the thing that happens at the end (see no spoilers, I’ve been good) and I’m excited to find out about these.This was a very good New find, and a great New series (sorry I stop with the terrible puns only I probably get) and I look forward to the revolution!"}, {"userName": "Olivia-Savannah  Roach", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/34117027-olivia-savannah-roach", "userReview": "I follow a booktuber called BenjaminOfTomes and was so impressed when I heard he was making a publishing company! He has since published plenty of books and I saw all of them whizz by. But there was something about New World Rising that prompted me to send an email to the publishing company and request a review copy of the book. I was so happy to be approved and now in the end I loved this book! It was well worth requesting and even if it wasn't, we could just look at that beautiful cover all day because it really is gorgeous. After turning the first page of this novel I was already sucked into the world. How could it happen so quickly? That's because before we even get to the novel there are some beautiful drawings and sketches of the different kinds of tribe members and their identifying features. We also get a map of the city and if there is a map in a novel it's already bonus points in my opinion. It also makes sense for those sketches to be there - in this novel Phoenix uses a journal left by her deceased parents to help her survive in Tartarus which is definitely not an easy task with or without a journal. If you watch Supernatural like I do, you'll know about the journal that the dad leaves Sam and Dean. It's that kind of journal!The world building was one of my favourite things about this novel. There's a lot of detail that has gone into the world, and we can see that from the way Phoenix travels around Tartarus and what she does. I also liked how each of the tribes were so different. We get to encounter them all in different ways and to me it was just so interesting to see their dynamics and how they worked. It was definitely ruthless.We can immediately feel sympathy for the main character because we get to read about her losing her parents and understand how it happens. There then is a little time jump to hwen she is of age and it is surprising to see how much she has developed and steeled herself. And yet when the time comes to either rescuing someone else who is a child or saving herself, she still has enough humanity in herself to try and save the child. Wilson should also be applauded for her writing style. It was written beautifully. Although I felt like a few conversations were a little stiff, (they were few and far between) the rest of the writing flowed smoothly and just added so much to the story. The descriptions and imagery had me blown away and loving every minute I was sucked into this world. This is a dystopian book because usually those follow a certain formula and that can get boring after a while. But boring is the LAST word I would use to describe this book. Maybe a few elements of a dystopian do trail into this one, but Wilson puts her own spin on things which makes this novel so unique. If that wasn't enough, we have a lovely main character called Triven who is the love interest. Like Phoenix, he is a book lover (more bonus points!) and reading actually is the first thing that brings them together. Triven is a true gentleman and really knows Phoenix incredibly well - sometimes better than she knows herself. The romance stays clean, which is good for a YA book, but is still enough to have me smiling. Mouse is the child that Phoenix saves. To avoid spoilers I won't say much about her but that child is definitely such a sweetheart.Phoenix's biggest fear is being trapped underground. This makes sense because that's where she was when her parents died. This fear comes back a lot in the novel because it's the kind of experience that haunts you. What I liked about the plot was that even though there was a general issue to overcome, Phoenix had her own personal ones to overcome as well.All in all, someone needs to get book two to me ASAP! The cliffhanger ending had me pacing in frustration. I usually stay clear from reading the beginning of the next book that usually appears after the acknowledgements, but this time I couldn't help myself! All it did was throw another twist to the mix that makes me want book two all the more. A must read from me!This review and others can be found on Olivia's Catastrophe: http://olivia-savannah.blogspot.nl/20..."}, {"userName": "jaroda", "userReviewDate": "Jan 08, 2016", "userURL": "http://www.goodreads.com/user/show/16654757-jaroda", "userReview": "Many thanks go to Of Tomes Publishing for sending me an e-copy in exchange for an honest review.\"Be strong, survive.\" These words have kept Phoenix alive for years in Tartarus since the night of her parents' deaths. Ever since they escaped with her from the city known as the Sanctuary, Phoenix has maintained a system that has kept her alive yet isolated from everyone. She refuses to join the tribes of Tartarus. Her only interactions with others have happened in terms of her survival in this desolated city. That is until she stumbles across a little girl and saves her life. In doing so, Phoenix ultimately falls in with a rebel group called the Subversive. Their goal: Bring down the Sanctuary from within. If Phoenix wants to continue to survive, she must make a choice.Join or die.Of Tomes sure knows how to pick 'em! I thoroughly enjoyed Rising. Not since Divergent have I read such a thrilling dystopian. The pacing was fantastic, the world and its inhabitants intriguing. I can't wait to discover more of the secrets the cities hold in Jennifer Wilson's New World series. I highly recommend checking this book out.★★★★★"}, {"userName": "Gabby", "userReviewDate": "Mar 27, 2016", "userURL": "http://www.goodreads.com/user/show/26560207-gabby", "userReview": "[I enjoyed the knife throwing scene between Triven and Phoenix even though it totally reminded me of that scene in Divergent with Tris and Four. But it was really cute. (hide spoiler)]"}, {"userName": "Kori (_livelaughread)", "userReviewDate": "Jan 22, 2017", "userURL": "http://www.goodreads.com/user/show/34746491-kori-livelaughread", "userReview": "First off, HOLY CLIFFHANGER. I’m so thankful that I had the second book on hand because wow, that ending left me breathless.This book is such a hidden gem in the dystopian genre. I absolutely adored it. I’ll admit that I was a little hesitant to pick it up because of the amount of dystopian series I’ve read and at this point, they all seem too similar. I’m happy to announce that I was 100% wrong and this book is absolutely worth your time.It centers around Phoenix, an orphaned girl who is living in a city overrun by 5 savage and ruthless tribes. She is strong, resilient, and capable after 6 years of surviving on her own—but she has trouble trusting and caring for anyone. But when she finds herself suddenly living among a sort of rebel group, she befriends Mouse, a 10 year-old girl who doesn’t speak, and yet adds SO much to this story. She is our voice of humanity in a world where killing is an everyday occurrence. I love Phoenix’s character. She comes from a troubled and tortured past, and watching her struggle with suddenly having two people to care about (yes, there is a bit of a romance, but it takes a backseat and is so well done) was one of my favorite parts.Jennifer Wilson’s writing and world building is what made this book absolutely addictive (I did finish it in practically one sitting…). The entire book is focused on doing. It never felt slow; there was constantly some form of action. There was also no form of info dump, and yet I feel like I have a decent grasp on how the world came to be. As always, I have my questions, but that is what book two is for!Thank you, Jennifer, for sending me a copy for review! Time to dive into New World Ashes."}, {"userName": "J.M. Storin", "userReviewDate": "May 23, 2016", "userURL": "http://www.goodreads.com/user/show/51349325-j-m-storin", "userReview": "As a debut novel, I thought Jennifer Wilson did a fantastic job. While overall I thought this book was just okay, the writing style was impressive and the potential is so great for this series! So onto the good stuff..Writing StyleAgain, this book was written with a fast pace and easy to follow prose that made it a very enjoyable and light read. Her descriptions were spot on, not too superfluous and not too bare. I would definitely read more books by this author.Phoenix and MouseTheir relationship was very well done and both of their characters had great development. Mouse was my favorite, but Phoenix was someone you could sympathize with and cheer for.So onto a couple of reasons I docked this rating by two stars.Plot Holes?So throughout the book I was trying to piece together what was going on and figure out the why behind what was happening and was seriously struggling. Why did \"the Sanctuary\" turn out to be the villainous society? What's their motive? Why do we focus solely on Ravagers? Why are they teamed up with the Sanctuary? I know there are other books in the series, but I needed a little more plot development to get behind this story and found myself struggling to piece it together.Love...Ugh, I'm so tired of insta-love in young adult. Although the relationship in this novel was a little more developed than some, I still felt it happened too fast. And the pacing for the relationship was inconsistent. Sometimes they'd be head over heels for each other and other times they didn't talk? I'm not sure I completely bought it.World BuildingWilson's descriptions were beautifully done, but I wish she had described a bit more about the big picture of this world. Why are we in this dystopian society? I totally forgot about the other tribes in the book, what is their purpose? Who are the Ravagers and how did they get to be so evil? I just wanted a better idea of some of the world building aspects and thought the story was lacking on these points.Overall, though, I do recommend this novel to all fans of dystopia. I'll read the next book as I'm curious what will happen to these characters!"}, {"userName": "Rachel Gunter", "userReviewDate": "Apr 04, 2015", "userURL": "http://www.goodreads.com/user/show/29072157-rachel-gunter", "userReview": "Over the years I've read a lot of dystopian books, its one of my favourite genres, and New World Rising has to be one of my favourites :) I loved the Tribes aspect, I really liked learning about the ways in which the Tribes stood out from each other. The world building of Tartarus was really good too!Phoenix was an interesting character, she'd suffered a lot and had had to learn to look after herself - I thought she was very brave, especially when she defended Mouse! And I loved how she saved books! I would definitely do that too! I'm so excited for the next book!"}, {"userName": "Rikke", "userReviewDate": "Nov 02, 2015", "userURL": "http://www.goodreads.com/user/show/13002095-rikke", "userReview": "I liked it but I wasn't overly impressed. I didn't like the first person narrative much, and coincidentally I ended up not caring much for Phoenix either, especially not after the first part. That bit definitely held my attention the most, but then circumstances changed, and it became something else. I guess it had to, but all the doubt, the self esteem issues, the obvious perfection, isn't really what I want most from a story. Obviously she has to be the master of all kinds of fighting, hand to hand combat, knives, guns. Stealth obviously. She alone had to have a perfect map of the city memorized. All of that seems unavoidable, though, because how else would she have gotten to be the heroine. But then there's the romance. Fortunately it doesn't drown out the story, but still.. Because she's a heroine, she has to be the object of both unwanted and wanted attentions. And she has to feel unworthy of it. And yet give into it. Really, what is it with dystopians. Has it become a rule that the main character has to be female, and stereotypical. Always protective of a younger child, always desired by some perfect boy, because God forbid she has to be devoid of an insta-soulmate. And actually this heroine did survive alone, for years, but now, having perfected her skills in just about anything on her own, destiny wanted something different from her. Not only is she willingly risking her life for a stranger, she is suddenly ready to team up for the good cause of something. I kinda wish I hadn't went ahead and bought Ashes already. But then again this one ends with a CLIFFHANGER of sorts, it wasn't insufferable, and maybe the sequel will even fill in some of the blanks in regards to the perceived utopia, as well as to some undisclosed motivations. I'm kinda hoping I will enjoy Ashes more, because Rising actually comes off as interesting, but lacking in its fundamental reasoning. I liked the idea of a false utopia. And I liked how the various tribes were also appalling in their own way, but why then, with an abundance of obvious miscreants, is, say, kissing more prominent than providing solid reasoning for why, how, and by what measures, a few is fit to, say, rise against someone of more power, and again to what means. Is this someone the bigger evil, and how? Really, I do feel something is missing. Like are they eating their young, possessing the innocent, working their citizens to death, or why do we root against them? Also it seems quite a few words have gone missing, at least from the kindle edition. The's and pronouns, so nothing major, just more of them than usual. And what kind of names are Arstid and Triven anyway?? Why not just make something weirder up.. Lastly, this is by no means a bad book, should you be in the mood for a dystopian, it's both interesting, and fast paced."}, {"userName": "Alyssa", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/7607210-alyssa", "userReview": "I received a copy from the author in exchange for an honest review.The gif above is the perfect description of myself after I read New World: Rising. This book left me with pieces of my heart scattered all over the place and emotions that I don't know how to contain. It left my jaw hanging. At loss for words. Erratic heartbeat. New World: Rising is the newest addition in my all time favorite books.I read this book without expecting anything. Little did I know that this book will blow my mind. Where do I start with my review for this glorious book? Let's start talking with our heroine, Phoenix. I had an instant love with her character. She's strong, smart, clever and everything that I was looking for an MC of a Dystopian book. Phoenix has to hardened her heart in order to survive in the world that she lives in. But her life took a 360 degrees turn when she saved a stranger. I like the transition of Phoenix in this book. From a girl who only cares about herself to a selfless person. I love that Phoenix is not only tough, but that she also has a soft side in her.Another reason why I love this book so much is because of the world building in this book. It's fantastic! Not that I wish to live in this world (Ha! Thank you, but NO), but what I like in the world building of New World: Rising is that it made my imagination so active. I was constantly imagining what each Tribe looks like, what The Sanctuary is like and how scary the Tartarus is. I had to take breaks in my reading to fully immerse myself in this world. It made reading New World: Rising even better.This book will not let you choose which team to take because guess what? There's no love triangle in this book. Yay for that! :D And for once in my life, it was the love interest that fell in love with our heroine first and not the other way around. Another yay for that! The progression of the relationship between Phoenix and her love interest is gradual. It's not insta-love (Thank God for that). I wouldn't go into details but let me tell you, I swooned a lot when I was reading this book. I blame the swoon-worthy love interest of Phoenix for that. New World: Rising is the kind of book that you wouldn't put down. It will suck you in from the very first page 'til the very end! I can't wait to start reading the sequel of this. Thank God it's already out now. Heh. :DP.S. Dear Jennifer Wilson, you're now added to my list of auto-buy authors. You rock.This review can also be found at Diary of a Book Maniac."}, {"userName": "Cait • A Page with a View", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "This is definitely one of the better YA dystopian books. It has the familiar elements of the most popular ones (especially Divergent) with the idea of an enclosed city surrounded by a wasteland and the citizens divided into opposing factions, but it totally takes it in a unique direction. The writing is well done and the story flew by because it actually focused more on  doing rather than telling.I was impressed at how quickly I got a strong impression of Phoenix just by her actions and inner dialogue. She was super resilient, smart, strong, capable, and not at all obnoxious. I loved character of the little girl Mouse who signs, too! Definitely recommend this one if you like dystopian.Thank you so much to the author for sending me a review copy!"}, {"userName": "Lauren (Bookworm Boutique)", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/38618640-lauren-bookworm-boutique", "userReview": "The thing about Dystopian novels is that they're always faced with comparison to other popular Dystopian novels. The Divergent series was the \"next Hunger Games\", it happens and I think that it's just the easiest way to explain these kinds of novels... So I'm going to be doing exactly that, sorry!Rising is the first novel in the New World trilogy by Jennifer Wilson. My first thought about this novel was \"Divergent\", and I honestly couldn't help myself. The book is set in the city of Tartarus, which is basically dilapidated and although we kind of get a history lesson, exactly what happened to cause all of this is slightly foggy. Within the walls of the city are Tribes, each Tribe has certain personality traits or physical aspect which helps them be identified as a member of one of these Tribes. The main character goes into detail about each one early in the book, and the author even provides sketches at the beginning of the book to help with visualization. Even with the similarity, I couldn't exactly recommend this to lovers of the Divergent series, because the situation within Rising is far more brutal and you definitely wouldn't want to be aligning yourself with any of them or buying merch with the tribes names on them, that's for sure.The book also reminded me a lot of The Host by Stephenie Meyer, and you'll have to read it to understand why (otherwise I'll give away too much of the plot) but basically the main character finds herself in a situation where she is considered extremely dangerous and disliked by a majority of the other characters.Rising follows the path of a seventeen year old girl called Phoenix, I couldn't help myself but laugh when I read this, not in a mean way, but mainly because it was seriously 'hit the nail on the head' type stuff. The second book in this trilogy is called Ashes, and I instantly saw an image of Phoenix 'Rising' from those very 'Ashes'. I understand that it was done on purpose and is maybe something you're not supposed to snort at, but I found it hard to take the name seriously after that.Phoenix isn't exactly a character that you instantly fall in love with. She is alone in the city, not affiliated with any of the dangerous Tribes, and so for a large portion of the book you rely on just internal monologues and backstories, which is fine, as long as you connect with the narrator. Phoenix insists that she's a 'hard' and 'callous' person, but there isn't a whole lot of evidence to support that, in fact, I kind of thought that, considering all she'd been through, she was kind of a soft person to say the least.The basic plot, without giving too much away is that Phoenix's parents were once part of The Sanctuary, which was a safe haven away from the city of Tartarus. Something happens within those walls which causes Phoenix's parents to leave, taking themselves and her into a seriously dangerous and messed up environment. Within Rising, Phoenix is introduced to some other characters who had also lived in The Sanctuary and who had chosen to leave as well, but what the novel kind of fails to explain is why they did this. Over the course of the story you find out that there is a lot of military presence and a lot of control, a heck of a lot of control, but what's never mentioned is why it would be better to leave those walls and walk yourself back into Tartarus where you'd be raped, killed, and have all your possessions scavenged within seconds, where food is scarce, where there are barely any safe hiding places, no medical attention, and where you're in constant danger. It was hard for me to imagine, and I had no reason to be on either side of the argument (either \"Yeah, take down The Sanctuary!\" or \"Nah, bro, bad idea...\" as there wasn't really enough information.That being said, and after writing this review I've realised I was far more harsh than I expected to be, I did enjoy this book. I'm a big fan of dystopian novels, cliches and all, so when I was approached to review this I pretty much jumped at the chance. The idea behind Rising definitely intrigued me, and the cliffhanger (why did you do that to me, Jennifer???) will most certainly mean that I pick up Ashes soon (although, if that one ends on a cliffhanger too I don't know if I could wait for Inferno without tearing my hair out...). Rising was full of action and horror, with a bit of a love story as well. Something I loved though, was that the love plot-line was not the focus of the story at all, so it didn't leave me rolling my eyes. It also helped that I have a total crush on Phoenix's love interest, he is a stunning character and I truly wish he was real.I'd recommend this book to anyone who enjoys Dystopian novels, especially if you find some of them a bit unrealistically tame, you will not think that of Rising. Rising is only 205 pages long, so it's the kind of book that you'll probably devour in one setting, I do not recommend picking this up if you're busy! I would give this book three out of five stars (★★★☆☆) I will be continuing this series too and will hopefully have my review of Ashes up soon!"}, {"userName": "Connie", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/20748319-connie", "userReview": "Source: I downloaded a copy of this book from Kindle Unlimited. Cost: Free Title:  New World: Rising Series:  New World #1 Author:  Jennifer Wilson Overall Rating:  5 starsA review of this book will be on my blog on 11/02/16I loved this book. I didn't really know what to expect to be honest, so I went into this book with really no expectations, and I was blown away! I loved the characters, their relationships, developments. UGH, I can't believe it took me so long to get into this world. I loved that this world was so complex, with the 5 tribes and the sanctuary. I loved that the sanctuary is the bad place and there seems to be no haven in this world that they've found so far. I also love that Phoenix promoted reading and education throughout this book. SO GOOD."}, {"userName": "Vienna", "userReviewDate": "Aug 04, 2015", "userURL": "http://www.goodreads.com/user/show/9125860-vienna", "userReview": "*4.5 stars*. I loved this book! It's a fast-paced dystopian and I loved the worldbuilding and everything seemed really realistic. The only thing I didn't like about it that again the main character has started ''dating'' with the guardian/instructer and it botters me that this seems to happen in almost every dystopian book. It's still an awesome read though!"}, {"userName": "Cassandra", "userReviewDate": "Aug 17, 2015", "userURL": "http://www.goodreads.com/user/show/10649513-cassandra", "userReview": "I absolutely loved this book and cannot wait for book two. I'm already thinking about book three. I'm so excited.Full review is on my blog:Review"}, {"userName": "Kate (GirlReading)", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/29599654-kate-girlreading", "userReview": "New World Rising is a fast paced and gripping dystopian. The whole time I was reading this, I couldn't help but think this would make such a great movie! Both the characters and plot in this created a brilliant page turner. I can't wait to read the next book."}, {"userName": "⭐Anni⭐", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/63666087-anni", "userReview": "This was a really fast read! I read it in 3 sittings, and then I read the preview for the sequel which was included, and now I immediately want more!!New World: Rising started out as a post apocalyptic story about a girl surviving on her own outside the walls of The Sanctuary because her parents left this city with their daughter when she was just a child. Then they were murdered, and from then on Phoenix was on her own. I loved the world described in this book. It was a dark and brutal one and I couldn't help it but the tribes that rule the world outside of The Sanctuary reminded me of the Grounders in The 100 - which is my favourite show and therefore I immediately loved the feeling this book gave me ;)Later on, it turned out to be more dystopian, which I also liked but I would've expected it to be more post apocalyptic. I would've loved to get more info and background on the world and more survival scenes. I'm not sure what to think of our MC Phoenix. She definitely is a survivor, which was awsome. She can take care of her own and doesn't need anyone else; even more so, she sees relationships as weaknesses. But after a while I was a bit annoyed by her because she always let me know how good she was at this or that and that she doesn't need anyone else. I didn't hate her, but I didn't love her either. I'd like to find out more about her though.What I didn't like was the romance. Yeah, this is a YA novel and they mostly come with a romance, but this one felt a bit forced and insta-love like. First, Phoenix doesn't want another person to look after because it makes her weak, and then she can't stop thinking about this guy she just met? But while thinking about him, she still tried to deny her feelings... girl, make up your mind!Triven, the love interest, was likeable enough, but maybe also a bit boring. There certainly is more about him than the book told me. The only character I loved from the beginning was Mouse. She was so sweet and precious and I really want to know what happens to her!The story itself was fast paced and exciting. The middle part was a bit slower and if it were longer, it would've gotten boring, but it was bearable. The action scenes were nicely written and the ending was thrilling and left me wanting more. That cliffhanger though!! Why did you do that to me?!So all in all an interesting and good book that I enjoyed, even though there were some things that I didn't like. It wasn't the most original book out there, but it was worth reading it and I'd recommend it to fans of the dystopian genre."}, {"userName": "Raul", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/44319549-raul", "userReview": "4.5 Stars!! This book was FANTASTIC!!! I loved this world and the characters. It is definitely one of the better dystopian books I've read and easily rivals and surpasses some of the better known series out there. The romance is usually never something I enjoy, but I liked it and it wasn't a main focus. There is definitely potential and am excited to see how this world expands in the next one."}, {"userName": "Sarah (thegirltheycalljones)", "userReviewDate": "Mar 09, 2018", "userURL": "http://www.goodreads.com/user/show/32607699-sarah-thegirltheycalljones", "userReview": "DNF 65%.A classic case of Murtaugh, aka \"I'm too old for that shit\".There were some pretty cool ideas, and I'm not familiar enough with dystopia to have been bothered by the eventual comparison to many others, more famous dytopian YA novels (I haven't read neither Hunger Games nor Divergent).The writing is very decent, and the MC, Phoenix, is okay. She's not annoying but just okay, because she's another \"tough badass girl who can't let herself to have any sort of feelings if she wants to survive in this cruel world\" but who are you kidding, author, when do you ever show she's like that? She's not. Phoenix repeatedly says she is though. But I can repeat all sorts of things in my head all day long and that doesn't make them true. Because if it did, I'd be at Hogwarts by now, and not writing this review from work, which has nothing to do with magic whatsoever.All the characters are pretty cliché, but they're not infuriating. The Love Interest is very cute on paper but never reached the book-boyfriend status, probably because insta-love.I did manage to reach the 65% mark, meaning that if I had no buddy-read planned I could have tried to go a bit further. But I forgot about this book as soon as I started a new one. I actually remembered it when I logged in to GR to write my other book review.So 2 stars it is.Farewell, gorgeous cover. You're okay but not for me anymore."}, {"userName": "Nicole Bell", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/18808048-nicole-bell", "userReview": "Very Divergent meets Mad Max. Don't get my wrong, it's a YA Dystopian novel just like the rest of them. But this book captured me from the very first page; hell even before the first page, the drawing and describing of the tribesmen was enough to keep me wanting more. I'm not promising it's something brand new, but if you enjoy dystopian novels I'm promising this author writes really well and will keep you interested and guessing. I'm on the second book and it's still has me hooked.WORTH THE READ!"}, {"userName": "Christina Marie", "userReviewDate": "Jan 07, 2016", "userURL": "http://www.goodreads.com/user/show/10872969-christina-marie", "userReview": "RATING: 4.5 STARS**This book was sent to me in exchange for my honest review**This book is a great start to what promises to be a fantastic dystopian, fantastical series. I loved this book. Though I believed to have had my fill of young adult dystopian fiction, Wilson has awakened a new desire in me with this one. And I cannot wait to read the next book.NEW WORLD RISING follows a young girl named Phoenix and her determination to fight to survive in a savage world that dealt her a rough hand with the death of her parents. There are several tribes in this world that are ruthless and you either belong to one of the tribes or you die. Phoenix chooses not to belong. And that decision is deadly. Through her struggles to survive, she learns whether or not it's safe to trust -- others and even herself.This book does a great job of painting the picture of a world that, quite frankly, I have no desire to live in. It's too cut throat for me, but that's what makes it interesting. Phoenix is a well developed, strong, stubborn, independent young girl. And honestly, with all of the YA dystopian books I've read, you'd think I'd be tired of that. But nope. Wilson has a way of making me fall in love with Phoenix - flaws and all. The wonderful thing about Phoenix's character? Her flaws are actually way more apparent than her strengths, in my opinion. And that made her, not only more likable, but it made her more human. Less superhero-ish. Phoenix is young. She's been through a lot. And the author doesn't allow the reader to forget that. The pedestal that you can easily put her on is shattered early on. And bravo for that.The world is scary. A scary scary place. You get a lot of explanation or terminology, tribes, language, at the very beginning of the book, which was very helpful. These tribes are ruthless. The imminent danger is very well felt. The world is a strong setting for what appears to be a strong premise. But while I do love the world, I find that there were a couple of flat points (for me) as I read on, BUT I had no worries because the characters more than make up for anything that the world lacks.When I read books, I typically am looking for a connection with the characters. The world could be horribly portrayed, but if the character development is perfect (or close to it), I am a happy reader. And Wilson knows how to write and develop some good characters. She introduces several characters that, not only aid in the development of our protagonist, but they also have their own moments of interest that the reader can grab onto. The progression of the development of Phoenix and her relationships with the characters she encounters is done at a pace that wasn't outside my realm of believability. I was on board for it all. In fact, those relationships exposed more and more of Phoenix's humanity that I mentioned previously.The action packed moments in this book were solid. There were a few moments of intense emotion, where I felt angry, nervous, happy, sad -- you name it. Wilson got me to feel a lot. And the book isn't even a long one. It takes skill to take me through the emotional wringer in that short of a read. But she did it - well. I cannot wait to see where this series goes. I think this promises to be something special. And I am so on board."}, {"userName": "Angela Mazon", "userReviewDate": "May 13, 2016", "userURL": "http://www.goodreads.com/user/show/31663377-angela-mazon", "userReview": "Before anything else, thank you so much Jennifer Wilson for being such an amazing bookish friend and for giving me a copy of your book. Of course, to Oftomes Publishing for the stunning cover and the weirdly unique size of the book.New World: Rising is about Phoenix who tried to survived for five or six years after witnessing her parents death at the age of eleven. At the age of sixteen, she knows (more than anyone) the secret passages, how to leap from building to building, how to hide even if the enemies are one foot away and how to survive living in Tartarus.In Phoenix’s world, there are two types of civilizations: The Sanctuary and Tartarus. Tartarus is divided into five tribes, each tribe is more brutal than the last one. Imagine that? The last tribe is already brutal, what more if it’s the first one? There are more mysterious things in The Sanctuary that were not revealed. But one thing for sure, it’s as bad as the Tartarus … or worse.Phoenix is perfect for the heartless world Jennifer Wilson has created. She’s strong, flexible and clever. She has every quality to continue living and survive. She prefers and functions well when she’s alone. All she cared about is her own safety and how she’ll live for the next day. But that changed when she met Mouse, the cute little kid she saved. It just shows that no matter how cruel the world asks her to be, there’s still humanity left inside her. There’s more about the two of them, a portion of their lives that has not yet been told and I’m going to happily wait for the next book.I finished this book last Monday but I can still feel the adrenaline rush pumping through my veins. It’s as if I am living through Phoenix and seeing through her eyes what’s it’s like to live in Tartarus. I could feel the wind splashing on my face, the stench of something burning and rotting bodies.I’m a huge fan of Dystopian novels so this book went to number one after I read it. I just loved how fast-paced this books is. It’s also quick and easy read but it never failed, not even once, to make me feel on edge. This book has everything I want to see in a dystopian novel. The gripping action scenes that kept me wanting more, the characters that I loved and adore, and their world … the heartless and ruthless world they’re currently in.This is a 10 out of 10 recommendable."}, {"userName": "Jess-i-ca ~Sometimes a Gif Witch~", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/8740772-jess-i-ca-sometimes-a-gif-witch", "userReview": "Not a bad beginning to this series. I am interested to see where it goes."}, {"userName": "Booksandcupsoftea", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/31467066-booksandcupsoftea", "userReview": "I read this on the plane home from Turkey, such a page turner! I need book two NOW! Such a brilliant dystopian world with amazing characters and plot twists!"}, {"userName": "Bexnbookx", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/56791158-bexnbookx", "userReview": "Want to see me talk about books? Check out my Youtube Channel: Bexnbookx\n'There is no good or evil here, it all depends on what side you're standing. Nor is it about wrong or right, it's about surviving.'\nNew World: Rising was an exciting, entertaining and a totally under-hyped dystopian!New World: Rising is book one in Jennifer Wilson's New World trilogy, and I want to start off by saying, I freaking loved it. The dystopian vibes were real, and I appreciated being brought back to a genre that I had missed to much!New World: Rising follows Phoenix, a young girl who watched her parents brutal murder at the age of eleven. Running on instinct she survives a world full of murderous tribes, in a cruel city to which there is no escape. Refusing to join any of the tribes, but determined to survive, Phoenix fights, that is until she needs to be saved.Since this is a review, below does contain spoilers, if you haven't read the book, don't read any further. You have been warned.The premise of this book intrigued me straight from the beginning, so much so that I picked up this gem as soon as I received it in my June OwlCrate! Jennifer's writing is fast paced and straightforward, which is wonderful because the writing is structured in a way that keeps you continuously needing more and being unable to put it down. The easy nature of the writing lead for a quick read, but the structure of the chapters is what intrigued me because just when you want to place it down a small twist or cliffhanger is entered to keep you drawn in. What a wonderful writing style to read, and I am excited to read more from this author. The plot is action packed, entertaining throughout and the writing style really complemented this. The straightforward writing style, let the plot and characters speak for themselves, which was awesome in this book. The characters throughout this story were wonderful, all were complex and well developed and I felt myself connect with them throughout the story. Our leading lady Phoenix was broken but strong, and I enjoyed seeing her development throughout the novel. I liked the complexity to her character, and the way she embraced others such as Triven and Mouse. Triven was an amazing male character, but what I enjoyed about him was that he was everything that Phoenix needed. I felt the ying and yang between the pair, and although a lot was left unresolved at the conclusion, I look forward to seeing both of these characters return in New World: Ashes. I am also excited to see Mouse, I love the relationship that was created and the softness she brought to our main character. I am hoping we dive more into Mouse's back story in the next book, there was a lot left of her character that I feel I don't know!\"In all of my adventures, nothing ever smelled quite like an old book\"Overall, New World: Rising was one of my favourite reads this year! It was a revamp of the dystopian genre and although dystopian's always have comparisons to books like Divergent and The Hunger Games, New World: Rising stands on it's own. Favourite Quote: 'Once I had opened a book and read its pages, those characters could never be taken away from me. Even if the books were burned, they would still live on in my mind'Rating: 5/5Purchase New World: Rising by Jennifer Wilson from Book Depository and receive FREE SHIPPING: https://www.bookdepository.com/New-Wo..."}], "description": "Worlds collide in debut author Jennifer Wilson's graphic dystopian series where Divergent meets Mad Max. Since witnessing her parents' murders at the age of eleven, Phoenix's only purpose in life has been to uphold her mother's dying words - to be strong and survive. But surviving outside of The Walls - outside of The Sanctuary - is more like a drawn-out death sentence. A cruel and ruthless city, Tartarus is run by the Tribes whose motto is simple, \"Join or die.\" Refusing to join and determined to live, Phoenix fights to survive in this savage world. But who can she trust, when no one can be trusted? Not even herself...The first of a trilogy, New World Rising is an epic tale of survival, instinct, trauma, and the extraordinary power of human connection.\"Savage and raw, Jennifer Wilson pulls no punches in this blood tingling dystopian.\" Kimberly Derting, award-winning author of The Pledge Trilogy", "title": "New World: Rising\n      \n          (New World #1)", "url": "http://www.goodreads.com/book/show/27268998-new-world", "average": 4.03, "cover": "https://images.gr-assets.com/books/1447717984l/27268998.jpg", "reviews": 382, "authors": [{"url": "https://www.goodreads.com/author/show/8471252.Jennifer_Wilson", "name": "Jennifer   Wilson"}], "type": ["Young Adult", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27268998-new-world", "http://www.goodreads.com/book/show/23364341-new-world", "http://www.goodreads.com/book/show/28248182-new-world-rising", "http://www.goodreads.com/book/show/27284375-new-world", "http://www.goodreads.com/book/show/33969932-new-world-inferno", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}