{"ratings": 33, "userreviews": [{"userName": "Kevin Lucia", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/1449299-kevin-lucia", "userReview": "A perfectly serviceable novel, but unfortunately, not one of my favorite Charles Grant works. Nothing wrong with, really - I guess I just don't like any kind of (spoiler) zombie novel, even one written by one of my favorite authors."}, {"userName": "Thomas", "userReviewDate": "Jun 24, 2015", "userURL": "http://www.goodreads.com/user/show/291872-thomas", "userReview": "I've mentioned before that I get songs stuck in my head from book titles that are the same as or similar to songs I know. I was a Cinderella fan when I was in high school, so of course as I was reading this book, I had \"Night Songs\" playing on my mental stereo. I suppose it could have been worse -- at least the book wasn't titled Talk Dirty to Me.This is a zombie novel, but you wouldn't know that from reading the blurb of the book or even from the first half of the book. Like any Grant novel, there's definitely something weird going on, and you know that from early in the story, but you don't really know what, specifically, it is until you've read that far. You're not even certain what the real threat of the story is until you're past page 100.Once you've figured out this is a zombie story, you spend another quarter of the novel reading about all the characters who unknowingly try to rescue the people they know. During this time, we get an inkling of what's causing this sudden zombification, but for the most part, the story becomes all about showing the tragedy of people being killed by the remains of their loved one. It becomes a little tedious and repetitive at that point, and then there's only a quarter of the novel left to see how the protagonists are going to get out of this mess. Grant's usual slow build-up doesn't work quite as well in a more plot-driven story.One thing I've noticed in Grant's fiction is that it's populated by white characters. I suppose most of the fiction I read can be characterized that way, but if a non-white character shows up in one of Grant's books, it's because he's using them as a plot point. The Egyptians in The Long Night of the Grave are understandable, but using Native Americans in The Curse and now Haitians in Night Songs is strictly so Grant can exploit the mythologies of those people. It's a little disappointing, but then again, these books are from the 1970s and '80s; I'm not sure diversity was a goal for the fiction of that time.Despite all that, I still found something to like out of the book. Aside from the hokey story, Grant manages to capture the isolation of the setting (the entire story takes place on a small island), and I'm still pretty amazed at how well he can capture a setting with just a few choice placements of words. Once the plot got going, I stayed engaged, and I felt more of a connection with his protagonists in this book than I have with his previous books.I'm still not sure if Grant is a writer for just anyone. His style takes some getting used to, and his pacing is very different from modern bestsellers. He's still a compelling writer, and I would recommend him to fans of horror who are looking for something different from all the rest of the horror out there, but it's hard to recommend a single book out of all he wrote."}, {"userName": "Charles", "userReviewDate": "Aug 04, 2008", "userURL": "http://www.goodreads.com/user/show/1336573-charles", "userReview": "One of my favorites by Grant."}, {"userName": "Dean", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/10506681-dean", "userReview": "A refreshingly original take on the zombie story. Impressive!"}], "description": "Somewhere in the night they are singing songs of death...Colin Ross, twice thwarted in love, once abandoned, quit the mainland for Haven's End, a wounded soul on an idyllic island, seeking to heal his life. But instead of peace, he is hurled into chaos. Some dark and ancient hatred, some evil force, is unleashed, wreaking vengeance on the islanders, mangling the living and mutilating the dead. And, as the piercing songs rise to met the roaring wind, Colin Ross, against his will, is sucked into the raging storm.", "title": "Night Songs", "url": "http://www.goodreads.com/book/show/2953047-night-songs", "average": 3.58, "cover": "https://images.gr-assets.com/books/1248362038l/2953047.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/717781.Charles_L_Grant", "name": "Charles L. Grant"}], "type": ["Horror", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/2953047-night-songs", "http://www.goodreads.com/book/show/25777711-night-songs", "http://www.goodreads.com/book/show/219479.Whirlwind", "http://www.goodreads.com/book/show/219471.The_X_Files", "http://www.goodreads.com/book/show/219472.The_Pet", "http://www.goodreads.com/book/show/415484.The_Hour_of_the_Oxrun_Dead", "http://www.goodreads.com/book/show/939548.Gallery_of_Horror"]}