{"ratings": 619, "userreviews": [{"userName": "Mientras Leo", "userReviewDate": "Apr 03, 2016", "userURL": "http://www.goodreads.com/user/show/6348927-mientras-leo", "userReview": "Me ha encantado recuperar este clásico del género en un momento en el que el fenómeno zombi parece hacer perder la fuerza a lo que fue en su día.Interesantísimo el uso de la tensión narrativa e imprescindible el prólogohttp://entremontonesdelibros.blogspot..."}, {"userName": "Craig", "userReviewDate": "May 01, 2014", "userURL": "http://www.goodreads.com/user/show/83180-craig", "userReview": "Well, this abridged dramatization/audiobook is a good choice to listen to for an eerie hour of after-dark driving. The story is essentially the same as the film with two interesting differences that caught my ear. Anyone who might read this review has surely seen it multiple times, but I'll call spoiler alert here just in case. First, zombie Karen talks to her mother before dinner (which is pretty much opposite everything we learn about the living dead in the film), and, second, she also infects Ben before the rescue team arrives... which kind of takes a lot of the punch out of the ending. The biggest let down, though, for me, is that my favorite line from the film is missing; \"They're dead all right. They're all messed up.\" It's been years since I read the original novelization, so I'll have to dig it up soon for a re-read. And then maybe warm up the DVD player!"}, {"userName": "Juan Antonio", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/65274191-juan-antonio", "userReview": "Nos encontramos ante la novelización del clásico cinematográfico de terror del legendario director George A. Romero: La Noche de los Muertos Vivientes (Night of the Living Dead), proyectada en 1968. Antes de adentrarnos en mi opinión sobre el presente libro, me gustaría ofreceros un prolegómeno muy personal y de igual modo muy interesante al respecto. He de sincerarme diciendo que nunca han llamado mi atención este tipo de adaptación literaria y es la primera que leo. Partiendo de esta premisa, el interrogante es el siguiente: ¿Qué razones me han llevado a leer ésta y no otras novelizaciones cinematográficas? Pues la primera razón y la más importante hunde sus raíces en mi infancia, allá por los años noventa del siglo pasado, cuando husmeando en la inmensa videoteca de mi tío encontré una copia casera en VHS en cuyo lomo podía leerse: “La Noche de los Muertos Vivientes”, se trataba de la versión de Tom Savini de 1990. Desde aquel primer visionado quedé tan fascinado que hasta día de hoy, casi todos los años la veo al menos una vez. Sin duda mi película favorita de zombis y creo que jamás podrán hacer otra igual, entre otras cosas, porque en aquel tiempo los muertos vivientes eran verdaderas obras de artesanía plástica, mientras que ahora, en nuestros días – a mi entender- abusan demasiado de los efectos digitales, haciendo que los no-muertos se asemejen más a un videojuego que a una película. Pasado el tiempo, visioné el clásico de Romero y aunque me cautivó, no me vislumbró como el remake de Savini.La segunda razón por la cual he leído esta novela, es por su autor John Russo y por supuesto por el prólogo que de ella hace el mismísimo George A. Romero. Bajo mi modesta opinión, creo que al tratarse de la novelización de un film, no hay nadie mejor para la realización de este trabajo que el propio guionista de la película, que en este caso, son ambos personajes mencionados. Hemos de saber que la novela se publica originariamente en 1974, es decir seis años después de la proyección de la película. Según he podido informarme, tan sólo tenemos dos versiones en castellano, una primera de 1985 –desconozco si ésta tiene el prólogo de Romero- y otra publicada recientemente en 2016, versión de la cual dispongo. En relación hay que decir, que tenemos otra novelización de esta historia cinematográfica escrita por Declan Sinnot, cuya publicación en nuestro idioma es del año 2015. Como no la he leído, no puedo opinar sobre la misma, pero dudo que esté a la altura de la novelización de John Russo, por las razones anteriormente expuestas.Sin más preámbulos, veamos qué me ha parecido este libro y dado a su condición de adaptación literaria, es inevitable que hablemos de la película en la que se inspira. Además también la compararemos con la versión de 1990, pues hay diferencias muy significativas e interesantes de analizar. El argumento de la novela es verdaderamente sencillo: “Siete desconocidos quedan atrapados en una granja solitaria mientras los muertos regresan a la vida por la influencia de una onda espacial radiactiva, emprenden un ataque despiadado y atacan a todos aquellos que se encuentran”.John Russo hace una adaptación muy fiel, -casi exacta me atrevería a decir- del film de George A. Romero, además utiliza un lenguaje preciso y conciso sobre las acciones que narra, del mismo modo que los diálogos que tienen los diferentes protagonistas, son muy claros y directos. Esta forma de escritura, -alejada de grandes descripciones y densas narraciones-, hace que el relato avance de forma vertiginosa y te adentres en los diferentes hechos que van sucediendo en la tétrica historia. Además, el autor, a pesar de su simpleza narrativa consigue crear esa pésima atmósfera grisácea del film en el que se inspira. La prosa del autor, consigue constantemente remitir al lector a las diferentes escenas que componen el clásico largometraje.Adentrándonos en los personajes, hay que decir que la historia la inician los hermanos: Johnny y Bárbara viajando al cementerio para poner una corona de flores a su madre y la finaliza el afroamericano Ben. Durante el desenlace, tenemos a los personajes que se encuentran escondidos en el sótano de la casa que son el matrimonio de Harry Cooper, su mujer Helen y su hija Karen; y aparte tenemos a la pareja de Tom y su novia Judy. De todos ellos, el autor de la novelización hace un calco físico y psicológico idénticos a los de la película. Además también están muy bien conseguidos los informativos radiofónicos y televisivos que retransmiten la caótica situación mundial a los protagonistas atrincherados en la casa. A parte de los personajes “vivos”, tenemos a los “no-vivos” o “muertos vivientes”, que en el libro, curiosamente, son llamados “espectros”. Estos seres de ultratumba que deambulan sin orden ni concierto en busca de carne, constituyen el verdadero epicentro de la historia y sin ellos nada tendría sentido. Los muertos vivientes de Romero, a diferencia de otros escritores y directores del género, -son un móvil de crítica al despiadado sistema que gobierna el mundo-, tienen un propósito y un mensaje para la gran masa social, víctima del imparable e insaciable consumismo impuesto por el capitalismo. Sobre el rol que juegan los no-muertos en las diferentes películas de este director, podréis encontrar multitud de información en Internet, libros, artículos etc.…Tanto en el film como en su adaptación literaria, el verdadero protagonista es Ben. Un joven afroamericano que representa el espíritu de la esperanza y la supervivencia. Su comportamiento y las acciones que lleva a cabo para salvaguardar la adversa situación, lo convierten en el líder del grupo. Ben morirá “en vida” -tanto en la película como en su novelización- de un tiro en la frente al ser confundido con un muerto viviente por la partida del comisario McClellan. En la versión de Tom Savini, aunque también es tiroteado por los mismos, morirá como un “no-vivo”, es decir como un muerto viviente. Para finalizar con este personaje, a modo de curiosidad, decir que una persona de raza negra interpretara el papel de Ben fue muy controvertido en la época, dado que el racismo a finales de los años sesenta, constituía un verdadero problema social en la Norte América de Johnson. No obstante, como ha apuntado en alguna que otra entrevista el propio director, sus películas intentan reflejar la realidad del momento en la que fueron realizadas.La figura más interesante – o al menos a mí me lo parece- es sin duda la de Bárbara, principalmente por la evolución que ésta experimenta desde la película de 1968 y su novelización en 1974, hasta la versión de 1990. Si nos detenemos y observamos al personaje, nos daremos cuenta que pasa de “Cenicienta” a “Guerrera”. Tanto en el film original como en su novelización, apreciamos durante toda la trama a una muchacha débil, temerosa y pusilánime, cuyo fin es la muerte. Es un personaje que no destaca por sus acciones, sino por su estado catatónico y caótico en el que queda inmersa desde el principio y que el escritor John Russo lo describe de forma magistral. Además, si recordamos, Ben agrede a Bárbara para calmarla y acto seguido la tumba semiinconsciente en el sofá; secuencia que no presenciamos en la versión de Tom Savini. La muchacha al encontrarse descalza, es el propio Ben quien en modo de príncipe protector le calza unas zapatillas que había encontrado en la casa, como si de una “Cenicienta” se tratara. Esta acción refleja la concepción social femenina, dependiente y débil frente a la masculina, que el cine proyectaba en aquellos años. Este prototipo de Bárbara, cambiará de forma radical con la versión de 1990. En ésta, nos encontramos con una auténtica luchadora en la que será ella y no Ben, la verdadera protagonista de la historia. Bárbara interpretada por una jovencísima Patricia Tallman luce ahora el pelo muy corto y pelirrojo, muy varonil, en vez de largo y rubio como en la versión original. Y aunque en un principio vista una falda de cuadros y calce zapatillas, será ella quien las cambie por unos pantalones verdes y botas negras militares. Ya no tenemos a un príncipe protector ni tampoco a una cenicienta, sino a una auténtica guerrera. Reputación que demuestra durante toda la historia y que la culmina cuando ciñe la canana y escapa de la casa haciendo frente ella sola a los “espectros”. Esta exhibición de valentía se verá recompensada con la supervivencia. En definitiva, nos encontramos ante una obra a tener muy en cuenta, sobre todo por aquellos aficionados al género Z en general y del trabajo de George A. Romero en particular. John Russo, sin ser un reputado escritor, ha sabido muy bien trasladar aquellas imágenes en blanco y negro al papel, con una narrativa muy clara y concisa que hacen de esta novela una lectura muy amena, entretenida y disfrutable."}, {"userName": "Chica Sombra", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/60098073-chica-sombra", "userReview": "Ya sabéis que soy amante del género Z, por lo que ya estaba tardando en leer este clásico entre los clásicos, el detonante de los maravillosos zombies. Esta novela está basada en la película con el mismo título que se estrenó en 1968, siendo un gran éxito y pasando a formar parte del cine de culto. Sí que había visto la película, pero no la recuerdo muy bien, así que volveré a verla y próximamente os daré mi opinión sobre ella.Todo comienza cuando los hermanos Bárbara y Johnny, de 19 y 26 años, hacen un viaje en coche hasta un viejo y pequeño cementerio donde está enterrado su padre. Allí, un muerto se levanta y mata a Johnny, mientras Bárbara huye con los sonidos del muerto viviente comiéndose a su hermano en la cabeza. Llega a una granja solitaria y se esconde allí, donde pronto conocerá a Ben, un joven con madera de líder que hará lo posible porque ambos lleguen vivos al amanecer cuando, supuestamente, una partida de rescate vaya a por ellos. El personaje de Ben me ha gustado mucho, pero sin embargo, Bárbara me ha puesto loca de los nervios. Vale, que sí, que cualquiera puede entrar en shock tras un suceso como el que le ha ocurrido a ella, pero pobre Ben, en vez de una compañera ha encontrado un estorbo. ¡Me encantó cuando la noquea de un puñetazo! A Harry también le habría abierto la cabeza por idiota y cobarde. Pero, Tom y Judy me han fascinado por su temprana edad y su valentía, para mí han sido los héroes del libro.Se lee bastante rápido, y son unos muertos vivientes diferentes (por ser los primeros) a los que hoy en día estamos acostumbrados. El final me ha encantado, pues ya sabéis que no me gustan felices ni perfectos... ¡quiero sangre, quiero dramas! Aunque eso sí, me he quedado con las ganas de saber una cosa: ¿dónde está el nieto de la señora Miller?"}, {"userName": "Rain Cross", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/33859084-rain-cross", "userReview": "Basado directamente en la película del mismo nombre de George A. Romero donde se sentaron las bases del zombi moderno, La Noche de los Muertos Vivientes nos narra lo ya vivido en la granja Miller.Con prólogo del mismo Romero, en el cual nos explica un poco cómo se desarrolló el rodaje y los entresijos del mundo cinematográfico de aquella época, la novela está escrita por John A. Russo, guionista de la película, por lo que suponemos de antemano que va a ser fiel a ésta, y no nos equivocamos.La narración es rápida, y a pesar de que ya sabemos qué va a pasar, nos aguardan un par de sorpresas de lo más agradables, como el añadir más gore en el último acto del libro, donde el caos se adueña de la granja Miller.En algunos momentos se me ha hecho algo pesado por las descripciones de las barricadas y en los momentos en los que Ben trata de fortificar la casa, pero el resto se lee de forma ágil y amena.Los personajes son los mismos que en la película de 1968, siendo Ben el más protagonista de todos y con el que más empatizas, ya que te pones en su lugar en todo momento y sientes sus dudas y frustraciones, y descubrimos algunas cosas más sobre él que en la película. Barbara, conocida por la famosa frase: Viene a por ti, Barbara, que su hermano Johnny le dice en el cementerio, sigue siendo insufrible. Se entiende que pueda estar en estado catatónico debido a la situación pero, al igual que el film, resulta ser más un estorbo que una superviviente. Tom y Judy, los más jóvenes, resultan ser los más valientes, y te entristece su destino. Harry es quien nos demuestra que el ser humano es el peor de todos, siendo en ocasiones un villano más peligroso (y estúpido) que los mismos muertos vivientes. En cambio, su mujer, Helen, se muestra como alguien con coraje que contradice a su marido en más de una ocasión. Y Karen... la pequeña que acaba... bueno, ya sabéis como, aquí se muestra más brutal si cabe que en su versión cinematográfica.También contamos con el punto de vista del comisario McClellan, personaje que en la película aparece muy poco y que gracia a él conocemos un poco más como se coordinaron los grupos de rescate.Los muertos vivientes que menciona el título, al igual que el film, son lentos, pero conservan algunos recuerdos que les hace capaces de usar piedras y otros objetos para lograr su cometido: devorar carne humana. Y las escenas en donde lo consiguen son explícitas y muy disfrutables.En general, La Noche de los Muertos Vivientes resulta una lectura rápida (son 192 páginas), que si bien es casi un calco al film, nos reserva alguna que otra grata sorpresa añadiendo sangre y vísceras y adornando más el acto final.¿Lo recomendaría?Si bien como he dicho se me hizo algo pesado en algunas partes, considero que los fans de la película de Romero no se lo pueden perder, ya no solo por el hecho de ser una adaptación fiel a ella, si no por las pequeñas novedades que esconde."}, {"userName": "Rafael Marmol", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/50823024-rafael-marmol", "userReview": "NOTE: This is a review for the Abridged Night of the Living Dead fully dramatized audio narration.As a fan of the original movie and the 90's remake, I can say this \"dramatized\" audio narration is an incredible departure from the source material. I'm not actually sure if the intention of the audio production director was to make this as silly and as campy as possible to make it comedic or if this was a serious attempt at producing a work based upon Night of the Living Dead. If it was meant to be comedic, they certainly succeeded. If it was meant to be serious, oh boy, did they miss the mark. I certainly hope it was the former because if it was the latter, Simon and Schuster needs to fire some people and enforce better quality control on their releases.Assuming this was meant to be comedic, the actors took the campiness to whole other level. The actress for Barbra was completely over the top and grating on the soul in her performance. Her screaming was so irritating it made my ears hurt. Not to outdone, the actor who played Ben took all the likability, leadership qualities, and rationality from the character and left him seeming like an angry black man bullying everyone else into doing what he wanted. Considering these were the main roles, they were responsible for carrying the story. The other actors were forgettable in their roles which ends up being more of a compliment to them since they weren't memorable for being as terrible as the main characters.Once again, if they were going for comedy, they certainly succeeded because I laughed entirely way too much at this audio production. The reasons above would outline why this is.If they were going for a serious adaption, the reasons above would outline why this was one of the worst attempts at adapting Night of the Living Dead ever. For the sake of everyone involved, I pray this wasn't the case. Finally, there are two main differences in the story which one didn't make sense and the other which could have been a somewhat creative difference which would have been fine if it didn't stomp all over the impact of the ending. The first difference is most likely a massive error or oversight. Throughout the whole story, we're being told the undead have no human qualities like speech, compassion, recognition of their loved ones, ect. These are fresh eating corpses. Near the end of the story, a zombie speaks...The other major difference is the fate of the last surviving member of the group.Overall, since I don't know the intention of the producer on this, I cannot give it a bad rating. If it was supposed to be comedic and campy, I'd give this four stars for managing to make me laugh more than I ever thought I could at people being eaten alive. If this was supposed to be serious, I'd give this two stars, only because it would fall into the category of being \"So bad, it's good.\""}, {"userName": "Dreadlocksmile", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/2075479-dreadlocksmile", "userReview": "First published back in 1974, the novelisation of the 1968 cult classic film ‘Night of the Living Dead’ was released a surprising six years after the initial release of the controversial yet highly successful movie. The novel was Russo’s debut literally release, which was later followed by a number of similarly pulp horror titles. Having co-written the screenplay alongside the legendary George A Romero, Russo was in the perfect position to extend the success of the N.O.T.L.D. franchise with the novelisation. What transpired was a too often overlooked novel that did the classic zombie movie justice, as well as adding a few elements of further insight into the classic storyline. After driving around for over two hours, Barbra and her brother Johnny eventually manage to locate their father’s grave where they have come to place a new reef and pay their respects. However, the night is quickly drawing in. As they go to leave, Barbra is attacked by a crazed stranger. Johnny wrestles with the attacker but is clubbed to death by the stone wielding attacker. Barbra flees to a nearby isolated house, which at first glance, appears empty. By now a few more of these ‘crazed’ individuals have arrived around the property. Upon exploring the house a little further, Barbra finds the remains of an old woman, whose corpse has been savagely mutilated. In her panic, Barbra attempts to flee from the house, but is halted in her tracks by the sudden approach of a car. Out of the car climbs a black man by the name of Ben who quickly fights off the attackers that have gathered around the front of the house, and takes Barbra back inside.Now inside, Ben begins to fortify the property by bordering up the window and doors with whatever wood he can lay his hands on. During this, Barbra remains in a catatonic state of shock in which Ben fails to get any sort of communication from the distressed young female. Whilst bordering up the house, Ben is shocked to find the sudden arrival of a small group of individuals who were hiding in the property’s cellar. The party consists of a young lad by the name of Tom and his girlfriend Judy, as well as the Cooper family (Harry Cooper, his wife Helen and their seriously ill daughter Karen).Ben already has a good idea of what is going on after a serious of dramatic incidents that eventually led him to arrive at this house. However, after the group listen to the emergency radio broadcasts and eventually the hourly emergency television broadcasts; they learn that the epidemic is in fact the dead returning to life and attacking the living for the consumption of their flesh. The broadcasts urge any individuals located in isolated areas, to make their way to the rescue centres that have been established all across the country. With this in mind, Ben begins to formulate a plan to get them out of this house. However, the numbers of the undead are swelling around the house with every minute that passes. A zombie siege has now started on the desolate house. And the rescue parties that are spoken of in the emergency broadcasts may never get to this remote building. A decision has to be made...and quickly.‘Night Of The Living Dead’ began life as a short story written by George A Romero, as an allegory inspired by Richard Matheson’s 1954 novel ‘I Am Legend’. Romero was half the way through converting the idea into a movie screenplay, when their film company ‘The Latent Image Inc’ (of which Romero was to be the film’s director), was ready to begin the filming process. While the team moved off to Evans City in Pennsylvania, John Russo (one of the company’s co-producers) took over the task of finishing of the scriptwriting. The end result was one of the most inspirational horror movies of all time, transcending all of the previous boundaries, and setting in place a new standard for which zombie films will be judged by.After the utterly unforeseen commercial success of the film, Russo made the decision to follow-up with a novelisation that closely followed the events of the movie. Indeed, there are hardly any differences, apart from a number of additional details that Russo has squeezed in to the story. The main one of these additions is the extra insight into the emergency rescue team, led by a Sheriff McClellan, who are making their way across the area, killing all of the undead that they encounter and rescuing any human survivors along the way. Russo dedicates a number of chapters to the progress of these groups, as well as delving into the characterisation of the principal individuals within McClellan’s party.Although the story originally started its life as a short story, Russo’s re-writing (adapted now from the screenplay) into a full-length novel still manages to maintain a good pace, with the tension never having chance to let up. Admittedly, the novel is not a fast paced, action-packed monster of a book; but Russo has kept true to the original story and delivered a powerful written version of the classic zombie siege.The characterization is adequately developed, with each personality appropriately fleshed-out. Harry Cooper is still just as cowardly and obnoxious, but now we are given small glimpses of the traumatic scenario from behind his eyes. Barbra’s desperate reaction to the undead attackers and the resulting catatonic state is transferred to the pages well.Russo’s breakdown of the novel into the various chapters is a little haphazard to say the least. The book contains a total of twenty-two chapters, although the first half of the book is divided up into just four chapters. This leaves the remaining half of the book to be broken up into eighteen odd chapters. Furthermore, the closer the reader seems to get to the end of the book, the shorter the chapters appear to be (roughly speaking). This may or may not be a purposeful concept for the novel, but it does cause the reader to wonder at the reasons behind such an odd format behind the structure of the book.All in all, the novel does the 1968 film justice, offering up a little extra insight into the details of the story, whilst still staying true to the original storyline. The few characters involved are full-bodied and proportionately fleshed-out, depending on their individual importance to the plot (i.e. less time is spent developing the characters of the likes of Helen Cooper and her daughter etc). A thoroughly enjoyable read and one that should not be overlooked by zombie and horror fans alike.The book also contains a ten page preface by George A Romero, in which he writes about the history of the story, detailing the filming process as well and talking about the ideas and principles behind the story (and dispelling a few notions from its over-analysis).The novel runs for a total of 176 pages (including the forward) and was first published by Pocket Books."}, {"userName": "Steven Ramirez", "userReviewDate": "May 28, 2017", "userURL": "http://www.goodreads.com/user/show/2781759-steven-ramirez", "userReview": "I believe there were two events in the twentieth century that established the era of the post-apocalyptic zombie. The first was the publication of Richard Matheson’s I Am Legend in 1954; the second was the release of the 1968 film Night of the Living Dead. Now, purists might argue that Matheson’s creatures were actually vampires, not zombies. Correct. But what he envisioned was a monster born of some global catastrophe not unlike the events depicted in World War Z. In previous decades, zombies were mainly slaves of the Haitian voodoo variety. And there weren’t a lot of them. There is nothing more nightmarish than having the entire planet swarming with the infected.I have only ever seen Night of the Living Dead on television, and still, it made a lasting impression. The line “They’re coming to get you, Barbara” is forever burned into my brain—a brain that those pesky ghouls probably want to munch on. I hadn’t realized that John Russo, one of the screenwriters, had turned this iconic film into a novel. Having read the book, I can certainly see why.Where the movie shows us the horror of being devoured by flesh-hungry ghouls, the book delves into the inner life of a few characters trying to survive something they simply don’t understand. I’m pretty sure that if something like this happened today, we would be more prepared than those innocent folks, having been brought up on The Walking Dead and Z Nation. But in the book, these people are clueless. And they cannot fathom the idea that the dead are shuffling around, not to mention the fact that they are pretty damned hungry.Try not to be jaded when you read this book. Remember, times were very different. The AIDS crisis hadn’t happened yet, or swine flu, or any of the other horrible outbreaks we’ve experienced in recent decades. The people in Night of the Living Dead were living small, ordinary lives. Then hell arrived."}, {"userName": "Олесь", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/76883618", "userReview": "Повівся на гучні слова в описі, про те, що це \"класика зомбі-горрору\". Якщо це класика, то годі й уявити, що написано в інших книгах цього жанру. Пізніше з'ясував, що книга написана на основі однойменного фільму, а не навпаки, як буває зазвичай. І справді, це більше схоже на переказ шаблонного жахастика. Текст це просто сухий виклад дій персонажів, без якихось описів, занурень в психологію чи ліричних відступів. Самі персонажі не викликають жодної емпатії, бо виглядають якось однобоко. Барбара, що всю книгу тільки те й робить, що верещить або навпаки ціпеніє, її протилежність Бен - двометровий красень, що легко перемагає зомбаків, завжди приймає вірні рішення за декілька секунд, а з Барбарою говорить виключно з глибоким розумінням та співпереживанням в очах. Це абсолютно штучні образи, яких не зустрінеш у реальному житті, тому до їх долі залишаєшся абсолютно байдужим. Були ще якісь персонажі, але вони взагалі нічим не запам'ятовуються. Тут немає красивої літературної мови та логічності викладу, немає оригінального сюжету чи хоч якогось рівня драматизму, немає натуралістичних чи шокуючих описів. Тому я так і не зрозумів, що в цій книзі має налякати."}, {"userName": "A Librería", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/56673098-a-librer-a", "userReview": "La noche de los muertos vivientes es uno de los clásicos del cine de terror. Criticada duramente por su gran contenido violento, la obra fue dirigida por George A. Romero, quien después abordó la película desde diversas perspectivas y de quien nos encontramos un prólogo hablando acerca de lo difícil que lo tenía el cine independiente en aquellos momentos.Crítica completa en: https://alibreria.com/2018/02/05/la-n..."}, {"userName": "Greg Kerestan", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/51899153-greg-kerestan", "userReview": "\"Night of the Living Dead,\" the movie, is a classic (and in the public domain), and I spent the summer of 2017 working on a stage adaptation for a Halloween event, since \"Rocky Horror\" rights were unavailable that year. This is the birth of the classic style zombie, which basically displaced the hypnotized \"voodoo zombie\" of the previous era. The plot is a little slow, the dialogue almost all exposition, but respect for the classics is in order here."}, {"userName": "Kaliban Escritura", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/32529830-kaliban-escritura", "userReview": "Magnífico en su crudeza y realismo. Aparte de ser una adaptación perfecta de la película, suple la carencia cinematográfica con una credibilidad en la psicología de sus personajes que hiela la sangre y eriza los pelos."}, {"userName": "Estanteriadecho", "userReviewDate": "Nov 10, 2016", "userURL": "http://www.goodreads.com/user/show/29439189-estanteriadecho", "userReview": "Reseña http://laestanteriadecho.blogspot.com..."}, {"userName": "George K.", "userReviewDate": "Oct 09, 2012", "userURL": "http://www.goodreads.com/user/show/4675995-george-k", "userReview": "Το βιβλίο βασίζεται στην πασίγνωστη ταινία τρόμου του Τζορτζ Ρομέρο και συγγραφέας του είναι ο σεναριογράφος της ταινίας, Τζον Ρούσο. Δεν μπορώ να καταλάβω γιατί επιλέχθηκε αυτός ο τίτλος και όχι ο πολύ καλύτερος Η νύχτα των ζωντανών νεκρών, αλλά αυτά έχουν οι φτηνές ελληνικές εκδόσεις τσέπης της δεκαετίας του '80. Η ιστορία είναι γνωστή, μια ομάδα ανθρώπων είναι αποκλεισμένη σε ένα αγροτόσπιτο κάπου στην αμερικάνικη εξοχή και προσπαθεί να αποκρούσει τις επιθέσεις των ζόμπι, που διψούν για αίμα και δεν καταλαβαίνουν τίποτα. Απ'όσο θυμάμαι είναι το πρώτο βιβλίο του είδους που διαβάζω και μου άρεσε. Είναι φυσικά παλπ και δεν μπορώ να του βάλω μεγαλύτερο βαθμό, αλλά η ιστορία ήταν καλή, η ατμόσφαιρα αρκετά τρομακτική, σίγουρα ηλεκτρισμένη, και οι σκηνές βίας ιδιαίτερα αιματηρές και γραφικές, κάτι που φυσικά και μου άρεσε. Το τέλος μου φάνηκε καλό, δεν ήταν αυτό που λέμε χάπι εντ όμως... Οι χαρακτήρες δίχως ιδιαίτερο βάθος, αλλά ποιος νοιάζεται; Η γραφή καλή, με ωραίες περιγραφές και ρεαλιστικούς διαλόγους. Δεν έχω δει την ταινία, αν και την έχω στην ταινιοθήκη μου. Θα την δω όταν ξεχάσω λίγο την ιστορία του βιβλίου. Το συγκεκριμένο βιβλίο της σειράς Βιβλιοθήκη του τρόμου των εκδόσεων Σίμωσι, είναι μάλλον από τα πιο σπάνια της σειράς και αξίζει να το αγοράσετε αν το βρείτε, τουλάχιστον για συλλεκτικούς λόγους."}, {"userName": "Sara Thompson", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/5242215-sara-thompson", "userReview": "This is one of those graphic novels that a parent must read before allowing their child to read it. It is not appropriate for children. It's not overly violent but there is a lot of drawn nudity and sex. I was a little shocked at how graphic that was.This graphic novel is based on the original Night of the Living Dead movie. It jumps around various characters and scenes as the first wave of zombies happen. There is some interesting insight to some of the characters that wasn't in the original movie.It's an okay story. I think I would have preferred if it stayed with just the original characters or excluded them completely. It just felt like something was missing. Granted it's going to be a series so that may account for some of the missing something but I can't say for certain. I can't really say I liked this either. It's not the worst I have read but it won't be the best either. It's entertaining enough."}, {"userName": "Dan", "userReviewDate": "Dec 19, 2013", "userURL": "http://www.goodreads.com/user/show/19657822-dan", "userReview": "The Night of the Living Dead novel resembles the film in many ways. Though the beginning contains an odd introspective introduction that is not included in the film and the ending is changed ever so slightly. Other than that it plays out the exact same way, often including many of the same lines, though sometimes improving them for a less clumsy read.Russo is a rather adept author, after a somewhat bumpy intro he hits his stride and the novel begins to flow. Like the film the suspense rises as tension builds in the house, and features a fantastic finale just like the film. Though it does feature some great gory gutmunching descriptions it does not rely on this as a gimmick.This book is to zombie literature, as it's movie predecessor is to zombie films, it checked all the boxes on the list and provided everything the genre needed to guide it on it's way. Like George Romero was a success as a first time film maker, John Russo is a success as a first time novelist."}, {"userName": "Holger Haase", "userReviewDate": "May 11, 2014", "userURL": "http://www.goodreads.com/user/show/17502896-holger-haase", "userReview": "Book adaptation of the classic horror film by one of its two creators.You know the film, you know the book.One of the few additions to this novel is in the depiction of the posse that roams the land to shoot the zombies (or ghouls as they are still called here).The famous downbeat surprise ending of the movie is left intact (though there is a small but somewhat crucial change about Ben's physical state that waters that ending down a bit) but we get more of a back story into the individuals that make up that posse. Whereas in the film they come across as anonymous blood-lusting rednecks enjoying a good hunt, here in the book they are closer to concerned citizens who are genuinely interested in assisting their endangered neighbours."}, {"userName": "Scott Wieczorek", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/15448820-scott-wieczorek", "userReview": "Being the progenitor of an entire genre, I had high hopes for this book. The plot and story line follow almost verbatim the movie. In fact, the book appears to be a mere adaptation of the screenplay into a fiction novel. Unfortunately, I felt the writing was poor and needed to be updated/edited for a more modern audience. From a proliferation of run-on sentences to head-hopping four or five characters in a single scene, I found it all too distracting to focus on the actual story. I really did want to give this book more stars, but feel that with the writing as-is, it causes too much of a major hurdle for this book to overcome. It's really a shame as I love good zombie fiction."}, {"userName": "Callie S.", "userReviewDate": "Jul 17, 2012", "userURL": "http://www.goodreads.com/user/show/10843750-callie-s", "userReview": "Poiché mi sono appassionata al genere alla veneranda età di trentadue anni, ho cominciato solo di recente a esplorarne i classici; e questo vecchio racconto, firmato John Russo, non delude: datato nello stile, complice anche il filtro della traduzione, porta in scena paure e topoi compositivi che avranno poi una lunga e fruttuosa vita editoriale.Fin dalla scena d'apertura la tensione narrativa è altissima e il sentimento di tragica ineluttabilità che pervade i protagonisti è trasmesso al lettore con apprezzabile efficacia."}, {"userName": "James", "userReviewDate": "Apr 12, 2009", "userURL": "http://www.goodreads.com/user/show/2213462-james", "userReview": "If you liked the film, then you will enjoy this basic straight port of the Russo script. There are some extra small touches along the way which help add some new colors to the tale as well, including [SPOILER:]the posse trained to decapitate the ghouls, and Ben's fate handled with some extra cutting remarks by Sheriff McClellan and his posse.[/SPOILER:].Recommended for fans of the film and zombie-fu followers in general."}, {"userName": "Christine", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/2439130-christine", "userReview": "This novel was fast paced and action packed, it was definitely a page turner but I didn't feel that the characters were developed enough for me to care if the lived or died. I think if the novel was slightly longer and it gave more of a background of each character I might have felt more suspense and fear for their lives. Still an enjoyable read though and I would recommend for all Zombie lovers."}, {"userName": "treva", "userReviewDate": "Feb 22, 2009", "userURL": "http://www.goodreads.com/user/show/1075019-treva", "userReview": "The first chapter is nearly word-for-word identical to the opening scenes of the film, but after this point, the novel does vary a little bit. I enjoyed learning quite a bit more about Ben and his motives. Harry Cooper is still the same ol asshole. I was also amused to read the word \"zombie\" in one spot; you'll notice the film never once mentions the z-word. George Romero's introduction was enlightening; he's an intelligent, well-written man."}, {"userName": "Marsten", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/5883864-marsten", "userReview": "Una maravilla de historia, un clásico del terror contemporaneo, que no puede faltar entre las lecturas obligatorias del género del terror.El bajo nivel literario del libro no merma el interés de la narración, llena de tensión, claustrofobia, miedo y escenas espeluznantes.El libro engancha mucho y la tensión va increscendo hasta llegar al final, un final brutal!Un buen libro cortito perfecto para iniciarse en esto del terror sin agobiarse!"}, {"userName": "Kathy", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/681853-kathy", "userReview": "I don't normally read novelizations, but when I saw that this was written by the man who wrote the original movie, I couldn't resist. Although it clearly follows the story of the movie, it is much more fleshed out and adds to the orinal movie. I have always loved this movie and am really glad I found this book!"}, {"userName": "Tony", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/5097186-tony", "userReview": "I had never even heard of the movie when I bought this book, which is a good thing, because reading it was and still remains one of the most viscerally terrifying experiences of my life. Seeing the movie first would have most certainly diluted that affect. My mother borrowed it when I had finished and returned it the next day. It scared her so much she couldn't even finish the first chapter."}, {"userName": "Evey Morgan", "userReviewDate": "May 05, 2016", "userURL": "http://www.goodreads.com/user/show/21724441-evey-morgan", "userReview": "Una obra maestra del género de terror sin duda. Me ha tenido enganchada y temerosa desde la primera página. Desde Hellraiser no leía nada igual. Sabía que me iba a gustar porque reunia todos los elementos para que lo hiciera, pero Russo lo ha elevado a otro nivel. La semana que viene subiré reseña completa en el blog: http://capitulo-26.blogspot.com.es/"}, {"userName": "Javier Balderas", "userReviewDate": "Apr 26, 2013", "userURL": "http://www.goodreads.com/user/show/19793647-javier-balderas", "userReview": "If you are a per or hardcore fan of the zombie genre this book is for you the story is one of the classic stories in the zombie world. It the beginning of the a world wide sensation that has what a zombie fan would want just enjoy the masterpiece"}, {"userName": "Elizabeth", "userReviewDate": "Nov 02, 2014", "userURL": "http://www.goodreads.com/user/show/2665937-elizabeth", "userReview": "If you like the movie, this is perfect. It really helped me understand a few things about Barbara and made me like her a bit more than I originally did. This movie is a classic and the book is a great companion piece."}, {"userName": "Nicole", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/47201454-nicole", "userReview": "It was ok I thought that it could have more details with the zombies. for those you like zombies book without great details then you would like it. but those like me who like the gruesome description of the zombies with more creepy nest than it not for you"}, {"userName": "Joe  Noir", "userReviewDate": "Jan 13, 2013", "userURL": "http://www.goodreads.com/user/show/16399833-joe-noir", "userReview": "A very satisfying fun read. A novelization of the movie by one of the screenwriters. Some paperback editions include a section of photos from the film. See also Russo's Return of the Living Dead."}], "description": "Out of the night they come. Filling the air with chilling howls, the dead are rising from their graves, bent on feeding on the flesh and blood of the living. They seek out human life. And these monstrous corpses will let nothing stand in their way as they hunt down the living to satisfy their own evil desires.", "title": "Night of the Living Dead\n      \n          (The Living Dead #1)", "url": "http://www.goodreads.com/book/show/93568.Night_of_the_Living_Dead", "average": 4.07, "cover": "https://images.gr-assets.com/books/1171256962l/93568.jpg", "reviews": 39, "authors": [{"url": "https://www.goodreads.com/author/show/63949.John_Russo", "name": "John Russo"}], "type": ["Horror", "Horror", "Fiction", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/93568.Night_of_the_Living_Dead", "http://www.goodreads.com/book/show/28486290-la-noche-de-los-muertos-vivientes", "http://www.goodreads.com/book/show/418695.Night_of_the_Living_Dead", "http://www.goodreads.com/book/show/12344191-la-noche-de-los-muertos-vivientes", "http://www.goodreads.com/book/show/23267929-night-of-the-living-dead", "http://www.goodreads.com/book/show/13458952-la-notte-dei-morti-viventi", "http://www.goodreads.com/book/show/418697.The_Night_of_the_Living_Dead", "http://www.goodreads.com/book/show/593529.Night_of_the_Living_Dead", "http://www.goodreads.com/book/show/9458232-undead", "http://www.goodreads.com/book/show/11298141-holiday-of-the-dead", "http://www.goodreads.com/book/show/593534.Return_of_the_Living_Dead", "http://www.goodreads.com/book/show/8268196-night-of-the-living-dead-volume-1", "http://www.goodreads.com/book/show/519092.The_Complete_Night_of_the_Living_Dead_Filmbook", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}