{"ratings": 8820, "userreviews": [{"userName": "Jeanette  \"Astute Crabbist\"", "userReviewDate": "Dec 05, 2008", "userURL": "http://www.goodreads.com/user/show/796425-jeanette-astute-crabbist", "userReview": "April 21, 2014: Rest in peace, Alistair MacLeod. Died April 20, 2014.His extraordinary style will never be matched. Another outstanding piece of storytelling from this great Canadian writer. He uses repetition of images and phrases throughout the book as a very effective tool. It gives the story both a rhythm and an anchor, continually bringing you back to reminders of what binds the clan and their shared history.This is the story of the Scottish clan of Calum the Red, who came to Nova Scotia over 200 years ago. They come from that rich ancient oral tradition where the family stories are repeated endlessly through the centuries, and added to as events progress. They're all so hopelessly inbred within the clan that they can barely keep track of who's who. There are THREE Alexander MacDonalds in the story! All cousins who basically look the same, redheaded but dark eyed. Even the dogs are inbred, descended from the brown dog Calum the Red brought from Scotland. Given the confusing family ties, I thought the author did an amazing job of setting them apart so I could keep track of all the people.The main story takes place in modern times, with the narrator telling his story of being raised by his grandparents after his parents died when he was three years old. The behaviors and connections of the clan are so deeply rooted in the ancestral experiences that the oft-repeated histories and songs sometimes appear more real and important than current events."}, {"userName": "Maciek", "userReviewDate": "Apr 04, 2012", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "I just learned that Alistair MacLeod died yesterday. This shouldn't be such a shock - he was 77, and suffered a major stroke in January which forced him to remain in a hospital in Windsor, Ontario - a city where he lived and taught, and ultimately passed away. I was reading materials on him work just a few weeks ago and he was still with us, and now he's not. Despite being an acclaimed author in his native Canada and abroad, Mr. MacLeod remained a very private person - I had no idea about his condition, and the abrupt news of his death were unexpected and touched me.No Great Mischief is Alistair MacLeod's only novel - before it he was mostly known for his short stories, which were ultimately collected in Island: The Complete Stories. Alistair MacLeod was born in North Battleford, in the prairie province of Saskatchewan, but his fiction is set in the Canadian maritimes - mostly in Nova Scotia's Cape Breton Island, where he came to live at the age of 10. Although he later moved to Windsor and taught at the local university for over four decades, every year he returned to Cape Breton for the summer. The long history of the island, its unique culture and unrelenting weather provided plenty of inspiration for these fictions, which ultimately culminated in this book - Macleod was 64 when it was first published, and it has since won him a number of awards and honors. In 2009 was voted to be Atlantic Canada's greatest book of all time.No Great Mischief begins in the fall, my favorite season, with the narration of Alexander MacDonald, a successful orthodontist who journeys across southwestern Ontario on Highway 401, from his home in Windsor towards the city of Toronto, where he is to see Calum, his older brother. It is September, the golden month, and as Alexander notes in the splendid autumn sunshine the bounty of the land is almost overwhelming, as if it is the manifestation of a poem by Keats - and the drive to Toronto becomes one towards the past, as the emotional ties between brothers give way towards a narrative mirroring almost whole of Canadian history, starting from the expulsion of Calum MacDonald and his family from the Scottish Highlands in 1779 and their journey and subsequent arrival in Cape Breton, the land of trees, where they would form the clann Chalum Ruaidh - a closely knit community with its own identity and history. The title comes from general James Wolfe's assertion of the fierce Scottish Highlanders, whom he summoned to fight in the Battle of Plains of Abraham: \"hey are hardy, intrepid, accustomed to a rough country, and no great mischief if they fall.\"This is - and most likely will remain - Alistair MacLeod's only novel. He was a perfectionist, and one who never rewrote his work - he wrote a sentence of a story, waited for the muses, and wrote another sentence. He also wrote the final sentence halfway through, as a light to guide him throughout it. No Great Mischief in both form and theme is reminiscent of the oral tradition of storytelling, when an elder would sit down in front of his audience and begin to tell his story; there aren't any wasted words here, and in its short length (under 300 pages) the novel manages to describe history of generations of people and a country. It isn't a perfect book - there are many moments where MacLeod veers too close to bathos, such as by having his characters randomly break into songs in Gaelic one too many times - and the symbolism is sometimes too obvious - there's one scene where a character walks into a room with a t-shirt saying living in the past is not living up to our potential - but it is a book full of genuine charm and purely human heart, a product of great effort and time, and one that I will read again. This is why, in honor of the author, I am giving it the extra fifth star - with sadness, as we will not read a story by him again. Rest in Peace, Mr. MacLeod.'All of us are better when we're loved'"}, {"userName": "·Karen·", "userReviewDate": "Oct 27, 2014", "userURL": "http://www.goodreads.com/user/show/1652898-karen", "userReview": "We are all better when we're loved.\n1940s Cape Breton is a place untouched by modern ideas of individualism. Here identity is not forged by choices made, but by birth into a history, birth into a clan, birth into your place in that lineage that stretches back to Calum Ruadh who came from Moidart to the New World in 1779 when he was a man of 55, who lived another 55 years in the land of trees, giving his life a strange sort of balance. Who are your parents, who are your grandparents, those are the questions to establish who you are. Ah, clann Chalum Ruadh. That is who you are.Our narrator is Alexander MacDonald, but he hardly knows his own name until poked by a cousin when he fails to respond to it called from the roll at school. He is gille beag ruadh, the little red-haired boy. Years have passed since that time; he drives from south west Ontario to visit his eldest brother Calum in Toronto, stranded there in the back lanes between Spadina Avenue and Yonge Street, a man who has nothing, a man who has everything. In majestic, sweeping rhythms, 'ille beag ruadh interweaves the history of his family and of the MacDonalds, those same MacDonalds betrayed by the Campbells at Glencoe, those highland men who fought alongside General Wolfe on the plains of Abraham, of whom the General said \"They are hardy, intrepid, accustomed to a rough country, and no great mischief if they fall.\" Past and present drift and mingle, indistinguishable. Is it nought but fine irony when a young woman in a black T-shirt walks towards him: the T-shirt carrying the slogan \"Living in the past is not living up to our potential.\"?The men of the clan work the land and the sea, and when that no longer serves, Alexander's brothers set off to work deep under the surface in the uranium mines of Elliot Lake. When a cousin, also Alexander MacDonald, is killed in an accident, this Alexander MacDonald steps in to fill his place. He, in turn, is replaced by another cousin, another Alexander MacDonald, come from California to escape the draft. They are elements in a complex network, one that demands fierce loyalty and equally fierce adherence to a code of honour among blood. When that code is broken, Calum, the eldest, the leader, must take the rap. Equally as remarkable as the relations between brothers and cousins is the relationship between man and beast; even the dog who cares too much and tries too hard, even the horse who always keeps her side of the bargain, aye, even they show that fierce loyalty. Only the sister is a weakness in the construct of this saga, as she appears too much as a mere spokesperson, a history lesson, a lecture for our edification, but not our delight. And the ending slips just a touch into melodrama and sentiment, twin spectres at the feast, so successfully shut out from all that had gone before, although the chance for them to wheedle their way in was often there. But somehow a book has to end, and why not with a death foreseen, and a return home across a storm swept causeway. Crossing to the other side, indeed.Soundtrack:http://www.youtube.com/watch?v=wT_Gdy..."}, {"userName": "Miles Kelly", "userReviewDate": "Mar 06, 2011", "userURL": "http://www.goodreads.com/user/show/3325839-miles-kelly", "userReview": "I guess this is not my sort of book. It is the tale of Scots in Cape Breton and in particular a branch of the MacDonalds, and makes much of how they never forgot their roots, always stick together, and still speak Gaelic. It won various prizes and is considered the best Atlantic Canadian novel. But how it got so esteemed I have no idea. I found it tiresome and longwinded. There is really not much of a plot except a bunch of disjointed anecdotes. The characters are little more than mouthpieces for their ethnic background - continually making historical references (to Culloden and Wolfe) at any moment and continually reciting the same lines. It is difficult to know who is speaking or where they are speaking since they all say the same things all the time. And nothing much happens but even what does happen makes little or no impact since none of the characters seem to have any depth. One character called Alexander MacDonald gets replaced by another character called Alexander MacDonald for no particular reason. The traveling to Scotland falls particularly flat as everyone they meet is out of a North American fantasy of the Scottish Highlands. Immediately recognizing the MacDonalds by their red hair and black eyes and talking of the '45 and Prince Charlie as if it all happened yesterday."}, {"userName": "Paul Burry", "userReviewDate": "May 20, 2009", "userURL": "http://www.goodreads.com/user/show/2338304-paul-burry", "userReview": "\"My sister was silent for a moment.'Calum once told me,' I said, 'that when they went back to the country, they went one day to cut a timber for the skidway they were making for their boat. They went into a tightly packed grove of spruce down by the shore. In the middle of the grove, they saw what they thought was the perfect tree. It was tall and straight and over thirty feet high. They notched it as they had been taught and then they sawed it with a bucksaw. When they had sawed it completely through, nothing happened. The tree's upper branches were so densely intertwined with those around it that it just remained standing. There was no way it could be removed or fall unless the whole grove was cut down. It remained like that for years. Perhaps it is still there. When the wind blew, the whole grove would move and sigh. Becuase all of the trees were evergreen they never lost their foliage, and the supporting trees extended their branches every year. If you walked by the grove, Calum said, you would never realize that in its midst there was a tall straight tree that was severed at its stump.'\""}, {"userName": "BrokenTune", "userReviewDate": "Nov 17, 2014", "userURL": "http://www.goodreads.com/user/show/10592271-brokentune", "userReview": "\"The ‘lamp of the poor’ is hardly visible in urban southwestern Ontario, although there are many poor who move disjointedly beneath it. And the stars are seldom clearly seen above the pollution of prosperity.\"This, in short, is what I liked about the book. Yes, I do mean that particular quote. I know this is one of those books that a lot of people seem to really like, and I can understand why, but for me this was a frustrating and really annoying read. To the extent that I even got annoyed with things I would not usually pay much attention to, like \"Why is the guy's Gaelic name spelled in two different ways?\".To paraphrase the author himself: \"She could not help it, I suppose. Sometimes it is hard to choose or not to choose those things which bother us at the most inappropriate of times.\"Anyway, No Great Mischief tells the stories of a family from when they first left Scotland for Canada in 1779 up to late 1970s/1980s (it's not really clear). There are plenty of colourful characters, plenty of stories of hardship, and an abundance of nostalgic references to Scotland - or rather one single event in Scottish history. For the most part, the references were limited to the Battle of Culloden and the Jacobite Uprising (around 1745/46). And this, together with the nostalgia for anything Gaelic just really got on my nerves rather quickly.Don't get me wrong I have rather a soft spot for Gaelic and I delight in watching BBC Alba sometimes just to hear it while reading the subtitles, but we're talking about a story relying on a few overused phrases and pretending as if everyone with the last name of MacDonald is fluent in it. As for the Jacobite Uprising...Really, there is more to Scottish history and not everything that happened to the MacDonalds of Cape Breton in the 20th century can be blamed on or explained by a reference to an event in 1745/46.Let me illustrate...One of the MacDonald's relatives living in California is being drafted to fight in the Vietnam War and his parents send him to the branch of the family in Cape Breton to escape the draft. And the discussion is as follows:\" ‘From what I understand of this war,’ he continued, ‘those people are only fighting for their own country and their own way of being. It’s hard to say they should be killed for that.’‘I know,’ I said. ‘Wars touch all of us in different ways. I suppose we have been influenced by lots of wars ourselves. We are probably what we are because of the ’45. We are, ourselves , directly or indirectly the children of Culloden Moor, and what happened in its aftermath.’‘Yes,’ he said with a smile, ‘the old men at home, the seanaichies, always used to say, “If only the ships had come from France …”’‘Maybe,’ I said. ‘We’ll never know. Perhaps it was all questionable from the start. Talking about history is not like living it, I guess. Some people have more choice than others.’ \"Aha, yup. Culloden. Of course. Everything can be traced back to Culloden. No mention of the Union of Crowns, the bribery surrounding the Darien scheme, and the resulting Act of Union. Or why not go back further to the wars of Scottish independence?Incidentally, I do get that part of the book's message is how people might be held back by living in the past - or as MacLeod puts it: \" ‘Living in the past is not living up to our potential.’ \"It's just that this message - conveyed as a joke - is rather muddled by a lot sentimental illusion."}, {"userName": "Brian", "userReviewDate": "Dec 30, 2008", "userURL": "http://www.goodreads.com/user/show/198932-brian", "userReview": "Set in Cape Breton in the nineteen seventies, No Great Mischief revolves around the visit of a successful orthodontist to his alcoholic brother eking out a miserable existence in a sqalid room above a shop in Toronto. The visit is the starting point for a narrative that follows the fortunes of a group of Scots-Canadians descended from one legendary eighteenth century immigrant. Hardy and tightly-knit in the face of recurring tragedy, the extended family see themselves and the rest of the world with reference to their group identity. But it's an identity that is being eroded by modernity and the book is an elegy to the last generation of the clan to understand itself in this way. The robust storytelling is woven around with imagery that explores the book's central themes of leadership, community, intransigence and betrayal. Poignant and intelligently written, this is a book quite unlike much contemporary fiction in that its concerns are not only with the personal but also with community."}, {"userName": "Joanna", "userReviewDate": "Mar 29, 2009", "userURL": "http://www.goodreads.com/user/show/620387-joanna", "userReview": "I really enjoyed this book -- much more than I'd expected to from reading the description. I know very little about Canada's history or even its geography, so I actually found myself occasionally consulting a map to locate the relevant places from the text. The writing was beautiful and managed to be sentimental without being sappy or sarcastic. I'd recommend this book to anyone looking for a powerful read that sneaks up on you as you're going along."}, {"userName": "McKel", "userReviewDate": "Jan 18, 2008", "userURL": "http://www.goodreads.com/user/show/799836-mckel", "userReview": "I absolutely loved this book. I would recommend this book to anyone, especially if they are descendents from Scotland or Ireland. It deals with the struggles that people have trying to hold onto their roots, yet becoming a part of a new society. It's the old world vs. the new world struggle. Some embrace the \"modern\" world and leave their family and their legacy to be part of this world, while others desperately hold onto whatever heritage they have left and forfeit a lot to do it.Another aspect deals with a person's connection to their geography. A common thread in Canadian literature deals with nature's unwillingness to change to man's desire. For example, a plowed field will once again create weeds and take over again. It's a constant battle between man and nature.This book is well written and well thought out. Worthy of reading."}, {"userName": "Sharon", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/5934145-sharon", "userReview": "Alistair MacLeod doesn't waste a word as he tells the story of a fiercely loyal family bound by shared history and culture even as they move through tragedy after tragedy to make their way in the \"new country.\" The story is told through the eyes of Alexander MacDonald, orphaned as a child by a terrible tragedy and raised by his grandparents. Repetition of phrases, proverbs and themes, juxtaposition of current and past circumstances, reflection on the MacDonald clan's past tragic history, musings about the irony of trying to determine \"which of us were the lucky ones\" as each new family tragedy unfolds -- these and other literary devices powerfully impact the reader and convey the way in which members of this clan are sustained by a family history that lives on within them. Throughout the book runs a hauntingly beautiful Gaelic refrain, binding the family together across generations, regardless of modernization or the dementia of old age.Reading this book while in a Cape Breton to visit my husband's MacDonald family made the reading of this book especially meaningful for me. MacLeod captures perfectly the culture of the island and the struggle to hold on to its unique identity and ancestral culture in the face of modernization and so many of its young people \"heading west.\""}, {"userName": "Bill", "userReviewDate": "Feb 04, 2008", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "This was a Christmas gift from my mom, and it is also one that I would have bought for myself.It won several international awards, and the back cover and inside pages are lush with glowing reviews from across the literary landscape of esteemed writers and reviewers.(You can see where I'm going with this, can't you?)It's a story that roots itself, for the most part, in my birthplace, Cape Breton, Nova Scotia And, it's a novelization about the MacDonald clan! This novel had so much going for it for me before I even cracked the cover open that it pains me now to write a disappointed review.Not that it was that bad, but because it wasn't that great. There were some nice observances and some good imagery, but I don't know, the novel as a whole just had a certain blandness to it and didn't really do a whole lot for me. It was short, so not a lot of time to devote to it so sure, give it a shot if you want. Who knows, you just may respond like the Globe and Mail reviewer who called this the book of the decade. Funny, I seem to find all \"great writers (Ondaatje, etc.)\" terribly bland and uninteresting. Maybe ahm jus' stoopid."}, {"userName": "Val", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3920677-val", "userReview": "MacLeod is a wonderful writer, but I found nothing to lure me to this fictional memoir of a family descended from Scotland. Actually, I found most of the story quite boring other than certain characters' relationships with animals. The Gaelic inclusions were interesting but after a while I found myself skipping over these passages because I neither knew how to pronounce them nor how to translate them. I really do not understand all the praise for this book - it seemed that each time MacLeod hit upon a new mantra for his characters to use he would just repeat them over and over."}, {"userName": "Laurel", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/15977158-laurel", "userReview": "I read this book, quickly, in less than twenty-four hours. It really held my attention, and I was interested to see how it ended. This novel won several major literary prizes when it was published in 1999 by Alistair Macleod, a Canadian writer. The narrator is an orthodontist, who frequently visits his alcoholic older brother in a rundown rooming house on downtown Toronto. These visits provide the opportunity for the narrator, Alexander MacDonald, to tell the story of his family's history in Canada, the clan of Calum the Red, dating back to their settlement in Cape Breton, Nova Sçotia, in 1779.The present day members of the narrator's clan are forever ever linked to all Macdonalds of previous generations, proudly tracing their roots back to Scotland. The stories of how different generations coped with living in the \"land of the trees\"' beside the sea, are poignantly interwoven into the narrator' s present day task of visiting his brother Calum, an ex-con and a drunk, with the events of his childhood, and the relationships between himself, his twin sister, the grandparents who raised them and the multitudes of cousins and other relations who had a hand in his upbringing as a member of the clan. Music, oral history, homesteading in a difficult natural environment, uranium mining in Elliott Lake, and present day cultural influences are all tied together to suggest that regardless of where you go, you frequently take the past that has moulded you into your modern self, with you. Macleod's writing style is somewhat sparse, yet poetic. He excels at creating vivid images in your mind's eye. I could visualize the scenes in the old kitchen, with members of the family gathered round, listening to a grandfather's story passed from generation to generation, with dogs panting on the floor, and whiskey or beer being passed around. I was down in that terrible uranium mine, feeling the silica and water running out of drenched gloves as Alex and his brother drilled into the tough Canadian Shield for 12 hours a day, since there was limited work to be found at home. How many folks from the east, have travelled great distances to find work, in our present day? A common thread and link to the past. Macleod is really adept at describing many examples like this one, making the past relevant.I have yet to visit Nova Scotia, but will certainly think of the traditions and pride, the courage and steadfastness of the clans who settled Cape Breton, and whose relatives strive to keep their Celtic heritage alive, when I visit the land of the trees. I was moved by the story Macleod wove, and thought that his narrator' s grandfather, likely shared some of the qualities of my dad's parents. Around 1900, they tried valiantly to homestead in the northern reaches of Saskatchewan-without a doctor to birth three children or nurse a family through a long bout of scarlet fever. There were deadly blizzards when you could die only several yards from your cabin or barn, you lost hold of the life saving rope strung from cabin to barn through the long winter.The clan suffered its own winter tragedy, which had an enormous impact on the entire family, but particularly the narrator. To say more would lessen the impact, and deprive the reader of a crucial experience, and undermine the author's plan for the reader. I think reading this book brought me closer to my own past. That alone, makes it worthwhile."}, {"userName": "MacDuff", "userReviewDate": "Nov 08, 2008", "userURL": "http://www.goodreads.com/user/show/159371-macduff", "userReview": "This is the second time I've read this book, and I was teary-eyed at the end again. It's the story of the clann Chalum Ruaidh, or the Clan of Calum the Red, an 18th century Scottish Highlander who crossed the ocean to Nova Scotia. His family, the following clann, has to come to terms with the fact that their somewhat famous ancestor crossed the ocean to start a new life with his family...to what end? This is an absorbing novel, and MacLeod is an incredibly mature writer. With anyone else, it might have seemed to drag. But MacLeod has the ability to weave the story so that the reader isn't necessarily concerned with moving forward and progressing through the plot as she is concerned with penetrating the family history, Scottish history, and Nova Scotian history in general. This is a lovely, lovely book. It's something that stays with you long after you finish it."}, {"userName": "Tom", "userReviewDate": "Dec 14, 2010", "userURL": "http://www.goodreads.com/user/show/1040328-tom", "userReview": "I thought this was one of the most poorly written books that I've ever read. I get the whole struggle of immigrants to hold on to their roots and the scourge of alcoholism, etc. However, I found that the dialogue didn’t ring true in that I don’t think people actually speak the way it was written. All the characters seemed to do was to rehash legends of their ancestors, which is all well and good. But they were the same legends told over and over and didn't advance the plot at all. And the constant repetition of the clan’s name and that they had red or black hair and the fact that the moon was the “lamp of the poor” was unbearable."}, {"userName": "Lynn", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/8281578-lynn", "userReview": "Beautifully written story about a remote community and an enduring family."}, {"userName": "Anita", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/29405146-anita", "userReview": "This haunting story stays with you long after you have put down the book.It is beautifully written, the descriptions of the settings are so evocative that I actually felt as if I had visited Cape Breton myself.It tells the story of a family, the MacDonalds, who leave Scotland in the late 18th Century to journey to Canada, and it follows the lives of their ancestors in the Cape Breton area of Nova Scotia. Most of the MacDonald clan intermarry, so that they form a very tight-knit community, who remain fiercely loyal to their kin.Most of the characters are finely drawn. I especially loved the Grandma, the two Grandfathers and Calum the eldest grandson; also the various animals owned by the MacDonalds in the story. I grew to love Cindy, the horse, and the family dogs, loyal to their deaths. The only character who, to me, remained shadowy was the granddaughter, twin to the narrator, Alexander MacDonald. He is one of three Alexander MacDonalds in the story, which the author cleverly distinguishes from one another, so that the reader does not become confused.The only other criticism I offer is the fact that the book contains a lot of history of the Scottish Highlands, with which many readers will be unfamiliar. There are also many Gaelic songs and expressions. This is a story of courage in the face of hardship, set in an unforgiving environment. Those who have left their homeland to find a \"better life\" often discover that life is not any better in their New Land. It is a sad tale of loss and the unpredictability of life, but there are amusing moments especially given Grandpa's antics when inebriated. Recommended."}, {"userName": "Katie", "userReviewDate": "Mar 10, 2013", "userURL": "http://www.goodreads.com/user/show/4302491-katie", "userReview": "A friend recommended (and dropped off) this book for me to read. In contemplating my review, I've just decided to (word-for-word) hash out my text message to her on my feelings toward \"No Great Mischief.\" That way I don't have to re-think my feelings for this book a second time.Conversation:Friend: Did you like it? (Don't be afraid to tell me your true thought).Me: \"I thought the book was alright, but definitely not a favorite. Which slightly surprised me because this was a historical fiction novel and those are my favorite! I got annoyed with all the Gaelic words and references. And I felt that the author didn't explain the war very well so I had a hard time with all the references to the war and what it was trying to allude to. I hated that the author used grandfather to describe one paternal grandparent and grandfather to describe the other maternal grandparent. It was extremely confusing and I didn't figure it out until I was 2/3 through the book. I also had a hard time understanding the \"point\" the author was trying to carry across. The back of the book was captivating and I was excited to read more and more to find out about this \"murder\" that takes place. But it didn't happen until 10-20 pages from the end. That was frustrating and I felt that the author could have done a lot more to develop that plot or idea. So overall, I guess, it was okay. Sorry the review was a little harsh, but I'm only reading for an hour in the middle of the night... So I'm moody at this time and need a book with more guts.\"And... yup... I think that summarizes my feelings for this book."}, {"userName": "Catherine", "userReviewDate": "Oct 15, 2012", "userURL": "http://www.goodreads.com/user/show/867628-catherine", "userReview": "This book snuck up on me. It started so slowly, with a successful orthodontist driving to visit his alcoholic older brother. While this \"current\" (actually 1970s) storyline continues throughout the book, the majority of the novel consists of flashbacks which reveal the past and what brought the brothers to such different places in life. These two brothers come from a huge Scottish-Canadian clan, descended from the twelve children of Alexander MacDonald who settled on Cape Breton Island in Nova Scotia. The narrator is also named Alexander MacDonald, as are several other characters. Don't worry, it's not as confusing as it sounds. There are stories from the Highlands (which made me wish I knew more about Scottish history), from the narrator's childhood and young adulthood, as well as more recent interactions between him and his twin sister, who also left the poverty of island life behind. MacLeod's writing has a distinctly Gaelic sensibility that I love: dark but warm, unapologetic, and a little bawdy. His tendency to ramble is mostly charming, but sometimes his tangents wandered a bit too far off course. Disappointingly, this is the only novel he has written. He apparently excels in the short story format, which isn't my favorite, but may be worthy of an exception in this case."}, {"userName": "Shirley Schwartz", "userReviewDate": "May 24, 2014", "userURL": "http://www.goodreads.com/user/show/4278399-shirley-schwartz", "userReview": "This novel by the great Alistair MacLeod is one that I'm sure is offered in creative writing classes. If it's not, then it should be. It is a novel about the MacDonald family. They came from Scotland and settled in Cape Breton Canada looking for a better life. But where the MacDonald's go, it seems that hardship and tragedy follows them. On board ship, the MacDonald patriarch loses his wife, leaving his six children motherless. He then marries his wife's sister and they have six more children and then she dies. This man is Alexander MacDonald's great grandfather, and it is with Alexander that we explore the lives of the Canadian descendants. Alexander experiences a huge loss when he and his twin sister are three, and as a result, they are raised by their Grandma and Grandpa. Their brothers are much older and find themselves making their own way through life, but they remain a part of Alexandar's. It is a rich, rewarding life that Alexander and his sister live. One filled with love and warmth, but marked with sadness and sorrow too. The story goes back and forth from Alexander's childhood to his life as an adult, but so seamlessly that you don't even notice the shift. The book is funny, poignant and at time unrelentingly sad, but it is a book that is meant to be savoured and enjoyed. The MacDonald clan is not one that I will forget soon."}, {"userName": "Taka", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/73783-taka", "userReview": "Wonderful—It's quite a novel: clocking in at 281 pages in the edition I read, this covers much more than what 281 pages usually covers—the history, the family saga, the depth of characters, the richness of the setting are all here, delivered in a precise, beautiful prose. You come to inhabit these people on Cape Breton, breathe their culture, appreciate their customs and beliefs, and love them. You'll laugh at the jokes of Grandpa, you'll be touched by the dogs and by the strong family tie, and you'll weep, heartbroken, at the end.Though everyone talks almost identically, in the formal, precise, yet lyrical language of the protagonist, it still worked to impart the dialogue and the texture of the story as a whole with a foreignness, maybe even a mythical quality, which is fitting for a story that explores history, folklore, and memory.This is not a plot-driven novel. This is not for people who'd like a quick read. It's a story that works more like a poem in that it's driven by imagery, by disparate memories that are not always told linearly, but associatively. Once you get used to the pace and nature of the novel, you'll be able to relish every moment with the Clan Calum Ruadh.Highly recommended."}, {"userName": "Lindsay Wilson", "userReviewDate": "May 27, 2012", "userURL": "http://www.goodreads.com/user/show/6760889-lindsay-wilson", "userReview": "Despite making it more than halfway through this book yesterday on a plane, I found myself really uninvested in the characters and their disjointed story. As a result, I basically just skimmed through the rest. I can see why so many people like it, as it's quite well-written, but it's surprisingly dull, given how esteemed it is. The story of Alexander's parents and grandparents is quite interesting, and I actually was intrigued about where the story was going, but once the story starts to focus around Alexander and his brothers, my interest basically collapsed. I will never, for the life of me, understand why authors think it's a good idea to give multiple characters the same name. I get that it's all supposed to be about constancy through the generations and things like that, but to me it's always just seemed unnecessarily confusing. So, 3-4 stars for an intriguing start, but only 1-2 for the second half of this book. Since the crappier half seemed extra disappointing given the decent beginning, I've rounded down from this distorted averaging system and decided on a 2."}, {"userName": "Tee Jay", "userReviewDate": "Apr 16, 2010", "userURL": "http://www.goodreads.com/user/show/3573856-tee-jay", "userReview": "How could I not like No Great Mischief? This novel is about Elliot Lake, the town in which I was born, and also Sudbury, the town in which I currently reside. Oh, and there's some uranium mining and rugged Northern Ontario terrain thrown in for good measure. The story itself is not that bad either. The impression I had when I read No Great Mischief was that of a novel made up of short stories. Each chapter was almost autonomous from the rest of the story. However, one could not understand them individually if they were not read as a whole. Many geographic locations are covered in detail and this novel could almost be categorized as historical fiction as there is a lot of history found within the pages. No Great Mischief is a fine example of Canadian Fiction and would be a good addition to anyone's bookshelf."}, {"userName": "Ann", "userReviewDate": "Sep 10, 2015", "userURL": "http://www.goodreads.com/user/show/2042479-ann", "userReview": "Came across this book and decided to reread it and see if I still loved it. I do. A/the Great Canadian Novel by the late Alistair MacLeod. This saga of the MacDonalds of Cape Breton starts with their historic emigration from Scotland. These unforgettable details are necessary because the legend lives on in the family members. A family tragedy haunts younger family members whose lives are altered in memorable ways. Some MacDonalds move west to Ontario and some farther. Great characters abound -- Grandpa and Grandfather, Calum and Grandma. Unforgettably tender scenes feature dogs, horses and tomatoes in Leamington.MacLeod only wrote one novel, but like Harper Lee's To Kill a Mockingbird, it is a treasure."}, {"userName": "Patrick", "userReviewDate": "Mar 11, 2009", "userURL": "http://www.goodreads.com/user/show/646953-patrick", "userReview": "I am ambivalent about this book, and not sure whether or to whom to recommend it. The prose is good, and the depiction of place and person compelling. The problem I have is that most of the characters are basically thugs and punks. I am not sure if I am supposed to somehow identify with them (which I cannot, despite my Scots heritage), or to be put off (which seems an odd motivation for a writer of fiction). Unlike the main character, I cannot reconcile the two into a sensible whole. Bottom line: try it for 50 pages, and if it grabs you, fine; if not, have no illusions that it will evolve into something else."}, {"userName": "Shannon", "userReviewDate": "Mar 23, 2009", "userURL": "http://www.goodreads.com/user/show/1715547-shannon", "userReview": "A fairly typical Canadian novel with flawed characters, tragic events and disfunctional families. What truly sets this book apart is its precise writing that directly reflects the changing nature of the relationships. There is hope and humour alongside the sadness and toil. For anyone who wants to read a good Canadian novel, I would recommend this one."}, {"userName": "Louise", "userReviewDate": "Sep 19, 2012", "userURL": "http://www.goodreads.com/user/show/5108969-louise", "userReview": "I read this book about 16 years ago and gave it 4 stars then. Today I am giving it 5 stars. Middle age gives you a different perspective."}, {"userName": "Amanda", "userReviewDate": "Jan 10, 2018", "userURL": "http://www.goodreads.com/user/show/2981443-amanda", "userReview": "I bought this novel last year when in Scotland and picked it up last weekend, after a week of being unable to read or concentrate because of an accident my son had.The gentle, rolling rhythm of McLeod's prose carried me through this masterful work effortlessly and, now that it's finished, I know I'll miss the family depicted in the pages. It's been voted Atlantic Canada's greatest book of all time - and I'm not in the least surprised.While I have little knowledge of the Scottish historical aspects of the the story, I have been lucky enough to visit the regions, the Scottish Highlands and the Canadian maritimes, featured in the book and now want to go back to both.Fabulous writing, a powerful story and a memorable family - I loved it."}, {"userName": "Ahavah", "userReviewDate": "Feb 22, 2017", "userURL": "http://www.goodreads.com/user/show/38619161-ahavah", "userReview": "This is a book which apparently won a lot of awards. Based on reviews, most people love this book. Maybe you will. Sadly, I am in the minority of reviewers who did not care for it at all and can't understand the gushing. The book took me nearly a month to get into, and I finally forced myself to finish it only because it was due back at the library and I'd already invested over a hundred pages in it.I'm still not entirely sure what the plot was. I don't think there was one. However, we get to see a lot of family anecdotes about Scotch-Canadians and their yearning for the old land. I guess it was kind of interesting to see how someone from such a different place might live. We follow Alexander MacDonald – one of three in this book, actually – as he jumps back and forth between real-time visits with his alcoholic brother, his youthful memories of growing up with his grandparents in Cape Breton, and occasional (also flashback) visits with his well-to-do sister. The author hops between past and present tense to do this, and I didn't like that at all. I found the switches to present tense to be jarring. Granted, I'm not really a fan in the first place, but this gimmick missed the mark for me.He's also extremely repetitive. This very rarely this works to hammer something home, but mostly it's just dull. He tells us multiple times and in multiple ways how well-to-do his sister is (as well as himself, though that's not quite so obviously harped on). He tells us stories from his childhood, then his relatives retell the same stories later, then his brother brings them up in 'real time'... just very, very repetitive. Which, imo, doesn't really work well in a story that has no drive forward.Some of the anecdotes which we meander through were okay. I did get pulled in around the middle of the book, though it didn't last as long as I hoped. The characters often seem more like caricatures. Especially when anyone visits Scotland and the locals all immediately recognize their clan because of the red or black hair (yeah, because that's not common in Scotland at all) and start waxing on about Bonnie Prince Charlie. I have a big extended family, and even if the overarching Mac-whatevers are very similar, a clan indeed, you always see individuality in the people. These were just cardboard MacDonalds. One grandpa was a drinker and funny and one was sober and somber, and that's about as deep as characterization got here. The (two) women were even worse. Grandma's full of clichés, which writers are warned to steer clear of (another obvious gimmick here, imo), and sister pats her hair or looks out her Very Expensive Windows while being mostly defined by her husband or house – and is only around to repeat family stories we've already heard.Some phrases were pretty good. I can see some good skill when looking at the trees but not the overall forest. It just didn't work for me at all. I have no clue how it won the awards and has the following it has. You can sum up the entire book by saying: If only the boats had come from France & Always look after your blood. I literally opened the book to a random page, aiming to get the exact quote (not \"thicker than water\", but she was so full of clichés that that's where my brain went), and found it on the page I opened to. Not serendipitous; repetitive.Guess I'm just not the right market."}, {"userName": "Ben Page", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/14883618-ben-page", "userReview": "A must read for every Canadian, maritimer, fisherman, redheaded Scot or Irishman. Truly a pleasure."}], "description": "Alexander MacDonald guides us through his family’s mythic past as he recollects the heroic stories of his people: loggers, miners, drinkers, adventurers; men forever in exile, forever linked to their clan. There is the legendary patriarch who left the Scottish Highlands in 1779 and resettled in “the land of trees,” where his descendents became a separate Nova Scotia clan. There is the team of brothers and cousins, expert miners in demand around the world for their dangerous skills. And there is Alexander and his twin sister, who have left Cape Breton and prospered, yet are haunted by the past. Elegiac, hypnotic, by turns joyful and sad, No Great Mischief is a spellbinding story of family, loyalty, exile, and of the blood ties that bind us, generations later, to the land from which our ancestors came.", "title": "No Great Mischief", "url": "https://www.goodreads.com/book/show/919530.No_Great_Mischief", "average": 4.02, "cover": "https://images.gr-assets.com/books/1320489970l/919530.jpg", "reviews": 597, "authors": [{"url": "https://www.goodreads.com/author/show/8878.Alistair_MacLeod", "name": "Alistair MacLeod"}], "type": ["Fiction", "Cultural", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/919530.No_Great_Mischief", "http://www.goodreads.com/book/show/14273.No_Great_Mischief", "http://www.goodreads.com/book/show/609892.No_Great_Mischief", "http://www.goodreads.com/book/show/18617887-no-great-mischief", "http://www.goodreads.com/book/show/919534.No_Great_Mischief", "http://www.goodreads.com/book/show/21420566-no-great-mischief", "http://www.goodreads.com/book/show/10955239-no-great-mischief", "http://www.goodreads.com/book/show/1190573.No_Great_Mischief", "http://www.goodreads.com/book/show/10955240-island", "http://www.goodreads.com/book/show/14272.The_Lost_Salt_Gift_of_Blood", "http://www.goodreads.com/book/show/116490.As_Birds_Bring_Forth_the_Sun_and_Other_Stories", "http://www.goodreads.com/book/show/14274.To_Every_Thing_There_Is_a_Season", "http://www.goodreads.com/book/show/17411712-remembrance"]}