{"ratings": 146, "userreviews": [{"userName": "Larry H", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5872506-larry-h", "userReview": "Growing up in the New Jersey suburbs in the mid-1980s, my family ate dinner out nearly every Sunday evening, and more often than not, we ate Chinese food, as did many other families in my town. (I used to joke that there were classmates I saw more regularly at the Chinese restaurant than I did in high school!) While there were several different Chinese restaurants in our area, and everyone had a favorite, we frequently ate at one particular restaurant, whose owners my parents had known for a number of years. The owner and his wife seemed to have a fascinating relationship, and the high school gossip I was then loved to make up stories about what was going on in their lives, as well as the lives of the other employees. Perhaps those memories were what drew me to Lillian Li's \nNumber One Chinese Restaurant\n—that, and the fact that Li's book takes place in a suburb of Washington, DC known for its Chinese restaurants.The Beijing Duck House in Rockville, Maryland, has certainly seen better days, but it's still a favorite among the community's restaurants. The creation of immigrant Bobby Han, the Duck House was once a place where presidents and celebrities dined, but Bobby's death left the restaurant caught between his two sons, the more managerially suited Johnny, and the more impulsive, ambitious Jimmy.Jimmy has dreams of getting away from his father's legacy and opening a fancier Asian fusion restaurant where he'd never again have to serve the dishes which exhaust and repulse him. But to make his dream possible requires striking a deal with the devil, one who has been on the outskirts of their family for years now, and doesn't know how to take the word \"no\" for an answer.When tragedy strikes, it may make the achievement of Jimmy's dreams closer to reality, but it also upends the lives of many others. For longtime employees Nan and Ah-Jack, they are forced to confront the so-called elephant in the room, their friendship/flirtation, and decide whether to pursue something more after 30 years. But if they do, how will this affect Ah-Jack's wife and Nan's rebellious teenage son, Pat?Pat, a dishwasher at the Duck House since being expelled from high school, is in the midst of a flirtation with Annie, the hostess, who happens to be Jimmy's niece. While Annie has very little love for her father or her family's restaurant, she's not expecting to get pulled into a scheme which threatens to destroy both.As Jimmy tries to hold on to his dream, he must battle his brother, their seemingly ineffective mother, and the family friend whose menacing presence has always kept everyone on edge. But what does Jimmy really want? Is it making a name for himself, or continuing to bask in the spotlight his father built all these years ago.There's a lot going on in this book, with no shortage of melodrama, family dysfunction, angst, and even a little crime for good measure. While the different situations the characters find themselves in certainly have potential, they never really grabbed my interest as I had hoped. I don't know if there was too much to digest (no pun intended) all at once, or if it was more that the characters weren't particularly sympathetic, but I felt that the plot really dragged, and never picked up much steam.If you like stories of family dynamics, you might enjoy this one. The one thing I truly appreciated about this book is that Li didn't spend too much time dwelling on the food, so I didn't get as hungry as I often do when reading books about restaurants and cooks!NetGalley and Henry Holt & Company provided me an advance copy of the book in exchange for an unbiased review. Thanks for making this available! See all of my reviews at itseithersadnessoreuphoria.blogspot.com, or check out my list of the best books I read in 2017 at https://itseithersadnessoreuphoria.blogspot.com/2018/01/the-best-books-i-read-in-2017.html."}, {"userName": "Kasa Cotugno", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/2345554-kasa-cotugno", "userReview": "Although restaurants provide centerpieces of the novel, there are other invitations for potential life changing confrontations framed by the food, and the way in which that food is prepared and offered gives scenes immediacy as well as normalization of what could be explosive situations. This is true of almost every culture. Discordant exchanges are either enhanced or softened by the sharing of a meal, and Lillian Li slyly incorporates such practices throughout this deceptively light toned novel. Jimmy and Johnny Han are second generation owners of The Beijing Duck House, which was the realization of their father’s dream upon emigrating to Maryland. The two other main characters are their employees, Jack and Nan, who have known each other deeply for 30 years, but are brought together by circumstance and misunderstanding. Their story is propelled by the fate of the restaurant, and their acceptance of fate also contains elements of black comedy. As the story unfolds, the Hans and their employees are brought to life vividly, their complex lives illuminated, and this made me hungry for some Peking duck."}, {"userName": "Alex", "userReviewDate": "Jan 31, 2018", "userURL": "http://www.goodreads.com/user/show/5522229-alex", "userReview": "This novel is a feast to me in many respects. First, it is full of psychological dramas in multiple main characters, not only about the conflicts in their minds as they act, but also including sketches of the psychological development in their lives. These owners and workers of the Chinese restaurant confess and tell their life stories, in addition to the restaurant scene as seen from a narrator. As a bonus a work scene of cooks of a non-Chinese restaurant is also depicted briefly but vividly. The second strong point to me is the portraiture of various relationships between teenagers and their parents, mature brothers, they and their mother, unusual lovers, they and they respective spouses, etc., most of them quite chilly in nature, but others bitter-sweet. On top of these two aspects, the book is peppered with philosophical wits and some streams of consciousness, both of which I like as well. Lastly, this novel is not lacking plots and suspension, although usually I myself am not particularly after. All these are crafted within less than 300 pages, quite amazingly."}, {"userName": "James", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76455774-james", "userReview": "if you've read \"tiger mom\", \"everything i never told you\", and \"crazy rich asians\", THIS is the next book you HAVE to readLove how you see asian immigrants vs. their children born in america (both contained in the umbrella term \"asian american\" despite being so different)"}, {"userName": "Jenny", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/64553705-jenny", "userReview": "I used to work at a Chinese restaurant many years ago. This book brought back so many of my memories. It made all those people I used to work with alive again. The love, expectations, frustrations, conflicts and struggles between the two generations (first generation of immigrant Chinese parents and second generation of American born Chinese) also touched me deeply, like Nan and her son Pat, Johnny and his daughter Annie, Jimmy and his strong minded mother Feng Fei. Through the author’s writing, I can feel their love, pain, and confusion acutely. This is a book that tells the stories of the people who work in one of the countless Chinese restaurants that are almost everywhere in the world. They are more than just the people who serve us the delicious Chinese food we love."}, {"userName": "Chris W", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76455196-chris-w", "userReview": "interesting analysis of the many roles of food and sharing meals togetherpushes the concept of what constitutes a \"family\" - definitely not your stereotypical or boring \"love you no matter what\" kind of family you see so often in american literatureenjoyed seeing the dramatic business side of the industry, not just the food, as wellfantastic read! consumed it in one sitting; couldn't stop myself"}, {"userName": "Kayo", "userReviewDate": "Dec 13, 2017", "userURL": "http://www.goodreads.com/user/show/31710254-kayo", "userReview": "Delightful book. Characters that make you want to read the next page. So much going on, but exactly how you'd like to spend an afternoon reading. Thank you to Henry, Holt and Company, NetGalley and author for the chance to read this book. While I got the book for free, it had no bearing on the rating I gave it."}, {"userName": "Fey Fan", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76456428-fey-fan", "userReview": "beautiful moments of poetry so well inserted into each chapter I found myself re-reading entire paragraphs over and over just to make sure I fully-appreciated the full effect of Lillian Li's words; no idea how she manages to be so subtle yet so powerful, but she does it wellthe multi-faceted storyline also has plenty to be enjoyed for the more casual readers as well!"}, {"userName": "❀⊱Rory⊰❀", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/25852225-rory", "userReview": "3.5 Stars. Review to follow."}, {"userName": "Donna", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/14459210-donna", "userReview": "Agitated. That’s how I felt reading Number One Chinese Restaurant. I felt agitated and unsettled throughout the entire book. The characters agitated me on almost every page, as they argued with and annoyed each other on a constant basis. This is the story of a Chinese family, the Hans, and the restaurant dynasty they’ve struggled to maintain for several decades. Alongside the Hans are their employees, friends, and business acquaintances, some of whom they’ve known since childhood.Jimmy Han, the younger son of the deceased restaurant founder, manages the day to day operations of the business. He is on the floor, barking orders, sometimes cooking, often yelling insults to those around him. He has plans of opening a second restaurant, the Beijing Glory – a more lavish, upscale version of what he considers his late father’s old-fashioned and outdated establishment, the Duck House. Jimmy’s dream causes him to plan a desperate act with the help of an old family acquaintance, a godfather-like “fixer.” Although he decides better of his idea, wheels are already set in motion, and the plan takes off without him, involving his niece and the teenage son of one of his loyal employees.The characters in the novel are tied intricately together through years and familial bonds, yet no one seems to like each other. Each character is pitted against the next in a never-ending swirl of insults, dislike and distrust – brother to brother, parent to child, lover to lover, spouse to spouse. I found this exhausting and couldn’t bring myself to like even one character in the story. Their incessant anger, disillusionment, and disappointment in life was ultimately so depressing that I couldn’t wait for the story to end. I persevered, however, as I really wanted to know how everything played out in the end.The book itself was well-written, although I was consistently taken aback by the author switching perspectives and settings without warning in the middle of a chapter. I finally got used to this, although it was another reason to feel unsettled throughout the book. Maybe that was the author’s intent. If so, it worked. More agitation.A 3 star rating, and this only because I did have enough interest in the storyline to follow it through to the end.Many thanks to NetGalley and Henry Holt and Co. for an ARC in exchange for my honest review."}, {"userName": "Kevin Hu", "userReviewDate": "Feb 11, 2018", "userURL": "http://www.goodreads.com/user/show/65701723-kevin-hu", "userReview": "I received this book from NetGalley and was excited to dive into a fiction that dealt with themes surrounding the Chinese restaurant life. I personally grew up as a product of this very niche subculture. I think that Li does some things well here. She illuminates the generational barrier that disallows a conventionally intimate relationship between 1st gen parents, who toil endlessly to pave the way for their progeny, and the 2nd gen children who yearns for the existence of some kind of a relationship and even at times resent the unwelcome gift of toil. She exposes, in rare occasions, that a language barrier can inhibit what communication there is left between generations. Her minor characters, in a restaurant setting where most of the book takes place, have fleeting qualities that lend to the vapid impressions and homogeneity of each character - this is very much accurate to the environment. She dabbles with the organism of Chinese microeconomy and microcosm that would exchange progressive methods of enterprising a restaurant in exchange for loyalty to your people. The cultural differences certainly collide when a business is passed on to children with a completely different framework of goals in enterprising.Even so, I had my qualms with this effort. The title was never really referenced within the story and the concept of being 'Number One' may have existed when interpreting the competing restaurants between the Duck House and the Glory - but this is never clearly defined as that sort of relationship. The characters were very shallow. The context for each character was never illuminated enough to justify and make sense of some of the decisions they made. For as much as Jimmy/Johnny's father was spoken about as the elephant in the room, and as much as his legacy casted a narrative arc over this story, we don't know much about him. The progression of the plot was much too abrupt and at the same time underwhelming. The plot really didn't take any twists or turns - Jimmy wanted the restaurant burned in order to establish his own legacy apart from his father's so I Chinese godfather figure with immunity came in to set up the fire and the deed was done. Nan & Ah-Jack's story felt like a parallel story that could have existed independent of the story as a whole. Personally, growing up with my parents in the restaurant business, I can attest that seeing their insurmountable flaws was easy. But as I grew up, their redeemable qualities began to wring out endlessly. I felt like NOCR attempted to justify and make sense of why our relationships with the 1st gen Chinese restaurant working parents may have been so poor, but failed to illuminate the very precious qualities that our 2nd gen eyes were not able to cherish. The redemption is certainly there and we just have to point our flashlights at it."}, {"userName": "Anita", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/76405691-anita", "userReview": "Wow, this book really makes you  feel . The characters are complex and all have a myriad of personalities. The language is so creative and expressive. The pain the characters feel, whether physical or emotional, isn't just an abstract concept in this book. Through Li's painstakingly honest descriptions, my heart genuinely felt pain and anger for each character. The concepts of love and family are also thoroughly explored in this novel through the relationships the characters have. In this book, love and family aren't just cheesy sappy things filled with rainbows and sunshine, they're tears and sorrow and tough decisions too."}, {"userName": "Pam", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/11583934-pam", "userReview": "Thank you NetGalley for a digital advanced copy. Sadly, I did not like this book at all. I had considered DNF at 25 percent in but persisted. There was nothing about the main family to like at all. I don’t mind flawed characters, but I need to also like the characters and I did not. There were two secondary characters Nan and Jack, and Nan’s son that I had some empathy for their story. But all these characters were just sad and some of them mean. And there didn’t seem to be any resolution for most of them. Giving this book a 2 may have even been too much."}, {"userName": "Topher G", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76454895-topher-g", "userReview": "dark humor intermingled with lighthearted themes: a.maze.ing"}, {"userName": "Andre", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/5321728-andre", "userReview": "3.5⭐️Stars. The Beijing Duck House is the Han family restaurant and the centerpiece of this novel about a dysfunctional family. Although dysfunction reigns humor is never far from the page and the crazy mysterious Uncle Pang is a shadowy gangster type who seemingly has his hand in everything as the ultimate puppet master. Bobby Han is the patriarch of the family and his dream of a Chinese restaurant in America comes to fruition in Rockville, MD. Bobby has two sons, Jimmy and Johnny who have two very different ideas about furthering the reach and influence of the Beijing Duck House while keeping the Han family name in high esteem in the MD area.Jimmy wants out, he has worked in the family business since he was a teen and is now known as Little Boss. He wants to implement his own vision and agenda and wants his own restaurant. Johnny is more interested in being seen and recognized as a VIP, he doesn’t have much tolerance for the nuts and bolts aspect of running a restaurant. Jimmy plots his moves which goes astray, and the ensuing fallout threatens to turn the family completely apart.This all leads to a raucous conclusion to a novel that has exposed the reader to a chaotic restaurant scene, Chinese family dynamics, including inter-generational conflict and astute witty observations concerning immigrant life as opposed to Native American life.\t\t“Americans. They believed a strong marriage came from knowing their partner’s every shadowy thought. But it was knowing too much that killed love. A strong marriage came when the wedded stopped trying to plumb their partner’s depths. Life became easier when one passed the years with an amiable stranger and not a mirror that reflected back all of one’s flaws.”There are themes that are universal across cultures, especially dealing with immigrant experiences. A lot going on in this novel that is always busy and those tidbits of wittiness buttress the fast paced doings of the Han family along with their network of restaurant associates and customers. And, of course the ever present Uncle Pang keeps this story high above the boredom line. 3.5⭐️ A big thank you to Netgalley and Henry Holt&Co. for an advanced DRC. Book available June 19, 2018"}, {"userName": "Wendi Lee", "userReviewDate": "May 25, 2018", "userURL": "http://www.goodreads.com/user/show/30649545-wendi-lee", "userReview": "*3.75 stars*There’s a lot of good things to say about this book about a Chinese restaurant and the people who work there. Brothers Jimmy and Johnny Han own the business, but that’s where all similarities end. There’s also Nan and Ah-Jack, employees who have been there since the very beginning, still struggling to make ends meet and untangle their complicated feelings for one another. It was a compelling read, with lots of soap-operaesque twists and turns. I especially felt for Nan, a single mother raising a son just on the brink of making a series of bad decisions. And I liked the Han matriarch, with her sharp tongue and even sharper mind. I wouldn’t like her as my own mother, however!So, here’s what I struggled with. This novel is largely a character study, and I personally feel that we should see some arc in character growth. Here, I feel that most (but not all) the players remained stagnant, and that made the ending frustrating. This is a smaller criticism, but I was also uncomfortable with the descriptions and attitudes toward the “amigos,” the Mexican employees working in the kitchen and as busboys. There are a lot of stereotypes happening there, and while I can accept that some of characters see these individuals in this light, I find it troubling that this is never addressed, but rather viewed as “facts.”Thank you to Netgalley and the publisher for an ARC."}, {"userName": "Jane", "userReviewDate": "May 31, 2018", "userURL": "http://www.goodreads.com/user/show/52277469-jane", "userReview": "Thanks to LibraryThing and Holt publishing for this ARC.I really enjoyed this book about a Chinese restaurant in Rockville, MD (where I live coincidentally, though it never mentions the name) and it's quirky characters working in the restaurant and the family dynamics of Jimmy and Johnny the two brothers who own it. I really liked the blending of the employees and the close camaraderie of the Chinese community in the restaurant."}, {"userName": "Ming", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/3962630-ming", "userReview": "Thanks to Henry Holt & Company and NetGallery for this advance reader’s copy in exchange for an honest review. Its general description is amply available on GoodReads, on Amazon and elsewhere.I truly enjoyed this book. Initially, I had some reservations that it would be another immigrant tale populated by immigrants fumbling along to achieve “the” American dream. Instead, it’s about dreams and hopes and how they change you by having them.The story quickly drew me into the lives of a Chinese restaurant owner as well as his family and a few of his employees. I appreciated how, at the beginning, Jimmy disdained the business his father had established but later, his feelings changed when he opened his own restaurant. This evolution was subtle but credible and affecting. Various gems included the scenes when a young Jimmy starts an apprenticeship at Koi, a high-end restaurant. His euphoria from being in the rhythm, chaos and beauty of the kitchen is palpable. This high set into motion a powerful longing. His attempt to recapture that experience, that alignment of passion and purpose, propelled the story to the book’s conclusion. Along the way, we meet two restaurant employees, Nan and Ah-Jack, whose relationship was complex and importantly, compelling. These co-workers spend a lot of time together and develop a dynamic, an almost co-dependent one, that reveals its limitations and strengths as they follow Jimmy to his new business. This parallel story grounded the book, providing a somber but mature contrast to the soap opera antics of Jimmy and his family.I’ll note two things here. One, this book is rare because the Asian male characters have sex. And more than one Asian man does so. I’m not being flippant. It’s a sad reality that Asian men are emasculated and/or diminished, especially in American white society and too often by female Asian authors (e.g., A. Tan). And two, I cannot understand or accept how grown people hold on to children’s names, e.g., Johnny, Bobby, etc. It is worse when the adults are people of color. And way worst, when the men, as a category, had often been referred to as “boy.” In contrast, the white waiter in this book is named and called as “Tom.”"}, {"userName": "Lolly K Dandeneau", "userReviewDate": "Dec 10, 2017", "userURL": "http://www.goodreads.com/user/show/1412404-lolly-k-dandeneau", "userReview": "Via my blog: https://bookstalkerblog.wordpress.com/'Uncle Pang was always picking something apart.'Uncle Pang is more than picking everything apart, he is the master controlling his puppets. Between the workers and the owners, the real action takes place behind the scenes, not with the patrons. Jimmy Han doesn’t want to work under his deceased father’s shadow anymore, he longs for an edgier more modern restaurant and no one is going to stop him. Certainly not his overbearing old mother, nor his do-gooder older brother Johnny. When he isn’t ordering his workers around, he is making plans, big plans for his future restaurant. Nan and Ah-Jack (my favorite characters) are both buckling under the demands of their loved ones. For Nan, it’s her wayward son Pat, “Nan wanted to believe that at Pat’s core, all his gentle selves were curled up, waiting to be awoken.” It’s too hard for her to admit just how much he has soured. Ah-Jack’s wife Michelle is sick with cancer, and he’s getting too old to be as strong for her as he once was. There is something that has always been special, that’s simmered between he and the much younger Nan. She brings out the poetry of his tongue, the youth of his old heart. The love Nan has for Ah-Jack ‘came slowly, as weaknesses in the body often do.” But how does he feel, anchored to his dying wife, whom he’s been tied to since his childhood? Annie is the privileged niece, working in the family business, enticed by bad boy Pat- but just how far will she go for a little excitement?Uncle Pang is like a dark cloud that descends on them all, picking and chosing who to ‘use’ and who to ‘discard’. Pat and Annie get caught up in a game too big for themselves, and it will cost more than young love. It’s a story not just about the successful Chinese immigrants, but those who struggle to make their way to a better life for themselves and their children. It’s the complications of family, brothers locked in their roles one as ‘trouble’ the other, as reluctant ‘savior.’ It’s a matriarch that refuses to give up control to her foolish sons, and love that is never too late. It’s thinking that what you dream of is better for you than what you have and that sometimes we idealize something so much that once we attain it, we find we may not want it at all.I enjoyed the humor, even the selfishness and greed but most of all I adored the relationship between Nan and Ah-Jack (the old fool by far the best character). Everyone seems to be either manipulating each other, fooling themselves, or saving one another. A story of beginnings and endings, of many relationships that simmer beneath the roof of a Chinese Restaurant, that is for some a home and for others a weight around their neck.Publication Date: June 19, 2018Henry Holt & Company"}, {"userName": "Kate Olson", "userReviewDate": "Feb 20, 2018", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "I was given an opportunity to read an early copy of this title with the agreement that I would hold my full review until publication date. With that being said, I highly recommend this to the following types of readers:1) Fans of family/domestic fiction2) Fans of foodie fiction3) Fans of books about the immigrant experience in America4) Readers looking to expand their cultural experiences"}, {"userName": "Annie Wang", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/77961305-annie-wang", "userReview": "In the first half of the book, it took some patience for me to follow the story—the life and dream of Jimmy, his brother Johnny, his mother Feng Fei, his father’s friend, Uncle Pang, the restaurant manager Nan, and waiters, busboys, … . I was completed attracted in the second half of the book. At the end, I suddenly realized, there are some much deeper meanings in the story. Jimmy, who has worked for 30 years in his father’s restaurant, just wants to have a new restaurant, completely different than the Duck House, the restaurant he heritaged from his father. The location will be in the center of the city, the decoration will be chic, the waiters will speak English without accent, the menu will be new… , and no Uncle Pang will be there, Jimmy will be in full control! Finally, after all the financial struggle and efforts Jimmy opened his restaurant Glory. On the first Friday dinner time, an “incident” happened in the restaurant which almost killed the prominent business. Jimmy found out, his Glory is not much different than his father's Dock House at all. The story tells the toughness to make a mark of own life despite how eager the younger generation wants and how aggressively they try. After finished reading, I looked back, why the book’s title is Number One Chinese Restaurant? Which one is the Number One Chinese Restaurant? Duck House or The Glory?I like the wits in the book everywhere. The author must be a very talented person who is able to use an everyday’s life story to express her thinking about life and achievement of the young generation."}, {"userName": "Mary", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/15849662-mary", "userReview": "I received an ARC from NetGalley. I had a rough start with this book. It was difficult for me to get pulled in, and I nearly put it aside permanently...But, I kept on, and I'm really happy that I did. Once I got to know each superbly done character it was effortless. The story unfolded and carried me right along. A family story, but with elements of a greasy dark underworld, favors and payoffs... It almost reminded me of Goodfellas, only with Chinese food. LOL I really enjoyed it!"}, {"userName": "Ashley", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/76051991-ashley", "userReview": "This amazing debut novel will leave you with permanent impressions on what family can be as Lillian Li excels in character creation, particularly that of older generations. I found myself in disbelief that someone so young could encapsulate the wisdom of relationships aged forty years so well without having lived them. More than this, however, is the representation of dual-cultured people, particularly immigrants and the inner and outer conflicts they experience in the juxtaposition of their home and assimilated cultures. This incredibly important element, and what I believe to be the marker of the next great American novel, is portrayed so well in Li’s three generations of characters. My first read of the year, Number One Chinese Restaurant stands to be one of the best."}, {"userName": "amanda eve", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/2192819-amanda-eve", "userReview": "I don't believe that characters have to be particularly likable, but they do have to be interesting. There wasn't a single character I cared about; some were outright obnoxious but most were just mildly irritating. There were a few really lovely turns of phrase; unfortunately, I was bored by the story over all."}, {"userName": "Anthony Martinez", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76454175-anthony-martinez", "userReview": "Shines light on the world of the high-class chinese restaurant industry, a cuisine that is almost never regarded as high-class"}, {"userName": "Brian Hu", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/76456074-brian-hu", "userReview": "I found this book to be incredibly relatable and am thankful to know I am not alone in my experiences"}, {"userName": "James Garth", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/76397981-james-garth", "userReview": "Simply beautiful language throughout - bravo!"}, {"userName": "AnisaAnne", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/52585885-anisaanne", "userReview": "You can also read my reviews of WP: https://anisabookreviews.wordpress.co...3.5 stars rounded to 4Number One Chinese Restaurant is a truly original tale of the innermost secrets of a Chinese family-owned restaurant. Behind the accents and the shuffling of Asian flavors is a poignant look at the relationships that build a microcosm of love, loyalty, and interconnection. And the dark side of doing business.Jimmy Han has his eye on opening a restaurant better than the one left by his father's legacy. Beyond the doors of the Duck House lies a dream of opening the best Chinese restaurant in Maryland. But inside the doors of the Duck House, there is love, control, power but most importantly history. Jimmy is one step closer to opening up Glory, but his loyal brother Johnny has other ideas for the original Beijing Duck House of Maryland famous for its Northern Chinese cuisine. That fateful night where fire engulfs the restaurant will be the twist of fate for many. And change does not fare ware for the characters of this story.The narrative is told by multiple characters, Jimmy, Johnny, Ah-Jack, Nan, Pat, and Annie. The stories are told in the present tense but each waiter, manager, son, daughter and business owner have their own cards that fall on the floor. Jimmy is struggling to find his own path through the restaurant business but his family always tempers his full ability. Ah-Jack, a full-time waiter, is tired and suffering from his ailments and old habits. Nan, the manager is trying to raise a teenage child while hiding her affection for Ah-Jack. And then there is Johnny, the brother who comes back into the picture with his own interest in mind.This story is an emotional journey from beginning to end. Its pace is fluid and shifts from present tense to past rememberances. It is not clear initially how the chapters will be set up but this is part of the uniqueness of the story. Several aspects of this story are confusing but the relationships between the characters are most poignant.The interactions between waiter Ah-Jack and manager Nan is endearing. From their first meeting at her new job at the Mayflower, the slow courtship, to the reversal of roles at the Duck House, we see the love build slowly and confoundingly. But Ah-Jack has a picture of another in his wallet. His wife is at home being treated for cancer. But Ah-Jack can bearly pay for her treatment or keep his job. Time has ravaged his life, his marriage, and his dignity. And the Han family has their own traditional Chinese dynamics. Feng Fei, the mother of Jimmy and Johnny is a caustic, matriarch who is self-absorbed and hard on her children. Jimmy always wanted to be a chef, but in his struggle to fit in he always found a way to be an outlier. His desire to be his own story with his own restaurant will resonate with anybody living in another's shadow. And Jimmy and Johnny who are always at odds have a co-dependent relationship as two brothers, one the rescuer of the other's calamity. However, with all the friction between the characters, loyalty and family reign most important.The pulse of the Duck house is controlled chaos. Waiters parading dishes, catching their breaks, takings nips from the bar after a long shift. Each of these characters carries a past and a distinct personality and clearly longstanding relationships with other employees. The combination of all these aspects makes the narrative lively.Lillian Li has composed a novel blending the right amount of humor and charm with tradition. There were at times where the novel felt unbalanced and conversations drawn out, but the story and the characters provided enough entertainment to push through those parts. Overall, a good novel.Thank you, NetGalley, Henry Holt and Company, and the author for the ARC in exchange for my honest review."}, {"userName": "Andrea", "userReviewDate": "May 24, 2018", "userURL": "http://www.goodreads.com/user/show/3821216-andrea", "userReview": "I expected to like this book. Quite a bit. Didn't. 2.5 but cannot round up as the boredom factor predominated.I live near Rockville, Maryland, where the Number One Chinese Restaurant/Beijing Duck House is situated. I like books set in my area. And I like books with an ethnic flavor; potentially 2 for 2. But this was MEH. Did. Not. Care.Setting: A \"[restaurant inhabits its]...own world, inhabited by waiters and kitchen staff who have been fighting, loving, and aging within its walls for decades.\" A \"story about youth and aging, parents and children, and all the ways that our families destroy us while also keeping us grounded and alive.\" All true.And with quite a cast of characters. The Han family: Jimmy [front and center], his older brother, Johnny and his daughter, Annie. Deceased father. Mother. Long-time employees Nan [and her son, Pat] and Ah-Jack--and his wife, Michelle--and her boyfriend, Gary. The plot thickens. Janine. Who is connected to who? And the seedy Uncle Pang whose presence/interference is everywhere.Some humor. \"Duck is simply a chicken that takes longer to make.\" \"She had a personality that did not inspire people to be better but persuaded them to be comfortable at their worst.\" \"A wife holds all your secrets. Even the ones that aren't true.\"So I kept on plodding through. Glad I finished, but..."}, {"userName": "Cindy", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/1065846-cindy", "userReview": "I thought this book was a superb debut emphasizing family loyalty between two generations. Taking place in a Chinese Restaurant and told with dark humor Li brings to life characters that love, hate, and make sacrifices that keep their families together. The story started out slow but but due to great character development the plot became interesting and involved. Lillian Li is an author I plan on following. I received this ARC from Librarything and Henry Holt and Company. Thank you."}], "description": "An exuberant and wise multigenerational debut novel about the complicated lives and loves of people working in everyone’s favorite Chinese restaurant.The Beijing Duck House in Rockville, Maryland, is not only a beloved go-to setting for hunger pangs and celebrations; it is its own world, inhabited by waiters and kitchen staff who have been fighting, loving, and aging within its walls for decades. When disaster strikes, this working family’s controlled chaos is set loose, forcing each character to confront the conflicts that fast-paced restaurant life has kept at bay. Owner Jimmy Han hopes to leave his late father’s homespun establishment for a fancier one. Jimmy’s older brother, Johnny, and Johnny’s daughter, Annie, ache to return to a time before a father’s absence and a teenager’s silence pushed them apart. Nan and Ah-Jack, longtime Duck House employees, are tempted to turn their thirty-year friendship into something else, even as Nan’s son, Pat, struggles to stay out of trouble. And when Pat and Annie, caught in a mix of youthful lust and boredom, find themselves in a dangerous game that implicates them in the Duck House tragedy, their families must decide how much they are willing to sacrifice to help their children. Generous in spirit, unaffected in its intelligence, multi-voiced, poignant, and darkly funny, Number One Chinese Restaurant looks beyond red tablecloths and silkscreen murals to share an unforgettable story about youth and aging, parents and children, and all the ways that our families destroy us while also keeping us grounded and alive.", "title": "Number One Chinese Restaurant", "url": "http://www.goodreads.com/book/show/37457519-number-one-chinese-restaurant", "average": 3.83, "cover": "https://images.gr-assets.com/books/1513049759l/37457519.jpg", "reviews": 80, "authors": [{"url": "https://www.goodreads.com/author/show/15871363.Lillian_Li", "name": "Lillian Li"}, {"url": "https://www.goodreads.com/author/show/15871363.Lillian_Li", "name": "Lillian Li"}], "type": ["Fiction", "Literary Fiction", "Adult Fiction", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/35020361-number-one-chinese-restaurant", "http://www.goodreads.com/book/show/37457519-number-one-chinese-restaurant", "http://www.goodreads.com/book/show/32223281-number-one-chinese-restaurant", "http://www.goodreads.com/book/show/37778319-spark"]}