{"ratings": 55908, "userreviews": [{"userName": "Jeremy Baker", "userReviewDate": "Aug 02, 2008", "userURL": "http://www.goodreads.com/user/show/1388090-jeremy-baker", "userReview": "This was the last Anita Blake novel worth reading, primarily because of Edward. The rest of the series has been garbage (including Edwards' return. Seriously, what was his body count in the Harlequin, one? Maybe?). I don't have a problem with the sex, but Hamilton has sacrificed that literary device thingy called 'plot' in order to pack the pages with smut. Something happens, they have sex for five hundred pages, then the Ardeur snaps it's fingers and kills the badguy.In terms of characters it's obvious that Richard is Hamilton's personal dumping ground from everything she's ever felt about her ex-husband, turning the interesting power dynamic present in the first few books into something sad. Also, despite the legions of evil creatures (including the oldest and strongest vampires on the planet) that attack her at every turn, nobody close to Anita ever dies. Hamilton has stated that she loves her characters and will never kill them off, and that childish petulance combined with the almighty Ardeur robs her books of any sense of danger.Now Blood Noir is out, and though I will reserve judgment until I hear something more specific about it I'm not holding my breath expecting Hamilton to grow up again."}, {"userName": "Crystal Starr Light", "userReviewDate": "Oct 03, 2012", "userURL": "http://www.goodreads.com/user/show/3990525-crystal-starr-light", "userReview": "Obsidian Butterfly: A Review in Two PartsAnita Blake returns home to a phone call from Edward. He's calling in a favor and needs her to come to Albuquerque, NM to assist him in a job. She goes to find that there have been several gruesome murders, the victims left horribly maimed. Who is performing these crimes and how far will Anita go to stop them?NOTE: I have VERY DIVISIVE feelings about this book. Therefore, I have split this review into two parts. One part will probably appeal to those who are big Anita Blake fans; the other is VERY VOCAL about how certain parts of the book made me feel.PART ONE:Up to this point, the series had become rather beleaguered with Anita Blake's increasingly complicated love life. Does she love Jean-Claude or Richard? How does she balance both in addition to her growing powers and her place as lukoi? And what about her increasingly dark turn, embracing dark magics and torture? How does she reconcile this with her Christian and moral upbringing?While these questions are very good, Anita needed some space to work them out. Hence this book. It was a great way for Anita to get some distance, look at things with a new perspective and realize some important lessons such as:+ Just because Ronnie is dating a slightly boring guy, doesn't mean that Anita can't make an effort to remain friends.+ Catherine may be married, but she is still Anita's friend.+ Anita can't keep holding back her abilities and powers.+ Anita isn't being fair to the Triumvirate and deserves to muddle through her complicated love life.The actual mystery and investigation is very interesting. I thought LKH brought some interesting Southern flavor to the novel, setting it in Albuquerque. I liked Anita meeting another necromancer, a vampire who thought she was a goddess, and learning more about Edward (such as that he CAN love and maintain a reasonably \"bad @$$\" lifestyle). I liked seeing Anita investigate the murders, ask questions, dig deeper. Sure, the mystery isn't the most brilliant or original I've ever seen, but at least, for once, Anita is investigating these crazy events instead of talking with people who drop convenient plot points.If this were the only part I was reviewing, I would easily give this book a 3.5 stars. It brings up some interesting conflicts, new sides to old characters, and mixes up our surroundings so things don't get too boring.PART TWO:I cannot believe how misogynistic and disgusting this series has become. I thought I could hold back the floodgates until \"Narcissus in Chains\", the one I hear is the beginning of the end of the Anita Blake series, but I can't. This book is absolute dreck.Why? What makes this book worse than all the previous 8 books? It's not that hard: I'll break it down to my two points.1) Misogyny. I had noticed since about \"Burnt Offerings\" that these books seemed to showcase a more and more hostile view of women. Well, this book easily surpasses them all. Anita's (and I almost wonder if the author's) hate for women drips from nearly every single page in the book. Comments like:\"'She's direct even for a man,\" Edward said. 'For a woman, she's like a battering ram.'\"and\"'You would have made a good man.' I took the compliment because that's what it was.\"and \"She also knew how to shake hands. Most women never really got the knack of it.\" are insulting and demeaning.Making broad statements like \"women are naturally friendly\" or that all women have large purses and pack a bajillion suitcases full of crap is small-minded and foul. Letting 14 year old impressionable boys get away with misogynistic statements just keeps the cycle repeating. Starting fights with cops over who's balls are bigger and then letting a man say rude, misogynistic remarks without a peep just proves that Anita doesn't have her priorities straight and is nothing like the \"strong, independent woman\" she purports to be.Every woman not named \"Anita Blake\" is a delicate, easily broken flower: the nurse who is \"too fragile\" to answer questions Anita might have about who is dead and who is alive, a \"dwarf\" woman who is brutally murdered, a young scientists named Dallas and Edward's fiancee, Donna.\"That Dallas was oblivious to [Olaf staring at her] made me worry about her just a little...her survival instincts just weren't up to it.\"\"'She's a wimp,' [Peter] said. I agreed with him but not out loud.\" [May I just add, this is a SON talking about HIS MOTHER.]\"If Edward showed Peter this little corner of hell and word got back to Donna, it might be enough to break them up permanently. I was willing to trade some of Peter's innocence for that.\"Speaking of Donna, I don't think I've ever seen a character so badly villified. From the moment Anita lays eyes on her, she is undermining the woman, demeaning her, and treating her like filth.+ Anita is critical about Donna's age, calling her in her early thirties and going up to her forties.+ Anita insults how Donna \"makes out\" with her fiancee in the car, in a gesture to make \"Anita jealous\".+ Anita immediately sides with Peter, Donna's bratty 14 year old son, in front of his mother.+ Donna is unable to defend herself and Peter, at 8, is forced to wield a weapon.+ When Donna and her children have been threatened, Donna breaks down into hysterics. Instead of tending to her children and trying to comfort the woman, Anita does this:\"I got a handful of that short, thick hair and pulled her hair up. It hurt and it was meant to. 'Look at me, you selfish b!tch.'\"+ Anita is ready to sacrifice Peter's innocence to get Donna and Edward to break up:\"If Edward showed Peter this little corner of hell and word got back to Donna, it might be enough to break them up permanently. I was willing to trade some of Peter's innocence for that.\" + Anita withholds information about Peter's rape because \"Donna wouldn't be able to handle it\":\"He hadn't told [Donna, his mother] about the rape. I didn't betray his secret. First, I wasn't sure she could handle another shock. Second, it wasn't my secret to tell.\" And on and on and on. The things Anita does to Donna and the way Anita thinks of Donna is absolutely INSULTING and EMBARRASSING. I'm not saying that women can't hate each other, that they are always \"naturally friendly\"'; but Anita has ZERO REASON to behave so rudely to Donna. And yet Anita isn't the one portrayed as the b!tch; no, it's DONNA.And then we have a major scene where a male stripper is sexually harassed. Anita makes the flip comment that if he had been a woman, EVERYONE would have jumped to make sure he wasn't assaulted, but because he's a MALE, people let him be. Leaving Anita as the only one to rescue him.As if that isn't enough, the number of times rape is brought up is obscene. Edward hires a \"bragging rapist\" to help him solve the murders; Anita is nearly raped YET AGAIN. Other women are likewise threatened.TRIGGER WARNING (I honestly canNOT believe I am including a trigger warning in a review about vampires and paranormal creatures): Child rape, child torture.2) Child rape and torture. At one point in the story, Peter and Becca, Edward's fiancee's children, are kidnapped. Anita and Edward attempt to rescue them. Before they do, they (and the readers) are subjected to a brutal depiction of child rape and torture. A random woman fondles Peter until he experiences his first \"Pleasure\" and hits him across the face. He screams and protests the entire time. A man holds Becca in his lap and breaks her fingers as she screams.I respect that LKH wants to make sure that we realize that these kids are in real, serious danger, that they might not come out alive. I even respect her for trying something darker. I understand it's all too easy for people to say that \"X\" is a bad guy without having that bad guy do anything to prove he is a bad guy.But honestly, this scene is completely unnecessary, a chill, pornographic thrill, something to make readers gasp in shock and horror. These characters have only appeared in this book; I've heard they don't reappear (ETA: I've been told that Peter does reappear in the series, so perhaps there is some discussion about the trauma he has undergone here). Furthermore, apparently, things like their damaged mental health never needs to be addressed, because Anita sure as hell doesn't mind withholding Peter's rape from his own mother:\"He hadn't told [Donna, his mother] about the rape. I didn't betray his secret. First, I wasn't sure she could handle another shock. Second, it wasn't my secret to tell.\" Do things like this happen? Of course, all the time (unfortunately). But did we really need to \"go there\" in an Anita Blake novel? In my opinion, no. It's a horrible, horrible, cheap, awful way to show that these guys are bad and that Anita Blake needs to hurry up and save the day.These two main bullets are the reason that this book is rated 1 star. Sure there are other parts of this book I wasn't fond of--the extreme gore that made me regret every meal I ate, Anita's constant aggression to authority, her antisocial personality disorder (seriously, check it out, it's astonishing how many bullet points she can tick off)--but by far the worst, the ones that made me the most mad were the blatant, undisguised misogyny (and no, I'm not talking about misogynistic characters, I'm talking about the whole attitude of the book) and the unnecessary, gratuitous, vile child rape and torture scenes.If you really like Anita Blake, have always liked Anita Blake, and desperately want more of her and Edward, then go ahead, have a ball with this book. More power to you. But if you are sick and tired of the woman-hating, excessively violent, angry Anita Blake, then you might want to give this a pass--or at least proceed with caution.NOTE: For those not faint of heart, I recommend taking a look at some of my status updates for the items I forgot to mention, such as the stellar writing (\"I laughed. They laughed. A good time had by all.\"), more examples of how hateful Anita is, and my mind being blown to pieces."}, {"userName": "Jilly", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/25894509-jilly", "userReview": "This book is a vacation from Anita's usual life because she travels to New Mexico to help Edward, the assassin, solve a case. So, no love-triangle b.s., which is nice.When arriving in New Mexico, Anita discovers that Edward is engaged to be married to a very naive widow with two adorable children. Edward's nickname is \"Death\", and he likes killing things. So, the idea of Death getting married bothers Anita.give it a few years, Death, and you'll be wishing for your namesake!So, Anita gets all up in his business about trying to make him break-up with his woman. She really is a nosy, judgmental busybody. From what I can see, she doesn't have the clout to give relationship advice.And, here's something that bothered me - tell me if you catch it...They take her to a Mexican restaurant (she hates Mexican food - what the hell? Mexican food is life here in Texas. Don't be dissing it!), and she says that they get to the table and the waiter brings them a basket of bread. Huh? This doesn't happen. You get chips and salsa, not bread. And, then she goes on to say that oh, it's not bread, it's sopapillas. Seriously? That doesn't make it sound right. Sopapillas are a dessert. Baskets of chips with salsa are what they bring when you get there. In other words: Do your fucking research if you don't know what would really happen! This makes me think that the author has never eaten in a Mexican restaurant in her life. And, that's fine - just don't make your characters go there if you don't know how it's done.you can never eat Mexican food too often, Anita Kill-Joy!Okay, so that's out of my system. I mean, come on, Mexican food is THE best food ever. How could anyone not like it?...... okay, NOW it's out of my system.This book had a LOT of killing and violence. It even went a little too far for my tastes because there were rape and torture scenes with children. So not okay! Aside from that, it was action-packed, Edward-packed, and a lot of great new characters. If I were to do it over again, though, I still wouldn't read it because of the child hurting stuff. I just can't handle that kind of thing. If you are going to rape and torture people in your book, make sure they are over 21.I'm taking a break from the series for a few days to read Winter. Yay!!"}, {"userName": "yellowbird", "userReviewDate": "Feb 25, 2009", "userURL": "http://www.goodreads.com/user/show/2039724-yellowbird", "userReview": "This is the book where Laurell K. Hamilton lost me as a reader. I love the early Anita Blake books, because they are police procedurals set in a fantasy world. But somewhere along the way, the menage a trois between the three main characters (a necromancer, a vampire, and a werewolf) overspread the pages like a nasty rash of suspicious nature. In the books after Obsidian Butterfly, Anita is having sex with every were creature available, the detective elements have gone out the window, and I could only skim the books, hoping the series would somehow recover. My husband continued to buy the series because he is a collector by nature, but I refused to read them. Eventually he also lost heart. Unfortunately, I know what went wrong. Sorting out an impossible love triangle is difficult enough in real life, let alone in a piece of fiction where all the participants have to stay likeable, and can't become utter shits. The Twilight  series by Stephanie Meyer has similar problems, as it is also a romance involving a werewolf, a vampire, and a human. When my teenage niece asked for the Twilight series for Christmas this year, I felt like warning her not to get involved in a tangled love affair. Of course, we ended up buying Twilight for her anyway. Some things have to be learned through personal experience."}, {"userName": "Jo ★The Book Sloth★", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/13870608-jo-the-book-sloth", "userReview": "4 Vampy starsTo begin with I have to say that this book is one of my favorites from this series. It is quite true that I have several emotional changes during Anita Blake's books. For several reasons I love and hate this series but the truth is that I have never been bored for a minute while reading one of the series' books!\nWhy I love the books \n1) Anita Blake is a woman who can mesure up almost to every man or woman she comes across either human or supernatural and that makes an interesting heroine at the very least. I may not always like her but I always find her entertaining.2) The plot in every book is always different enough to be captivating so you never get the idea that you read the same things all over again. The crime stories are always interesting and fresh. Yes, she usually hunts vamps but that's the job description. The adrenaline rush during reading the books is addictive.3) The gory stuff are really a plus in my opinion...I can see why many disagree but I find it really fascinating the way she doesn't shy away from the disgusting details.4) The supportive characters are always a major part of the story and are always different enough from each other not to be boring. Again you don't always like them but LKH knows her character development. AB probably has the best bad guys of UF.\nWhat I don't really like about the books\n1) The misogynistic comments are a really big downside in the Anita Blake books. Most of the times the cops and often Anita herself seem to display a very racist side with comments about other women's behaviour and usually in the books only Anita comes out as a strong female character. Some would say that since Anita can take everyone out either male or female it can't be that bad but the fact is that it is actually that bad. Anita is just too hypocritical. She judges prejudiced people while she shows a highly judgemental and prejudiced behaviour. Slut-shaming isn't nice whether the character doing it is a man or a woman, whether it's a Mary Sue or a badass.2) The sex is just too much. Sometimes I think the books tip the balance between adult romance or erotica and porn! As the books progress the sex scenes become more blatant and frequent to the point that I actually just skip them all.I know that the vampires in Jean Claude's line feed on lust but you can read so many sex and orgy scenes before you've had enough.3) Asher is actually pretty annoying. He is full of envy, complaints, arrogant in some things and completely insecure in others and he just whines his way through the books.\nWhy this particular book?\n1) No sex is the biggest reason. It has an interesting mystery story with much action and NO SEX!2) Edward is just a favorite! I love all the books in which he has a lead role and it doesn't get more lead than this. He is interesting without all the lust that Anita seems to have for almost everything that belongs in the male category.3) The plot is more interesting than most the other books, the characters fascinating, the southern pieces seem to give another flavor to the story and the fact that she doesn't have all her lovers in her feet seems to give the book a more adventurous side beside the romance feeling that most of the others have.4) No Jean Claude, Richard, Asher. In the early books I kind of liked Richard but then he started behaving like a jerk and he never stops the whining, along with Asher they make your brain bleed with all the complaints. Jean Claude is kind of ok but really at some points he gets just as clingy as the other two and you can never tell whether he is a good guy or a bad one (it made things interesting for a while but at some point you get fed up).Now I know that I seem to like the book for what it doesn't have more than for what it has but it is true that if there weren't so many moments where Anita puts down other female characters it would be an amazing book. Now it has to go with just great!"}, {"userName": "Tilly Slaton", "userReviewDate": "Oct 27, 2011", "userURL": "http://www.goodreads.com/user/show/6289182-tilly-slaton", "userReview": "I really wasn’t excited about this book. All I wanted was to skim over the paragraphs so that I could get to the next book of the series, Narcissus in Chains as quickly as possible! And then it hit me … mutilated bodies and Olaf. You need to read this book to understand just how messed up my opinion is of his character. He’s dangerous. He’s deadly. And Blake is just his victim type. I like him! Total turn on .. go figure.Obsidian butterfly is a fantastic book filled with torture, essence sucking vampires, sociopath serial killers and monsters that apparently can rip the skin from a human’s body without leaving any tool marks. Eww.Edward wonders why I’m so sympathetic to monsters. The answer is simple. Because I am one.Anita alienates herself, putting as much distance as possible between herself and her lovers. Working with a witch to build stronger barriers in hopes to withstand accidental intrusions, Blake is pulled into Edward’s world of gore as he calls in the favor that she owes him.Surrounded by centuries old delusional vampires claiming to be gods, werewolves enabling a psycho necromancer dwarf, Anita really has her hands full.There are several scenes in this book that are to die for! Pun intended ..There is one scene that doesn’t get any easier with every reread. A skinless corpse searching for food in a hospital.. and a nursery. Absolutely disgusting, completely heart-shattering, this scene haunts me with nightmares. It is the most gruesome and heart wrenching scene I have ever read. Violent, action filled and brilliant .. Yet I still wanted to vomit. Double thumbs up on the intense description and detail put into that scene.Odd moments shared between Edward and Blake. Weird? Totally awkward, a must read!I recommend this book to adults only! Do not read if you have a weak stomach or strict line of moral code on what is and is not acceptable. This book pushes the limits of imagination and gruesome disgust. Extreme violence. Some sexual content. Rape. Shocker, right?Do not read this book out-of-order. Start with Guilty Pleasures!~Happy Reading!"}, {"userName": "Faye", "userReviewDate": "Jul 13, 2017", "userURL": "http://www.goodreads.com/user/show/56458845-faye", "userReview": "[the children while they were held captive (hide spoiler)]"}, {"userName": "Donna", "userReviewDate": "Apr 13, 2016", "userURL": "http://www.goodreads.com/user/show/13244359-donna", "userReview": "This is one series where the reviews are as entertaining as the books are. I love reading the reviews after I've finished the book. For this particular book, people either loved it for hated it. And I am leaning toward the love side. Even though Jean-Claude wasn't in this one (and I find him very entertaining) I didn't mind. This is probably the cleanest one yet. I liked that this wasn't the same-old, same-old. We got to see a more detailed look at Edward, which I liked. There were also some great twists that kept this engaging. And I can still say that I like the MC, Anita. She is good and bad, in an even balanced way. So still 4 stars."}, {"userName": "Grace", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/2895577-grace", "userReview": "Did you know that once you unfreeze meat, you shouldn't refreeze it? It goes kind of squishy and rotten.People's faces freeze and unfreeze so much in this book, it's insane. Masks, monsters, blah blah blah. Oh, and there's a giant hulking threatening rapist, so that's good. Anita does her usual routine: show up, act like a total asshole, hit/kick people, threaten them with guns, posture and stomp off, all arrogant and full of herself. This woman should be dead a thousand times over. She is a moron who foolishly takes any opportunity she can to piss people off for absolutely no reason.Look. I get that women in American society are conditioned to be conciliatory. I get that this is not a good thing, and that when women act assertive in the same way that men do, they are frequently punished for it. But Anita Blake is not taking this stereotype on - she's just as asshole. If she were a man, she'd still be an asshole. I like characters to have good reasons to act the way they do, and she doesn't. She's just a reactive, hypersensitive jerk.God I hate this series."}, {"userName": "Bark", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "Finally, it's Edward's book!A 4 1/2, not quite a five because Anita's badass attitude grates here and there but so much better than the books focused on the triumvirate (sp?) and sexy times. Obsidian Butterfly is all business, no sex. This is the book the Edward fans were clamoring for and it was worth the wait. This book lets us in on Edward's secret life when he calls in Anita to help out with a series of grisly murders. She learns he's living another life where he is known as good old boy \"Ted\" complete with sweet girlfriend and acting as step-in dad to her two children. Anita pries and teases and her relationship with Edward becomes less of a \"who will kill the other first\" kind of thing and more of a \"I will always have your back\" kind of thing. It's believable and I loved that about this book.It is dark and gory and some extremely nasty things to happen to innocent people. There are paranormal baddies and mysteries and loads of danger filled action. Usually those things bore me but I found myself pretty much attentive to the audio from beginning to end. Narrator Kim Alexis does a fantastic Anita, all tough bitch, and also handles the myriad of other characters with ease. I was never at a loss wondering who was speaking.I think Obsidian Butterfly is one of the best installments in this series. If you're a fan of the earliest books and the harder boiled edge of those stories this might be the last book in the series you should probably read. It all sorta goes downhill from here but I'm going to read 'em again anyway."}, {"userName": "Diana (Offbeat Vagabond)", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/4571498-diana-offbeat-vagabond", "userReview": "Review posted here: http://offbeatvagabond.blogspot.com/2010/10/laurell-k-hamilton-obsidian-butterfly.html Let me start off by saying, I am a huge Anita Blake fan. There wouldn't be True Blood if not for Anita. Hell, as much as it pains me to say this, there wouldn't be Twilight if. It for Anita. She is the original badass. Now I am aware of how people feel about the series now. But this does not mean I am going to stop reading the series though. This book is definitely different from the last eight books. We are not focused on Anita,first of all, we are focused on Edward. Also, most characters that we are use to, Jean-Claude, Richard, Dolph, and more are nowhere in this book. Though Jean-Claude makes a \"dreamy\" appearance in this book. Now back to Edward. He scares me and he is a psychopath, yet he is surprisingly likable. He does go for the bad guys (at least I hope he does). But this book starts with Anita starting to pay Edward a favor (after killing his even crazier psycho killer friend, Harold). She goes to Arizona to meet Edward to then find out he has a fiance with kids and goes by the name Ted. I honestly didn't know whether to laugh or cry at this, given how Edward is, if his \"family\" knew what he did, well that would be too much. Anita, of course, knows the catastrophe that this will be and can't believe Edward is doing this not only to Donna, but to her little four year old girl and teenage son (who saw his dad die. Yeah, that bad). So \"Ted\" called Anita to help solve a series of horrendous mutilations. People are being skinned alive, but they are not dead. No one can figure how they are alive and why they have been strange occurrences while they were skinned. People just conveniently needed to leave their own homes to walk or something when these mutilations took place. So while investigating Anita meets Edward's backup. One is Bernardo Spotted Horse, sexy, horny ex Military killer and Olaf. Olaf is big, German, and a rapist who just so happens to target women with Anita's characteristics. I am sure you can imagine this meeting. They end up meeting the Master of the City and her human servant after a disturbing stage display. If you are familiar with Anita's meetings with other vampires and their entourage, at least one person has their brains shot out. But the meeting wasn't a total waste because she finds out Obsidian Butterfly (the Master of the City) is not the god she says she is and that he cryptic talk leads to a dangerous realization (won't say, read the book). Anita also meets up with a fellow necromancer. He is as scary as everyone says he is a d has a thing for Anita. He also has a secret. But due to Nicky's stupidity (the other necromancer), Anita and her gang are being followed by Ted's \"friends\" who want Anita to protect their coward of a leader. There are a lot of things happening in this book (sorry if my follow up isn't helping much, I don't have the book with me), but it manages to not feel cluttered. It moves in a nice pace. Some books are too slow to get to the drama or the action. This was just fine. I love that we find out the Edward isn't completely soulless. Tge other books really had me thinking otherwise. Now I have heard the complaints about no Richard and (barely) no Jean-Claude, but I think this book was fine without them. It is what Anita needed to get things figured out (but not necessarily straighten). She is attracted to Detective Ramirez in this book, but the thought of leaving her boys completely is a no-go. I honestly would have liked to have seen how Anita would be like dating a human. I love Richard and Jean-Claude for sure, but still. I have read multiple reviews about this book and have seen the issues, but frankly, I wasn't disappointed. I like the turn this book took. It still felt like Anita. She is still on that line of cop and killer. That is what makes me love her. She doesn't follow the law 100%, but she does what she must to save others. This book kept to that. This book was full of Anita's humor, Edward's new found beating heart, monsters that have done things that I honestly had a nightmare about the other night and strange love (well, I am nit sure love is the right word, hell not even lust is the right word). Overall this was a great book in the series. I love the new yet old Edward/Ted. I thought this was a great read and like I said, it is the Anita we know and love, just with a different perspective."}, {"userName": "Fangs for the Fantasy", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/5912634-fangs-for-the-fantasy", "userReview": "Anita killed one of Edward’s backups – which means she owes him a favour and he has finally called to collect. Or his alter ego has – reassuring Anita that what he wants in New Mexico is nice and legal. And a holiday away from her love life is probably not a bad idea.Little did she imagine she’d be plunged into Edwards and that the cold, lethal assassin has a fiancée and she has 2 children – all of which have no idea about the man she’s going to marry.And while the job may be legal – it’s brutal. Dozens of people have been killed or mutilated – and the deaths are some of the worst Anita has ever seen. Worse, it’s been done in a way neither she nor Edward’s erstwhile and experienced back up have ever seen.Anita has to find and stop the murderer even as the death toll rises. That means facing Aztec gods, a fellow necromancer, ancient vampires and a prejudiced police force – even before she gets to the monster itself, which can feel her looking for it, and is watching her.The writing style of this book – indeed of this series – walks that line between being evocative, setting the scene and having that fun, snarky, hard boiled internal narrative that I so love and being extremely over descriptive, pointless and dull. Since this book is set apart from her lovers, it pulls it back and goes back to earlier books where it is more for setting scene, theme and mood, rather than us enjoying 20 pages describing just how blue Jean-Claude’s very blue eyes are.And it really does convey the sense of place. It’s one of those books where you’re nearly sure the author must have spent some time in the location in question because they seem to know it. There’s such a realness to the scene and the area that you rarely get from second hand accounts.read more"}, {"userName": "Marianne", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/16417346-marianne", "userReview": "Well, I've done it. I've gotten through the first 9, fairly smut free, Anita Blake novels by listening to them on audible or reading the comics instead of the actual books. Now it's time to up the ante, to see how much (or little) I'll be enjoying Anita's upcoming ardeur and nympho side. Unfortunately, it seems to have been too hardcore for the suits over at Audible, because poor Kimberly Alexis never got to impersonate even one of Anita's many lovers in the throes of passion. (Too bad, I thought she did a good job with Jean-Claude.) Kimberly Alexis has really added an extra layer of enjoyment to the Anita Blake books. She's made me forget that Laurell Hamilton has a tendency to repeat whole sentences and paragraphs throughout the novels. (Truth be told, I'm sick of hearing about \"so much meat\", how small Anita is, and how used she is to having bullies trying to intimidate her by sheer size alone, or how she's prefers NOT to engage in casual sex. *Snickers*)This book though, is probably one of my favorite Anita Blake novels to date. Edward has been an interesting enigma for so long, and I enjoyed reading about his alter ego. But surprisingly, the man who inched his way into my heart, was Olaf; the psycho mass murdering rapist. Makes me glad I don't fit his vic profile! That letter he left her at the end? Creeeeeeeepy! *Shivers* Nevertheless, Anita's mercenary hitmen made this book all the more interesting. Made me almost forget Jean-Claude. Richard? Eeeh, time to dump his furry ass.Well, that's all. Bring on the ardeur! *Rubs hads together in excitement*"}, {"userName": "Jeri", "userReviewDate": "Feb 17, 2008", "userURL": "http://www.goodreads.com/user/show/673399-jeri", "userReview": "As the author says this one is for all the Edward fans out there. And indeed, I am one of them. Right from the beginning I have liked Edward, even when all we knew about him was that he was a cold, mysterious assassin. In this book we, and Anita, learn more about Edward's background. It's a fascinating story and full of the action that surrounds both Edward and Anita most of the time. Anita takes another step in her personal growth in this book as well. Though she does spend a lot of time trying to determine if she's becoming a sociopath or if she is already one. It's darkly humorous as always."}, {"userName": "Onefinemess", "userReviewDate": "Aug 03, 2010", "userURL": "http://www.goodreads.com/user/show/4105181-onefinemess", "userReview": "A nice change of pace with much less sex than usual (yay!). Don't get me wrong, I like sex, but man is it freaking overkill in some of these books. MMmm author fantasy fulfillment much? It was a nice change seeing Anita almost totally out of her element. The rather unexpected character development for Edward was a nice touch too, and I hope to see it address again in the future. Especially the molestation thing... AGAIN: DID THE CHARACTER REALLY NEED TO BE RAPED/MOLESTED? I see what the author was doing, but it seemed kind of out of place, especially considering the molester was just some human chic who we didn't even know had a predisposition to do this kind of thing.I figured out in this book (I know, I know, I'm slow sometimes) what we, as readers are supposed to be feel threatened by. I mean, obviously Anita isn't going to die, so we can't worry about that, her love life isn't going to suffer - it's only going to prosper - so we can't worry about that, we can't worry about damage to her vagina from giant horse penis anymore - book 10 showed that she can take that. So what are we left fearing for? Her humanity. With each book she trades away a new piece, sinking (if you view it as a negative) further and further away from what is \"normal\". And, we as readers, can see why she rationally made each choice. But with each choice, and each boundary crossed, she is a little (or a lot!) less like the readers. So I think that's what we're supposed to worry about - what will she trade this time to save those she doesn't really like but will risk (not life and limb!) but soul and sex for? As a result, we (or me at least) find less and less to identify with her as a character about. So instead of reading a story where we're sort of riding along with the character, now I'm just kind of sitting back and watching the train wreck. Don't get me wrong, it's fascinating, but I really wonder how Hamilton is going to end this. Because she really should at some point. Maybe after Anita takes out the whole Vamp council and sits in charge of pretty much every supernatural being in the world?"}, {"userName": "taveena kade", "userReviewDate": "Apr 18, 2018", "userURL": "http://www.goodreads.com/user/show/71204036-taveena-kade", "userReview": "i have to admit-this book? worst in the series so far. I skipped most of it and honestly, I feel like it didn’t add anything to the overall series. I think that it would’ve been better as a novella (book 8.5 maybe?) because of all that. If i could return it i would because it’s a waste of money. If you’re reading this review and you haven’t bought the book yet, please just trust me and skip it."}, {"userName": "CJ", "userReviewDate": "Mar 20, 2008", "userURL": "http://www.goodreads.com/user/show/1008029-cj", "userReview": "Best of the series - this book takes a closer look at Edward and his world. Anita makes some surprising and frightening discoveries about the mystery man in her life.  If you were ready for a break from the vampire politics,the hot and heavy romance and the soul searching that came with said romance, this book is for you.  This is the first step in the author's contention that the real monsters are not always the ones with fangs and super human powers, and she presents this with a skillful subtlety that vanishes later in the series.  I thought Laurell K Hamilton was a solidly good writer until this book; after this book, I thought she was a gifted writer.  The books that come after Obsidian Butterfly never manage to reach the level this one seems to effortlessly float to."}, {"userName": "Regina", "userReviewDate": "May 05, 2011", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "ETA: I ended up moving this up to 4 stars desipte my criticism below.This book would have been 4 stars if not for the repeated cultural and geographic mistakes. It was definitely a horror and gore filled book, not for the light hearted -- includes child abuse and murder. Seeing Edward and getting to know more about him made this book for me. He is now a favorite."}, {"userName": "Jenn", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/3957464-jenn", "userReview": "Obsidian Butterfly is different than all of the other Anita Blake books that led up to strictly because it separates Anita from her power base (or boyfriends, depending on how you look at it). When an old friend calls in a favor, Anita knows she can't refuse. She did kill his last back up, so... New Mexico, here she comes!Upon arrival, Anita is immediately thrust into a gruesome murder investigation. Gruesome meaning the victims are skinned but somehow still alive.. at least some. Others are hacked to bits. She has such a pleasant line of work, doesn't she? Anyway, Anita's never seen anything like this and the unknown makes her fear come out, so she does what she does best - pisses everyone off. One of the things I really liked about this one was the change of scenery. Don't get me wrong, I missed my boys (*cough*Jason*cough*), but it was nice to see Anita as a fish out of water. Working with new people and ones she didn't necessarily trust at that. I remember when I first read this series, I thought this was my least favorite out of the set. But having reread it multiple times, I've come to really enjoy it and see it as a vital part of the world. We get to know Edward. We get to watch as Anita struggles to accept who she is alone vs who she is with Richard & Jean-Claude. A nice little breather from that drama, but it also supplies a whole new world of drama."}, {"userName": "Kascha", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/8437401-kascha", "userReview": "This is actually the first of the Anita Blake books I read. I was anxiously looking for a new series to lose myself in while in a Barnes and Noble waiting to see 50 First Dates, and I happened on this one and was really attracted to the title because of the mental imagery the title conjured.Let's say that the day after I finished it I hurried back to the store and bought the entire series up to this point once I realized what order they actually came in. It was such a page turner; full of intrigue and thrills with a plot that was extremely easy to get absorbed in, and set in a world that was similarly easy to fall into. Anita impressed me as very complex and obviously right on the verge of breaking hence her early iron willed control and unwillingness to let go of her own tightly locked down values, but at this point in the series she is already well on her way to metamorphosis into something altogether different from anything she imagined. It was great reading following that.It is hard for me to decide where this book fits in the hierarchy of the series from best to worst because the ones preceding it were all defining volumes and as such represent a point at which you just knew things would run downhill. I read other reviews where people pan this one and don't understand those, but also see that there are tons of longtime readers who all list this book as the point beyond which the series jumped the shark. It is quintessential Anita Blake in my opinion; containing all the elements that made the series what it once was. It is actually the only book of the entire series that caused me palatable upset. I don't want to spoil anything, but this is a graphic book still true to the original formula highlighting Anita's skill set that lends so heavily to RPIT and her contributions as a marshall, meaning scene investigations, gunplay and \"wet work\" which is profoundly gory and very intricately described. As a mother, I have had several opportunities to have themes and situations in the story cause unease. But this one reaches a point within where I had an almost primal reaction and actually, I must admit, did break into tears. There is of course necromancy in spades here as well, but I mention Anita's other skills to form a contrast with the preachy, vamp and were politics laden miasmas that the series got progressively more bogged down with. There is none of that here.It was this book's ability to make me feel the situations within it that put it at the top for me, but the subject matter also makes it the book I skip when I reread the series. It takes a lot for that to happen because I am good at maintaining distance from fictional situations normally.All the other characters in the book are well done too. We get extensive time in Edward's world, which is at once even darker and more menacing and mysterious than Anita's because it is so much colder. There is just enough still unknown about Edward even while he's heavily involved in the story to keep him a reason to turn pages madly. So when you add Olaf into the mix and his sick sadism uniquely tuned to Anita you get a completely different feel from the situation. Jean-Claude is of course always trying to possess Anita but it's a much warmer feel than with Olaf. Olaf is like ice cold madness, and it really comes home when it's made clear that even Edward keeps him at arms distance and can't even claim to control him. I spent a lot of time in Anita's shoes feeling like meat to be torn apart by a laughing madman on the verge of the best climax of his life. And shocked at my need to turn pages even faster in response.If you are a fan of the original ideals of this series, you can't go wrong with this one. It has everything you'll be looking for and does a great job of blending the realities of Anita's job with the realities of what she is becoming esoterically and spiritually, and maintains the balance Laurell used to be known for. Enjoy it, because after this point things change almost violently, and definitely for the worst as the series begins to quickly run off the rails for complete inability to say goodbye to any of an ever increasing cast of \"eyeball-creasingly\" gorgeous flawed male anti-heroes and the tawdry bedroom multiple-choice tests that abound as a result of the deus ex machina we've come to know and hate as The Ardeur.Great reading, and does the series proud!"}, {"userName": "chucklesthescot", "userReviewDate": "Mar 13, 2010", "userURL": "http://www.goodreads.com/user/show/3426724-chucklesthescot", "userReview": "Edward asks Anita to help him solve a grisly case of murders where he lives with his new family, under a secret identity. I was so pleased to see that there was going to be an Edward themed book as he is one of my favourite characters in the series. I loved it when he turned up in The Killing Dance which is still my favourite book from this author. I was hoping that this might lead us back into proper urban fantasy and this book certainly delivered.Edward is living as normal guy Ted, with his girlfriend, playing father to her two kids. They have no idea about his other life as a deadly hit man and Edward wants to keep it that way. His relationship with Anita in this book goes from professional rivals to friends and I liked that development. It was fun to see this other side of Edward and gave him that human side that we had never seen. Of course that does not mean that Edward has gone soft...I didn't like Anita's attitude to Donna. It seems to me that Anita gets jealous every time another woman is the centre of attention. She may not want to bed Edward, but I think she's pissed that he doesn't want to bed her, instead loving a normal woman. This is Anita's excuse to sneer at the woman for her age, looks, inability to see Edward's true nature etc. Anita has been worshipped by all the men in her life for too long that she can't stand being second best to another woman. Maybe this is why she sneers about Ronnie's relationship as well. She hates when a man doesn't love her, even if it's a friend's lover. It's like her relationship with Richard-she can have any number of lovers she wants but when Richard has other lovers, she gets pissed and whiny about it. Her thuggish behaviour to Donna when the poor woman is crying over her family being threatened is disgusting. I'm surprised that Edward didn't bitch slap her for that coz I wanted to. Badly. Yes the story is disturbing when Donna's kids get abducted but this was used to show more depth to Edward-his conflicted feelings of loving stepdad and hit man. You can argue that what happens to Peter is not needed but it was there to shock you, showing that even Edward can't stop the bad guys all the time. It didn't detract from the book for me, though that might be because I read authors like Edward Lee who take shocking to crazy heights. Olaf also adds to disturbing as you are just waiting on him to lose control and attack Anita. It creates some good tension.This book was full of action, magic, danger and great characters-all the things that I really enjoy in urban fantasy. The plot moved at pace, we had interesting interactions between the characters, Anita gets into lots of trouble as usual and Edward is trying to protect those he loves. This was an enjoyable book and it was wonderful not to have the whole Anita love triangle getting in the way of the story. I really hoped that this was a turning point for the series and that we'd go back to the Anita of old, but sadly it was just a break from her tangled love life, the exception to the rule."}, {"userName": "Pete", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/6595232-pete", "userReview": "[Meeting Edward (now to be called Ted) at the airport was startling for Anita as she was introduced to his fiancée Donna and her two kids, Peter 14 and Becca 9. Anita was shocked at this, knowing that Edward was not in love with Donna. He was incapable of such emotion as love.LKH describes each location so well that the reader feels like they are walking along with all the characters seeing everything in the rooms.Anita learns that Donna’s husband was killed, and that Peter grabbed the attacker’s gun and killed and feels like the protector for both his mom and sister. Edward takes Anita to the hospital where six survivors, (if you can call them that) are under treatment. Anita who is not squeamish is overwhelmed by the gore of viewing skinned alive people whose sexual organs were cut off. There were no blade or claw marks. Anita suggests a pair of killers one being dominate and the other a follower. The cops are looking for simple answers for crimes.Upon arriving at Edward’s house, Anita meets his accomplices, Bernardo Spotted Horse, a Native American Indian and Olaf a German who is a thug having been convicted of rape. Tension flies as all the alpha personalities ignite including Anita.Anita and her associates are to meet the Master of the City, Obsidian Butterfly after a gory sacrifice show. With 100+ vampires surrounding the master, one breaks loose and attacks Anita who unleashes her gun on him.Talking about a bullet hole through a vampire, “In like a penny, out like a pizza.”As usual, Anita is in battle after battle, multiple hospital visits, ritual killings and other full steam ahead story segments. Anita finds more gore killings from an Aztec/Mayan god and in the end takes him out.There are some disturbing child molestation scenes with Peter & Becca that I would like to have skipped. Numerous battles ensue to rescue both of them, and Peter is able to take revenge on his attacker.  (hide spoiler)]"}, {"userName": "Chinablue_25 West Bostedor", "userReviewDate": "Jun 11, 2010", "userURL": "http://www.goodreads.com/user/show/2715176-chinablue-25-west-bostedor", "userReview": "This has been the best one so far!! I was so enthralled that I had a difficult time putting this book down for even the smallest things like eating and using the bathroom!!One of the things I liked so much about this book is that Edward was in the ENTIRE book. I was always intrigued by Edward in the previous books and found myself thirsty fir more if him. In this book I got it! There have been moments when I thought that Hamilton was taking their relationship into the direction of a sexual relationship. Not true. But Anitas relationship with Edward does in fact evolve in this book and strengthen. Edward goes as to so far to tell one of his colleages that she is his soulmate. That he believes when we find our soulmate we are too much alike to be sexually attracted to one another. A few times Edward shows a bit of protectiveness towards Anita. You really see in this book that he cares a great deal for her but in a completely platonic way. I also really enjoyed how the book ended. One of Edwards colleages(the one he made the soulmate speach to) is Olaf and he is a serial killer. His favorite victim type happens to be Anita. Short petite pale skinned long dark hair. In the end after working with her and seeing her cut out a vampires heart and hold it in her bare hands he decides that she is in fact HIS soulmate. In the end he leaves her this note essentially saying they are soulmates and he wants to be by her side killing together and he is willing to give up killing small petite long dark haired women to Anitas choice in victim just to be by her side killing together. Awww how romantic! I'm hoping for an Olaf appearence in the next book!!"}, {"userName": "Noodle TheNaughtyNightOwl", "userReviewDate": "Nov 08, 2011", "userURL": "http://www.goodreads.com/user/show/5150803-noodle-thenaughtynightowl", "userReview": "Argh! This was not expected and not well received. I had been complaining that I had given out two 9/10 scores recently to Anita Blake Books (Books 7 & 8) and worried that I'd end up giving the same score again and again and again. I needn't have worried at all.This one was so not par for the course. The story centres around Edward the notorious Bounty Hunter, a.k.a. Death, and although Edward is an excellent character on the pages and one I had taken a liking to right form the start, this book did not do him justice. Hamilton had so much room to work with Edward and I think she let herself and the series down.We see less of the sexy stuff, which could be acceptable, and more of the mystery stuff, which also could be acceptable, but somehow neither worked. Anita is what she is and I don't know about you, but I do read these books for the love triangle that includes Jean-Claude and Richard. Frustrating though it is at times, I enjoy the sexy bits. This time no Richard, and Jean-Claude only appears in a dream briefly. Hence this book being so far from the main storyline as it could get.It was not a welcome change for me.I even found myself skipping whole paragraphs and some pages, just to get to the end. Part of me didn't want to miss anything, but that was more to do with the fact that I read eight books in the series now and felt I had a vested interest in it, not because it enticed me in. Not at all.Boring, long-winded, and so not Anita Blake. This book could be missed quite easily and not affect the series one bit.So, what does this one get?3/10: \"Finished the book but left a lot to be desired\" on the NBRS."}, {"userName": "YA Reads Book Reviews", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/1764232-ya-reads-book-reviews", "userReview": "Originally posted on www.yareads.com, reviewed by NicholeWow. First, this book was almost 600 pages. It wore me out!If you haven’t read the Anita Blake books, then you definitely should. They are amazing! The only problem is that they are VERY intense. So intense that I can’t read them straight through. When I first started my Anita Blake kick I read about 6 or 7 of them in a row. Then I developed something that I called “an Anita Blake burnout.” I didn’t pick up another one for almost, if not over, a year. I read the 8th one last February, and now I just finished Obsidian Butterfly this month.This book was REALLY good. I didn’t read it straight through, though. Anyone who has read these books will understand when I say that it would have been too physically exhausting to read this book without taking a break. I ended up finishing like 3 or 4 other books before I finished this one.There is a lot of stuff that goes down in this book. I almost wish that LKH had made it into two books. Whenever I thought I was coming to a peaceful part of the book (HA!), I was instantly swept into another twist/plot. It was really good, though. I would definitely recommend this book to everyone as they are just SO good. Unfortunately, I have heard that the series goes downhill from here. I cannot attest to that, as I have not read anything past this book. I’ll just have to wait and see!Warning: This book does contain abuse and child abuse."}, {"userName": "Danielle Folker", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/17406195-danielle-folker", "userReview": "This book started out a 3 star. It felt like a filler novel in the series. None of the main characters except for Anita appeared in it. This book as the dedication describes is for everyone who wanted to get to know Edward more. And that we did. This was also the goriest of all Anita Blake books. At one point I put the book down and told my husband she went too far this time. I feel like I am too emotionally involved in this series sometimes. As the scene that went too far was coming up I was saying to myself there is no way Anita will let anything bad happen. But she is just one person and can only do so much. This book was creepy and disturbing. There was also a line in the book that made me a little mad. Anita was talking about women's body types. As she got to my body type which is thin and short she described it as a \"boy with breast\". That actually pissed me off. I do not strive for this body type. It is the one I was born with. I can't help that I wear a smaller size pants than a size 5... Other than that I loved the book more than I originally thought I would. I read the description for Narcissus in Chains and I'm very happy that Jean Claude and Richard will be in the next one. But I'm going to take a little Anita break before I jump on book 10."}, {"userName": "♥ Ashleigh ♥  contrary to popular belief i'm not actually mad!", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/4690797-ashleigh-contrary-to-popular-belief-i-m-not-actually-mad", "userReview": "i really enjoyed most of this book, there were a few erotica scene's with random people and blood that made me want to put the book down but the rest was alright.the monsters in this book were great, anita was even working with a few this time.i loved edward, he's a fantastic character and his new life is a nice surprise :) i cant wait for him to join anita in another book.Olaf was one of my fave characters, not because i like him but because he makes the book interesting and i know he'll be popping up in the future. im kinda hopping Bernardo will help anita on another job in the future as well.im interested in the government and wondering if the spook squad will contact her. im thinking they will prob be trouble in the future which will make that book pretty exciting and action packed.im glad anita is not with jean-claude and richard in this book, im really hoping she dumps them both soon but im not sure about the \"mark\". im thinking it's mainly jean-claude's fault that random sexual events happen in this series which always end up with some blood being spilt - which is deff creepy.i kinda wished she left the boys for the cop but i knew that wasnt going to happen, oh well.im looking forward to the next book."}, {"userName": "Danae", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/10101334-danae", "userReview": "Over the past year I have become a big fan of Laurell K Hamilton and this series. Anita Blake has been a recurring theme in my reading list and a series I've enjoyed a great deal until this book. It was just as suspenseful as her others and in that respect I loved it, but I have serious issues with some of the scenes in this one.I don't think there is ever a need for graphic child rape in a story and I strongly disagree with the author's choice to include it in this one. I feel it was used purely for shock value when it wasn't necessary. The child involved isn't a recurring character and the graphic description did not add any value to the story so overall there was no need for it. I'm not suggesting that sort of thing has no place in a book. In certain story lines it does, but it could be handled with a bit more finesse. This was bulldozing into a scene with the intention of horrifying the reader. If she was going for shock value then she got it. If she was going for disturbing then she got it. If she was hoping to demonstrate the way to shock and distrub without being crass about it she missed by a mile."}, {"userName": "Deborah Ideiosepius", "userReviewDate": "Apr 18, 2011", "userURL": "http://www.goodreads.com/user/show/4802663-deborah-ideiosepius", "userReview": "Well, I think it was number nine. After a while I realised that people who read Laurall K. have stoped bothering about the novel titles and just refer to them by number.Anyway, picked one up off a friends shelf and tried to read it. It might work better if you start with #1 and work up but I doubt it.I love sex, I like engaging in it, reading about it or discussing it. I enjoy the occasional erotic novel and even soft porn on the odd legal occassion. Rarely have I found an author who can make sex boring but this novel did it. Not disgusting or anything just mind numbingly boring. If you have two hot guys (even if one is a vamp and the other a wolf) and one hot girl one would think it would be intellectually impossible to fail. Not so, after a page or two of repetition I found my brain to be so bored it had slid away from the bed on the page to contemplate something more interesting - I think it was the laundry list."}, {"userName": "Kim", "userReviewDate": "Apr 26, 2009", "userURL": "http://www.goodreads.com/user/show/1761649-kim", "userReview": "This book was actually a disappointment to me.I was really looking forward to the story line about Edward. While there wasn't as much gore as the other books, but what was in it was really bad. I can't believe that the torture and mutilation of infants and children helps sell books! I know this sounds naive, but I believe that you can get enough gore and destruction with adult characters without pulling children into a horror story. I know this will fall on deaf ears (no one will care about 1 persons opinion) but it saddens me that Ms. Hamilton felt the need to use children in the story in this manner."}], "description": "The Anita Blake, Vampire Hunter backlist takes flight with a whole new look.In her ninth adventure, vampire hunter Anita Blake owes a favor to a friend-a man almost as dangerous as the ancient evil she's about to face.", "title": "Obsidian Butterfly\n      \n          (Anita Blake, Vampire Hunter #9)", "url": "https://www.goodreads.com/book/show/190361.Obsidian_Butterfly", "average": 4.08, "cover": "https://images.gr-assets.com/books/1327139907l/190361.jpg", "reviews": 1360, "authors": [{"url": "https://www.goodreads.com/author/show/9550.Laurell_K_Hamilton", "name": "Laurell K. Hamilton"}], "type": ["Fantasy", "Paranormal", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/190361.Obsidian_Butterfly", "http://www.goodreads.com/book/show/6672667-obsidian-butterfly", "http://www.goodreads.com/book/show/7042657-obsidian-butterfly", "http://www.goodreads.com/book/show/17880483-obsidian-butterfly", "http://www.goodreads.com/book/show/30281.Guilty_Pleasures", "http://www.goodreads.com/book/show/30274.Circus_of_the_Damned", "http://www.goodreads.com/book/show/15309.The_Laughing_Corpse", "http://www.goodreads.com/book/show/30273.The_Lunatic_Cafe", "http://www.goodreads.com/book/show/30241.Bloody_Bones", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}