{"ratings": 276, "userreviews": [{"userName": "Elizabeth", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/27276528-elizabeth", "userReview": "\"There were some things you couldn't come back from.\"\nOdium 3 is the third book in the Dead Series, and the battle continues for Nina and the men and woman living in this post-apocalyptic world! Each book in this series must be read in order. If you haven’t experienced the first two books in this series, you need to stop reading this review now and come back and read it after you have read the first two books! \n\"Would mankind ever rule this earth again? I doubted it.\"\nAt the conclusion of Odium 2, I felt a range of emotions that I can barely articulate. I was shocked, heartbroken, and nervous with the conflict between Nina and Mikey and the stress of the world they are living in. In this third book, Nina once again shocked me with her ferocious spirit and drive to do what is right despite the threat it would bring to her life and well-being! As Nina and Crunch embark on the big journey, Mikey is out on a scouting mission. Both Nina and Mikey are fighting for the same cause, and yet, they are miles apart from each other both physically and emotionally! The primary threat continues to be the undead who have infested the world with one goal in mind...kill! No matter what happens, Nina is strong and maintains her bad ass personal and witty personality throughout the death and destruction. But is Nina strong enough to survive? Will she and Mikey find their way back together again?\n\"You'll understand why this place needs to burn if you see.\"\nTold in mostly dual POV, Odium 3 is another riveting addition to this explosive series. As each character is introduced and developed within the story, the hope for their survival grows stronger in my heart. Although I have tried not to get “too close to anyone” (as we know…no one is safe), my love and hope for these characters just continue to grow. The most addictive element of this series is the witty dialogue and complex plot. In the midst of the chaos and violence, Nina continues to keep things light and humorous even in the darkest of moments, and I am always sitting on the verge of crying, laughing, or peeing my pants from fear. Claire C. Riley brings the five senses to life with every single turn of the page. You will be completely transported to another place and time! Overall, I highly recommend Odium 3 to readers who enjoy suspense, action, and aren’t opposed to a little blood and guts! Nina is the strongest heroine I have ever met, and you will experience a feeling of camaraderie with the characters like no other when you dive into his world. I will warn you the ending in this installment left me terrified for what’s to come. Luckily, Odium 4 is out and loaded on my Kindle. If anyone can survive the zombie apocalypse it’s Nina….right?***The Dead Saga****A copy was graciously provided via the author in exchange for an honest review!*For more reviews/reveals/giveaways visit:"}, {"userName": "Carol (StarAngel's Reviews) Allen", "userReviewDate": "Jun 26, 2014", "userURL": "http://www.goodreads.com/user/show/6294320-carol-starangel-s-reviews-allen", "userReview": "Book – Odium III (The Dead Saga #3)Author – Claire C. RileyPublication Date – Spring 2015Genre –Zombie/RomanceType – Part of Series Cliffhanger – YesRating – 5 out of 5 StarsComplimentary copy generously provided by the author in exchange for an honest review.\n\nSynopsis\nNo synopsis in print yetThe story continues with Nina, Mikey, Michael, Nova and a few new characters.My Thoughts - Story I’m typing this as I just shut down my e-reader because my emotions are doing double time right now.I’m pissed…yeah – I’m fucking pissed. What the fuck have you done to me Claire? How could you?Why do I feel this way?**This was not the ending I was hoping for**More fallen people**It’s not Winter of 2015**The sneak peek into the next book didn’t tell me shitThis is why I love Claire’s writing so much. She is able to touch every single emotion I have in a few hundred pages. In one day, I cried – I laughed – I got pissed – I got the squishy feelings and I followed these characters through the world of zombies and dangerous men.Shit, I know I should wait to write this review because everything is so new and fresh right now – my head and heart feel like a pinball machine going on a full tilt because I want to share with you all of the wonderful things about this story. This coming to Jesus moment for Nina, the beautiful wisdom of Crazy Pants, the loyalty of Mikey and the ping-pong emotions that is a result of Nova.I am not throwing words out there or kissing ass – but I do have to share that Claire C. Riley is the top Zombie writer ever in my book. When a book comes out written by her, I don’t even hesitate to read it.Re-Cap We start right up where Odium II left off – Nina and Nova need to find Hilary and Deacon to find out about the pregnancy. Mikey is on his way to the Mall for more pillaging. The story is broken apart by Nina’s POV through her mission and then Mikey’s POV through his. We switch back to Nina when the two meet back up again.I really can’t go on about the story because I will give too much away. I can only say that I couldn’t put this down from the moment I started it today.Reason for Reading – Author RequestStory – 5 out of 5 StarsSteam –  5 out of 5 StarsAngst – 10 out of 5 StarsWriting – 5 out of 5 StarsContent Flow – 5 out of 5 StarsHEA (Spoiler) – CliffhangerTold From – Dual POVHero – Mikey – Even though he comes from the bad side…he is such a sweetheartHeroine – Nina – One tough chick but so torn in the insideWould Read More from Author? Hell YeahRecommend To – Everyone who loves a great post-apoco zombie love story.For more Reviews, Free E-books and Giveaways"}, {"userName": "Jessica Austin Gudmundson", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/38798662-jessica-austin-gudmundson", "userReview": "Best yet.Another roller coaster ride of emotions from horror author Claire C. Riley. It feels like a change for our MC Nina. I still want to punch her in the face, but she's growing into something different. Its the little things, really, presented without much fanfare, a delicate devastation that catches you unaware and hits you with major force, that makes Claire C. Riley's third book in the Odium Dead saga series so good. Peppered with humour, heartbreak, hope, horror, and sadness, Odium III is an awesome read and I have fallen into another book coma."}, {"userName": "San", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/17586355-san", "userReview": "Each time I read one of Claire C Riley's books I say to myself \"Ok! This time I'm prepared for anything she has to throw at me.\" And then each time I'm gut punched. Odium III had everything a great zombie story should have. It was Dark, disturbing, sad, heartbreaking, passionate and brought the fears of the characters to the forefront more so than before, (With hints of humour sprinkled into this dark world). I was left so wound up by the cliffhanger ending. Even though I wanted to scream because of it, it was written perfectly. Another quality piece of writing by Claire C Riley."}, {"userName": "Lori", "userReviewDate": "Feb 17, 2015", "userURL": "http://www.goodreads.com/user/show/1460100-lori", "userReview": "Damn you Claire! Odium III is another amazing, gory, emotional zombie ride from Claire C. Riley. The story picks up with Nova and Nina on their little trip to find a certain lady with a certain bun in the oven. Obviously a spoiler if you haven't read the first two. But if you haven't read them, then while the hell are you looking at the third book anyway. :p Nina is still her unapologetic bitch self. And I love it. Her gooey middle shows, but she's not bleeding her emotions all over the pages in a way that seems out of place for her, or even annoying to read. It's just the way it is. And it's hard to read sometimes, but that's because Claire has really managed to put her readers in Nina's shoes. The action is so intense in these books. So is the gore. So if you're squeamish, umm... sorry. I really want to squee and jump and puke fangirl fairy dust all over the Dead Saga, but that's weird. And inappropriate. Instead I will tell you that this book is my favorite out of the three, and that they only keep getting better and better. And I swear to all that is good in the world, that I will fly across the ocean to Claire, and make her give me a happy(ish) ending. And I hate happy endings. So that's how much I am invested in this series. Oh and OMG Claire how could you leave me hanging like that, how could you?!?!?!?!?!?!?!?!"}, {"userName": "Maribel Zamora", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/12712945-maribel-zamora", "userReview": "Odium III was such a hard read because I’m already so invested in the Saga; in Nina’s journey, that her pain was my pain, her loss my loss, and her victories my victories. That being said I’m still trying to wrap my head around everything that happened in the story. I so naively went in hoping and thinking that Claire C. Riley-author extraordinaire, would take us down a different path, a path of least resistance- if you will, but that was so very naïve. What’s the fun in that? Riley wants you to hope and think that everything will be okay, that our tomorrow will be a little brighter. And just as your smile gets a little bigger, your hope grows a little more, and when you look to your left and see someone you love- BAM! It’s chaos! You just keep reading saying nonono, this can’t be happening , but oh man it is and your left with a huge whole where your heart use to be. Well that was me anyways. I still have hope because I’m pretty sure there’s at least two more books to come!"}, {"userName": "Sue", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/22992163-sue", "userReview": "I have not read a book in a while that made me want to take a hot shower, have a stiff drink and eat a hot meal (that did not involve wild game, canned food or beef jerky)...while clutching my pillow and hiding under a cuddly blanket.Yes...Odium III will make you feel so down and dirty and depressed and make you wish you could sleep with the lights on and hope to all that is holy that the zombie apocalypse will never happen.Nina and Nova are on a road trip to hell...a mission to find someone who may or may not still be alive and what started as Nina's search for answers turns into a struggle, yet again, to survive and come out of it not hating herself any more than she does already.Mikey is gone from her life (but not from her heart) for now...and as tough as that is for her to deal with, nothing could prepare her (or Nova) for the horrors they will encounter on this mission.I am not usually too squeamish a person (I will clean up vomit and scrub toilets...no problem)...but OMG some of the descriptions of living conditions and the absolute filthy state of their bodies and how they are forced to live, made my stomach turn. Some of the horror is in the lack of humanity and compassion that people living in this world would come to accept as normal behavior and it was written as poetic prose amidst the heartbreak. Life has forever changed and no matter how bad we think things can get for Nina and Nova, it is not even close to the devastation of what these girls encounter or the heartbreaking decisions they are forced to make.Just when I was feeling absolutely gutted, around the 66% mark in the book, I was smiling and crying some happy tears once again (even if for just a brief moment) and realized that even though Riley created this horrible bleak vision of the world, there might still be some tiny shred of happiness to be found.A few other characters come into the picture to provide both comic relief (Joan), a touch of tenderness (Adam), passionate lust (Mikey) and a dangerous man from the past becomes the hand that deals a fatal blow.Ends with another cliffhanger that will make you scream at Claire Riley (how dare she do that?!!!) but know that there will be another installment to carry on and hopefully give us more of a resolution and maybe some peace for Nina and Mikey.I received a free copy of this book in exchange for an honest review.***** 5 ***** \"a poetic form of torture and despair\" stars"}, {"userName": "Amy Queau", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/17435881-amy-queau", "userReview": "What a ride!I’ve read all the Odium and Odium Origins novels, and the thing I love most about these books is how well thought out the characters are. Nina has always been stubborn and unforgiving, and one of the reasons I have always adored her is because she’s done what she’s needed to in order to survive this post-apocalyptic world; she’s hardened her heart, ignored her spirit, and solidified her bad-assery with a katana.But in Odium III, we see a shift in Nina. She has the zombies mastered, she’s found peace in her decisions, and she’s even made a few friends along the way. And for lack of a better term, she seems grateful for her life.But this is Claire C. Riley we’re talking about here, so don’t think this is going to be all wine and roses. I’m beginning to think that this author can’t write a book without killing some of her most beloved characters. I don’t know if I want to hug her for creating such brilliance, or slap her face.There isn’t much I can say about OIII without giving away the plot, but I can tell you that I was not disappointed with this installment of the Dead Saga. In fact, I’d go so far as to say it was my favorite one yet.This book can not be read as a standalone. I would highly recommend reading all the books in this saga, including the Odium Origins novellas. However, for this book, Odium I & II should be read first."}, {"userName": "Shana Festa", "userReviewDate": "May 06, 2015", "userURL": "http://www.goodreads.com/user/show/9185553-shana-festa", "userReview": "I'm a writer. Like Claire Riley, I dabble in zombie fiction. Also like Riley, my main character is a strong female lead. So, it's a fair statement to say I tend to prefer reading zompoc told from a snarky, feminine perspective. Odium is an exceptional series that earns its place on the keeper shelf. It tells a well-rounded story with just enough detail to tell the complete tale but not so much that a reader is bogged down with minutia. One of the things I enjoy so much is that while her MC is female, she's written fairly masculine. Guarded, aloof, and--at times--downright rude. But that doesn't mean she isn't likable. My hands-down absolute favorite part of Odium III is the introduction of Joan. She's fabulously funny and adds a much-needed bit of levity to the book. Her quirky dialog had me laughing out loud on more than one occasion. There's a particularly touching moment in Odium III that found me near tears. A mere few lines between Nina and a child that was so eloquently written that it had tugged on my heartstrings before I'd realized what was happening. I'm looking forward to seeing what's next in the Odium series. This one's a keeper. Pick it up and see for yourself!"}, {"userName": "Shellie Brewer", "userReviewDate": "Aug 12, 2014", "userURL": "http://www.goodreads.com/user/show/3093790-shellie-brewer", "userReview": "Absolutely amazing....I really loved every bit of it. Am very happy to find out this was not the conclusion to the series. I also am very mad about the ending was not expecting it at all but mad in a good way. This author's writing is also amazing she has been able to capture me from the first chapter and not let go. Nothing more I can say except its a must read the whole series is just incredible adventure that never stops to surprise or amaze me from start to finish."}, {"userName": "Lindsay", "userReviewDate": "Feb 01, 2015", "userURL": "http://www.goodreads.com/user/show/4337141-lindsay", "userReview": "4.5 starsI just finished this book. Just now. I’m still raw and beaten down, and if Claire were here, I would have some choice words for her. This is where I will warn you, as no one had the heart to warn me: This is NOT the last book in the Odium series. For some reason, I thought this was a trilogy, so I had a certain idea in my head about where this book was headed. I was thoroughly confused when it went in the exact opposite direction. The further I got into the story, the more wary I became. Why isn’t Claire tying up all the loose threads? Why have my questions not been answered?! WHY is Nina doing that?! SOMEONE STOP HER!! *Sigh* Did I mention I had choice words? Anyway. That’s your warning.The story started off a little slow, mostly because life kept getting in the way. Apparently a mother is not allowed more than three minutes of unbroken reading at one time. Huh. Anyway, it certainly puts a damper on the tense scenes that Claire is known for. Overall, the pace of the book was a little slower than I was anticipating, but it had a lot of really interesting introspection going on instead. Nina kept flirting with the idea of having hope, before having it dashed on the rocks yet again. This internal back and forth struggle she has going on is both fascinating and painful at the same time. You want her to be happy, to be wrapped up safe in Mikey’s arms, to have all her dreams come true… but at the same time you know that she has to be hard in order to survive. Nina needs to be protected by her sarcastic, bitter outer shell, and quite honestly, I would be sad to see it go!One tiny detail really stuck with me while reading the first half of the book. Nina gets a cold. It’s such a simple thing, but so overlooked in zombie movies and books! How often does someone have to battle something so mundane, when the overall plot already has the characters running for their lives? I loved it! I can just imagine myself in that same situation. I would be sick ALL THE TIME, while fleeing through a winter rain, undernourished and overly stressed. How are ALL the characters not sick ALL the time?!At this point, I’m going to assume that you have all read a book by Claire Riley. Yes? If you haven’t, you need to pick one up right this second. She has a very distinctive style, filled to the brim with personality and flair, with a touch of sarcastic bite. Odium III did not disappoint. There was dreadful foreshadowing right from page one (dum dum duuuuuum), and I just knew that my heart was about to get broken. Quick! Cut all ties! Maybe if I don’t love them, Claire won’t kill them! She is ruthless when it comes to sacrificing her characters, but I love how absolutely realistic that is. Just because everyone’s rooting for you, doesn’t mean you’re safe.Claire, I love you. But I also really, really hate you. I’ll forgive you, though, if you can get Odium IV into my hands by September.A copy of this book was provided by the author in exchange for an honest review."}, {"userName": "Laura", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/9481759-laura", "userReview": "It occurs to me that when I read post-apocalyptic zombie stories, I am not really reading them because I find the undead terrifying. I think for me it's a fascination following the characters scavenging through all those places that now stand empty and the lawlessness that follows such a rapid decrease in population. But if they are to be included I think it's important to do them up right so to speak, and this is something the author did really well. This may be one of the only zombie series that illustrates the stench that would likely be present in this situation. Not only does she include it, she also includes scenes in which the characters are literally gagging from it, if not out-right puking. She also never got too technical regarding what caused the dead to rise. She just kept it simple and I like that. Sometimes I think too much emphasis is spent trying to sell the science of it all and this can cause contradictions that end up being unbelievable. There were so many aspects included in this series that lots of times never get addressed in this genre. I always secretly wonder about these things, I don't know why. This author addressed them and I appreciated it, although it wasn't necessarily pleasant to read about, for example a lack of toilet paper. It wasn't overly-descriptive and she never really went into very much detail about other things lacking that we certainly take for granted, tampons etc..but she still put that unwashed, unclean feeling into the series which just helped to illustrate how dire the circumstances really are. I think the series was better for it, and because of this, it was easier for me to believe this story coming from the point of view of a woman. I really liked Nina. She was a bitch. She really was, but she never spent any time feeling sorry for herself. I think her bitchiness might have been a way to hold on to her humanity somewhat. She was a bitch before the world ended and she's a bitch after. She did have her moments though when she was caring and kind. She was no Mary Sue either. She could barely shoot to save her life and couldn't hit the target until it was almost on top of her. There were other times that she really pissed me off. Sometimes she could be downright hateful. She had a tendency to constantly want to go off on her own which got old but was understandable due to constantly watching people die. I really hated the cliffhanger ending but soon realized that there is another book coming out. So at least there will be some resolution but I won't get my hopes up. This author has no qualms whatsoever about killing off characters right and left."}, {"userName": "Ozsaur", "userReviewDate": "Aug 01, 2016", "userURL": "http://www.goodreads.com/user/show/17781193-ozsaur", "userReview": "[SPOILERS SPOILERS SPOILERSEmily Rose was one of the reasons I liked this series. I loved how she changed Nina and helped her grow. Nina not only stopped growing, but she seemed to go in reverse in this book. Emily Rose was an important part of the series for me, and to have her killed, without getting a single scene in the book no less, was the exact moment this series was over for me.There was no point to her death except to add more pain and angst for Nina. For all Nina's overblown dramatics when she finds out, she was pretty damn quick to jump on Mikey's dick after. And her with serious injuries, too. I was completely disgusted with Mikey after the second book, and I hated that Nina took him back with barely an apology. Hell, she apologized to him! Screw that! Oh, and the whole zombie baby thing was so telegraphed that I got bored waiting for the big reveal, which wasn't big because it wasn't at all surprising. And after Nova killed it and Deacon, Nina got all high and mighty about it. Fuck off, Nina. Deacon murdered a whole town full of people, including children. I don't know why she thought taking him back to her own base was a good idea. Okay, I can't go on any more. The whole book was a crapfest.  (hide spoiler)]"}, {"userName": "Melanie Marsh", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/8058065-melanie-marsh", "userReview": "I have a huge love/hate relationship with Claire C. Riley. Every book she puts out destroys me entirely. Like rips me apart completely. I feel more emotion reading her books than I have ever felt reading any other book. Odium III is no different. I hate that I can feel so torn up about a book and love it at the same time. I think I love it when she tortures me. Odium III has so many great elements. There is a good amount of action, but it’s not a constant battle in the typical sense. Most of the actual battles occur within the characters heads. These characters are so freaking messed up in the head it’s not funny. But at least they come by it honestly. They have every reason in the world to be messed up. In this book we are given much more insight into Nova’s personality, and I really love her character. She is so bad ass. We are introduced to Joan, aka “crazy pants”. She is a very interesting character. She provides good comic relief, that’s for sure! Nina is still whining. I know she’s a main character, but I really don’t like her. She’s a walking disaster. I don’t know how she has managed to survive this long. She is such a depressing character. She reminds me of Debbie Downer from Saturday Night Live. The action scenes are very intense. There are some amazing scenes in this book that will leave the reader open mouthed with shock. I am still shaking my head in disbelief over this book. It’s not just one scene that did this to me. It’s several. I just can’t believe some of the scenes. Odium III is a great book. It picks up right where Odium II left off and carries the story forward flawlessly. If you haven’t started reading this series, you really should. I can’t think of another series that I can honestly say that I feel this strongly about. Every time a new book in the series comes out, I get this feeling of joy and dread all at the same time. I’m almost afraid of what I will find once I start reading! I do know that despite my unhappiness about certain things, Claire C. Riley has never disappointed me. Her writing is amazing and her creativity knows no bounds. She paints an apocalyptic world that is terrifyingly realistic and to be honest, it makes me a little bit nervous!"}, {"userName": "Liz at Fictional Candy", "userReviewDate": "Sep 17, 2014", "userURL": "http://www.goodreads.com/user/show/6062267-liz-at-fictional-candy", "userReview": "Claire C Riley has certainly upped the ante in Odium 3. Friends, if you are into the apocalypse, then I suggest you catch on to this series in a hurry.I'll skip a lot of the preliminary stuff, and assume you've read some of this series. We know Nina is a former resident of a walled in city, she's connected and fallen for a man named Mikey. They travel with some friends, and they are on the run from the Forgotten, which is a group of blood-thirsty criminals. The group feels like they may have found a home base with a new group of people, but as we know all too well - things are not always as they appear. At the end of Odium 2 Nina and Nova have taken off in search of a couple from Nova's old camp because they are expecting a child. Now, most of Odium 3 is the story of Nova and Nina, who are alike and different in so many ways. But somehow in this book these two manage to find a friendship. Both women are strong and a bit on the bitchy side. But where Nina is cautious, Nova is more wild and brazen. However, both women are to be admired for their varied strengths. And I like both women. I like that it's not always roses and rainbows and that there are times they hate each other. I like that they find a certain camaraderie that is so important to survive the apocalypse. No man is an island, and if you think you can survive on your own for very long, you are wrong. Claire C Riley really made me laugh throughout this book several times by the way of a character named Joan, a.k.a. Crazy Pants. Oh my goodness, this woman is hilarious. She's a bit off her rocker, but she finds companionship with Nova and Nina, and is on the trip with them. When things get too tense, you can count on Crazy Pants to come through with some comic relief.Odium 3 does not lack on the gore - or the surprises. Riley has definitely brought new situations to the apocalypse, and kept it fresh, dangerous, and exciting. I loved this book from the first to the last page! This is one of those series that I find myself anxious for each new book, her writing is that good. So yeah, if you haven't tried out Riley's version of the apocalypse, it's time you should."}, {"userName": "Becky Stephens", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/24779079-becky-stephens", "userReview": "I’m pretty sure too much time elapsed between reading Odium II and Odium III, and there were too many other stories floating around in my head in that time. It took me a while, as I read, to remember how the last book left off. Then, I was crushed when the details came to me—Nina and Mikey were not a couple. As I read, I dared to hope they would reconcile. Just as Nina wavered on her hope for a future, for humanity.Nina is that one character that you truly root for. She’s bitter, sarcastic, and has a short fuse, but she has every right; she has survived so much. Unfortunately, each event has left a mark on her soul, and that shapes her decisions. But, still, I have hope for her. If she has survived this long, she can continue to survive—with or without Mikey.Claire writes each and every character with such detail that I imagine they are standing in front of her as she types away. I don’t necessarily mean she describes them physically. No, it’s more than that. Each character is a deep well of thoughts, emotions, and experiences that it’s impossible to think that they are simply names on a page. No, they must be real people. And, I suppose they are, even if in Claire’s imagination.I’m happy to report that I have read every single book in The Dead Saga series, and they are all filled with three-dimensional characters and gory zombie goodness. If you are a fan of zombie stories and haven’t yet read one of Claire C Riley’s books (What the heck is wrong with you?), then I suggest you get to one-clicking. You will be happy you did.I received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review."}, {"userName": "Stormy", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/5883218-stormy", "userReview": "When Odium III showed up on my kindle finally, I was practically salivating! I couldn't wait to dive right back into Nina's story and watch what happened to her and the gang. I can guarantee you that THIS book will not disappoint. In true Claire C. Riley form, she keeps you hanging on the edge of your seat all through the story. She gives you that roller coaster ride of a book that has you clutching your kindle, crying out in despair at times, and asking yourself WHAT IN THE WHAT!?!? Laughing out loud at Nina's snarkiness, and praying to the Kindle Gods for them not to take your favorite characters.Odium III Begins where Odium II left off. But shortly after you dive into this you realize that Nina is changing and developing into a character far from where she began. The great thing about the Dead Saga Series, and Claire C. Riley's awesome writing abilities is that just when you think you have it ALL figured out, the scene changes, something crazy happens, and she takes you on another crazy ride you never thought would happen within the story she has written. Just when you think you can let your breath go, and the characters can finally breath, so can you. She throws in a twist and makes your heart sink once more.I have never really been a huge fan of stories that move past the Trilogy stage. But this is one series that you will want to sink your teeth into every single book the author puts out. You will want it to keep going and going. I would want to live in Nina's world, you know, if I wasn't going to be chased down by Deaders or the Forgotten! Odium III took me on a crazy emotional ride and I loved every single second of it! I'll be impatiently awaiting the next book in this amazing series!"}, {"userName": "Eli Constant", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/16763100-eli-constant", "userReview": "It's hard to give an in-depth review of this book without spoiling some phenomenal and twisty happenings within- not that established fans should be surprised by now. Riley has an innate (almost infuriating) ability to make us (her fans & readers) fall in love and like with her characters and then face-punch us like a well-worn heavy bag in a testosterone-riddled ghetto gym. You'd think we'd be pissed; that we'd wave 'adios' to Riley, unable to take one more instance of 'what the f**k just happened?'Right. Like that's going to happen.Because the truth is... well, we live for that s***t.Let me just say these few things- Nina is in an even darker place- emotionally & physically. Nova is still the zombie-killing ninja we know and love, but a hint of a softer side peeks out and makes us go 'awww, I totes like her more now'. Crazy Pants is a person (that needs a bath and some memory juice). Mikey's still sexy (although we don't see him as much, boo). Some characters that were ever-present in books 1 & 2 play supporting roles instead of being front-and-center, but that doesn't mean they're safe. And the questions (Hilary & Deacon) and cliff-hanger from book 2? Yeah, those are answered and played out in morbid, gut-wrenching, gooey detail that made my heart hurt. I put the book down a few times (that rarely happens to me). Of course... this book also ends with some tears, a cliff-hanger, and a 'Nina... what the crap!?'. D*** you, Riley! So prepare your face, you duct-taped punching bag, Riley's got her gloves on and she likes to leave bruises."}, {"userName": "T.W. Brown", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/3234548-t-w-brown", "userReview": "Last year, I was hit with about a dozen books in a row that were written by amazingly talented women. I am not saying this with shock or surprise, I am simply putting down a preface for those who do not realize the amazing talent for capturing the horror market that these women possess. I am in constant awe of how they can bring me (the reader) so deep into a story.Claire Riley has the ability to hook you with such an awesome display of descriptive ability. Her strength resides in her talent at making you hear, see, feel, and smell everything that her heroine Nina encounters. You would be gravely mistaken if you think this might be some \"Harlequin Horror\". Oh no. This is the real deal with grit, violence, and all of the nastiness (in the best way possible) that you want from a horror/zombie tale.As is the hallmark of the best stories in the z-cult, Claire's story is about people. They feel and emote in very real ways that do not ever seem forced.I was blessed to receive an advance copy of this book for review and hope I am equally fortunate when she releases book 4."}, {"userName": "Ken Mooney", "userReviewDate": "Mar 23, 2015", "userURL": "http://www.goodreads.com/user/show/10278361-ken-mooney", "userReview": "Claire C Riley revisits the world she's already shown us in her other Odium books, and this third entry in the series proved to be the most gripping yet. As ever, Riley has an amazing central character, and a sense of everything that character things and feels...and of course, we feel it to.Riley's story is a mix of love and hate, a blend of fear and confidence that comes in a world where zombies have taken over...and where the scariest things are actually the other people who are in this world. Riley is capable of telling thrilling and heart-breaking stories, but I don't want to say much about these without spoiling the first two books in this gripping series.Odium 3 proves one thing to me: Riley is building a world, a world where she knows exactly what she's doing, and which is as engrossing as The Walking Dead or any other zombie apocalypse. This book is a must for rans of Riley or her worlds, but definitely (as with all series) start from the beginning."}, {"userName": "Halima Rahman", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/11369249-halima-rahman", "userReview": "\"If there was a heaven, then that meant that there was a God, and if there was a God, what the hell was he thinking letting zombies walk the earth?\"Just when I thought it couldn't get any better, it did! I'm speechless... Wow! Nina's journey becomes darker & more intense and in many ways more reflective and emotional. Through the captivating magic of Claire's writing I felt it all and am still feeling the rawness of every page, the heartbreaking effects of Nina's tragic plight, the irresistible depths of Mikey's feelings, the intensity of Nova. This was the series that pulled me into the Zombie dystopian Genre & I'm so glad it did. Yet again Claire C Riley has taken me on an amazing, vivid and fierce journey through the apocalypse. My only complaint is that I'm now desperate for the next book & I'm not sure I can wait until Winter 2015!"}, {"userName": "Shanna Tidwell", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/39871892-shanna-tidwell", "userReview": "It appears that part of my review is missing! Edit:I love this series. I was given book 2 & bought 1 & 3. Worth every penny. This is one of my favorite zombie series. Wasn't expecting a book 4 because it said 'trilogy' on the cover. Can't wait to finish the books on my list so I can buy it & start on it. That being said I know not all series can go on forever..... but still! Damn! I actually loved the narrator even though I wasn't happy with the change in book 3. It's usually frustrating. Still she did an excellent job. This one just left me wanting more and I don't think I'm going to get it."}, {"userName": "Stephanie Maynard", "userReviewDate": "May 01, 2015", "userURL": "http://www.goodreads.com/user/show/30209199-stephanie-maynard", "userReview": "Omg!!I love this whole series and I'm so mad at how it ended. I am not a patient person so I hate that I have to wait for next book. The ending to this made me mad. I bit my lip till there was nothing left lol. The suspense killed me I cannot believe everything mind Nina and Nova and Mikey and just everyone went thru. Joan cracked me up for sure haha. Seriously tho this is an amazing suspenseful series that will make u scream, cry, hope, love, and everything. WHY DID IT HAVE TO END THAT WAY? I need the next book like now. For all zombie lovers this is a MUST READ! The author is amazing and definitely knows their shi*."}, {"userName": "Donna", "userReviewDate": "May 01, 2016", "userURL": "http://www.goodreads.com/user/show/10285365-donna", "userReview": "Exciting run for their lives!The third entry in this amazing series took more characters from us that we loved and gave us new ones to learn to love.I love Joan, or \"Crazy Pants.\" What a colorful, damaged and vulnerable woman she is! I am chomping at the bit to start number four, especially with how this one ended, leaving us with no clue how it went, except our imaginations.This continues to be one of my all time favorite zombie series. But I have to wonder if Nina would really do what she did in the end. I'm hoping some miracle happens and she survives.I have read this for the THIRD time, definitely one of my all time favorite zombie apocalypse series. But to end this book as it did just made no sense to me this time again. Why does she go into that mall alone? What does she hope to achieve? I see no rationale for this. On to IV which hopefully will enlighten me."}, {"userName": "Kelli Mcelreath", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/32390572-kelli-mcelreath", "userReview": "So the third installment in the series. I'm obsessed with where Nina will go. The awesome thing about these books is you have no idea what will happen. Seriously. You don't know what characters will make it. Who will survive who will die and all through it you are their cheerleaders. the story picks up from the last and it emotionally draws you in and it's a total page turner, up all night situation. No one is safe. I laughed in some parts. Was mad in others and ended with a sob. I can not wait until winte. This will be torturous."}, {"userName": "Gail", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/28503145-gail", "userReview": "Odium III, oh how I want thee not to be over so soon. This book was filled with so much growth in the character of Nina, but it did not let down on any zombie killing, or any of the “you ain’t going to believe this” stuff you have come to expect from Claire Riley. If you think that you have been shocked before, and there is nothing left to get you, go ahead and read on in to these pages. I am on pins and needles waiting for the next installment. Oh, please write faster, I can’t take much more waiting."}, {"userName": "For the Love of Books & Alcohol Blog", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/28470999-for-the-love-of-books-alcohol-blog", "userReview": "This cover! OMG"}, {"userName": "Dena", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/6071893-dena", "userReview": "Wow!!I am in awe of how real this journey is turning out. The real threat is people not the zombies and his author reiterates it over and over again. I like the fact that Nina realizes what is within herself and fights for it. I like the way the story is going and I can't wait to find out what Mikey is going to do. This story is definitely a roller coaster ride of intense emotion."}, {"userName": "Sal", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/14922432-sal", "userReview": "Fantastic!I said it in my last review of this series but I'm going to say it again, this just keeps getting g better and better! This series really is one hell of a ride and a ride I do not want to get off! Every page has me gripped, every breath stealing moment makes me want more and more is what is what I will have. Onward to the next book!!"}, {"userName": "Allie Rashkow", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/4017717-allie-rashkow", "userReview": "No. I can't believe it ended like that. No. And now I have to wait who knows how long for the next one? And I swear to God if Mikey keeps thinking she's gone and goes and meets someone else, I can't even. Ugh."}], "description": "In this life, nothing is simple...not even DEATH In the third instalment of the Odium series, having distanced herself from Mikey, Nina is on a mission. She's seeking a woman who could be the answer to all their problems...or just another nightmare made reality. Travelling alongside Nova, the two women are faced with countless threats and inexplicable circumstances...just another day in the land of the dead. But Nina is changing, feeling the strain of this life, and beginning to rethink the choices she's made and the woman she's become. New allies will be forged on this road of self-discovery, bonds will be broken, and old enemies will resurface. Nina will be forced to make a decision that could have devastating consequences. However life is nothing without someone to love, or a family to love you in return. And in this new world, there is only one way to prove that love is still possible. Sacrifice.", "title": "Odium III\n      \n          (The Dead Saga #3)", "url": "http://www.goodreads.com/book/show/22559561-odium-iii", "average": 4.23, "cover": "https://images.gr-assets.com/books/1422790683l/22559561.jpg", "reviews": 53, "authors": [{"url": "https://www.goodreads.com/author/show/6982197.Claire_C_Riley", "name": "Claire C. Riley"}], "type": ["Horror", "Horror", "Science Fiction", "Romance", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/22559561-odium-iii", "http://www.goodreads.com/book/show/25200028-odium-iii", "http://www.goodreads.com/book/show/25492101-shut-up-kiss-me", "http://www.goodreads.com/book/show/39652603-odium", "http://www.goodreads.com/book/show/39653049-odium-ii", "http://www.goodreads.com/book/show/24980201-limerence", "http://www.goodreads.com/book/show/29970373-out-of-the-dark-1"]}