{"ratings": 1744, "userreviews": [{"userName": "Simone", "userReviewDate": "Apr 09, 2007", "userURL": "http://www.goodreads.com/user/show/28888-simone", "userReview": "This book is an essential read for anyone interested in feminist and or gender related issues. An absolute classic. Here are a few memorable excerpts:1. \"Partiarchy is the power of the fathers: a familial-social, ideological, political system in which men - by force, direct pressure, or through ritual, tradition, law, and language, customs, etiquette, education, and the division of labor, determine what part women shall or shall not play, and in which the female is everywhere subsumed under the male.\"-a nice definition since so many fumble with it usually2. \"A crucial moment in human conscioussness, then, arrives when man discovers that it is he himself, not the moon of the spring rains or the spirits of the dead, who impregnates the woman; that the child she carries and gives birth to is his child, who can make him immortal, both mysticallyl, by propitiating the gods with prayers and sacrifices when he is dead, and concretely, by receiving the partimony from him. At this crossroads of sexual possession, property ownership, and the desire to transcend death, developed the institution we know: the present-day patriarchal family with its supernaturalizing the penis, its division of labor by gender, its emotional, physical, and material possessiveness, its idea of monogamous marriage until death (and its severe penalties for adultery by the wife), the \"illegitimacy\" of a child born outside wedlock, the economic dependency of women, the unpaid domestic services of the wife, the obedience of women and children to male authority, the imprinting and continuation of heterosexual roles\"3. \"The pig, declared an unclean animal in the Koran and the Old Testament, was a reiterative figure in goddess - religion; the sow was sacred in Crete, sometimes appeared as an embodiment of Isis, was sacrificed at the feast of Aphrodite, and was a symbol of the Eleusinian cult of Demeter. \"Wherever the eating of pork is forbidden and the pig is held to be unclean, we can be sure of its originally sacred character\"\"-something I never knew4. \"Women who refuse to become mothers are not merely emotionally suspect, but are dangerous. Not only do they refuse to continue the species; they also deprive society of its emotional leaven - the suffering of the mother\"5. \"As her sons have seen her: the Mother in patriarchy: controlling, erotic, castrating, heart-suffering, guilt-ridden, and guilt-provoking; a marble brow, a huge breast, an avid cave; between her legs snakes, swamp-grass, or teeth; on her lap a helpless infant or a martyred son\"-nice"}, {"userName": "Rebekah", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/12288876-rebekah", "userReview": "I only made it to the half way point in this book. I may finish, but I'm not sure yet. While this book is praised by many feminists, many of whom I have read, I am not loving the tone Rich takes when writing about motherhood. While it shares real expereince, which I appreciate, it also tends to demonize the 'mother.' I was especially put of by a section where she writes that motherhood is essentially a power trip for women and a way to exercise control. As a mother and a woman I take offense to this. While I can see how this may be the case with some parents (not only mothers), it is definitely not the case with all mothers.The parts of the book that attempt to shed light on some of the more painful expereinces women have as mothers, as well as the sections where she discusses how women's relationships with their own mothers affect their parenting is interesting, at times even valuable, but at other times it is again a bit demonizing.I'l update if and when I finish this book."}, {"userName": "GeekChick", "userReviewDate": "Oct 26, 2007", "userURL": "http://www.goodreads.com/user/show/577893-geekchick", "userReview": "Rich details how motherhood and childbirth were subjugated as people transitioned from matriarchal or equal societies to patriarchy. She traces how patriarchal systems then drastically lowered women's role and value, and how childbirth was 'stolen' from midwives and turned into a 'medical procedure.'Rich is clearly angry about all this, and given the era she grew up in, it is understandable. And remember that the book was written in the mid-1970s. Still, the anger only rises to the surface now and then. It is an excellent, empowering book for any woman who struggles to define herself outside the role of 'mother' or \"woman without children.\" Her point of, \"why do we define women who aren't mothers by something they don't have, rather than something they do?\" rings true. We have been reduced to the sum of our reproductive capacities. The situation has been improving in recent decades, but depending where one lives there is still a long way to go. As a working mom struggling to add motherhood to her self-definition (rather than becoming it), I found this book extremely liberating and empowering.I've read a few other books on this subject, but this one is the best."}, {"userName": "Rebecca Foster", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "This is an excellent book about the myths and stereotypes surrounding motherhood, contrasted with the reality of Rich’s experience as a mother of three sons. It is an academic-level work and can be fairly heavy going, which is why I started skimming at about page 55 (though I did slow down and read in its entirety the late chapter that felt most relevant to me, “Motherhood and Daughterhood”). Though it was originally published in 1976, we’re still in thrall to the patriarchal system of motherhood that Rich describes and dates back to the dawn of monotheistic religion. She writes about the bodily reality of motherhood and the crisis of purpose for both mothers and non-mothers: is becoming a mother really the only marker of a woman’s success? How can a separate identity as an artist be carved out and sustained? New books about motherhood arrive every year – I’m looking forward to Sheila Heti’s, for instance – but it’s hard to imagine one more complete and profound than this."}, {"userName": "Aubrey", "userReviewDate": "Jul 27, 2014", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "Those who speak largely of the human condition are usually those most exempt from its oppressions—whether of sex, race, or servitude.\nAt the end of this book, Rich says something about women, even at the time of her writing, thinking in ways that were ignored, derided, or actively suppressed by mainstream ideologies. I don't know whether she intended this to be self-reflection or irony, or if she had any intent at all that reflected on her own building of structures rather than the broadside and seemingly exterior targets of patriarchy and gynephobia. To put this in a way less oblique, between the time I read On Lies, Secrets And Silence and now, I have become increasingly and horribly aware of the connotations of the phrase \"radical feminism\" with all its TERF and SWERF offshoots that invest certain \"women\" the divine right to define what \"woman\" is. If this were in anyway conducive to social justice movements, I would be perfectly right in defining woman as only those who undergo the risk of bleeding out every month as the result of perfectly natural biological processes, in addition to the uterus, in addition to the vagina, in addition to the breasts and the hormones and whatever else the gendered social construction has imbibed over the years. However, I don't. My main reason why? I'm not interested in participating in genocide.Reading this while trying to factor trans women in is like trying to take a wolverine for a walk through the park. It's not just the difficulties of getting any use out of all the assumptions of shared commonalities of physiognomy that make the experience a tightrope. It's also that there's a history of radical feminism humiliating, violating, and ostracizing trans women in the streets, on the podium, and in the halls of US Congress, a violence that is more than healthy on the modern trails of the Internet. Rich may have published this in 1976, but the Stonewall Riots that were spearheaded by a trans woman of color occurred nearly a decade previous, and I find it extremely hard to believe simple ignorance could have lasted so long. Throw in the fact that Rich is acknowledged as having aided in the murderous horror that is The Transsexual Empire by the author herself in 1979, and you have a cis writer who's more comfortable referencing cultures in Kenya and China than with looking in her own backyard when it comes to concepts of mother, motherhood, and the impact of it on women. Every so often a quote would appeal, but not enough to post it outside of the context of a willful calcification of the idea of womanhood around what science, up till this point so suspicious in its preponderance of (cis) men participation, at the time proposed.Beyond the transphobic construction of this entire thing (you could say it's aged badly, but the fact that Rich never bothered to go back and comment on her thinking before her death in 2012 shows that it hasn't so much aged as poisonously survived), there are smaller individual matters about her vilification of birth control, abortion, insanity, and a relationship between mother and child where the child is not in anyway owned by the parent. As someone whom eugenics would have eagerly purged out of the womb, the last thing I need is a portrait of child abuse that seeks apologisms and an analysis of infanticide that considers gendred physiognomy as the only plausible factor. In terms of birth control business, I agree there needs to be more review of the science, but considering how Rich glosses over the coercion of Puerto Rico women, followed by the enforcement of incarcerated women with the former connected the horrible side effects to the drug trials they were undergoing, her critique comes off less as invested and more as ableist as fuck. There's also the random allusions to woman of color (black women more like), slavery, incest, and other issues that weren't intersectional so much as the bare minimum of covering all of one's bases.In short, I like Rich far better when she talks about herself. That's what the beginning of this book was, a misleading introduction that led to me looking to recapture the tone of someone who's actually experienced what she's talking about till, disappointingly, the very end. I'll still be looking to acquire another book of her poetry/prose/writing compilations, but to put it plainly, those who had reservations about mourning her without qualm back in 2012 were right to have such."}, {"userName": "Joanna", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/5244849-joanna", "userReview": "Good thing I didn't read this in college, or I would never have gotten married and had a child. Or, maybe I should have read it then and sacrificed everything for my poetic career.A reminder of what being a gifted writer, committed feminist and serious thinker really means. Some of it is a little dated, but it's still like having a bucket of cold water poured on your head--infuriating, terrifying and enlightening all at once."}, {"userName": "Kenya Wright", "userReviewDate": "Dec 12, 2013", "userURL": "http://www.goodreads.com/user/show/3414889-kenya-wright", "userReview": "I read this long ago in one of my Feminist Theory courses. It basically changed my life and I believe I was lucky to read this before actually becoming a mother. I have so much less mother's guilt as I pursue my writing career."}, {"userName": "Isla McKetta", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/5723395-isla-mcketta", "userReview": "This is the book I should have started reading when I found out I was pregnant, but I'm so glad I finally got to it. It's an insightful look at womanhood and motherhood with no agenda except for women to find their own best journeys. I really appreciated Rich's blend of academic research and personal insight."}, {"userName": "delphiansybil", "userReviewDate": "Jun 20, 2007", "userURL": "http://www.goodreads.com/user/show/135039-delphiansybil", "userReview": "This is an amazing book -- Rich discusses the experience of motherhood and daughterhood from pre-birth to adulthood with exquisite language and emotion. Every mother and daughter, and every daughter who is thinking of becoming a mother should read this book. It is fantastic and really one of the most important feminist books of its time."}, {"userName": "Lois", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/1345295-lois", "userReview": "Adrienne Rich died today. She had a profound impact on me when this book was published, when I was 26 and not yet thinking about becoming a mother. Her poetry, especially \"Diving into the Wreck\" and \"Dreaming a Common Language\" moved me and challenged me."}, {"userName": " SaЯRah Muhammad", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/34560388-sa-rah-muhammad", "userReview": "Adrienne Rich's book, Of Woman Born, is a book about Rich's own experience of being a mother. She writes from a feminist perspective, and explains how the motherhood institution that is imposed on them through society determines a woman's motherhood experience. At one point in the book, Rich tells a story about a woman who killed and decapitated two of her children in her front yard. When Rich discusses this story with her poetry group, the women all agreed that they felt a direct connection with the woman`s desperation. Rich wrote that every woman in her poetry group that had children could identify with her. It seems as though all parents have a breaking point when it comes to their children, however it seems highly unlikely that those parents could ever imagine doing what that woman did to their own children. Rich also discusses the hatred that mothers feel towards their child, and the depression she felt throughout raising her three children. The book also seems to be a bit outdated. At one point of the book, Rich writes \"I had no idea of what I wanted, what I could or could not choose. I only knew that to have a child was to assume adult womanhood.\" When relating this quote to the 50's, it is very fitting. However, it is not so true for this time period. Women are no longer expected to bear children. Women can now go to college, achieve a degree, and obtain virtually any job a man could get. It is much more accepted now if a woman does not want to have children. There are many women who chose not to have families now a day, but who are still assumed into adult womanhood. She continues to express that her children held her back from being able to do what she wanted to do in life. I know plenty of women who are able to have jobs while also caring for their children. I feel like by Rich saying this, she is stating an untrue generalization that no woman wants to be a stay at home mom, and no woman is able to live her life to the fullest if they have children. These generalizations may be true for some women, but there are plenty of women out there who do not fit into this mold that Rich describes. Rich also writes \"women have been both mothers and daughters, but have written little on the subject; the vast majority of literacy and visual images of motherhood comes to us filtered through a collective or individual male consciousness.\" For the time this book was written, Rich was completely right. However, women writers are now as common as men.The one part I did find interesting in the book was when Rich discussed the history of women. She theorizes that women bear the weight of Eve's transgression, since she was the first women offender. She also goes on to talk about how the relationship between sexual acts and pregnancy went unrecognized. Men had an active denial to their paternal role; therefore they believed that women were impregnated by spirits of the dead. I also thought it was interesting when Rich mentioned how Ancient Mid-Eastern tombs were deliberately designed to resemble the body of the mother- with labyrinths and spirals intended to represent her internal anatomy- so that the spirit could be reborn there.I have read a lot of positive reviews for this book, so maybe I do not have the same connection to the author that others have. I am not a mother so there may be some parts of the book I cannot fully relate to and have some bias towards."}, {"userName": "Jennifer", "userReviewDate": "Jun 15, 2008", "userURL": "http://www.goodreads.com/user/show/317361-jennifer", "userReview": "This is a 2nd wave feminist standard, and it adds fuel to the argument that 3rd wave feminism hasn't added nearly as much to the dialoge as we young gals who don't listen to our elders might think. The first few chapters focused on the inherently speculative history of ancient societies that might have been women- and specifically mother-centered. While that is interesting (even if it isn't true, it offers visions of ways of viewing motherhood that differ from the modern sentimental view), it wasn't really what I was after. However, later chapters went into the history of midwifery and obstetrics, and Rich discusses the ongoing struggle for male control over women's sexuality and motherhood. She also tells the story of her own experience as a mother, something she was deeply ambivalent about. Rich argues that the expectations put on mothers (which seem to have changed little since 1975, and now there's even less of a social safety net for moms) is crazy-making, and in fact devotes the final chapter to women who kill or fantasize about killing their children.She also has a chapter each on women's relationships to their sons and daughters, and I was surprised by how little I related to the mother/daughter chapter.I give it 3 stars because there were at least 3 chapters that were fine enough but not really what I was interested in reading, the rest of the book was very good."}, {"userName": "TippyH", "userReviewDate": "Jan 30, 2017", "userURL": "http://www.goodreads.com/user/show/32271411-tippyh", "userReview": "Reading this book after just having my second child was certainly timely and made it all the more relevant. A very thorough examination of women and motherhood in history up to present day. I enjoyed the historic element of the book in particular the analysis of the development of medical help in child birth and contrasting the approach of midwives verses OBs. Having recently received midwife care I could closely relate to the difference in approach despite some of the examples Rich cites occuring decades ago - much felt relevant today. It was refreshing to read someone speak so frankly about the difficulties of motherhood and the place society puts mothers in. Although this book was written a good 30 years ago I would say it is still very relevant today."}, {"userName": "missy jean", "userReviewDate": "Oct 05, 2008", "userURL": "http://www.goodreads.com/user/show/327527-missy-jean", "userReview": "Fascinating. I love how Rich combines her feminist critique with anecdotes and reflections from her own experiences as a mother. I don't necessarily agree with all of her conclusions (and some of the information is dated, since the book was written in the '70s), but I really related to her language. Rather than dismissing the challenges of motherhood as minor frustrations, Rich really delves into the confusion and identity loss and overpowering sense of inadequacy that many mothers feel. It was healing for me, in chapter one particularly, to read someone else describing these familiar (for me, anyway) emotions with so much compassion and precision. I've been thinking nonstop about some of the issues this book addresses."}, {"userName": "Steven", "userReviewDate": "Mar 06, 2008", "userURL": "http://www.goodreads.com/user/show/957423-steven", "userReview": "With sturdy intelligence and an astute layering of research, personal experience and fresh insight, Adrienne Rich has created a timeless text that even at the beginning of the twenty-first century stands as a fascinating and thought-provoking study of women's challenges in modern societies. The reader is continually drawn into the text and its visceral world of examples from literature, scientific texts and real life testimonies. Throughout the book, I was in constant awe of Ms. Rich's ability to turn her personal experiences into pitch perfect testimony that took this academic study to a more engaging level. This is one critical book no one should be afraid to tackle."}, {"userName": "Maria", "userReviewDate": "Jun 01, 2013", "userURL": "http://www.goodreads.com/user/show/15674802-maria", "userReview": "Το μόνο που έχω να πω είναι ότι είμαι πολύ χαρούμενη που το βρήκα μεταφρασμένο στα ελληνικά και κατάφερα να το διαβάσω στη γλώσσα μου και να το κατανοήσω καλύτερα. Η Rich, της οποίας το έργο γνώρισα πριν λίγο καιρό στο πανεπιστήμιο, με αυτό το εξαιρετικό έργο της με προβλημάτισε σε σχέση με την μητρότητα αλλά και τον φεμινισμό. Αλλά και γενικότερα για τους ρόλους των γυναικών και των ανθρώπων μέσα στην κοινωνία. Με τη δεύτερη ανάγνωση σίγουρα θα ανακαλύψω περισσότερα!!!!!"}, {"userName": "Rose Gowen", "userReviewDate": "Dec 15, 2015", "userURL": "http://www.goodreads.com/user/show/190812-rose-gowen", "userReview": "I wasn't that into the mother-goddess bit, and I would have liked to have more of Rich's personal story/experiences. Otherwise, this book made me mad (in a good way). I wish I'd read it years ago."}, {"userName": "Nicolas Lontel", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/76024640-nicolas-lontel", "userReview": "Ayant lu rapidement le résumé, je m'attendais \"simplement\" à une réflexion sur la maternité et le rôle de mère, mais je ne m'attendais vraiment pas à la réflexion approfondie sur l'enfantement, la maternité et la femme, sociologique, historique et un peu personnelle aussi, qu'Adrienne Rich nous livre ici.Autant elle s'inscrit à la suite des réflexions anthropologiques de Margaret Mead et Johann Jakob Bachofen sur les sociétés matriarcales, gynocratiques et/ou patriarcales et les éléments qui la composent qu'à la suite des réflexions de Kate Millett (Sexual Politics) sur les attributs du patriarcat contemporain et leur incidence sur la vie des femmes. Elle approfondi aussi énormément ce que Deirdre English et Barbara Ehrenreich commençaient à explorer dans Witches, Midwives, and Nurses: A History of Women Healers ainsi que Complaints and Disorders: The Sexual Politics of Sickness et suit un parcours historiques et juridiques de la prise en charge de l'enfantement et de la théorie, des méthodes de travail par le patriarcat et les hommes et la dépossession de l'enfantement au corps médical reléguant le statut de sage-femme à celui de sorcière et prompt aux insultes. Elle parle évidemment aussi des nombreuses violences obstétricales, du Moyen-Âge à aujourd'hui.En plus de toutes ces analyses, très larges, complexes et presqu'exhaustif pour expliquer des systèmes d'exploitation, qu'on retrouvait beaucoup dans les essais féministes des années '70, elle introduit aussi sa propre expérience d'enfantement, de mère dans la société américaine et en tant que femme appartenant à certaines communautés (juive, lesbienne, ...) qu'elle le désire ou non et arrive à refléter un large éventail d'expériences de d'autres femmes (noires, pauvres, etc.) et de leur propre barrière et oppression dans une conception de la maternité imposée par le patriarcat. Elle réfléchit aussi sur la place (ou l'absence) de la femme non-mère (qui n'a pas de mot pour la décrire) dans la réflexion théorique féministe et maternelle.Un livre qui n'a pas vraiment vieilli au fond. Probablement un incontournable du genre."}, {"userName": "Nicole", "userReviewDate": "May 07, 2017", "userURL": "http://www.goodreads.com/user/show/2395941-nicole", "userReview": "To have a child, to not have a child. To give birth, to embrace motherhood, to find oneself feeling trapped in it, to choose not to have a child, to struggle with infertility and remain childless, to struggle with infertility and have a child through IVF or adoption...if you are a woman, there is a part of you that will always define itself by how it relates to motherhood. I cannot speak for the experience of men and their relationship to fatherhood, and that isn't what this book is about anyway. \"Of Woman Born\" is unabashedly female in nature, from its refusal to remain academic in nature and foray into the personal, to the author's naked hatred for what can be termed, for better or worse, as \"the patriarchy\". Though one of the members of my bookclub found it to be dated, I was taken aback by its relevance to and the pictures we see of groups of old white men in the federal government making decisions about women's health. Rich's experience of motherhood is not one that I particularly relate to, but her documentation of her ambivalence and discomfort with it is vitally necessary in a world that tells us that motherhood should be universally embraced. The history of motherhood is primarily a silent one, as most women's history tends to be. For me, this elevated Rich's work, and excused many of the flaws that my bookclub friend found herself hung up on."}, {"userName": "Michelle", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/1430004-michelle", "userReview": "In the canon of great feminist thinkers, particularly from the second-wave, Adrienne Rich is less a household name than Betty Friedan or Gloria Steinem. She shouldn't be. Her treatise on motherhood and what it means in the history of society, not just relationally, but as a social construct, is profound. To read words written in the mid 1970s that still ring true today is both comforting and horrifying. Rich connects us to our history - mothers to daughters - and provides a path forward that, 45 years later, we have yet to find."}, {"userName": "Melissa", "userReviewDate": "May 22, 2017", "userURL": "http://www.goodreads.com/user/show/291746-melissa", "userReview": "Some parts are dated/dry as dust, but when Rich is incisive and brilliant, no one writes like her."}, {"userName": "Jeremy Hung", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/3106901-jeremy-hung", "userReview": "\"The woman's body is the terrain on which patriarchy is erected.\""}, {"userName": "Bookshark", "userReviewDate": "Jan 04, 2018", "userURL": "http://www.goodreads.com/user/show/5863653-bookshark", "userReview": "so much and so little has changed. many brilliant insights, lovely writing"}, {"userName": "Mia You", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/73373867-mia-you", "userReview": "Essential reading for anyone who is a mother, knows a mother, has a mother."}, {"userName": "Cara Byrne", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/17928781-cara-byrne", "userReview": "I enjoy this book more and more each time I read it. Rich's work is deeply interesting and dynamic, as she explores the institution and the \"potential relationship\" or experience of motherhood through historical and literary research, as well as talking about her experiences as her mother's daughter and as her three sons' mother. The autobiographical content is raw and poetic and is easily my favorite part of this book. I also appreciate her taking up of Lessing's concept of \"matrophobia,\" exploring the intricacies of mother and daughter relationships. I love how she ends the book: “The repossession by women of our bodies will bring far more essential change to human society than the seizing of the means of production by workers. The female body has been both territory and machine, virgin wilderness to be exploited and assembly-line turning out life. We need to imagine a world in which every woman is the presiding genius of her won body. In such a world women will truly create new life, bringing forth not only children (if and as we choose) but the visions, and the thinking, necessary to sustain, console, and alter human existence – a new relationship to the universe. Sexuality, politics, intelligence, power, motherhood, work, community, intimacy will develop new meanings; thinking itself will be transformed. This is where we have to begin” (292)."}, {"userName": "Brenda", "userReviewDate": "Feb 19, 2008", "userURL": "http://www.goodreads.com/user/show/802435-brenda", "userReview": "Favorite Quotes:\"The most important thing one woman can do for another is to illuminate and expand her sense of actual possibilities.\"\"But the \"motherless\" woman may also react by denying her own vulnerability, denying she has felt any loss or absence of mothering. She may spend her life proving her strength in the \"mothering\" of others - a with Mrs. Ramsay, mothering men, whose weakness makes her feel strong, or mothering in the role of teacher, doctor, political activist, psychotherapist. In a sense she is giving to others what she herself has lacked; but this will always mean that she needs the neediness of others in order to go on feeling her own strength. She may feel uneasy with equals - particularly women.\"\"Interpreting to a little girl, or to an adolescent woman, the kinds of treatment she encounters because she is female, is as necessary as explaining to a nonwhite child reactions based on the color of her skin.\"\"Mothering and nonmothering have been such charged concepts for us, precisely because whichever we did has been turned against us.\""}, {"userName": "Dawn", "userReviewDate": "Mar 30, 2010", "userURL": "http://www.goodreads.com/user/show/3521409-dawn", "userReview": "Lately I've been reading everything I can find about maternal feminism, a quieter branch of feminism. This is the first second-wave text I'm reading; everything else has been published post-1985 and references, in some way or another, this phenomenal book. Why is a woman's place in society so ardently outlined up until becoming a mother? Why does \"mom\" seem like some sort of asexual sub-woman delegation? What happens if you want to experience maternity but aren't resigned to it being the peak experience of your life? These are the questions that eventually propelled me to my \"click\" moment with feminism,and the questions Rich was the first to tackle in this book."}, {"userName": "Kathy", "userReviewDate": "Apr 23, 2012", "userURL": "http://www.goodreads.com/user/show/2336179-kathy", "userReview": "Stunning work. It raged into the world with a horrible and beautiful truth. I read it first as I was nursing my firstborn, in the 70's. Fearful territory. She may have been the first to look with clarity at the ambivalence of motherhood, coming from her own perspective as a good mother and wife of the 1950's, bearing three sons in something like 6 years, plunging into the roughening waters of feminist consciousness, coming out as a lesbian. As to the last, I have always cherished her retort to the interviewer who asked what her sons thought of her lesbianism. Said Adrienne \"well, I guess you'll have to ask them\"."}, {"userName": "Molly Westerman", "userReviewDate": "Dec 01, 2010", "userURL": "http://www.goodreads.com/user/show/3925365-molly-westerman", "userReview": "A must-read for feminists interested in the institution of motherhood (and really, as Rich argues, why wouldn't you be, whether or not you intend to parent?) and for parents, birthworkers, and other healthcare providers interested in feminism and/or in mothers' experiences. I went into this book braced to find it painfully dated but (although of course it's of its own time) was pleasantly surprised throughout: it's not just an influential classic of historical interest but a book that continues to be thought-provoking and relevant today.Rich writes engagingly and is honest and thoughtful in her arguments here."}, {"userName": "Jan Priddy", "userReviewDate": "Nov 11, 2012", "userURL": "http://www.goodreads.com/user/show/4074574-jan-priddy", "userReview": "This is a well-researched exploration of the psychology of motherhood, and how female biological role as creators has been co-opted, exploited, and perverted by patrimony. I wish I'd read it when it first came out, and I am very glad to have read it now. She is a generous-hearted, creative, and courageous writer. I am familiar with most of her sources, so that made the reading interesting. That she spoke to notions stirring already in my mind, was even more satisfying."}], "description": "The experience is her own—as a woman, a poet, a feminist, and a mother—but it is an experience determined by the institution, imposed on all women everywhere. She draws on personal materials, history, research, and literature to create a document of universal importance.", "title": "Of Woman Born: Motherhood as Experience and Institution", "url": "https://www.goodreads.com/book/show/305826.Of_Woman_Born_Motherhood_as_Experience_and_Institution", "average": 4.18, "cover": "https://images.gr-assets.com/books/1365396010l/305826.jpg", "reviews": 71, "authors": [{"url": "https://www.goodreads.com/author/show/29947.Adrienne_Rich", "name": "Adrienne Rich"}], "type": ["Feminism", "Nonfiction", "Parenting", "Womens", "Sociology"], "outlinks": ["http://www.goodreads.com/book/show/305826.Of_Woman_Born", "http://www.goodreads.com/book/show/1018447.Of_Woman_Born", "http://www.goodreads.com/book/show/38455932-na-tre-d-une-femme-la-maternit-en-tant-qu-exp-rience-et-institution", "http://www.goodreads.com/book/show/2866288-of-woman-born", "http://www.goodreads.com/book/show/1271942.Of_Woman_Born", "http://www.goodreads.com/book/show/130810.Diving_Into_the_Wreck", "http://www.goodreads.com/book/show/364141.The_Dream_of_a_Common_Language", "http://www.goodreads.com/book/show/195211.The_Fact_of_a_Doorframe", "http://www.goodreads.com/book/show/128136.An_Atlas_of_the_Difficult_World", "http://www.goodreads.com/book/show/304485.On_Lies_Secrets_and_Silence", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}