{"ratings": 869, "userreviews": [{"userName": "Kaya", "userReviewDate": "Apr 13, 2014", "userURL": "http://www.goodreads.com/user/show/15462098-kaya", "userReview": "\"You should never be careless about friendship. You will find, the older you get, that new friendships do not come around quite as often as they once did. You should treasure those you have, protect them fiercely.\"   This book is amazing. Light and engaging, but at the same time penetrating and introspective. It isn't the usual type of genre I like, but it really got under my skin. Though it is a chick lit, I found it more of a tale about eternal friendship that can be just as important as a romantic partner. While some parts are predictable, it didn't ruin the overall experience. Imagine my surprise when I found out Amy Silver is actually Paula Hawkins. She's a true master at building specific psychological state of her characters. The book alternates from New Year’s Eve’s in 1990 when Nicole is thirteen and spends her first New Year’s Eve with Julian. This story unravels over the period of 21 years with main reflections on past New Year's events throughout Nicole's life. It's post Christmas 2011 when we join Nicole, and from the very first chapter it becomes evident that there are problems between her and her husband Dom. Through flashbacks over previous New Years, we discover the events that have led to her current situation, especially involving her bonds with Julian, Alex and Aidan. Each year as she celebrates New Year, we find her taking different paths - sometimes there is heartache, other times friendship issues, partying till the sun comes up, depressing times. All of this happens with the same circle of friends.Characters and their difficult situations are believable and easy to empathise with, even when you can't really understand them. I was near to tears in certain parts - those parts almost broke my heart. This book is a page turner, a story of friendship and love that left me wanting more. The secondary characters are also well fleshed out and they give the real depth to the story. This novel covers topics such as domestic violence, grief and death. Mostly, it's about a group of friends and their complex relationships with one another. Those relationships never become simple. They’ve all made mistakes, some that have hurt each other, but no matter what they done I couldn’t not like any of them. Their mistakes, regrets and secrets are slowly revealed as the book goes on, and it's so hard to hate them for it. Ultimately this book is about new beginnings, forgiveness and redemption. Even when you don't know how to move on. There is everything - loss, pain, melancholy, avoidance. There is no black and white character.Even though she's keeping secrets, it's so easy to understand Nicole and feel for her, hoping that everything will work out and that she'll make her dreams come true. She’s smart, feisty, but selfish and impulsive. Also, she doesn't deal with the past quite well. Overall she's a round character with many layers.  „But New York isn’t just home to Karl; it was also home to Aidan and to Alex. How was it that some of the most important people in my life have ended up there, in glamorous Manhattan, while here I was stuck in boring old southwest London?“  A tragic event made her change her life drastically because she couldn't cope with the pain. So instead of trying to get better, she built a wall around herself and fell deeper in melancholy. None of her friends who can actually help her are near, so she's even more successful at avoiding her problems.Julian and Nicole become inseparable after their first New Year's Eve so they try to spend every beginning on the new year together. They share a tradition of telling each other their New Year's resolutions, even when're not comfortable doing that with anyone. This book plays with the idea that your soulmate and love of your life can be different persons. Julian is obviously Nicole’s soulmate. They have so many sweet moments together. \"‘To us,’ Julian said, clinking his glass against mine. ‘You and me, Nic. We never need anything more than you and me.’\" They have one of the most beautiful friendships I've ever read about. „‘I can’t face my dad yet,’ he said in a small voice. ‘That’s why … that’s why I came here. I knew I could count on you, I knew that even though I hurt you and even though we haven’t spoken for ages, I knew you’d understand, because that’s just the kind of person you are. I knew that if I was with you, I’d be okay.’“  They're the reason why I love this book so much. „At that moment, I felt a sudden pang of longing for Julian. With Jules at my side, I always felt invincible.“  One of the biggest problems was that Nicole couldn't be independent without Julian around. It's like when he wasn't by her side, she'd just forget about her identity. She had to learn how to live on her own and I'm not sure Dom was any help in that process. I can't imagine what it's like to lose your soulmate, but the author represented the feeling quite realistically. Nicole is truly happy only with Aidan. He brings out her best traits and is the only one with whom she could fulfil her dreams. Also, he's her partner in crime and she's the only one who can handle his instability and make him feel safe. Their relationship is rocky, with a lot of tension and abandonment issues, but it was so easy to root for them.  „He kisses me on the mouth and I’m going back in time again, his lips on mine feel exactly the way they did when he kissed me on the beach in South Africa fifteen years ago. No other kiss has felt like that since.“  It's always nice to read about female friendship without typical vanity and rivalry. That's the case with Nicole and Alex. They've been through so much together and even though Alex has done something unforgivable, at the end of the day, they still adore and complement each other. They just needed a test to remember that. „I hadn’t been able to say no to her since the first day I met her, during freshers’ week.“  They had so many ups and downs.Ugh, Nicole should've never married Dom. I'm not saying he's a bad guy, but I feel like she only settled for him instead of seeing him as her perfect match. He could never understand her temperamental side nor could he handle her drastic changes of moods. He always complained how she was always running out the door from him, but it was so easy for her to do so when he was always bringing her down. „He would never understand why I can talk to her, joke with her about what happened, but cannot bear to speak about it with him. Why should he? I can’t understand it myself. Maybe it’s just because I’ve loved her for longer than I’ve loved him. Sometimes I think it’s because I loved her more.“  Even after this, she stayed with him, ugh. This isn't about what he's done, it's about that she didn't love him like you're supposed to love your spouse. Ugh, their marriage frustrated me so much. They were clearly unhappy but they maintained satisfied appearance for reasons unknown. I'm not sure that even habit kept them together.  Check out my blog!"}, {"userName": "Serendipity Reviews", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/1886570-serendipity-reviews", "userReview": "I am beginning to think the run up to Christmas can not begin without an Amy Silver book. I really had forgotten how much I love a good chick lit book and I was definitely in need of this one. What I love most about Amy Silver's books is that the characters and situations they are in are believable and real. It isn't all marshmallows around the fire with this author, oh no, she writes a book that hits you hard and leaves you breathless and near to tears in certain parts. Her books are about real people with real problems. This story unravels over the period between Boxing Day and New Years Day, with reflections on past New Years events throughout Nicole's life. The reflections are really revealing, allowing you to judge Nicole's state of mind on the present lead up to New Year.  From the first few pages, you are convinced that Nicole is keeping secrets from us, which are unravelled like Christmas presents as the story progresses. Even though she is keeping secrets, you find yourself staying right by her side, hoping that everything will work itself out for her, as you find out why she is really in the situation she is. All the characters were believable and I felt like I had stepped into a book where I knew everyone from the start. I was the absent friend who only supported them via email as I couldn't be there physically. I was desperate for each of them to find true happiness, even though they had aired their imperfections. I came away loving Aidan, Julian and Karl,wishing they were in my life for real. The characters stay with you long after you finish reading the book. The ending took me by surprise as it wasn't the one I was convinced it would be. However, I was rather pleased with how the story turned out and I imagine in the same situation I would have made similar choices to Nicole.I did have a little bit of a awe struck moment, when the story mentioned the Highline in New York, which has fascinated me ever since I found out about it. Highline is an elevated park that used to be a rail line, which runs all around New York. It is definitely something I intend to visit, should I ever get the pleasure of visiting New York. Here is a video for you to see how fabulous it is yourself - http://www.youtube.com/watch?v=qLmiaC...I truly loved this book and will be keeping it as one of my permanent collection. I envisage myself reading it again and again in the future, as I move into the festive season. If you haven't read a book yet by Amy Silver then I would definitely recommend this one or All I Want For Christmas as I have really loved them both. Get your journey to Christmas off to a good start with an Amy Silver novel."}, {"userName": "Helen", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/4207930-helen", "userReview": "Going into this I expected it to be a really fluffy chick lit book, but the storyline had a fair amount of grit to it which I liked. The characters were believable, rough around the edges and troubled in a lot of ways. There were a few cultural and political references which is unlike a lot of chit literature. There was quite a bit of travelling to different parts of the world too, which added a unique element.The chapters jumped about from different time lines, which usually I don’t take too, but the author did this very nicely. I researched the author and book afterwards and I was stunned to see Amy Silver is a pen name for the famous Paula Hawkins, writer of The Girl on The Train. I’ve read this too, and the chapters do the same thing within the more famous book.The writing style was very entrancing, it was easy to get lost in the book, and I finished it remarkably quickly. I enjoyed the few major plot twists which came out the blue. One Minute to Midnight is actually very well written. I was deceived by the pretty cover, as it was definitely not your typical kind of read. If you like Paula Hawkins writing, I would give this one a go."}, {"userName": "Sakina Nazim", "userReviewDate": "Jun 17, 2013", "userURL": "http://www.goodreads.com/user/show/20943892-sakina-nazim", "userReview": "***MAJOR SPOILERS COMING THROUGH ***This book was heart-breaking. Broke my heart when Julian died. Broke my heart when Nicole left Dom. Broke my heart even when her father died. Broke my heart seeing Nicole's heart being broken by Aidan so many times and yet she went back for more. I never really liked Aidan's character. Yes, he is smoking hot but besides that there is nothing much to him other than a drunkard tortured soul who has apparently been through a lot. The book in the beginning was just fascinating and I couldn't put my phone down (Since I was reading an e-book)but then as it moved forward it started to get slightly boring. And Nicole is a really selfish bitch here. Even after all the love received from Dom (I agree that what he also did was wrong and unforgivable except was it really unforgivable? In a way she also always craved for Aidan and wanted him and it wasn't infidelity exactly but she didn't exactly want Dom either, did she?) And then the end of the book, I couldn't actually stop the flow of tears. It was so heart-breaking and in a way pathetic how she goes back for Aidan. Theres hardly any focus on the richness of Dom's character in the story. I know he's not exactly one of the main characters but his character was a very charming one. Amy Silver's writing was good but she could have made Dom's character grow a little more on us and she could definitely have made Nicole a little empathetic."}, {"userName": "Bev Dulson", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/9171859-bev-dulson", "userReview": "Never judge a book by it's cover, couldn't have said it better myself where this book is concerned. I bought it a while ago with the intention of keeping it for the festive season for a nice 'fluffy', easy read. As it was, I picked it up last week and thought I'd give it a whirl, just wish I'd read it sooner. 'Fluffy' would've been good, I like books like that, but what I actually got was a book that I couldn't put down, twists I didn't see coming and and ending that I think was happy, it just left me feeling very reflective.The book takes us through various NYE in the life of Nicole and her friends, starting with when she was 14 and she meets Julian, who will quickly become a very important person in her life. Each year as she celebrates New Year, we find her life taking different paths, there's heart ache, friendship issues, good times, bad times and this pivotal moments in her life all take place in a different part of the world, but with the same circle of friends and with one guy in particular who keeps breaking her heart.I thoroughly enjoyed this book and would totally recommend it."}, {"userName": "Becky", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/8132556-becky", "userReview": "I read this book in less then 12 hours, it had me completely gripped. Whilst reading it you will go through all the emotions, you'll be exhaused after! You will find that you'll become very attached to Nicole and Julian but after the tragedy it'll feel as something is missing, as though there is a hole in the book, from this point my emotions went all other the place. I think that the book also has a strong point to it that you should never settle for second best because you will never feel happy, the only time it feels that Nicole is truly happy is when she is with Aidan, he brings out the real her which I think the author does really well. The only disappointing part of this book that I find is the end, which is the hardest part to write! But as I didn't want it to end I may have been disappointing with anything. It is by far the best book I have ever read! Amy Silver is a very talented author."}, {"userName": "Tin", "userReviewDate": "Jul 03, 2012", "userURL": "http://www.goodreads.com/user/show/4047214-tin", "userReview": "\"You should never be careless about friendship. You will find, the older you get, that new friendships do not come around quite as often as they once did. You should treasure those you have, protect them fiercely.\"A touching story about hope, true love and enduring friendship, One Minute to Midnight leaves you with a sad, happy smile (if that's even possible) in the end. We'll realize that there's so much to live for, and that forgiving those who wronged us is one key to happiness."}, {"userName": "Luise", "userReviewDate": "Dec 24, 2014", "userURL": "http://www.goodreads.com/user/show/23504531-luise", "userReview": "Oh my god. I wrote a review, it died and everything was gone. Are you kidding me? So it was basically a nice story that took turns between the days before New Year's Eve in the present and this day in various years of Nicole 's past. I really enjoyed most it, especially the ending. What I disliked was the main character herself. She is an egoistic and immature bitch. (Reasons for that are lost in nirvana.)"}, {"userName": "Jessica (Jess Hearts Books)", "userReviewDate": "Nov 26, 2011", "userURL": "http://www.goodreads.com/user/show/2500965-jessica-jess-hearts-books", "userReview": "At this time of year you only have to walk into a bookshop to see the abundance of Christmas books that are released during the build up to Christmas and so what first struck me about One Minute to Midnight is that this is a book about New Year. New Year is a time that tends to be overshadowed by the excitement for Christmas something that’s also apparent in the book industry. And so reading a book about New Year and the new beginning’s that come along with it was a very welcome breath of fresh air.First things first I have to say don’t be fooled by this book’s beautiful- but undeniably girly- cover. This isn’t your typical chick-lit read. One Minute to Midnight is a realistic, hard-hitting, tug on your heartstrings novel that covers topics such as domestic violence, grief and death and is about a group of less than perfect friends and their complex relationships with one another.Our leading lady is Nicole and straight away I found her fascinating to read about. She’s smart, feisty and is a woman with a past. There are a lot of skeletons in Nic’s closet and secrets that not only is she keeping from her husband Dom but us readers too. The book alternates from the present build up to New Year to the New Year’s Eve’s of Nicole’s past beginning in 1990 when Nicole is thirteen and spends her first New Year’s Eve with Julian Symonds unbeknownst to them starting a tradition and friendship that will see them through many New Years to come. With the book being told on the same day each year One Minute to Midnight had a certain One Day feel about it which I loved especially as it gives you the feeling that you really know these characters that you’ve watched them grow up.I found the characters in this book to be so well developed. Every one of them felt so real and even the secondary characters stood out. They’ve all made mistakes, some that have hurt each other, but no matter what they done I couldn’t not like any of them because Amy Silver has this way of making you understand her characters and their actions. Their mistakes, regrets and secrets are slowly revealed as the book goes on. Ultimately this is a book about the characters finding new beginnings, forgiveness and redemption themes that tie in perfectly with New Year.Amy Silver writes like a dream and has the ability to make you both laugh and cry. The prose is so organic with some truly heart felt moments particularly between Nicole and her father, and her husband Dom. One Minute to Midnight is definitely a book that touches your heart and I can certainly see myself pulling this off the shelf for re-reads in the future. One Minute to Midnight is such a wonderful book that is so much more than just chick-lit. Definitely add this to your Winter reading piles this year, this is my first of Amy Silver’s novels and it definitely won’t be my last!"}, {"userName": "Janet", "userReviewDate": "Nov 24, 2011", "userURL": "http://www.goodreads.com/user/show/4698727-janet", "userReview": "This is the story of Nicole Blake. In 2011 a mid thirties Nicole is feeling nostalgic and in a rut, so she begins looking back at her life. We flashback to Nicole at 13. This year marks a turning point in many phases of her life; namely a breakdown of her parents marriage, and the first time she falls in love. Most of the story revolves around key events that have defined Nicole since her early teens, all coincidentally right around New Years Eve outings since that night.Nicole falls in and out of love but a few things remain constant in her life. Her friendship with Julian and Alex, her obsession with Adian, and her tumultuous relationship with her father. All of these relationships, among her career and her current marriage, are building blocks to where Nicole has been and where she's going.This was a hard book to rate. In the first half I was certain I was going to love this book. I don't like to read too far into a synopsis as to not spoil where it is going. But in the second half I started to grow frustrated with Nicole and how she only seemed to think about how she felt in any given situation. In the end I averaged out my feelings to a 3 star rating, but in all actuality it is probably more of a 3 and a half star book."}, {"userName": "Sarah", "userReviewDate": "Dec 10, 2013", "userURL": "http://www.goodreads.com/user/show/21572007-sarah", "userReview": "it's a book about friendship and love, loss and pain. I loved it, not only because it always comes back to NYE (my fav day of the year) but also to the friends you love the most.Julian and Nicole are inseparable once they met and so they try to spend each NYE together or at least talk to each other on the phone. they share a tradition of telling each other their New Year's resolutions, some obvious, some ridiculous and some impossible.the book is about love as well. the kind of love that's heartbreaking, dangerous, yet so tempting and Aidan is too handsome and fascinating to resist...as life goes on it becomes clear that the life you live and that's in your comfort zone does not always make you happy. when you realize that you have to choose, accept the pain and take a risk or stay where you are and never know if a change would've been the best thing ever happening to you.what would you choose?"}, {"userName": "Paula Sealey", "userReviewDate": "Dec 31, 2013", "userURL": "http://www.goodreads.com/user/show/2650544-paula-sealey", "userReview": "It's post Christmas 2011 as we join Nicole, and from the first chapter, it becomes evident that there are problems with her current life and her relationship with husband Dom. Through flashbacks over previous New Years during Nicole's life, we discover the events that have led to their current situation, which involve her very best friends Jules, Alex and Aidan, the other main characters. A definite page turner, this story of friendship and love evolves beautifully and left me wanting to read the next chapter straightaway, until I found I just couldn't put it down and read the book in two sittings! All of the main characters are so well developed, especially that of Nicole, who is very complex and real as she tries to find her way back from events that occur. Unusually, the secondary characters are well fleshed out too and help give depth to the story. The ending is so heartbreakingly beautiful! I'm really looking forward to reading more of Amy Silver's work."}, {"userName": "albregia", "userReviewDate": "Jun 14, 2012", "userURL": "http://www.goodreads.com/user/show/4805563-albregia", "userReview": "[ it wasn't difficult to know about Julian's fate, Alex's affair (although I did expect it much earlier, say, when they were in South Africa), and her entire relationship with Aidan (hide spoiler)]"}, {"userName": "Kezza22", "userReviewDate": "Jun 25, 2012", "userURL": "http://www.goodreads.com/user/show/4037083-kezza22", "userReview": "I bought this book because I read loads of good reviews and thought it would be an enjoyable book... But it really wasn't for me... Although I read it I just got more and more put off with the deceit in this book and how the main character could keep going back to an ex who just kept dumping her when a better option came around... I don't want to spoil the book for those that haven't read it yet but for me this wasn't an enjoyable read."}, {"userName": "Fabulous Book Fiend", "userReviewDate": "Jan 08, 2012", "userURL": "http://www.goodreads.com/user/show/7373175-fabulous-book-fiend", "userReview": "I read this book in a matter of days. I found it such a fast paced read and I had to find out what happened next. As a fan of chick lit and a fan of One Day, it was like this book was meant for me. It begins on boxing day, leading up to new year and flashes back to new years in the past so you get a real feel for each of the characters. I found myself wanting to know what happened next at the end of the book. I would love it if there was a sequal so I can revisit the characters!"}, {"userName": "Laksmi Daniswara", "userReviewDate": "Mar 25, 2015", "userURL": "http://www.goodreads.com/user/show/24791013-laksmi-daniswara", "userReview": "beautifull story, although a little sad comes when the story endedThere is no black and white character in this bookthat's why i love this book"}, {"userName": "Caro", "userReviewDate": "Jan 19, 2014", "userURL": "http://www.goodreads.com/user/show/7418975-caro", "userReview": "Auch wenn der Jahreswechsel schon wieder einen Monat her ist, ist es keineswegs zu spät um dieses Silvesterbuch zu lesen. Du und ich und all die Jahre handelt zwar von Silvesternächten, guten Vorsätzen und wiederkehrenden Neujahrsritualen, aber das bedeutet nicht, dass man die Geschichte rund um die Protagonisten Nicole nicht auch im Frühling, Sommer oder Herbst lesen kann.Nicole ist Anfang 30 und mehr oder weniger glücklich mit Dom verheiratet. Ihr Job läuft nicht wie gewünscht und auch Doms Wunsch nach Kindern teilt sie nicht. Ihr ist klar, dass sie etwas in ihrem Leben ändern muss, aber der richtige Anstoß und der Mut fehlen ihr vollkommen. Wie schon im Klappentext angedeutet kann sie nicht mehr auf ihren besten, längsten und wichtigsten Freund Julian zählen und das macht ihr ganz schön zu schaffen.Den Ursprung hat die ganze Story im Jahr 1990, natürlich an Silvester. Die damals 13jährige Nicole lernt den 15jährigen Julian kennen und daraus entsteht eine wunderbare Freundschaft. Es wird zum Ritual, dass sie jedes Jahr gemeinsam Silvester feiern und sich gegenseitig ihre fünf Vorsätze fürs kommende Jahr erzählen. Mit der Zeit werden dann viele Charakter eingeführt: Julians Cousin Aiden, Nicoles Kommilitonin Alex und nach und nach die verschiedenen Partner, mit denen sie sich mal mehr und mal weniger amüsieren. Was dann genau zwischen Nicole und Julian vorfällt und die beiden auseinander reißt, ist eine Sache, die ich bei dem Klappentext eher weniger vermutet habe. Direkt in einem der ersten Kapitel platzt eine gewaltige Bombe und wirft alle Gedanken des Lesers über den Haufen. Die Kapitel sind dann immer abwechselnd aus der Gegenwart und der Vergangenheit erzählt. Nicole erzählt am Anfang von Silvester 2011, was sie dann auch jedes zweite Kapitel tut. Dazwischen kommen immer wieder Storys aus den vergangenen Jahren zusammen, sodass man ihre persönliche Entwicklung aber auch die Freundschaft zwischen ihr und Julian sehr genau zusammen puzzlen kann. Dadurch blieb es immer unglaublich spannend und ich konnte besonders im letzten Drittel das Buch kaum noch aus der Hand legen.Was mir leider nicht ganz so zugesagt hat, waren die Charakter. Ich weiß gar nicht, wie ich das ganze Buch so spannend verfolgen konnte, ohne einen von ihnen so richtig zu mögen. Nicole ist meiner Meinung nach unfassbar egoistisch. Sie weiß nicht so genau was sie will beziehungsweise sie hat nicht den Mut ihre Gefühle auszusprechen und dementsprechend zu handeln. Nun mag das vielleicht daran liegen, dass sie ohne Julian aufgeschmissen und nicht ganz sie selbst ist, aber irgendwie konnte ich mit ihr auch vor dem ganzen Drama nicht warm werden.Auch Nicoles späterer Ehemann Dom hat mich nicht umgehauen. Zum Großteil hatte ich einfach nur Mitleid mit ihm, weil er eine so viel liebevollere Person als Nicole verdient. Richtig verlieben konnte ich mich aber auch nicht in ihn, dazu war er mir irgendwie zu langweilig und hat viel mehr geredet als gehandelt. Nicoles Freundin Alex scheint ein flippigerer Typ zu sein und ich kann auch nicht behaupten, dass die Szenen mit ihr langweilig oder gewöhnlich waren. Allerdings ging sie mir nach und nach immer mehr auf die Nerven, weil auch sie sich total egoistisch, uneinsichtig und überhaupt nicht wie eine Freundin verhalten hat. Aidan, im Klappentext als Nicoles große Liebe betitelt, war auch überhaupt nichts für mich. Er wird zwar irgendwie als Gegenteil von Dom dargestellt und kommt tatsächlich eigensinnig und interessant rüber, dafür hat auch er meiner Meinung nach eine große Klappe und nichts dahinter. Er ist ein Feigling und immer genau dann weggelaufen, wenn man ihn gebraucht hätte. Zu guter Letzt wäre da noch Julian. Als der das erste Mal aufgetaucht ist, fand ich ihn unglaublich lahm, arrogant und kindisch. Das hat sich dann zum Glück gebessert und er war im Endeffekt der einzige Charakter, den ich sympathisch und nicht nur in Ordnung fand. Tatsächlich hat er sich zu einem liebevollen und witzigen Menschen entwickelt, den wohl jeder gerne in seinem Leben haben würde.Amy Silver hat es aber trotzdem geschafft, mich in den Bann ihres Romans zu ziehen. Obwohl ich mit kaum einem Charakter warm geworden bin, hab ich mitgefiebert und wollte unbedingt wissen, wie es weitergeht. Der Aufbau der Kapitel war interessant gestaltet und auch der Schreibstil hat mir super gefallen. Nicoles Leben geht immer wieder auf und ab und es gibt so viele krasse Ereignisse, dass es eigentlich gar nicht langweilig werden kann. Besonders das letzte Drittel des Buches hab ich ziemlich zackig gelesen und musste dann leider feststellen, dass ich vom Ende relativ enttäuscht war. Das Ende ist nämlich nichts Halbes und nichts Ganzes und einfach unrealistisch. Ich bezweifle sehr stark, dass Menschen sich innerhalb weniger Tage so stark ändern können und solche teilweise krassen Aktionen so gelassen und verständnisvoll hinnehmen. Es ist schlichtweg nicht glaubhaft und viel zu kitschig und das hat mich dann sehr enttäuscht.FazitInsgesamt habe ich mir mehr erwartet. Die Charakter waren zwar nicht unbedingt gewöhnlich, aber trotzdem fast alle eher unsympathisch. Mit dem Ende war ich absolut gar nicht zufrieden, denn es war einfach total typisch und triefte vor Klischees. Was wirklich schade ist, denn der Roman an sich war erfrischend und überhaupt nicht typisch. Genau für diese ungewöhnliche Story, die ganzen interessante Erlebnisse und die anhaltende Spannung gibt es dann aber auch verdiente 3 Sterne.(Februar 2014)"}, {"userName": "Vanessa Edwards", "userReviewDate": "Oct 13, 2017", "userURL": "http://www.goodreads.com/user/show/57465637-vanessa-edwards", "userReview": "I think it was a quick easy read and it was good."}, {"userName": "Jenny Jancke", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/39534985-jenny-jancke", "userReview": "Inhaltsangabe:Nicole ist dreizehn, als sie 1990 Julian kennenlernt. Nach einer kurzen Beziehung werden sie die besten Freunde und erzählen sich jedes Jahr zu Silvester ihre 5 Vorsätze für das neue Jahr. Mit ihm kann sie über alles reden und er ist immer für sie da. Zusammen werden die beiden erwachsen, finden gemeinsame Freunde und werden erfolgreich in ihrem jeweiligen Beruf. Doch 2007 passierte etwas, dass Nicole so grundlegend erschüttert, dass sie ihr Leben komplett ändert. Sie heiratet, hat kaum noch Kontakt zu ihren alten Freunden und ändert die berufliche Richtung. Erst vier Jahre später hat sie den Mut sich den Ereignissen zu stellen.Eigene Meinung:Das hat 22 Kapitel und besteht aus zwei Erzählsträngen, die abwechselnd geschildert werden. Vom Weihnachtsmorgen bis Silvester 2011, sowie Silvester ab dem Jahre 1990. So erlebt der Leser nicht nur, wie die Protagonistin erwachsen wird, sondern auch welche Auswirkungen die Entscheidungen und Erlebnisse aus den früheren Jahren ihr aktuelles Leben beeinflussen.1990 lernt Nicole auf der Silvesterparty ihrer Eltern Julian Symonds näher kennen. Er ist der coolste Junge in ihrer Schule und sie ist natürlich in ihn verliebt. Von ihrem Vater werden die beiden beim Rauchen in ihrem Zimmer erwicht, dazu kommt, dass Julian auch noch getrunken hat. Bei dem folgendem Streit trennen sich ihre Eltern und ihr Leben gerät zum ersten Mal aus den Fugen. Doch das ist beinahe nebensächlich, denn danach ist Nicole fünf Wochen mit ihrem Schwarm zusammen. Als Julian plötzlich Schluss macht, versteht sie nicht weshalb und igniriert ihn. Silvester 1991 trifft sie ihn wieder und erkennt den Grund für die beendete Beziehung. Julian ist schwul und wurde deshalb von ein paar Jungen verprügelt. Seit diesem Moment sind die beiden unzertrennlich. Noch am gleichen Abend lernt sie Aidan kennen. Er ist Julians älterer Cousin und bis auf die Augenfarbe sehen sich die beiden sehr ähnlich. Auch diese Begegnung wird in der späteren Geschichte noch einmal sehr wichtig.Und von da an entwickelt sich die Geschichte. In der Gegenwart ist alles so anders, dass man ständig daraufhin fiebert nun endlich zu erfahren was passiert ist. Warum hat Nicole ihren Beruf aufgegeben, obwohl sie nicht nur erfolgreich war, sondern auch Preise bekommen hat? Weshalb darf ihr Mann nicht wissen, dass sie noch Kontakt zu ihrer ehemaligen besten Freundin Alex hat? Und was ist aus Julian geworden?Natürlich kann man schon einige Dinge vorausahnen! Dennoch verliert die Geschichte nicht an Emotionalität. Die Autorin hat einen ruhigen, fließenden Schreibstil, der den Leser in dem Buch vorantreibt und dazu einläd immer weiter zu lesen.Ich merke gerade, dass es mir sehr schwer fällt zu diesem Buch eine Rezension zu verfassen. Ich weiß nicht woran das liegt, aber es funktioniert einfach nicht. \"Du und ich und all die Jahre\" ist mein zweites Buch der Autorin. Auch nach der Lektüre von \"All I want for Christmas\" war ich in dieser eigenartigen Stimmung.Die Geschichte war wundervoll. Amy Silver hat ihr Augenmerk hier weder auf die Charaktere noch das Setting gelegt, sondern vielmehr auf die Geschichte selbst. Hätten die Charaktere mehr Tiefe gehabt und hätte ich den Figuren damit näher gestanden, dann hätte ich das Buch sicher nicht lesen können. Es geht hier um viele berührende und tragische Ereignisse, die Nicole zu verarbeiten hat und doch geht es auch un Dinge wie Freundschaft und Liebe und darum nicht einfach so sich selbst aufzugeben.Urteil:Amy Silver hat es wieder geschafft mich voll und ganz mit ihrem Buch zu überzeugen. \"Du und ich und all die Jahre\" kann ich jedem empfehlen, der nicht vor berührenden Erzählungen zurück schreckt. Die Lebensweisheiten die zwischen den Seiten stecken stimmen nachdenklich und lassen den Leser mit einem prüfenden Blick auf das eigene Leben zurück. Ich freue mich darauf \"Was bleibt, wenn du gehst\" zu lesen. 5 von 5 Sternen."}, {"userName": "Janine2610", "userReviewDate": "Sep 06, 2016", "userURL": "http://www.goodreads.com/user/show/23384358-janine2610", "userReview": "Viele wichtige Lebensthemen auf engem Raum konzentriert»Du und ich und all die Jahre« ist ein Roman, der rund um die Silvesternächte aufgebaut ist. Mit der Protagonistin Nicole konnte ich, als ich sie zu Beginn in einem der Gegenwart-Kapitel kennengelernt habe, nicht wirklich viel anfangen. Sie erschien mir als erfolgreiche Fernsehreporterin nämlich erst sehr unglaubwürdig mit ihrer entscheidungsunfähigen Art und ihrer Unfähigkeit, sich in ihrem eigenen Haus gegen die Schwiegermutter zur Wehr zu setzen.Kapitelweise springen wir in ein anderes Jahr, die Handlungen finden aber immer um Neujahr herum statt. Schnell bekommt man also auch einen ersten Eindruck von Nicole in ihrer Jugendzeit, wir lernen Julian kennen und erleben mit, wie sich aus einer anfänglichen Liebelei eine ganz besonders starke Freundschaft entwickelt. Am Anfang von fast jedem neuen Kapitel findet man zusätzlich auch immer eine kleine Liste mit 5 Neujahrsvorsätzen von Nicole. - Diese Vorsatzliste ist seit dem Beginn der Freundschaft zu Julian ein fixes Ritual zwischen den beiden.~ »Es ist immer später, als man denkt.« ~(S. 295)Ich habe das Buch in einer Leserunde mit einer zweiten Bloggerin gelesen und uns beiden war durch die Gegenwart-Kapitel schnell klar, dass ein schlimmes Ereignis Nicoles Leben erschüttert haben muss und wir durch die Zeitsprünge in die Vergangenheit nur die wichtige Vorgeschichte erfahren.Freundschaft spielt in diesem Buch eine sehr große Rolle, aber dieses Thema ist bei weitem nicht alles, worum es hier geht. Eine Liebesgeschichte darf natürlich auch nicht fehlen: eine Dreiecksgeschichte, versteht sich. Und die macht ihrem Namen alle Ehre! Es ist nicht nur Julians Name, der ständig fällt ... Eine Protagonistin, die zwischen zwei weiteren Männern steht - diese Konstellation, gepaart mit dem Umstand, dass die Gute ein ernsthaftes Entscheidungsproblem hat, bietet jede Menge fesselnden Lesestoff. Versprochen! ;)~ »Eines Tages wirst du nein sagen müssen, Nic. Sonst wird er immer wieder auftauchen, dein Leben auf den Kopf stellen und anschließend wieder auf die Suche nach neuen Abenteuern gehen. Männer wie er halten es nicht lange an einem Ort aus, weißt du.« ~(S. 146)Neben den beiden großen Hauptthemen Freundschaft und Liebe, geht es aber auch noch um Betrug/Fremdgehen, also in weiterer Folge ums Verzeihen. Mehr kann ich dazu aber gar nicht mehr schreiben, denn damit würde ich ungewollt spoilern. Ebenso hat die Familie einen wichtigen Stellenwert in Nicoles Geschichte, allen voran ihr Vater, zu dem die Beziehung sehr kompliziert zu sein scheint. Und zu guter Letzt lässt sich auch noch der Tod blicken und die Akzeptanz desselben und die Trauerbewältigung, die damit automatisch einhergehen muss, bekommt auch seinen Platz.Manch einer würde jetzt wahrscheinlich anmerken, dass das aber ganz schön viele wichtige Lebensthemen für nur 367 Seiten sind. Dazu muss ich allerdings sagen, dass ich nie das Gefühl hatte, dass eines dieser Themen nur angeschnitten oder zu kurz gekommen wäre. Die Autorin hat es in meinen Augen hervorragend hinbekommen, Nicoles wichtige Lebensereignisse ausreichend und in die Tiefe gehend zu erzählen bzw. zu bearbeiten.Ein Buch, das mich mit ungeahnter Tiefgründigkeit überrascht hat und ich deswegen als sehr fesselnd und unterhaltend empfunden habe. Gerne eine Leseempfehlung dafür!"}, {"userName": "Tinka Beere", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/34144831-tinka-beere", "userReview": "Ursprünglich war dieses Buch ein reines lag-eben-auf-dem-Wühltisch-für-weniger-und-sah-relativ-interessant-aus-Buch. Ich habe es mitgenommen, ich glaube, es war in dem Monat, als ich so arg viele Bücher von den Wühltischen geklaubt habe :DIm Sommer habe ich schon einmal begonnen, das Buch zu lesen, doch ich habe schnell gemerkt, dass es besser in die Zeit um Silvester passt. Da ich möglichst keine Klappentexte lese, ist das ja auch nicht verwerflich. Also habe ich mir das Buch jetzt noch einmal vorgenommen und bin überraschend schnell in die Geschichte eingetaucht.Nach und nach bin ich dann auch immer tiefer in der Geschichte drin gewesen, konnte mich mit den Charakteren identifizieren, habe Nicole erwachsen werden sehen. Die Geschichte spielt von Weihnachten bis Silvester 2011/2012. Abwechselnd mit den Kapiteln, die 2011/2012 spielen, gibt es Kapitel von vergangenen Silvestern aus Nicoles Leben.Zwar kennt der Leser das Leben von Nicole, wie es in der Geschichte ändert, doch nach und nach werden Ereignisse entblättert, die ich zumindest nicht erahnen konnte. Ich fühlte mich beim Lesen immer tiefer in den Strudel der Verzweiflung, Angst, Einsamkeit und Trauer gezogen.Trotz der deprimierenden Stimmung, ist es aber auch eine aufmunternde, motivierende Geschichte. Jedes Jahr erzählt Nicole sich mit ihrem besten Freund fünf Vorsätze für das neue Jahr. Und in fast jedem Jahr steht \"5 Kilo abnehmen\" auf dieser Liste. Diesen Teil finde ich ziemlich ironisch, da sie es ja nicht wirklich schafft, aber dennoch ihr glücklich sein kann.Ehrlich gesagt, hat mich das Buch auch selbst dazu gebracht, über meine Neujahrsvorsätze nachzudenken. Ich wollte mir keine machen, jedenfalls nicht speziell für Neujahr, sondern sie gleich anpacken. Doch im Hinterkopf stehen schon seit Jahren immer die gleichen Vorsätze auf dieser Liste, wenn sie auch nur im Kopf existiert. Und leider sind viele dieser Vorsätze Dinge, die von Außen kommen, die von mir erwartet werden. Der Sturkopf in mir sagt sich, warum sollte ich mir das vornehmen, wenn es nicht meine Vorsätze sind? Irgendwie sind sie es ja schon, aber dadurch, dass es Dinge gibt, die von Außen eben erwartet werden, wird es noch schwieriger, sie zu erreichen. Ich hoffe, ihr versteht, was ich meine ;-)Fazit: ❤❤❤❤❤/❤❤❤❤❤Ich mochte die Geschichte wirklich sehr gerne. Ich habe nichts erwartet und dann hat sie mich überrascht. Ich konnte aus ihr lernen und viel für mich mitnehmen, Situationen noch einmal durchleben, die ich selbst erlebt habe, nur eben jetzt mit einigem Abstand und so kann ich sie neu bewerten."}, {"userName": "Sebastian Waisbrot", "userReviewDate": "Feb 21, 2017", "userURL": "http://www.goodreads.com/user/show/51269042-sebastian-waisbrot", "userReview": "I've recently became interested in the Cold War era. I grew up after it the fall of the USSR and I find it difficult to understand the tension the world faced during that time, considering I'm pretty sure no Thermonuclear War did start. This book, however, was able to get me into that environment: I could really feel how each player thought the war was inevitable.I was also shocked to see the technology at the time. It's not that I did not know, but I never thought about all the limitations and their implications the times had. The stories about mistakes and deceptions played are just amusing at the same time they are terrifying once one considers what was at stake."}, {"userName": "LittleMsCrazy", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/42122126-littlemscrazy", "userReview": "Im Buch geht es um Nicole. Sie ist mit ihrem Leben so wie es ist eigentlich nicht so richtig zufrieden, weiß aber auch keinen Weg es zu ändern. Sie ist mit Dom verheiratet, der quasi der perfekte Mann ist, aber trotzdem krieselt ihre Ehe. Zudem steckt sie mit ihrem Beruf ziemlich fest und schafft es nicht ein nächstes Projekt zu finden, indem sie aufgehen kann.Als sie über Silvester zu einem alten Freund fährt trifft sie auf ihre große Liebe Aidan. Das macht ihre Probleme nicht besser und sorgt für immer mehr Unstimmigkeiten.Wie soll sie jetzt weiter machen ? Was ist der Weg für ihr perfektes Leben ?Hinten auf dem Buch steht ein Zitat aus der Rezension der Daily Mail : „Ein berührender Roman über Wendepunkte im Leben und darüber, wie wichtig es ist, Verantwortung für das eigene Glück zu übernehmen.“Ich finde, dass dieses Zitat das Buch wirklich sehr gut wiederspiegelt. Man konnte mich fast nicht mehr von dem Buch wegkriegen, weil ich so gefesselt war. Ich konnte seit langer Zeit mal wieder so richtig in die Geschichte versinken und die Welt um mich herum vergessen.Sobald ich es schaffe werde ich mir auch die anderen Bücher der Autorin ansehen und lesen. Ich bin wirklich restlos begeistert und werde das Buch auf jeden Fall weiterempfehlen und jeden in meiner Umgebung quasi zwingen es zu lesen.Alles in allem also ein großartiges Buch, das einen selber dazu bringt über das eigene Leben und was für einen selber das persönliche Glück ist, nachzudenken."}, {"userName": "Eve", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/3297168-eve", "userReview": "Where do I begin? ... The most unique thing about this book is the fact that I have never read a book where I didn't know who will be the lucky guy who will stay with the girl at the end. OK, that's not entirely true cause there are books with many twists and you can't always guess BUT the thing about this book was that I couldn't decide who of the two guys I wanted to be. Dom or Aidan. I mean, yes, both of them made some huge mistakes but they were both adorable. Dom, with his unbelievable tolerance, love, patience and Aiden with the true spark (which I suspected will be the ONE)... However, I was sad and happy at the same time when I finished the book, that's quite an odd feeling. Anyway, this book is not only about the love story and those 3 main characters but also about the power of friendship and family. Many great characters summed up in 400 pages contributed for my excellent first Amy Silver experience. I would have given it 5 stars but settled for 4 because there were few unnecessary descriptions, parts and dialogues and the ending was \"shortened\" according to my expectations. See, the title of the book made me believe that Nic and Aiden are going to met one last time one minute before midnight, just like they have every year before the final one."}, {"userName": "Kirsty (Book - Love - Bug)", "userReviewDate": "Dec 10, 2011", "userURL": "http://www.goodreads.com/user/show/5437700-kirsty-book---love---bug", "userReview": "After all this year’s Christmas-themed books, One Minute to Midnight, was just thing I needed to get me thinking about the New Year. This book is set between Boxing Day 2011 and New Year’s Day 2012 interlinked by chapters focusing on previous New Year’s Eves, starting with 1990. Amy Silver delivers well with the fabulously unique way of telling each characters backstory. This isn’t just any old chick lit; it covers an estranged father-daughter relationship, the fear of being stuck in a safe relationship and not knowing which the right direction to go in is, death and the closest of friendship bonds imaginable. Alongside this there is a vast array of wonderful characters who you’ll adore.When you turn the last page, you’ll be satisfied, yet left wanting more. This book will make you think about the choices you’ve made and those you’ll make in the New Year, and it might make you realise that the good guy can’t always win…..!"}, {"userName": "Swati", "userReviewDate": "Nov 15, 2011", "userURL": "http://www.goodreads.com/user/show/6582231-swati", "userReview": "Nicole Blake and her first crush slash best gay friend Julian Symonds has a tradition to make resolutions every New Year’s eve despite of the fact that how far they are. When Nicole become friends with Jules little did she knows that he has a drop-dead gorgeous cousin Aidan who will make Nicole fall head over heels. Nicole’s friend Alex never liked Aidan but Nicole is deeply and madly in love with him but much to her surprise he keeps on appearing and disappearing every now and then and one day he ended up breaking Nicole’s heart. Years have passed and once again New Year’s eve is round the corner but things has changed, Nicole is now married to Dom, she doesn’t talks to Alex, Jules is not there by her side and Aidan is a past which keeps on threatening her relationship with her husband Dom. It’s brilliantly written novel and Amy has done the incredible job of telling stories from past and present without missing a beat."}, {"userName": "Jozef Nakielski", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/16764804-jozef-nakielski", "userReview": "This is a lovely book. A good read with characters and a plot that are easy to follow. However, I can't help feeling that the morals it tries to put over, That you shouldn't accept second best and should wait for life to get better, are contradicted by the outcome of the story. Not only that, the book feels unfinished.Many reviewers are sorry that the book ended, perhaps because it feels like it hasn't. I don't know if that's to leave it open for a sequel, which would be nice or if the author just couldn't think of a proper ending. Had The ending been different I'd have given it 5 but as it feels unfinished and the contradictory its a 3. Its also a shame that Amy Feels the need to scatter the story with references to drugs and weed. It really isn't needed."}, {"userName": "Mary ", "userReviewDate": "Jul 12, 2012", "userURL": "http://www.goodreads.com/user/show/5546968-mary", "userReview": "I'm so excited I found this book out of nowhere. Well, the cover is charming and the synopsis is promising. Then when I decided to explore it, turns out to be a marvelous book. The story was so breattaking, brilliant and charming, while the characters were awesome and real. It's my first Amy Silver's book and this is not just a regular chicklit. Her style is mixed between Paige Toon and Emily Giffin."}, {"userName": "Reka", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/49328805-reka", "userReview": "I would like to say I was extremely excited to read this book for some reason , I had a great feeling about it , however it was by far the most dissapointing book I have ever read. Sorry about the major spoilers but Julied died? what??? are u insane? if u needed to kill of someone you should have killed off Aiden , the most annoying character there was there. Rubbish !Anyway I will never read a book of Amy Silvers again. GOD!!!!!"}, {"userName": "Tasha", "userReviewDate": "Jan 03, 2016", "userURL": "http://www.goodreads.com/user/show/48160930-tasha", "userReview": "Brilliant! By far the best book to start of the New Year. This is the first book I have read by Amy Silver and it did not disappoint. I just could not put it down, i read it in two days and any chance i had i picked up and read a chapter. Okay, occasionally there were a few things that happened which is obvious, but it didn't ruin the story. Would love if Amy silver wrote another book with the same characters in, so we can find out what happens to them."}], "description": "For many years, beginning when she was thirteen, Nicole Blake spent every new year with her three friends: Julian, her first love, Alex, her best friend, and Aidan, her obsession. Together the four had partied hard, suppported each other, and fallen in love. But then tragedy and betrayal tore the friends apart, and Nicole settled down to married life with Dom in London. But in the week running up to New Year's Eve 2011, Nicole and Dom are preparing for a trip to New York to meet up with Aidan and Alex for the first time in years. But with so much left unsaid and unresolved between them all, can they really return to their old friendship? And if they do, Nicole isn't sure she'll ever want to come home again.", "title": "One Minute to Midnight", "url": "https://www.goodreads.com/book/show/12385108-one-minute-to-midnight", "average": 3.91, "cover": "https://images.gr-assets.com/books/1320157810l/12385108.jpg", "reviews": 63, "authors": [{"url": "https://www.goodreads.com/author/show/260373.Amy_Silver", "name": "Amy Silver"}], "type": ["Womens Fiction", "Fiction", "Contemporary", "Holiday"], "outlinks": ["http://www.goodreads.com/book/show/12385108-one-minute-to-midnight", "http://www.goodreads.com/book/show/18270532-du-und-ich-und-all-die-jahre", "http://www.goodreads.com/book/show/13103350-one-minute-to-midnight", "http://www.goodreads.com/book/show/8691521-all-i-want-for-christmas", "http://www.goodreads.com/book/show/17612799-the-reunion", "http://www.goodreads.com/book/show/6754661-confessions-of-a-reluctant-recessionista", "http://www.goodreads.com/book/show/36663525-conversations-create-growth", "http://www.goodreads.com/book/show/464536.Guerrilla_Learning", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}