{"ratings": 344, "userreviews": [{"userName": "BlackOxford", "userReviewDate": "Oct 10, 2016", "userURL": "http://www.goodreads.com/user/show/17744555-blackoxford", "userReview": "The End of DemocracyAfter watching the Clinton-Trump election on television, I felt a compulsion to do something, anything, that might dull the emotional pain caused by the Trumpian irrationality and mendacity. I found succour of a sort, if little solace, in Simone Weil's 1943 essay, On the Abolition of Political Parties. On the one hand, the piece is prescient as a prediction of the party-political phenomenon of Trump and its causes. On the other, unfortunately, it offers no real alternative to party organisation in a democracy. But perhaps the warning it provides, coupled with the confirmation of her hypothesis in almost every action of Trump and his supporters, may prevent a future descent into irrecoverable chaos.Weil takes her inspiration not from the usual ancient Classical Greek and Roman cultures but from the unlikeliest of sources for someone who is ultimately critical of mob rule, namely the French Revolution. For her, \"The true spirit of 1789 consists in thinking not that a thing is just because such is the people’s will, but that in certain conditions, the will of the people is more likely than any other will to conform to justice.\"What impedes this spirit is the attempt to corrupt the free will and reasoning ability of individuals. The signal of such corruption is ‘passion’, that is emotional stimulus which stops reason and eliminates free will. For Weil, political parties are vehicles of collective passion whose function is to instil conformity through social pressure. The goal of political parties, that is of their members as well as their leaders, is growth in their own power without limit. Political parties kill conscience and promote mendacity, thus destroying the most fundamental connection with reality: Truth. “The truth which we desire but have no prior knowledge of... is a perfection which no mind can conceive of – God, truth, justice – [words] silently evoked with desire, have the power to lift up the soul and flood it with light. It is when we desire truth with an empty soul and without attempting to guess its content that we receive the light.\" Political parties blind us to this light.One is tempted to discount Weil’s desperately negative view until one remembers that Nazism, McCarthyism, and now Trumpism are all products of party-political democracies. Sinclair Lewis’s It Can Happen Here can and does happen here. Weil has an educational message for those in Anglo-Saxon countries, particularly Britain and the United States. She notes that the continental European political system not only demonises rival parties but as a matter of course threatens party rivals with prison and even extinction. Anglo-Saxon politics, Weil notes, hadn’t yet reached this level, preserving a fundamental civility that was real but, as she saw it, temporary. Because of factional dissatisfaction and frustration which are necessary consequences of democratic politics, the natural trajectory of democracy is toward the continental model. Donald Trump’s threat to prosecute and jail Hillary Clinton is a fulfilment of Weil’s prediction. As is the stubborn refusal of Trump’s Republican supporters - particularly religious evangelicals - to even recognise the possibility of immorality on the part of their chosen leader. Their consciences appear frozen and inoperable.Weil in fact implicitly anticipates this last point as well. She traces the origin of such obstinate mendacity to the Catholic Church’s attempt over many centuries to control the spread of sects and threatening (to it) divisions which followed the French Revolution. Parties act like mini versions of a secular Church. Unity is maintained through the generation of collective passion, a drug which should be banned like other harmful substances. Which provokes a thought that seems to be incipient in much of the wonder at Trump’s ability to attract and maintain such a stalwart following. Trump has in fact created a secular Church, with himself as self-designated pope. “There is no us without you” is the prayer of his congregation. Let us hope that like all such religions, Trumpism fragments into its own sectarian bits before it does any more harm to democracy."}, {"userName": "Aubrey", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/4119460-aubrey", "userReview": "This is a horrible introduction to Simone Weil. I'm giving four stars to her actually doing her own thing, not the ninety-six actually seventy-one actually thirty-one pages that isn't fanboys or fanboys of fanboys. I don't regret requesting that the university buy (me) a copy, but I will if the edition proves such a turnoff and/or distraction to potential Weil enthusists that they chase after the much name-dropped Milosz and Camus instead. They both won Nobel Prizes, people. These are not the nonconformists you're looking for.\nWhen the country is in the grip of a collective passion, it becomes unanimous in crime.\nSo. Politics. And morals. And labels. The collective power versus the individual freedom. Weil seems to be a thinker who gave little shit about excuses for oppression and actually put her money where her mouth is, a combo that unsurprisingly resulted in a short lifespan if not a similarly stunted bibliography and, of course, my interest. I wasn't expecting the rationalist hand-waving that attempts to transform thought into a series of vacuumed assumptions in the name of mathematical \"logic\" and \"truth\", but Weil's actions speak louder than the words which eventually, fortunately, followed the former. Of what follows, this is the statement I wish to poke at most: \nWhenever a circle of ideas and debate would be tempted to crystallise and create a formal membership, the attempt should be repressed by law and punished.\nI as an individual fall within the jurisdiction of various circles of ideas and debate that have crystallized under a patriarchal, heteronormative, and ableist society. In reaction to this social effort to control those who are not men, straight, or neurotypical, I have sought out others with similar experiences, naturally gravitating towards groups that offered a confirmation of my reality backed by numerous members. The phrase above is very stirring and all, but parsed with such broad choices in vocabulary that condemnation falls upon the KKK and the LGBT community alike. I have my own issues with the latter's biphobia in an organization supposedly for social justice, but who is this \"law\", and what is the punishment. Weil's admiration for the Ancient Greeks, Plato in particular, does not reassure.What I wanted to find out from Weil was her dividing line between communal support and political party, personal validation and ideological indoctrination, taking a stand after years of dialectical self-reflexivity and seeing things only in black and white. What I found was a very small piece of her thought process and vague hinting at the whole of it in the words of this edition's two ending essays. Was Weil truly invested in contesting oppression at all times, or did she, like so many other thinkers, reduce the oppression of others to rhetorical flairs in order to enhance her philosophical toolkit? I'll have to read Simone Weil on Colonialism: An Ethic of the Other to begin to find out."}, {"userName": "Sunny", "userReviewDate": "Oct 06, 2016", "userURL": "http://www.goodreads.com/user/show/5870882-sunny", "userReview": "Game changing book. I went to the dentist the other day for a hygiene check and he said that at the end it would feel as though my teeth had shifted. My brain had shifted similarly after having read parts of this. I can’t believe I had never heard of her before and not read anything by her prior to this book. She died in 1943 in Ashford England In a sanatorium apparently from malnutrition as she had starved herself as she was eating the same rations as her French country folk had been allotted by the Germans. She talks with the cutting directness of a Nietzsche but with a thousand times more simpler use of words. She talks simply about the skank that we see happening around us pretty much globally. No I’m not saying that the totalitarian situation or communist example is much better but I do know that if had been watching division 4 football matches with division 4 football players all my life that wouldn’t stop me from thinking that a division one standard could exist. Republic, democrat, tory, labour, left, right; they are the magician’s legerdemain which distract us from other possible modes we could construct and live in. Would you like a medium or large café latte sir? .. Umm no just make it a small one. The best bits were as follows: •\t“We pretend that our present system is democratic, yet the people never have the chance nor the means to express their views on any problem of public life. Any issue that does not pertain to particular interests is abandoned to collective passions, which are systematically and officially inflamed.”•\t“Collective thinking cannot rise above the factual realm. It is an animal form of thinking”•\tIf they try to react against party control, this very impulse to react is itself unrelated to the truth and as such should be suspect.”•\t“Political parties are a marvellous mechanism which, on the national scale, ensures that not a single mind can attend to the effort of perceiving, in public affairs, what is good, what is just, what is true. As a result – except for a very small number of fortuitous coincidences – nothing is decided, nothing is executed, but measures that run contrary to the public interest, to justice and to truth.”•\t“If one were to entrust the organisation of public life to the devil, he could not invent a cleverer device.”•\t“Nearly everywhere – often even when dealing with purely technical problems – instead of thinking, one merely takes sides: for or against. Such a choice replaces the activity of the mind. This is an intellectual leprosy; it originated in the political world and then spread through the land, contaminating all forms of thinking. This leprosy is killing us; it is doubtful whether it can be cured without first starting with the abolition of all political parties.”•\tKEY POINT: “She was not more dialectical than many who practise the dialectical art by changing it into an art of compromises and who buy the unity of opposites too cheaply. “"}, {"userName": "Eadweard", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/16652983-eadweard", "userReview": "\" Democracy, majority rule, are not good in them selves. They are merely means towards goodness, and their effectiveness is uncertain. \"-\" When a country is moved by a collective passion, the likelihood is that any individual will be closer to justice and reason than is the general will -or rather, the caricature of the general will. \"-\" 1. A political party is a machine to generate collective passions. 2. A political party is an organisation designed to exert collective pressure upon the minds of all its indi vidual members. 3. The first objective and also the ultimate goal of any political party is its own growth, without limit. \"-\" Just imagine: if a member of the party (elected member of parliament, candidate or simple activist were to make a public commitment, 'Whenever I shall have to examine any political or social issue, I swear I will absolutely forget that I am the member of a certain political group; my sole concern will be to ascertain what should be done in order to best serve the public interest and justice.'Such words would not be welcome. His comrades and even many other people would accuse him of betrayal. Even the least hostile would say, 'Why then did he join a political party? - \"-\" When a country has political parties, sooner or later it becomes impossible to intervene effectively in public affairs without joining a party and playing the game. Whoever is concerned for public affairs will wish his concern to bear fruit. Those who care about the public interest must either forget their concern and turn to other things, or submit to the grind of the par ties. In the latter case, they shall experience worries that will soon supersede their original concern for the public interest.Political parties are a marvellous mechanism which, on the national scale, ensures that not a single mind can attend to the effort of perceiving, in public affairs, what is good, what is just, what is true. As a result -except for a very small number of fortuitous coincidences -nothing is decided, nothing is exe cuted, but measures that run contrary to the public interest, to justice and to truth. \"-\" The institutions that regulate the public life of a country always influence the general mentality -such is the prestige of power. People have progressively developed the habit of thinking, in all domains, only in terms of being 'in favour of' or 'against' any opinion, and afterwards they seek arguments to support one of these two options. This is an exact transposition of the party spirit. Just as within political parties, there are some demo cratically minded people who accept a plurality of par ties, similarly, in the realm of opinion, there are broad-minded people willing to acknowledge the value of opinions with which they disagree. They have com pletely lost the concept of true and false.Others, having taken a position in favour of a certain opinion, refuse to examine any dissenting view. This is a transposition of the totalitarian spirit.\""}, {"userName": "Sander", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/4366837-sander", "userReview": "Incredible essay that I will keep close by at all times. As well, I've just found a new favorite writer."}, {"userName": "Justin Evans", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/2184529-justin-evans", "userReview": "The only thing I needed to know about this was that Ensor's 'Christ's Entry into Brussels' was on the cover. It helped that I'm curious about Weil, and that NYRB put it out, and that sometimes I just want a book I can finish in an hour or two. And the title helped a lot. But really I just needed the cover. Weil's argument is quite clear, and seems pretty accurate: partisanship distorts thought, whereas disinterested thought helps politics. The relevance to our present political rhetoric is pretty clear. Consider, \"Nearly everywhere - often even when dealing with purely technical problems - instead of thinking, one merely takes sides: for or against. Such a choice replaces the activity of the mind.\" Now consider the political 'debates' about [insert any contentious political issue here.] The essay is padded out with another essay by Milosz, which I found very puzzling at times and insightful at others; and one by Simon Leys, which was unnecessary. A beautiful little artifact, anyway, and a stimulating after-lunch read."}, {"userName": "Michael Julian Arnett", "userReviewDate": "Oct 03, 2014", "userURL": "http://www.goodreads.com/user/show/12259042-michael-julian-arnett", "userReview": "In the title essay, Weil analyzes political parties and the party spirit. She concludes that all political parties, no matter how noble their intentions or how fully they claim to represent the public good at their inception, ultimately \"aspire toward totalitarianism\", that is, complete control and requiring complete and unthinking loyalty from their members. Its sole purpose becomes its own indefinite perpetuation; it becomes about itself: \"Once the growth of the party becomes a criterion of goodness, it follows inevitably that the party will exert a collective pressure on the people's minds. This pressure is very real; it is openly displayed; it is professed and proclaimed. It should horrify us, but we are already too much accustomed to it.\" And it is not just in politics that the party spirit has taken hold: it is palpable in the arts and sciences and, of course, religious denominations, where it has its origins. I read the book twice. It's a slim 70 pages, with the title essay occupying less than 40. The rest of the volume contains an essay on Weil by the poet Czeslaw Milosz, and another essay on Weil AND Milosz by Simon Leys, who passed away just a couple months ago (the same day as Robin Williams, I believe) and who translated Weil's essay. I have been wanting to read Weil for years now and this felt like a good introduction to her life and work. I also adore Milosz and Leys, and having all three in this volume was like listening in on a brilliant conversation."}, {"userName": "David Ranney", "userReviewDate": "Mar 09, 2015", "userURL": "http://www.goodreads.com/user/show/6725259-david-ranney", "userReview": "When a country is in the grip of a collective passion, it becomes unanimous in crime. If it becomes prey to two, or four, or five, or ten collective passions, it is divided among several criminal gangs. Divergent passions do not neutralise one another, as would be the case with a cluster of individual passions. There are too few of them, and each is too strong for any neutralisation to take place. Competition exasperates them; they clash with infernal noise, and amid such din the fragile voice of justice and truth are drowned.\nand\nPolitical parties are a marvellous mechanism which, on the national scale, ensures that not a single mind can attend to the effort of perceiving, in public affairs, what is good, what is just, what is true. As a result -- except for a very small number of fortuitous coincidences -- nothing is decided, nothing is executed, but measures that run contrary to the public interest, to justice and to truth.\nand\nNearly everywhere -- often even when dealing with purely technical problems -- instead of thinking, one merely takes sides: for or against. Such a choice replaces the activity of the mind. This is an intellectual leprosy, it originated in the political world and then spread through the land, contaminating all forms of thinking.\tThis leprosy is killing us; it is doubtful whether it can be cured without first starting with the abolition of all political parties."}, {"userName": "Maria Rita", "userReviewDate": "Aug 26, 2013", "userURL": "http://www.goodreads.com/user/show/19830838-maria-rita", "userReview": "I partiti politici sono entità astratte e sfuggenti. Questo vale ad ogni latitudine ed anche nelle democrazie più liberali della più antica tradizione europea e degli Stati Uniti d'America. La Weil scrive le sue riflessioni alla luce delle vicende storiche che hanno portato alla Seconda Guerra Mondiale ma sono talmente convincenti che conservano intatto il loro fascino anche ai nostri giorni e ci illuminano, ci fanno riflettere, sulla natura più profonda delle organizzazioni partitiche ed umane di tutti i tempi. Lei però parte dalla convinzione che la verità sia una e che tutti guardandosi dentro la possano perlomeno vedere. Non è chiaro con che strumenti possano agirla questa verità perché essa abbia una presa sulla vita pubblica, ma essa è una e i partiti invece sono tanti e ognuno persegue un fine che non è il bene di tutti ma l'interesse di un gruppo. Di più, secondo la Weil i \"partiti sono organismi costituiti pubblicamente, ufficialmente in modo da uccidere nelle anime il senso della verità e della giustizia\". Come darle torto se pensiamo solo per fare un esempio, a quanto le scelte della politica internazionale e di ogni singolo stato negli ultimi 30 anni, abbiano contribuito in modo determinante a creare tutte le premesse per lo scoppio della più grande crisi economica dopo quella del 1929 e in cui siamo tutt'ora invischiati dal 2007?!"}, {"userName": "Jim", "userReviewDate": "Mar 29, 2017", "userURL": "http://www.goodreads.com/user/show/1895570-jim", "userReview": "This slim book is actually by three authors: Half is an essay by Simone Weil entitled \"On the Abolition of All Political Parties.\" This is followed by a 1960 essay by the Polish poet Czeslaw Milosz on \"The Importance of Simone Weil\" and a current essay by Simon Leys on \"In the Light of Simone Weil: Milosz and the Friendship of Camus.\"The result of this organization is to make this a work of political philosophy combined with a tribute to its author.Weil is most convincing on he subject of political parties: The goal of a political party is something vague and unreal. If it were real, it would demand a great deal of effort and attention, for the mind does not easily encompass the concept of the public interest. Conversely, the existence of the party is something concrete and obvious; it is perceived without any effort. Therefore, unavoidably, the party becomes in fact its own end.And what should we be aiming for if not the success of a political party? According to Weil, the answer if \"truth, justice, and the public interest\" -- things which get lost in the hugger-mugger of party politics."}, {"userName": "J.", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/1298937-j", "userReview": "I was apprehensive recalling how quickly Weil can at times slide from mysticism to the political muddle of, say, The Need For Roots, but I have to admit that my fears were misplaced: this is a serious, abstract work of Platonic ontological ethics, traits probably well-served by its severe brevity. (I'd recommend just ignoring the essays by Milosz and Leys by whatever trick you use to ignore Thibon's intolerable insertions in Gravity and Grace.)"}, {"userName": "Bevan", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/22961031-bevan", "userReview": "The English version is available, as \"On the Abolition of All Political Parties,\" translated by Simon Leys. Black Books, Australia, 2013. Includes an essay by Czeslaw Milosz. This is a brilliant essay by the French philosopher, originally published in 1957. Particularly apropos for today's political world."}, {"userName": "Jonathan Norton", "userReviewDate": "Jun 11, 2017", "userURL": "http://www.goodreads.com/user/show/5888466-jonathan-norton", "userReview": "Simone Weil was a very profound thinker but like all philosophers her writings vary in quality and should not be taken uncritically. They were never written to be treated as such and she would despise such an attitude as idolatry. Her topical political writing after the Fall Of France was rather poor, she fell for some very glib \"cultural\" explanations that were no doubt circulating amongst the stunned intellectual class both at home and in exile, who couldn't accept that it was simple cowardice and inadequate training caused soldiers to run away from German tanks, rather than the supposed influence of Gide's novels.This particular essay was written not long before her death in 1943 and so shouldn't be treated too harshly as she wasn't in good condition by then. Nevertheless the argument is weak in scope and detail. She too quickly excuses the British party system in order to focus on French politics. Her objections to mindless orthodoxy hardly fit the historical story of the National Assembly in the 20s and 30s: endless coalitions collapsing because there was *too little* consensus, not too much. The ideological submission of the Communist Party seems to mesmerise her, yet the CP had quite a few splitters and defectors (including stalwarts who went over to the Right and ended up as Vichyites and Nazis). Some of her objections to the notion of a general \"point of view\" are frankly adolescent. The charm and power of Weil is in her near-saintliness, but here the unworldliness is merely naivete.The strongest points here are the reiteration of her opposition to \"the Great Beast\" of mass society, and its suppression of the individual conscience. But party politics, apart from its most poisonous extremist varieties, is a very weak and vinegary specimen of that particular brew."}, {"userName": "Jeff Buddle", "userReviewDate": "Aug 19, 2016", "userURL": "http://www.goodreads.com/user/show/23285240-jeff-buddle", "userReview": "This is not a book. This is an essay, combined with an essay about the essayist, and matched with an essay about the man who essayed the original essayist. In short, it's a pamphlet. The real star here is Simone Weil's 'On the Abolition of All Political Parties,' an indictment of all of political parties regardless of affiliation. Weil was writing in 1943 France, so is colored by both Hitler and 1789, but her vision is remarkably clear. A Party politician, regardless of affiliation, exists in service to his Party, not the common good. The Party will, no doubt, influence the politician to serve only it. The Party must win at all costs and so the desirous politician will sacrifice his own morals to win his post. As such, in Weil's estimate, political parties are inherently evil. They serve not the public good, but themselves. Weil had no political affiliation herself and as the corroborating essayists would have it, had anarchist sympathies. I can relate. I'd like to read more work by this remarkable woman."}, {"userName": "George", "userReviewDate": "Jun 26, 2017", "userURL": "http://www.goodreads.com/user/show/7895055-george", "userReview": "Simone Weil was way ahead of her time. She asserted that political parties are all totalitarian in nature, restricting the conscience of the individual in the name of vague ideology and party objectives. Rejecting what we would now call \"politics as usual\", she questioned the assumption that we need traditional parties in order to do politics.While I sympathise with this argument and I think that a great many people in Britain today would like to see politics conducted across parties, around issues that cover the national interest like Brexit, the economy, and the future of our public services, Parliament is set up for debates between different sides: we have the Government benches and the opposition benches, and most of the time there is no love lost between the politicians on each.So there would probably need to be a huge amount of reform in order to realise Weil's vision of politics conducted by individuals outside of party tribalism. We see in France that Emmanuel Macron rose to the presidency through establishing a new way of doing politics. His En Marche! \"movement\" pooled a mixture of citizens from a range of social and professional backgrounds, with no previous political affiliation - and no record of having held office - alongside politicians who came from parties that they felt no longer had the right answers for how the country should be governed. In less than a year Macron went from insurgent to president, winning his first ever election to the highest office in the land. Of course we must withhold judgement until we observe how well his movement transitions to Government, however the enthusiasm this new style of politics created offers an alternative to the creaky Parliamentary system in Britain.Parliament, while being far from perfect, has many opportunities for the 650 elected politicians. MPs form the Government and the loyal Opposition; they sit on the backbenches, on cross-party committees, all-party Parliamentary groups, and hold non-partizan offices such as that of the Speaker. There is a variety that is not always well covered by the everyday media, as they involve nuances that in our particularly fast-moving, news addicted world we struggle to pinpoint. The individual MP who votes his or her conscience - often labelled a \"rebel\" - has an important role to play, and this has been the case for many years, perhaps most notably since John Wilkes, as a Radical MP, campaigned for legal and Parliamentary reform in the 18th century, and was repeatedly banned from the House of Commons by the authorities and re-elected to his seat by his supportive constituents. Nowadays we have another peculiar example in Jeremy Corbyn, who after decades of disregarding the Labour Party whip - and indeed voting against his party and the New Labour Government a reported 533 times from 1997 - became Labour leader himself in 2015. It is perhaps no surprise that many of his backbenchers have now followed his lead and rebelled against his party line.Likewise on the Conservative side, David Cameron failed to get several of his own cabinet ministers to back his European Union renegotiation deal when he called the 2016 referendum. Nicknamed the \"gang of six\", cabinet collective responsibility had to be relaxed in order to stop Government secretaries of state such as Michael Gove and Chris Grayling from resigning from their roles. Tory MPs were split between wanting to leave and remain in the EU -- some for the sake of conscience, and the passionate views of their constituents, others for career opportunity. With loyalty to the Prime Minister having been undermined, rightly or wrongly, Cameron went on to lose his referendum and quit Downing Street in the aftermath.In my view, party political loyalties are already breaking, and Weil would look on the current events with a great deal of interest. Across parties the traditional lines are more blurred than ever. Our relationship with Europe is just one of the issues that divides parties and sees individual politicians choose new alliances, such as that forged between Conservative Boris Johnson and Labour's Gisela Stuart through the Vote Leave campaign during the referendum -- a quasi-political party formed for the purpose of ejecting us from the EU. You can look at other issues such as the vote for Equal Marriage in 2013, and this week's call for Northern Irish women to have abortions covered by the NHS in England and Wales instead of being charged, as signs that MPs do want to vote their consciences more often, and across the chamber of the House of Commons there is a diversity of views that are not wholly addressed by party membership.And despite the 2011 referendum on the Alternative Vote proving unsuccessful for the change option, there is still a case being made for electoral reform, especially by the Liberal Democrats and the Greens who believe that our politics would be more representative with a diversity of parties in Parliament, elected through proportional representation, rather than the traditional dominance of the big two that is secured through the first-past-the-post, winner-takes-all method. Maybe reforms like this would help more people become involved in politics, not just because they would feel their vote counted more, and they wouldn't have to vote tactically, but because they themselves could get involved with different or new political parties that stood a chance of getting elected to Parliament.These are big questions. They are very hard to answer in our current climate of confusion, with there being a hung Parliament after the recent General Election and no consensus as to what kind of Brexit we want for our country. And these debates will not go away any time soon. There may yet come a time when the grip of the traditional parties loosens completely, backbench rebellions bring down governing parties, and new forces arise and enter power.What is clear is that there is a thirst for something new, something different, and it is coming. Simone Weil wrote her essay nearly a century ago but it is more relevant today than ever."}, {"userName": "Cyrus Molavi", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/12604188-cyrus-molavi", "userReview": "Coherent and concise. I like the way she thinks, and will be reading more. The argument makes total sense, but I'd have liked it to be explored from more angles. (She addresses a few essentially by saying they are out if scope, though.)"}, {"userName": "Dina Rahajaharison", "userReviewDate": "Dec 24, 2013", "userURL": "http://www.goodreads.com/user/show/5973778-dina-rahajaharison", "userReview": "\"Il est impossible d'examiner les problèmes effroyablement complexes de la vie publique en étant attentif à la fois, d'une part à discerner la vérité, la justice, le bien public, d'autre part à conserver l'attitude qui convient à un membre d'un tel groupement.\""}, {"userName": "John Pistelli", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/833943-john-pistelli", "userReview": "If you'll allow me, dear reader, a self-indulgent preamble— Readers of my novella \nThe Ecstasy of Michaela\n will notice a few lines from Simone Weil quoted as the heroine's reading material. This should not be mistaken for deep familiarity with Weil on my part; I have read her in only in glimpses and glances and mainly thought that she was the sort of writer my fictional protagonist would be devoted to. In my experience, most creative writers read this way—I recently saw an essay in which Andy Seal expresses amused contempt for the supposedly opportunistic unseriousness of Saul Bellow as a thinker precisely because Bellow made creative use of philosophical writing in the way I just described; but I think Seal's judgment is the kind of thing that gives academics a bad name among writers. Closer to the mark is Umberto Eco's verdict in The Aesthetics of Chaosmos: The Middle Ages of James Joyce, delivered after Eco revealed just how shockingly little of Aquinas's writings Joyce had really read, that Joyce had read enough to intuit the whole Thomistic philosophy and its possible uses and implications. While I am no James Joyce or even Saul Bellow, I think this is part of the novelist's job description; after all, we have to understand the world, and there is no time to read everything. I do take Moses Herzog seriously as a thinker, and Stephen Dedalus, for that matter.Now to Simone Weil herself. This very short book is only half taken up by Weil's title essay, wherein she explains that only God is an end in itself; thus, political parties—which arrogate to themselves the whole truth of the human situation, thus making themselves ends rather than means to the good—are inherently idolatrous. In pursuit of this argument, Weil says a lot of attractive things that will have the truth-seeking reader nodding happily along:Just imagine: if a member of the party (elected member of parliament, candidate or simple activist) were to make a public commitment, 'Whenever I shall have to examine any political or social issue, I swear I will absolutely forget that I am the member of a certain political group; my sole concern will be to ascertain what should be done to best serve the public interest and justice.'Such words would not be welcome. His comrades and even many other people would accuse him of betrayal. Even the least hostile would say, 'Why then did he join a political party?'—thus naively confessing that, when joining a political party, one gives up the idea of serving nothing but the public interest and justice.But let us not nod too quickly. For one thing, here in America, where the idea of a political party has historically been less totalizing than in Europe (though this may be changing as the Democratic and Republican parties split on regional and racial lines), politicians say the above all the time, and it tends to mean very little. Weil's imagined honest partisan sounds like John McCain and the Straight-Talk Express; such sentiments guarantee nothing and can be used as propaganda for the worst political forces.We will avoid confusing Weil with a cynical American centrist if we understand her real values. The word \"justice\" in the passage quoted above provides a clue, as do these lines:Goodness alone is an end. Whatever belongs to the domain of facts pertains to the category of means. Collective thinking, however, cannot rise above the factual realm. It is an animal form of thinking. Its dim perception of goodness merely enables it to mistake this or that means for an absolute good.Weil essentially offers a modified Rousseauism, defending his concept of \"the general will\" and its materialization during the French Revolution as the view that \"in certain conditions, the will of the people is more likely than any other will to conform to justice,\" because the people have actual experience of the conditions related to their lives. This is a pleasant thing to think, but how true is it? Or, more to the point, who gets to say what those \"certain\" conditions are? Everybody, even kings and queens, claims to be doing the people's will. Who will adjudicate this claim? In the end, Weil's politics are not politics at all; she expresses a Platonic metaphysic in political terms, but what it would look like in practice varies from the hard-to-imagine (universal syndicalism, a kind of permanent Occupy meeting?) to the terrifying-to-imagine (terror on behalf of the general will?).The second half of this volume contains an illuminating 1960 essay by the poet Czesław Miłosz, who translated Weil into Polish, elaborating her philosophy in full. He explains that he took Weil as an example of thinking beyond the Cold War polarities of nationalist Catholicism and international Communism, even as she demonstrated some of the real affinities between Marx and the Church. Miłosz is brilliant on the topic of Catholic thought's inability to assimilate the historical dimension of philosophy more or less discovered by the nineteenth century, and he admires Weil's addition of \"the history of class struggle\" to the Platonic and mystic strain in Christianity. According to Miłosz, Weil was a Cathar; she believed thatThe only true Christian civilization was emerging in the eleventh and twelfth centuries in the country of the Langue d'Oc, between the Mediterranean and the Loire. After it was destroyed by the Frenchmen who invaded that territory from the north and massacred the heretics—the Albigensians—there has not been any Christian civilization anywhere.The Albigensians, let us recall, were essentially gnostics who considered this world the domain of evil, the kingdom of darkness. I am not saying they're wrong—look around!—only that their dismissal, and Weil's, of the reality of numinous pleasure in the world is a neurotic intellectual's politics and can as easily lead to becoming a perpetrator of violence as becoming its victim. Totalitarianism in the twentieth century may very well have been a gnostic revenge upon Europe for the Albigensian crusade, and the whole thing is parodied today in the impossibly puritanical cult of \"social justice\" on the Internet. Miłosz speaks for me when he says, \"I consider myself a Caliban, too fleshy, too heavy, to take on the feathers of an Ariel. Simone Weil was an Ariel.\" I am also with Susan Sontag in finding Weil's extreme persona and her extreme philosophy interesting, which is to say aesthetically compelling. In fact, aesthetically, I condemn my own condemnation of Weil; how, well, tacky to argue against a politics of Platonic truth, to imply that we should all resign ourselves to being the smile on Richard Rorty's face. Weil would have regarded this aesthetic praise, no doubt, as rebarbative paganism, the gratification of the natural animal at the expense of otherworldly grace. In her spirit, then, I would like to take Weil seriously enough to say that I think she is wrong, even dangerously deluded, and for the usual reasons: she was a self-hating bourgeois intellectual who devoted her life to slumming it, and in the process made a grotesque caricature of \"the oppressed\" in whose behalf she pointlessly starved herself. Miłosz attributes to Weil the view that we should always take the side of \"the oppressed,\" but this is easier said than done—or even understood. Who, in fact, is \"the oppressed\"? A rich white woman condescended to by a rich white man? A factory laborer in a sweatshop? While there are clear victims of some socio-political situations—civilians under bombardment, for instance (though maybe even this can be questionable; the WW2 bombings of Germany and Japan have long had their defenders)—for the most part, the whole rhetoric of oppression is mostly self-serving nonsense uttered by various power-seekers. Having grown up at least in part in a working-class milieu, I can testify that \"the oppressed\" mostly want money and power, just as \"the oppressors\" do, and that Nietzsche and Foucault grasp the truth much better than either Plato or Marx: \"Power is everywhere…because it comes from everywhere.\" If Weil wanted something else—and some people do—she should not have confused this with a politics. In fact, I charge her above all with that besetting vice of modernity, the confusion of an aesthetic disposition with a political argument. She should have gone somewhere to paint or write poetry; I wish I could.And so back to aesthetics: I find her views distasteful, even as I find their extremity compelling. Hence my desire to represent her in fiction, and/but to use fictional form to hold her at a certain ironic distance. I would not really want to be a Cathar, would I? Or would I? Weil says that truth is one, as Plato told us. Would that I could experience this truth, this oneness. In the meantime, I take my stand with Shakespeare and Dostoevsky and Joyce and Bellow and Sontag, those who turned their attention on the irreducible fact of our confusion. Even Plato wrote dialogues."}, {"userName": "Pedro Rodrigues", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/77562414-pedro-rodrigues", "userReview": "Um dos problemas que afectam as sociedades actuais é, sem dúvida, a maneira como os partidos políticos conduzem os assuntos públicos. É notório que existe uma descrença generalizada dos cidadãos relativamente aos partidos políticos, descrença essa que parece agudizar-se a cada ano que passa. Não estamos perante um problema novo. Em 1943, Simone Weil- escritora e filósofa francesa- escreveu um pequeno ensaio intitulado \"Nota Sobre a Supressão Geral dos Partidos Políticos\". Nesse livro, a autora declara sucintamente algo tão simples e tão violento como isto: os partidos políticos devem ser abolidos, pois não servem o bem. Segundo a autora, a democracia e os seus representantes directos (os partidos políticos) devem ser um meio através do qual se visa o bem. Mas o que é o bem? Para Simone Weil, o bem é constituído por três elementos, nomeadamente a verdade, a justiça e a utilidade pública, dando assim a entender a sua abordagem moral da política. A ênfase que a autora coloca na questão do \"bem\" destina-se a assinalar que a legitimidade de um sistema político ou de uma instituição, só é assegurada quando determinado sistema político ou determinada instituição se norteiam por princípios éticos. No entender de Weil, as motivações ideológicas dos partidos políticos não têm qualquer ponto de contacto com a ideia do bem, por isso não faz sentido prolongar-lhes a existência. Simone Weil, entende que existem três características que todos os partidos políticos partilham: são uma máquina que fabricam paixões colectivas; são uma organização construída de modo a exercer pressão colectiva sobre cada um dos elementos que a constituem; o objectivo de todo o partido político é o seu próprio crescimento, sem limite. A condução da vida pública não pode assentar em alicerces passionais porque, diz-nos a autora, só a razão nos pode impelir a seguir o caminho da justiça e da utilidade pública, caminho esse que nos é vedado quando somos guiados pela paixão. Por outro lado, a razão é invariável de homem para homem. Isto é, a razão não permite que formemos concepções divergentes sobre a justiça, dado que o conceito de justiça é, por definição, uno e indivisível. Aqueles que professam ideais racistas ilustram perfeitamente esta ideia. Só é possível ser-se racista caso deixemos que a paixão se apodere do nosso pensamento, visto que olharmos para o racismo com os olhos da razão torna-se absolutamente impossível concebermos qualquer ideia racista. É evidente que se pode criticar Simone Weil por ela não apresentar nenhuma proposta concreta no sentido de substituir os partidos políticos. No entanto, não acredito que essa objecção fragilize este livro. A filosofia é, acima de tudo, uma disciplina científica que nos ensina a olhar para o estabelecido de uma forma inconformada. Mais do que apresentar soluções e respostas, a filosofia apresenta questões. Pode-se achar que isto é pouco, mas é um erro. Por vezes, a \"mera\" indagação é mais eficaz na transformação da realidade do que a estúpida e incessante procura de respostas."}, {"userName": "Jordan", "userReviewDate": "Mar 18, 2018", "userURL": "http://www.goodreads.com/user/show/27936455-jordan", "userReview": "Simone Weil’s essay talks about how people are pulled either into the light of truth through a sense of unbiased reason, or away into the darkness through the bouts and vicissitudes of passionate desire. But each person’s pull away from the light is in a different direct, and each person’s pull towards it is in the same direction. This is a basic assumption of the goodness of democracy. (If democracy is not good, it is not what we should be practicing. If Hitler had never risen to power but the Weimar Republic still committed the atrocities of World War II through a democratic process it does not make those atrocities somehow less atrocious.) Political parties, on the other hand, serve to focus and align the chaotic desires of darkness and bundle them together into a force with power. It makes no sense, these days, to criticize someone for saying “As a democrat,” or “as a republican,” but these statements are parroted nonsense. It is not interesting or useful to know what a representative’s party stands for when we purportedly elected them for their ability to represent our own or on their views being a close enough reflection of our own. For this and other reasons all political parties should be abolished. We should replace them with a kind of informal forum, or as she calls them a series of journals, to which one may read or contribute, but to which one would not belong, but orbit, or be a reader of, or a writer in, but never a member, or subordinate, or a parrot of. In that way each person, each representative evaluates for themselves the plans and policies and proposals of the others, asking questions and offering criticism, and each shall cast their votes, when the time comes, in the light of their own reason and the will of those whom they represent. I basically agree with everything she says. The trouble is that it makes action difficult. One of the ways in which she criticizes political parties is how they develop a binary stance towards or against something, how they drain from the issue all nuance and use propaganda and slander to vie for power. The trouble is that our votes work this way, most of the time. One piece of legislation, arguments for or against. She doesn’t talk about it much, but in an ideal congress there would be a deliberation, proposals sent out and digested, discussion had, amendments made, and the best and most just proposal would succeed. That takes a long time, though. Maybe it should. I don’t know. But I agree with her. And her words are stark and piercing in the firelight of the current political climate."}, {"userName": "Kim", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/33607730-kim", "userReview": "trans. Simon Leys, 2013.Ah, fuck. This is one of those \"right time, right place\" reads, for me. My life has taken a hard \"disillusioned socialist\" turn. There are three essays here: first, Weil's, then Milosz's \"importance of Weil\", and then Leys' closing remarks connecting Milosz, Weil, and Camus. I don't agree with all of Weil's points. But from what I have read, I do think she is a true radical and a moral absolutist, which is both rare and common. Her ability to see \"value\" in \"dissenting\" opinions is true, her desire to speak truthfully is powerful, and her devotion to independent free thinking via an obedience to God while holding contradictions, is solid, it seems. Weil is Cartesian in privileging reason and activities of the mind over feeling-states and opinions, because she believes in a transcendent moral foundation.The essay is repetitive as hell, which Milosz praises as coherent thinking. The writing is easy to follow, given this logic. Problematic parts include the typical denouncing of so-called collectivistic primitive people in static, backward thinking societies, her binaric clinging to absolute truth/falsehood, and leaning too much towards the tyranny of masses. Obviously, the oversimplification of the far-left and right make her argument easier to comprehend. A few more points worth mentioning: she believes there is an essential lack of independent thought when you proclaim membership to a political party, and how this political system of what we would call \"identity politics\" today is cancerous to a truly democratic, free-thinking society. Instead, we buy in an image of the public good, which is really just whatever the party's platform has led us to believe. In short, the political party/group membership wants you to think that they have your best interest in mind, and thus, it is the same as the public interest -- however, this is not the case. That is why parties prey on masses of young, not yet fully learned, impressionable people -- who are susceptible to the party's propaganda, and who will carry out the party's agenda -- as if it were through their own vocation. Weil is cutthroat in her execution. But it very much a chicken/egg problem when it comes to the abolition of political parties. There is so much more to talk about; I will return to this once my thoughts have fully sinked in."}, {"userName": "Grig O'", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/5998404-grig-o", "userReview": "I found Simone Weil while browsing around Goodreads, and this title looked interesting so I checked it out. Around the same time I watched this talk by Thomas Metzinger (of The Ego Tunnel: The Science of the Mind and the Myth of the Self fame) on spirituality and intellectual honesty, which ended up tying in nicely with Weil's essay.Metzinger's main thesis is that spirituality, as the existential quest for inner truth, is closely related to being an intellectually moral person. While T.M. doesn't cite Weil in his brief literature review, she would probably identify with the John Locke stance of intellectual honesty as obligation towards God.In this sense, this essay reveals Simone Weil as a highly spiritual person. Indeed, she spares no quarter for brutish, dogmatic collectives from the Catholic Church to trendy art movements, but obviously most of her ire is saved for political parties. Her critique rings true because it comes from a place of selflessness and clarity, which leads to several striking passages already quoted here by other reviewers.Now, I'm docking one star due to the obvious weakness in the argument. Removing political parties is precisely what authoritarians do once in power: this is because (and Weil admits this) they can be vehicles for popular will, albeit imperfect and corrupt. As with other liberal democratic institutions such as workers' unions, political parties are fundamentally insufficient means of emancipation, yet the alternative is far worse. So the key is not to retreat in some idealistic spiritual/intellectual medium (whose social implementation will always be impure, no matter what ethical regulations Weil's world would instate), but to honestly engage with the existing institutions as best we can, in order to try to perfect them.Don't take this as too harsh a criticism though, S.W. might have come to these conclusions had she lived longer and I know full well I'm not one to give her lessons, heh."}, {"userName": "Michael", "userReviewDate": "Mar 13, 2018", "userURL": "http://www.goodreads.com/user/show/26293526-michael", "userReview": "Excellente description de la dérive des partis, le livre fait néanmoins une généralisation de ce néfaste \"esprit de parti\" qui y est décrit à tous les partis. Certains d'entre eux peuvent pourtant ne pas correspondre à la description qui en est faite par Simone Weil : ils ne seront pas forcément doctrinaires, ils n'auront pas forcément vocation à croître indéfiniment...Je remarque en outre une forme de scientisme, ou de déterminisme, chez l'auteur, qui établierait l'existence d'un standard de vérité ou de justice, qu'il est propre à l'Homme de découvrir lorsque les conditions lui sont favorables.L'auteur associe également cette vision des choses à Rousseau, chez qui je ne l'ai pourtant jamais trouvé. Si Rousseau pensait qu'une bonne démocratie ne permettrait au peuple de n'accomplir que le juste et le bon, pourquoi disait-il également qu'une bonne démocratie accordait au peuple le droit de se tromper ?En somme, ce livre est un excellent réquisitoire contre les partis, mais néanmoins, par l'expression qu'il contient des propres pensées partisanes de Simone Weil, montre aussi à quel point il est dur de venir à boût de l'esprit de parti, même à titre individuel."}, {"userName": "Jesse", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/75412-jesse", "userReview": "Sort of an early-era hot take in response to the utter breakdown of civilization occasioned by WWII, and the resulting factionalism occurring even within the supposedly united cohort of the anti-Vichy French government in exile. Still packed with salient points about the need to separate individual thought from the grinding mechanics of political discourse, a searing polemic in line with the purity-seeking perfectionism that defined the final period of Weil’s brief life."}, {"userName": "E7boehm", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/27250961-e7boehm", "userReview": "The essays main problem is that it covertly attacks political association. This must mean that there is an ideal system where there is no affiliation. Weil is trying to make a purified system , it is very french in its repression of speech and association. She made me think but her argument that nothing in the public interest is achieved by parties and a system without parties would be any better is questionable."}, {"userName": "David Sousa", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/63236420-david-sousa", "userReview": "Num argumento lúcido e simples, Simone Weil demonstra como os partidos políticos são intrinsecamente totalitários, que o bem comum verdadeiro não coincide com vontades partidárias que só favorecem categorias sociais e não expressam a vontade geral. Banir os partidos políticos é uma solução natural e consequente da procura indivídual da verdade e da justiça. Ler!"}, {"userName": "Yasmina", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/40367802-yasmina", "userReview": "...par Tomski : « Un parti au pouvoir et tous les autres en prison. » Ainsi sur le continent d'Europe le totalitarisme est le péché originel des partis.\"A lire pour comprendre la machination des partis politiques."}, {"userName": "Tracey", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/37756416-tracey", "userReview": "A short and interesting read as to why party politics will never bring true democracy or government of the people, by the people, for the people."}, {"userName": "Maurizio Manco", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/71961244-maurizio-manco", "userReview": "\"Non c'è nulla di più confortevole del non pensare.\" (p. 49)"}, {"userName": "Rhys", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/22127141-rhys", "userReview": "Enjoyed the essay by Milosz on Simone Weil."}], "description": "A brilliant woman who was a study in fiercely maintained contradictions, a star student who went to work on a factory line, a Jewish convert to Catholicism who insisted on refusing baptism, Simone Weil is one of the most intransigent and taxing of spiritual masters, always willing to push her thinking—and us—one step beyond the apparently reasonable in pursuit of the one truth, the one good. She asks hard questions and avoids easy answers. In this essay—now in English for the first time—she challenges the foundation of the modern liberal political order, making an argument that will have particular resonance in present-day America. Examining the dynamic of power and propaganda caused by party spirit, the increasing disregard for truth in favor of opinion, and the consequent corruption of education, journalism, and art, Weil proposes that politics can only begin where the party spirit comes to an end.This volume also reprints an admiring portrait of Weil by the Nobel laureate Czesław Miłosz and an essay about Weil’s friendship with Albert Camus by the translator Simon Leys.", "title": "On the Abolition of All Political Parties", "url": "https://www.goodreads.com/book/show/22747485-on-the-abolition-of-all-political-parties", "average": 3.9, "cover": "https://images.gr-assets.com/books/1405864185l/22747485.jpg", "reviews": 47, "authors": [{"url": "https://www.goodreads.com/author/show/18395.Simone_Weil", "name": "Simone Weil"}, {"url": "https://www.goodreads.com/author/show/269491.Simon_Leys", "name": "Simon Leys"}, {"url": "https://www.goodreads.com/author/show/84259.Czes_aw_Mi_osz", "name": "Czesław Miłosz"}], "type": ["Philosophy", "Politics", "Nonfiction", "Writing"], "outlinks": ["http://www.goodreads.com/book/show/22747485-on-the-abolition-of-all-political-parties", "http://www.goodreads.com/book/show/20447761-on-the-abolition-of-all-political-parties", "http://www.goodreads.com/book/show/9717587-manifesto-per-la-soppressione-dei-partiti-politici", "http://www.goodreads.com/book/show/20305110-note-sur-la-suppression-g-n-rale-des-partis-politiques", "http://www.goodreads.com/book/show/35599368-nota-sobre-a-supress-o-geral-dos-partidos-pol-ticos", "http://www.goodreads.com/book/show/37904998-note-sur-la-suppression-g-n-rale-des-partis-politiques", "http://www.goodreads.com/book/show/34514903-note-sur-la-suppression-g-n-rale-des-partis-politiques", "http://www.goodreads.com/book/show/88329.Waiting_for_God", "http://www.goodreads.com/book/show/730139.Gravity_and_Grace", "http://www.goodreads.com/book/show/32781.War_and_the_Iliad", "http://www.goodreads.com/book/show/141420.The_Need_for_Roots", "http://www.goodreads.com/book/show/88331.An_Anthology", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}