{"ratings": 91, "userreviews": [{"userName": "Ashley Fontainne", "userReviewDate": "Jun 10, 2013", "userURL": "http://www.goodreads.com/user/show/5648545-ashley-fontainne", "userReview": "A broken man stands at the grave of his wife, his world turned upside down as he watches while her casket is lowered into the damp earth. Distraught beyond consoling, he aches for her presence. What is he to do without her? How will he find the strength to live on alone?As the main character struggles with his pain, his mind isn't thinking clearly. Grief overwhelms him, until a mysterious stranger offers him the impossible.This book is a quick read but really delves into the sorrow a person experiences with the loss of a loved one. It also touches upon how easily it is to cross the threshold into insanity when a desperate heart wants something that can no longer be,Dark,, intense and written with an expert hand, Orchid is a must read for fans of Stephen King's 'Pet Cemetery.' Warning: once you start, you won't be able to put this one down until the final word is read."}, {"userName": "Shane O'Neill", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/12341417-shane-o-neill", "userReview": "Imagine, if you will, the dread at losing the one you love - when all that you hold dear is suddenly, and inexplicably, taken from you. And then, when all seems lost and nothing can lift the darkness threatening to consume you, a stranger walks up to you and says he can restore all you have lost. What would you do? Could you resist that last glimmer of hope?This is the dilemma facing Mark Wiseman. While standing at his wife's graveside and looking down on her casket, a man tells him he can give her back to him. Should he let her go? Or should he accept the offer to be with his beloved once again? For such things carry a price and is it a price he is able to pay?"}, {"userName": "Jeff Fountain", "userReviewDate": "Oct 22, 2013", "userURL": "http://www.goodreads.com/user/show/16720545-jeff-fountain", "userReview": "If you have ever had the thought skip merrily through your head about doing something you know will come back and bite you later, you should probably read this story first. Straight ahead and right to the point, Orchid a wonderful tale about love, loss and not being able to let go, even if your own soul is at stake. A great story that will make more than a few readers stop and ponder decisions they have made in their own life. Well done."}, {"userName": "Emma Edwards", "userReviewDate": "Jun 27, 2013", "userURL": "http://www.goodreads.com/user/show/10877659-emma-edwards", "userReview": "What wouldn't you do for true love? Would you defy death to change your destiny? Would you make a deal with the devil? Orchid is a dark, poignant tale detailing what lengths a man will go to keep the woman he loves with him. Mark is offered a deal he could not refuse, unfortunately true to human nature, he never imagined the cost or the consequences of his choices. The story that unwinds from one decision made in the throws of anguish and despair is overflowing with heartbreaking betrayals and mind numbing revelations.If something seems to good to be true, it usually is and sometimes it can cost you your very soul.Orchid is a well written, amazing short read that left me spellbound and full of anticipation to read more Tales of The Black Sabbath."}, {"userName": "Scott Stevens", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/17857954-scott-stevens", "userReview": "Orchid: Tales of the Black Sabbath starts with a mood that's dark and gets darker. What's not to like about this horror short? It is a great cross-section of O'Neill's crisp writing found in his vampire-led The Dracula Chronicles series. Right from chapter one it reminded me a bit of the suspense and ominous moodiness of Stephen King's Bachman works. When the creepy stranger appears graveside at the end of the first chapter appealing to the fresh widower, \"Just don't let them bury her,\" you know full well he'll take the bait and you're not putting this down until you finish."}, {"userName": "Maer", "userReviewDate": "Nov 06, 2013", "userURL": "http://www.goodreads.com/user/show/6988142-maer", "userReview": "The choice to bring a lost loved one back from the dead is explored in O'Neill's short story in a new and very different way. This story packs in the angst of Mark, who has lost his beloved wife, his dilemma over choosing what he wants versus what he knows is right. This story is a well written, dark horror story that stays with you long after you finish it. O'Neill has a talent for painting pictures that draw you in - whether you want to go where he leads or not! Beware the dark paths this talented author creates because we all know that going down them comes with a price.Highly recommend!"}, {"userName": "Roy Huff", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/15061761-roy-huff", "userReview": "4.5 stars. Short, dark, and disturbing. This is only 4.5 stars because it was a little on the short side, but that's where my complaints end. This story is just creepy and dark enough to make it interesting, but doesn't try to be something that it's not. It feels authentic and has an intriguing take on insanity, love, and the undead. I don't want to give to much away, but if you like paranormal or horror, you will most likely enjoy this one."}, {"userName": "John Dolan", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/12447371-john-dolan", "userReview": "Fans of Shane O'Neill's 'Dracula Chronicles' will enjoy this short story.It contains the author's hallmark blend of horror, visceral violence and compelling narrative. I personally prefer O'Neill's writing when it contains more of an epic historical trajectory, but nonetheless I've rounded up my 4.5 stars to 5, and will be interested to see where he goes with 'Tales of the Black Sabbath'."}, {"userName": "Ashen", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/11112583-ashen", "userReview": "I thoroughly enjoyed Shane O'Neill's first foray into short, erotic horror. Understanding the roots of the story, and the inspiration behind it, I was interested to see how Mr. O'Neill would treat the subject matter, which has the potential of being either very creepy and frightening, or, at the other extreme, farcical. I am happy to say that Shane delivers a solid, well written short, giving us just enough of the background we need to keep the tale flowing, while managing to keep us away from the inherent sorrow that Mark Wiseman's situation engenders.The other aspect of this tale that pleases me so much is that it is well-written and, for a self-published work, well-edited. When there is so much dross around in the SP world, it is good to see that Mr. O'Neill is one of those few writers who cares about the work he produces, and that benefits both writer and reader alike.I am looking forward to more from Shane in this series."}, {"userName": "Christoph Fischer", "userReviewDate": "Oct 19, 2013", "userURL": "http://www.goodreads.com/user/show/13998364-christoph-fischer", "userReview": "“Orchid” by Shane KP O’Neill is a terrific horror short that really took me by surprise. The story begins low key at a Jewish funeral where Mark bemoans the sudden death of his wife Orchid. But a mystery figure offers him to bring her back, as long as the wife is not buried; a tough decision to make for the fresh widower.The story is dark, moody and written in an almost hypnotising prose that creeps slowly under your skin and stays there is an unsettling way yet you want to know what will happen. The scene is set with attention to detail and love for the genre, much in the style of the psychological horror of the Dracula movies. This is a very scary and well written short; very impressive!"}, {"userName": "Rebecca", "userReviewDate": "Aug 29, 2013", "userURL": "http://www.goodreads.com/user/show/14356900-rebecca", "userReview": "When feeling your most vulnerable losing the one person you cherish and love above all, dies. A stranger bewitches you with the words that your loved one can be returned to you. What would you do? That dilemma lands on Mark's shoulders and one he struggles to comprehend. A brilliant and twisted dark tale, which will have you double guessing. Superb."}, {"userName": "Kelly", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/29259230-kelly", "userReview": "I really enjoyed reading Orchid. It has left me wanting to know more about what happens with Orchid and her 'new lease' on life. Pain and grief make people do crazy things and this was a great example of that!! Awesome work :) cant wait to read more from this author!!"}, {"userName": "Mary Bargh", "userReviewDate": "Jun 04, 2013", "userURL": "http://www.goodreads.com/user/show/17869733-mary-bargh", "userReview": "I loved it!!It was shorter than I expected, but was a wonderful tale of love and loss with a bit of a twist.Suited to \"Tales from the Crypt\" lovers."}, {"userName": "Kevin", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/17340907-kevin", "userReview": "I knew for a long time this horror series was coming. Orchid was even better than I expected and was told it would be. The images in my mind reading this story were so vivid and real. I could almost feel the protagonist's tension and agony. It would be good now if the author would hurry up and get the next out there."}, {"userName": "Sheryll Barton", "userReviewDate": "Sep 22, 2013", "userURL": "http://www.goodreads.com/user/show/24159534-sheryll-barton", "userReview": "A very well written short story which kept me enthralled to the end. The author writes skillfully bringing the story to life. Definitely a book which you will find hard to put down."}, {"userName": "Tove Lervik", "userReviewDate": "Mar 23, 2014", "userURL": "http://www.goodreads.com/user/show/28845552-tove-lervik", "userReview": "Scary.. knew all the way through something bad was going to happen. Had to read all of it at once. It takes a good story to catch me that way. I have never read horror before so I didn't know what to expect but I think I will read more such stories after reading this one. I could understand Mark's reaction and the choices he made. He didn't have much time to make that decision and he knew it was wrong. I was sitting with my heart in my throat at something of the things that happened. This writer is really mean to his characters. It was very good and I would recommend. I will read the next one."}, {"userName": "Brandt", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/16412973-brandt", "userReview": "What a great introduction to the work of this author. Orchid (Tales Of The Black Sabbath Book 1) byShane KP O'Neill is gripping! The concept got me interested. I mean we’ve all lost someone, what would we do to get them back. The author took the premise and delivered an intense story. This line still echoes in my head, “‘Do not let them bury her,’ he repeated his voice firm and cold.” I can’t wait to read more of his work."}, {"userName": "Doug Lamoreux", "userReviewDate": "Mar 18, 2016", "userURL": "http://www.goodreads.com/user/show/5817128-doug-lamoreux", "userReview": "I wish those who don't read could relinquish their free time to those of us who do read but don't have enough time to read. Orchid has been on my TBR list for a long while, and I just got to it. It was a quick, fun, and entertaining read that I should have gotten to much sooner. From the graveyard, to the pit of the rain soaked grave, to the appearance of a sinister cryptic character, to all that comes after, Orchid is an enjoyable short story worthy of the genre label 'Horror'. Nicely done, Shane KP O'Neill."}], "description": "**Note** This is a horror short story.Imagine, if you will, the dread at losing the one you love - when all that you hold dear is suddenly, and inexplicably, taken from you. And then, when all seems lost and nothing can lift the darkness threatening to consume you, a stranger walks up to you and says he can restore all you have lost. What would you do? Could you resist that last glimmer of hope?This is the dilemma facing Mark Wiseman. While standing at his wife's graveside and looking down on her casket, a man tells him he can give her back to him. Should he let her go? Or should he accept the offer to be with his beloved once again? For such things carry a price and is it a price he is able to pay?", "title": "Orchid\n      \n          (Tales of the Black Sabbath #1)", "url": "https://www.goodreads.com/book/show/18000394-orchid", "average": 4.73, "cover": "https://images.gr-assets.com/books/1369950006l/18000394.jpg", "reviews": 18, "authors": [{"url": "https://www.goodreads.com/author/show/6580373.Shane_K_P_O_Neill", "name": "Shane K.P. O'Neill"}], "type": ["Horror", "Short Stories", "Occult", "Gothic", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/18000394-orchid", "http://www.goodreads.com/book/show/18777760-for-whom-the-bell-tolls-vlad-dracula-1", "http://www.goodreads.com/book/show/22877148-bound-by-blood-bound-by-blood-1", "http://www.goodreads.com/book/show/16233465-bound-by-blood", "http://www.goodreads.com/book/show/20739386-birth-of-the-monster", "http://www.goodreads.com/book/show/21524199-the-path-to-decay-vlad-dracula-2"]}