{"ratings": 260, "userreviews": [{"userName": "Eila", "userReviewDate": "Aug 23, 2014", "userURL": "http://www.goodreads.com/user/show/31677732-eila", "userReview": "I have expressed this in past reviews, but I'm going to say it again-- the most important part of any story, to me, is character development. That means I get to know the characters well enough to form an emotional connection to them. Sometimes the connection is negative, sometimes it is positive.The Orphans is a book that satisfies my desire to grow attached to the characters perfectly. The story starts out with a very brief introduction of two of the main characters in the midst of firing at a large group of zombies. Then, Mike Evans does something somewhat unique; he spends the rest of the book telling the story of the main characters and the events leading up to the apocalypse. By the time I finished The Orphans, I knew the complete story behind the spread of the zombie outbreak, I got to know the characters thoroughly, and I grew to care about them. In addition to Evan's impressive ability to build up his characters, he's also a talented writer. He has a natural gift for the craft, with a style that is straight-forward. He doesn't add unnecessary descriptions or dialogue. He seems to know his audience and delivers a story that flows with consistency, making it a fast-paced and enjoyable read.The author is currently working on the second book in this series. I will definitely be picking it up as soon as it is published."}, {"userName": "Kya Aliana", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/8003940-kya-aliana", "userReview": "The Orphans by Mike Evans5/5 starsAs many of you know, I not only avidly devour YA zombie fiction, I write it as well. That said, this review should have a major impact when I say: It doesn’t get any better than this! I repeat: It doesn’t get any better than this!Mike Evans’s debut novel is shocking to the core. His strong and eminent voice is prominent and never wavers throughout the book. This is a huge step up for YA Zombie fiction everywhere. It’s truly incredible how Evans perfectly captures the essence of teenagers. He impeccably illustrates how they think, act, and mature through heavy and intense situations and experiences, all while interweaving their emotions and relationships with each other. This is something that I see and hear every author struggling with; Mike Evans voice is clear and his perspective is spot-on throughout each chapter.The Orphans offers a plethora of thrills. This book has it all, excitement, danger, love, conflict, resolution, developing relationships, struggles, and all executed in a way that feels real. I found myself immersed in the story as opposed to removed and reading it. Evans flawlessly showcases the zombie apocalypse in a refreshing, new, and riveting manner. It’s not just your every day zombie story; it goes oh so much deeper! So profoundly deep that I say every author can learn something from his style and every reader will appreciate the hard work and detail that went into this story.The descriptions are off the charts! I felt like I was right there, living out a vivid memory or even simulation. I could picture everything within the character’s radius, I could feel what they felt, smelled what they smelled, I was there with them… I was the character!All of the characters soared far above and beyond my highest expectations for a novel, especially a YA novel. I could easily relate to these characters and even see pieces of myself in them. I felt as though they not only could easily be my friends, but that they were my friends. It wasn’t difficult at all to put myself in their shoes, and that included ME in the story. How often do you get to include yourself in a story? Here’s your chance. These characters grip your heart from the first chapter, and they cling on through the end.This is a story of epic proportions; one that you will NEVER forget. After you read the last page, you will find yourself clambering around, restless, and craving more! If Evans miraculously finished and published the sequel tomorrow, it wouldn’t be fast enough for me! I’ve never devoured a book in this manner… I was absolutely distraught when my Kindle battery died on me… I HAD to find out what happened next. It wasn’t a want, it was a need, and I was going to do anything to make sure I read the next chapter.This is not just another zombie story: This is a story about YOUR high-strung emotions! This is a story about life, relationships, hardships, heart-pounding situations, and so much more. This is a story that YA readers of all ages will appreciate and relate to. This is a story to be remembered, a book to passed down from generation to generation. This is a story that questions how far you would go, and puts your heart to the test in a way that you never thought possible. You won’t be able to put this book down!Mike Evans is certainly an up-and-coming and rapidly rising prized author of YA fiction; setting a new standard for zombie novels of all worlds. This is a tale you will never forget… but in the words of Reading Rainbow “you don’t have to take my word for it”. Go on, go read it! I double-dare you! This will get your heart racing, your blood pumping, and your mind begging for more!THE ORPHANS: http://www.amazon.com/Orphans-Vol-I-e...Happy Reading,Kya Aliana"}, {"userName": "Stephanie Lunsford", "userReviewDate": "Oct 09, 2014", "userURL": "http://www.goodreads.com/user/show/14783992-stephanie-lunsford", "userReview": "This book is about more than just Zombies, it's about relationships between father & son, widower Dr. Frank Fox, who lost his wife, Marie to cancer,& his son, Shaun, who has a deep seeded anger towards his father for leaving him alone to take care of his mom while she was dying. He had to be the man of the house & grow up quicker than he should have. Frank & his new fiance, Karen. Shaun & Karen's daughter, Ellie.It isn't easy being a teenager but it's def. not easy when your dad starts dating the mother of the girl you love. After Karen tells Frank about her having cancer, Frank remembers his work from his time overseas when his 1st wife was dying of cancer. he tells Karen, I can come up w/a cure only thing is should Dr. Fox play God w/his \"cure\" for Cancer? Find out what happens when his assistant & partner gets involved & tries some things of his own.If you had a chance to save the one you love from dying a horrible death would you? would you take that chance even if it may not work & could turn into something else altogether? well buy this book & see what happens when Dr. Fox tries to save the woman he loves! Shaun will do anything to make sure Ellie is safe & will do whatever it takes to make sure she survives. what would you do to make sure your love survives?Mike Evans did a fantastic job of making each character being believable even down to the smart mouthed teenagers! He is truly talented & I for one can NOT wait for the next book because Mike also left me hanging to find out what happens next!!! Be sure to pick up your copy of \"The Orphans\" today! Come along for tbe ride of emotions of happiness, love, loss, sadness, joy, anger, depression & let's throw in some danger too! You ready for the ride of your life? Buckle up... It's gonna be a bumpy ride!!!"}, {"userName": "Tom Leeland", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/16745586-tom-leeland", "userReview": "By rhl Format:Kindle Edition|Verified PurchaseMr. Evans earned my five star review. As the name would suggest the outcome of the book does seem appropriate. Profound story telling no doubt about it. The 'Turned' is what the zombies are called in this book and these are not your old school variety \"Romero\" type. The correct amount of human element was met for me in the guise of the father \"frank\" and son \"Shaun\" who had a strained relationship that was filled with loss and tension that instantly had me caring about them both. Each chapter was like an interconnected small story that made the whole book come together seamlessly. original ways for the delivery of the virus that had more then one way of being spread. Attention to detail was strongly evident ,gore, backround and small things like mannerisms of each character was displayed in this authors writing. This story was fast paced and centered from beginning to end. I have to admit that i'm no writer so my knowledge about punctuation and grammar are nothing to brag about so when I say with the exception of one minor mistake in one sentence the rest of this book was edited flawlessly. I eagerly hope that another installment to come from Mr. Evans and his Orphans."}, {"userName": "Shannon Sharpe", "userReviewDate": "Aug 05, 2014", "userURL": "http://www.goodreads.com/user/show/13756704-shannon-sharpe", "userReview": "I liked this book a lot. I will certainly read the next as the author left you with just the beginning and needing to know what happens as this one starts out in the future, but shows you the events that led to where the beginning~ ends. Good story and heartfelt. Characters are relatable and the sarcasm with the kids were not over the top, but something I would hear with my own kids. Flow was smooth. Ending had me needing just a bit more to be satisfied where it left off and give it a 5 star. I am sure the author will get there with the next! Hurry and write!"}, {"userName": "Jett Cat", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/18277934-jett-cat", "userReview": "So, when is the next one due? I suppose that is the best way I can express that I enjoyed this book!I. will note, that it was a neat change to actually get to know what causes the \"zombie apoc\". Not that I have anything against not knowing, I just found that this was a nice twist on the genre. Great read for fans of the genre. I will, however comment that someone needs to get the next book out! Way to pull me in and leave me hanging!"}, {"userName": "Todd Burnett", "userReviewDate": "Jun 07, 2014", "userURL": "http://www.goodreads.com/user/show/13422972-todd-burnett", "userReview": "A must read for zombie genre fans, Mike's talent for graphic description is intense and the action is rather full throttle. Though not for younger readers due to the violent nature of the plot, the storyline works well and is peppered with humor and tragedy. I'd highly recommend it if zombies are your passion."}, {"userName": "Elizabeth Robbins", "userReviewDate": "Aug 07, 2016", "userURL": "http://www.goodreads.com/user/show/14433078-elizabeth-robbins", "userReview": "A scientifically plausible zombie apocalypse, with all of the back-story included. You will love and hate these characters, and cheer when some of them get chewed on. It took me almost a week to finish, because at heart I'm kind of a chicken. Couldn't listen alone, or before bed. Great story, and looking forward to the rest of it!"}, {"userName": "Miranda Reynolds", "userReviewDate": "Jul 30, 2014", "userURL": "http://www.goodreads.com/user/show/12350769-miranda-reynolds", "userReview": "Loved the book can't wait for sequel so much going on and so many different stories intertwined to all come together in the end for an amazing finale this was a page turner warning reader will lose sleep!"}, {"userName": "Carey", "userReviewDate": "Aug 07, 2014", "userURL": "http://www.goodreads.com/user/show/24745430-carey", "userReview": "What a great and different view of how and why a Zombie outbreak occurred. I usually don't like when a story bounces around different time frames, but this was so important to & and came at the perfect time for each part of the story. I'm looking forward to the next book."}, {"userName": "Laurie Mault", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/21523486-laurie-mault", "userReview": "Great storyThis book was a a different type of zombie book. The author was able to build his characters in such a way that the reader can connect. I really enjoyed this page-turner."}, {"userName": "April Jessee", "userReviewDate": "Aug 21, 2014", "userURL": "http://www.goodreads.com/user/show/23635258-april-jessee", "userReview": "This is a wonderful zombie book. graphic and detailed oriented with the complete story. loved all the characters and how the zombies came to be! all that will read this book will love."}, {"userName": "Mercelenid Odiott-oquendo", "userReviewDate": "Jun 12, 2014", "userURL": "http://www.goodreads.com/user/show/14490248-mercelenid-odiott-oquendo", "userReview": "Amazing!!! I couldn't put it down. So many twist and turns...and some tears. You will not be disappointed. A must read. Waiting for 2."}, {"userName": "Lisa", "userReviewDate": "Sep 30, 2014", "userURL": "http://www.goodreads.com/user/show/17206084-lisa", "userReview": "This was a great start to the series and I'm very much looking forward to seeing what the next installment holds."}, {"userName": "Rebecca Larsen", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/14068129-rebecca-larsen", "userReview": "5 StarsLots of action and plenty of unexpected twists and turns will keep you hooked. Just imagine combining Dawn of the Dead with The Walking Dead. Using just the best aspects of both, you would have The Orphans. Always expect the unexpected with Mike Evans as the author. Nothing is predictable, and no-one seems safe."}, {"userName": "Christy Thornbrugh", "userReviewDate": "Oct 14, 2014", "userURL": "http://www.goodreads.com/user/show/13960981-christy-thornbrugh", "userReview": "I really enjoyed this book a lot usually im a very slow reader but this book was great and i could not put it done finished it in 2 days as appose to my two weeks it would normal take. I love the fact that we got a story of how it all happen not just hey it was this and thats it nope he goes in to a lot of deatal to let you know how and when it happen There gore factor of it is great , i love the charters of the book as well I can not wait for book 2 to come out i am on the edge of my seat waiting for it.  I also think this book would make awesome movie"}, {"userName": "Trevor", "userReviewDate": "Dec 28, 2016", "userURL": "http://www.goodreads.com/user/show/63140838-trevor", "userReview": "If you are going to write a book where you make one of the the main characters prior military and a good portion involves the military, please at least take a couple of minutes and talk to someone. It was painful to read. The same goes for firearms, hunting, and cancer. I am usually pretty good at suspending my disbelief but to say things with such authority that are not true have to be called out."}, {"userName": "Alina", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/31927139-alina", "userReview": "I will just say that the author of this book looks like a really nice guy(we are friends on facebook) but this book is the work of a genius with a crazy twisted mind . This book has more depth that manny more other Zombie books that i read before. Ist complex and interesting. I loved each page!Go and read it!"}, {"userName": "Genesis Blue", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/5237122-genesis-blue", "userReview": "Very interesting read, though I kept expecting things to revert to the beginning of the story, which is foreshadowing . . . but it never happened. I guess that's later in the series, which I'm definitely going to be reading."}, {"userName": "BookLoversLife", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/4020075-bookloverslife", "userReview": "Do you ever wonder how or why does the Zombie Apocalypse start? I mean, I know how it usually starts in books or movies, but if it was real, how would it start? Well I think Mike Evans hit a home run with this because it's exactly the way I think it would start!! The government recruit some top scientists to create something soldiers could use in defense of chemical warfare, but things don't go as planned. Frank Fox was one of the scientists but was sent home before he could see the finished product. His wife had died of cancer and he had to care for his son. Years later, he meets a woman and just as he proposes to her, she tells him that she has terminal cancer. He can't lose someone else to this disease, so gets his research out from the time he was working with the government and decides to try to modify it so it can become a cure. Well... that's all I'll say about it!! Want to know what happens? Then go buy it.I find with a lot of the Zombie books I read, there is always an abundance of characters who are glossed over. I often find myself confused with what is happening to who, but not here. The author really took the time to let us get to know each and every character. We get to see how and why the outbreak happened and I loved that!! I loved that I became invested in them so quickly. I loved getting to see why someone would create something so destructive, why you would play God as such!! I pretty much loved everything about this!!The story is compelling, it's entertaining, it's captivating and I devoured it. The pace is fast enough to hold your attention, and as it starts with kids shooting Zombies, you know it's going to become more scary and intense. The author has created an amazing book 1 and I can't wait to see if all the rest are just as good. I'm invested in the characters and need to know what's going to happen with them :) In all, a well crafted and developed story. This author knows how to tell a great story and I need more!!! The narration is the only thing that brought this down. The narrator was...... boring. I don't know, he was reading it slow and with little inflection, plus he seemed to take a lot of pauses in the middle of sentences. It was quite frustrating to listen to and was almost a DNF for me. I ended up having to speed up his narration and it became just about bearable. By the end, it didn't annoy me that much!! I will listen to the next one and can only hope he will have grown as a narrator with each one. I was voluntarily provided this audiobook for free from the author, narrator, or publisher. This in no way affected nor influenced my thoughts."}, {"userName": "Sean Hammond", "userReviewDate": "Jun 12, 2015", "userURL": "http://www.goodreads.com/user/show/43913898-sean-hammond", "userReview": "I am a huge fan of zompoc indie authors. That being said, there is typically a certain amount of leeway that needs to be given. Not having professional editors and a ton of experience, characters tend to be a bit shallow - especially in the first book or two. Scenes are not always described in enough detail to fully immerse you in the environment and convey the image they had in their head when they wrote it. This is all before the plethora of grammatical and spelling errors. Don't get me wrong, I love these authors and their stories. It's practically all I read. Rome wasn't built in a day and that's fine.Occasionally there is an exception to this rule...Mike Evans has beyond proven his natural ability as an author and shattered the indie mold with \"The Orphans\". Though mildly predictable from the title, the run away freight train of a ride that ensues is anything but. As it continuously builds steam with every turn of the page, you'll find yourself holding on tighter and tighter.Character development is thorough and deep yet never boring. The dad who's \"never there\". The teen boy who is angry yet doesn't know the whole story. The cute, confused girl next door. In one way or another, we've all been there, done that and got the t-shirt. I think most readers will identify with at least one if not all of the characters in some manner. You'll find yourself on the edge of your seat pulling for these folks to make it through and mourn for their loss when/if they don't.This is all before we get to the zombies.The zombie genre is way over done in many aspects. All too often, it's a very predictable rehash. Evans has managed to bring new life to the undead. The origin story is quite interesting. Though we have all read time and again the lab experiment gone wrong origin story, this one is different. From the reason it was created to how interwoven into the characters lives the story actually is, it's a fresh take on a story that's been retold too many times and it works.The zombies, or \"Turned\" as they are referred to, are equally as fresh as the origin. These aren't your typical Romero zombies. Fast and violent, there are no shamblers here to slowly creep towards our heroes while they sneak out the back. Every moment is an all out run for your life and you still won't make it affair.As you may be able to tell, I thoroughly enjoyed this book. It was an action-packed thrill ride that kept me up late on more than one occasion to see what would happen next. I am actually quite happy the next book was released just as I started reading this one so I didn't have to wait to experience the next gore filled chapter. I highly recommend this book to any fan of the zombie genre."}, {"userName": "Amie's Book Reviews", "userReviewDate": "Apr 25, 2016", "userURL": "http://www.goodreads.com/user/show/11232185-amie-s-book-reviews", "userReview": "~ I received a free copy of this audiobook through Audiobook Blast in exchange for an honest review. I have read A LOT of zombie fiction and it takes quite a bit to impress me - ORPHANS: ORIGINS did just that. When the audiobook first started I was worried that there would be nothing new in this audiobook and that I would be bored listening to it. My concerns were quickly put to rest as the story began to unfold.Frank Fox is a man who gave up his prestigious position as an army research doctor to raise his four-year-old son after his wife dies of cancer. Sounds noble right? Well, twelve years later, his son, Shawn doesn't think so. All Shawn remembers from that time is that his father was not there for Shawn or for his mother. Shawn is angry and feels that his father abandoned them. Shawn was only 4 years old and was left to care for his dying mother alone. You can't blame Shawn for feeling that way. Imagine a tiny four year old left alone to watch his mother (the Center of his life) wither and ultimately die. Obviously from what I just wrote, you realize that this book has much more depth than just your typical zombie story. I do not want to give too much of the story away, but I do want say that this book contains one of the most plausible explanations as to the circumstances of how the zombie virus originates that I have ever read. I think future readers will agree.Not only is there lots of action and some very scary scenes, but it also contains very believable human drama. The characters are well written and it is easy to visualize the people in the book.I rate this book as 4.5 out of 5 stars ⭐️⭐️⭐️⭐️ and I highly recommend ORPHANS: ORIGINS Book One to all lovers of zombie fiction. It is well written and the narrator does a terrific job and keeps listeners on the edge of their seats. The half star loss came from me being overly nit picky. There were a couple of pronunciation issues but nothing that was so glaring that it detracts from the story as a whole.I will be looking forward to listening to the next audiobook in this series. I am very interested to know what happens next with Shawn and his friends. To read more of my reviews, visit my blog at http://Amiesbookreviews.wordpress.com"}, {"userName": "Harold Cloninger", "userReviewDate": "May 28, 2016", "userURL": "http://www.goodreads.com/user/show/25074041-harold-cloninger", "userReview": "There seem to be two types of zombie stories. The slow methodical paced zombies that are scary as a mob, but not so much individually. And then there are the fast, extremely ferocious ones that you can't outrun. This book has the latter. There were several times I felt dread at knowing, no matter how fast you ran, these creatures were still going to catch you. At times there was a sense of hopeless inevitability. The author excelled at getting me to care for his characters. I empathized with Shaun a lot and to a lesser degree with the other protagonist Ellie. I had to keep reminding myself throughout the story they were only 13. They seemed so capable for their age. Had Mike not stated their age I would've put them closer to 16 or 17. With that said there were a couple throw away characters that didn't get much time to get to know before the inevitable happened. Granted they weren't major characters, but a little more time devoted to them would've made their deaths more meaningful.The story jumps back and forth in time and the dates are listed at the beginning of the chapters. The first time the story jumped to the past it was a little jarring because I hadn't paid attention to the dates, but after the first time I expected it and enjoyed the diversion and insights the past provided.I've read some reviews and there were a few complaints about the gore. I don't quite understand the remark as this is a zombie book. Did they expect butterflies and rainbows? Yes, there is gore. I didn't feel it was excessive considering the genre. I like the author's writing style as well. He's descriptive enough to give you an idea, but doesn't go into so much detail as to tell you exactly what to see. I prefer reading books like this. I loved Robert Jordan, but he'd spend three pages detailing a dress, when a paragraph would do."}, {"userName": "Eric Reeves", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/1211420-eric-reeves", "userReview": "I haven't laughed this hard while reading a book in many, many moons. At least during the first part of the book. Then it gets a bit more serious with bodies and zombies. Hard to be funny when you got all of that going on.The initial few chapters with dialogue between Ellie and Sean (hope I spelled those right...never saw their names, just heard them) were hilarious and gut busting, for me anyways! I could probably read endless chapters just listening to them go through life even if nothing else happened. Brilliant!The rest of the book I thought was very good as well. After the infection, it reminded me a lot of The Walking Dead (which I'm addicted to), except these zombies were much stronger and faster, hence, much more dangerous.I really enjoyed getting the backstory and hearing the progression of events that led to the outbreak. Lots of these apocalypse stories get into the meat too quickly and leave you wondering how all of this happened to begin with. It was put together very well and I thought it interesting to see the story being told through a bit of a back and forth timeline.Narrator (Jack Wallen, Jr.) definitely did the dialogue justice. He was spot on with the sarcasm and really did a great job with timing and execution of the punchlines. Outstanding job reading this book. I was very impressed and I'm going to look for more books read by him just because I thought he did such a good job.I'm very much looking forward to the next installment of this series to see how it progresses.I received a free copy of this audio book for an honest review."}, {"userName": "Michelle Bryan", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/28792679-michelle-bryan", "userReview": "From the first two pages of The Orphans: Origins, Mike Evans had me hooked. The opening scene is a bunch of teens on a rooftop fighting an exhausting battle against a horde of 'turned'. Two beautifully written lines at the end of the prologue lays the groundwork for what you are about to read. \"Thinking back to how it had all started, he brought out an old journal and pen. It was as simple as standing up for a girl and setting the fate of the world on fire.\" What a great intro! You cannot help but want to read more. You need to know what events took place that lead up to this and Evans does not disappoint in this aspect. The world building and back story are astounding! You get to know and fall in love with Shaun and Ellie long before any undead enter the picture. Shaun's unrequited love for Ellie, his unresolved issues with his dad, the bullying at school, every teen angst is covered and so well written. All the characters are written perfectly, right down to their teenage sass attitudes. When all hell finally does break loose, the action never stops. Evans plays with your emotions as he takes you on a nail biting rollercoaster ride into a nightmare world....and I enjoyed every moment of it. This is the first installment in the series and I will definitely be picking up book two. A well deserved 5 stars."}, {"userName": "Denise Keef", "userReviewDate": "Mar 02, 2015", "userURL": "http://www.goodreads.com/user/show/7004267-denise-keef", "userReview": "I am a big reader of zombie apocalyptic stories. When I had heard about The Orphans: Origins and read the blurb I knew it was one I wanted to add to my library. When I started reading it I couldn’t put it down! In the prologue we are introduced to two of the main characters who play a very important part in this amazing story and who, through the whole book, are brought closer and closer together. Mike Evans has written a very deep story with this one. It doesn’t just tell the story about a zombie outbreak, it also is about how the people are affected by it during the first stages of it. The depth of characters, the amount of detail, the total feel of this story will take you into the lives and feelings of each character and have you laughing and crying as you read more and more into this book.It is really hard to write this review and not give spoilers away which I never do because it would be very unfair to someone looking over the reviews, so let me just say this…if you like to read awesome stories about zombies and the people surviving the apocalypse, then this book is for you! You will not be sorry from the first page to the last because you will lose yourself in the pages and want more when that last page is turned! Do yourself a favor and pick up a copy of this amazing five star story and kick back and enjoy!"}, {"userName": "Kimberly Sandlin", "userReviewDate": "Jan 19, 2015", "userURL": "http://www.goodreads.com/user/show/39355597-kimberly-sandlin", "userReview": "Word can not describe how I feel as I finished this book tonight. I am so sad that it ended and can not possibly wait for the next book in this series to come out. The character development is amazing and you truly develop an emotional relationship with each character as they come to life before your eyes. The Orphans had me at times nearly in tears wishing that I hadn't really read what I know I just had. Other times it had me so angry at ones actions that I was literally cursing them... the rest of the time it had me talking out loud making comments such as dang, oh my gosh, or that was brutal. This is not my typical genre for books and to be more then honest when it was recommended to me I only started reading it because a friend of mine told me I would love it, I had my doubts but he was right! I am now a new fan of Mike Evans, he has a long lasting fan waiting as patiently as possible for more books from his insane yet beautiful mind. I highly recommend this book. Its such a great read and will definitely leave you begging for more!!"}, {"userName": "Tacuazin", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/4848727-tacuazin", "userReview": "I have mixed feelings about this one.For starters, the story takes forever to start getting interesting, although once it finally does, it´s quite good, grasping you and not letting you go.But throughout the entire book I was really bothered by the characters and their inane conversations. The main adult protagonist, Dr. Frank Fox, is basically and arrogant ass and a shitty parent. The son isn´t much better, admittedly, and spends the entire book whining for one reason or another. The women are either damsels in distress or harebrained children. I don´t think this book would pass the Bechdel test for movies.I guess I won´t continue with this series."}, {"userName": "Trisha Perry", "userReviewDate": "Sep 17, 2016", "userURL": "http://www.goodreads.com/user/show/18046858-trisha-perry", "userReview": "Frank Fox a scientist still broken from loosing his wife eight years ago, he will do anything to save the new love of his life. So when his lab partner tells him his new prototype drug works, he takes his word for it and uses some on his fiancée, who only has hours left in her fight with bone cancer. But really, what have the two scientist unleashed?This is not your typical zombie story - it is way better and really, maybe it could happen. This is such an awesome start to a action packed series. Book one Origins is just that, the start, and I can't wait until I can get book two and more. I had the audio narrated by Jack Wallen Jr. who was awesome! He made each character come alive with a voice of his or her own, and that really made the book great, I will continue on with the audios."}, {"userName": "Nicky", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/4348813-nicky", "userReview": "This book was ok (it was a no cost first in series). I'm assuming it was young adult as it read very young. It was interesting but slightly dragged out. I looked at the next installment but felt it was expensive for something only ok."}], "description": "In 2008 the government assembled a top secret elite group of scientists to develop a defense against chemical warfare during the US-Iraqi conflict. Frank Fox was one of the scientists. Eight years later, Frank finds love, but when he asks for her hand in marriage he learns she is dying of cancer. Frank sets out to modify the drug from the Army, determined not to lose her. Armed with what he thinks is the cure, when he gives her the drug the outcome is anything but what he wanted–hell is unleashed on society.", "title": "Origins\n      \n          (The Orphans #1)", "url": "http://www.goodreads.com/book/show/24925825-origins", "average": 4.33, "cover": "https://images.gr-assets.com/books/1445089303l/24925825.jpg", "reviews": 67, "authors": [{"url": "https://www.goodreads.com/author/show/8296859.Mike_Evans", "name": "Mike        Evans"}], "type": ["Horror", "Horror", "Apocalyptic", "Did Not Finish", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/24925825-origins", "http://www.goodreads.com/book/show/22437049-the-orphans", "http://www.goodreads.com/book/show/23120238-the-orphans", "http://www.goodreads.com/book/show/29230928-the-uninvited-1", "http://www.goodreads.com/book/show/25492685-surviving-the-turned", "http://www.goodreads.com/book/show/26760132-strangers", "http://www.goodreads.com/book/show/24505581-gabriel", "http://www.goodreads.com/book/show/31344939-the-stranger"]}