{"ratings": 17, "userreviews": [{"userName": "Walter", "userReviewDate": "Jun 16, 2017", "userURL": "http://www.goodreads.com/user/show/25109368-walter", "userReview": "John Chester Miller wrote this work in 1943. It's a history of the American colonies in the ten years prior to 1776, and it was dedicated to the Harvard fellows. So this book had all the makings of a very boring experience. Actually, nothing could be further from the truth. This book was very well written, with a vivid narrative and well stocked with quotes from period newspapers and letters. At times it is humorous, at other times it is profound. The best part of this book is that Miller really delved into the mentality of the American colonists as well as the politicians in the Mother Country. Miller examines all of the important events of 1765 to 1776, from the Sugar Act to the Stamp Act to the Deplorable Acts to the Boston Tea Party. He examines the interactions between the colonists and the English officials, and between the various communities within the colonies. The reader is left with an excellent understanding of the origins of the Revolution and why a population of English subjects would develop such an anger toward their own nation that they would declare independence from their own King and Parliament.I would highly recommend this book to anyone interested in US history and particularly the colonial/Revolutionary War period."}, {"userName": "Erik Graff", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/974210-erik-graff", "userReview": "Though dated, this is a serviceable introduction to the question of the causes of the revolt of the American colonies against the British crown."}, {"userName": "Jacqui N", "userReviewDate": "Feb 26, 2013", "userURL": "http://www.goodreads.com/user/show/17594557-jacqui-n", "userReview": "A very thorough and readable description of the events which led to the American colonies declaring independence from the \"mother country,\" beginning with the accession of George III and the end of the French and Indian War, to the signing of the Declaration of Independence in 1776'. The author's wry humor was prevalent all throughout the book and made for an entertaining read. Brilliant."}, {"userName": "Ellis Knox", "userReviewDate": "Dec 02, 2013", "userURL": "http://www.goodreads.com/user/show/3338358-ellis-knox", "userReview": "This is the hardbound 1943 edition"}], "description": "Origins of the American Revolution attempts to explain why the American colonists rose in rebellion against a government whose authority, less than fifteen years before the Declaration of Independence, they had helped to extend over a large part of the North American continent.", "title": "Origins of the American Revolution: With a New Introduction and a Bibliography", "url": "http://www.goodreads.com/book/show/2274878.Origins_of_the_American_Revolution", "average": 3.59, "cover": "https://images.gr-assets.com/books/1266691191l/2274878.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/82704.John_Chester_Miller", "name": "John Chester Miller"}], "type": ["History", "North American Hi...", "Military History"], "outlinks": ["http://www.goodreads.com/book/show/2274878.Origins_of_the_American_Revolution", "http://www.goodreads.com/book/show/7080030-origins-of-the-american-revolution", "http://www.goodreads.com/book/show/16638628-origins-of-the-american-revolution", "http://www.goodreads.com/book/show/143116.The_Wolf_by_the_Ears", "http://www.goodreads.com/book/show/453598.The_Federalist_Era_1789_1801", "http://www.goodreads.com/book/show/2842407-alexander-hamilton", "http://www.goodreads.com/book/show/98245.Sam_Adams", "http://www.goodreads.com/book/show/2747224-crisis-in-freedom"]}