{"ratings": 315, "userreviews": [{"userName": "Renita D'Silva", "userReviewDate": "Feb 27, 2018", "userURL": "http://www.goodreads.com/user/show/17336261-renita-d-silva", "userReview": "Beautiful, heartbreaking and thought provoking. Another wonderful story by this author, one which takes the reader on an emotional journey alongside the characters. I loved this stunning, wonderful tale of love and motherhood, friendship and family and highly recommend it to everyone."}, {"userName": "Trish at Between My Lines", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/15939692-trish-at-between-my-lines", "userReview": "I’ve consistently loved Sinead’s books. But I feel like she has toned down the ott humour, and notched up the feels. And it’s a winning combination for me.I loved all the colourful characters, and my heart agonised over the various obstacles that they had to crawl through.“Page turner” is an over used phrase, but very apt here! As I grabbed the book, and turned pages as quick as I could every chance I got."}, {"userName": "Monica Mac", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/46907893-monica-mac", "userReview": "I thoroughly enjoyed this book. It is a familiar enough story: a young woman finds herself pregnant and the father is nowhere in sight so she becomes a single parent. In this instance, she is pregnant with twins, which makes things tougher. She does, however, have a wonderfully supportive network of family and friends and they all rally around to help her. There are so many strong and interesting characters in this book that it really added to my enjoyment of the story. Lucy is a very strong woman and has brought up her children very well, but at what cost? She wants nothing but the best for them, always, and yet is her protectiveness and stubborn attitude that her children must strive for the top driving them away from her?This was a thoroughly modern tale of single parenthood and there are many times when I was surprised at the direction the story was going but it all made a lot of sense to me. I got completely emotionally involved with Lucy and for that reason, I think this book deserves 5 stars. Thank you to NetGalley and Bookouture. All opinions expressed in this review are entirely my own."}, {"userName": "Margaret Madden", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/21224317-margaret-madden", "userReview": "Review to follow..."}, {"userName": "Megan Jones", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/18958766-megan-jones", "userReview": "Lucy Murphy is a driven mother with the main intention of ensuring her twins have a better start than she did. Abandoned by their father early on in her pregnancy, and forced to leave behind her future career of a lawyer, she vows nothing will stand in the way of her children’s dreams. When the twins are given the opportunity to move to a prestigious school all Lucy sees is the glittering future lying in wait for them. But Lucy is confusing her thwarted ambitions with what her children really want. Lucy is blind to the risks of forcing her children into a future they may not want. Until it is too late.I found this a book of multiple sections. I loved the first part where we learn about the situation Lucy found herself in when pregnant, this was very enjoyable, highly emotional and really grabbed my interest. Then we skip forward to when the twins are moving to their new school, we see them fight to fit in and grapple with the future their mother has set out for them. Here my interest waned a little, not massively but a little bit, the drama drops off to begin with which was a shame and I did struggle to maintain interest. However Moriarty does pick the plot pace back up and towards the end my interest and enjoyment picked up again.Before I say anything else, I have to say this reads a bit funny, I cannot quite put my finger on why but at times this reads like a true story article from a magazine, unfortunately for this book it does not work and it made the reading quite stunted which was a shame. Negative aside, I thoroughly enjoyed, if this is the right word, Kelly’s plot thread. I will not detail it for fear of giving it away, but it is with Kelly that the majority of my interest and enthusiasm for this book went. Her plot is incredibly emotional, raw and I have to say Moriarty writes it extremely well and sensitively. The other plot threads are good as well but they do not have the power that Kelly’s plot thread held for me. As well as this I thoroughly enjoyed the characters that Moriarty has created, they are incredibly likeable, realistic characters and it was a pleasure to immerse myself in their world for a short time.‘Our Secrets and Lies’ is an enjoyable, emotional, realistic read from Moriarty but not her best for me. There are moments where not a lot is going on and my interest died down, having said I loved the characters and I finished this feeling like I had a new group of friends."}, {"userName": "Peg", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/14963713-peg", "userReview": "4.5 starsOur Secrets and Lies is an inspirational, heartbreaking and touching story. This novel gripped my heart, sparked my anger, moved me to tears, and made me smile. Lucy was soon to be a single parent, and her heart was broken. Tom, the father of her unborn twins, had abandoned her. He left her alone to deal with the fallout, including informing her parents of her pregnancy. Tom was crazy about Lucy. The last thing he wanted to do was to listen to his father and leave the country. But, that’s exactly what his father demanded. And if Tom didn’t want to be cut off from his family, he had to listen to him.Tom’s father humiliated and verbally abused Lucy. She was crushed. Lucy decided to make it her life’s mission to prove that Tom’s father was wrong. Lucy was not the lowlife that he made her out to be. So she gave up her dream of becoming a successful lawyer and devoted her life to raising her children and caring for her parents. Although Lucy was a loving mom, she was intense and obsessed with her children, Dylan and Kelly. She didn’t realize that the pent-up anger that she’d carried for years, after being abandoned and humiliated, drove her to become overbearing with the twins. But, because of her micromanaging, Lucy almost lost them. Unconditional love requires sacrifice and often the willingness to let go. Lucy discovered this the hard way. Painful lessons are never fun, but, it’s through them, that hearts, and lives, are changed. They are also the lessons that are rarely forgotten. Sinead Moriarty writes a compelling, gripping and an emotional story. I loved it.Thank you, Bookouture Publishing and NetGalley, for my advanced review copy."}, {"userName": "Kathy ", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/8254902-kathy", "userReview": "Though a good student, Lucy Murphy walks away from the hope of a promising career as a lawyer when she finds herself pregnant with twins. The father of the children, pushed by his own father, deserts Lucy in this time of need. Thus, Lucy raises the twins, Dylan and Kelly, alone. What Lucy does not realize is that her pent-up anger at her lifelong situation has become a major part of her life. She loves her children but has become too intense and over bearing. Can Lucy figure out what she is doing to her children in time to not lose them?This is a good book about relationships. Lucy, though a bit too much, was obviously a solid, loving mother, who only had her children’s best interests in mind, whenever and whatever she did for them. However, she became so obsessed that she almost lost them. I did not like the father of the twins, who abandoned Lucy during the time she needed him the most, or his father, who refused to accept the fate of his son and Lucy’s pregnancy, banishing his son because of it. The story is not an unusual one, and I did like the fact that Lucy had a strong support system. As the story unraveled, I could feel the emotional grip it began to have on me, as I read along. This is the first book I have read by this author, but will now pursue more by her, after reading this one. I received this from NetGalley to read and review."}, {"userName": "Angela", "userReviewDate": "Mar 05, 2018", "userURL": "http://www.goodreads.com/user/show/5871618-angela", "userReview": "I liked it. For about half of the book it the focus on Lucy and the events that led up to her deciding to have the baby and keep it and then the book fast forwards and we get to see snippets of the major past events but mostly focuses on the the present and how her kids are doing in school. Lucy changed and not for the better though from all accounts she did well with raising her kids without a father figure in their lives (grandpa apparently doesn't count). There's some bullying involved and some drama but it's not over-the-top-suspends-belief-and-wrecks-the-book type of drama. Its used to build things up for a main event in one of the character's lives and without it being there the event wouldn't have had as much impact as it did. For fan's of the author I'd recommend the book, while its not as good as some of her other books it's still a good read."}, {"userName": "Savanah Rae", "userReviewDate": "Mar 03, 2018", "userURL": "http://www.goodreads.com/user/show/3382033-savanah-rae", "userReview": "I received this book for free from Netgalley in return for my honest opinion.I've never read anything from Sinead Moriarty but I really enjoyed this book and will look for more books from her. Lucy is in college when she meets Tom. She wants to be the top lawyer in her class. She wants to be successful. Unfortunately for her, she becomes pregnant. She wants to keep it but Tom's father sends him away and tries to force Lucy into getting rid of her child.Tom goes away and Lucy is forced to raise her children on her own. Her parents help her but she never does become a successful lawyer. She does the best she can for her twins.Kelly and Dylan are enough for Lucy but is Lucy enough for Dylan and Kelly?Kelly wants to find her father but Dylan could careless.This book is based off of lies and secrets for sure!!Such a good book!! I loved it and highly recommend it."}, {"userName": "Ellen", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/7134495-ellen", "userReview": "Lucy is a top student with plans to complete legal studies and possibly be first in her class. Lucy becomes pregnant and faces difficult decisions which impact her future. Feeling the pressure to be perfect, Lucy has unrealistic expectations for her own children, without realizing what is truly going on in their lives. The female characters in the story are all strong and supportive. Family relationships are complicated and are at the heart of this book. I recommend for fans of women’s fiction"}, {"userName": "April", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/6419632-april", "userReview": "I'm sorry to say I did not enjoy this book. I really did not like Lucy, not even at the end when she wised up. The book dragged for me. After already reading one of Moriarty's books, I was aware of her liberal side. I was taken aback by her attack on Melania Trump, and our President of the United States. It was disgusting! Why can't foreign authors leave American politics out of their books. I read Irish novels because I have some Irish roots. And after visiting the country I fell in love with it. I will not read another book by Moriarty!"}, {"userName": "Helen Tamblyn-Saville", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/69285734-helen-tamblyn-saville", "userReview": "I'm a long time fan of Sinead Moriarty and she deals with heavy subject matters just as well as she writes chick lit.Although I do find her writing almost child like at times, she has a knack for bringing humour and warmth into even the most difficult subject matters. Our Secrets and Lies didn't disappoint and I found myself cheering on the leading lady Lucy, sympathising with Tom and sobbing my heart out on the train.Sinead is a great story teller and this is one that I will be dipping back into. Her writing may seem basic, but she is skilled at drawing emotion from readers."}, {"userName": "Mary Thomas", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/12956720-mary-thomas", "userReview": "Thanks to Netgalley for my copy.Lucy has her hopes and dreams for a glittering career shattered when she has an unplanned pregnancy. She becomes a single mother with the support of her family.She pins all her hopes on her twins for them to live out her unfulfilled career. She is ultra strict and very controlling.I had such a dilemma with this book. Whilst I liked the family dynamics and enjoyed some characters I really could not engage with the character of Lucy at all. I just didn't understand the reasoning for her decision making and reasoning."}, {"userName": "Kathleen Gray", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/16056426-kathleen-gray", "userReview": "Well done drama about a woman who basically lives through her children. Talk about a tiger mom! Dylan and Kelly bear the weight of Lucy's disappointment at having to give up her own dreams. Simplistic but true. It's not until the twins are 17 that things come to a head. I felt for everyone in this tale, except Tom who is a dope. It's a nicely written quick read that will make you shake your head more than once. Thanks to Netgalley for the ARC."}, {"userName": "Lisa", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/5671811-lisa", "userReview": "I really enjoyed this story and the way it unfolded. The characters were well developed and relatable. There was an authenticity to the lives and love of the families involved in the story. I am hoping that this story will continue into another book as there is so much to discover with this family. I would recommend the book! I look forward to reading more books by this author!"}, {"userName": "Erin", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/3261315-erin", "userReview": "Thanks to Netgalley for an advanced copy of this in exchange for my honest review. A great quick read. I really enjoyed the characters in Our Secrets and Lies and it was well written. Family dynamics and secrets along with our own hopes/fears all come to a head in this novel. This book made me laugh and cry -- very well done!"}, {"userName": "Mark Kreminski", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/37035310-mark-kreminski", "userReview": "Ok readI don't generally review the books I read. I would not recommend. The comments about The President of the United States and The First Lady were offensive and did not relate to the story. Will not choose to read anything else from this Author. **"}, {"userName": "Candy", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/12185655-candy", "userReview": "Not a bad story, but nothing new, woman gets pregnant and bloke runs off, she has to deal with it all alone. I didn’t like the main character I thought she was really selfish. But she comes through in the end.But all in all a good read 8/10"}, {"userName": "Leona", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/9731833-leona", "userReview": "Another brilliant book by this talented author. I loved it."}, {"userName": "Oonagh Considine", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/36409807-oonagh-considine", "userReview": "Absolutely brilliant!! A complete page turner! Very funny at times. Definitely recommend this book to people!"}, {"userName": "Noreen", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/9427462-noreen", "userReview": "A nice easy read. Lovely, likable characters."}, {"userName": "Christine Hulsman", "userReviewDate": "Apr 25, 2018", "userURL": "http://www.goodreads.com/user/show/75842225-christine-hulsman", "userReview": "it was brilliant"}, {"userName": "Lynette", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/7561175-lynette", "userReview": "Easy readEven though I love this author, I wasn't crazy about the end, it was a good story, but would have been nice for more stuff to be resolved"}, {"userName": "Sarah", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/2059534-sarah", "userReview": "Heart warming Hard to put down. Great story about love hate and everything in between. A mother wanting only the best for her children and the rocky path to get there."}, {"userName": "Terry", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/9020661-terry", "userReview": "5/18/18"}, {"userName": "D", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/29650960-d", "userReview": "So soThe story was very predictable. I dislike any political views in books, ruins the entire book for me. Not my type"}], "description": "Can a mother be true to her children if she cannot be true to herself?Having her son and daughter at 21 forced Lucy Murphy to walk away from a glittering future. They are the loves of her life and she is determined that they will have wonderful lives.So a scholarship to a prestigious school seems like a golden opportunity for the twins, the fulfilment of every wish Lucy has for them. But Lucy is confusing her thwarted ambitions with what her children really want. After all, seventeen-year-olds have dreams of their own, dreams they cannot always share with their mother.Until catastrophe strikes, Lucy is blind to the cost of forcing her own wishes on the twins, particularly her sensitive daughter. To have any hope of surviving as a family, all three will have to face up to some surprising and difficult truths ...Our Secrets and Lies is a moving, gripping and thought-provoking story about a mother learning the hardest lesson of all - how to let go of her children and how to live without them.Praise for Sinéad Moriarty'A heart-warming and a heart-breaking story, beautifully written and sensitive' Woman's Way'A fascinating exploration of difficult subjects ... Moriarty writes with compelling authority' Irish Times'There is warmth and heart aplenty in this delicately told story' Daily Mail'OMG! I'm an emotional wreck after reading this novel, probably not helped by the fact that I pulled an all-nighter to finish it ... I just could not put it down' Eileen Dunne, RTÉ'Heartfelt and deeply moving ... I couldn't put it down.' Susan Lewis'We ate this fabulous story up - 4 stars' Heat magazine'Intriguing and thought provoking ... a great read.' Katie Fforde'Gripping and thought-provoking - I was desperate to discover how it would pan out!' Paige Toon", "title": "Our Secrets and Lies", "url": "http://www.goodreads.com/book/show/35942788-our-secrets-and-lies", "average": 4.09, "cover": "https://images.gr-assets.com/books/1514977117l/35942788.jpg", "reviews": 27, "authors": [{"url": "https://www.goodreads.com/author/show/749455.Sin_ad_Moriarty", "name": "Sinéad Moriarty"}], "type": ["Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/35942788-our-secrets-and-lies", "http://www.goodreads.com/book/show/38229169-our-secrets-and-lies", "http://www.goodreads.com/book/show/327369.The_Baby_Trail", "http://www.goodreads.com/book/show/2461610.In_My_Sister_s_Shoes", "http://www.goodreads.com/book/show/11872945-me-and-my-sisters", "http://www.goodreads.com/book/show/22031405-the-secrets-sisters-keep", "http://www.goodreads.com/book/show/604599.From_Here_to_Maternity"]}