{"ratings": 26959, "userreviews": [{"userName": "Mo", "userReviewDate": "Jul 19, 2013", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "As good, if not better the second (or maybe it is the third) time around. #Ilovemattfarrell.\n EXQUISITETORMENTINGMAGIC\nYes, this book had it all. It was epic. Won’t say too much about it and won’t give too many quotes as it just needs to be read and felt…. This is my first contemporary by Ms McNaught. I have read her Historicals and they have been solid, five stars for me. This book was written nearly 25 years ago. Does it seem dated? A little bit, the fact that there are no mobile phones, some of the descriptions of the dresses etc. But it does not take away from the fantastic writing and characters in the book.Loved the two main characters, Matt and Meredith.Matthew Farrell, the farmboy, from Indiana, with his Irish roots …Meredith Bancroft, the Princess, living in the mansion, attending the Country Club…They meet, the attraction is instant. But theirs is not a straightforward Happily Ever After.It is set in Chicago, actually the last few books I have read have been set in Chicago, is this an omen that I must return to visit this wonderful city!This is their story, it spans about 12 years, from when she is 18 until she turns 30. It is a long book but well worth it. I would highly recommend it.\n I have the strangest – the uneasiest – feeling,” she admitted, lifting her head and looking at him with unguarded candor, “that something is happening, or going to happen, and it’s terrible. Whatever it is, it’s terrible.”"}, {"userName": "Sophie ♥", "userReviewDate": "Feb 19, 2013", "userURL": "http://www.goodreads.com/user/show/14918997-sophie", "userReview": "Rate: 500 million stars“If you'll kiss me back,\" he whispered huskily, brushing his lips along the curve of her jaw, \"I'll make it sixmillion. If you'll go to bed with me tonight,\" he continued, losing himself in the scent of her perfume and the softness of her skin, \"I'll give you the world. But if you'll move in with me,\" he continued, dragging his mouth across her cheek to the corner of her lips, \"I'll do much better than that.\"Unable to turn her face farther because his arm was in the way, and unable to turn her body because his body was in the way, Meredith tried to infuse disdain in her voice and simultaneously ignore the arousing touch of his tongue against her ear. \"Six million dollars and the whole world!\" she said in a slightly shaky voice. \"What else could you possibly give me if I move in with you?\" \"Paradise.\" Lifting his head, Matt took her chin between his thumb and forefinger and forced her to meethis gaze. In an aching, solemn voice he said, \"I'll give you paradise on a gold platter. Anything you want— everything you want. I come with it, of course. It's a package deal.\" Meredith wallowed audibly, mesmerized by the melting look in his silver eyes and the rich timbre of his deep voice. \"We'll be a family,\" he continued, describing the paradise he was offering while he bent his head to her again. \"We'll have children ... I'd like six,\" he teased, his lips against her temple. \"But I'll settle for one. You don't have to decide now.\"AHHHH! This review probably won't make sense because I have so much to say about this book and right now I am just so incredibly emotionally overwhelmed to think straight. First, Judith McNaught is officially my author of the moment. Her writing style is perfect for me and I've already planned to read all of her books (every one I can get me hands on). Since Lisa Kleypas, I haven't read many authors I've liked but now I've finally found one!Okay. I don't know how to say this but this book was almost the most perfect thing I've ever read - an exciting, frightening, stressful, horrible, joyful, tearful, painful and satisfying rollercoaster of a read. I was so emotionally distraught and actually on the verge of a heart attack towards the end of the book that I had to skim through to the happy ending then I forced myself to go to sleep to get some rest before going back and re-reading the last 60 pages when I was a lot calmer the next day. I'm writing this to try and let you understand what this book did to me (I know I sound like a madwoman but all of this is true).Although this book is contemporary the beginning reminded me so much of a historical romance and it really embodied what I love about historicals - the sweetest young love followed by a destructive heartbreak that is definitely reminiscent of Romeo and Juliet. This novel is divided into 3 parts - 14-year-old Meredith, 18-year-old Meredith and 29-year-old Meredith. We follow her through childhood, adolescence and adulthood which makes Paradise seem like the book version of a TV series (for those of you who don't know, this book is 700+ pages which is really long for a romance novel). The length of the book allowed us to fully appreciate and understand the development of each character. I would compare this book to a long journey - one that really makes you feel. I'll be the first to admit a lot of my feelings during reading this book weren't positive and it is for this reason I'm describing it as \"almost perfect\". I don't have complaints about the length of this book but there is no way you can start this book and not finish it before you go to sleep but because of its length, you're forced to spend the whole day and night reading which sort of fatigues you and you start to lose appreciation for it towards the end. I'd love to read this book again and I know that it will be a much less intense and more enjoyable experience. I know I'm going to disappoint a lot of you when I say this, but Paradise came SO CLOSE to becoming my all-time favorite book and I was thinking it would definitely end up being number one when I read the beginning but in the end I just can't give the book that title. Even though it was beautiful I was so frustrated by Meredith too many times in the book and her lack of complete trust in Matt throughout most of the book had me knocking off small fractions of a star in its rating. That's really my only complaint. I would have liked to see Meredith show more faith in Matt and allow me to fully believe that she deserved him. She did in the end but her doubts before that left me slightly upset. Matt was the perfect hero. He is the perfect man to lead this book and much of the book's perfection is cause of him. God I loved him so much and I found myself feeling wretched and heartbroken for him repeatedly. He got his happy ending in the end but I wished he didn't have to suffer so much for such large parts of the book. I really wished that Meredith would just trust him and love him always like he deserved to be loved.On a concluding note, I still love this book with all my heart. Paradise is a story I'll be reading again for sure and I'm forever going to be glad I decided to give it a go. I'll definitely be looking forward to keeping y'all updated with what I think of her other books."}, {"userName": "◆ Anna's ƦªϻƁℓℹռg$ ◆", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/22324639-anna-s-g", "userReview": "NO IDEA HOW MANY STARS3.5 MAYBE?For the love of God, I can’t decide if this book is brilliant or just ridiculous.I was so excited when I finally put my hands on it because I had heard so many great things about it. Because of that, my expectations were \ntoo very\n high.I can't exactly say I was disappointed because I did like the story. If you compare it to some of today's romances, this is a WORK OF ART.It has an interesting, engaging and charming storyline (albeit at times ruined with too many details and unnecessary twists, ridiculous misunderstandings and mood changes, but let's not split hairs on that because it is still a very good storyline).The characterization is well-done, although you can’t really avoid getting to know the characters and understanding their backgrounds, backstories and personalities after 700+ pages. And boy was this book LONG (and I’m not talking about the number of pages). I’ve read a lot of books that are even longer than this one but they didn’t feel so long and exhausting. But let's not split hairs on that either, I would choose a long book over a novella any day.The writing is very good, albeit with a touch of cheese here and there. Again, let's not split hairs. HOWEVER...A few things rubbed me wrong. On that, I MUST split hairs:<<<<<<<< WARNING: MILD SPOILERS AHEAD! >>>>>>>>#1 The underlying message that ONLY women are responsible for keeping themselves AND their partners protected during sex?It made me a bit angry but seeing as this book was written in 1991, I decided to turn the blind eye. #2\tCheating like it’s nothing. Now \nTHAT\n pissed me off. The heroine cheats on her fiancé with the hero. You won’t feel shocked or mad because, let’s be honest, it’s just Parker, her fiancé who is as attractive and exciting as a dead fish. And the author will make you feel okay with it because the heroine doesn’t really love her fiancé. A Fun Fact: Even boring, dull, uninteresting and unloved people are human beings and have feelings.#3\tHere comes the point where I have to say something about our lovely heroine. I didn’t like her. At all. The harder the author tried to portray her as wonderful, beautiful, modest, beautiful, kind, smart, beautiful (yes I know I’ve already mentioned it twice, but she really WAS extremely beautiful), the more I disliked her. NO, SCRATCH THAT. I liked her a lot in the beginning. Then I sympathized with her and started to love her.Then I admired her. Then, around the middle of the book, just when my love and admiration was on the verge of developing into true adoration I started to dislike her. I just couldn’t connect with her anymore. She was so prim and proper and stubborn. And indecisive. Boy did she grate on my nerves sometimes.And geez, how much more groveling was the hero supposed to do? He basically spent the second half of the (700+ pages long) book groveling for something he was not guilty of.And all that waiting…for them to meet for the first timefor them to meet eleven years afterfor them to admit their feelings for each otherfor her to stop being so stubbornfor all the stars to alignfor them to finally get together.And I’m not talking about the slow burn, you know that delicious anticipation, building up of tension, palpable chemistry bubbling and boiling, ready to explode.BUT WHATEVS…This book was written a long time ago and I’m almost sure I would have rated it 5 stars if I had read it when it was first published.Putting aside all those issues (because no book is ever flawless and perfect), I still enjoyed it a lot, and I still think it is worth reading. After all, there are parts in this book that I really loved and that will stay with me forever.So back to my rating. In my opinion, the first third of the book deserves 4 stars, the second third 5 stars and the last third 2 stars. But like I said, I'm still not sure about the rating and I may change my mind about it. I just need a day or two to to clear my head."}, {"userName": "Mona", "userReviewDate": "Oct 08, 2012", "userURL": "http://www.goodreads.com/user/show/6013607-mona", "userReview": "*For such a long ass book, I'm keeping this review short*My first thoughts on reading a 709 page long book...WTF?After some 'encouragement' from my buddy Effie... I decided what the hell, I'll try it out or get chopped up.Well it was the BEST decision ever...Epic FUCKING read!!It starts out interesting and simple, then builds up. Then...shit seriously got real after page 80!Then more...It has so much unexpected surprises that got me so excited. Thinking finally its going to all work out...Only to leave me highly emotional, experiencing palpitations, anxiety...And an extreme urge to murder one particular motherfucker...This book had it all, from drama, second chances, sweet love to unbearable sadness and forgiveness. Even awesome, strong willed characters. Its...beautiful. And left me wanting more! I know, crazy after 709 ages :S People go read this book, its amazing..."}, {"userName": "Didi", "userReviewDate": "Dec 01, 2012", "userURL": "http://www.goodreads.com/user/show/6082482-didi", "userReview": "[Meredith's mom was rushed as well as her reconciliation with Meredith's father--I felt it deserved much more than a brief paragraph of intention--I also felt the story couldn't handle yet another plot twist (hide spoiler)]"}, {"userName": "Lady Raven RAVE!", "userReviewDate": "Feb 05, 2011", "userURL": "http://www.goodreads.com/user/show/4930778-lady-raven-rave", "userReview": "Story: GREATIntimacy Level: NICE/GOODEnjoyment: GREATLength: 708 pagesStyle: Contemporary Romance ( Re Read)TRUE STORY!!! I had this sitting on my book shelf for 3 years since 2002 and never read it until 2004, not because I didn't have the time, but because I thought it didn't sound interesting and wondered what can a romance author write within a 708 page book, like come on seriously. I had read a couple books prior by the author, but they were historical. But then I wanted something to read, so.... I was desperate and decided, why not read the Big BOOK as I called it. And to my surprise O.M.G.! the book was really good couldn't put it down; I wanted to finish it so bad just to find out what happen. From the start of the book it feels like your growing up with the characters together getting to know them and going through their highs and lows. I found it so true what people say in their reviews, its like you just don't want it to end, I actually was at the end of the book and felt a little disappointed because I was getting ready to turn the page and it was the end...GET IT...READ IT...TREASURE IT. It's one of those books that's a keeper and I am sorry it took me so long to read it, but it was worth the read. If you do decide to get this book I hope you enjoy it as I did, I know its 708pages but I think its worth a read.Re-Read update 2012: I originally read this book in 2004 and I still felt the way I did the first time I read this book. I love it and plan on a re read again once in a while. Byhttp://www.romancenoveljunkies.com"}, {"userName": "Beverly", "userReviewDate": "Feb 17, 2013", "userURL": "http://www.goodreads.com/user/show/13095060-beverly", "userReview": "This was the first book I ever read for fun, and I read it when I was 14 years old. Me and my group of girlfriends all shared the same book. I think I was the second girl to read it, and from there it took off. I remember thinking the sex scenes were so risqué, and I would blush just reading them.Now 15 years later, this book doesn't seem risqué at all. One thing that hasn't changed though is the excitement I felt reading it. I could remember bits and pieces of the story, and I was dying to finish it to see how things ended. Matt Farrell...swoon...he is the perfect male character. He is a self made man, he is determined, strong willed, compassionate, loving, and forgiving. \n\"What else could you possibly give if I move in with you?\" \"Paradise\" \nI love this book and Judith McNaught, they introduced me to this world of fiction and my love for reading. Present time I am still reading with my girlfriends, we just don't have to share a book now. MWAH Ladies I love reading with you!!"}, {"userName": "Danielle", "userReviewDate": "May 12, 2017", "userURL": "http://www.goodreads.com/user/show/22412202-danielle", "userReview": "I have no idea what to think of this one! It about gave me anxiety.Review when I get my thoughts together, and have 'wines'..."}, {"userName": "NMmomof4", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/24665574-nmmomof4", "userReview": "[- Does  have cheating- Does Not have a descriptive sex scene with OW/OM-  Does have both the h and H pushing away-  Does have a separation between the h and H-  Does Not have abuse - Does  have a HEA ending (hide spoiler)]"}, {"userName": "María Ángeles", "userReviewDate": "May 06, 2016", "userURL": "http://www.goodreads.com/user/show/23830302-mar-a-ngeles", "userReview": "Los primeros capítulos no consiguieron engancharme.Empecé a preguntarme si realmente me iba a gustar el libro. Más tarde he comprendido que la autora quiere que conozcamos de primera mano la personalidad de Meredith. Pero entonces llegó la salvación!!! Un mini capítulo en el que aparece por primera vez Matt y que le da vidilla al asunto.A mí el libro me ha encantado!!!!!! Es cierto que a veces es lento y demasiado detallado, pero para mí, no ha restado emoción. Los dos protagonistas, Matt y Meredith , son personajes fuertes, redondos, y con una alta personalidad. Me ha enamorado su forma de actuar frente a los problemas: siempre hacia adelante, solución frente a \"echar culpas\". La historia de amor entre ellos me parece preciosa y la conversación que tienen cuando descubren la verdad me ha tocado el alma: lagrimitas...!El mundo laboral de los dos protagonistas es un temamuy presente en el libro. Es verdad que la autora ha escrito muchas páginas sobre bolsa, socios, OPAS hostiles, créditos... Y lo valoro. Porque aunque prácticamente no tengo idea del tema, me voy con la impresión de saber más de él. Y eso me gusta de un libro!. También he valorado muchísimo la forma en que la autora nos presenta dos formas de trabajo distintas: lo autoritario y sin cuestionamientos frente a lo motivador y novedoso. Totalmente de acuerdo con lo que la autora deja ver.La decepción. Para mí ha sido Lisa, esperaba mucho más de ella y de sus apariciones. Su \"final\"... totalmente inesperado.Es verdad, tal vez le sobren páginas a este libro, pero yo lo volvería a leer encantada.Reseña en Blog: http://unablogueraeventual.com/parais..."}, {"userName": "valee", "userReviewDate": "Jan 23, 2010", "userURL": "http://www.goodreads.com/user/show/2320890-valee", "userReview": "I must have been the only one here who had not read this book yet.  My only real excuse is that I was saving it for one of those days you just need to read a book you'll completely adore. Based on the reviews I read I just knew I would love it. This is a longer read than most, specially in the romance genre, probably twice as long. I was afraid It would be slow-paced or too repetitive because of it, but it wasn't, every page was one less to get to that HEA you start craving right after starting the book.While usually romance books are fast and easy reads, this one was a bit more complex than that. The plot might have been a bit shallow and unreal (rich, silly girl hooks up with much older poor boy and ends up pregnant), but the romance, the feelings and all the impediments to get their HEA were way too real. I loved that about this book, how the author was able to get down to Earth such an unreachable reality. For some reason though, I thought this read would be about a more serious topic, involving darker and deeper feelings. Not that I'm complaining, I still had an amazing time reading it, I loved this read so much that I skipped work a day because I couldn't put the book down. I adored the author's writing skills too. She just has a way with words and will make you unable to stop reading.What I will treasure the most about this read was the length of it, because it made possible for me as a reader to get to know the characters in a way that most reads never allow me. We see the main characters grow up, see how they think, their believes, dreams and hopes in different times of their lives. We see how life gets in their way and between them, how love is not always enough. As weird as it seems, Iloved that.What better way to describe this amazing romance than with a quote form it:\n\"Lisa, have you ever met anyone and then known within minutes that he's the most special person you're ever going to meet in your life?\"\nThe strong emotions from the Hero were what truly did it for me, though. I just adore the quiet and strong-willed Heroes, those who don't let anybody see their true feelings and when they actually express them is in a burst so strong that will leave you breathless:\nI came looking for you to give you the glad news, and you did the noble thing—you married a girl you didn't want.\" \"Didn't want?\" he exploded, his harsh voice in complete opposition to the poignancy of his words. \"I've wanted you every day of my godforsaken life.\""}, {"userName": "Feminista", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/5716741-feminista", "userReview": "Rating: 2 out of 5.I was pretty disappointed with this book. The characters and the plot were similar to many of the other books that I have read.Virgin heroine meets a guy who sleeps around, they fall in love, misunderstandings happen, they break up and then meet again years later. In these years, the hero becomes very successful and sleeps around with dozens of other women. The heroine, however, only sleeps with one other guy, which she doesn't find very satisfying. Misunderstandings are resolved. And then...The end...And one more thing, I did not appreciate how \"becoming pregnant\" was \"stupid\" of the heroine. It was the hero's responsibility also to have ensured otherwise. I am not sure how birth control was back then, but even now, men who just assume that birth control is being taken, by women they only met hours previous, are the stupid ones. I also didn't like how the heroine accepted the blame and responsibility... I have said this before and I'll say this again, it takes two to tango... Why do people forget that?"}, {"userName": "Jan  ", "userReviewDate": "May 11, 2016", "userURL": "http://www.goodreads.com/user/show/20856081-jan", "userReview": "Judith McNaught made me realise or think, for the first time, that perhaps I could play in another team.God help me!I am in love... with Meredith."}, {"userName": "Floripiquita", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/63637736-floripiquita", "userReview": "Que me ha desaparecido la crítica!!! Arggg. A ver si me acuerdo de lo que puse.Si este libro solo fuera sobre Matt le daría 5 estrellas sin dudarlo, pero no sólo de el vive \"Paraíso\". La historia de amor entre los dos protagonistas es muy bonita y a veces muy triste, hay un rollo ochentero de amor y lujerio que me ha hecho bastante gracia y hasta me ha parecido bien el instalust e instalove, con un hombre como Matt todo es creíble. Pero se me ha hecho un poco largo y el final me ha parecido predecible y precipitado. Además, he echado en falta un cierre para la pareja secundaria y algo más de información sobre la hermana y el padre de Matt o la madre de Meredith."}, {"userName": "Alkyoni", "userReviewDate": "Sep 17, 2011", "userURL": "http://www.goodreads.com/user/show/3720870-alkyoni", "userReview": "A week ago, I sent a message to my friend Fani – the romance guru- asking for a recommendation on contemporary romance. My requests were simple: I wanted a hero who wasn’t tormented and a heroine who didn’t cry every 10 pages. This was her first recommendation, so I ordered it.When it was delivered, I almost chocked. The thing is huge; it can easily be used as a presse- papier during a tornado with excellent results. Given the fact that I’m not really a fan of plain romance without some suspense or adventure, I estimated that it would take me at least two weeks to finish it.Yeah, took me a day and a half. The funny thing is, even though I can’t say that it’s one of my favorite books ever, I was reading it with such ease, such delight, never feeling bored, and the amazing thing that has never-ever happened to me when reading something like it, was that I didn’t roll my eyes. Not even once.The love story is so sweet, and McNaught has such a great way with words that I could visualize each scene at first. Later on, she delivers such a thorough and yet not boring or overly detailed character building, that I actually felt like I knew the characters in person. I loved the characters and it is obvious that McNaught loved them too, because both Meredith and Matt are drawn with great care.The only reason I’m not giving it a higher rating, is because it really is a work a fiction and you don’t get to forget that fact. Matt and Meredith’s love story is very sweet and very unreal at the same time. I liked Meredith more than Matt to be honest, because even though she is rich/beautiful/smart/caring/and so on, she has worries and thoughts and insecurities that make you feel like she’s a real person. Matt is so perfect that I couldn’t get past the fact that this guy never existed and he never will. But that’s just me, I’m sure other readers are looking for just that, and I assure them that he really is something.Anyway, this is exactly what I wanted to read and even more than I expected, so thank you Fani!"}, {"userName": "♥ℳelody", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/4439079-elody", "userReview": "2.75 starsUgh. This was painful for me.When you are feeling like this while reading:\n\n\n\nIt's not so fun.*sigh* I was expecting something really great for Matt and Meredith after reading Perfect. But the emotional pay off in this was close to zilch for me. When you spend 650 out of 700 pages of the book keeping the hero and heroine apart, despising and disparaging each other, thinking the worst and having the wife \ninsistent\n on marrying someone else and doesn't love the hero at all 90% into the story??....\nWHAT EXACTLY AM I SUPPOSED TO DO WITH THIS?You keep pounding it in the readers (and the characters) heads over and over again how much of a mistake the marriage was and how little they know each other and the heroine is ‘in love’ with someone else, Matt is 100% wrong wrong WRONG! for Meredith, blah blah blah....then you can’t help but be forced to go along with it. Anyone who knows me and my reading tastes knows that I am a big fan of romantic angst. Like HUGE. Here it was like sitting through a never-ending forced therapy session with a lovesick hero and a belligerent heroine talking about their entire relationship from conception all the way to a very rushed floundering reunion that seemed 200 pages too late. I felt the overall tension, misunderstandings, grudges, miscommunication outweighed the reconciliation and light happy moments for these two. This was incredibly unbalanced where the uphill battle outweighed the much anticipated climatic reunion twofold. JM keeps putting her readers in this uneasy shaky mindset through a good portion of the story:\nAnd I'm not sure if I enjoyed this kind of mind game. I started to feel really manipulated by it. If you are not sure if the h/hr will end up together or even love each other still with 30 pages left of the book? It's a problem. I kept having to tell myself to be patient, the end result will be worth it. Was it? Not really. Just barely. That was the biggest problem for me which I couldn't overlook. You need to convince me, show me these two truly love each other. I know they did, but I didn't see enough of it. The actual reconciling is maybe 20 pages tops combined with another exhausting misunderstanding shoved in there at the last minute because the 11 years of estrangement & bitterness wasn’t enough right? I love tension just as much as the next person but seriously just...\n\nI enjoyed the lovey dovey moments while they lasted but I wanted more. Waaaaaaay more. I don’t want crumbs. I felt really resentful and manipulated as the misunderstandings kept stacking up. What made it worse was how far Matt was willing to go to sweep Meredith off her feet and win her back but she was having none of it. I hated that the most. Heroes chasing after obstinate uninterested shrewish heroines is my least favorite kind of trope. I fucking HATE IT. Meredith kept acting like Matt was the fire-breathing villain in this even after the truth came out and it made me want to just smack her even more. I felt this couple’s potential was completely wasted here.And I’m sorry but Meredith’s sneering snobby ‘nothing but a dirty steelworker’ cut downs to Matt whenever she was angry with him I found contradictory to her characterization and hypocritical. She is presented as this self-embodied perfect poised independent business woman who doesn’t have a hateful bone in her body, but JM took it too far and morphed her into a brittle selfish haughty snob who acted like she was better than Matt when they meet again 11 years later. A snob is a snob. End of. Stop trying to throw glitter and fairy dust on it to make readers buy into a false package. I found her character very inconsistent at times. She acts betrayed, hurt and offended by Matt at every turn. Yet her perfect angel of a fiance (who she constantly puts on a pedestal) belittles her best friend Chloe and she just shrugs it off and acts confused by it. Really? Where is your spine woman? Oh and it gets even more ridiculous. Not even a full day--try mere hours-- after ending her engagement with said fiance, her best friend Chloe (who's secretly been in love with the fiance) sleeps with him and doesn't seem to care about the repercussions. \nExcuse me IN WHAT UNIVERSE IS THIS CONSIDERED FORGIVABLE?! Earth to McNaught: NO woman should do that to another woman. Ever. Especially someone who you've grown up with and is considered a sister, family to you. And not having the decency to even feel guilty about it is insupportable. Of course Meredith forgives them both (because she's just that perfect RME) and doesn't give them the burn of a cold shoulder. Her non-reaction to the whole thing is what burned my ass the most given the shit she gave Matt. Ugh. Just UGH.I literally wanted to do this every time Meredith flung cruel barbs at Matt:\nThe brutal set downs I found grossly unfair because they hit below the belt given how far Matt came and the struggles he dealt with. The emotional and verbal abuse and misery compounds everything that I wanted to see happen. This was literally like sitting through a couple's never-ending therapy session.And this was in serious need of editing. Oh boy did it ever. A big chunk of this was weighed down by the repetitive never-ending-20-pages-too-long business meetings, business strategizing and corporate talk and endless background fodder. At times this didn't feel like a romance story at all, Meredith and Matt are drowned out by all the corporate politics and filler nonsense about secondary characters who play minor roles. McNaught is a big fan of meticulous details and thorough backstories which is something I generally look for in my readings. But here I felt she got too bogged down in the details of things that honestly added nothing to the story. Do I really need to know the history of the 2 old security guards working at the Bancroft department store? Or how long a board executive has worked with Matthew and what each person wears and their entire educational background? REALLY? No thank you. It just became a chore to read through all this unnecessary tiring filler. Maybe it was more of my personal taste that bled into this, but the corporate info dumping added absolutely nothing to the foreground of the story. I love love LOVED all the details and background information in Perfect, it worked marvelously with the Hollywood backdrop, but here it was suffocating with all the mundane repetitive business talk and stiff bigoted socialites who I cared nothing about.Meredith kept saying her ‘baby’ and love is Bancroft & Company and you really feel that through most of this which I found depressing at times. And her stifling socialite twittering friends & acquaintances didn't help and her bigoted controlling manipulative father I wanted to pummel through the ground. Her constant enabling of that man was disgusting and unbearable to sit through. Your father is your family I get it, but sometimes you gotta take the bull by the horns & make sure those who did wrong are held accountable. Phillip Bancroft got a measly slap on the wrist for the outrageous scheming & gross stunts he pulled in here and that pissed me off to no end. He ruined Meredith and Matt’s life, I totally understood Matt’s hatred of the man and was annoyed that Meredith tried to get him to play nice. While I think this had a ton of strong potential (the 'early' years of the hero and heroine and how they meet was brilliantly set up) I did not get the satisfaction I was looking for. I loved the potential they had but I wanted more. The anxiety this book gave me is unparalleled with anything else I've read so far. While I see what JM was trying to do here, she focused too much of her attention on parts that were irrelevant and got carried away with the small minutiae details that should have been edited out. Perfect was much more successful in pacing and plot and flawless in it’s execution of the romantic arc. Loved that to pieces <3. This in comparison, fell short and wasn’t a winner for me unfortunately. JM loves her tortured couples, I just pray her HR couples don’t have the same endless misery with no end and verbally abusive drag-down fights."}, {"userName": "Arlene", "userReviewDate": "Aug 17, 2009", "userURL": "http://www.goodreads.com/user/show/1746727-arlene", "userReview": "Re-read: February 2016Loved it even more this second time around. Looking for a book that I could connect with the characters and decided to revisit this one after seven years. Love...Originally read: September 2009Paradise, by Judith McNaught, is a great contemporary novel that’s filled with love, corporate intrigue, humor, deception and friendship. The main characters, Matt Farrell and Meredith Bancroft, are immediately weaved into the novel with plenty of back story to give you a full picture of their journey when they meet, go their separate ways, and later reunite. I thought the book was captivating and for the most part fast paced and intriguing. The story is about two strong willed people, Meredith Bancroft and Matt Farrell, who fall in love at a young age and get married. After a brief time together, they find themselves separated by a devastating event, which was exacerbated by lies and deceit on the part of Meredith’s father who stopped at nothing to keep them apart. Eleven years later, they encounter each other and realize their hostility for one another was unwarranted and based on a series of misunderstandings, thus giving them a second chance at love, but not without a fair share of forces determined to keep them apart.I am taking one star away for a couple of reasons. First, the novel is filled with quite a bit of overwhelming detail on places, events, and people. I did skim over some of the deep dive on the descriptions and corporate happenings, which by the way were very well researched, but there just seemed to be an overabundance of detail that wasn’t really necessary for the storyline. Second, there were two secondary characters I didn’t care for at all, which included Phillip, Meredith’s father, and Lisa, her best friend. I was bothered by how Meredith allowed her father to get away with his lies and deceit which affected her relationship with Matt. It just felt like he was able to easily walk right over her. In addition, I couldn’t believe that Meredith easily accepted her best friend moving in on her ex-fiancé. That was just odd and unrealistic.Regardless of those minor flaws, this is a great novel that will keep you engaged and rooting for the main characters the whole way through. I enjoyed the journey and will definitely read other novels by this author. Great read!"}, {"userName": "Beanbag Love", "userReviewDate": "Aug 05, 2009", "userURL": "http://www.goodreads.com/user/show/2598237-beanbag-love", "userReview": "[kicked Daddy to the curb. (hide spoiler)]"}, {"userName": "WhiskeyintheJar/Kyraryker", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/2763722-whiskeyinthejar-kyraryker", "userReview": "My first contemporary by Judith McNaught gave me some of her fun emotional connection and a good amount of eye glazing department and corporate talk. Our leads had an instant connection when they met and I really enjoyed their back and forth tinged with sexual chemistry and sass. Unfortunately, Matt and Meredith don't spend a lot of time together. Their first go at it has them together for a whirlwind six days and then its not until the 60% mark that they get to spend any real time together. There was way too much corporate world talk for me and caused me to put off grabbing this back up to read. For having a bit older of a publishing date, this still held up pretty well. There was some high drama, with a lot of it coming from Meredith when she was upset, she was portrayed a pretty dramatic; it seemed to be feeding into this time period's love of overstating the thought that women are high strung emotional beings. I would have liked the corporate talk 80% slashed, Matt and Meredith spending more time together, and less of a rushed ending."}, {"userName": "Fran", "userReviewDate": "Aug 26, 2014", "userURL": "http://www.goodreads.com/user/show/21359327-fran", "userReview": "4.5 Stars\n“If you'll kiss me back, I'll make it six million. If you'll go to bed with me tonight, I'll give you the world. But if you'll move in with me, I'll do much better than that.\"\"Six million dollars and the whole world! What else could you possibly give me if I move in with you?\" \"Paradise.\"\nI feel like it took me forever to finish this, but only because real life (and live sports) kept getting in the way. I believe it's safe to say that this one had unbelievable staying power because if this was a lesser book, I probably wouldn't have stayed interested and emotionally invested until the very end, what with all the reading breaks that I had. It's a long book after all. *sigh* I'm a happy girl. :)"}, {"userName": "Renee", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/12732363-renee", "userReview": "Let me just start by saying, that I’ve been tangled in the worst book slump for weeks now- weeks I tell you! I was starting to doubt I'd ever recover. Everything I read, felt bland and lifeless, like I’ve read it a thousand times over. Well, that is, until I read this little gemstone of a book. I had no idea what to expect from this, especially having gone in completely blind. This story was breathtaking. I love Judith Mcnaughts voice. Her storytelling is so unique, while her writing style is sophisticated and elegant. She has a distinct way of completely bringing her characters to life. This book was so much more than just a love story. I don’t want to give too much away, but this book is a must read!Brace yourself for Matthew Farrell, Ladies - he will knock your socks off!"}, {"userName": "Mei", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/6876967-mei", "userReview": "An emotional rollercoaster!I loved this book! This is one of the most virtually sizzling books I’ve read lately. Why virtually? Because nothing is openly described, but it was sizzling all the same. The powerful pull was there all through the book.I loved the story, I loved the characters, I love the tone of voice and the way the story is told.It was interesting, It was compelling! I couldn’t stop reading it!Yes, it is long, but I found myself wishing it was longer, just to be able to linger there a little bit more!Everything has already been told about this book, so I wouldn’t be adding nothing new, but I couldn’t, just couldn’t not say that it is a wonderful book!Thanks, Mona, for recommending this book to me!"}, {"userName": "abi rafon", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3883395-abi-rafon", "userReview": "We oftentimes got easily disappointed when our expectations were too high. . And because many of Judith Mcnaughts fans tagged ‘paradise’ as her best contemporary, I had expected so many things like what one should expect when they heard the word “BEST”. It did not disappoint me though there were times that Im a bit ‘furious’ about Meredith, the heroine. I thought then that she was ‘nothing’ compare to other heroine of mcnaughts novels like Victoria (once and always), Elizabeth (almost heaven), and Alex (something wonderful) who’s for so many times proved that they really loved the hero despite all the heartaches, and pains and mistrust they received. Unlike Meredith whose trust for Matt was always on the critical stage. The truth was I started reading this book liking Meredith... but as the story goes by, my fascinations towards her were slowly fading until I almost got angry and silently wondering WHAT THE HELL WAS MCNAUGHT THINKING GIVING MATT THAT KIND OF HEROINE?!. Especially when he’s asking for her trust but she just turned her back and broke his heart. I thought she was intelligent and smart. So, I was nearly decided to give just 4 stars BUT what she did after was great, really, really great (I was pertaining on the scene in boardroom where board of directors was there). It made me forget all her flaws and quickly accept her for Matt. I was relieved so im back to five stars. Great story."}, {"userName": "Leona", "userReviewDate": "Nov 22, 2011", "userURL": "http://www.goodreads.com/user/show/7020824-leona", "userReview": "This goes down as one of the top 5 romances, I have ever read. This book defines the genre and is everything a reader would want in a romance novel. The author does a tremendous job in laying the foundation and framework for us to understand the heroine. And what a heroine! Meredith Baxter is one of my all time favorites. The ugly duckling that turns into the swan, and I found myself rooting all the way for her, because she was not only beautiful on the outside, but on the inside! A must read."}, {"userName": "kari", "userReviewDate": "Sep 09, 2009", "userURL": "http://www.goodreads.com/user/show/2207055-kari", "userReview": "I half-liked this book, I know that sounds funny but I really liked the hero and not the heroine. She seems like such a nincompoop and a dimwit that I wanted to reach into the pages and give her a good shake. She is presented on the first pages as being very smart and then we are given close to 500 pages to prove that she is anything but.I half-liked this book because the first 200 pages, all of the back story, could have been done in maybe ten pages since when they meet up later, they're going to recall and talk over everything that happened. From that point on, the story begins to move quicker and I liked it from that point but the beginning truly goes on too long.Matt is a great character, well-developed and his motivation is easy to understand. I wanted him to find his happily ever after but Meredith as written doesn't really seem good enough for him. Every time she has a chance to consider whether his motives are good or bad, she always chooses bad. I got very tired of it long before she finally has an epiphany. The change is too long in coming.Matt thinks only of her once he decides to pursue her. All of his thoughts are of what will help her and make her happy. She never seems to consider whether what she does will affect him either way. The supporting characters are interesting and add to the story. The business details are well-done and I undersood what was going on but there could have been a bit less description of her board of directors and his takeover staff and their activities. I'd give five stars to Matt but only 1 star to Meredith so that's the 3 stars.I will read McNaught again but this wasn't my favorite."}, {"userName": "Sheryl", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/6039696-sheryl", "userReview": "*re-read for about the 100th time in hardcover*I originally read this back in 1992... yes, I was 12(!!!) when I read this for the first time and it totally blew my mind!!! I started reading romance from the time I was 9 (no, of course my parents never knew that I was reading bodice rippers at such an impressionable age!!) and up to the time I was 11, I never strayed from historical romances. Then I saw that my ABSOLUTELY FAVORITE author had written a *GASP* contemporary romance (turns out she had previously written 2 other contemporary novels, but I did not know that then)! I asked myself at 12, could I do this? Could I dive into the world of contemporary romance, when all I had read up to that point was historical? Well, I took a chance and I truly credit this book for starting my OBSESSION with contemporary romance that feature ALPHA-MALES!!! Matthew Farrell was the EPITOME of everything that I STILL LOVE about men (yes, both in books AND in REAL LIFE ); growly, bad-boys who came across as a$$holes, but when given the right women, turn into a pile of mush!!! To this day, I can still go back to this story and whenever I read it, I get the shivers on HOW GODDAMN FREAKIN' HOT, Matthew was/is *SWOON*. The incomparable Judith McNaught... there will NEVER be another author like her."}, {"userName": "Piper", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/10095424-piper", "userReview": "\"If you're still willing to take me there,\" she said, swallowing almost painfully, \"I thought I'd like to see paradise.\" LOVED this!!!!"}, {"userName": "Blair", "userReviewDate": "May 26, 2014", "userURL": "http://www.goodreads.com/user/show/24702150-blair", "userReview": "Reread:Still as amazing.No words to describe how much i loved this book.It was AMAZING.#EPIC"}, {"userName": "Cassandra Dexter Colby", "userReviewDate": "Feb 15, 2016", "userURL": "http://www.goodreads.com/user/show/33953938-cassandra-dexter-colby", "userReview": "Le doy 3 porque Judith se ha montado un culebrón que en la tele daría para 400 capítulos, pero ya se me ha hecho cuesta arriba al final. Matt no ha sido lo que yo esperaba, pero le reconozco a la autora que sea el germen de otros tipos por el estilo. Eso sí: el segundo de esta serie que me espere sentada..."}, {"userName": "moi", "userReviewDate": "Aug 08, 2010", "userURL": "http://www.goodreads.com/user/show/4123629-moi", "userReview": "UPDATED REVIEWAs I have already mentioned below that this book or rather this story or more better Matt and Merr never cease to surprise me with their depth of affection for one another.Last year when I had read and review, I was miffed with Lisa for sleeping with Parker. That was a big error of judgement from my side. This time when I read and maybe you could say my understanding the situation is more clearer this time. One when loves someone dearly they always do things most unexpected by them. Lisa did what a love-sick woman would do.. :)Jumping Parker's bone when she saw her opportunity!! *laughs*And another person who touched my heart was Caroline Edwards, Merr's mother. She is those silent and yet very important character. The way she described Phillip for us was just mind-boggling.. Another example of a person truly in love... You could see her love in her eyes, in every word she spoke and how she just calmly accepted her fate..Other thing I failed to mention earlier was Matt's love for Meredith and to the extent he was ready to risk it all.. And I was truly miffed with Meredith for being selfish in the end when it was her time to trust Matt... She expects him to trust her but she failed to return that trust to him. I mean... If my love would declare his love for me and then ask me to trust him I would blindly trust him. He deserves that in the least! And how he was total GONER for Meredith shows in the way he accepted her back without further ado and just simply her being around him was enough to melt his heart for her.. Priceless... What true love can do to people...Review while reading..I am reading this book after a year now and this story never fails to touch my heart... I have a smile plastered on my face whenever I read this story. Some of us are just scared with the sheer volume of the book that we don't understand what a love-story might have in it that requires so much pages...This story is a like a good old wine which tastes better-er with time...*smiles* This story just strikes a cord in your heart... It has everything in it drama and all the upheavals two lovers might face..All the characters are just brilliant!! And you are just hungry for more. I wanted to know every little thing about Merr and Matt... This is just so romantic Matt chasing his wife or better put.. re-courting his wife and trying to win over her heart and all the insecurities...Currently, I just in that part of the story where they are faced with public drama of their divorce and how they are preparing for their joint press conference.. As they have already compared Meredith to Grace Kelly so I am sticking to her...and my Matt would be...Read from April 20 to 23, 2011, read count: 5 and counting...Uhh... How do I begin describing the book? Oh God!! This is my all-time-favorite romance book... I don't know.. I loved this book at first read, and my love grew more with every read... I loved the story!! It was so beautiful and detailed that I felt I was sitting by a window and seeing all the events in front of me... :) I have liked Judith's all books... She has a gift to give us so many beautiful, strong characters.. All her characters have so much to give and they just grow on you.... Matt was my favorite!!! hands down!! He is the clear winner for the best hero from all her books... Matt Farrell... just seeing his name brings a big broad-grin on my face that I cannot erase... He is charming, witty, stubborn, crazy in love with Meredith, uncompromising in business but he is ready to give Merr Paradise in gold platter!!! (laughs) Well I don't mind...(winks) and very soft-hearted!! Aaww!! My heart cried for him when Merr doubted him and did not trust him... And most of all, he always got what he wanted and he never hesitated to take risks (he risked all he had to get Merr back in his life)....Meredith... well, she is nice too.. actually too nice.. I mean I do not have that big heart as she had to forgive her father... He father was vicious to the core!! That was very horrible of him to degrade and humiliate her.. And I also felt like giving her a tight slap for hurting Matt... :( But, that too was justified.. as you see, she had hard time trusting herself with Matt.. he never actually told her how he felt... Both Merr and Matt were just so suited for each other in every way.. I especially loved how no matter what the situation is they always got along with each other and always have good humor while facing difficult situations!!! The way the story progressed, it was like a flow.. nice soothing music... :)And most favorite part of the book was how Matt pursued Merr.. hahahahha.. it was so endearing and soooo sweett... :DAnd one thing I just could not digest was Lisa sleeping with Merr's ex fiancée!!! :O and Merr accepting her.. I mean that was real cruel of Lisa to do that... What?! the moment Merr broke up, Lisa could try her hand!!! What the hell!!! :O If she had liked him so much and she claimed to know Merr she could have told Merr... :OAnd actually speaking ... Philips Bancroft, Merr's father.. he too was strong character.. He actually made us hate him to the core!! :D He too is driven as Matt and would stop at nothing to get what he wanted... and here he wanted Matt out of Merr's life.. his vicious plans were too wicked .. :) Okay, on a serious note... I am highly obsessed with this book and I cannot make myself hate it no matter what... I loved this book as I did not have any expectations from it... :) And title is so PERFECT!!! you'll know it when you read the book... :)People, I will not say... everyone of you might like this book... It is a detailed story and very well written, if you ask so? For one moment I did not feel this was unnecessary and should have been edited.. I never wanted this book to end... But, some may not agree with me... Here, I have told you what I liked about this book... I would say, if you are a sucker for good story and strong characters you should read it... Give it a fair chance people... it is not very bad.. maybe it will disappoint you a little... nothing extreme.. :) Don't miss this heart-breaking story!! :)I hope you like my review.. if you din't like it.. feel free to comment... :)"}], "description": "Corporate raider Matthew Farrell had come a long way from the poor, scruffy kid of Indiana's steel mills. A long way from the country club where, feeling like an outsider, he had dared to fall in love with a beautiful blonde named Meredith Bancroft, and known a once-in-a-lifetime passion and betrayal that still haunted his memory... Now world leaders courted him, the media watched his every move, and he was ready to move in on the Bancroft empire.A cool, poised executive in her family's legendary department store chain, Meredith had once defied her father for the sexually magnetic, intense Matt Farrell -- and their brief, ill-fated marriage was the disastrous outcome. Now, as the Bancroft firm is threatened by a hostile takeover, Meredith is forced to confront Matt. As tensions build between them, bittersweet memories rise to the surface, leaving them suspicious, restless, and uncertain. Will they be able to believe in each other -- and grasp the tender miracle that is before them?", "title": "Paradise\n      \n          (Second Opportunities #1)", "url": "http://www.goodreads.com/book/show/16006.Paradise", "average": 4.32, "cover": "https://images.gr-assets.com/books/1386921972l/16006.jpg", "reviews": 1163, "authors": [{"url": "https://www.goodreads.com/author/show/9885.Judith_McNaught", "name": "Judith McNaught"}], "type": ["Romance", "Romance", "Contemporary", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/16006.Paradise", "http://www.goodreads.com/book/show/23878696-para-so-robado", "http://www.goodreads.com/book/show/7662532-paradise", "http://www.goodreads.com/book/show/888286.Paradise", "http://www.goodreads.com/book/show/129619.A_Kingdom_of_Dreams", "http://www.goodreads.com/book/show/350684.Whitney_My_Love", "http://www.goodreads.com/book/show/129616.Something_Wonderful", "http://www.goodreads.com/book/show/129621.Almost_Heaven", "http://www.goodreads.com/book/show/129617.Perfect"]}