{"ratings": 4223, "userreviews": [{"userName": "Krissysch", "userReviewDate": "Sep 20, 2017", "userURL": "http://www.goodreads.com/user/show/47371791-krissysch", "userReview": "Ich lese ja eigentlich nie Thriller, aber irgendwie hat mich dieses Buch neugierig gemacht. Ich fand die Idee der verschwundenen Passagiere toll und schön umgesetzt. Auch die weiteren Themen, die sich im Laufe der Geschichte ergeben, passten gut und kamen gleichzeitig sehr überraschend. Es gab einige Wendungen und blieb immer spannend, bis zum Schluss hatte ich keine Ahnung, wer hier der \"Täter\" ist. Dennoch hat mir ein wenig der Nervenkitzel gefehlt, den ich bei einem Psychothriller erwartet hätte.."}, {"userName": "Franco  Santos", "userReviewDate": "Sep 15, 2015", "userURL": "http://www.goodreads.com/user/show/29931457-franco-santos", "userReview": "Ese es el problema con los deseos, señor Schwartz. Solo los equivocados se cumplen de inmediato.\nComo no podía ser de otra manera, otro libro más de Fitzek que leo del tirón. Imposible no hacerlo. Fantástico trabajo de este autor que no para de sorprenderme.Con El pasajero 23 se reafirma que Sebastian Fitzek es uno de los mejores escritores de thrillers de la actualidad. Es admirable su habilidad de no dejar ni un cabo suelto y de encima tener la osadía de hacer creer al lector que está un paso por delante de él para luego humillarlo con una resolución que superará cada una de sus expectativas. No solo cierra el caso de manera limpia y clara, con todas las piezas encajando a la perfección, sino que también juega con la mente del lector dando vuelta el tablero a último momento, presentando una conclusión igual de perfecta pero mucho más impactante. Otra cosa que no puedo ignorar es la evolución en su prosa. En este libro se nota un salto en su forma de escribir. Descripciones más detalladas y personajes mejor desarrollados. Y se mantiene, por supuesto, su manejo magistral de los puntos álgidos, de reavivar el misterio en el instante justo para volver mas adictiva la lectura y de distribuir pequeños y grandes plot-twists estratégicamente, de tal modo que cause una especie de mareo deductivo en el pobre individuo que está leyendo."}, {"userName": "Semjon", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/58642176-semjon", "userReview": "Man könnte über das Buch sagen, dass- durch die kompakten Kapitel und die kurzen Sätze in dem Buch eine Rasanz vermittelt wird,- dass sich durch die vulgäre primitive Sprache eine Authentizität bei den wenig normalen, mit persönlichen Defiziten belegten Figuren entsteht,- dass durch die detailreiche Schilderung von Gewalt und Perversität eine natürliche Spannung entsteht,- durch die unzähligen Plottwists man sich prima unterhalten fühlt, - durch die Verdrehung des Rollenbildes von Opfer und Täter der Autor mutige neue Wege beschreitet und dabei Tabuthemen, wie die Rolle der Frau als Täter anspricht, - dass durch das Weglassen von atmosphärischen Beschreibung der Orte eine vollständige Konzentration auf die Handlung möglich ist. Ich sage aber, dass- dass das mit Abstand der schlechteste Fitzek ist, den ich bislang gelesen habe- dass das Merkmal eines Psychothriller die angedeuteten Beschreibungen von Ängsten ist und dieses Buch dem Leser keine Raum für Phatansie lässt, wenn Folter und Vergewaltigung im Detail beschrieben werden. Das Buch gehört für mich eher in den Bereich Horror, den es geht ums das nackte Überleben in vielen Sequenzen. Fitzek sagt im Nachwort, dass es kein Psychothriller, sondern ein Familienbuch ist. Da fehlen mir die Worte. - dass hier ein ganz verquerstes Frauenbild gezeichnet wird. Es gibt wirklich keine einzige normale weibliche Person in dem ganzen Buch. Es sind Täterinnen, Vergewaltigerinnen, Mörderinnen, Psychopathinnen, verstörte Mädchen, Gewaltopfer, Vergewaltigungsopfer etc. Dazwischen pendeln ahnungslose Männer umher wie blauäugige Staffagen,- dass der Autor nicht in der Lage ist, eine Atmosphäre herzustellen, Orte zu beschreiben, den Leser in einen anderen Raum zu versetzen, den Personen einen Charakter zu geben, die Geschichten hinter den Handelnden zu erläutern. Es geht nur um Schnelligkeit und um das bewusste in die Irre führen des Lesers. Man wird das Gefühl nicht los, dass es dem Autor Spaß macht, mit immer noch einer Wendung und noch einer Absurdität den letzten Rest an Realismus aus der Geschichte herauszuschreiben, nur für den Effekt, dass sich der Leser am Ende wundert über die ach so erstaunliche Auflösung. Das ist für mich billige Effekthascherei, Pulp Fiction, aber es ist dann teilweise so wieder hanebüchen, dass ich es in einem Rutsch durchlesen musste, weil ich es kaum glauben konnte. Für diesen speziellen thrashigen Unterhaltungswert gibt es einen zweiten Stern. Bislang habe ich Fitzek als ganz guten Autor von Psychothrillern kennen gelernt. Ob Nachtwandler, Therapie oder Splitter, es ging immer um einzelne Menschen und ihre verquerte Wahrnehmung der Tatsachen aufgrund psychischer Störungen oder anderweitige Eingriffe in ihr Leben. Man konnte eine Beziehungen zu den Hauptpersonen aufbauen und mit ihnen durch das Buch leiden. Das geht dem Passagier 23 völlig ab. Und dabei hätte man aus der Grundidee einer Kreuzfahrt mit dem Verschwinden von Menschen so viel an atmosphärischer Spannung auf einem Schiff mit unzähligen Gängen und Menschen, ohne die Möglichkeit zur Flucht, machen können. Stattdessen Gewaltpornographie und vergewaltigte Kinder. Das ist nicht mein Ding."}, {"userName": "Andrew Smith", "userReviewDate": "Jun 03, 2016", "userURL": "http://www.goodreads.com/user/show/5885760-andrew-smith", "userReview": "This is the third audiobook I’ve listened too based on books by this author. I say ‘based on’ because they’ve all been Audible Drama productions, complete with a big cast, sound effects and all of the extras you’d expect from a radio production. My previous experiences with The Child and Amok were excellent and I liked the look of the cast here too, with British actor Max Beesley playing the lead character. The plot surrounds an investigator (Beesley) whose wife and child disappeared overboard on a cruise some years ago. The deaths were assumed to be suicide. As a result, he’s become reckless and wild, taking on the riskiest undercover operations with no fear at all for his own safety. He just doesn’t care. But one day he gets a phone call that challenges the assumption concerning the fate of his family. In order to learn more he’s enticed to join a cruise where a strange lady seems to have set up permanent home aboard the very ship from which his wife and son had supposedly taken a jump.Experience has taught me that in Fizeck’s stories nothing is quite as it seems: expect surprises and lots of them. And such is the case here with twists and turns throughout the eight-hour long production. The quality is excellent, both in terms of the acting, the effects and the way the story mixes narration and scenes that are acted out. The whole thing was tense, slightly shocking and highly entertaining. I won’t go into the detail – if you’re interested it's best you go in with as little information as possible – but I will say that you should be prepared for some uncomfortable scenes featuring young children. It’s certainly not gratuitous or graphic, but best be forewarned.I found this production to be on a par with the others I've listened to. The story itself was gripping and, in it's own way, though provoking. If you like audiobooks you’ll find that this is a slightly different take on this particular format – you might want to give it a try."}, {"userName": "Kayla Dawn", "userReviewDate": "Nov 03, 2017", "userURL": "http://www.goodreads.com/user/show/70522717-kayla-dawn", "userReview": "Ach man, der liebe Fitzek muss am Ende auch immer über die Stränge schlagen.. hätte er es nicht so übertrieben, wäre das für mich ein 5 Sterne Buch, allerdings legt er immer noch eine Schippe drauf & das geht mir meistens einfach zu weit. So gings mir bis jetzt mit jedem seiner Bücher, die ich gelesen habe (gut, mit dem hier eingeschlossen sind es erst 3 😂) Ich mag seinen Schreibstil sehr und auch die Story ist grandios gewesen, aber wie gesagt, am Ende übertreibt er mir einfach zu sehr und macht etwas einigermaßen realistisches total unrealistisch."}, {"userName": "Cory", "userReviewDate": "Oct 30, 2014", "userURL": "http://www.goodreads.com/user/show/6891967-cory", "userReview": "• apfelwolken •Asche auf mein Haupt: Mir war überhaupt nicht bewusst, dass schon wieder ein neuer Roman von Sebastian Fitzek auf dem Markt erscheinen sollte. Manchmal könnte man fast den Eindruck gewinnen, dass es Fitzek-Romane regnet wie Kamelle am Kölner Rosenmontagszug.So wurde ich dann am Erscheinungstag von der allgemein ausbrechenden Hysterie relativ überrascht, alle Welt rannte mit wehendem Haar zur nächstgelegenen Buchhandlung, die ganz Ungeduldigen luden „Passagier 23“ kurzerhand auf den eReader, in freudiger Erwartung eines „echten Fitzeks!“Die ganze Aufregung war ansteckend, mir war langweilig und so habe ich kurzentschlossen mein bereits leicht eingestaubtes Kindle zum Leben erweckt und mich in die zu Papier gebrachten Fluten geworfen.„Ein echter Fitzek!“Das Phänomen um Sebastian Fitzek finde ich schon recht beeindruckend. Ich persönlich habe erst zwei seiner Bücher gelesen und kann schon verstehen, was seine Romane so besonders und anders als andere macht.Man nehme einen Topf, dessen Material aus Konflikten, Traumata, Existenzängsten und emotionaler Instabilität besteht. Nun werfe man allerlei psychische Störungen, Leid und die widerlichen Abgründe der menschlichen Seele hinein und würze das Ganze mit einer guten Portion an Absurdität, übelster Perversität, Ekel und Abartigkeit.Voilà, schon hat man einen typischen Fitzek-Roman. Das Konzept geht auf: Die Leute wollen schockiert werden, wollen in die abscheuliche Gedankenwelt von Psychopaten eintauchen und sich von deren Gräueltaten erschüttern lassen – je kranker, desto besser.Und Fitzek macht seine Sache gut: Er hat ein Händchen dafür, einer Geschichte völlig unerwartete, überraschende Wendungen zu geben - auf nichts ist Verlass, keinem Charakter kann man vertrauen und so wird man als Leser bis zur letzten Seite immer wieder mit neuen Rätseln und Wendungen konfrontiert. So auch in „Passagier 23“.Auch hier hat Fitzek wieder eine rasante, verstrickte Geschichte konzipiert, diesmal in der beeindruckenden Kulisse eines Kreuzfahrtschiffes. Ein Ort, der, wie er sagt, einer Kleinstadt gleicht – nur ohne Gesetzeshüter. Verbrechen sind also kaum Grenzen gesetzt und von denen spielen sich so einige auf der „Sultan of the Seas“ ab.Klingt doch gut! Was also war das Problem?Mein Problem mit Fitzeks Romanen ist immer, dass es mir von allem zu viel ist! Zu viel Perversität. Zu viel Abscheulichkeit. Zu viel Ekel. Zu viele wirre Wendungen.Man kann ja kaum einen klaren Gedanken fassen und sich selber einen Reim auf all die Geschehnisse machen, da wird man schon von der nächsten Absurdität überrascht. Die bizarre Handlung prasselt unaufhörlich auf einen ein, schaukelt sich immer weiter hoch und driftet dabei leider irgendwann komplett ins Konfuse und Groteske ab.Man merkt, dass Fitzek viele Stunden Recherche in seinem Roman verarbeitet hat, und das lässt er den geneigten Leser auch spüren, indem zum Beispiel Informationshäppchen in Dialogen platziert, die dadurch im richtigen Leben ziemlich unbeholfen klingen würden:[Daniel:] „Ich könnte stundenlang so weitermachen. Es gibt ganze Webseiten, die sich mit dem Phänomen vermisster Passagiere beschäftigen: internationalcruisevictims.org, crusejunkie.com oder cruisebruise.com, um nur die drei bekanntesten zu nennen.“ (19%)Ich hätte mir beim Aufzählen dieser Websites wahrscheinlich das Zungenbein gebrochen.Pappfiguren auf einem Ozeanriesen.Hätten die Charaktere doch bloß so viel Tiefgang wie der Ozeankreuzer gehabt.Es ist natürlich praktisch, einen Hauptcharakter zu erschaffen, der durch den schmerzlichen Verlust seiner Familie sämtliche Emotionen abgelegt hat. So erspart man sich, einer Figur einen gewissen emotionalen Tiefgang verleihen zu müssen und kann sich stattdessen ganz darauf konzentrieren, Martin Schwartz‘ als beispiellosen Überermittler und Psychologen auszubauen. Seine sagenhafte Kombinationsgabe war an vielen Stellen einfach abwegig und auch seine aggressiven, leicht gewalttätigen Launen haben ihm nicht unbedingt Sympathiepunkte eingebracht.Da mochte ich Gerlinde Dobkowitz schon lieber, allerdings blieb auch sie nichts als eine Karikatur: Eine betagte Dame, deren einziger Sinn letztendlich darin bestand, Schwartz Informationen zuzuspielen und sporadisch lustige Sprüche zu klopfen. Aber immerhin brachte sie mich zum Lachen.Eigentlich waren alle Charaktere eine Ansammlung von Stereotypen: Die betagte, aber lebhafte Dame; der therapiebedürftige, aber geniale Ermittler, der sich stellenweise wie die Axt im Walde aufführt; der depressive Teenie mit Hang zur Gothic-Szene (denn wie wir alle wissen: Gothic = Böse) et cetera pp. Es fiel mir dadurch sehr schwer, mich in die Figuren hineinzuversetzen und mich um ihr Wohlergehen zu sorgen.FazitIch war noch nie auf einem Kreuzfahrtschiff. Mein Wunsch, einmal auf so einem Kahn zu reisen, ist nach dem Lesen von „Passagier 23“ nicht größer geworden - aber auch nicht kleiner. Die Geschichte war einfach zu abstrus, um mich in meinen zukünftigen Reiseplänen zu beeinflussen. ;-)Letztlich bleibt man als Leser von „Passagier 23“ nichts als ein Zuschauer, der die beängstigenden Geschehnisse auf dem Kreuzfahrtschiff mit einigem Abstand aus der Ferne beobachtet. Man fiebert mit, ja, aber gefühlsmäßig passiert leider recht wenig.Ich bin deshalb übrigens auch der Meinung, dass Fitzeks Romane wunderbares Potential für Verfilmungen bieten – auf großer Leinwand kann ich mir die Geschichte hervorragend vorstellen. Vom Buch hätte ich nur eben etwas mehr erwartet. Es ist wirklich schade, denn eigentlich mag ich Sebastian Fitzek! In seinen Nachworten ist er mir immer total sympathisch. Nur mit seinen Romanen werde ich leider nicht so richtig warm."}, {"userName": "lenaireen", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/47071952-lenaireen", "userReview": "Mal wieder ein nur zu empfehlender Fitzek!Gerlinde Dobkowitz und ihre Sprüche warn zum schmunzeln und die Danksagung Fitzeks war mal wieder der Brüller :-D"}, {"userName": "lebe.liebe.lese [Tina]", "userReviewDate": "Jun 18, 2017", "userURL": "http://www.goodreads.com/user/show/63316474-lebe-liebe-lese-tina", "userReview": "Also irgendwie war das für mich kein PSYCHOthriller. Sondern einfach nur ein Thriller, welcher mir leider nicht so super gefallen hat. Es war okay, aber nicht Fitzeks bestes Buch."}, {"userName": "bookspumpkin", "userReviewDate": "Jun 08, 2014", "userURL": "http://www.goodreads.com/user/show/22418818-bookspumpkin", "userReview": "Klappentext: Denken Sie an einen Ort ohne Polizei. Eine Kleinstadt, aus der Jahr für Jahr Dutzende Menschen verschwinden. Spurlos. Der Ort für das perfekte Verbrechen. Zum Inhalt: Martin Schwartz, Polizeipsychologe, hat vor fünf Jahren Frau und Sohn verloren. Es geschah während eines Urlaubs auf dem Kreuzfahrtschiff \"Sultan of the Seas\" - niemand konnte ihm sagen, was genau geschah. Martin ist seither ein psychisches Wrack und betäubt sich mit Himmelfahrtskommandos als verdeckter Ermittler. Mitten in einem Einsatz bekommt der den Anruf einer seltsamen alten Dame, die sich als Thrillerautorin bezeichnet. Er müsse unbedingt an Bord der \"Sultan\" kommen, es gebe Beweise dafür, was seiner Familie zugestoßen ist.Nie wieder wollte Martin den Fuß auf ein Schiff setzen - und doch folgt er dem Hinweis und erfährt, dass ein vor Wochen auf der \"Sultan\" verschwundenes Mädchen wieder aufgetaucht ist. Mit dem Teddy seines Sohnes im Arm... Meine Meinung: Als ich vor Monaten durch Zufall auf Amazon gesehen habe, dass ein neuer Fitzek Thriller erscheint, war mir schon - ohne den Inhalt zu lesen - klar, dass ich es mir sofort kaufen muss. Auf der Buchmesse habe ich dann Sebastian Fitzek persönlich getroffen und mir angehört, was er zu dem Buch erzählt hat. Auch die Web Lesung über Lovelybooks habe ich mir angeschaut und er hat mich immer neugieriger gemacht. Ich konnte es kaum erwarten, bis das Buch erscheint. Und als es vor zwei Tagen, am 30.10. endlich soweit war, bin ich sofort in die Buchhandlung gestürmt und habe es mir gekauft. Das Cover ist ja schon mal der totale Eye Catcher. Mit dem Bullauge und dem darunter wunderschön gestaltetem Buch, hat es gleich diese düstere Atmosphäre, die man von einem Thriller erwartet. Den Thriller auf einem Kreuzfahrtschiff spielen zu lassen, fand ich eine grandiose Idee! Ich habe das Buch soeben ausgelesen und hab nur ein Wort dafür: PERFEKT. Eigentlich lese ich keine Thriller, aber Fitzeks Bücher begeistern mich jedes Mal auf's Neue. So auch \"Passagier 23\". Ich habe das Buch komplett am Stück gelesen (Natürlich habe ich zwischendurch kurz geschlafen ;) ) und es viel mir schwer mich loszureißen. Jedes Kapitel endet mit einem Cliffhanger. Man denkt immer: \"Oh ich muss weiterlesen! Was ist bei der Person jetzt passiert?\" Und dann liest man weiter und es geht aus einer anderen Sicht weiter. Somit fällt es einem wirklich schwer das Buch aus der Hand zu legen. Die unzähligen Wendungen in diesem Buch sind typisch für einen Fitzek. Er hat es mal wieder geschafft, mich bis zur letzten Seite im Dunkeln tappen zu lassen. Des Öfteren habe ich das Buch mit offenem Mund angestarrt und konnte gar nicht glauben, was er sich da schon wieder ausgedacht hat. Auf dem Buchrücken steht ein passendes Zitat zu diesem Buch: \"Sebastian Fitzek sprengt nicht nur den Rahmen der Realität, sondern gleichzeitig die Grenzen der Vorstellungskraft.\" - Christine Brand, NZZ am SonntagHierbei schreckt er vor nichts zurück. Dieses Buch beinhaltet mal wieder Perversität höchsten Grades und lässt den Leser nicht glauben, dass einige Dinge in diesem Buch wirklich der Wahrheit entsprechen. Mein Fazit: Dieser Psychothriller ist ein Must-Read für alle Thriller Leser und besonders für alle Fitzek Fans. Ich kann auf jeden Fall versprechen, dass es keinen Fitzek Fan enttäuschen wird! Dieses Buch ist spannend bis zur letzten Seite und ja... es ist wieder'mal nichts für schwache Nerven ;) Ein perfekter Psychothriller des Meisters der Thriller.Die Rezension ist auch auf meinem Blog zu finden: http://kimlovee123.blogspot.de/2014/1..."}, {"userName": "Julia", "userReviewDate": "Oct 17, 2017", "userURL": "http://www.goodreads.com/user/show/20443727-julia", "userReview": "[oder total irre (hide spoiler)]"}, {"userName": "Martu Barimboim (Booksofcoffee)", "userReviewDate": "Jan 27, 2016", "userURL": "http://www.goodreads.com/user/show/31624455-martu-barimboim-booksofcoffee", "userReview": "Increíble. No tengo palabras para describir este libro jugó indiscriminadamente con mi cabeza.Es totalmente un must read si les gusta el thriller. Y si nunca leyeron un thriller POR FAVOR empiecen por este"}, {"userName": "Alexandra Fritz", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/46011718-alexandra-fritz", "userReview": "Am Anfang hat es sich voll gezogen, aber das Ende war echt mehr als perfekt."}, {"userName": "Bren queleoar", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/61298683-bren-queleoar", "userReview": "Una novela impresionante que, desde ya les digo, voy a recomendar hasta el hartazgo. Martin Schwartz es un destacado psicólogo e investigador con un pasado fuerte y triste que, un día se ve sorprendido por el llamado de una mujer llamada Gerline que lo invita a embarcar el Crucero “Sultan of The Seas” tentándolo con un mensaje sumamente personal que a Martin le será imposible ignorar. Una vez que pise el crucero Martin descubrirá un entramado de crímenes y misteriosas desapariciones caratuladas como ‘suicidios’ que vienen sucediendo hace tiempo en diferentes cruceros. La reaparición de una niña pequeña que, se creía se había quitado la vida junto a su madre hace algunos meses en ese mismo barco, abrirá la puerta a una investigación hipnótica y cautivante que el lector no podrá de dejar de leer y cuyo desenlace jamás llegará a imaginar. Sebastián Fitzek es un autor que me encanta y confirmo después de haber terminado de leer este libro que es un gran maestro del thriller psicológico. La novela es adictiva desde la primera página y si bien puede parecer un inicio confuso, el autor suele presentarnos numerosas tramas, historias y personajes que, si bien parecen no tener mucho que ver las unas con las otras, llega un punto en el que todo se une, cobra sentido y no queda ningún cabo suelto. No le encuentro fallas al libro, lo disfruté en todo momento me mantuvo desconcertada todo el tiempo, y se me hizo imposible elucubrar y tejer hipótesis, puesto que todo va cambiando constantemente y cada final de capitulo te deja con la boca abierta necesitando leer más. El final está a la altura del desarrollo, de la tensión que se genera y superó muchísimo mis expectativas, me sorprendió y me volvió a sorprender al tal punto que necesite dejar de leer en cierto momento para asimilar las cosas que se estaban develando y que no esperaba bajo ninguna circunstancia. Lo recomiendo muchísimo para todos, porque es un libro para todo público, de esas historias adictivas y que se disfrutan de principio a fin, estoy convencida de que les va a encantar y sin dudas, después de estos acontecimientos, van a sentir algo de desconfianza y temor a la hora de embarcarse de nuevo en algún crucero…"}, {"userName": "Thessia", "userReviewDate": "Oct 25, 2017", "userURL": "http://www.goodreads.com/user/show/38845498-thessia", "userReview": "mein letzter Fitzek. Ich fand es zwischendurch so unglaublich langweilig, dass ich es eigentlich gar nicht mehr weiter lesen wollte. auch wenn das Ende okay war hat es mich nicht überzeugt!!!"}, {"userName": "Karin", "userReviewDate": "Nov 23, 2017", "userURL": "http://www.goodreads.com/user/show/62906775-karin", "userReview": "3,5 PunkteIch persönlich mag kurze Kapitel viel lieber als lange. Diese Vorliebe wurde bei den von mir gelesenen Fitzek-Büchern immer erfüllt. Jedoch kommt dadurch mein Schlaf meistens zu kurz – denn ein Kapitel geht ja immer noch :-)Für mich war die Geschichte zu Beginn spannend. Ich konnte aber schon ziemlich bald erraten, wie das Buch ausgeht. Normalerweise bin ich beim Erraten vom Ende ziemlich schlecht – aber dieses Buch war mir echt zu durchsichtig. Fitzek hat zwar versucht, dass er das „typische Täterbild“ in Thrillern komplett umzudrehen, aber mir war das offensichtlich. Auf den extremen Fitzek-Hype bin ich – trotz der kurzen Kapitel – noch nicht aufgesprungen. Drei von 4 Büchern waren für mich Durchschnittlich. Aber ein paar Bücher von ihm stehen noch auf meiner Liste ;-)"}, {"userName": "Annie", "userReviewDate": "Nov 20, 2016", "userURL": "http://www.goodreads.com/user/show/27547335-annie", "userReview": "3.5/5Ich habe lange überlegt, ob ich dem Buch 3 oder 4 Sterne geben soll. Es war, wie von Fitzek nicht anders zu erwarten, super spannend und hätte ich die Zeit gehabt, hätte ich es sicherlich in einer Sitzung beendet. Auch die Auflösung hat mir sehr gefallen, obwohl ich den letzten Twist dann leider kommen sah. Alles in allem ein super Buch, bei dem mir wohl das Setting einfach nicht so zugesagt hat."}, {"userName": "rebeccas.world.of.books", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/72575302-rebeccas-world-of-books", "userReview": "Diese Buch ist so ein pageturner 😱 von vorne bis hinten so unglaublich gut durchdacht, und spannend und mit so vielen verschiedenen Aspekten. Ich muss sagen ich glaube es wie mein neues Lieblingsbuch von Herr Fitzek. Einzige Kritik: ich fand das Ende ein wenig zu offen 🤷‍♀️ aber ansingend war es einfach wieder mal der perfekte Psychothriller :)"}, {"userName": "Vee", "userReviewDate": "May 07, 2015", "userURL": "http://www.goodreads.com/user/show/29857730-vee", "userReview": "Ach, ich mag den Autor einfach! Er könnte sonst etwas beschreiben und ich würde an den Zeilen kleben bleiben. Allerdings muss ich dem Buch \"nur\" vier Sterne geben, weil es zwischendurch doch etwas langatmig war. Aber das Ende - hallelujah!"}, {"userName": "Fragmentage", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/6621776-fragmentage", "userReview": "hm... mein erster Fitzek und irgendwie fand ich ihn weder besonders gut geschrieben, noch besonders spannend :/ Das Setting auf dem Kreuzfahrtschiff hatte mich sehr angesprochen, blieb dann aber reine Kulisse und wirkte nicht glaubwürdig im Gesamtzusammenhang, dazu ein paar eklige Schockeffekte à la Nordic Noir und ein unnötiger, konstruierter Twist am Ende. Alles nicht bahnbrechend für das Genre.Ich stelle fest: Von diesem Autor muss ich erstmal nichts anderes lesen."}, {"userName": "Paula ", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/19812205-paula", "userReview": "Y después de esta lectura, ya me declaro fan de Fitzek. La verdad es que lo terminé hace dos días pero me tomé el tiempo para escribir algo.Capitulos cortos, con cliffhanger que te dejaban con la boca abierta y tiraba por la borda cada hipotesis sobre el asesino, el plot twist del final fue excelente.Cuando lo empecé me desconcertaban los pov de personajes que no conocía y no sabía que tenían que ver, pero después el rompecabezas se arma y todo tiene sentido. Que el escenario sea en un barco lo hizo más oscuro y me gustó la información sobre desaparecidos en cruceros.Entre toda mi lista de sospechosos y mi teoría sobre lo que pasó con la familia de Martin jamás me imaginé esa revelacion ni tampoco lo de Naomi y Anouk.Todo lo que esperaba de un libro de crimen y suspense."}, {"userName": "MadameMelli", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/30681565-madamemelli", "userReview": "Ein grandioses Buch voller Wendungen. In jedem Kapitel wurde man mit etwas unerwartetem konfrontiert.Passagier 23 ist eine extrem spannende Geschichte, bei der Herr Fitzek sich wieder einmal selbst übertroffen hat.Ganz toll fand ich die Anspielungen auf vorangegangene Bücher, vor allem auf das Rätsel am Ende von \"Der Seelenbrecher\"."}, {"userName": "Carolin Wahl", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/43230028-carolin-wahl", "userReview": "Obwohl mir etwas die Tiefe und die Verbindung zu den Charakteren gefehlt hat: Kopfkino hat wunderbar funktioniert. Story war sehr spannend."}, {"userName": "Julie", "userReviewDate": "Jul 24, 2014", "userURL": "http://www.goodreads.com/user/show/27741289-julie", "userReview": "Seit einer Interview von Herrn Fitzek auf der FBM 2014, bei der er das Buch präsentierte, konnte ich kaum erwarten, dieses Buch endlich zu lesen. Wie bei Noah schon entfernt sich Fitzek langsam aber sicher von der düsteren Menschenpsychologie, die man bei Der Augensammler oder Der Seelenbrecher lieben gelernt hat. Passagier 23 ist ein sehr guter Thriller aber meiner Meinung nach kein Psychothriller.Apropos Seelenbrecher: Diejenigen, die immer noch nach der Lösung des Rätsels aus der Danksagung suchen und seitdem immer noch in einem Starrezustand sind, werden mit Passagier 23 endlich befreit ;)Die Handlung ist wirklich sehr spannend. Zusätzlich zur Thematik des Verschwindens auf hoher See behandelt Fitzek auch das Thema des Kindesmissbrauchs, was für weitere Emotionsschübe sorgt. Das Buch ist schwer wegzulegen, auch wenn die üblichen Cliffhanger zum Schluss der Kapitel weniger \"krass\" ausfallen wie in den vorigen Büchern. Es sollte also denjenigen gefallen, die diese Cliffhanger für \"übertrieben\" gehalten haben. Wie üblich sind die Kapitel relativ kurz, vor allem in den letzten 100 Seiten, und die Geschichte wird von verschiedenen Perspektiven dargestellt. So lernt man nach und nach alle anwesenden Figuren und deren Erlebnisse kennen. Die Figur von Martin Schwartz hat mir sehr gut gefallen. Trotz seine Macken ist er sehr liebenswert und man erlebt die Geschehnisse der Kreuzfahrt richtig mit. Die anderen Figuren waren mir ehrlich gesagt mehr oder weniger gleichgültig. Ich habe mich aber gefreut, von Diesel aus Amokspiel wieder zu lesen :) Den Epilog fand ich zwar als Antwort zum Prolog ziemlich wichtig, allerdings hatte ich das Gefühl, dass diese \"Zusatzgeschichte\" nicht so richtig zum Rest passte. Ich fand sie ein wenig unglaubwürdig, deshalb \"nur\" 4 Sterne.Wie üblich ist die Danksagung ein Genuss. Bitte unbedingt bis zur letzten Seite lesen, denn Fitzek hat dann noch eine Überraschung parat!Alles in allem war es ein sehr guter Thriller, den ich auf jeden Fall weiterempfehlen werde."}, {"userName": "Alexandra ", "userReviewDate": "Oct 19, 2014", "userURL": "http://www.goodreads.com/user/show/2982535-alexandra", "userReview": "Der neue Thriller von Sebastian Fitzek ist zwar gut, aber er reisst mich nicht regelrecht vom Hocker. Warum ist auch leicht erklärt, der Autor versucht mich mit denselben Finten wie im Seelenbrecher zu manipulieren. Nichts gegen Manipulationen in einer Geschichte, das ist die Hauptaufgabe eines Krimalautors, den Leser zu verwirren und den Mörder zu verschleiern, aber wenn er jedesmal versucht, mich mit derselben Masche aufs Kreuz zu legen: nämlich der dreifachen Wendung bei Täter und Opfer ca 100 Seiten vor Ende des Romans, dann ist die Überraschung auch nicht mehr überraschend. Ein bisschen weniger verschwurbelte Krimi-Ambiton im Plot wäre echt mal eine Innovation gewesen. Der Schauplatz des Romans und die Hintergrundgschichtln sind wie immer bei Fitzek grandios und sehr genau recherchiert - diesmal geht es um ein Luxus-Kreuzfahrtschiff auf dem reihenweise die Passagiere auf ungeklärte Weise verschwinden, was in der Realität auch ein immanentes dringliches Problem der boomenden Luxus-Reisebranche darstellt. Auf jeden Fall habe ich gelernt, wenn ich jemanden tatsächlich mit einem perfekten Mord um die Ecke bringen will, buche ich eine Passage am besten über den Atlantik und schubse das Opfer ungesehen über Bord. Keine Polizei für Tage auf dem offenen Meer, genug Zeit die Spuren zu verwischen und die Reedereien helfen auch noch zu vertuschen, da sie um ihr Milliardengeschäft fürchten. Herrliche Zeiten für böse Menschen!Fazit: Ein guter, sehr typischer Fitzek, aber bei der Plotgestaltung sollte er sich nun mal eine neue Strategie überlegen :-)"}, {"userName": "A Girl Has No Name", "userReviewDate": "Jan 03, 2015", "userURL": "http://www.goodreads.com/user/show/29402776-a-girl-has-no-name", "userReview": "Passaiger 23 ist wie gewohnt ein echter Page Turner. Fitzeks Talent für ein spannendes Tempo und unfassbare Cliffhanger bleibt unumstritten. Auch das Setting auf dem Kreuzfahrtschiff hat mir gut gefallen, da ich bislang noch kein Buch in die Richtung gelesen habe. Martin Schwartzer hat mir als Hauptcharakter sehr gut gefallen und ich wurde auf jeden Fall weitere Bücher um seine Person lesen wollen. Die anderen Charakter empfand ich im Gegensatz jedoch eher als flach. Natürlich gab es auch in diesem Buch wieder unerwartete Wendungen und ich war an manchen Stellen wirklich überrascht. Im Hinblick auf Prolog und Epilog finde ich jedoch, dass es vielleicht ein bisschen zuviel des Guten war; die Geschichte hätte auch gut ohne die besagten Teile auskommen können. Insgesamt hat mir dieser Fitzek besser gefallen als Abgeschnitten und Splitter, daher gibt es 4 Sterne."}, {"userName": "Nickyjen", "userReviewDate": "Jun 18, 2015", "userURL": "http://www.goodreads.com/user/show/35584119-nickyjen", "userReview": "This time it was an \"okay-read\" for me.It wasn't as good as some of his other books but I still enjoyed it! He definitely showed off his awesome writing style and he wrote about such disturbing issues which made me cringe now and then.I liked the concept of this book and that it's based on true facts for example that there is a certain amount of people on ships who completely disappear every year and without a trace! Very frightening!I definitely recommend this book (and all of Fitzeks other novels) to everyone who loves thrilling and kind of creepy books!"}, {"userName": "Azumi", "userReviewDate": "Feb 27, 2016", "userURL": "http://www.goodreads.com/user/show/14024451-azumi", "userReview": "Meh! error! No me ha gustado y es que no me he creido lo que me ha contado, todo muy pillado por los pelos...Le pongo dos estrellas porque a pesar de esto he llegado hasta el final, aunque solo haya sido para saber como acababa todo :("}, {"userName": "Mis Lecturas", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/34676758-mis-lecturas", "userReview": "En realidad un 3,5."}, {"userName": "Miłośniczka Książek", "userReviewDate": "Jun 10, 2016", "userURL": "http://www.goodreads.com/user/show/16130345-mi-o-niczka-ksi-ek", "userReview": "Mega! Musicie sięgnąć po tę książkę <3A żeby Was przekonać, że warto, zapraszam do zapoznania się z moją recenzją ^_^http://magicznyswiatksiazki.pl/pasaze..."}, {"userName": "Tanja Berg", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/5935491-tanja-berg", "userReview": "A rather pointless thriller about a grieving police officer, Martin, who is lured on a cruise ship to investigate the return of a missing passenger. Little Anouk turned up out the blue, after having been gone for two months. Her disappearance had been settled as suicide and homicide on the part of the mother. Unfortunately, Anouk is silent. The case bears an uncanny resemblanace to the disappearance of Martin's own wife and son, Timmy, a few years earlier. Martin has not come to terms with this and he is hoping that in solving the case of Anouk and her mother, the truth about the fate of his own family will come to light.The author writes quite engagingly, and many (most) of the chapters end in little cliff hangers. This gets old quickly. By the half way point I had lost interest and it never really returned. Although I found Martin sympathetic, I couldn't really connect with him or any of the other characters. Many things bothered me that had nothing to do with solving the disappearances. The motive is farfetched beyond belief. The one redeeming thing about this book is that is so easy to read that I feel I must have fantastic German skills. I know it isn't quite true - after all, I can't be bothered to cook together a review in German - but that's the only way this book brought anything to my table."}], "description": "Jedes Jahr verschwinden durchschnittlich 23 Passagiere spurlos auf Kreuzfahrtschiffen. Noch nie ist jemand zurückgekommen .... bis jetzt!Passagier 23Eine Transatlantikpassage wird zum Albtraum.Packender Psychothrill auf hoher See - ein Ort, wie geschaffen für das perfekte Verbrechen - ohne Polizei und ohne Entkommen.", "title": "Passagier 23", "url": "http://www.goodreads.com/book/show/22022939-passagier-23", "average": 4.03, "cover": "https://images.gr-assets.com/books/1398788781l/22022939.jpg", "reviews": 414, "authors": [{"url": "https://www.goodreads.com/author/show/190305.Sebastian_Fitzek", "name": "Sebastian Fitzek"}], "type": ["Thriller", "Mystery", "Audiobook"], "outlinks": ["http://www.goodreads.com/book/show/22022939-passagier-23", "http://www.goodreads.com/book/show/25933185-el-pasajero-23", "http://www.goodreads.com/book/show/27827166-passagier-23", "http://www.goodreads.com/book/show/28242797-passenger-23", "http://www.goodreads.com/book/show/23499009-passagier-23", "http://www.goodreads.com/book/show/26845666-el-pasajero-23", "http://www.goodreads.com/book/show/30170465-pasa-er-23", "http://www.goodreads.com/book/show/331653.Die_Therapie", "http://www.goodreads.com/book/show/7789265-der-augensammler", "http://www.goodreads.com/book/show/4842437-der-seelenbrecher", "http://www.goodreads.com/book/show/16156645-der-nachtwandler", "http://www.goodreads.com/book/show/28254289-das-paket"]}