{"ratings": 2034, "userreviews": [{"userName": "Lyndsey", "userReviewDate": "Oct 18, 2010", "userURL": "http://www.goodreads.com/user/show/4224396-lyndsey", "userReview": "[image error]"}, {"userName": "Sesana", "userReviewDate": "Mar 28, 2011", "userURL": "http://www.goodreads.com/user/show/5172893-sesana", "userReview": "[So he's the driver in a car accident that severely injures him and kills his best friend. The actual cause? His best friend's girlfriend's dog runs in front of the car. The poor best friend doesn't want his girlfriend to feel guilty about the accident, so he makes Jared promise not to tell her. Ok, fine. But couldn't Jared have blamed the accident on a squirrel instead of saying that he intentionally ran into a pole? (hide spoiler)]"}, {"userName": "Kelly", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/2276205-kelly", "userReview": "Charlotte’s parents are ghost-hunters who travel the country investigating (and debunking) the paranormal. In the past, Charlotte’s peers have treated her like a freak when they learned about her parents’ profession, so when Charlotte starts a new school at the beginning of senior year, she keeps it a secret. Avery, a popular cheerleader, lives across the street from Charlotte’s new home, and the two girls become fast friends. Finally, Charlotte thinks she’s going to have a normal life —that is, until ghostly presences start manifesting around her, and until it becomes clear that there’s a secret at Charlotte’s school that no one will talk about, not even Avery.Mara Purnhagen’s Past Midnight is a book I read in one sitting (and yes, I stayed up well past midnight to do it). The plot twists aren’t particularly shocking, but Purnhagen does a great job of raising the tension to nail-biting levels nonetheless. Charlotte is a likable protagonist, and the relationships (familial, friendly, romantic) are realistic and complex. The prose is transparent; it doesn’t draw attention to itself. It’s the kind of prose that stays out of the way of the story.If you’re tired of overwritten prose and the standard array of YA paranormal clichés, give Past Midnight a try. It’s refreshingly devoid of those things. It’s simply a good (and spooky) story. Ghost story fans will enjoy this one. The added element of ghost-hunter parents is fun, original, and promises a steady supply of plot hooks. The novel is short but reasonably priced, and I recommend it to YA readers who are sick of the same-old same-old."}, {"userName": "Miriam", "userReviewDate": "Aug 17, 2010", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "I'm using 2 in the goodreads-rating \"it was okay\" sense. There wasn't really anything to hate on in this book. The concept was interesting and the characters were nice enough, if a bit bland. It was a nice change to have a teens-at-school setting without outrageous bitchiness and douchery. Even the cheerleaders were nice! But the downside of this is that the conflicts get resolved too easily. The supposed \"main\" plot with the ghosts isn't developed enough and ends up feeling like a side note to Charlotte being an ordinary girl wanting to fit in and have a more normal life. I sympathized with her, but it wasn't very exciting."}, {"userName": "Brenda", "userReviewDate": "Jul 13, 2010", "userURL": "http://www.goodreads.com/user/show/754448-brenda", "userReview": "Charlotte Silver's parents are ghost debunkers. Yep I said ghost debunkers think Ghost Hunters on sci fi. Sounds interesting right. Yeah sure unless your a teen starting your senior year of high school. Charlotte doesn't want to be a paranormal problem solver she just wants to fit in and be normal for her last yr of high school, but unfortunately for Charlotte that isn't going to happen.Her parents travel all over the country debunking ghost stories and their latest stop is in Charleston SC, which just happens to be where Charlotte's older sister Annalise is attending college.They are trying to debunk some stories around the Courtyard Cafe and need the girls to help draw out the paranormal energy.Something happens while the group is in the Cafe that really freaks Annalise out and causes some uneasiness for Charlotte. So when the parents decide they want to go back to the Cafe the only way Annalise agrees is on the condition that they will settle down and stay in one place for a year so Charlotte can go to the same school for her entire senior yr. So when the family realizes that something from the Cafe has followed them home and that whatever it is seems to focus on Charlotte things start getting really weird. Or should I say weirder because things were already weird right?Because when your a teen and your parents are ghost hunters life is already weird...This is a very fast paced paranormal read that really does have some awesome spooky elements to it. I also think the secondary characters Avery, Jacob, and Noah also have a great story line going on. Even though this is geared toward teens I really enjoyed it myself. I would have to say this story is a bit more than your average ghost story it also about a young girl realizing that being different is ok. This is the first book I have read by Ms. Purnhagen but it won't be my last. I give this book 5 stars and if your looking for a spooky read be sure and look for this book due out Sept 1st."}, {"userName": "Krystle", "userReviewDate": "Aug 05, 2010", "userURL": "http://www.goodreads.com/user/show/2639204-krystle", "userReview": "Here’s something that I wasn’t expecting much out of that actually turned into something pretty good. Past Midnight actually brings something fresh to the table concerning ya paranormal stuff. This is not your typical girl gets haunted by a ghost in a creepy house story. It’s different in the sense that Charlotte’s parents are paranormal debunkers, like the ones you see on TV.What really made this cool was that the author definitely knew her stuff, by having them use EVP recorders, thermal heat imaging, camera works, blessings, and those kind of things to figure out what the heck was going on to her, instead of the usual “IT’S A GHOST!” And, because I’m such a wimp, I got scared. There’s this whole suspenseful mood going on and I creeped myself out. Eep.For such a short book, it jumps right into the plot and doesn’t drag. Despite what the premise says, there isn’t much of a romance in this book, perhaps very subtle hints, but it’s not something that turns into an eye-rolling subplot. The ending left me wanting more and I can’t wait to delve into the next story.If you loved the Devouring series, you’ll definitely lap this one right up."}, {"userName": "Jessica", "userReviewDate": "Sep 22, 2010", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "Past Midnight started out really nice. I was quickly hooked and curious to find out what the ghosts wanted from Charlotte and most importantly I wanted to know what really happened to Adam and what that big secret was that Jared wasn’t allowed to tell. Finally, when the time came and Charlotte figured it out I thought it was a pretty lame secret. I was really expecting something more dramatic.Be warned, there is zero romance in this book. Two cute guys are introduced and one of them seems to be Charlotte's prospective love interest but that’s all. So if you’re looking for something romance related this is not the book for you.To sum it up: nice story, unfortunately a little lame but I see quite some potential for the sequel."}, {"userName": "Lynne Perednia", "userReviewDate": "Aug 12, 2010", "userURL": "http://www.goodreads.com/user/show/388812-lynne-perednia", "userReview": "Past MidnightBy Mara PurnhagenYA paranormalHarlequin TeenSeptember 2010ISBN-13: 978-0-373-21020-6Intro: I know a lot about ghosts. More than the average person and way, way more than any other seventeen-year-old. Except for Jared and Avery, but most of what they know they learned from me this year, when things got crazy. I know a lot about things going crazy, too, thanks to my parents. They're paranormal researchers, and let's just say they like to bring their work home with them. And sometimess, their work follows them home.[italics:] For good.And so begins the tale of Charlotte, a girl who has been moved around by her parents her entire life while they making documentaries debunking ghost stories. Charlotte, about to begin her senior year, is the quiet one of the family. Her more beautiful older sister, Annalise, is the one who has on-camera experience being a trigger for energy that her parents do believe in, even if they don't believe in ghosts.But when the family checks out a restaurant in Charleston, S.C., it's Charlotte who the energy seeks. That energy will change what everyone in her family has assumed about their life's work.At the same time, Annalise helps talk their parents into staying in one place long enough for Charlotte to spend her entire senior year at one school -- a first. She makes friends for the first time. And, of course, these friends end up having problems for which Charlotte is particularly well-equipped to help.Charlotte isn't thrilled about being the trigger. Her reaction goes along with her feelings about her family; she's the outcast. She shows good teenager anger at this abrupt change in how things have always been. But even though she is upset about this, Charlotte and her family are refreshing in their ability to talk to each other about what's bothering them. There is one instance late in the story when this doesn't happen but that, too, is portrayed realistically. Overall, what a pleasure to read about characters who are related to each other and talk to each other without rancor.The other characters are as likeable as Charlotte's family. Her new friend Avery is a cheerleader who is not a spoiled snot and who is not a mean girl. Bad boy Jared has a secret but it is an honorable thing he is doing, no matter how badly it is hurting him. Even the mean girl at school is an interesting character who has the potential to be more than a one-note irritant. And there are nice geeky guys with hearts of gold.Mara Purnhagen has crafted a well-paced story in which things move along. The reader is not subjected to going over the same basic dilemma over and over again. Instead. she has presented in Charlotte a young woman who is coming into her own. She doesn't have to reject her family to find her own way, nor does she have to abandon anyone who was important to her before in order to welcome more people into her life. The subplot of what happened to her new friends before she arrived works well within the scope of how Charlotte's life is changing.The only drawback to this paranormal is that Charlotte discovers information about that energy in Charleston through dreams. This seems a cheat compared to everything else that happens. This drawback is more than compensated by the story's strengths. This includes the fact that, just when it appears that a secondary character may not be trustworthy, Purnhagen doesn't go there. And it works. As the story progresses, nearly every character, especially the adults, have to question what they thought was so. At least one refuses to do so. This also is handled very reasonably. And, because the series is set to continue, it's also terrific that everything is not wrapped up like the end of a half hour sitcom. It's going to be fun to read what happens next to Charlotte, her family and friends in the upcoming One Hundred Candles next March and Beyond the Grave next September."}, {"userName": "Shelley", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Rating* B-*Genre* YA Paranormal*Review*Past Midnight is the first book in the duly named Past Midnight series by Mara Purnhagen. The rest of the books in the series are named at the end of this review.17-year old Charlotte Silver hasn't been able to stay in one place for long periods of time because her parents are world famous paranormal investigators Patrick and Karen Silver who debunk ghost sightings. Charlotte and her older sister Annalise, even though they are part of the crew, have never been able to make any long term friendships. The longest place they ever lived was London when Charlotte for 4 years old. Annalise is actually the lucky one in that not only is she older by several years, but she is already in college in Charleston, South Carolina.So, what happens when Annalise finally breaks down after a rough shoot and says enough is enough that she’s had enough? Her ulterior motive is that it's not fair for Charlotte to move all over the place and not have any friends when she is going to be a senior this coming school year. Annalise, it seems, is tired of being the one who is sensitive to ghost energy and she’s had enough.Finally giving into the whims/wishes of their daughters, the Silvers, with their long time employee Shane, decide to give living in a new town for a whole year a try. The only problem is that something paranormal has decided to follow Charlotte home from Charleston. And, to top things off, they demand that Charlotte help them find their lost daughter from 1886!So, not only is Charlotte starting a new school, and finally making new friends like Avery Macintosh, Callie, and Noah. But, she is also expected to try and find a way to reconnect the family before they fade away because she is a so called trigger.Past Midnight is not really a spooky ghost story. Sure, the ghosts tend to get a wee bit impatient when Charlotte keeps putting off helping them, and sure they tend to insert themselves into Charlotte’s business when she doesn’t like a certain person, and sure they throw a hissy fit when James Silvers is alone in the house and time is running out before they fade away. But, they don’t go around killing anyone.Past Midnight is not a YA romance novel by any stretch of the imagination. Oh sure there is a hint of a former romantic entanglement between Avery and a bad boy named Jared. But, Charlotte doesn’t venture down that avenue until near the end of the book and then it’s mostly friendship with her fellow AV student who she may have a small crush on.No sex. No sex. No Sex. If you are looking for sex, uhm, did I say no sex? GoodOverall, Past Midnight is a fluff piece that masquerades itself as a YA ghost novel. It’s a quick and easy read in which you can finish it in one or two sittings. Charlotte isn’t the most likable character of all time, and her moniker of Paranormal Princess is something she ends up wearing proudly. But, this is after-all the first novel in the series, so, there is lots of room for growth and development.Mara PurnhagenPast Midnight1. Past Midnight (September 2010) 1.5 Raising the Dead (January 1st 2011)2. One Hundred Candles (February 15th 2011)2.5 Haunting the Night (August 1st 2011)3. Beyond the Grave (08/23/2011)"}, {"userName": "Nandini", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/3440570-nandini", "userReview": "Got an ARC of this book straight from Harlequin YA Paranormal, and I must say I was very pleasantly surprised by its quality and readability. Charlotte Silver is the oft-overlooked younger sister in a family of ghost hunters. This is less weird than it sounds. Charlotte's parents do not actually believe in ghosts, they're more interested in disproving claims of hauntings while being unable to explain away a couple of strange \"energy patterns\" they've come across in their career. Anyway, Charlotte happens to trigger some actual, somewhat malevolent sleeping ghosties during a filming session with her parents and older sister. The haunting begins in earnest as Charlotte begins to have cryptic dreams about a girl from the past century, and sinister thuds and thumps and thrown furniture begin to hammer in the ghostly message: find the dead girl, and somehow reunite her with her even deader parents.And meanwhile Charlotte copes with starting her senior year at a new high school where a mysterious tragedy occurred last year, a new friend with big secrets, a fight with her older and much more glamorous sister, the bitchy rival in the AV club and the cute boy also in the AV club... Standard fare for your typical YA novel, very deftly handled. The book's weakness lies in its very-vanilla themes and storyline: nothing big is at stake, nobody is evil, no one's life is risked and very little happens in the climax. YA books these days tend to push the envelope when it comes to dark themes and high stakes - for example, Sarah Rees Brennan's \"The Demon's Lexicon\" is in a completely different league compared to this. Perhaps it's not always necessary to go dark and dangerous to be a good book, but the low conflict level in this one did detract from my ability to care what happens to Charlotte. I always knew she would be fine.The book's strength is definitely in its solid narrative skills and likeable cast of characters. I can see why there will be two more books about Charlotte Silver. Recommended for younger teens."}, {"userName": "Jessica", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3345952-jessica", "userReview": "If you're looking at the post before this and thinking, \"What? There is no way she could have possibly finished this book so fast!\", I understand. However I assure you, I really did. Read below to find out why!Charlotte and her sister Annalise help their parents debunk \"ghost stories\" by proving their scientific origins. The question is: What happens if there is one that you just can't seem to disprove?As a reader, and I know I say this often, it is extremely important that I feel invested in the characters if I am going to truly love a story. That being said, Charlotte and Annalise are superb protagonists! Their personalities meld beautifully and you can feel the sisterly chemistry between them. I personally loved Charlotte! She was spunky, sweet and driven. What I was most impressed by was that even the secondary characters, like Avery and Noah, had an amazing story line and were well developed. It's hard not to find yourself drawn into their story.Past Midnight is a very fast paced and slightly spooky read. I warn you, if you are the type who has nightmares based on horror or suspense movies, you may not want to read this before bed. Although I don't think Mara set out with the intention to scare her readers, some parts of the book will definitely raise the hair on the back of your neck! I had to read another book for a few chapters before bed and even then I had ghosts haunt my dreams for the night. As I'm sure you can tell, I absolutely adored Past Midnight! The story is the perfect blend of ghost story, coming of age story, and sweet romance. If you're shaking your head in amazement, don't despair. That is precisely what I felt the moment I reached the ending of the book. Mara Purnhagen manages to mesh all of these topics into a well paced book that will have you reading as fast as you possibly can. Beautifully written and deliciously creepy."}, {"userName": "Steph", "userReviewDate": "Aug 11, 2010", "userURL": "http://www.goodreads.com/user/show/2142019-steph", "userReview": "Past Midnight\n was a quick, fun read. One I read straight through in one sitting. The story flowed nicely and I liked all the characters.This book tells the story of Charlotte Silver, a high school senior who's parents are paranormal debunkers. They've included their two daughters, Charlotte and her older sister, Annalise, making them part of their \"team\". Annalise is the one typically used on camera to lure communication with spirits while Charlotte tends to find herself behind the camera. On their current job at a restaurant, Annalise gets a bad feeling. That \"bad feeling\" seems to leave her, once her family moves, but is now being felt by Charlotte.Once in their new home, Charlotte is thrilled to know she'll finally have a full year at one school. To top off her luck, she almost immediately becomes good friends with her neighbor, Avery. Avery is popular and Charlotte quickly finds herself with a set of friends. She's determined to be the \"normal\" kid and not stand out as the child of paranormal hunting parents. Her plan is going great until she learns Avery's secret and the local cable company announces her parent's show in a full page article in their monthly magazine.The events that occur in the story cause several things to happen, one of which is Charlotte learning that she shouldn't be embarrassed by her parents' job and the other changes everything her family has believed about the paranormal up until now.This is a fun YA ghost story that also addresses the \"new kid\" syndrome. I will read on in the series.Thank you to NetGalley and Harlequin Teen for allowing me the opportunity to read this novel free-of-charge."}, {"userName": "Paige Keller", "userReviewDate": "Oct 31, 2017", "userURL": "http://www.goodreads.com/user/show/70610183-paige-keller", "userReview": "The book was about ghosts and spirits, but it was not frightening. It was more of explaining the background of experimenting spirits in certain places. It included some facts about real devices used in the real world even in a fiction book. This is a reader beware book because I am such a nerd on reading about ghosts or find these kind of topics interesting. Also, this a book for teens because it was a very easy read and a t a lower reading level than for adults. \tMara Purnhagen is the author of four young adult novels and two novellas. The books she wrote includes Tagged, Past Midnight, One Hundred Candles, and Beyond the Grave. As of right now, she does not have any accomplishments. She is not superstitious, but fears of cobras being in the bathtub. Also, during her high school years she was known as the band geek. Mara Purnhagen is known as a mom who writes stories and that was one of her dreams that came true. \t“Past Midnight” is a story about a young girl named Charlotte whose parents work on a show called “Doubt”, that try to dispute paranormal activities. Because of her parents’ job, they are constantly moving. After Charlotte and her older sister Annalise convince their parents to settle, Annalise goes off to college and Charlotte just wants a normal life. So she keeps her secret from her new friends, let alone they have secrets hidden from her, too. Charlotte can’t really keep her secret a secret anymore because there are two parent ghosts who are haunting her now and it is affecting her daily life; She is losing sleep and having nightmares. Charlotte and her family and friends aim to get rid of these ghosts, but they have to find their dead daughter first. So they visit the dead daughter’s grave who ironically is named Charlotte and her parents reunite with their dead daughter and both Charlottes are at peace now. Charlotte realizes that she doesn’t want a normal life and that the paranormal is her normal. \tThe character I liked the most was Avery because she was really kind to Charlotte on the first day she moved in. She introduced her and welcomed her to the school and made her feel included. She believed and trusted Charlotte and was a really good friend to her. The character I disliked the most was Bliss because she was straight up rude to Charlotte. Charlotte hadn’t done anything to Bliss and she would bring her down and get into arguments/fights with her. Even when Charlotte forgave her, she was blatantly rude. \tI really liked the setting because it was an average neighborhood and high school along with some restaurants in South Carolina. It relates to the plot line because the Courtyard Cafe and the pizza place had a huge impact on the characters because that is where they did their research in retrieving data from studying the energy in these places. The author described Charlotte’s house really well. She described how airy and light it was because all of the other houses they had lived in the past years looked like haunted houses that were dark and eerie. \tThe author uses a lot of flashbacks because when Charlotte had her dreams, she dreamed about something that happened in the 1800s. There was one major historical event that happened which was the hurricane in Charleston in the 1800s (I don’t know if it’s real or not, it could be a made up natural disaster). It affected the story positively because it helped form a plot line that lead to the major climax of the story which was solving the mystery of the dreams. The author also involved multiple conflicts that were being solved one by one throughout the story. It may seem confusing that there are different conflicts being solved at the same time, but the author portrayed the scenes very clearly. \tThe deeper element or lesson was that you shouldn’t lie to your friends or keep secrets from them because it will come out somewhere, somehow, eventually. The author got her meaning across effectively because Charlotte’s thoughts included that she should tell Avery her secret sometime soon because it will come out soon. Then it came out in the newspaper so Avery found out before Charlotte could tell her personally. There was definitely emotions of curiosity and sadness and fear. \tOverall, only some people will like this book. I don’t think it could relate to multiple people; it only relates to people interested in reading about ghosts and spirits. It does have a very creative story line. The plot overall was very interesting and showed, clearly, characters the reader should hate and characters the reader should love. Lastly, it is a book for teens and preteens because it is set in a high school setting and tennis could relate more to the characters on a more personal level."}, {"userName": "Chanelle", "userReviewDate": "Aug 15, 2010", "userURL": "http://www.goodreads.com/user/show/2802964-chanelle", "userReview": "This novel surprised me, and in a good way. At first, I assumed the novel would have a pretty basic plot on ghosts, but I love ghosts and all kinds of ghost stories so I was willing to give it a go, either way. It kept getting pushed to the back of my TBR pile, until one day I thought 'no, I'm going to read this today.' And I'm glad I did. It centres around Charlotte. A girl with slight insecurity issues, especially around her older, beautiful sister. Her parents make their living investigating paranormal sightings and disproving them, which I loved. It's a fresh spin on the whole reality/ghost show type thing. And Charlotte isn't really all that pleased with her parents' job as it involves moving around a lot never leaving her time to settle down and make friends. But after a particularly strange, freaky investigation in a cafe, the family agree to settle down for the year to allow Charlotte the chance to finish her senior year in one place. Which would be great if the ghosts from the cafe hadn't of followed Charlotte to her new town with demands of their own.What I really liked about this novel was Charlotte's desire to be normal. She craved it, and it is entirely realistic. As a reader, I was very sympathetic to her cause and I couldn't see her parents side when they would try to persuade her that their job was thrilling and a good thing. I found them to be very selfish. The blurb is slightly misleading as I expected there to be more of a romance than there was. But in a way, I'm glad the romance was set aside for the plot to shine through. We are introduced to a group of girls led by Avery, a well developed character who, for once, isn't the bitchy cheerleader stereotype. She has secrets of her own and a personality that shines through, sometimes more than Charlotte's. I liked Avery very much and whenever Charlotte would do something that could potentially ruin the friendship, I'd get upset. So Purnhagen definitely did something right there!We are given a bit of mystery as a side plot. There's a secret centred around one boy at the school and Charlotte is determined to find out the whole truth, not just the little pieces she is fed by Avery and her friends. When the final discovery comes about, it wasn't gasp worthy, but it made sense and it gave the story a new level. I would have liked for the ghosts to have been a little creepier. There were some things they could do that was never fully explored. And I have the sequel sitting here to read so I'm hoping they'll be explored then. I liked how the ghosts were described, but a scene at the end threw it all out of wack and it left me more confused than it should have. Charlotte's reactions to the hauntings were realistically done and well described. I'd have liked to have seen more haunting scenes, though. Purnhagen has a way of writing that makes you feel like you're in the story with the characters. The description is slightly lacking, and the prose isn't as nice as I've seen in other books recently. However, none of these points affected how much I enjoyed reading. Once I started I couldn't stop.I'd recommend this to anyone wanting a light paranormal read with a hint of mystery."}, {"userName": "Kai", "userReviewDate": "Oct 29, 2010", "userURL": "http://www.goodreads.com/user/show/3295955-kai", "userReview": "Original post at Amaterasu ReadsAre ghosts real? Ask Charlotte Silver.Her parents have made a name in disproving that ghosts exists. All her life Charlotte hasn't settled in one place, never having a chance to with the nature of her parents' work. They might be famous, but once people find out who Charlotte is and what her family does, she starts attracting all the wrong attention. All she wants is to be like a normal seventeen year old and not be treated as the Princess of the Paranormal once everyone finds out what her parents do.When a filming in Charleston went wrong, her older sister, Annalise, decides its time for the family to settle down in one place and finally make a home. The family heads over to Copper Court, living in a new house, and hopefully, its time for a new beginning for Charlotte. But when they left Charleston, they brought along with them something. The very thing her parents sough to disprove. Ghosts. And they're stalking Charlotte.The novel portrays ghosts as energies. There are no ghosts, but when we die, we leave behind energies, oftentimes in the places special to us or those that we frequent, and it is these energies we left behind that people sees as \"ghosts\". It's a very interesting concept/premise for a paranormal novel, and Mara Purnhagen was able to create a unique book combining paranormal investigation theories, elements and ghosts.Charlotte is a character we can all relate to. Her need to be \"normal\" is very understandable, growing up not belonging anywhere and not really establishing ties with anyone other than her family. Her longing to belong to something and establishing roots somewhere is evident in the book, going so far as to keep her identity a secret in an attempt to make new friends.Annalise, Charlotte's older sister is the big sister we all want to have. She's very sensitive to what Charlotte's been going through, and as an older sister did something about it, going to such great lengths as compromising with her parents and finally forcing them to settle in one place for Charlotte's sake. She's supportive and smart, and its no wonder why Charlotte sometimes feel jealous of her older sister. Annalise doesn't care what people will think of her, and faces problems with a smile, while Charlotte tends to hide and avoid it, being bothered that people thinks she's a freak because of what their parents do.I love how Charlotte's has a close knit family. They're a team, and though their lives are anything but ordinary, Charlotte's parents take into consideration what Annalise and Charlotte were feeling.Past Midnight is a very engaging read and a fantastic start of a series. Fast paced and thrilling, its a fun novel you shouldn't miss. Fans of the paranormal genre have to read this! I'm a slow reader, so I didn't make it in time, but this is a perfect read for Halloween as well."}, {"userName": "Danny", "userReviewDate": "Oct 29, 2010", "userURL": "http://www.goodreads.com/user/show/3254909-danny", "userReview": "This is more of a 3.5 stars.I enjoyed the book, this I can say truly. It's not a big mind blowing plot but anyway highly enjoyable. Charlotte, her sister and especially her parents are something like ghost-hunters, but not really. Actually, the don't believe in ghost and rather call them \"energy\". But they are pretty famous for this and the family moves around a lot, always looking for a new case. The film documentaries which is what made them famous in the first place. For Charlotte and her sister, this is not always fun. People tempt to laugh at them and since they are moving around a lot they could never really made friends. Why bother if you are moving again in a few month. Now, Charlottes sister is in college and the family meets in Charleston to investigate a possible energy. This time though, something strange happens - stranger than usual and Analise freaks out. Strangely, those events triggered some happenings that will keep Charlotte busy and frightened. The family also finally decides that it's time for Charlotte to have a normal live for once and stay close to Charleston at least for Charlottes senior year. This, of course makes Charlotte extremely happy! She also befriends with her neighbor - a Cheerleader from her school. What I liked the most was that here the Cheerleaders are not displayed as bitchy arrogant chicks but rather than normal nice girls that value friendship! I was always afraid that Charlottes friendship with them would fire back, but it never did! I liked Charlotte, she was an easy going and nice girl but then became more and more frightened by strange dreams and weird appearances and finally has to admit that something ghostly is going on and that demands her attention. The plot is divided in a few subplots, we have the ghost story from Charlotte but then there is also her friendship with Avery, which I enjoyed even more. Avery has some secrets and Charlotte has a feeling that she's hiding something. And, when we find out what it is I was shocked and surprised! Then, there is the boy at school : Jared who everyone treats like an total outside- nodody talks to him or even speaks about him. He's a sad and so lonely figure... But Charlotte doesn't get why? When she finds out - my heart warmed for Jared! Without mentioning any spoilers, I had some tears in my eyes several times. The only thing that was totally lacking was romance. I was always hoping for Charlotte to meet a guy or something but there was nearly nothing. True, there is Noah - a year younger and in her AV class, but well... nothing happens..really. Honestly, if the story would have had a bit of love for Charlotte I would have enjoyed it even more. But in the end it was a good read, great characters, great subplots (which were even more interesting than the main ghost story) and some great surprising twists. I will definitely read the next one too!"}, {"userName": "Chibineko", "userReviewDate": "Oct 28, 2010", "userURL": "http://www.goodreads.com/user/show/4436152-chibineko", "userReview": "Unless you've been studiously avoiding noticing such titles, there's no mistaking that paranormal teen fiction has enjoyed an enormous raise in popularity in the past few years. As such, more & more authors are putting out their own stories to thrill & entertain readers both young & old. (Let's be honest- teen fiction rocks regardless of how old you are.) With large amounts of similarly themed books entering the market it's difficult to find something that puts a different spin on things. Purnhagen seems to have found a good way to put a spin on the typical \"girl & ghosts\" story.Since the moment she was born, Charlotte has grown up in a family of ghost chasers. Not just any ghost chasers but famous ghost chasers with their own television show & bestselling books. While Charlotte will admit that some of the perks are awesome such as traveling all over the world, the rest of it isn't so glamorous. She'd give anything to be able to stay in one spot for a while so she can finally have a normal life with friends she didn't have to say goodbye to a few months after meeting them. When her older sister strongarms her parents into settling into one area for Charlotte using a recent ghost scare as incentive, Charlotte's sure that she'll finally be able to achieve normality. Unfortunately whatever seemed to have freaked her sister out has followed Charlotte. And it isn't leaving until it gets what it wants...While there's been a lot- and I mean A LOT- of \"girl & ghost\" stories out there, there hasn't been too many that have a reality ghost hunt show theme or plot element to them. Readers will enjoy this unique idea because it not only helps to set the book apart from a lot of similarly themed books, but it also helps to explain how Charlotte is exposed to ghosts & will continue to be exposed to ghosts. (This is the first book in a series.) Many will be able to commiserate with Charlotte's non-ghostly woes, especially the frustration about having to move & leave friends behind. Others will enjoy that Purnhagen didn't go for the \"cheerleader mean girl\" stereotype that many other teen books often employ. Charlotte does have the beginnings of a nemesis, but it's not a cheerleader & this girl actually seems to have somewhat of a reason to dislike her.However where the tale seems to lack is in speed. Things take a very long time to get started & for such a short book, that seemed to detract from the overall enjoyment. This wasn't a huge detractor, but enough of one that many readers will wish for things to happen a little more quickly.Overall though, the characters are great, the plot is interesting, & Purnhagen really does seem to be on the right track here with this series. This book deserves at least one good read (or three) & I can really see this becoming a favorite with many readers."}, {"userName": "Kt", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/3681846-kt", "userReview": "Charlotte Silver has had an interesting life. She's traveled all over the world with her ghost-debunking parents, never staying in one place for very long. All of that changes when they went to Charleston, and things go very wrong. Charlotte gains a set of spiritual stalkers that follow her to their new home. As if starting a new school while keeping her parent's occupation is hard enough, things get a little hairy when those spirits turn demanding. She's start to question everything she thought she knew about the supernatural and hope she figures a way to get rid of her stalkers before things get any worse.This book was a little lighter on the paranormal side than most books in the genre, but it worked very well. In fact most of the things that were happening, the parents kept trying to come up with rational explanations like the rest of their debunking methods. However, when push came to shove, they stepped up to the plate to help Charlotte, even going so far to contact spiritualists, something they never would have given the time of day for. I'm happy the author took thus route as it could have easily gone the other way considering her parent's beliefs. I really was glad to see a supportive set of parents, something that you don't seem to see in many YA novels.I had a hard time getting attached to these characters, especially Charlotte. They all just felt a little one dimensional leaving me feeling detached. I prefer stories to grab me from the start and suck me into caring about the characters and what was happening to them. Yes, there are some spooky parts that had me feeling not a little creeped out right along with Charlotte, but other than that, I just had no attachment to the story. I'm hoping that changes in the next book as there is a really great potential here, and I do like the premise behind it all, so if the characters form a little more depth I would feel a lot more invested.Okay so I did enjoy reading Past Midnight. Granted some of it felt to be a little \"fluffy\" at times, as well as a little predictable, but when it all came down to it, the book read quickly and held my interest. Perhaps I would have liked it just a little more if there had been a little romance or a least a tease of a potential love interest, but there wasn't really anything at all in that department. I'm hoping some possibilities open up in the future as I think that would really add to these books. I'd recommend Past Midnight to YA fans that like their books with just a touch of paranormal mixed in with a high school setting full of problems both mundane and supernatural."}, {"userName": "Robert Beveridge", "userReviewDate": "Nov 09, 2010", "userURL": "http://www.goodreads.com/user/show/766524-robert-beveridge", "userReview": "Mara Purnhagen, Past Midnight (Harlequin, 2010)I was in the middle of a dozen other things when I picked up Past Midnight, the first book in a new series by local author Mara Purnhagen. This is nothing out of the ordinary; I'm usually in the middle of a dozen other things. It's not all that often that I put them all aside and concentrate on one book, however, and that's exactly what happened here. I can't quite put my finger on why, but there's no denying the speed with which I devoured this. I took it down in less than twenty-four hours, despite those twenty-four hours containing a whole lot of other (non-book-related) stuff. Charlotte Silver is a normal teenager in a very abnormal family; her parents are world-renowned debunkers of the paranormal, with a host of books and a bunch of documentary ghost-hunting-style TV shows tot heir credit. They move around a lot, and thus a good deal of Charlotte's life is spent trying to mask who her parents are when she turns up at the inevitable new school at the end of each summer. At the end of summer vacation one year, however, Charlotte's older sister Annalise steps in and lays down the law: the two of them want Charlotte to have a normal year in a regular everyday house and one single high school, or Annalise will no longer help with the documentaries. The parents capitulate, and the family moves into a newly-built house instead of a supposedly-haunted Victorian horror. Charlotte is thrilled...until she discovers that a pair of ghosts from their summer vacation in Charleston have followed the family to their new digs. Charlotte doesn't believe in ghosts, but it seems a few of them believe in her...My favorite thing about this book is that in a genre that's more than saturated with paranormal romance novels, Purnhagen sticks to the “paranormal” and discards the “romance” altogether. Hallelujah. She is setting it up for romance farther down the line (it looks as if Charlotte's going to be torn between two guys at her high school, though the end of this book makes it pretty clear who she's going to end up with), but this is a simple ghost story/mystery, and it's a stronger book for that, I think. It shows that Purnhagen is at least willing to turn her back on some of the conventions of the genre, and with so many carbon-copy books coming out these days, that's sure to be a strong point. As well, Purnhagen knows how to start a book fast and keep the pace wavering between “pedal to the floor” and “breakneck”, which always makes for fun genre novels. Fans of the new breed of teen ghost stories will definitely want to check this one out. *** ½"}, {"userName": "Lauren", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/1676535-lauren", "userReview": "Ever since reading Mara Purhagen's fantastic first novel Tagged, I've been eager to read more by her, so when Past Midnight (her newest novel and a paranormal mystery at that!) showed up in my mailbox I was beyond ecstatic. And as it turned out that was just the right emotion to be feeling, because Past Midnight is an unputdownable ghostly paranormal read that I can't suggest highly enough for all you paranormal lovers out there! From the first page the reader is thrown into the world of Charlotte Silver, a girl who has never been exactly normal thanks to her famous paranormal investigator parents. But this year, Charlotte's senior year, is going to be different; she's going to be normal. Because not only have her parents agreed to stay in one place for the year but she's already making friends at her new school. But as it turns out everything is soon to unravel. Because not only is she being stalked by scary paranormal beings, but her friends are getting closer and closer to finding out about Charlotte's parents occupation and she just can't have that now, can she? So now she's on the path to find out who (or perhaps what) is stalking her and how she can get rid of them once for all, but when her friends find out about everything, will they stick by her side? More importantly: will she make it out of high school alive? And most important of all: Will she EVER be normal? Only time can tell in this rich paranormal mystery by Ms. Purhagen. Charlotte was a character I loved reading about, because, quite frankly, she was a pretty interesting girl. I especially loved the way she would go out of her to help her new friends, and the way she grew to understand that no one is normal or perfect for the matter, that you should just roll with the punches and live your life. My favorite secondary character out of the mix would have to be a tie between Avery and Noah, because both were characters that were not only fun to read about but ones I respected as well. The plot of this was nothing short of fun, though why wouldn't it be? I loved the way Mara intertwined facts about paranormal investigating right along with the ghostly sub-plot, because paranormal investigating is a topic I always love to read more about. Making Past Midnight even better in my eyes was Mara's writing, which moved in a fun, fast paced sort of way, just like in Tagged.In all, Past Midnight is a ghostly paranormal mystery and a fantastic start to a new series that I highly suggest you pick up the next time you see it in stores or online. Grade: A-"}, {"userName": "Mallory", "userReviewDate": "Jun 25, 2010", "userURL": "http://www.goodreads.com/user/show/2954519-mallory", "userReview": "First off how many of you are tired of constantly reading books that are 300-600 pages long and bulky? Really its hard to find a book that is under 300 pages anymore. I’m pleased to say that Mara Purnhagen’s Past Midnight is a wonderful paranormal novel that is under 250 pages! Past Midnight took me a few days to read and I enjoyed every second of it. Charlotte’s family moves around a lot because of her parent’s career as ghost hunters with their own T.V. show. One day something goes wrong at a place in Charleston, SC where Charlotte’s parents are filming. Afterwards Charlotte starts seeing strange things in her sleep and bedroom. Charlotte makes new friends in her new hometown. The first friend we meet is a girl how lives across the street from Charlotte. That girl would be Avery who has a secret that everyone in town seems to know about but will not tell Charlotte when she asks about what happened. Then there are two guys introduced to us. Theres Jared who is somehow connected to Avery’s secret. Then there is Noah who, if I remember correctly, is a good guy that cares about Charlotte and they seem to be on the path towards a relationship. Really though the only boy that stuck with me months later after reading Past Midnight is Jared. I really don’t remember anything about Noah. Sorry Noah! Jared just seemed more flirtatious and a better match for Charlotte. They had natural chemistry or something! Whenever Charlotte needed someone to talk to who would understand she’d call her sister Annalise. They are so nice to each other. Annalise was like a fairy godmother to Charlotte in certain ways. Along with Charlotte’s friends keeping secrets, Charlotte keeps that fact that her parents are ghost hunters a secret from her friends in hope that she can actually live a normal teenage life. Don’t worry though every mystery gets revealed at the end; which includes what happened with Avery and Jared and why are ghosts following Charlotte? Will Charlotte’s family secret stay hidden forever or will the town find out? My only suggestion would be to rush out to your local bookstore and see if they have a copy of Past Midnight available and buy it! I can hardly wait for Feb. 15, 2011 to get here so I can go out and buy the second book in the series One Hundred Candles."}, {"userName": "Orlanda Machado", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/26249033-orlanda-machado", "userReview": "Original Blog Review: http://landamac.weebly.com/blog/revie...My Blog: http://landamac.weebly.com My Instagram: http://instagram.com/blog.myescape/BookDepository Affiliate Link: http://www.bookdepository.com/?a_aid=... Actual Rating: 1.5 stars So let's set the record straight... I DIDN'T LIKE THIS BOOK.... NOT A BIT!I don't know what to call it, maybe torture is a good word... yes, an awesome word. This book was really bad in my opinion, I didn't like the way it was written, I didn't like the characters, I didn't like the plot, I didn't like the scenario... I didn't like this book - simple.I've never read anything written by this author and honestly I don't know if I want to read anything else written by her... I'm not thinking of reading the rest of the trilogy because I have some self love you know? I don't really want to die while reading it... I mean, why should I read books that I know that I'm not going to like when I have pretty interesting books sitting on my shelf waiting for me to read them?So if I recommend this book? NO... if I'm sorry that I read it... YES, I am really sorry... if there's a positive point? YES, there is... actually there is. The thing is, I started reading this book first, because it was pretty small and secondly because it was (supposedly) an horror book... BUT IT IS NOT AN HORROR BOOK... it is not scary at all and the main character is a stupid main character... so talking about that positive point?!... This book was small, so the reading was easy (even if it was kind of crap) and I read one more book for my 2015 reading challenge... SEE? everything has a good side!"}, {"userName": "Yan", "userReviewDate": "Feb 18, 2010", "userURL": "http://www.goodreads.com/user/show/1350957-yan", "userReview": "Charlotte has never stayed at a town long enough to complete more than a semester at school yet her sister, Annalise, is determined for Charlotte to graduate and finish her senior. That’s why after their last hunt at disproving ghost their parents and Charlotte are finally staying a full year in a town, in a school! But this brand new house Charlotte has always dreamed of has a few hidden ghosts that came with her and they are angry.I am easily scared. Like I get scared watching Scary Movie, which is meant more as a comedy than a scary movie, which is really pathetic in my eyes, but what can I do. So when I read Past Midnight pretty darn close at midnight with my brother popping in at random moments in my room I jumped. I freaked, okay. Quite honestly, readers won’t be too terrified but Past Midnight is still suspenseful and tension-filled even for those not scared of their own shadows.Mara Purnhagen does her research and writes about thermal machinery and EMF readers like she’s been at the scene directly hunting ghosts. Purnhagen debunks her own theories and creates new opposition to give multiple and various viewpoints of ghosts/lingering energies. The characters are dainty yet filled with a strong presence. The parents, thankfully, act like parents; friends act dotingly; sisters act like sister, and Charlotte acts like a heroine instead of a weak side-character. There is plenty of space left for development in the sequels to come, but there is enough depth that readers will not be too frustrated. The hint of romance is tasteful and the ending of Past Midnight was that happily ever after I was looking for without that eye-twitching, gagging sweetness. There are still questions needed to be answered and characters that need to be clarified, but overall a good beginning to an interesting series (a sequel that I am definitely waiting for)."}, {"userName": "Frannie Pan", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/20502251-frannie-pan", "userReview": "There’s nothing in particular to say about this book, really.Charlotte Silver is a normal girl expect for her parents’ job: they have their ghost-hunting reality show and they move a lot to do their research and make their documentaries; this until Charlotte feels the need of spending her last year of high school in one single place and they all decide to settle down in Charleston, where she hopes she’ll be able to be just like everyone else and not the paranormal-obsessed freak that previous schoolmates thought she was. Charlotte doesn’t believe in ghosts. Unfortunately, it seems that ghosts believe in her.Nowadays we’re surrounded by vampires, witches, werewolves, warlocks and fairies. What about ghosts? Where are they? Finally a book about ghosts! I don’t think I have ever read a book that talked about book, so I appreciated this one very much.It is a simple book of little more than 200 pages and I really enjoyed it for this. No insta-love, no heroines, no nothing. Just a girl with her family. Yes, her family. Because in this story Charlotte has a very nice relationship with her sister and her parents; they are present in their daughter’s daily life while lately parents seemed to always and conveniently disappear in YA novels to give more space to their kids.There may be a little crush in the end that will probably develop in the next book of the series but in this one there was room only for friendship and the right amount of “drama”.Overall, it’s a very interesting book, perfect when you don’t want to read anything too serious and just relax with a nice and simple story. It could have been a stand-alone but I’m curious to see if the author managed to keep the same carefree attitude in the next books; moreover, I want to find out more about this ghostly world, so I’ll definitely buy the other books of the series!"}, {"userName": "Wendy Cantu", "userReviewDate": "Jun 15, 2013", "userURL": "http://www.goodreads.com/user/show/7908169-wendy-cantu", "userReview": "Past Midnight wasn't a bad book. It was your stereotypical paranormal YA novel, but it lacked anything special to make it stand out in its genre. Charlotte Silver hasn't had a normal childhood. Her parents, semi-famous ghost hunters, and older sister Annalise, travel the world in search of debunking reported spirit activity. All Charlotte wants is some normalcy -- a permanent residence, friends, and maybe even a boyfriend. Her parents agree to buy a house and settle down long enough for Charlotte to complete her senior year of high school, but things end up far from normal. Something from an investigation over the summer has attached itself to Charlotte, and it's not giving up until it gets what it wants.It's all pretty formulaic. Charlotte is awkward, feeling like she doesn't quite fit in. She's not as pretty or \"sensitive\" as her sister, who is often used as \"bait\" to encourage spirit activity. She makes friends at her new school by trying to hide who she really is, but it's only a matter of time before her identity is revealed. Of course, her two identities must converge in order to conquer the main plot challenge and save the day.The only thing I can say that didn't fit into the stereotype was that Charlotte didn't really have a main \"love interest.\"Really, there is't a whole lot to say about this book. I was looking for something light and fun to read after reading a couple serious books, and this did fit the bill. I'm curious enough to read the next one, but there needs to be some serious character development."}, {"userName": "Reading Teen", "userReviewDate": "Sep 12, 2010", "userURL": "http://www.goodreads.com/user/show/3329955-reading-teen", "userReview": "I really enjoyed reading this book! Charlotte was a fantastic main character! She is smart and funny, and just seems like the girl-next-door; like someone that you would want to be friends with. The storyline was interesting and fun to read. Once I picked up the book, I only set it down once (because it was midnight) and looked forward to picking it back up the next day. There were so many different little mystery nuggets in this book. I love books that make you wonder what's going on, where you're trying to figure out the puzzle right along with the main character. All the characters in Past Midnight were enjoyable to read about. I loved that the popular cheerleaders in this book were nice and supportive and welcomed Charlotte into their group even though she wasn't a cheerleader herself. It was really refreshing not to read the same \"popular-girls-are-mean-and-nasty\" storyline. Mostly I just really liked watching Charlotte evolve as a person. I thought her sister, Annalise, did a fantastic job of encouraging Charlotte to face her problems head-on, and not be ashamed of who she was. And in the end, Charlotte realizes that there's nothing wrong with being different!Past Midnight is part of a series, but I didn't feel like it had \"Series Syndrome\" at all! It was a quick read, it didn't drag on and on, and it had a totally satisfying, wrapped up ending. One of the things I love most about this book is that it is TOTALLY clean! YAY! If you like ghost stories, or just really cute YA reads, I would definitely recommend Past Midnight!Andye (http://Readingteen.net/)"}, {"userName": "Murphy's Library", "userReviewDate": "Dec 05, 2010", "userURL": "http://www.goodreads.com/user/show/4350714-murphy-s-library", "userReview": "(from Murphy's Library - http://www.murphyslibrary.com/ - rated 3 and a half)This story is a little creepy, but it gets you in a way that is “haunted.” Charlotte is the daughter of a couple who produces a show about haunted houses, and she never stays at the same place for too long. When she moves for the sixth time in three years we start to read her story.When she finally got to stay at one place during eleven months, after her sister gave her parents some problems, she started being haunted by something that followed her home from their last place. Will she ever be normal?I felt sorry for Charlotte, maybe because I thought she was so weak at first. She’s a pushover, and I can relate because at some point in my life I had to do the same thing that she had: to stop being the yes kind of girl. She has to mature a little, maybe their constant moving gets a tool in her growing up, she keeps a secret of things that are important, takes time discovering things that are right under her nose and makes bad choices.I liked Annalise, her sister. I like how this character was build and I thought she was the perfect type of person to be a sister to Charlotte. Her parents are a problem for me, as I thought they were too self-centered.It is an involving book and the plot is really good. I just thought the characters could be either more real or completely paranormal. Some facts should be real but they were a little unbelievable—like how everyone was aware of Charlotte’s friend secret, but nobody bothered to tell her. How come everyone know something that should be secret?Overall, it was a good read."}, {"userName": "CrystalBookSnob", "userReviewDate": "Mar 26, 2011", "userURL": "http://www.goodreads.com/user/show/2909188-crystalbooksnob", "userReview": "I really like books that have to do with ghosts and hauntings. Sometimes they're fun, light and good-natured and others are super scary and gruesome. I would classify Past Midnight as the former because the main character is really comical about her paranormal-obsessed family and their ghost-hunting reality show. Since I also really enjoy a good mystery, this book was right up my alley! Ghost hunters trying to figure out the mystery of why some ghosts have decided to haunt their daughter. It was so fun to read because I always wanted to know what was going to happen next and if they had discovered more information when they were digging into the past. Charlotte, the main character who is being haunted by ghosts, is very embarrassed about what her parents do and had been teased about it at other schools that she attended. She prefers to keep that part of her life a secret until Halloween rolls around. But she soon finds out that her friends are more upset with her for not telling them the whole truth than the fact that her family is a little different. My favorite character in the book is the nerdy yet hot guy that is her partner in her AV class. I'm a really sucker for nerdy guys. He's a real gentleman who knows who she is, about her family and knew that she would tell him when she was ready. And his mom being a big fan of the Silver family is really funny!The story was set up very nicely and there was just enough character development for it to be a series! I'm super excited about the next one, which I already have waiting for me. It's a really fun ghost story that has made me very interested to see how it continues."}, {"userName": "Claire (Cem)", "userReviewDate": "Nov 15, 2010", "userURL": "http://www.goodreads.com/user/show/2712681-claire-cem", "userReview": "Review originally published at Cem's Book Hideout.I really liked this book, more so than I first thought I would. The book kind of has two main plots, the one involving Charlotte and the ghosts haunting her, and the other involving Charlotte's new friend at school, Avery. Personally, I enjoyed the storyline with Avery more than the ghosts-attacking-Charlotte one. I don't really know why, but I certainly had more sympathy in that part of the story than when the focus was more specifically on Charlotte. I liked the writing and the ideas, it's a little spooky and it has some very funny moments as well. It also very nearly had me in tears a couple of times. There is, as you could expect with a book about ghosts, a fair bit of grief, but it also has a heavy focus on moving on, on dealing with that grief and living, which I really liked.Charlotte is easy enough to relate to with her insecurities and desperate desire to fit in. But she also has a tendency to hide from her problems and hope they go away. She's quite passive and while that's her personality (and something she's working on, at least a little) I found it a bit frustrating at times. I prefer stronger characters who really go after things. But as it was her personality, and it's not a book heavy on angst despite the issues, I could get past it and keep going with her. And it's worth it because Past Midnight is a really good read! There are some really great moments and I'm looking forward to seeing what happens next in book 2, One Hundred Candles."}, {"userName": "Erica", "userReviewDate": "Aug 19, 2010", "userURL": "http://www.goodreads.com/user/show/2366949-erica", "userReview": "Ghosts are one of the paranormal creatures that I'm late jumping on the bandwagon for, and they're really starting to grow on me. Past Midnight was simply an absolutely adorable read, that is really the only way I could think to describe it. It's another fantastic read from Harlequin Teen.I love Mara Purnhagen's ghosts in Past Midnight. They weren't full on like ghosts like you are used to, but instead just more like a shadow or a voice or an object moving, so it was more just the energies of people. I thought that was so much more effective and more eerie. I really liked Charlotte's character. At first I wasn't as crazy about her, thinking she was going to be stereo-typical less favorite child, but she didn't turn out to play that role which was nice. Noah was a super fun character as well, as was Jared. I'm really interested to see what role those 2 play in future books, as with Bliss. I didn't like Bliss at all, but I think she certainly is an interesting character. I really liked Purnhagen's writing, it just had a really fun quality about it. This book was so light and I just breezed right through it. When I was reading it, it was simply the perfect read for the time.Past Midnight is a book I really wish I had picked up earlier. I had noticed it, but for some reason didn't pick it up. With it's fresh take on ghosts and fun cast of characters, Past Midnight is just one great read."}], "description": "Let me set the record straight. My name is Charlotte Silver and I'm not one of those paranormal-obsessed freaks you see on TV…no, those would be my parents, who have their own ghost-hunting reality show. And while I'm usually roped into the behind-the-scenes work, it turns out that I haven't gone unnoticed. Something happened on my parents' research trip in Charleston—and now I'm being stalked by some truly frightening other beings. Trying to fit into a new school and keeping my parents' creepy occupation a secret from my friends—and potential boyfriends—is hard enough without having angry spirits whispering in my ear. All I ever wanted was to be normal, but with ghosts of my past and present colliding, now I just want to make it out of high school alive….", "title": "Past Midnight\n      \n          (Past Midnight #1)", "url": "https://www.goodreads.com/book/show/7737852-past-midnight", "average": 3.66, "cover": "https://images.gr-assets.com/books/1285096786l/7737852.jpg", "reviews": 272, "authors": [{"url": "https://www.goodreads.com/author/show/3097903.Mara_Purnhagen", "name": "Mara Purnhagen"}], "type": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/7737852-past-midnight", "http://www.goodreads.com/book/show/8621466-one-hundred-candles", "http://www.goodreads.com/book/show/9188333-raising-the-dead", "http://www.goodreads.com/book/show/9132487-beyond-the-grave", "http://www.goodreads.com/book/show/11542006-haunting-the-night", "http://www.goodreads.com/book/show/6926414-tagged"]}