{"ratings": 8990, "userreviews": [{"userName": "Jessica", "userReviewDate": "Feb 12, 2009", "userURL": "http://www.goodreads.com/user/show/1359960-jessica", "userReview": "In this book you will meet Patty Jane and Harriet who are sisters living in Minneapolis, MN. These sisters have a bond that will touch your heart and they live a life that may just break your heart, but a heart cannot be broken without first having been filled to the point of bursting with joy and love. This book is chocked full of wisdom and love that is expressed through each character in its own special way. I don't think you will step away from this book untouched or without falling in love with the characters you meet. I was grinning ear to ear with happy tears in my eyes at witnessing the love Patty Jane and Harriet experienced. There were also times when I was crying to the point of having to put the book down in regards to some of the grief Patty Jane and Harriet had to experience.I think it's safe to say you will love this book!"}, {"userName": "Emily", "userReviewDate": "Sep 13, 2011", "userURL": "http://www.goodreads.com/user/show/3557606-emily", "userReview": "My mom recommended this book for me and I'm not quite sure why. The whole thing felt like it was trying too hard - every life event had to be chocked full with wisdom and little sayings. Each character had these \"charming\" eccentricities that are supposed to be endearing, but instead it felt like too much going on. Finally, even though the characters had many road-bumps along the way and plenty of sadness, none of it really felt genuine. Even the depressing moments felt chocked with sugary-sweetness.I would recommend this for someone who wants a light read and doesn't need much depth. My mom liked it and I do usually trust her taste, so maybe I'm missing something that is there."}, {"userName": "Relyn", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/1060439-relyn", "userReview": "I heard of this book often when it first came out. I even tried to read it at the time. I guess I just wasn't old enough to appreciate it yet. The humor is more subtle than I was ready for maybe? Or the storyline just too hmmmm... not twentysomethingish? I don't know exactly why I didn't like it then, but I know that I do now. I laughed, often. And I cried, too. Often when someone says that they cried at a book, they mean that they teared up. I usually mean that, too. But this time, I cried cried. The blow your nose and have red eyes kind of cry. It was such a happy cry, too. I don't want to give anything away, so I'll just say that it was when my favorite song was featured in a wedding. I guess you could say this book was a lot like real life. Peopled with characters that are both good and bad, quirky and normal. Lives that are happy and sad, but, most of all, full of love.  - - - a note about the narrator - - - Christina Moore read this book and she was wonderful. (I also loved her reading of Practical Magic.)"}, {"userName": "Suzyberry", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/4673025-suzyberry", "userReview": "Set in Minneapolis and around places I know well, this book hooked me immediately. Though I read it long ago, I fell in love with Lorna Landvik's style of writing...not to mention a really great story. Lorna writes in a voice that sounds like your best friends'...as though she's just across the table from you sharing a cup of coffee. It's a book I keep on my shelf and have re-read, something I seldom do. You will love the characters, the story-line and the easy drift of words as you turn each page. This is her best book ever. Summer read for sure!!!"}, {"userName": "Jessica", "userReviewDate": "Oct 07, 2008", "userURL": "http://www.goodreads.com/user/show/1209275-jessica", "userReview": "It was predictible and one of those easy reads...I did like it. It was well written, the characters were sarcastic, it was a good book to read when you weren't looking for a lot of substance...shorter chapters that captured your attention, but not requiring a lot of thought. I kept waiting for Avel to die from the get go...didn't expect on the wedding day...corny. And it was said that one of the sisters (trying not to spoil it) died of cancer in the end. We read this book for my BC2 as a tribute to Nancy, that just passed away from cancer. I didn't really need that in the book. Whatever."}, {"userName": "Chelsie", "userReviewDate": "Jun 13, 2008", "userURL": "http://www.goodreads.com/user/show/960694-chelsie", "userReview": "I loved this book. Very easy and quick to read. Have you laughing and sad - I just really liked it!"}, {"userName": "Kristen", "userReviewDate": "Jan 19, 2018", "userURL": "http://www.goodreads.com/user/show/6473739-kristen", "userReview": "I actually did like this very much as a beach book: very quick story with some good characters and not requiring much thought. And, I liked the Scandinavian flavor of everything from humor to baked goods to word choices and character traits (like leaving the room to avoid confrontation). Also, tackling a serious theme like alcoholism and showing a positive light on the AA process was a plus as was the interaction with Nora and her dad at the end. So, two stars for all of that. But, I was so sad that the one great character, Avel, had to leave the story after only a few chapters. His interaction with the women was the best part of the book. It went downhill after he died. Maybe his character should have been the manicurist. Also, I think I would have enjoyed the book more if there had been more bantering in the salon among the women (like in Steel Magnolias) than all the overly predictable series of crazy plot events. I agree with another review that said she felt like the book tried too hard; it definitely felt like that when Thor's story was revealed at the end (\"Misery\" came to mind). So, take this one to the beach, but don't expect too much.I have to note the best quote:  \"It's how we Norwegians are. It's hard for us to...to say certain things. We got so we even joked about it. Olaf used to have what he called the 'Vowel Theory.' To get our blood moving, he said, Scandinavians should breed with Iranians and Italians, Africans and Arabs; any person whose country began with a vowel.\""}, {"userName": "Amanda ", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/17692462-amanda", "userReview": "3.75 starsLorna Landvik is a Minnesota author, and she gets Minnesota right. Minneapolis and St. Paul, their landmarks, river and lakes, come alive reading this. The story is pure fiction to be enjoyed as such. A little unlikely / unbelievable at times, but touches the heart with humanity and realness at others. Sometimes funny, sometimes sad (I cried). Partly very predictable, while sneaking in a few surprises. I was distracted at times by typos, but the writing is witty and the story - heartwarming, with an inspiring vibe."}, {"userName": "Amy", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/9068-amy", "userReview": "I liked this book more than I thought I would. I assumed, when starting it, it would be a lighthearted read but it ended up having much more depth than I expected."}, {"userName": "Barbara", "userReviewDate": "May 29, 2017", "userURL": "http://www.goodreads.com/user/show/1456717-barbara", "userReview": "This is the second time I read this. I reread Landviks debut to prepare for the long awaited sequel that just came out. A story about 2 sisters and their ups and downs thru life and love. a great summer read!"}, {"userName": "Stephanie", "userReviewDate": "Oct 30, 2017", "userURL": "http://www.goodreads.com/user/show/45586909-stephanie", "userReview": "I read this book for the first time soon after it came out in 1997. I loved it, and did again the second time. I remember well that first read - as a mother of three, staying in bed all day because I couldn’t put the book down. The kids would wander in every so often and find me either laughing or crying as I read. The characters, somewhat eccentric, get to your heart and make you wish you could have been a customer at Patty Jane’s House Of Curl."}, {"userName": "Margi Duffy", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/28528604-margi-duffy", "userReview": "I first picked up this book because of the title..and I knew it would have to be about a bunch of women and their lives. And it was, It was all I thought it would be. funny, messy, funny and sad.What I thought was a predictable part turned out to be something totally different, and I was left wishing that that part was more detailed. It felt out of place at first but such good writing brought it all together.I love stories of women and their lives and especially women who are good friends no matter what."}, {"userName": "Barb Middleton", "userReviewDate": "Aug 03, 2013", "userURL": "http://www.goodreads.com/user/show/4361541-barb-middleton", "userReview": "\"Uff-da, mayda,\" says Norwegian Grandma Ione in Lorna Landvik's tale set in Minneapolis. My Grandma had many variations on \"uff-da.\" When the coffee was done percolating she'd jump up and run to the kitchen chirping \"uff-da meg.\" \"meg\" means \"me\" and her \"uff-da's\" were similar to \"oh no!\" or \"gracious me!\" The Germans would use \"achto lieber\" in the same way. Landvik captures the 1950's focusing more on the Norwegian and Swedish immigrants who settled in south Minneapolis than the Germans. My mother and mother-in-law grew up in the same area Patty Jane does in this tale. They, too, dealt with hardship and tragedy although Patty Jane has so much turmoil in her life it pushes the borders of credibility. The characters are so off-beat they kept my interest as opposed to an interesting plot that was predictable in many spots. Except for Thor. Anyone who says they predicted that plot twist is lying. Patty Jane is a potty-mouthed, strong woman who works hard to raise her daughter after her husband abandons her days before the girl's birth. Her sister, Harriet, is a chain-smoking good friend and the two go through hardships together along with Thor's mother Ione. Patty Jane and Harriet take up most of the narration along with some interesting minor characters. The salon as being a place of female empowerment doesn't quite come to life. The characters needed a bit more fleshing out for me. I couldn't quite visualize it although the gist of a group of supportive women and a man does come through. I did feel that my emotions were being manipulated too much. The women pull their life together and then something awful happens. They come together again before another tragedy. And on it goes so that my sympathetic \"uff-da's\" changed to a disbelieving, \"uff-da!\" My brows were raised more than once. But heck, the characters are fun; the setting is my hometown, and the accents I get, resulting in a quick, enjoyable summer read."}, {"userName": "Laura", "userReviewDate": "May 23, 2011", "userURL": "http://www.goodreads.com/user/show/3643725-laura", "userReview": "Another great book! The book revolves around Patty Jane and her sister Harriet, as they go through quite a few ups and downs. In Part I, they both are young, a bit naive, and in love but then tragedy strikes. But they support each other, keep trudging on, and then in Part II, they find their second loves...along with quite a few friends with Patty Jane's House of Curl.This book was definitely not some sappy romance novel, and while sad at times, overall was upbeat. And actually, it was pretty funny. My favorite character was Avel, a super-short rich man who the tall and lanky Harriet proceeds to meet and instantly fall in love with one afternoon. My #2 favorite would be Ione, Patty Jane's Norwegian mother-in-law, who bakes amazing desserts and often mis-speaks common English expressions. Overall, there were a lot of great quotes in this book that I wish I would have been writing down. (That's the downside of library books - can't really mark or turn down the pages.)One of the reviews on the back cover compared this book to Fried Green Tomatoes, and actually, though the setting is completely different, this book is pretty similar. It's even got a mystery, with the strange disappearance of Thor, Patty Jane's husband, that finally is resolved towards the end."}, {"userName": "Louise", "userReviewDate": "Mar 22, 2009", "userURL": "http://www.goodreads.com/user/show/2143983-louise", "userReview": "This is the second novel of Lorna Landvik's that I've read and was not disappointed. This novel was filled with such emotional warmth, humour, sadness, triumph and close, understanding bonds between women.Patty Jane and her sister Harriet are such colourful characters who know how to love and to forgive. I would have loved to have been part of Patty Jane's House of Curl and the womenly friendships they shared.From back cover:\"Patty Jane Dobbin should have known better than to marry a man as gorgeous as Thor Rolvaag, but she was too smitten to think twice. Yet nine months into their marriage, with a baby on the way, Thor is gone. It's a good thing Patty Jane has her irrepressible sister, Harriet, to rely on. For it's been said that a fine haircut can cure any number of ills, and before long the Minnesota sisters have opened a neighbourhood beauty parlor complete with live harp music and an endless supply of delicious Norwegian baked goods. It's a wonderful, warmhearted place where you can count on good friends, lots of laughter, tears, and comfort when you need it-and the unmistakable scent of somebody getting a permanent wave...\""}, {"userName": "Barbra", "userReviewDate": "Dec 06, 2009", "userURL": "http://www.goodreads.com/user/show/844127-barbra", "userReview": "I just adored this book - it was warm, tender, full of wonderful characters, funny and romantic. I laughed and cried and didn't want the book to end.Back Cover Blurb:Maybe Patty Jane Dobbin should know better than to marry a man as gorgeous as Thor Rolvaag,but she's too smitten to think twice. Yet nine months into their marriage, with a baby on the way, Thor is gone. It's a good thing Patty Jane has her irrepressible sister Harriet to rely on - not to mention her extremely short, extremely rich almost-brother-in-law, Avel Ames.It's been said that a good haircut can cure any number of ills, and before long the Minnesota sisters have opened a neighbourhood beauty parlor complete with live harp music and an endless supply of delicious Norwegian baked goods. It's a wonderful, warm-hearted place where you can count on good friends, lots of laughter, tears and comfort when you need it - and the unmistakable scent of somebody getting a permanent wave....."}, {"userName": "Carolyn", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/2384791-carolyn", "userReview": "Another great Lorna Landvik story, with all the whit of Minnesota humor. The two sisters Patty Jane and Harriet go through more ups and downs then they should be able to handle. As Patty Jane's daughter, Nora, says, \"but comparatively speaking, our family seems to have had a lot more terrible things than most people.\"You'd be laughing at the funny sayings of Patty Jane or her mother-in-law, Ione, and then in the next moment feel the loss of loved ones that each sister faces. Alcohlic parents, deaths of loved ones, alcholism, cancer. But they all came together in times of need.Salons with live harp music, baked goodies, learning seminars, and squables of ladies getting their hair done. Makes you appreciate the quirks and lessons learned that make you a family."}, {"userName": "Sarah", "userReviewDate": "Jun 08, 2016", "userURL": "http://www.goodreads.com/user/show/1748363-sarah", "userReview": "Many many years ago I read all of Lorna Landvik's books and loved them. Recently I put Patty Jane on my \"to re-read\" list and got right to it. And oh it was wonderful! Just a really satisfying story with lots of heartfelt moments and tragedy and triumph. I think it's funny (and kind of insulting) that the first sentence of the blurb on the cover flap says \"An easy-to-read story\". I'll be generous and assume they mean it's easy to read because the story draws you and you care for the characters, not that your brain can easily handle the story structure and vocabulary. I was surprised at how little of the story I remembered. I loved the midwestern Scandinavian details and I suspect I'll go on a nice comfortable jag of rereading some of her other cozy titles."}, {"userName": "Susan Fetterer", "userReviewDate": "Aug 12, 2011", "userURL": "http://www.goodreads.com/user/show/6023277-susan-fetterer", "userReview": "If memory serves this was the first Lorna Landvik novel I read. The Minneapolis metro area has a phenomenal writing community, numerous publishing houses and one of the country's best public library systems. I heard Minneapolis writer Landvik lecture several years ago and loved her humor and incisive wit which bursts through on the pages of this and her other novels. Her characters are fleshed out, a bit off-tilt, but really interesting and unusual. Humor is balanced with the more dramatic aspects of life, as most lives are."}, {"userName": "Amber Carter", "userReviewDate": "Sep 04, 2010", "userURL": "http://www.goodreads.com/user/show/3975776-amber-carter", "userReview": "As always Lorna Landvik wrote a book that made me cry. Sometimes reading a book to escape from everyday life is needed. Then again, sometimes reading a book about others surviving everyday life is what's needed. Lorna Landvik never disappoints to deliver characters that seem as real as an aunt or a neighbor. Real life lessons when it comes to love, life and enjoying all it has to offer. Another book on my shelf that is dedicated to the writings of Ms. Lorna Landvik."}, {"userName": "Chelsea", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/278477-chelsea", "userReview": "I am quite fond of Patty Jane's House of Curl. And this book is one reason I am quite fond of book clubs, and our library's in particular. This is a book I never would have picked up on my own. But, as a pick for November's meeting, I decided to listen to the book on audio. I must say, I semi-fell in love with the characters and just the whole book. Pleasant surprise for me! :)"}, {"userName": "Michele J", "userReviewDate": "Mar 24, 2012", "userURL": "http://www.goodreads.com/user/show/4986260-michele-j", "userReview": "I really enjoyed this book. It made me laugh and cry. The characters were all so quirky yet relatable. The only thing I didn't like was the fact that almost the entire plot of the book (including spoilers about certain characters)was on the inside of the dust jacket, which I always read. I would definitely read this author again."}, {"userName": "Deb (Readerbuzz) Nance", "userReviewDate": "Jul 25, 2009", "userURL": "http://www.goodreads.com/user/show/1654645-deb-readerbuzz-nance", "userReview": "Sort of a Norwegian Southern novel.  I tried this a couple of times, but I was determined to get to the end this time; I don't see what all the fuss is about."}, {"userName": "Kissa", "userReviewDate": "Aug 23, 2008", "userURL": "http://www.goodreads.com/user/show/1302307-kissa", "userReview": "Any story that takes place in a beauty salon has got to be good. That's where all the secrets are revealed, right? This was a fun weekend read. Not too long or too short."}, {"userName": "Amanda Adam johnson", "userReviewDate": "Jul 19, 2012", "userURL": "http://www.goodreads.com/user/show/11094764-amanda-adam-johnson", "userReview": "LOVED THIS BOOK!!"}, {"userName": "Sidney", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/28612540-sidney", "userReview": "Quick read. Reminded me a lot of Steel Magnolias. Nothing to jump up and down about; I found it very predictable."}, {"userName": "Veronica", "userReviewDate": "Sep 03, 2014", "userURL": "http://www.goodreads.com/user/show/1997090-veronica", "userReview": "I laughed I cried I loved every character"}, {"userName": "Barb", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/5417917-barb", "userReview": "Perfect time in my life to re-read this book! Listening to it was the best!"}, {"userName": "Darlene Christensen", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/35988327-darlene-christensen", "userReview": "Mary Jane and Harriet are sisters who grew up with parents who drank in excess with the sisters caring for the parents at the times of excessive drinking. Patty Jane married handsome Thor Rolvaag and became pregnant the night of her marriage. Thor had been out one night drinking in excess when he slips on ice and disappears before the birth of Nora. Harriet meets Avel Gains a rich man, becomes engages and dies in an airplane crash days before the wedding date. Mary Jane had opened a beauty shop and had good steady customers. One of her employees was Clyde Chuka a manicurist and artist in his spare time. Harriet meets Reese Brown, a policeman, and they marry. Sadly Harriet dies from cancer. Thor is discovered having lost his memory. Dr Temple Curry has been hiding Thor and caring for him. Mary Jane had found love with Clyde Chuka and they have a son named Harry after Harriet. Thor never recovers his memory of his family, but is happy building bird houses."}, {"userName": "viemag", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/50209106-viemag", "userReview": "Patty Jane's House of Curl by Lorna Landvik is a delightful read. Landvik tells the story of Patty Jane, her daughter Nora, her sister, Harriet, and her mother-in-law, Ione. It is at times sad and at times laugh out loud funny. The story is set in Minneapolis during the 1960's and has a strong sense of place, especially for readers who have lived or are currently living in the Minneapolis area. Landvik's characters are likable and very human so that when they suffer, their suffering is felt by the reader. A very enjoyable read."}], "description": "Patty Jane Dobbin should have known better than to marry a man as gorgeous as Thor Rolvaag, but she was too smitten to think twice. Yet nine months into their marriage, with a baby on the way, Thor is gone. It's a good thing Patty Jane has her irrepressible sister, Harriet, to rely on. For it's been said that a fine haircut can cure any number of ills, and before long the Minnesota sisters have opened a neighborhood beauty parlor complete with live harp music and an endless supply of delicious Norwegian baked goods. It's a wonderful, warmhearted place where you can count on good friends, lots of laughter, tears, and comfort when you need it--and the unmistakable scent of somebody getting a permanent wave. . . .", "title": "Patty Jane's House of Curl", "url": "http://www.goodreads.com/book/show/82976.Patty_Jane_s_House_of_Curl", "average": 3.86, "cover": "", "reviews": 540, "authors": [{"url": "https://www.goodreads.com/author/show/10020.Lorna_Landvik", "name": "Lorna Landvik"}, {"url": "https://www.goodreads.com/author/show/354773.Christina_Moore", "name": "Christina Moore"}], "type": ["Fiction", "Womens Fiction", "Humor", "Adult Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/82976.Patty_Jane_s_House_of_Curl", "http://www.goodreads.com/book/show/4332425-patty-jane-s-house-of-curl", "http://www.goodreads.com/book/show/1040546.Patty_Jane_s_House_of_Curl", "http://www.goodreads.com/book/show/16451.Patty_Jane_s_House_of_Curl", "http://www.goodreads.com/book/show/20941949-patty-jane-s-house-of-curl-ballantine-reader-s-circle", "http://www.goodreads.com/book/show/16249.Angry_Housewives_Eating_Bon_Bons", "http://www.goodreads.com/book/show/16449.Oh_My_Stars", "http://www.goodreads.com/book/show/16447.The_Tall_Pine_Polka", "http://www.goodreads.com/book/show/16448.Welcome_to_the_Great_Mysterious", "http://www.goodreads.com/book/show/82971.The_View_from_Mount_Joy"]}