{"ratings": 608, "userreviews": [{"userName": "Amy Bruno", "userReviewDate": "Sep 03, 2010", "userURL": "http://www.goodreads.com/user/show/1774372-amy-bruno", "userReview": "Penelope’s Daughter , written by Laurel Corona, takes Homer’s The Odyssey and flips it on its head…focusing instead on what happened to his wife Penelope, daughter Xanthe and son Telemachus during his absence, as narrated to the readers by Xanthe while she weaves the story of her life on her loom.Most of us know of Homer’s The Odyssey from required reading in school, but I have to admit that I don’t remember very much of the experience. I can say now that if it was as entertaining as Penelope’s Daughter I might have paid a lot more attention! It just took a few pages and I was caught up in Xanthe’s world with Corona’s entrancing style of writing and exquisite descriptions.My most favorite part was how the author began each chapter with Xanthe at the loom describing the colors she would use to represent a person, event or place that had meaning to her.On her brother, Telemachus: “He is woven in green, with little tufted knots of white, like the olive in bloom where we used to play when I was six and he was eight years old.”On her life in Sparta: “I took a charred ember from the fire and, going to the hidden side of my weaving I darkened what I had woven about Sparta until it was caked in black. Sometimes from the front of the loom I stare where I know the black is hiding, imagining little holes burning through the cloth. We think we can control the story we present to the world, but the truth always lies in the background, awaiting its chance to illuminate and scar.”This was my first read by Laurel Corona, but you can be bet I will be back for more! Penelope’s Daughter was one phenomenal book and I highly recommend it!"}, {"userName": "Sarah Mac", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/4490376-sarah-mac", "userReview": "Meh, I yield. It's not a terrible book -- but I don't care about the characters, the narrator's voice is bland, & the style is too episodic for my taste. The writing is pretty smooth (too smooth, perhaps?) & grammatically it's okay, so there's that much. Some of the descriptions are nice & there are a few pretty turns of phrase. But overall, nope. I'm not connecting with it.Since I'm not very familiar with The Odyssey, I can't comment on how well it ties to the original epic. But this much I'm sure of: Penelope sparked my interest more than her fictional daughter. We see nothing of Penelope other than what Xanthe mentions in her narration, but she has a more dramatic personality & her situation is more intriguing (IMO). I'd rather the author had focused on her instead."}, {"userName": "Lezidezi", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/7497082-lezidezi", "userReview": "I loved the mythology behind this story and bringing the characters from Greek History to life with them."}, {"userName": "WillowBe", "userReviewDate": "Jan 27, 2011", "userURL": "http://www.goodreads.com/user/show/1842059-willowbe", "userReview": "Liking it quite a bit. She has modernized Mary Renault's writing style. Though it's not as sumptious as Jacqueling Carey's prose. But really nice imagery. Written so that it's appropriate for teen readers, though. Just needs a little bit of something more for some oomph. But I like the unexpected turn the story has taken. Let's see how it ends.Update: The ending was a bit anticlimactic as epilogues always are. However, since a primary point was that women do not make things happen, but rather are acted upon, it makes sense that the ending should have this feeling. It echoes that point. After all, her story would only end when some male did something, and so it did. But I was disappointed in him;for all his vaunted cleverness, he had no idea what an extraordinary person he had fathered. But he was a cypher to his daughter, just as she was a cypher to him. But that was the way of things in Ancient Greece. Ditto the way the \"trairous whores\" were dealt with. Xanthe seemed to think they deserved it. However, those \"suitors\" would have raped them all long before if the serving girls weren't taking the edge of the men's lust. But again, that is Ancient Greece for you.Very lyrical writing; Corona resisted the urge to sensationalize- I was sure there would be girl-on-girl sensuality, but nope. Anyone who believes women can't be friends, only competitors, should read this book to experience the flavors of true friendship and love among women. I found this story captivating and had to really discipline myself not to read it all in two fell swoops. I was able to savor it and fully appreciate all its many flavors."}, {"userName": "Carol", "userReviewDate": "May 25, 2012", "userURL": "http://www.goodreads.com/user/show/3356446-carol", "userReview": "I really wanted to like 'Penelope's Daughter by Laurel Corona. I am a passionate reader of historical fiction. But the book fell flat for me. I love Homer's Odyssey. I read it in World Literature in college. I love the rich poetic images so much and also the vision of Penelope's devotion.The author did a tremendous amount of research as evidenced by the afterword and bibliography. I did enjoy reading about the important festivals in Greece such as the grape festival but I was so stuck on Homer's portrayal of Penelope that I did not feel comfortable about the different direction that the author took Penelope’s story.I liked that there was an excellent glossary in the back of the book to explain the Greek words and this book was easy to read. I did enjoy the references to weaving. I have never woven anything much I do have experience in putting designs in the knitted things which I think are related.What I didn’t like is that I didn’t feel very engaged in the book. I didn’t feel the fire and passion of the characters or the events. I feel sorry that I gave it only two stars, I rarely do. But what made the decision for me was asking myself whether or not I would recommend it to my friends. I would prefer that they read the original Odyssey instead. There seemed to be a lack of depth in the writing.Some people have given this book very high ratings, this is just my own personal reaction."}, {"userName": "Althea Ann", "userReviewDate": "Jun 22, 2011", "userURL": "http://www.goodreads.com/user/show/3846743-althea-ann", "userReview": "Another entry into the genre of stories from the point of view of 'forgotten women.'This novel proposes that when Odysseus left Ithaca, his wife Penelope was pregnant with a daughter never mentioned by Homer. Corona shines a light on what life may have been like for Xanthe, growing up in a difficult situation, never knowing her legendary father.Occasionally, I found details to be unconvincing for the time period, but overall this was an absorbing book, which brings to life the secret lives of ancient Greek women. Xanthe's story is more interesting and entertaining than many books of this type that I've read. A pitfall in writing this sort of thing is that oftentimes there's a reason that history didn't record the deeds of obscure people: they weren't that exciting. But this tale has plenty of adventure and tension."}, {"userName": "Mιss •kαthєяίиє•  Τhε Emεrαℓd Pяίиcεss®", "userReviewDate": "Jun 06, 2016", "userURL": "http://www.goodreads.com/user/show/2795642-m-ss-k-th-h-em-r-d-p-c-ss", "userReview": "I admit I was the tiniest bit expecting that this book would be awful, because how dare someone add such a blatant sub-plot to such an amazingly epic story. Penelope's Daughter is an excellent book turns out. Xanthe, the heroine, is so integrated to the main storyline of Odyssey, that by the end I was wondering why could Homer have missed adding such a plotline. Besides the obvious, Penelope's Daughter explores the way women lived and even delves further to their everyday activities and faith. I'm not an archaiologist so I am not sure over the overall accuracy of descriptions of that being honest to the time period, but it made a fascinating and truthfull reading, as in, \"I don't believe this can be fictional\".I enjoyed it thoroughtly."}, {"userName": "maggie", "userReviewDate": "Sep 01, 2017", "userURL": "http://www.goodreads.com/user/show/33455772-maggie", "userReview": "sometimes i feel like i could wipe my ass with a piece of paper and get that published in the new york times as a best seller . laurel, what on earth were u thinking.u really created a female character and make her entire life revolve around men trying to rape her. srsly u created a brand new character and u could have gone anywhere with her story. yet u made her hide inside a castle, forever weaving, because nasty old men want to rape her in order to take over the throne. u could have went ANYWHERE and u went here."}, {"userName": "Heidi", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/35924336-heidi", "userReview": "This is my book club pick. I loved the feminist perspective. I had no trouble reading this in a month's time...I usually get bored or too busy to finish books. I did not get bored! It's a bit explicit for my book club. I don't know how on Earth this would be classified as a teen read. I don't want my daughter to read it until she is forty! I read the Odyssey in high school and did not enjoy it. I am glad this author had the guts to redo a Homer classic."}, {"userName": "Stefaniab", "userReviewDate": "Nov 16, 2016", "userURL": "http://www.goodreads.com/user/show/12844552-stefaniab", "userReview": "Light but enjoyable \"what if\" story taking place during the time period of the Odyssey and Aeschylus' \"Electra.\" Though the heroine is the fictional daughter of Penelope and Odysseus, most of the story transpires in the post-Trojan War court of Menelaus and Helen. I particularly enjoyed Corona's depiction of Helen as seen through the eyes of heroine Xanthe."}, {"userName": "Laura", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/54801029-laura", "userReview": "The book started out pretty slow and took me a bit to fully get into it. However it picked up toward the middle and was an overall interesting and fun re-imagination of one of my favorites, The Odyssey. I loved that it was from the perspective of a relatable woman."}, {"userName": "Victoria", "userReviewDate": "Apr 19, 2018", "userURL": "http://www.goodreads.com/user/show/39373694-victoria", "userReview": "I did enjoy some parts of the book, but there were parts that felt long and boring. I feel like a lot more important stuff could have happened in the story. The book was still enjoyable to read, though."}, {"userName": "Tamara Agha-Jaffar", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/51003559-tamara-agha-jaffar", "userReview": "Penelope's Daughter by Laurel Corona tells the story of Xanthe, the ostensible daughter of Penelope and Odysseus, conceived before Odysseus left for Troy. Xanthe grows up in Ithaca until her mother decides to scuttle her off to Sparta for her own protection. Penelope orchestrates Xanthe’s supposed death and burial. Disguised as a young boy, Xanthe travels to Sparta under the care of Mentor. Once there, she comes under the tutelage of Helen of Troy who embraces her as a companion and daughter. Xanthe spends several years with Helen until Telemachus is sent to escort her back to Ithaca where she witnesses the return of Odysseus and his revenge against the suitors and the women servants who betrayed him. The novel ends with Xanthe’s betrothal to the love of her life, Peisistratus, the youngest son of Nestor.Since I love reading and writing about myths and the re-tellings of myths, I was looking forward to reading Penelope's Daughter. I wasn’t disappointed. It was an engaging novel with some interesting elements.Each chapter begins with Xanthe’s description of the fabric she weaves, explaining how each thread, pattern, and colors represent specific events, people, and phases of her life. Since weaving was the pre-eminent occupation for women at that time, the continuous references to weaving were interesting and convincing for the time period. Another strength of the novel was its focus on women: their daily lives, their friendships, their rituals, their activities, and their support of each other. It was refreshing to hear women’s voices and to see the world through their eyes as they carved a niche for themselves within the confines of a male dominated society. Reference to events and characters from Homer’s The Iliad and The Odyssey were skillfully woven throughout the narrative. These popped up at unexpected places, with the men behaving in ways true to their characterization in the original epic poems. But for the most part, men and their activities were treated as nuisances and interruptions from the all important focus of women and their activities. The only issue I have with the novel is with the characterization of Xanthe. She came across as insipid and dull, an uninteresting character more acted upon than acting. Granted, she lives in a heavily patriarchal society with little space to maneuver. However, both Penelope and Helen live in the same society and yet they are far more interesting and emerge as active, vibrant agents with no shortage of cunning up their sleeves. Penelope dupes the suitors by scuttling her daughter out of Ithaca right under their noses. And Helen has her own bag of tricks to navigate the events to her desired outcome. Even Hermione, the daughter of Helen and Menelaus, actively tries to change or forestall events, regardless of how misguided her actions or motives are. But Xanthe is a wallflower relying heavily on others to navigate the situation for her.Other than the shortcomings of Xanthe’s characterization, Penelope's Daughter is a well-researched and engaging read. With its description of rituals, the intricacies of weaving, the intermittent appearances of characters familiar to readers of the Odyssey, and its unflinching focus on the lives and activities of women, it will appeal to readers interested in breathing life into mythology, especially since it gives voice to those denied it in the original myths. Recommended, especially for readers who love mythology and enjoy the re-tellings of ancient stories."}, {"userName": "Marie", "userReviewDate": "Sep 09, 2010", "userURL": "http://www.goodreads.com/user/show/1170687-marie", "userReview": "Years ago in high school I was forced to read the Iliad and/or the Odyssey .. I retained nothing from the story though. Luckily for Homer, here comes Laurel Corona breathing new life into the age old tale, with her story of Penelope's Daughter. Xanthe is the daughter of Odysseus and Penelope, and with wonderful magnetism I was drawn to this tale of a young woman struggling to achieve her mother's affection. Once that occurred, she was forced to leave Ithaca in secrecy as protection against the men who were eager to take Odysseus' wife or daughter and kingdom for their own.Xanthe goes to her mother's cousin and childhood friend, Helen of Troy, in Sparta. Here she becomes a young woman under Helen's careful watch, and Xanthe loves her almost immediately. The customs of the times and of Helen's servants are described in detail and I was enthralled with the experiences of Xanthe as the author retells them in first person from Xanthe's sometimes jaded and naive point of view. Laurel Corona illuminates Xanthe's world of Ithaca and Sparta as she exhibits some of the trials of becoming a teenager. Laurel Corona re-imagines Homer's story and brings the women to the forefront of it, relaying the sexual awakenings of Xanthe and the worshipping of goddesses into a hypnotic story of Xanthe's journey towards her fate. Xanthe was a character that I could be sympathetic to, as she was born to a man that had already left her mother and disappeared for twenty years leaving his family behind in a tumultuous situation. Xanthe's life could never be her own since she was a princess, and for that fact alone she would not be safe until her father would return to reclaim his family. Building Xanthe's story, Laurel Corona inserts many new theories into the traditional story of the adventurer Odysseus, but I was intrigued most by the female characters that drove Corona's story, such as Penelope and Helen of Troy. The servants who were Xanthe's best friends and protectors were strong characters in the novel, and the disdain for Xanthe's brother Telemachus was a prominent undercurrent of its own. There was a lot of foreshadowing as Xanthe was weaving her story on her loom, which I found added another intriguing layer to the story in itself.There were not many strong or likable male characters in the novel, although the wishful thinking for Odysseus' return was seen as the one thing that could salvage all of their lives in Ithaca. Xanthe meets a man in Sparta whom she connects to, but her future is held in limbo as Ithaca awaits the return of Odysseus. Would Xanthe get what she wants upon that return? Would her mother, Penelope, be able to reconcile with the man that left her behind and caused such upheaval by his very absence? This well-researched story though is told with an aura of mythical times that blended fluidly with humanity's pain, triumph and upheaval. I found the ending to be a bit less passionate than I had expected, but the entirety of the novel was very well put together and helped bring a better understanding to an epic time period. I hope that the author honors us with more novels like this one, as I truly enjoyed the writing style and the vision of Laurel Corona and will definitely read more stories from her."}, {"userName": "Heather", "userReviewDate": "Sep 15, 2010", "userURL": "http://www.goodreads.com/user/show/2291692-heather", "userReview": "If you are a fan of The Odyssey you are sure to enjoy the events that transpire in this book. While the struggles of Odysseus to return home to his family following the Battle of Troy are not the focus of this novel – the life of his family at home, and also that of the life of Helen of Troy following the war, are expanded upon. We also learn that after Odysseus set off for war, his wife, Penelope, had a daughter that he never knew about. We explore Xanthe’s life throughout the twenty years that Odysseus is gone and it ends just after he returns home.Each chapter of the book begins with a description by Xanthe of a part of her weaving that she is working on. Xanthe has decided, while locked away in her bedroom, that she will tell her life’s story through a giant weaving. She explains choices for different colors, techniques, threads, and as you read on in the chapter, you can see how this weaving mirrors her life. It is a very interesting story telling device, although at the beginning of the story it did leave me a little confused.Xanthe can break down her life into three distinct sections – and the book is broken down the same way – Ithaca, Sparta, Ithaca. The first part, Ithaca, Xanthe is a very young girl. She doesn’t really understand the world that is unfolding around her now that her father has been gone for so long and the politics that are at play. I had some trouble getting into this section – it just felt a little more dry to me than the rest of the book. The second part, Sparta, is Xanthe’s life at the court of Helen of Troy. She was sent there to try an escape The Suitors. Here is where the story really picked up for me. This is where Xanthe really grows up and learns more of her role in life. Then the third part, Ithaca, is her return to Ithaca and the family reunites with Odysseus. It really is a coming of age story for Xanthe.The author creates a very vivid Greek world. The descriptions of the traditions, coming of age rites and initiations, and worship of the Gods and Goddesses were beautifully rendered and well researched. The characters that were very much marginalized in The Odyssey and even non-existent characters were fully fleshed out in the pages of Penelope’s Daughter. You were really able to see what drove them to the decisions that they made and who they were. One character whose story really blew my mind was Helen of Troy. Xanthe learns a lot about the circumstances surrounding why Helen went to Troy. You also get into the back story of Helen’s life prior to Troy. That was the most interesting and touching part to me.If you are a fan of The Odyssey or a fan of Greek mythology this is a book that should certainly not be missed. You will not be disappointed by the tale that unfolds and will be completely sucked into the story of Xanthe.This book was received for review from the publisher - I was not compensated for my opinions and the above is my honest review."}, {"userName": "Anna", "userReviewDate": "Apr 30, 2012", "userURL": "http://www.goodreads.com/user/show/2038521-anna", "userReview": "When I found a book in the romance section of the library about the daughter of Odysseus, I was all over that. The only issue is that when I got to reading it, I discovered this really isn't a romance novel. It's really more Xanthe's life story, a coming of age and a study of what life would have been like for the family left behind in the 20 years of Odysseus's adventures, especially for the women, limited as they were in a man's world. There is a love interest, but it's not their story, it's very much Xanthe's story.Look, plotwise there's not much here to talk about. Penelope's Daughter meanders, and there really isn't a coherent storyline to take you from point A to point B. This is a book that's all about the journey, the exploration of Xanthe, of her world and the people around her. There are an awful lot of legendary characters to play with here, to humanize and try to understand in a way Homer never did. This is the story of the female characters, of the lives they created with the limited options available to them.Which is not to say that this is a boring book or something not worth reading. On the contrary, I enjoyed it very much. Enough so, actually, that after I finished it and had started on the next book, I was still in \"excited to read this\" mode and found myself vaguely disappointed every time I had the opportunity to read a few pages more because I remembered that oh yeah, I'd already finished Penelope's Daughter. It's such a bittersweet thing when you read a book that you enjoy enough it actually influences your reading experience for the next book.There were a few overtly sexual moments that made me a little uncomfortable, since they didn't involve informed consent, but none of the characters seemed bothered by it, and both titchy moments were expressly part of a religious ceremony, so your mileage may vary.You'll note here how little I've talked about Xanthe's romantic interest. He's not completely insignificant, but there's a pretty good list of characters who are given more time and depth than Peisistratus (whose name I just had to go look up). Since the book starts with Xanthe's childhood and ends when she's around 20, he's not introduced until very late in the story, and while her excitement over him is obvious, there isn't a lot of emphasis placed on romantic feelings between the two of them.So really not a romance, but there are so many other characters to meet I was too busy to be disappointed by my own misled expectations. This is what I occasionally call a \"visiting\" book, the type of book you re-read just so you can stop in and visit with the characters again. And you can bet I'll be doing so."}, {"userName": "Carrie Slager", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/8854256-carrie-slager", "userReview": "For me, this book was a solid ‘meh’. There were some elements that were awesome and some that weren’t but the main reason for my indifferent reaction is the lack of emotional quality in Laurel Corona’s writing. I know Xanthe falls in love at one point. Do I really feel it? Not so much.My favourite part of the whole novel is probably the level of detail that was put into it. Laurel Corona seamlessly wove Xanthe’s story into the greater story of the Trojan War, bringing life into a character Homer never considered important. I loved all the little details about weaving but also the details of daily life in Ithaca and Sparta. The author has this way of describing things that makes you feel like you’re actually there. It’s a truly magical experience.One of the so-so aspects of the novel was the characters. Helen was fascinating and I can honestly say I would’ve preferred hearing her point of view than Xanthe’s. Xanthe is a rather bland character overall and as I said earlier I felt no emotional attachment to her. She got mad at times, was in love, felt true happiness, etc. Yet I, the reader, felt pretty much none of it. I was being told she experienced these things rather than experiencing them right along with her. The odd part was that I really felt for Helen so it could be a matter of personal preference. Who knows?The plot does drag in some places, particularly during Xanthe’s childhood in Ithaca. I love all of the little details to be sure, but some of them really just didn’t need to be there to understand the story. Sometimes Xanthe’s chronicle dragged when she was with Helen in Sparta and that was rather disappointing considering how amazing Helen is in this interpretation. Overall the plot was fairly good but I did feel let down at the end of the novel when Odysseus returns. It just felt like Laurel Corona was rehashing the myth without adding a new variation on it.Basically, meh. Penelope’s Daughter has some good and some bad in it. It’s worth a try if you think it sounds interesting but I wouldn’t go out of my way to convince you to read it.I give this book 3.5/5 stars, rounded up to 4 stars for Goodreads rating purposes."}, {"userName": "Jennifer", "userReviewDate": "May 17, 2010", "userURL": "http://www.goodreads.com/user/show/1698103-jennifer", "userReview": "I absolutely love books about Greek Mythology. A few months ago, I was perusing through the Penguin calendar on new releases, and I found this gem by Laurel Corona. At first, I was a bit put off that someone could write a book about one of the most popular stories ever told and make additions. Penelope and Odysseus could not have possibly had a daughter too! No no no! However, I was very interested to see how this would play out. Needless to say, I was not disappointed one bit by \"Penelope's Daughter.\" It chronicles the life of Xanthe, a daughter conceived before Odysseus left for Troy. In this story, Xanthe is brave, industrious, and wise unlike her brother, Telemachus. One problem I had with this book was Telemachus' role. Now, I am all for the Feminist ideal of having Xanthe be a hero, but poor Telemachus is portrayed as a lost boy with no father figure and who is pretty gutless.As Xanthe grows older, Penelope fears for her safety from the many suitors living in the megaron of Ithaca. Penelope secretly sends Xanthe to Sparta so she can be safe from danger. The best part of the book is the middle which includes Xanthe's tutelage under Helen of Sparta herself. The book takes a bit of an adult turn in the middle, which I did not expect but did appreciate. I like books that focus on the real rituals that have been talked about in other ancient Greek texts but hardly ever included. \"Some things are meant to be experienced once, and then remembered forever.\" (pg. 202) Corona introduces Hermione, Helen and Menelaus' daughter, to the story to show even more feminine perspective. This book is a fantastic read, but I will warn you, it is a slow one. I was in the mood for a slower book, so this fit right in. It may be too slow for others. As a work of fiction, I was impressed with Corona's imagery and imagination. I recommend this book to any lover of Greek mythology who wants to read something more about the women behind the scenes of the most popular stories. Jen's Rating: ****"}, {"userName": "Amanda", "userReviewDate": "Dec 10, 2010", "userURL": "http://www.goodreads.com/user/show/4193046-amanda", "userReview": "Penelope's Daughter explores the women of Homer's The Odyssey, specially Xanthe, the little-known daughter of Odysseus, King of Ithaca, and his wife Penelope who famously fought off hoards of suitors while patiently waiting 10 years for her husband to return from Troy. The novel is told through Xanthe's eyes, after she is barricaded in her rooms and begins to weave a tapestry of her life. As the threads come together, the fascinating story of Xanthe's life unfolds.When Xanthe was young, life was good in Ithaca. She and her brother were able to move freely throughout the island and interact with the people without issue. Then Odysseus went off to Troy to retrieve the infamous Helen from Paris' clutches, Xanthe became older and reached womanhood -and the world changed for Xanthe. She was escorted everywhere by guards, and leering suitors invade the palace, hoping to snare Penelope or her daughter. To protect Xanthe, Penelope sends her to live with an unexpected cousin in Sparta- Helen herself. As Xanthe settles into Helen's household, she grows into womanhood and find unexpected things about herself.Just as Xanthe weaves a fascinating tale of her life, Corona weaves a vivid, fabulously written story that paints a fascinating and little-known picture of the women of Homer. Finally given a voice, theses women finally get the opportunity to stand on their own and prove that they may have been misrepresented in Homer's classic epic poem, especially poor Helen. Corona's story telling and character development are masterful. It completely drew me in and kept me filling page right up to the very end.Though Penelope's Daughter is, at its heart, a coming-of-age story, it's a fascinating tapestry of the women of Homer and well-drawn exploration of a woman who is nothing more than a footnote. Ideal for fans of historicals set in the ancient world or for fans of female-powered literature."}, {"userName": "Bella Hendricks", "userReviewDate": "Feb 16, 2017", "userURL": "http://www.goodreads.com/user/show/28960418-bella-hendricks", "userReview": "I'm not normally a reader of adult fiction I'm more into YA but I've been wanting to give this genre more of a shot. I've had this book in my too read stack for years and finally got around to it. Honostly, for what it was it was very believable. It was certainly well researched and did an excellent job of maintaining the feel of Ancient Greece, in the way the people talked and acted and in the events that transpired. It had the proper feel to it for what it was and didn't feel too modern or out of place. Very well executed."}, {"userName": "Jennifer Jensen (Literally Jen)", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/2438813-jennifer-jensen-literally-jen", "userReview": "In \"Penelope's Daughter\", Laurel Corona offers a beautifully written women's perspective of the times after the Trojan War. I have read Homer's \"The Odyssey\" several times, and jumped at the opportunity to read this one once I learned it would be set in ancient Greece. I was also very drawn to the idea that Odysseus had left for war not knowing that his young bride Penelope was pregnant with his second child. This is Xanthe's story.Corona's version of Penelope's side of the story is very believable. Instead of pursuing Penelope's hand in marriage, the suitors are just lying in wait for Xanthe to have her first blood. To save her daughter from rape and inevitably disappointing marriage, she fakes Xanthe's death and sends her off to live with Helen of Troy, the woman responsible for Odysseus having left Ithaca in the first place. Helen becomes like a mother to Xanthe, teaching her the ways of a woman and how to worship the goddesses. Eventually Xanthe returns to Ithaca with her brother Telemachus and is reunited with her mother. The conclusion of the novel brings Odysseus home, and only then is Xanthe's future determined.My favorite part of this novel was the time that Xanthe spent in Sparta with Helen. I loved the way that Corona imagined Helen, and almost wished she had written solely about her instead of Xanthe. The women are definitely the focus of this novel, and Xanthe and Helen as well as some of the servant women are the most lively. I was really disappointed in Penelope; she didn't at all resemble the wife and queen that I so admired in the Homeric tale.I pretty much hated the novel once Odysseus returned. I adored him in \"The Odyssey\" and despised him in this book. I couldn't believe how Corona chose to conclude what started out as a really pleasurable read. This isn't the book you should be reading if you are partial to Homer's tale."}, {"userName": "Shelby Lee", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/3737963-shelby-lee", "userReview": "I guess it’s just because I read so much, and from so many different genres, but it’s always such a pleasant surprise to come back to a historical fiction novel. If you were to ask me right this moment, historical fiction is my favorite.If you get a well written hifi (let’s try to make this a thing), it means that the author has studied and read about and spent time dwelling in a specific period of history. My preference is ancient history, but anything can be good (if done well). When the author has soaked up all the information that exists, they can better see the holes we have no way of filling. They can see places where the story drops, only to be picked up later, and they begin to weave a way to connect these broken pieces. I love it.This book is very good. Of course, I’m already in a place to love it because I like historical fiction and I’ve always had a huge interest in ancient Greece. Even if you never gave either of those things much thought, I think you’ll appreciate this book.If you have any sort of educational background like I have, you’ve come across Homer and The Odyssey before. You’ve heard of Helen of Troy and Achilles and Odysseus. Even if these words just bring faint hints of recognition, you know the stories.When Odysseus heeded the call to go to Troy and bring back Helen, he left behind his young wife and son. Laurel Corona has looked at the ancient texts we have to describe this period and felt that something was missing. Perhaps Odysseus had a daughter. It certainly wouldn’t be the first time women have been written out of history. Here we have one authors take on filling in the blanks, and I personally think it is a super engaging and well written story."}, {"userName": "Briansmom", "userReviewDate": "Mar 17, 2011", "userURL": "http://www.goodreads.com/user/show/2089495-briansmom", "userReview": "I wanted to like this book. I have read and loved many historical novels, about people both real and fictitious. But there doesn't seem to be many hist. nov. set in ancient Greece, so when I found this, I was intrigued. Having read and studied Homer's Odessey in high school (more years ago than I'd care to admit) a \"reimagining\" sounded like a great idea for a story. Also, though I am not a weaver, I enjoy and practice other fiber arts and therefore have a great appreciation for the weaver's art. In fact, I think that the author's use of weaving both as Xanthe's creative outlet and as a metaphor for her life were the best feature of this book. Unfortunately, the book suffers from several problems. The author has an annoying tendency to assume that the reader knows things that are not made clear previously. Many times, I'd read a passage, and then think, \"huh?\" and have to go back and figure out who the people are, or exactly what she was referring to. I think that more careful editing could have made this a better, and far more readable, book. I also think that the author is inexperienced and therefore will develop a clearer writing style over time. I hope so! This period in history is fertile soil for really great stories. Heros, gods, goddesses, and demi-gods; not to mention immortals who just can't keep their fingers out of the workings of the day-to-day lives of mere mortals: a writer couldn't ask for better material than this!! Kudos to the author for the pronunciation guide and list of characters!! Next time, please also include a simple map."}, {"userName": "Charlie", "userReviewDate": "Nov 01, 2010", "userURL": "http://www.goodreads.com/user/show/2808380-charlie", "userReview": "The story set up begins a little slow but picks up pace as the tale evolves. I believe this is due to the necessary background given early on and also, the age of the main character, Xanthe. The background given is of great consequence and enriches the reader’s attachment and sympathy for the main character later in the story. I encourage readers to stick with it and enjoy the journey; after all, The Odyssey inspired Penelope’s Daughter. The tale of Penelope's Daughter truly begins when Xanthe leaves for Sparta. The portrayal and female point of view, especially when it comes to this story, is exquisitely executed. It shows the vulnerability, fears, exploitations, but also the strength, wiles and cunning awareness that women possessed and used to survive. A wonderful depiction of beauty and strength with a feminist revolutionary edge, but not unrealistic for the time. There are some beautiful depictions of celebrations, especially those pertaining to womanhood. I believe the Goddesses would be pleased. Laurel Corona successfully messes with Homer’s epic by bringing to light the bonds of women: their friendships, loyalty, fears, love, sexuality and the differences that separate them from men in the ancient world. This is a perspective rarely shown and it was superbly rendered and a pleasure to experience. Bravo!"}, {"userName": "Kristen McQuinn", "userReviewDate": "Mar 21, 2012", "userURL": "http://www.goodreads.com/user/show/289897-kristen-mcquinn", "userReview": "I really loved this book. It is set during the time of The Odyssey but is told from Odysseus' daughter's perspective. I liked The Odyssey, of course, but I had some issues with the lack of female characters of strength in it. I know that was just the way it was back in the day, so it's not really a complaint. But I am a sucker for classics retold through the eyes of women. All three main women - Penelope, Helen and of course Xanthe - are strong, flawed and believable. I especially found Helen intriguing. After Troy, she just came home with Menelaus and went on with her life. What else was there for her to do? She did it, and did it elegantly. I really enjoyed, too, Xanthe's story, and seeing her grow to womanhood. I don't know much about weaving, but I liked the way she told her story by weaving it. Maybe that was the only way it would really have worked, since I don't think she was supposed to be literate. Using such a feminine skill to tell her story, a skill that was a vital element of her life used to create functionality as well as a way to create beauty, fit in perfectly with the story, IMHO.I definitely recommend this book to lovers of classical epics, of tales retold, and of strong women."}, {"userName": "Beth", "userReviewDate": "Jul 07, 2011", "userURL": "http://www.goodreads.com/user/show/4075354-beth", "userReview": "Sadly, for me, this book was just okay. I tried and tried to love it, and I really thought I did, but this novel just paled in comparison to Corona's Finding Emilie, which was one of my favorite books read in 2011.I liked the setting and loved the idea of getting the backstory of the Odyssey, and Helen of Troy even made an appearance, which I loved! But I just didn't like certain aspects of the story, mainly the very superficial romantic relationship that she had with the prince. Their romance just felt very on the nose & unrealistic (you're beautiful, I'm handsome, I love you, let's get together!). I also didn't care for the girl-on-girl action. It was just a little much for me.I did love the details about spinning & weaving that opened each chapter. That was quite beautiful.Many reviewers seem to love this novel, so please take my review with a grain of salt. Perhaps I had set myself up for disappointment as her most recent novel was such an enjoyment to me."}, {"userName": "Little Pieces", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/13447266-little-pieces", "userReview": "Decepcionante. Empieza bastante bien, pero pronto pierde fuelle. Sobran muchas páginas de descripciones y situaciones mil veces contadas. Llega un momento en que parece que nos cuenta la vida de Helena más que la de la protagonista, la que, además, simplemente está ahí \"sufriendo\" la historia porque no aporta nada de nada. El libro hubiera sido igual sin ella. Los personajes, sobre todo ella y la propia Helena, se vuelven aburridos, repetitivos y demasiado perfectos. Además, la protagonista no tiene una evolución psicológica apreciable: a los dieciocho da la sensación de seguir teniendo trece.El final es horrible. La única parte que sostenía un poco esto era el esperado encuentro con Odiseo y puff. La segunda mitad ha costado mucho leerla. Ya era todo bucólico, perfecto, aburridísimo. Qué pérdida de tiempo."}, {"userName": "Liss Capello", "userReviewDate": "Sep 21, 2011", "userURL": "http://www.goodreads.com/user/show/6394786-liss-capello", "userReview": "I feel like if I had read this book when I was younger, I would have liked it more, but as it was I found it not particularly compelling. The author's re-imagining and filling in the spaces in the Odyssey is plausible enough, and that is perhaps its downfall: Xanthe (a character who could have existed, but is never mentioned in the original text) has a rich emotional life but she never really accomplishes much beyond exploring her feelings and acquiring technical proficiency in weaving. There is probably a lot of historical accuracy to the scope of her role, but unfortunately it did not make for an utterly engaging read. That said, I didn't hate the book, just wasn't in love with it, and I did very much admire the usage of weaving as metaphor, particularly in the conclusion where the comparisons between warp and weft threads are drawn."}, {"userName": "Mgv22", "userReviewDate": "Mar 27, 2013", "userURL": "http://www.goodreads.com/user/show/11567499-mgv22", "userReview": "I didn't enjoy this one so much. I was really into the idea of it, especially as I was finding a hard time finding many novels set to read and I was drawn to the emphasis on female characters. However, I found the protagonist, Xanthe, lacking in substance - it seems tome that her story itself is not as interesting as those of the characters surrounding her (most prominently of course this meaning Helen and Penelope). She is just an observer who perceives those around her in an noncomplex manner: immature (Telemachus), queenly but with depressive tendencies (Penelope), and tragically magnificent (Helen). Had the story focused solely on either Helen or Penelope, it may have been a better read. Instead, I found myself a bit bored overall - waiting for there to be some great action or romance only to be disappointed as both of these presented themselves in a curt manner."}, {"userName": "Gaile", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/3006785-gaile", "userReview": "The daughter of Penelope and Odysseus,Xanthe is born after her father's departure for the Trojan war. Ten years later when the war is over Odysseus doesn't return. Penelope afraid of the persistent suitors both for her hand and her daughter's sends Xanthe away for her own protection. Xanthe then falls in love. Of course we know the end that Odysseus returns and kills all the suitors some twenty three years after the start of the Trojan war. The story doesn't give us an explanation of why Odysseus was gone so long.There is also a description of pagan ceremonies devoted to the Goddesses, Hera and Orthis. (Artemis)The writing is dreamy making the reader feel she is indeed a part of the world of mythology except we now know not all that Homer passed to the world was fiction."}], "description": "The award-winning author of The Four Seasons retells The Odyssey from the point of view of Odysseus and Penelope's daughter.  With her father Odysseus gone for twenty years, Xanthe barricades herself in her royal chambers to escape the rapacious suitors who would abduct her to gain the throne. Xanthe turns to her loom to weave the adventures of her life, from her upbringing among servants and slaves, to the years spent in hiding with her mother's cousin, Helen of Troy, to the passion of her sexual awakening in the arms of the man she loves. And when a stranger dressed as a beggar appears at the palace, Xanthe wonders who will be the one to decide her future-a suitor she loathes, a brother she cannot respect, or a father who doesn't know she exists...", "title": "Penelope's Daughter", "url": "https://www.goodreads.com/book/show/7954712-penelope-s-daughter", "average": 3.58, "cover": "https://images.gr-assets.com/books/1279050598l/7954712.jpg", "reviews": 78, "authors": [{"url": "https://www.goodreads.com/author/show/155363.Laurel_Corona", "name": "Laurel Corona"}], "type": ["Historical", "Fantasy", "Fiction", "Fantasy", "Mythology"], "outlinks": ["http://www.goodreads.com/book/show/7954712-penelope-s-daughter", "http://www.goodreads.com/book/show/10808023-penelope-s-daughter", "http://www.goodreads.com/book/show/3121307-the-four-seasons", "http://www.goodreads.com/book/show/17586492-the-mapmaker-s-daughter", "http://www.goodreads.com/book/show/9756613-finding-emilie", "http://www.goodreads.com/book/show/3399766-climate-change-in-context", "http://www.goodreads.com/book/show/4324596-ukraine"]}