{"ratings": 9, "userreviews": [{"userName": "Paula Sealey", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/2650544-paula-sealey", "userReview": "'Perfect Strangers' is an entertaining read bringing the stories of three families in the coastal town of Fallenbay together.Isobel has arrived seeking the person responsible for her downfall who has been traced to the town. She has come with a clear mission and intends only to stay long enough to get the answers she needs, but she finds herself becoming friends with locals Cleo and Sarah. Cleo is busy running her cafe, little realising that there are serious problems in her children's lives. Sarah is about to get married, but is harbouring doubts over her relationship with husband-to-be Jon.The plot weaves their stories together as the three ladies begin their friendship; like a few episodes of a soap opera in book form really. At the start I had a bit of a job keeping up with who was who as there were so many characters and different stories playing out, but this got better as I became more involved with the different groups of people. The plot itself didn't hold any major surprises for me as I kind of guessed a lot of what was happening and who was responsible as the stories played out; I still found it enjoyable though, and really liked Erin Knight's portrayal of the three main characters.*I received a copy of the book from the publisher via NetGalley in exchange for an honest review."}, {"userName": "Janette", "userReviewDate": "May 12, 2018", "userURL": "http://www.goodreads.com/user/show/4119720-janette", "userReview": "A very interesting read highlighting the current obsession with social media. I enjoyed how the plot weaved between the three friends. The twists and turns throughout the book kept me absorbed until the very end of the book. Well written, I recommend this book.A really good read - I can't wait to read more from Erin Knight.Thank you to NetGalley and the publisher for the opportunity to read this book in exchange for an honest review."}], "description": "Discover the gripping new novel about powerful secrets and big lies, perfect for fans of Liane Moriarty and Tracy BuchananEveryone is allowed their secrets…aren’t they?Isobel arrives in the quiet Cornish town of Fallenbay determined to find peace – and answers – after her most intimate secrets have been splashed across the internet.Cleo thinks she’s happy running a small coastal café but has no idea of the trouble her children are getting themselves mixed up in.Sarah has finally put her horrible ex behind her and found the man of her dreams. Or has she?All three women have no idea how powerful their darkest secrets can be, and how they will change the town of Fallenbay forever..", "title": "Perfect Strangers", "url": "http://www.goodreads.com/book/show/36589576-perfect-strangers", "average": 4.0, "cover": "https://images.gr-assets.com/books/1522830882l/36589576.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/17966315.Erin_Knight", "name": "Erin  Knight"}], "type": ["Fiction"], "outlinks": ["http://www.goodreads.com/book/show/36589576-perfect-strangers"]}