{"ratings": 12468, "userreviews": [{"userName": "♡Karlyn P♡", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/1131400-karlyn-p", "userReview": "2* 'I deserve a BIG medal for making it through this one' Stars. First, let me get this off my chest: The heroine, Freya, was SO. DAMN. ANNOYING!PERFECT FOR YOU is a light and way-too-f'n-silly romantic contemporary where the heroine has a deep aversion to her hot, sexy, rich, nice, generous and damn-near-perfect neighbor Greg, who just so happens to be a lawyer. Because (according to Freya) all lawyers are bottom feeders with the single goal of hurting people. Makes sense right? No? Uh, not to me either. Which hence lies much of the problem with this story. It doesn't add up. Freya is struggling at work and has lost her creative edge, so she decides she needs to get laid in order to get her 'muse' back. She posts a personal ad, and the weird dates begin. Freya's little sister is convinced Greg is the right choice for her sister and sets about coaching him. He is a great guy and doesn't play her games, but he does take a few pieces of advice along the way. The sister continues to meddle with Freya's attempts to date by coaching the other guys into screwing up, which just adds to the oddity of this story. Freya continues to resist Greg's charming advances while she lobs insult after insult at him. Still, she does agree to let him woo her with nice dinners and agrees to have sex with him. Just to get her muse back. But she treats him like a boy-toy, and continues to date other guys even after she begins sleeping with Greg. Her denial over Greg really being a good-guy and not the crazy evil person she wants to believe him to be gets extremely frustrating, and her behavior towards him is so hard to watch without cringing. Greg, who really is waaay too good for Freya, is the best part of this story and why I gave it two stars. He was a great character but he deserved better. I listened to this on audio, and I will give props the narrator. She was excellent, just sad it had to be this story."}, {"userName": "Kellie Maddox-Ward", "userReviewDate": "Aug 23, 2012", "userURL": "http://www.goodreads.com/user/show/7309666-kellie-maddox-ward", "userReview": "[Freya and Greg end up coming to an \"agreement\" Didnt see that coming!They fall in love HEA  (hide spoiler)]"}, {"userName": "Alba M. ", "userReviewDate": "Mar 13, 2016", "userURL": "http://www.goodreads.com/user/show/51436903-alba-m", "userReview": "Lo tenía en el móvil y por eso he tardado tanto en leerlo.Estaba gratis en iTunes así que me dije venga reléetelo. La historia está muy bien, es una mezcla de romance, diversión y viejos rencores. También me encanta que a parte de la historia de Greg y Freya también metieran a Anna (la hermana de Freya) y Max el vecino... que dos.Mi único pequeño inconveniente es que la traducción no está en castellano si no que es más español sudamericano y por lo tanto tiene palabras que me chirriaban un poco. No es que me hicieran la lectura complicada o incomprensible pero se me hacia raro jajajaEs una historia para pasar el tiempo :)"}, {"userName": "Ria Lize", "userReviewDate": "Jan 01, 2013", "userURL": "http://www.goodreads.com/user/show/2055542-ria-lize", "userReview": "I tried to think of several ways to start this review, but I think going for simple and direct-to-the-point is best. But to sum up my thoughts: If I wasn't annoyed, I was bored. Perfect for You could not be any more not perfect for me.Reasons why I intensely disliked Perfect for You:1.) Freya has lost her muse, so in a flash of inspiration, she decides to post an ad that she is a lonely woman in need of a man. (Unfortunately, she sucks, so her best friend writes it for her instead).Her neighbor, Greg has always wanted her, but Freya has some silly prejudice with her neighbor because he is a lawyer, and a lawyer once betrayed her father. That apparently means ALL friggin lawyers are evil. I can understand if she'd hate that particular lawyer, but it seems a bit judgemental of her to say that every lawyer is conniving.2.) Freya dates multiple guys at once. I understand that she and Greg are not committed yet or exclusive, but the fact that she knows she likes Greg, has sex with him, but still kisses another guy (more than once) to see if she really liked him makes me lose a helluva lot of self respect for her. One thing I never want to read about is the fickle main character. I know she feels nothing for Connor, but to me, it's inexcusable that she would tolerate dating another guy, trying to lead him on and flirting back with him. Why would anyone do that? What if Greg was watching? How can she not consider how it would hurt him?3.) You know that moment in a film where the guy is caught with some other woman, but he isn't really cheating on the main female character, it's just that she was peeking at the wrong time? This book has that kind of moment. When Freya's sister, Anna, tries to sabotage her sister's dates, the hero is blamed for it, and she won't let him explain.I mean, he opens his mouth, but she just won't stop talking and everything else is shot down to hell. I can understand that she's pissed off, but she won't even hear what he's trying to say. I don't know why I continue to read these Amazon freebies. 75% of what I choose to read are mostly angsty romancy stuff (which get are often teeth-grinding and hair-pulling)f, 20% are just okay reads, while the other 5% are the real gems. -edit-Oh no, it's New Year. Here's to hoping I won't get be rating 2 star reviews the whole year. >.<"}, {"userName": "Mara De Guzman", "userReviewDate": "Feb 22, 2013", "userURL": "http://www.goodreads.com/user/show/5934255-mara-de-guzman", "userReview": "This is another freebie that I got on Amazon. It was okay. Okay, it was a bit more than okay but a bit less than great. It was funny and sweet and not bad for a free book.Good thing I didn't expect much from this, no disappointments. I kind of expected it to be an okay-read at the least and it turned out to be that.The story was \"yeah, sure\" and the romance between the two main characters looked like it was already happening long before this book happened. Yep, with this book alone, their sweet, romantic story seemed to be \"rushed\". They haven't officially been together for at least a month (or two) and they already got engaged?But I won't go too deep with this review, I'll take it as it is and say that it's an enjoyable one if you have time to spare in your day to read a book. :)"}, {"userName": "Lisa Kay", "userReviewDate": "Nov 19, 2014", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "★★★✩✩ (This is a review of the audiobook.) Xe Sands gives us a lovely narration. Good differentiation between characters and I liked her pacing and inflection. I was enjoying this lighthearted book until - bamb - a bit of a double standard occurred. In any book, if the hero did what Freya did, I think the readers wouldn't forgive him.Still, I'll go on with the series."}, {"userName": "Canan  ^^", "userReviewDate": "Mar 10, 2015", "userURL": "http://www.goodreads.com/user/show/6090884-canan", "userReview": "evvet bunun bir seri olduğunu tahmin etmiştim.. :Dneyse konu bu değil tabi :)hafif eğlenceli bir hikayeydi..."}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Jan 28, 2013", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "FREE on Amazon US today (4/12/2013)."}, {"userName": "tacitus", "userReviewDate": "Mar 22, 2013", "userURL": "http://www.goodreads.com/user/show/14135942-tacitus", "userReview": "I will admit that my opinion of this book is based on a very heavy pet peeve. If the setup to a story plot feels terribly artificial, I won't like it. Not matter how good everything else is. I just can't stand fake scenarios, mostly the ones that include artificial human reactions. Here it is:The heroine has lost her creativity and thinks that a steamy affair will get her \"creative juices flowing\". Okay. That's ridiculous enough already. Now the followup. She decides to find this steamy romance through a personals ad on Craig's List. At first, I thought the author was setting the heroine up to be some kind of relationship dunce, which was okay with me, but that's not what's going on here. The author treats this like a good idea and...so does all the heroine's friends. From her coworker, to her little sister, everyone's reaction to this scheme is \"Wow! Great idea! It's genuis!\" Really? I'm expected to buy that?In a believable scenario, the very idea of a personal's ad designed to have an empty sexual affair would be met with horrified gasps from your friends and family, then the fact that it would be through Craig's List would get you committed because that is DANGEROUS AND STUPID. Yet, no character in the story setup reacts this way. My THIS IS ARTIFICIAL CRAP alarm went off loud and clear. The rest of the book did not make up for this. In fact, it only seemed to get worse.I have read a lot of books like this recently, where none of the characters involved seem to have any moral opinions or hangups. The only characters who say something is \"wrong\" or whatever are the villains, the bad characters who represent a block to the hero or heroine. That's disgusting, and so is the setup to this story. Believe me, I am no prude. If I were I wouldn't be reading Romantic/Erotic fiction, but come on...."}, {"userName": "Tori", "userReviewDate": "Apr 14, 2012", "userURL": "http://www.goodreads.com/user/show/1327059-tori", "userReview": "This book was not bad. Not good, either, but all in all not bad. There were a few 'OMG you have got to be kidding me' moments, like a support character whose attraction was his Harry Potter glasses and the fact that he smelled like onions (I don't know about you guys, but usually when I say someone smells like onions, it's typically in reference to the fact that they need deodorant!) There was also a lot of potential, I enjoyed the characters, the banter was pretty good, and the story wasn't bad either. But, in the end, I don't know it just felt like it was missing something. Like that elusive ingredient when you're cooking something and it's good, but you know it needs a dash of something to make it really good, and you just don't know what it is. That's how this story felt to me."}, {"userName": "HJ", "userReviewDate": "Jun 06, 2013", "userURL": "http://www.goodreads.com/user/show/7698316-hj", "userReview": "Meh. Cute and sweetish, typical romance. Not bad, just nothing spectacular."}, {"userName": "Kathleen", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/10329036-kathleen", "userReview": "The thing I love about Kate Perry is her books are simple. Now, normally that would sound like a bad thing but don't get me wrong, I mean that in the best way possible. She does an excellent job of creating a world that's light and easy. There's always good chemistry and you always get your happy ending. I love reading books by Ms. Perry when I just need a little pick me up, and that's what her books do.Freya is a web designer in San Francisco who seems to be having a bit of designers block. When she's up against the possibility of losing her job, she knows she better get her \"mojo\" back and quick before she's out the door. Set up on her possible last project designing the website of an adult company, she puts an ad on Craigslist hoping to find a man to spark her creativity. In the midst of all this is her hot neighbor Greg who just may be the answer she's been looking for...that is provided she can get over that feeling of disdain she has whenever she's in his presence. This book is quick and the two leads have great chemistry. The sister annoyed me a bit but I suppose she was beneficial in the way the author wanted the book to go. I truly enjoyed this one as I do with most of Kate Perry's books. Plus, as an added bonus, you don't have to read them in order because they're all independent in the Laurel Heights series. This was book one but I didn't read it first and no, I didn't miss anything.4 stars."}, {"userName": "Loretta Kelly", "userReviewDate": "Nov 30, 2012", "userURL": "http://www.goodreads.com/user/show/14908186-loretta-kelly", "userReview": "S-S-S-S-Steamy!\"PERFECT FOR YOU\" ... is the second Kate Perry book I have read this month; except that there is much more sensuality in this one, she has not changed her writing style from the first book I read. If you are wanting read about spicy sexual activity, in locations you may have never dreamed of, with very little drama - then this is the book for you. This saga is based on Freya's need to regain her creativity for an ad campaign at work. The muse she turned to in order to solve this problem happens to be an attorney (Greg) - who's career Freya did not trust and hated with a passion. If it had not been for her meddling little sister, Anna - there would have been no plot at all. The Epilogue - 1 year later - was the best part of the book, for me.Will I read another Kate Perry book? Yes, I will. This book has the makings of a good romance movie for we \"visual\" people; once I recognized this, I was able to read it through to the end and enjoyed most parts of it."}, {"userName": "Burçak Kılıç Sultanoğlu", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/3699333-bur-ak-k-l-sultano-lu", "userReview": "Kolay okunur, sevimli bir aşk hikayesiydi.. Beğendim :)Freya'nın fazla inatçı olmasına ayar olsam da Greg karakterini sevdim :)Konu olarak web tasarımcısı Freya ilhamını kaybeder ve ilhamını geri kazanmak için aşk arayışına çıkar. Komşusu Greg bu kişinin kendisi olduğunu en başından beri bilir ve Freya'ya kendini ispatlamaya çalışır :D Romantik film tadında hoş bir kitap :)"}, {"userName": "Hayal Perest", "userReviewDate": "Dec 09, 2015", "userURL": "http://www.goodreads.com/user/show/28075920-hayal-perest", "userReview": "Bir dal Greg Cavanaugh alabiliyor muyuz? ♥️ Greg, sen ne tatlı adamsın yahu! Freya'nın inadı beni deli etmiş olsa da kitabı sevdim. http://www.hayalperestinzamanyolculug..."}, {"userName": "HÜLYA", "userReviewDate": "Aug 23, 2015", "userURL": "http://www.goodreads.com/user/show/5629547-h-lya", "userReview": "Sevimli bir hikaye idi ancak Sydney Landon'u daha çok sevdim..."}, {"userName": "Donna ~ The Romance Cover", "userReviewDate": "Sep 26, 2012", "userURL": "http://www.goodreads.com/user/show/11672704-donna-the-romance-cover", "userReview": "I enjoyed this book, loved the characters, a lovely romance story for us hopeless romantics."}, {"userName": "Min Li Li", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/5394864-min-li-li", "userReview": "Eğlenceli zaman geçirmek için harika bir kitaptı.Belki biraz Freya'nın inadı gıcık etmiş olabilir beni ama yine de okurken güzel vakit geçirdim. :D"}, {"userName": "Lori McD", "userReviewDate": "Jan 24, 2013", "userURL": "http://www.goodreads.com/user/show/5878249-lori-mcd", "userReview": "3.5+ starsCute freebie about a web designer who's lost her mojo... and she desperately needs it back to finish the designs for a big-time online adult store. It's not your run-of-the-mill porn shop; Freya (yes, named after the Norse love goddess) needs to get her own sexy love goddess back to finish the campaign. She's only got 4 weeks. This client could make-or-break her little San Francisco boutique web design company.Everyone knows that her upstairs neighbor, Greg Cavanaugh, is the right one to get Freya's mojo back. All except Freya. She's hung-up on the fact that Greg is a lawyer. Freya's doctor father was sued for malpractice, and his lawyer hung him and the family out to dry. On the way home from the judgement, her father wrapped the car around a tree with her mother inside, too. Freya lost what was left of the family money paying the lawsuit and accident costs. And she was barely out of high school, yet she had to take care of her younger sister, Anna.So don't talk to Freya about lawyers! But she still needs to find her sexy, so she puts a personal ad on craigslist looking for a god to bring back her sexy goddess (or some such thing - great wording!). Problem is, she gets a whole lot of weirdos!Freya inadvertently tells Greg about the ad while Anna's there. He volunteers, but she shoots him down. Greg knows there's a deep attraction between him and Freya. He wants to pursue it, but he's genuinely a nice guy... not willing to push or control Freya to get what he wants. Like any self-respecting person, Greg wants Freya to want him enough to make it happen.Anna, Freya's younger sister, decides that she needs Greg's help on 2 fronts: 1) Anna has decided she wants to be a lawyer, and she needs help breaking the news to Freya. Anna thinks if Freya falls for Greg, she'll get over her lawyer-thing. 2) Anna really thinks Greg & Freya belong together. But she's got to stall the guys that answer Freya's add that Freya is willing to go out with. And for that, she needs a bit of Greg's help.Greg helps once, but he feels so skanky doing it, that he refuses to help anymore. He does promise Anna he won't tell Freya what she's up to. And Greg also promises to turn up the heat towards his own seduction of Freya.Then there's the downstairs neighbor - the new guy. He's cute, young, and a Latino-looking Harry Potter (as Anna describes him)! He's also a chef, and Anna manages to push her way into his flat and his life. But Max isn't a pushover; he's got his own rules and plans. And somehow, he makes Anna better - even at her deceptions!We all know where this is going, right? But the getting there is SO MUCH FUN! There's one date between Freya and Greg in a jewel vault... talk about steamy! Made me see dessert possibilities in new ways!Fun, quirky, cute. It's one of a series of books."}, {"userName": "Guilty Pleasures Book Reviews", "userReviewDate": "Aug 07, 2012", "userURL": "http://www.goodreads.com/user/show/4391611-guilty-pleasures-book-reviews", "userReview": "Slick's review posted on Guilty PleasuresThis is my first time reading Kate Perry and I already know it won’t be the last. In fact, before I started my review on Perfect for You, I went to Amazon and downloaded the next two in the series. This was a fun and sexy story filled with some pretty interesting people.Freya Goodwin is a graphic artist who has lost her muse. She’s decided she needs to find someone who makes her feel sexy and help her get her muse back. She’s hoping a personal add on Craigslist will do the trick. She’s feeling the heat at work and can’t loose her job because she is putting her younger sister through college.Greg Cavanaugh is Freya’s upstairs neighbor and happens to want her. They previously spent one pretty perfect day together until Freya found out he’s a lawyer. Since then she won’t give him the time of day and since he’s pretty much convinced he’s in love with her, this drives him nuts. When he finds out she’s placing a personal ad, he realizes he’s got to take action.Freya’s little sister, Anna, has some pretty selfish reasons why she wants her sister to date Greg. She decides to “help” Greg and also drive away her sister’s other dates. After a series of “chance” meetings and some pretty great “dates”, Freya finds it hard to resist Greg. She starts getting back into the groove at work. They fall into a pretty hot and heavy relationship but then it all comes to a screeching halt when Freya comes across some information and feels betrayed.I found these two characters interesting and I very much enjoyed their combative relationship. It was evident from the start that these two have some major chemistry and it was fun to watch Freya realize that while she met some other fairly nice guys, chemistry is important. I loved that Greg refused to help Anna with her scheming and instead just continued to prove himself over and over to Freya. Anna’s love interest also added some extra depth and gave her good advice. Freya’s friend and co-worker Eve added some perspective and comic relief. This was a very enjoyable read with a believable plot, likeable characters, and some sexy lovin’ on the side. I can’t wait to read the next book in this series which is Eve’s story, I’ll be back soon with a review on that one. Happy Reading!!"}, {"userName": "SecretNinjaGRL", "userReviewDate": "Aug 25, 2013", "userURL": "http://www.goodreads.com/user/show/4990577-secretninjagrl", "userReview": "Okay, I know a lot of people are somewhat all over the place with their ratings on this book. It appeared to be that it was one of two options (for most readers): you either loved this book or you hated it with a great passion to want to burn it to hell and back.I admit, I liked this book. It was really sweet. Greg was determined but he wasn't like most books I've read where there is a complete alpha male and he isn't to be defied or questioned at any one given point in the book. In fact, he was portrayed as sweet, sexy, and confident male. He was so confident and laid back that it just added an extra layer of sexiness to his character. My heart broke for Freya and her little sister Anna with their family history and how they were treated in their past. Sorry, I'm trying not to be a complete spoiler in my review. ;) Nonetheless, I'm excited to read the remaining books in the series to find out what happens to these characters and the other supporting characters within this book. Sex sense were tame (bummer) but it was a well-written book and flowed well. And, did I mention that this was a free book on Amazon.com? Well, it was and still is!! Although I prefer a complete alpha male to come in to my life and dominate every ounce of me and my time, I damn sure wouldn't mind finding myself a Greg either ;)"}, {"userName": "Melanie Claudia", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/11821844-melanie-claudia", "userReview": "The story line was a bit blah. Nothing was detailed, like, you don't fully grasp what happened. Its about this web designer, Freya, who lost her muse. So, she puts up an ad on craigslist to find herself a man (to date? to sleep with? for company?) in order to get her muse back for a big project. Yeah I know what your thinking.. WHO does that? I mean, if that doesn't scream out S-L-E-E-Z-Y, i don't know what does. She also supports her younger sister through college. In the beginning, she appears to have some sexual tension with her neighbor, Greg. But she wont go out with him because he is a lawyer. Background story is, her father was cheated by a lawyer which led to an accident which killed her parents. There is also some weird obsession with Freya's nipples in this book.Moving on, Anna (her sister), wants Freya to hook up with Greg because Anna wants to go law school and she thinks Freya hooking up with Greg (who is a divorce lawyer) will pave way for her to tell Freya about law school (she is currently doing arts). All in all, it was an \"okay\" book. I cannot say I didn't enjoy it, but it lacked substance."}, {"userName": "Night", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/17500944-night", "userReview": "While looking through the list of books to read, I had passed by this novel a couple of times. At the time, the title just seemed a bit too cheesy for me; even now I still think so. However, based on the reviews, I decided to go for it. Someone has mentioned \"light\" and easy to read... just what I was looking for. But I think that what I really loved about it was the humor; I had quite a difficult time masking my laughter while reading this when the rest of the house was asleep. The heroine possessed a witty attitude without being too overly stubborn; she was believable and I like that. I also found the side characters quite well developed without straying too much away from the main story. I was afraid that the sister in the story would end up \"meddling\" too much and cause a predictable and unnecessary drama to unfold, but it didn't turn out to be the horrible mess I imagined. Overall, the story was sweet and a smooth read for someone who wants a casual but amusing plot."}, {"userName": "Princessquinto", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/7209788-princessquinto", "userReview": "Overall this book is ok, it's too predictable but I enjoyed it. Got me feeling excited but nothing really special about this book. I know how it'll end but kept reading just cause I'm so bored and needed something cheesy :))"}, {"userName": "Ronnie", "userReviewDate": "Mar 28, 2013", "userURL": "http://www.goodreads.com/user/show/9080699-ronnie", "userReview": "I will admit I did not like this book at the start. I found Freya to be annoying. But I’m glad I gave the book a chance to hold my attention.Freya is a strong, independent and very serious woman. At least that’s how she first comes across – stiff. Greg is what kept me reading. He is easy going, open and sexy as hell. And the chemistry between the two is apparent from the very first interaction.Okay so the book is centered around Freya and her need to get her groove back in the muse department. She has a big sexy ad campign coming up and her muse has dried up and her ideas fizzled instead of sizzled. Plus if she doesn’t get her muse back and this campaign isn’t successful she will be out of a job. And since she’s responsible for her sister’s college tuition, no work equals no money and means no college for younger sister Anna.And she finds her muse, a bit reluctantly, in the form of Greg Cavanaguh. After she places a personal ad that results in no sparks from the respondents. One of her problems with Greg is his career choice – he’s a divorce lawyer. Anna is also a welcome addition to the book. How she tries to sabotage Freya’s dates with the other men adds some levity and humor to the story and some need lightheartedness.Overall, Perfect for You is a good read. It managed to hold my attention despite a slow start. And there are plenty or sexy, spicy and sensual ways she gets her groove back muse-wise. But if you are looking for scorching the pages, extreme heat erotic or erotica then the sex scenes may not satisfy you. They are detailed but not graphic or overtly explicit. Some of the characters weren’t as developed or well-rounded as they could have been. And there were some parts I found childish (like the lawyer hang up). And the romance between Anna and Max was cute. I hope they get a novella where their relationship is explored more. So will I read another Kate Perry book? Yes. Ms. Perry is a good writer and her writing refreshing. This won’t be the last Kate Perry book I read."}, {"userName": "Gisele", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/21817145-gisele", "userReview": "4.5 solid starsFirst time I read anything from Kate Perry and it was a lovely surprise. Thanks Kobo Store for recommend it to me, very grateful.I should probably be beating myself for liking it, because this is a series and now I'm feeling like I should read the others 9 books.. Where will I find the time to accomplish it is beyond me!Anyways, Perfect for You has a very simple plot. Freya has a crush on her hot neighbor, Greg. And he is pretty much in love with her as well. They hanged out once and got along very well, but when Freya discovered that he was lawyer she pushed him away. You see, her father was a doctor and when he was sued by a patient, his lawyer did a very bad job on advising him how to handle the situation. Her father lost the case and his license. He was so upset with the outcome, that when he left court he accidentally crashed his car. Both her father and mother died on the accident, and now she's very, very suspicious of lawyers, but Greg is not one to be put off!Greg knows Freya feels something for him, and with his charms and a little help from Freya's sister, Anna, he finds a way to her heart. Plus, Freya needs Greg. She's a web designer, and she have lost her inspiration, but it keeps coming back to her everytime she encounters Greg. so, to get her project done, she agrees to date him.I loved the author's voice! The story was fast-paced, sexy, funny and sweet. We also have a side story featuring Anna and Max (one of Freya's neighbors), that was very sweet. It was very nice the interaction between Freya and her sister and her friends. So much love and companionship!It's a perfect book if you want something light and sweet to read between angst books. Kate Perry' books are already on my list of comfort reads. :)"}, {"userName": "Rebecca", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/16504359-rebecca", "userReview": "Okay, so I gave this book 3 stars because its dead in the middle. I wanted to love this book but I just can't. I can't hate it either. This is my first review so I hope its okay.... This book was alright..My favorite character in the whole book is Anna, she's funny and I can relate to her more than any other female characters in the book. However, I didn't like how she was so afraid to tell Freya what she had done. To me it just wasn't that big of a deal. Maybe it's from coming from a large family that fights and bickers all the time, I just didn't see it as blown out as it was. Also, she was such a strong, outspoken young girl, in real life she would have just told her and got it over with. Freya just annoyed me.... -__-Greg was wonderful at the beginning of the book but the more his character developed the less interesting he was. That't when the book started getting predictable.The book was very steamy which was an A++ but it was so predictable by the end I kinda forgot about all that. It took me 3 tries to get into the book. I finally got into it and was starting to enjoy it and then it just got boring again. By the time I got to the end I felt like, if you toned down all the steamy parts and made it a little more PG-13, this could be a made for TV movie that airs on Hallmark. I love Hallmark movies, don't get me wrong, but I don't want to read them.All in all this book was kinda ehh... It was really good if you like predictable, cliche love stories with steamy love scenes. If you like romance and suspense that leaves you longing for more until ending in sweet satisfaction, this is not the book for you."}, {"userName": "Danielle", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/2416038-danielle", "userReview": "Review originally posted at Ramblings From This ChickI really liked this book. Yes it's a little clichéd and predictable, but I loved it anyways. I love Miz Perry's voice and the stories she creates. She is able to get me so wrapped up and invested with what's happening that I don't ever want to put the book down until I've finished.I loved both Greg and Freya. They had such great chemistry and were hot together. They both have such strong feelings for one another and it was just so refreshing to see a hero that knows what he wants. Greg is so fully aware of his feelings for Freya. He knows that he loves her and wants to spend his life with her, he just has to convince her that they are meant to be.Freya knows that her and Greg have great chemistry and Greg is definitely sexy, but he's a lawyer and Freya despises lawyers and no amount of prodding by her sister or Greg will change her mind. Also, Freya is convinced Greg is a playboy and she has no desire to be another notch on his bedpost, no matter how sexy he is.I really enjoyed this book and I loved getting to know these characters. Yes, I do wish it was a tad bit longer and I thought that the ending seemed a little bit too predictable and on the sappy side but I loved it all the same. I'm really looking forward to picking up the other books in Miz Perry's Laurel Heights series.**Copy provided by author**"}, {"userName": "Sara", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/4524856-sara", "userReview": "Oh my God! Beautiful! Beautiful! Beautiful! I adored it! It was fun and incredibly hot and kind of sweet! It made me smile and chuckle. It made me hot, my hormones crazy. And I loved all the characters. Freya was a good main character, though I didn't like much her stubborness on disliking lawyers and keeping on going out with Connor. Oh, right, that was one character I didn't like. He was so boring. And kinda stupid, if you ask me. I liked Anna a lot, even though I didn't agree with her about some of her behaviours. She might have done it for her sister's good but she went a little too far. I liked that she was fierce, fun, sweet, caring and knew what she wanted and took it. Like with Max. I'd have liked to read more about them. Maybe in some other book? I hope so. I also liked Eve, though we didn't see much of her, but she seemed a really good friend and kind of fun. Guess I'll know her better in her book. And last, but not the least, Greg. My favorite. What an amazing man! A really good guy. And I loved him from the start. He was hot, sweet, sexy, caring, fun and attentive. Good enough to eat. And I bet he would melt in my mouth like delicious chocolate. Mmmmhh... don't let me think about that scene....... Anyway, the story was good and fun. Really a great read. I enjoyed it!"}, {"userName": "Mayu", "userReviewDate": "Jul 31, 2014", "userURL": "http://www.goodreads.com/user/show/24399566-mayu", "userReview": "Tras leer el 25% de esta historia que Amazon regalaba, abandoné su lectura. Simplemente, Perfecto para ti no era lo que yo esperaba. Para empezar, la traduccion es mala. Sin mas.Para continuar, no habia forma de conectar con lo que Kate me estaba contando. Queria sentir como algo especial esta novela, porque esa sinopsis y esa portada prometia una novela amena, romantica y divertida, pero todas esas promesas quedaron en nada en cuanto empecé a leer Perfecto para ti. Puede que a otras personas le gusta esta novela de enredos pero a mi no, desde el principio, se me hizo aburrida e insipida. La traduccion no ayuda nada, lo empeora todo, claro. Pero la historia, esa trama, tampoco es nada especial, y aunque hay un gran trecho de esta novela que no he leido, no siento curiosidad, no podria interesarme menos saber como continua todo. Los protagonistas, estos dos vecinos, pues yo deseaba que me cayeran muy bien, pero no. No siento afinidad ninguna con ellos, y con los secundarios tampoco. No son personajes con chispa. La protagonista, incluso me cayó mal. Odio esos prejuicios que tiene contra los abogados y lo rapido que le dio la espalda al amor, y por consecuencia, a su vecino. Y ese vecino, aunque no me caia mal, tampoco le veia nada especial. Asi que, otra novela abandonada. T_T."}], "description": "Freya Godwin's muse has gone MIA. With Freya just hired to redesign the top adult website company in the country, her muse couldn't have chosen a worse time to disappear. Determined to get her sexy back, Freya puts an ad online, hoping to find the right man to inspire her. Unfortunately, all roads point back to her upstairs neighbor Greg Cavanaugh. He's everything she doesn't want: a playboy and scumbag lawyer. Except if he's so wrong for her, why does his touch feel like magic? And why does being with him make her believe anything is possible?", "title": "Perfect for You\n      \n          (Laurel Heights #1)", "url": "http://www.goodreads.com/book/show/13562664-perfect-for-you", "average": 3.81, "cover": "https://images.gr-assets.com/books/1332856283l/13562664.jpg", "reviews": 659, "authors": [{"url": "https://www.goodreads.com/author/show/828855.Kate_Perry", "name": "Kate Perry"}], "type": ["Romance", "Romance", "Contemporary", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13562664-perfect-for-you", "http://www.goodreads.com/book/show/25012434-perfecto-para-ti", "http://www.goodreads.com/book/show/17162883-perfect-for-you", "http://www.goodreads.com/book/show/23591776-perfect-for-you", "http://www.goodreads.com/book/show/25123360-sahile-a-k-vurunca", "http://www.goodreads.com/book/show/15710505-perfect-for-you", "http://www.goodreads.com/book/show/20897282-perfecto-para-ti", "http://www.goodreads.com/book/show/13605143-return-to-you", "http://www.goodreads.com/book/show/15993039-close-to-you", "http://www.goodreads.com/book/show/15982350-looking-for-you", "http://www.goodreads.com/book/show/16094843-dream-of-you", "http://www.goodreads.com/book/show/17367900-tamed-by-you", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}