{"ratings": 3821, "userreviews": [{"userName": "Donnie Edgemon", "userReviewDate": "Jul 25, 2011", "userURL": "http://www.goodreads.com/user/show/5879647-donnie-edgemon", "userReview": "All sports fans on my news feed should read this book. Every single one of you. \"Play Their Hearts Out\" is an eye-opening account of what the players we see on college basketball courts go through before we see them. It's not the rim nailed to a barn, or the neighborhood pick-up game in a cul-de-sac or even twenty-five games a winter with a high school team that paves the path to a college scholarship. All-consuming grassroots basketball with all of its shady operators makes up about 90% or more of the preparation for high-level hoops. The author, George Dohrmann, followed a grassroots team in California from 4th grade until the kids finished high school. College basketball fans will recognize a few names in the book since the kids are now in their second years of college. Dohrmann focuses the narrative on the team's star player and the team's coach. Plenty of high-level grassroots coaches are noble characters, coaching for the benefit of the kids or the love of the game, and Dohrmann credits those that his time around the system found. The protagonist coach of of \"Play Their Hearts Out\", though, is the type of operator that has given grassroots (or AAU or \"summer\") basketball a bad name. The star player's tragic arc is predictable, and his eventual maturation and potential redemption is, too. This book is the text version of the amazing documentary \"Hoop Dreams\", set in the modern quagmire of shoe companies and graft surrounding the so-called \"amateur\" basketball of the 2000s. Unless you have personally experienced high-level grassroots hoops yourself, you must read this book to understand amateur basketball in the USA in this century. The only reason that I have rated this book with four stars instead of five is that Dohrmann himself made himself part of the exploitation system by insinuating himself into the lives of these kids and their families with the impossibility of separating journalism from friendship. He observed and reported some disturbing moments and developments during his time around the kids that would have forced any responsible adult to intervene, but a read between the lines shows that Dohrmann chose the role of journalist at times around the players that he admits in the acknowledgments to referring to as \"my kids\". Much like the coaches that Dohrmann rightfully accuses of using and disposing of the kids, Dohrmann used his eight-year friendship with them and their families to write a best-seller. As a mirror to buying tickets and watching television that supports the troubling system, though, I bought his book and find myself recommending it to others. I suppose there's a reason that this unseemliness exists and is difficult to solve."}, {"userName": "Dave", "userReviewDate": "Feb 18, 2011", "userURL": "http://www.goodreads.com/user/show/2529161-dave", "userReview": "One reviewer billed this book as the Friday Night Lights of AAU basketball, and the book lived up to this lofty standard. The author spent eight years following an AAU team, with much of the focus on the \"coach\" and the star player, who was once the No. 1 ranked player as an 8th grader. While I was aware of the arguments that the AAU system was a major cause of the degradation of team basketball, to see the system in action was downright repulsive. The \"coach\", after identifying Demetrius Walker as a star prospect, saw Walker as a launchpad to start his own multi-million dollar youth camp, and as a way to build relationships with shoe companies. (I put coach in quotation marks, because it's evident that the vast majority of the top AAU coaches know next-to-nothing about basketball, and spend no time actually developing players, in this case, which left Walker with no understanding of how to actually play the game).Perhaps the slimiest aspect of the coach/player relationship was the coach's purposeful decision to position himself as Walker's father figure, only to desert Walker when needed the most - a situation repeated with several players throughout, with sad consequences.The other revelation was the degree that the shoe companies dominate youth basketball, all the way up to college. I'm not sure why a high school player, or even a middle school player here, should be permitted to receive dozens of free shoes and clothing from a shoe company, or how coaches and high schools can pay the rent for the star athletes. This is an area where immediate reform, likely from the NCAA, is needed.The book touches on the shoe companies' desire to reach these kids as early as 10 years old, and how the AAU coaches use this relationship as a stepping stone for personal riches - to the detriment of the kids. Bottom-line, the world of big-time AAU basketball, and by implication, college basketball, is a system of organized sleaze, exploitation of kids and their families, and a system designed to make the coaches millions of dollars."}, {"userName": "Lucy Montgomery", "userReviewDate": "Aug 06, 2011", "userURL": "http://www.goodreads.com/user/show/1487497-lucy-montgomery", "userReview": "This is a very interesting book, especially for someone who has a child/children who play sports at a high level. The book illustrates the morally questionable (and highly profitable) \"grassroots\" basketball system that funnels kids from grade-school age travel through college recruiting. As with all sports, it is not necessarily the early stand-outs that ultimately reach the highest levels nor are those with the most talent coached/guided to reach their greatest potential. And as with life, the kids with active/involved parents fare the best overall (though not necessarily on the basketball court). I think the most horrifying revelation of the book is simply the enormous amount of money spent by sneaker companies and pocketed by coaches/tournament organizers on youth basketball. While some money is used to benefit the players, most of that is divvied out strategically to benefit the coach/organizer (with little regard for the best interest of the player), and the remainder ends up in the coach/organizers' pockets."}, {"userName": "Derek Prior", "userReviewDate": "Dec 15, 2010", "userURL": "http://www.goodreads.com/user/show/3269550-derek-prior", "userReview": "I really enjoyed this book and became attached to many of the people that Dohrmann follows. At its core, it's a story about Demetrius Walker and the ways in which the grassroots basketball system chews him up and spits him out. At various points I found myself wanting to stop the story to give Demetrius advice. It seems even the author had a hard time remaining strictly a biographer and it's hard to blame him.The planets that orbit Demetrius are interesting in their own right. Coach Keller, Aaron, Roberto, Rome, Terran, Jordan, etc. Aside from Demetrius and Keller, I think the most interesting character is Justin. His experience with Keller and the grassroots machine serves as a stark contrast to D's, in large part due to their respective parenting situations. Justin and his mother serve to show that the grassroots machine can be beaten.When I finished this book, I immediately turned to the Internet for updates on all the players involved. It will be interesting to see what becomes of them over the next few years."}, {"userName": "Nasos Delveroudis", "userReviewDate": "May 15, 2014", "userURL": "http://www.goodreads.com/user/show/29436095-nasos-delveroudis", "userReview": "Perhaps the best sports book ever written."}, {"userName": "Aaron Poorman", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/1570586-aaron-poorman", "userReview": "I am a die-hard sports fan. Evidence of this fact is not hard to find ; For instance I spent the majority of yesterday afternoon watching preseason NFL games - All in anticipation of the Broncos opener. (and the debut of Touchdown Jesus Tim Tebow) Basketball, and the NBA's Denver Nuggets rank second in the hierarchy of my rooting heart. At least where the so-called 'major' sports are concerned. Despite all that I rarely read sports related books. My reasoning for this is simple. I can usually place said sports books into three basic categories. First is the success story. I don't want to give the impression that I am some bitter armchair a-hole who doesn't like to see people achieve their dreams. However, I would much rather watch those sort of triumphs live. The Saints' recent Superbowl win is a good example of this. Particularly because head coach Sean Payton and starting quarterback Drew Brees have both released books on the heels of the big win. (neither of which I have any intention of reading) Sorry champs, I know how the story ends. The second category is the hard luck heartbreaker. The story of the star who didn't make it. Sure there are lessons to be learned from such books but as I've already said I do not derive pleasure from an athlete's failure. Third, and most likely to draw my disdain is the tell-all media whoring money grab. The kind of book released by guys like Jose Conseco, full of finger-pointing, and rife with tones of self-righteousness. Of course I don't condone cheating, yet there is something especially off-putting about books like that. Even more so when you consider the fact that most authors of these books wouldn't be saying anything if they weren't broke and desperate for cash.Now that you know why sports related literature is a rarity for me you may wonder what makes George Dohrmann's Play Their Hearts Out an exception to the rule. Well I'd be remiss if I didn't admit that I was somewhat obligated. I won an advance copy of this book through a goodreads giveaway. Still there is a reason that this book enticed me to enter where others of it's ilk get no attention whatsoever. The hook was that I wanted a better understanding of the so-called grassroots game. This is the term most closely associated with the AAU system. The AAU organizes leagues and tournaments for grade school kids as young as seven, and as old as eighteen. (second grade, through highschool). The AAU dabbles in almost all sports, but basketball is by far king in it's the youth sports machine. Baseball has Little League. Football has Pop Warner. Youth basketball has no such establishment, outside the AAU, or at least not one so strong. Basketball also differs in another big way. The NBA's entrance procedure is different. Players are not barred from joining the Association straight out of high school, and more often than not, straight off an AAU roster. Superstars can be, and are routinely drafted early. The NFL still requires it's players to, if not attend college, at least wait three years after high-school graduation before becoming eligible. The MLB, though not shy about drafting youngsters, has an extensive minor-league system where prospects develop before being sent up to the majors. One need look no further than the NBA's two biggest stars to see the contrast. Kobe Bryant and Lebron James never went to college. They are both products, and prodigies of the AAU. Other notables include Dwight Howard, Kevin Garnett, and Tracy McGrady.Basketball is unlike other team sports, in part because of it's limited team size. Having only ten players in total on the floor at any given time means individuals have greater chance to shine, as individuals. Yet the brighter spotlight is not all a natural occurrence. Sponsorship greases the wheels of the AAU system in an unmatched capacity. Specifically sponsorship of shoe companies, such as Nike, Adidas, and Reebok. In the AAU it is common practice for coaches of elite teams to sign on as \"consultants\" with shoe companies, which nets them salaries and product (in insane amounts) in exchange for agreements to wear gear, and in many cases run sponsored tournaments and camps. The money allows teams to travel nationwide and increase their top players profiles which helps explain some of how mega-hype spreads. The coaches themselves are some of the loudest drum beaters for potential phenoms, and as you will see subsequently, one of the most unsavory elements of grassroots basketball.I don't want to give away too much of the plot here, seeing as this advance review. (release date says 10.5.10) What I will say is that the story deals primarily with one star, Demitrius Walker, and the coach who ' discovered' him Joe Keller. At the age of nine or ten Walker was told by Keller that he was destined for the NBA, and of course riches beyond imagining. Demititrius had size and quickness that other boys his age couldn't hope to match These types of promises are doubtless common, no matter how ludicrous they might seem. Yet what Keller didn't mention to his golden boy recruit was both money and revenge were coach Joe's primary motives. Years earlier Keller had been duped by local coach and power broker Pat Barrett when he handed over eventual #2 overall draft choice Tyson Chandler. Barrett had promised a partnership which never materialized. Barrett's SCA Stars were already sponsored by Nike, and so Keller thought he would extend either a joint-team proposal or a similar contract to the one he enjoyed. Dohrmann, who was writing a story for Sports Illustrated in 2000 hoped to get some dirt from Keller. When their initial meeting revealed little, Dorhrmann assumed he'd have to look elsewhere. Still a relationship was forged, and Keller would eventually talk at more length about his relationship with Pat. Nothing goundbreaking was published at that point but after a follow-up interview in 2001 Keller advised Dohrmann to keep in touch. He explained his intention of starting a new squad to beat Barrett at his own game. What is even more telling is Keller's decision to allow extended access to his teams story once Walker was found. Keller explained that as long as any comprehensive piece done about his team, (or a book like this one) waited until the conclusion to be published, he, meaning Keller, would be rich, and would no longer care what Dohrmann said.The story is a long one that spans over eight years. From the inception of Keller's team the Inland Stars to the high school graduation of it's players. The team is eventually re-branded as Team Cal, following a sponsorship with Adidas. The roster changed frequently but Demitrius was always the focal point as far as coach Joe was concerned. Many Inland Stars / Team Cal alums went on to sign with Division I programs. This is the most positive part of the story to be sure. It also proves Keller's eye for future talent. What is also apparent however is Keller's reputation as a dishonest, and generally bad guy. For example he is no longer on good or even speaking terms with his former players. Walker's rise to a #1 ranked prospect (in the 8th grade) led to his being dubbed by one of Dohrmann's SI colleagues ' The Next LeBron ' in 2005. His life anointment shines a light on the darker side of expectations and the hunt for NBA dollars.Again I reiterate that I do not typically read sports books. Play Their Hearts Out is more than that. This is the type of story that movie makers might salivate over. If anything holds this back from being a blockbuster it will either be it's grittiness (which may scare away family oriented film makers) and it's length ( which could keep it from being a future Spike Lee Joint) It's no real surprise that this was well written. After all Dohrmann is one only four sportswriters to ever be awarded a Pulitzer - Albeit an earlier series of stories he wrote for the St. Paul Pioneer Press detailing academic fraud. The book may not change the way you view basketball, but it will show you up close, what has changed basketball.*Review w/ song can be read and or heard on my bloghttp://subliminalmaybe.blogspot.com/2..."}, {"userName": "Kristine", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/582776-kristine", "userReview": "I'm really excited for this one. I won it thru First Reads ...This book took me a little while to get into, but I was SO hooked. It was literally like watching a train wreck and I would keep my husband up at all hours of the night telling him all the outrageous things I had read that day. This story is Demetrius Walker's story: about how as a 10-year-old he was recruited by a jerk of a coach (Joe Keller) in the AAU system of SoCal. Joe Keller used this boy so disgustingly to make himself a millionaire . . . acted the father figure, hyped and marketed him to the point he was ranked #1 player in the country -- as a 6th grader. That led Sports Illustrated to do a story on him titled The Next LeBron?. One tiny little drawback? Keller knew jack about basketball and didn't teach D the fundamentals or how to work hard. He had promised the boy he WOULD be in the NBA. How do you think a 6th grader would handle the pressure? Or how as a freshman, when everyone else had now caught up to him in size -- he fizzles out as his \"mentor\" drops him on his a**. I'm sorry to even fake swear here but my indignation and anger at how one could so callously use another human being like this without regard for the child's best interest makes me want to vomit. This is a child!!And Joe Keller is one of hundreds, if not thousands, of pariahs in the grassroots/AAU system that suck the future out of these kids to line their pockets. To read to the end of the book to find out how this all played out . . . I can only say one thing: D wasn't perfect, but for him to be where he is at now is credit to his character. Crazy crazy Crazy!! I almost feel like I did at the end of reading The Glass Castle. I think I was that outraged. Not as extreme in treatment but in the blatant disregard for the welfare of a child. p.s. This is not a fast read. It's a little detail laden - only when it comes to basketball games (especially at the end). But being a girl that LURVES basketball I ate it up, yo. I would recommend this to my friends who don't like basketball, they can just scan the play-by-play if they like . . . but the story needs to be told."}, {"userName": "Shirley", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/35683-shirley", "userReview": "I've watched countless hours of basketball in my life (March Madness is my favorite time of year!) but didn't know much about grassroots youth basketball and just how dominant (most Division I college/NBA players have come out of that system) and corrupt (and unregulated) it is. This is an extremely illuminating look at grassroots youth basketball (mainly in Southern California). The author focuses on a coach, Joe Keller, and his protege, Demetrius Walker, who comes to see Keller as a father figure. Keller hypes and thrusts Demetrius into the national spotlight (a Sports Illustrated profile describes Demetrius as \"14 going on LeBron\"). This book follows Demetrius and other players on one of Keller's teams for eight years and the rise of Keller's star as he develops his youth basketball empire (and callously discards whoever no longer serves a purpose for him). Some of his kids don't have the right guidance (starting with the coach himself) and fall through the cracks (while still hoping to play Division I basketball one day), while others come out OK because they had a parent watching out for them. Unfortunately, some of the parents are as despicable as the coach - like the single mom who decided where her son should go to high school on the basis of which coach subsidized her rent (by ~$1000 a month), even though that coach had faced allegations of molestation AND her son had been molested by one of her husbands (and refused to remove her kid from that atmosphere even after her son told her the coach had actually made advances toward him). I was amazed at the pressure facing these kids at such a young age. The shoe companies (Nike, Reebok/Adidas) are complicit in the grassroots process by sponsoring teams and showering (9-year-old) players with shoes and gear (hoping to gain their loyalties so that they'll go on to, say, a Nike-sponsored high school or summer team or college) and even paying some coaches' salaries (like that of Keller). Interestingly, there are rules for college coaches recruiting high school players, but not for college coaches vis-a-vis players who are not yet in high school, so we hear accounts of coaches (from high-visibility programs such as USC/UCLA/Kentucky/Florida) scouting middle schoolers and younger at summer camps sponsored by the big shoe companies. Highly recommend for any sports fan!"}, {"userName": "Tom Gase", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/2339366-tom-gase", "userReview": "If I read a better book in 2012, I'll be very shocked and pleasantly surprised, as this book is about as good as it gets.The author, George Dohrmann, follows an AAU basketball team and its players,coaches and parents for eight years. This book has been called by some people the \"Friday Night Lights of youth basketball.\" I couldn't disagree more. I actually liked some characters in Friday Night Lights. No, the Hamlet of youth basketball is probably better.Although without giving away the ending, you find yourself not liking most of the characters, ESPECIALLY the main head coach Joe Keller, and a lot of the parents. The story focuses on Keller and how he helps out these kids, but his main focus seems to be just trying to find a winning lottery ticket and the next Lebron James that he can use to make money off. The line that ends the first section of the book made me actually throw my book down to the ground in digust. I knew youth basketball was bad, I didn't know just HOW BAD it was. Read this book with fine reporting and find out for yourself. A good story, you seem to be rooting for a lot of the players and hoping that through it all, they can find a way to make it. A must for any sports fan of any kind and it should be required reading for journalists."}, {"userName": "Kristen", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/920399-kristen", "userReview": "This book made me so glad that I am a girl. I grew up playing AAU basketball in tournaments all over the nation, and I attended some recruiting camps after receiving letters from colleges in middle school like these kids in the book, but neither my more talented friends, nor I ever faced the crazy pressures that these boys did. Shoe companies were not lining up to take advantage of girl basketball players, and for that, I am so thankful. The free gear and the money that was thrown at the coaches ruined any altruistic motives they might have had in helping the kids. This story is heartbreaking, and I spent the whole time with my mouth agape, not believing that the grassroots basketball machine is actually legal. And the parents . . . some of those parents need to be grabbed by the shoulders and shaken until they wake up and see what is going on around them. This book contains some detailed descriptions of game-play that would probably not be interesting to non-basketball fans. However, the majority of the book is not about the sport but about the kids, parents and coaches."}, {"userName": "Ang", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/39727-ang", "userReview": "Though it took me a long while to get into this book, when I finally did I was hooked. I think Dohrmann started out just a little slow--the first third of the book felt glacially-paced to me. But as the boys age, the story really picks up, and it's really a very informative and interesting read. For anyone who likes sports, and especially basketball, I feel as if this is a must-read. I have seen the LeBron James documentary (the one that starts with him playing in AAU basketball), but that film gave NO voice to the other side of AAU basketball, and I was glad to learn about it.[return][return]I wish the stories had happier endings, in some instances. But it's real life, and I wish that because I felt that I came to know some of the boys in the book. Which just goes to show how well this book is written, I suppose. Anyway, I highly recommend this book; keep slogging through the early slow-going, and it's definitely a rewarding read. I'm really glad I came away with a free copy. Highly enjoyable."}, {"userName": "Stefanie", "userReviewDate": "Dec 10, 2010", "userURL": "http://www.goodreads.com/user/show/1354891-stefanie", "userReview": "I bought this book as a Christmas gift for my dad and as I started wrapping it, I thumbed through it, read the cover and decided I'd read it to see what I thought. Wow, what a great book! Eight years of investigative reporting and George Dorhmann has written a Pulitzer prize-winning non-fiction account of a group of incredibly talented boy basketball players. This book details the inner world of AAU basketball for players beginning at the age of 10. The author is credible and believable and seems to report the individual stories of these kids with measure and candor. Primarily, the book focuses on Demetrius Walker and his journey through the sad, scary world of boys' elite basketball. While it was hard to read some of these kids' stories and see the variety of adults who only cared about profiting from these kids' talents, in some cases it was a testament to the toughness of these kids that they came through.I loved this book!!"}, {"userName": "Edel Henry", "userReviewDate": "Dec 03, 2014", "userURL": "http://www.goodreads.com/user/show/30354027-edel-henry", "userReview": "This book was an addictive but enraging read. Incredibly well written, it really makes you care for the young players at its heart - which makes it all the more difficult as they are exploited and discarded by the corrupt American youth basketball system. While the book is framed around the difficult journey of Demetrius Walker there are so many cautionary tales within it that it is very easy to finish the book feeling quite empty - particularly when the coaches and camp runners who created the hype that would prove these players' downfall remain unaffected and, in the case of Joe Keller, wealthier than ever. Definitely recommended. Basketball is a backdrop to the human story of vulnerable kids being built up and torn down by a broken system."}, {"userName": "Jarrad Hamlin", "userReviewDate": "Jul 06, 2010", "userURL": "http://www.goodreads.com/user/show/3776808-jarrad-hamlin", "userReview": "Play Their Hearts Out, is a very in-depth look at the world of youth basketball. As a former high school assistant basketball coach this book really angered me. The total disregard for athletes and their futures is sickening. The youth basketball machine is exposed for the terrible modern day institution of slavery that it is. Read this book if you are a fan of basketball and want to better understand the sometimes seedy world of youth basketball. Dohrmann put his life into the research and writing of this book, great effort!"}, {"userName": "Jack Duboff", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/12775208-jack-duboff", "userReview": "The book, Play Their Hearts Out: A coach, His Star Recruit, and the Youth Basketball Machine by George Dohrmann is a really good book because it really opened my eyes and gave me a great insight about what happens behind the scenes with coaches in AAU basketball. It really surprised me that coaches would exploit their own player's talents for their own good, and then just move on and treat them like yesterday's news. If you want to find out what really happens in this world, then read this."}, {"userName": "Muneer Uddin", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/674422-muneer-uddin", "userReview": "Dohrmann uses his considerable reportage skills to uncover the cesspool that is AAU basketball. We see the greed and exploitation that young boys are subjected to in the coaches' quests to \"make it\". I hope that this book leads to some changes in the amateur youth basketball system, to better protect players and ensure that they are given all the opportunities in life that their talent will allow them,"}, {"userName": "Chip", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/1622905-chip", "userReview": "Fascinating and insightful. Up there with Friday Night Lights. The author spent years following the boys that are the subjects of his book, and it shows.FYI, the author's blog provides occasional updates on how the boys are doing in college - e.g. [SPOILER] http://www.georgedohrmann.com/blog/id...?"}, {"userName": "Lance", "userReviewDate": "Feb 11, 2015", "userURL": "http://www.goodreads.com/user/show/8511956-lance", "userReview": "Very interesting book on grassroots basketball. Full review is posted on my blog:http://sportsbookguy.blogspot.com/201..."}, {"userName": "K", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/81232236-k", "userReview": "I can't recall any other nonfiction book in which the author despises the main person he's writing about. Or not unless the person is a killer. Yet here, author George Dohrmann clearly hates Joe Keller, the youth basketball coach who is Dohrmann's window into the corrupt world of youth basketball.The book opens up with Keller yelling at Dohrmann about how Dohrmann doesn't know anything, doesn't deserve any of Keller's time, and basically stomping around like a teenager. This is before Keller actually has any power, but after he made the biggest blunder of his early career in losing access to the best middle school basketballer in Southern California, Tyson Chandler. Keller treats everyone with disdain that comes from his own insecurities and competitiveness and anger, and the author gives you page after page of it. It's absolutely stunning that Keller succeeds in his sleazy maneuverings to find the next Chandler-like star and ride him to the top.But he does. We follow the infuriating success of Keller in the sleazy world of big-time recruiting of basketball players ages 9-15. Yes, starting at age 9. Grown men are lining up to bribe talented 9-year-olds and their parents to shift from one AAU team to another, in an endless game of one-upmanship. The bribes begin with t-shirts and shoes, then include expenses covered for weekend tournaments and for individualized coaching, adn then extend to paying rent or miscellaneous expenses for the impoverished ones. And then the real wheeling-and-dealing starts when these kids are ready to enter high school. Seriously.To say it's corrupting is like saying Donald Trump likes to Tweet. The entire system is built on corruption, and it's fueled by the relentless marketing of basketball shoes, gear and players. The book's main events occurred more than 6 years ago, and at the time it was a system that seemed broken beyond repair. Yet it's endured and (probably) become even worse.The child star of the book is Demetrius Walker, a precocious player who Keller hypes to be the No. 1 ranked 7th grader in the country. As if anyone could actually make that determination, not to mention whether that determination says anything about Walker's future as a basketball player or (more importantly) as a person. It's a warped system, and Walker begins to display all the things you'd fear about him: selfishness on the court, lack of effort in training, and fear that he will be shown up by another player and lose his ranking. The hype reaches the point that, quite literally, Sports Illustrated does a feature on him before he's in high school and asks whether he might be the next LeBron James. (LeBron is 21 at the time of this article, barely 3 years into his pro career and without anything close to a championship, so it shows how the youth symptom warps even what is defined as greatness to be aimed for.)Basically, Demetrius is bigger, stronger and faster than everyone his age, Keller's answer to this in the early years is to give Demetrius free reign to do what he wants on and off the court, and to yell at his teammates for every real and imagined mistake. And to make sure that Demetrius gets his chances to dunk a basketball, which is surely an eye-opener for any 12-year-old. But it's not going to last, as Demetrius is destined to be about 6'3\", which is pretty moderate size even for college basketball. So when Demetrius really struggles at the high school age, Keller just drops him and moves on to other ventures with other, younger phenoms.Numerous teammates of Demetrius make more than cameo appearances in the book, and the author tells their stories well. Their stories are compelling, as they work with Demetrius on the court, become friend or foe off the court, and learn to tune out the volatile, ignorant Keller. Bottom line is that those kids whose parents pay attention to what's going on and pull them out of Keller's shadow relatively quickly wind up in good shape because they all are phenomenal basketball players. The ones whose parents stay dependent on Keller for money -- and therefore for exposure to colleges -- fail.America's greatness comes from a freedom to pursue wild ideas and to take new ideas to the limit. Sometimes, this has been very productive, such as Facebook or Uber or Starbucks. Other times, it starts out okay but gets warped far beyond anything productive, such as professionalized youth basketball. This book is a fantastic expose of what can go wrong when a good idea is taken to its extreme."}, {"userName": "Carol Haldy", "userReviewDate": "Feb 03, 2018", "userURL": "http://www.goodreads.com/user/show/40594342-carol-haldy", "userReview": "Child abuse - the author skillfully details systematic child abuse of these young players at the hands of the following (in no particular order): parents - with visions of NBA dollars dancing in their heads - made incredibly bad decisions for their sons. coaches - in particular Joe Keller ( I would NOT send a child to anything connected with this despicable character) and he was not alone; the Big Three Shoe companies - for being the driving force behind all of the former. My son played basketball through high school in the AAU world. It always amazed me when we played in North Philadelphia, Wildwood, and Reading how teams from relatively poor areas would enter in amazing uniforms, matching warm ups and spanking new shoes. I now get it.My heart literally breaks - I was in tears several times - reading about the central bball player - Demetrious. What was done TO HIM - nauseating.The author is to be commended. This book is a must read for anyone interested in youth sports - as a cautionary tale."}, {"userName": "Anna C", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/48579957-anna-c", "userReview": "Play Their Hearts Out: A Coach, His Star Recruit, and the Youth Basketball Machine by George Dohrmann was one of the most inspiring books I've read. The main character in this story, Coach Joe Keller, aspires to assemble kids who have the capability to play basketball, and keep them together throughout their high school careers to generate the next great player. Demetrius Walker who, unlike many of the other players that Coach Keller considers to be successful in the sport, is favored by his coach, and finds himself caught up in the fame and fortune behind sponsors such as Nike, Adidas and Reebok. This book exposes in which talent before puberty is dominated by businesses and companies.  In my opinion, I feel that this book was one of the most inspiring stories I've read. Considering the fact that I’ve had the chance to understand the fundamentals of this sport throughout my very own high school career, it helped me get to know the character Demetrius Walker in a very profound way. I found that Coach Keller was a great blend of different characteristics as an honest, caring, father image for many of his young players. It almost reminds me of my very own high school coach, who I saw as an encouraging, strategic, and more importantly, a close friend; I never thought of her as a coach. I definitely recommend this book to folks who are able to interpret and appreciate the beauty that basketball has to offer."}, {"userName": "Steven", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/4087520-steven", "userReview": "This account of eight years in the lives of juvenile basketball prospects is a staggering balancing act: enough reporting to give a reader all necessary facts, enough clear writing to paint a full picture through the narrative, and enough background knowledge to give the whole story sufficient context. It's easy to tell which characters the author does and doesn't admire, but he offers factual evidence for all of his impressions and doesn't shy away from any of the unsavory details that surround the youth sports circuit. The crisp, clear writing and broad scope set this book apart from the ubiquitous \"a season with the ____________\" genre. The subject matter veers grim frequently, but the tone is sad rather than exploitative, as the author mourns for the innocence his subjects have lost and invites the reader to do the same."}, {"userName": "Henry Ho", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/31862210-henry-ho", "userReview": "Pretty good. Felt like the game descriptions were unnecessarily in depth and didn't add much."}, {"userName": "Darren m-p", "userReviewDate": "Mar 25, 2017", "userURL": "http://www.goodreads.com/user/show/42175748-darren-m-p", "userReview": "If You liked Hoops Dreams give this a whirl. Heartbreaking stuff"}, {"userName": "Southey Blanton", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/22760087-southey-blanton", "userReview": "For any parent who is interested in putting their children in amateur sports leagues this is worth a read to see where many of the stakeholders are coming from and what motivates them. And in most cases it is never the children and their development as young adults or athletes."}, {"userName": "Dox", "userReviewDate": "Aug 28, 2010", "userURL": "http://www.goodreads.com/user/show/2608235-dox", "userReview": "This book was received as part of an Early Reviewers Program. \tThis narrative is like watching a train wreck. \tIt is a fascinating journey with a group of kids through their youth, starting at about age nine, all the way through middle school and to high school, and that all important time where they strive to achieve a scholarship. Its core focus is on the young talent Demetrius Walker, and his relationship with his Coach, Joe Keller. \tThe narrative covers all the elements: the hope, the hard work, the competitiveness, the disillusionment, the selfish acts of selfish men, the few truly good coaches in a rotten system, the different types of parenting (and the indifferent parenting), the rise to glory, the crashes and burns, the hype, the corruption, and the struggle. \tIt combines many elements into the telling of this journey, and the author does an excellent job of juggling the many perspectives, backstories, and side information that are necessary to deliver the reader into the \"why\" and \"how\" of the system, and to understand the machinations behind the actions. Different components are highlighted and brought forth when important to the narrative, and although there may be a few points where the reader without requisite back knowledge may have to gloss through, given the enormous scope of the topic, that is to be expected and understood. A reader somewhat already familiar with the world of basketball should find this narrative compelling and revealing. (Although I wonder if those truly immersed in this world already might find themselves more responsively indignant than ready to accept that change would be beneficial. It is, after all, a system that rewards the cutthroat sharks.)\tHowever, for the novice basketball enthusiast--or even someone just vaguely familiar with the sport--this is an eye-opener of a book. It delves into some of the seediest aspects of how young players are developed and how the cards are stacked against them from the start. Fortunately for the uninitiated reader, the author deftly describes the action on the court just as well as the social constructs off the hardwood. The games and the player's abilities and moves are tightly and well described, and these are often the most exciting areas of the book, bringing the reader right onto the bench with the coach and players.\tFrom the outset it is acknowledged that the author was along for the ride with this group of individuals, and every so often within the story the author will surface with a question or interaction that is part of the story. It is commonly remarked that just by observation that there is influence upon the actions one is observing, and the reader must by necessity wonder about topics that reside below the surface of a book like this. With as much access to the individuals as he had, what influences did the author have? What bias may be written into the book that the reader should take with a grain of salt? Given the complexity of the life stories, the bias of one individual observing doesn't appear to be any more significant than would be expected. Indeed, with the foreshadowing written in and the 20/20 hindsight of a reader, there were times when I wished someone would step in to at least give some encouraging words or sage life advice to these vulnerable, talented children. \tIf anything, my one criticism of the book would be that because of the many individuals involved, that the reader can sometimes be overwhelmed by the numerous names. People come and go, and then come back into the story again, and it takes a reader who is paying attention to the names to keep things straight. Because of the huge number of people, and the stage needing to be set, the beginning of the narrative takes a while to gel. It isn't an instant, comfortable envelopment into this basketball world, and the reader needs to give the book a few chapters for that to happen. \tIf nothing else, this book is a clear call for reform. This system takes children and puts them through a grinder. Between the corrupt coaches, the corrupt and powerful shoe companies, and the corrupt scholarship methodology, this is a system rotten at its core."}, {"userName": "Diane Wilkes", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/4846204-diane-wilkes", "userReview": "The \"Coach\" -- Joe Keller. A man who knows nothing about coaching basketball, but knows there's money in working with potential young phenoms. The Star Recruit -- Demetrius Walker. A young basketball phenom and Joe Keller's meal ticket. The Young Basketball Machine -- The AAU--a feeding ground for colleges, not liable to the NCAA or any real rules, peopled with predatory coaches and greased with the money from Nike, Adidas and Reebok. PLAY THEIR HEARTS OUT is a heartbreaking and eye-opening book. If you remember a time when high schools were the sole arena for basketball players to get college scholarships, you may not even be aware that the arena and rules have changed so drastically. Kids who are interested in basketball play in the Amateur Athletic Union (AAU). The top teams are often their own dynasties, run by coaches who are more interested in making money off their players than coaching. Some are completely ignorant about coaching but are superb recruiters who know how to motivate kids--with dreams of the NBA. A lot of these youngsters have single parents, some of whom are rather predatory themselves (and get paid to live close to the coach). These kids want a father. These coaches pretend to fill that void in order to make money off of them. And you can just take the \"Amateur\" out of the AAU--these kids get tons of free sneakers and gear, along with other gifts. But these are just facts and you can walk away from them...but after reading PLAY THEIR HEARTS OUT and getting to \"know\" people, you can't walk away from their stories. Joe Keller started his fiefdom (basketball camps for rising 6th, 7th and 8th graders--yes, 12-14 year olds!) by starting a team young. His chosen one: Demetrius Walker, a great raw talent and really nice 6th grader. Keller brings Demetrius into his home, treats him like his son, and puts enormous pressure on him--including getting him on the cover of Sports Illustrated as the next LeBron. Keller starts with one group of kids and swaps them in and out according to their abilities with no concern for the kids themselves. He has zero loyalty. He brings home a national championship with one group of kids and is still wheeling and dealing, despite promising the kids and their parents that they'd be a unit through high school. When Keller starts working on his camps for kids because that's where the real money is, he leaves the kids on \"his team\" to flounder without him. Demetrius cracks under the pressure and the fact that his \"father\" has no time for him anymore. Keller gets to his promised land, but he dumps the ones who got him there. He learned his \"craft\" from Pat Barrett, an AAU coach who poached Keller's first phenom...but Keller did him one worse by using younger and more vulnerable kids to achieve his goals. As a Tar Heel fanatic, I found it fascinating to read about some of the kids who are or were on the Tar Heels (none played for Keller, thank goodness): Kendall Marshall, Wayne Ellington, Dexter Strickland. But the name Aaron Moore, whose mother pimped him for rent money, is one I will always remember as well. And his story will haunt me. Something has to be done about treating these kids like used condoms. College coaches and the NBA need to get involved in cleaning it up, but when David Stern claimed that he would, he got the owners of the big three sneaker companies on the board. The old story of the fox guarding the hen house--but with a PR bonus. The book is wonderfully written--a top shelf basketball book like THE BREAKS OF THE GAME and THE MIRACLE OF ST. ANTHONY'S. And it's terribly heartbreaking."}, {"userName": "John Spiller", "userReviewDate": "Jul 11, 2015", "userURL": "http://www.goodreads.com/user/show/44682995-john-spiller", "userReview": "George Dohrmann, an investigative reporter for Sports Illustrated, is no newcomer to world of college basketball. In 2000, he won a Pulitzer Prize, while working at the St. Paul (Minn.) Pioneer Press, for a series of stories that uncovered academic fraud within the University of Minnesota men's basketball program. While writing an article, “School for Scandal,” for Sports Illustrated, highlighting the hangers-on trying to capitalize on Tyson Chandler’s jump from high school to the NBA, Dohrmann met Joe Keller, the man who “discovered” Chandler. At the time, Keller, a former welder and car stereo salesman, coached an AAU basketball team of 10 and 11 year-olds . Dohrmann made a proposal to Keller: let him follow Keller’s team, with unfettered access, and he would not publish what he witnessed until after the boys had finished playing AAU basketball, some eight-plus years later. Keller agrees. Dohrmann gets entrée into the underbelly of basketball; Keller receives the cache of Sports Illustrated affiliation. Reminiscent of John D. Rockefeller in the oil business or Lyndon B. Johnson as a young member of the Senate, we watch as Keller scratches out a niche in a field where power resides in the hands of the few, relying on maniacal drive, which ultimately alters the landscape to play to his limited strengths. Lacking the shoe company connections to attract elite high school talent, Keller instead parlays his ability to size up athletic potential in preteens to become the “Sonny Vaccaro of the Middle Schoolers”. Keller ultimately realizes his dream, but at a great cost to his humanity. In lesser hands, this story could tend toward the formulaic: innocent youth callously exploited by cynical “coaches” merely interested in turning a buck. Of course, there is that. However, Dohrmann provides so much detail and context that we see the twisted rationalizations behind some of the more monstrous behavior depicted in the book. Rather than overt finger pointing at selected villains, Dohrmann intersperses the good and the bad and trusts the reader to draw their own conclusions.If you are looking for dirt, Dohrmann has plenty to share. Because he witnessed most of the events in the book, he names names. If you are a recruiting junky, “Play their Hearts Out” has plenty of behind the scenes stories involving a number of recognizable 5-Star athletes.Those looking for a happy ending, or at least seeing the bad guys get their comeuppance, will learn, “The grassroots-basketball society was not a just one, and the real Joe Keller would never face the consequences of what he wrought.” “Play Their Hearts Out” is one of the better sports books I have read in the past few years and probably one of the best basketball books I have read, entering the pantheon of “Hoop Dreams” and “The Last Shot”. Anyone with an abiding interest in basketball -- high school, college, or pros, owes it to themselves to read this book."}, {"userName": "Victoria Whipple", "userReviewDate": "Aug 30, 2012", "userURL": "http://www.goodreads.com/user/show/2436144-victoria-whipple", "userReview": "Last year I accompanied my son to AAU basketball 7th grade Nationals. It was only his second year playing AAU, and I had no idea until we arrived in Memphis what we had gotten into. Sure, there were some teams like his with all legitimate 7th graders, but there were many teams with boys sporting beards and tattoos. Rumors swirled about the ages of these boys, I learned of the term \"reclassify\" for the first time, I saw some great games, good and bad coaching, and parents who were either fully supportive of the children or completely manipulative. The whole time I was there I was wishing there was some kind of primer for AAU basketball to help me navigate the mess. I work in a middle school, so as I was talking to the students at the beginning of the year about what they'd read over the summer one of my 7th graders told me about this book (which now myself, my son and my husband have all read as well as some other parents from my son's team). I'm so glad that student shared it with me, because I know so much better now how the machine works. This is a sometimes heartbreaking sometimes elating story of one AAU coach (who, if karma has it's way better look out) and one player in particular, but also several who played for him on and off from 5th-8th grade. Unfortunately for the boys, many of them kept following this man's advice and teachings even after he deserted them. He ruined many young, innocent lives to make himself a millionaire. The reader becomes involved in the lives of these boys, and shares their triumphs and much more often their heartbreak. It exposes the black, slimy underbelly of grassroots basketball, and how it exploits these boys (and I'm sure it's the same with girls) who just want to play ball. Dohrman's writing is crisp, insightful, and completely professional--to tell of these experiences from a completely neutral point of view while he was getting to know and care for these boys must have been incredibly difficult. This is a book that must be read by all dedicated basketball players and their parents, and by anyone who loves the game. Even for those who don't have a particular interest in basketball, it is an extremely well-written and involving story. I can't recommend it highly enough for all adults and kids grade 6+ due to some strong language. Thank you for writing this book, Mr. Dohrman. We are going back to nationals this July, with a different team, new coaches who seem to really care for the kids and the game, and with a completely different perspective."}, {"userName": "Bob Mustin", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/2496216-bob-mustin", "userReview": "There was a time when the second best avenue to writerly acclaim (the best being investigative journalism) was sports writing, and Dohrmann seems cut from that cloth. He’s a Sports Illustrated writer-Pulitzer winner – and, as this book demonstrates, a bit of an investigative writer himself. But a bit about the book.Dohrmann began following what he calls grassroots basketball, i.e., the entrepreneurial AAU system of pre-high school hoops. His main focus is a struggling coach, Joe Keller, and his basketball find, a young California kid named Demetrius Walker. Talk about patience: Dohrmann follows these two and a secondary cast of characters through some eight years, most of it through the kids’ seventh and eighth grades. Keller, by Dohrmann’s accounting, has a gift for recognizing hoops talent in pubescent boys, but his primary talent is the entrepreneurial one; he ends up rich from basketball camps and all its ancillary product and activities, leaving his boys to struggle toward high school and college.Dohrmann’s main point here is that boys from less than desirable home lives are ending up as the means to the entrepreneurial end in hopes of rescue through making it to the NBA. As a result, they aren’t coached well, aren’t developed as pre-adults, and the sins of the coaches and other wheeler-dealers haunt these kids throughout their sports lives. While Dohrmann’s writing voice is rock solid, it doesn’t approach Grantland Rice’s elegance. However, he clearly knows how to take volumes of data about these coaches, the boys and their families, and write it without it seeming an amorphous mass of data. Where possible he lets his characters talk through dialogue; as a result, you’re drawn deeply into their lives, their sports journey, their trials and successes. When he resorts to backstory, he does so in a way that embellishes his the here-and-now, and he doesn’t linger there long enough to lose the reader.In such an eight-year odyssey, and with the amount of detail at Dohrmann’s disposal, it would be tempting to let one's self drift away from this story’s arc, but Dohrmann's a disciplined enough writer to make such an ambitious project work. If his writing here has a downside, it’s a minor one: he lingers too long over somewhat trivial matters near the end. But for tomorrow’s hoops stars, today’s fans, and this aging hoopster, it’s an enthralling must-read."}], "description": "Eight years of unfettered access, a keen sense of a story’s deepest truths, and a genuine compassion for his subject allow Pulitzer Prize–winning journalist George Dohrmann to take readers inside the machine that produces America’s basketball stars.    Hoop dreams aren’t just for players. The fever that grips college basketball prospects hoping to strike big-time NBA gold afflicts coaches, parents, and sneaker executives as well. Every one of them has a stake in keeping America’s wildly dysfunctional, incredibly lucrative youth basketball machine up and running—no matter the consequences. In Play Their Hearts Out, George Dohrmann offers an up-close and unforgettable look inside the maw of that machine. He shares what he learned from his years spent embedded with a group of talented young recruits from Southern California as they traveled the country playing in elite Amateur Athletic Union (AAU) events. It’s a cutthroat world where boys as young as eight or nine are subjected to a dizzying torrent of scrutiny and exploitation. Coaches vie to have them on their teams. Sneaker companies ply them with free shoes and gear. “All-star camps” are glorified cattle auctions, providing make-or-break opportunities to secure the promise of an elusive college scholarship.    At the book’s heart are the personal stories of two compelling figures: Joe Keller, an ambitious AAU coach with a master plan to find and promote “the next LeBron”—thereby paving his own path to power and riches; and Demetrius Walker, a fatherless latchkey kid who falls under Keller’s sway and struggles to live up to the unrealistic expectations his supposed benefactor has set for him. As their fortunes take shape and the pressure mounts—Demetrius finds himself profiled in Sports Illustrated at age fourteen, while Keller cultivates his business empire—Dohrmann weaves in the stories of numerous other parents, coaches, and players. Some of them see their prospects evaporate as a result of poor decisions and worse luck. Others learn how to thrive in a corrupt system by playing the right angles. Written with incomparable detail and insight, Play Their Hearts Out is a thoroughly unique narrative that reveals the inner workings of an American game, exposing the gritty reality that lies beneath so many dreams of fame and glory.", "title": "Play Their Hearts Out: A Coach, His Star Recruit, and the Youth Basketball Machine", "url": "https://www.goodreads.com/book/show/8124176-play-their-hearts-out", "average": 4.21, "cover": "https://images.gr-assets.com/books/1320501257l/8124176.jpg", "reviews": 220, "authors": [{"url": "https://www.goodreads.com/author/show/3513223.George_Dohrmann", "name": "George Dohrmann"}], "type": ["Sports and Games", "Nonfiction", "Sports", "Biography"], "outlinks": ["http://www.goodreads.com/book/show/8124176-play-their-hearts-out", "http://www.goodreads.com/book/show/9998782-play-their-hearts-out", "http://www.goodreads.com/book/show/37798141-play-their-hearts-out", "http://www.goodreads.com/book/show/8857177-play-their-hearts-out", "http://www.goodreads.com/book/show/34962629-superfans", "http://www.goodreads.com/book/show/13414593-hand-me-down-dream-essay", "http://www.goodreads.com/book/show/36484310-chasing-messi"]}