{"ratings": 9387, "userreviews": [{"userName": "Alan Wightman", "userReviewDate": "Nov 03, 2010", "userURL": "http://www.goodreads.com/user/show/4385204-alan-wightman", "userReview": "Point Counter Point is a tragicomedy about a group of London intellectuals and/or members of the leisured class in the 1920s. Despite cynical and fun-making elements, Huxley allows his characters to formulate a series of profound and serious ideas, amongst them being:(a) Why do people bother with worrying about liberty, democracy and politics, when they should just get on with living their lives (b) It is easier to live the life of the intellectual, to live in a world purely of ideas, than it is to succeed in the art of life – to be on good terms with your colleagues, friends, spouse and children. (c) Art is so much purer and more discriminating than life. In the sense that lurid accounts of orgies never discuss fatigue, boredom or hiccoughs (d) You cannot properly separate the mind from the rest of the body. Any attempt to live a super-pure existence by living entirely in the mental will result in one becoming simply less than humanAnd so on.Huxley is so sharp, so clever and so observant that it is a pleasure to be in his company. Yet he is so cutting about the intellectual pursuits that one can’t but feel guilty that one has the leisure and self-indulgence to be reading such a clever book. One should be undertaking some arduous proletariat task, or at least interacting with one’s fellow man. Or possibly indulging in one of those orgies (although, says Huxley, wickedness becomes as routine and uninteresting as anything else after a while).So many little ideas, compared with Brave New World, which has one huge, overarching notion that there must be more to life than the simple pursuit of pleasure, or even happiness. But Point Counter Point seems much more natural, less clunky, than Brave New World’s 1932 attempt to be 24th century seems in 2008.In summary, Point Counter Point is really good"}, {"userName": "Edi", "userReviewDate": "Feb 20, 2009", "userURL": "http://www.goodreads.com/user/show/2053193-edi", "userReview": "To this day, Aldous Huxley's \"Point Counter Point\" remains my favourite novel. The deepest corners of human nature -- that's where he goes, and that's where I haven't seen anyone else being able to.The novel doesn't have a front-to-back storyline, a precise plot, or a main character. It starts off with Walter Bidlake's \"trials and tribulations\", only to extend to the entire social network of the London elite of the 1930s.Huxley's versatility brings this writing to the status of \"masterpiece\", since all characters are explored (or they explore themselves) in great depth, from the flourishing façade to the darkest memories and secrets. The incredibly beautiful and superficial woman, the rough military leader with a soft spot, the cynical and politically involved, the rich, the one who despises the rich but secretly envies them -- name it, and you've got it there. And then there's the way they all influence each other's lives. It gives you the feeling you're looking at a complicated chess game, only from inside the pieces. It's clockwork, but it's also got the spontaneity you expect to find in the 20 years between the World Wars, when the world was left without any solid values and everyone was just thinking about tomorrow."}, {"userName": "James", "userReviewDate": "Oct 25, 2008", "userURL": "http://www.goodreads.com/user/show/426277-james", "userReview": "Bad people doing bad things, but in a very witty way. That is a brief, if incomplete, summary of Aldous Huxley's novel, Point Counter Point.It is more broadly a \"novel of ideas\" with a novelist of ideas, Philip Quarles, at its center. Quarles is a withdrawn, cerebral man, ill at ease with the everyday world and its emotions. He is surrounded by friends and family whose lives are like those of the monsters that Philip writes about in his journal. Just as Philip decides to structure his novel on the contrapuntal techniques of music (think Bach and Beethoven) the novel Huxley has written is structured in the same way. We are presented with an opening overture of more than one-hundred-fifty pages at a dinner party that serves as an introduction to most of the characters. The remainder of the novel intersperses scenes from their lives, letters from lovers and most interesting, the writings of Philip Quarles, who with his wife spends most of the first half of the novel returning from India and who is the closest to a protagonist that we get. While there is a bit of a literary explosion near the end, this is more a novel of the daily lives of London sophisticates in the 1920s. It catalogues their alternately sordid and ludicrous (sometimes both) erotic adventures, which generally end unhappily.I particularly enjoyed the wealth of references to literature and philosophy, Huxley's polymathic mind shows through on every page. Among the literary references was the use of Dickens in a way that captures one of his essential character traits, \"the appearance of Dickensian young-girlishness\" (p. 19). Overall, I found the play of wit and ideas compelling, enough to bear with the bad people and their antics."}, {"userName": "Vit Babenco", "userReviewDate": "Feb 20, 2014", "userURL": "http://www.goodreads.com/user/show/19283284-vit-babenco", "userReview": "Counterpoint can't exist without a point. The opposites need each other.“The industrialists who purvey standardized ready-made amusements to the masses are doing their best to make you as much of a mechanical imbecile in your leisure as in your hours of work. But don’t let them. Make the effort of being human.”That's an exact description of the today pop culture.“I wanted to change the world. But I have found that the only thing one can be sure of changing is oneself.”Some persons try to be a part of the universal harmony and some want to become a counterpoint and some are just tone-deaf."}, {"userName": "Krishnaroop Chakrabarty", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/14005847-krishnaroop-chakrabarty", "userReview": "Huxley is quite the literary enigma. He is the progenitor of a style of expression that is thoroughly unique and exhaustive in its presentation of the matter at hand and this itself prevents any form of imitation by other lesser competent literary mortals. Yet the only deterrent to Huxley is perhaps Huxley himself. Over indulgence is undeniably his most persistent arch nemesis and it befuddles the authors best efforts in quite a lot of his creations and is well demonstrated here in PCP. The notion is arguable indeed but one cannot quite construct a 400+ novel merely out of a compulsion to isolate and vivisect certain episodic and grudgingly personal philosophies. A short story would have sufficed for this yet Huxley pompously persuades you with a brilliantly structured opening sequence and then abandons you in a confounding melodrama of rambling psychologies and distasteful diversions. This was not expected of the same author whose keenness of perception edited his philosophic and metaphysical outings with such unrelenting effectiveness in the laudable Brave New World and the morbid Ape and Essence. Social criticism is thus an aphrodisiac which Huxley cannot quite forego and yet he is seduced into excesses such as PCP and the drab Those Barren Leaves from which he just cannot liberate himself. No doubt, I am still in awe of the manner in which Huxley struggles passionately against his Achilles Heel and describes the music of Bach, how he deconstructs Romanticisim through Rampion, how he he enamors with an unflinchingly accurate portrayal of dissipating love...and yet I just couldnt proceed beyond page 201. A case of Huxley being slayed by his own ambitions."}, {"userName": "Sofía (Софья)", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/42124049-sof-a", "userReview": "En esta novela Huxley desarrolla varios personajes. No hay uno principal y otros secundarios, son todos iguales en su peso. Mírenlos de cerca: Philip es el intelecto, Walter Bidlake es la carne, lo corpóreo, Rampion es la naturaleza, lo auténtico, Spandrell es un \"demonio\". Son personajes planos, homogéneos. Cada uno parece un componente de algo grande, todos ellos son partes de ese personaje colectivo que nos presenta el autor - de la sociedad británica. Huxley los choca, los hace discutir, intercambiar opiniones, expresar ideas, tesis (de ahí viene el título \"Point counter point\").La novela fue publicada en el año 1928, tres años después del libro de Gide \"Los monederos falsos\". Huxley utiliza la misma herramienta que antes había empleado su colega - el metatexto, novela dentro de novela. PCP es el diario de Philip. Muy minuciosamente el describe el proceso de la creación, las causas, los métodos. Es una literatura egocéntrica, está enfocada en si misma, se interesa solo en si misma. Por que Huxley lo hace? Es una manera de revisar su trabajo, de verlo con otros ojos, de chequear las construcciones. Por esta razón la novela se lee muy fácil, no hay ningún \"entre líneas\", está todo explicado.Otro punto sobresaltante del libro es su lado satírico. Con frecuencia los escritores usan los prototipos para sus personajes pero por lo general los disimulan, Huxley lo hace abiertamente para que los lectores reconozcan a las personalidades de su novela, la tarea que no era difícil para un contemporario de los años 20 en Britania, obviamente tomando en cuenta que se trata de los integrantes del circulo literario-editorial. Yo voy a mencionar solamente dos nombres, los otros Uds los encontraran fácilmente en cualquier artículo sobre la novela. Bajo del nombre de Philip Quarles el autor se representa a si mismo y el personaje de Mark Rampion se basa en D. H. Lawrence, autor de \"Sons and Lovers\", a quien Huxley tenía mucho aprecio. Los que no tenían tanta suerte aparecieron en el relato tratados por el autor con toda ironía y hasta sarcasmo. Parece que burlarse de sus enemigos desde las páginas del libro era un evento común.La década de los 20 es el tiempo de muchos cambios en la literatura. Los escritores experimentan, emplean nuevas técnicas. La literatura no es un arte multidimensional, es lineal. Para empezar con otra escena el autor tiene que terminar con el episodio anterior. Rompen esta estructura utilizando texto fragmentado. Huxley trabaja con esta herramienta constantemente.«Se expone un tema: luego se desarrolla, se cambia, se deforma imperceptiblemente hasta que, aunque permaneciendo reconociblemente el mismo, se ha hecho totalmente diferente. En las series de variaciones, el procedimiento se lleva un paso más allá. Por ejemplo, esas increíbles variaciones de Diabelli. Toda la extensión del pensamiento y de la emoción, y, no obstante, en relación orgánica con un ligero y ridículo aire de vals. Poner esto en una novela. ¿Cómo? Las transiciones bruscas no presentan ninguna dificultad. Todo lo que se necesita es un número suficiente de personajes y de intrigas paralelas, argumentos de contrapunto. Mientras Jones asesina a su esposa, Smith empuja el cochecillo de niño en el parque. Se alternan los temas. Más interesantes, las modulaciones y variaciones son también más difíciles. El novelista modula reduplicando las situaciones y los personajes. Muestra varios personajes enamorados, o muriendo, o rezando, de modos diferentes: disimilitudes que resuelven el mismo problema. O, viceversa, personajes símiles confrontados con problemas disímiles. De esta suerte se puede modular de modo que se presenten todos los aspectos del tema, se pueden escribir modulaciones en cualquier número de modos diferentes.»\"Mientras Jones asesina a su esposa, Smith empuja el cochecillo de niño en el parque.\" - aquí esta la clave. El texto fragmentado en este libro es la herramienta de la sátira.Otro detalle interesante. Huxley elimina las conexiones externas entre las escenas y hace trabajar sus relaciones internas. Cada escena es una idea, una tesis, la próxima escena seria la respuesta a esta tesis pero lo curioso es que las escenas tienen diferentes interpretaciones, entonces ¿cuál de todas sigue Huxley? :) Si tengo que esquematizar la estructura, quedaría así: Escena № 1 (la tesis № 1) -> Escena № 2 (respuesta a la tesis № 1). No puedo no hacer la comparación con Faulkner. El esquema de \"Luz de agosto\" sería así: Escena № 1 (cronológicamente № 28 por decirlo así) -> Escena № 5 (cronológicamente № 15). Escenas 2, 3 y 4 no existen en el libro, el lector tiene que escribirlas en su imaginación. Además, los fragmentos están mezclados en el tiempo. Por eso la lectura de Faulkner es más complicada y más excitante. Volviendo con Huxley, las ideas representadas en PCP están para analizarlas. Son verdaderamente pequeñas joyitas que uno quiere apreciar una y otra vez. Mi libro quedó todo subrayado y con mis comentarios pegados en los márgenes. Se puede tratarlas con los amigos (ó no amigos), yo ya lo hice y fue divertido.Concluyendo, PCP es una novela fascinante por su técnica y contenido intelectual. La recomiendo a todos."}, {"userName": "Greg", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5894339-greg", "userReview": "Point Counter Point, the title says what the book is about - the double bind that humans are in. The quote on the frontispiece is by Fulke Greville. \"Oh, wearisome condition of humanity, Born under one law, to another bound,…\"I read Point Counter Point about ten year ago. With novels that have a vast cast of characters, I started keeping a folded sheet of paper as a book mark adding all the names of the characters as they are introduced into the story so as to remember who is who, and I started writing down lines, quotes, words, not forgetting the page number!Books like P. C. P. are character and ideas based, with the author's philosophy sown into the tale. I don't remember too much of the story, I remember the characters and some scenes. So the notes I kept while reading P. C. P. are a great memory jogger. Looking back I'm surprised at the amount of notes.The situation towards the end of the book with Spandrell and Illidge and the dead body of Everard Webley is unique and hilarious, describing the planning and removal of the corpse, one of those 'physical burst out laughing' moments. I loved the book."}, {"userName": "Andrew", "userReviewDate": "Jan 21, 2014", "userURL": "http://www.goodreads.com/user/show/442654-andrew", "userReview": "A phrase like \"novel of ideas\" sounds so ponderous and leaden-- you'll not find many who liked The Magic Mountain as much as I did, but I'll readily admit it was tough going-- but Huxley proves that a novel of ideas can be on the contrary, witty, playful, and as bitchy as a gin-sodden Truman Capote. Nearly every page has a line that's a total keeper:\"The rush to books and universities is like the rush to the public house. People want to drown their realization of the difficulties of living properly in this grotesque contemporary world, they want to forget their own deplorable inefficiency as artists in life.\"You got me, Aldous, you got me."}, {"userName": "Tony", "userReviewDate": "Aug 11, 2012", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "POINT COUNTER POINT. (1928). Aldous Huxley. ***.\tWell, I read it, but was frustrated in that I didn’t understand what the author was trying to do. I am a big Huxley fan, but this book won’t be included in my list of all-time favorites. First off, there is no plot – at least one that I could find. It reminded me very much of the film, “My Dinner With Andre,” except that this dinner date had about twenty characters in it. It starts out at a musical soiree at the mansion of a very rich couple in London, where the characters get to meet and greet each other. From this event, many go on to a restaurant where there is another party going on. Next, it’s off to another party, where the conversations and relationships continue to grow and confound the reader. It is all composed of witty conversation, but none of it seems to lead anywhere. I was forced to go to Google and see what I missed. There I learned – in an article by Wikipedia – that each of the principal characters was derived from a real life person known to Huxley at the time – though not all were alive at the time. It would be a waste of time to list all of the parallels here; you can look them up yourself. Readers who were contemporaries of this novel probably were able to recognize the characters, while today, ninety years after, it would be almost impossible. This plus the fact that there was a lot of shock value in the behavior of the characters in the book probably made this a best seller. Today, however, unless you get a copy with copious footnotes, the book is severely dated. Although filled with witty conversation, it still doesn’t go anywhere. Keeping all the characters straight is also a chore. Anyway...I was disappointed."}, {"userName": "Realini", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/7873218-realini", "userReview": "Point Counter Point by Aldous HuxleyAnother version of this note and thoughts on other books are available at:- https://www.youtube.com/playlist?list...This is a monumental novel that I must admit to have rejected years ago.How foolish one can be.Aldous Huxley has dazzled me with:-\tBrave New World, The Doors of Perception and now this masterpiece.It is a complex work, with complicated characters and surprising events...There is even a murder, a few deaths and some love affairs.Astonishing points of view are expressed on almost anything From God to the music of Beethoven, from Saint Francis to Tolstoy.Speaking of Saint Francis, there is a personage that attacks the said Francis with aplomb.He was sick, licking the wounds of lepers for his benefit.This Saint did not cure those sick people, he was just enjoying himself.Perhaps I should be ashamed to admit that I found the remarks funny, albeit in a tasteless, cruel and exaggerated way.John Bidlake seems to be towering over this account, at least in terms of seniority, if not with his status as the leonine creator of old.A lover with energy, charm, talent, success and idiosyncrasies he is likeable...up to a point.Walter Bidlake is one of my favorites, the son of the aforementioned painter and trapped in a disastrous affair with Lucy Tantamount, while also cohabiting with a pregnant Marjorie.I just realized that I have to give up on the other characters, even if this mix is fascinating.The dinamic of their relationships was hard to follow sometimes, but this chef d'oeuvre is extremely satisfying.The dialogues are marvelous and the themes are serious and looked at from unusual angles.Tolstoy is dismissed as something of an old fool and I happen to have read The Intellectuals by Paul Johnson which shows that despicable side of the Russian writer...and a good number of others:-\tIbsen, Hemingway, Rousseau...One statement that intrigued me was, I hope similar to what I put here:-\tThe search for The Truth is not really \"noble\".-\tIt is just like any other occupation.-\tIndeed, many of those who think about that are ordinary or worse.It was in the line of challenging Saint Francis, the music of Beethoven which is too wonderful, too heavenly.And there are characters that challenge most accepted points of view"}, {"userName": "Anja Murez", "userReviewDate": "Jan 03, 2012", "userURL": "http://www.goodreads.com/user/show/6967252-anja-murez", "userReview": "I reread Point Counter Point after discovering that Dorothy L. Sayers wittely, intellectually and mostly gently pokes fun at the book and its author in \nThe Documents in the Case\n, in the person of John Munting, alias Philip Quarles, alias Aldous Huxley himself (talk of Russian puppets inside puppets!). Of course Aldous Huxley was a pacifist, Sayers quite the contrary; Sayers was a Catholic, be it more of the mind than of the heart, where Huxley tends to some unspecified universal mysticism. Both are \"\npassionate minds\n\". Point Counter Point offers great satirical portraits of D.H. Lawrence, Katherine Mansfield, Lady Ottoline Morell, and Huxley himself. In this first \"novel of ideas\" Huxley experiments with an essayistic form of narrative, trying to cramp as many ideas & theories into the book as possible. \"Ape and Essence\", as it were. When the reader gets rather bored with the non-moving non-plot & the avalanche of philosophical talk, Philip-Quarles-alias-Huxley explains why the book is getting so sadly tedious. Then follow a Murder, and the Death of a Child. All the Great Questions are raised in both books – \"What is Life\", of course, Religion & Politics, and the respective beastlinesses of Communism and Fascism. And Sex, the big teaser of the Thirties. Both are brilliantly funny. As a crime-novel, Documents is rather a disaster - as a novel, Point is rather a bore. But essayistically spoken, both are gorgeously brilliant."}, {"userName": "Daniel Leverquin", "userReviewDate": "Oct 11, 2016", "userURL": "http://www.goodreads.com/user/show/52152232-daniel-leverquin", "userReview": "Sam naslov se odnosi na transpoziciju muzike u književnost sa namerom da opiše isprepletene životne priče različitih likova koji bez obzira na karakterni kontrast vežu jake niti sudbinske privlačnosti. Kontrapunkt kao oblik muzičkog umeća vešto je utelovljen u priču. On navodi na visoko intelektualni stil autora, koji je jedan od njegovih zaštitnih znakova.Na roman se može gledati kao na mozaik sastavljen iz suprostavljenih delova koji se savršeno uklapaju u tkanje života, s jedne strane licemerje i lažnu pobožnost Barlapa, a s druge oštar jezik, učenost, i objektivni pogled na svet Rampiona, prezir prema svetu Morisa Spandrela i nasuprot njoj ravnodušnost Filipa Kvorlsa, altera ega samog Hakslija. Ovde moram napomenuti da je šteta što izraz spandrelovština nije ušao u svet književnosti kao karamazovština, zbog cinizma, jakih neiživljenih osećanja Morisa, prototipa osobe zasićene životom, koji kao da je pobegao iz nekog romana Dostojevskog. U nekim momentima ličio je na Raskoljnikova, a upoređen je sa Stavroginom u jednom delu romana.Naravno, kroz knjigu se otvaraju različita krucijalna pitanja, vezana za religiju,filozofiju, politiku... Ispoljava stavove od koji su neki proročki (pogađa početak Drugog sv. rata). Zanimljivo je navesti da nema glavnog lika već svako igra svoj ples kao što i različite melodije u kontrapunktu daju osobenost jednoj na kraju muzički skladnoj celini."}, {"userName": "Darran Mclaughlin", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5897674-darran-mclaughlin", "userReview": "Neither brilliant nor awful. It has some good elements but it has no central theme or idea, and no plot to speak of. It reminds me of a cross between Vile Bodies and The Mandarins by Simone de Beauvoir. It is a book about the racy nihilism and the upper classes in the jazz age and a 'roman a clef' about the ideas and personalities of the twenties. I recognized the character of DH Lawrence, and it was interesting to see how highly he was thought of at the time. I think I got who James Middleton Murray was supposed to be, and I think I might have understood who Huxley himself was, but I have no idea who Katherine Mansfield was supposed to be as none of the female characters are writers or New Zealanders. It wasn't a bad book but I wouldn't recommend it to anyone. The most interesting bit of it for me was the character of Philip Quarles, who resembles me so much he could have been based on me. I should add that as a novel of ideas it is nowhere near the quality of the great, usually Germanic novels of ideas. It isn't in the same league as books like The Magic Mountain, The Man Without Qualities, Atomized or anything by Dostoyevsky."}, {"userName": "Mirna", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/63496199-mirna", "userReview": "Dolazi na red \"in my time of need\"; Huxleyju se uvijek rado vraćam.Nije mi lako sažeti dojmove, budući da je Kontrapunkt knjiga koja je, doslovno i najjednostavnije rečeno, pretrpana svime i svačime. Odlučila sam ignorirati činjenicu da se radi o romanu, kao i samu radnju (ako ona kao takva uopće i postoji, jer dobiva se dojam da su sekvence događaja nanizane jedino sa svrhom da se izolirani esejistički zapisi nekako povežu). Premda su me pojedini dijelovi osvojili te sam se na iste vraćala za vrijeme čitanja, to isto ne mogu reći za knjigu u cjelini.On opet piše o ljudima, secira ih. Likovi (kojih zaista ima mnogo i nije ih najlakše upamtiti, osobito u početku) iskorišteni su kao sredstva-predstavnici ideja, kao primjeri rastezljivosti granica svega što je ljudsko.Analize i dijalozi su iscrpni i temeljiti, riječi kao da su odvagnute matematičkom preciznošću-pogađaju u srž, cinizam nenametljiv i doziran, tek toliko da začini tekst...jer neke istine trebaju malo cinizma da postanu komične. Valjda su tada lakše probavljive.Huxleyja se nekad naziva vizionarom, čovjekom koji je bio ispred svog vremena, koji je predvidio \"moderno društvo\" kakvo danas imamo. A meni se čini da je samo imao istančanu sposobnost opažanja i procjene. 1928./2018.-isti ljudi, slične priče, nove okolnosti. U svakom slučaju, većim dijelom zabavno i stimulativno štivo... :)"}, {"userName": "John", "userReviewDate": "Mar 18, 2009", "userURL": "http://www.goodreads.com/user/show/2095414-john", "userReview": "Huxley is one of those important writers that are rarely read, outside of his famous work \"Brave New World.\" That is an important work and it is easy to see why it is so well known, and well-read. But it is Point Counter Point that is the far more important, and more significant work. The book is largely about two families--the Bidlake's and the Quarles' along with their circle of friends and relations. The two families are tied together through the marriage of Philip and Elinor, who begin the novel in India, but return to England where the majority of the novel takes place.Huxley is an ambitious and skilled writer. He is interested in how what one thinks affects how one lives. The psychology and the motivations of his characters are central to the story. This is apparent from the outset, as Huxley shows how Walter Bidlake is torn between obligations he has to his pregnant mistress and his lust for a new lover. He is burdened with guilt and misgivings, but in the end, his lusts are too great to overcome and he surrenders himself in a manner that is quite disconnected from the way he lives the rest of his life. It is fascinating that he recognizes how fruitless and joyless his affair will be, and it is indeed so. It is a disgusting, jealous kind of affection--far from the kind of contented love found in marriage. Meanwhile, his pregnant mistress moves from jealous anger to contented sadness in watching her lover give himself to a joyless, lustful affair. Surprisingly, she finds contentment in Christian piety.Through Walter and his new mistress, Lucy Tantamount, we are introduced to the wastrel, Maurice Spandrell. Spandrell is an interesting character, as he is a contrarian--a materalist with spiritualists, a spiritualist with materialists, etc. But at his core, he wants to have a God to believe in, but failed to believe. This conflict of visions drives the climax of the book.The book is primarily concerned with the connection between belief and behavior. How ought we to think, and how ought we to behave? In this regard, Huxley is a prophetic in understanding the absolute failure of the materialistic worldview. He recognizes the brutality of a world without God. He recognizes that morality exists and binds us. All the characters are ultimately constrained with feelings of guilt--even those that do not believe it possible, or believe they can resist such feelings.But the novel ultimately fails to satisfy, as the book ends with a rather despicable weaseling his way out of a contractual commitment with one woman to allow himself the freedom to pursue a sexual commitment to another. The only truly happy people in the book are left in their happiness and do not reappear later. But this is one of those rare books that takes the mask off of the materialistic worldview so pervasive in the modern world. It is a vicious thing."}, {"userName": "Oliver Twist & Shout", "userReviewDate": "Dec 05, 2014", "userURL": "http://www.goodreads.com/user/show/5425403-oliver-twist-shout", "userReview": "Es tan pedante, pomposo y pesado que dan ganas de robar un Delorean, viajar al pasado, luego viajar a Londres, esperar a Aldous Huxley en la puerta de su casa y darle un paliza de órdago. Conseguir que recobre la visión después de una buena hostieja a rodabrazo. Tan horrendo es que hace que el Brave New World parezca un accidente. Hasta antes de leerlo, no sabía que se podían escribir diálogos tan petulantes en un libro y encima hacerlo tal que así, completamente en serio, sin ironía de ninguna clase. A lo mejor es que hay estar empapado en mescalina para encontrarle la gracia al puñetero libro, no sé. O a lo mejor es que el traductor es un criminal profesional."}, {"userName": "Marc", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/2876105-marc", "userReview": "A very typical Huxley: fine intellectual discussions, moral dilemma's, and lot's of characters eagerly making their own life miserable. Connotations of satire, some sardonism, and in general blunt pessimism. A very stimulating read, portraying the infertility of intellectual circles."}, {"userName": "Kate Savage", "userReviewDate": "Nov 13, 2013", "userURL": "http://www.goodreads.com/user/show/25582110-kate-savage", "userReview": "I give this book two stars but not because I consider it mediocre. It's just an average of two extremes: some moments superb and some moments catastrophically bad. Particularly if you're a feminist, or have any investment in a non-rapey world.THE GOOD: Huxley pays attention to class. A person's position of power or disenfranchisement is shown as the foundation for the most intimate of thoughts (you can only believe certain things when you have a guaranteed weekly income). It is latent in any physical object (a house is described not just architecturally but historically, through political economy: meaning you trace the rounds of theft and disenfranchisement behind the splendour of the rich). I began the book with excitement, thinking somebody had combined the delicate social psychology of Henry James -- which bathes a reader’s brain in the jubilation of being a social primate, capable of reading thoughts into actions and faces that in turn can read your own -- somebody had joined this with a subject matter that actually mattered. James is all the petty interplay of the frivolously rich; Huxley promises to delve straight to all the big questions.Most of the action of the novel is gathering to talk (until the very end, where Huxley throws in several astonishing events). Sometimes the conversations are marvellous, like the rousing argument between a right-wing paramilitary leader and an upper-class scientist about phosphorus. THE BAD: At other times it's all impossible to believe. In an actual life, when very intelligent people get together, no one ever is allowed to monologue for an entire chapter, with only occasional three-word questions here and there to keep the good lecturer going. It feels too obvious that Huxley had written an essay and wanted to push it in there somewhere. As Huxley himself writes in the book: \"people who can reel off neatly formulated notions aren’t quite real; they’re slightly monstrous. Living with monsters becomes rather tiresome in the long run.\" So does reading about them.And of course you'll get uneasy about the gimmick of a novelist writing a novel about a novelist writing a novel about a novelist writing a novel . . . \"And so on to infinity, like those advertisements of Quaker Oats where there's a Quaker holding a box of oats, on which is a picture of another Quaker holding another box of oats, on which etc., etc.\" Very cool idea . . . for an oat package.THE TERRIBLE: RAPEY! ALERT!I mentioned Henry James earlier, who could do one thing Huxley can't: write of a woman who thinks. In PCP, women can be funny, shrewd, wicked or good, but they cannot be thinkers.There’s more, and there’s worse: Rape is real, and a legitimate subject for literature. A crucial subject for literature, even. But while I live in the world with soaring sexual abuse rates, I’m not about to have any patience with an author -- particularly a male author -- who presents rape as a great way to win your girl. It's all throughout the book, but the real rapey-charmer is the paramilitary strike-breaker, Webley, who writes this gem of a letter to the lady he fancies:I warn you: one of these days I’ll try the good old methods. I’ll do a slight Rape of the Sabines and then where will your ineffable, remote superiority be? How I hate you really for compelling me to love you so much! It’s such a damnable injustice -- getting so much passion and longing out of me and giving nothing in return. And you not here to receive the punishment you deserve! I have to take a vicarious revenge on the ruffians who disturb my meetings [. . . at which point he describes beating up some commies . . .] it was really you I was fighting. If it hadn’t been for you I wouldn’t have been half so savage. [. . .] The next fight will be against the real enemy -- against you. So be careful, my dear. I’ll try to stop short of black eyes; but in the heat of the moment one never knows.Whew, what a charmer! So MANLY! Nothing says I love you like a “slight rape” threat!The female characters appear to be into this bruise-your-face 'uncontrollable passion.' It feels like I'm reading an Ayn Rand novel.When rape isn't happening or being threatened, misogyny can be more versatile. Philip, the character stand-in for Huxley himself, gets irritated that a woman he thinks is hot wants to actually talk to him. He thinks: \"A woman who uses the shapeliness of her breasts to compel you to admire her mind -- [. . .] trying in private life, very trying indeed.\" You heard right -- she's just using her boobs to make a man listen to her ideas. Very bad manners.When he pushes for sex, and she is clear she doesn't want his \"pouncing and clawing,\" Philip leaves her with this lecture: \"if you were really and consistently civilized, you'd take steps to make yourself less desirable. Desirability's barbarous. It's as savage as pouncing and clawing. You ought to look like George Eliot. Good-bye.\"She sexually assaulted me first . . . by not making herself ugly enough for me to not want sex. If Huxley had been interested in doing some of the same insightful analysis of gender that he does with class, this could be one of the best books, even if it couldn't escape the inevitable problems of a \"novel of ideas.\" But he fails spectacularly."}, {"userName": "Veronica", "userReviewDate": "Apr 18, 2011", "userURL": "http://www.goodreads.com/user/show/3873925-veronica", "userReview": "I am still shaking my head in disbelief that Huxley penned this drivel just four years prior to the publication of Brave New World. Perhaps I’ve missed his point (sorry, just couldn’t help myself), but this one was a snooze fest for me. There was, as expected, some great dialog and a multitude of interesting characters, however, I cared for none of them nor did I care for this lengthy tale.There is, of course, class distinction, however, most of the affluent characters were rather self indulgent bores while the lower echelon were envious, ignorant and foul mouthed. While I get the cracks and sarcasm, it either didn’t go far enough or went too far. Many of the characters are said to be based on actual people including the likes of D. H. Lawrence, Augustus John, and Nancy Cunard. Some autobiographical comparisons are also insinuated, supposedly as Philip Quarles, but possibly as Walter Bidlake.There’s Marjorie Carling who is seduced and impregnated by Walter Bidlake. She pines away for her man who, she is quite aware, is out pining for another. This is a pitiful woman whom we never get to truly know so she never garners any deserved sympathies.Walter Bidlake is the man who doesn’t want what he has and wants what he doesn’t have. He is well aware of his wrongdoings, but oh, he just feels so sorry for himself and his current predicament. Well, I didn’t feel sorry for him and most certainly, did not like him.Lucy Tantamount is free spirited and sexually promiscuous as well as self indulgent and intellectually lacking. Described as somewhat unattractive, one can only guess (cough, cough) why men are attracted to her like flies. Another unlikable character.Huxley covers the literary gamut including the have’s and the have not’s, infidelity, alcoholism, cancer, and premature death, but we either don’t know enough about any given character to care or know too much and still don’t care. There is an unexplained murder that really just doesn’t fit in with all of the hedonism that abounds. I get that this was truly satire, but it just didn’t work for me. I couldn’t wait to finish this one…I’m sure I’d enjoy Mr. Huxley’s company, but I would steer clear of discussing this novel and perhaps ask about his teaching of the young George Orwell.My rating for Point Counter Point is a 5 out of 10."}, {"userName": "Andrés Cabrera", "userReviewDate": "Oct 13, 2014", "userURL": "http://www.goodreads.com/user/show/8404507-andr-s-cabrera", "userReview": "Una de las mejores novelas que he podido leer. Si bien es difícil resumirla, Contrapunto se basa en diferentes historias, múltiples voces polifónicas que tienen una realidad en común: la Inglaterra de principios del siglo XX. Cada personaje tiene un concepto bajo el cual rige su vida (en ese sentido, todos estos serían \"monstruos\", como bien dice Huxley, pues no hay nadie que viva así en la vida real). Se está ante el positivista científico, el hedonista, el erudito burgués, el proletario venido a burgués, el aristócrata hipócrita y deleznable, entre otros. La entrada a este momento histórico preciso se da sobre la base de la pérdida del \"mundo\" anterior, de ese periodo histórico en el que los aristócratas vivían con elegancia y solvencia. Estos, ahora se perciben como seres en decadencia: burgueses con una moral deleznable, apresados bajo las \"apariencias\" y \"encantos\" que perduran en una sociedad desencantada.Sin duda alguna, esta novela vale cada palabra escrita (y leída, por supuesto). Sólo queda dedicarle un buen tiempo."}, {"userName": "Leah", "userReviewDate": "May 30, 2011", "userURL": "http://www.goodreads.com/user/show/5456299-leah", "userReview": "Utterly addictive. This book had some indescribable quality about it that made it completely fascinating, although it was ostensibly about not very much at all. Filled with the intellectual, raging, pathetic, humorous musings of all its characters, it held up so many strings all at once and never dropped any of them. It took me a while to get all the names of the characters right (I kept confusing Burlap and Bidlake, for example, and forgetting who Walter was), but their experiences and inner monologues were so entertaining and different from each other that the names hardly mattered. I found myself thinking about A Handful of Dust while reading the Phillip and Elinor scenes, especially towards the end. Tragedy and comedy seemed to be inextricable in all these characters' lives, and the political madness of Webley was mirrored in Rampion's worldly lifestyle, Phillip's distant lifestyle, Illidge's working-class rage and even in Elinor's matter-of-fact outlook. I found this extremely satisfying.I loved this book!"}, {"userName": "Bookaholic", "userReviewDate": "Jan 12, 2014", "userURL": "http://www.goodreads.com/user/show/27577243-bookaholic", "userReview": "Acum vreo şapte sau opt ani, când am citit pe nerăsuflate Punct Contrapunct şi am trecut-o repede în galeria personală a cărţilor de aur, m-am regăsit în (sau mai bine zis, am aspirat umil să mă asemăn cu) personajul Philip Quarles: un romancier deşirat, osos, cu un simţ al umorului cel puţin discret (ca să fiu gentilă) şi care se lăfăia într-un intelectualism asumat, trecând totul prin filtrul nemilos al creierului dumisale genial.Iată şi pasajul pe care l-am copiat atunci conştiincios şi caligrafic în caiet:O, da. Philip Quarles eram (sau aş fi vrut foarte tare să fiu) chiar eu! Mintea nesăţioasă, firea schimbătoare şi (deductibil din continuarea pasajului de mai sus) spiritul liber, dar chinuit şi blocat de această libertate însăşi! Nu mai exista niciun dubiu. (continuarea cronicii: http://bookaholic.ro/punct-contrapunc...)"}, {"userName": "Denerick", "userReviewDate": "Apr 16, 2009", "userURL": "http://www.goodreads.com/user/show/2220222-denerick", "userReview": "A truly fantastic book. Read this in the buildup to university exams in between college books and other things I had to read for UNI. While my mind was focused on that, in the evenings and before bed, Huxley exercised the more important parts of my brain. I can't do the book justice on the grounds that I lack the intelligence to truly convey what Huxley presents in Point Counter Point. All I can say is that this book is among the best I've ever read, on a whole range of issues. It tackles the meaning of life, tragedy, joy and nihilism in a complex matrix of characters one strains to keep track of at times. Delivered with funny and at times absurdist wit, the book never fails to provoke the mind whether in rejection or agreement."}, {"userName": "Jay", "userReviewDate": "Mar 12, 2011", "userURL": "http://www.goodreads.com/user/show/5086169-jay", "userReview": "A tortured thing to slog through, it might have been a decent novel if Huxley and his editor (if there was one) had cut certain aimless philosophical discussions between the intellectual men. Huxley wants to argue with himself in public, fine, let him do it in an essay not couched in the trappings of an otherwise entertaining piece of fiction.It is rather a collection of vignets, some of which (like the story of Marjorie, Walter, and Carling) Huxley seems to lose interest in. Of the many melodramas set up in the beginning only one or two reach conclusion."}, {"userName": "Nataša", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/4994064-nata-a", "userReview": "Razvukla sam je na jedno mesec-dva, pa možda zato i nisam uspela u potpunosti da se stopim s njom...opšti utisak je prosečan, zbog toga trojka.Kad sve sumiram, osim velikog broja likova, totalno različitih, gde je skoro svako u nekom svom svetu (što nas još jednom podseća na to koliko smo svi posebni i jedinstveni), mogu reći i da mi se posebno dopala raznovrsnost međuljudskih odnosa, naročito muško-ženskih. Da ne nabrajam, ko je čitao, znaće o čemu govorim :)"}, {"userName": "Sara Zovko", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/55287577-sara-zovko", "userReview": "Što bi Huxley imao reči/napisati za današnje društvo, današnje bogataše i današnje intelektualce? Koliko bi se usamljen tek osjećao u našem vremenu? Likovi Kontrapunkta zatvorenici su vlastitog karaktera i ega, bogati intelektualci nezadovoljni životima koje žive, sjajni izvana dok u sebi tragaju za smislom, istinom i Bogom."}, {"userName": "Ivana", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/6323079-ivana", "userReview": "For some reason I thought that I haven't finished this novel. Reading it again, I realized that I had finished it. I didn't mind rereading it, thought. I still think that is an excellent novel."}, {"userName": "AJ Finkle", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/60828417-aj-finkle", "userReview": "Does man, in pursuing the intellectual, deny and suppress its natural (and often described as baser) instincts? Are these instincts just as vital, or perhaps even moreso, to the healthy human experience as knowledge, faith, and science? Is the intellectual life and the search for Truth a convenient and easy distraction from or excuse to avoid actually having to live one's life, and interact, feel, and connect with other human beings? Are these qualities exclusive to those who are well enough off financially to have the time and means to educate themselves and indulge in this lifetime of mental masturbation, while the less privileged, who are resigned to a daily life of drudgery, don't have the luxury to sit around debating deeply philosophical notions? These are just a few of the questions Huxley examines in Point Counter Point, an entire novel devoted ironically to engaging in the very actions described above. It was a very unsettling read for me, as I found myself alternating between marvelling at the deftness with which Huxley uses his characters and dialogue to explore themes of ultimate meaning, detachment, ennui, sex, love, science, religion, etc. and feeling disgust with these privileged, hypocritical, elitist aristocrats with no real perspective beyond their own artificially created bubbles having no problems ruminating and speculating on the lives of the lower classes of which most of said characters know nothing. And yet, despite this, still adoring the minds of these characters. Philip Quarles was my favorite character in the novel, and maybe one of my favorite characters in any novel. I relate intimately to his social detachment, his inability to hitch his wagon to any idea or notion permanently or adamantly, and his crippling awareness and self-consciousness of these qualities while at the same time being pitifully unable to change them.This was one of those rare and special reads that comes along at the right time in one's life and hits one in exactly the right way at exactly the right time; one of those reads which in my weaker and more sentimental moments might beckon me to entertain the idea that I was somehow \"meant\" to read this at this moment in my life, before reason takes back the reins and dismisses that as the self-indulgent nonsense it is."}, {"userName": "Ana Craciun", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/38638877-ana-craciun", "userReview": "Dupa o indelungata si minutioasa cercetare a bibliotecilor iesene si dupa o asteptare cat toate zilele de joi, pot spune ca Jeni Acterian avea dreptate: ,,o curata bucurie si in acelasi timp o tristete''. Cele mai bune 600 de pagini pe anul asta."}, {"userName": "Fernanda", "userReviewDate": "Apr 04, 2018", "userURL": "http://www.goodreads.com/user/show/10100254-fernanda", "userReview": "“Cuesta tanto trabajo escribir un libro malo como uno bueno; sale con la misma sinceridad del alma del autor.”Sobre lo absurdo del ser humano."}], "description": "Aldous Huxley's lifelong concern with the dichotomy between passion and reason finds its fullest expression both thematically and formally in his masterpiece Point Counter Point. By presenting a vision of life in which diverse aspects of experience are observed simultaneously, Huxley characterizes the symptoms of \"the disease of the modern man\" in the manner of a composer--themes and characters are repeated, altered slightly, and played off one another in a tone that is at once critical and sympathetic.First published in 1928, Huxley's satiric view of intellectual life in the '20s is populated with characters based on such celebrities as D.H. Lawrence, Katherine Mansfield, Nancy Cunard, and John Middleton Murry, as well as Huxley himself.", "title": "Point Counter Point", "url": "http://www.goodreads.com/book/show/5135.Point_Counter_Point", "average": 3.85, "cover": "https://images.gr-assets.com/books/1386925117l/5135.jpg", "reviews": 264, "authors": [{"url": "https://www.goodreads.com/author/show/3487.Aldous_Huxley", "name": "Aldous Huxley"}], "type": ["Fiction", "Classics", "Literature", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/5135.Point_Counter_Point", "http://www.goodreads.com/book/show/4799725-point-counter-point", "http://www.goodreads.com/book/show/6061813-point-counter-point", "http://www.goodreads.com/book/show/4699452-contrapunto", "http://www.goodreads.com/book/show/3716631-point-counter-point", "http://www.goodreads.com/book/show/12340374-kontrapunkt", "http://www.goodreads.com/book/show/6940848-contrapunto", "http://www.goodreads.com/book/show/16110258-contrapunto", "http://www.goodreads.com/book/show/7712868-punct-contrapunct", "http://www.goodreads.com/book/show/20878142-contrapunto", "http://www.goodreads.com/book/show/5129.Brave_New_World", "http://www.goodreads.com/book/show/5479.Brave_New_World_Brave_New_World_Revisited", "http://www.goodreads.com/book/show/5128.The_Doors_of_Perception_Heaven_and_Hell", "http://www.goodreads.com/book/show/5130.Island", "http://www.goodreads.com/book/show/5481.Brave_New_World_Revisited", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}