{"ratings": 9868, "userreviews": [{"userName": "Ginny", "userReviewDate": "Jul 14, 2012", "userURL": "http://www.goodreads.com/user/show/6614648-ginny", "userReview": "Really wanted to love it but I did not. I am sure I am in a minority around here, Dorothea Benton Frank is a local hero. But this booked dragged on and on. I found the dialogue between the characters to be ridiculous. I have been here a long time as has my family, for many generations. I have yet to hear a single low-country person or Charleston native every speak in the way these people spoke. It was so silly, they all sounded like they were in some really bad highschool play. I was embarrassed that they were portrayed in this way.This book really did not even have much of a plot line to speak of, certainly no tension or question of how it was going to end. I was disappointed. For me, it was not even a very fun beach read. I feel that the author has become very formulaic in her writing. Maybe it is time to switch genres or just take a break."}, {"userName": "Kristen", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/1192196-kristen", "userReview": "This is a pleasant read, especially if you ignore the uninspired writing and the truly awful dialogue. (The things the 10-year old boy says are completely unbelievable.) It is told in alternating voices, and whether by design or because of the lack of skill of the author, the voices sound almost too similar to differentiate. The setting is good though, and some of the characters are interesting, but this is not a set-your-hair-on-fire story by any means. It's pretty much Mac 'n cheese. If you want a lovely watercolor of the South, this will be right up your alley. Edit: I've given this book up. It's so full of cliches and stupidity that I simply cannot go on. I really don't know who reads books like this."}, {"userName": "PacaLipstick Gramma", "userReviewDate": "Jul 15, 2012", "userURL": "http://www.goodreads.com/user/show/10736041-pacalipstick-gramma", "userReview": "Unlike others, I thought this book was terrible. I rated it 1 star, but if I could, I would have rated it a half star.The story line is so unbelievable that I had a hard time getting through the book. I kept thinking it would get better. WRONG.Her husband dies a horrid death, and 2 months later she's falling for the handsome Dr. next door to her parents' home? If she was so devastated, I would think it would take longer than a couple of months to get beyond that grief. Less than 9 months later she's engaged? And her 10 year old son is depressed and that's ok? She's a nurse, so she, of all people, should understand the ramifications of depression.The characters were also too unrealistic. Much too sappy and making nice.This read more like a fairy tale.I will not waste my time reading any more of this author's books."}, {"userName": "Wayne White", "userReviewDate": "Aug 18, 2012", "userURL": "http://www.goodreads.com/user/show/11924928-wayne-white", "userReview": "Book ReviewByC. Neuroticus Absolutus\tI just finished reading Porch Lights by Dorthea Benton Frank, another story about life on the barrier islands of South Carolina. They say write about what you know best. Ms. Frank was born and raised on Sullivans Island and weaves a treasure trove of knowledge and experience into one story after another about the South Carolina Lowcountry. I’ve read eight of the dozen books she has written, each with charming, lovable characters who draw the reader into real-life predicaments where Ms. Frank lets the characters lead the reader to happy endings. She writes feel-good books that go well with sun block, sand, seashells, colorful beach umbrellas and pitchers of Margaritas. She has mastered the art of storytelling with an occasional twist of humor. Moreover, whereas the average chick-lit authors write to fit the formulas of the Harlequin ilk, Ms. Frank skillfully constructs entertaining narratives outside the constricting formula mold.\tPorch Lights features Jackie McMullen, an Army nurse with multiple tours of Afghanistan who is widowed when her firefighter husband dies in the line of duty. She comes home to a ten-year-old son Charlie who is devastated by his father’s passing―as is she. The boy’s depression leads her and her son from New York back to Sullivans Island and her long-separated mother and father. Jackie refuses to believe that she will ever love again and plans to return to Brooklyn before the next school year begins. But Charlie develops a relationship with his grandfather and the kind bachelor doctor next door and refuses to leave the island. An approaching hurricane provides the impetus for Jackie to leave Sullivans Island quickly, but Mother Nature moves in to put the kibosh on all human plans. \tOh, did I mention that Steve Plofker, the handsome doctor next door, eyes curvy nurse Jackie from the moment she arrives home. Before you can say Bob’s your uncle, he develops longer-range plans for Jackie than she is willing to consider. As they say, love will find a way. Or will it?\tEach chapter in Porch Lights is preceded by a quote from Edgar Allen Poe, whose work The Gold Bug captures young Charlie’s imagination and leads him to discover the marvelous history of Sullivans Island, which Ms. Frank skillfully intertwines in her story. What’s more, each chapter alternates the point of view between Jackie and her mother Annie. An unusual approach considering that most agents, editors and critics say never switch points of view. However, in Porch Lights, Ms. Frank accomplishes this with a story that changes POV effortlessly and seamlessly, a credit to her mastery of her craft.\tI like action/adventure Uzi-toting bad guys and all-American, Glock-in-hand heroes who look like they stepped out of a WWII Army recruiting poster. Still, with all that tiring action, I occasionally need a laid-back story that tugs at my heartstrings and lets me unwind. That’s when I turn to Ms. Frank’s creations, books guaranteed to warm your heart and let you relax.\tI admit that Ms. Frank’s books are getting more predictable with the printing of each new novel. I believe her best work lies in her earlier books. Nevertheless, I like her stories. I know pretty much what I’m going to get when I take one of Ms. Frank’s novels to the cash register. No disappointments.\tBedtime or beachtime, poolside or plane ride, Porch Lights is a good read."}, {"userName": "Regina Spiker", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/4274600-regina-spiker", "userReview": "Ms. Frank never fails to amuse and entertain me. Her characters always touch my funny bone and in this novel Annie Britt, matriarch and owner of her home, The Salty Dog down on Sullivans Island, makes me giggle out loud with her thoughts and words. Things like: “I had two hormones left. Benedict and Arnold” and “I still believed I could handle Dr. Love. That’s why the Lord invented dimmer switches. There comes a time when we’re all better off in the dark.” Annie’s daughter Jackie and her sweet ten year old son, Charlie, have come to spend the summer with her. Jackie’s husband, a New York City fireman, recently lost his life doing the job he loved and both Jackie and Charlie were still distraught – so back to the island they came. Can the lovely Low Country and Annie’s love heal their hearts? This novel is a great summertime read or anytime read…Another line by Annie and wholeheartedly agreed with is: “…because a book lets your imagination soar and a movie makes all the decisions for you.”"}, {"userName": "Denise", "userReviewDate": "Dec 04, 2012", "userURL": "http://www.goodreads.com/user/show/2953994-denise", "userReview": "This is a typically enjoyable read from Dotty Benton-Frank. The locale is Sullivan's Island, a favorite place of ours (and where the author is from)....so, what is not to love? The main character has lost her NYFD husband to a fire related accident. She comes to Sullivan's Island to spend the summer school holiday because she is concerned about the prolonged depression of her ten-year-old son. The beautiful setting and presence of family work their magic and both Jackie and her son begin to recover from their loss. The story was a bit predictable but the quirky, lovable personalities make up for that....On a more personal note, the MC is protrayed as an Army Reserve nurse and although she thanks someone for helping her with this part of the story, the author makes multiple errors in this story line. I wish she or her editor had really sought some technical fact-checking to prevent folks like me from being annoyed. I am a 29 year Army employee and my husband was in the Army for 30 years, so I can't help but feel annoyed that she does not know the difference between enlisting and being commissioned as an officer or that U.S.Army is a proper noun which is capitalized (unlike military which is an adjective). The medical facts are pretty muddy as well and should have been reviewed more closely by a career nurse."}, {"userName": "Marla", "userReviewDate": "Jun 24, 2012", "userURL": "http://www.goodreads.com/user/show/4021000-marla", "userReview": "Enjoyable audiobook. Well written and kept the reader's attention."}, {"userName": "Kathleen (Kat) Smith", "userReviewDate": "Jun 06, 2012", "userURL": "http://www.goodreads.com/user/show/4328680-kathleen-kat-smith", "userReview": "Porch Lights are a sign of welcome or a symbol that you are waiting for someone to come home and that's exactly what you, the reader, will find when you read the latest novel by Dorothea Benton Frank, Porch Lights!I guess the hardest thing for someone to deal with in life is to lose someone that they love. Dealing with the loss and finding a way to move forward when it feels like you lack the motivation to do so would be a challenging thing to do. Yet that is exactly what Jackie and Charlie McMullen are trying to do. Finding a way to move forward without Jimmy McMullen, who was killed as a New York fireman when the building he was in collapsed, living Jackie without a husband and young, ten-year-old, Charlie without a dad.Now Jackie is trying to find a way to pull Charlie out of a lingering depression that is consuming his life. Withdrawing as an Army nurse, Jackie takes a trip back to her childhood home on Sullivan's Island in Charleston to stay the summer with her mom, Annie Britt in hopes of finding a solution. What she learns there is a process of letting go of the pain but retaining the love and memories she has of her life with Jimmy and begin building a new one. Along the way she learns how much she needs to change as well as the beach begins to sooth away the worn and sharp edges of her past. She learns to let Charlie begin to experience his own challenges as a boy growing up, from skateboarding with the friends he meets, sleep overs, baseball games and learning a different way of life from the one he left behind before the summer.Along the way, Charlie and Jackie have plenty of help from not only Jackie's mom Annie, but her father, Buster who comes and stays with them to help Charlie make the transition much easier doing stuff a father and son might. A neighbor next door to Annie's, is a local doctor, Steven Plofker, who offers Charlie a job walking his dogs and taking care of them for the summer while teaching him the value of a job and responsibility. He is also very interested in Jackie seeing as they both share losing a spouse in common.The delight the reader finds in Porch Lights by Dorothea Benton Frank is a life that is much more simple. Spending the days walking along the beach in search of the ocean's treasures, sharing homemade ice cream from an old fashioned crank machine, and just memories of grilled bar-b-que meals eaten in the company of close family and friends on porch, calls the reader home in a serene way. Healing begins for all of them and changes how they view life as they work together to move forward in the next chapters of their life. Dorothea paints such a splendid canvas for the reader, you can smell the salty air and feel the cool ocean breezes in her latest novel.I received Porch Lights compliments of William Morrow, a division of Harper Collins publishers for my honest review. If you are truly looking for a memorable summer read, than search no further and pick this one up. It is such a treasure to find a difficult subject like the loss of someone dear is something to be shared with family and friends and in the end changes them all and brings healing no one really expected. I rate this one a 5 out of 5 stars and the cast of supporting characters Dorothea created make this an exceptionally fun read, especially Jackie's mom, Annie who fears aging the most!"}, {"userName": "Lorretta", "userReviewDate": "Jun 20, 2012", "userURL": "http://www.goodreads.com/user/show/8525294-lorretta", "userReview": "I received this through the GoodReads Giveaway.This is the first book that I have read from this author. I found her writing style to be very smooth and easy to understand.The story is told from the viewpoints of Jackie and Annie. Jackie is a military nurse who has lost her firefighter husband; Annie is Jackie's mother. The two are supposed to be complete opposites, but as the story unfolds, we see how alike they are.Jackie's 10 year old son, Charlie, is having a very hard time coping with the loss of his father. In a last ditch effort to help him without bringing in professionals, Jackie decides to go home to Sullivan's Island for the summer. There they are greeted by Annie who whips up treats that make the heart sing and creates excursiions for Charlie. Annie regales Charlie with her beach knowledge, introduces him to Edgar Allen Poe, and brings the battles of \"the war\" to life with landmarks to punctuate the action.It is hard for Jackie to accept that Annie is not tryng to be bossy and often snaps at her for imagined slights. She has always blamed Annie for making Buster, her father, leave. They are not divorced, but have lived apart for 11 years. As Buster starts coming around, Jackie reluctantly sees that there ARE two sides to every story and sometimes everyone has an equal share of blame to shoulder.Things come to a head when Charlie, who is much too well-behaved, decides that he does not want to leave and return to New York. Add in a handsome doctor with two dogs, Annie's vibrant best friend and a cast of friendly beach dwellers and you have a nice summer read."}, {"userName": "Margaret", "userReviewDate": "Jul 25, 2012", "userURL": "http://www.goodreads.com/user/show/10549695-margaret", "userReview": "When I read Frank's Sullivans Island books, I feel as though I am on the island too, taking part in best friends' lives. I want to live in her books.Jackie is called home from active duty in Afghanistan to bury her firefighter husband and to figure out how she and her ten year old son will go on without the man they loved so deeply. Settling on the idea of going home to visit her family on Sullivans Island is the beginning of the healing that takes place for Jackie and her son as well as for her feisty parents who, still married, have been separated for 11 years and really can't stand to be around each other.I missed the more out-loud laugh humor that Frank usually weaves into her wonderful stories, but the interaction between Jackie's parents made me smile.I look forward to Frank's next book full of southern style and island life."}, {"userName": "Lesley", "userReviewDate": "Aug 14, 2014", "userURL": "http://www.goodreads.com/user/show/3430178-lesley", "userReview": "Well its way better than the hurricane sisters. This is satisfactory read. I started it as an audiobook and 3 chapters in I had to order the book from library book. That voice was horrible reading a southern story. The book got better when I read it."}, {"userName": "Diane Perry", "userReviewDate": "Sep 19, 2017", "userURL": "http://www.goodreads.com/user/show/11185453-diane-perry", "userReview": "I love DBF. She can write a good southern novel, and transform you in the moment. The story is told by Jackie and Annie. A mother and daughter that are complete opposites of each other. Jackie has recently became a widow and trying to raise her son Charlie. Charlie is not dealing with his Dad's death well at all. Jackie decides to go to Sullivan's Island to stay with her Mom, and try to pick up the pieces. I saw the mix reviews on this book, and I really wander if some that reviewed didn't get Frank's writing style. For me, this was a loving story filled with relatable emotions and very humorous moments. Very enjoyable."}, {"userName": "Patricia", "userReviewDate": "Jun 17, 2017", "userURL": "http://www.goodreads.com/user/show/22844720-patricia", "userReview": "I have fallen in love with Sullivan's Island which is located in South Carolina. I hope to visit there for real someday!"}, {"userName": "JudiAnne", "userReviewDate": "May 28, 2012", "userURL": "http://www.goodreads.com/user/show/1266107-judianne", "userReview": "Porch lights is a fun, heartwarming story of family and friends, their conflicts and never ending love. There is a smorgasbord of luscious, fresh low country food that will set your saliva glands in motion and descriptions of various assorted cocktails, exotic cheeses and pates eaten on the porch every night. The porch lights on the island are to welcome anyone who wants to join. In NYC Jackie is a prim and proper army nurse recently home from Afghanistan to attend the funeral of her fireman husband. Devastated, she and her 10 year old son decide to spend the rest of the summer with her mother, Annie on Sullivan's Island, SC. Annie, or Glam-ma (short for glamorous grandma) as Charlie knows her, is ecstatic they are coming to visit. She begins to work her magic on Charlie with her tales of Edgar Allen Poe, who lived on the island as a soldier. Jackie is not happy about the stories because she thinks they will frighten him. Quite the contrary, she turns Charlie from a depressed little boy to a rambunctious, happy kid who makes new friends and he starts skateboarding again. Charlie falls in love with the excitement of Sullivan's Island and decides he wants to stay but his mother is insisting that they return to the house in NYC where he was born and where they lived with his father. This is quite a dilemma for Jackie who desperately wants to do the right thing by Charlie. There is an array of other colorful characters also. There is Steve, the doctor who lives next door to Annie. He provides Charlie with a job of keeping his lovable dogs company while he works. Annie's best friend Deb, who spends a lot of time with the family. Buster is the almost ex-husband who lives near by and there are many more. We visit friends on Isle of Palms, SC in the winter, which is a sister island to Sullivan's Island and it is every bit as gorgeous as the author describes. It's a nice place to visit but I wouldn't want to live there for two reasons. The summers choke the sweat out of you with the heat and humidity and the fresh food is as delicious as Frank describes so I'm afraid I would eventually become roly-poly instead of pleasingly plump."}, {"userName": "Erin", "userReviewDate": "Jul 28, 2012", "userURL": "http://www.goodreads.com/user/show/1975653-erin", "userReview": "One of the oldest traditions of finding your way home involves leaving a light in the window - a candle, a hurricane lamp, an electric lamp, and porch lights. In Frank's novel, Porch Lights, she uses this tradition to symbolize Jackie's return from the darkness, to her home. Jackie and her son Charlie have suffered the devastating loss of Jimmy, Jackie's husband and Charlie's father. They are living in the home they made as a family in New York, trying to put their lives back together. Jackie and Charlie are understandably having a rough time, and Jackie realizes they need to get away from it all for a bit, to return to her family home of Sullivan's Island, to help her child heal.She doesn't have the best relationship with her mother, thinking her too flighty and dramatic, but has a pretty solid relationship with her father. At least at first. Jackie begins to appreciate her mother and see her in a new light, during their weeks together. And she also starts to heal herself. Her son is flourishing on the island, and does not want to return home. And I don't blame him, it sounded like paradise on the island. Sitting on the porch, drinking coffee in the morning, cocktails at night, with an ocean breeze blowing over you, all relaxed and lazy. Morning walks on the beach, all the Poe trivia - I wanted to move in with Annie too!! I had no idea that Edgar Allen Poe ever lived on Sullivan's Island. I found the bits of information about Poe and his life on the island very interesting, and definitely inspired me to read The Gold-Bug. I haven't started it yet, but I will soon. I have always been a fan of Poe's poetry, and some of his stories, like the Tell-Tale Heart. I have always wanted to go to the Outer Banks, but now I really want to go, now that I know of Poe's Tavern. (yes, I am a nerd)Is this book one of the most well written I have ever read? No, and sometimes the dialogue drives me nuts. But the characters are fun, the setting amazing, and it is entertaining and beachy and perfect for a light read."}, {"userName": "Sharon Redfern", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/3653142-sharon-redfern", "userReview": "Every time I read one of DBF's books I want to move down south and get adopted by a big 'ole family and live like the characters in her book do. This book tells the story of a much fractured family. Annie and Buster is a married couple, both retired, that have been living apart for 11 years since he got fed up with her controlling ways. From Annie's point of view, it was the day after their daughter’s wedding, he had his junk all over the porch, and they had a bunch of relatives coming over so of course she was concerned. Jackie, the aforementioned daughter, is coming back to the low country with her son Charlie, aged 10. Jackie's husband Jimmie, an NYFD member had died on duty several months before and Jackie needs a break from life in Brooklyn. She is also grappling with decisions after being an active duty nurse in Afghanistan and now figuring out where her life will go.The visit is fraught with tension between Jackie and Annie and Annie and Buster. Throw in good looking Dr. Steve from next door who Annie has been lusting after in her heart and it just keeps getting deeper. Annie is the true southern woman who just keeps on living life every day no matter how hard it has become and who believes that good food is a cure for a lot of problems. She is a font of information for Charlie, telling him all about the low country ways, the battles in the area during the Revolution, and about local celebrity Edgar Allen Poe.One of things I love about DBF's books is that there is such a sense of normalcy in the lives of the characters, even when they are doing the craziest things- like scoping out Dr. Steve's unmentionables. The continuity of years of tradition becomes a balm that soothes the troubled soul whether you believe in the traditions or not. While this story does have a few incidents of emotional lows and one scary moment, generally it is a tale of a family finding its way back to each other by living day after day and opening their hearts to the healing they can give each other."}, {"userName": "Marleen", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/1616365-marleen", "userReview": "There should be more writers like Dorothea Benton Frank, who have the knack to pen down stories that part with wisdom about family dynamics all the while keeping the narration so genuine and witty. You will say there are many out there who write just like her, but not to me. I think Dorothea Benton Frank is unique. Extremely unique. Her books enchant me every time. I immensely liked Porch Lights. This story was perfect. I wish it had gone on forever. I wished I lived there with the Britt family and their neighbors, on that island, on that beach. It delivered everything I love in a good read!I particularly enjoyed the two alternating voices of Annie, the Mom, and Jackie, the daughter, who tell the story of a family that is bit disjointed at the beginning of the book. Jackie’s an army nurse who returns from Afghanistan after her fire-fighter husband dies in a fire. She and her ten year old son, Charlie (oh what a sweet boy!) are inconsolable and need a change of scenery, so Jackie decides to stay for duration of a summer vacation with her mother, who lives on the beach of Sullivan’s Island, near Charleston, SC.Jackie’s Mom, Annie, is an angel is disguise. A principled, generous woman, who often made me laugh. I adored all the other characters; Buster, Jackie’s Dad and Annie’s husband, the neighbors, Dr. Steve, and Deb, Annie’s best friend and confident. All little gems.This whole story lifted my spirits and I will certainly read it again."}, {"userName": "Anita Johnson", "userReviewDate": "Jun 16, 2012", "userURL": "http://www.goodreads.com/user/show/2143488-anita-johnson", "userReview": "Dorothea Benton Frank is the perfect Southern hostess. She invites the reader onto her front porch on beautiful Sullivans Island, SC, pours the sweet tea and tells a funny and heartwrenching story of family. Jackie McMullan has just flown back from her third tour of duty in Afghanistan on bereavement leave because her husband, Jimmy, a New York City fireman, was killed while saving people in a burning building in Brooklyn. She and her 10-year-old son Charlie escape to her parents' home on Sullivans Island to let her family, the ocean and the natural beauty of the Low Country help them to heal their grief. Her mom, Annie, is the perfect Southern lady who adores her family to the point of suffocation, and her dad is a crusty fisherman who has a heart of gold but doesn't have the least bit of tact where his wife is concerned. Dorthea's humor and compassion make this story of family relationships so real, you may feel as if she is describing your own clan, no matter where you live."}, {"userName": "Joanne", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/3324743-joanne", "userReview": "This is a beach read. I really enjoyed it and I know I'll read more of Frank's work. Like most of the genre, it was fairly predictable. However, it was well done, I found the characters interesting, and there were few (if any) typos and spell/grammar checker errors--you know, those things that get corrected by a computer and no one actually takes the time to realize they're now incorrect. (For example--and I know I've read this in more than one recent book--\"she (he/they) poured over the map...\" Really? Was it easier to read when wet? Sorry, it's a pet peeve and I know I've digressed. But there are times when I can't help thinking the author probably had it right to begin with and then someone ran a checker over it without taking the time to check the checker. LOL. Okay, I'll try to get back on track now.) Back to the book. As I said, it was somewhat predictable. But enjoyably so. I'd definitely recommend it to those who enjoy \"women's\" novels."}, {"userName": "Ruth", "userReviewDate": "Nov 08, 2012", "userURL": "http://www.goodreads.com/user/show/922881-ruth", "userReview": "Jackie is a grieving widow. She returned home from her third tour of duty as a nurse in Afghanistan because her husband, Jimmy a firefighter in NYC had died while fighting a fire. She was the only parent left for her ten year old son, Charlie and both of them were depressed. Although she was often at odds with her mother, Jackie decides to return \"home\" to stay with her mom on Sullivan's Island for the summer. Her parents are estranged but she is hoping that having his grandparents in his life will help Charlie heal. Dorothea Benton Frank, has written a warm, realistic story of the love of family, showing even the thorns in those relationships. They seem so real that you just know that you could show up on Annie's porch and be invited to stay for dinner. Hope I show up on one of those \"special occasion days\" which always call for red meat, according to Annie, rather than their fresh fish on the grill days!"}, {"userName": "Helen Hammond", "userReviewDate": "Apr 05, 2013", "userURL": "http://www.goodreads.com/user/show/16394511-helen-hammond", "userReview": "I absolutely loved this book! I had the wonderful opportunity to interview Dottie Benton Frank in her Sullivan's Island home a few weeks ago. (This was for a freelance project and is about her newest book, The Last Original Wife, which I cannot wait to read.) DBF, a true SI native, wrote yet another heart-warming tale of coming home in Porch Lights.She clearly did a ton of research on her native island- mostly to satisfy her 10-year-old character, Charlie's inquisitive mind.Young Charlie and his mother come to SI after their father/husband dies in a tragic accident in Brooklyn, NY.Charlie becomes obsessed with the island and its history- especially Edgar Allan Poe.I loved the local references DBF uses in her tale- definitely loved the fascination with the lighthouse too!This was an easy read- very enjoyable!"}, {"userName": "Julia", "userReviewDate": "Sep 20, 2012", "userURL": "http://www.goodreads.com/user/show/1908883-julia", "userReview": "I really enjoyed this book. The descriptions of Sullivan's Island and the surrounding areas had me feeling like I right there at the house on the beach. I came out of the gym (with no windows) after finishing the book and almost expected it to be raining. I thought the author did a nice job combining elements of history, geography, literature, and a great story all in one book. The information about Edgar Allan Poe, about the Civil War, and about the Lowcountry all flowed with the story really well in my opinion and even taught me a new thing or two.I thought the eventual romance between Jackie and Steve was done really tastefully as well as the romance between Jackie's parents. I'll definitely be picking up another one of Frank's books in the future."}, {"userName": "Melissa", "userReviewDate": "Mar 24, 2013", "userURL": "http://www.goodreads.com/user/show/850665-melissa", "userReview": "I love Dorothea Benton Frank's books though, from reading the descriptions, I can never tell which ones I've read because they all follow a similar theme: someone finds themselves either unexpectedly drawn or returning to the South Carolina low country following some significant life event. The story wasn't the most original but the vivid characters and amazing Sullivan's Island backdrop made this a book worth reading. If you're a Southern or lover of Southern food, don't be surprised if find yourself craving hush puppies, fried flounder and other coastal Carolina cuisine. I also have a desire to set a bar and a beautifully decorate table nightly."}, {"userName": "Kelly Bragg", "userReviewDate": "Jul 28, 2013", "userURL": "http://www.goodreads.com/user/show/5553784-kelly-bragg", "userReview": "I LOVED this book! Y'all know I am a fan of Dorothea Benton Frank, but even so, I admit the past couple of books have been good, but not great. NOT THIS ONE! Once again the Lowcountry & Sullivan's Island work their magic on wounded souls. Dorothea does SUCH an incredible job describing things about the Lowcountry that some people never see or truly appreciate: the amazing food, incredible sunsets, ocean breezes, salty marshes, and yes, PLUFF MUD! Every time I read one of her books I awaken anew to the beauty that surrounds me each & every day.READ THIS! You won't be sorry!"}, {"userName": "Laurie Buchanan", "userReviewDate": "Nov 22, 2013", "userURL": "http://www.goodreads.com/user/show/2082469-laurie-buchanan", "userReview": "The passion of two high-risk jobs in a loving marriage sets the backdrop for loss, devastation, and the ensuing grief of a mother and her ten-year-old son who is spiraling into depression. Hoping to find temporary reprieve, they travel to Sullivan’s Island where salted breezes and the loving arms of family and friends offers instead a deeply healing balm and the courage to move forward. Sprinkled with a healthy dose of wit and wisdom, Dorothea Benton Frank does not disappoint."}, {"userName": "Stefanie", "userReviewDate": "May 27, 2015", "userURL": "http://www.goodreads.com/user/show/1890572-stefanie", "userReview": "I quite enjoyed this book, and will check out some of her other titles as well. The only thing that bugged me was the voice of the boy. Kids just don't talk like that. It didn't ruin the book of course, but it bugged me."}, {"userName": "Debbie", "userReviewDate": "Mar 14, 2015", "userURL": "http://www.goodreads.com/user/show/4191554-debbie", "userReview": "Another winner from DBF. I haven't met one of her books that I didn't like. They are not world changing or anything that will stop you in your tracks, but they are just great story telling. I can feel the ocean breeze on my face and the sand between my toes, no matter the time of year."}, {"userName": "Sandi", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/11516882-sandi", "userReview": "Although predictable, i enjoyed being immersed in the Carolina low country setting. Light and enjoyable."}, {"userName": "Ansley Gowan", "userReviewDate": "May 04, 2015", "userURL": "http://www.goodreads.com/user/show/42640800-ansley-gowan", "userReview": "Such an amazing book! Got hooked so quickly and couldn't put it down! It's definitely a must-read!"}, {"userName": "Becky", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/273083-becky", "userReview": "This was another fantastic book by Dorothea Benton Frank. It makes me want to get a beach house on Sullivan's Isand."}], "description": "When Jimmy McMullen, a fireman with the NYFD, is killed in the line of duty, his wife, Jackie, and ten-year-old son, Charlie, are devastated. Charlie idolized his dad, and now the outgoing, curious boy has become quiet and reserved. Trusting in the healing power of family, Jackie decides to return to her childhood home on Sullivans Island.Crossing the bridge from the mainland, Jackie and Charlie enter a world full of wonder and magic — lush green and chocolate grasslands and dazzling red, orange, and magenta evening skies; the heady pungency of Lowcountry Pluff mud and fresh seafood on the grill; bare toes snuggled in warm sand and palmetto fronds swaying in gentle ocean winds.Awaiting them is Annie Britt, the family matriarch who has kept the porch lights on to welcome them home. Thrilled to have her family back again, Annie promises to make their visit perfect — even though relations between mother and daughter have never been what you'd call smooth. Over the years, Jackie and Annie, like all mothers and daughters, have been known to have frequent and notorious differences of opinion. But her estranged and wise husband, Buster, and her flamboyant and funny best friend Deb are sure to keep Annie in line. She's also got Steven Plofker, the flirtatious and devilishly tasty widowed physician next door, to keep her distracted as well.", "title": "Porch Lights", "url": "http://www.goodreads.com/book/show/13338545-porch-lights", "average": 3.84, "cover": "https://images.gr-assets.com/books/1337210210l/13338545.jpg", "reviews": 1122, "authors": [{"url": "https://www.goodreads.com/author/show/36935.Dorothea_Benton_Frank", "name": "Dorothea Benton Frank"}], "type": ["Fiction", "Womens Fiction", "Romance", "American"], "outlinks": ["http://www.goodreads.com/book/show/13338545-porch-lights", "http://www.goodreads.com/book/show/13426331-porch-lights", "http://www.goodreads.com/book/show/15725591-porch-lights", "http://www.goodreads.com/book/show/15738359-porch-lights", "http://www.goodreads.com/book/show/13622168-porch-lights", "http://www.goodreads.com/book/show/65399.Sullivan_s_Island", "http://www.goodreads.com/book/show/16248139-the-last-original-wife", "http://www.goodreads.com/book/show/18635039-the-hurricane-sisters", "http://www.goodreads.com/book/show/65397.Plantation", "http://www.goodreads.com/book/show/417176.Isle_of_Palms", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}