{"ratings": 2595, "userreviews": [{"userName": "Nickolas", "userReviewDate": "Feb 25, 2015", "userURL": "http://www.goodreads.com/user/show/6459136-nickolas", "userReview": "REVIEW SUMMARY: Seven books in and Maberry's Joe Ledger series is still going strong.MY RATING: 4.5 starsMY REVIEW PROS: The most realistic and terrifying threat the Department of Military Sciences has faced; none of the characters feel safe; fast paced and gripping.CONS: The protagonists are inactive for much of the novel; not enough Ledger time; if the villain reveal at the end is supposed to be a surprise it isn't.BOTTOM LINE: Maberry continues to raise the stakes, pushing Ledger and the DMS to the breaking point.Nothing in life is certain except death, taxes, and the next Joe Ledger Novel. Maberry's series of techno thrillers has remained a constant comfort in my life since Patient Zero released way back in 2009. Through dedication Maberry has produced a new Joe Ledger Novel annually and despite this intense schedule the series has only continued to grow stronger. Over the years Ledger and the Department of Military Sciences have battled zombies, super soldiers, chimeras, biblical plagues, vampires, zombies again, and now Skynet! Predator One sees the team facing off against drone terrorism.Drone warfare has made plenty of headlines over the past couple of years. The commercialization of drones seemed to be one of the bigger stories of 2014. Maberry takes all of this and creates a frighteningly plausible terror scenario. The Seven Kings are back -- or at least one of them is anyway. The Gentleman, lone survivor of the secret group, is on his death bed but before he passes from this world he wishes to exact revenge on the agency that has continually foiled his plans. Now I'm not 100% positive whether or not the Gentleman's identity is supposed to be a secret. His real name isn't revealed until the end but there are enough blatant \"clues\" that I started to suspect it all might be a red herring (it's not). I'll admit that I was happy to see the character reappear.The Seven Kings felt a little cartoony to me when they first entered the picture way back in book three, The King of Plagues, but that is no longer the case with Predator One. There may only be one \"King\" left but the threat he poses to the world is far greater than anything we've yet experienced in a Maberry novel. As Alfred says in The Dark Knight, \"Some men just want to watch the world burn\" and the Gentleman certainly falls under this category. Predator One is, without exaggeration, the most brutal Joe Ledger Novel to date. Readers of this series have likely grown comfortable. Not since book two, The Dragon Factory, has one of the primary good guys died. There's been a high degree of civilian casualties (especially in the last book, Code Zero) and the DMS redshirts that get stuck on Ledger's team have a high mortality rate but no matter how dastardly the villains, no matter how terrible the evil scheme, Joe Ledger always saves the day. Predator One goes a long way toward rebuilding the diminished horror aspect of the series. I felt as though the characters were in actual danger. The terror attack at the baseball game is harrowing and heart wrenching -- it's the sort of iconic attack that would leave America reeling for years to come. Every component of the the Gentleman's plan raises the stakes and the death toll. Predator One does for commercial drones what Jaws did for sharks. Terrorism is all about fear and Maberry does not hesitate to embrace that in his writing. I hope that Maberry shows the fallout of Predator One in the next book because after all that transpired America should never be the same. Likewise I don't suspect the characters will ever be the same after the events of Predator One. Except for Ledger. Joe Ledger never really changes, and honestly who would want him to? The Gentleman goes for the DMS's throat, targeting not just the agents but their families as well. Somehow Maberry even manages to accomplish the impossible -- he made me care about Rudy Sanchez. That's the nature of Predator One, it cuts so deep that I was able to set aside my loathing of Ledger's best friend. I've even come around to liking former baddie Alexander \"Toys\" Chismer, despite myself. All the other favorites are present and accounted for from Top and Bunny to Bug and Church (seriously, when the hell is he going to get his own damn spinoff/prequel novel) and Junie Flynn, who I have come to adore. Even Violin (I'd also settle for a Violin spinoff novel) makes an all too brief appearance.My biggest complaint about Predator One is that the good guys seem to remain static for the majority of the novel, acted upon by the Gentleman rather than acting of their own volition. Ledger spends a lot of time at a hospital recovering from the baseball game attack. Junie, Toys, and Rudy spend a good deal of time at another hospital with the comatose Circe O'Tree. And then Ledger and Rudy head to a third hospital to investigate a peculiar drone attack. A lot is happening but our protagonists feel slightly impotent in the midst of it all. And perhaps, to give Maberry credit, that's where the heavier degree of tension and horror comes from. The book moves at a blistering pace and Maberry's short chapters will keep you turning the pages well after you resolved to put the book down. The perspective jumps around from Ledger's first person narrative to the third person perspective of his allies, the villains, and some of the victims of the attacks. This gives readers both a personal and a broader view of events as they happen. Because of the scale of the Gentleman's plan I was expecting/hoping that the plot of Predator One might carry into the next book, Kill Switch. Relatively late into the book the Department of Military Sciences is still in the dark as to the nature of the threat and I was unsure Maberry could wrap it up in a hundred pages or so . Thus far each book has been \"standalone\" to a degree but I was salivating at the idea of a larger arc. Unfortunately that turned out not to be the case but the finale is still fulfilling and felt far from rushed. As far as I am aware all of the Joe Ledger Novels are upwards of 400 pages and yet I've still managed to breeze through each in a weekend or so. Assassin's Code remains my favorite of the series (it'll be difficult to top) but Predator One displays a continued improvement while providing fans with everything they love so much about Joe Ledger and the Department of Military Sciences. Nick Sharps SF Signal"}, {"userName": "Leah", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/15797955-leah", "userReview": "Holy freaking hell.Jonathan Maberry has done it again.He's once again kept me at the edge of my seat, while reading a frightening realistic scenario that will forever change my views on certain up-and-coming technology. I loved every second of this novel. It scared the hell out of me, but I still loved every second of this.Joe, the Echo Team, the DMS, and Mr. Church never seemed to catch a break this time around. The bad guys were too good, and they knew Mr. Church and the DMS too well. They knew what made them tick, and the bad guys knew exactly how to hurt them.This was easily my favorite book of the series so far. While I wish there was more Joe and the good guys, I love that I was able to see into the dark, disturbing minds of the big bad bastards for a lot of this. Some of the big bads were new to the game, but the biggest bad bastard was someone the readers have met before, and when I realized who it was (pretty earlier on, it's not like it was a secret), there was profanity. It was a major WTF moment for me.Every time I review these books, I feel like I have to end with recommending the series. It's an action-packed, techno-thriller series that I think a lot of people would love. Try it out, because the books just seem to be getting better and better!"}, {"userName": "Janie Johnson", "userReviewDate": "Jan 15, 2015", "userURL": "http://www.goodreads.com/user/show/5116650-janie-johnson", "userReview": "Predator one is book #7 in the Joe Ledger series. Wow Maberry did it again! I have to say that I think these books have just gotten better and better as I read them. I am so glad that I was introduced to the fantastic writing of Jonathan Maberry.Now since these are different cases for the DMS to solve I decided to share the synopsis of this book.Synopsis--On opening day of the new baseball season a small model-kit airplane flies down from the stands and buzzes the mound, where a decorated veteran pilot is about to throw out the first ball. The toy plane is the exact replica of the one flown by the war hero. Everyone laughs, thinking it’s a prank or a publicity stunt. Until it explodes, killing dozens.Seconds later a swarm of killer drones descend upon the picnicked crowd, each one carrying a powerful bomb. All across the country artificial intelligence drive systems in cars, commuter trains and even fighter planes go out of control. The death toll soars as the machines we depend upon every day are turned into engines of destruction.Joe Ledger and the Department of Military Sciences go on the hunt for whoever is controlling these machines, but the every step of the way they are met with traps and shocks that strike to the very heart of the DMS. No one is safe. Nowhere is safe. Enemies old and new rise as America burns.Joe Ledger and his team begin a desperate search for the secret to this new technology and the madmen behind it. But before they can close in the enemy virus infects Air Force One. The president is trapped aboard as the jet heads toward the heart of New York City. It has become PREDATOR ONE.--I really loved the plotline to this book and the whole series, even though it is on terrorism. I never thought I would enjoy anything about this but there is always so much action and excitement it is sure to soothe anyone's need for some adrenalin rushing adventure, and this book was no different. The action and excitement never let up for a second. I was glued to the pages, and so very engaged I thoroughly enjoyed every minute of the story while sitting there on the edge of my seat, literally. The characters of course are always my favorite part of this series and really any of Maberry's writing in general. The characters just develop so well throughout the series that they are always a joy to read about. Readers get introduced to some pretty gritty, malevolent characters as well, the ones you love to hate the most. Of course Joe and the Echo team are among my favorites, and this does include Ghost, Joe's dog. They are all so realistic to me that I feel like I am apart of their family since starting this series back in 2014. It has been awesome knowing them all.I do find this series pretty equally plot and character driven. It is such an exciting adventure that I recommend it to just about anyone. It is truly a treat to read. I look forward to the final book in the series Kill Switch Scheduled to be released in April this year."}, {"userName": "Chris Berko", "userReviewDate": "Mar 15, 2017", "userURL": "http://www.goodreads.com/user/show/13125862-chris-berko", "userReview": "More awesomeness from Maberry. The last sixty pages is some of the best stuff he's written."}, {"userName": "Chris", "userReviewDate": "Mar 26, 2016", "userURL": "http://www.goodreads.com/user/show/1448151-chris", "userReview": "Once again, Joe Ledger and his DMS team are tasked with stopping a global threat that is bent on bringing the United States to its knees. Only this time, a deadly shadowy terrorist organization, once thought to be destroyed, has kidnapped a brilliant computer genius and coerced him into developing a program that takes control of our most advanced weapons systems...and turns them against us.If you haven't read this series, I'd recommend starting with first novel, PATIENT ZERO. But these white-knuckle thrillride novels are incredibly enjoyable...and damn highly recommended!"}, {"userName": "Darla Phillips", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/27105935-darla-phillips", "userReview": "Just keeps getting better!Every time a new Joe Ledger book comes out I think okay this one is my favorite.... Mr. Mayberry has done it again! Do yourself a favor and read this series from the beginning."}, {"userName": "Nathan Tullis", "userReviewDate": "Apr 08, 2015", "userURL": "http://www.goodreads.com/user/show/18356135-nathan-tullis", "userReview": "Predator OneWhat a book! I always wait with anticipation for the next Jonathan Maberry novel. Always. This time was no exception. I have re-listened to every Ledger book over the last few months in preparation. Timing it just right, I finished Code Zero Monday on my way home from work. Tuesday morning I set in for an adventure. I was not disappointed. It was going to be a good day. Joe and Rudy were at opening day in Baltimore. They were going to watch a true American Hero throw out the first pitch and shake hands with Joe's all time hero, his father. Junie, Circe, and Lydia were in San Francisco house hunting. Then, out of nowhere, Circe faints. Meanwhile in Baltimore, a small remote airplane flies over the field, doing tricks and dives. The crowd was loving it! In the blink of an eye. BOOM! A good day went very, very bad. A quick series of events involving timers, guns, and...pigeons? WTF?...sends Church and the entirety of the D.M.S. into a battle they are ill prepared for, and a name they thought they'd never hear again. This time though, it's all personal. A computer program developed by a man who puts even the D.M.S.'s top expert, Bug, to shame, can take control of virtually any military equipment with a CPU. It wreaks chaos, sending Captain Ledger and the rest of the Echo team on a mission they thought was completed years ago. While Echo team tries to find the bastard behind this, unknown to them as The Gentleman; Church is stranded on Air Force One, a plane no longer under their control, and Rudy Sanchez is battling his own demons. Oh yeah, and a nice little glimpse of where Joe Ledger gets his tenacity.I devoured this audiobook in 2 days. Ray Porter delivered an absolutely incredible performance. I've listened to a lot of audiobooks narrated by Mr. Porter and he is easily my favorite narrator, so I will obviously show no bias. He is Joe Ledger. I'm sure you've seen that before, so have I. It's just fact. The man adds so much to this story with his intensity. Every character has his or her own voice and they all get their own special touch of character from Ray Porter. You can hear the passion he has for these characters in every word.This is a must read and a must listen. It's one of the best Ledger books yet. It adds depth to a lot of characters and is packed with adrenaline."}, {"userName": "Eileen", "userReviewDate": "Dec 28, 2014", "userURL": "http://www.goodreads.com/user/show/1344889-eileen", "userReview": "Over 320 companies use, make or sell drones. More & more companies are creating autonomous vehicles. But what happens when these two technologies are used in terrorist attacks? Drones used as bombs in a public venue or used to deliver food that includes a highly toxic poison? You're using the self parking feature on your car when suddenly it puts the car into drive & floors the peddle into oncoming traffic.Nobody is safe from the Seven King's newest attacks. The DMS & their family members are being attacked and it's up to Joe & his crew to stop them. Definitely an all nighter!!"}, {"userName": "Neil", "userReviewDate": "Mar 19, 2014", "userURL": "http://www.goodreads.com/user/show/10449113-neil", "userReview": "All of the ledger books are outstanding and this one is no different. A fast paced edge of the seat ride with over the top characters and story. The only slight let down.......it was obvious who the \"burned man/gentleman\" was and maybe the \"boy\" character was underused. But awesome and can't wait for the next one."}, {"userName": "Lilyn G. | Sci-Fi & Scary", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/33783014-lilyn-g-sci-fi-scary", "userReview": "Ray Porter's impeccable narration is the only reason this received 3 stars instead of 2."}, {"userName": "Robin Edman", "userReviewDate": "Apr 13, 2015", "userURL": "http://www.goodreads.com/user/show/2189025-robin-edman", "userReview": "Best Ledger yet! I just love the way this man writes action sequences which, along with love scenes, I usually skip. The big action scenes are in first person, which I generally dislike. Not here; Ledger's voice is perfect for telling what he is doing and what is being done to him. I get so nervous, though, when the dogs fight."}, {"userName": "Stacey Ronczy", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/36651656-stacey-ronczy", "userReview": "Just when you think it's safe to live your lifeThink again. Maberry gives us the long awaited next chapter in our Joe Ledger series. It was worth the wait. Grab a beer or three, settle in with Joe, Ghost, the Echo team and their extended family on the wildest ride yet."}, {"userName": "AudioBookReviewer", "userReviewDate": "May 28, 2015", "userURL": "http://www.goodreads.com/user/show/7365795-audiobookreviewer", "userReview": "ABR's full Predator One audiobook review and many others can be found at Audiobook Reviewer.Ok, I am a huge fan of Joe Ledger, everyone in his team at the DMS, Jonathan Maberry and Ray Porter. So I will let the gushing commence. If you have been following this blog from the beginning, not sure how many people were around back then. This is the series that jump started my obsession with audiobooks.If you are a fan of precise secret agent, hugely entertaining, highly technical and sophisticated military, fast paced action scenes, characters that seem shallow on the surface but are way deeper than you would ever imagine, constant plot twists, turns, dead ends and reboots, expertly crafted stories that are brought to life with a master of his craft narrator. Then Joe Ledger is for you.If you have yet to listen or read to any of the books in the series, your in luck, because any of them could be picked up and enjoyed in any order. Jonathan Maberry made this possible by briefly introducing most of the characters and a history of what the DMS team has been through.In my humble little fan-boy opinion, Predator One is hands down the best Joe Ledger novel yet. Why, you ask? Simply because Joe Ledger and his team are unleashed from their reins and allowed to do what they do best. Stop the bad guys. However, in Predator One, each one of them have a huge price to pay. I think everyone of the characters are forever damaged if not killed from, of all things, drones.Yes, drones. Remote controlled flying machines (there is so much more to this, but I will not spoil the fun) wreak havoc on the DMS, yes there is way more to it than this but trying to keep this simple. Told in a way that made me look around whenever I heard something strange outside or saw a strange shadow coming near me. Along with that Maberry was able to deepen each and every character contained to a level that has never been reached before.The more that I listen to Ray Porter, the more silky, subtle and commanding his voice becomes. I have not listened to him do much else other than be Joe Ledger so maybe I am biased. You want to hear a story telling technician at work, this is your chance.Audiobook purchased for review by ABR."}, {"userName": "Timothy", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/1526379-timothy", "userReview": "Okay. Listen up. Jonathon Maberry is one of our ten best thriller writers writing today period. He is also an awesome guy who deserves all the success that comes his way. Saying that. If you have not read a book in the Joe Ledger series, you are missing out on one of the great series out there. I already knew that Maberry was a master of horror with his Pine Deep trilogy, but then a friend introduced me to Joe Ledger #1 \"Patient Zero\" Which has one of the greatest openings I've read in the last 20 years. I was hooked. I try to get the new Ledger and save it for when I really need a good book, it never happens. It is always devoured quickly leaving me hungry for more. In this the 7th outing for Ledger, Echo Team, Ghost, Junie, Church and others, there are no holds barred and everyone is fair game including a wonderful fight scene with Aunt Sallie (I wish there was more detail, but my imagination is pretty good). Maberry has some of the evilest villians in the game and \"Predator One\" is no exception. One we have met before who is just bugnuts crazy. The only thing keeping you and me and my little dog safe is Joe Ledger. Just trust me. Pick up Patient Zero and start today. You will be glad that there are 6 more in the series to keep you going."}, {"userName": "Tobin Elliott", "userReviewDate": "May 16, 2015", "userURL": "http://www.goodreads.com/user/show/624440-tobin-elliott", "userReview": "There's very few authors I'll drop everything for to read their stuff. Stephen King is one. Clive Barker is another. I think I'm going to have to add Maberry (at least for his Joe Ledger series) to that list. Seven books into the series, I swear, these books are somewhat formulaic, and somewhat predictable, but holy shit, they simply kick serious ass. And by the way, before you think I'm in any way denigrating Maberry's writing for formula or predictability, I'm basically considering these novels like a favourite roller coaster. You know it's going to have a big drop, lots of twists and turns, serious speed and a hellraising finish. So do Maberry's books.In this particular one, it was actually interesting to see Maberry punish damn near every ongoing character in this series. I also love how, while each book works as a standalone, the author is careful to build a universe. He's also good at building future plots very much like soap operas do it: that is, he'll bring up something briefly in one book, mention it a bit more at length in another book, then eventually, this becomes the main thrust of the next book. And now I'm waiting for the book where Ledger takes on Nicodemus. Oh hell yeah. Hoo-ah!"}, {"userName": "Remittance Girl", "userReviewDate": "Apr 21, 2015", "userURL": "http://www.goodreads.com/user/show/3444627-remittance-girl", "userReview": "With each Joe Ledger novel, the stakes get higher, Joe gets wittier and Maberry's brand of grade 'A' action thriller becomes more and more a metaphor for some truly deep insights on present day social and political ambiguities.Predator One was so good I finished it and started to listen to it again a second time. But I admit to having listened multiple times to the earlier Ledger novels too. And I usually never do that. Once is usually enough and I'm onto the next book.Maberry's one of the very few writers in the genre equally skilled at characterization, action sequences and tasty, fresh dialogue. Even his prose and descriptive writing leaves others in the genre eating his dust.Meanwhile, if you're one of those readers who gets enjoys a good action yarn, but gets bored by the long battle sequences, give the Ledger series a go. They really aren't like anything else in the genre. It's meaty, exciting fiction, whether you're a fan of plot or character-driven novels.I had the audiobook version of this and Ray Porter's narration is flawless. He brings Joe to life like no one else could."}, {"userName": "Mike & Lindsey Willis", "userReviewDate": "Apr 16, 2015", "userURL": "http://www.goodreads.com/user/show/37067322-mike-lindsey-willis", "userReview": "Like riding a rocket!Mayberry does it again. Joe ledger goes toe to toe with an old adversary as the world burns. Starts like a wild car ride, ends like riding a nuke on the way down, yelling \"yippy kill yay\" and trying to defuse it. Definitely worth the read. Keep them coming, Mr. Mayberry!"}, {"userName": "J.F. Penn", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/1696949-j-f-penn", "userReview": "Fantastic. Another triumph. Couldn't stop reading it. The stakes are higher than they've ever been for Ledger and the world as the last remnant of the Seven Kings goes on a drone rampage. Massive body count. Hell of a ride."}, {"userName": "Giedre", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/5487874-giedre", "userReview": "Everyone gets maimed. A lot."}, {"userName": "Shanna", "userReviewDate": "Jan 22, 2018", "userURL": "http://www.goodreads.com/user/show/51072850-shanna", "userReview": "I actually started this book earlier than my start date. I had a lot of trouble getting into this book. The scenes at the beginning with Boy were disturbing. Disturbing enough that I want sure I could continue it. But I made through and onto the good parts. Poor Bug. I felt so bad for him. I was scared about Aunt Sally and Mr. Church. I'm very happy for Circe, Rudy and Albert. Joe and Juney awwww lol. I don't even want to to mention him but ugh Nicodemus. What was he? Is he gone forever? I sure hope so. Banshee and Ghost should have puppies. I love them both so much!"}, {"userName": "Kooloo", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/57987058-kooloo", "userReview": "I never wanted this book to end - BUT I needed to know how it would!"}, {"userName": "Gilbert", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/6242488-gilbert", "userReview": "Tense readAnother tense read from a great author and great story teller. Joe never fails to keep you on the edge of your seat ,"}, {"userName": "Carol", "userReviewDate": "Apr 20, 2015", "userURL": "http://www.goodreads.com/user/show/1481662-carol", "userReview": "[one seemingly indestructible terrorist character was a little too easily disposed of considering how evil he was. I was expecting more of a knock down drag out confrontation. But who knows, in this series he may come back, yet again. Maberry seem to keep doing that.  (hide spoiler)]"}, {"userName": "Dan", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/7325648-dan", "userReview": "Every Joe Ledger book is centred on a fairly basic idea. This is what if terrorists could hack into all the automated drones and vehicles. The answer: chaos. One of the Seven Kings is still alive, just. He plans his last act in this world to be the destruction of America. By kidnapping the Einstein of computing and forcing him to do the Seven Kings bidding, the Kings now have control of all the drones and military vehicles in the country. And boy are they going to use them. It feels like Maberry suddenly realised that is writing books rather than films and doesn't need to worry about budget. The scale of this book is bigger than anything that has come before it. From drones attacking on the opening day of the baseball season to Air Force One being controlled, this is the DMS' biggest challenge yet. What's worse is that all the main players in the DMS are targeted in one form or another. Mr. Church's phone just keeps ringing with more bad news. One of the most interesting ideas of the book was Toys getting more involved with the DMS. He has been a villain in the past, working with the Seven Kings, and is now an ally of the DMS. When it's the Seven Kings behind the atrocities it's Toys who has vital information. It's the notion that a person can change for the better, something these types of novels regularly ignore.It's a neat idea to bring many people's fears about automated technology come true in this novel. It brings a real fear and sense of danger because you don't know where the next attack will be nor where it will come from in most cases. Although it certainly ramps up the tension and danger, there are some problems with the basic plot. There's lots of speculation about futuristic computing which shows there was some proper technology research involved in this book. The trouble is it relies on the idea that all automated drones and vehicles use the same software. I'm sorry but I just don't buy that. Plus there's the fact the final solution to the whole book is mind-bogglingly simplistic. The other problem is that this is a technology-based fight, not a soldier-based fight. Therefore Joe Ledger himself doesn't actually do much in the book- a soldier can't find a plane after all. There's one of Ledger's best ever moments right at the end of the book but the rest of the book is far from the best of the character- he's either in hospital or on a plane for most of it.I really enjoyed the book, mainly for the thrill of what could happen. This book is more about the Seven Kings attacks that it is about the DMS doing anything about it. It's good stuff but I want Ledger more involved in the next book."}, {"userName": "TheGeekyBlogger", "userReviewDate": "Apr 14, 2015", "userURL": "http://www.goodreads.com/user/show/196094-thegeekyblogger", "userReview": "Listened for Fun (Audible)Overall Rating: 4.25 Story Rating: 4.50Character Rating: 4.00Audio Rating: 4.50 (not part of the overall rating)First Thought when Finished: Another one out of the park (couldn't resist), Predator One by Jonathan Maberry had me on the edge of my seat the whole time.Overall Thoughts: I feel like the Joe Ledger series would make the perfect Netflix series. It has action, thrills, fringe science, and great escapability. This one had drones (scared the ever-loving heck out of me), baseball, and brought us more evil than in previous books. It ratchets up each book bringing us closer to (read Benny Imura or Dead of Night if you want to know where we are going). Honestly, I am just now counting down to the next one. I want it NOW!Audio Thoughts: Narrated By Ray Porter / Length: 16 hrs and 56 mins Ray Porter is perfect for this series. I can't believe that book 1 I was like \"meh\" with his narration. Now I can't imagine anyone else as Joe Ledger!Part of my Read It, Rate It, File It, Done! Reviews"}, {"userName": "Michele", "userReviewDate": "Dec 02, 2015", "userURL": "http://www.goodreads.com/user/show/4169876-michele", "userReview": "After a bit of disappointment with the prior Joe Ledger book, I think Jonathan Maberry is back on his game with Predator One. Utilizing pathogen and technology threats that harkens to his earlier novels, Maberry built an excellent amount of tension through the events choreographed by the last of the Seven Kings against Joe, Mr. Church, Rudy, and the rest of the DMS family. The action was non-stop and the pacing kept me turning the pages to read the next scene. Most of the characters were back again - Violin, Toy, Bunny, Bug, Aunt Sallie - albeit in smaller roles. There were some interesting new characters such as Dr. Pharos and Banshee. However Maberry introduces many minor characters for one chapter events and skillfully develops and humanizes them prior to their demise. As an aside, one of the aspects of this novel that I personally enjoyed were the inclusion of the Pacific Northwest locations, since they were familiar to me from having lived in the Puget Sound area. Thanks to a strong comeback with this novel, I'm anxious to read the next installment of Joe Ledger."}, {"userName": "Jeff Miller", "userReviewDate": "Apr 09, 2015", "userURL": "http://www.goodreads.com/user/show/3947630-jeff-miller", "userReview": "When in each book you must once again save the world from destruction, it gets hard to keep upping the plot. One way to to this is to have an overarching story arc with major battles marking each book. Such a story arc has been kind of grafted on in these novels along the way.The majority of the Joe Ledger novels I have enjoyed immensely for what they are. Even the lesser stories were at least a worthwhile read even if the plot line was reaching even in a genre where you expect SF, military action, and forays into urban fantasy.This entry was an excellent Joe Ledger novel and had all that I expected and wanted. Maybe that is damning with faint praise, but I don't mean to imply that. I keep coming back because they are so much fun."}, {"userName": "Darcy", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/2225246-darcy", "userReview": "Once again Joe and the DMS are up against a lot. I think the opening big blast was all the more horrifying because the bad guys struck at such a blatantly American symbol. It seemed like that was the theme because every time there was another strike they were big American symbols.I hated all the hard hits that DMS took. It was sort of a genius plan, because if you want to cause big problems, going after the people that can stop you in unique ways will do it.I found myself deeply disturbed by how the bad guys bastardized \"normal\" things. What bothers me is it seems like these things could happen in our life now.As bad as things were in this one, the ending was perfect. All of them needed this \"normal\" to remember what they fight for."}, {"userName": "Jason Gonsalez", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/11250899-jason-gonsalez", "userReview": "I was going to wait to write a review for this series because I thought this was the final book. But apparently there is going to be another 1 next year. Joe Ledger is the shit. Plain and simple the man is a fucking rock star. he must be the greatest fighter and luckiest man alive when it comes to a zombie outbreak or the plague of the biblical times. the man never stops being a beast. he takes the situations to the next level and overcomes them all. and he is a bit of a hoe too. this girl dies let me take on another. this girl is the most beautiful woman but I want this one now. but that is my rant for now. I'll have more when the series ends. be well book worms."}, {"userName": "Steph", "userReviewDate": "Jul 20, 2015", "userURL": "http://www.goodreads.com/user/show/2142019-steph", "userReview": "[ Sam Imura, Tom & Benny's older brother, is a sniper with Joe's team. In this installment, Sam's younger brother infant/one-year-old (I can't remember exactly) Tommy is mentioned. So, that must mean that Benny's series takes place about 10-15 yrs after Joe's. I'm hoping Maberry will somehow bridge the two series before this one ends.  (hide spoiler)]"}], "description": "On opening day of the new baseball season a small model-kit airplane flies down from the stands and buzzes the mound, where a decorated veteran pilot is about to throw out the first ball. The toy plane is the exact replica of the one flown by the war hero. Everyone laughs, thinking it’s a prank or a publicity stunt. Until it explodes, killing dozens.Seconds later a swarm of killer drones descend upon the picnicked crowd, each one carrying a powerful bomb. All across the country artificial intelligence drive systems in cars, commuter trains and even fighter planes go out of control. The death toll soars as the machines we depend upon every day are turned into engines of destruction.Joe Ledger and the Department of Military Sciences go on the hunt for whoever is controlling these machines, but the every step of the way they are met with traps and shocks that strike to the very heart of the DMS. No one is safe. Nowhere is safe. Enemies old and new rise as America burns.Joe Ledger and his team begin a desperate search for the secret to this new technology and the madmen behind it. But before they can close in the enemy virus infects Air Force One. The president is trapped aboard as the jet heads toward the heart of New York City. It has become PREDATOR ONEp", "title": "Predator One\n      \n          (Joe Ledger #7)", "url": "https://www.goodreads.com/book/show/16111973-predator-one", "average": 4.36, "cover": "https://images.gr-assets.com/books/1403886148l/16111973.jpg", "reviews": 259, "authors": [{"url": "https://www.goodreads.com/author/show/72451.Jonathan_Maberry", "name": "Jonathan Maberry"}], "type": ["Thriller", "Horror", "Fiction", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/16111973-predator-one", "http://www.goodreads.com/book/show/24406733-predator-one", "http://www.goodreads.com/book/show/21851195-predator-one", "http://www.goodreads.com/book/show/25315714-predator-one", "http://www.goodreads.com/book/show/23209539-predator-one", "http://www.goodreads.com/book/show/22537664-predator-one", "http://www.goodreads.com/book/show/7157310-rot-ruin", "http://www.goodreads.com/book/show/3993839-patient-zero", "http://www.goodreads.com/book/show/9917998-dust-decay", "http://www.goodreads.com/book/show/13147460-flesh-bone", "http://www.goodreads.com/book/show/6962671-the-dragon-factory", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}