{"ratings": 539, "userreviews": [{"userName": "Lori", "userReviewDate": "Mar 23, 2012", "userURL": "http://www.goodreads.com/user/show/1460100-lori", "userReview": "Rhiannon Frater fans (like me) will not be dissapointed with this new book. Everything gets better. Amaliya is still that smart mouthed vamp that we love. Cian...oh man! Samantha--my new hero/fucking hilarious! Jeff is such a sweety. I'm not as attached to Jeff as I am to the other three but he is growing on me. I don't really want to talk about the plot. I will give too much away. This book is sexy, scary, and heart breaking. I was bawling at one point. Come on dudes. It's Rhiannon. She's ruthless...well her characters are. If you thought the Summoner was scary in the first book...well just wait. I was absolutely terrified of the newest villian in this book. Rhiannon has a knack for dark and twisted tales of horror. That is what this book is. It is a stellar additon to the PWSD's trilogy. I cannot wait to see what happens next!!!"}, {"userName": "Giselle", "userReviewDate": "May 10, 2012", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Dude! I didn't even have this on my GR shelves yet! *blasphemy**taps hand* Bad stalker!"}, {"userName": "Glass", "userReviewDate": "Apr 15, 2012", "userURL": "http://www.goodreads.com/user/show/4808910-glass", "userReview": "This was such a fun book to read! I enjoyed in it even more than with Pretty When She Dies. Rhiannon Frater continues to write story about Amaliya in the same doomed and gloomed mode. Right from the opening scene you will already be forced to cover your head and scream \"Bloody hell!!!\" Biggest difference compared to the first book is that Pretty When She Kills has this... how to put it? Romantic side? But let me assure you that romance in this book is more like something that you could find in True Blood than in Twilight. And when I say True Blood, I mean blood, lust and tearing clothes. Also, you will read stories about other characters, mainly Samantha and Jeff. Sam's POV was my favorite part of the whole book. I liked the way her relationship with Amaliya developed and her new ghost-whisperer abilities.Rhiannon introduces us with some new characteres - keep an eye on the new girl, Bianca. I had to pick up my jaw from the floor. I don't usualy imagine actors or musicians as characters from the latest book I've read, but this time I just couldn't help myself. For me Amaliya is Megan Fox - long back hair, tattooes, and blue eyes, whole good girl gone bad thing. I'm wondering if author used her as the inspiration."}, {"userName": "Shelley", "userReviewDate": "Mar 16, 2012", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "Genre: Urban FantasyRating: 3.5-4.0*First Thoughts*Amaliya Vezorak is back in the sequel to Pretty When She Dies. As a matter of opinion, this book was well worth the wait. Amaliya continues to be a badass vampire necromancer. She and Cian, the vampire master of Austin, are in a relationship that has become smoking hot. They are still under attack by outside forces who want to take over their territory and capture Amaliya. There are other dangers awaiting them as well, and it will be a miracle if they survive until the end of the story. Once again Frater takes no pity on her characters. Characters fall by the wayside like dominoes. Stephanie has come into some awesome new powers of her own and learns how to deal with Amaliya as a colleague and friend even though she is still mad about losing Cian. We shouldn't feel sorry for Stephanie since she and Vampire Hunter Jeff Summerfield are getting along swimmingly and now Stephanie's powers makes her a valuable tool against Cian's enemies.New characters are introduced and we even get flashbacks into how Amaliya was turned into a vampire by the Summoner. If you have read Pretty When She Dies, then you definitely don't want to skip this book."}, {"userName": "Jennifer (Bad Bird Reads)", "userReviewDate": "Sep 08, 2013", "userURL": "http://www.goodreads.com/user/show/6864850-jennifer-bad-bird-reads", "userReview": "http://readingandwritingurbanfantasy....At A GlanceI was disappointed with Pretty When She Kills but I have high hopes for the series. Too many character POVs and unnecessary deaths but there was some redeeming qualities. The GoodPretty When She Kills starts off with a bang! I was drawn in right away. Amaliya and Cain are in a tough spot. It seems like everyone is after them, but friends and family are always there to help. But even with the support, some enemies are just too hard to kill...and keep dead. One of the things I love about this series is the love and support Amaliya gets from her family and friends. They risk their lives for her and they wouldn't have it any other way. Even Samantha and Amaliya get closer this book. They really become good friends and confidants. But the reason behind their change of feelings is questionable...and excitingI was happy to see Amaliya really embrace her vampirism this time around. This is her new life and she loves it, even if there is death, blood, and zombies. She is happy with Cain and is excited for the future. They may have their problems, they argue and fight, but they are always there for each other.Pretty When She Kills is a lot darker than the first book. It still has a little of the humor we have come to love from Frater, but be ready for some sadder, more depressing moments. The ending was surprising. I wasn't expecting it at all. A lot was left unresolved so I can only imagine how exciting the third book will be. The BadI feel like I am in the minority in not liking this book as much as the first. Pretty When She Dies was exciting, dark, funny, and intense. But Pretty When She Kills had plot problems, the characterization was poor, and I was pretty bored for a good portion of it.The book starts out with one storyline, then that gets dumped, and we get a whole new storyline to focus on. I was so confused by that. And the plot was really lacking. The flow felt slow almost to the very end. I needed more action in the middle. I HATED the multiple POVs. We got into the heads of WAY too many characters. I missed hearing from Cian and Amaliya. They barely got 1/5 of book time. I don't care enough about the other characters to want to sit through their inner monologues so many times.And last, the deaths. Spoiler: people we care about, main characters, die. I don't mind when important characters die if it's for a good reason or it is essential to the series. But these deaths felt completely unnecessary. They got killed for killing sack. For the shock factor only. And the other characters' reactions to the deaths felt off, dispassionateI almost gave this book 2.5 stars, but I do still have hope for the series. The SnugglyWe barley get to hear from Amaliya and Cian so their relationship didn't change too much. They got into some fights, they made up, that's it. But I do like the direction of their relationship. Samantha and Jeff get a lot closer in this book but I just don't find them that interesting. This one is not as sexy as the first book, but we do get some hot moments. Some sex. Suitable for new adult and adult audiences. Final ThoughtsI really had a lot of problems with Pretty When She Kills, but I will for sure be continuing this series. I think this one suffered from Second Book Syndrome. But these characters are strong enough to make this series amazing. So don't let this book stop you from trying out Frater's work. Recommended. Quotes\"At times like these she was haunted by a life she would never have.\"\"There were no souls inside the bodies, but there were memories. She could feel the whispers of who the zombies once were. The lost hopes and dreams brought tears to her eyes.\"\"I'm so not going all Patricia Arquette. I refuse to! Because the next thing you know I'll be all John Edwards-y and people will be banging on my door wanting the deets of their granny's peach cobbler recipe.\"*Free book from author for honest review"}, {"userName": "☕ Kimberly ", "userReviewDate": "Oct 05, 2012", "userURL": "http://www.goodreads.com/user/show/5082615-kimberly", "userReview": "Pretty When She Kills is the second book in Rhiannon Frater’s dark, gritty vampire trilogy. I was delighted to step back into this dark world and it was quite the adventure. Vampires do not sparkle in Frater’s world and instead have uncanny abilities and territorial rivalries. I quickly became enthralled in this action packed tale and consumed this in a single afternoon.The tale picks up a few months after book one ended. Cian and Amaliya are wrapped up in their romance and she is dreaming of happily ever after. We soon learn those thoughts will have to be put on hold when multiple forces work to overthrow Cian to gain control of Austin, Texas and harness Amaliya and her power. With an attack eminent, Cian and Amaliya enlist the help of the Vampire Hunter and his motley crew. The tale that unfolds offered awesome battle scenes, humor, and danger. I found myself completely immersed and cannot wait for the final chapter of this beautifully written tale.I adore the characters Frater has created in this series. Even the villains have to be admired for their cunning and unique personalities. We see growth in Amaliya and new abilities emerge. She is still kick-ass and totally snarky. While she still likes to jump into the thick of things, she is trying to think things through. I loved that when she is mad she jams out on her drum set. Cian is beginning to realize he should have secured Austin better and worries about those he cares for. The romance while not quite as steamy as book one certainly made my heart race. While Amaliya still doubts Cian s unbridled feelings, he certainly convinced me. It amazes me how she can take on monsters but still has so much self-doubt. Amaliya’s grandmother, cousin and others are back and in jump in the mix. Jeff the vampire hunter and his crew help out. I adore Jeff and totally dig his life. Samantha Cian's ex is back and if you remember I hated this little minx. Well guess what, she totally rocked this book and was even kick-ass. Yep, miss preppy and annoying was cool. New characters added to the tales page-turner suspense. I loved and loathed the villains and wanted them shown no mercy.Frater took me on one heck of ride and had my emotions all over the place. I was angry, sad, fearful and cheering the next. Quite frankly I didn't want the journey to end. I am completely in love with this urban fantasy and the way the author portrays this world. Her unique twists to vampires, supernatural powers and epic battle scenes had me deliriously happy one minute and screaming at her the next. (yep, that's right I yelled aloud to Frater and the air turned blue) When an author gets me that wrapped up in the tale, that I shout publically while reading…you know it’s a winner. I cared, I wanted more and most of all I believed. The characters are so fleshed out that the lines of reality blurred. The transformation of Samantha’s character and the supernatural elements woven into this tale gave me goosebumps. From the creepy-tasitc prologue to the last sentence I was held captive. If you haven't entered Frater’s vampire world you are completely missing out on some stellar reading.Kimba the Caffeinated Book Reviewer"}, {"userName": "Smash", "userReviewDate": "Feb 29, 2012", "userURL": "http://www.goodreads.com/user/show/1271418-smash", "userReview": "Courtesy of Smash Attack ReadsInterest in Book: After the ending in Pretty When She Dies, I definitely needed to know where the story would take Amaliya and Cian. The book ended on a good note, but there was a lot left up in the air. And, in true Frater form, she doesn't make it easy on her characters or readers!World-Building: The world-building just gets me all giddy and excited in this series! I think Rhiannon is pretty masterful at this process, but I just love the little twist she throws into a seemingly normal, gritty vampire tale. Cian rehashes his vampiric history and I truly loved the lore expansion. We are introduced to a were coyote, a dhampir and a witch, and Samantha gets more than she bargained for when she decided to hang out on the wild side. The world expands nicely, but it doesn't make your head spin. And we get a taste of Amaliya's new life and powers right along with her. What an experience!Characters: Rhiannon introduced more POVs during this installment, with many interconnecting story lines. Some of the characters are very tricky and treacherous. The bad guys are seriously bad, yet some might surprise you. Some characters make you laugh out loud, some make you sob, and others make your heart soar with love. Rhiannon has incredible characterization skills. She can build relationships up, break them down, smack them around and reel them back in. There is a lot of grey area with her characters, which keeps both the characters and the readers on their toes.There was some growth with all of the main characters. Amaliya is learning more about what she is and controlling the power she possesses. Cian is opening up to the idea of expanding his family. Samantha's life becomes overwhelming and unbearable  but with the help of her friends, she's able to gain control. I think this leads to some soul-searching and compassion-feeling, and Samantha's characters becomes a little less annoying. She does, however, have quite the mouth on her and she made me laugh numerous times. As did Eduardo, a new addition to the story who has eyes all over Amaliya. Amaliya plays it up, which makes Cian squirm. Fun times.Lasting Impressions:The ending was an epic WTF and I just loved how it all played out. I truly love this series! It's gritty and entertaining. There is a lot of action, great lore and great smexy time! There is heart-break, revelations, soul-searching, romance and ass-kicking! It's got a little bit of everything that makes a book fun to read."}, {"userName": "jD", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/2415283-jd", "userReview": "This is the second book of the trilogy \"Pretty When She Dies\" and once again, I am blown away. I don't normally read unfinished duologies and trilogies because there is always a \"Game of Thrones\" out there that can take 20 years to wrap. It's never worth being left hanging. So when I initially picked up Pretty When She Dies, I didn't know it was a trilogy. I didn't learn it until I read Ms Frater's remarks at the end of this one. I don't normally read these notes but I wanted to know when the next book was coming out. This one does not have a 'hard' cliffhanger but there is the edge of a knife kind of feel. As it turns out, Ms. Frater expects to finish this trilogy in 2013. Not so bad. I can work with that.As for this book, Amelia is back with her rag-tag group of heroes. Amelia and Cian are still together and making their undead relationship work. I like them together. Their banter is never boring or without revelations. Samantha, Jeff, and the Grandma are back. A few new heroes and bad guys are introduced into the mix which expanded my enjoyment considerably. As before, the price of getting to the truth of it all is bloody with a high price. Amelia learns more about her necromancy while Samantha discovers an unexpected side-effect of drinking Amelia's blood when she was dying in the previous book. I didn't see that twist coming but it was an entertaining development. Once again, I could not forsee most of what Ms. Frater had planned for these characters. The story felt more Urban Fantasy this time because Amelia was so much stronger. She rolled with the punches like she had been a badass her whole life. I feel like I got to know Cian better in this one. I am hesitant to fall in love with him because Ms. Frater doesn't seem especially sentimental. I would not put it past her to do him in or turn him into a secret bad guy. I would not put money on it either way. Ms. Frater is very good at making knots so complex you can't see what's tied up. This is really good stuff. All of it. There is nothing I would take away or add. I highly recommend this one to UF fans especially if you like smart bad guys, loads of fighting, and fresh humor thrown in to add a little light to the darkness. There is sex but I would still consider this YA on the PG-13 side. Perfect overall."}, {"userName": "Hannah", "userReviewDate": "Sep 06, 2012", "userURL": "http://www.goodreads.com/user/show/3899614-hannah", "userReview": "This series is a fantastic example of indie authors who do it right. It feels as polished as any traditionally published novel. Oh and if you've been wondering what happened to all the dirk and dirty vampiric urban fantasy after the Twilight implosion - here you go.Pretty When She Kills begins with the resurrection of Bianca, another of the Summoner's progeny, and Rachon's (the Summoner's most loyal offspring) need to kill her before she wreaks too much havoc as a newborn vampire. Except when she finds the ghostlike girl has Necromantic powers she can't bring herself to do it and so decides to bind her to her. Already we find ourselves glued to the pages as it starts with as much of a bang as Pretty When She Dies.There is a lot of character growth in Pretty When She Kills, which might well be why I much preferred it a little to Pretty When She Dies. The major player in my opinion being Samantha who I found incredibly annoying before. She's just a little lost and afraid and I just want to hug her! She has her own stuff to deal with now and relationships of varying types to entangle, romantic and non, and I really respected her and the way she embraced how crappy life can be and decided to kick it's arse. After despising her so much before, she has definitely become my favourite character. How's that for character growth? Amaliya, as well, had some growing to do. As we already know she has a tendency to want to run when things get hard and she hasn't changed, but she also embraces a few things and I felt even more sympathy for her than before. She's still very human at her core.\"It really is different for you, isn't it? Being what you are?\"Amaliya gave her a brief nod.We also meet a few new characters in Pretty When She Kills who provide even more interesting side stories and funny quips but I shan't spoil these for you because they're fun to meet on your own.Even the bad guys are intriguing. Some are just straight-forward nasty, like the Summoner in Pretty When She Dies, but some have another side to them which really leaves us questioning: how bad are they? This is an aspect of Rhiannon's writing that I adore. The fact that nothing is simply black and white. This along with her fab way of setting up an atmosphere that really puts you in the moment. And there are a few twists in the story. You know, just to keep it interesting. Not once did I find the novel getting 'samey', I pretty much loved it throughout. It's freaking epic and book three is only going to be better.Pretty When She Kills is a definite improvement on Pretty When She Dies which I thoroughly enjoyed, I just adored this one a little more. It felt more polished and was fast-paced throughout. If you're not sure whether or not to pick this one up - do. I promise it's worth it. Ooh, and we meet a few new supernaturals in this one.."}, {"userName": "Kassa", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/2095317-kassa", "userReview": "I may write a real review of this but I'm on the fence. I liked the first one but this second one annoyed me. The females are all idiots. \"Huh?\" is the response to almost anything. I could figure out what was going on well before Amelia or Samantha ever clued into the obvious. I'm not sure why the females never act with much intelligence and they react first before rational thought seems to kick in. Furthermore the author says over and over that Cian and Rachon are siblings but that would mean that Amelia is Cian's sister too. Funny how -that- isn't mentioned. If it's too weird to have Cian and Amelia as siblings and lovers then the author shouldn't make the repeated references to Cian and Rachon that way. I like the story in that it's easy to listen to and I can zone out and ignore when the females are doing something stupid (though that's often). I did get more and more annoyed with it as it went on. The characters should be smarter than they acted. They often WERE smarter in the previous book but to get the action and plot moving, the book took away some intelligence. Here's hoping the next one is better."}, {"userName": "Mary", "userReviewDate": "Aug 01, 2012", "userURL": "http://www.goodreads.com/user/show/8243269-mary", "userReview": "\"The girl stood drenched in blood in the center of the graveyard.\" That, my friends, is how you begin a book about vampires.All of the major players from PWSD are back - Amaliya, Cian, Innocente, Sam, Jeff, Sergio. Even some of the secondary characters play a more major role - Pete, Rachon. And, we meet Bianca, Eduardo, Cassandra, Aimee and more.Others are after Amaliya for her powers. She and her own Scooby Gang have to fight the big bads to not only save her but also....well, I don't want to give anything away. Let's just say that there is some major butt-kicking and heartache in PWSK.Things I loved most:- Sam learning to use her new power.- Adding Cassandra and Aimee to the mix (along with Cassandra's unexpected connection to Cian.)- Jeff and Sam advancing their relationship.- Learning more about Rachon.If you love vampire novels, you need to read this series. Go ahead, you know you want to. 5/5 stars.Thank you to the author for providing an E-copy in exchange for an honest review."}, {"userName": "Lorre", "userReviewDate": "Oct 05, 2012", "userURL": "http://www.goodreads.com/user/show/6349980-lorre", "userReview": "This trilogy only gets better with each book! I loved the prequel and the first book but Pretty Whe She Kills was even better!It was nice to see Cass and Aimee from the prequel again, Cian sure got a surprise when he met them :)I knew from the start that Ethan guy was bad news and that he wasn't there to help at all but I never guessed what was really coming and how disasterious is would be for some of Amaliya's entourage.One of the charchters that suprised me in this book is Samantha. I didn't like het much in the previous book. She was just some airheaded, naieve bimbo, or so it seemed... in this book Samantha shows that she is not just some bimbo but has a lot of courage and is ready to help.Her charachter definitely grew on me.I can't wait to see how this trilogy concludes!"}, {"userName": "Fred", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/6150621-fred", "userReview": "Good vampire / zombie pulp. A solid sequel, but not sure it's as good as the first one."}, {"userName": "Sofia Galvez", "userReviewDate": "Jun 28, 2013", "userURL": "http://www.goodreads.com/user/show/5420503-sofia-galvez", "userReview": "The book was okay. Nowhere near as good as the 1st book."}, {"userName": "Sarah", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/5498027-sarah", "userReview": "This book was disappointing. Not as well written as the first one and NOWHERE near as good as her As the World Dies series. I know she can do much better and hope she delivers on the next book."}, {"userName": "Michelle", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/7957821-michelle", "userReview": "Review to come soon."}, {"userName": "Regina", "userReviewDate": "Dec 01, 2011", "userURL": "http://www.goodreads.com/user/show/3104032-regina", "userReview": "2012!!!!!!"}, {"userName": "Heidi", "userReviewDate": "Oct 10, 2012", "userURL": "http://www.goodreads.com/user/show/5463965-heidi", "userReview": "“Four Stars: A thrilling sequel with outstanding characters and a thick story line!Amaylia is learning to be happy as a vampire. After her thrilling defeat of The Summoner, she is settled in with Cian content for once in her life. Of course, danger is still looming on the horizon. The other vampires are plotting and looking for ways to oust Cian. Her grandmother and cousin Sergio are now adopted vampire hunters and Samantha and Jeff are an item. Danger sneaks toward the happy couple from all angles and it is just a matter of time before they find themselves in another deadly fight for their lives. Is the powerful one really dead and gone or will his vile fingers stretch forth from the grave and rein down more destruction?What I Liked:*This book is awesome! It blows the doors off its predecessor with its intricate plot, terrific characters and plenty of new paranormal introductions. Ms. Frater brings us a winner with this one. The story line has so many angles: Amaylia and Cian are trying to fend off the leaders of the other covens, a stranger named Ethan finds Amalyia's family and promises he can restore her to a human, Samantha is dealing with some new found abilities, the powerful vampire Rachon is plotting against the others.....there is so much going on in this book. I loved all the different plots and how everything brilliantly pieces together! *All the characters from the first book return along with some new introductions. I love how diversified the cast is. There are vampires, bounty hunters, vampire hunters, witches, a dhampir, a phantagasm, Necromancers and necromancer-vampires along with some ghosts oh and lots of zombies. If you enjoy books with a full cast of paranormal characters this will surely satisfy you. *I loved that this book is full of action, plotting and some big twists and turns. You are certainly on the edge of your seat the whole way, not knowing what everyone's true motives are until the final page. *I was pleased that this book did not have all the sex scenes like in book one. This book had only a couple of trysts which were nothing compared to all the sexy time in Pretty When She Dies. This book is much more focused on plot and characters and it was a much better read!And The Not So Much:*This book doesn't exactly end on a cliffhanger, but it doesn't completely resolve either, basically the bad guy gets away to fight another day. This isn't a big issue since the book does come to a resolution and the plot is laid out for the final installment. I can tell you after picking up the tantalizing threads for the third book, it is going to be one heck of a ride and I can't wait to see how it all plays out. Those Mayans better be wrong about December 2012!*I was not satisfied with how things ended up with Innocente. Not so much over the events, but because I felt that there was something more, like she has an unfinished role and I just don't feel like her part completely played out. I am hoping I will get my closure in the next installment. The Pretty When She Dies books remind me of Anne Rice's books, with the dark, sexy vampires all plotting for power and the intricate story lines. If you are a fan of Ms. Rice I urge you to check out this series. I am eagerly anticipating what is sure to be an action packed, exciting ending in 2013. Favorite Quotations:\"Tilting her head, the girl gazed past the treetops at the bloated harvest moon ascending in the night sky. The orb split light through the branches and cast a bluish glow over the old cemetery.\"\"At times like these she was haunted by a life she would never have.\"\"She, meanwhile, should have lost a few pounds before becoming a vampire.\"\"There were no souls inside the bodies, but there were memories. She could feel the whispers of who the zombies once were. The lost hopes and dreams brought tears to her eyes.\"\"I'm so not going all Patricia Arquette. I refuse to! Because the next thing you know I'll be all John Edwards-y and people will be banging on my door wanting the deets of their granny's peach cobbler recipe.\"I received copies of this book from the author in exchange for an honest review! Rainy Day Ramblings."}, {"userName": "Kristin", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/3369070-kristin", "userReview": "Rhiannon Frater is one of the best writers of horror and urban fantasy out there. Okay, that's just my humble opinion. In the case of Ms. Frater's Pretty When She Dies series, she brings to the table an urban horror tale balanced with love interest(s), humor to lighten the load, and a tightly packed plot with virtually no holes (none that I saw) and lots of twists that turns that had me saying, \"Oh, no she did NOT just do that!\" And no, her vamps are not the sensitive, touchy feel-y sort; they most certainly don't sparkle!World Building - Because this horror tale is set in an urban setting, Ms. Frater didn't need to spend time drawing a picture for us of what the world looks like; it's ours. Where world building came into play with this book was explaining what was happening to Samantha. Ms. Frater did a great job of letting us discover, at the same time as Samantha, just what Samantha is capable of. Ms. Frater also graced us with a few more supernatural races and what she refers to as \"super powers\" for the humans. I really loved what she did with Samantha; especially for one crazy scene at the end of the book (I can't tell you but it is so freaking amazing I about spit out my coffee!!)I'm especially fond of the city Rhiannon chose to set her book in, Austin, TX. Many times the characters lament that the city is changing and they're each trying to decide if it's for the better or the worse. It's a great metaphor for the vampires' lives. Change is hard and uncomfortable, but to get what you want, sometimes you need to do the hard stuff.Characters - Samantha, Samantha, Samantha... yeah, I pretty much hated her character in the first book. I never really have a problem with characters I dislike in a book because they usually serve a purpose. Samantha definitely serves a purpose and grew on me. We get to meet some of Jeff's team of vampire hunters. Secretly, I wish I could be Jeff: own a bookstore, be a leader of a group of vampire hunters, and drive around in an old Land Rover. And we also get some new characters added to the mix that only add to the story, never weighing it down. I really can't wait to see what happens in the next book :)And it truly amazes me how consistent Ms. Frater remains with her characters, especially after how much time has passed between when she wrote Pretty When She Dies and Pretty When She Kills (Ms. Frater must have KILLER notes!!) Amaliya is still that unrefined drum playing, cigarette smoking girl who likes to run away from her problems. Cian is still an ass sometimes. Innocente is still smart as hell and Sergio is a great sidekick for her. Story & Tempo - Ms. Frater wrote the best darn (or damn?) prologue I've read in a long time! Horror, horror, horror!!! She shocks ya and then dumps you into Cian and Amaliya's life. Brings you UUUPPPPPP, and then dumps you on your ass. I LOVE IT!!! Ms. Frater does that often throughout the book; ending some chapters on cliffhangers. Many times I was like, \"I don't want to read about this other stuff NOW, I want to know what happened!!!\" But then you get wrapped up in the new direction Ms. Frater has taken you and your dumped on your ass again!! And the use of that writing method does not lessen the plot at all and you're never lost. The plot and story are tight. You have your twists and surprises on top of some hard emotions that had me crying for about 10 minutes (that's a long time for me and a book to do the weeping thing). Rhiannon Frater is just a freaking amazingly talented author. Just go buy her books NOW, okay?!?! Her next book in the series, Pretty When She Destroys (Pretty When She Dies #3), is going to be out sometime next year. On top of that, the trilogy has been optioned for film and has a script for the first movie! Amazing! The producer is in the process of shopping the script."}, {"userName": "Chapter by Chapter", "userReviewDate": "Aug 17, 2012", "userURL": "http://www.goodreads.com/user/show/6473590-chapter-by-chapter", "userReview": "If you loved Pretty When She Dies, you are definitely going to love Pretty When She Kills. I, personally , loved it even more than the first. Probably because Amaliya seems more comfortable with her badassness, and because…you know…she and Cian are together. I love this couple! Seriously best undead couple ever!Pretty When She Kills pretty much picks up from where the first left off. Amal and Cian are together, Samantha is still coming to grips with the end of her engagement with Cian and is now dating Jeff, Innocente and Sergio have been inducted into the Vampire Hunter’s guild thing, and the other vampire Masters are wanting Amaliya for their very own, since new shad leaked out that the Summoner is dead and gone, and Amaliya is the new baddie to have on their side.Amaliya is still trying to learn exactly how her gift of necromancy works and learn how to harness her powers. But it looks like there’s a new kid on the block who shares the same powers as Amaliya. And she’s been in contact with her grandmother begging for help, and warning them that Amaliya is in trouble.Rachon, sister to Cian via their creator, the Summoner, has been requesting a meeting with both Cian and Amaliya to discuss a potential pact, to keep Amal safe and to keep Austin in Cian’s hands. But is that really what Rachon wants? Or does she have something else more sinister up her sleeve…Let me start off by saying…holy plot twists! Pretty When She Kills is full of twists and turns that you definitely do not see coming. Once you think that everything is on the table, and there can no longer be any more surprises…BAM! Rhiannon Frater throws in another, and another, AND ANOTHER! It was such a thrill ride, and I loved every minute of it.The characters are still as lovable as in the first installment, and what I loved most was the very Buffy-esque theme. A few Buffy innuendos thrown into the mix, with some specific name calling. Jeff is now dubbed Giles, Samantha has considered herself as Buffy, we’re introduced to a new coyote shifter named Eduardo who reminds me of a more badass Oz. We’re also introduced to a pretty powerful witch with a Willow/Tara feel to it. I could keep going, but suffice it to say, it was this little this coincidence that had me falling even harder for this phenomenal cast of characters.We are also introduced to Bianca, a newly born vampire who seems to have the same powers as Amaliya since…ya know…the Summoner created them both and seemed to have infused them both with the same gift. We also get to see a whole new cast of characters and watch the parts they play in this game of chess. Among them is a Vampire Hunter/Bounty Hunter named Ethan who is one dude you don’t want to mess around with. I love how you as you’re reading, you’re constantly wondering whether he’s on Team Good or if he’s batting for Team Not so Good.The writing and world building in Pretty When She Kills surpasses that of its predecessor and has left me craving the next installment, Pretty When She Destroys…which I am in need of ASAP! I can’t get enough of this storyline, and need to know what will happen with this Scooby gang. And let me just say, as a side note, that I loved the World of Warcraft (WoW) tidbit thrown in. I say this because, Rhiannon Frater mentions the whole “stopped playing WoW when it got too easy to level to 60”. A little secret about myself…I quit playing WoW when it got too easy to level to 80! Yes, I was a WoW addict…sshhhh…Fans of Rhiannon Frater will love the first two installments to this trilogy. Commonnnnn #3!"}, {"userName": "Stéphanie", "userReviewDate": "Sep 12, 2012", "userURL": "http://www.goodreads.com/user/show/1858445-st-phanie", "userReview": "Rhiannon Frater has done it again by writing this amazing novel. The sequel to Pretty When She Dies, PRETTY WHEN SHE KILLS is as interesting as the first book of the series. Amaliya was a great main character to read about in the previous book and I was overjoyed to read more about her in this installment. However, since I enjoyed the first book so much, the original novel still remains my favorite Rhiannon Frater book. PWSK is a close second and should be read by anyone who liked PWSD.One thing I was disappointed with is the fact that, unlike book 1, PRETTY WHEN SHE KILLS doesn’t concentrate on mainly one point of view. Since I like the Amaliya character so much, I found it difficult to have to constantly jump from one POV to the other. Personally, I would have liked to read more from Amaliya’s view but I understand how difficult the story would have been to write if the author would have been limited to one POV. The Amaliya in PWSK is very similar to the character we meet in the first book, if not a little more mature. She has truly embraced her life as a vampire and is only starting to comprehend the extent of her necromancer powers. Her relationship with Cian is very fitting and and great to read about. Obviously, it’s not a perfect relationship but all it remains something solid since both characters care about each other very much.I’m glad Rhiannon Frater took her story beyond the vampires and the necromancer myths. She added magic and witches to the mix, which in by opinion, adds so much more interesting bits to the story. New and old enemies make appearances throughout the book and even if I was confused in determining who the real antagonist was, the surprising dénouement kept me on my toes until the very end. Obviously, the story doesn’t finish with this novel. A third will follow this one to complete the Pretty When She Dies trilogy. For those of you who don’t like unfinished stories, I would recommend waiting for the third book to be published before reading PWSK. A couple of death will sadden many readers. Two important characters meet their end during the final battle and obviously these deaths affect Amaliya on a deep level, despite her being a strong character. I truly don’t know if the death were truly necessary but I’m sure they will be a huge incentive for Amaliya in the next novel.I admire the author’s ability to combine sarcastic humor and pop culture to a horror and urban fantasy setting. Personally, I find Buffy references never get old, and the Clueless mention was simply awesome. Overall, Rhiannon Frater’s vampire are original enough, but what distinguishes her series from other is the lore and myths included in the stories. The authentic and original characters are also a huge advantage. Personally, I find characters are the backbone of any story and throughout all her novels, Rhiannon has never failed in creating some interesting ones. Vampire fans who haven’t read this series will absolutely adore it. If you haven’t added this series to you TBR piles, I don’t know what you’re waiting for!¨¨¨¨¨¨¨¨¨¨¨¨¨¨¨¨°º©©º°¨¨¨¨¨¨¨°º©©º°¨¨¨¨¨¨An electronic advance reader's copy was provided by the author. Also reviewed on Tynga's Reviews"}, {"userName": "Book Bite Reviews", "userReviewDate": "Jun 02, 2012", "userURL": "http://www.goodreads.com/user/show/6904179-book-bite-reviews", "userReview": "It begins a depiction of a horror scene. Bianca Leduc rises as the latest necro-vamp created by The Summoner, but Rachon decides to keep her for herself. Being Amaliyas college friend, we get the impression Bianca is friendly when she appears as a ghost to Innocente. Amaliyas mother had a dream where Bianca is asking for her help. She says Amaliya is in trouble , that Rachon wants to kill her. OKThis book is full of terror and excitement and humor. As you can imagine Amaliya can raise the dead and now we have two necromancers. We see her powers as win and a force to be reckoned with. The Summoner is dead .Samantha was so much fun as is Jeffs colleague, Benchley. Samantha is seeing ghosts while trying to pick up the pieces of her life with Cian. A woman cries out to her for help and vanishes before her eyes. \"Fuck. My. Life\" she says . She becomes irate and blames it all on Amaliya. She almost died in the last book but Amaliya saved her by feeding her, her blood. Nathan persuades Pete to join him in his search for Amaliya. He thinks Nathan can save Amaliya. Nathan lies of course. In actual fact , Nathan is a bounty hunter who tracks down monsters and was hired by Rachon. Truth was he needed to use Pete and Innocentes blood to perform an occult ceremony he says to bring Amaliya back to human life. Then Rachon was going to kill her. You think Rachon is evil? Etzli is worse!When Jeff witnesses Samantha with the ghost of Cassidy Longoria, he surmises Samantha is a Phasmagnus. At this point I have a bad feeling about Nathan digging up The Summoners dead body parts. Pete and Innocente and Sergio are in danger.What if Innocente is unable to help Nathan locate his body parts? Let the ghosts do it instead! Lol and let the dead unbury their own dead!!! We meet two new characters that of Cassandra and Aimee. OMG! my precious !! I'm really pleased with these two.Sunday was a full moon ....the busiest damn day and night of the history of Austin TX! The gravediggers and the gang were gathered in one place...A Cemetery!! AGH! Shit is going down, two people(ok 3 ) die, and 2 people (ok deadly people) escape when the fight ended quite abruptly. Amaliya ended it and the zombies rested. In the next book, Pretty When She Destroys, at least we know what will be back. Evil incarnate!Two weeks later....Sitting in Jeff's Shop discussing important matters were the somber faces of those who had lost the battle. I call them \"The Gang\" They lost two of their loved ones, of which I won't say. Interesting Story about the Sword of Lucifer and the 13 rings. A story inside a story! EPICLOGUECian and Amaliya move into a new home south of downtown Austin in the Bouldin Creek area. They both express their love and dreams to one another. Beautiful and rich. To be cont....in Pretty When She Destroys 2013 WOOT!"}, {"userName": "Book Twirps", "userReviewDate": "Aug 14, 2012", "userURL": "http://www.goodreads.com/user/show/5225569-book-twirps", "userReview": "It’s no secret that I love Rhiannon’s books. The As the World Dies trilogy is by far one of my favorite series ever. I think this series is quickly becoming my second favorite.I read Pretty When She Dies a couple of weeks ago and immediately fell in love with Amaliya. She’s the typical strong, feisty, no BS kind of heroine Rhiannon creates so perfectly. What I like best about Rhiannon’s stories are her characters. She really gets into their heads and makes us feel for them. At the same time, none of her characters feel the same. Each of her leads are their own person which can be difficult for some authors.Warning: Don’t read further if you’ve not read the first book. There are spoilers ahead.In the last book, Amaliya and Cian defeated the Summoner (the vampire/necromancer) and moved in together back in Austin. Samantha broke up with Cian and there was a hint of something cooking between her and Jeff (the vampire hunter). Everything seemed to be well in Amaliya’s world (or at least as well as it could be), but in true Rhiannon fashion, things are far from well. The vampire king of San Antonio wants Amaliya to join him. He saw her necromancer powers at work in the first book, and he wants her power for his own evil use. There’s a new villain, and they are just as frightening, if not more so, than the Summoner from the first book. I honestly wasn’t sure this was even possible.I won’t say any more about the plot because I don’t want to spoil anything. This book definitely elevated the series to a whole new level for me. It was scarier than the first, and I really grew attached to a lot of the characters. In the first book, Samantha kind of got on my nerves. Maybe it was because she was engaged to Cian and I wanted him to be with Amaliya, but she annoyed me. I’m happy to say that she redeemed herself in this book. In fact, she really grew on me and totally cracked me up. I’m also happy that we got to see more of Jeff. He was important to book one, but I didn’t feel close to him. I’m glad he got more to do in this installment.As always, the writing is brisk and fluid and the action rarely stops. Every scene has a purpose here and there’s no wasted space on the pages. Also of note are the sex scenes. I mentioned they were hot in the first book, and they have not cooled off. Keep a spray bottle handy to cool yourselves down while reading. I know I’ve said it before, and I’ll say it again. If you are a fan of vampires, or if you used to be, but have grown tired of the over-saturated market, you need to give these books a try. Rhiannon has restored my faith in bloodsuckers!"}, {"userName": "Amanda Croley", "userReviewDate": "Aug 15, 2012", "userURL": "http://www.goodreads.com/user/show/2721716-amanda-croley", "userReview": "I have been waiting forever to read this book, and finally finished it. In the first book Pretty When She Dies, Amalyia wakes up after being turned into a vampire against her will. Her sire, which was also her professor, The Summoner left her to awake alone. Left on her own, she has no idea how to overcome the blood lust, and several people die. She returns home, but Pete her ex freaks out when he finds out what she is. Somehow (I can't remember) she ends up in Austin with Cian, and they defeat the summoner in a bloody battle. This book starts with the two of them still in love, and planning their future together. Samantha, Cian's ex is still bitter about their breakup, but she is seeing Jeff, the vampire-hunter. Jeff's family and Cian have had a long-time understanding, they work together, and Cian keeps the supernatural population in order. Now that the Summoner is gone, masters of other cities are trying to take Austin from Cian. Rachon (the Summoners fav child/lover) is wanting revenge for the Summoners death, and apparently Bianca Leduc is also one of the Summoners new creations who has necromancer powers. ***Spoilers***Rachon is there when Bianca awakens, and keeps her to use against Amalyia. She hires Ethan to track her down, while planning to turn her back to mortal so that she can be killed. Bianca is her secret weapon that no one knows about, until she starts speaking to Innocente (Amalyia's grandmother) in her dreams, asking for help. Innocente and Pete are tricked into helping Ethan recover the Summoners ashes to restore Amalyia to a mortal, but at the final showdown it's revealed that the Summoner took over Bianca's body when he was killed and has tricked them all. He kills Innocente before Cian and Amalyia get there. Cian also finds out he has a daughter, who is dhampir (part vampire/part mortal). She and her girlfriend also help in the battle. Once The Summoner/Bianca reveals herself, Rachon knows she has been tricked and joins the other team. At the end of the book, it's revealed that Etzli is working with the Summoner, and they both get away. They are both looking for 13 rings that can open the veil between here, and the otherworld so that they can live uninhibited by the sun. Cian, Amalyia and the rest of their crew know that it's only a matter of time before they are targets again, but until then their group is determined to find as many rings as possible."}, {"userName": "Kat", "userReviewDate": "Sep 10, 2012", "userURL": "http://www.goodreads.com/user/show/3835702-kat", "userReview": "This day is a very important one in my reading history. It's the day when I finally proclaim that I will no longer avoid vampire books, that I actually LIKE reading vampire books and that Rhiannon Frater is now firmly in my lists of favourite paranormal AND zombie writers.Pretty When She Kills is a fantastic mixture of vampire, witches, dhamphirs, necromancers and several other paranormals, coupled with larger-than-life characters and an action-packed storyline with allegiances, betrayals, romance and lovey-times.Amaliya makes a huge progression as a person in Pretty When She Kills - no longer giving in to her flight mode at the first sign of trouble, she pushes her self-doubt aside and stands up for the people she loves, even if it means putting her own life at risk. Although I loved her in the first book, I loved and respected her by the end of this one - she is the kind of character that I would love to sit down and have a beer with and just pick her brains.Cian is one hot vamp, Samantha is an awesome foil for Amaliya and we're introduced to some awesome new character that I immediately wanted to learn more about. The dialogue is gritty and real, and the pacing is absolutely perfect - enough time to absorb what is happening without feeling bogged down by detail or dialogue.The plot is full of twists and turns as new characters are introduced, old characters reappear and one of my favourite things about Ms. Frater as a writer is that she isn't afraid to kill off favourite characters. Pretty When She Kills is more than just an entertaining story, I finished feeling I had also learned things about the characteristics of paranormals, parciularly some of the lesser-explored areas.Pretty When She Kills is also an incredibly creepy tale - I was almost afraid to read it at night in some parts because it got so far under my skin. This is paranormal/horror as it should be!Hot on the heels of reading the first book in this series, Pretty When She Dies, plunging back into Amaliya's world felt seemless. The characters, which were big and bad and fabulous in the first book are back bigger and better, and the intensity is wratched up more than a few notches. I can't wait (although I'll have to!) for the third book in the series.Read more of my reviews at The Aussie Zombie"}, {"userName": "Amy Fournier", "userReviewDate": "Mar 06, 2012", "userURL": "http://www.goodreads.com/user/show/5943163-amy-fournier", "userReview": "I want to start off by doing some crazy fan girl dance or something. For real, this book was amazeballs!! I thought I loved the first one, but this one was just overflowing with awesome!! Rhiannon turned up the heat, the action, and the creepy factor in this one and I loved every second of it!! The character development is really great too. I love getting to know the different characters better. Amaliya is still one kick ass chick and things get a lot more crazy for her. She of course still has the spunky personality that I loved in the first one, but I love seeing the softer side of her too. It comes out a lot more in this book than it did in the first one now that she is more adjusted to the fact she is a vampire/necromancer. Her relationship with Sam is still quite intense and I love their interactions. Amaliya is a seriously funny, tough as nails chick and I can't get enough of her. We meet some pretty dangerous characters too. Rachon for one is an old vampire that is not one to be messed with, but it seems that she is now a big thing to worry about. She is coming to Austin and Amaliya knows that it's a very bad thing. There is also another Necromancer/Vampire they have to worry about. Innocente has been seeing her. On top of that Sam is even more pissed than before because now she is seeing dead people thanks to Amaliya's blood. Forget the fact that Amaliya saved her life, she is livid about it!! Pete is on a mission to help Amaliya. It's very sweet and sad at the same time. He loves her so much, but of course we know that she is happy being a vampire and she loves Cian. This book is just full of action and suspense. It gets very intense as they realize there is more to it than just Rachon wanting revenge and a necro-vamp calling out for help. This book had hooked! There is so much going on and we learn a lot of new things, but it's never to the point where it's too much at a time. It's like an adrenaline rush that you can't get enough of. And lets not forget the steamy, sexy scenes. We still get some of those too, though not as much since they are fighting for their lives. (or un-lives I guess) I can't really say much more except you are in for one hell of a ride reading this book!"}, {"userName": "Kristin (Blood,Sweat and Books)", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/6974252-kristin-blood-sweat-and-books", "userReview": "I received this book for review from the Author. All opinions are my own and I was not compensated in any way for them.Review:Pretty When She Kills continues following the story of Amaliya Vezorak the badass vampire established in Book 1 Pretty When She Dies.The GoodThe Characters- OMG I didn't think I could like these characters anymore than I already did but I totally do. I still think Amaliya is my favorite but shockingly I found myself liking Samantha (Cian's Ex)more and more as the book progressed. I love especially how even minor characters who you know are there purely as lambs to slaughter have a voice no matter how brief. It's surely a testament to Rhiannon's writing.The Pacing- To say that it was good would be an understatement. I read through this book in one sitting. I didn't even realize how quickly the time had passed until I hit the last page.The Sexy- I wouldn't call this book Romantic even though I love watching Cian and Amaliya together. If you ever watched Buffy I think of their relationship as more Buffy/Spike than Buffy/Angel. It's gritty,powerful and full of just primal desire to be together. Whereas with Angel it's sweet, tender, and safe.The Vampires- Throw your perfectly coiffed hair, daylight walking, sparkly vampires out the window. These vampires will rip your throat out and do it with a smile on their face. I love Rhiannon's vampires they encompass everything a proper vampire should be. I think that is what makes them so enjoyable to read about.The BadJeff- I feel a bit bored during his scenes. I like his character and especially where I believe it's headed but I don't know.... I just have this disconnect with him that I don't have with the other characters.Final ThoughtsOverall Pretty When She Kills is another great book by Rhiannon Frater. I really don't have any faults with the book as a whole and I cannot wait for the next in this series. I have no doubt it will be epic. If your looking for a Bloody good time then I Highly suggest picking up Pretty When She Kills. I will be rating Pretty When She Kills by Rhiannon Frater 5★★★★★."}, {"userName": "Stephanie Ward", "userReviewDate": "Aug 19, 2012", "userURL": "http://www.goodreads.com/user/show/4831794-stephanie-ward", "userReview": "'Pretty When She Kills' is the second book in the paranormal horror trilogy that focuses on our heroine, Amaliya, as she continues adjusting to her new life as a vampire. Aside from being turned in the first book, Amaliya figures out that she is also a necromancer (awesome!) and had to defeat her enemy. Not everything was bad - she also fell in love with Cian, the vampire master of Austin. In this second installment, Amaliya is faced with even more problems as a huge paranormal war seems imminent, she is being hunted by a mysterious man and the progeny of the Summoner, and now her grandmother is having horrifying visions of another necromancer vampire. Will Amaliya ever get a shot at peace and a happy ending?This book, like the first in the series, is incredibly well written. It is fast paced and flows effortlessly - making it a literal page turner. There are so many completely awesome things going on - a necromancer vampire!? - that the reader is immediately immersed in the world that the author has created. Our heroine, Amaliya, is witty and so badass. She doesn't take crap from anyone and tackles problems without (much) fear. All the characters are unique and have their own personalities - they are very realistic and easy to identify with, even though most of them are supernatural. There are so many twists and multiple plot lines going on throughout the novel that you are kept on your toes the entire time and keeps you trying to figure out what will happen next. I honestly can't say enough good things about this series. It's one of the most interesting and engaging horror/paranormal series that I've ever read. This is the first I've read of Rhiannon's work, and I'm now completely hooked and I may begin stalking her. If you haven't read this series - START NOW! You definitely won't regret it.Disclosure: I received a copy of the book in exchange for an honest review."}, {"userName": "Erin Hayes", "userReviewDate": "Feb 05, 2012", "userURL": "http://www.goodreads.com/user/show/6816709-erin-hayes", "userReview": "This is the same review I posted on Amazon: I preordered an early copy from Ms Frater and devoured this book from the second I downloaded it to my Kindle. The buttons on it are probably still jammed from me pressing too hard to turn the page.Book one, Pretty When She Dies, was one of the very first indie ebooks I ever bought. And I loved it. It opened up the whole world of indie authors that I now proudly support - my Kindle is full of indie books now. Some have been awesome, some have been real duds - but very few have lived up to the world of Amaliya and her friends. A sequel to it would have a lot to live up to. I was not disappointed.Pretty When She Kills starts a few months after the first book ends. Amaliya and her friends and family are getting used to her being a vampire and the impact it has on everyone's lives. And that's when someone decides to mess with Amal's happy ending. I don't want to give away too much of the plot, but my favorite characters were back in full force, and I loved every minute I spent with them.As always from Ms Frater, it felt like a book from one of the big publishing houses - a slick cover, tight writing, well edited, nice world-building (I lived in Austin for four years, so it was a treat to be brought back there), and a wizz-bang ending that I did not see coming. You should've seen my jaw hit the ground, it was pretty magical, how the plot tied in with some historic points in time. It makes you wonder if Ms Frater was planning it from book one.While I still consider Pretty When She Dies to be one of my favorites, Pretty When She Kills is very close and deserving of my five-star review. I'll be anxiously awaiting for the concluding book in the trilogy."}, {"userName": "Darlene", "userReviewDate": "Nov 09, 2012", "userURL": "http://www.goodreads.com/user/show/5469695-darlene", "userReview": "I really enjoyed Pretty When She Dies, and it was great to re-immerse myself into Frater's dark vampire world.The story picks up four months after the conclusion of Pretty When She Dies, and Cian is teaching Amaliya how to defend herself and helping her to practice how to control her necromantic powers.Amaliya's grandmother, Innocente, is warned in a vision that Amaliya's life is in danger. When a paranormal investigator named Ethan Logan tracks down Pete, the man who has been crushing on Amaliya all of his life, he tells Pete that he can save Amaliya and restore her to human form. Pete agrees to help Ethan, together with Innocente and Amaliya's cousin, Sergio.Meanwhile, Cian's ex-girlfriend, Samantha, has discovered that her brush with death in Pretty When She Dies has resulted in some unusual paranormal abilities due to the blood that Amaliya gave to her to save her life.I really enjoyed this second book in the series even more than the first one. In Pretty When She Dies, Amaliya was mad with the hunger of a newborn vampire. In this story, she is learning how to control herself and drink from humans without killing them. I liked seeing her growth from a ruthless killer. An unexpected favourite this time around is Samantha. I enjoyed her so much more in this book, and she has undergone a bit of a transformation herself. She is definitely more strong-willed and courageous, and I like her love/hate relationship with Amaliya.I am looking forward to reading the conclusion of this series, Pretty When She Destroys, which will be released later this month.I received this book from the author in exchange for an honest review. I did not receive any compensation for my review, and the views expressed herein are my own."}], "description": "Amaliya Vezorak never believed in happy endings…When Amaliya harnessed her necromancer powers to defeat her greatest enemy, she believed she had finally found a happy ending with Cian, her lover and the master of Austin. That happiness is short-lived when the vampire ruling over San Antonio attempts a takeover of Austin in order to capture Amaliya and use her power for his own devices.To make matters worse, Samantha, Cian’s ex-fiancée, is seeing ghosts, the untested vampire hunters of Austin are running scared as a supernatural war looms, a mysterious man is hunting Amaliya with the help of her one time lover, Pete, and Rachoń, the Summoner’s favorite progeny, appears to be out for revenge.When Amaliya’s grandmother, a powerful medium, experiences terrible visions that reveal there is another necromancer vampire and she is crying out for help, Amaliya realizes happy endings do not come easily…", "title": "Pretty When She Kills\n      \n          (Pretty When She Dies #2)", "url": "https://www.goodreads.com/book/show/16037174-pretty-when-she-kills", "average": 4.02, "cover": "https://images.gr-assets.com/books/1348161219l/16037174.jpg", "reviews": 78, "authors": [{"url": "https://www.goodreads.com/author/show/2310121.Rhiannon_Frater", "name": "Rhiannon Frater"}], "type": ["Paranormal", "Fantasy", "Horror", "Fantasy", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/16037174-pretty-when-she-kills", "http://www.goodreads.com/book/show/13139589-pretty-when-she-kills", "http://www.goodreads.com/book/show/9648068-the-first-days", "http://www.goodreads.com/book/show/6350211-fighting-to-survive", "http://www.goodreads.com/book/show/6718719-siege", "http://www.goodreads.com/book/show/12295280-as-the-world-dies", "http://www.goodreads.com/book/show/13581917-the-last-bastion-of-the-living"]}