{"ratings": 2366602, "userreviews": [{"userName": "Stephen", "userReviewDate": "Mar 16, 2010", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "6.0 stars. Confession...this book gave me an earth-shattering Janeaustegasm and I am feeling a bit spent and vulnerable at the moment, so please bear with me. You see, I decided I wanted to get more literated by reading the \"classicals\" in between my steady flow of science fiction, mystery and horror. The question was where to begin.After sherlocking through my Easton Press collection, I started by pulling out my Dickens and reading A Tale of Two Cities which I thought was jaw-dropping AMAZO and left me feeling warm, satisfied and content. It also made me made retrospectively pleased that I named my youngest daughter Sydney.After Two City “Tale”ing, I decided to give this book a whirl as I kept seeing it on GR lists of \"goodest books ever.\" However, I must admit I was hesitant going in to this for two big reasons. One, I thought it might be a bit too romantical for me. The second, and much more distressing, reason was that Twilight was on many of the same lists as this book. Austen fans should pull a nutty over that one.So needless to say I went into this thinking I might hate it. Well, for the 999,987th time in my life (at least according to my wife’s records)...I was wrong!!! I absolutely loved this book and had a mammoth, raging heart-on for it from the opening scene at the breakfast table when Father Witty (Mr. Bennet) is giving sly sarcasm to Mrs. Mommie Put Upon. I literaphorically could not get enough of this story. I was instantly captivated by the characters and Elizabeth Bennet, the main protagonist, immediately became one of my all time favorite characters. Mr. Darcy joined that party as soon as he showed up in the narrative as I thought he was terrific as well.Overall, the writing could not have been better. It was descriptive, lush and brilliant. The story could not have been more engaging or intelligent and the characters could not have been more magnificentastic. Elizabeth and Fitz are both smart, witty, self-confident and good. Austen could not have written them better. Oh, and I am sorry if this is a bit of a minor spoiler but I need to add that George Wickham is a cock-blocking braggadouche of startling proportions. I needed to say that and now I feel better. This one has made it onto my list of All Time Favorite novels and is truly one of the classics that lives up to its billing. A FINAL WORD TO THE GUYS: ...Guys, do not fear the Austen...embrace the Austen...HIGHEST POSSIBLE RECOMMENDATION!!!"}, {"userName": "Elizabeth", "userReviewDate": "Nov 30, 2008", "userURL": "http://www.goodreads.com/user/show/1762033-elizabeth", "userReview": "NOTE: The review you are about to read was written in 2009. 2009! That's almost 10 years ago! I was 17 and thought I was the smartest person ever! In all honesty I barely remember this book. So, negative comments regarding my intelligence are no longer necessary. They will be ignored. As they have been for probably 6 years now. CARRY ON!P.S. Can we all just LOL at my use of the words \"mind-numbing balls\"?? HA. This book is quite possibly the most insipid novel I have ever read in my life. Why this book is so highly treasured by society is beyond me. It is 345 pages of nothing. The characters are like wispy shadows of something that could be interesting, the language that could be beautiful ends up becoming difficult to decipher and lead me more than once to skip over entire paragraphs because I became tired of having to stumble through them only to emerge unsatisfied, and the plot is non-existent, as though Austen one day decided she wanted to write a novel and began without having any idea what would happen except that there would be a boy and a girl who seemingly didn’t like each other but in the end got married. The story really probably could have been told in about 8 pages, but Austen makes us slog through 345 pages of mind-numbing balls and dinner-parties. I don’t care what anyone says, this is not great literature. This is a snore.Read my review of Pride and Prejudice and Zombies."}, {"userName": "MacK", "userReviewDate": "Aug 12, 2007", "userURL": "http://www.goodreads.com/user/show/164338-mack", "userReview": "Where my massive crush on Jane Austen began: alone, on a hot day in Montana, cursing her name.I had to read it for AP English and I could not see the point. Girls need to marry. Girls can't get married. Girls are sad. Girls get married. Girls are happy.I went to school to half heartedly discuss it and waffled and wavered in an effort to please my teacher. Finally she said: \"was it good or not, Ben?\" \"No it wasn't.\"\"Thank you...now read this twenty pages of literary criticism for homework.\"Twenty pages of literary criticism later, I was hooked. Once you know what to look for, it's hilarious. Once you're keyed into the contextual life of women, you have to feel for the plight of the Bennet sisters, and laugh at the crudity of their mother and Mr. Collins.So yes: I'm a guy and I love Jane Austen. You got a problem with that? Huh? Huh? Do you? Huh??? Well if you do, I'll be over here nursing my dorkiness just waiting for a fight for the honor of my beloved Jane."}, {"userName": "Zoë", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "THIS BOOK IS MY JAM. JANE AUSTEN IS MY JAM. I LOVE EVERYTHING ABOUT HER AND THIS BOOK. READ THIS BOOK. THAT IS ALL."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Mar 21, 2017", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "I finally did it!!!! And I loved it!!!!"}, {"userName": "Troy", "userReviewDate": "Mar 20, 2009", "userURL": "http://www.goodreads.com/user/show/2125915-troy", "userReview": "I was forced to read this by my future wife.I was not, however, forced to give it 5 stars."}, {"userName": "Hira", "userReviewDate": "Jul 03, 2009", "userURL": "http://www.goodreads.com/user/show/2485544-hira", "userReview": ""}, {"userName": "Rolls", "userReviewDate": "Mar 07, 2007", "userURL": "http://www.goodreads.com/user/show/18657-rolls", "userReview": "\"Pride and Prejudice\" by Jane Austen started off annoying me and ended up enchanting me. Up until about page one hundred I found this book vexing, frivolous and down right tedious. I now count myself as a convert to the Austen cult. I must confess I have been known to express an antipathy for anything written or set before 1900. I just cannot get down with corsets, outdoor plumbing and buggy rides. Whenever someone dips a quill into an inkwell my eyes glaze over. This is a shortcoming I readily own up to but have no desire to correct. So I admit to not starting this book with the highest of hopes. I did really enjoy Ang Lee's \"Sense and Sensibility\" however and so when my friend threw the gauntlet down I dutifully picked it up.Boy did I hate him at first. To get anywhere with this book one has to immerse oneself in the realities of life and marriage in the nineteenth century. At first all this talk of entailment and manners just left me cold. I liked the language to be sure. Austen's dialogue is delightful through out but dialogue alone (no matter how delicious) does not a great novel make.A hundred pages or so in though I started to see what a shrewd eye for character this Austen woman had. Mr. Collins was the first person I marvelled at. His character springs forth fully formed as a total but somehow loveable ass. From that point on I found much to love about this book. I was so into it by the end that I was laughing at some characters, sympathizing with others and clucking my tongue at an unhappy few. In short I was completely absorbed. In conclusion I must now count myself a fan of Miss Austen's novels (and not just their fim adaptations) and do so look forward to acqauinting myself with more of her work in the future. \"Emma\" anyone?"}, {"userName": "Anne", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/940777-anne", "userReview": "Critics who consider Austen's works trivial because of their rigid, upper-class setting, wealthy characters, domestic, mannered plots and happy endings are almost totally disconnected from reality, as far as I can tell. What can they possibly expect an upper-middle class English woman to write about in 1813 but what she knows or can imagine? Sci-fi? A history of the American Revolution? A real-life exposé of underage exploitation in the garment district of London? Come on. What other setting can she be expected to tackle with authority? Austen's value lies in her portraiture: her characters are believably human in their concerns, vanities, failings and quirks. The plots serve largely to showcase their interaction and thus, her observations of human nature, which are pointed, accurate, and hysterical. Here, in her best work (my opinion), her technical skill as a writer also shows in Pride and Prejudice's tight plotting and economical casting; there are no superfluous characters or wasted chapters here. My college lit professor used to go on and on about this novel as a revolution of literary form in that dialogue drives the plot as much as exposition; I'll buy that but it doesn't thrill me for its own sake as much as it did her. It does mean, though, that Pride and Prejudice is a relatively smooth and lively read, that we learn about events and characters as much from what they say to each other as from what Austen narrates to us. The banter between Darcy and Elizabeth isn't empty flirting, it's a progression, a chart of their ongoing understanding/misunderstanding and a way to take stock of plot developments as well as an enjoyable display of wit. Austen's heroines are famously caught between love and money are famously criticized for always getting both in the end. I've got no problem with this wish fulfillment. Keep in mind that being married is basically the only possible 'job' available to a woman of her position--marrying a rich dude is the only viable escape from the life of poor-relation dependency Austen herself lived, there's nothing reactionary or anti-feminist about it. The other option--becoming a governess--is barely respectable, putting a woman into an ambiguous class limbo of social invisibility that translates directly into a loss of safety and self-governance. Expecting Elizabeth to, what, become a doctor? is silly and anachronistic, and perhaps if that's your preference you'd be better off reading Clan of the Cave Bear, with Ayla and her bearskin bra, or what have you. Pride and Prejudice is simply a joy to read, a dance of manners and affection between the leads and a parade of human silliness in the supporting cast. edited to add: some thoughts specific to the Patricia Meyer Spacks annotated edition I received as a gift for Christmas 2010:It’s quite remarkably handsome, and sturdy, and useful for whacking spiders if you are that sort of person. Generously illustrated with color and black-and-white sketches, engravings, and reproductions of earlier editions, household objects, relevant artwork, contemporary cartoons, diagrams and fashion plates.My attention wandered during the editor’s introduction in what turned out to be a horribly familiar way. While I appreciated Spacks’s discussion of historical background, her warnings about the subtlety of language and characterization, and the dangers of identifying too much with our favorite characters because Austen stacks the deck for that purpose, etc etc, it was a sort of technical appreciation--dry, and a little bit soulless. I was, perhaps, impatient. At some point as I yanked my eyes back to the pages I kept trying to read, I realized: Spacks is a Professor Emerita at the University of Virginia--my former stomping grounds (wahoo-wa!) (...sorry, that happens)--it’s more than possible she was MY professor back in 19. I don’t remember her name or face, but certainly her style, the steel trap of her mind, and the mildly pushy feeling of her obsession with language all felt very very familiar. So, grain of salt: I may have some kind of baggage here.That said, this is a must-own for the serious P&P fan. As with any annotated edition, I wouldn’t recommend it for a first or even third reading of the book--these notes take up half-to-full pages, sometimes continuing to the next, and only if you’re already familiar with the text of the book itself can you spare attention to wander off down these other roads. Keep another straight copy of P&P around for when you just want to read the thing. Some footnotes are simple definitions, or style notes: some are mini-essays that include their own cited references. Spacks includes centuries of Austen scholarship in her notes, not just contemporaries, so points of view vary widely. There’s quite a smorgasbord of textual commentary to pick through, and you’re sure to find little tidbits that strike you as especially resonant or horrendously wrong and weird. Two tidbits I liked: first, a primary source. One note, in discussing the complicated British class system of the day, refers to a table constructed by one Patrick Colquhoun in his A Treatise on the Wealth, Power and Resources of the British Empire, in Every Quarter of the World (2nd ed., London, 1815, pp 106-107)--a table which lays out exactly where, for instance, Darcy stands in relation to the Bennett family. He’s in the “second class,” they’re in the fourth. Clearly people put a lot of time and effort into codifying and arguing about societal structure, status and behavior, and I think that would be a fascinating thing to read. Another note I lingered over involves Mr. Collins, a character we love to hate. Here's the upside of an annotated edition: I’d never bothered to give Mr Collins much of my attention, since he’s icky--but Spacks points out the oddity of a snippet that I'd always ignored before. In bidding Elizabeth farewell from Hunsford, Mr Collins apologizes profusely for the humbleness of his style of living, as if he considered her socially above him--and this is a complete 180 from his incredibly condescending proposal of marriage earlier in the book, where he deigns to presume he’s taking a burden from her parents by opting to support her. Also, Spacks has a lot to say about Elizabeth's inconsistency and lack of generosity towards Charlotte Lucas--traits I'd noticed in past readings without following through to some of their logical conclusions and their connections with Elizabeth's later behavior.Definitely worth the purchase price! Add it to your collection, but don't make it your only copy, since it's hard to tuck under your pillow."}, {"userName": "Richard Derus", "userReviewDate": "Jun 24, 2010", "userURL": "http://www.goodreads.com/user/show/3920693-richard-derus", "userReview": "Well-loathed books I've re-readRating: 4 very annoyed, crow-feathered stars out of fiveThe Book Report: No. Seriously. If your first language isn't English, or if you're like nine years old, you might not know the story. Note use of conditional. My Review: All right. All right, dammit! I re-read the bloody thing. I gave it two stars before. I was wrong-headed and obtuse and testosterone poisoned. I refuse to give it five stars, though. Look, I've admitted I was wrong about how beautiful the writing is, and how amusing the story is. Don't push.Stephen Sullivan, who rated this with six stars of five, is now on a summer travel break from Goodreads, so I can publish this admission: He was right. It is a wonderful book. I had to grow into it, much as I had to grow into my love for Mrs. Dalloway. But now that I'm here, I am a full-on fan.Deft is a word that seems to have been created for Austen. She writes deftly, she creates scenes deftly. She isn't, despite being prolix to a fault, at all heavy-handed or nineteenth-century-ish in her long, long, long descriptions. She is the anti-Dickens: Nothing slapdash or gimcrack or brummagem about her prose, oh nay nay nay. Words are deployed, not flung or splodged or simply wasted. The long, long, long sentences and paragraphs aren't meant to be speed-read, which is what most of us do now. They are meant to be savored, to be treated like Louis XIII cognac served in a cut-crystal snifter after a simple sole meunière served with haricots verts and a perfect ripe peach for dessert.The romantic elements seem, at first blush, a wee tidge trite. And they are. Now. Why are they? Because, when Miss Jane first used them in Pride and Prejudice, they worked brilliantly and they continue so to do unto this good day. Why? Because these are real feelings expressed in a real, genuine, heartfelt way, as constrained by the customs of the country and times. And isn't that, in the end, what makes reading books so delicious? I, a fat mean old man with no redeeming graces, a true ignorant lower-class lout of the twenty-first century, am in full contact with the mind, the heart, the emotional core of a lady of slender means born during the reign of George III.You tell me what, on the surface of this earth, is more astonishing, more astounding, more miraculous than that. Jane Austen and I Had A Moment. She's Had A Moment with literally millions of English-speakers for over 200 years. She's had moments with non-English speakers for more than a century. Elizabeth Bennet and Fitzwilliam Darcy are cultural furniture for a large percentage of the seven billion people on the planet. (Large here is a relative term. Less than one? Still amazing for a book 200 years old.)Reading is traveling in time, in space, but most importantly inside. Inside yourself, inside the characters' emotions, inside the author's head and heart. It is a voyage of discovery, whether you're reading some bizarro mess, Dan Brown's mess, religious tracts, Twilight, whatever. You-the-reader are going somewhere in a more intimate contact than you-the-reader have with any other being on the planet. Movies, TV, sex, none of them take you as deep into the essence of feeling and emotion as reading does. And no, snobs, it does NOT matter if it's well written, it matters that the book speaks to the reader. (Sometimes, of course, what one learns is how very shallow and vapid some people are...I'm lookin' at you, Ms. Fifty Shades.)So I thank that rotten, stinkin' Stephen-the-absent Sullivan, safe in the knowledge he won't see me admitting this, for reminding me to live up to my own goal of remaining open to change. I heard him yodeling his rapture, and I revisited the book, and I learned something valuable: Only admit you're wrong when the person you don't want to embarrass yourself in front of isn't around to see.\nThis work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License."}, {"userName": "Bookdragon Sean ", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/27788046-bookdragon-sean", "userReview": "Society, with all its restrictive constructs, is one nasty piece of work. It comes with so many silly rules, so many silly expectations. Those of social station and wealth must be seen to marry someone of the same “worth” regardless of the feelings involved; they must be seen to marry someone on their level of class structure. But what of love? What of passion? Should it be quenched because of these all-encompassing silly constructs? Austen doesn’t think so. Enter Darcy, a man who is royally pissed off; he has fallen in love with someone considered far beneath him, to declare his love for her is to step outside the realms of his supposed pedigree: it is a form of social death. So he is a man torn in two. At the route of things, he is a product of his society; consequently, he is affected by its values. Although he hates it all the same; thus, the long sullen silences, the seemingly moody and arrogant exchanges with Elizabeth. But it’s all the expression of a man struggling to deal with the raging tempest of emotions that have taken hold of his mind: his being. “In vain have I struggled. It will not do. My feelings will not be repressed. You must allow me to tell you how ardently I admire and love you.” Indeed, Austen slowly reveals the dangers of false perception as she gradually peels away the mask of this stoic pillar of aristocracy, and underneath blossoms a misunderstood and sensitive soul. So the romance plot is born. Elizabeth eventually loses her prejudice and sees through Darcy’s false pride. Darcy loses his integrated construct of prejudice and ignores the pride of his relatives. As ever with Austen, the title of the work is suggestive of the main motifs; she’s never subtle as its all ways clear which way her razor sharp sarcasm is pointed. So love conquers all. Austen was a strong advocate of social mobility, and often it’s based upon love in her works. But she only believes in real love. She’s not interested in fleeting moments of heat and sexual lust; she portrays true and lasting romantic attachments, relationships that are strong and real. For her, such things transcend class boundaries, wealth and intelligence. Love is love. It doesn’t matter who it is with as long as it is real; hence, Austen becomes a critique of society and its customs that prevent these relationships from being realised. She knows how stupid it is, and she loves to poke fun of her caricatures of the old stilted class of her era: the ones that resist her ideas.  Is this the best Austen? I did really enjoy this book, and I have given it five stars, but it’s not as good as her other works. For me it lacks the moral growth of  Northanger Abbey  and Emma.It lacks the conciseness of Persuasion. The emphasis on the injustice of romance has made it popular, though I do strongly believe that the love in Persuasion is stronger than it is here. That endures rejection, separation, war and decades; yet, it still lingers. I love Austen, and I have loved each one of her books I’ve read so far in different ways. I hope to continue to do so. This is the fourth Austen I’ve given five stars, I can easily celebrate her as one of my favourite writers."}, {"userName": "Ana ", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "“We are all fools in love.” \nWhy have I not read this sooner?I must admit, I didn't initially understand all the fuss surrounding this novel. I did not understand why so many millions of readers love it. It seemed to me they were all a bunch of romantic fools. Now that I am 'one of them', I can report back that the Pride and Prejudice fandom is actually full of normal people who care passionately about the characters.I instantly fell in love with the story and its amazing characters. Marvellous, magnificent, superb, delightful... Just some words to describe how great this novel is. I’m so damn sick and tired of hearing about 'alpha males' and how women just love them and how 'they're so hot'. I love beta men/nice guys.It's refreshing to read about a hero who doesn't have to use foul language and violence to get attention and power. \nMr Darcy is a gentleman. He is intelligent and wellinformed, competent, cool-headed, strong, yet silent. He is also arrogant and prideful. Hey, nobody's perfect. He suffers from a social shyness and awkwardness that is received by others as rudeness. \nMr. Darcy stands the test of time because he recognizes Elizabeth as an equal, he is not threatened by her intelligence and outspoken personality. In fact, Darcy appreciates all those traits.They're such different people but alike in many ways. He and Elizabeth have such respect for each other, and I think that's what makes the romance in Pride and Prejudice such a success. \n\nAnd now I'm just going to compare every man to him and basically, I'm ruined forever. FOREVER.\nAnd let's not forget his estate. \nSure, Mr Darcy has his issues and his flaws (so many times I wanted to scream at him and Elizabeth to get over themselves and talk already, I mean come on just get together already good grief this is ridiculous).Antigone, Annabeth Chase, Arya Stark, Scout Finch, Clarice Starling and Scarlett O'Hara are pretty much guaranteed on any of my favourite heroines lists and now I can add Elizabeth Bennet to that list too. Elizabeth is such an admirable heroine. And boy is she one smart tough cookie. She stands up for herself and those who matter to her, she loves to read and she thinks for herself. She is a woman far ahead of her time. If you haven't read this yet, read it now. It's a wonderful book, easy to read, even though it was published in the early 19th century. It will play on your emotions, and it will make you think. Well done, Miss Austen. \nNice try, sir. But you're no Mr Darcy. \nThis never happened in the book but I couldn't help myself."}, {"userName": "Anne", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Mr. Darcy...*swoons*First, we need to clear something up. Colin Firth is the only Mr. Darcy.That other Mr. Darcy was horrible! No, no, no, no, nooooo!Make it stop. Make. It. Stop. Tell the bad man to go away, Mommy!So, quite obviously, the BBC miniseries (in all its 327 minute glory) is the only version that is acceptable. The other movie was such a travesty to this book, that I wept big, fat, angry tears...like the spoiled brat that I am. Or maybe I'm exaggerating slightly. What were they thinking?! You don't mess with perfection!What did you think, Elizabeth?Exactly.Anyway, instead of reading it this time around, I listened to an audio book version. Apparently, which audio version you listen to makes a difference.My real-life BFF said her version had an American \ndoing British accents\n, and she found it terribly annoying. I, however, had a version with an actual lady from the land of tea 'n crumpets, and she did a fine job. Well, she did have this lounge singerish voice, so instead of sounding like a fresh-faced 20 year old, Elizabeth sounded like she had been smoking 3 packs a day for about 40 years.Eh, I was ok with it. I kept imagining Lizzie with a cigarette dangling from her lips like a truck stop hooker, and it gave the story a fresh perspective.I've read this so many times over the years that I've lost count, but I still wish I could go back and read it for the first time all over again. I hated that stupid, arrogant, arse-faced Mr. Darcy when he first showed up at the ball. Ugh. What a prick!So, just like Lizzie, I remember being shocked at his proposal. And just like Lizzie, I was horrified by the way he dissed her family while he did it!And how could he think she would ever agree to marry him after the way he convinced Bingley that Jane didn't love him?! And the way he treated poor Wickham!Just who did this guy think he was! But then...The Letter!Oh, my! Well, that certainly put a different spin on things didn't it?!Elizabeth & I were so ashamed that we had judged him so harshly.*hangs head*And the way he acted toward us when we met near the lake!So kind...such a gentleman!Ok, I've probably read that particular scene (at Pemberley) a million times. Sometimes, I would just pick up and start the book from there. Total comfort food.It's just...ahhhhhhhhhhh.Of course, Lydia has to go and ruin everything! How could she be such a stupid, selfish, uncaring twat!? Grrrrrrr!*strangle, strangle, strangle*How will Darcy and I...I mean, Darcy and Elizabeth...manage to get their Happily Ever After?Feelings! Oh, the feelings!So. Yes, I'm unashamed to admit that I am that cliché of a woman who loves Pride and Prejudice. Unashamed! I just...{insert fangirl screaming and crying}*Throws panties at Mr. Darcy*"}, {"userName": "karen", "userReviewDate": "May 27, 2009", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "it is official: now everyone on the planet has read this book. i was the last holdout, and being the last person (excluding those who are just being born...... now) i am sorry i didn't like it more. i knew going into it that i was not a jane austen girl; i had read two others and thought them bloodless and mercantile. but everyone said to me, \"well, you haven't read pride and prejudice is why you don't like her.\" which i thought might be valid. but it's not. because i still don't care. this is not the greatest love story of all time. it's more like the most amiable alliance of compatible feelings that ends up in a mutually agreeable union and merging of fortunes and temperaments. i mean, really. this book needs heathcliff to come barreling in on a stallion all wet from the moors to ravish all five of these daughters and show them what a real man is all about. now there's a love story..."}, {"userName": "Sherwood Smith", "userReviewDate": "Oct 18, 2008", "userURL": "http://www.goodreads.com/user/show/162084-sherwood-smith", "userReview": "Some years back in one of my APAs, someone castigated Jane Austen's books like this: \"All those daft twits rabbiting on about clothes and boyfriends and manners.\"Since then, I’ve encountered other variations on the theme that a modern woman ought not to be reading such trash because it sets feminism back two centuries.Well, much as I laughed over the first caveat, that isn't Austen. It sounds more like the silver fork romances inspired by Georgette Heyer. Austen's characters don't talk about clothes at all, outside of air-headed Mrs Allen of Northanger Abbey, who doesn't think of anything else. Austen sticks her satiric quill into young ladies who think and talk about nothing but beaux, such as poor, luckless Anne Steele in Sense and Sensibility. Manners are emphasized but not manners without matter; Austen saves her spikiest irony for hypocrites.I think it's important to remember that whereas Heyer was writing historical romances in the silver fork tradition, Austen was writing novels about contemporary life, especially the problems facing young women in her own walk of life, the country gentry. She criticized herself in a much-quoted letter to her sister Cassandra, saying in effect, 'the problem with Pride and Prejudice is it's too light and bright and sparkling.' Many have misinterpreted this remark. It seems to me, on close reading of her elsewhere, that she meant the novel to be taken more seriously than it was.What is it about, really? It's about the wrong reasons for marrying, and how those can affect a woman for the rest of her life. Of course a hard-line feminist can point out that novels about marriage are hideously retro for today's woman, who has many choices before her. During Austen's time, marriage was the only choice a woman had, unless she was rich enough to shrug off the expectations of her society, or unless she was willing to live on as a pensioner to some family member or other, which more often than not meant being used as an unpaid maid. Of course there was teaching, but the salaries for women were so miserable one may as well have been a servant. The hours and demands were pretty much equal.If one looks past the subject of marriage, the novel's focus is about relationships: between men and women; between sisters; between friends; between family members and between families. As for marriage, Austen sends up relationships that were formed with security as the goal, relationships that were sparked by physical attraction and not much else, relationships made with an eye to rank, money, social status, or competition. And, with abundant wit and style (or as she’d say, with éclat), she offers some truths about the differences between love and lust, and what relationships based on either mean to a marriage months—or decades—after the wedding.The fact that Austen doesn't use modern terminology doesn't make it any less real than a contemporary novel that has a supposedly liberated woman romping from bed to bed for forty pages while in search of the perfect relationship. The message is the same, that women who mistake falling in lust for falling in love are usually doomed to a very unhappy existence. And in Austen's time, you couldn't divorce, you were stuck for life.I've had dedicated feminist friends give me appalled reactions when I admit to liking Austen. I don't consider reading Austen a guilty pleasure, as I do reading Wodehouse. I consider Jane Austen a forerunner of feminism. She doesn't stand out and preach as Mary Wollstonecroft did. Her influence was nevertheless profound. Again and again in those novels she portrays women thinking for themselves, choosing for themselves—even if their choices are within the conventions of the time. What the women think matters.In Austen’s day (and too often, now) female characters were there as prizes for the men to possess, or to strive for, or as catalysts for male action. These days we call them refrigerator women. Jane Austen gave her female characters as much agency as a woman could have in those days, and the narrative is mostly seen through their eyes.The famed relationship between Elizabeth Bennet and Mr. Darcy makes it very clear that they were first attracted by one another's intellect—those two were clearly brain-snogging before they ever got to the fine sheets of Pemberley. It is also clear that the man—his higher social and economic status notwithstanding—had to earn the woman's respect, and rethink some of his assumptions, before she could see in him a possible partner. There is no dominant male making the decisions: those two are equal right down to the last page, and Austen makes it clear that it will continue to be so after the marriage. Each time I reread the novel, I notice something new, but in the meantime, will I continue to recommend it to young women just venturing into literature? You bet."}, {"userName": "Starjustin", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/61242604-starjustin", "userReview": "Well, I finally finished this classic novel, by Jane Austen, set in the 18th century, and I have to say it was worth all the time I took to read it. I absolutely loved the main characters, the humor, and most of all the romance. I watched the movie and loved it also, but the book is much more detailed and descriptive. Definitely a favorite! I highly recommend it to everyone. You won't regret reading this one. 🐦"}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Mar 06, 2014", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "I am so genuinely surprised at the positive experience I had reading this book! I had so much fun reading it and can now understand why people love it so much :3 Let's be real this deserves 5 stars <3Around the Year in 52 Books Challenge Notes:- 9. A book mentioned in another book"}, {"userName": "Ahmad Sharabiani", "userReviewDate": "Jun 07, 2008", "userURL": "http://www.goodreads.com/user/show/614778-ahmad-sharabiani", "userReview": "938.\tPride and Prejudice, Jane AustenPride and Prejudice is a romantic novel by Jane Austen, first published in 1813. The story charts the emotional development of the protagonist, Elizabeth Bennet, who learns the error of making hasty judgments and comes to appreciate the difference between the superficial and the essential. عنوان: غرور و تعصب - جین اوستین (نشر نی، بنگاه ترجمه و نشر، زرین، ) ادبیات انگلسان؛ تاریخ نخستین خوانش: سال 1974 میلادیعنوان: غرور و تعصب؛ اثر: جین اوستین (آستین)؛ مترجم: شمس الملوک وزیری؛ مشخصات نشر: تهران، بنگاه ترجمه و نشر کتاب، 1336، در 661 ص، زیر نظر: احسان یارشاطرمترجم: شاهرخ پورانفر، تهران، زرین، 1362، در 536 صمترجم: رضا رضایی، تهران، نشر نی، 1385، در 449 صداستان را جین آستین در سن بیست و یک سالگی و در سال 1796 میلادی بنوشته است، و برای نخستین بار در سال 1813 میلادی چاپ شده؛ و در ایران به سال 1336 هجری خورشیدی با ترجمه ی بانو: شمس الملوک وزیری، به زیور طبع آراسته گشته است. آقا و خانم بنت پنج دختر دارند: جین، الیزابت، لیدیا، مری، کیتیا. جین و الیزابت بزرگتر و زیباتر از سه خواهر دیگر خویش هستند. مردی سرشناس و ثروتمند به نام: چارلز بینگلی، در باغ خویش، و در همسایگی آنها زندگی میکند. او بسیار مهربان و خوش چهره است. خانم بنت کوشش میکند مرد جوان یکی از دخترانش را به همسری خویش برگزیند. و ... ادامه داستان؛ ا. شربیانی"}, {"userName": "Otis Chandler", "userReviewDate": "Oct 10, 2006", "userURL": "http://www.goodreads.com/user/show/1-otis-chandler", "userReview": "So the other day Elizabeth and I are in the book store and she saw this book, and said she really wanted me to read it. In horror at the thought of reading what I thought was a 'chick book', i immediately countered that she would then have to read one of my favorites: Dune. She agreed!So I read it, and I have to admit, it was good - damn good. Even though there was a serious lack of any gratuitous violence, I tore through it in several days. Austen is an amazing writer, and has a particular talent for explaining her characters deep motivations (or prejudices) in a few defining sentences.I think my favorite part of it is the unwinding of Elizabeths' prejudices against Mr Darcy. It is done so slowly and artfully and believably that the reader is completely pulled into the story.  It is a definite period piece - here are a few funny observations:- Nobody in the book had a job - they all earned income from their estates- Since nobody had jobs they spent all day gossiping- People were judged not by what they did for a living but what family they were from and how they behaved in society. Completely different from today!- Dating was much tougher back then. You needed at least 10 dates to get anywhere, and you probably had to marry in order to go all the way.Jokes aside, this is a classic, and I highly recommend it for any guy or girl."}, {"userName": "Jasmin", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/3284904-jasmin", "userReview": "\"I cannot fix on the hour, or the spot, or the look, or the words, which laid the foundation. It is too long ago. I was in the middle before I knew that it had begun.\" This was Mr. Fitzwilliam Darcy's reply when Ms. Elizabeth Bennet asked him when he fell in love with her. Pride and Prejudice by Jane Austen had put my left out dictionary into good use. I have to admit, I was very slow in the first pages, however, nearing the end, I was like a driver going at 100mph, eager to reach the finish line.At the first pages, I have to admit I was frustrated, for Jane Austen had called her characters Miss Bennet, and I must duly mention that there are five Miss Bennets. And the use of various nicknames, confused me more. I thought Elizabeth and Eliza and Lizzy are different persons. So, I put a book guide into good use as well. I must also mention my despise of Mrs. Bennet. I hated her more than anyone in this novel. She has no talent in being a mother whatsoever and have no notions of leading her daughters in the right path. The only thing that matters to her is the marrying of her five daughters. After the misfortune of Lydia running away with Wickham, she was frivolous as to forget the elopement as soon as news of marriage were ensued. She considered the hunting for a wedding gown, the most of her problems. I've never seen a woman as fickle-minded as her and no one as blinded to riches than her. Nor do I have a desire to meet one.Lydia Bennet, is another matter. She is selfish and insensitive as anyone can get. I have to mention this, to unload the hatred in my chest.How Jane and Elizabeth turned out to be well bred is a wonder, considering the type of mother they are born with.But enough of what I hate of the book, because it will soon be forgotten, and all but the love of Mr Darcy for Elizabeth would remain.This is a genuine love story. I've fallen in love with Mr Darcy. He wanted to change his ways for his beloved Elizabeth. He helped her in so many ways and he needed no credit for it. For him, it was enough that he knew he helped her. He also hid his love for her for so long, its endearing.No part of the book was useless. All were vital for the fruition of Mr Darcy and Ms Bennett's love story. As you go deeper in the book, all pieces come together, like a puzzle, slowly making meaning.Indeed, Ms. Elizabeth Bennet is lucky, to have loved and to be loved in return. Despite the troubles their love had to endure, it was victor in the end. ♥"}, {"userName": "Bill  Kerwin", "userReviewDate": "Jul 26, 2007", "userURL": "http://www.goodreads.com/user/show/83582-bill-kerwin", "userReview": "A quintessential novel of manners. Fine moral intelligence and subtle psychological insight expressed in a straightforward, epigrammatic style. I read it for the first time forty years ago, and I am still half in love with Eliza Bennet."}, {"userName": "Miranda Reads", "userReviewDate": "Mar 01, 2018", "userURL": "http://www.goodreads.com/user/show/71848701-miranda-reads", "userReview": "To summarize: Mister. Darcy. *cue the long, sustained high-pitched squealing *This was truly as glorious as I remember. Every time I reread this novel, I love it more.  \nThe \nromance\n, the \nhigh society\n, the \nwitty banter.\n Gah. I just adore it all. \n\"And your defect is to hate everybody.\"\"And yours,\" he replied with a smile, \"is willfully to misunderstand them.\"\n Elizabeth Bennet  (second eldest of the five Bennet sisters) is the one with a  clear, level head.  Jane is the beautiful one, Mary is the look-at-me-I'm-so-pious one, Lydia is the I'm-so-dumb-that-I'm-probably-going-to-get-murdered one and Kitty is the well-she's-just-kinda-there one. Now, back in the day...there was one, singular goal for all women above the age of 16. GET YOURSELF A MAN  before you reach 25 and become a \nSPINSTER\n *cue high-society ladies fainting*. \n\n Mrs. Bennet (their mother) has taken this so completely to heart that she thinks of nothing else. After all, \nIt is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.\n Mr. Bingley and Mr. Darcy moved into town and immediately Mrs. Bennett set her dasterdly plans in motion (on behalf of her mortified children). She will do whatever necessary to get a rich man to put a ring on it (oh Beyonce, your words are applicable in any century).\nA lady's imagination is very rapid; it jumps from admiration to love, from love to matrimony in a moment.\n Only, there is a snag in her otherwise flawless plans. Elizabeth is not going to roll over to whatever man is thrust her way. To her mother's ever-living-disappointment, Elizabeth has all the spunk and backbone of a truly glorious woman: \nI could easily forgive his pride, if he had not mortified mine.\n Truly a great read, no matter the century.Plus Jane Austen is totally my soul sister.\nI declare after all there is no enjoyment like reading! How much sooner one tires of any thing than of a book! -- When I have a house of my own, I shall be miserable if I have not an excellent library.\n\nAudiobook CommentsAs with most old-timey books, It is far easier for me to listen to them than to read them. I like hearing the odd phrases and ancient unused words much more than struggling through the hard copy. I really enjoyed this audiobook and the narrator did a fab job of characterization."}, {"userName": "Peter Meredith", "userReviewDate": "Oct 24, 2011", "userURL": "http://www.goodreads.com/user/show/4988481-peter-meredith", "userReview": "18 chapters in... I want that to sink in for a moment... ok. 18 chapters in and NOTHING has happened. I am enjoying her writing style very much, but I also enjoy the back of an occasional cereal box so that may not mean much. We will see.I am sitting here eating a tootsie roll, a Halloween left over, and I can't help notice the similarities between it and the novel Pride and Prejudice. First off, like P and P, the tootsie roll wasn't one of those dinky ones that you can almost swallow in a single bite so you know that I've been at this for a while and now that I finally got it down, I have to wonder why I put it into mouth to begin with. Secondly, tootsie rolls are a throwback to another age, there are far better candies out there and the 36 wrappers littering the floor will attest to this. You have to really like tootsie rolls to appreciate them. I don't.Pride and Prejudice is the dullest most wonderfully written book that I have ever read. I read it simply to get a feel for the author's fantastic ability at arranging words, and really I mean it when I say, oh what wonderful blather.I give the book one star. After 62 chapters, there is nothing that happens. There is barely a story to the story, at least not one that could be remotely interesting...even to people who like romance. In the age of bodices, there is nary a one that is ripped open, let alone one that is undone with the gentle exploring fingers of a lover. And then there is the hubbub over the book...Satirical? A witty comedy of manners? Sure, I smiled a few times at the only funny character in the book, Mr. Bennett, but overall, I read, studied the sentence structure, noticed the wall paper and waited patiently as the paint dried. Even the dramatic ending where Lizzy gets the guy, is a letdown and dull. Just to let you know, I was joking about it being in any way dramatic. Which brings me to the characters. Other than Lizzy, they are all stereotypical and lack even the most remote concept of depth. Jane is pretty and sweet from the first page to the last. The mom is overbearing, the dad aloof. Other than Darcy, no one grows or changes in a book that spans a few years and endless pages.Normally, I use one star for books that I just can't finish and if I wasn't an aspiring author, I wouldn't have bothered to get through half the book, but since I did... and when I compare it to yawner like A Tale of Two Cities, I had to bump this one up a notch.PS, Don't read Moby Dick either, if you know what's good for you."}, {"userName": "Lizzy", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/30575403-lizzy", "userReview": "Just a few words to express how I loved Jane Austen's Pride and Prejudice. So much has already been said, that I feel almost redundant. 'Pride and Prejudice' for me is above all about women’s choices in marriage, or the possibility of love versus choosing for money or social position. During Austen's time, marriage was the only option a woman had, except if she was rich enough to disregard the expectations of society; except if she was willing to live as a poor relation, which usually meant being used as an unpaid servant. Of course, there was always the option of becoming a governess, but that represented not only miserly wages, even worst it implied becoming barely respectable and existence in an ambiguous class oblivion of social invisibility and no autonomy. What could be worst? Thus, let’s not criticize Austen’s contemporaries who saw marriage as their only choice, let’s even try to understand Mrs. Benet predicament:\n”If I can but see one of my daughters happily settled at Netherfield,” said Mrs. Bennet to her husband, “and all the others equally well married, I shall have nothing to wish for.”\nBut we have to remember that woman’s necessity was not one-sided:\n It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.\nBut, alas, that has probably been said before. What else can I mention here? That Jane Austen was ahead of her time, and her heroine, the witty and charming Elizabeth Bennet, makes us fall in love with her by her accurate view of the world: \nThere are few people whom I really love, and still fewer of whom I think well. The more I see of the world, the more am I dissatisfied with it; and every day confirms my belief of the inconsistency of all human characters, and of the little dependence that can be placed on the appearance of merit or sense.\nAnd let’s not forget Mr. Darcy, for I am a romantic at heart, and he conquered me with his truthful statement, and even more crucial for me, ended up changing for Elizabeth:\nIn vain have I struggled. It will not do. My feelings will not be repressed. You must allow me to tell you how ardently I admire and love you.\nWhat I most liked about Elizabeth and Darcy’s relationship is that it is not a simple romantic tale, but I loved how they overcome his pride and her prejudice and grow up gradually from a mutual antipathy to an understanding. And that does not happen overnight but over a period of over a year.All this, and much more if I wished to be even more redundant is what makes this novel so popular and enduring. It was refreshing to have a story that despite questioning prevailing values makes us smile. Highly recommended.____"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Sep 28, 2015", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "I know we're all here for this: But I just love EVERY single character so much. The entire Bennet family is hilariously perfect -- I even have this weird fondness for Mr. Collins. Pride & Prejudice retellings will forever be my favorite because there's just so much you can do with these characters.Has anyone written a decent book from Bingley's perspective? Pretty sure he's actually my favorite Austen guy..."}, {"userName": "Nandakishore Varma", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "If somebody had told me that I'd love a romance before I read this book, I would have laughed derisively.In my late teens, romance was just not my cup of tea: it was meant for (yechch!) - girls. I was happily reading about those brave and hardy men who blew up German castles (during World War II) and evil Communist strongholds (after the war). The only women in those books were beautiful spies or dangerous adventuresses.A few years later, my aunt pointed me to this book, after I had rather enjoyed an adaptation of it on Doordarshan (the Indian TV channel). I opened the book, read the first couple of sentences, and was hooked.\nIt is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.However little known the feelings or views of such a man may be on his first entering a neighbourhood, this truth is so well fixed in the minds of the surrounding families, that he is considered the rightful property of some one or other of their daughters.\nBy God! You can't be more true to life than this...[personal interlude] Scene: Myself at a marriage reception, strutting about rather proudly having recently landed a job.Mother calls: \"Nandu! Come here for a moment.\"I go rather reluctantly, because I know what is about to transpire. It is like I dreaded: there is another female with mother. My mother presents me to her proudly.The lady looks me over with an appraising eye, and my knees are already weak.She says in a wondering tone: \"My! How tall your son has grown!\" (I'm all of five-feet-six-and-a-half inches.) \"When I last saw you (this to me) you were only so tall...\"(and she holds her hand the appropriate height from the floor. This is not surprising, because when she last saw me, I was only five years old.)She turns to my mother, and says the dreaded words: \"He's employed now. Isn't it time he settled down?\"Uh...oh. I sidle away, because I know what's coming next: she knows of a \"nice girl\" who would be the perfect match for me...[end of interlude]Oh, Mr. Bingley and Darcy, I sympathise with you from the bottom of my heart!***Elizabeth Bennet was the first girl I hopelessly fell in love with. Unfortunately for me, she existed only on the pages of a book, so my love was doomed from the start.***\n\"...Happiness in marriage is entirely a matter of chance. If the dispositions of the parties are ever so well known to each other or ever so similar beforehand, it does not advance their felicity in the least. They always continue to grow sufficiently unlike afterwards to have their share of vexation; and it is better to know as little as possible of the defects of the person with whom you are to pass your life.\" - Charlotte Lucas.\nBeing married to the same wonderful woman for more than twenty-three years, whom I did not know at all before our marriage was arranged, I can vouch for the veracity of the above statement.***Wonderful book. Read it!"}, {"userName": "Paul Bryant", "userReviewDate": "Sep 27, 2007", "userURL": "http://www.goodreads.com/user/show/416390-paul-bryant", "userReview": "Revived review to celebrate the 200th anniversary of the death of Jane Austen. Go Jane - like a cute little tortoise you have outlasted all of those bustling hares.****It is a truth which I would like to see universally acknowledged, that no one voluntarily reads any 19th century novels unless they are by Jane Austen. I fear that modern readers think all these Radcliffes, Disraelis, Eliots, Gissings and so forth tolerable, but not handsome enough to tempt them, or even, that they are most disagreeable, horrid books, not at all worth reading. They look at them without admiration at the library. They tell me they are all too long, but for my own part, if a book is well written, I always find it too short. But it is particularly incumbent on those who never change their opinion, to be secure of judging properly at first, lest it be considered prejudice. Such perseverance in wilful self-deception! In vain I have struggled to tell them about Thackeray, Dickens and Bennett. It will not do. Somewhere they have formed the groundwork of disapprobation on which succeeding events have built so immovable a dislike; and I firmly believe that Moby Dick is the last book in the world that they could ever be prevailed on to read. The modern reader is so well disposed towards those who are in interesting situations, that a young person, who is either a vampire, or a zombie, is sure of being kindly spoken of. Well, well. One half of the world cannot understand the pleasures of the other. My idea of good company is the company of clever, well-informed dead people who have a great deal of conversation; that is what I call good company. Laugh as much as you choose, but you will not laugh me out of my opinion."}, {"userName": "Rosianna", "userReviewDate": "Jan 01, 2008", "userURL": "http://www.goodreads.com/user/show/731288-rosianna", "userReview": "I'm a great believer in the idea that if anyone didn't like this book it's because they didn't read it properly and/or are possessed. In all seriousness, the wit is timeless and Austen should always be remembered as a literary genius, as I hope she will."}, {"userName": "Helen Ροζουλί Εωσφόρος   Vernus Portitor Arcanus Ταμετούρο   Αμούν Arnum", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/20643658-helen-vernus-portitor-arcanus-arnum", "userReview": "Ενα βιβλίο που γράφτηκε το 1797 με τον τίτλο « Πρώτες Εντυπώσεις», αναμφίβολα αντιπροσωπευτικός, διότι και οι δυο πρωταγωνιστικοί χαρακτήρες εντυπωσιάζονται λανθασμένα ο ένας για τον άλλον και χάνουν πολύτιμες στιγμές ανάμεσα τους ορμώμενοι απο φαινομενικά μειονεκτήματα και παρεξηγήσεις. Όταν εκδίδεται το 1813 το βιβλίο τούτο έχει τον ακόμη πιο εύστοχο τίτλο « Περηφάνεια και Προκατάληψη ». Δυο βασικά χαρακτηριστικά των πρωταγωνιστών μας αναμειγνύονται με το πάθος και τη λογική και αποτελούν ανασταλτικούς παράγοντες για την μοιραία σχέση τους. Μέσα από μια πολυεπίπεδη ανάλυση και βαθιά περιγραφή των χαρακτήρων η ευφυΐα της Όστεν παρουσιάζει με θάρρος, πάθος, σάτιρα και οξυμένο κριτικό πνεύμα την κοινωνία της Αγγλίας τον 18ο αιώνα. Είναι περισσότερο μια ψυχολογική ανάλυση της μικροαστικής αντίληψης των ανθρώπων της εποχής για τον έρωτα, το γάμο, τα ήθη, τις ταξικές διαφορές, τις περιουσίες που κρίνουν τα πάντα και τις αρετές που πρέπει να υπάρχουν ή απλά να φαίνονται στην ανθρώπινη φύση. Φυσικά, το έργο διαπνέεται ελλειπτικά απο ποικίλα προσωπικά συναισθήματα των χαρακτήρων και μπορεί άνετα να καταχωριστεί στην ρομαντική κλασική λογοτεχνία. Έχουμε μια ιστορία αγάπης που γεννιέται και προσπαθεί να μείνει αναλλοίωτη μέσα σε μια ανδροκρατούμενη κοινωνία με πολλές κοινωνικές συμβάσεις και προκαταλήψεις. Η Ελίζαμπεθ, πανέξυπνη, ετοιμόλογη, διορατική, τρυφερή, θαραλλέα και πρωτοπόρα παλεύει να χρωματίσει με πάθος και αξιοπρέπεια τη θέση της στην κοινωνία. Ο κ. Ντάρσυ, με την μεγάλη περιουσία και την ακόμη μεγαλύτερη αλαζονεία, γίνεται εξ αρχής το πρότυπο του δυναμικού άνδρα που μιλάει ελάχιστα μα σκέφτεται πολύ, που περιφρονεί και κατακρίνει, που αδιαφορεί για τα πάντα και εκφράζεται με απόλυτη καυστική ειλικρίνεια. Ειναι ο σνομπ ερωτεύσιμος άνδρας που προκαλεί δέος και αντιπάθεια, φαινομενικά. Στην ουσία όμως ακολουθεί την καρδιά του, αγαπάει βαθιά, απόλυτα και αληθινά. Κοινωνική σάτιρα, κοινή και καυστική κριτική εποχής, αγάπη, ανταλλαγές απόψεων, ιδεών και συμπεριφορών δημιουργούν και προωθούν την πλοκή της ιστορίας.Κάπου μακριά και έμμεσα ο αναγνώστης αντιλαμβάνεται έντονα τα συναισθήματα των ηρώων καθώς δεν εκφράζονται άμεσα, απλώς αναλογούν σε αντίστοιχες οξυμένα πνευματικές και ευαίσθητα ψυχολογικές επάρκειες για τον κάθε χαρακτήρα. Ύφος απλό και λιτό. Ελάχιστες περιγραφές. Πολλοί διάλογοι που οικοδομούν τους χαρακτήρες με ρεαλισμό και αποδίδουν άρτια μηνύματα και συμπεράσματα σχετικά με την αποδοχή λαθών που θα γίνονται πάντα στην ανθρώπινη φύση μα και την ευτυχία που αξίζει να απολαμβάνουμε κάθε στιγμή της ζωής μας. Καλή ανάγνωση Πολλούς ασπασμούς."}, {"userName": "Jason Koivu", "userReviewDate": "Nov 22, 2008", "userURL": "http://www.goodreads.com/user/show/1742824-jason-koivu", "userReview": "Will I read Pride and Prejudice again? Yes, a thousand times, yes!Near perfection! P & P is one of those rare gems that weds character, plot and language all in one harmonious marriage. Austen's plotting is so very precise here. It's an absolute pleasure to behold. The timing is impeccable and there is very little, if any, fat in the prose to slow it down. Finding new clues to future plot twists and turns with each reread has reached the level of a sport for me now! They say, write what you know. Austen knew the life of the upper class (more precisely, the lower ranks of the upper class). She knew all about sitting around in parlors waiting to one day possibly be wed. She knew the rules of engagement that her class and gender imposed upon her. And so she wrote about those things and wrote well, weaving complex love triangles in a realistic, down-to-earth style. Some readers, often American, complain that Austen's work is tedious and unimpassioned. They are annoyed by characters that do not speak out or act when action would resolve the problems that arise in the social situations that make up the basis of Austen's stories. They lose sight of the fact that the early 19th century is not early 21st. Heck, it's not even the same country. To some living 200 years after Austen published, these sensibilities do not readily make sense. You must understand that the basis of Austen's writing is founded upon the mores of her time.What makes P & P  so exciting and intriguing is that our protagonist does push back, she does speak out. She does all those things we modern day readers wish she'd do. You just have to read very carefully to see it all happening. It's occasionally quite subtle, but it's there. A familiarity with early 19th century England, its language and customs will help unveil this novel's beauty and brilliance.While I would not have wanted to be a woman living then, essentially tied down and utterly reliant on a wealthy man's whim for my happiness or even salvation, I try to at least enjoy the spectacle of something absolutely foreign to the way I live. Watching these people in the midst of arguing or courting is much like watching the controlled chaos of a boxing match. The principle parties are dueling like fighters looking to beat the crap out of one another, yet under strict rules by which they are bound. Break the rules and you may be disqualified. The constraints these people put themselves under in the name of civility may seem fanciful to us outsiders, but for a woman whose very livelihood depended on winning this bizarre game, it was very real.(Reviews of film and television adaptations to come!)"}], "description": "\"It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.\"With this sweeping generalization, Pride and Prejudice begins, and whether or not you agree with Mrs. Bennet's premise in Jane Austen's classic novel, you have to read on. Originally written in 1797 under the title First Impressions, this is the story of the romantic and ideological sparring of the spirited, vibrant Elizabeth Bennet and the egotistical Mr. Darcy. But it is also a comedy of manners, a caricature of English society depicted in the microcosm of the Bennet family. Here is a courtship farce that takes place through a series of letters, ballroom flirtations, and parlor discussions. Austen's forte was her portrayal of women—they are the most dynamic and believable characters in the book. And though it is an eighteenth-century English family she captures on the page, her story of love and ideals is universal. Reprinted faithfully from the first London edition of the work, this volume also includes critical essays by Virginia Woolf and Julia Prewitt Brown. --jacket flap", "title": "Pride and Prejudice", "url": "https://www.goodreads.com/book/show/3084664.Pride_and_Prejudice_", "average": 4.25, "cover": "https://images.gr-assets.com/books/1267764997l/3084664.jpg", "reviews": 52733, "authors": [{"url": "https://www.goodreads.com/author/show/1265.Jane_Austen", "name": "Jane Austen"}, {"url": "https://www.goodreads.com/author/show/6765.Virginia_Woolf", "name": "Virginia Woolf"}, {"url": "https://www.goodreads.com/author/show/44961.Julia_Prewitt_Brown", "name": "Julia Prewitt Brown"}], "type": ["Classics", "Fiction", "Romance", "Historical", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/3084664-pride-and-prejudice", "http://www.goodreads.com/book/show/1885.Pride_and_Prejudice", "http://www.goodreads.com/book/show/437125.Pride_and_Prejudice", "http://www.goodreads.com/book/show/10515068-pride-and-prejudice", "http://www.goodreads.com/book/show/18300267-pride-and-prejudice", "http://www.goodreads.com/book/show/636831.Pride_and_Prejudice", "http://www.goodreads.com/book/show/7893001-pride-and-prejudice", "http://www.goodreads.com/book/show/1886.Pride_and_Prejudice", "http://www.goodreads.com/book/show/12483496-pride-and-prejudice", "http://www.goodreads.com/book/show/1775860._", "http://www.goodreads.com/book/show/1893.Pride_and_Prejudice", "http://www.goodreads.com/book/show/84979.Pride_and_Prejudice", "http://www.goodreads.com/book/show/4615.Pride_and_Prejudice", "http://www.goodreads.com/book/show/20446282", "http://www.goodreads.com/book/show/14935.Sense_and_Sensibility", "http://www.goodreads.com/book/show/6969.Emma", "http://www.goodreads.com/book/show/2156.Persuasion", "http://www.goodreads.com/book/show/45032.Mansfield_Park", "http://www.goodreads.com/book/show/50398.Northanger_Abbey"]}