{"ratings": 7703, "userreviews": [{"userName": "Nildene", "userReviewDate": "Dec 20, 2017", "userURL": "http://www.goodreads.com/user/show/46076161-nildene", "userReview": "I have yet to read the original PPZ, my luck having meant that I can never find a copy myself so this review is much less a comparative one than it is a grasping at straws to find something enjoyable about it.Of course, I have to begin with what was this graphic novel’s most redeeming quality; the small parts of quick wit and humour. This essentially meant that I would make this rating 3 stars rather than 2.I emphasise small parts, as I found sometimes this fell flat due to the formatting of the graphic novel itself. I didn’t understand a lot of the random use of bold within dialogue. Of course, I understood it for dramatic effect but when it is used for one word within a sentence but has no direct correlation with a form of wit or humourous quality, it only led me to confusion.But overall, the graphic novel was tolerable.I was not a fan of the artwork most of the time. Some pages were fully sketched out and sections of art seemed unfinished, with little detail applied to them. This unfinished quality was understandable when figures were “in the distance” within a frame, but also led to confusion because those distant figures resembled the faint figures of zombies.And the fact that the entire book was set in black and white also meant hat it took forever to finally understand who was who. Darcy and Bingely are drawn with similarities that confused me, as did Jane and Elizabeth’s characters – the only defining feature with those two sisters were their hair!With the popularity of this PP parody, you would assume that there’d be a budget for a coloured graphic novel? Or at least, completed drawings? The artist did wonderful work on close ups and with the select detailed drawings throughout the graphic novel, but those are outweighed entirely by the sketch/unfinished drawings.It was a fairly quick read, once you got your brain around all the black and white and greys, and figured out who was who.Maybe my ideas will change if I ever reread this graphic novel, but I doubt it will be any time soon."}, {"userName": "Jeane", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/4869474-jeane", "userReview": "Not a fan. The art work was not that great, and with all the hype that Pride and Prejudice and Zombie the novel is getting, you would think that you could pay someone enough money to color the graphic novel. I am not saying that I am against black and white comics, but this art work looks literally like I am looking at someone's sketchbook. It is rather poorly done, and everyone looks the same. I can barely tell Lizzy and Jane apart except for that Jane has dark hair. I could barely tell Lydia and Kitty and Mrs. Bennet apart, and Mr. Bingely and Mr. Darcey looked the same also. I think that this would have been much improved by coloring it, but that is not to say that the story wasn't also horrible. I thought I would love it because I love Pride and Prejudice and I love zombies, but no. I hated the way they made Lizzy. First of all she was yelling like Xena in one scene, I mean seriously?!? In another scene she kills (who I thought was Kitty, but I guess it wasn't since she is in the book later, so I don't know who it was) a innocent \"alive,\" not a zombie girl, just because she annoyed her. This could have certainly been better. If you absolutely have to read this book choose the novel form, not the graphic novel, like I said I am certainly not a fan."}, {"userName": "Bry", "userReviewDate": "Mar 21, 2010", "userURL": "http://www.goodreads.com/user/show/1360862-bry", "userReview": "You know I really enjoyed the written version of this work. I thought it was witty, humorous, and so completely absurd. And even though there was very little original additions to the text I still found myself laughing out loud at the idea of the Bennett girls fighting zombies in their empire waist dresses and stockings, all while still following the incredibly strict rules of modesty and decorum. Yet this graphic novelization completely fell flat of the original PPZ which was so disappointing especially as I loved the book and graphic novels in general. So I thought this would be a perfectly enjoyable read for me, but sadly no.At first I liked the penciled and sketchy graphics that make up the art of this novel, but the closer I looked I realized how incomplete the images were. Lines of an object that were behind another and thus should not be visible were not erased, details on the characters such as hair and clothing were inconsistent, and even the characters motions were inconsistent and disjointed. What was most annoying is that even the characters positions around a table for example were inconsistent making it extremely hard to determine who was speaking. At one point Mr. Darcy, Caroline Bingley, Mr. Bingley, and Mr. Hurst are sitting around a table playing cards. And in every panel over the course of 2 pages Mr. Darcy and Caroline continuously switched seats at the table. Talk about major continuity issues. That is just lazy on the part of the editor to notice something like that.Also the inked lines throughout the art were awful. They were usually just around the entire figure of the character but not around defining characteristics such as the eyes. Also the lines were horribly inconsistent in terms of thickness making the characters features seem different from page to page and even panel to panel. In the beginning, the penciled style seemed to push the tension and fast pace of the story, and then it just felt as if the publisher wanted to strike while the iron was hot and churn out this puppy quick enough to cash in that they didn't mind cutting corners and sacrificing the art. The characters themselves did not even seem the same from the written work, and I am not referring to the original Jane Austen version, but the PPZ version. When reading the novel the characters did seem more harsh in their interactions but overall still kept their original Austen humor. In the graphic version though it was if the characters had no sense of humor and rarely smiled. Lines that were humorous and sarcastic in the written version just came off as blunt and mean in this conception. The flow of the story was also hard to follow throughout the entire book. For instance, Caroline Bingley is never introduced in the work by herself, so when she approaches Darcy at the Long's house and is confronted with the knowledge that he admires Lizzy's fine eyes, you wouldn't even know that that was Caroline who had spoken with Darcy if you did not know the original story fairly well. And yes, most people who are reading this probably know both the Austen and Grahame-Smith versions, but even still, previous knowledge on the readers part should not equal laziness on the adapter Tony Lee's part. I will say that the cover art is just as awesome as the written version. I love the zombie emerging from the ground while still holding onto her parasol! Totally reminds my of Alexia from the Soulless books and her ever present parasol. Sadly though the cover art was the best part of the entire work. And honestly just based on art, style, adaptation of the original story, etc this work deserves only 1 star, but since I a such a Janite and really did love the original PPZ writen version I am cutting this work just a bit of slack."}, {"userName": "John", "userReviewDate": "May 08, 2010", "userURL": "http://www.goodreads.com/user/show/1917422-john", "userReview": "This was an early birthday present from a friend--I gave her the novel of the same name for Christmas. Despite rumors to the contrary started by an unnamed party, I enjoyed reading Jane Austen's Pride and Prejudice when I was in high school, mainly because I always liked smart-assed women--god help me--and the sarcastic Mr. Bennet.Having already read Seth Grahame-Smith's Abraham Lincoln: Vampire Hunter, I was curious as to how he would mix zombies with the time-honored classic. It seems today's recipe for writing success is \"just add zombies,\" kind of like cilantro.Well, if you like kick-ass, Shaolin-trained, sword-playing, zombie-hunting ladies who also serve a mean afternoon tea and can waltz with the best of them, then you will thoroughly enjoy Pride and Prejudice and Zombies.The premise for the story is that England is overrun with \"unmentionables\"--zombies--and that it is almost standard practice for anyone of social standing to train in the martial arts in the Far East to combat these brain-gnawing hordes. The Bennet sisters are no exception, who are more warriors than ladies, according to Mr. Bennet.Darcy retains most of his aloof charm in this adaptation and he only beats one servant or so, but he deserved it. LOLPerhaps my one criticism for this graphic novel was the artwork. While Cliff Richards' skills are obvious--nicely drawn characters and solid layouts--I would have enjoyed a splash a color here and there instead a strict black and white interpretation."}, {"userName": "Joe", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/123153-joe", "userReview": "This book's illustration was so bad, I couldn't finish it. It's not that the illustrator used a style I didn't like. It was just an unintelligible mess, the visual equivalent of madness born from lingering too long at the edge of an abyss. Several of the characters looked exactly the same, to the point where I memorized the characters' eyebrows in an attempt to tell one character from another. The sketchy, washed out, and almost Xerox quality of the visualization made me want to kill myself, repeatedly, if necessary, to preclude ever seeing it again, even if by accident, in this world or the next. In fact, I now promise, in the middle of this review, to live a more ethical life, if by chance there is a Hell and reading this again would await me as punishment. Everyone in this project should be ashamed that it ever saw the light of day. Even the greed that no doubt drove the decision to milk this franchise with such a wretched example of craven excess should be embarrassed by what it created, and probably is. For shame, for shame. One of the worst books I have ever read."}, {"userName": "Jennifer", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/6317433-jennifer", "userReview": "As a Jane Austen fan, I really did try to like this book. Surely any exposure to Jane Austen's books would be good for our generation. This book has a great opening line: \"It is a truth universally acknowledged that a zombie in possession of brains must be in want of more brains.\" It is a wonderful play on the original words. Unfortunately the graphic novel continues downhill form here. I could not connect to any of the characters because they all looked so similar. One can blame the artist for that. But the travesty does not stop merely at the shoddy, seemingly hastily sketched art. The writing itself is dull and soon it becomes too ridiculous almost to carry on. The writer does not stay true to the characters, especially to that of Elizabeth's character. She is so cutthroat in this rendition that she seems one-dimensional, and loses the personality of the original. I cannot in good conscience recommend this graphic novel, even if it means millions of people will know Jane Austen's name because of it. I do not believe Jane Austen herself would not appreciate this kind of fame."}, {"userName": "CJ - It's only a Paper Moon", "userReviewDate": "May 17, 2010", "userURL": "http://www.goodreads.com/user/show/1357098-cj---it-s-only-a-paper-moon", "userReview": "Only 4.7 because I think it would be awesome if this has been in color. Liked the artwork, reminiscent of the actual mash-up book with it's pencil and shading techniques, and the story is just an abridged version of the book. If you didn't like the book, you may not really like this and if you are complete and utter Jane Austen purist just skip this book completely.I on the other hand got a kick out of seeing Jane, Lizzy, Darcy and Lady De Bourgh drawn out. You know what this book and this graphic novel made me realize? What about Mary? Poor quite, bookish, slightly prudish Mary?If you like graphic novels and Jane Austen but aren't ready for the Zombie Mash-Up, Marvel released a graphic novel of P&P"}, {"userName": "Peacegal", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/3078602-peacegal", "userReview": "The illustration style chosen for this graphic novel was very strange. The panels do not appear completed; instead, they are rough pencil outlines that appear to be far from finished. I once saw a documentary that indicated that Disney’s Beauty and the Beast was so labor-intensive for the artists, they actually had to show part of the film to critics in animated black and white pencil sketches. Well, that’s what P&P&Z is like. Imagine a cartoonist’s comic layout before it is shaded, inked and colored and you have this book. Needless to say, backgrounds are little more than hints of shapes and characters (especially the young women) are very hard to tell apart. Was the artist just lazy or did he run out of time? Whose idea was this?"}, {"userName": "Sari", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/287133-sari", "userReview": "When I was a kid, I was lucky enough to stumble upon a huge stash of comic books that belonged to my father and I developed a life-long love for comics. When I heard that one of my favorite books, Pride and Prejudice and Zombies, was turned into a graphic novel, I was excited to get my hands on it.I have to tell you how great it is. Yes, sometimes graphic novels are a little hard to follow. My kids love to read The Legend of Zelda graphic novels and since they’re Japanese-style, they read from back to front. I swear I get lost trying to figure out which panel to read first, but this book is fairly straightforward.Maybe the drawings aren’t as detailed as you’re used to, or they’re not in color. However, there are hidden benefits to everything. This particular book is perfect, because it combines three things I love: reading, comics and the opportunity to color.Yes, color. I still love to color. I’m in my 40’s, but I’ll admit it. When I was a kid, I had some amazing art coloring books and this book totally takes me back. The paper is perfect for colored pencils. We recently went on a trip to the beach and I took PP&Z with me and it was entertaining and made for hours of enjoyment. Which color should I use for Elizabeth’s dress today? How many streaks of coral can I put in her hair? Should she be blonde or brunette? Brunette, of course!. Should I make the zombies green or purple? How about green with purple guts?The possibilities are endless.I love to pack the book and my pencils in my purse, for when I’m waiting in the car at pickup after school or if I have to wait in the dentist’s office. It’s good to get out your aggressions coloring a little zombie mayhem.I’m sure Quirk never intended to publish a coloring book, but this graphic novel is a must have for anyone who loves to find the quirkiness in everyday things."}, {"userName": "Lolly's Library", "userReviewDate": "Nov 30, 2011", "userURL": "http://www.goodreads.com/user/show/2649865-lolly-s-library", "userReview": "I enjoyed the original mash-up novel, so when I heard of the graphic novel adaptation, I was quite excited. However, I was also leery, which is why it took me so long to get my hands on it and when I did, it was as library copy. I was leery for the main fact that I knew the interpretation of the graphic novel could be potentially iffy. And I was right. The illustrations are technically skilled, but lacking distinction. The only way I could tell Lizzie and Jane apart was by Jane's dark hair. The other female characters, the young ones at least, were interchangeable and it was very easy to confuse one for another. Plus, the characters were bland and overly romanticized. It was like looking at a bunch of Barbie and Ken dolls dressed in regency-style clothing. The women all had full lips, petite noses and large, doe-like eyes. And of course the men had perfectly styled hair and dashing, Prince Charming features. Frankly, it got rather boring after a while, watching all the perfect people parade across the page.Then we come to the actual story. Naturally, due to the manner of graphic novel storytelling, the original tale was abridged. But not well, which resulted in a choppy and abrupt storyline; while the original novel, due to the inherent nature of a literary mash-up, had the occasional disconcerting moment when new material was introduced into the old, there were exponentially more of those jarring moments in the graphic novel. And the numerous double entendres referring to \"balls\" and their enjoyment by the girls got truly tiresome and were completely out of place. Including the snort of laughter given by Lizzie after one of those references (concerning musket balls, as opposed to the dancing balls which were the main victims of the juvenile jokes).In the end, I'm glad I read the book: It satisfied my curiosity. However, I'm also glad I didn't buy it as I had initially planned and instead got it as a loan from the library. Because it was truly a letdown and could've been so much better."}, {"userName": "TeenRA Resource Teens", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/19713409-teenra-resource-teens", "userReview": "Catherine's Response: \tI quite enjoyed this novel. I know there are some who would argue that it is an adulteration of a classic but I can see the merit in both works. The story is quite funny, things will be going along normally and, all of a sudden, zombies will pop out of nowhere and the killing will commence. My favorite part was when Elizabeth rejected Mr. Darcy’s first proposal with a kick to the face. I think this is a great resource for helping reluctant readers appreciate the classics. Start them off with the graphic novel, move to the book version, and they may eventually want to read the original. I also liked the slightly unfinished quality of most of the illustrations. It fit nicely with the rougher take on the story.A Quick Pitch:\tTake Jane Austen’s classic love story, Pride and Prejudice, add a zombie apocalypse, a band of Kung Fu fighting sisters, and plenty of grotesque illustrations, and you have Pride and Prejudice and Zombies: The Graphic Novel. \tAfter a strange plague overtakes much of England, the dead walk the earth looking for brains. Elizabeth Bennet and her sisters are trained by the best martial artists in China, so they can fight off the waves of unmentionables invading their village. Elizabeth has always been disdainful of how easily distracted her younger sisters are by the frivolities of balls and love. But when several new gentlemen come to town, Elizabeth must find a way to balance balls, beheadings, and the possibilities of new love."}, {"userName": "Selwa", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/6874113-selwa", "userReview": "Pros: I did actually find the retelling to be clever and funny. Not enough to want to read the full-length novel version, but entertaining enough.Cons: As stated by other reviewers, the drawings looked like sketches, like this was more of a draft than a final product. I think I would have minded less if I wasn't getting characters confused, but it was hard to tell them apart at times.Also, there was the reminder, early on, that I am not the target demographic, when Lizzy's skirt gets ripped off and she arrives at Netherfield in shoes and a garter belt. Yes, I understand a book with zombies in it (and in the title) will attract more male readers than female readers, but still, really? Also, the sex kitten pouty lips and eye make up. I wish the dudes were drawn more attractively."}, {"userName": "Bradley", "userReviewDate": "Dec 14, 2015", "userURL": "http://www.goodreads.com/user/show/728016-bradley", "userReview": "Apparently Del Rey doesn't have the money to afford an inker. It's like one of those \"director's cut\" comics that DC sometimes puts out that only include pencilled art without the inking or color. I don't mind black and white comics. This isn't a black and white comic. It's garbage."}, {"userName": "Nicole Karlson", "userReviewDate": "Jan 05, 2016", "userURL": "http://www.goodreads.com/user/show/12960387-nicole-karlson", "userReview": "Ummmm. I was not a fan of this book. I gave it 2 stars because I did laugh a few times."}, {"userName": "Becca", "userReviewDate": "Jun 29, 2017", "userURL": "http://www.goodreads.com/user/show/4549547-becca", "userReview": "Last year I tried to read the novel version of this book and couldn't stand it. So I tried the graphic novel version thinking it would at least be quicker to get through. I can't stress enough how terrible it is."}, {"userName": "Amy Coles", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/12533098-amy-coles", "userReview": "Could I justly expect anything less?"}, {"userName": "Noelle", "userReviewDate": "May 31, 2016", "userURL": "http://www.goodreads.com/user/show/10370282-noelle", "userReview": "I love Jane Austen and thought that a zombie spoof would be a fun addition the other adaptations of her work. I am one of those people who saw the Pride and Prejudice and Zombies movie before reading the book--gasp--I know. But being very familiar with the original I found it to be a fun and humorous addition. I did not get to read the main book yet, but loving graphic novels, I just had to give this one a shot. The story itself was quite fun and had moments of that expected cheesiness that comes from regency era zombie slaying. Honestly for the most part I really enjoyed it.But there were a few things that drove me nuts. As some other readers commented the similar way in which many of the characters were drawn made it difficult to determine who exactly was talking. However, this was for me minor compared to what they did to Mr. Darcy. I mean I get it, adaptations take some liberties with characterization so this might have just been a personal thing.And having read what other people were saying about the text itself it seems the author simply wanted to make sure a few less savory characters got their just desserts. Still, I think there were points where liberties were a bit extreme. In one scene Darcy was characterized to be well...cruel--which I would not have thought as much about except that it completely detracts from the point of the novel. That Darcy was misjudged due to poor decisions and that he is a actually a good person. I just don't think that Austen's Darcy would have physically beat a female servant--or any servant for that matter--in front of the staff to set an example of what happens when he is crossed. Surely there had to be a less degrading way to punish a wrongdoer? If not for that one point, I could have suspended my disbelief a little more which is too bad because I was quite entertained up until that point."}, {"userName": "Jody Mena", "userReviewDate": "Aug 02, 2011", "userURL": "http://www.goodreads.com/user/show/5943684-jody-mena", "userReview": "The graphic novel of Pride and Prejudice and Zombies was surprisingly engaging and entertaining, especially considering that I really detested the text version of this story. It's really the truth that some stories need to be told in print, while others need to be told in pictures. The novel version of this retelling of Jane Austen's classic was extremely mind-numbing to me, probably because it was basically Pride and Prejudice (of which I am a great fan), nearly verbatim, only with zombie slaying and bad kung-fu references gumming up the works, and I had to force my way through it. But the graphic novel, to the contrary, kept me engaged and interested all the way to the end - no one was more surprised than I was, it was like night and day! The artwork was beautiful, even the gory parts, I loved the realism and attention to detail. I think the story works so much better in graphic form because it lacks most of the flowery narration of the original story that contrasts and clashes so totally with the re-told story and re-vamped characterizations. My advice is, don't bother with the novel, instead, read the original Pride and Prejudice, then go straight to this graphic novel, and enjoy!"}, {"userName": "Elizzy B", "userReviewDate": "Oct 10, 2014", "userURL": "http://www.goodreads.com/user/show/430209-elizzy-b", "userReview": "Review in English belowComo sabía que no me iba a leer la \"novela\", por llamarla de algún modo, decidí leerme la versión abreviada, esto es, el cómic. Desde luego, que coger una historia, quitarle frases y poner \"¡zombies!\" no se sostiene mucho. Por no decir que está hecha para sociópatas, pues Elizabeth desde luego lo es. Y cómo acaban y cierran los personajes, un horror. Lo mínimo que se debe hacer cuando se está destrozando un clásico, es hacerlo con humor, y esto, lo tiene muy poco. Y no sientes la atracción entre Darcy y Elizabeth, salvo en un par de chistes obvios. Lástima, lástima.Por cierto, el dibujo no está mal, aunque se ahorran el color.Knowing that I would not read the \"novel\", to call it somehow, I decided to read the abridged version, namely the graphic novel. Of course, to take a story, take phrases out and put \"zombies!\", it does not much hold. It is made for sociopaths, of course, Elizabeth of course she is. And just how they close the characters, a horror. And you don't feel the attraction between Darcy and Elizabeth, but in two obvious jokes. The least you should do when you are destroying a classic, is to do it with humor, and this has very little. It's a pity, a true pity.By the way, the drawing is not bad, although it is all black and white."}, {"userName": "Lauren", "userReviewDate": "May 12, 2015", "userURL": "http://www.goodreads.com/user/show/12031194-lauren", "userReview": "One star for astoundingly bad art by Cliff Richards (Buffy the Vampire Slayer comics). The sketchy black-and-white drawing appears quite incomplete. Despite the setting of 1813 England, the young women are drawn with a too-modern, extremely commercial standard of beauty, and they all look exactly alike. Imagine Victoria's Secret models with collagen-plumped lips and cat-eye makeup wearing modest gowns and carrying katana swords and you've got the picture. Truly, I often couldn't tell the young female characters apart when there were several in one frame (and as readers may recall, there are five Bennet daughters). I found this maddening and offensive, as Jane Austen's original novel (and life in general) contains such delightful and contrasting characters. This graphic novel could have been infinitely better, and I'm disgusted with myself for even finishing reading it. I've heard that the zombie novel on which it's based is better, but now I have zero inclination to read that. And guess what? There's a film in production. Huzzah."}, {"userName": "Erin", "userReviewDate": "Jan 07, 2012", "userURL": "http://www.goodreads.com/user/show/2665969-erin", "userReview": "I read this book as part of a cross-genre reading challenge that I'm doing (graphic novel - check). I haven't read many graphic novels, nor have I read Pride and Prejudice and Zombies, although Pride and Prejudice is one of my favorite books. As a foray into the graphic novel genre, I think I would have been better served going with another book. I don't know how closely the graphic novel stuck to Pride and Prejudice and Zombies, but I found myself disliking characters that I really liked before. And I had trouble following the story because I couldn't always tell the characters apart on the page. Since they were so far removed from the characters I knew from the original story, I sometimes just found myself skimming through. I also didn't appreciate the addition of the innuendo either. It actually just made me dislike the characters more."}, {"userName": "SaraLaLa", "userReviewDate": "Dec 30, 2015", "userURL": "http://www.goodreads.com/user/show/8379760-saralala", "userReview": "I love the story of Pride and Prejudice and i do enjoy zombies, so I thought this would be a fun read. As it turns out, the zombie plot was forced and kind of strange. I ended up ignoring the pictures because I found it difficult to tell the characters apart. This graphic novel did stay fairly close to the original story line aside from Charlotte becoming a zombie. That was so weird. The only thing that motivated me to read this version is that I was still so enamored with Mr. Darcy and wanted to relive his role in the story."}, {"userName": "Daria Marshall", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/21892859-daria-marshall", "userReview": "2.5 stars The art seemed like there were parts of it that was not completed. It was hard to keep up with who was saying what because of the art and the fact that a lot of the characters sounded the same. I think if I had read the actual novel first and was more familiar with that story rather than just the story of Pride and Prejudice, I would have enjoyed it more."}, {"userName": "Nickcole", "userReviewDate": "Jun 22, 2016", "userURL": "http://www.goodreads.com/user/show/9551848-nickcole", "userReview": "Rating: 3I thought that I was going to love this version of the book because who doesn't love a good zombie, but I just couldn't connect with it. I guess I'm just a fan of the classic and adding zombies wasn't the right move for me. lol The art was excellent and the way the author adapted the story for a zombie fight was awesome. So maybe one day I'll try and read it again."}, {"userName": "Anna", "userReviewDate": "Aug 20, 2010", "userURL": "http://www.goodreads.com/user/show/3900844-anna", "userReview": "Sorely disappointed with this rendition. The graphics were gratuitously suggestive and the dialogue lame. \"My balls are yours.\" Seriously? Wow, I was really hoping for something better after the print novel made such a splash."}, {"userName": "Mar", "userReviewDate": "Oct 12, 2015", "userURL": "http://www.goodreads.com/user/show/10846208-mar", "userReview": "It's silly but if you know Pride and Prejudice backwards and forwards you'll probably enjoy it. Unfortunately, I found the scene changes quite rushed and confusing at times. A similar thing happened with the character designs. Overall, a pleasant experience and a fun read."}, {"userName": "Maura Mclaughlin", "userReviewDate": "Apr 24, 2012", "userURL": "http://www.goodreads.com/user/show/6948567-maura-mclaughlin", "userReview": "hysterical. Note to self: read the actual book."}, {"userName": "Shirley", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/3498915-shirley", "userReview": "The story gets five stars.The drawings in this graphic novel get no stars.A huge let down, at least on the visual side."}, {"userName": "Megan", "userReviewDate": "Nov 29, 2010", "userURL": "http://www.goodreads.com/user/show/2160472-megan", "userReview": "A thoughtful and funny gift from my brother that I wish I had enjoyed. I gave up right around the \"Pentagram of Death\"."}, {"userName": "Otherwyrld", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/10781757-otherwyrld", "userReview": "I think it was probably a mistake to try and read this graphic novel almost immediately after finishing the original book, given that I wasn't impressed with that original. Perhaps I was hoping that some action sequences would liven up the story. Alas, I was to be disappointed. As far as I can tell, given that I skip read it, the story is the same as the original book. The edition I read had a film tie-in cover, but I am assuming that it is based on the novel rather than the film, which I have yet to see. That said, the success or failure is now down to the artwork.Alas, the artwork doesn't really do the story any favours either. It's certainly competently drawn and the layouts are well executed, but the whole thing looks unfinished, like these are just sketches (or maybe storyboards) for a finished concept. The book is one that just screams to be in colour, and having a black and white story is a major disappointment. Even so, the art would have still been salvageable if there had been some weight or depth to it. As it is, there is far too much blank white spaces in each panel which could have been filled with something - anything - to make it feel just a bit more there.Finally, the art does a disservice to the characters by making them bland and uninteresting to look at - this is particularly true of the five Bennett sisters, who at times are impossible to tell apart. Again, colour would have helped out in this respect.So, a good adaptation might have elevated an otherwise poor story, but this graphic novel fails to do even that much."}], "description": "THE NEW YORK TIMES BESTSELLER—NOW AN EYE-POPPING GRAPHIC NOVEL OF MANNERS, MORALS, AND BRAIN-EATING MAYHEM It is known as “the strange plague,” and its unfortunate victims are referred to only as “unmentionables” or “dreadfuls.” All over England, the dead are rising again, and now even the daughters of Britain’s best families must devote their lives to mastering the deadly arts. Elizabeth Bennet is a fearsome warrior whose ability with a sword is matched only by her quick wit and even sharper tongue. But she faces her most formidable foe yet in the haughty, conceited, and somehow strangely attractive Mr. Darcy. As the two lovers meet in the ballroom and on the battlefield, they’ll soon learn that nothing—not even bands of ninjas, hordes of flesh-eating zombies, or disapproving aunts—can stop true love.", "title": "Pride and Prejudice and Zombies: The Graphic Novel", "url": "https://www.goodreads.com/book/show/6693775-pride-and-prejudice-and-zombies", "average": 3.93, "cover": "https://images.gr-assets.com/books/1320413809l/6693775.jpg", "reviews": 341, "authors": [{"url": "https://www.goodreads.com/author/show/169377.Seth_Grahame_Smith", "name": "Seth Grahame-Smith"}, {"url": "https://www.goodreads.com/author/show/1265.Jane_Austen", "name": "Jane Austen"}, {"url": "https://www.goodreads.com/author/show/10473.Tony_Lee", "name": "Tony Lee"}, {"url": "https://www.goodreads.com/author/show/101873.Cliff_Richards", "name": "Cliff Richards"}], "type": ["Sequential Art", "Horror", "Horror", "Fiction", "Sequential Art"], "outlinks": ["http://www.goodreads.com/book/show/6693775-pride-and-prejudice-and-zombies", "http://www.goodreads.com/book/show/7842793-pride-and-prejudice-and-zombies", "http://www.goodreads.com/book/show/33793629-pride-and-prejudice-and-zombies", "http://www.goodreads.com/book/show/7108001-abraham-lincoln", "http://www.goodreads.com/book/show/5899779-pride-and-prejudice-and-zombies", "http://www.goodreads.com/book/show/12954783-unholy-night", "http://www.goodreads.com/book/show/20454635-the-last-american-vampire", "http://www.goodreads.com/book/show/293217.How_to_Survive_a_Horror_Movie"]}