{"ratings": 1257, "userreviews": [{"userName": "Paul", "userReviewDate": "Dec 29, 2014", "userURL": "http://www.goodreads.com/user/show/4643325-paul", "userReview": "I like to read a good ghost story at Christmas. Unfortunately this wasn’t really it. It is a novella, almost a short story and easily readable in one sitting. It revolves around four medical students who share digs. The story is written my one of them and is found by his family after he dies many years later. Two of the group are interested in experimentation with the end of life and bringing back the dead. They have the truly daft idea of capturing the last breath, which they think has potency, and using it to bring someone else back to life. It takes a while to get going, isn’t really scary as a good story in this genre should be and the ending is truly silly. Not up to Hill’s usual standard. Back to M R James I suppose. There were also a couple of silly typos."}, {"userName": "Sam Quixote", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "In 1983, Susan Hill wrote a decent ghost story called The Woman in Black that was turned into a brilliant West End production. Since then she’s been coasting on her reputation as a horror writer, churning out extremely dull ghost novellas every now and then that nonetheless sell quite well due to the Woman in Black’s success. So it goes with Printer’s Devil Court, which is the worst thing by Hill that I’ve read to date.Set in some time that could be the Victorian or Edwardian era, Hugh Meredith is a med student living in crappy digs in Printer’s Devil Court with a couple others. His flatmates are a bit mad and, after talking about Lazarus one night after dinner, they reveal to Meredith that they can bring the dead back to life – sort of. That sounds like a passably interesting plot, no? Susan Hill doing the Frankenstein thing? So why is it subtitled “A Ghost Story”? Because Susan Hill is best known for ghost stories, which sell. The reveal of the supernatural thing in this story is total garbage. Is it a ghost? Is it some kind of resurrected body/semi-conscious zombie? What was the point of resurrecting the dead again? Horror doesn’t work if you don’t know basic things about what we’re supposed to be scared about and why. Instead of working on the feeble “story”, Hill instead does her usual trick of writing extensively about the atmosphere. If there’s one thing I hate reading, it’s descriptions of weather and the background, but Hill positively revels in this kind of extraneous crud so the pages are padded out with images of dark, foggy London, fireside chats, and oh god I’m falling asleep just recounting it. Hill doesn’t have a clue when it comes to originality. She adopts the clichéd “story within a story” approach that the Victorians favoured: a framing device of the “present day”, with the main story taking place years in the past, usually via a just-discovered manuscript. The drawings included here are unremarkable and add nothing to the story, clearly serving to add to the page count only. The whole thing looks like a weak facsimile of a bad Victorian ghost story. It’s not much of a book anyway – it’s essentially a short story that’s been stretched out to 100 pages long through large font size, corny pencil drawings, lots of blank space between chapter endings and blank dividing pages. Shockingly, there are a ton of typos in this short story (“Printer’s Devil’s Court”) which makes it clear this was rushed out to make the publishers a quick buck. Was there even an editor on this thing, either to pick up obvious typos or perhaps focus the story? Doesn’t look like it. Printer’s Devil Court is a piss-awful “horror” story that doesn’t know whether it’s a ghost story or a weird Frankenstein/zombie thing, and it has the least satisfying ending ever. Susan Hill is a vastly overrated horror writer – she’s in fact an utterly appalling one. Put simply this book is 95% nothing, 5% might-as-well-be nothing. It’s certainly not scary and might be the most pathetic excuse for a ghost story I’ve ever read. For great horror short stories, I highly recommend reading Shirley Jackson instead."}, {"userName": "Blair", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "Part of the Kindle Single series, Printer's Devil Court is a brand new short story from Susan Hill. In the tradition of her well-known historical ghost stories, the most famous of which is The Woman in Black, it's a spooky, atmospheric tale set predominantly in early-twentieth-century London. Against a backdrop of impenetrable fogs and bleak winter storms, a young trainee doctor becomes unwittingly involved in a devilish scheme devised by two of his acquaintances, which will come to haunt him for many years afterwards. Despite its extreme brevity, I found this tale more fully realised and satisfying than Hill's two most recent longer-length ghost stories. Perfect for Halloween."}, {"userName": "Mariana", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/16176892-mariana", "userReview": "¿Una historia de fantasmas escrita por la misma autora de \"La Dama de Negro\"? ¡Claro que quiero leerla!Con este hype fue con el que empecé este libro en el que, si bien la autora sigue haciendo gala de su capacidad para crear escenarios tétricos, góticos, cargados de ambiente, lo cierto es que la trama resulta bastante floja.Seguimos a un grupo de jóvenes doctores en el Londres post-victoriano, dos de los cuales piensan que han encontrado la forma de devolver la vida a los muertos. A nuestro protagonista le piden que sea el testigo del macabro experimento que se proponen hacer y ante sus ojos se consuma algo que él se niega a aceptar como posible.Pasan los años y volverá a encontrarse ante la terrible aparición que ha sido traída de vuelta a la vida y que hubiera sido mejor dejar muerta. El protagonista tendrá que descifrar qué es lo que este ser espectral quiere. Es una historia muy corta en la que no pasa realmente mucho, como les digo, todo es más bien atmosférico. En el momento más perturbador, cuando vemos a la aparición fantasmal, lo que ocurre es más bien decepcionante... es una historia de un fantasma del tipo \"alma en pena\" y no verdaderamente sediento de venganza. Le doy 2 estrellas por la atmósfera gótica y una más por el final. Habrá que leer más de Susan Hill para ver si no es una autora one hit wonder."}, {"userName": "Lily", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/4713523-lily", "userReview": "First of all, what a beautiful, beautiful cover. I mean, look at it. It’s gorgeous. It’s textured, too, which makes it all the more lovely.However, the story within wasn’t nearly so lovely to read. In fact, it was dull. Extremely dull. And the science didn’t really make sense – granted, it’s more of a ghost story than a piece of science fiction, but you’d expect the science to add up, wouldn’t you?The characters are unexciting and not nearly fleshed-out enough. I found that I didn’t really care about any of them, even Meredith. Their experiments are suitably horrific enough, but if I want horrific experiments, I know I’ll stick to Shelley in the future. Frankenstein portrayed the horror of morality in science far better than Printer’s Devil Court has. I know Susan Hill is supposed to be masterful at ghost stories, but truly? I’m not seeing it here. All I see is a jumbled mess of characters and half-baked ideas. If only Hill could have properly meshed them together. Perhaps then it would have been suitably gripping."}, {"userName": "Leah", "userReviewDate": "Jun 17, 2015", "userURL": "http://www.goodreads.com/user/show/17629329-leah", "userReview": "A young medical student has taken rooms in Printer's Devil Court in London, sharing them with three other medical men. One evening, the four men have a discussion as to whether the story of Lazarus could possibly have been true – is it scientifically possible to bring someone back from the dead? Two of the men hint that they have been carrying out experiments on the subject and ask Meredith and the fourth man if they would like to join in. The fourth man considers the whole idea to be blasphemous and refuses, but Meredith's curiosity wins out, and he agrees to be a witness to the experiments – a decision he will regret for the rest of his life.Susan Hill has written this very much in the style of a Victorian ghost story although it's set in the 20th century. It feels very much like working to a recipe...1 notebook revealing a terrible secret1 creepy street name4 medical students2 or 3 graveyards to taste2 corpses1 late night adventure in a mortuary1 man racked by conscience and haunted for the rest of his lifeMix all together with a wooden spoon until smooth, and bake for 1 hour and 40 minutes.Unfortunately, the resulting cake is somewhat bland – a Victoria sponge without the jam perhaps. One feels that a vital ingredient has been forgotten...1 generous splash of essence of horrorThe quality of the writing and storytelling is quite high – it's just that it's a story we've all heard so often in various forms and Hill brings nothing new to the recipe. I felt she was so busily ensuring that she got it to sound authentically Victorian, which she succeeds in doing very well, that she lost sight somewhat of the fact that a ghost story ought to be scary, and in order to be scary it must have some element of unpredictability. I kept hoping there was going to be a twist that would turn expectations on their head, but I'm afraid it ran along too smoothly from beginning to end without deviating from the obvious route. And there's no added ingredient to make up for the lack of the scare factor – no great moral questions are raised, there's no element of humour. The most effective bits are the mortuary scene and the first graveyard scene, in both of which the quality of the writing does manage to create a chilling atmosphere, but from there on the story meanders on, not really going anywhere at all, until it reaches a completely anticlimactic end. I listened to the audiobook version which has a running time of 1 hour and 40 minutes. The narrator Stephen Pacey does a good job with the material available, but I'm afraid that my spine remained untingled and my hair unraised.NB This book was provided for review by Audible UK via Midas PR.www.fictionfanblog.wordpress.com"}, {"userName": "Andrew", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/800291-andrew", "userReview": "So here we are with the last (that I am aware of) of Susan Hills \"ghosts stories\" and I must admit this one though no great shocker did catch me out hence the high review.So another short ghost story in the classic - British fireside story - if it was in another season I would almost be tempted to call it a Christmas Ghost story. This one is typically atmospheric and perfectly illustrated, instilling a perfect sense of time and place. The story - and here it gets tricky without giving away spoilers - at first feels predictable, the characters, the location and even the subject matter. This is sense of familiarity is not dispelled as you carry on reading. For me it was more a case of enjoying the scene, as if I was watching a play unfold before me. However the final reveal, the conclusion to the story really caught me out and although neither shocking or disturbing was a creative twist I didn't see coming which I will admit on some stories is far from the case. Now I am sure many can provide titles of stories which have a similar twist but for me this is the first and for that it will stay with me (reading many Stephen King short stories have a similar place in my memories).So I have said it once and I am sure I will say it again - Susan Hill has a deft skill at weaving familiar and yet disturbing stories which defy the normal and as such will long remain in my mind, something I am and keep being impressed over."}, {"userName": "Cathleen", "userReviewDate": "Nov 01, 2014", "userURL": "http://www.goodreads.com/user/show/1297014-cathleen", "userReview": "I was looking for something spooky, atmospheric, and ghostly for Halloween reading. Susan Hill has carved out a niche writing supernatural tales, as well as a fine police procedural series, so I gave this a try. The most appealing parts of this were her descriptions of murky London, but the plot was slight. The story needed more suspense to create the creepiness I hoped the story would have."}, {"userName": "Becky Wright", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/59668422-becky-wright", "userReview": "Review to follow!"}, {"userName": "Cameron Trost", "userReviewDate": "Aug 13, 2016", "userURL": "http://www.goodreads.com/user/show/3912308-cameron-trost", "userReview": "This is the first Susan Hill story I have read, and I must say I was disappointed. The tale starts of well with Victorian doctors conducting experiments in the hope of successfully resurrecting a cadaver. The premise, although not original, promises a gripping ghost story in the Victorian Gothic tradition. Unfortunately, it doesn't deliver on that promise. Any ghost story worth penning needs a chilling twist, the kind that raises the hairs on the back of your neck, but the climax to this story is disappointing. I have been led to believe that Susan Hill deserves the hype surrounding her fiction, so I'm willing to give her another chance. Please tell me which of her ghost stories I should read. The Woman in Black? I certainly enjoyed the film released by Hammer in 2012."}, {"userName": "Megan", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/60510860-megan", "userReview": "The story was just very average and very, very dull. It follows four medical students, two of who have an interest in resurrecting the dead. It mainly just felt like a really poor attempt at a Frankenstein-esque story.For a short story it takes a really long time to get going, and never really hits a peak. The main body of the story happens too quickly, with little detail, none of it enticing.I enjoyed the writing style but other than that the story lacked intrigued and for a supposed 'horror' story, it lacked the horror aspect.The story line had potential but I was bored and considering how short it was, if I had read it (as opposed to audiobook) or not listened to it in one sitting, I'm not convinced I would have finished it."}, {"userName": "Brendan Nicholls", "userReviewDate": "May 08, 2016", "userURL": "http://www.goodreads.com/user/show/17999985-brendan-nicholls", "userReview": "This is my first Susan Hill novella and must admit I like these old fashioned horror settings. I think this works much better as a period horror instead of a horror period book, I know you are probably wondering what is the difference between the two. The book is more period with a dash of supernatural (horror), I found that the novel balanced nicely. Like most horror films, this book has clearly divided the audiences which is okay, you either find yourself on one side of the fence or the other. As a horror fan I did find this story a very pedestrian one and not something ground shattering. It's short and detailed like most old fashioned stories, detailed. I'll probably read the other books in the series but I'll be doing so in between books. Above average and worth checking out."}, {"userName": "Emma Harrison", "userReviewDate": "Jan 02, 2015", "userURL": "http://www.goodreads.com/user/show/15822492-emma-harrison", "userReview": "This is a beautiful book to look at. It's a smaller size than normal, hardback and with beautiful textured artwork. The publishers have done all that they can to entice the reader into picking up this book. Sadly, the beauty of the book stops at the cover. Four Doctors live together in shared quarters. James and Walter decide that they want to try and achieve the impossible by bringing someone back to life. An act that is witnessed by Hugh. Oddly for an author who is so good at writing ghost stories, this one has none of the required ingredients. Ghost stories generally require us to suspend our beliefs but the way the two Drs commit their crime is so lacking that I didn't really care what happened next. Sadly there is no suspense, chills or even bumps in the night with this story."}, {"userName": "Angie Rhodes", "userReviewDate": "Jan 05, 2017", "userURL": "http://www.goodreads.com/user/show/19091303-angie-rhodes", "userReview": "Once again Susan Hill manages to chill the bones, and keep the reader holding their breath. Three medical students. who are also close friends and share rooms, make an unholy pact.  One of them has the bright idea to bring back life,! Rafe states that Jesus brought back Lazarus's daughter, so where is the harm?  What follows. haunts Hugh for years,, and now it is time fro him to fcae his demons, in Printer's Devil Court It did remind me of the classic book Frankenstien by Mary Shelley , ( not as gory) Read it, it will play on your mind for days"}, {"userName": "Melissa  Williams", "userReviewDate": "Jun 13, 2015", "userURL": "http://www.goodreads.com/user/show/41219050-melissa-williams", "userReview": "What a shame, I've read several of Susan Hills books and have always been a fan-but this novel is far from her best. It started with promise but came to a dismally predictable and dull end. Thoroughly disappointed."}, {"userName": "James", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "Not quite up there with: 'Woman in Black', 'Dolly' or 'Small Hand' - but nevertheless a good creepy ghost story of a read."}, {"userName": "Eleanor Grace", "userReviewDate": "Mar 20, 2018", "userURL": "http://www.goodreads.com/user/show/30567091-eleanor-grace", "userReview": "This was a decently spooky easily consumable ghost story, though I sincerely doubt it would have been as chilling if I hadn't listened to it on audio; Steven Pacey's ghost voice really creeped me out and I don't think it would have been as effective just being read. I think audio definitely helped my enjoyment of this story, so I think if I pick up any more Susan Hill I may do the same.In terms of the actual story, it's nothing I haven't seen before really. There was nothing groundbreaking or different, just the same old ghost story which made it somewhat enjoyable but not riveting. I was only spooked towards the end of the tale.I honestly thought the downfall of this story was just how short it is. I know its a short novella but it didn't have to be quite so brief. A little more introduction of the characters and the scientific project they are working on would have made the premise more believable and slightly more development and hinting towards the existence of the supernatural would have made this story significantly better, I believe.That being said, it fit its role nicely and I would be very open to reading more of Susan Hill's work in the future."}, {"userName": "Clare ", "userReviewDate": "Jul 22, 2017", "userURL": "http://www.goodreads.com/user/show/24034373-clare", "userReview": "Listened to in audio format.I have read all Susan Hill's Simon Serrailer series so I know the quality of her work. Printers Devils Court is only 1.5 hours long but it has taken me 3 days to listen and I very nearly gave up listening.This book is definitely a slow burner and the story did not start for me until part 3. For me the story really began years later when Hugh returned to London to visit his stepson.Printer Devils Court was a decent novella, maybe if the story was longer we could of find out more about fellow doctors Walter and Rafe."}, {"userName": "Oliver Clarke", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/7902804-oliver-clarke", "userReview": "I have slightly mixed feelings about this spooky novella from Susan Hill. It’s a tale of young doctors meddling with nature while conducting experiments intended to bring the dead back to life, and whilst it’s nicely written and very atmospheric, it just isn’t that scary. I read it is hardback and the book itself is lovely, packed with illustrations that add to the experience of reading what is supposed to be an early twentieth century memoir. It’s a quick and entertaining read but fails the to terrify."}, {"userName": "Rao Javed", "userReviewDate": "Jan 03, 2018", "userURL": "http://www.goodreads.com/user/show/18653053-rao-javed", "userReview": "Creepy little book I'd say. The narration and the deception was truly breathtaking. This was my first Susan Hill book I'd love to read more of her work soon.The concept was somewhat clichéd but I liked it somehow and also the story line was nearly predictable. Nevertheless, the way it was expounding was unique so a good 3 starts for this creepy little book."}, {"userName": "Peter", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/43011227-peter", "userReview": "This little book with its beautiful textured cover was a pleasing read. Ms Hill as almost, but not quite captured the classic victorian ghost story. The crazy science needed for the procedure on the bodies was dead on.A pleasing read."}, {"userName": "Chris", "userReviewDate": "Nov 04, 2015", "userURL": "http://www.goodreads.com/user/show/5129776-chris", "userReview": "Hugh Meredith is a junior doctor in the first decade or so of the twentieth century, lodging near Fleet Street in London and training nearby at the fictitious medical school of St Luke’s. He is drawn into a mysterious enterprise set up by fellow students Walter Powell and Rafe McAllister, namely bringing a dead person back to life. The results of witnessing the experiment come literally to haunt him in this novella by Susan Hill. The question I asked myself is, does this short story (a little over 100 pages) live up to the reputation that the author’s ghost tales have established for her?The answer, surprisingly and disappointingly, is no. This is a rather humdrum fiction, devoid of suspense or horror and confusingly told. The frame is the re-appearance of a notebook bound expertly by Dr Meredith but of “no commercial value”, returned by a bookseller to the beneficiaries of the late medic. This tells his stepson what had he had refused to believe from previous telling, but still finds incredible. Frankly, the process by which the life essence of a just-expired destitute is transferred to another just about-to-expire destitute is unconvincingly envisaged, and the physical complications arising from donating and receiving bodies being of different genders is clumsy and illogical. The descriptions of subsequent hauntings in St Luke’s churchyard and later in the West Country lack any power to chill, unfortunately.Matters are further confused by the inclusion of several Victorian engravings which give the impression of a 19th-century setting when the text soon makes it clear that time period of the tale is the 20th, with the Blitz occurring sometime between Meredith’s training and his retirement from general practice. Perhaps the illustrations suggested a possible narrative which the author later transferred to a modern timeframe.Originally published in 2013 by the author’s own company Long Barn Books in a Kindle Edition, this hardback edition by Profile Books a year later is bedevilled by printing errors in the first few pages, presumably transferred wholesale from the first edition. When Walter Powell becomes Walter Power, “its” and “it’s” are confused and quotation marks are omitted I wondered if these were deliberate nods to the name of the London court where some of the action (such as it is) takes place — a printer’s devil of course being an apprentice in a printing workshop — should one innocently assume the phrase refers to misprints and spelling mistakes that might inadvertently slip through the editing process. Luckily the rate of error swiftly decreases and the devil in the detail is largely absent thereafter.The hospital and churchyard which feature in the novel are entirely fictional, but Hill seems to have amalgamated several London institutions to create Printer’s Devil Court and its environs. Fleet Street of course is still synonymous with newspaper publishing, though the huge printing presses have long since gone. St Luke-by-the-Gate and its nearby hospital for paupers might well be based on the real-life St Luke’s Hospital for Lunatics, founded in 1751 and then rebuilt north of the City of London. The site was sold during the First World War to the Bank of England, becoming St Luke’s Printing Works and producing banknotes for several decades. Thus printing, church and hospital may have coalesced to form the miasmic background of Hill’s ghost story.http://wp.me/s2oNj1-court"}, {"userName": "K.B. Goddard", "userReviewDate": "Mar 06, 2015", "userURL": "http://www.goodreads.com/user/show/40750700-k-b-goddard", "userReview": "Firstly, this book isn’t a novel; I’m not really sure you could even call it a novella; it’s more like an extended short story, which is fine. I’m a pretty slow reader but I read this in a couple of hours. Printer’s Devil Court is home to four medical students. One night when they are gathered around the fire talking the conversation takes a sinister turn. The narrator, Hugh, soon finds himself being drawn into some dark goings on in dark corners of basements and disused mortuaries.There are obvious overtones of Mary Shelly’s Frankenstein in this book and it reminded me slightly of the 1970’s film ‘The Asphyx’ The book is also illustrated, which does give the feel of a Victorian/Edwardian book. Currently it’s only available in hardback or Kindle versions. I have the Kindle version but the book cover looks very nice and it probably looks beautiful as a hardback; but for a book with such iffy reviews I couldn’t justify the rather unappealing £7.49 price tag, essentially just for a pretty cover. I enjoy Susan Hill’s writing style; she has a knack for descriptive language which really helps you settle into the mood and atmosphere of a story. Where this story fell down for me was in the same place that ‘The Mist in the Mirror’ did, the end.I have been accused of being ambiguous in the endings of some of my own ghost stories; but ghost stories are supposed to be ambiguous. It isn’t necessary for us to understand the mechanics of how someone returned from the dead or how exactly they got their revenge in a locked room unseen by the reader, off screen as it were. However, there is a crucial, and perhaps subtle, difference between an ambiguous ending that leaves scope for the reader’s imagination and a frustratingly open and unnecessary ending.I can see that Hill is most likely trying to maintain the tradition of the twist ending. But if there is a twist ending in all of your books, surely the element of surprise is lost? Now, instead of catching you by surprise you’re reading the book waiting for the twist. I wouldn’t object to this if the twist was satisfying, but I didn’t feel as though it was in this case. It read as though she reached the end of the book and realised she was a few hundred words short so tagged on a completely random scene that wasn’t well enough explained to allow you to speculate over it properly. Other people may find that the explanation was obvious, but to me, although I have a couple of vague ideas what she might have been trying to suggest, I didn’t really feel I had enough information to go on.That’s what felt wrong in this book. It did a great job of creating the right atmosphere but it was light on plot details. I felt this especially when one character, who presumably is only there at all as a counterpoint to the other in the early pages, was written out with no further mention, presumably because he had fulfilled his purpose. Then there were moments when the narrator kept asking what two other characters were doing when they had just told him what they intended to do; It occasionally made it feel a little contrived in places. All in all not a bad book, some good classic gothic themes and imaginative take on the ghostly aspect of the story; but I personally would have enjoyed it more if it had ended before the epilogue, which didn’t really work for me. Either that or had a more substantial epilogue."}, {"userName": "G.R.", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/1515960-g-r", "userReview": "Susan Hill's latest spooky offering, Printer's Devil Court, was published by Profile Books in 2014. At a little over a hundred pages long, I shot through it in no time, and I enjoyed it a great deal. It's perfect reading material for these cold, wet, gloomy winter evenings.Following the death of Dr Hugh Meredith, a hand-sewn manuscript is sent to his stepson by the London solicitors dealing with his estate. The small book, entitled 'The Wrong Life', contains the late doctor's account of certain experiments which took place during the early days of his medical career, the effects of which haunted him for the remainder of his life...In his first year as a junior doctor, Meredith takes lodgings in a house in Printer's Devil Court, which is also occupied by three other doctors: Walter Powell, James Kent and Rafe McAllister. One foggy November evening, the four doctors have eaten dinner together and are enjoying a glass of Port before an open fire when the discussion turns to the subject of raising the dead. Walter and Rafe, after swearing Meredith to secrecy, explain that they have been conducting secret experiments and need a helping hand to continue. Out of curiosity, Meredith goes along with his two housemates, but suspects that the whole thing is just a jape. Suffering from bronchitis, Meredith is sent away to his family home in Norfolk to recuperate over Christmas and thinks little more of the doings of Walter and Rafe, until he receives a telegram: 'Enterprise critical stage. Urgent you return and witness'. The effects of what he does witness, in a little used room in the basement of the London hospital where he works, haunt him for the rest of his life.The story is well-paced and very enjoyable and, as always, Hill's descriptions of the narrator's environment are excellently atmospheric. While reading this story, I was reminded of Daphne du Maurier's 'The Breakthrough', which also deals with the idea that it is possible to trap a person's life spark at the moment of death; though, in du Maurier's case it was with a computer and for a different purpose."}, {"userName": "Jess", "userReviewDate": "Oct 12, 2014", "userURL": "http://www.goodreads.com/user/show/13802541-jess", "userReview": "I like Susan Hill. I first came across The Woman in Black when I was about 15 and it scared the life out of me. When it comes to the traditional ghost story, Hill is up there with the best. Sadly, this story really disappointed me.I hadn't realised Hill had released a new ghost story until I stumbled across it in my local library, and as Halloween is approaching I figured now would be the best time to borrow it. I'm a big fan of Gothic Literature that deals with themes such as re-animation and medical advancement gone wrong, like Mary Shelley's Frankenstein and Robert Louis Stevenson's The Body Snatcher, so I was excited to read Printer's Devil Court and be thoroughly creeped out.Sadly, it just didn't work for me. I didn't find the story spooky in the slightest, though there were some parts that made me a little sad. For the most part I was just bored. It isn't a long story at all, and yet it took me two days to get through it because I didn't feel like I had to know what was going to happen next. In fact if it were any longer I probably would have given up because I found the narrator so dull - he could have been any narrator from any story and I wouldn't have noticed the difference - and there was also the unfortunate inclusion of the \"beautiful dead woman\", which is a trope I am so tired of seeing in stories. Especially stories with male protagonists. It's creepy, and frankly if I saw someone dead or almost dead my first thought wouldn't be to mention that they're hella cute.On top of that the edition I read had quite a few mistakes and typing errors throughout that just threw me off. I don't expect to find so many mistakes in so little a book, especially not when it's been published. That's more the editor's fault than anyone else's and I know it doesn't really affect the story in any way, but I found it distracting.Sadly, it just wasn't for me but I'll still read more Hill in future."}, {"userName": "Dave Taylor", "userReviewDate": "Nov 05, 2016", "userURL": "http://www.goodreads.com/user/show/48420769-dave-taylor", "userReview": "Having previously read and reviewed Dolly and been a little unimpressed by it, I decided to give Printer's Devil Court a go. Mainly because I don't like to give up on a writer without comparing their other works, but especially not one with such an extensive back catalogue as Susan Hill. I'm glad I tried this book, like Dolly (and most of Susan Hill's novels) it is classed as a 'chiller' but, much like Dolly, I found that it wasn't really scary it just had more suspense to hold my attention.Without giving anything away this relatively short novel is about mans never ceasing quest to subvert the laws of nature, with a slight nod toward Mary Wollstonecraft Shelly's 'Victor Frankenstein'. With both these books (and hopefully her style doesn't change much), the author writes in what could be said to be a style reminiscent and evocative of Edgar Allen Poe, H.P. Lovecraft, Bram Stoker and/or Mary Wollstonecraft Shelly. More recent writers with this sort of Victorian sparseness to their work, in my opinion were: Roald Dahl (in his Tales of the Unexpected) and, to a certain extent Ernest Hemingway. They used descriptive language without added embellishment. All these writers had the same thing in common, they managed to write in such a way that you feel that you are there, living the scenes yourself.Susan Hill has this ability in spades."}, {"userName": "Holly", "userReviewDate": "Jan 05, 2015", "userURL": "http://www.goodreads.com/user/show/4717304-holly", "userReview": "I really love Susan Hill's writing. This is the fourth work I've read by her, and I'm excited to read more.Printer's Devil Court is a Victorian ghost story in the vein of M.R. James or Joseph Sheridan Le Fanu and the plot is reminiscent of Frankenstein. The story's overall tone is very Victorian, so if you have a problem with slow, old-fashioned pacing and style, you may not want to pick this one up (I can see that many other Goodreads reviewers weren't fans!) Printer's Devil Court is not as good as The Woman in Black, but it's comparable to Dolly or similar Hill stories (though I have to say that I preferred Dolly). If you're only used to modern horror stories, you may not like this one! If I had half stars, I'd probably give this a 3 1/2 out of 5."}, {"userName": "Charlotte", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/4732637-charlotte", "userReview": "I was very impressed by this short story. Hill's prose is completely evocative of Victorian London, and the characterization is superb given that there is very little room for description in so few pages. The story is told via a book written by a doctor entitled 'The Wrong Life' that has fallen into the hands of his stepson. It tells of the doctor and his peers that all lodged in the same house. Two of his housemates began engaging in some strange research and the protagonist was witness to a very disturbing and eerie experiment. Over the years he tried to forget about what happened, and moved to the country to start a family and work as a rural doctor. However, one day he returned to the hospital at which the experiment occurred and that night he is confronted with a horrifying vision in a church graveyard which causes him to question everything. A really spooky read with a great sense of atmosphere, it would be perfect for a stormy winters night."}, {"userName": "Paul", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/8624680-paul", "userReview": "I enjoyed this. A quaint little ghost story that was quite Dickensian in its telling.It was a neat little read, easy on my repairing brain, and I suppose in terms of length it must fall into the novella/novelette range. Susan Hill left a lot up to the reader's imagination in her telling, and this is most refreshing.As a ghost story it was cute. Lots of questions and no real answers (which I like) as it keeps you thinking after you've finished. If you're looking for a book that's not taxing but is equally quite interesting then give it a go. If I could, I'd give it 3.5 stars.I think you'll enjoy it as a bitesize read."}, {"userName": "Damaskcat", "userReviewDate": "Oct 29, 2013", "userURL": "http://www.goodreads.com/user/show/6945307-damaskcat", "userReview": "Dr Hugh Meredith – country doctor in the West Country – leaves his step-son a manuscript which reveals some very shady goings on from when he was doing his medical training. What he witnessed during a macabre experiment carried out by his fellow medical students haunted him for the rest of his life.His story is likely to haunt the reader as well. This is an atmospheric and unsettling short story from a master of the macabre and ghostly and will delight anyone who enjoys understated ghost stories. It is well written and the characters are well drawn even though they are only sketched in a few words."}], "description": "One murky November evening after a satisfying meal in their Fleet Street lodgings, a conversation between four medical students takes a curious turn and Hugh is initiated into a dark secret. In the cellar of their narrow lodgings in Printer's Devil Court and a little used mortuary in a subterranean annex of the hospital, they have begun to interfere with death itself, in shadowy experiments beyond the realms of medical ethics. They call on Hugh to witness an event both extraordinary and terrifying. Years later, Hugh has occasion to return to his student digs and the familiar surroundings resurrect peculiar and unpleasant memories of these unnatural events, the true horror of which only slowly becomes apparent.", "title": "Printer's Devil Court", "url": "http://www.goodreads.com/book/show/23348593-printer-s-devil-court", "average": 3.22, "cover": "https://images.gr-assets.com/books/1431488234l/23348593.jpg", "reviews": 215, "authors": [{"url": "https://www.goodreads.com/author/show/18874.Susan_Hill", "name": "Susan Hill"}], "type": ["Horror", "Fiction", "Horror", "Gothic", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/23348593-printer-s-devil-court", "http://www.goodreads.com/book/show/22601736-printer-s-devil-court", "http://www.goodreads.com/book/show/18684588-printer-s-devil-court", "http://www.goodreads.com/book/show/23357518-printer-s-devil-court", "http://www.goodreads.com/book/show/30180719-printer-s-devil-court", "http://www.goodreads.com/book/show/30354378-printer-s-devil-court", "http://www.goodreads.com/book/show/37034.The_Woman_in_Black", "http://www.goodreads.com/book/show/37040.The_Various_Haunts_of_Men", "http://www.goodreads.com/book/show/37036.The_Pure_in_Heart", "http://www.goodreads.com/book/show/8675320-the-small-hand", "http://www.goodreads.com/book/show/7505921-the-shadows-in-the-street"]}