{"ratings": 18889, "userreviews": [{"userName": "Pouting Always", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "[ Paul goes to Korea and finds out his books aren't actually translated but rather used to publish someone else's story (hide spoiler)]"}, {"userName": "Obsidian", "userReviewDate": "Aug 24, 2017", "userURL": "http://www.goodreads.com/user/show/35942740-obsidian", "userReview": "I honestly don't feel like reliving what I already wrote in my update besides the fact that I don't know if I would have liked this more in the original French or what. The dialogue seemed off to me and the plots (such as they were) did not seem realistic at all.The book focuses on two characters. Mia who is an English actress who I guess is famous. And Paul, who is a writer who has become a success in Korea. Yeah you read that right. I would honestly just say that this book is the literary version of the movie Drinking Buddies to me. You have two people who keep saying that they are not interested in each other, but keep doing enough to let you the audience know that they are interested in each other. Of course just like with that movie, I am reading a book knowing that these two people are terrible for each other. Heck, I would have liked the book more if the author had went with that as a plot instead of this yeah they are somehow falling for each other thing.I didn't really like the flow since the book just felt stuck and then the action moves to Korea of all places. I wonder if the author has been there since I don't even get a sense of Korea. I just had to read about hotel rooms, some food, and Mia and Paul being asinine in another country."}, {"userName": "Maria Clara", "userReviewDate": "Jan 06, 2017", "userURL": "http://www.goodreads.com/user/show/46308842-maria-clara", "userReview": "Es increíble, estoy pensando qué decir de esta novela y, sencillamente, me encuentro con la famosa página en blanco. Supongo que algo de culpa la pueda tener el protagonista que, como escritor, la sufre en algún momento de la historia. O puede ser que en este caso las palabras sobren; aunque, claro, sin palabras, la página seguirá en blanco."}, {"userName": "Lisa", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/15493045-lisa", "userReview": "A delightful love story set in Paris, where everything is not quite what it seems. SUMMARYOn the big screen Mia plays a woman in love. But in real life, she’s an famous British actress in need of a break from her real-life cheating husband. She escapes from London to Paris behind a new haircut, and a waitressing job at her best friend Daisy’s, restaurant. Paul is an American author, living quietly in Paris, and doing his best to stay out of the literary spotlight. When Paul’s best friend secretly sets him up with Mia through a dating website, the two are off to a laughable start. Paul and Mia‘s relationship status is “complicated” and they decide to remain “just friends.” But can men and women just be friends? While Mia tries to decide what to do about her philandering husband, Paul visits Korea for a book tour, where his books are surprisingly popular. But not everything is quite what it seems. “One day, I’m going to live in theory, because in theory everything goes perfectly…““If I were going to read one of your books, which one would you recommend?” “I’d recommend one by another author.”REVIEWP. S. from PARIS is a delightful romantic comedy set in the City of Love. It’s a fast-paced and light read perfect for a day at the park or on the beach. The Paris descriptions are enjoyable and many of the scenes will make you smile. Paul’s fear of media attention and flying on airplanes adds an endearing quirkiness to his character and, Cristoneli, Paul’s Italian editor of an American author in France has trouble actually speaking French and tends to bungle his words sometimes creating new and hilarious mixed up words. P.S. from PARIS is recommended for those who just want something a little light and funny topped with a scoop of romance. It’s marveful and spectaculous.MARC LEVY was born in France. He has written 18 novels and his work has been translated into 49 languages. He currently lives in New York City and through a nation-wide poll has been ranked as one of France’s favorite authors."}, {"userName": "Diana", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/13036247-diana", "userReview": "What a charming romantic comedy! I will admit it took me a bit to get into the writing style. (I often wonder how much is lost in translation??). However, it is a short book and I was engrossed before long. This is the kind of book that puts a smile on your face while reading. I can definitely see this as a movie that I would enjoy watching. A great, light-hearted, short summer read."}, {"userName": "Miss_", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/4303531-miss", "userReview": "De mis libros favoritos del 2016"}, {"userName": "Nicole", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/8159103-nicole", "userReview": "This book didn't do it for me. It was a Kindle First book, and I'm glad it was free. I didn't like the writing. Like, at all. Perhaps it's better in French? The point of view felt lazy, not omniscient. The dialogue wasn't believable to me, which was unfortunate since the story relied on the heavy dialogue and minimal descriptions. The characters didn't seem like real people and the whole story just felt 'meh.' There was something missing -- I just didn't believe the characters or their stories. It also bothered me that I always had to assume when the characters were speaking French or English. I mean, duh, the story is in France, but four out of five of the main characters are native English speakers, so it seemed obvious to me that they would switch between languages. I think there was one scene in the novel where they were like \"let's speak French.\"I'm obviously in the minority here. A lot of people really like this book. I'm just not one of them."}, {"userName": "Fatima", "userReviewDate": "Mar 06, 2018", "userURL": "http://www.goodreads.com/user/show/55256951-fatima", "userReview": "Mia is a British actress who needs a break from her philandering husband and from her fame, so she travels to Paris and lives with her best friend. On the other hand, Paul is a writer whose first novel was a major hit but he just wants to runaway from fame so he ends up living in Paris. Both of them bump into each other and that's when love spreads in the air. The story is like a normal Bollywood film. Paul is a great character. Anyone who is a writer will love his character. Actually what make this novel good is the scenes of the novel. The scenes are descriptive and written smoothly. You actually feel like you are roaming on the streets of Paris. While reading the descriptive scenes of Paris, I was mentally there.What is not working is the story. Mia is British actress. She can't hide in Paris and no one could recognize her. And yes, what I did not like is the way writers are portrayed, like how Paul has been portrayed( shy and running away from fame). I mean who doesn't like fame, If I would be a successful writer one day, I would like to sign books and all. I would recommend this book to those who love reading Dramas and to writers to check how scenes are written."}, {"userName": "Thanh Thanh", "userReviewDate": "Oct 16, 2015", "userURL": "http://www.goodreads.com/user/show/38771557-thanh-thanh", "userReview": "4.5/5 Hôm bữa có một bài báo cho rằng những cuốn sách của Marc Levy và Musso chỉ được xem là ngôn tình, vì vậy không được đánh giá cao như những tiểu thuyết Pháp kinh điển khác. Mình thấy cũng đúng, chúng giống ngôn tình thật, nhưng nếu mọi cuốn ngôn tình trên thế giới đều được viết như phong cách của bác Marc, thì mình sẽ đánh giá thể loại truyện này cao hơn nhiều. Dù truyện nhẹ nhàng, nhưng qua nhiều chi tiết và lời nói bình thường của nhân vật ta vẫn có thể thấy tâm đắc và triết lí, chắc chắn là có nghĩa hơn những câu ngôn tình sến súa ta hay thấy bạn bè share trên Facebook. Có lẽ đây là cuốn sách hài hước nhất mà Marc Levy từng viết, và nó chẳng giống gì với những cuốn trước đây. Đúng như cái tên, chuyện kể về Chàng và Nàng, họ gặp nhau, làm bạn, yêu nhau...và còn đủ thứ khác nữa. Như một bộ phim hài, có khá nhiều tình huống dở khóc dở cười và các nhân vật thì thích châm chọc nhau. Và vì mình coi nó như truyện cười, nên cái chi tiết lừa dối người dân Hàn dù rất ảo và phi logic nhưng mình cho qua và còn thấy truyện mắc cười hơn."}, {"userName": "Rachel", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/1099875-rachel", "userReview": "Lovely ReadI loved this book. Clean, straightforward writing with an engaging voice. Loved, loved, loved the twist and the ending. There were moments i laughed out loud. This book was \"marvelful.\" : )"}, {"userName": "Rebecca", "userReviewDate": "Aug 21, 2017", "userURL": "http://www.goodreads.com/user/show/295133-rebecca", "userReview": "This looked like a quick read, and turned out to be a very quick read when I decided not to finish it."}, {"userName": "Mandy", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/5859680-mandy", "userReview": "An unashamedly romantic novel from popular French writer Marc Levy. I’ve read quite a few of his love stories and they are all without exception gentle, charming, light and heart-warming, with a very French feel to them, a bit quirky with sparkly dialogue and engaging characters. I suppose overall they don’t amount to very much but I find them really enjoyable and it’s nice on occasion to read something that is no more than it pretends to be – a sweet love story. In this his latest offering, Mia an actress and Paul, a writer, meet up through a stratagem devised by friends and although each is currently involved with someone else it is obvious that true love will win out and everyone will live happily ever after. A few little unexpected plot developments make this a satisfying and entertaining read."}, {"userName": "Noémie", "userReviewDate": "Jan 24, 2015", "userURL": "http://www.goodreads.com/user/show/4737810-no-mie", "userReview": "4,5 c'est tendre et pimenté! J'ai passé un très bon moment !"}, {"userName": "Carla Palmeiro", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/16530811-carla-palmeiro", "userReview": "So, Goodreads tells me that Marc Levy is the most-read French author today and I wonder, really!? Contemporary French literature must be in a deep rut because this just won the price for the worst book I’ve read the entire year!! Fortunately, rarely do I encounter such weak writing and storytelling. This is quintessential light reading with a strong emphasis on the light part!His writing skills and storytelling did remind me of a once famous writer in my native country; Margarida Rebelo Pinto, once the most read ‘novelist’ in Portugal. Luckily ‘tugas’ eventually found the light and moved on for better things. I just hope French will soon follow.Avoid it if you consider yourself having any taste whatsoever or consider it you’re in for mindless nonsense garbage!"}, {"userName": "Gigi", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/18540533-gigi", "userReview": "DNF.The writing is stilted and I didn't feel drawn to the characters, probably because they were all quite flat and one-dimensional."}, {"userName": "Maria", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/3454514-maria", "userReview": "Um romance simples, mas que me agradou muito.Opinião completa: http://marcadordelivros.blogspot.com/..."}, {"userName": "Ali", "userReviewDate": "Jan 17, 2017", "userURL": "http://www.goodreads.com/user/show/59207938-ali", "userReview": "Historia bonita y corta (200 paginas aprox). Los diálogos entre ellos son divertidos y peculiares. No es una historia de sentimientos profundos pero es bastante entretenida y adictiva, sobre todo por la forma en que está escrita."}, {"userName": "Mi vida en hojas de papel ", "userReviewDate": "Apr 19, 2016", "userURL": "http://www.goodreads.com/user/show/36307691-mi-vida-en-hojas-de-papel", "userReview": "una historia que me ha recordado a lo mejor de Marc Levy, con una trama original, divertida, natural e inesperada, acompañada de unos personajes inconfundibles.Reseña completa aquí: http://mividaenhojadepapel.blogspot.c..."}, {"userName": "Nicko D", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/4894126-nicko-d", "userReview": "Винаги е време за любов! Още повече ако стрелите на Купидон хвърчат на фона на Айфеловата кула и Сена. Романтичната новела „Тя и той” от Марк Леви е вашият безплатен билет за едно лудо, щуро и забавно пътешествие в Париж, където две разбити сърца неочаквано ще попаднат в плен на любовта. „Тя и той” е част от каталога на издателство „Колибри”, в превод на Петър Герджиков.Писането на романтични новели е изключително опасно плъзгане по бръснача за авторите. Измисляйки интересна и забавна история обаче, съчетана с изключително приятен и четивен стил, французинът Марк Леви е сътворил невероятно вкусен бонбон, след чието поглъщане няма да добавите и една калория към талията си.Американецът Пол се премества да живее в Париж, след като не може да понесе успеха на дебютния си роман в Америка. Заживявайки в града на любовта, с годините Пол се отегчава от купоните до ранни зори и момичетата за една вечер. Той заживява в свой собствен свят, света на книгите, и отношенията му с жените се свеждат до връзка от разстояние с корейската му преводачка.Мия е филмова звезда във Великобритания, чийто приятел обаче й кръшка с асистентка. Разочарована от мъжете и търсеща малко спокойствие, тя отива на гости при своята приятелка Дейзи в Париж, която стопанисва кокетно ресторантче в центъра на града. Съвсем случайно в компютъра й Мия попада на сайт за запознанства, където си прави регистрация на шега. Не след дълго получава съобщения с покана за среща от красив, млад и интелигентен писател. Дали обаче съобщението, което тя получава й е изпратено от Пол или от неговия най-добър приятел от детството - Артър, който е загрижен за самотата на писателя?Мия и Пол се срещат на уредена вечеря в ресторант, само че писателят не знае, че е паднал в клопката на Артър и е на любовна среща с красива актриса. Мия пък се чувства ужасно неловко от създадената ситуация, че жена с нейното реноме и слава може да си търси мъж в сайт за запознанства.Възможно ли е изпитаме най-силното чувство на света с помощта на чужда намеса или търсенето на любовта е самостоятелен път? „Тя и той” е от онези забавни и интригуващи романи, които могат да се четат по всяко време, а прозата на Марк Леви е глътка свеж въздух, която със сигурност ще ви разведри със забавното си съдържание. Повествованието на французина оживява в читателското съзнание ала американска романтична комедия.Марк Леви е популярен френски писател, роден през 1963 г. в Бийанкур. На осемнайсет години постъпва в организацията на Червения кръст и едновременно следва в Париж стопанско управление и информатика. Още като второкурсник създава първата си компания. През 1984 г. заминава за САЩ, където участва в създаването на две фирми за компютърна графика, а по-късно ръководи студио за обработка на компютърни изображения. През 1991 г. се връща във Франция и става един от основателите на компания, занимаваща се с архитектура и вътрешен дизайн. След което рязко сменя посоката и се отдава на писане. Още първият му роман „Ами ако това беше истина” (2000), го прави известен. Книгата е екранизирана през 2005 г, преведена е на около четирийсет езика и е издадена в трийсет и пет страни. След този голям успех писателят се установява в Лондон, а по-късно - в Ню Йорк."}, {"userName": "Dee Arr", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/60710386-dee-arr", "userReview": "Over the years, I have found that books that promise to be funny or a “comedy” seldom live up to the hype. While I am not sure why I took a chance with author Marc Levy’s “P.S. from Paris,” I have to say that it was not a disappointment. Here’s why:CHARACTERS – Mia is an actress, caught between her career and the actions of her philandering husband. Her life is one that pulls her in directions she doesn’t always want to go, and she struggles with the feelings that she begins to feel for Paul. Paul Barton, who is essentially a one-hit wonder when it comes to the novels he has written, already has a long-term lover. However, it is easy to see he has feelings for Mia. Both of the main characters are deeply described, and readers are able to see the thoughts they share with us (even as they keep those secrets from each other).There are a couple of supporting characters – Daisy, who is Mia’s best friend, and Cristoneli, Paul’s editor. Both help to move the story along. Daisy is a thorn or a salve at any given moment, but her best wishes are always for her friend. Cristoneli is a humorous person, and although he is a bit one-dimensional, I enjoyed the chapters where he is featured.PLOT – Let’s face it, a romantic comedy is a romantic comedy. However, Mr. Levy has thrown in a number of twists, so many that a mystery writer would be proud. There were a couple of times where I felt the plot was beginning to bog down, but the author was always there to rekindle the action and keep me reading. In fact, the last 15% had me so wrapped up that I couldn’t turn the pages fast enough.The scene where Mia and Paul meet is priceless. Thrust together unknowingly and not for the reasons each of them suspect, the chapter is definitely one of the best in the book. The interplay developed at that time continues throughout the story, making this an enjoyable tale.DIALOGUE – This book lives on dialogue, no matter whether it is between characters or when Mia or Paul are having a discussion within their own minds. Because of this, the book flies by, and the characters are intimately revealed by what they say…and also, by what they don’t say.JUST IN CASE YOU WANTED TO KNOW – Most of the vulgarities present in many books today are missing, although there are a few words here and there. All scenes of affection are tastefully done and it would not be embarrassing if a younger reader browsed through and read them.OVERALL – While I did not laugh out loud, many of the scenes put a smile on my face. The story is charming and a lot of fun. Mr. Levy’s deft handling of two people falling in love while not realizing it deserves five stars."}, {"userName": "Nata", "userReviewDate": "Nov 13, 2016", "userURL": "http://www.goodreads.com/user/show/8227768-nata", "userReview": "E prima carte pe care o citesc de Marc Levy și contrar multor opinii pe care le-am auzit despre scrierile lui, mie mi-a plăcut destul de mult acest roman. L-am citit cap coadă făcând nouă ore de drum spre București. Umorul cred că salvează foarte mult această carte, dar e atât de potrivit cu personajele și acțiunile lor. E vorba despre Paul și Mia. El scriitor, ea actriță. Li se înscenează o întâlnire de care ei nu au habar. Hotărăsc să rămână prieteni. Mia suferă după o dragoste neîmpărtășită, Paul iubește o coreeană de la mare distanță. Frici peste frici. Fugă de realitate. Gânduri și sentimente pe care nu vrei să le recunoști, dar care au un impact foarte mare asupra sufletului și asupra a tot ceea ce ai făcut până în momentul în care ai decis că așa nu se mai poate. Mi-a plăcut romanul. Umorul la ordinea zilei. Personaje bine conturate. Limbaj accesibil. Stil de a scrie atrăgător, eu așa l-am găsit și sper să-mi placă la fel de mult și celelalte cărți ale lui."}, {"userName": "Middlemist Red", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/28941431-middlemist-red", "userReview": "‘Elle et Lui’ is a lovely romantic comedy that I can picture exactly as a great movie, if anybody would look into it and decide to have a new go at this Author.I had never read Marc Levy but obviously knew him by name. This is an author who sells a lot of books every year, and one of the French authors the most “profitable”. This book contains some very funny passages, misunderstandings, and dialogues with cute puns. Sure, it's not great literature, but it is such an easy and enjoyable read that swallows almost four hundred pages within hours. Too bad the plot is predictable and the end was too fast for my taste.I’m looking forward to read his other novels."}, {"userName": "Nada EL Shabrawi", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/9361151-nada-el-shabrawi", "userReview": "Sweet, beautiful, and funny romance."}, {"userName": "Grace", "userReviewDate": "Aug 17, 2017", "userURL": "http://www.goodreads.com/user/show/21044214-grace", "userReview": "2.5 starsThis was my first time using Kindle First. The idea behind the story was intriguing, but the execution was lacking in my opinion. I'm not sure if this book was translated from French, so that might be part of the problem. But ultimately it came down to the characters, both of which I had trouble connecting with. I liked how they first met but never understood how they weren't honest to each other, their friends, or themselves.I liked the book more once they arrived in Korea and where the story led from there, but that was after the 60% point when it was hard to overcome my initial impressions."}, {"userName": "Maria Sol", "userReviewDate": "Apr 22, 2016", "userURL": "http://www.goodreads.com/user/show/21424508-maria-sol", "userReview": "No me gustó, principalmente creo que con lo que menos pude conectar y por ello que este libro no me gustara, es con el estilo del autor, demasiado inconexo, todo pasa como muy rápido y sin demasiadas explicaciones, me faltaron muchas cosas en este libro, mucha mezcla, se lée muy rápido y todo queda sin profundizar en nada. Es una lástima porque creo que la historia esta buena, pero realmente la forma en que esta contada no es para mí, es el primer libro que leo de este autor y si lo quieren leer advierto que algunos personajes aparecen en otros de sus libros."}, {"userName": "Lucia Ortega", "userReviewDate": "May 04, 2016", "userURL": "http://www.goodreads.com/user/show/44285106-lucia-ortega", "userReview": "3,5/5Me ha gustado la historia pero los diálogos algunas veces me parecía forzados y los protagonistas muy serios y sosos.Es un libro ligero, rápido de leer y perfecto para desconectar :D"}, {"userName": "Furrawn", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5437232-furrawn", "userReview": "Actress. Omelet. Writer. San Francisco. Opera. Paris. Caricaturist. Bench. Grocery list. Translator. Grocery list again. Joy. Fear. Airplane. You know the way a books is sometimes a perfect balance of what you want in a book right at that moment? I wanted a light and playful yet deep and thoughtful book. Those books are difficult to find. This book was everything I hoped and wanted it to be!"}, {"userName": "Maria Carmo", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/3054983-maria-carmo", "userReview": "What an adorable way of meeting some of our favorite characters of Marc Levy again after several years! How close one can feel to these characters, these stories that entwine themselves and lead us by the hand in a mounting thrill, until the end which, apparently, is never quite final (remember how his first book with Lauren and Arthur \"If only it were true\" (where Paul was Arthur's best friend) was followed, years later, by \"Finding You\" - the meeting of Lauren and Arthur again...This time - and without giving out any spoilers, so you may read this book with as much pleasure as I did - Paul in the main character but his friends Arthur and Lauren still resurface once again...A marvelous romantic comedy that I can picture exactly as a great movie, if anybody would look into it and decide to have a new go at this Author.At the same time, a wonderful story within the story, the cause that the Author finally embraces. Let us see if the sub plot the writer was working on will also become a Marc Levy new book, who knows?Absolutely a good read!Maria Carmo,Lisbon 30 March 2015."}, {"userName": "Laura", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/58575210-laura", "userReview": "3,5 estrellas. Después de leer historias densas, me gusta desconectar con este tipo de libros. Me he reído muchísimo con estos dos... El final un poco flojillo."}, {"userName": "Mathieu Mazza", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/17996444-mathieu-mazza", "userReview": "Ma chronique : http://enjoybooksaddict.blogspot.fr/2..."}], "description": "From Marc Levy, the most-read French author alive today, comes a modern-day love story between a famous actress hiding in Paris and a bestselling writer lying to himself. They knew their friendship was going to be complicated, but love—and the City of Lights—just might find a way.On the big screen, Mia plays a woman in love. But in real life, she’s an actress in need of a break from her real-life philandering husband—the megastar who plays her romantic interest in the movies. So she heads across the English Channel to hide in Paris behind a new haircut, fake eyeglasses, and a waitressing job at her best friend’s restaurant.Paul is an American author hoping to recapture the fame of his first novel. When his best friend surreptitiously sets him up with Mia through a dating website, Paul and Mia’s relationship status is “complicated.”Even though everything about Paris seems to be nudging them together, the two lonely ex-pats resist, concocting increasingly far-fetched strategies to stay “just friends.” A feat easier said than done, as fate has other plans in store. Is true love waiting for them in a postscript?", "title": "P.S. from Paris", "url": "http://www.goodreads.com/book/show/34036335-p-s-from-paris", "average": 3.7, "cover": "https://images.gr-assets.com/books/1485611095l/34036335.jpg", "reviews": 1316, "authors": [{"url": "https://www.goodreads.com/author/show/61788.Marc_Levy", "name": "Marc Levy"}, {"url": "https://www.goodreads.com/author/show/7793421.Sam_Taylor", "name": "Sam Taylor"}], "type": ["Romance", "Fiction", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/34036335-p-s-from-paris", "http://www.goodreads.com/book/show/29868995-ella-y-l", "http://www.goodreads.com/book/show/28816624-ella-y-l", "http://www.goodreads.com/book/show/28255365-chuy-n-ch-ng-n-ng", "http://www.goodreads.com/book/show/24671869-elle-lui", "http://www.goodreads.com/book/show/35171631-ela-e-ele", "http://www.goodreads.com/book/show/38389329", "http://www.goodreads.com/book/show/36112620-p-s-from-paris", "http://www.goodreads.com/book/show/386887.If_Only_It_Were_True", "http://www.goodreads.com/book/show/123765.O_es_tu_", "http://www.goodreads.com/book/show/7970021-le-voleur-d-ombres", "http://www.goodreads.com/book/show/182671.La_prochaine_fois", "http://www.goodreads.com/book/show/17304270-seven-days-for-an-eternity", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}