{"ratings": 439, "userreviews": [{"userName": "Hannah", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/17442587-hannah", "userReview": "Another excellent installment in the Nikki Boyd series. These books are so addictive! I love Lisa Harris's writing, and it's great that the stories are squeaky clean, too. Plenty of thrills and danger without sensuality or curses. Happy face! Do yourself a favor: when you start book one, have two and three all lined up behind them. Definitely recommended.Nikki has a lot to deal with in this story. The main suspect appears to have his finger in every pie, yet is so charming and innocent in person that he couldn't possibly be the one...could he? Is there another plausible suspect with fingers in every pie? Harris definitely kept me guessing with the layered characters. Though the romance is still understated, it ticks up quite a bit between Nikki and her man. Also, though it's evident that Nikki is a reliever, there's less of a faith message than in the previous two books. But I'm okay with that because of understanding Nikki's faith from the other stories."}, {"userName": "Laura", "userReviewDate": "Apr 06, 2017", "userURL": "http://www.goodreads.com/user/show/2521894-laura", "userReview": "First, the disclaimer. \"I was provided a free copy of this book. All opinions are my own.\" That done, PURSUED is, I think, the first book I've read by Lisa Harris, but I am greatly impressed. This suspense grabbed hold and held on through-out the entire book. Yes, I knew who the bad guy was. I knew why. But the suspense was in Nikki trying to find the missing key witness before the villain did. How did the witness disappear so fast? Even more scary is airline officials denied that anyone was even sitting in the seat next to Nikki after the airplane crashed... that seat was empty. Was the woman a figment of her imagination? I had to keep reading to see what happened next. And how it would play out. I haven't read any of the other books in this series, but this one easily stands alone. I maybe tempted to go back and read Missing and Vendetta though. Fans of suspense will definitely want to read PURSUED. There is no faith message and the romance is there, but only slightly."}, {"userName": "Staci", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "This third novel from the Nikki Boyd Files was action packed! The action begins on page one and doesn't let up until the final few pages.Nikki is traveling on a commercial flight from Houston to Nashville when there is an explosion downing the plane. She is looking forward to seeing Tyler after his return from the Middle East. Instead of spending time with Tyler, she finds herself on a 48 hour ride to find a missing passenger from the plane.The Nikki Boyd Files series is recommended for fans of suspense.My gratitude to the publisher, Revell, for a complimentary net galley copy of Pursued. The opinions expressed are my own. I was not required to post a review."}, {"userName": "Karen", "userReviewDate": "Mar 27, 2017", "userURL": "http://www.goodreads.com/user/show/18944747-karen", "userReview": "Fans of police dramas will enjoy this fast moving story! From the first exciting scene to the end, it all takes place in just a few action-packed days.  Nikki leads an exciting life as a missing persons investigator in Nashville. She is a good character, tough and smart, but compassionate when needed. Plenty of action and suspense with some gritty scenes, yet also some touching moments squeezed in that add inspiration and a little bit of a romantic interest carried over from the other books. Nothing sugar-coated or too sappy here. Third book in the series, but easily reads as a stand alone. Recommend! (Book provided by NetGalley and the publisher. All opinions are my own.)"}, {"userName": "Rebecca", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/10732829-rebecca", "userReview": "\"Sometimes today's troubles left her feeling as if she were drowning . . . . and these past twenty-four hours . . . . . \"T. B. I. agent Nikki Boyd has just survived a plane crash; one of her seat-mates did not survive, and the other one has disappeared; in fact, the flight manifest never recorded the young woman's presence at all, but Nikki has her watch to prove it. Suddenly finding herself in the middle of an F. B.I. investigation, instead of reuniting with Tyler Grant, the growing love of her life, Nikki is determined to find the young woman who was scheduled to testify in a grand jury investigation.The next forty-eight hours are crucial, especially when the stakes are suddenly raised higher than anyone expected. There are a trail of deaths to follow, but just where is Erika Hamilton? Fighting injury, exhaustion and desperation, follow Nikki and her team as they bravely pursue justice for all.A riveting read!"}, {"userName": "Donna Thompson", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/7337222-donna-thompson", "userReview": "I didn't think I could love another series by Lisa Harris as much as I loved her Southern Crimes series, but the Nikki Boyd files definitely give it a run for its money. \"Pursued\" is the third book in the series and although you'd get more enjoyment out of reading the entire series, you don't have to in order to enjoy this one. The book takes off with a bang, literally, as the flight Nikki is on crash lands and the woman in the seat next to her vanishes, seemingly into thin air. In the midst of all the turmoil, Nikki also has to manage some personal crises of her own, but her lasting faith in God is the anchor that pulls her through. I enjoy not only the suspense and thrill-a-minute aspect of Ms. Harris's books, but also the relationships, complex characters and trust in God that she manages to interweave effortlessly with the non-stop action. This book will keep you flipping pages at warp speed."}, {"userName": "Cara Putman", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/674427-cara-putman", "userReview": "Enter another fast-paced race against time. I love the way that this series is an adrenaline charged adventure. The romance takes a back-seat, yet moves a step forward sweetly toward what I hope is a forever for the characters. The twists and turns kept the pages flying for me. A perfect read for those who love romantic suspense where the suspense takes center stage."}, {"userName": "Lindsey (Books for Christian Girls)", "userReviewDate": "Apr 20, 2017", "userURL": "http://www.goodreads.com/user/show/19266895-lindsey-books-for-christian-girls", "userReview": "About this book:“Nikki Boyd's flight into Nashville was routine—up until the crash landing at the airport.  When the dust settles, Nikki discovers that the woman who had been seated next to her on the plane is missing—and no one will admit she was ever there. When she learns that Erika Hamilton had been flying to Nashville with an air marshal as a key witness in an upcoming grand jury trial, Nikki wonders if her disappearance from the crash site means she’s running from trouble—or straight into it. Before Nikki can even see her family, she and her team are pulled into a missing persons case where the motives are as unclear as the suspects.”Series: Book #3 in the “Nikki Boyd Files” series. Review of Book #1 review Here! and Book #2 Here!Spiritual Content- 2 Corinthians 4:17 at the beginning; A couple Scriptures are remembered & mentioned; Many Prayers; Talks about God & Him being in control; ‘H’s are not capital when referring to God; Mentions of God, Jesus, & trusting Him; Mentions of prayers & praying; Mentions of churches; A few mentions of miracles; A couple mentions of Heaven. Negative Content- Minor cussing including: a ‘sucks’, two ‘stupid’s, three ‘stupid’s, and five ‘shut up’s; Pain, injuries, blood/bleeding, fighting/wrestling, being shot, being hit/attack, being chased by dogs, a break-in, a crash landing, explosions, a car crash, being held hostage, & nearly being killed (up to semi-detailed); Watching a few people die (including a suicide) (up to semi-detailed); Fighting over a gun & someone is killed (not Nikki, up to semi-detailed); Finding bodies, murders, checking pulses, blood & injuries/wounds (up to semi-detailed); A nightmare (semi-detailed); Many mentions of murders & murderers (up to semi-detailed); Mentions of the possibility of being killed (up to semi-detailed); Mentions of Nikki’s missing sister, the abductor, past murders & the possibility she was murder; Mentions of deaths & dying (barely-above-not-detailed); Mentions of brutal murder, a killer & killing; Mentions of murders, murderers, bodies, wounds & murder scenes (up to semi-detailed); Mentions of a car fire, explosion, a burned body & the smell of burning flesh (up to semi-detailed); Mentions of a suicide; Mentions of pain, those shot, injuries/wounds, & bleeding/blood (up to semi-detailed); Mentions of someone stabbed, a knife & blood (up to semi-detailed); Mentions of weapons, weapons shot & aimed; Mentions of snipers; Mentions of women who were held hostage for long amounts of time; Mentions of a car chase & one hitting a railing going into a gully; Mentions of illegal activities; Mentions of hit-men & thugs; Mentions of drinking, gambling, & addictions; Mentions of prisons, jails, inmates & an attack in a prison; Mentions of military tours & a bullet in a man’s leg; Mentions of the plane’s crash landing; Mentions of break-ins; Mentions of lies & lying; Mentions of divorces; Mentions of nightmares; Mentions of hunting; A few mentions of a drunk driver who killed another driver; A few mentions of gangs; A few mentions of drugs & drug trafficking; A few mentions of embezzlement; A co when someone was shot & almost died (barely-above-not-detailed); A couple mentions of a Mafia group; A couple mentions of burglaries & thefts; A couple mentions of tattoos; A mention of a war; A mention of domestic violence; *Note: A mention of designers (Oscar de la Renta & Prada); A couple mentions of Star Trek; Sexual Content- a forehead kiss, two barely-above-not-detailed kisses, and two semi-detailed kisses; Remembering kisses (up to semi-detailed); Touches, Embraces & Smelling (up to semi-detailed); Noticing; Mentions of an on-again, off-again affair (between the missing woman & her “sugar daddy”) and a child was conceived; Mentions of other affairs & a married couple with an “open relationship”; Mentions of a womanizer/player; Mentions of blushes; A few mentions of a teen guy who got a girl pregnant & she had an abortion; A few mentions of jealousy; A mention of an abusive boyfriend; A mention of a cheating spouse; A mention of swooning; Being in love & a bit of the emotions; *Note: Mentions of ovarian failure & infertility; A mention of butting into someone’s life. -Nikki Boyd P.O.V. of Nikki 300 pages~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*Pre Teens- One Star New Teens- One StarEarly High School Teens- Two StarsOlder High School Teens- Three StarsMy personal Rating- Four Stars {OHS girls can add up to a full star for interest in law enforcement &/or murder mysteries.}Wow. What a crazy read. This was a highly anticipated read for me after the ending of the last book. I've waited nearly a year to get my hands on this one. And oh my goodness, this did not disappoint for my suspense-lovin' heart. Oh. This was just what I was expecting and more. Nikki is back and just as awesome as ever. I loved all the twists and turns of this third book. Shockingly my heart wasn't racing as much as I thought it would be, but I did get completely involved into the plot and was quite literally pouting when it was over. I also have to take a moment and just swoon over how this cover looks with the previous two books cover. And let's not get me started on the spines. #AllTheHeartEyesNow that I know the news about the fourth book in the series about Nikki's sister. I’m going to say it's going to be intense, I'm calling it now.Link to review:https://booksforchristiangirls.blogsp...*BFCG may (Read the review to see) recommend this book by this author. It does not mean I recommend all the books by this author.*I received this book for free from the Publisher (Revell) for this honest review."}, {"userName": "Melanie", "userReviewDate": "Apr 26, 2017", "userURL": "http://www.goodreads.com/user/show/5396610-melanie", "userReview": "4.5 starsI think Pursued is my favorite book in the series so far. After being slightly disappointed in the previous book, I was a little nervous that this book would also let me down...but it didn't and instead I was hooked and really enjoyed the story. I loved how the romance that had been teased about in the first two books, finally ended up being a part of the story. I really like both of those characters and seeing them in a relationship is great and makes me happy for them. :) The suspense was good and kept me turning pages. There were some very intense scenes and even some unexpected events. All in all, Pursued was a thrilling read. I really liked it and recommend the book. *I received a complimentary copy of this book for my honest review. As always, all thoughts and opinions expressed are my own.*"}, {"userName": "Caitlyn Santi", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/6980753-caitlyn-santi", "userReview": "Another fabulous read from Lisa Harris! I think Vendetta is probably still my favorite of the series, but this one was excellent too! Can't wait to read Vanishing Point later this year!"}, {"userName": "Natalie Walters", "userReviewDate": "Apr 13, 2017", "userURL": "http://www.goodreads.com/user/show/12771423-natalie-walters", "userReview": "Book #3 in The Nikki Boyd Files takes us on another trip with Special Agent Nikki Boyd of the Tennessee Bureau of Investigations. Action fills the pages of this book from the start when the plane Nikki is traveling crashes upon landing and the woman sitting next to her mysteriously disappears.This suspense story certainly delivers. It seemed that every other chapter significant setbacks held the heroine from accomplishing her mission but I have to admit that by the time I got to the last ten chapters I was exhausted. And so I skimmed ... yeah, not entirely proud of that but I really just wanted to see the story end and the good guy win and the bad guy go down. The story doesn't slow down much if at all regardless of the interpersonal struggles the heroine is facing. I know this is suspense but I really, really wanted something more to happen between Nikki and beau Tyler. After all, in the last novel they were so close ... and then BAM! I have to wait until next book and yet here I am still wanting some closure or something more ... maybe I've been reading too much romantic suspense 😐. Regardless of my need for some romance, I did find the heroine's dismissive response to her family and friends post-plane crash (and several other life-threatening moments) a bit too much for me to empathize with. I get being all job-focused and whatever but I would've liked to seen Nikki respond differently--or at the very least a reasonable explanation besides a missing person case to keep her away from them. Even my soldier knows how important familial connection is post-traumatic events. The plot is full of crashes, explosions, and near-death experiences that will make suspense fans happy. The faith element isn't preachy but the heroine offers up prayer in her times of need, which at times felt superficial to the plot but authentic to the character. I think fans of Lisa Harris and Nikki Boyd will be satisfied with this new release and anxious for the next.***I received a copy of this book from the publisher in exchange for my honest review."}, {"userName": "Maureen Timerman", "userReviewDate": "Apr 03, 2017", "userURL": "http://www.goodreads.com/user/show/3840941-maureen-timerman", "userReview": "Can you imagine sitting next to someone on a plane and having the plane crash, you survive, but they tell you that no one was in the seat next to you? Must have a concussion, but you have something in your possession that proves you are right, will they believe you? This is basically what happens to Nikki, and what it leads to is unimaginable.By the end of this book it is a miracle that Nikki even survives, from one page to the next her life is one the line, and she seems to be an energizer bunny, and keeps on going. This is one of those books that you are quickly turning the pages for answers, but once you are at the end you wish you had gone slower, and that there was more.If you like mystery and suspense this book is for you, and although it is the third book in this series, you will not be lost to read as a stand alone, but it will make you want to read the other two, they are just as good. I want more!I received this book through the Publisher Revell and their Blogger Program, and was not required to give a positive review."}, {"userName": "Dawn", "userReviewDate": "Apr 27, 2017", "userURL": "http://www.goodreads.com/user/show/1642306-dawn", "userReview": "Nikki Boyd is returning to Nashville on what should be a routine flight. Then the plane crashes. Suddenly Nikki finds herself in the midst of chaos. When the woman who was seated next to her disappears, the FBI ask Nikki to help. But it's a race against time, and the FBI won't share all of the details. Can Nikki and her team find answers before it's too late?I've enjoyed each book in this series and this one was no exception. I loved how fast paced this book was. The twists and turns that the case followed had me eagerly turning the pages.What I found different than the others in the series was that Nikki was a victim this time as opposed to the investigator. Seeing her attempt to separate herself from her job was interesting. Especially when she was trying to figure out her relationship with Tyler.I recommend this series to anyone who enjoys romantic suspense.I received the Kindle copy of this book from the publisher via NetGalley for the purpose of giving my honest opinion. My thoughts and opinions are my own.Recommended to fans of romantic suspense, Irene HannonRating - 4 stars"}, {"userName": "Cathy Daniel", "userReviewDate": "Apr 16, 2017", "userURL": "http://www.goodreads.com/user/show/7218096-cathy-daniel", "userReview": "This book has one of the best opening scenes with the plane crash. I really felt sucked in. The first half I was completely wrapped up. Then as the second half went on and more murders, while not graphic, I started feeling it was too much. I think I'm more used to love inspired suspense books which are much tamer. Don't get me wrong, it wasn't too descriptive, it's totally a personal thing. If I were in a different mood I maybe would have even been less bothered. Since it's all mood & preference I didn't knock stars off :)"}, {"userName": "Karin", "userReviewDate": "Sep 09, 2017", "userURL": "http://www.goodreads.com/user/show/20048682-karin", "userReview": "3.5 stars rounded upNikki Boyd is flying home to Nashville, chatting with the woman next to her and looking forward to seeing Tyler who has just arrived back from three months in Africa when the plan crash lands. She realizes that Erika, the woman seated next to her is missing and the air marshal sitting next to her is ded from the crash, but apparently she was never on the plane.Nikki and her team are pulled into the case by the FBI, and a lot goes on over the next 48 hours in this action packed thriller as more questions continue to arise about Erika and those in her life. While I am not big on thrillers, this one is well done and keeps you on your seat from start to finish."}, {"userName": "Rachel", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/24104675-rachel", "userReview": "Review to follow.*Thanks to the author and publisher for a complimentary copy of this book. I was not paid or required to write a positive review and all opinions stated are my own.*"}, {"userName": "Eadie", "userReviewDate": "Apr 14, 2017", "userURL": "http://www.goodreads.com/user/show/4687834-eadie", "userReview": "I received an ARC of this book for an honest review. In order to prepare to read this book, I did read the first two books in the series as I wanted to know what happened previously. The book does a great job in explaining what has happened in the past but I just like to read series in order. I'm glad that I did because I got to see how Nikki and Tyler's relationship grew over these books. Nikki has joined the Missing Persons Task Force after her sister went missing 10 years ago. She now knows how families feel when love ones go missing and she takes her job very serious. In Pursued, Nikki is sitting on a plane next to a woman named Erika Hamilton when the plane suddenly crashes. After the crash, Nikki was looking around for Erika but she seemed to have disappeared off the plane but in the seat Nikki has found Erika's watch.I don't want to give away any spoilers but you need to read this book in order to find out why Erika has disappeared and how Nikki feels bound and determined to find her. You will not be disappointed as the book is non-stop action and adventure. The characters are well-developed and the plot is an excellent one that will keep the pages turning unstoppable. Lisa Harris' writing is amazing as she weaves twist after twist down to the last page.I now look forward to book four as the suspense in these books is like a non-stop roller coaster and I can't wait to go for another ride. I would highly recommend this series to those who love suspense thrillers with a hint of romance."}, {"userName": "Book Him Danno", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/872245-book-him-danno", "userReview": "This is the first book in the series Nikkie Boyd Flies I have read. I was worried I would be lost jumping into a series. I wasn't because Lisa Harris was able to bring the past and present together quickly keeping reader engaged in the the current story while giving new readers a chance to catch up.Lisa Harris is able to keep readers engaged though out the story while building the different characters who readers will become attached to quickly. While the plot line is pretty predictable the author is able to keep reader engaged with the strong characters who seem understand who they are in the creation of the Lisa Harris world.Pursued is well throughout book that will have reader rereading the book for enjoyment.Advance Copy from Netgalley"}, {"userName": "Natalie", "userReviewDate": "Jul 23, 2017", "userURL": "http://www.goodreads.com/user/show/49649873-natalie", "userReview": "3.5 starsThere was plenty of action and excitement, but I wasn't wild about the ending. It seemed a little too easy. I was surprised there wasn't more revealed about Nikki's sister in this one. In both of the previous books, she has gotten more information, and there wasn't much learned in this one. I also found it a little hard to believe that the book takes place over only 2 days. It's a little hard to believe that Nikki could have had that much happen to her in 48 hours.Overall a good suspenseful read. I hope everything turns out ok in the last book."}, {"userName": "Kelly Bridgewater", "userReviewDate": "Mar 31, 2017", "userURL": "http://www.goodreads.com/user/show/33835690-kelly-bridgewater", "userReview": "I love mysteries and suspense that keep me hopping and begging me not to put the book down. With Lisa Harris's The Nikki Boyd Files, I have felt like that completely. With this series, I have returned to Nikki Boyd and her best friend, Tyler, and watched her interact with the mysteries that come across her lap.The writing is clear and concise. I can completely see the setting. I could feel the airplane turbulence in the first couple of chapters and held my breath as they crashed to the earth. Harris does a good job at bringing Nikki to life in the third installment of this series. While the novel features the same heroine, Harris has stayed true to who Nikki is. She didn't do anything that seemed out of character for me. Tyler, the returning hero, is a military man who is the type of man everyone would want in their life. He supports Nikki completely even when she makes dumb mistakes and keeps putting herself in the path of danger. But there were moments that he appeared to be kind of fake. Instead of stopping the woman he loves from chasing the bad guys, he shrugs his shoulders and moves on with his life.The top reason I enjoy suspense and thrillers is the fast pace of the novel while wondering who is the bad guy. With Pursued, Harris kept the action moving. Every time a chapter was about to end, Harris would throw Nikki into another harrowing situation where she had to run for her life or be caught in the cross hairs. I had a really hard time putting the book down. I stayed up way too late finishing the book, which I love. But I had a hard time believing that a number of bad things could happen to one person in a forty-eight hour period.As for the romance between Nikki and Tyler, Harris finally allowed them to come to terms with their happily ever after. It may have taken three books, but I'm glad to see them realize their ultimate relationship together.The plotline is has been done a number of ties, but I still enjoyed following the story even though the ending was pretty predictable. Similarly, the spiritual elements were not preachy. Nikki did pray for help from God when she was in a difficult situation. I highly recommend Pursued to fans of Lynette Eason, Christy Barritt, Patricia Bradley, and the fans of the first two books in Nikki Boyd's series.In conclusion, Lisa Harris' conclusion to the Nikki Boyd files is a non-stop story, begging for me to continue reading to see what happens to Nikki and Tyler as she races to the solve a missing person case. I really enjoyed the action and how slow the romance took to come to a reality.I received a complimentary copy of Lisa Harris' Pursued from Revell Publishing and the opinions stated are all my own."}, {"userName": "Brittany", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/18727044-brittany", "userReview": "Pursued was a roller coaster of a suspense novel! It was absolutely packed with action. The main character, Nikki Boyd, was plunged into danger time and again as she desperately tried to solve her latest case.Pursued is the third book in the Nikki Boyd Files series. The main storyline in this novel, which is one of a missing woman, could stand alone. Yet I believe that the underlying character and relationship growth between Nikki and Tyler would be better understood by reading all of the books in order.This novel was truly packed with action and suspense! It was almost non-stop, yet believable. I’m really looking forward to book four in the series.I received a complimentary copy of this book. All thoughts and opinions are my own.You can read this review on my blog at:https://brittreadsfiction.wordpress.c..."}, {"userName": "Zac Weikal", "userReviewDate": "May 23, 2017", "userURL": "http://www.goodreads.com/user/show/10498551-zac-weikal", "userReview": "This review was originally posted on Buy, Borrow, Skip  I received this book for free in exchange for an honest review. This does not affect my opinion of the book or the content of my review. \nPursued\n by Lisa Harris was one I did not want to put down! The chapters kept ending and urging me to read the next chapter. There was a lot of suspense with a hint of romance, which I enjoyed.This is the first book I have read by this author, and it happens to be book three in this series. I initially thought it was the last one, but it turns out there is going to be another one coming out, which I’m really excited about!I really picked up this book because of the book description and that it was based in Nashville. I’ve wanted to go to Nashville for a long time and have yet to visit there. I was also in the mood for a suspense book, which this delivered on for sure!While this is the third book in the series, I did not have any trouble figuring out what was going on. There were references to what I assume happened in the other books, but there was enough explanation that it made sense. I also don’t think the explanation would be boring to someone who has read the other books. I felt the author did a nice job with this.There were a lot of people who got killed in this book. At times it felt like a lot, but it did increase my adrenaline as I read the book and increased the stakes for Nikki.I was glad that the romance was most subtle, yet moved forward. Many times in these types of books I feel like the romance can get in the way of the story, but it did not do that here.The entire book takes place over a very short time span. I liked how the author gave the time and location at the start of the chapters. I found this to add to the detective aspect of the book. I also liked that the times weren’t all even numbers, which made the chapter setup more believable.I was hooked on this story from the opening chapter. I did want the first few chapters to get moving because I wanted to find out about Erika, so it felt like it was moving a tad slow, but I think that was my impatience and the author doing a great job of making me yearn for answers.I’m really glad I read this book. It was a quick read and one I didn’t want to put down. I’m looking forward to the next book in the series and hopefully finding out more about Nikki’s sister. View my full review and any exclusive content on my blog (Buy, Borrow, Skip)"}, {"userName": "Lisa Johnson", "userReviewDate": "May 18, 2017", "userURL": "http://www.goodreads.com/user/show/7092311-lisa-johnson", "userReview": "Special Agent Nikki Boyd is on her way home to Tennessee. She is flying on a plane when they encounter some turbulence. The woman in the seat next to Nikki strikes up a conversation and tells Nikki she is afraid. Before they can continue their conversation, more turbulence strikes and it is discovered that the man next to this woman is dead, then the plane takes a nose dive. After getting off the plane, Nikki notices that the woman has accidentally left her watch in her seat. Nikki tries to find her to return it, but doesn’t see her. She asks for her name of a flight attendant and told that no one was sitting in that seat. There is no record of the woman being on the plane. A mystery begins that will take Nikki on a harrowing journey in the next 24-48 hours.In addition to this, Nikki is to meet Tyler at the airport. He has returned from overseas just a few days ago after a 3-month contract job. He has a new job offer in Tennessee, but he and Nikki haven’t had a chance to talk about a relationship or the future. With this new case of a missing person, Nikki is whisked out of the airport and taken directly to her office to begin the search for the missing woman as Nikki discovers she was supposed to testify at a trial that would have resulted in a famous philanthropist going to jail. With the search on, Nikki is under pressure to find the woman as well as deal with a personal health issue that might affect her future relationship with Tyler. How will she survive the next couple of days? You will have to read this exciting tale to find out!Whew! Talk about nonstop action!! This book starts with a plane crash and never lets up on the adrenaline scale. Special Agent Nikki Boyd endures more chaos in her life in the span of 48 hours than anyone can shake a stick at! She has professional trauma as well as personal drama. It is a good thing she is a Christian or I don’t know how she would keep her sanity. If you like action, then you will certainly enjoy this very entertaining story from the pen of Lisa Harris. Nikki and Tyler make an adorable couple and I am so glad that they are pursuing a relationship together. I have liked her determination to continue investigating her sister’s disappearance for over ten years. I hope more is revealed in the next book, Vanishing Point, about this ongoing mystery. This fourth book in the series is due to be released in November 2017 and I can’t wait!"}, {"userName": "V. Palmer", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/15401571-v-palmer", "userReview": "Lisa Harris gives us a story with more twists than O. Henry! Don't bother trying to guess. Just allow yourself to be swept up in this thrilling ride!I do just want to note that there are some hard deaths in this story. Nothing extremely graphic, but that doesn't make it any less difficult.The story starts with an airplane crash that makes me seriously reconsider ever flying again! Once Nikki is pulled into the missing person case for her fellow passenger, her life is put on the line again and again. This case is personal is so many ways. Even though Nikki is a seasoned agent, she's a human being, so seeing her struggle with her near death and the hard-hitting angles of the case proved to be realistic. In the midst of Nikki's desperate search, she learns to let go of the plans she has for the future with Tyler...and trust God. In case I've worried anyone, Nikki and Tyler sitting in a tree... ; ) Four Stars! Action packed!! This might be my favorite book in the series. If you like a suspenseful story with a little romance, then you must read this story. Each story is its own separate mystery, however, since there are elements in the backstory and romance that build in each book, I recommend reading Vendetta and Missing first. To my knowledge, this is the last novel in The Nikki Boyd Files. HOWEVER, Vanishing Point: A Nikki Boyd Novel, releases November 7th, 2017. The story is told from a different perspective. Also, rumor has it that we will finally learn what happened to Nikki's sister, Sarah.I. Can't. Wait.I received a copy of Pursued by Lisa Harris from Revell, a division of Baker Publishing Group. All opinions expressed are my own."}, {"userName": "Janell R.", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/41065618-janell-r", "userReview": "At the recommendation of a Goodreads friend I decided to try out my first Lisa Harris book. I was not disappointed! Despite the fact that it was the third in the series (what is with that? This is now the third book in a row that I’ve read that was the third in a series. I guess they do say ‘three’s a charm’ but seriously! Okay anyway…), it worked pretty good as a stand-alone. I could tell that there were things in the previous books that were referenced, but it never felt like it was hard to follow or anything. I do want to go back and read those though.This is one of those fast paced books whose chapter titles are marked by hours and minutes on the clock, and the whole thing takes place within the space of about 60 hours. Definitely made it difficult to put down. There were some unexpected (even disappointing) twists, and I actually don’t feel like there was complete resolution to the main issue, but not sure if that might be something the author continues in her next book. I can’t go into details without giving serious spoilers. I did enjoy the spiritual side as well. While it wasn’t as strong as others I’ve read, she still brought out some great truths, especially toward the end. Mrs. Harris is a very talented author and I look forward to reading the next book in the series as well as others she’s written as I get the opportunity. Overall, I would give this a four star rating!Disclaimer: I received this book from Revell Books in exchange for my honest review."}, {"userName": "Amy", "userReviewDate": "Apr 24, 2017", "userURL": "http://www.goodreads.com/user/show/5721050-amy", "userReview": "I have been looking forward to Pursued since I read its excerpt last year at the end of Missing. This story was an adrenaline rush. Starting with the crashed airplane that Nikki was on; her day goes from pretty bad to worst. And then some more bad happens, a lot. I actually felt really bad for her and if it were me I would have went off with new hunky boyfriend/ best friend Tyler for the rest of the day. But no, Nikki becomes a key witness and the best possible hope in a missing person’s case of the woman who was sitting right next to her on the plane.This was jam packed with excitement, danger, and Nikki’s emotions are all over the place. Not only is she dealing with this new missing person case, but she has also received some devastating personal news. This was a very quick read; my only complaint is I was really hoping for more of Nikki and Tyler time. I am hoping that they get their own story, together. I am looking forward to the next in the Nikki Boyd Files where the synopsis tells us that we will finally get the answer we have been waiting for this entire series, the reason Nikki Boyd is who she is: what happened to her missing sister. I received a copy of this book for free from the publisher. I was not required to post a positive review and the views and opinions expressed are my own. Bring on the next adventure!"}, {"userName": "Mark", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/2648514-mark", "userReview": "I have really enjoyed this series, and am hoping there is at least one more. It was not obvious by the way the book ended if the series is over or not. This book had far more mystery, suspense, and action than the previous two books. I actually feared the book was going to be slow and boring, and how wrong I was. It took a while for the action and suspense to start, but the book really took off when it did start. I found myself reading as fast as I could to see what would happen next. Bodies were piling up, and I was wondering if anyone was going to be left alive by the end of the book, but there were some. The romantic parts of a book like this aren't always of interest to me, it depends on how the author approaches it. I found myself hoping the one in this series would work out, and it came to a satisfying end. This book does tend to be more violent than the others, but I still enjoyed it a lot. I made the mistake of starting it on my work lunch break, and had to wait til I got home to finish it. And finish it I did. The author outdid herself on this one, and if this is the end of the series, it is a great one. I was given a copy of this book in exchange for my honest review."}, {"userName": "ASC Book Reviews", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/14593382-asc-book-reviews", "userReview": "There are things I LOVE about the Nikki Boyd books and then there are things that I don't so much. And Pursued is no exception. :) Let me start with the LOVE! Lisa added so much prayer from Nikki in Pursued and I LOVED IT!!!! With suspenseful scene after scene I LOVED how Nikki would send up quick prayers along the way! I actually really love Nikki as a character also, she's unique and interesting! There were somethings that I thought didn't add up as far as facts and the timeline however and there were sometimes I found myself thinking, \"wait that's doesn't make sense\" or \"come on guys [talking to the characters, you know you do it to ;) ] you know what's going on. Stop asking silly questions.\". There were also some sense that were a tad too long for me; I found my mind wandering. BUT Nikki's personal mystery, you know the one that got her into law enforcement, about her sister's case are the parts that keep me going, even through the too long scenes! I CAN'T WAIT FOR THE NEXT BOOK where, I'm hoping, we finally find out all about Sarah!!! Overall I think followers of this series will enjoy this one, but I don't think this is a stand alone.Songs: \"Oh My Soul\" by Casting CrownsSongs etc. May be changed and/or added in the future. ~ASC2 Corinthians 12:9-10~ASC*I requested and received this book from Revell for the purpose of reviewing it. This in no way affected my opinion and the above are my true thoughts and feelings about Pursued. ~ASC"}, {"userName": "Joan", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/8435102-joan", "userReview": "This is the third in the Nikki Boyd series. She is an agent with the missing persons division of the Tennessee Bureau of Investigation. While this book reads well on its own, I suggest reading the earlier books in the series to understand Nikki's passion for finding missing persons.This novel has a good combination of action and investigative techniques. Nikki is a capable investigator but she is plagued with disrupting thoughts. I did get a bit tired of Nikki thinking of something in the past, then someone saying something jerking her back to the present. Nikki is not quite the effective policewoman I am used to having in novels with female leads. Readers who like extended accounts of character thoughts that interrupt the flow of the action will like this novel. Interestingly enough, when Nikki does come out of her thoughts, she rises to the occasion as a good and forceful agent.This is a good investigative procedural novel. There is also a bit of romance. There is a little Christian influence but it is not strong. I recommend it to readers who do enjoy suspense with a good dose of troubled character thinking as well.I received a complimentary egalley of this book from the publisher. My comments are an independent and honest review."}, {"userName": "Fiction Aficionado", "userReviewDate": "Apr 18, 2017", "userURL": "http://www.goodreads.com/user/show/39426033-fiction-aficionado", "userReview": "If you love a good law enforcement suspense read, look no further. This book is action from the first chapter to the last—the kind of action that has the good guys on the back foot from the get-go, scrambling to find the person they’re supposed to be protecting, let alone trying to get to the bottom of what’s really going on.Nikki’s arrival in Nashville also coincides with Tyler’s return from a three month posting in Liberia, and she’s anticipating their reunion as the plane comes in to land, but her personal life takes a backseat before she’s even left the airport. Those who prefer an emphasis on the romantic part of romantic suspense may feel a little disappointed that Nikki and Tyler’s relationship didn’t take a more central role throughout the story, but it honestly didn’t need to in this one. That said, the knowledge that Nikki has some serious news that she is yet to share with Tyler does hover in her mind throughout the story, and the fact that this is weighing on Nikki adds to the urgency and tension in several of the scenes, as well as Nikki’s emotional involvement in the case.Readers who are eagerly awaiting the answers to what happened to Nikki’s sister will pick up one or two more pieces of information here, but the conclusion to this plot will come in the next book in the series, Vanishing Point, releasing in November 2017. Personally, I can’t wait! In the meantime, this was a gripping read, highly recommended for readers of romantic suspense.I received a copy of this novel from the publisher. This has not influenced the content of my review."}], "description": "Nikki Boyd's flight into Nashville was routine--up until the crash landing at the airport. When the dust settles, Nikki discovers that the woman who had been seated next to her on the plane is missing--and no one will admit she was ever there. Erika Hamilton had been flying to Nashville with an air marshal as a key witness in an upcoming grand jury trial. When she flees from the crash, is she running from trouble or straight into it? Before Nikki can even see her family, she and her team are pulled into a missing persons case where the motives are as unclear as the suspects.", "title": "Pursued\n      \n          (Nikki Boyd Files  #3)", "url": "http://www.goodreads.com/book/show/30259134-pursued", "average": 4.29, "cover": "https://images.gr-assets.com/books/1467579406l/30259134.jpg", "reviews": 150, "authors": [{"url": "https://www.goodreads.com/author/show/106417.Lisa_Harris", "name": "Lisa Harris"}], "type": ["Mystery", "Christian Fiction", "Suspense", "Christian", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/30259134-pursued", "http://www.goodreads.com/book/show/17384597-dangerous-passage", "http://www.goodreads.com/book/show/22504613-hidden-agenda", "http://www.goodreads.com/book/show/18637160-fatal-exchange", "http://www.goodreads.com/book/show/26171342-vendetta", "http://www.goodreads.com/book/show/27066859-missing"]}