{"ratings": 1686, "userreviews": [{"userName": "Elyse", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/597461-elyse", "userReview": "Audiobook......[mental health break]....narrated by Laura HicksI’ve never read or listen to a book by Cassondra King until now.Enchanted unpaved streets - little cottages are hidden from view making them look safe - huge magnolia and oak trees- an historic town - a little utopia in the middle of the deep South in Alabama. A perfect society!....Ha....Divorce women are starting out on a new journey and therapist Clare Ballenger has focused exclusively on helping these divorce women mend their broken hearts and land back on their feet stronger than ever. As we get to know Clare more intimately, we soon realized that she does not follow the same advice she gives to her clients. The last thing she wants is to fall in love again since suffering the loss and grief from when her own husband died in a tragic accident. There are numerous characters - yet easy to keep track of them all. Clare has two men interested in her: Rye who was her husband’s close friend and Lex, a Yankee from Maine. Dory is Clare’s best friend —- but Clare can’t stand her wealthy husband named Son. Haley is Clare’s daughter - married to a jerk named AustinSo....mostly it’s the women in this novel whom this story centers around. Between the writing - the dialogue- and the exaggeration ( in a good way)....there may be many relationship problems going on — but we definitely get that SOUTHERN BELLE COMMUNITY FEELING in this novel.A little long - some parts I liked more than others - I laughed out loud several times- I drifted off at times too- (too much chatter about ‘doves’ and their white wings), but for whatever reason - I mostly liked it -( nice garden-listening)...Lightness - sweetness - a little gripping (not ‘too’ much- haha: not too much)- and a happily ever after ending. 🙂3.5 rating"}, {"userName": "Vicky", "userReviewDate": "May 24, 2011", "userURL": "http://www.goodreads.com/user/show/4896571-vicky", "userReview": "\"Queen of Broken Hearts\" by Cassandra King is one of the best books I've read in a long time. It is poignant, uplifting, tear-jerking and insightful. When I opened the book to the first page, my heart plummeted. First person point of view – not my favorite. And I'd just finished another review book in first person that I most definitely did not like. Not only was this one in first person, but present tense – a double whammy. To say I started reading with a negative attitude in place would be a truism. Then the story took over and I forgot about the point of view. While the present tense did occasionally intrude, the story was so well written that I couldn't count that against it. Like \"Steel Magnolias\" or \"Fried Green Tomatoes\", this is a story of the deep South, but it touches on themes that affect us all.The story is set in a small Alabama coastal town and centers around Clare, a therapist who's got her own problems. Clare, a widow, runs group sessions and retreats for women going through divorce. Her work is everything to her, even taking precedence over the two men who want her as more than just a friend. She can dish out advice, but when it comes to taking it herself, Clare has more than a few problems. Full of quirky characters, \"Queen of Broken Hearts\" will make you laugh and cry, cheer and boo, but most of all, it will make you keep reading to the very end. The story has a touch of romance and all the angst you can handle as you get a peek at the lives of the inhabitants of Fairhope. This one is definitely a keeper."}, {"userName": "Shelleyrae at Book'd Out", "userReviewDate": "Apr 26, 2010", "userURL": "http://www.goodreads.com/user/show/1607230-shelleyrae-at-book-d-out", "userReview": "You need to read this in the garden with an iced tea or mint julep to sip on. The language is evocotive of Southern society and the environment and it flows with description and dialogue. The pace can feel a bit slow unless you have the time to enjoy it - its not a quick read. There is a huge cast of characters but interestingly it doesn't feel crowded as can often be the case. They are well developed and complex but the relationships between the characters and in general are really the heart of this book."}, {"userName": "Dana", "userReviewDate": "Mar 24, 2016", "userURL": "http://www.goodreads.com/user/show/4725799-dana", "userReview": "Today I finished the LONG, 412 page novel by Cassandra King (who happens to be the wife of Pat Conroy, one of the most talented writers living today---If you have never read The Prince of Tides, it should be on your short list-----) called The Queen of Broken Hearts. The novel is set in Alabama and is filled with deeply drawn, flawed, but lovable, characters. The protagonist is a widow, in her late 40's or early 50s, whose husband died in the woods near their home, when the gun he was carrying went off. That is all we know until nearly the end. Was it suicide or an accident? There was no foul play. The couple had been madly in love but there were demons that, perhaps, needed tending. Claire is a therapist who counsels women going through divorce. She runs retreats for these women to help them mourn the loss of their marriages, and to find a way to move on. Claire's best friend, Dory, Dory's husband, Son, and two men who vie for Claire's heart play pivotal roles in the story, as does her mother in law, Catherine-Zoe, and her step daughter, Hailey, whose own marriage may not be all she thought.I loved the descriptions of the thick and plush Alabama countryside, with its unique odors of warm marshes in the deep south, odors which no one can quite imagine if they have not been there. I have, so I could easily relate to the descriptions. There is so much love and caring among these characters. I felt part of their community, felt their losses and joys for the time I spent reading the novel. The book could have been shorter, but I supposed King needed to make it lengthy to include all her detailed descriptions, dialogues and backstories. It was a good book, though not as great as the ratings might indicate."}, {"userName": "Russell Sanders", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/1813997-russell-sanders", "userReview": "I approached Cassandra King’s Queen of Broken Hearts with so much raw anticipation. I had just finished and loved King’s The Sunday Wife. I was eager to get caught up her in lovely prose and finely wrought characters again. In that respect, Queen of Broken Hearts does not disappoint. The novel is the tale of Clare Ballenger, a celebrated psychoanalyst specializing in divorce. We see Clare as she navigates her own relationships following her husband’s unexpected death. The book is full of insight into human interaction, dealing with grief, and the logistics of starting over. King has given us all a primer of life with this book. Using engaging characters, we take the journey willingly, eager to reach the outcome, knowing we will be enriched. But ultimately, I was not as enchanted with this novel as I was with The Sunday Wife. King chooses to tell the story in first person, present tense. This gives it an immediacy, an urgency. But darn it, there is so much backstory about each of her participants we, as readers, need to know, that she frequently lapses into past tense. And that’s where it bogged down for me. Yes, I know that all that backstory was needed, that I could never have understood Clare and her story without it. But just when the plot gets flowing nicely, it is interrupted by explanation of what went before. And that was a story killer for me. For others, I’m sure it won’t matter, so it certainly shouldn’t be a reason to not pick up this admirable book. And I truly recommend it to anyone who has suffered a divorce. One other thing, I love King’s irony in naming her protagonist Clare. For this woman who sees such clarity in others’ predicaments sees very little in her own. But go with her on her journey and find out if that clarity ever shows up for this aptly named character."}, {"userName": "Cindy", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/365038-cindy", "userReview": "I just got this book from my favorite thrift store for books. As I'm reading the reviews, I notice that there are two reviews that are exactly the same; one by someone named Alice, one by someone named Sharon Reyes. I left comments on both. What is up with that? Is this done to bring the star level up? It really makes me wonder about the book and about the author and I'm not sure I'll even read it now.What do you all think about this???"}, {"userName": "marilyn flower", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/80784625-marilyn-flower", "userReview": "Thoroughly enjoyed the read...liked being kept guessing about main character's romantic inclinations, though the amount of air time sort of gave it away. Lots of quirky characters i would have liked to spend more time with, including Rye and Zoe and Cooter. this is my first Cassandra King novel and I was pleased to find touches of the magic of Pat Conroy! Much was made of Tommy but he never made it \"on stage.\" Some of the flashbacks were awkward, but the story kept moving at a nice pace. Very courageous themes about divorce and recovering a strong sense of self."}, {"userName": "Anne", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/8893349-anne", "userReview": "Too long."}, {"userName": "Sandy Emmons", "userReviewDate": "Dec 05, 2017", "userURL": "http://www.goodreads.com/user/show/7264234-sandy-emmons", "userReview": "I really wanted to like this but it just didn’t pull me in but I did finish it."}, {"userName": "Jeannie Cloud", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/63504879-jeannie-cloud", "userReview": "Fun and light hearted"}, {"userName": "Lisa Ward", "userReviewDate": "Oct 17, 2016", "userURL": "http://www.goodreads.com/user/show/39888623-lisa-ward", "userReview": "I enjoyed this story about a divorce coach who realizes she should practice what she teach."}, {"userName": "Sidna ", "userReviewDate": "Jul 19, 2011", "userURL": "http://www.goodreads.com/user/show/2384898-sidna", "userReview": "This is the third Cassandra King book I have read and it is the LAST one of her books I will ever read! She is not a particularly good writer, but she is a real man hater. In every book almost all of the male characters are real sh#ts! None of them are physically abusive to their wives, but they are verbally abusive and put their wives down in a nasty way every chance they get. Since she is married to Pat Conroy, my all-time favorite author, I can't figure out where why she has this hatred of men, particularly men who are in relationships. From what Pat has revealed about himself, he is probably no picnic, although he is a real charmer in person, but I can't believe he treats her like that!The main character in this book is a woman named Clare who has a PhD and a practice as a divorce counselor. She helps women feel better about getting a divorce, although she claims that she is not in favor of divorce. She met her best friend in college. Her friend married a man she had known all her life and always planned to marry and they seem to have a good life. After their two sons grow up and leave home, her husband has the audacity to want to spend more time with her. She wants to start a gardening business, which she does over his protests. Clare is outraged that the man wants to spend time with his wife and does her best to get her friend to divorce him. The friend kicks him out. After a few days, she takes him back and he takes her on a wonderful trip to Europe. All this time Clare is warning that she is making a terrible mistake and she should dump him. What's not to love about this guy?The entire book is foreshadowing, which is way overused. If you are going to tell a story, tell it! Clare's daughter (there's a secret here, which the author drags out for as long as possible) is married to a man who constantly puts her down, but Clare thinks that is just fine. Anyone but a dope would see that he has a girlfriend, which comes out when he leaves his wife and two small children. Good thing she is a divorce counselor and not a marriage counselor!Of course, her own love life is a mess. Her husband, the great love of her life, died several years previously. More tedious foreshadowing about what happened to him. She has two men interested in her, but can't get over her great love for her dead husband. Then we find out he was a hopeless alcoholic and had a lot of other problems. Maybe that is why she cannot stand to see her friend in a happy marriage.I definitely would not recommend this book to anyone!"}, {"userName": "Agatha Donkar", "userReviewDate": "Sep 03, 2007", "userURL": "http://www.goodreads.com/user/show/189840-agatha-donkar", "userReview": "Picked this one up because one of those what-to-read-next algorithms recommended King's The Same Sweet Girls to me and that one's always out at the library; I didn't know beforehand that King was married to Pat Conroy, who has his flaws as a writer but who I will also defend to the death, because I believe that he can turn a phrase like nobody's business. The first two lines of Prince of Tides still give me goosebumps after all these years.But this is not about Pat Conroy, this is about Cassandra King, and sadly: King is no Conroy. While this book had the same twisted narrative structure, relying heavily on past-tense flashbacks to flesh out character and motivation, and the same dark, morbid, ultimately hopeful plot conventions that Conroy often relies on, the fact of the matter is that Conroy can flat-out write and Cassandra King can't. Don't get me wrong, I enjoyed it a whole lot, even if I found the protagonist completely unsympathetic; it was a page-turner and I wanted to know how she was going to screw up her life and the lives around her next, so clearly King's doing a little bit of something right.But -- it's not even purple prose, because it's not that inventive. It was just a completely serviceable style of writing, and the plot and the supporting characters, at least, deserved better than that. Unfair to compare a writer to her husband, perhaps, but I can't help but do it -- Conroy's a master of the detail, a master of grounding a book so firmly in a sense of place that you can smell the salt marshes while you're reading his novel in Chicago, and I didn't get any of that with this book. I'll probably pick The Same Sweet Girls up if I ever manage to find it in at the library, but this was a disappointment. I wanted to love it, and I mostly found it boring and uninspired."}, {"userName": "Mary Jo", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/637320-mary-jo", "userReview": "This book seemed above all to be about middle-aged lady wish fulfillment. The protagonist’s life is perfect. Her counseling business is expanding and she’s got at least 2 suitors, but you know immediately which one she’ll end up with. The idyllic little Southern town where she lives is complete with “characters” and folksy, semi-mystical traditions. It all just seemed bland and happy. The only people in the book with real problems were her daughter and best friend, whose marriages were in big trouble, but for pretty banal reasons that didn’t really interest me. The protagonist’s anxiety and concern about their problems made her seem like a judgmental busybody, actually. The themes had to do with overcoming the past and choosing to be happy in the present despite past losses and pain, which despite their universality, weren’t communicated to me in a way that made me care about them, perhaps because they weren’t especially relevant or resonant in my short, relatively easy life. It seemed like the protagonist should have been able to just get over it already, to mourn her loss and move on, especially since she was a counselor telling others to do the same thing. I just could not believe that it was as hard as she pretended it was. I think that was what kept me from relating. The climax/solution was overly obvious: What, the ritual you created to help other women find closure would be useful for you too? Whoda thunk! My conclusion: this book was not written for me.It’s ok if a book just was not written for me. I’m not worse off for having read it. This book and I can go our separate ways, and I might even recommend it to a divorced woman of my parents’ generation who enjoys easy, shallow, sentimental reads, like Nicolas Sparks or James Patterson. For more reviews, visit www.mereader.wordpress.com"}, {"userName": "Kellie", "userReviewDate": "Dec 28, 2009", "userURL": "http://www.goodreads.com/user/show/842772-kellie", "userReview": "This was a book about relationships, heartbreak, divorce, death, family, friends and life. It was a book that caught my attention. It's the type of book I find myself reading as fast as I can to find out what happens next. That's the sign of a good book. One I like. It was disappointing though in certain aspects. I felt the storyline about Haley and her husband was cut short. I would have liked to have had more closure on this part of the book.The ceremony and labyrinth references were a little far fetched and I skimmed.The writing style was excellent. I love the bird references. I love birds. There is something magical about a bird. Their flight. Their beauty. I loved Lex and Rye. Great male characters. Manly but sensitive. I didn't like Dory. At all. I thought she was phony. She wanted everyone to believe she was strong and had a handle on things but she was in love with a weak, self obsessed jerk.Clare, the main character, was interesting enough. She was strong which I like. I really didn't understand her issues with herself. I understood the issues she had with losing Mack but that seemed normal. I didn't understand her regrets, her struggles. She really didn't have any that had to do with just her. The guilt she had about Mack was real, but what else was there?The setting was the gulf coast of Alabama. I picture old-time southern, coastal scenes. Money. I like the influence of Lex who is a Yankee from Maine. It shows how well people of the north have come down and fit in well with the people from the south. Like me!!Overall, I enjoyed this book. I think the writing is exceptional and I really enjoy this author."}, {"userName": "JayeL", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/591995-jayel", "userReview": "I am reading this book right after reading The House at Riverton by Kate Morton. I think that that sequence puts the Queen of Broken Hearts book at a disadvantage. This book has a completely different writing style and feel. After reading The House at Riverton, this book seems jarring and the author seems to be using a gimmicky writing style. I thought about abandoning it, but am trying to give it a chance.One of the things I dislike is that Cassandra King springs characters on the reader. She did that, especially, with Elinor Eaton-Yarbrough and I found it to be quite jarring. Another difficulty I am having with this book is that the author and the characters say things, which just don't seem real.I think the underlying message was that we all need to constantly work on ourselves and be open to taking risks and changing. I don't think that I would read another book by this author as I don't think she has a smooth style"}, {"userName": "Sharon", "userReviewDate": "Jan 11, 2010", "userURL": "http://www.goodreads.com/user/show/3129564-sharon", "userReview": "This book is a rarity: one with characters over 40 who actually lead vibrant, interesting lives. Another plus: it's set in the South, but is not populated with drunk, manipulative escapees from a Tennessee Williams' play (OK, Maybe one - but he's dead). A strange coincidence: it's set in Fairhope, Alabama, a town that was featured in an article in Smithsonian magazine I just read. Anyway, it's the story of a woman who is a therapist and runs retreats for women going through divorces. The m...more This book is a rarity: one with characters over 40 who actually lead vibrant, interesting lives. Another plus: it's set in the South, but is not populated with drunk, manipulative escapees from a Tennessee Williams' play (OK, Maybe one - but he's dead). A strange coincidence: it's set in Fairhope, Alabama, a town that was featured in an article in Smithsonian magazine I just read. Anyway, it's the story of a woman who is a therapist and runs retreats for women going through divorces. The marriages of her friends and family are in various states of disarray, yet the story is not depressing. She drops hints about her past, but reveals more detail as the story progresses, providing a nice sense of discovery for the reader."}, {"userName": "Miranda", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/3889505-miranda", "userReview": "First of all, I love Cassandra King. She and Pat Conroy are my two favorite authors. To me they are a \"super-couple\" (LOL). I first read this book four years ago, the summer after I filed for divorce – which was fitting since the main character, Clare, is a divorce counselor and her daughter, Haley, and best friend, Dory, both had serious marital problems. Clare also has unresolved issues of her own, as she is still trying to cope with the circumstances of her husband's death years after he passed away. The first time I read the book, I more related to Haley because she was kind of in the same situation I was at that time, almost word for word. Now, years later, I identify more with Clare because I understand her hesitation to get into another romantic relationship after the pain she suffered due to her deceased husband's poor decisions and ensuing actions. This book was good for me the first time I read it, and it was good for the second time as well. I'll probably read it again sometime down the line."}, {"userName": "Amy", "userReviewDate": "Dec 22, 2008", "userURL": "http://www.goodreads.com/user/show/1710557-amy", "userReview": "I wrote the following review back a year or so about this book and gave it a 2 star rating. The problem is, I pricked it up again and it was a totally unfamiliar story. I'm reading it now, as if for the first time. Wonder what's up?  I had really hoped to be enchanted with this, as I am enchanted with this author whenever I hear her speak. But the book didn't quite grab me and I found myself passing it by for other works, rather than picking it up again. Maybe someday, I'll find another copy and give it another go. The author is a wonderful speaker and I have enjoyed other books by her.Okay, so I've moved it up to 2.5 stars. All in all, the story didn't grab me. I kept waiting to connect with the characters, but never really did. The making and breaking of relationships, both good and dysfunctional, somehow seemed stilted to me. Once again, I found myself skim reading to actually find out what happened to Mack and who ended up with whom. Would have liked to walk the labyrinth, though."}, {"userName": "Wendy", "userReviewDate": "Jan 09, 2011", "userURL": "http://www.goodreads.com/user/show/1336988-wendy", "userReview": "This is a sweet and charming story about Clare, a woman who's endured her own heartbreak but makes a living as a \"divorce coach\" in a small southern town.Clare's mission is to help newly single women deal with their grief, anger, and loneliness. What her clients don't know is that Clare is dealing with grief and loneliness too. After the traic loss of her husband, Mack, Clare throws herself into her work and shuts herself off from any romantic entanglements. When two very different but very interested men come into her life, she is determined to keep both of them at arms' length as friends only. Meanwhile, Clare has plenty of other distractions. Her daughter and her best friend are going through marital problems of their own. Clare is also in the middle of building a retreat and counciling center for her clients.I frankly didn't expect to like this book but the author did a lovely job of creating very real people on the page and a setting that made me feel like I was in Fairhope, Alabama."}, {"userName": "Christi", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/12584290-christi", "userReview": "About 3 pages into this book, I had to make sure that it wasn't the second book in a series. After i determined it was not, I picked it up again. A few pages later, I had to check again just to make sure. Finally, I realized that the past events the author is alluding to have not been discussed yet. The entire book was this way - references to past events or feelings which is finally revealed in detail about 10 pages. It was quite frustrating. One of my other frustrations with this book was the authors frequent use of phrases like \"Here's what happened:\" or \"Here's what she said:\". The character has already stated their intention to tell you the story or what was said. Why say \"Here's what happened:\"?I also had quite a bit of trouble with the characters. How is a therapist so oblivious to everything going on in the lives of the people closest to her? And Rye was a pansy and Lex was a fool. This book was a waste of my time.l"}, {"userName": "Diana", "userReviewDate": "Jun 10, 2014", "userURL": "http://www.goodreads.com/user/show/3772617-diana", "userReview": "I was on a long car trip that meant several days on the road, and was happily engrossed in Doris Kearns Goodwin's \"No Ordinary Time,\" when my Nook's battery died at the beginning of the final day's drive. Luckily, while shopping in a Dollar Store during the trip, I had picked this book up for a dollar, and quickly retrieved it from my suitcase, so I was saved from a full day of boredom in the car. I had previously read and enjoyed \"The Same Sweet Girls,\" so I was familiar with Cassandra King -- and I knew that she is married to Pat Conroy, who I am sure could not be married to someone who writes bad books -- so I snatched it up when I spotted it. While this one is by no means great literature, it was a very enjoyable read, with believable characters and an interesting plot, and was perfect for passing the time. I recommend it. And now that I am home, I can get back to FDR and Eleanor in the White House."}, {"userName": "Marianne Leslie", "userReviewDate": "Aug 10, 2014", "userURL": "http://www.goodreads.com/user/show/32687927-marianne-leslie", "userReview": "A good easy book but slow in parts. The book starts off very light hearted and humorous with a funny dialogue between Claire (main character) and her 'friend' Rye. Wish the book had stayed light hearted and funny as it would have been more enjoyable. Claire, the main character is likeable as are most of the characters in the book. Well, except for Claire's mother in law and boyfriend. Reading the chapters about the mother in law and her bird sanctuary were painful!!! Loved loved loved the parts of the book about Claire's daughter. Wish more of the book focused on her and her problems. The end of the book was a little yawn worthy for me but that was probably because I couldn't get into the bird sanctuary at all and the end focused on that setting. Over all an OK book, something to pass the time. But, not a page turner."}, {"userName": "Patty", "userReviewDate": "Oct 15, 2013", "userURL": "http://www.goodreads.com/user/show/2422493-patty", "userReview": "So many times in life we help other people with their problems but are not able to come to terms with our own issues, even pushing our problems further and further into the recesses of our own minds until we don't even know there is something that we need to tend to before we can truly move on with our own lives. To me that is what the book is about, first realizing that there is something keeping us from being our best selves and then being able to put our guilt and hardships behind us and move on. So often we we need for someone close to us to tell us that we need to deal with something because, well we think we have dealt with it, but others can see we are still having difficulty. Having strong friends who don't mind telling you something critical is a friend indeed."}, {"userName": "Nan", "userReviewDate": "Nov 27, 2013", "userURL": "http://www.goodreads.com/user/show/6935744-nan", "userReview": "I have read other books by Cassandra King and enjoyed them, so picked this one up thinking I would feel the same. Not so much- in fact, I stopped reading after the second character within 10 pages felt it necessary to describe someone as \"faggy\". I am not sure why Ms. King felt that the use of this particular word was appropriate, unless she thought that doing so would show how spunky & irascible the characters who used it were but this reader was offended by the use of the word, and by the idea she felt it was appropriate. I admit, I skimmed through the book after that and from what I could see, none of the characters became any more likable so perhaps I did not miss anything by not finishing! I am sure others will feel differently however, this book was just not for me."}, {"userName": "Amber Jones", "userReviewDate": "Jul 21, 2011", "userURL": "http://www.goodreads.com/user/show/2218477-amber-jones", "userReview": "I don't know if I would have enjoyed this book as much if I had read it.The narrator, Laura Hicks, changed voices for each character and she hit them spot on.I laughed outloud while driving because what was being said with the voices was beyond funny.Story is about a therapist whose husband dies and she is stuck between two men who want her. Her mother in law, Zo Catherine, is called the bird lady and enjoys the company of Cooter Poulet who at one point gets pecked in the butt by a peacock named Ghangis Khan.Honestly, if you are going to read this book, listen to it on CD. I laughed long and loud during several parts."}, {"userName": "Laine", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/757195-laine", "userReview": "A PhD psychotherapist targets people at risk after divorce (which ends up being mainly women) whilst she herself has strange relationships ...I do very much like the setting, which is beautiful Mobile Bay, one of the unsung unknown completely mind numbingly gorgeous areas of the US. The storyline seems interesting enough, and definitely in my field. So what could be wrong here?I think this author tries too hard with her characterizations ... her cast ends up as caricatures, only flesh deep, predictable, full of platitudes and generally unbelievable. I had a hard time finishing this one."}, {"userName": "Connie", "userReviewDate": "May 03, 2011", "userURL": "http://www.goodreads.com/user/show/477647-connie", "userReview": "Divorce therapist comes to terms with her own issues amidst a love triangle. She copes with her husband's hunting \"accident\", a friend's marital unrest and her daughter's dissolving relationship with her husband. My favorite characters are Zoe Catherine and Cooter. Zoe Catherine lives in the woods on her bird sanctuary and Cooter is her \"love\" interest/companion/friend. I enjoyed the quirkiness of Zoe and Cooter's relationship. The book does drag on in some parts however is an overall pretty good read."}, {"userName": "Amy", "userReviewDate": "May 14, 2009", "userURL": "http://www.goodreads.com/user/show/1557472-amy", "userReview": "The book Queen of Broken Hearts is a book that is filled with compassion and it makes you think about what you can do to help your fellow community members. The book will inspire you to do great things for your community, your neighbors, and the people that mean the most to you.I reconmend this book to everybody because it opens your mind in to help the world around you. Also it will boost your condince about having one struggle after another and still trying to do good for the world or other major places in the world."}, {"userName": "Tom Hooker", "userReviewDate": "Aug 30, 2010", "userURL": "http://www.goodreads.com/user/show/2404072-tom-hooker", "userReview": "A therappist who specializes in divorce recovery must tend to her own broken heart. Five years ago, Clare Ballenger's husband, Mack, died in tragic hunting accident. The fact that Mack was deeply depressed casts a pall of doubt over whether or not this was truly an accident. Now Clare is launching a retreat center, where her charges can come for divorce recovery seminars, and her adopted daughter is finding herself in need of Clare's services. All the while, two eligible men think Clare has mourned long enough."}], "description": "The national bestselling author of The Same Sweet Girls and The Sunday Wife returns with another compulsively readable novel.It's not easy being the Queen of Broken Hearts. Just ask Clare, who has willingly assumed the mantle while her career as a divorce coach thrives. Now she's preparing to open a permanent home for the retreats she leads, on a slice of breathtaking property on the Alabama coast owned by her mother-in-law. Make that former mother-in-law, a colorful eccentric who teaches Clare much about love and sacrifice and living freely. When Clare's marriage ends in tragedy, her work becomes the sole focus of her life. While Clare has no problem helping the hundreds of men and women who seek her advice to mend their broken hearts, healing her own is another matter entirely. Falling in love again is the last thing she wants.So when Lex--a charismatic, charming, burly sea captain--moves to town to run the marina, Clare insists they remain friends and nothing more. But even though she fights it, she begins to fall for him--and then finds she has a rival, his estranged wife Annalee.A story infused with all the flavors, textures, and intrigues of a small Southern town, with a rich, resonant center, Queen of Broken Hearts is a bold step forward for Cassandra King.", "title": "Queen of Broken Hearts", "url": "http://www.goodreads.com/book/show/3423932-queen-of-broken-hearts", "average": 3.72, "cover": "https://images.gr-assets.com/books/1347508115l/3423932.jpg", "reviews": 137, "authors": [{"url": "https://www.goodreads.com/author/show/7136628.Cassandra_King", "name": "Cassandra    King"}], "type": ["Fiction", "American", "Womens Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/3423932-queen-of-broken-hearts", "http://www.goodreads.com/book/show/176725.Queen_of_Broken_Hearts", "http://www.goodreads.com/book/show/5895314-queen-of-broken-hearts", "http://www.goodreads.com/book/show/19269028-queen-of-broken-hearts", "http://www.goodreads.com/book/show/5031671-queen-of-broken-heart", "http://www.goodreads.com/book/show/298538.The_Same_Sweet_Girls", "http://www.goodreads.com/book/show/209809.The_Sunday_Wife", "http://www.goodreads.com/book/show/18106938-moonrise", "http://www.goodreads.com/book/show/209810.Making_Waves", "http://www.goodreads.com/book/show/18722380-the-same-sweet-girls-guide-to-life"]}