{"ratings": 143905, "userreviews": [{"userName": "Yonaily ", "userReviewDate": "Sep 12, 2013", "userURL": "http://www.goodreads.com/user/show/22496761-yonaily", "userReview": "When my sister told me about an early review that promised really bad things happening to our favorite characters in this installment, I didn't care. I didn't actually think that was true; I trusted SJMAAS. But oh, dear nothing could have prepared me for what I was about to face the moment I picked up this damn book. With this review I'm putting these book down and getting some needed rest. I think we all deserve it after dealing with Aelin and the author's bullshit, am I right?Now, let's get down to business.How to ruin a book series by adding absurd romantic subplots and destroying some characters for the sake of a ship: A novel by Sarah J. Maas.Prepare yourself for QUEEN OF BULLSHIT. This one was definitely my most anticipated book of 2015, and reading it was an absolute torture. I'm outraged and sad and deeply disappointed that one of my favorites series is now such a piece of crap, but I'm certain that I am done with SJM's work. What she did to this series--to its characters--is an insult to the readers. This is not a book--this is poorly written fanfiction of the Throne of Glass series. (If you listen closely you can hear Sam and Nehimia yelling that they didn't die for this shit.)I'm gonna miss you, Celaena Sardothien. The assassin we all loved was murdered. She was sassy, smart, badass and arrogant, but in this book the author turned her into a fucking fangirl, Aelin Galathynius. She did not only act out of character--she became dependant on a hot fae dude who's centuries older than her. SJMAAS failed at creating an empowering female character. Aelin Galathynius was a self inserted version of the author, a poor caricature of Celaena Sardothien. If you think that the way Aelin acts in this book is how a queen should be like, Wyrd help y'all. Celaena would never hurt Dorian, yet Aelin was so eager about killing the Crown Prince who was posessed by a demon. She never stopped to think for a damn minute of what her actions would cause to the friends she loved. No--she was so obsessed with Rowan that everything else what pure background. While Chaol and Nesryn worked to free Dorian from his father, Aelin showed the city to her fae companion. She socialized with Lysandra, she wore dresses for Rowan, and she had dinner with her cousin and her new friends. And when they finally managed to rescue Dorian, Aelin had the audacity to tell him she had come back for him. BULLSHIT. \nShe’d kill whoever was needed, whore herself, wreck herself, if it meant getting Aedion to safety.\nRemember when Celaena said to Dorian \"I'll come back for you\"? Yeah, me neither. Chaol Westfall deserved better than to be destroyed so I ship could happen. The author kept using the Nehemia card to make him look bad. Aelin blamed him for everything--leaving Dorian, having a part in Nehemia's death, working for the King of Adarlan and never killing him. But when he replied, \n“You do not get to blame me for that. For his actions.”\nBut you do get to blame him for things that were out of his control, Aelin? Where's the damn logic.\nChaol had run. He’d run, and Dorian had been left to been slaved by the collar.\nIf he had stayed he would have been killed by now, and who would be trying to save Dorian? You? YOU, Aelin?! I thought so.And just to make it even more clear,\nYou should have gotten Dorian and Sorscha out the day the king butchered those slaves. Did you learn nothing from Nehemia’s death? Did you somehow think you could win with your honor intact, without sacrificing something? You shouldn’t have left him; how could you let him face the king alone? How could you, how could you, how could you?\nChaol had to endured this throughout the entire book. Damn, the entire series! He got the worst part. If I recall, Celaena never tried to kill the King, and she worked for him too. So, she's a freaking hypocrite for throwing those accusations to Chaol. SJM made Chaol feel sorry for himself, she made him see himself as a fool for trusting an assassing when HE GOT OVER IT A LONG TIME AGO!!\nNo, Celaena Sardothien certainly did not exist anymore. That woman—the woman he had loved... Perhaps she’d drowned in the vast, ruthless sea between here and Wendlyn. Perhaps she’d died at the hands of the Valg princes. Or maybe he’d been a fool all this time, a fool to look at the lives she’d taken and blood she’d so irreverently spilled, and not be disgusted.\nI see what you're trying to do, SJMAAS. But I'm no fool. I SEE U, VILLAIN.Chaol Westfall deserves better 2k15 #CHAOLWESTFALLDEFENSESQUADI WILL ALWAYS SHIP CHAOLAENA. It's over. They're not endgame according to this damn book. But I still have my copy of Crown of Midnight that proves otherwise. SJMAAS changed her mind. She wrote Crown of Midnight with an idea, and she changed it the moment Rowan showed up. Nesryn Falig was obviously used as a plot device. It seems like SJMAAS didn't want Chaol to end up alone. I can't buy anything written in this book. Chaol Westfall would blush whenever he saw the girls who used to wait for him at his morning runs. He was dedicated to his Prince and King, and yet the author created this poor excuse of him having a relationship with Nesryn Faliq even before Throne of Glass so he wouldn't mind seeing Aelin and Rowan together. THAT WAS PATHETIC.\nA faint sort of amusement shone in her dark eyes. The same sort of amusement that had been there last year whenever they would meet, at inns or in rooms above taverns or sometimes even up against the wall of an alley.\nOk that sounds fake but ok.I think what bothers me most about QoS is that the sort of closure Celaena and Chaol had in Heir of Fire was thrown to the trash can. I was fine with them not being together anymore, but what they both did in this book felt completely out of place. They acted like kids--SJMAAS pitted them against each other. Reading it was like watching a dummy relationships reality show. And they not having feelings for each other?? I get it, they are over. But when Chaol got hurt Aelin didn't even look at him! And Chaol never cared about Rowan, either. (Actually, Chaol seemed startled by Rowan's beauty, just like everyone else who came across him.) Their past was was erased. Like it never happened.\n“It meant something to me. What you and I had. More than that, your friendship meant something to me. I never told you the truth about who I was because I couldn’t face that truth. I’m sorry if what I said to you on the docks that day—that I’d pick you—made you think I’d come back, and it would all be fixed. Things changed. I changed.”\n@ Sarah J. Maas, WAS THIS FUCKING NECESSARY?!!!!\nThere was so little left of the guard she’d come to care for....\nYou changed, not him.\nYou remind me of what the world ought to be; what the world can be, she’d once said to Chaol. Her face burned. A girl had said those things; a girl so desperate to survive, to make it through each day, that\tshe hadn’t questioned why he served the true monster of their world.\nWHY ARE YOU LYING. STOP FUCKING LYING, WOMAN. STOP. LYING.\n\nYes, she’d loved Sam—more than she’d ever loved anyone. Even Chaol.\n\nBITCH DON'T MAKE ME SLAP YOU WITH MY COPY OF CoM.This part, though.\n\nDo you understand what it was like for us here? While you were off playing with magic, off gallivanting with your faerie prince, do you understand what happened to me—to Dorian?\n\n WHERE'S THE LIE. #ChaolspeaksthetruthRowan/Aelin should have stayed platonic. In Heir of Fire they repeatedly told us that there was absolutely nothing romantic in their relationship, but in this book they acted like lovers in a erotic novel. It was pathetic. Rowan treated Celaena like hell in the previous book: he told her she was useless, that she would be better off dead; but now they're so suddenly in love with each other and it's all over their heads. And I wonder how they went from friends to lovers in such a small amount of time. Aelin would wear a dress with nothing underneath, and Rowan would take it as a huge turn on. She would freak out thinking too much about her incredibly handsome male partner that I wanted to punch my head against a wall. Several times. Their relationship is not healthy at all, SHE LITERALLY OWNS HIM. And every five seconds Aelin would come up with things like this:\nA chill fog had blanketed the world the night before, seeping in through every nook and cranny. Nestled under layers of quilts and down blankets, Aelin rolled over in bed and stretched a hand across the mattress, reaching lazily for the warm male body beside hers.\nI just hope it's a dead body. #sorrynotsorry\nAfter all that she had endured, after what she had overcome in Wendlyn, to return to this... She wished Rowan were beside her, wished she could smell his pine-and-snow scent and know that no matter what news Arobynn bore, no matter how it shattered her, the Fae warrior would be there to help put the pieces back together.\nThat sounds like the typical \"fix me, I'm broken\" plot we find in every NA book. I know Rowan is hot and has amazing fighting skills and his body's been formed by centuries of war and blah blah blah, but he acted like he was a member of Jersey Shore. Everything was an excuse for him to be shirtless. And the way he and Aedion acted around Aelin WAS THE MOST PATHETIC THING I'VE EVER SEEN. It was like watching a pissing contest. Guys, Celaena made it through three damn books without you. I'm pretty sure Aelin can take care of herself.BACK THE FUCK OFF.Everybody loved Aelin Galathynius. She was beautiful, she was sexy, she was lethal. Rowan and Aedion would fight over her. Arobynn would send her expensive gowns and perfumes. And she was definitely enjoying the attention. Celaena was arrogant, but Aelin reached a whole new level.\nShe did not need the extra strength, speed, and agility of her Fae form to bring down her enemies.\nWhatever helps you sleep at night, honey.One of the few good things about this book was Dorian and Chaol's friendship (BrOTP af). At this point they're all I care about. I wouldn't mind if they get together and get married and have babies. They're the only two characters I dare save from this mess. Don't fight me on this.\nEverything—everything was for Dorian, for his friend. For himself, he had nothing left to lose. He was nothing more than a nameless oath-breaker, a liar, a traitor.\nI love how loyal to Dorian Chaol is. I love how he fought Aelin just to save his Prince. His King. I love how he always believed there was a chance to save him. But I wish they had had a moment at the end of the book, because that is what they deserved. Chaol left with Nesryn, and now Dorian is unprotected again. It just feels off.I would like to talk about Arobynn Hamel, because I thought of him as such a rich and interesting character. I hate that he was lowered to the point of being just another crazy fan of Aelin. In the short novels we got to see a bit about his creepy obsession with Celaena and how far he would go to have her. I believe his character had more things to offer than just that. I was looking forward to reading the epic battle between the Greatest Assassin in Adarlan and the man who trained her, but that didn't happen. Arobynn was a huge threat, and killing him off so soon--without getting his potential to its fullest--was a pretty ugly decision, if you ask me. And what a way to kill the Assassin's King: while he's asleep, by Lysandra. Really, Sarah?! REALLY?! The King was another disappointment. The biggest villain, a monster, the man who had erased magic from the Kingdom.... asking for mercy. The whole being-possessed-by-a-demon plot would have worked out pretty well if only had been thought throught. Why? Because we barely got the King's pov. If you want me to believe he had been struggling with a dark force within him, you must let me know him first--dude, we didn't even know his freaking name!--otherwise I don't care about what happens to him at all. Having Lysandra, The King and Arobynn's POV's in the previous books would have made things a lot interesting and added more depth to the plot. But the author just included them in this book, and honestly they felt more like mere excuses and subplots. And can we talk about these ridiculously long speeches?\nManon Blackbeak, heir of the Blackbeak Witch-Clan, bearer of the blade Wind-Cleaver, rider of the wyvern Abraxos, and Wing Leader of the King of Adarlan’s aerial host, stared at the portly man sitting across the black glass table and kept her temper on a tight leash.\n\nShe was fire, and light, and ash, and embers. She was Aelin\tFireheart, and\tshe bowed for no one and nothing, save the crown that was hers by blood and survival and triumph.\nStop acting like you're both Daenerys Targaryen. If you go into my profile, you'll see that Sarah J. Maas has been removed from my list of favorite authors. I cannot believe in the poor excuses she made. Arobynn Hamel getting killed so easily even though No one—not even the King of Adarlan—would be stupid enough to go after him (actual quote); The King of Adarlan being posessed by a demon all this time; Lysandra and Aelin suddenly being BFFs and sharing everything; Lysandra being a shape-shifter (how fucking convenient)... And Manon, I couldn't bring myself to care about this precious character. At All. I got some serious Manon/Dorian vibes, so I guess in the next book there'll be another romantic subplot. The King and his son had such an interesting plot, but sadly Aelin and Rowan's adventures were more important for the sake of the plot. SJMAAS lost me when she decided that Aelin would be ok with killing Dorian.So this is it. The most difficult part is that I now should see Crown of Midnight as an standalone, because that book is a contradiction to everything I just read from Queen of Shadows. A fanfic of her own series is what SJM wrote, and it pains me to see how my favorite characters were sacrificed over stupid subplots. It all ended in the second book, I'm afraid. Well--it was good while it lasted, because I already gave up on these books. _______________________________________________________Queen of Shadows, a summary:Aelin: Celaena Sardothien is dead, I'm in charge now, and I'll burn everyone who dare say otherwise.Chaol: but WHAT ABOUT DORIANAelin: You left him!! You poor human with no powers couldn't save Dorian nor destroy the King and I hate you!! Chaol: I feel so sorry for myself.Rowan: How you doin'? *takes shirt off*Dorian: ♪I was as pure as a river, but now I think I'm possessed♫Aelin: *contemplates killing them all while also saying she's changed*Chaol: but WHAT ABOUT DORIANNesryn: This is too messy, I'm out.Rowan: *breathes*Aelin: omg did you see that? HE. JUST. BREATHED.Manon: *staring at nothing* I...wanna...learn...what...love...isArobynn: Aelin Galathynius is perfect.Lysandra: Aelin Galathynius is perfect.Rowan: Aelin Galathynius is perfect.Aedion: Aelin Galathynius is perfect.Erilea: Aelin Galathynius is perfect.THE WORLD: Aelin Galathynius is perfect.Chaol: She is not my queen.Aelin: OMG how dare you you! I am Aelin Ashryver Galathynius, heir of fire, beloved of Mala Light-Bringer, and rightful Queen of Terrasen, and I have Rowan now.Me: I thought Chaolaena was endgame.Me: WHAT HAPPENED TO THE SECOND BOOK??? CROWN OF MIDNIGHT??? WHAT ABOUT THAT???SJMAAS: I don't know, suddenly I can't read.*If you listen closely you can hear me cry* This was one of my favorite series and now it's ruined."}, {"userName": "Andreea Pop", "userReviewDate": "Jul 23, 2013", "userURL": "http://www.goodreads.com/user/show/4858513-andreea-pop", "userReview": "“Maybe the world should burn.”\nEpicness. That's the only word I can think of to describe Queen of Shadows in order to encompass its complexity and awesomeness, because while I loved Throne of Glass and Crown of Midnight blew my mind away and Heir of Fire broke my heart into teensy tiny pieces, neither of those installments felt as grand as this one -- worlds collided, debts were paid and a queen rose to her glory. \n\n“Let’s go rattle the stars.”\nI'm going to start by saying that I've read it twice in a matter of days -- once devouring it cover-to-cover, fueled by that insatiable need to find out what the hell happens next (pulling an all-nighter, if I might add), and then simply to savor its cleverness, awed yet again at Sarah's ingenuity. But as I finished it for the second time, I realized something extremely important: QoS is a tribute to strong, tough heroines, main and secondary alike.\n\n“Please,” Lysandra said, waving a manicured hand, “you and I are nothing but wild beasts wearing human skins. Don’t even try to deny it.”\nYou will be completely astonished with the unraveling of Aelin Ashryver Galathynius, because in reality you haven't exactly met her until now. You see, she's the same heroine we've come to love during these past 3 (4) books and yet a different persona. Every trait of Celaena Sardothiens is magnified and combined in such a masterful way to create a unique character. She's still an arrogant, stubborn, brave and sassy young woman, but she undergoes a spectacular character-development into a cunning, determined and fierce queen. Aelin is completely in control and she makes a statement in bold capital letters that she doesn't buy any bullshit and that she's ready to reclaim back everything that was taken from her. And oh, boy, she does it in style. \n\n“I went too long without demanding retribution. I have no interest in forgiveness.”\nIn addition to that, she has matured a long way and, for the first time, she shed her impulsiveness for being open-minded, calculating and often kind. Aelin managed (through those crushing sessions of healing from HoF) to lose some of her darkness and her real strength -- spiritual and physical alike -- finally shone in this installment, making me so proud of her at this point. And I'd bet a good deal that Sam and Nehemia are freaking proud of her too. *sobs* \n“I miss you,” she said. “Every day, I miss you. And I wonder what you would have made of all this. Made of me. I think—I think you would have been a wonderful king. I think they would have liked you more than me, actually.” Her throat tightened. “I never told you—how I felt. But I loved you, and I think a part of me might always love you. Maybe you were my mate, and I never knew it. Maybe I’ll spend the rest of my life wondering about that. Maybe I’ll see you again in the Afterworld, and then I’ll know for sure. But until then … until then I’ll miss you, and I’ll wish you were here.”\n\nNow onto the next awesome woman and quite possibly my favorite character from this book: Manon Blackbeak. She was completely fabulous in a mind-boggling manner. I never would have expected her wonderful character-development: she is not all about discipline and obedience anymore. She starts wondering. She starts plotting. She starts taking a stand, slowly but surely, like Dorian did in CoM and later in HoF. She's gloriously wicked, but she's no evil and I utterly loved her. I cannot wait for when her defiance will leave the witches kneeling at her feet. \nAnd damn, when those two met?! Shots fired. Fireworks exploded. And badassery was brought to a whole new level. It was by far my favorite scene out of the whole novel, managing to exceed my expectations thousand fold -- they were deadly and powerful and so goddamn magnificent I was literally fangirling. The encounter in its entirety was astounding by starting out surprisingly and unfolding in an incredible way that only increased my adoration for both kick-ass chicks.\n“We are the masters of our own fates—we decide how to go forward.”\n\nThe attention falls equally on some other ladies. Prepare to fall helplessly in love with Asterin. She's so strong and loyal and her story will move you to tears. We finally get reacquainted with Kaltain and she's not in a place full of flying unicorns and pink rainbows -- she's basically in her own hellhole. There were a few fascinating developments that transformed her into a worthy, lethal player. Nonetheless, her inner strength was awe-inspiring and I ended up regretting that we didn't get to know her better before. She was hands down amazing and she has my unwavering respect and admiration. \n“She did it for herself. To free herself. And she was entitled to. After what they did, she was entitled to rip the entire damn world to shreds.”\nThis book allowed us to meet new kick-ass females: Lysandra, who was nothing short of amazing and surprising; Elide Lochan, who was determined and immensely brave; and Nesryn Faliq, who was simply awesome in every way. I loved and cheered for them all. And now let's fuss over the boys. Firstly, Chaol. His reunion with Aelin was all sorts of shit, no, this-can't-be-happening, and I was mad at him for his demeanor. With that being said, I can assure you he remained true to his character throughout the whole book, his loyal, selfless traits reminding me why I like him so much and his insecurities being in sync with his overall upbringing, legacy and priorities. With Dorian's safety being his ultimate goal, his desperation is just gut-wrenching. \n“Oath-breaker. Liar. Traitor. Chaol was all of those things now, but not to Dorian. Never to his true king.”\n\nSpeaking of Dorian, my sweet, precious and innocent cinnamon roll. He killed me in this book. Killed me with his few and far between chapter POVs that had him in pure, unaltered agony and pain. Killed me with his loneliness, with his sense of being lost, with his acceptance that he'll drown in an ocean of misery and cold. And finally he killed me with his force to constantly fight back, with the desire to tear free of the monster inside him and with the protection he bestowed on his loved ones. He's done kneeling before others and he is forever changed, but wonderfully so. I loved loved loved him, even when he broke my heart. \n“I am going to destroy everything you love.”\n\nAedion was undoubtedly a new favorite of mine. The fact that he's Aelin's male version is only a shade of his real personality -- he had me tearing up and smiling at the same time with his boundless love for his queen and his loyalty and sarcasm were a recipe for instant swooning. Oh, and his father? I went bazinga. \n“Behind them, across the hall, the dancers shattered their roses on the floor, and Aedion grinned at his queen as the entire world went to hell.”\n\nWe meet again with the King of Assassins, Arobynn Hamel, and he did not disappoint with his cruel, scheming, controlling self. He was a ruthless bastard but the satisfaction I felt when the pupil outwitted the master was priceless. Bon voyage, you shameless asshole. \n“Tell me what I must do to atone; tell me to crawl over hot coals, to sleep on a bed of nails, to carve up my flesh. Say the word, and it is done. But let me care for you as I once did, before … before that madness poisoned my heart. Punish me, torture me, wreck me, but let me help you. Do this small thing for me—and let me lay the world at your feet.”\nRowan Whitethorn is yet again a main focus of the book and I enjoyed everything about him. His devotion, his wisdom, his alpha-male intensity and not to mention the rare moments when he let emotions overtake him. Aelin's effect on him really brings out sides we haven't met before and the fact that he was, at times, sweet (yes, I'm talking about the King of Stoicism) continues to blow me away. \nBut the best part about these characters is not even themselves. Their intricate relationships are the real deal. The BROMANCES ARE FLAWLESS -- Dorian and Chaol redefine friendship, Aedion and Rowan set the backbone of a brotherhood for ages, Aelin and Manon bring a delicious and unpredictable frenemy dynamic to the table and the queen regains female companionship through Lysandra. Aelin and Aedion are even more amazing then I ever would've imagined and their reunion was all kinds of splendid (I was crying, goddamit) and the Thirteen prove again just how much of a family they can be. Besides these, the original trio crawl their way to being once again a marvelous team -- Dorian and Aelin is possibly the best thing ever, maybe only topped by Dorian and Chaol. Banter and kinship and support and dedication are all etched deeply in every single relationship, giving them an almost magical quality. \n\n“For her friends, for her family, she would gladly be a monster. For Rowan, for Dorian, for Nehemia, she would debase and degrade and ruin herself.”\nNow -- expect romance. The wowza kind. The slow-burning kind. The tension off the charts kind. One ship is sailing fast, folks, and it is steamy and romantic and snarky and just asdfghjkl. I'm not saying who it is just in case you escaped the spoilers. There are new feelings on the horizon for a certain male and I hope it will come to fruition soon. And and and maybe I'm a fool to hope or even bring it into discussion, but do I sense Dorian and Manon?!? BECAUSE I'M DOWN FOR THAT, MAAS. \nAll my talk about characters shows how incredibly balanced QoS is, because this book is very much plot orientated. So many twists coming from Arobynn and the Valg world and the rebel cause and bitch queen Maeve and the King and the Duke (turns out he's a key player) and I can't even. The Valg plotline is an endless well of terrifying territory and it seems that we'll venture further into their scary world. It's thrilling, jaw-dropping and fabulously written. The last 200 pages or so were a masterpiece, keeping you glued to the pages and at the edge of your seat, but the entire book is darker and bloodier than any of its prequels. \n“Elegant, feminine, and utterly wild. Warm, and steadfast—unbreakable, his queen.”\n\nQoS is not necessarily flawless. I have slight complaints -- like Rowan being a bit too soft sometimes and Dorian and Chaol not getting enough page time -- but they don't irk me because I got so much more awesomeness instead (all of the above + Abraxos and Fleetfoot, of course) and I am fully aware we can't have it all; it was almost a 700 pages book! My favorite still remains Heir of Fire though, with QoS and CoM not far behind, because that book broke me into pieces and did not apologize for it. However, QoS did with that phenomenal ending that had me smiling ear-to-ear and teary-eyed at its sheer perfection. It was like SJM personally apologized for every time I cried and sobbed and went crazy over her devastating story and gave me a solace of utter joy. Happiness is not a good enough word to describe what I was feeling at the dinner scene. \nYet again, Sarah J. Maas pulled out the big guns and took over the fantasy genre with a gorgeous world, otherworldly characters and imaginative plot. She is my favorite author and, even though I'm aware of her storytelling skills, she continues to bewilder me with each book she creates. I got literally everything I asked for (seriously, my initial \"demands\" can be found here ), even the things I thought were impossible to come true. So thank you, SJM, for this outstanding book. \n\n“She was the heir of fire.She was fire, and light, and ash, and embers. She was Aelin Fireheart, and she bowed for no one and nothing, save the crown that was hers by blood and survival and triumph.”\nQueen of Shadows is a breathtaking continuation to my favorite series -- a truly wild rollercoaster, brilliantly woven with plot twists and thrilling from beginning till end, and also an absolutely beautiful journey sprinkled with countless gut-wrenching moments. Enthralling, action-packed and heartwarming (yes, you read that right), this book deserves every praise known to humankind and I bow down to the queens in eternal awe -- Sarah and Aelin, you're both spectacular. Cannot wait to see what you have in store for us next. \n\n“What do I do?”She had to swallow before she said, “You light up the darkness.”\nENJOY! <3 P.S.: It pains me to see how a lot of people hate this book due to its main romance. I love Dorian to the moon and back and Doraelin is basically my OTP and for that I could've downright hated CoM, QoS and especially HoF (miss you, Sorscha). Obviously, I didn't, because what a lot of fans fail to acknowledge is that we shouldn't get blinded by the shipping-war. I NEED them to take a step back and appreciate the glorious world Mass created, the ingenious plot and the ever-wonderful characters. Romance was never the main focus of these books, even if it sweetened the installments and gave us butterflies. After all, a choice was bound to happen sooner or later seeing we have such swoon-worthy males around our beloved heroine and need I remind you there are still 2 more books? Anything could change! Maybe everyone will die in the end -- would you prefer that instead of watching your ship sink? (Sarah, please don't get any ideas). Regardless, I've said it times and times again -- as long as Aelin is happy, I'm happy, and if that means Doraelin isn't endgame I'm not going to bawl like a baby about it, because she deserves to have someone at her side and she deserves to choose whomever the hell she wants. Team Aelin forever."}, {"userName": "Emily May", "userReviewDate": "Sep 02, 2013", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "Many people know how I have felt about the books of this series. That I enjoyed the light, fluffy Throne of Glass. That I absolutely loved Crown of Midnight. That Heir of Fire was a slow, plodding disappointment. Did I like Queen of Shadows more than its predecessor? Yes.Do I think it's a fantastic book? No.Do I think you should read it? Well, it depends. It depends on whether you are committed enough to this series and these characters to read 650 pages of just okay.This book is loooonnnng. I think - objectively - Maas has grown as a writer with every book, developing a complexity and density to her plot that wasn't there in the beginning. But I also think that a lot of the delicious goodness that made me sprint through pages in the first two books has been sucked out. Like other much-loved fantasy greats, her books have become more layered, with other characters, perspectives and side stories existing alongside Aelin/Celaena's story. Though, I personally don't care for many of these characters and I have to force myself not to skim-read through their chapters to get back to the main story.And, to be honest, a whole lot of this huge book (about two thirds) feels like set-up for what is going to happen. Which might be fine until you consider that it is 650 pages long (and really didn't need to be), which means there are about 400 pages of planning, angsting, conversation and obsessing over Aelin.Because that is really starting to get to me. We're about 2000 pages into this series and I honestly don't think I can take any more about how amazing Aelin/Celaena is. Everyone is in love with her. Everyone is in awe of her and her endless ability to do no wrong. Rowan sees her again and has to spend half a page going on about how stunning she is.And the badass speeches that are getting kind of old:\nShe was fire, and light, and ash, and embers. She was Aelin Fireheart, and she bowed for no one and nothing, save the crown that was hers by blood and survival and triumph.\nThe first one or two times this happened, I thought \"Hell yeah!\" but now I'm just like \"Yeah, okay, I get it. She's freaking amazing.\"My favourite thing about this book is Lysandra. Both what Maas has done with her characterization and the way she has developed the complex female friendship between her and Aelin. That was fantastic. But the romantic relationships have also turned sour, for me. My Chaol ship appears to have sunk and I find beautiful Rowan so boring - I have no interest in his relationship with Celaena or how good he is with his tongue. I will read on because I'm too invested in this series to not know what happens, but I am resigned to the very likely probability that this series peaked at Crown of Midnight.Blog | Facebook | Twitter | Instagram | Youtube | Pinterest"}, {"userName": "Wendy Darling", "userReviewDate": "Jul 07, 2014", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "[Dorian and Chaol should just get a room together.  (hide spoiler)]"}, {"userName": "Kat O'Keeffe", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/4672379-kat-o-keeffe", "userReview": "SPOILERY BOOK DISCUSSION HERE - https://www.youtube.com/watch?v=l_GL7...THIS WAS ABSOLUTELY EVERYTHING I WANTED AND NEVER KNEW I NEEDED. THANK YOU SARAH FOR THIS PERFECT BEAUTIFUL BOOK.Here are some of my spoiler-free impressions:DORIAN. PRECIOUS CINNAMON ROLL. I CAN'T.AELIN. QUEEN OF SHADOWS. MORE LIKE QUEEN OF SLAYING YASSSSS GET IT GIRL.ROWAN. i'M SCREAMING.CHAOL. MORE SCREAMING.AEDION!!! LYSANDRA!!! MANON!!! AROBYNN!!!!!!!!!I had about twelve heart attacks while reading this book. IT WAS AWESOME."}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Sep 04, 2015", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "BRB CRYING FOREVER. This book was a wild ride! While I loved this book, I did feel like the characterization within this book was a bit off. That's the main reason I didn't give this 5 stars. Other than that I was thoroughly happy with what went down in this story, even if certain things didn't go the way I wanted them to. GIVE ME BOOK 5 NOW. K THANKS."}, {"userName": "Sasha Alsberg", "userReviewDate": "Mar 11, 2015", "userURL": "http://www.goodreads.com/user/show/10915830-sasha-alsberg", "userReview": "SO GOOD. SO FREAKING GOOD.NOT JUST GOOD BUT GREAT.GAHHHHHHHHHP.E.R.F.E.C.T.I.O.NI read Queen of Shadows back in June but could not say anything about it (not even that I had it!). But now I can and let me tell you, Sarah has done it again! I LOVED QoS, so beautiful, bloody and outstanding. OH and...ROWAN...SWOON!!! 5/5 stars of course!"}, {"userName": "Christine Riccio", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/10093827-christine-riccio", "userReview": "QUEEN OF SHADOWS WAS AMAZING. I LOVED IT. CAN NOT WAIT FOR THE NEXT ONE HERE'S MY EXTREMELY FANGIRLY BOOKTALK: https://www.youtube.com/watch?v=lSSKo... LET'S TALK ABOUT IT MORE PLEASE"}, {"userName": "Regan", "userReviewDate": "Sep 02, 2015", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "Oh my god. Perfection."}, {"userName": "+ly", "userReviewDate": "Dec 12, 2013", "userURL": "http://www.goodreads.com/user/show/20455107-ly", "userReview": "Updated: September 30th. This is \nmy\n opinion, \nmy\n review and if you don't like it, I don't care.#CHAOLWESTFALLDEFENSESQUAD-------------------------------------------------------------------------I FEEL BETRAYED.At first, I wanted to write a long, very long review about Queen of Fanfiction but then i tought Why sould I waste my time? It's not worth it. This thing.. i call it \"thing\" because for me QoS is not a book, \nit's a very poorly written fanfiction.\nCONGRATULATIONS SJM FOR RUINING A GREAT SERIES!!!. I'm not exagerating. This book ruins everything to the point ToG and CoM should be considered as stand-alone. Awesome books that were thrown to the trash can.QoS has so many plot holes, it's actually funny. But the worst is what SJM did to the characters. The Aelin we all grew to love was murdered and replaced by an OOC and even-more-arrogant new version. This new Aelin was so bad that she didn't ever care about saving Dorian, her friend. Dorian was left aside because Maas cared more about Aelin & Rowan's adventures that what was really going on with his character. So sad.Chaol.. my baby. His character was completely destroyed by both Sarah & Aelin. He deserved better than what he got.But you know why she did all this, right??R O W A E L I N.All for the sake of a ship. Pathetic.I'm not gonna talk about the rest. They can die for all i care. @Authors, please don't make SJM's mistakes: \nDon't screw characters to fullfill your own creepy fangirly obsessions. Don't change your mind mid-series. JUST DON'T.\nFinally. From the moment I first read Throne of Glass, it became one of my ultimate faves. Now, I feel disappointed, angry, but mostly sad. So you guys will understand why i can't keep supporting this author nor her series. \nI'm not gonna continue reading this trash. I'm not gonna support abusive relationships. I just can't.\nAnd for the record:\nCHAOLAENA IS ENDGAME, WE ALL KNOW IT.\nCHAOL WESTFALL DESERVED BETTER!!\nDORIAN DESERVED BETTER.\nEVEN THE FUCKING KING DESERVED BETTER.\nWE, THE READERS, DESERVED BETTER."}, {"userName": "Etnik", "userReviewDate": "Sep 15, 2014", "userURL": "http://www.goodreads.com/user/show/34369915-etnik", "userReview": "YOU FREAKING PERFECT PIECE OF LITERATURE.DEFINITELY THE BEST BOOK I HAVE READ SO FAR IN MY LIFE."}, {"userName": "Rachel  (APCB Reviews)", "userReviewDate": "Aug 20, 2013", "userURL": "http://www.goodreads.com/user/show/12502667-rachel-apcb-reviews", "userReview": "Post-reading: WOW. No words for this book. 95% love for this book, but the first 300 pages had issues I can't deny. But overall I just love love love how the plot developed! Full review:Check out my review @ A Perfection Called Books**Spoilers from previous books. Slight QoS spoilers about romance.Throne of Glass has been one of my favorite series for a few years now, so I've been impatiently waiting for Queen of Shadows and building the expectations to the highest degree. The fourth installment wowed me yet had some flaws I can't ignore.As much as I'd like to blindly give myself over to the epicness of this series and say \"It was perfect, and everything was amazing\" I can't do that as a reviewer. Nor can I do that as a reader/person in general. I refuse to trick myself! Overall though, I have so many positive things to say about this book,and a few negative things to discuss.The PlotFirst let's start with the plot development. I bow down to Sarah J Maas and her brilliant plotting. I am astounded by all the ties and connections reaching so far back to The Assassin's Blade. There are lots of ah-ha and mind-blowing moments. Everything connects in some way, and Maas is a magnificent plotter. The pacing was a bit slow for the first 300 pages, but there's so much plot build-up and development that keeps us engaged. Maas' writing has progressively matured into a beautiful story-telling talent. There's an ominous edge to it that perfectly matches the tone of the series. I feel this series is getting darker and darker; it's often pitched as a less promiscuous YA Game of Thrones. There are some bloody scenes, lots of death, and quite a bit of pain. Action is interspersed throughout the story too.The CharactersLet's talk about the characters! In Heir of Fire, I had a few issues with the various POV switches, but I thought the transitions were smoother in Queen of Shadows, and I actually like Manon and her story a bit more in this book. Elide is also introduced, and while her POV was my least favorite, her character is pretty tenacious and smart, so I can't wait to see where she goes next. Lysandra is re-introduced, and I love her sassy and snarky character. Nesyrn is a rebel who is part of the city guard. She's pretty stoic and strong-willed, and I like her! Aedion will always be a bright star with his unending devotion and loyalty to Aelin. Dorian's character and POVs were painful and sad to read. I love him and thought his tenacity and decisiveness were admirable. Squad assembled in this book, and I was so happy about that!! I love Aelin's court/group and seeing them all come together was definitely one of my favorite parts. Light banter and strong female friendships prevail, and I approve! Arobynn comes back into this novel and oh geez I forgot how cynical and ruthless he is. Sam has such a presence in this novel which was equal parts surprising, somber, and up-lifting.Let's talk about Rowan, Chaol, and Aelin. Such fun. While I loved all the other characters mentioned above, I had so much trouble with these three. Please don't stone me, but I'm going to call BS and say these people were SO out of character for the first 300 pages. I liked Rowan a bit better in this book, but whoa has he changed. No longer is he the tight***, brutal and unemotional warrior. He's now reduced to a horny teenager who pines over Aelin. I failed to see many similarities between this Rowan and the one from HoF. Chaol, oh my sweet Chaol. Honorable Captain of the Guard, now disgraced and rebel-turned. His bitterness has reached his peak just as his character and his POV has been diminished. I still hold on to the hope he'll achieve redemption. Chaol has grown so much throughout this series, yet he still needs time to grow. He's used to his beliefs and blindly and honorably follows his king. Now that everything he knows and loves is being threatened and challenged, he's had to change, and not everyone reacts the same way to change. He's made progress!Aelin has turned malicious and bitter. I love how bad*** she is and how she fights for what she believes in, but I missed her sarcastic nature. I missed the girl who loved reading and dresses yet also loved to show people her girl power and how awesome she is. She lacked the confidence and humor I associate with her. Just because she and Celaena have different goals, I don't think that should mean her character takes a 180 turn. Most of all Aelin is highly hypocritical, especially towards Chaol. Aelin and Chaol are both mad at each other for both reasonable and unreasonable things. Personally I think they were both being hypocritical as they slung insults and accusations at each other at their first meeting in QoS. I see faults on both sides, but I think they'll work through it eventually.The RomanceSpeaking of Aelin and Chaol, you've probably heard about the romance news. I'll be honest, this ship is sunk and blasted to smithereens. They want and need different things, and it would never work out. It twinges my heart and makes me wonder about the so-called significance of the words exchanged on Crown of Midnight. Some things literally do NOT make sense. Aelin even says something to the effect of \"Even though I said I'd always pick you, I didn't mean I'd actually always pick you.\" I feel like books 1 and 2 were so insignificance and fake now in regards to the romance. I think it's fresh and unique to see how realistic the portrayal of falling into and out of love is, but it still hurts. I feel like we were led on in Crown of Midnight, and you can't deny all the words they said to each other. Jumping to the romance, I do not understand it nor will I get on board with it. I'm not being a stubborn Chaolaena shipper (okay maybe a little bit), but I fail to see Rowaelin in the long run. Rowan is the type of guy Aelin needs right now. I just don't understand how things progressed from Heir of Fire as a platonic friendship to a lusty and yearning attachment in Queen of Shadows. I feel like I missed an extra novella or something. Rowan had his one true mate AND is three hundred years old. This romance does not compute. That being said, there actually isn't much romance in this book, it's more promises to come in the next book.As Cait from Paper Fury pointed out, there are so many conveniences in the romance department. Nesryn will take Celaena's place in Chaol's heart, so Aelin and Rowan can be happy together, and everything is all sparkly rainbows and wonderful now. I feel like this is such an easy way out. The Chaolin breakup was brutal, and I'm sad to see how it wrecked their friendship too.The last 150 pages of the book are insanely epic and wonderful. The characters grow into their own a bit more as well. Overall the amazing plot, squad assemblage, and writing make this book wonderful while the romance and earlier portrayal of the characters sorely disappointed and confused me.Update 5/22/15Queen of Shadows is 672 pages long. *sinks in* OH MY GOSH I AM SO FREAKING EXCITED!!!!!!!!Update 3/10/14LOOK AT THIS BEAUTIFUL COVERAhhh, she's so badass!! AND SHE'S GOT THE SWORD!! She's ready to take back her crown, all hail Queen Aelin!!!! Bwhaha a red cover means action and blood to come, right? Preferably the King of Adarlan's?Update 1/27/15 A TITLE: Queen of ShadowsEeeek! I love it.AND Sarah J Maas stated that Queen of Shadows is longer than Heir of FireUpdate 1/5/15 Apparently there will be no arcs for book #4. *cries*Words can not convey my excitement for this book!! It's going to be EPIC. HEIR OF FIRE REACTIONS:MY HOPES/REQUIREMENTS/NEEDS FOR BOOK #4:-Save Dorian-Save Aedion-Chaolaena get back together-Rowan come backkkkk-Find the wyrdkey-Kick Arobynn's ***-Kill King of Adarlan Jerk-Face-Form alliance with Wendlyn-Build this rebellion!!!!! I also need....ACTION:CHAOLAENA:BADASSERY & EPICNESS:Until Book #4 comes out....Me attempting to wait for book #4:"}, {"userName": "Penelope ", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/23635926-penelope", "userReview": "This “review” has a lot of gifs, quotes and feelings.So basically I’ve been waiting a year to read THIS. And yes I said T H I S because I don’t know how I should describe this book.I’m so so disappointed that I’m not sure if I want to read the next book. What happened to Celaena/Aelin? What happened with the characters?I’ve been seeing a lot of comments saying that Celaena and Aelin aren’t the same person. Uhm what? I mean, only because someone has two names, they are different? They have to have another personality? I don’t think so. Celaena and Aelin are the same person, I don’t know if Sarah wanted to make Celaena/Aelin to look badass but she’s so mean. So so mean with everybody except obviously Rowan and Aedion. \n“There hasn’t been a we for a while, Celaena—” (Chaol)“It’s Aelin now,” she snapped as loudly as she dared. “Celaena Sardothien doesn’t exist anymore.”“You’re still the same assassin who walked away. You came back only when it was useful for you.” (Chaol)\nUHM EXCUSE ME? We all know that the favorite male character of Sarah is Rowan but what she did with Chaol, what she did with him… No, I can’t forgive that. I can’t do it. I’ve loved Chaol since Throne of Glass, she made us believe or at least in my case that Chaol was going to be the endgame and after Crown of Midnight, I was sure of that. But then came Heir of Fire and the Fae… I’m not a fan of Rowan. I don’t know what makes him so special that all the readers love him, I mean why? What did he do? Chaol is one of the best characters of the series and then you read Queen of Shadows and it’s like that everything we've read was a stupid joke of Sarah. I don’t understand it. You can’t forget someone that you’ve loved in some months. You can’t! But in Queen of Shadows it’s like Celaena/Aelin forgets everything that has happened between them, and she blames him for everything! WHY? HE WAS ALONE! He’s not an assassin like Celaena/Aelin. \nAelin hissed, “Need I remind you, Captain, that you went to Endovier and did not blink at the slaves, at the mass graves? Need I remind you that I was starved and chained, and you let Duke Perrington force me to the ground at Dorian’s feet while you did nothing? And now you have the nerve to accuse me of not caring, when many of the people in this city have profited off the blood and misery of the very people you ignored?”\nOkay, first of all, what was he going to do? He was only the Captain of the Guard. Okay he did wrong, but when Chaol meets Celaena/Aelin, she's an assassin and everything that Chaol knows is that she has killed a lot of people. And, if she thought that of him, why she didn't tell him in Throne of Glass or Crown of Midnight? WHYYY?There are a lot of fights in the book between them. They blame each other for everything and the end of the book… it was this a joke or what? I’ve been waiting a year to read… t h a t? Do you guys remember the quote of CoM?\n“I’d always pick you”\nWell then this happens.\n“It meant something to me. What you and I had. More than that, your friendship meant something to me. I never told you the truth about who I was because I couldn’t face that truth. I’m sorry if what I said to you on the docks that day—that I’d pick you—made you think I’d come back, and it would all be fixed. Things changed. I changed.”\nReally? “I’m sorry if what I said to you on the docks that day—that I’d pick you” REALLY SARAH? I don’t think so. No, no and no. But the worst thing is that she wanted to make Chaol look like the bad guy and find him a new girlfriend and in the end Celaena/Aelin says something like: “oh but we will always be friends, I mean I have Rowan and you have your girlfriend, everything is fine, what happened in Crown of Midnight? Because I can’t remember it hahahaha” NO NO NO NO AND NO.but then... \n“Chaol waited—waited for that twist and tug of jealousy, for the bile of it to sting him.But there was nothing. Only a flickering relief, perhaps, that …That Aelin had Rowan.He must be feeling truly sorry for himself, he decided.”\nOh sure, now he doesn’t love her anymore right Sarah? Why you want to make us believe that the real OTP is Rowaelin when it’s not? Chaol has been through a lot of things and you still want to make his character look bad. Thank you. Seriously thank you so much.Then, the scenes of Rowaelin, I mean it was necessary? Really? Because I didn’t really care if Celaena/Aelin wanted to kiss Rowan or Rowan was thinking that Celaena/Aelin is hot.Dorian, well he’s in the book and he’s obviously having a bad moment, yes we know it, but who is going to care of Dorian (except Chaol) when you have 123456 discussions of Chaolaena or stupid scenes between Rowaelin?Manon… Who cares about that character? And well the end… it wasn’t what I expected to be, it was more like the end of the series but what happened to Chaol it’s not fair. I’m sorry but it’s not fair.I don’t know if I’ll read the next book, because my OTP is not endgame and I really didn’t care so much about the plot when “everything” is basically solved in this book and when Sarah has been romanticizing in every book a couple. First in ToG, Dorian and Celaena/Aelin, CoM Chaol and Celaena/Aelin and in HoF and QoS Celaena/Aelin and Rowan.#TEAMCHAOLAENA #TEAMCHAOLBYE"}, {"userName": "Katerina", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "“But she was her own champion now.”\n\nBrutal and magnificent. A force of nature. How else can I describe a book about witches, demons and dark lords, fae queens and warriors, possessed princes, rebels and whores?Queen of Shadows deserves more than 5 stars. Queen of Shadows rattles the stars.\n\n“She was a whirling cloud of death, a queen of shadows, and these men were already carrion.”\n\nThe fire-breathing bitch-queen is back. Ready to gather her court, claim her throne and wreck havoc to those who hurt her and the people she loves. The world is changing, trust is tested, enemies turn to friends, friends to lovers, villains to allies and the real evil is darker and more cunning than anyone thought. The real fight starts now.\n\n“They joined hands.So the world ended.And the next one began.”\n\nBy the Wyrd, Sarah J Maas's storytelling is spectacular! I lost two nights' sleep and I forgot to eat because I was sucked in Erilea, sucked in battles and plots and plans that went wrong and sacrifices and general badassery. An emotional roller coaster, a wild ride, an incredibly vivid and captivating book. That's what we call high fantasy people.\nThe characters\nI can't help but admire Sarah's characters. It's true, Celaena is not someone I can relate to nor agree with, and I found myself scolding her for her decisions and cringing at her cruelty, but at the same time I felt a wave of pride for what she's achieved and the way she has grown up. And the rest of the women oh.my.god!! I freaking love Manon, my brilliant bloodthirsty witch, and Lysandra and Nesryn, they're the embodiment of strength and courage! And they kick ass!As for the men in this book? Dorian is and always will be my favorite, my number one, my precious prince, my baby, my sun and stars, my chocolate cupcake, but Aedion and Rowan and Chaol are also perfect. And edible. I'm a big fat slut.\nEmotions\nEvery time Dorian was in pain, my heart broke. Every time Sam was mentioned, my heart broke. Every time a story full of pain was revealed, my heart broke.But then Aedion would say something funny and I would be like \nThe romance\nLet me make something clear. The new ship? Ahoy mates, I'm on board!BUT, I didn't like the way Sarah handled the Chaol/Celaena relationship. I actually felt bad for Chaol and thought that he was right most of the times he and Celaena argued. They all have changed, him and Celaena (and Dorian for that matter), they're not the people we met in the first book, and that's expected. I just wish some changes were smoother.However, this book was epic. Period. The different storylines were knit together perfectly, and the last 100 pages gave me goosebumps. Like I said, epic.You haven't read it yet? Shame on you!(just kidding, but please go read it!)"}, {"userName": "Maggi", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/16969868-maggi", "userReview": "[yes, she’s his new love interest. kill me (hide spoiler)]"}, {"userName": "Kiki", "userReviewDate": "Sep 24, 2014", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "This review is absolutely STUFFED with spoilers. Spoilers to the highest degree. Please, please do not read it if you haven't read the entirety of Queen of Shadows.*deep, pensive sigh*Oh, this book.I could sit here and review this thing objectively, or I could be honest with all of you: this series has a hold over me, so much so that it can lie and cheat and steal and kill (basically, it can be Scarlett O'Hara) and I'll still let it sleep on my couch, eat my food, and lounge around at home all day watching Netflix while I go to work and serve coffee for five hours. This series is stellar. It's my weakness. It might be my favourite. I loved the first book, the second book blew the first out of the water, and the third book...don't even get me started. The third book was literally flawless. It was an absolute work of art.And then along came Queen of Shadows, and I was faintly disappointed. It's as if I got home from work and this series said, \"I was looking on Gumtree for jobs\" and I had a brief moment of hope, but then it continued: \"But I don't really want to work entry level.\"Tough shit, book. The thing that really kills me is that I can't hate it, no matter how nauseatingly annoying the Rowaelin thing was, or how irritating Aelin's dictatorial bullshit was, or how unbelievably boring it was for the first three hundred pages. THREE HUNDRED PAGES, people. I was bored for three hundred pages, with all of this wandering around and talking and all those longing looks at Rowan's muscles and velvety skin (come on).The problem is that it was all character development, but it was impossible to understand that because I was so blinded by how annoying it all was. We love Celaena, and we love Aelin because we loved Celaena, and I get it, I do. But having anyone who questions this beloved character be keelhauled for it cheapens that love. It's infuriating to see Aelin building this court that has such potential on such intolerant terms. Chaol, constantly raising important questions, is threatened with violence every time he questions her. Is this the sort of kingdom Aelin really wants to rule, particularly in the wake of the atrocities committed by the all-powerful King of Adarlan? Really?Heir of Fire transformed Celaena from a character I loved to a heroine who lives inside me, and I adored her with my whole heart. This assassin with such an unbreakable spirit who has the extraordinary ability to shine and soften was an astonishing piece of character development. Do I think that was lost in Queen of Shadows? No, I don't, but I think this book missed the point. I think Aelin having tough burly lackeys who threaten anyone who questions her and promising violence against anyone who reacts without calm to the overthrowing of a monarch is absurd, and sounds an awful lot like something the King of Adarlan might do. Do you see my point? Maybe a fine line was supposed to be drawn here, but nobody picked up on it. In that case, I can only assume it wasn't intentional to make Aelin a mere stone's throw away from being a really scary Tudor-esque monarch. God, she might as well just go ahead and marry six women and declare herself the head of her own church. I feel bad because over the course of the book this peters out, and I think that might have been what Maas was going for. Aelin still has a lot to learn about being a queen. But building a court based on threats of violence? How is that 'changing the world'? No wonder they're using the Old Ways to build a guard force. I mean, jesus, this sort of dictatorship is as old as dirt.I'm disappointed with Chaol, too, not for anything he did, but for the way this book wanted me to feel about him. It wanted me to think he was a tool, but he wasn't, was he? I think amid all of this chaos we forget one of the hallmarks of Chaol's character: the dude is human. And I don't mean that in the sense of, well, he's only human, he makes mistakes! It's more a case of all of these extremely powerful immortal Fae warriors demanding that Chaol have already saved the world, when he has no magic, no healing, and absolutely no social standing since he chucked away his title, his job, his home and everything he has ever worked for to join a rebel force that is saving people from being soul-fucked by a bunch of demons (whose power, by the way, I feel isn't refined enough. I have a hard time figuring out what exactly it is that the Valg do, and what exactly the rules are. I love this mythos, I love the originality of it, but sometimes feel that the lines around it need to be filled in a bit better). He does some dumb shit, says some shitty things, but the fact that Aelin is mad at him for fleeing the castle when Sorscha was killed and Dorian and Aedion were captured is insanity. There's never any rebuff for this, so I'm delivering it now: if Chaol had stayed in that castle and fought, then Dorian and Aedion's sacrifice would have meant nothing. It would have all been pointless. This is another instance in which the characters themselves navigate their own world weirdly. Stay and fight...how? Chaol is human. Compared to the other magically gifted characters, he's really weak. In saying that he should have stayed, Aelin is really telling Chaol that he ought to have hung around and let the king butcher him.That's not something the Aelin at the end of Heir of Fire would ever have asked someone to do. So what gives?Moreover, Chaol isn't from Terrasen. He says he fears how Aelin will use her power, and fears for the safety of the humans when magic returns. He calls Aelin a monster; awful, a horrific thing to say, but he has the sense to grow and develop beyond that ignorance, so much so that he trusts Aelin with his life, and tells her that her magic is beautiful in the end. But nobody got it. It's like, look at the bigger picture: this Adarlanian boy who grew up being told that magic was dangerous and should be shunned, who grew up weakly human, who has been threatened with violent death by all of the Fae he has met (Rowan, Aelin and Aedion), who has seen Aelin literally gut and torture people even in her weaker human form, is afraid of what will happen when magic returns, and is afraid of magic itself? Oh, wow, I wonder why!I mean, come on. This should have tied in beautifully with Manon's arc, where she in turn sheds her bigotry and realizes that it's never too late to change. The beauty of both these pieces of development is that they were at no one's expense - you never feel like another marginalized character is being used to teach a privileged character a lesson about acceptance. It's all internal and hard-won. It's all a case of personal experience and soul searching. It doesn't do that heavy handed, problematic teacher-mentor thing. But this was lost, among other things, because this book was so oddly constructed. Even messy at times.It's just the nature of this beast. The first half of this book is all over the place. The last half is magnificent, with Aelin and Manon's fight, Manon's message to Aelin, the ring, the hellfire, the glass wall, Lysandra's ghost leopard...amazing. Just amazing. Chills, tears, everything was felt. Manon soaring through the sky as magic returns was haunting. Kaltain's sacrifice, her rebellion, and the fact that Manon understood it all? Beautiful. God, so beautiful. The witches made this book. Without them, it would have maybe been a 2.5. But it's a journey of peaks and troughs. The ending was spectacular, and Arobynn's death was...meh (by the way, Arobynn was such an infuriating character. I literally could not STAND reading about him. The best part of the whole Arobynn thing was Aelin's absolutely ingenious plot to take all of his money after Lysandra got her deserved revenge. That was one of my favourite Aelin moments, because she felt like Celaena, like this intelligent, wily, graceful woman that we love). Aedion's whining, painful, and Nesryn and Chaol's romance, while kind of sweet at the end, was pretty heavy-handed. Every move the witches made was glorious, and the revelation about Erawan, the king, and Perrington? GOD, yes. The king broke my fucking heart. Holy fucking shit, that was so intense and my whole face was leaking. Dorian's whole arc was unbelievably well rendered and so, so sad, but so, so hopeful. And that damn prose. God's sake, Maas can write. Jesus, Mary and Joseph, this author is talented. And a three-star story told with five-star words is a really tricky one, isn't it?In the end, this book is what it is: it's the dais for the last two books to stand on. All of these ships and circular conversations were filler. Come on, admit it. This book was filled with filler. Filler, filler, filler. It could have stood to be about a hundred pages shorter. And I hate saying that, because I'm the queen of writing stupidly long books. That's like a hallmark of my storytelling. But if you're going to write a long book, you had better make sure that it's CRAMMED with plot, which this one simply wasn't. The whole Lorcan side quest was pointless. It's a set-up for Maeve, and her role in the next books, but why is that so obvious? It shouldn't be. It's just annoying because I wasn't scared or angry when Lorcan showed up, I was just bored. It was a case of getting the Lorcan thing out of the way so I could power ahead to the good bit. And damn, the good bit was good. But the rest of it...bleh.A little aside about the king: it really gets my goat when authors spend all of this time rendering protagonists in stunning detail and don't make that same effort with the villains. Even with the (god so heartbreaking, kill me now) revelation with the king, he's still a two dimensional character. I can't even picture what he looks like. He doesn't even have a fucking name! Isn't that insane? He could have been built up to be anything, an enigma or a legend or a fanatic or something, but he had no personality. I get that he was possessed, so technically this wasn't his personality, but do the Valg not have personalities? I don't know. I would have liked for the king to be a real character, not just a figurehead for Very Bad Things.Like I said, peaks and troughs. The triumph with the glass wall, and magic returning, but then Aelin's silly threats to the frightened, confused, disoriented people of Rifthold was fucked. And I'm annoyed that Chaol's injury was cheaped out with a quick fix in the Southern Continent. Like, really? It's heartbreaking, but what a piece of beautiful storytelling it would be for this paraplegic hero who fought for the freedom of his people to continue to fight this war and champion his king. It would be a testament to the fact that real strength is not about kicking and punching; it's about soul, and that anybody, regardless of what their body is capable of, can rise up and fight for what they believe in. There's a sentence, and it says that Chaol's injury won't break him...but the undertone is that it's only temporary. I know that this is fantasy, but fantasy is an imprint of reality. That's the beauty of this series, that it's not really about the quest, it's about the people who are on it. And I feel like a part of that is lost here. And I just bugs me. It bugs me because there's so much to love. The beauty and complexity of Elide (look, a disabled character whose story is lovingly and thoroughly told! Why are you afraid to do the same thing for Chaol?) and the complete wonder of Manon, and Asterin, whose story was so tragic, and that raised such powerful questions about body autonomy and nature versus nurture and humanity and family. And this glorious worldbuilding, so visual and beautiful, and the walk home to Terrasen. God, man, I'm tearing up thinking about it. I'm also tearing up with annoyance at all the time wasted faffing around with Rowan and his skin and Aelin's slinky nightgowns while so much bloodshed was going on in the streets. We have Aelin ripping on human Chaol for not doing enough while she and her immortal powerful lover hang around cooking breakfast and being cutesy and it just pissed me off. I have no strong feelings about the ships - I don't really care who ends up with who, as long as Manon ends up alone, because she needs a love interest like a hole in the head - but this Rowaelin thing did not need to be shoved down my throat like it was. And every single character ships it! Even Aedion, who honestly needed to grow a damn backbone. Prowling around being jealous then huffy then a total doormat for Aelin and Rowan to wipe their feet on was just depressing. Stahp, Aedion. I get that he's the archetypal devoted follower but I worry that he has no personality outside of that, his devotion to Aelin. I didn't even see what everyone else saw between him and Lysandra (Lysandra. GOD, this woman. I loved her so much I died a little. In fact, there are so many great female characters in this book, right down to Kaltain, who absolutely broke my heart with her courage and beauty and her vengeance). Lysandra is another character who needs a love interest like she needs to get hit by a carriage. Just don't. Just let the woman be, Sarah J Maas. Just let her be by herself for a while, in her lands in Terrasen, which was such a gorgeous moment of friendship between her and Aelin.Whatever. It's all water off a duck's back. In the end, I was cheering FIREHEART FIREHEART and crying and reminded of why I love this series, and am willing to pour so much of my money and my love and my time into it. Because it deserves it. Because even at it's worst, it's still so damn good. *I buddy-read this with my girl Ally. We had a blast, and a rage, and then I raged too hard and she had to remind me that this is in fact a fiction novel.*"}, {"userName": "Clau R.", "userReviewDate": "Jun 25, 2014", "userURL": "http://www.goodreads.com/user/show/13061577-clau-r", "userReview": "3.5 stars...Okay okay okay so... THIS BOOK. I'm so conflicted, I hated half of the things that happened but loved the other half! I was going to let myself give it 5 stars just for the AWESOME ending (overall the whole second part of the book was AMAZING), but the first part was unbearable! I believe it took me one week to finish it, while the second part I read it only in one day because OMGITWASSOAMAZING and I couldn't stop. BUT YES, the first part: BORING and ANNOYING. There are so many pages in this book and I don't feel they were necessary, also, I wanted to punch everyone.Another thing that I hated was what SJM did to my babies: CHAOL AND DORIAN. Especially to Chaol, he was so OoC most of the time! AND YES, I was a Chaolena shipper, (WAS, because that ship SUNK in this book and I'm so mad and sad and torn), but I wouldn't be as mad if SJM hadn't RUINED the character. She also ruined Chaolena's dynamics, she made them almost hate each other! At the end of the book everything is kinda better between them, but it will never be the same. So goodbye to my beautiful ship. Chaol didn't deserve what SJM did to him. And about Dorian... he wasn't in enough pages of this book. He was barely there (OH BUT AT THE END HE WAS SO AWESOME, I LOVE HIM SO MUCH).I'm not really fond of the whole Rowan/Aelin thing. I MEAN, I love Rowan, I really do! But what I liked about them was their friendship! It's really hard to find something like that in a YA book and I loved it, BUT THEN in this book they are suddenly all in love with each other, it doesn't make any sense! I can accept them together, I know I can, but SJM could have done a better job in making them fall in love with each other slowly, so WE the readers could notice the change! It was so abrupt! And I was so tired of hearing them saying how stunning and perfect the other was. Bleh. And tbh, they mostly wanted to undress each other in every scene they had together.SO... SHIPS I'M NOT ON BOARD:- Rowan/Aelin: I think they can convince me, but right now I'm a little icky towards them.- Chaol/Nesryn: I like Nesryn as a character, but SJM just put her in the book so Chaol could have a new couple, and it felt forced.MY NEW SHIPS:- Aedeon/Lysandra: YES, I love them!!! I really hope they become a thing in the next books.- Dorian/Manon: OOPS, am I the only one who ships them!? I mean, they surely can become a thing! The few encounters they had were some of the best parts of the book! And Dorian remembers her and FKDKDKGKGA. I don't wanna say much because SPOILERS, but yes, Dorian and Manon would be a powerful and really interesting couple.- Dorian/Chaol: YES I SHIP THEM. Can they get married, like, right now?And yeah... that's basically it. I just want to say that I absolutely LOVED the second part of the book. I couldn't stop reading! Dorian, Manon and Aelin are my heroes! GO, them!...EDIT: Just to add the thing I hate the most about this series! I absolutely HATE that EVERYONE IS SO IN LOVE WITH AELIN. Not just in this book, but in the WHOLE SERIES! Since book one! Sam, Chaol, Dorian, Arobynn, Aedeon, Rowan, even Lysandra... at some point of the series they have marveled at how stunning and beautiful and amazing Celaena/Aelin is, and I can't stand it! I mean, yeah she's awesome, I get it, but it's so unrealistic. Every male she befriends has to fall in love with her :/."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Oct 01, 2014", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "This one takes a close 2nd to Crown of Midnight as my favourite in the series. So so SO good!"}, {"userName": "Giovanna", "userReviewDate": "Oct 06, 2013", "userURL": "http://www.goodreads.com/user/show/23204207-giovanna", "userReview": "Edit: I've been wondering about these two stars. So...changing it to 1. Maas just sticks to her pattern of making characters OOC and Manon isn't enough to redeem this...thing. I can't even call it a book anymore. *if you comment please be civil. I've already had enough bad discussions about this and my patience has a limit. I've already seen enough of \"why are they complaining, QoS is perfect.\" Everyone can have their own opinion, please respect it. If you liked the book and you want to discuss it feel free to comment, but please respect my opinion.The bad: - It seemed like book 1-3 never happened. The character development is all over the place, there's no coherence in what they do and how they act and it's like everything that happened before QoS is gone. - I can't stand Celaena/Aelin/She-who-must-not-be-named anymore. She seriously has some issues about taking responsibility for her actions. I mean, nothing is her fault, not ever. Girl, get your act together, please. She actually says that Dorian's situation is Chaol's fault, that Nehemia's death was all his fault (again??? It was her decision to make, she sacrificed herlsef for you!) and that even Endovier was his fault (how's that possible I don't know.) What the heck.Also, I kind of hate how everybody is in love with her, because not only this is all Mary-Sue-like, but it also ruined most of the characters. Let's stop and think, just a moment: she went through four different guys, in like, four books (five if you count the short stories). Yes, she knows how to kick some ass, but in this book she was bitchy, arrogant and insufferable. You don't take for granted that people should risk their lives for you. Not to mention that she spends half the book saying that she doesn't need anyone or anything because she is this powerful person now and then melts two seconds after seeing Rowan. Coherent much.- Can I say that the thing about Aelin and Celaena being two separate persons feels like a joke? At the end of HoF I had the impression that she had accepted that she was both Aelin and Celaena. mean...just because you change your name doesn't mean that you're a completely different person. If it means that...well, let me tell you, it is called \"personality disorder\" and there are people you can talk to about that. She wouldn't be who she is if she hadn't trained and became an assassin, so don't give me all this bullsh*t about being a completely different person, because you don't change completely by changing your freaking name. It's also quite funny that Rowan thought that Celaena was a vicious, cold creature. I mean, Celaena was shallow, vain, funny, it's Aelin that is quite a bitch...- In CoM I was a huge Chaolaena shipper. Now, to be honest, I don't think Celaena is even worth the ground Chaol walks on. *mama bear comes out, you better hide*I mean, if she had just moved on, without all this bullsh*t, I wouldn't have been this angry. Guys, I loved them together, I still remember CoM and bawl like a baby, but sometimes stuff happens and people aren't okay for each anymore right? Now, if that had happened I would have been okay with it. But I feel like Maas just made Chaol act out of character, threw Rowan in the mix and suddenly Celaena (or whatever you want to call her) decided to treat Chaol like sh*t. I'm not even that mad at the change of ship but at HOW this change happened. - I know lots of people hate Chaol. I love him. He's the most realistic, complex character there is in the series, and yes, he has flaws, and I love him for that. I remember after reading HoF seeing so many people say that Chaol was behaving like a terrible person and that he couldn't accept Celaena because he didn't love her and things like that. I, personally, understood his behaviour. He's human. She had lied to him about everything and left and he had all the rights in the world to doubt her. He's been taught to see magic as a terrible thing for all his life, it's normal that he can't accept that in a blink of an eye. In QoS his behaviour doesn't make sense and he acts out of character most of the time. He spends all the time drowning in self-pity. https://s-media-cache-ak0.pinimg.com/...Why, Sarah, why ruin a character like him? Oh yeah, you had to, so it would be easy for other characters to shine. So, yes, I don't like how his storyline progressed, he didn't even had a role for most of the book. That was terrible and a horrible narrative device. In my opinion throwing away and completely destroying a character just because you fell in love with another is not only a poor job for an author but also unfair to your readers. Also, let's say this: he made mistakes, true, but the things he said? Most of them were true. No one questions Aelin, but how can he trust her when all she said was that she had to kill Dorian? How can you trust someone that cares about no one but herself and her fae puppies? - Let's talk about Rowan. I liked him and Aelin as friends. I'm not into this ship because I don't feel anything for him and Aelin as a couple, but this wasn't a problem for me. However if there's one thing I'm bitter about it is how this happened. The thing is, I don't think that it was coherent. Half of HoF was about Aelin repeating that they were friends and before people started shipping them I actually thought that their friendship was platonic. Yes, I just didn't see the chemistry and I still don't, but I think that if this had happened in book five, if their friendship had slowly turned into something more and not in like 2.5 pages I wouldn't have been this angry. All of this didn't seem coherent to me, which is the biggest problem I've had with lots of elements of this book. Not to mention that Rowan is like 300 years old and suddenly becomes like a teenager ruled by his hormones. I mean, he has never seen a nightgown. Unrealistic. Congrats, three characters already ruined! What kind of writer are you? You threw away two (three) great characters just so you could make this happen? Can we just, can we just look at the situation for a moment: hell no. You fell in love with Rowan? Fine. Just don't destroy another character because of this. Also ---> it was a damn good thing Rowan had no interest in her, either, because she knew she was stupid and reckless enough to consider whether moving on in the physical sense might solve the problem of Chaol.AHAHHHAHAHAHAHA- Can we just laugh at the fact that even Aedion started fangirling about Rowan? I mean, even Chaol thinks he's handsome. My eyes, my poor eyes.- Why every single female character has to be paired up with someone? Why can't we have an indipendent badass lady who doesn't need a love story? Please. It's so freaking ridiculous. I mean, even Manon? Not to mention Nesryn, who is just a mean to give Chaol his own new love story. I want to see an indipendent badass lady that needs no man. - I felt like lots of characters lacked depth. I mean, Lysandra is funny and all but I found her character to be forced, like...too much. She seemed...fake. Same goes for Nesryn, who's there just to be Chaol's new love interest, but had much more potential.- The writing was so redundant. Aelin was always \"fire breathing something\", \"death, bringer of sorrows and blah blah\", \"destroyer of all that breathes and whatever\". Stop it. PLEASE STOP.I call her \"Aelin devourer of the many love interests\". - Aedion was totally useless in this book. He isn't the same Aedion I saw in HoF, he's just Aelin's puppy. - The king's plotline...I'm laughing. Everyone's good, let's have some tea. Why can't anyone be truly evil? Ugh.The good (a much shorter list):- I liked the bromance. Chaol and Dorian's friendship, that's pretty much what kept me from throwing the book away. Chaol was the only one who cared about saving Dorian, and refused to believe that he was truly lost. I wanted that kind of friendship for Celaena too, but everything turns into romance when she's involved. *deep breaths*Anyway, as I said, I love Chaol and Dorian's friendship. It's complex, it had to go through some though things in HoF, but it truly is a beautiful bond. It should have been there in QoS too, but Maas didn't even bother with giving them a role in this book. - I love Manon, she's amazing. She's one of my favourite characters ever, one of the few reasons I might finish this series and probably the only reason why QoS doesn't get just one star. Thank the stars for Manon and her badassery. Great character development, badassery and bloodshed. I loved Asterin and her story was truly heartbreaking. I liked Elide too, she has a quite heartbreaking past, but she's such a strong and interesting character that I couldn't help but like her. She can't fight, but that doesn't mean that she isn't strong. Kaltain was a good surprise too, the last pages are the only one I truly enjoyed.- Manon? Manon. MANON. And the precious Abraxos. Overall this gets 2 stars, just because of Manon and the female secondary characters. Manon saves the day, but it isn't enough. There are a lot of things I despise here, and I'm talking about things like being coherent and being able to write a realistic character development. In my opinion Maas made quite horrible choices as a writer. I don't care if you love Rowan, if you want him to end with Aelin, if you write it in a good, realistic way, I'll be fine with it, but you just don't destroy all the characters because you feel like it. I'm so pissed off. This just takes back everything that happened in book 1-3. Everything. Really such a poor excuse of a book you are, Queen of Shadows. I hope that I will be able to at least enjoy book five, but at this point I wouldn't be surprised if I didn't."}, {"userName": "Angela", "userReviewDate": "Oct 05, 2014", "userURL": "http://www.goodreads.com/user/show/30035966-angela", "userReview": "\"Do you think monsters are born or made?\" \nI just... I just... I can't... I just don't know what to say. Celaena is coming for everything they said she couldn't have. Game of Thrones meets Batman. That's what the Throne of Glass series is... and yes it's as epic as that sounds. Sarah J. does it again. Another stunning build of a book. This review is going to be so hard to write. I want to gush. I want to scream. I want to rage about this book, but can't because *sigh* spoilers. As much as I want to spoil this for you I wont. I will still write my feelings about it and highlight a few moments I loved, but I just wanted to give warning this review WONT have spoilers in it... I will say that if you haven't taken the time to read this series you're a fool and I have no idea what you're doing with your life, besides living it wrong! Queen of Shadows picks up right where \nHeir of Fire\n left off; pulling us behind a car by our heartstrings. There are a lot of characters introduced and finally produced in this book that I unfortunately wont be able to touch base on in this review. Just understand that the smallest player can end up playing the biggest part. Anyways, I'll just jump right into our main players. First off lets talk about Dorian. God, I love him in this book (If you've read QOS you probably read that sentence and thought I was insane but I don't care). I absolutely loved reading from his point of view. The complete change from light to dark had me drawn in. He became such a stellar character in this novel. He is a true wild card at this point in time. Then there's Choal. I know people love Choal. That in the previous books everyone has been \"team Choal this\" \"team Choal that\", however if you know or have read any of my review for this series then you know I have not been team Choal---or even team Dorian. Choal does give us a ton of character development and growth in this book, and I love his character but he's still not one of my favorites in this series. Then we have a \"newer\" player, \n  Aedion\n... Love him. His sass, his loyalty, his personality shine so bright in this book. I just couldn't get enough of him. And the growing bromance between him and Rowan had me dying. This leads me too the two people I've been dying ta get ta....Yes, Rowan and Celaena. I know that Celaena officially goes by Aelin in this book, but I'm going to warn you now that I will probably always call her Celaena or \"C\". These two... OMG. THESE TWO KILL ME!!!!!! I haven't shipped a ship this hard in the longest and it has me all sorts of giddy. Again if you've read my review in the past then you know whose team I've always been on... Team Rowan. From the moment this man was introduced it was signed, sealed, delivered. I LOVE HIM!!!! Good gods I love him. Though we got a good deal of him in HOF it isn't even half of what we get out of him in this book. We get to see into his brain. We get to see how he is feeling, he's stages of thinking, and his feeling towards Celaena in a way we haven't been able to in the past. It has be swooning all over the place. Everything he does and says will win you over. He was already on my favorite fictional guys list but lets just say after reading this he has defeintely moved up on the list. I can't wait to see where their bond takes them.It's refreshing to have a character in this series that generally understands her struggles and the weight that has been put on her shoulders. Lastly we have Celaena. I have said it on many many occasions that Celaena is my all time favorite female character. Queen of Shadows just further justified this for me. She is one cunning, whip smart, silver tongued, bad-ass bitch. QOS by far gives the best description I've ever heard of her...\"A storm given flesh.\"That sentence is so spot on it isn't even real. In QOS ya girl is taking no prisoners. No seriously, If Celaena was in a GOT house she would be a freaking Lannister... and yall know why... Because a Sardothien always pays her debts.\n\nI can't even count how many times I screamed \"OH MY GOD\" over something she did. At one point in time this was my goodreads status update... \"Seriously????!!? Did C just drop the mic??? UH YEAH SHE DID!! Seriously just screamed \"oooooooooooh damn\" and scared the crap out of my dog. She just such a badass\"... Everything she does is so calculated that when you finally see all the pieces come together you'll be exploding. Your brain will have to take several cold showers to get over the mind rape she will do to you. If there was something you wanted from C that you didn't get in the past you'll get it in this one. She gives you a side of her we haven't seen. This raw real emotion that takes her character to a whole new level. Celaena's character in this novel had me bowing down to the real Queen that is Sarah J Maas. *Insert slow clap*. Bravo! Thank you for making a character that is the epitome of strong leading female. Yes Celanea might go a little stray cray here and there, but God... She might want a man but she doesn't need one. She can do bad all by herself. Sarah continued to show that you can be tough but still love the things you want. You can wield a sword but still love dresses. That you can be all these strong willed tough as nails things, but still love deep. There's no other word to describe Celanea's character besides amazing. As for the characters I couldn't mention, they truly hold their own in this book. One surprise after another. There is one certain witch in particular that I can't wait to see in the next book.I know I talked a lot about the characters and not so much about the plot. Again that is only because we are now four books deep people. QOS is the perfect balance of action packed scenes, romance, fighting, plotting, and build up. This is basically me the whole time... Page 1-170 I thank Maas for giving me everything back. Page 181 I die. Page 295 I freak the f out! Page 319 I cry my eyes out. Paged 320 I curl up in a ball and die again. 370 I realize that if my heart wasn't stolen by C before it's was officially taken. Page 400-656 I don't breathe and can't feel my body. I cry. I swoon. I die again and didn't even know that was physically possible. Swoon some more. Then do my final freak out. This is all without even mentioning the crazy plot twists that happen. They sneak up on you and tear your heart and eyes both out. Sometimes at the same time. And that ending, though a lot of lose ends are taken care of it still has me so conflicted. I just don't know where this story is headed. My heart is telling me it going to go one place while my head tells me to expect another.\nThe whole ending plays out just like a movie. So vivid you can see and feel the whole thing. Just phenomenal. Queen of Shadows was well worth the wait and hanging around till the next book comes out might just do me in. Don't even get me start on how we still get at least two more books! Sarah J. Maas continues to surprise me with a series I never even thought I would like, but has turned out to be one of my favorites. All in all Queen of Shadows is about finding your place in the world. Consuming what you must and then fighting for what you love. That you yourself can be your best friend or your worst enemy. That it isn't about how heavy the weight is but about how long you hold it. That you get to choose your future. That your past might have built you but that it doesn't have to define you. That one person can truly rattle the stars. originally read September 2015. Re-read August 2016  READ THIS REVIEW AND OTHERS OVER ON OUR BLOG:SOUTHERN BRED SOUTHERN READSOUTHERN BRED SOUTHERN READ SOUTHERN BRED SOUTHERN READ"}, {"userName": "Lyanna (I need a Herondale in life)", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/25237867-lyanna-i-need-a-herondale-in-life", "userReview": "UPDATE (08/14/15): QUEEN OF SHADOWS IS HALF A MONTH AWAY, I REPEAT, QUEEN OF SHADOWS IS HALF A MONTH AWAY!!!!!!!!!UPDATE (1/23/15): Aaaand we can finally stop calling it Throne of Glass 4 and start calling itWant to be updated on everything Throne of Glass?Visit the Throne of Glass fansite!It's not a trilogy?! EVEN BETTER Now for the long, long, long wait:[paces around the room][sits down][checks watch][stands up][paces around the room]I JUST NEED MORE OF ROWAN OKAY."}, {"userName": "Ben Alderson", "userReviewDate": "Aug 18, 2016", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "can i give this one million stars.\\pins[gjanbsf;igu[iUWRBNG[aiounfwdpvaoiunsfpgiubs[FUVBthe ending]odifnailsjfbgas;ifubg;iausbnfg[iousnDG[OUABNFOIUASNDGTHE CLOCK TOWERLSIDUFGpsbnr[fiuns[DIUGNAIUGNpsiungpaisubgTHE FIREEEEEE"}, {"userName": "Serena (The Book Comedian)", "userReviewDate": "Sep 28, 2014", "userURL": "http://www.goodreads.com/user/show/12242598-serena-the-book-comedian", "userReview": "FIRST YOU MAKE CELAENA LEAVE CHAOL AND NOW YOU MAKE HER LEAVE ROWAN?! Why don't you just take my first born baby.When Rowan was first introduced in the book I was like uh NONONO, I DON'T THINK SO, THIS FRIENDSHIP BETTER STAY PLATONIC-but by the end of the book I was like YESYESYES SHE MUST HAVE ROWAN and THEN the author kept emphasizing how they were JUST FRIENDS. SARAH WHY WOULD YOU DO THIS TO ME, YOU SET ME UP- Making me slowly like Rowan and then just TAKING IT ALL AWAY T_TI hope this situation will be remedied- preferably through a hunger game type of setting where Chaol, Dorian, Aedion, and Rowan fight to the death for Celaena. My rank of who I would want to win that game:1. Rowan2. Aedion3. Dorian4. Chaol (sorry Chaol, you were just not meant to be)What's your rank?Heir of Fire Review: https://www.goodreads.com/review/show..."}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Apr 02, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "Re-read on audio. Still awesome and still loving the narrator of the books ❤️MIND BLOWNSooooooooooooo, I loved this book! I was a little iffy there because I wasn't sure if Rowan was going to be in it but it's all good :-) Celaena/Aelin has returned to Rifthold. She's trying to sneak in undercover. She has a little bit of a different look for a bit. A little bit of hair dye goes a long way, but most people knows who she is. She is back to save her cousin and do what she needs to do to get rid of the evil in the land. I fell in love with Lysandra in this book, I love what she truly is and when Aelin does what she does to change a few things, it is on with all of the \"special\" people :) That's all I can say...you know, the spoiler thing! Anyhoo, I love that Aelin is more of a bad arse than she was before, but then again she found her true self while she was gone. I love her cousin Aedion and what we find out about him. It's just all so awesome! I wasn't pleased with Chaol in the first of the book, but it all came together in the end. The whole group, even some of the evil ones, got together and fought the good fight. TOGETHER! Well, ya know, there is a little bit more evil in their world so it's best if some of them hook up and get it done. And finally we have a kiss that I was waiting for the whole book :) I thought the chemistry with all of the characters in the book was wonderful! This was the best book by far, although, I did love Heir of Fire a lot as well. So many people came together and with so many plots and schemes that were just brilliant. It's certainly not over, you just know there is going to be more to do with the way the book ended! I can't wait for more!!MY BLOG: Melissa Martin's Reading List"}, {"userName": "C.G. Drews", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "[So they tear down the towers. Release the magic. Kill the king (!!) who actually was CONTROLLED BY ANOTHER DEMON and miiiiiight not have been uber evil after all. Free Dorian when Chaol \"dies\", it just snaps Dorian out of it. :') Chaol gets kinda cooked but in the end is only paralysed. Aedion and Rowan nearly get eaten. Aelin burns things and gets stabbed by Dorian. Adorable. She announces Dorian is King of Ardalan and she's Queen of Terrasen. She gives Lysandra loads of land. Manon eats people and rides her dragon. And Rowan, Aedion, and Aelin go home to Terrasen.I still ain't happy. I'd be FINE with Aelin's change in ship and heart and just focus on fey things. I WOULD BE IF THE BOOK GAVE EQUAL INTEREST TO DORIAN/CHAOL. BUT IT DOESN'T. They're like not hardly even in there. Equal rights dammit. (hide spoiler)]"}, {"userName": "Steph Sinclair", "userReviewDate": "Aug 20, 2015", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "By far, the best book in the series yet. Review to come."}, {"userName": "Jamie (The Perpetual Page-Turner)", "userReviewDate": "Sep 08, 2014", "userURL": "http://www.goodreads.com/user/show/1518370-jamie-the-perpetual-page-turner", "userReview": "[We are just going to go straight up lists for this because it’s been over a week and my brain still is like HAHAH YEAH COHERENT THOUGHTS WHAT ARE THEY.1. SHIPS AND THINGS: So it’s no secret that there has been lots of speculation about ships and where those would go in this series. I take my ships seriously. But I’ve realized some people take their ships EVEN MORE SERIOUSLY (ie. death threats to authors and crap). What I’m always more concerned about, especially with a fave series, is the integrity of the story that author is trying to tell rather than an author feeling pressured to give reader wish fulfillment. What I mean by that is I WANT CELAENA TO END UP WITH WHO SHE NEEDS TO BE WITH REGARDLESS OF HOW I FEEL ABOUT IT. If it happens to be the popular ship, cool. If it happens to be my ship, even better. But like…I need to BELIEVE that this is true to the character and their journey and this is what has to happen. Now, I rarely jump ships. I’m truly loyal. But QoS made me jump ships faster than a pirate looking for more booty. I was so team Chaol. And then I wasn’t. We saw his lack of acceptance for certain things about Celaena in HoF and (it should have raised red flags for me but I’m a hopeless romantic) and it struck me pretty early on in QoS that they couldn’t be together in my mind. At least not right now. Or ever. Maybe they will just be good friends. WHO KNOWS. You can’t be with someone who doesn’t get these essential parts of you. Who doesn’t accept them. Things that are you to the core. That are an important part of who you ARE and who you are going to be. Chaol can’t get past some of these things. I think he tried to believe she could be who he wanted but couldn’t altogether. She deserves to be with a person who gets her. Truly. She deserves to be understood to her core. Chaol loves her no doubt…but it might not be in the way she NEEDS or WANTS to be loved romantically. ALSO, we always knew early on that Chaol’s allegiances would always be to Dorian. That was evident from book 1. That was his King in his mind. And now he is the King. And he needs to be there while she is figuring shit out with her kingdom. They have dueling and conflicting journeys right now. I know lots of people are going to be upset about the turn in ships but I actually find it hella refreshing that a young female character doesn’t have to always be with their first or second love etc. That they can learn and grow and appreciate what that person brought to their life. Chaol did so much to help her to realize who she is and what she is fighting for. He is part of her journey to where she is now. I mean, this happens in life. Someone is right for you at a certain chapter in your life and then sometimes you both are still moving…but in different directions. Like hello my whole high school and college until I met Will. I thought I wanted vastly different things as I was coming of age. I don’t know what the rest of the series holds for them but I am SO OKAY WITH WHERE THEY ARE RIGHT NOW. And maybe they will be right for each other again….but they both of things to deal with in the remaining books…you never know where life is going to take you. But Sarah made me feel like THIS IS THE RIGHT THING. This is right for my girl. She is so complicated and still figuring her shit out and she deserves to be able to do that. She was a different person in some ways when she met Chaol. She deserves to keep figuring out who she is and what she wants –and decide who she wants to love. It’s an important decision when it comes to matters of the heart. I will defend this until the end of time. I HAVE SO MUCH PEACE ABOUT IT.2. Manon continues to be one of my favorites EVER and I think her character is even more fleshed out here. She still feels like who she is but these shifts within her in this book are SO believable to me and I can’t wait to see what she does in next book with all the info/perspective she has now. I have been waiting for an epic showdown between them and IT WAS THE SHOWDOWN THAT DREAMS ARE MADE OF. I burst into tears at the two acts of kindness they showed toward each other. THE MESSAGE ABOUT DORIAN. OMG OMG. BAWLED. I can’t wait to see when they meet again.3. Aedion: I’m just saying I want Aedion for MYSELF. He is a character who I loved getting to know better in QoS as I already loved him in HoF. “And Aedion grinned at his queen as the entire world went to hell” I DIED I DIED. The first eye contact between them after these years. DIED. And their first real conversation after they got to have after they rescued him….KILL ME NOW. EPIC REUNION IS SO BEYOND EPIC. The plan and execution was flawless.4. Dorian’s POV: One of the most distressing, and I mean heart in the pit of my stomach distressing, was Dorian’s POV. Oh my heart I wanted to puke. It was breaking my heart to watch him not remember and try so hard to. To be aware and acknowledge the demon in him and trying so hard to fight it. I cried so hard when he remembered his name. I LOST MY SHIT when C says to him, “We get to come back from this loss — this darkness. I came back for you.” LOST IT. LIKE SOBBED. And I totally felt like as much as she was saying it to him…she was reminding herself of this.5. THE BATTLE IN THE END. Her plan. Slipping the eye in Chaol’s pocket. How she saved Dorian. The banter with the king. THE FUCKING FIRE WALL. I was had to remind myself to breathe during this epicness.6. FUCKING CANNOT WAIT FOR MY QUEEN TO RECLAIM HER KINGDOM AND SEE WHAT IS UP THERE.7. HOT SEXY ROWAN. Please make that towel drop next time SARAH!!! “You make me want to live, Rowan. Not survive; not exist. Live.” HEART STOPPED. This is what I want for her. This is why I ship this.8. HOLLA BADASS LADIES: I’m so all about all the amazing dudes that Sarah writes (no seriously how does she?) but I was soooo in love with the roles that the ladies played in this book. It’s magical what Nesryn and Lysandra brought to this book. SQUAD GOALS ALL THE WAY. Badass, unapologetic ladies in the house! And seriously Kaltain quite literally blowing shit up?? And obviously Manon being Manon and what she did. IT WAS ALL ABOUT THE LADIES SAVING THE DAY IN THIS BOOK  (hide spoiler)]"}, {"userName": "Maureen", "userReviewDate": "Sep 01, 2015", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "3.5/5 StarsVIDEO REVIEW [there is a tiny non spoilery section for those who have read the rest of the TOG series: https://www.youtube.com/watch?v=jKhox...I HAVE FINISHED THE BEAST.I really really enjoyed this, though it definitely was not my fave. A lot of things were not done as well as they could have been (so sad to say that) BUT THAT LAST 100 PAGES MAAAAAN. So good.There were a lot of things that surprised me, a lot of things I loved, and a few things I didn't love. ** after more thinking and talking to friends i'm gonna have to move this down to 3.5. It's sad because I want this to be like a HP for me where even at it's worst it's amazing, but it just isn't that. **"}, {"userName": "Mikee Andrea (ReadWithMikee)", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/44137919-mikee-andrea-readwithmikee", "userReview": "Find me on Instagram & Twitter!\n\n❝She was fire, and light, and ash, and embers. She was Aelin Fireheart, and she bowed for no one and nothing, save the crown that was hers by blood and survival and triumph.❞\n\nHOLY CRAP. I finally did it. After more than a year of putting this book off. After two months of trying to get through this book... I. FINALLY. DID. IT. I was on the verge of deciding whether or not I wanted to DNF this series or not but after Queen of Shadows... all I can say is: WHAT WAS I THINKING?Well... actually, let me tell you lol. As great as Queen of Shadows was, as great as this whole series is, my Throne of Glass experience wasn't always smooth sailing. In truth, I honestly have a love/hate relationship with Sarah J. Maas and her books. All you readers who absolutely despite SJM and her books... I know how you feel, because SAME. Other readers who love and need SJM and her books as if it were air itself, I know how you feel too because YASSSS. Trust me. Brace yourselves ladies and gents because this will be a long one considering how I'm about to release a year's worth of love and frustration.Let me first start off by saying that this series changed A LOT through the years. Heir of Fire marks the end of Celaena Sardothien and the rebirth of Aelin Ashryver Galanthynius. And going into this book, I must say, I was NOT impressed. There were two main reasons why I put this book off for more than a year and contemplated putting this series off for good. One, I did not like Aelin. Celaena made me fall in love with this series and she was the person that made Throne of Glass great. At least in my opinion. People had their own issues with Celaena. Love her or hate her, she carried this series. Now... not so much. Don't get me wrong, she's still great and all but she is no longer the star of the series that introduced me to the fantasy world I love today.This whole series, alone, is no longer the same. In some instances, the changes were great. In others, not at all. Sarah J. Maas brought an influx of great, new characters but at the same time, it felt like I was saying goodbye to the old ones. These old characters may still be around this far into the series but they're definitely not the same characters I grew to love. Some changed for the better, and some turned into completely different people. Literally. And also figuratively. That especially being Celaena. And Chaol.Which brings me to reason number two: Chaol and Celaena. Hate me and judge me all you want but romance plays an important factor for me in books. (Don't come running after me with pitchforks now) It's not the only reason I read books, but romance and ships are like the cherry on top of a fantastic series for me. I want it all. Action, romance, plot. The whole shebang. And when it came to ToG, Chaol and Celaena were the heart of this series for me. In fact, they were the reason that gave me the push to pick up this series in the first place. So you can imagine why I did not want to dive into the inevitable that was Queen of Shadows. Sarah J. Maas changes her heroine's love interests like the weather. One book it's him. The second book it's this one. Third book it's that one. You're either for it or against it, and I learned it soon enough to be indifferent towards the romance in SJM's books or else you'll only be VERY angry. Take it from the angry shippers from TOG or ACOTAR!I started off with a very negative mentality going into Queen of Shadows and the first 250-300 pages didn't make it any better. The first chunk of the book was horrendously, torturously B-O-R-I-N-G. That actually says a lot because I never find Sarah's books boring. It's usually quite the opposite. It was so boring that it seriously had me contemplating on whether or not I wanted to DNF it. It's also why I had to dock off a star no matter how good it got in the end. Queen of Shadows could've easily became 200-300 pages shorter if Sarah would've just cut out all the boring, filler chapters in the beginning. That being said, once the story finally did pick up, it skyrocketed. There were actions and twists left and right, and sometimes I found myself barely keeping up.Aelin may not be the driving force of this series anymore but EVERYONE ELSE IS. Let me start off with the queen herself. Nope, not you Aelin. MANON BLACKBEAK. All hail Manon and the Ironteeth Clan. Manon's chapters in Heir of Fire made me die of boredom up until the end of the third book, and they just kept getting better and better in Queen of Shadows. Manon is the heroine I want to read about. She officially dethroned Aelin as the greatest female character in this whole series. SLAY QUEEN.In all honesty, the only reason I'm still reading this series is because of Maas's secondary characters. Manon, Dorian, Lysandra, Aedion, Chaol, Elide, and even Rowan. I hated Rowan's jerkface in Heir of Fire but once he stepped in Queen of Shadows I'm like, \"Hey, hello. Where have you been? ;)\" Don't know how that happened but suddenly I'm swooning over jerkface Rowan. Like I said though, Aelin is great and all, but I miss the old Celaena Sardothien. This new Aelin is now overshadowed by all these amazing side characters that although she's the main heroine of the story, she's probably the least favorite character. At least for me.Going into Queen of Shadows, my expectations weren't very high. I knew the disappointments that were coming and after more than a year of avoiding this book, I was prepared of what was to come. This review has been sounding a little negative but it really isn't. Although I was expecting the worst, in truth, it wasn't as bad as I thought it would be. I'm still on the fence about Aelin but I've came to love and even accept everything else. This series has grown and evolved into something more vivid and complex, and I, along with it. I've learned to expect nothing when it comes to SJM's books and just let it come to me, free and willing.I did have my disappointments within this series, and I know it probably won't end here but reading Queen of Shadows really reminded me of why I came to love this world and these characters. The ending brought back so many nostalgic feelings, and although I was a little sad about the changes that occurred throughout this series, I'll admit that our original trio: Aelin, Dorian, and Chaol have certainly came a long way since Throne of Glass. You may hate Sarah J. Maas but one thing's for sure: she is not going anywhere any time soon. Love her or hate her, her books, her characters, her storylines but you can't deny the fact that Sarah is one hell of a writer. And when it comes down to it, it will really break my heart to see this series come to an end after so many years. Empire of Storms, here I come!"}, {"userName": "Warda", "userReviewDate": "Sep 03, 2015", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "Every time I reread this series, I get fully consumed by it. Heart and soul! I'm going to love and adore it till death do us part. All hail, Sarah J Maas! 👑 Original review!Reread. Crying. Magnificent. My heart is so full and content right now. These books have me feeling all kinds of ways and I'm always drowning in emotions once I'm finished. I'm forever grateful to Sarah J Maas for creating these books and crafting such an epic story! I haven't fangirled this hard about an author or a book series since Potter."}], "description": "The queen has returned.Everyone Celaena Sardothien loves has been taken from her. But she’s at last returned to the empire—for vengeance, to rescue her once-glorious kingdom, and to confront the shadows of her past…She has embraced her identity as Aelin Galathynius, Queen of Terrasen. But before she can reclaim her throne, she must fight.She will fight for her cousin, a warrior prepared to die for her. She will fight for her friend, a young man trapped in an unspeakable prison. And she will fight for her people, enslaved to a brutal king and awaiting their lost queen’s triumphant return.The fourth volume in the New York Times bestselling series continues Celaena’s epic journey and builds to a passionate, agonizing crescendo that might just shatter her world.", "title": "Queen of Shadows\n      \n          (Throne of Glass #4)", "url": "http://www.goodreads.com/book/show/18006496-queen-of-shadows", "average": 4.59, "cover": "https://images.gr-assets.com/books/1441230104l/18006496.jpg", "reviews": 16323, "authors": [{"url": "https://www.goodreads.com/author/show/3433047.Sarah_J_Maas", "name": "Sarah J. Maas"}], "type": ["Fantasy", "Young Adult", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/18006496-queen-of-shadows", "http://www.goodreads.com/book/show/23848145-queen-of-shadows", "http://www.goodreads.com/book/show/7896527-throne-of-glass", "http://www.goodreads.com/book/show/16096824-a-court-of-thorns-and-roses", "http://www.goodreads.com/book/show/17167166-crown-of-midnight", "http://www.goodreads.com/book/show/17927395-a-court-of-mist-and-fury", "http://www.goodreads.com/book/show/20613470-heir-of-fire"]}