{"ratings": 2381, "userreviews": [{"userName": "Jacob", "userReviewDate": "Mar 26, 2010", "userURL": "http://www.goodreads.com/user/show/637062-jacob", "userReview": "April 2010First Reads win. I haven’t paid much attention to the recent flood of Classic Novels With A Supernatural/Horror/Sci-fi Twist, or the tsunami of Historical Figure As Secret Defender Of Mankind stories that followed. Truth is, I was really holding out for Cultist in the Rye (“After his expulsion from boarding school, as well as the Sacred Brotherhood of Blessed Darkness--no thanks to that phony Stradlater and his phony plastic skulls-and-candles rituals--teenaged satanist Holden Caulfield spends one final weekend in New York as he prepares to wake the Old Ones and bring an end to this phony, phony world”), but that’s probably not gonna happen. C’mon, Salinger’s been dead for months; surely his estate has cashed in by now! No? Aww. I guess I’ll have to console myself with lesser works--like this! Queen Victoria: Demon Hunter. Catchy title, catchy cover, and how could I ignore the following blurb? Colon:\"There were many staff at Kensington Palace, fulfilling many roles; a man who was employed to catch rats, another whose job it was to sweep the chimneys. That there was someone expected to hunt Demons did not shock the new Queen; that it was to be her was something of a surprise.\"Oh, Goodreads, you lied to me.It’s like a really awesome trailer for a really lackluster movie, where all the good jokes and awesome lines from the two-minute video turn out to be the only good bits in the whole two-hour snorefest. You thought she’d be some kind of badass monster slayer, right? Latest in a long line of royalty keeping Britain safe from the forces of darkness, banishing demons between royal functions, not being amused at all, that sort of thing, right? Wrong! Victoria’s just a regular old queen (or is she?) whose throne is somewhat threatened by an ancient demon bloodline, but not to worry, there are other people who do the demon-slayin’ for her...that is, until her husband Albert gets kidnapped by werewolves. Then it really gets not amusing personal. Cue training montage. Eighties music probably doesn’t work here. And then she breaks out the steampunk weaponry and saves the day. Fun, sure, and kudos for having a strong heroine (and more kudos for a great depiction of the utter squalor of Victorian London), but really, it wasn’t worth it. After a fairly dull story about young Victoria and her handsome prince, with several poorly-developed zombie subplots and a not-very-threatening demonic conspiracy, the epic and chaotic demon-slaying climax feels kinda tacked on and, well, really boring. Really. Boring. Shocking, I know. Not even the mountains of gore and intestines can save this book. It's a bit sad, really--I was expecting it to be entertaining and amusing, nothing great, a solid three stars, but really, it wasn't even that good. I don’t know what to believe anymore. If they can’t even do Queen Victoria well, I don’t think Zombie Salinger has a chance."}, {"userName": "Bry", "userReviewDate": "Jan 15, 2010", "userURL": "http://www.goodreads.com/user/show/1360862-bry", "userReview": "Basically it boils down to this....Blah blah blah....nothing happening...Blah blah blah....British history...Blah blah blah....nothing happening...Blah blah blah....GORE GORE GORE GORE GORE VIOLENCE GORE.....Blah blah blah....nothing happening...Blah blah blah...Ewwwww zombie prostitute sex....Blah blah blah....nothing happening...Blah blah blah...end of attempt at money grabbing off monster/classical literature mash up trend.Example of gore and violence...Jacqueline [a zombie:] used the moment to strike, driving her fist into Sugar's face and into her mouth, Sugar's jaw breaking with a snap. With a low, gurgling moan, Sugar dropped to her knees and Jacqueline moved to stand over her, ramming her fist further down the poor woman's throat until it was immerses fully to the elbow. She seemed to be almost rummaging for something, and expression on her face like that of a child rooting around in the sawdust for a lucky dip barrel. Then her gore-streaked arm emerged, her hand clutching an assortment of innards that she pushed greedily into her own mouth as, behind her, Sugar fell forward to the library floor, blood pouring from her mouth which gaped loosely open."}, {"userName": "Audra (Unabridged Chick)", "userReviewDate": "Apr 21, 2010", "userURL": "http://www.goodreads.com/user/show/3083001-audra-unabridged-chick", "userReview": "Love/Hate?: Love!Rating: 5/5Did you finish?: Yes -- laughing the whole time, too.One-sentence summary: Queen Victoria slays zombies.Why did you get this book?: I've seen it around but haven't heard any buzz.Do you like the cover?: Yes.First line from book: Much later, as he watched his manservant, Perkins, eating the dog, Quimby gloomily reflected on the unusual events of the evening.Review: I didn't know what to expect when I started this book, but I was pleasantly surprised. It was more graphically gross than I anticipated -- but I'm not normally a zombie/horror reader, so maybe it's not really too shocking for folks used to the genre? Gore aside, this novel has a wonderful sense of humor -- so much so I was constantly chortling, giggling, and chuckling on my commute. The alternate history presented by Moorat was fun and believable (for me, but I'm not a Victorian scholar). I think Quimby had to be my favorite character, followed by Queen Victoria -- I have a bit of a girlcrush on her!Moorat's next book is on Henry VIII as a werewolf, I think -- I'll likely pick it up because the tone and humor in this one was so good."}, {"userName": "Raye", "userReviewDate": "Sep 14, 2012", "userURL": "http://www.goodreads.com/user/show/5436095-raye", "userReview": "I don’t even know how long I’ve been wanting to read this book. All I know is that it’s been years and I can’t believe I have finally read it. After reading Pride and Prejudice and Zombies when it came out, and loving it. Then reading Romeo & Juliet & Vampires a couple years ago and not liking it, I wasn’t sure how I would feel about this one. I was hoping I would enjoy it, but I wasn’t going into with the expectations I had for it when I first found out about it and added it to my wish list.It was so good. I didn’t want to put it down. I lost track of time while reading it and stayed up until 2 AM. I can’t even remember the last time that happened. It was so funny and had great action. There were so many times I was laughing out loud. There were times when I just had to go read bits of it to my dad. I couldn’t wait to see how it would end, but at the same time, I didn’t want it to end.I thoroughly enjoyed this book and I can’t wait to read more by this author. I’ve had Henry VIII, Wolfman on my wish list for years as well. I might need to pick that one up soon.If you want a fast, funny read, with strong female characters and you enjoyed books like Pride and Prejudice and Zombies, you should check this one out."}, {"userName": "Bettie☯", "userReviewDate": "Oct 19, 2009", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "[Bettie's Books (hide spoiler)]"}, {"userName": "Seán", "userReviewDate": "Apr 16, 2010", "userURL": "http://www.goodreads.com/user/show/291243-se-n", "userReview": "Although I was excited (actually I was inordinately excited) to have finally won a First Reads giveaway, I admit I opened QVDH with more than a little reluctance. First of all, rush-to-market publishing trends such as 2009's zombie remix bonanza should usually be avoided by tenderhearted readers who are easily disappointed by passing literary fashion. Secondly, as a stalwart political progressive of Hibernian extraction (big ups to all my Fenian ravers!), I loathe monarchism generally as a primitive form of government, and I particularly despise Old Blighty's Hanoverian crime family (187 on George III). So you could bet that a comic novel about a young Queen Victoria released at the height of a publishing craze would be just about the last thing on my Amazon wishlist.Yet, therein lies the genius of GoodReads, my droogies! For I have to say, Holmes/Moorat delivers a fast-paced and fun read, probably setting the benchmark for this swiftly evolving microgenre. It took me about a quarter of the book to get acclimated, and some elements were less thoughtfully developed than others, but overall QVDH will serve you well as a literary snack. It'll enhance your interminable morning ride on the subway, thrice re-scheduled appointment at the doctor's office, or whilst waiting on line with the early evening hours of a Friday peeling away.HE SPEAKS FROM EXPERIENCE! Yes, I just finished the thing while waiting on line at a UPS pick-up center in the warehouse-n-bramble wilds of Maspeth, Queens, a place situated among full-capacity cemeteries, modular \"buildings,\" and the toxic turbidity of Newtown Creek. There I was for over an hour and as long as I had my book, there was no need to tap my feet or sigh impotently within earshot of glassy-eyed brownshirts.----0000----Pluses: Quimby the well-drawn roué could have supported his own narrative. The dynamic between he him and his zombie manservant, Perkins, was like an absurdist and risqué version of Jeeves and Wooster, and easily the most consistently enjoyable part of the story. [Holy shit: Jeeves and Bertie Wolfman. Yes?] Several scenes were particularly well constructed, e.g., the bloodbath in the House of Commons and the bible society's tour of Bedlam.I also enjoyed the forces of conservatism and class oppression depicted as succubi and werewolves because see above, i.e., gay Irish ravers.Demerits: The confused symbolism of QVDH's demons was kind of annoying. As previously stated, one moment it's suggested the motivating ideology of Conroy and his Satanic sponsors is indistinguishable from that of the upper classes (a sort of metaphysical pop Marxist critique?). However, later it's shown that the demonic bloodline that flows through Victoria's veins is the very source of her abilities and exists as a hereditary gift that must be nobly maintained rather than abused (a vague endorsement of Burkean conservatism by an appeal to Baal's Peerage?).Additionally, the premonitions of WWI and some instances of anachronistic dialogue may be a mite bit infuriating, until you pause and cease to care.Also, GoodReads? Give me more books."}, {"userName": "Amanda", "userReviewDate": "Feb 01, 2011", "userURL": "http://www.goodreads.com/user/show/4739775-amanda", "userReview": "Writing was a bit dumbed down, but overall it was an entertaining read. Although a work of fiction, the historical facts were accurate and the fiction was amusing. Blood and guts, with occasional bawdy humor and a pinch of history made for a pretty good book. It was a nice change from the other Quirk Fiction I've read that were actually based upon existing literature. It was refreshing to have no frame of reference except what I already knew about the Queen, those surrounding her, and the time period in which is took place."}, {"userName": "Jo", "userReviewDate": "Nov 22, 2009", "userURL": "http://www.goodreads.com/user/show/1740824-jo", "userReview": "So this isn't going to win any prizes for literature but it's bloody good fun. The title's a bit of a misnomer though as Queen Victoria doesn't actually become a demon hunter until late on in the book when her beloved Albert is kidnapped by werewolves. So you have zombies and demons and an arse kicking monarch and it makes you so proud to be British. Rule bloody Britannia!!"}, {"userName": "Hannah Polley", "userReviewDate": "Jul 19, 2017", "userURL": "http://www.goodreads.com/user/show/33809991-hannah-polley", "userReview": "This has to be one of the most ridiculous books I have ever read. My sister gave me this book and I barely glanced at the cover and I assumed it was a historical fiction book as she is a big fan of that genre. However, when I came round to reading it, I saw from the front cover it was a zombie story and inside found it had all manner of demons and things from the underworld. The story revolved mostly around Queen Victoria with zombies, werewolves, succubus', etc. thrown in. Both Victoria and Albert are half demons in the book but both have turned away from their demonic sides (although there is no explanation as to why Albert has done this as at one point he is in with the demons). I normally love zombie stuff and can take a lot of gore but I'm not sure if it was the book or the mood I was in but some of the descriptions of the zombies eating people made me feel a bit queasy. I would recommend if you like absolutely ridiculous storylines where very little is explained. Somehow I ended up rooting for Quimby and Perkins as I thought they were the best characters of the book!"}, {"userName": "Redfox5", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/3816075-redfox5", "userReview": "A fun romp(I really wanted to use this word) through Victorian England. Upon becoming Queen, Victoria discovers that some of her staff have the task of hunting demons. It surprises her even more , when she discovers she has a talent for it herself.  I liked this book but not as much as 'Henry VIII:Wolfman'. It made me smile alot but I expected there to be more demon hunting than their actually was. Also liked the twist at the end about Victoria and Albert's true ancestry. Although I'm sure some conspiracy theorists would argue that this is not fiction at all.  This book is certainly not for the people who pick up historical fiction books and then moan the author is not accurate. But if you have a sense of humor, you'll find something to like here."}, {"userName": "Chelsea", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/101415-chelsea", "userReview": "Unlike many people who sneer at the recent string of zombie mash-up novels, I actually quite enjoy them. Queen Victoria: Demon Hunter is a fun, bloody, pulpy ride through history that will be extremely enjoyable to anyone willing to accept the book as just that. However, compared to other similar books I've read, Queen Victoria disappoints slightly. The writing from A. E. Moorat is surprisingly rich, although the book is littered with typos, which makes me think this is a book that was rushed out by the publishers to cash in on the current zombie trend. Still, it's pretty clear Moorat is a capable author, and the way he has structured the novel is quite effective. However, the title of the novel is incredibly misleading. Unlike Abraham Lincoln: Vampire Hunter, another novel which sets a prominent historical figure against the undead, Queen Victoria doesn't play much of an active role in her own story. To be sure, Victoria is an interesting character, and she's quite a badass once she starts hunting demons, but she really isn't involved until halfway through the book, and only after the minions of hell have affected her personally. Sadly, Victoria is actually the least interesting character. Moorat has constructed a wonderful collection of original characters that fairly jump off the page. I was much more interested in the zombie creator, Lord Quimby, and the Royal Protektor, Maggie Brown, than I was in any of the royal family. This seems to be a pattern of all but the best zombie mash-ups. The balance between history and fiction is never quite achieved here. I got the sense that this would be a much stronger original novel without any historical references. Of course, it's unlikely that publishers would be interested in such a book, and an original novel would have to tighten its mythology. (The demons and zombies are a weird mish-mash in QV:DH that's never fully explained, but that's probably for the best.) All in all, though, I really enjoyed this book and would recommend it to fans of this tongue-in-cheek genre. It's not the best out there, but it's got such wonderful characters that I'd be willing to read a sequel about just their stories. Don't be tricked into thinking this is a book about Victoria, though, because honestly, it isn't. Whether that's a weakness or a strength depends on the reader."}, {"userName": "Stephen Theaker", "userReviewDate": "Oct 05, 2009", "userURL": "http://www.goodreads.com/user/show/937823-stephen-theaker", "userReview": "King William IV is dead, and Princess Victoria takes the throne aged eighteen. England and its new queen are under threat from the forces of darkness (among them the King of Belgium); luckily the new Queen has supernaturally quick reflexes and is handy with a range of weapons... Essentially this is Queen Victoria as Buffy the Vampire Slayer, dealing with monsters, boys, evil plots and a hard-ass mentor.The cover of this book is fantastic, but not to be trusted. For one thing, we only see young Vicki in this book, not the older lady of the cover. Then there's the magnificent tag line: \"She loved her country. She hated zombies.\" But it's over three hundred pages into the book before she meets one, and even then she only spends about seven pages fighting them in total, being mostly occupied by werewolves. Clearly the zombie angle has been (smartly) played up for commercial reasons.This is lightly plotted Kim-Newman-lite fun. Very little of the plot is resolved by the end, and there's often a sense of characters being moved around the board like chess pieces, but those characters are written with wit, in particular Lord Quimby and his dead manservant Perkins. Though you don't have to read it to get its best joke, there are others, such as the monster hunters called Hicks, Vasquez and Hudson. Don't be too disappointed if this turns up in your Christmas stocking."}, {"userName": "Fiction State Of Mind", "userReviewDate": "Feb 04, 2010", "userURL": "http://www.goodreads.com/user/show/1583976-fiction-state-of-mind", "userReview": "\"London,1838 Queen Victoria is crowned; She receives the orb, the scepter, and an arsenal of bloodstained weaponry\"I love zombies. I also love British History and historical fiction, so I was SUPER excited to see these two loves together. The opening scenes of this novel son't dissapoint.On the eve of her coronation Victoria learns a secret that has been kept form her and most of Englands citizens: Demons! They are plotting against her throne and the human race in general. The zombies that are introduced come from a suprising source. Still reeling with the new threat to her kingdom Victoria also has to contend with matters of the heart as she is reintroduced to Prince Albert of Saxe-Coburg. THe action scenes in this book are thrilling. Zombie violence, Demon attacks, werewolves! I found these scenes so thrilling I didn't want them to end. I also enjoyed the scenes with Victoria and Albert. A.E. Moorat's writing syle lends it self well to both Horror and Historical Fiction. I would have liked a little more Horror but enjoyed the book anyway. This book is definetly for some one who enjoys period pieces as well as Horror. Neither of the genres overpower but blend well. I was left with a definite interest in Queen Victoria's life and will definetely search out a biography about her in the future."}, {"userName": "Jay", "userReviewDate": "Jun 01, 2010", "userURL": "http://www.goodreads.com/user/show/2419499-jay", "userReview": "The most annoying thing about this book is how painstakingly average it is. I kept waiting for it to improve or get worse. Instead, it just hovered around average for the entire length. That's why it took so long for me to read- I couldn't get into it and devour it in two days, but I couldn't just quickly skim through it to finish it. I just plodded along, reading a few chapters a day until I was done. Nothing happened, and then a little bit more of nothing happened.I can't help but feel that Moorat is jumping on the Quirk Classics bandwagon. This book would have been a lot better if it had been about some noble lady, possibly named Victoria, who needs to fight the evil Conroy to save her father's land from the hands of savages. Or something. It just happened to be about Queen Victoria, and oh, there's a few zombies.I did like Quimby and Perkins, though, and throughout the entire novel I couldn't help but feel there was something homoerotic going on there. Gosh darn it, there should have been more homoeroticism."}, {"userName": "Ape", "userReviewDate": "Nov 23, 2011", "userURL": "http://www.goodreads.com/user/show/3091902-ape", "userReview": "This was great fun - obviously not to be taken too seriously, but it was a fun horror/comedy; an alternative look at British history. Perhaps not for the feint-hearted as there is quite a lot of blood and guts in the book, but at the same time it's certainly not the most graphic book, descriptive-wise, I've ever read either. But for light, gory entertainment it's a good read and the plot rolls along at a good pace. For this kind of history/literature meets trashy horror that's popular at the moment, it's quite good. I think I preferred it to the Pride and Prejudice and Zombies, simply because this one didn't drag and the whole plot flowed better.The cover on this book is slightly misleading perhaps - this is set during Victoria's younger days, just a spring chicken, courting and then marrying Albert, and getting into a bit of demon fighting. Lots of fighting ladies in this as well. Nice for the girls to get a go."}, {"userName": "Phogbound", "userReviewDate": "Mar 23, 2010", "userURL": "http://www.goodreads.com/user/show/1122512-phogbound", "userReview": "Would you enjoy the Victorian era if you knew that Vickie was actually a demon hunter in the evenings? Would the Baal (demonic adversaries of humanity) overthrow the British throne and foment bloody revolution? Would you like an alternate perspective of known historical facts that actually works quite well? Then, the game is afoot at your local bookseller in trade paperback!Caveat: It took me a while to settle in to his style but the extra effort was worth it - if only for a hapless peer and his zombie manservant. Priceless humor!"}, {"userName": "Kathryn Bergeron", "userReviewDate": "Mar 01, 2010", "userURL": "http://www.goodreads.com/user/show/2170356-kathryn-bergeron", "userReview": "Summary: Queen Victoria, the demure regent, learns quickly after her ascention the dangers of her position....especially to the supernatural. With a little help form her protecktor (yes, with a k), she battles demons, zombies, and much more to save her kingdom and her husband.Review: This was an excellent book, if you like intermittent humor (slightly debaucherous) and the arbitrary mixing of history with zombies, then you'll love it too."}, {"userName": "Amanda", "userReviewDate": "Oct 17, 2009", "userURL": "http://www.goodreads.com/user/show/2650694-amanda", "userReview": "Picked this up at the airport and couldn't put it down! An excellent mix of History, horror fiction, comedy and gore."}, {"userName": "Aaron", "userReviewDate": "Apr 06, 2010", "userURL": "http://www.goodreads.com/user/show/1196851-aaron", "userReview": "Queen Victoria has a new role in this novel. Not only is she to lead her nation, but she will also be matching wits with demons, werewolves, and zombies in the hopes of preventing the world from falling into despair.As the novel opens, Victoria's father is on his deathbed. A demon assassin drops into visit her just as she is getting word that she will be the new leader of the British Empire. Fortunately for her, she is also visited by Maggie Brown a talented demon hunter who has been appointed as the royal Protektor. It quickly becomes clear to Victoria that the royal has an innate talent for swordplay and battle. It is something that will serve the Queen well.Victoria is fortunate in that the dark forces seem to take a back seat as she settles into the throne and its responsibilities. She also has a chance to grow closer to Prince Albert. The two wed and start a family before England seems to be overrun with monsters.In the interim, Victoria has been learning more about the evil forces that few average citizens know about. This includes getting to know Maggie and the rest of the Protektorate, a group of demon hunters that have been pulled together to guard the British royal family, in the hopes of better defending herself and her people from harm.Unfortunately, those working for Ba'al an ancient god who rules the demon force, have someone working on the inside in the form of the secretary of Victoria's mother. He has been working for years to try and gain sway on the British throne, allowing him to use that power to convince the forces of Ba'al to offer him immortality.Another lord seems to have come across the ability to control zombies, allowing him to slowly build an army in the hopes of building his own source of influence. He is accompanied by a very humorous butler, who became a zombie himself during their initial meeting with the human-hungry creatures.As the novel progresses, the various subplots weave together and build toward an action-packed conclusion that would be great for the big screen. The author has also done a nice job of blending historical fact with the black arts and no shortage of dark humor to create a fun and interesting tale that seems to capture the feel of the Victorian Era.I would offer just one warning. Moorat does not shy away from the graphic nature of the violent actions that often surround zombies, demons, and werewolves so be prepared to be grossed out. Either way, this a great read for fans of recent Victorian-themed horror such as Pride and Prejudice and Zombies, Abraham Lincoln: Vampire Hunter, and The Adventures of Huckleberry Finn and Zombie Jim."}, {"userName": "Jenni", "userReviewDate": "Dec 12, 2010", "userURL": "http://www.goodreads.com/user/show/4052722-jenni", "userReview": "This story follows Victoria as she becomes Queen of England, and realises there is more to life than she'd thought. On the night her uncle dies and the throne becomes hers Victoria meets her first demon, and Maggie Brown one of the team of Protektors charged with keeping her safe from them. There is far more that she will have to learn than she'd ever imagined, and all whilst she pursues Albert of Saxe-Coburg and Gothe. At the same time in London Lord Quimby holds a party that ends up with a bloodbath and his loyal manservant Perkins being turned into a zombie. Whilst trying to foil a blackmail attempt they start to formulate a plot that will allow them to use their new zombie making skills.I was fairly dubious before I started reading the book - I'd avoided all of the monster twists on classics but as this was original fiction based on facts I thought it might be okay. I'm no historian so I wasn't too worried about glaring historical inaccuracies - it's worth a mention that there are deliberate anachronisms that may bother readers with an interest in history. It's really hard to try and describe this book and I think one of the main reasons for this is that there are two main plotlines working throughout the book. Whilst they're both just about working toward the same end point they don't feel very connected. Victoria's plotline does at times feel very thin. I liked the idea of a secret demon hunting team within the royal household and Victoria's involvement with them. I frequently found myself wishing that the author had carried on with her story rather than jumping back to the other main plot. The plot for Quimby and Perkins on the other hand was stronger, it did add a little more graphic detail at times for my tastes but I'm sure many readers will love this. The dark humour that accompanied their story worked really well, I found myself really enjoying it.I enjoyed some but not all of the characters, there were a number of characters that felt a little panto-like. I would have loved to see more of Victoria and Albert, and the Brown family. The bizarre Jeeves and Wooster style pairing of Quimby and Perkins were wonderful.I did, in general, enjoy this book though I think I would have enjoyed it far more if the two plotlines had been expanded and given their own books. I suspect that if this had happened the Victoria book would have been the book I had expected to pick up and the Quimby and Perkins book would have been a thoroughly enjoyable bonus."}, {"userName": "rabbitprincess", "userReviewDate": "Dec 25, 2009", "userURL": "http://www.goodreads.com/user/show/1093061-rabbitprincess", "userReview": "I probably enjoyed this as much as I did because I saw The Young Victoria in January. Certainly the first part of the novel reminded me a great deal of the movie, and it also helped me picture all the historical personages. And in terms of a storyline, I think I'm more favourably disposed toward historical fiction with zombies than simply rewriting famous works of literature to include the undead. Perhaps it's because with historical fiction you don't necessarily have to match the original author's voice -- it's all one author.As for the violence, there's plenty of that for you zombie aficionados. Moorat is definitely good with description; I had to stop reading this on the bus because I would keep clapping my hand over my mouth in horror reading about revenants feasting on still-warm entrails or rats burrowing into people's skulls and gouging the eyes out so that the eyes dangle out by the optic nerve. Very, very vivid.One aspect I did have a bit of a beef with was the plot element that King Leopold was a descendant of Baal and that he was trying to get Albert and Victoria to marry so that they would produce demon babies. But I kept saying to myself, \"Leopold is Victoria's uncle by blood, so wouldn't she be part demon as well?!\" I figured this out by page 100 and it bothered me until the characters actually had the situation revealed to them. But even if Victoria and Albert are half-demon, that doesn't necessarily mean that their kids would be full demon. They could have had non-demon children. Obviously I am thinking about this too much. But the demonic aspect of Victoria did explain her ruthlessness in battle. I thought it might be a subconscious expression of self-loathing, like she's destroying these external manifestations of a very nasty side of herself...although that might be a bit heavy for this kind of book.I also had difficulty picturing some of the non-historical characters, but that could just have been my brain being too traumatized from the violence to expend energy on picturing 100% fictional people. And I imagined either Burke or Hare to be somewhat like David Tennant, because he was originally supposed to be in a movie about them or something with Simon Pegg, but he had to pull out and Andy Serkis got the role instead. So I pictured him as Ten when he was alive, and then Andy Serkis when he was not. Not that I have anything against Andy Serkis, but I like Ten better.So if you like stories about zombies and books set in historical England, you might like this one. Just don't read it while you're eating."}, {"userName": "Brooke", "userReviewDate": "Feb 15, 2010", "userURL": "http://www.goodreads.com/user/show/2293281-brooke", "userReview": "Victoria had no clue that when her time came to be Queen she would also hold the title of Demon Hunter. These demons want the crown for themselves, that way they can rule over Britain how they see fit. Queen Victoria isn't concerned with the Demons, she's more infatuated with Prince Albert. He's handsome, smart, and everything she wants in a partner. Victoria must face a country full of demons, zombies, dark magic, and people she's known all her life actually being a part of the underworld. When danger attacks close to home, Victoria finds that she's mighty capable of wielding a weapon and that she's been under the protection of the assassin Maggie Brown without her knowledge. Victoria and her allies can only hope they can get the country back under control before it's too late.There are a few different points of view going on in this book, and I must say my favorite was Queen Victoria's. But there wasn't enough of her. The other storyline didn't grab me as much as her story, and every time I kept really getting into it I was pulled out and tossed into the other. This made me sad and made it hard to read this one. I enjoyed all of the characters though, and the historical aspect seemed to be pretty spot on. I may like history but I'm not history buff, so it seemed historically accurate to me! Well, besides the blood, guts, zombies, and demons.I would have liked to see more Demon Hunting by Victoria in the earlier parts of the book. The beginning mostly sets up her taking the throne, her marriage to Albert, and the birth of her children. We're also shown that something is not right with her mother's judgment of those she lets close to her is way off.Quimby is the main character in the other storyline happening in Queen Victoria: Demon Hunter. He's the funniest character in the book, and he really sets up the book in the beginning when he is holding a \"dinner\" party, and zombies begin to eat his prostitutes. His reaction and the way he handles the situation is hysterical. Him and his manservant Perkins make a great duo.This book took me a while to finish. Almost a month. It seemed like every time the point of view changed I put it down to only come back a couple days later. I think the writing was good, but I just wish there had been more Victoria and more Demon Hunting. Ya know, since she's a Demon Hunter and all? If you are really into historical books with some gore and paranormal tossed in there then hopefully you will enjoy this book too!The cover is pretty fantastic too right? Love it."}, {"userName": "Talulah Mankiller", "userReviewDate": "Apr 22, 2010", "userURL": "http://www.goodreads.com/user/show/3245656-talulah-mankiller", "userReview": "Can I just take a moment to say how sad I am that I got the Kindle edition and not the paperback? I mean, seriously. Check out that cover. IT IS DIVINE.Ahem.Okay, this book can only be described as a mad romp. The title is a little misleading–Victoria doesn’t do much demon-hunting for the first half of the book–but other than that, it’s all pretty self-explanatory. On the night of the old King’s death, numerous horrible things happen: a two-headed rat eats a man, my Lord Quimby’s zombies eat his whores, and a succubus tries to kill Princess Victoria. Victoria, it must be said, does not kick the succubus’ ass, but she does defend herself quite well until her bodyguard, one Maggie Brown (mother of John), gets there to protect her.After the excellent opening sequences, though, the rest of the book is mostly just a scramble to set Evil Incarnate on the British throne. I’ll be honest: it drags a bit. Almost all of the characters are funny, but if not for the occasional breaks for hilarity with Lord Quimby, this book would be just as faddish and forgettable as Pride and Prejudice and Zombies: The Classic Regency Romance – Now with Ultraviolent Zombie Mayhem!…thanks, Amazon, REALLY didn’t need the subtitle there. But whatever. Moving on. As I was saying, Quimby is what makes the book. If not for him, Queen Victoria would be a fairly funny, slightly tired story–but with him? Dear LORD, I about wet my pants laughing. Quimby is an amoral, incurable narcissist who does all manner of appalling things to get what he wants, and I loved every goddamn minute of his shenanigans. Here’s an excerpt: Quimby took a deep breath, ready to tell his manservant in no uncertain terms that if he did not neutralise the youthful threat–preferably by tearing at least one of them limb from bloody limb to teach the rest of them a lesson–then he had better start looking for employment elsewhere, speaking of which, did he know of any other members of the nobility likely to welcome the walking dead into their home? No. So plenty of luck finding suitable employment elsewhere. Now kill one of these children before I lose my bloody temper…An entire book full of Quimby would probably be too much, but having him as a side plot in a novel otherwise populated by sane people? WONDERFUL! I cursed Jha for recommending this because I totes bought it and I need to save money, but honestly? It was worth every penny. I REGRET NOTHING."}, {"userName": "Melissa", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/11425610-melissa", "userReview": "See my other reviews at Never Enough BooksQueen Victoria has long been held as one of the most beloved of British monarchs. After taking the throne at the tender age of 18, the young queen soon finds she has her hands full with matters of state as well as matters of the heart. When she learns of the violent and long fought war between humans and demons; her responsibility towards the Empire takes a darker turn.Victoria finds assistance in her royal advisers as well as a small group of royal bodyguards called the Protektorate. With their help she will fight monsters of all kinds and protect not only her beloved England but her beloved Albert.Judging by the reviews on Goodreads and Amazon, those who read Queen Victoria: Demon Hunter seem to fall in to two camps; those who enjoyed the book and those who didn't. Personally, I fall in to the first group - I greatly enjoyed this book.Queen Victoria: Demon Hunter takes place in an alternate reality. In this world, demons are real and they have been at war with the human race since the beginning of time. These demons seek to rule the world by any means necessary and the humans who are aware of these demons seek to stop them.Beyond that, the story stays fairly true to how history played out. Victoria did indeed take the throne at 18 and shortly thereafter met and married Prince Albert. They had several children and were very much in love. These are facts and while Moorat might have fudged a few details for sake of the story, many of the events played out just as history described them.Moorat did an excellent job with all of the characters in Queen Victoria, both real and fictional. Taking well known historical persons and giving them a unique twist is no mean feat and I believe Moorat did this very well. The characters are not perfect, they each have their own foibles and drawbacks. They each have their own reasoning for doing what they do and behaving why they behave.As this is a tale about demon hunting, blood and gore is involved. Some readers might find the action scenes a bit off putting. Those who are especially squeamish might find certain passages difficult.For a book that was released at the height of the zombie craze, Queen Victoria: Demon Hunter is a good addition to the genre. Those who enjoy alternate reality type tales will likely enjoy this book. Moorat does a great job and I'll be looking for his other books in the near future."}, {"userName": "BookMarc", "userReviewDate": "Mar 28, 2010", "userURL": "http://www.goodreads.com/user/show/2769331-bookmarc", "userReview": "Have you ever watched Rachel Ray or maybe one of those cooking segments that loiter morning talk shows? You know how if you try the recipe yourself it never comes out the way it appeared on television? Well, 'Queen Victoria: Demon Hunter' is the literary equivalent of that recipe you made at home...it has the right ingredients, it's been prepared correctly but somehow it just hasn't come out like you wanted it to.The book starts out with a bang, major fireworks actually, with all the depravity that a fan of this genre could want. There's zombies and rats (one of which is huge has two heads), a prostitute renowned for being able to shove a pineapple up her vajayjay, decapitations and so much more. Then the story charters calmer waters for a while, in what is a pattern for this book, before waves of action come crashing against the shore again. In fact the pacing of the story is fairly decent and not where the problem lays.I don't recall off hand in which of his books Stephen King wrote, \"...it's not the tale but he who tells it...\" but I think that's where the problem does lay in this novel. The story itself is good but the telling of the story is not as captivating as it could be. Also, the way the whole book is written struck me as odd. For example here's a few lines from page 87,\"...until something happened. Something she would mull over later. The speed. How it was pure instinct. Because as the ageing...\"You see how paragraphs start as if they should be part of the previous sentence or at least a direct follow on? I've never experienced that before, or at the very least I've never noticed that before in a novel, but it's deliberately written that way throughout the book. The author is also attempting to add to the Englishness of the novel by spelling words such as 'ageing' the English way. At least the variant spelling I can handle just fine, then again I lived in England for 26 years so that certainly shouldn't be a problem for me, but the layout and structuring of the sentences really annoyed me.Overall, I have a feeling that a lot of people will like this novel and will not be concerned or distracted by the nuances which left a foul taste on my selective palette. However, the storyline for me was still interesting and the characters were fun and had distinctive personalities and so it was a decent enough read."}, {"userName": "Bjorn", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/19667916-bjorn", "userReview": "Victoria's life isn't simple. Not only did she just turn 18, and is trying to get out from the control of her mother and her mother's advisor, but she has to win the heart of that cute prince Albert from next-door (well, Germany) - and in the middle of this, she just became queen and ruler of the entire British empire. Oh, and King Leopold of Belgium is a demon lord who's heading a conspiracy of demon half-breeds, werewolves, zombies and succubi trying to take over all of Europe, and it's up to Victoria to fight them.It is, of course, not a coincidence that this comes out so soon after the success of Pride And Prejudice And Zombies. Very soon afterwards. So soon afterwards that the publisher hasn't even had time to proof-read it. In fact, if it had as many successful jokes as it had mistakes, it would be... still an obvious attempt at cashing in on a trend, but at least a reasonably funny one. The idea of Queen Victoria as a vampire sla... sorry, demon hunter is potentially funny. And of course, P&P&Z worked pretty well.As it is, though, they apparently didn't have time to put the jokes in. Yes, the entire premise is silly but has potential for some plain historical comedy - sort of a biography of the early days of Victoria written on crack. But it's not funny. In 375 pages, Moorat manages to make me smile exactly twice: when it turns out the queen's bodyguards are called Hudson, Hicks and Vasquez, and when Lucio Fulci makes a cameo as a member of the House of Lords. That's about as fun as it gets: some characters have names that remind you of other (better) works. The rest is just a plot nicked wholesale from season 1 of Buffy except without the snappy dialogue or well-rounded characters, with absolutely no suspense, and written in a prose that tries hard to sound Victorian and just ends up sounding like... well, bad Victorian prose with added profanity for no particular reason."}, {"userName": "Gabrielle Friesen", "userReviewDate": "Mar 13, 2013", "userURL": "http://www.goodreads.com/user/show/18086721-gabrielle-friesen", "userReview": "The book fails because it is unable to mix the two genres of historical fiction and zombie/horror fiction well. It spends too long setting up a historical background and historical credibility, that is, of course, not real, and too little time on its own hook. Large portions of the book go by with demons being mentioned frequently, but they then fail to show up for pages and pages of text. If I wanted to read about how into Prince Albert Queen Victoria was, I could just read Queen Victoria’s journals, which incidentally, were just recently made available online, and were already widely available. No one picking up Demon Hunter is going to be reading it for the historical facts its provides, anyone who reads it will either already know those facts, or just be in it for the zombies. Moorat spends far too much time caught up in trying to paint a historical picture of Victorian England, which is ultimately incorrect since zombies were thrown in (albeit rarely), meaning that there is no pay-off for a reader interested in the history, and no pay-off for the reader interested in zombies. While setting the scene is important, it could easily have been done in a few pages, at the most a chapter, but Moorat needs an obscene amount much page-space to do it. However, when Moorat does get to the zombies, they are more often than not a delight, in the way that zombies and eviscerations can be a delight. The book jumps between Queen Victoria’s exploits, and the exploits of Lord Quimby and his manservant Perkins. The sequences with Quimby are the most enjoyable parts of the book, full of dark humor and the shambling dead. There are essentially two stories present: Quimby and his zombie misadventures, and Victoria as demon hunter in-training. Had Moorat just written about Quimby, he would have produced a solid, and likely highly enjoyable straight-up zombie book. As is, the book is a jumbled, disappointing, and boring slog through the Victorian Age."}, {"userName": "Dagmar1927", "userReviewDate": "Mar 03, 2011", "userURL": "http://www.goodreads.com/user/show/5069470-dagmar1927", "userReview": "I absolutely loved this book. While generally steering away from historical fiction (as historical inaccuracies usually make me reach for a cricket bat and a mace) I couldn't resist buying this as soon as it came out and it was certainly worth it.From the very first page I was laughing - particularly about the pineapple. Oh dear, I had to have a bit of a lie down. Usually I'm one of those irritating people who latch on to one character and disregard the rest to the point of skimming over them, but there wasn't one undeveloped or badly portrayed character in here. I've never read anything remotely horror-like before and so the gore was a little off-putting at first, but after the first few slivers of brain, I was used to it and read on with growing amusement. I sincerely hope A.E. Moorat writes a sequel, as I will be there at the head of the queue waiting to buy it. This was one of those delightful stories that are so historically inaccurate in some ways that I stop being angry and absolutely adore them. Like 'Anastasia' for example. I would recommend this book to anyone with even the remotest shred of humour in their souls and an vague interest in the era."}, {"userName": "Yael", "userReviewDate": "Feb 24, 2010", "userURL": "http://www.goodreads.com/user/show/1714801-yael", "userReview": "There were many staff at Kensington Palace, fulfilling many roles; a man who was employed to catch rats, another whose job it was to sweep the chimneys. That there was someone expected to hunt demons did not shock the new Queen; that it was to be her was something of a surprise. -- Queen Victoria: Demon HunterIn London, in 1883, Queen Victoria is crowned. She receives the orb, the scepter -- and an arsenal of bloodstained weaponry. Britain is about to become the greatest power of the age. But there's the small matter of the undead to take care of, first. Demons menace the crown, and those who lust for power have loosed ravenous hordes of zombies within the aristocracy.But in Queen Victoria's great heart, the need to battle the menace of the infernal hordes takes a dim second place to Prince Albert, her great love. Can the young Queen dedicate her life to saving her country from Hell's fury when her heart lies elsewhere?This magnificent portrait of those troubled times presents a new understanding of a most remarkable woman, a legendary monarch -- and, quite possibly, the greatest demon-hunter the world has ever known."}, {"userName": "Julia", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/1303301-julia", "userReview": "I found this improbable novel about the young Queen Victoria being—among other things – a bang up zombie slayer thoroughly delightful. There’s also a succubus, werewolves and followers and relations of Baal to kill. John and Maggie Brown are the leaders of the Protektorate, and as it turns out Queen Victoria also has a talent for it.”’The King is dead, your Majesty,’ came the voice from the deep and dark shadows. ‘Long live the Queen.’ The King is dead? There was another crack of lightning, this one more prolonged than the last and once again the woman was illuminated. ‘Come your Majesty,’ she hissed. ‘Come to me.’ The woman glided towards her; one clawed hand reached out. And Victoria knew what to do. (Later she would have time to ask herself: how? How did she know what to do? Was it intuition or conditioning?”)"}], "description": "This novel takes you to the smoggy, cobbled streets of Queen Victoria's vile & villainous Britain. A layer of horror will be seamlessly woven in to comedic effect: you'll meet a group of demonic, feral chimney sweeps, who first appear to victims as angelic, Christmas-card versions of urchins, before turning into agents of death.", "title": "Queen Victoria: Demon Hunter", "url": "https://www.goodreads.com/book/show/6676743-queen-victoria", "average": 3.54, "cover": "https://images.gr-assets.com/books/1347304840l/6676743.jpg", "reviews": 247, "authors": [{"url": "https://www.goodreads.com/author/show/3127624.A_E_Moorat", "name": "A.E. Moorat"}, {"url": "https://www.goodreads.com/author/show/21485.Andrew_Holmes", "name": "Andrew   Holmes"}], "type": ["Horror", "Fantasy", "Historical", "Fiction", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/6676743-queen-victoria", "http://www.goodreads.com/book/show/6676742-queen-victoria", "http://www.goodreads.com/book/show/7553001-queen-victoria", "http://www.goodreads.com/book/show/7014395-henry-viii", "http://www.goodreads.com/book/show/8764927-untitled-moorat-mashup-novel", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}