{"ratings": 12151, "userreviews": [{"userName": "Lily King", "userReviewDate": "Dec 24, 2007", "userURL": "http://www.goodreads.com/user/show/711206-lily-king", "userReview": "This read like an exceedingly bland public service announcement. At some point in time Rainbow Boys would have been groundbreaking in its positive portrayal of gay teenagers, but by 2003 the characters and scenarios are -- at least within queer pop culture -- common at best. A progressive illustration doesn't quite cut it as an excuse for banality."}, {"userName": "Thomas", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/2018505-thomas", "userReview": "Rainbow Boys, a story about three gay teens, was published in 2001. In 2001, not a single state legally recognized gay marriage, and Don't Ask Don't Tell was still accounted as perfectly acceptable. Queer as Folk, my favorite television series about a group of gay friends in Pittsburgh, was just in the middle of its first season.Allow me to remind everyone that every opinion, review, or comment contains bias: whether that bias be influenced by personal experience, inherent beliefs, or time. If I had been 16 (as opposed to six) in 2001, I probably would've appreciated this book based solely on its existence. On the second page one of our protagonists cannot imagine \"that someone could be gay and laugh about it\" - it's thanks to this book and myriad other works of art that that has changed.However, now that it's 2013 and there are several splendid GLBT YA books available (Aristole and Dante Discover the Secrets of the Universe, What They Always Tell Us, Suicide Notes, The Miseducation of Cameron Post, etc.) Rainbow Boys doesn't stand out when compared to the rest of the pack. The characters felt extraordinarily ordinary, which I don't mind, but they didn't pop out of the pages like other YA protagonists - gay or straight. The third person perspective may have distanced us even more from Jason, Kyle, and Nelson. Alex Sanchez's writing had only a surface level quality to it and I couldn't connect to any of the characters or the plot events beyond a mere \"aw, I wish that didn't happen to X character\" or \"aw, Y character and Z character are pretty cute together.\" Some of the slang was outdated such as \"putting the make\" on someone and \"crank calls.\" And one strange incident occurred: one of the main characters slept all night with his contacts in but felt perfectly fine the next morning. Trust me, you do not want to sleep with your contacts in. Your eyes will feel like they're on fire the next morning.Overall, it is with great remorse that I give this book a shoddy summary of my opinions as opposed to a legitimate review. I really do love Alex Sanchez though and I think he's one of the best YA GLBT writers out there; his book Bait, published in 2009, shows that his writing has grown in depth and precision over the years."}, {"userName": "Lauren Stoolfire", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/6857324-lauren-stoolfire", "userReview": "Jason, Kyle, and Nelson are all coming into themselves and coming out of the closest. All three high school students are incredibly different from one another, but all three find themselves struggling with their own identities, relationships, love, and intolerance. Honestly, I have no idea why I haven't read this already because it's an absolute must read. When this book came out I would have just been going into high school, and I think this novel would be brilliant and do the most good in the hands of those students regardless of the novel's age now. Even though it's definitely dated in some regards and there has been some progress today, it still manages to feel very timely with what Jason, Kyle, and Nelson go through and would still make a wonderful resource for teens. I am planning on continuing this series and seeing where our core cast is taken. I have to admit, I'd want to know how these guys are doing now. If you haven't read this novel yet, what are you waiting for? By the way, that is Matt Bomer on the cover!"}, {"userName": "Deeze", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/5180617-deeze", "userReview": "I loved being introduced to these 3 boys. So different yet they each have a connection. Watching their story unfold left me wanting more. ETA  Second time reading and still as good as the first. I love how we get a look at all three boys and their differences, while seeing them all at the same time. Its hard to pick a favorite as they all have good and bad points. But I think despite how whinny he can be, Nelson is the one I feel most attuned too. Not the flamboyant sassy Nelson, but the insecure lonely Nelson. What really makes a change in this book was there was no evil mother, instead we have two dead beat dads lol."}, {"userName": "Steven", "userReviewDate": "Mar 12, 2007", "userURL": "http://www.goodreads.com/user/show/23724-steven", "userReview": "This is a great book, a wonderful resource for teens who are gay, questioning or are simply interested in the perspectives of gay teens and how they can be supportive of their gay peers.I was recently warned that I may be in danger of hell-fire for promoting books such as these because students may \"turn gay\" after reading this material. This is ridiculous. A student does not \"turn gay\" simply by reading a book. There are many factors that contribute to an individual's sexual orientation. There is also an increasing amount of evidence that one of the contributing factors shaping sexual preference is genetic in nature. I read something that was very disturbing to me the other day. A high ranking fundamentalist was posed the question of what he thought should be done when the gay gene is finally isolated. His solution was to actually tinker with people's DNA to eradicate the problem. This is very disturbing to me.Whether you agree with these lifestyles or not, the truth is that teens (and parents) need resources and support. Teens need to know about things like \"coming out\" and the risks involved in unprotected sex. Teens need answers, but most importantly, they need to know that they are not alone."}, {"userName": "Law Rence", "userReviewDate": "Dec 14, 2012", "userURL": "http://www.goodreads.com/user/show/12198601-law-rence", "userReview": "Finished this book in a day! Yes, a day. It was an easy heart-warming read. Alex Sanchez really did an amazing job to entertain and to lecture at the same. This is one of my  life changing books  cause it really made me realize the facts I am facing today.Well enough of my problems. Though there might me a lot of parts where it just kept changing from one scene to another it really is a must read for every one!"}, {"userName": "Laura", "userReviewDate": "May 02, 2017", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "[“The light turned on. There stood Jason, his lean, muscled body naked in front of Kyle. In that moment Kyle thought contact lenses were the greatest invention ever created.” Haha….”Naked Jason Land!” :D (hide spoiler)]"}, {"userName": "Matthew", "userReviewDate": "Oct 24, 2014", "userURL": "http://www.goodreads.com/user/show/9978483-matthew", "userReview": "Can I just say that how awesome it is to have Matt Bomer on the cover before he was famous? It goes to show you how people are oblivious to the past because if I knew beforehand that he was on the cover of this book, I would have known and suspected that he is gay.I ABSOLUTELY LOVE AND TREASURE THIS BOOK! HIGHLY RECOMMEND IT FOR TEENS AND ADULTS WHO WANT TO REMEMBER THEIR YOUTH & INNOCENCEMany years ago when I was in middle school, I was beginning to discover who I am and who I liked. I fought against being bullied around in school but I did not let those who caused me harm, to define who I am and that I had romantic feelings toward men. It was a scary feeling having these abnormal thoughts and feelings when the majority of the students around me were all heterosexual. Since I felt very single out, and in order to feel not left out, I went through a discovery phase in which I watched anything with gay content whether it be a television show or foreign soap opera, singers who supported gay people, famous gay icons, HIV/AIDS, and countless other things that made me well knowledge towards my new cultural identity. I discovered this book online and remembering reading the first chapter and relating extremely to Jason Carrillo. No one in my family knew who I am (Currently they still don't except for my sister) and I felt like having this secret was like being a spy among my family and friends. Now that it has been about 7-8 years now since I discover my true identity and this brought back wonderful feelings of my upbringing and couldn't believe how much I could relate to these characters. I thought I was going to read a few chapters the first night but I read the entire book in one night. I kept finding myself enchanted by the writing and beautiful storytelling and realizing that this book is a great book for those who are still in the process of accepting themselves or want a simple book about accepting who you are, romance and friendship.In the very beginning of this story, if I had to pick a character that could relate to me, no doubt it would be Nelson. When I was growing up, people sense I was very mature for my age and I believe part of it is because since I realize I was gay at an early age, I already went through the steps that countless teenagers are going through in high school and college. Nelson is more in touch with the gay culture, and not to mention is in love with his best friend of two years. I've never been in a relationship with a man yet and I have my fair share of heart breaks from friends and people I have encountered over the years. What made me relate to him more was the concept that Kyle could not reciprocate his feelings for Nelson and he got extremely mad and I felt those same emotions in the past. Its Nelson's fault that he never made any moves or indication that he was interested in Kyle and the idea of letting go is harder than one can imagine. We get caught up with this fantasy of who we want to be with and in reality there is a reason why things do not work out the way they do. At least Nelson meets a great guy in the end which in my life that was not the case. I related to Nelson in the beginning but felt like a complete stranger midway through because he does dangerous things could have gotten him killed or sick.I love Jason and Kyle. I love the dynamic between the two and love the innocent moments they shared as Jason was discovering who he truly is and I feel that many could relate to Jason because he was someone who had a great relationship with a girl and yet slowly he started get in touch with his identity, he realized that something is wrong and that being gay is not a choice.I believe the magical word for this book is innocence. These three characters are discovering who they are, who they love, and what it means to be intimate with another man. I really want to read the rest of the series and I hope it lives up to my expectations from this first book. I am really looking forward to these characters and I felt they have become a part of me. Thank you Alex Sanchez for finding characters I could relate."}, {"userName": "Jamie Fessenden", "userReviewDate": "May 15, 2011", "userURL": "http://www.goodreads.com/user/show/4692982-jamie-fessenden", "userReview": "Very entertaining and realistic account of what it's like to come out and experience your first romance. I have a minor complaint about the weird way in which the boys always omitted descriptions of sex. They would be talking naturally, and occasionally swearing, but whenever they tried to talk to each other about sexual experiences, they would say code words, such as \"Well, we didn't S or F.\" or just say, \"Did you...you know?\" That was very tiresome and clearly a cop out, though it's hard to say whether it was on the part of Sanchez or the publisher. I'm sure it reaches a broader audience this way, but it killed the realistic feel of the novel, and I can't imagine most young people not finding it silly.I also found it annoying that Sanchez portrayed every character in the story as being convinced that one unsafe encounter would necessarily lead to becoming HIV positive. I agree that the book should present this as a legitimate concern and emphasize that people should never have unprotected sex with strangers or people you don't trust to be honest about their sexual history. But all of the adults, including doctors, that the boys encountered seemed utterly convinced that the boy who had unsafe sex was now HIV positive. It was reminiscent of the way YA novels and movies tend to assert that a girl will always get pregnant, if she has sex without using protection. No talke about statistical probabilities -- just absolute causation. It was alarmist.Nevertheless, like everything I've read by Sanchez, this is an important book to have available to young people."}, {"userName": "Adam", "userReviewDate": "Jun 05, 2013", "userURL": "http://www.goodreads.com/user/show/2691043-adam", "userReview": "Have read an Alex Sanchez book before, and enjoyed his style with this piece as well.Cute story of three senior year boys coming of age and coming to terms with being gay in a largely bigoted high school. Told in turn by the perspective of each boy (properly highlighted at the start of each chapter and throughout at the bottom of each page)... Nelson Glassman, out and proud at home and school; Kyle Meeks, closeted to family and school at first but active in a Rainbow Youth Group; and Jason Carrillo, perhaps the most complex of issues, closeted with a girlfriend, Debra, at the beginning, but falls in love with Kyle by the ending and comes out to family of an abusive father, an enabling mother, and an endearingly innocent 6 y/o sister. Together with help from the Art teacher, Ms. MacTraugh, they petition to start a Gay/Straight Alliance group at their school. I'm feeling that the next book in the trilogy will expand on the outcome of this. I enjoy quick reads like these, and wish I had something like this to identify with when I was coming of age... Looking forward to the next two in the series"}, {"userName": "Roser", "userReviewDate": "Jul 14, 2015", "userURL": "http://www.goodreads.com/user/show/11245567-roser", "userReview": "This was such a lovely and fast read. Four stars. 7.5 or 8 out of 10. Found in the LGBTQ section of Foyles at a good price and I new I'd liked it. Three gay character all dealing differently with their coming out. It was interesting and felt very real. Maybe a bit old fashioned but still very good."}, {"userName": "- ̗̀  jess  ̖́-", "userReviewDate": "Oct 31, 2016", "userURL": "http://www.goodreads.com/user/show/7235660---jess--", "userReview": "This was one of those books that was on my to-read list years and years ago when I first discovered YA queer lit, but I never actually read it until I had to take a class on it. Go figure. That being said, I think I would have liked this a lot more when I was younger. 2011-2012 was when the narrative of \"miserable queer teenagers\" was ending and being replaced by stories where queer teens just happened to be queer, and in the past couple years I've grown to like the latter narrative more. But I recognize that we wouldn't have gotten to these stories - where gay teens are allowed to be gay, and happy, and face little homophobia in their lives - without stories like Rainbow Boys. And sometimes in this world, where I can talk about being queer, wishing I had a girlfriend, and happily post fanart and posts about queer ships on an Instagram account with 1700 followers and get no homophobic comments; where so many churches in my city hang up rainbow flags at its doors and not only tolerate but welcome members of the LGBTQ community; where the Queer Centre at my university inhabits a space covered with rainbow flags on the outside - I forget about how hard it used to be for kids and teens. I was in the GSA at my high school, but I forget how difficult it used to be to set up these, to go to these. So this book was a bit of a brutal kick, but I think one I needed to remember: how hard queer people before our generation fought for people who would come after them, and how hard some people are still fighting. Sanchez presents three different boys, but all of them are unique, but somewhat stereotypical. There's the soft flamboyant gay guy (Nelson), and then there's the closeted jock (Jason). Kyle wasn't quite as stereotypical. I think my favorite of them was Nelson, though, because he does not know when to shut up and is sarcastic and I love that. I liked how Nelson's mom was such a good and accepting mom, you'd think it would be one of the other two's parents that were like that. But it was good, because in a lot of earlier queer books no one had even one accepting parent. I think I connected to Kyle the most - I'm low-key, but I'm not really out to anyone (except on the Internet and I suppose people who like read my stuff on the internet OOPS HAHA). It kind of sucked that there weren't too many accepting kids who weren't gay at their high school, which would have been nice. I do think that Sanchez's writing style is a bit too telling, not showing, which made it kind of hard to read sometimes because telling doesn't immerse you as much, but it was pretty good altogether."}, {"userName": "Alex", "userReviewDate": "Jan 12, 2010", "userURL": "http://www.goodreads.com/user/show/888773-alex", "userReview": "I wasn't expecting to enjoy this novel. I was pleasantly surprised.The copy looks like something from the 1980s, and I'm not sure why. No one is wearing anything dated and the copyright date is 2001. I think it just reminds me of some of the girly books I saw that were from the '80s. Or maybe it's the front right guy's hair. Anyways, the cover in combination with the descrip made me think it was going to be cliche.I picked it up anyway, because it was one of the few queer lit books at my local library (way to go rural PA). As I say, I was pleasantly surprised. While there is a certain amount of cliche in the character types, there was also an endearing quality about them that made this cliche acceptable, as if they were made to be cliche just for that reason. The chapters flit back and forth among the three characters, sometimes showing the same events from another perspective (although not enough to make it seem boring, normally just a few lines). This keeps you from getting bored with the \"between time\" of one character and helps the book keep a nice quick pace. I read it in one day, in under 6 hours, probably less. I think one thing that surprised me about the book was that it actually touched on serious topics (like AIDS, sex without condoms, and all the complications therein). Needless to say, I'm picking up the sequel."}, {"userName": "Holyfool", "userReviewDate": "May 15, 2012", "userURL": "http://www.goodreads.com/user/show/2503705-holyfool", "userReview": "picked up the book because of the photographer who did the cover and ended up reading it. i don't regret it but i don't recommend it either. mr. sanchez's first novel ( written 12 years ago ) treated the subject like an abc family after school special to be watched by junior high schoolers in the 1980's.  times have changed so much that the book can not sustain the reality of the facts and the mental level of nowadays teens' issues. mr.sanchez really generalized, stereotyped and [ i am sure ] fantasized his writing through this book so much that his prose just collapsed. his book was so expected and contrived that it left me empty thinking.maybe mr. sanchez, who i believe wrote the Rainbow Boys' Nelson's flaming character based on himself, newest books are better written and update to any level of any matter the man decides to put his thoughts to work."}, {"userName": "Ralitsa  Koleva", "userReviewDate": "Feb 20, 2010", "userURL": "http://www.goodreads.com/user/show/1558251-ralitsa-koleva", "userReview": "To be honest I paid attention to this book, only because one of my favorite actors was on the cover. Than I got curious seeing a reviews in the web from so many and different people. For book worm like me, all this positive words and reviews made me to want read this one. And I don't feel sorry.I don't know what's going on in the gay world... But that book made me feel like those people which have to fight so many hard moments in their days with other people which just can't accept them. I'm not gay, but I totally fall in love with this book! Plus the author writes 3 different POV! Every single chapter is from Jason, Kyle or Nelson's POV, which I love it gives you the chance to see what's going on with each of the boys. Its so good written that you don't realize when you are closing the book and opening the next one.I strongly recommend this no matter to gay people or straight people."}, {"userName": "Evan", "userReviewDate": "Oct 05, 2007", "userURL": "http://www.goodreads.com/user/show/216337-evan", "userReview": "The book is told through 3 boys eyes with alternating chapters of each of their perspectives. Kyle, a nice boy, whose a swimmer. He hangs out with Nelson a gay boy who's obviously gay. Also, Kyle is in love with Jason, a basketball player. Through the course of the book Kyle comes out to his parents. So does Jason and they become boyfriends? There relationship is kind of not official at the end of the book. They definitely like each other though. Kyle and Nelson have to deal with violence from a couple of other boys at school. They get picked on, threatened, and prank called. In one fight, Jason defends them. The book is simply written and enjoyable. Not the best YA I've read but one of the very few that deals with gay boys as the protaganists."}, {"userName": "Serena.. Sery-ously?", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/2926860-serena-sery-ously", "userReview": "L'ho letto in italiano 1812374392824 volte, lo conosco a memoria.. E sono rimasta shoccata e DISGUSTATA dalla censura nella nostra italica bigotta versione.No, dai, ma seriamente??*Disgusted mode: ON*"}, {"userName": "Dennic Von", "userReviewDate": "Oct 28, 2015", "userURL": "http://www.goodreads.com/user/show/39795763-dennic-von", "userReview": "So good!"}, {"userName": "Suraya (thesuraya)", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/27632683-suraya-thesuraya", "userReview": "cute but some annoying characters and mundane plot and writing style"}, {"userName": "Kristina", "userReviewDate": "Jan 23, 2010", "userURL": "http://www.goodreads.com/user/show/3193621-kristina", "userReview": "This book was really good, I couldn't put it down for one minute! It was inspirational, and it really made me realize how being yourself is the important thing and not trying to be someone else."}, {"userName": "Gary Jones", "userReviewDate": "Mar 17, 2014", "userURL": "http://www.goodreads.com/user/show/17410955-gary-jones", "userReview": "fantastic read I felt I knew the boys by the end so om going to read ok 2 now"}, {"userName": "Tennousei", "userReviewDate": "May 09, 2010", "userURL": "http://www.goodreads.com/user/show/2485949-tennousei", "userReview": "Чудесно утро, което започва с чаша кафе и Rainbow Boys. Не знам какъв точно им е проблема на хората, та освен да плюят по \"различните\" от тях, друго не им се отдава..."}, {"userName": "Jessica ", "userReviewDate": "Jan 14, 2018", "userURL": "http://www.goodreads.com/user/show/32295199-jessica", "userReview": "I think I missed the optimal age to appreciate this book fully which is sad. It wasn’t a bad story and many parts really tug at the heart strings. But being 30 and not 15 a lot of the altercations took such an extreme turn so quickly that without the benefit of raging hormones I couldn’t relate in the slightest. Again unfortunate because the subject matter itself I can relate to entirely. If you are at that age, going through high school this book 500% was written for you and I highly recommend it."}, {"userName": "Menglong Youk", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/27195238-menglong-youk", "userReview": "This is the first LGBT book I've ever read and the trilogy becomes my 6th favorite of all time. After finishing reading, I'm not hesitate to give it five stars because the book is undeniably encouraging, touching, heart-warming and inspiring. This trilogy will be listed in my reread list. Alex Sanchez did an absolutely great job on this novel and he automatically becomes one of my favorite authors of all time. This book is highly recommended to whomever want to be encouraged and stay strong against bullying.Update : I've just finished listening to the audiobook again because I want to come back to the World of Rainbow Trilogy. This trilogy is really unforgettable for me, just like the Harry Potter series. It is so amazing to come back to the old world that I adore. I wholeheartedly hope Alex Sanchez will continue this story for another few books. Really, I want to know more about Jason, Kyle and Nelson. *Spoilers*Below is my most favorite partNelson squirmed with embarrassment as his mom continued: “That’s my son, taken his first morning of kindergarten. Smiling. Happy. When I picked him up that afternoon, however, you would see a very different picture of him. Crying. Hurt. Sad. You see, his very first day of school he learned a new word: ‘sissy.’ The next morning he begged me not to make him go back.” Nelson had forgotten al that. Now he understood why she’d brought the photo. “I promised him school would get better. I believed it then. Now I realize I lied. For the past twelve years, every single school day he’s been caled names and obscenities, while most teachers have stood by silently. Some school officials even told him he brought it upon himself.” She looked at Mr. Mueler, who turned away from her gaze. “Simply because he walks and talks differently from other boys, he’s been hit, kicked, beat up, spit upon, and received death threats.” Nelson slid down in his seat, wishing she hadn’t told everyone he’d been spit upon. She looked straight at him. “There have been days when I wished my son hadn’t been born gay. Not because I love him less for it,” she said emphaticaly, “but so he wouldn’t have to endure so much suffering.” She looked at Fenner’s dad. “Some here talk about family values while in the same breath they disparage a group that would foster values of tolerance and understanding. I don’t know what those families have as their values. But I know students should be able to attend school without being abused. I believe this group wil help achieve that. Thank you.” School board members passed the photograph back, looked at one another, and nodded. Nelson sat thinking. In spite of his embarrassment, he sensed his mom had made the best point of anyone yet. The next number was caled, but no one stood up. “That’s your number!” MacTraugh whispered. Nelson rushed to the front and sat down. The school board members stared at him. He shifted in the hard wooden seat, stil without a clue what to say. “Uh, in case you don’t recognize me from the photo, that was me.” He meant it as a joke, except no one laughed. But his mom smiled. He cleared his throat, a little reassured. “Not every gay teenager has a mom like mine. Most teens don’t. Most aren’t even out to their parents, or anyone else. There’s a reason for that. As you just heard, it’s dangerous being gay.” As he spoke, he felt increasingly confident. “Some people ask: Why do we need a Gay-Straight Aliance? Why do you have to make such a big issue out of big issue out of being gay? Wel, we wouldn’t need a GSA if everyone accepted and respected—or at least tolerated—people who are different.” He narrowed his eyes at Fenner’s dad. “Some people talk about a homosexual threat. Excuse me, but who’s realy being threatened in this situation? The purpose of our club isn’t to ‘recruit’ anyone. What we hope to do is change attitudes and build understanding.” He stared out at the sea of faces and wondered whether his message was getting through. “Look, whether or not this group is approved won’t affect me. I graduate this year. I’m doing this for those who come after me. Do you realy want to make them go through the …” He was about to say “shit” but caught himself. He realized he was getting angry and took a breath to calm down. “Don’t put them through what I’ve been through. You can make school a safe place for everyone.\""}, {"userName": "Nikki Boisture", "userReviewDate": "May 28, 2009", "userURL": "http://www.goodreads.com/user/show/575042-nikki-boisture", "userReview": "This book was kind of...meh. It's about gay kids in high school, and the book kind of reads like a public service announcement. Hey Kids...get your parents involved in PFLAG! Hey Kids....don't be a homophobe! Hey kids....the GSA (gay straight alliance) has a right to meet thanks to the Federal Equal Access Act! Don't get me wrong, those are all important messages, but the book is none too subtle about getting that message across. (It even ends with several pages of information all types of gay related groups for teens.)Other problems with this book? Each of the kids has daddy issues, which seems a little cliche. Does a gay boy really have to be all close with his mom, but have a tortured relationship with dad? The characters were not developed much beyond their sexuality. OK, so Jason is actually bisexual and a super basketball player. Kyle is a swimmer. Nelson is just gay. That's it, nothing else to him. So. I'm being generous by giving the book three stars (I'd like to give it 2.5, but you know....Goodreads and all.) It wasn't really terrible. I liked the story line well enough and I'd be especially interested in reading more in depth about Jason. One laugh out loud moment, when Kyle's dad finally comes around (and all it took was Kyle getting the shit kicked out of him at school) he decides to go to PFLAG with Kyle's mom. And he asks Kyle about it and, in all innocence, calls it PFAG. Poor stumbling Kyle's dad."}, {"userName": "Carly", "userReviewDate": "Sep 12, 2009", "userURL": "http://www.goodreads.com/user/show/2443464-carly", "userReview": "Rainbow Boys follows the lives of three gay (read as two gay and one sorely confused about his sexual identity) boys on their journey through their Junior year of High School. There’s love (some returned, some unrequited), sex and bashings abound. Most reviews want to know “What have you learned while reading this book?” Well, nothing, really. It just showed the facts more clearly - a lot of people dislike the homosexual community and, because of this, go out of their way to make them uncomfortable, with bashings or with lurid name calling. And that stuff makes me sick. I don’t care if someone is gay or straight or bi or whatever - I have a few gay friends and my best friend is gay. Why do some people feel the urge to do those kind of horrible things to other people? I don’t understand it.I, for one, loved this book (as did my friend who let me borrow it). I fell in love with Kyle’s shyness, his and Jason’s half-way love, and with Nelson’s “I don’t give a crap” attitude. It was a really sweet book, despite the curious looks I received from it while reading it in public.Seriously people, grow up. And for those of you who understand that life is more than being gay or straight and want to read a good book, pick this up."}, {"userName": "Nicole", "userReviewDate": "Mar 30, 2009", "userURL": "http://www.goodreads.com/user/show/1985994-nicole", "userReview": "I'm kind of divided about this book. It's about these three gay boys in high school -- one is out and proud, one is gay but not out, and one is just beginning to explore his sexuality, concluding that he's at least bisexual, if not gay. The book sends great messages about the importance of safe sex regardless of your sexual orientation, relationships without sex and sex without a relationship, HIV and AIDS, and the prejudice and abuse many young gay men experience from their peers and their communities. For these reasons, I think it's a great book for young adults to read -- probably especially for young men grappling with their own sexuality, as well as those who see gays as inherently evil and possessing no feelings or humanity of their own.That being said, there is quite a bit of sex on the page in this book. Although not pornographic by any standard, it definitely made me uncomfortable to think about a young teen reading this book and picturing the sexual acts between the three boys. Because of this, I wouldn't really give it to anyone younger than 10th grade.Overall, a good book with good messages despite its rather graphic depiction of gay sex."}, {"userName": "Holly", "userReviewDate": "Jul 08, 2015", "userURL": "http://www.goodreads.com/user/show/2896679-holly", "userReview": "I love reading young adult LGBTQ novels even as a 18 year old. This book made me wish I read it when I was in middle school or high school! I love how the book switches between the three boys providing different perspectives. I enjoyed how the one character was bisexual and questioning throughout the novel. I wish they would have kept him bisexual and didn't make him completely gay. The bi element would have provided diversity and representation. Another good thing about the book was that one of the characters was latino and came from a latino family. That element provided much needed representation. Too often we see cis white gay boy novels and making a poc character made it much better. Overall, the book dealt with matters of homophobia, aids/hiv, as well as personal/familial acceptance. I think the aids/hiv portion was a little dramatized but I suppose the purpose of that was too preach safe sex which granted is rather important. All in all, it was an easy, fun, LGBTQ read and I am currently reading the second in the series."}, {"userName": "Troy", "userReviewDate": "Oct 22, 2010", "userURL": "http://www.goodreads.com/user/show/4416471-troy", "userReview": "I liked this book. If you like reading stories about gay teens who are trying to make sense of their sexual orientation and trying to see how they fit into the real world, I think you'll like this. The only drawback for me was that the characters seemed more like \"representatives\" of real kids. Some of their dialogue seems a little too \"grown up\" for their age, and I got the feeling that the author was probably wanting to appeal to parents of gay teens as well. There's very little cursing (which is something that is a natural part of teenage vocabulary), and the cursing is very toned down. I also felt like I always knew where the story was going even before it happened. There's a predictability about it that took away some of the suspense for me. I did, however, like the 3 main characters even though they were so very different from each other."}, {"userName": "Audrey", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/2413680-audrey", "userReview": "3.75 stars. I wasn't too taken with this story for the first third, but after that, the different POVs and the growth shown by each of the young men really drew me in. While the first 1/3 might have been a 3 stars for me, the rest of it was solid 4-4.5 star reading. I'm usually not a fan of YA stories, but this one really rang a chord with me. It felt real, even when I was cringing through some of the life choices made by these guys. By the end of the story, I felt like I really had taken a journey with them, and I was pleased to see there were two more books that explored their lives and relationships."}], "description": "Jason Carrillo is a jock with a steady girlfriend, but he can't stop dreaming about sex...with other guys.  Kyle Meeks doesn't look gay, but he is. And he hopes he never has to tell anyone -- especially his parents.  Nelson Glassman is \"out\" to the entire world, but he can't tell the boy he loves that he wants to be more than just friends.  Three teenage boys, coming of age and out of the closet. In a revealing debut novel that percolates with passion and wit, Alex Sanchez follows these very different high-school seniors as their struggles with sexuality and intolerance draw them into a triangle of love, betrayal, and ultimately, friendship.", "title": "Rainbow Boys\n      \n          (Rainbow Trilogy #1)", "url": "https://www.goodreads.com/book/show/94064.Rainbow_Boys__Rainbow_Trilogy___1_", "average": 3.84, "cover": "https://images.gr-assets.com/books/1388281942l/94064.jpg", "reviews": 511, "authors": [{"url": "https://www.goodreads.com/author/show/53974.Alex_Sanchez", "name": "Alex   Sanchez"}], "type": ["Young Adult", "Lgbt", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/94064.Rainbow_Boys", "http://www.goodreads.com/book/show/2336234.Rainbow_Boys", "http://www.goodreads.com/book/show/10592332-rainbow-boys", "http://www.goodreads.com/book/show/94063.Rainbow_High", "http://www.goodreads.com/book/show/94062.Rainbow_Road", "http://www.goodreads.com/book/show/673498.The_God_Box", "http://www.goodreads.com/book/show/94060.So_Hard_to_Say", "http://www.goodreads.com/book/show/8525600-boyfriends-with-girlfriends", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}