{"ratings": 3109, "userreviews": [{"userName": "karen", "userReviewDate": "Oct 14, 2011", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[zzzzzzombies (hide spoiler)]"}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/\n“You’re not like the rest of them, Stony. Maybe it was the way you were born. But you’re different. You’re more . . . human.”\nDear Daryl Gregory . . . . . \nI stumbled upon this author a few years ago when everyone was raving about We Are All Completely Fine (followed up by a library copy of Harrison Squared since (1) it featured the MC from We Are All Completely Fine in child format and (2) I’m always on the lookout for YA to force upon my own children). I forgot all about him until Spoonbenders showed up (once again on NetGalley – seriously authors, get your shit out there so people start talking about it – unless your publisher finds someone to release a blurb stating your new book is the “next Gone Girl” – in that case buy a big bed so you can spread your bajillions of dollars all over it and roll around). Anywho, Spoonbenders hooked me with only the title and I didn’t put two and two together regarding the author until waaaaaay after I clicked the request button (or maybe not even until I was almost done reading the book – #oldladybrain). Same goes for Stony here. I had never even heard of this book until status updates from my pal Zombieslayer put it on my radar.My finger has been hovering on the 4 Star button, but I can’t really figure out why I’m so anxious to deduct anything from this one. Well, except because . . . . \nI haven’t met a zombie I loved more since I ran across this fella in the back shed umpteen years ago . . . . \nAnd the story? REMARKABLE! While I’m sure there will be some comparisons to Warm Bodies simply due to the humanity factor, to me Stony was a (nearly) brand new take on things (and there was no romance sidestory to muck things up either, if that's not your idea of a good time). To begin with, Stony was a living dead who grew from baby to adulthood rather than the norm. I’m going to try and keep this brief in order not to drop any unintended spoilers, so let me just say not only do you get the story of Stony's (or Brother John, as he’s known to his family) upbringing, but when stuff and things happen which make Stony leave the comfort of the family farm where he’s been hidden his entire life you get to venture out into the real world with him as well. It’s there that he learns about the Living Dead Army, a potential leader who may seem familiar to many . . . . \n(Well, maybe more like the Gorton’s Fisherman, but you get the idea). Stony also discovers that due to his unique history . . . . . \nWe learn that you can’t always trust everything you’ve always been told and you most definitely shouldn’t rely on the . . . . . \nAnd we readers get introduced to The Lump. Oh good golly Miss Molly The Lump!!!!!!!\nWhy has no other author ever thought about things like this before?!?!?!?!?!?!Anyway, I’m going to wrap it up here before I say alllllll the things about allllllll the things. If you’re a zombie aficionado, this one can’t be missed. And once again, to you Mr. Gregory (because I know I tend to be pretty vague): I’ll read anything you write . . . . . \nAll the Stars."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "May 23, 2015", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "Update August 17, 2017: $1.99 on US Amazon. This was really good and a different take on zombies. Original post:This is a book about a newborn baby who is found on his dead mother on the side of the road. He was found by a single mother driving by with her young daughters. They take him home and raise him secretly. Why secretly? Well, the baby wasn't like other babies and if anyone found out about him, they'd take him away and probably kill him, and the rest of the family would be in loads of trouble. They name the baby John (Stony) Mayhall. Stony doesn't breathe, he doesn't eat. Yet somehow he miraculously grows up and is a good man. He ends up being a sort of hero. A zombie hero.Yes, this is a book about zombies. That's no secret. But this is not a typical zombie book. It's hard to classify it. It's not horror, although there are some gross parts. It almost reads like general fiction with a dash of magical realism. It has supernatural aspects, but the book isn't heavy on it. The zombie world-building was quite interesting. These zombies are somewhat different. It's definitely not a \"brains, brains\" zombie book. It's more about the zombies becoming a sort of marginalized minority group and those who support them, hate them, or engage in activism on their behalf - or against it. Who knew there could be such a thing as zombie politics - among the zombies themselves!This isn't a thriller, yet it moved along pretty well, and was easy to read. I liked Stony and his family and the supporting characters he met after leaving home. If you are or know someone who doesn't like horror, but is willing to give a paranormal or zombie book a try, I would recommend this. (But there is a lot of cursing - I'm not saying this is a PG-rated zombie book, if that kind of thing matters to you.)Great read! :)"}, {"userName": "Jason", "userReviewDate": "Jan 06, 2011", "userURL": "http://www.goodreads.com/user/show/10378-jason", "userReview": "This was pure pleasure--a reinvention (or is that revitalization?) of the zombie mythos, a compelling and often surprising what-happens-next? page-turner, and as sweet, funny, moving, and yet tough-minded as the very best of Bradbury (or John Crowley, who gets a hat/tip).My rating may go up. But this is awesome; I've really enjoyed Gregory's novels, but this is something.(And now Mira Grant and Colson Whitehead have a pretty high bar to jump for their uses of the zombie. . . .)A longer review to come. And arrived:The premise builds on the Romero base -- a zombie outbreak on the east coast, in 1968, happened, but got contained. (Romero's \"documentary\" is referenced a few times.) Since then, the US government has amped up surveillance and secret ops, ever vigilant against recurrences, in a situation not too dissimilar from our own post-9/11 formerly-color-coded state of always-could-become-terrifying-so-don't-fret-too-much-about-our-rights context. Yet at the tail end of that first outbreak, a dead child was found, and the single mother raising her three young girls couldn't bear to kill the boy. So they kept him.And he grows up. This physical impossibility is one of many departures from most zombie conventions, but Gregory--in brief digressions or extrapolations that delight--is actually trying to tease out some philosophically-grounded theory of zombies, riffing on but refuting (or at least reimagining) the generic tropes of epidemiology and infection. There's something strange about matter suddenly mobile, and there's a recurrent strand of this novel--like the author's prior two works--intrigued by the nature of the human, and how fantastic ideas (demons, genetic mutations, zombies) resonate with the on-going struggle to make sense of humanity and existence. As a horror fan and semi-knowledgeable zombie geek, I was gobsmacked by how Gregory's surprising transformations of lore made retroactive sense of the conventions. (He isn't just trashing old approaches but creating new contexts for interpreting them--and with wit, no smirks but a loving teasing sense of play.)The novel traces young John--nicknamed Stony--in youth, adolescence, and then as an adult; it's a zombildungsroman, utterly enjoyable for the sophistication Gregory brings to characterization, even with walk-on parts, and Stony is thoughtful and likable (maybe a bit too likable?) -- and overall, one \"flaw\" in the novel is how, even when engaging the meanness of human behavior or the horrors of the inhuman it is relentlessly humane. If you're seeking a dark satire or a horror novel, move along. And while I might have wished for a bit more bite, this is a zombie novel by way of Ray Bradbury--a what-if, with a lot of sadness and wonder but not much dread and no terror.That said, there are traces of social satire, never reduced to mere allegory. Intriguingly, all of Gregory's novels are alternate histories -- he goes back in time, reimagines recent US history through these genre tropes. Or maybe it's metafictional in intent: inevitably, some character calls attention to the ways we fantasize, what our dreams of such creatures tell us about what bothers and delights and terrifies and underpins American culture. Or.... these hints of bigger Meaning or Purpose are fascinating but never really center-stage; the novel has a big Story, and rips right along, and Gregory's focus is on these people (or non-people) and their response to these big events. It's a lovely novel--even the zombie-indifferent (or -antipathetic) would find much to relish. Gregory is a very good writer, and I can't wait to see where he goes next."}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Jun 16, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "Made the list for Best Badass Zombie Books..http://badassbookreviews.com/the-best...Part 1This is the story of a little baby found on the side of a road. He is clearly different. He should not be. Wanda Mayhall does not care. Stony is a baby. She will protect him from the world, and make sure he is raised to be loved and cherished just like her three other children.Sadly for Stony, he knows he is not like his sisters. His physical self is not only different, but he feels no pain, and things that should kill him (like an arrow to the heart that is accidently released by his best friend Kwang) only cause concern on how he’ll hide it from his mom.Stony also knows that his kind, whatever the right term is for his kind, is feared. See, one bite, and you have his “disease”. People without his disease do not trust him. Moreover, they might be onto something. After the initial bite, there is a time-period where his kind becomes mindless, and in their state of mindlessness, they want to bite others.Stony fears for the day when he is discovered. In his fear, he prepares.Part 2This is a story of a young man forced to live away from his family because some townsfolk finally figured out his disease. Now he lives with others like him. However, he does not exactly fit in with them either. Stony is different. He wants to make the world a better place, he believes everyone is good until they are proven to be anything else, and most of all, he wants his family to be safe. Stony’s disease is different from the others as well. It progresses differently & Stony thinks differently, he is smarter, he is logical and he is compassionate. Because of this, he is treated differently even among his own. Part 3This is the story about the government. Using scare tactics to keep the public misinformed. Conducting experiments on diseased patients and voiding these patients of all rights. It is also the story of a man trying to protect his own from the government, playing the governments game until he can set things right. Stony, the forever optimist, believes he can make everything better if he just tries hard enough.Part 4This is the story about a middle-aged man’s sacrifice for his family. This is a story about discovering who you are and what you truly are made of. It is about finally figuring out the real monsters in the story and about selfless love.It’s the story about Stony the zombie.Side Note- I originally had this at 4.5 out of 5 stars but everytime I think about it, it brings tears to my eyes. Thus, I moved it up to 5 stars."}, {"userName": "TL ", "userReviewDate": "Aug 21, 2015", "userURL": "http://www.goodreads.com/user/show/4342402-tl", "userReview": "Lazy updating this because I haven't feeling well past few days and can't concentrate enough to write a proper review for this and my other most recent read... bleh. I blame Mother Nature (allergies and sinus suck)Still enjoyed this one very much, this would be interesting to see as a mini-series or a movie if done right.---Original review:I was very skeptical about this, not gonna lie or sugarcoat it. I'd seen some positive reviews for it and was intrigued but it took me awhile to pick it up after I bought it... kept picking it up and putting it aside after reading a few pages. Then, when I was putting my TBR list together for October, I glanced at it sitting on mt shelf and figured 'why not now?'A different take on Zombies/living dead but it worked out really well for me.----In 1968, after the zombie outbreak, Wanda Mayhall and her three young daughters discover the body of a teenage mother during a snowstorm. Wrapped in the woman’s arms is a baby, stone-cold, not breathing, and without a pulse. But then his eyes open and look up at Wanda-and he begins to move.This one isn't a fast paced book, Stony's life and deeds unfold at a steady pace. He grew on me slowly, the clever bastard :). There were a few slow spots but I never thought about abandoning the book, I took my time with it because I didn't want to say goodbye to Stony. There are a few instances where I raised my eyebrows when Stony did certain things, that had me thinking...I won't spoil it for youins but you'll see what I mean :).I loved him for not giving up, thinking ahead, and trying to make things better for his people... protecting his family by staying away and making certain 'improvements' to the house. (Though I don't think he imagined it that way fully at the time)The story starts in 2011 and gives you hints abut what is going on, then goes back to 1968 and moves forward throughout the years/different stages in his life.We get to know Stony really well,at times it felt like you were really reading someone's life story.Everyone is done so well, even the bad guys. (One didn't have as a big part as I thought and the other I kind of expected but not in the way it happened) Delia and Mr. Blunt were my favorites :). 'The Lump' was an intriguing one as well... too bad he didn't have more screen time.The whole world, the history, the customs, the different kinds of LDs... was just endlessly fascinating to me. I couldn't get enough of it. There's humor sprinkled throughout all the seriousness, sort of 'graveyard' or 'black humor' I guess, but never failed to make me smile.When I book pleasantly surprises you, well :) Need I elaborate?<3 <3Would highly recommend, happy reading!Other wonderful reviews of this book:karen's reviewSh3lly (Not all those who wander are lost)'s reviewFiggy's review"}, {"userName": "Paquita Maria Sanchez", "userReviewDate": "Dec 25, 2011", "userURL": "http://www.goodreads.com/user/show/2508169-paquita-maria-sanchez", "userReview": "Though this is certainly not the very best novel I have ever read--or have read this year, or this month, or even this week--this is definitely the most super funfun time I have had reading a book in ages. I know that by saying that I am running the risk of driving people away from Stony Mayhall out of sheer literary fussiness and general taking-self-too-seriouslyness (not saying I'm not guilty), and that is truly a shame because it really is quite well-written on top of being fast-paced and cheeky in all the right ways. I should thank goodreaders Mike and karen for their reviews which piqued my interest in this one, as I probably would never have even considered picking it up otherwise. I'm glad that I did, as the pacing combined with the at times dark and at other times wholesome and heartwarming humor is well-balanced and makes more out what could otherwise just be same ole zombiesplatter nonsense. In fact, it is particularly non-splattery. Oddity number one. \"Zombies, snore\" you may be saying, but don't give up on them just yet. I realize that they're almost as all-up-in-yo-face as sparkling vampires these days, but can we at least agree that zombies are a helluvalot cooler than those assholes to begin with? Besides, Daryl Gregory knows what he's getting himself into, and he calls himself out for every embraced or deliberately curtailed staple of zombie mythology throughout the story. This is not some redundant Land of the Dead bullshit; there is something else going on here. It's not quite wacky enough to be likened to Shaun of the Dead, but also not anywhere near gory enough to bring any other major zombie film to mind. (Sorry, I must use examples from film since I love zombie movies, but have never read a single other zombie novel.) Raising Stony Mayhall rests somewhere in between these standard approaches, a family-centered coming-of-age tale based around the idea of a post-infection, generally non-violent, hunted and oppressed zombie minority. Most people fear and shun them, even though they have to bite you to share their \"disease,\" and they don't even have the urge to do so ...well, not anymore. Throughout the whole thing, I just kept thinking \"AIDS epidemic, AIDS epidemic, just come out and say it, Daryl...AIDS EPIDEMIC.\" It's not just that simple, however. There is a whole lot more social critiquing going on (as fictions about zombies tend to exhibit), and the layers aren't just something a thesis-writing FVS or Lit student has read into it after the fact. It's all placed with care. I should just get to the point. This novel is sort of like those microwavable Amy's burritos that you buy at the health food store; sure, it's not the very best thing you could be consuming, but you could do a whole lot worse and damn is it tasty anyway.* *You know, even that may be unfair. I think I'm being too harsh because reading a zombie NOVEL just makes me feel silly. Never mind my baggage, this is quality literature despite the constraints it has set up for itself from the beginning. It's gooooood."}, {"userName": "Reynje", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/5590906-reynje", "userReview": "Gregory’s take on zombies in Raising Stony Mayhall is both unusual and ambitious, blending an alternate history, a Living Dead divided by ideology and politics, and musings of the existential variety. It is an intelligent book that has a lot to say, occasionally taking a philosophical turn as Stony wrestles with the paradox of his existence and the events his life has set in motion. The first part, detailing Stony’s early family life, is strong and richly observed. The characters are written with obvious care, particularly Stony, who is very endearing as the boy who is not a living boy. However, beyond this point, I began to feel as if I was reading another book entirely. The shifts in time and tone created distance between myself and the story that I found difficult to bridge, and I felt less involved with Stony on an emotional level. The plot is detailed, and the LD world Gregory has built is interesting and much more complex than a simple mass fever for brains type scenario. Unfortunately, I found large portions of the story quite disengaging to read, given the slowing pace and the vast amounts of information incorporated into the narrative. While I appreciate some of the deeper themes and discussion throughout the story, and I enjoyed the climactic scenes, I felt it was let down by a rather predictable ending. By this point, I’ll also admit that my investment in the story was quite low, so the impact felt a little hollow for me. If you’re looking for a different take on the living dead with some thought provoking ideas about life, family, guilt and redemption, this may be for you. Unfortunately, it just wasn’t really for me."}, {"userName": "Emma", "userReviewDate": "Dec 26, 2017", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "3.5 interesting concept in the zombie novel genre. The main character is a zombie who gets adopted by a family in Iowa. I really enjoyed the first third of the novel but liked the rest of it less. Some interesting ideas about how the zombies organised themselves."}, {"userName": "Kaora", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/7983564-kaora", "userReview": "The blurb of this book is what first drew me in promising a new take on zombies. Not one where they are mindless feeding machines, but one where they are able to think and speak and control their impulses.The zombies in this book, after being turned, go through a 24-48 hour fever where they are the mindless feeding machines, but after the fever breaks they turn into the \"Living Dead\" or LD. Their bite is still deadly, and they are hard to kill but they can function almost normally. If you consider occasionally losing a body part normal.The book did not flow. It was broken up into parts, each one a different time in Stony's life - his growing up, on the run with other undead, in prison, and after prison. With each section comes a jump in time, that kept me from fully investing in the story. It was like a skipping CD that when you started to get into it, you found yourself somewhere else entirely without a clue on what you may have missed.I didn't enjoy the writing that much, as I usually enjoy a descriptive writer and unfortunately the author seemed more intent on conveying deeper themes than setting the scene. He also put in a lot of details that were just unnecessary, like this one:He started the car, put it in gear, looked over his shoulder and pressed on the gas. The car lurched forward, and he slammed on the brakes.I don't need an up to date play-by-play on every second of this guy's life.The entire book is written from a 3rd person perspective, but towards the end the writer suddenly attempts engage with the readers:Do you remember Officer Tines?It's important that you all know this so you know that William Tines was not a bad man.The change is so abrupt, but I guess it fits with the general choppiness of this book.I did like how the book brought up questions about humanity, and what makes us human, but it could have been executed much better than it was.2 stars.Cross Posted at Kaora's Corner."}, {"userName": "Trudi", "userReviewDate": "Jul 18, 2011", "userURL": "http://www.goodreads.com/user/show/1416912-trudi", "userReview": "This book has an outstanding premise and infuses a lot of originality and freshness into the standard zombie canon. I came so very close to giving it four stars, but alas, in the end it remains at a solid, hard won three. In a novel filled with a brilliant cast of characters, everyone unique and engaging in their own way, I felt there was an emotional element largely absent from most of the story. I'm left a little perplexed why this should be so, since it's a book about \"zombies\" and how they think and feel and remember and even love. The entire story is a curious, valiant attempt to \"humanize\" a monster that for so long has been dehumanized and even demonized. If you are going to give zombies personalities, worries, fears and dreams, if you are going to give them a family who loves them or people willing to risk their own lives and safety to hide them, then shouldn't there be an overwhelming sense of ... compassion? empathy? feelings of heartbreak and tragedy? This book is filled with philosophy and action and world-building, but amidst all of that drama there is very little emotion. I felt disconcertedly detached throughout.Now if that doesn't necessarily bother you, than by all means I cannot recommend this book enough. Daryl Gregory accomplishes something here that I didn't even think was possible -- he writes a coming-of-age zombie tale about zombies who now must fight for the right to live dead. What are they anyway? Do they still have a soul? When is dead ...dead? More than once I did have the refrain from The Elephant Man running through my head: \"I am not an animal, I am a human being!\"Writing zombies as existential beings certainly turns established canon on its head, but it also left me wondering whether I even want my zombies thinking and feeling. These kind of zombies become the heroes of their own story but get in the way of putting live humans in impossible situations forcing them to make impossible choices to survive. Suddenly, the book starts to read like an allegory for Nazi Germany, where the zombies are the Jews in hiding and the living have become SS soldiers ferreting out safe houses to annihilate and / or experiment.Overall, I think this is a brave novel that is gripping and interesting in the questions it raises. I wanted to think less however, and feel more and that's where I was let down."}, {"userName": "Lightreads", "userReviewDate": "Feb 18, 2012", "userURL": "http://www.goodreads.com/user/show/1836077-lightreads", "userReview": "Bravo. This is the zombie book I didn't know I wanted. It's a grim, slyly funny, philosophical story about a zombie baby found beside the road in alternate history 1968 Iowa, and the women who risk their lives to raise him (raising, get it? No really, I swear, it's actually very cleverly funny). This is a book that draws its political horror in broad dashes, but does its interpersonal work in tight, minute, precise gestures. It's thinking about zombie fiction, but not in that irritating way where it's all did you know none of this makes any scientific sense? But instead in that zombies are a way to think about embodiment, and the persistence and unholy power of consciousness. You can read it as kind of about disability if you want to, but I think that's a little too narrow a lens. Really it's about the mystery of being alive in inexplicable flesh. And that's pretty universal. It made me laugh a lot, and facepalm, and then, eventually, want to hold someone's hand for a while. There are so many perfect small touches, like how zombies are asexual (but in our protagonist's case, not a-romantic), and how everyone knew the world was going to end, the only question was when. But the big picture emotional push of the book was so good, I really don't need to pick it apart.And now I really want to know what this Daryl Gregory fellow is going to come out with next.Highly recommended."}, {"userName": "Bonnie", "userReviewDate": "Jun 17, 2011", "userURL": "http://www.goodreads.com/user/show/5136858-bonnie", "userReview": "Interested in more of my reviews? Visit my blog!In Part I, the Mayhall family find a woman long dead on the side of the road with a baby wrapped up inside her coat. Shortly after, Wanda Mayhall realizes what he really is, yet decides that they are going to keep him anyways and hide him from the world. We watch Stony change and literally grow from a baby into a young man just as any normal living human being does. We watch him become an integral part of the Mayhall family and develop into his own unique person. This was my favorite part of the novel. Following Part I, which I was absolutely in love with, there was a major shift in the story and I wasn’t exactly on board with it. It became overly political, it became slightly philosophical, and I realize in retrospect that this was the world that the author was creating but it wasn’t exactly how I thought the story was going to go (or how I would have preferred it to go). I did enjoy the scientific aspects of the story and how the Living Dead were researching to find out what made them the way they are and what made it possible.’Here was Thomas’s blood before he died, six hours after the bite: perfectly normal. And here was Thomas’s blood after he passed, at the 6:12 mark: dark, viscous, waxy. The transformation had occurred between observations, like the state change in a quantum particle. Like death itself.’Many parts of this book required a certain amount of imagination. The idea behind the zombies in this book was that “Consciousness was the key.” At one point Stony explains how he once removed one of his toes and yet it still failed to decompose even though it was completely separated from his body. Once the toe was finally off his mind and he had failed to continue checking on it and thinking about it, only then did it finally start rotting and decomposing. I found this to be quite an interesting concept yet extremely hard to understand. Was that the only thing that kept these zombies ‘alive’? That if they had stopped thinking about themselves as a living dead person would they simply cease to exist?’Where one dead thing ended and another began was largely a problem of perception and definition.’Final ThoughtsI was overall disappointed with this book; however, I think that was largely because I was expecting something different entirely. I thought the storyline with the LD ‘governments’ and the plans being hatched by them was pretty strange and largely unbelievable. I had a hard time understanding where all the money came from… how one person could be the sole benefactor of so many. Also, the ending was inevitable but a bit too anticlimactic I thought. I loved Stony in the beginning but I was pretty disappointed at how the rest of the story unfolded."}, {"userName": "Bandit", "userReviewDate": "Jul 11, 2012", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "This is a great book. A really great book. I originally came across Daryl Gregory's books while browsing amazon.com and thought they looked very interesting, so particularly with my love for zombie genre, this was a case of judging the book by the cover (or description really since the cover is not very descriptive) and it definitely paid off. There is an epic quality to this book, which easily transcends the genre limitations and simply transforms it into a great work of literature with strong well developed interesting characters and exceptional writing. Stony Mayhall is quite possibly one of the best characters (zombie or otherwise) that I have ever had the pleasure to read. Just like in Warm Bodies, where R's driving quality is his humanity, it's what makes the book so irresistable. I read it within 24 hours of starting it. In fact Stony Mayhall is sort of like zombie Superman...he has amazing powers and talents, he can destroy the world, but he chooses over and over again to try saving it, because of his human upbringing, because of his inate kindness and strong moral core. I checked this book out from the library, but now I know I have to get my own copy as well as read other Gregory's books. 5 star read. Very highly recommended."}, {"userName": "Carly", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/4490040-carly", "userReview": "[I’m not just talking about his sister. Consider his mother, who is trapped in prison. We don’t really hear about her after Stony gets out of prison.But another huge problem for me was the lack of answers. What allowed the zombies to move? Was Stony somehow special? (hide spoiler)]"}, {"userName": "Marvin", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "At first, this novel begins like The Waltons meets The Walking Dead. It's a clever quarter of a novel that introduces our hero Stony Mayhall as a zombie infant that does something no other zombie does...grow up. The setting is interesting too. It begins in 1968 in an alternate reality that has witnessed a zombie epidemic shortly before that year. The zombies have been pretty much killed off by the government yet small groups still exist The kind Mrs. Mayhall sees that there is something different about Stony and raises him as her own, keeping him hidden in her rural Iowa home.It's kind of sweet. However when the second quarter of this book begins, Stony starts to meet other living dead or LDs (\"We don't like to be called zombies\") and they are nothing like he and the world envisioned them. This is where the novel takes on some interesting socio-political overtones. I think it is purely intentional that this novel starts in 1968 and ends in 2011. The early parts has definite comparisons with the civil rights movement while anyone who misses the Al Qaeda implications in the later half must be living under a rock. To say this is a zombie novel is a gross misrepresentation. It has more to do with the socially minded science fiction of Asimov, Heinlein and the religious overtones of Philip K Dick than any horror writer. Because of this, it is a engrossing read that speaks of the meaning of being human and our fears of different life styles and thoughts. Highly recommended.."}, {"userName": "Megan Baxter", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/5742086-megan-baxter", "userReview": "Goddammit, people. I don't want to read zombie books. I'm not a huge fan of zombie cinema (I've seen two Romero movies, and that's about it.) I don't read horror. I like to sleep, and I'm far too sensitive to such things! (Although it's easier to let go of when it's the written word instead of the screen.) So how have I ended up reading two zombie books this year, both of which I really liked? Dammit, Daryl Gregory! Dammit, Mira Grant! Stop that!Note: The rest of this review has been withdrawn due to the changes in Goodreads policy and enforcement. You can read why I came to this decision here.In the meantime, you can read the entire review at Smorgasbook"}, {"userName": "Bill", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "Stony was born into the world not knowing really who or what he was. It was like he was an Etch A Sketch that had been drawn upon and then shaken. In his super hero alter ego he was “The Unstoppable.” That may be truer than he could ever realize because The Big Bite is on the horizon and Stony and his group of LD and breather buddies either need to find a way to stop it or embrace it.A very interesting twist on the Zombie apocalypse that was refreshingly original in premise and execution. The characters were written flawlessly and the pacing flowed with barely a hitch. My second excellent read from Mr. Gregory. I look forward to more. 4.5 Stars and Highly Recommended!"}, {"userName": "David", "userReviewDate": "Dec 07, 2011", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "I'm not sure why zombie novels are all the rage right now, or why I'm reading so many, but Raising Stony Mayhall was unexpectedly good. From the description, I was expecting it to be kind of a one-note gimmick based on the thin premise of a \"zombie baby,\" but some positive reviews convinced me to give it a try, and I'm glad I did.This is a book written by someone who knows the zombie genre and treats it with appropriate respect, while adding something of his own to the zombie mythology. The background is that in 1968 (yes, that date should ring bells if you know your zombie movies), there was a brief zombie outbreak, which was quickly contained after a large number of deaths. Unbeknownst to the public, however, the zombies weren't all destroyed, because it turns out that zombies are only mindless brain-eating monsters for a few hours after they \"turn\"; after that, the madness passes and they become their normal selves again... except, dead.The government has been imprisoning or destroying every zombie they find and keeping their existence secret.Stony Mayhall was a zombie baby found in the arms of the dead teenage girl who had recently given birth to him. The baby is found by a single mother and her daughters in 1968, just after the outbreak, and instead of turning it in, they keep it. Somehow, this \"dead\" baby grows up. Stony has to live his life in hiding with his adoptive family, though he does have one childhood friend who knows about him. Other than being undead, he matures mentally like a fairly normal kid, until one horrible night when he is a teenager, events force him to flee and go underground. He discovers that there is an entire secret society of living dead hiding from the authorities. They are divided into factions: some want peaceful coexistence with the living, others want to start a zombie apocalypse.This book has many strengths. The writing is a cut above; Daryly Gregory does not write this like a pulp horror novel, but more like a literary bildungsroman. Stony is a compelling, sympathetic character, as he's smart and introspective and while a good person, he's also capable of learning to become a hard-bitten, cunning one. The book raises many issues concerning the morality of the living dead and what defines a human being; to its credit, it never goes for camp and while there are some funny parts, it's not satirical. Gregory has thought out the rules for his zombies very carefully, and everything is internally consistent. He confronts certain physical impossibilities head-on, which become important in the final climax.My only complaint is that it skips around in time a bit, spending the first half of the book with Stony's upbringing from 1968 into the 1980s, and then jumping around from the early 90s to the present day. So the overall chronology of the book isn't always clear.Other than that, though, this was an excellent read. I've never read such human zombies, nor a zombie novel with so many touching moments. It's entirely self-contained and there's absolutely no need for a sequel, so I recommend it for anyone even mildly interested in the genre. It wasn't quite blow-my-mind awesome, so I'm giving it 4.5 stars."}, {"userName": "Figgy", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/5056662-figgy", "userReview": "Featured on my 2014 favourites list!In 1968, after the zombie outbreak, Wanda Mayhall and her three young daughters discover the body of a teenage mother during a snowstorm. Wrapped in the woman’s arms is a baby, stone-cold, not breathing, and without a pulse. But then his eyes open and look up at Wanda-and he begins to move.This book was not what I expected, at all, and I found it an incredibly refreshing take on the zombie genre. Stony is just a normal boy growing up in a house full of girls, normal, except for the fact that he’s not alive. There were times while reading this book that I felt like I was reading someone’s real life story. When I could completely overlook the fact that he was zombie, when I saw him for the person he was, regardless of his grey skin.The rest of this review can be found here!"}, {"userName": "Janene", "userReviewDate": "Jul 06, 2011", "userURL": "http://www.goodreads.com/user/show/1739786-janene", "userReview": "Occasionally a novel comes along that totally changes the way you view things and your perceptions of what 'should be'. This book was so touching and different. It was one of those books that the further I got, the slower I read. Not because I was bored or uninterested...no. It was because I was afraid of what was coming..the unknown and didn't want to say goodbye to Stony and try to find something equally as precious. There are several great reviews here... all I'll leave you with is....read it. Highly recommended reading for the Living Dead fan or person who's not so much of a fan. PS: And if you read and enjoy the flavor of this book...check out 'Handling the Undead'. ;)"}, {"userName": "Carlos", "userReviewDate": "Apr 21, 2012", "userURL": "http://www.goodreads.com/user/show/7211477-carlos", "userReview": "Este libro es lo que uno espera de la literatura de género. Que use las convenciones, las pervierta, las dinamite y haga algo totalmente inesperado. Gregory no sólo tiene una idea brillante, sino que la desarrolla con competencia más que solvente.No sé con qué cara se podrán crear nuevas obras de zombies sin hacer el ridículo al lado de Raising Stony Mayhall. Y quien lo haga y no sepa que el buen Stony es el fantasma que vigila a los LDs, mejor que no cuente con mi atención.5 estrellas para un libro que tiene que ser un clásico."}, {"userName": "Leah", "userReviewDate": "Sep 12, 2011", "userURL": "http://www.goodreads.com/user/show/663928-leah", "userReview": "http://sosaysthewhale.wordpress.com/2...I could simply say drop whatever you're doing and read this book. Now. That wouldn't do it justice, though. This is the kind of story that needs to be discussed, demands to be gushed over, and ultimately stays with you long after you've finished those last words.It is traditional to end with the Last Girl, the sole survivor, a young woman in a blood-spattered tank top. She drops her chain saw, her sawed-off shotgun, her crowbar - these details differ - and stumbles out of the ramshackle house and into the light. Perhaps the house is burning. Dawn glows on the horizon, and the ghouls have been defeated (for now, for now - all happy endings being temporary). Perhaps she's found by her fellow survivors and taken to an enclave, a fortress teeming with heavily armed government troops, or at the very least gun-toting civilians, who will provide shelter until the sequel. Perhaps this enclave is located in Easterly, Iowa, about sixty miles northwest of the ruins of Des Moines. Perhaps the girl's name is Ruby.So begins our story. To say this is a zombie story would feel like a lie. Yes, the main character is a zombie and, yes, there was a zombie outbreak. However, Raising Stony Mayhall is so much more than a horror novel. There is an unassuming elegance in Mr. Gregory's writing and it's clear he carefully deliberated over each word. There were countless passages where I lost myself in the imagery and forgot I was reading what was being put forth as a run-of-the-mill zombie tale.There are few gorey scenes. There really is nothing in-your-face about Raising Stony Mayhall. It’s so much more than yet another book cashing in on a popular trend: it’s a story about family and to what lengths we go to protect those we cherish. Don’t expect a Lifetime movie though. Thankfully, it’s not quite that sappy.Are you sleeping,Are you sleeping,Brother John?The story opens in Easterly, Iowa in the winter of 1968. (The prologue was set in the present day, 2011.) On both coasts there has been a zombie outbreak and what's left of civilization is trying to pick up the pieces and attempt to return to some sense of normalcy.Wanda Mayhall is a widowed mother of three girls: Alice, Chelsea, and Junie. One night while heading back to their farm, they come across the body of a young woman barely out of her teens. There's no hope of saving the woman, but Wanda is unable to leave behind of body of the newborn discovered in the woman's arms.\"We should call him Gray,\" Chelsea said.\"He's not a cat,\" Alice said. \"We shouldn't name him anything.\"\"We'll call him John,\" Wanda said, surprising herself again.\"That's it?\" Alice said. \"John?\"\"Brother John,\" Chelsea said.The boy looked up at them. Then he blinked. He hadn't blinked before.\"A boy like this,\" Wanda said, \"is going to need a normal name.\"Despite all evidence that the boy is dead - no pulse, he's not breathing, his skin is grey & cold - he soon begins to move. At first it's just a twitch of an arm. Then his eyes open. His chest heaves.They just rescued an undead. An undead baby, at that.The Mayhalls live on a fairly secluded piece of land with only one other house in viewing range. The Chos are a Korean family who had moved out west with dreams of farming, only to fall back on a mechanic business. The Chos have a 5-year old son, Kwang, and shortly after meeting John, the two become inseparable. Stony - the name given to him by Kwang - grows as Kwang grows. He ages he Kwang ages.Despite being taken into a loving family, a series of extremely strict rules have been set in place for Stony. He's never allowed outside, he is never to walk past the windows, any friends (and as they grow, boyfriends) of his sisters are never allowed over, and school is completely out of the question. Instead, Mrs. Cho homeschools Stony and later he educates himself with the aid of his sisters' textbooks.For the first time in his life, Stony felt it. It ran like a hot wire, up from his spine, to the base of his skull. His mouth opened on its own.He wanted to bite. He wanted to bite hard.With each page, I grew to care more and more for Stony. He's not the quintessential zombie that everyone immediately thinks of: moaning, shambling along oh-so-slowly, viciously attacking any living being. However, in a sense, he is: super-human strength, no pain whatsoever, he requires no sleep or food, physical exercise doesn't tire him. He is virtually indestructible.Seeing things through Stony's eyes, knowing his thoughts and feelings, it's easy to forget that, technically, he is a monster. Mr. Gregory is wonderful at allowing the reader to settle into a period of comfort, only to bring to light the horror of the situation. And what a quiet horror it is. It silently sneaks up on you, greeting you around the corner. The climax was so eloquently written I felt as though I was in the middle of a zombie outbreak. I panicked when the zombies were in the stairwell. A flash of terror ripped through me with the lone zombie calmly ambling down the road while the policemen stood waiting.Stony looked up. Calhoun was staring at him, hollow-eyed. His skin was glossy, his teeth perfectly white, but his eyes were ancient and terrified. Calhoun was more afraid of death than anyone he'd ever met. While so many LDs were becoming sleepers, throwing themselves into the abyss, Calhoun was doing everything in his power to pave over it, seal it up. He was going to the stars, damn it. He was going to be immortal.I loved how the book progressed through the decades. The novel occurs between 1968 and 2011. When Stony is a teenager, something happens that changes his life forever. He lives the majority of his adult life on the run (what part isn't spent in hiding).It was this part of the book that didn't grip me as the beginning did. There are new characters involved (one still rubs me the wrong way) along with some sub-plots that weren't entirely clear. I longed for Stony to return to being a 5-year old on the farm.The mailman reached the fence, planted two hands, and vaulted over without breaking stride. The move looked so practiced that Stony wondered if he'd learned it in postal school. Advanced Canine Escape Techniques.Mr. Gregory has a deliciously wicked sense of humor. I'd never hail Raising Stony Mayhall as a comedy or as a wacky, zany story because it certainly isn't. That said, there are plenty of great one-liners and witty quips that brought a smile to my face and made me giggle.Thanks to Romero's endlessly replayed documentary of the outbreak, everyone thought the living dead shuffled around like geriatric patients. But those were the fevered dead, brain-damaged and confused, at the mercy of recalcitrant limbs jerking to their own rhythm. After the fever passed, a sane LD only had to tell the muscles to move, and they moved. Jump, and they jumped. Free will, or its compelling illusion, was restored.No zombie tale is complete without a shout-out to Night of the Living Dead. I wonder if Raising Stony Mayhall wasn't supposed to be a sequel or a spin-off of some sort. NofLD premiered October 1, 1968...which was when the original outbreak occurred in Raising Stony Mayhall. Also, NotLD takes place in Pennsylvania (in the area where I live, which is pretty awesome), and Stony discovers his birth mother was from Evans City, PA.The more I think about this, the more I wonder if this wasn't the case. And if so, this book just became all the more incredible.All LDs were going to hell in an inescapable handbasket. The graveborn said they understood more because they'd gotten closer to the other side than anyone - they had a better idea of what was spiritually at stake. The bitten LDs argued that they'd all died, and the graveborn were putting on airs.I could ramble on and on about how much I loved this book. June seemed like an odd time for release, but I suppose since Raising Stony Mayhall isn't your typical zombie novel, it wouldn't receive an expected Halloween publication date.Prior to writing this review I had a massive list of quotes and lines and entire paragraphs I loved enough to write down. Mr. Gregory's style is so effortless and beautiful. I will definitely be hunting down his other works.I highly, highly recommend Raising Stony Mayhall, even for those of you who aren't normally into zombie books (I know I'm not). You won't be disappointed!The fevered dead didn't attack animals, or invade butcher shops. They craved human meat, human and nothing but, as if taking revenge for being kicked out of their former species. The Payback Diet."}, {"userName": "[Name Redacted]", "userReviewDate": "Jun 04, 2011", "userURL": "http://www.goodreads.com/user/show/287915-name-redacted", "userReview": "Okay. It was never easy for Stony Mayhall. He was born a poor zombie child. He remembered the days, sittin' in the basement with his family, diggin' and readin' over in Iowa... (Apologies to Steve Martin)Seriously though, this is an incredible bildungsroman about a boy born dead named John \"Stony\" Mayhall who grows up in an alternate version of America in which John Romero's 1968 film was actually a documentary. For unknown reasons, the dead rise in the Eastern US, hungering for human flesh and spreading their infection by bite. The military finally puts down the living dead, but a single mother named Wanda discovers the frozen corpse of a girl in a snowstorm; the girl died clutching her dead newborn...her living dead newborn. Wanda decides to secretly raise the child alongside her three daughters, trying to keep him from learning the truth about his \"people\". What follows is quite possibly the finest zombie novel I've ever read."}, {"userName": "Mimi", "userReviewDate": "Apr 13, 2013", "userURL": "http://www.goodreads.com/user/show/2490110-mimi", "userReview": "[The zombie virus causes the infected to die a physical death while exhibiting all the classic zombie traits, like a bout of fever, mindlessness, a hunger for human flesh, and a gray skin tone. The infection is passed on through saliva entering the bloodstream. After 48 hours, the infected regain control of themselves and a majority resume whatever state of mind they were in before the infection, though there are a few who never recover. The living dead can die and be killed, but they don't feel pain or heal themselves. Though no exception to the limitations of zombies, Stony is a special case because he grows and achieves a level of body awareness that's never been seen before. He comes to understand why \"the stick\" moves and what actually makes it move.  (hide spoiler)]"}, {"userName": "Jason", "userReviewDate": "Jun 21, 2011", "userURL": "http://www.goodreads.com/user/show/2613919-jason", "userReview": "1 StarI am a fan of Daryl Gregory and highly recommend his previous novels.This books out starts out well, and for the first half of this novel is an almost sweet and tender zombie story about a boy named Stony. Cool premise, good characters, decent backstory, and a clear hurdle to clear.After that point Stony and this book turn for the worst. I absolutely hated the things that occur to Stony, the things that he brought upon himself, and the direction that the plot took. With less than 75 pages to ago I had enough and decided to stop right their.I had some interesting quotes but decided not to put them in this review.For my respect for the Author, of whom I am a fan, I leave this one by saying....not for me!!!!"}, {"userName": "Emily", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/11168164-emily", "userReview": "Ahaha, I literally just got that the title was a pun. Holy crap this was fun. It's another entry in the humanized zombies subgenre, but it was so well-seated in pop culture that it added a whole other layer of snappy fun. The book is funny and irreverent, an alternative history where The Night of the Living Dead was a documentary and the zombies now live in safe houses dodging discovery and aided by sympathetic friends and family. Absolutely enjoyable."}, {"userName": "Nicolas", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/1156136-nicolas", "userReview": "Après la premier épidémie zombie, une famille recueille un bébé zombie qui va grandir avec eux, et devenir quelqu'un ... de bien ?Je suis assez étonné par ce roman.D'abord, parce qu'il ne s'agit pas tant d'une histoire de zombie que d'une histoire de famille : Stony cherche, dans tout le roman, à protéger ses siens, et montre tout le temps l'amour qu'il a pour eux. Du coup, forcément, l'angle \"roman de zombie terrifiant\", n'est plus vraiment là où s'attend.Parce que c'est aussi un roman, une métaphore, sur la discrimination : Stony est pourchassé, et ses semblables sont abattus à vue, simplement à cause de leur état de zombie. Pire encore, dans une vision digne de Menguélé, le camp de détention de zombies est avant tout une ode à la cruauté humaine, où le sadisme stupide des gardiens n'est qu'un écho assourdi des \"expériences scientifiques\" de ce bon docteur.Tout cela est bel est bon. Qui plus est, de nombreux passages sont d'une émotion rare. Alors pourquoi est-ce que je n'arrive pas à me défaire d'une sensation diffuse de loupé ?Ca n'est certainement pas à cause des dilemnes moraux de Stony. Il se sent coupable de l'apocalypse zombie, et c'est peut-être partiellement vrai, mais pas grave du tout puisque ça entre dans le cadre fictionnel.En fait, je pense que c'est plutôt à cause de la façon dont l'auteur, à plusieurs reprises, joue avec le quatrième mur. En soi, ça n'est pas un problème. Ce qui en fait un souci, c'est qu'il n'y a pas de régularité. En fait, j'ai l'impression que ces passages sont plus des accidents qu'une volonté propre de l'auteur de faire une ellipse ou quoi que ce soit d'autre ?Ca en fait quand même un sacrément bon roman, mais peut-être pas un chef d'oeuvre. En tout cas, merci à la salle 101 qui m'a recommandé de lire cet auteur."}, {"userName": "Juan", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/6876092-juan", "userReview": "\"The dead stick moves in the wind, and believes it moves itself\"Si te digo que este es un libro de zombis, seguramente, lo primero que pensaras es \"vaya, otro más sobre zombis. Ya cansa tanto muerto viviente. Paso de leerlo\". Es una reacción normal, lo reconozco. Es tanta la avalancha mediática sobre este tema, que la mayoría de nosotros estamos ya bastante saturados. Sin embargo, te diré que si esa es la razón por la que no piensas leer este libro, te equivocas de cabo a rabo.Este no es un libro sobre muertos vivientes a la vieja usanza, es decir, no se trata de la típica historia contada a través de un héroe por accidente, que se encuentra sin querer en pleno epicentro de una horda de zombis, de la que tiene que huir a base de su ingenio innato y, por que no decirlo, grandes dosis de suerte. No, este no es ese tipo de libros (suspiro de alivio). Este libro nos pone en la piel de John Mayhall, más conocido como Stony. Y Stony no es un héroe de folletín, ni un genio, ni siquiera es un una persona corriente…es decir, si es una persona, pero muerta.Sí, lo has averiguado, Stony es un zombi. Pero no uno cualquiera. Stony nació siendo un zombi, es decir, nació \"muerto\" (ahí queda eso).Bajo esta premisa, el libro narra las aventuras de Stony Mayhall. Narración que, en la mayor parte de la novela, se realiza en primera persona. Y ahí está la gracia, ya que conocer lo que piensa un muerto viviente sobre nosotros, los humanos, es bastante curioso. Es más, conforme avance la trama te plantearás quienes son más humanos, los humanos o los no-humanos (me ha salido un trabalenguas sin querer).En cualquier caso, el libro tiene de todo, momentos de angustia, terror, humor, acción, etc. Todo narrado con una gran maestría y uso de las palabras. Vamos, uno de esos libros de los que enganchan hasta el final.Muy, pero que muy recomendable.PD.- Y gracias a todos los que me habéis recomendado este libro. Vosotros ya sabéis quienes sois :)"}, {"userName": "Jeremy", "userReviewDate": "Jul 26, 2011", "userURL": "http://www.goodreads.com/user/show/4820742-jeremy", "userReview": "I read an article about this book and was intrigued because it sounded like a story similar to what I tried (and failed) to write during National Novel Writing Month in November, 2010. I really like Gregory's idea that brain-eating zombies suffer from a horrible fever and then return to almost-normal once it passes. I also like the idea of Stony as a zombie messiah, a child born dead (or \"LD\", living dead), but so much of the book is quips and snark and references to Romero's \"documentaries\". The book starts strong, but after a while the tone becomes too wink-wink, as if the story shouldn't be taken seriously."}], "description": "In 1968, after the first zombie outbreak, Wanda Mayhall and her three young daughters discover the body of a teenage mother during a snowstorm. Wrapped in the woman’s arms is a baby, stone-cold, not breathing, and without a pulse. But then his eyes open and look up at Wanda — and he begins to move.The family hides the child — whom they name Stony — rather than turn him over to authorities that would destroy him. Against all scientific reason, the undead boy begins to grow. For years his adoptive mother and sisters manage to keep his existence a secret — until one terrifying night when Stony is forced to run and he learns that he is not the only living dead boy left in the world.", "title": "Raising Stony Mayhall", "url": "https://www.goodreads.com/book/show/9466865.Raising_Stony_Mayhall", "average": 3.84, "cover": "https://images.gr-assets.com/books/1326125621l/9466865.jpg", "reviews": 451, "authors": [{"url": "https://www.goodreads.com/author/show/1343790.Daryl_Gregory", "name": "Daryl Gregory"}], "type": ["Horror", "Horror", "Fiction", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/9466865-raising-stony-mayhall", "http://www.goodreads.com/book/show/12050537-raising-stony-mayhall", "http://www.goodreads.com/book/show/13375849-raising-stony-mayhall", "http://www.goodreads.com/book/show/33708583-l-ducation-de-stony-mayhall", "http://www.goodreads.com/book/show/32827398-spoonbenders", "http://www.goodreads.com/book/show/17910129-afterparty", "http://www.goodreads.com/book/show/3191189-pandemonium", "http://www.goodreads.com/book/show/20344877-we-are-all-completely-fine", "http://www.goodreads.com/book/show/22238192-harrison-squared", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}