{"ratings": 985, "userreviews": [{"userName": "Carol. ", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "“People keep saying I’m a bel dame, but I’m not. Haven’t been in over twenty years. I’m just a woman… And you lied to me.”Rapture defies easy explanation. It reminds me of watching a woman give birth, or or revenge sex, or even–dare I say it–of my current musical obsession, Disturbed’s acoustical version of The Sound of Silence. There is something that is simultaneously brutal, messy, fundamental and life-affirming that cuts to the core.After the events of Infidel: Bel Dame Apocrypha, Nyx has retired to the coast, hidden in a house with Anneke and her brood of children. It’s a life of sorts, although she still isn’t able to avoid an occasional death. One evening, a government official and familiar face comes calling with an offer to return to the bel dames, if she’ll only take this one last job. It is a premise familiar to anyone familiar with retired heroes, but this is Nasheenian, and every offer comes with an implied threat: Nyx knows the only route to safety–and not even a sure one at that–is a scorched-earth policy.“Nyx went upstairs. Opened the bedroom door. There sat her lover, Radeyah, sketching the view of the sea from the balcony on a foolishly expensive slide that devoured each stroke. She was joyously lit up in that moment like a woman at peace with God.”With her usual complex ambiguity, Nyx continues to deny sentiment and tenderness while committing unrelenting brutality to protect it. Hurley always does something amazing with character, and I found myself sympathizing with almost everyone at times. Three people from God's War  (my review) return and are followed in three seemingly separate story lines, There’s an additional appearance by a nameless, deadly woman who brings in a scene of awkward foreshadowing. For most of the book, the three attempt to manage their own issues; Rhys, managing a hardscrabble existance; Inaya leading shifter revolution; and Nyx’s mission to retrieve a certain man. It takes most of the book before they are fully woven together.“‘You don’t have to kill everyone.’ She enjoyed bickering for bickering’s sake, like a child. He was nearly twenty-one now, and her shrill, seventeen-year-old fury felt like something half-remembered from a lifetime ago.”Interestingly, though the final (?) book in the trilogy, the world of Umayma continues to be developed, held up and angled so that we meet the Drucians, and see The Wall at the end of the desert (which reminded me too much of LeGuin) and lingering First Family/intergalactic politics. The politics didn’t feel as organically brought in, largely feeling unfinished. I don’t doubt that there is a coherent background conception as much as I mistrust that they are conveyed to the reader in a cohesive fashion. The politics this time are something else, and while they incite the mission, they play a massive role in the ending. It feels a bit uneven and rough.It it an amazing story, but suffers at times from uneven pacing. That didn’t stop me from reading, however, and it won’t stop me from re-reading. Or from becoming a Patreon for Hurley’s work, because, wow: it wallows in all the messy, organic body fluids of humanity while struggling to keep an eye on God.“They were the ones who’d done what she hadn’t, and what most living folks never would–they lost their limbs, their skins, their sanity to take a burst or a bullet for a friend, for a squad, to save a mission. Those were the ones she worried about most. The heroes. Heroes were unpredictable.“"}, {"userName": "Bradley", "userReviewDate": "Dec 24, 2015", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Do you like meat grinders?I won't lie. This is a difficult book to read. It's not so much filled with blood, guts, and bugs, (although it has plenty,) but it's the omnipresent oppressive machine of this world that grinds everyone down into so much pulpy protein.As a SF, Hurley's work is very, very imaginative and rich, never resting on old ideas to pump out new stories.She steadfastly brings in some of the most promising and far-reaching and immediate settings, and they're so damn real that I swear I have to reset my filter... a bunch of locusts keep messing with my hair.Most impressively, though, is the devotion Hurley has to tackling all the deepest and darkest niches of our everyday lives, including family vs duty, team vs self, religion vs reality, hard choices vs sanity, and most importantly, it's a never-ending discussion about what comes after love and loss. Of course, the same thing could be said about the whole world, here, but its the individual characters who suffer, and by god, everyone suffers.The fleeting moments of happiness are few and in general the tone is always one of stoic acceptance, so we don't absolutely have to roll in all the excised organs, tongues replaced with a symbiotic bugs, or the fact that every gift comes with three or four fatal strings attached. But they do.God, these are very oppressive books. Impressive, and gorgeous in their way, with amazingly deep character studies and worldbuilding, but these novels are definitely not easy. (The writing is fine. I'm only referring to the subject matter.)I can respect this one along with the other two in the series, but I must confess, it's almost too much for me. Idea speculation is the trade of SF, but there's two sides to it. There's the question and there's the answer. Putting all these idea elements together into a novel and then offering up this world makes a wonderfully complex stew, but the only thing I take away is that life is hard and things are complex.In other words, this is a reflection of real life.Okay, so I don't live being beset by aliens in a war-ground with shapeshifters and magicians with everyone around me mired in the fallout of a holy war, but the similarities are everywhere, regardless.It takes a grand imagination to pull that off.But here's where I find issue with it: Perhaps I didn't want to be shown a world hopelessly tied up in its crazy with no real solution. Character studies don't need solutions, but more often than not, a world-building SF generally gives us some sort of drastic change in the setting. (Something more than a shapeshifter revolution or a resumption of civil war. All of that has been practically the norm. I keep thinking of a real resolution that's unusual for these people. Like prosperity. Like real peace. As it is, I just feel sad for them.) *sigh*Still, it was a very impressive ride."}, {"userName": "Roy", "userReviewDate": "Nov 01, 2017", "userURL": "http://www.goodreads.com/user/show/38117634-roy", "userReview": "A few years have passed and Nyx is back at it again. One of my favourite characters ever written. Just so cool, perfect amount of action and great plotting. This wasnt as good as books 1 and 2, felt like it was needing an ending, but little too forced. Dont think there's any plans to re-visit this world, but from these 3 novels, it requires a larger audience."}, {"userName": "Helen", "userReviewDate": "Nov 08, 2015", "userURL": "http://www.goodreads.com/user/show/314287-helen", "userReview": "I really enjoyed this, I think it's my favourite Nyx book.Okay, there are oodles of bugs; in the ear, head, ground... heck everywhere. Wait to see what happens to dead people, ew. We have never had a history of the world, moons or the innate biology and having finished I've discovered that I'd like this. Particularly of the early settlement.Nyx is living peacefully, in a family set up. She has mellowed, found reason for life, retired to all intents and purposes. Sadly, this is the reason she returns to work. So, new crew, new mission, new geography. Of course, previous characters return and have their own adventures. Death, torture, betrayal are once again themes. One death took me by surprise, to the point where it was over before I'd accepted that it had happened. Sob. I feel the book ends in a satisfactorily upbeat manner. Various survivors continue with their lives, their goals. As for Nyx, well read the book and see for yourself."}, {"userName": "Joseph", "userReviewDate": "Feb 04, 2015", "userURL": "http://www.goodreads.com/user/show/5004971-joseph", "userReview": "And it's been another good few years since the events of Infidel and the years have been even less kind to Nyx. Although as things begin, she's settled into a sort of semi-retirement on the coast.But we're not here to read 400 pages about her peaceful post-bounty-hunting existence, so she gets offered one more job that she can't refuse (or at least that she doesn't refuse, although she might've wanted to). And then she leads a new team (with one or two familiar faces) on an even more brutal journey than we've seen before.Separately, Rhys and Inaya from previous books are experiencing their own unravelings and setting off down paths that will eventually cross with Nyx's in unexpected ways at unexpected points.This was not a fun book -- the world is grim and bad things happen to people who don't deserve them. (And, occasionally, to people who do deserve them.) But it was a compelling one that showed more of the world than we'd seen before, and even started to unveil some of the history of how people ended up in such a messed-up environment to begin with."}, {"userName": "Ranting Dragon", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/4367400-ranting-dragon", "userReview": "http://www.rantingdragon.com/review-o...It has been two years since Kameron Hurley shocked the science fiction community with her debut novel God’s War. Now, Hurley’s blood-soaked trilogy has come to an end with the novel, Rapture. Does Hurley end the trilogy with a flourish or a whimper? The answer cannot easily be heard under the rousing applause that Rapture deserves. Rapture is one of those rare beasts of a novel that marries together beautifully gritty characters, soul-stirring moral implications, and a complex world.With a quaint ocean-side home, a doting lover, and a gaggle of kids to look after, Nyx thought she had finally found peace. But with all the blood that Nyx has spilt, she should have known that running away would not be that easy. The Bel Dames, a group of government assassins, have convinced her to come out of retirement and take on one more bounty. Nyx knows that she cannot do this bounty alone, so she hires a cadre of shifty mercenaries to help her. In the shadows of Nyx’s journey, revolutions are brewing and peace is on a knife’s edge.The characters come full circleIt has been a long and brutal journey for Nyx and her cohorts. Every friend killed and every corpse burned has taken a tremendous emotional and physical toll on the cast. Rapture is when each character must answer for both their triumphs and their follies; they cannot simply sweep their actions under the rug. The internal struggles the main characters have to go through elevate this novel above mere fiction into something we can all learn from, with the message of the past coming back to haunt you ringing true. Sometimes, when you mess up, there is not redemption waiting on your doorstop or a shoulder to cry on because you forsook it years ago.Upheaving expectationsOne of the most enthralling things about Rapture—and the entire Bel Dame Apocrypha trilogy—is how adroitly Hurley lays bare our own societal norms and expectations. All of the current hot-button issues are on transparent display here: same-gender relationships, female sexuality, religion, and morality. Although Hurley seems be on the liberal half of the political spectrum, she is more than willing to show both sides of the argument. Of course, this may ruffle a few readers’ literary feathers because she includes both the good and the bad. This is part of what makes Rapture such an engaging novel—it forces the reader to be uncomfortable with its fearsome honesty. It forces us to reevaluate our thoughts on various issues, regardless of which section of the sociopolitical spectrum we call home.Those sure are a lot of viewpointsThere is something to be said about being too ambitious. In this case, Rapture sports a rather large cast of point-of-view characters for a fairly slim novel. For the most part, this lengthy POV list is not bothersome when it comes to the returning cast, as they are already nicely developed from the previous novels. It becomes a hindrance instead with the new characters introduced in Rapture. Overall, the new characters are well-developed but at many times are their motivations muddled—and some characters just seem like walking plot conveniences.Why should you read this book?Novels like Rapture only come every once in a while, piercing through readers’ corporeal forms and straight into their souls. That being said, Rapture, and the entire Bel Dame Apocrypha trilogy, is not for everyone. Its brutal slant on multiple subjects may rub some readers the wrong way, its cast is not likeable in the heroic sense, nor is there much closure. But for those who want to be challenged by the novels they read, I implore you to look no further than Rapture."}, {"userName": "Jason", "userReviewDate": "Jul 04, 2014", "userURL": "http://www.goodreads.com/user/show/2613919-jason", "userReview": "4 StarsRapture, the final book of the Bel Dame Apocrypha is a good concluding story to a remarkable series. I had problems with this book, and it is the weakest of the three books. There are far too many POV’s in this read and there is little pay off in it. Couple this with the fact that the first two books did not share this problem, it really stood out. This third book had the least amount of character development excluding Eshe. It had far less bugs, less, magic, and less action over all. That is not saying that this isn't a dark read. It goes places that the first two books did not even go and that will put many people off.Kameron Hurley has created a brave, raw, dirty, and totally amazing world. Nyx is an incredible protagonist that is unforgettable, I am just not sure that anyone would actually want to meet her. But I love that this series is lead by a scary older woman that was easy to believe in.I highly recommend this book to fantasy readers looking for something fresh. Those that like the dark reads and the antiheroes will love Nyx and this series. Some of the YA crowd might like this, but there is no storybook fairytale to be gaga over here.Brave, Bold, and filled with Bugs!!!!!!"}, {"userName": "Jacqie", "userReviewDate": "Mar 01, 2013", "userURL": "http://www.goodreads.com/user/show/2133111-jacqie", "userReview": "First, I'm annoyed that it's so hard to find this book in an initial search on Goodreads or Amazon. I had to look by author- title wouldn't find it. Bad.This is (I think) the last book in the Bel Dame Apocrypha series. What I continue to like most about all the books is the character of Nyx. She's so ruthless, so brutally pragmatic, so good at hiding from everyone, including herself, that she actually cares if people live or die. Nyx usually gets the job done in a spectacularly ugly way, but she just doggedly keeps going. Kind of like she did in the desert for probably too long in this book. I think the book suffered from some pacing flaws- the desert bit went on a bit long and I couldn't figure out why Nyx would allow her party to keep trudging along with an obviously insane and compromised person for a guide. By the time they reached the other side, I was having a problem orienting myself, or getting a clear visual of where the characters were. There was no map in any of the books, and I didn't miss one until Rapture. I also never really understood what was up with the red women. The book also does a retread of previous themes: Nyx hooks up with a new crew and proceeds to get them into situations when people are going to go down and not get up. It was harder for me to emotionally invest in the crew this time around, although Nyx still seemed to care about them. The only two characters that recur to any great extent are Rhys and Inaya, and I never really cared for either of those two much, although Rhys does a better job of explaining himself in this book. Inaya still comes across as naive and rigid. I may the the only person who's a fan of Khos, but I feel like he got the short end of the stick in this series. The gray goo was pretty cool, though. And I did like the ending. And the revelation of a bit more of Umayma's history. I'm sure there are a lot of good stories left in how this world was colonized and how its belief systems and cultures developed."}, {"userName": "Alexandra", "userReviewDate": "Oct 20, 2012", "userURL": "http://www.goodreads.com/user/show/4780341-alexandra", "userReview": "[and here's a slight spoiler, sorry, but if you've read the other two this is important - they're also outshone by Rhys. Yes, Rhys is here again, in a very surprising - for both himself and Nyx - twist. And that relationship is so fraught, so difficult, so sad and so bitter and so frustrating, that anything else rather pales.  (hide spoiler)]"}, {"userName": "Terence", "userReviewDate": "Jul 02, 2012", "userURL": "http://www.goodreads.com/user/show/1019174-terence", "userReview": "Rating for this book: 3.75+; rating for the series overall: 3.5_____________________________After a relatively lackluster second volume in the Bel Dame Apocrypha series, Kameron Hurley comes roaring back with Rapture. Seven years have passed since the events of Infidel, and Nyxnissa so Dasheem is in exile in Drucia, where she lives with her former comrade Anneka and her family. The situation in Nasheen has continued to deteriorate in the meanwhile: The centuries-long war with Chenja is over, and the boys – the fodder the bel dames and First Families have been sacrificing for all this time – are returning home and becoming a disruptive element that threatens to push Nasheen into outright civil war. Raine, Nyx’s erstwhile instructor, enemy and a man she had left for dead, survived and has become the leader in the fight for men’s rights. When he’s kidnapped, Fatima – another old foe, the murderer of Rhys’ family and bel dame leader – extorts Nyx’s aid in tracking him down and bringing him back to Nasheen. Obviously, things cannot be as straightforward as this, and Nyx rapidly finds herself enmeshed not alone in the machinations of the bel dames, the Queen and the First Families, but also those of the Ras Tiegans, the civilizations of the North and a larger cabal of First Families that revives an ancient conjuror to ensure the “aliens,” who have returned, do not gain a foothold on Umayma.This thing that makes Rapture such a good read and a very satisfying conclusion to the story is Hurley’s decision to focus almost exclusively on Nyxnissa, who is the heart and soul of the series. Looking back, the weakness of Infidel was that the author introduced too many new characters and their subplots that either didn’t go anywhere or distracted the reader from Nyx. Here, we have brief discursions into what Rhys and Inaya are doing but everything properly comes back to Nyx, who is one of the more interesting characters I’ve encountered in a while.Why? I have been wondering how to answer that question since I don’t like to leave readers hanging with sentences like the one above, so let me enumerate several of the reasons:1. Nyx feels very human. That is to say, her motivations are complex, conflicted and not always obvious to herself or to us2. She’s indomitable. Despite failing – as she see’s it – in everything she’s done, she doesn’t give up.3. She has at her core an admirable nature (part of which, IMO, is #2). You have to admire her devotion to what she see’s as her duty, to her companions (though they often misinterpret it), and to her ability to cling to her humanity in the face of all the shit (pardon my French) that’s thrown her way.Another factor in the novel’s favor is that Hurley continues to open up the world of Umayma without info-dumping. We are tantalized with more clues about Umayma’s colonization and its earliest history, the nature of humans and their relationship to the bugs, and the reasons behind Umayma’s xenophobia.And – finally – I liked the ending’s ambiguity, which immediately brings to mind Frank Stockton’s short story “The Lady or the Tiger.”A vigorous thumbs-up for this book and the entire Bel Dame Apocrypha series. I fervently hope Hurley continues to write in this universe (as well as branching out; I’d be interested in reading anything she writes)."}, {"userName": "Burgoo", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/5108047-burgoo", "userReview": "By now you should know what to expect from the Bel Dame Apocrypha. Bugs. Blood. Betrayal. Success that feels more like failure.In Rapture, former bel dame Nyx is forced out of retirement in order to do one last job. This time, she has to retrieve a political leader & bring him back to Nasheen alive. As luck would have it, it happens to be someone she thought she had already killed. Her journey to retrieve this man takes her beyond the edges of civilization.Hurley builds upon the strengths of her earlier novels. The world building, the characterizations, the tense action sequences are all here & even more developed than in the earlier novels. The main complaint about the earlier novels was the plotting. Here Hurley manages several seemingly unconnected storylines that ultimately join in to complete the story. With the conclusion of the Bel Dame Apocrypha, Hurley may have written the best SF series of the new millennium. If one purpose of speculative fiction is to reflect and comment on present existence, few series tackle the problems of modern life in such an unflinching manner. Examining violence, religious intolerance, sexism and gender roles, and environmental collapse, Hurley deals with the significant issues of our time."}, {"userName": "Jen", "userReviewDate": "Oct 20, 2012", "userURL": "http://www.goodreads.com/user/show/4740555-jen", "userReview": "Rapture is the third and final book in the Bel Dame Apocrypha. Is it everything we could have hoped for? Does it answer all of our questions? Does it close out the story of Nyx with a gigantic bang? Welllll....not exactly. But it's awfully good all the same. We find Nyx living in exile with an old mercenary buddy and her thirteen thirteen-year-olds. She's recruited for a special mission that even the bel dames can't be trusted with; rescue her old boss, Raine, from kidnappers who have taken him far north into the tractless desert. Trouble is, the last time Nyx saw Raine, she stuck a sword in him and left him for dead. And there are plenty of other complications, from the moony sixteen-year-old rich girl that follows one of her team members all the way from Ras Tieg to the red sand that comes to life when it smells blood and can strip the flesh from a body in under fifteen seconds. There's also the matter of the extremely deadly assassin on her tail, and the fifteen-foot centipedes that have this annoying habit of leaping out of sand dunes at inopportune moments. And those are just the minor problems.Rapture suffers, oddly enough, from an overload of narrators. There are so many I had trouble keeping them straight. The many interweaving story lines do eventually come together in a huge and satisfying way, but by the time we get there we've lost one of the most interesting narrators (yes, she does show back up and surprise us, but where was she for half the book?) and another one has just stopped talking, though he continues to exist in someone else's narration. Is this fatal? No, just annoying, but annoying enough to be noticed, and anything annoying enough to be noticed is annoying enough to push me out of the story, which is also annoying. So I'm giving it a one-star deduction. But that shouldn't stop you from running right out to buy it as soon as it's released, because it's still a great read."}, {"userName": "Matt Brady", "userReviewDate": "Aug 19, 2014", "userURL": "http://www.goodreads.com/user/show/7881793-matt-brady", "userReview": "This was my least favourite book of the series. In many ways it's also the most straightforward. The previous two books in the series had labrynthine plots filled with double- and triple-crosses, sudden reveals, betrayals, surprises, so much so that I found it pretty hard to follow what was actually going on. Rapture is much simpler. It also felt a bit repetitive, especially some of the character beats. They're done well, particularly the relationship between Nyx and Rhys, but it was covering a lot of the same ground as the previous book. The big climax also felt a little rushed and anti-climactic, especially given the lengthy journey to get there. As in the previous two books, Kameron Hurley gets right into it, all with the show don't tell, and while I appreciate that I think all three books could maybe do with a little more exposition, which isn't something I say a lot. There's so much going on and Hurley's commitment to only telling the story through the eyes of her characters is admirable, but also leads to more than a little confusion.The world remains fascinating. In Umayna, Hurley ha created a fascinating place, a planet filled with deadly toxins and ravenous bugs, an alien world barely fit for the human civilizations that have managed to survive and thrive. A nice setting for gritty, cynical war stories."}, {"userName": "Silvana", "userReviewDate": "Feb 10, 2016", "userURL": "http://www.goodreads.com/user/show/666003-silvana", "userReview": "3.5 stars. Hurley's Bel Dame Apocrypha is one of the most visceral series I've ever read. Although this last novel suffers from too many POVs and tiring travelogue, it still stirs emotion. We have three old POVs and a few new ones, which sadly mostly serve as plot conviniences despite having interesting back stories and/or motivations. Nevertheless, I do appreciate the ending between Nyx and Rhys - kudos for Hurley. Note for authors: there are times to halt your worldbuilding. Am I the only one who found it hard keeping up with the ocean people and the wildling... I mean the people beyond the Wall...Aadhya or whoever they are? I like the additional back story on Umayma, colonies and so on, but getting all these new people was rather overwhelming. Should have stick with the Nasheen-Chenja-Ras Tieg-Bel Dame-First Families-aliens power play. All in all, still one of the best if not unique series I've ever read. It is gutsy, gritty, mindblowing and simply, brave."}, {"userName": "Kam", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/5399361-kam", "userReview": "[She initially shows up as a nameless character who's been in deep-freeze (or the Umayman equivalent of deep-freeze), and who's been brought back to deal with the issue of the aliens from New Kinaan, who were first introduced in God's War. She meets up with Nyx and her team later on in the plot, and since their goals overlap, she comes along for the ride. While I do find her intriguing - not least because she opens up so many other questions about Umayma and how it works - I was rather concerned about the fact that she became almost a deus ex machina for the story. The thing is, though, Hurley's proven she's too skilled a writer to create a character whose sole purpose is to be deus ex machina, which means that there is definitely something I'm missing about the way she's characterized. I understand that she's mysterious and powerful, and her motives are almost the same as Nyx's, but not quite. I also know that she bears an enormous grudge against certain people, a grudge which drives her to pretty much shatter the bel dames at the end of the novel. But somehow, all the layers of mystery wrapped around her - not to mention the fact that there is no truly deep insight into her character - makes her feel more like a means to an end. Hopefully Hurley will write more books set in Umayma, and have Safiyah appear in them, or even make her the main character, because she's a character with too much potential to be wasted. (hide spoiler)]"}, {"userName": "Katy", "userReviewDate": "Nov 02, 2012", "userURL": "http://www.goodreads.com/user/show/5552109-katy", "userReview": "Book Info: Genre: Dark fiction/Science FantasyReading Level: AdultRecommended for: Fans of dark fiction, especially of the science-fantasy type, intricate world-buildingTrigger Warnings: murder, violence, torture, attempted genocideMy Thoughts: In this book, the world of Umayma really opens up, and we find out a lot more about the countries mentioned in the previous books, as well as many countries and peoples that are new to both us and to the characters in the book, such as Kiranmey, by the Wall at the northern end of the desert. In an earlier review I said it looked like the planet generally followed a form of Islam, but that was a generalization based upon a few statements like, “We all follow the same God.” As I learn more about the different peoples, however, it looks like Nasheen, Chenja and Tirhan have a form of Islam, while Mhoria might be a form of Judaism, and Ras Tieg sounds like it is Catholicism. Drucians show up in this book, and I'm suspecting they aren't human, or at least not the same type of human as the rest of the world, but there is no information about their religious beliefs other than that they worship multiple gods, and the desert nomads, Kharians (I think; it's hard to keep track of all of them) have some mysterious and pagan sort of belief where it is hinted they worship wind and sand. The Mhorians segregate the genders to the point that M/M relationships are not only acknowledged, but preferred, and the Nasheenians tend to prefer F/F relationships and have a lot of disdain for men. Tirhan allows up to 4 wives per man, and the desert nomads and Drucians allow multiple husbands (or at least two). It's amazing to see this sort of variety; I'm not aware of any modern society that allows multiple husbands on Earth, although I believe some of the African tribes once did something like this. To make it even more interesting, people on this world have evolved a form of magic dealing with insects and others have developed a form of shape-shifting; mostly into a single other creature, but in some extremely rare cases they are not limited at all and can shape-shift into anything, while other people have mutated in different ways. Basically, reading this series and figuring out the different peoples is like a particularly fascinating anthropology project. And you really do need to read the whole series before you even begin to have a feeling for the world outside of Chenja and Neeshan; that information is provided in dribs and drabs throughout the series, but more is given in this third book than in the first two combined. I would love to learn more about this world and its peoples; I wonder if the author could be enticed to write a sort of atlas of Umayma? That would be really cool, and I would definitely buy it. If nothing else, I do hope the series continues, because I'm sure there is a great deal yet to learn about this world. Maybe some prequels, or move on to other characters, unless Nyx is somehow re-made, because she's becoming pretty old for these types of things. Of course (speaking of age), apparently First Families can lives for centuries; one character mentions an “older” man and then later recognizes him as her great-grandfather's brother! Some of the details that come out regarding the First Families and how the world was settled are fascinating tidbits; again, I would love to know more.At any rate, it's a pity that the problems that Night Shade is experiencing is putting the future of this series in jeopardy, because it is a really good one. I do hope the author will find a way to continue it, I really do. There is so much more to learn about this world, these people, and how it all fits together. Nyx may be retired, but there are other characters, and other stories to be told. I have seen the quality of these books improve with each story, and it is just now, in the third book, that the whole series is really coming into its own. Highly recommended for fans of dark fiction, well-crafted science-fantasy stories, and intricate world-building.Series Information: Rapture is the third book in the Bel Dame Apocrypha (also sometimes called the God's War series). There is no word on whether the series will continue or whether this is the end of it.Book 1: God's War, review linked here where formatting allowedBook 2: Infidel, review linked here where formatting allowed Disclosure: I received an e-galley from Night Shade Books via NetGalley in exchange for an honest review. All opinions are my own.Synopsis: After years in exile, Nyxnissa so Dasheem is back in action in service to the bel dames, a sisterhood of elite government assassins tasked with eliminating deserters and traitors. The end of a centuries-long holy war between her country, Nasheen, and neighboring Chenja has flooded the streets of Nasheen with unemployed—and unemployable—soldiers whose frustrations have brought the nation to the brink of civil war.Not everyone likes this tenuous and unpredictable \"peace,\" however, and somebody has kidnapped a key politician whose death could trigger a bloody government takeover. With aliens in the sky and revolution on the ground, Nyx assembles a team of mad magicians, torturers,and mutant shape-shifters for an epic journey across a flesh-eating desert in search of a man she's not actually supposed to kill.Trouble is, killing is the only thing Nyx is good at. And she already left this man to die..."}, {"userName": "Tom Whalley", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/7547216-tom-whalley", "userReview": "You know, this Bel Dame Apocrypha series has been one hell of a messy, dirty, split-lip, bruised knuckles journey. It's well worth it.Aight, says Tom, with a crack of his knuckles. Let's do this.God's War set the stage for an utterly unique, horrifying world. It began with Nyxnissa so Dasheem, Bel Dame assassin, drinking whiskey hours after selling her womb. Not in a metaphorical 'carry someone's child' way, but a 'her internal stitches are tearing and she doesn't care' way. She went to a boxing match, went home with one of the fighters, and we readers realized this was a book set on a matriarchal Islamic planet, full of magical insects and LGBT themes. It amazed the hell out of us, surprised us, and made each and every one of us amazed at how well Kameron Hurley can write outsiders. Seriously; every single character is either too gay, too straight, too religious, not religious enough, or in some other way, an outsider to their society. Then Nyx murdered a bunch of people and alienated her friends and left us all feeling kind of hollow, because it's that kind of book. That kind of series. The kind where you're scared and alone and can't stop staring at the horror, because to ignore the smell of decay is to let the infection spread.Infidel followed up and really reiterated the utter desolation present in the Bel Dame Apocrypha series. Ironic, really, that the book that features a lush, overgrown, terrifying forest could be the one that feels like death. Set several years after God's War, we see that Nyx is somewhat of a cancer and that her whole crew is better off without her. This is accentuated as, slowly but surely, they're all forced to join her in another violent mission. If the first book was about being an outsider, this book was about obsession and infection. Nyx has caught some unknown illness, and as she breaks down, we see the ties of her relationships decay and corrupt. Everybody suffers.But the real beauty behind this book, if you can call it beauty, is the way Hurley writes as a woman who has gone through some serious shit. There's guns, and punching, and murders, and she writes the violence to feel female. Wounds are wet gashes of pain, characters cramp and break, and a character being on her period is actually important. If God's War was a five star book, Infidel is a six. Everything is better, everything is heavier, everything is worth more and losses are greater. God's War is one of my favorite debut genre novels of all time. Infidel is a sequel that somehow raises the stakes and the quality across every level.To say Rapture isn't as good as either is hardly damning. It's not as good, in the way that a brand new BMW is not as fast as a Ferrari or a Lamborghini. Nyx is still as dark, Rhys is still as standoffish, the world is still violent and disgusting. All the elements are there.There's just no growth. Not like in the first two novels.In Rapture, Nyxnissa is older. She's retired (exile can also be retired, right?), found a nice girl, and is spending her life in secret, simple solitude. Hell, the war, the centuries-old forgotten-how-it-started war is over, and boys are returning to the cities and towns and, hell, regular life. It's plain, it's simple, and it's closer to a happy ending than Nyx thought she'd ever get. Then someone tracks her down, offers her a job, and everything goes to hell, because Nyx can't say no to violence, not even if she tries.I think that ending a series like this with a more personal, tired touch to the writing was a good idea, even if it was less exciting to read. Nyx's reflexes are slower, she's weaker, and everyone's a little bit over their place in the first two novels. Reading a book about an older female badass is so unique and fantastic, I can't believe I've never done it before.The problem is, there's too many viewpoints. Kameron Hurley wanted to write a book about the whole world, and in doing so, left character development spread a bit too thin. It just... look, I want you to read this book and this series so bad that I'm not going to go into this too much at all. There's too many people to cover to read a more personal viewpoint in this many pages, and this is a book that begs for a more personal viewpoint. It's about endings; the war, the friendships, the job, lives, everything. Rapture is a mostly satisfying coda to one of the most darkly imaginative SF/F series that I've ever read. If it feels mostly like more of the same, remember that there's only three novels in the world like this. Try to clamor for more of this kind of same. If I have one solid criticism, it's that this series will never be a movie, or a TV show, or a videogame, or anything visual, because we don't live in a world where a studio will spend money on a sci-fi action series starring a plain older brown bisexual woman. That's not a problem with this series. It's a problem with the world. The Bel Dame Apocrypha is incredible, and I'll be a lifelong Kameron Hurley fan because of it, even if she never reaches these heights again."}, {"userName": "Lance", "userReviewDate": "Mar 19, 2018", "userURL": "http://www.goodreads.com/user/show/46538050-lance", "userReview": "\"In the garish light of the moons, the desert was a bloody carcass shot through with wind-worn splinters of stone that predated the beginning of the world.\"\"It was strange to find a world on the other side of the one you knew, one you never knew existed.\"No book has had me this captivated for a long time. Not this year. I was ravenously hungry for the next sentence for hundreds of pages on end, biting back tears whilst simultaneously feeling the characters' dehydration headaches as if I was out in the desert with them. The plot may be chaotic, but when the world is this full, this vivacious, giving off the feeling that it will go on for eternity in some galaxy beyond our imaginations long after the series is finished, who cares about such a minor detail as plot?The premise is as convoluted a mire of treachery and politics as ever. \"'Nasheen is on the brink of revolution. There are discharged boys with nothing to do but start fights and steal bread. Women are running raids on their own into Chenja in defiance of the ceasefire. The bel dames, I have never seen them so hostile to their own people. The streets are bloody. Bloodier than I've seen them.'\" A ceasefire between Nasheen and Chenja has been declared, and an entire gender of surplus militant men is flooding into Nasheen again. Hurley's militant state in which every sixteen year old boy goes into military service for forty years is grazes the reality of war-torn regions in our world with frightening realism. \"Most boys she knew who got shoved home without proper decompression blew right the fuck up. They jumped off bridges or walked naked into deserts or picked off people in the market with some patched-together weapon.\" In Nasheen, war has become an industry, a way of life. Neither men nor women are emotionally or economically equipped to support the extra bodies that the peace will keep alive. The problem is so bad, that the bel dame assassins (formerly an almost unkillable order of women tasked with disposing of deserters, nakedly lusting after power now that all deserters have been pardoner) bring Nyx out of retirement. \"Seven years. She thought she might just die out here, forgotten, presumed dead.\" She is tasked with returning political prisoner and men's advocate Raine al Alharazed to Nasheen alive before his death causes a revolution. \"'No, we'll have no martyrs here.'\" Nyx has been exiled for seven years since the end of Infidel, stayed away from the news, quietly waiting to find out when she was needed again. \"Nyx found the idea that these vagrant squatters now had full independent personhood and voting rights rather appalling.\" And in a world where a nation of shell-shocked soldiers are demanding their civil rights, it was only a matter of time. Hurley deals with the restrictive cultural norms of this military society with eloquence. \"'We've been second class in Nasheen for centuries, fodder for an endless war. We want equality, Nyx. That's all.' 'Equality. You want to spend two years of your life a breeding compound? You want to be a vessel for twenty babies, just to watch them all get carted off to the front to get blown up in some war? Then you want to give up another two years at the front, throwing your body against munitions with the boys? We're just caretakers for the fodder, Raine, when we're not the fodder. We all give our bodies to Nasheen. You're not special. You keep going on about how you want to change things for men. Men at the expense of women. You need to change the whole system to be free, not just improve your part in it.'\" This sentiment could apply to any society: unfair treatment for one subpopulation means that everyone is compromised, not just those with the newest complaint. The next time I hear male students whining about how girls do better in school exams because they mature faster, or that stopping discrimination against young women who may go on maternity leave hurts male-led family businesses, I will throw this at them. This might just be my quote of the year. In the name of men's equality, Nyx and her team engage the real challenge of this book. The red desert. The survival sections were so riveting, so visceral, that each step of the journey engaged my full attention. I felt as if there was nothing beyond that stretch of sand. \"Atishi bulaka was one of the first foreign terms he had learned when coming to the north. It referred to the flesh-eating sand, the sand that burrowed into wounds to devour the blood within, leaving behind a gutted deflated corpse.\" In a literal invocation of resource poverty, the microbes within the sand can, and do, devour people. \"'They walled themselves in with this contagion millennia ago. I suppose it worked. The world could have been much worse, you see. It could have all been like this.'\" As if the starvation, dehydration, and hallucinations weren't enough. \"'What the world really wants to do is change us to fit it'\" Hurley's style is vividly perceptual. Everything is narrated using the body of the reader as it medium. She makes you feel as if you are there. \"She was in that bad place that you knew was bad but you were so fucking out of it you didn't care. It was a cosy place to be in\" Through it all, Nyx is \"like a stone pillar in a sandstorm\". She is fucking hard. \"Then she was up again. How, she wasn't so sure. One minute, she was on the ground, and when she came to the next, she was walking again, plodding forwards like some half-dead cancerous wanderer.\" I ached with admiration and jealousy as well as physical discomfort reading these passages. I never wanted the desert to end.In contrast to Nyx's dogged psychological resilience, there are the intriguing satellites of her new team. They all felt real, with just the right balance of untold secrets and detailed background to really come to life. Ahmed provides the missing point of view of the recruit from the front. \"It was never anything but that - boy. Not patron. Nor sir. Just ... boy. As if he had walked off his house mother's doorstep just yesterday.\" Instead of a triumphant return, he is uprooted in his birth nation, as if his real home was the war itself. \"the man he was at the front no longer existed.\" Ex-torturer Ahmed is coolly manipulative and offers a rare male take on the calculated use of sex appeal to control power. \"His calm way with each member of her team, building alliances for the inevitable showdown.\" Then there's Kage, the Drucian sniper exiled from her tiny cavernous nation for the heart-rending reason that her children died of asphyxia as she tried to keep them quiet whilst hiding them during a raid. \"They were young people, always, and they laughed as they did it, as if it were some adolescent rite of passage, to murder Drucians in their homes.\" One of the most recent races to colonise Umyma, Kage's people have their own unique physiology resulting from long isolation from humanity. \"'I am a woman, yes, but I can also give children. It's private.'\" Her refugee nation, and her own status as an outcast among outcasts was so sad, but had me yearning for more. \"It was strange how you did realise how much you lived a place until you had lost it so completely. Everyone believed that the world outside was better. But it wasn't. It never was.\" Eshe, the young shifter Nyx has been training since he was aged eight also makes a return, dogged by a pathetic sheltered rich girl daughter of the Ras Tiegan living saint. \"Nyx secretly hoped she would die next\" I did too. The idea of a centuries-old saint sustained by the replacement organs of virgin girls is as gruesome as they come, and her daughter is supposedly destined for the same fate. Isabet is a wry commentary on the falsely won protection that those feigning weakness receive from others, highlighting the reliance of even the most privileged on desperate people.The team are tailed by Safiyah, a conjurer from Nasheen's First Families, who can manipulate the organic engines of the grounded space-ships on the planet to control living things. \"'The shape-shifters know. The places we put our bodies when we are in form.'\" She gives some great world-building, drawing together the previously unrelated anomalies of magicians and shape-shifters. \"True conjuring was about making something from nothing. Or rather, creating something dynamic from the inert soup of primordial possibilities\" And adds a bit of irony of her own. \"'You would wake me for a woman? Just a woman?'\" It turns out that great dynast occasionally bow for ordinary people too.At the end of the desert journey is Rhys. Once the self-appointed moral conscience of Nyx's team, he has withered in his own faith and nobility without the vulgar strength of his working-class and under-class colleagues to compare himself against. He has reduced himself to threating to take the children if his wife leaves him. \"'You take your right, and I will take mine. I will take the children and you will have nothing.'\" His fate creates a bitter bile at the back of my throat, seeing Rhys painfully slowly decay in the absence of anyone to look down on. \"the feeling she got when she thought of him was always the same - a fierce protectiveness that left her with anger and regret.\" In many ways, his story is the darkest part of the book. The rot and the wasted potential. The bullying and reluctance to let go of his own superiority at any cost. There is a lot to think about here. Politics. The desert. Abductions. Eventually, it will lead them back to Ras Tieg, the riven Christian country where modern fundamentalist opposition to abortion has been reimagined as a rampant purging of shifters from the population especially miscarrying female shifters. \"It was a helpless feeling, to know you could not protect the women you cared for. To know that women's bodies here were co-oped so fully and completely that they had ceased to be fully human in the eyes of the priests.\" Once conservative Inaya is now leading the underground shifter resistance group, in the hope of a peaceful revolution. \"'We must re-write our story from one of fear to one of celebration.'\" But her people cause nothing but violence. Inaya is a lot like Nyx, unable to stop fighting and accept a world rife with corruption. \"It was like a dream of a place. And the reason it existed was because the rest of the world was like this. The people there could live like that because they sent weapons to countries like hers, and dared them to tear each other apart.\" And yet she would never see it that way. She still chooses to see right and wrong in terms of absolutes, never as equally sordid possibilities, or acknowledge mistakes. \"Inaya had to choose between the Nasheenian boy shifter who had stood loyally at her side for seven years or the renegade rich girl who could win her people the revolution\" There's class and race and religion all mixed up into messy, hypocritical characters. It's stomach-turningly real politics. \"The sorry truth was, she couldn't remember the last time she'd turned in a bounty alive.\"The fate of Raine al Alharazed, Nasheen, and Ras Tieg are all interconnected by a murderous plot and the magician's space-warping tunnel system. But in many ways the plot isn't important. It's the moments. There is aching dialogue between Nyx and Eshe, as he grows from child-like devotion in her to a petulant loyalty to Isabet. \"'Do you think people can be different? Different from the way they learned to be?' 'You make who you are. It's for no one else to decide. Understand?'\" And the heart-rending scene where at the end where Nyx offers Ahmed the deed to her family home still with Eshe's name printed on a scrawled out in pen, because destroying Eshe, the young man she thought of as a son, was as crude and finite as a line on paper. There's Inaya stretching herself out across the cosmos to stop a wove of devouring sand from claiming any more lives. \"Inaya watched the world from the sky. She was all-seeing, all knowing. She wondered if this is what it felt like to be God. To see all the joy and horror at once, to pick up grains of sand one by one which a tide threatened the destruction of humanity.\" There's the empty powerless of even First Family conjurer Safiyah. \"'Sounds like an excuse to me. Sounds like something lazy rich people tell themselves to justify not doing a goddamned thing to change the world.'\" But beneath it all is the ache of loss. Searing, pointless, loss like a cauterised wound without poignancy or reflection. It feels unfinished, as all suffering is. \"Nyx wanted to shout at her, tell her that no one had given up more than she had. That was a lie, but it felt so true in that moment\" It's so ghastly it's almost beautiful in it's own way.And out across the stars, the alien arms-dealers of New Kinaan are coming back ...\"'We could have twenty years to sort out or differences before facing interstellar war.' 'What do they want? To colonise us?' 'No. To conquer us and strip us bare. There are very few habitable worlds left. It was only a matter of time before they extinguished theirs.'\"Kameron Hurley, please write more!"}, {"userName": "Antoni Comrie", "userReviewDate": "Feb 17, 2018", "userURL": "http://www.goodreads.com/user/show/20332406-antoni-comrie", "userReview": "4/5 stars.Great dark scifi story, not a superb book, it doesnt try to be, but that doesn't stop it from being great. The varied perspectives and realistic outcomes really make the story easy to get immersed in.The ending however was superb."}, {"userName": "deilann", "userReviewDate": "May 03, 2015", "userURL": "http://www.goodreads.com/user/show/35215676-deilann", "userReview": "Originally posted on my blog, SpecFic Junkie.Hnnn. <3 Rapture gave me whatever ephemeral something was missing. Less of an action ride than Infidel and more confident than God's War, Rapture brings the Bel Dame Apocrypha arc to just the right end, with everyone in their respective places.Rapture follows a lot of the same themes as the previous books, but somehow it seems grittier and true because Nyx has finally gained something besides herself she's afraid to lose. And yet, she's still completely self-preserving. I really love how Kameron Hurley manages to write a character who is, for all intents and purposes, completely despicable and manages to not only engage the reader, but enjoy Nyx's shenanigans.The other thing I loved about Rapture is that the punches were not held back. Unsurprisingly, people die... but Kameron Hurley does not spare the darlings. Also unsurprisingly, there's a betrayal. (Was it in Infidel that Nyx made a comment about how someone always betrays? I think so.) However, I honestly did not see it coming, despite the pattern and hints dropped. Sometimes it's so nice to be in the dark.And everything really does end just right. Everything changes, and yet Nyx never does—to me that's a big part of what this series is about. Once you create a weapon, what else can it be? I also really appreciated that Nyx is not alone in this status, with the addition of a new, wonderful character. I wish we could learn more about her... maybe one of Kameron Hurley's works in this universe covers her more clearly.Actually, to be honest, there were several characters in this book that fit that description. Also, a trans character whose transness is not a plot point or really that important at all. Because this series wasn't already amazingly diverse enough. Hnnn. <3So once again, all I can say is this: read these books. They can be tough to find physical copies of, especially Infidel and Rapture, but you can get eBooks easily. Also, don't forget the library. Even if your local library doesn't have a copy, that doesn't mean they can't source a copy for you."}, {"userName": "Gerhard", "userReviewDate": "Jul 24, 2013", "userURL": "http://www.goodreads.com/user/show/7416346-gerhard", "userReview": "I put off reading this for a long time as I knew it was the final volume in the Bel Dame trilogy, and I was full of trepidation as to how Kameron Hurley would end Nyx’s story. Suffice it to say the ending is note perfect. “She’d been hoping for a storm.”The cover of Rapture shows a demented looking woman facing off with a weird giant centipede earwig kind of thing, which sort of reminded me of Dune. There is a much more forcible reminder of this comparison with the introduction of the mauta kita towards the end. Indeed, in many respects this trilogy is really a weaponised, feminised version of the Frank Herbert saga.It is quite astonishing how topical Rapture is in terms of the current debate about religious fundamentalism and the role that ongoing global conflict plays in propping up capitalist Western economies.Rapture begins smoothly – in many respects perhaps too smoothly, reminding me of a big-budget Hollywood blockbuster following hot on the heels of an independent shoestring-budget movie. But Hurley has lost none of her genre or street smarts with this final instalment, which is definitely the best written and most plot driven of the three. It also extends the SF basis of the series is some fascinating ways.Given the fickle nature of genre dynamics, a lot of attention of late has focused on Ann Leckie’s Ancillary Justice, while God’s War is in many respects a much more radical and successful inversion of religious and gender stereotypes."}, {"userName": "Sineala", "userReviewDate": "Apr 24, 2013", "userURL": "http://www.goodreads.com/user/show/7372963-sineala", "userReview": "This trilogy has had very interesting pacing. While I generally expect the last book of a trilogy to focus on concluding whatever plot the second book (usually the weakest) has started to spin out, here the second book went in a different direction, was mostly self-contained, and Rapture here decided to up the ante by dumping a truly amazing amount of additional worldbuilding into the mix: several more nations, an entire desert, a land past the desert, magicians who are way better than the magicians we have seen previously, and an all-new team for Nyx. (Don't worry, she runs into her old friends eventually.)It was just a lot to take in at once, and I'm not really sure, as a reader, that it was the best way to do the worldbuilding. I did like the actual plot, such as it was, and I think I might have liked the book better had it just stuck to Nyx Brings People In and not suddenly given me so much more information about the world that was not previously present.My likes and dislikes are pretty much the same as with the first two, other than that: great characters, especially Nyx and Rhys, but generally more grim and violent than I like. Still, if the premise is your thing (queer kickass bounty hunters!), you might as well give it a try."}, {"userName": "Marie Michaels", "userReviewDate": "Nov 08, 2016", "userURL": "http://www.goodreads.com/user/show/13567670-marie-michaels", "userReview": "I am amazed at how Kameron Hurley manages in the third installment of this series to simultaneously give the feeling that years had passed since the prior volumes and maintain a sense of continuity. I really had the sense that Nasheenian society had fundamentally changed since Book 2--Hurley really dove into what it would mean for that nation to undergo such a change as it had. No status quo here!Everything that is great about the first two books is great here: the vivid, often horribly so, settings; the increasingly damaged but still struggling characters; and the intricate plotting. It was fun (as much as these books are *fun*) to travel beyond the lands that have been mentioned so far on this planet and see even more kinds of terrible creatures!And Nyx and Rhys... definitely the most complicated, not-even-sure-I-want-them-together ship ever. Hurley plays their relationship so deftly, the push and pull, attraction and repulsion. I don't know what I want with them any more than they do. And that ending!! (vague spoilers ahead) So cruel, so ambiguous, so appropriate. This series is definitely not for everybody, but if it is for you, it will be relentless in grabbing you and not letting you breathe until the end."}, {"userName": "Robyn", "userReviewDate": "Apr 10, 2016", "userURL": "http://www.goodreads.com/user/show/25037254-robyn", "userReview": "4.5 that I am rounding up to 5 for the quality of the whole series, inventiveness of the world, and incredible characters. Nyx is one of those creations that must live beyond the page (even as terrifying and saddening a thought that might be) - absolutely incredible. And the supporting cast is just as wonderful!"}, {"userName": "Colleen", "userReviewDate": "May 25, 2015", "userURL": "http://www.goodreads.com/user/show/5020117-colleen", "userReview": "This series is dark and violent, the last book in the trilogy could possibly be the darkest. The world building throughout is amazing and frightening and fascinating. The story concludes in a way I didn't see coming."}, {"userName": "Embracing My Books", "userReviewDate": "Oct 14, 2016", "userURL": "http://www.goodreads.com/user/show/50136998-embracing-my-books", "userReview": "You can read the review on my blog: http://embracingmybooks.blogspot.be/2..."}, {"userName": "Andrew", "userReviewDate": "Mar 16, 2015", "userURL": "http://www.goodreads.com/user/show/5143064-andrew", "userReview": "Fatima scrambled up. She grabbed the paper, shoved it toward her. “Just bleed on it and you’re a bel dame again, Nyx.”“And you can control me.”“Nyx, if you knew who we were after—”“Fuck you. And fuck the Queen.”“The bel dames made you, Nyx. They can unmake you.”Nyx started to the door, only half expecting to get a knife in her back.“It’s Raine al Alharazad,” Fatima said. “Your old boss.”Nyx stopped in the doorway.“He’s head of the broederbond now. He went missing three weeks ago. Rain’s always been a disgruntled activist. You knew that. But he showed up here five years ago calling himself Hamza Habib and growing a far larger following than ever before. We think he’ll be elected to the ruling council after the Queen forms the new government, if the boys have their way.”Nyx let out a long breath, like she’d been punched in the gut. “Raine is dead. I put a sword through him and left him to die in a ditch in Chenja. A long time ago.”“People don’t stay dead in Nasheen,” Fatima said. “You know that better than most of us.”***Seven years have passed since the end of Infidel, the second book in author Kameron Hurley’s Bel Dame Apocrypha. At the start of Rapture, the third and final entry in the series, Nyxnissa So Dasheem—Nyx—the former bel dame assassin/mercenary, is living in exile with former teammate Anneke and her lover Radeyah. It’s a quiet-ish existence, for the most part—following the events at the end of the previous book, Nyx’s team has scattered, each following new (and most importantly separate) paths. But when Mercia, the young ambassador’s daughter who Nyx was hired to protect at the start of Infidel, reappears in Nyx’s life with an offer she can’t refuse, Nyx releases whatever tenuous hold she had over the life she was attempting to build and re-enters the fray.Nyx is promised a return to the bel dames if she completes a task for Fatima. The job? To retrieve a kidnapped politician and avert all-out civil war. And to bring him in alive—something Nyx hasn’t had all that much experience with.Rapture sees the world of Umayma at a crossroads. The centuries-long war between Nasheen and Chenja has come to an end, resulting in an incredible number of boys being sent back from the front and deposited on the streets. Simultaneously, the shifters, led to some extent by Inaya, are making a push for safety and equality, demanding that the world see them for what they are. But while this powder keg of civil rights issues festers and percolates, spinning around the disappearance of the aforementioned politician, another threat rises in the form of the First Families who seek to take control of the world they helped to manufacture in the first place. They are ancient, they are legion, and they have the power to remake—and unmake—the world.Rapture, like Infidel before it, takes a unique approach in telling a single, overarching narrative. Building on the culture introduced in God’s War, the first book in the series, Hurley takes the long road by setting each book years apart from the last (six years between the first two; seven years between books two and three). As a result of this, and Hurley’s exceptional waste-no-time-and-suffer-no-fools approach to world building, Umayma exists and develops off the page. The culture shifts and evolves while we’re not present, forcing us to catch up quick with each window offered into this world.The same can be said for Hurley’s characters. Most of the cast from books one and two have returned, though their circumstances have changed rather dramatically: Eshe and Inaya are working together fighting for the rights of shifters; Khos, Inaya’s husband, has been abandoned for his wife’s cause; Anneke is briefly seen hosting Nyx in exile. It’s Rhys, however, who is seemingly having the hardest go of things following the tragedy his family faced in Infidel, when his children were murdered and his hands were cut off. Though he and his wife Elahyiah have started a new family, Rhys is unable to move on and let go of his past.The new cast—Nyx’s new team—is a mixed bag of instabilities and shady pasts. There are Kage and Ahmed, both on the run from those who would hunt them; Eshe, the only returning team member, and Isabet, who is unable—or unwilling—to leave his side; and the bel dame Khatijah and her possibly mad sister (and shit magician) Eskander. Together, the strange and untested group is en route to the wall—a two kilometre high living wall at the end of the world that they must find a way over if they are to retrieve their target. Between their starting point and the wall, however, is a brutal journey that will test—and threaten—each and every one of them.Rapture, from the very beginning, feels different than the two books that came before. Make no mistake: it’s an excellent book and I damn well loved it. But there’s a noticeable change in tone. It’s an end-of-life book—it very much marks, and feels as though it does, the end of Nyx’s storied, deadly career. The new team never quite gels, but it’s not necessarily supposed to, for the reader or for Nyx. The gathering of personalities she accumulates for this final mission is a combustible assortment of lost souls searching for, or running from, a fight. They aren’t Nyx’s family—they’re barely even her allies. They’re there because they need to be, because she needs them, and because she simply has no fucks left to give. When she stops serving a purpose, so do they.At the same time, Inaya has abandoned her family for her own fight, and Rhys’s inability to let go of the violence in his past has effectively driven his family away. Across the board, personalities in Rapture have been torn asunder; even in peacetime, those living in Nyx’s shadow are unable to escape the dark.Which makes the fact that Nyx is tasked with bringing Raine in alive all that much more ironic. Because Nyx is a killer—it’s all she knows. And as if to drive home her lack of purpose in a world moving toward peace, Raine’s kidnapping is proof of one essential thing: that nothing stays dead in Umayma, and that Nyx will never, ever be free from her past—not while she still has breath in her lungs.As an end-of-life tale, much of what occurs over the course of the book serves as the slow dismantling of everything Nyx was as a person. Every action, every look of revulsion she receives for how she pushes forward, is another chunk taken out of her wall (not-so-subtly personified by the fact that it’s a giant living wall that provides the group with their most visible obstacle).As with the previous two books in the series, it’s the will-they-or-won’t-they between Nyx and Rhys that offers the story’s most tangible emotional anchor. The two have always been on opposite ends of any and all ethical debates—and that’s to say nothing of the racial and religious divides that have come between them, or the fact that it was bel dames who shattered whatever chance Rhys and his family had once had for happiness. But regardless of their differences, there has always been a connection between them—almost like love without real affection, if that makes any sense. Post-armistice, both Nyx and Rhys are forced to re-evaluate their worth in the world. It’s only through being forced into each other’s paths again after so long apart that the depths of what they feel for one another is ever addressed, as is the impossibility of any future between them. This is beautifully rendered when, near the end, Rhys rushes toward Nyx, embraces her, and says, “I have always been happier without you.” It’s just fucking perfect and says everything necessary about their relationship—that they will always be drawn to one another, for some inexplicable reason, though both know that to act on that would destroy either’s chance at peace.In Hurley’s kill-or-be-killed world, this is an absolute perfect exclamation of love. And just how gloriously fucked up is that.There’s so much more I want to say about Rapture, from Inaya’s prison escape that would make Hannibal Lecter proud; to the glorious gore of the blood-thirsty sand that devours people, leaving only empty husks behind; to its Sopranos-ass ending, which manages to be both ambiguous and final—and most importantly, earned, a perfect summation of Nyx’s life, times, and crimes. Rare is the trilogy that succeeds and grows in confidence and quality all the way through to the end. There is little, if anything, to be disappointed about regarding Hurley’s Apocrypha. This is an exquisite series, not to be missed under any circumstances."}, {"userName": "Ellen", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/3681764-ellen", "userReview": "[\"Nyx?\"\"Rhys?\"Have you ever been happy?\"She thought of Radeyah, and drunk nights at the fights. Dinner with Anneke’s squalling kids. The stink of the ocean. And she remembered during all those moments, of yearning for this one: the sound of gunfire, and Rhys’s body beside her.“No,” she said.She turned away and started walking across the muddy street to join what remained of her team. Cutting everything up, cutting everything away. And for what? A chance at saving Nasheen from blowing itself all to hell? Some days she wondered if it was worth it. She had killed a lot of people, for nothing. Given up everything she loved, for nothing. Saved nothing.She heard splashing behind her and turned.Rhys came at her.She half thought he meant to shoot her, and stepped back, pivoted left. but he slipped his arms around her and embraced her. He pulled away before she could figure out how to hug him back.“I have always been happier without you,” he said.“I know,” she said.He released her, and then he was off and away, through the blinding sheets of rain.IT COULD NEVER GO ANYWHERE ELSE BUT NONETHELESS I AM SO SAD WAAAAAAAAAAAAAAme at the end of god's war: well they've got two more books to work this outme nearing the end of rapture: Oh No (hide spoiler)]"}, {"userName": "Michelle", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/84077-michelle", "userReview": "In all 3 of the Bel Dame books, Hurley's talent at evoking place and crafting character are at full force. The desert wind, desperate warriors, stink of organic technology, agony of fight wounds, and scramble to survive all feel very real and very immediate. There's a refreshing bravery in Hurley writing an utterly unsentimental antihero of a type we've seen as a man, but vanishingly rarely as a woman...and then having the rest of her rogues' gallery be made of both other hard-bitten women and equally tough men so that Nyx isn't built up simply by lack of comparison. These books are complex and fascinating character studies of both people and this desert world.The frustrating part is that there's a plot pushing the character studies, and none of these people are the players ultimately pulling the strings. Nyx thinks and acts like the former soldier she is, and while her fierce independent streak and dedication to her version of honor makes her a force of chaos in the real player's plans, she is often used as a tool, meaning we don't really know what's going on until she finally does. We get glimpses of a tantalizingly complex political background story, but never learn the bigger picture. It feels very real and completely honest - the world is made of pawns more than queens after all - but more than a little frustrating."}, {"userName": "Adam Whitehead", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/5866785-adam-whitehead", "userReview": "For centuries the nations of Nasheen and Chenja have fought a gruelling, deadlocked war. Millions on both sides have been killed by airbursts, poison gas and hostile swarms of insects. Now peace has come. Hundreds of thousands of young men and boys have returned home to the cities of Nasheen to find that their female rulers don't know what to do with them, but still expect them to obey. A movement for equality and representation is building, spearheaded by a mysterious figure. Retired bel dame Nyx is \"persuaded\" out of retirement to deal with the problem. Her mission will involve crossing a vast desert to unknown lands, a chance meeting with old friends and the final hope that she might find some peace at last.The Bel Dame Apocrypha series has done increasingly interesting and original things with each volume. Overall, the series is a curious mix of fantasy and science fiction, set so far in the future that technology and magic have become indistinguishable and a \"fallen\" race of humans, divided internally by religion and ideology, must make use of them to survive on a hostile, only partially-terraformed planet. The SF elements work because they are subtle and kept in the background, and overall the \"bugpunk\" theme is sold because the author commits to it, making her weird concepts convincing due to how the characters treat them as ordinary.God's War was an accomplished debut, benefiting from a razor-sharp sense of story but being a bit rough around the edges. Infidel was superior, a brutal (even traumatising) novel that was incredibly powerful but made you wonder if the author should be hauled before an international tribunal for the mistreatment of fictional characters. Rapture retreats a little from being that hardcore - although it's certainly not a happy novel - and instead shifts to being a more detailed and in-depth exploration of the world and history of Umayma and how it will develop going forwards.It's a remarkable book, driven by anger and fury and burning intelligence. A lengthy crossing of a hostile desert made me draw comparisons with Mad Max: Fury Road (although Rapture predates that film by three years), not for the plot but for its sense of purpose. We learn more about the world and what's going on in remote areas, but the book remains focused on the characters and how they relate to one another. The final collapse of relationships long tottering on the edge is sad, but also inevitable and then horribly liberating, in a way that's true to life.The book is mainly concerned with its own storyline, but finds time to wrap up long-standing plot threads from earlier volumes. Indeed, characters and arcs established in earlier volumes which felt a little disconnected from Nyx and her team are here tied into the main storyline with great skill. It's not a neat ending to the series - and there is at least one large dangling plot thread that potential sequels could pick up on - but it does bring about enough satisfying resolution to work if there is never another Bel Dame novel.If the novel does have some weaknesses it might be that some of the desert sequences in the middle do drag on a long time when the book's finale (which involves crossing the entire continent) is squeezed into a few too few pages, feeling rushed to the edges of incoherence. But the author just about manages to carry it off, producing an ending that's epic, spectacular and wonderfully messy.Rapture (****) is a readable, finely-characterised and highly imaginative novel, brimming with wit and attitude."}], "description": "After years in exile, Nyxnissa so Dasheem is back in service to the bel dames, a sisterhood of elite government assassins tasked with eliminating deserters and traitors.The end of a centuries-long holy war has flooded the streets of Nasheen with unemployed - and unemployable - soldiers whose frustrations have brought the nation to the brink of civil war.Not everyone likes this tenuous and unpredictable \"peace,\" however, and somebody has kidnapped a key politician whose death could trigger a bloody government takeover.With aliens in the sky and revolution on the ground, Nyx assembles a team of mad magicians, torturers and mutant shape-shifters for an epic journey across a flesh-eating desert in search of a man she's not actually supposed to kill.", "title": "Rapture\n      \n          (Bel Dame Apocrypha #3)", "url": "http://www.goodreads.com/book/show/16164236-rapture", "average": 4.02, "cover": "https://images.gr-assets.com/books/1359117279l/16164236.jpg", "reviews": 131, "authors": [{"url": "https://www.goodreads.com/author/show/4369922.Kameron_Hurley", "name": "Kameron Hurley"}], "type": ["Science Fiction", "Fantasy", "Fiction", "Lgbt"], "outlinks": ["http://www.goodreads.com/book/show/16164236-rapture", "http://www.goodreads.com/book/show/13575986-rapture", "http://www.goodreads.com/book/show/24713514-rapture", "http://www.goodreads.com/book/show/17058258-rapture", "http://www.goodreads.com/book/show/23346902-rapture", "http://www.goodreads.com/book/show/9359818-god-s-war", "http://www.goodreads.com/book/show/29090844-the-stars-are-legion", "http://www.goodreads.com/book/show/20646731-the-mirror-empire", "http://www.goodreads.com/book/show/26114477-the-geek-feminist-revolution", "http://www.goodreads.com/book/show/11470277-infidel"]}