{"ratings": 24240, "userreviews": [{"userName": "Ashley", "userReviewDate": "Jan 16, 2016", "userURL": "http://www.goodreads.com/user/show/5222160-ashley", "userReview": "[Kari found out that Ryan, her first love, hadn't betrayed her and if she had been a little more patient all of her dreams would have come true. It makes me wonder how many times my impatience has cost me something I have been so desperately wanting. I did want her to be with Ryan, but I knew that it was wrong while she was still married to Tim. I think too many people today think it is okay to be with someone while you are separated but still married to someone else. Just because the other person ended it emotionally first doesn't mean that your actions are any better than theirs.  (hide spoiler)]"}, {"userName": "Tarah", "userReviewDate": "Dec 19, 2008", "userURL": "http://www.goodreads.com/user/show/1816089-tarah", "userReview": "Karen Kingsbury writes books that deal with issues all christians face at some time or another...the characters are flawed and human yet God is present in all their lives...."}, {"userName": "Gardavson", "userReviewDate": "May 13, 2009", "userURL": "http://www.goodreads.com/user/show/1948060-gardavson", "userReview": "I beyond hated this book. I felt like the author was pushing her beliefs. Specifically, I felt like, thru her character, she was saying that God wanted women to stay with their cheating husbands. Even after getting caught the husband couldn't commit to ending the affair. And the wife stayed with him, not because she felt it was where God was leading HER, but because that is what christian women should do. Let me say I have no personal experience with being cheated on, so it's not for that reason that this rubbed me so wrong. I just think that the path for one person may not be the path for another. It felt like the author was making a statement, not writing a fictional situation with fictional characters."}, {"userName": "Britni", "userReviewDate": "Jun 18, 2011", "userURL": "http://www.goodreads.com/user/show/389139-britni", "userReview": "he best TV shows are the ones that end with you wanting to know what happens next. The ones that you season pass on your TiVo because you don't want to miss any part of the storyline. The ones where each episode leads into the next and is connected to all of the ones that came before it. Those are my favorite kind of shows.So it's no surprise, I'm a sucker for any books that are part of a series. I love that by the end of a good series each of the characters is developed so thoroughly that I feel like I know them personally. And I'm sad to see them go.Two years ago I did a giveaway on my blog and asked readers for book recommendations. One of the top recommendations was the book Redemption by Karen Kingsbury. I had no idea when I bought it that it was part of a five-book series. I just finished reading the fifth and final book of the series and wanted to let everyone know about these great books. I used Redemption in one of Fluent Brittish's book swaps, and everyone that read it loved the book.So here I am taking that recommendation and passing it on to you. Karen Kingsbury's Redemption series is about people like you and me. It's about a family that goes through trials, struggles, and hardships. About individuals that sometimes forget their faith but always eventually come back around. About relationships between friends, family, lovers, neighbors, and strangers. It's about life. Life as I know it and life as you know it. And I recommend this book to anyone who is looking for a way to remember that no matter what happens, no matter how bad it gets, it will always be okay.So if you're looking for a good book, I've got five for you. Redemption, Remember, Return, Rejoice, and Reunion."}, {"userName": "Tamara Tilley", "userReviewDate": "Jan 06, 2012", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "This is not my first time reading REDEMPTION from the Karen Kingsbury Redemption series. I had read the first three books in the series when they first came out, but then I got out of step. I continued to purchase all the books in the set and the series’ that followed, but always felt I needed to go back to the beginning and re-read before I continued on into the other series that dovetail off of this one. So, between my other scheduled readings, I have committed to get up to speed on the multiple series put out by Kingsbury. All that to say my reviews will probably be short and to the point.The Redemption series follows the Baxter family. The Baxter’s seem to be a genuine, close knit family, but there are many fractures under the surface. REDEMPTION tells the story of Kari Baxter Jacobs. When she discovers her husband, a respected professor, is having an affair with one of his students, her life comes apart at the seams. Wanting to do everything she can to save her marriage, she refuses to give up on her husband. But, when her old high-school sweetheart shows up on the scene, and would like to pick up where they left off, Kari is torn between forgiveness and anger, temptation and commitment. What ensues is a roller-coaster of emotions and a horrible tragedy. Kari’s strength on all counts will be tested.It took a little while to get back into this book. I think it’s because Christian fiction has grown by leaps and bounds since this series debuted in 2002. About a third of the way in, the momentum picked up and I remembered why I liked Karen’s writing. I like stories that are realistic, not cookie-cutter, and the troubles that plague the Baxter family make them human. I am half way through REMEMBER, the second in the series and will post more when I am finished."}, {"userName": "Lori", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/936038-lori", "userReview": "I'm giving it 50 pages... which corresponds exactly to the first four chapters. If I don't like it by then, I will abandon yet another book and add to my arsenal of thoughts about why I don't like fiction.Wish me luck.UPDATE: I'm 140 pages into this book which was described to me as \"life-changing.\" So far, I give it an emphatic \"eh.\" I've already read phrases like \"hit him like a Mack truck,\" and \"deeper than a canyon.\" I've already read through scenes containing the exaggerated speech of a drunken man, and the melodramatic hesitation over dialing the last digit of a phone number.Oh, and a character named Dirk. DIRK.So, the writing isn't riveting, is all I am saying. It's Christian-y in ways that make me want to gag a little. And, despite the superficial 'messiness' of the characters involved in the conflict, they are messy in very neat, predictable ways. Not messy like in real life. It's starting to really read like morality play.And I'm getting a little uncomfortable with the continual assertion by the main character that seems to follows this pattern: God wouldn't let it happen this way unless he was eventually going to work it out for me.It remains to be seen if she wises up on that score. For that reason, I'll keep reading (along with the reason I read past my intended 50 pages, which is that I feel like I need to read it all to be able to creditably say that I didn't like the book.) So, I will finish the book... even though I think I already know how it is going to end. Only 219 pages left to go. (But who is counting, right?) Seriously hoping this book surprises me, but not counting on it.THE FINAL VERDICT:Eh.This is basically a Christian soap opera. I can appreciate what Kingsbury and Smalley are trying to accomplish through this book - I have been encouraged in a few aspects of my faith, but I am not the sort to take a lot of life lessons from fiction. So all I am left with is, was this a good story?It isn't an awful story. Contrived. A bit hokey. But not awful. Being that this book is the first in a series, a lot of groundwork was laid down for the storylines of the later novels. However, I can't say that I am dying to know what happens to these characters. As 'real' as they were supposed to be, they were just TOO much of whatever trait they were supposed to portray. They came in and out of behaviors too quickly and too conveniently. And I found Ryan's behavior at the end downright creepy. Add in here the believability of having two girls in the same family, both incredibly beautiful, both sought after by anyone with an X chromosome, and both with men who have pined after them since they were teenagers. Maybe this is my problem with fiction, but that kind of stuff just isn't believable.As for the story itself, I thought the ending was very convenient, both in terms of the plot for the next book, and also for the romantics who want the perfect ending. The writing was pretty weak too. On more than one occasion, a character felt things \"with every fiber of his being.\" There is a really bad metaphor of a sinking ship that was totally unnecessary. There was a photographer who wore a beret and said things along the lines of 'work with me baby.' And, to describe one character, Kingsbury wrote that she could not have been more disgusted if someone had dumped ten spiders down her sweater. I guess I'm just saying that this is not the kind of writing that really draws me in.So the bottom line is this: I'd read the next novel in this series if I wanted some light, escape reading. But the book would probably have to be readily accessible. I don't see myself hunting it down and devouring it by next week."}, {"userName": "Marnie  Krüger", "userReviewDate": "Jun 10, 2015", "userURL": "http://www.goodreads.com/user/show/6108495-marnie-kr-ger", "userReview": "I think a lot of people rate this book for the message it gives: Love is a DecisionIf my opinion would have been based solely on this I would also give it five stars, Karen truly brought the theme through beautifully.But I don't just read for a theme or a messages, I want an intriguing plot and full well developed characters. I want a clear line between whose point of view I'm reading.For me this was the biggest issue, there were so many characters that sounded the same, that felt the exact same thing, and described it the exact same way. I get that this is the first book in a series, but there where so many unwanted characters and thoughts brought in, that at stages it was just to much.This is my second Kingsbury novel and to be honest I was disappointed, the plot for this book and A Time to Dance was almost the exact same plot, cheating husband dedicated wife, supporting family that doesn't quite understand. The plot was not really a surprise for me in any way. I predicted the ending so accurately when I hit the forty percent mark it was an \"I told you so\" ending. I really like the christian fiction and would try other books, I'm just not sure it will be Karen Kingsbury's books."}, {"userName": "Kristine Larson", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/5968624-kristine-larson", "userReview": "I can honestly say, I am not someone who pushes faith on anyone - I know I am a Christian; however I don't read the Bible religiously; I don't attend church faithfully and I don't pray on a daily basis. With that being said - anyone who is familir with the works of Karen Kingsbury knows she is a Christian writer and her writing incorporates versus from the Bible and includes a deep faith in Family, Love, Prayer and most importantly - God. I belive in all of that - however I don't act on it openly. But in reading this first book of this series, I have to say this writing was amazing and the story drew me in. I loved falling in love with the Baxter family and every turn of the page drew me in. I immediately went to the library and checked ou the next 4 books and have read all 5 books. This series follows the Baxers who include the parents (John and Elizabeth) and their 5 adult cihldren who face a world of trials and tribulations from first loves; to divorce; to death; to adoption; and other tragedies and celebrations. All the while leaning on eachother and God for support, guidance and strength. I was thoroughly impressed with this series and I am very happy I was introduced to her work."}, {"userName": "Elishya (lace)", "userReviewDate": "Jun 15, 2011", "userURL": "http://www.goodreads.com/user/show/5583320-elishya-lace", "userReview": "The First book of an entire three set series called the Redemption series, the forgiven series and the sunrise series. All following the life of the Baxter family. 6 children, multiple grandchildren, a husband and a wife and the story of their lives and their children. This book in specific begins with the struggles of one of the eldest daughters, Kari and her cheating husband. We get a sense of the entire family and how much they love one another through the love of Christ. The focus, redemption, and how we must trust in God to provide us with our lives and pathways. Once you redeem your love for Christ, everything changes and your life has purpose. Its hard not to follow the entire series after reading just this book because you'll want to know what happens to each of the Baxter children as time passes on."}, {"userName": "Anna", "userReviewDate": "Jul 14, 2009", "userURL": "http://www.goodreads.com/user/show/1349290-anna", "userReview": "I'm really surprised at how much I enjoyed this, as I'm very skeptical of Christian fiction books that either depict characters through rose-colored glasses or employ conversion as a plot device or major moral turning point for wayward characters. Refreshingly, this had neither. The story involves Kari, a young wife; her husband Tim; Kari's family, the Baxters; and Kari's former (and still current) love, Ryan. Tim is a journalism professor and begins a very passionate affair with a student that causes him to leave his wife. As the title implies, it is a story of redemption, about how (and why) Kari and Tim reconcile, and how Kari and Tim address the sin issues in their lives that led to the estrangement that developed in their marriage prior to the affair. The characters' inner dialogue was spot on. My biggest complaint was that the main characters (aside from Tim) were exceedingly beautiful, intelligent, financially successful, and virtuous. Granted, we all know families like this, the kind who go to church together as a family and live in a big, comfortable house where youth group meets, and seems to have no problems on the surface. So it is not inconceivable to me that a family like the Baxters exists. However, Kari and Ryan's rekindled romance following Tim's affair with the student was unbelievably G-rated. If their feelings for each other were as strong as they described, I can't believe there wasn't real temptation to do more than kiss. Ryan, especially, seemed unusually restrained for a guy in his position.I'll be reading Book #2 in the series!"}, {"userName": "Amy (Foxy)", "userReviewDate": "Jun 15, 2012", "userURL": "http://www.goodreads.com/user/show/9955253-amy-foxy", "userReview": "SERIES:"}, {"userName": "Molly Cafinated Reads Jaber", "userReviewDate": "Nov 13, 2017", "userURL": "http://www.goodreads.com/user/show/48982273-molly-cafinated-reads-jaber", "userReview": "I reviewed this book several years ago, so this is a reread review.  I can tell you that my thoughts then were high on this book and not much has changed through the years. Mrs. Kingsbury's books were introduced to me by my mother many years ago, and I was hooked. Redemption was one of the first Kingsbury books that I read, and it is one of my favorites. I was instantly hooked on it the first time I read it, and the reread was no different. Whenever I find myself in a book funk, or I suffer a tragedy in my life, I pick up Redemption and am reminded that with God's redeeming grace, I can pull through anything.As someone who went through a bad first marriage, this book truly hits home for me. There are many elements of the book that I went through but I didn't lean on God through it all like Kari did. I loved watching her character again. It truly felt like reuniting with a long lost friend. The pain and suffering she felt, once again became my own. The sadness and the struggling, were mine. I found myself wanting to wrap her in a big old hug and fall to my knees to pray for her. This is definitely still a 5 star book in my opinion. Mrs. Kingsbury can create a novel that will suck you in, wrap you up in God's warmth and grace, and set you down in a brand new place. Her words will stay with you long after you've shut the pages, long after you've placed the book back on the shelf. She will leave you breathless and ready for the next book. I highly recommend this book to all! *I purchased this book for my personal collection. Cafinated Reads was under no obligation to post a review, positive or negative.*"}, {"userName": "Charlene", "userReviewDate": "Mar 28, 2018", "userURL": "http://www.goodreads.com/user/show/73663286-charlene", "userReview": "Karen Kingsbury leads you on a emotional roller coaster in the story of Redemption. Personally this one was extremity painful. I don't mean in a negative way but it felt so real and relative that my heart hurt from beginning to end. My favourite elements to this story are: 1. while there are main characters it's not written from one or two characters POV. Each of the lives of the Baxter family and their nearest & dearest were explored individually. Some more than others. 2. The Word of God informs us of many things but how does that look in reality? Karen Kingsbury paints a beautiful, truthful & painful picture bringing Biblical principles to life. 3. I love how scripture is used.4. I love that God has his own voice.5. I love that the consequences of disobeying the principles of God are driven home throughout the story. It causes you to stop, reflect and examine your heart and your personal walk as a believer in Christ. Overall I loved this story. It made me cry, scream, shout, cry and also smile. Karen Kingsbury's writing is very captivating. I can not wait to read more about the lives of the Baxter family in this series. I am hooked! I listened to the audio version. Narrated by \"Sandra Burr\" who I give 5 stars throughly enjoyed listening to this on audio. Finished within 48hrs :). Recommended to all Christian contemporary fiction fans. Don't let the fact that it was written 16 years ago put you off. This story is as much relative now as it was when it was first written. Warning: If you have had adultery challenges in your marriage this story may be very raw and difficult to read."}, {"userName": "inabookshell", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/31075572-inabookshell", "userReview": "I think I've found a new author that I love ❤️"}, {"userName": "Maria Rubatino", "userReviewDate": "Nov 29, 2012", "userURL": "http://www.goodreads.com/user/show/15021715-maria-rubatino", "userReview": "I kept having to force myself to keep reading. It is a story that was obviously hung upon the co-authors' idea of Biblical marriage which is shaky at best. I can put up with a half-hearted, unbelievable story with flat characters, but completely ignoring advice from the apostle Paul about marriage (he said if your unbelieving spouse wants a divorce you should let them in 1 Cor 7:15) and not even addressing the issue of the Baxter family's underlying dysfunctional relationships was too much for me to take. Granted, the guy that wanted a divorce came back to God but only AFTER he found out that his wife was pregnant. I felt pretty disrespected as a reader that we were supposed to just believe that Tim was going to now be a good husband and Kari would be happy. I'm also pretty upset about the \"it was all a misunderstanding,\" situation with Ryan. I mean, really. You can't be THAT in love with someone and not even want an explanation when he suddenly wants a new girlfriend. I just don't believe it. I feel very manipulated into wanting to read the other books by underhanded comments that were left unexplained. You shouldn't get your readers I read the next books in the series by bringing things up you don't intend to explain until 3 books from now. This isn't a TV show where you get the audience to hang on through the commercial break by postponing the results of the voting until then. Maybe some people like that kind of thing in their books, I don't know, but I like series that tell new stories. I keep reading because I like the characters, the story (and what I learn from it) and come away feeling accomplished; Not bullied into buying another book."}, {"userName": "Jennifer", "userReviewDate": "May 07, 2012", "userURL": "http://www.goodreads.com/user/show/837447-jennifer", "userReview": "Karen Kingsbury's books are fun and easy to read. It's easy to get drawn into the Baxter family and all that is going on with them and want to keep reading each book in the series to find out what will happen next. It's encouraging to learn from how they do or don't put their faith into action when tough times happen in their lives.Kari Baxter Jacobs discovers her husband, Tim, is cheating on her. He is a college professor. He moves in with one of his students and tells Keri he wants a divorce. She is devastated, but does not want a divorce. She believes love is a decision and that she should honor the marriage vows she made before God. She spends a lot of time at prayer and moves in with her parents. Soon after this happens, she discovers she is pregnant. Things get complicated because, Ryan Taylor, the guy she was in love with in high school, comes back into her life while she’s separated from Tim and her feelings for him still exist. But she gathers her strength and eventually Tim decides he wants to work things out with Kari and have the baby with her."}, {"userName": "Erin", "userReviewDate": "Sep 08, 2009", "userURL": "http://www.goodreads.com/user/show/1762014-erin", "userReview": "I found this book to be refreshing and easy to follow, which is something I highly value in books. Throughout this story you’ll learn about the Baxter family and other’s in close relationship to them, though the main focus is on Kari Baxter and the struggles she encounters with her husband Tim.I personally like how prayer and scripture was added into this book. The characters I found believable and enjoyed getting to know bits and pieces of who they were. I defiantly will pick up the next few books in this serious to learn more about the Baxter’s walk with Lord in life through joys, struggles, and heartache…all which most people go through in their own lives daily. It’s nice to have a book to relate to that tackles the harder questions and topics not commonly mentioned in christian fictional stories.I recommend this book if you are looking for a great christian series to keep you captivated for awhile. I give this book 4 stars."}, {"userName": "Elizabeth", "userReviewDate": "Jun 12, 2013", "userURL": "http://www.goodreads.com/user/show/1034783-elizabeth", "userReview": "one thing that I have often struggled with, in reading Christian fiction, is the way in which the authors portray the influence of the Lord in people's lives. Often times in Christian fiction it can come off as a bit shallow.But this book for me almost hit it directly on the head. I loved how the characters relationship with the Lord was part of their life. I love how the characters spoke words that seemed real instead of speaking words that were expected of them in terms of their religious beliefs. the writing was very well done. I was hooked within the first chapter. I wanted to stick around to see how this story would end for these characters. I actually got teary eyed, laughed a little, felt heartbreak and saw myself in the family. Sad this story ended but I am very happy to find out that there are four additional stories in the series."}, {"userName": "Amber", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/33787179-amber", "userReview": "Wonderful read!! So thought provoking and inspiring. I bawled my eyes out!"}, {"userName": "Amanda Sheila", "userReviewDate": "Dec 19, 2014", "userURL": "http://www.goodreads.com/user/show/11886105-amanda-sheila", "userReview": "I guess this book rubbed me the wrong way, I don't know. The heroine's such a doormat but she disguised it with her religion. She's just stand there with heart ache, when her husband hurt her heart and her trust, she didn't get up and save herself. She's weak and I don't like my heroine's weak, so.. No. Not sure if I want to read the next installment of the series."}, {"userName": "Alita Baker", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/22120028-alita-baker", "userReview": "I love the Baxter series"}, {"userName": "Rebecca Ray", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/44239460-rebecca-ray", "userReview": "I will confess that I don't actually like Christian fiction. It's often too formulaic, and the characters and situations are too contrived. Often, I feel like the faith statements are too shallow, and the whole thing just turns me off. However, my sister and mother have both been in love with a series from Karen Kingsbury for a while, and they kept recommending to me that I read the Baxter books. I would listen to them and find something else to read, but my mother bought me several series of them to try out for Christmas, so I just had to put them on my reading list. (This book will actually be a part of my #vtReadingChallenge as \"a book recommended by a family member.\")Redemption is the first book in the Baxter family saga and it's the beginning book where we meet the whole family. The protagonist of this book is Kari Baxter Jacobs. The book begins with her husband walking out the door because Kari has discovered his affair. Despite the fact that Kari is still committed to their relationship, Tim wants nothing to do with their marriage. In his mind, he has found a new love and the old love is gone, despite the guilt and the small voice in his head reminding him of his sin. He decided to just drown that voice out with alcohol.In her pain, Kari moves out of her home and and moves in for a few weeks with her parents. We are introduced to her whole family and to the dynamics between them. (We're especially introduced to her sister Ashley, who will be the protagonist of the second book in the series.) An old flame also comes back into her life, and she has to make a decision to remaining committed to her marriage or allowing it to slip away. She also has to face an incredible tragedy in her life to overcome (as if her husband's infidelity isn't enough!!).When I started reading the book, I was bothered by the formulaic feel of the writing. I was annoyed at the chapters from the point of view of Tim, who I considered to be very shallow and of low character. I had just finished reading the books of A Song of Ice and Fire, and after reading those, it was difficult to go to a writing style that was, quite frankly, much less beautiful. Yet, by the time I was fifty pages in, I was completely drawn into the story and the character.I found myself tearing up several times during the book, especially as Kari faces her decision whether to stay in her marriage or to allow herself to reinitiate a relationship with her high school boyfriend. The love that puts duty over personal desire and is not self-seeking is still one that I have difficulty with, so to see her make the choice to commit herself to her marriage, even when it is hard, was something that I found beautiful and heartbreaking for her personal happiness. It reminds me of the lovely Gary Thomas books on marriage (Sacred Marriage & A Lifelong Love) where I was really brought home to the fact that my marriage wasn't about me and weather I was happy or not (and I am!!). Instead, I was struck again by how much my marriage has to do with my sanctification and my relationship with God. This section is beautifully handled in illustrating both the right decision and the personal pain that it caused.Kari had already been through so much that I just couldn't stand it when she had to suffer more hardship before the end of the book. Yet, she still was able to sing \"Great is thy Faithfulness\" before the end of the book, and that is enough to remember.Because of the way that this book emotionally moved me and reminded me of the purpose of marriage, I have to give the book five stars. I am going to momentarily pause my list of books to read for the challenge that I am working through and work through some more of the Baxter books because I have so enjoyed the time that I have spent in their world at this point. After all, it's no good to get back to a reading challenge until I've read enough of these books to be ready to move on without worrying about \"what's going on in their world.\" :-)"}, {"userName": "Alexa", "userReviewDate": "Dec 13, 2016", "userURL": "http://www.goodreads.com/user/show/44299273-alexa", "userReview": "Unbelievable!!! The ending… WOW!!!!!! You'll never guess...or see it coming and it had all the elements of an incredible novel without your ability to see the gears working. It deals with serious adultery, and other elements that are involved so if you or anyone else has ever suffered this horrific ordeal or know someone who has, I encourage you to pass this book along. ( for me, the only sad part is that there is a low amount of scripture used ). This is a \"clear your calendar type of book\" ,grab your comfy clothes and relax in being prepared to spend time with the series because there's five books to this particular series. You're going to want to read every single one of them like potato chips without even looking inside the bag for amount you donned, totally caring less about how much you ate and even eschewing the urge to exercise it off when you're on the treadmill. I kid you not. When somebody recommended , initially the author Karen Kingsbury, I was like \" yeah okay , more sport books, and movie novels. \". My heart was not for it. ( i am being honest). Not my cup of latte. I really didn't want anything to do with them, but I did ask the Lord to give me a heart for her books if He wanted me to read them. Two weeks later with my interest piqued , the Lord inspired me to pick up the first book of the Baxter series since it started with her Christmas book that came out and I noticed it involved \"the Baxter family.\" However Spoiler Alert: if you do read \"The Baxter family Christmas \", skip the first part because it will totally blow the entire series for you. It goes on to describe every single family member, what happens to them, all the kids they have , the why's and details one needs not to know. Final conclusion: I was flabbergasted -which was my initial reaction. The ending was amazing. And if anybody knows me I tend to be more garrulous then speechless, \" I'm working on it Lord, I'm working on it.\"  But really I just could not close my mouth afterwards. A must read. To characterise: I would have to place it as a \"warm-hearted\" character driven book with a thick plot involved with each book."}, {"userName": "Havebooks Willread", "userReviewDate": "Feb 09, 2014", "userURL": "http://www.goodreads.com/user/show/27589594-havebooks-willread", "userReview": "I was pleasantly surprised at how much I enjoyed this book which a woman from church brought and told me I should read. The characterization was good enough that I feel like I know the adult Baxter siblings and I am looking forward to reading the rest of the series to see what happens in their lives.This particular installment focused mostly on Kari who discovers her husband's infidelity. The way they deal with it was refreshing to me, even as it was painful. I have to admit I guessed how it would end, but that's just me--always trying to figure out how the plot will go. I still enjoyed the journey getting there. :)Two quotes stood out to me:\"God will always honor your choice. If ever you decide not to put God first, God will always honor your choice\" (135).(I thought this was a really good point. We are the ones who make the choice about following God or following self and God will allow the consequences that come from following self.)\"When they were kids it all seemed so easy. They went to church and believed, and in return God took care of them and made sure everything worked out the way it was supposed to\" (213). (Hmmmm, trying to process that one. It seems an immature understanding, for sure. The character who had this thought is struggling with her faith, and I would guess her understanding is part of the reason. The Bible FOR SURE never promises that our lives will be easy because we follow the Lord. I think there are too many people who have this sort of expectation and then struggle when life happens to them. I think that's one of the reasons I am so enjoying this series (for I moved immediately into the second book before writing this review)--real life is happening to the Baxter family and that makes them relatable.)"}, {"userName": "Lena Morrison", "userReviewDate": "Feb 14, 2014", "userURL": "http://www.goodreads.com/user/show/28404981-lena-morrison", "userReview": "My original review from 2 years ago: This is my favorite book of the series. I liked it. I admit, I wanted Kari to leave her husband and go with Ryan, but it all happened differently. It was good.My review now:I changed my mind. I still really like this book. (It was almost 4.5 stars for me.) It made me cry, and I thought it had funny moments, but most of all, the majority of it all felt real. I liked Kari. She was such a kind, yet flawed, individual. I find it sad to see how many Christians that have read this book didn't support Kari's decision to stay with her husband despite his unfaithfulness. There is nothing more Scriptural. Although adultery is the only grounds on which God allows divorce, it's obvious throughout the whole Bible that he does not like it. In fact, he hates divorce. Kari's choice to remain with Tim is what would please God more.  I liked all the other characters, and I really like the Baxter family. I changed my mind in the sense that I wanted Kari's marriage with Tim to work, and to last. I didn't want her to end up with Ryan. In fact, I barely liked Ryan this time around. Especially after the that little \"fling\" with Ashley.  Karen Kingsbury writes well, and some of what she wrote was somewhat cheesy, but the majority of it wasn't, at least not for me. I think this is my favorite of all the books she's written that I've read. Sometime soon I look forward to reading the rest of the Baxter series. :)"}, {"userName": "Jodi", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/2822898-jodi", "userReview": "This was a book about Tim who was unhappy in his marriage and started having an affair. He finally moved out of his home with his wife and lived with his girlfriends. He started drinking and making very bad choices. His wife Kari realized she had a part to play in his being unhappy in the marriage. A tough pill to swallow or to even read. Kari would not grant Tim the divorce and said that she would fight for their marriage. She stayed with her parents and learned that she was pregnant with Tim's baby. The baby that they had been trying to have for years. Kari also had an old flame Ryan. She loved him since she was in high school. Ryan started to come around again. He finally had to learn that his love for Kari was selfish and not the kind of love she deserved. Ryan took a job out of state and tried to move on with his life. Tim went back to Kari and they started to go to couseling together. Things were looking up until the girlfriend called and told Tim she was pregnant with his baby. Tim didn't know how to tell Kari now that they were working on their marriage. Tim made a bad decision one night that cost him his life. The girlfriend admitted to Kari that she had lied to Tim about the baby and that Tim's last words were that he loved Kari and that he was sorry."}, {"userName": "Melanie", "userReviewDate": "Mar 02, 2016", "userURL": "http://www.goodreads.com/user/show/9834339-melanie", "userReview": "Redemption is the first book in the Baxter series. Kari thinks she is married to a wonderful, faithful man and one phone call changes all of that. Kari finds out that her husband is having an affair and now he wants a divorce. Kari wants to honor God and stay committed to her marriage, regardless of what her husband wants. Then Ryan Taylor walks into her life again after breaking her heart all those years ago. Kari wants to stay faithful to her husband, but she is struggling with the emotions that go with her husband having an affair and leaving her. To top it off, Kari finds out that she is three months pregnant and is determined to make this work with her husband, no matter how he feels. Tim realizes that he has made a huge mistake in leaving Kari and wants to do everything he can do to make things right with Kari. Will Tim and Kari get back together or will Ryan come in between them? The first book in the Baxter series was definitely a good read!! I can't wait to start Remember!!!"}, {"userName": "Eva Wilkerson", "userReviewDate": "Jul 16, 2011", "userURL": "http://www.goodreads.com/user/show/5651718-eva-wilkerson", "userReview": "I'm guessing I had a good cry coming because that's exactly what happened in reading the last quarter of this book.Honestly, in the beginning I thought this was just an everyday novel with some scripture thrown in there every once in a while. I wasn't very impressed. However, what I didn't expect was the reminiscing and soul searching that this book caused. I really didn't have much in common with the story of the main character (marriage) but I could see myself in many of the other elements of the story.I think my feelings were more about what was going on in my life than it was with what was going on in the story BUT I did realize that I need to rely on and include God more in my decisions, my healing, my plans, and more in my life in general.And for that I can't wait to get my hands on the second installment of this series. It may not be everyone's cup of tea but just like a scriptural reference is was here when I need it (and was ready to hear it)."}, {"userName": "Bekah", "userReviewDate": "Oct 04, 2014", "userURL": "http://www.goodreads.com/user/show/25766853-bekah", "userReview": "This was the first book I read by Karen Kingsbury and I must say that she did a great job with this book. It kept me reading until the last page was turned.I really liked all of the character. They were very well developed. I enjoyed reading Kari's journey to healing after her husband was unfaithful to her. She truly did want to do what God wanted her to do, which was work at her marriage with her husband. She wasn't perfect and she did make mistakes, but this was truly a story of what love really is.I really liked Ryan and as I've gone on reading this series I've liked him even more. He's very kind and truly does respect Kari's decisions.I really look forward to continue reading this series by this author!"}, {"userName": "Delvina", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/34163607-delvina", "userReview": "I really loved this book. My heart broke about five times and I cried as many times too, if not more. This is a great read - it reminded me that there is so much pain and suffering in the world but that with God's love and grace he will give us strength and courage in the lowest times of our lives. And that everything in life happens for a reason - that God gives us trials to learn - that He will never give us trials that we cannot overcome if He is in the centre of our lives.I particularly liked the lesson that love is not self-serving. And that God's love is different from worldly love like when they fall in love in the movies. That lesson will remain with me forever, and to the authors - for that I am grateful. Thank you very much. And all Praise and Glory be to God!"}], "description": "A fresh new look for the best-selling series from America’s number-one inspirational novelist, Karen Kingsbury. Fans will enjoy a personal note from Karen and Gary Smalley as well as discussion questions for book group use. Revisit the Baxter family in all their life-changing events, or share the series with someone who hasn’t discovered it yet.The Redemption series won Christian Retailing’s 2005 Retailer’s Choice Award for Best Series!When Kari Baxter Jacobs finds out that her husband is involved in an adulterous relationship and wants a divorce, she decides she will love him and remain faithful to her marriage at all costs. This book shows how God can redeem seemingly hopeless relationships, and it illustrates one of Gary Smalley’s key messages: Love is a decision.Redemption is the first book in the five-book Redemption series about the Baxter family—their fears and desires, their strengths and weaknesses, their losses and victories. Each book explores key relationship themes as well as the larger theme of redemption, both in characters’ spiritual lives and in their relationships.", "title": "Redemption\n      \n          (Redemption #1)", "url": "https://www.goodreads.com/book/show/6568166-redemption", "average": 4.36, "cover": "https://images.gr-assets.com/books/1328322800l/6568166.jpg", "reviews": 861, "authors": [{"url": "https://www.goodreads.com/author/show/3159984.Karen_Kingsbury", "name": "Karen Kingsbury"}, {"url": "https://www.goodreads.com/author/show/7362.Gary_Smalley", "name": "Gary Smalley"}], "type": ["Christian Fiction", "Christian", "Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/6568166-redemption", "http://www.goodreads.com/book/show/11433.Redemption", "http://www.goodreads.com/book/show/8404381-redemption", "http://www.goodreads.com/book/show/6192084-redemption", "http://www.goodreads.com/book/show/6846324-redemption", "http://www.goodreads.com/book/show/289644.Even_Now", "http://www.goodreads.com/book/show/35332.Remember", "http://www.goodreads.com/book/show/97862.One_Tuesday_Morning", "http://www.goodreads.com/book/show/8139321-leaving", "http://www.goodreads.com/book/show/11430.Return"]}