{"ratings": 366849, "userreviews": [{"userName": "Rachel E. Carter", "userReviewDate": "Sep 18, 2014", "userURL": "http://www.goodreads.com/user/show/29482005-rachel-e-carter", "userReview": "[1. “Little lightning girl.” Okay, yea, the way they use her reminded me a lot of Mockingjay. Not going to lie.2. Cal – Shame on you, you hot beautiful prince, you. You were totally scamming AND making move’s on your brother’s girl. I know you are supposed to come off as this nice guy but before Maven turned out to be evil I seriously did not like you. I mean I was totally rooting for you and Mare (*gasps that dance scene*) but I was mad at you for being the popular/likable guy when you were totally secretly making eyes at your brother's wife that you know he's falling for. That said I still loved your romance scenes and I do like you. I will admit to my sickness.3. Maven. Maven, Maven, Maven. Hello Darkling meets Joffrey. Kind of like Malfoy with a heart. Y’all know that scene in Harry Potter I’m talking about:So needless to say I am secretly in love with him. Because I am shameless and always root for the complicated guy and/or villain love interest. #TeamWarnerDarklingMorpheusJaceDamonSalvatoreDaemonBlack -and now Maven.4. This book totally has a love triangle (maybe more, you can never tell with the childhood friend what’s-his-name). But strangely enough I enjoyed it. It played out to my guilty pleasure side. If Maven wasn’t in this book I would totally be in love with Cal, and vice versa. I loved them both. The only other time I have loved both guys in a love triangle was Cassandra Clare’s Infernal Devices series (and even then I still obviously preferred Will, but I was definitely okay with both).5. There were definite clichés/overused tropes:“You're going to be his brother's wife. And he's going to war.”“I am the little lightning girl, and I am going to make the world change.”… but I was down with them. Because tropes & clichés are there for a reason. We all secretly love them. We just don’t love them when the writing sucks.Only trope I hated: the instalove with Cal & Mare, I was cool with it until (I apologize for the rant) this happened:Maven shakes his head. “He [Cal] will always choose you.”>> Really? Yea, he liked her but now everyone was suddenly “Cal will choose you over his country?” Umm. NO. That part annoyed me to no end because while I was down with instalike I was not down with instalove (and I did not interpret Cal as that much of an idiot). Thank the gods that turned out not to be true. It’s cool that Cal hesitated but if he had actually chosen Mare I would have lost respect for him. Instead I gained so much more for him standing up to her and turning her in. Way to go, Cal!!!6. The brother Shade. WTF? Why didn’t the Guard tell her about him if he was still alive? That twist annoyed me. They didn’t suspect Maven so they had no reason to keep it a secret. Maybe I missed something but that was the only plot hole of the book and honestly it was so small I didn’t care.7. Queen Elara (enough said):  “Like any wife, she hates her husband for challenging her, and like any queen, she hates the power the king holds over her.”Now onto my favorite scene… Let’s be honest: it was everyone’s. We all knew a big twist was coming but it was still SO EPIC. And helloooo Darkling aka Maven. I knew you were more than just your brother’s shadow.\"He rolls his shoulders, cracking his bones to chase away an ache. His motions are sluggish and strange, and when he settles back on his feet, hands on hips, I feel like I’m seeing him for the first time. His eyes are so cold.\"The queen was way too much of a biatch to just stand on the sidelines with the most awesome power (Whisper!) of all. \"Because she already knew. Because he is her son. Because this was her plan all along.\"When  Malfoy/Joffrey listened to Cersei Lannister Maven listened to his mother I had this image in my head: Followed by a wish that Mare had her powers back to do this:I LOVED EVERY MINUTE OF THIS BOOK, GUYS. READ IT NOW. I LITERALLY BOOKMARKED EVERY SINGLE PAGE. AND NOT JUST THE MAVEN PARTS, GUYS, ALL OF IT!!!And finally my favorite line of the whole book:“This was the shadow controlling the flame.” Yea, I know, I’m #teamMaven. I know you are all #TeamCal, hence I leave you with this: (hide spoiler)]"}, {"userName": "Emily May", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "I just... can't do it.It was boring, light and silly, and I'm pretty sure I've already read the basic premise of this book in Pierce Brown's Red Rising.I made it to 60% on my kindle and then skimmed for a bit, but I've been attempting to read this book for over a week now and the magic was evidently lost on me. When you're reading a book and you reach a point where you think \"is it too soon to DNF this?\", you know things must be bad. It's so sad, though, because everything about The Red Queen was just screaming \"love me, Emily!\" before I picked it up. It's not because of the love triangle, either. I've said before that an author can easily sell me a well-executed love triangle - so nope, it wasn't that. Let me tell you a sad little truth about this book and I can take it straight from the blurb:Graceling meets The Selection in debut novelist Victoria Aveyard's sweeping tale...That's an odd mash-up to use in your marketing anyway. Like Gone Girl meets Twilight or something similar. But, whatever, there was a rather distinct lack of Graceling in that 60% I actually forced myself through. Maybe it comes later... but I no longer have any interest in sticking around to find out. There was way too much of The Selection's mean girl antics to make this book interesting.The part of this book I read was sooooo slooooow. Painfully slow. We're introduced to a world that had potential but remained incredibly basic, bringing nothing particularly new to the table. There are two kinds of people in this world - Silvers and Reds. The former are the ruling class, have silver blood, and sometimes possess special abilities like mind control and elemental manipulation. The Reds are a slave class who are ruled over by the Silvers and live in poverty.Mare is a Red who, in unexpected circumstances, discovers that she has powers of her own. In order to keep an eye on her and learn more about the powers she possesses, she is disguised as a Silver and trained within the Silver palace. All the other women in the novel instantly hate her (usually for no good reason) and all the men see sunshine radiating out of the pores of her skin (metaphor for \"cue love triangle\").Ooookaayy. And this is the description for Red Rising:Darrow is a Red, a miner in the interior of Mars. His mission is to extract enough precious elements to one day tame the surface of the planet and allow humans to live on it. The Reds are humanity's last hope.Or so it appears, until the day Darrow discovers it's all a lie. That Mars has been habitable - and inhabited - for generations, by a class of people calling themselves the Golds. A class of people who look down on Darrow and his fellows as slave labour, to be exploited and worked to death without a second thought.Until the day that Darrow, with the help of a mysterious group of rebels, disguises himself as a Gold and infiltrates their command school, intent on taking down his oppressors from the inside.Of course, there's a revolution brewing in both books too. And both main characters pretend to be members of the other class. I mean... it's like the word \"Gold\" was just replaced with \"Silver\" and all the socialist angst was replaced with high school bitchy angst.There was so little action in that first 60% that I literally had to force myself through pages and pages of Mare flirting with the Silver prince - Cal - and the prince's betrothed - Evangeline - hating Mare as soon as she set eyes on her. This book was a constant showdown between the innocent MC and the bitchy mean girl (and her gang of mean girls). Hell... you can even match the characters up to their high school cliques. And I'm sure Evangeline's meanness is going to be used as an excuse for Mare to run off with Cal and not lose any sleep over it. Maybe not... but probably.The main problem for me was that the revolution and the bigger war going on between the Silvers and Reds wasn't given enough attention. I felt like the plot relied on the romantic aspect and the angst to propel it along. Neither of which I cared about.Farley scoffs. \"You want me to pin my entire operation, the entire revolution, on some teenaged love story? I can't believe this.\"Across the table, a strange look crosses Kilorn's face. When Farley turns to him, looking for some kind of support, she finds none.\"I can,\" he whispers, his eyes never leaving my face.Blog | Facebook | Twitter | Instagram | Tumblr | Youtube"}, {"userName": "Kat O'Keeffe", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/4672379-kat-o-keeffe", "userReview": "I'm kinda conflicted over this book. It was well written and entertaining, and if it didn't feel so similar to some other books I could have really enjoyed it. But there were just so many elements that had me thinking, \"Yep, I've definitely seen this before.\" There were also some aspects that felt very contrived, so I had to really work at suspending my disbelief to buy into it.Ultimately, I thought this book was an entertaining read, and I totally get why some people are LOVING it. But for me personally it was just too generic, and I didn't feel like there was anything truly special to set it apart from the crowd."}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Oct 22, 2014", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "This was fantastic! I thoroughly enjoyed this crazy adventure of a book. I will say though that it did take a bit of time for me to really get into this book. I also felt the world is still a bit underdeveloped for my liking, but I'm hoping that I gain a better understanding for everything in the sequel. Other than that such an exciting read, full of twists and turns that will leave you flailing all over the place! HECK I'M STILL FLAILING."}, {"userName": "Sasha Alsberg", "userReviewDate": "Feb 06, 2015", "userURL": "http://www.goodreads.com/user/show/10915830-sasha-alsberg", "userReview": "That plot twist though....That betrayal though....MIND = BLOWNRed Queen was fantastic, especially the ending! Wow!"}, {"userName": "Jesse (JesseTheReader)", "userReviewDate": "Jan 18, 2016", "userURL": "http://www.goodreads.com/user/show/8114361-jesse-jessethereader", "userReview": "this was a re-read for me. my original review can be found here: goodreads: https://www.goodreads.com/review/show...youtube: https://youtu.be/kKQ5jusa8fo After re-reading this, I stand by my original 4 star rating and my overall enjoyment of this book. I want to make it clear that I know this book does not have the most original concept and it also uses a lot of tropes, but I still had such a fun time reading it. I love the characters and the shock factor and the world. I can't wait to give Glass Sword a go and see where Victoria Aveyard takes this story."}, {"userName": "Jessica ❁ ➳ Silverbow ➳ ❁ Rabid Reads-no-more", "userReviewDate": "Apr 16, 2014", "userURL": "http://www.goodreads.com/user/show/10336538-jessica-silverbow-rabid-reads-no-more", "userReview": "[Self-centered:The biggest gripe the Reds have with the Silvers is that when they turn eighteen, if they don't have a job (and jobs are few and far between) they are conscripted into the army. The Silvers have been at war for over 100 years, and the Reds have always been their cannon fodder. Fairly early in the book, Mare finds out that her favorite brother (of three) was executed as a deserter of this army. She is understandably wrecked.BUT. When the brother of her biggest rival is one of the Silvers marked for assassination, Mare observes the two clearly close siblings, and thinks:\n\"If all goes to plan, he'll never hug his sister again. Evangeline will have lost a brother, just like me. Even though I know that pain firsthand, I can't bring myself to feel sorry for her. Especially not with the way she holds on to Cal.\"\n\nB/c JEALOUS.But that's nothing compared to when she wakes up in a prison cell with Cal after they've been wrongfully arrested for the murder of the king. When it all goes to hell (as YA books are wont to do in that last 10-15%):1. Cal learns that his evil stepmother the queen used her mind control power to make his mother kill herself.2. His evil stepmother the queen uses her mind power to make Cal unsheathe his father's sword and use it to behead him. His father. Cal beheads him. Himself. WITH HIS OWN SWORD.3. His brother (Maven) stands there and watches.And Mare's first thought?\nMaven has betrayed me. No, he was never on my side at all.\n\n*flares nostrils again*Now would be a good time to bring up how all that heavy-handedness that drove me nuts also made the book incredibly predictable (b/c DUH, of course Evil Stepmother killed the Queen). The second Maven showed up to meet the Red Guard along with Mare, I not only doubted his sincerity, but I also predicted that the whole thing had been orchestrated by his mother in a plot to get him on the throne in place of Cal. The only things I didn't get with pinpoint accuracy were that Shade (Mare's brother) was the lone survivor from the 27 suspicious cremations--I thought all of them were together somewhere, either being experimented on by Silvers or that they were already with the Red Guard--and I thought Kilorn was also an Extra based on Mare's comments about his super-sneakiness. Actually, I still think Kilorn's going to be an Extra. Anyway, it was obvious that Mare wasn't the only Red who had developed abilities, b/c of all the references to her father's \"bloodhound\"-like sense of smell. Moving on. Irrational:My teeth grind together, chewing on the words before I can spit them out. \"Did Cal tell you what happened?\"\"He did,\" Julian replies evenly. \"And he's right. Don't fault him for it.\"\"I can fault him for whatever I want,\" I snort, remembering the war books and death guides all over his room. \"He's just like all the others.\"\n\"What happened\" was that Mare lost control of her power when she learned that Shade was dead. So Mare is throwing a temper tantrum b/c Cal prudently had her training schedule changed to include practicing control of her gift b/c he was concerned she might hurt herself or someone else. Those \"war books\" and \"death guides\"? HE'S THE CROWN PRINCE. His country has been at war for 100 YEARS. Of course he studies battles and tactics, you ridiculous harpy.And when Cal is furious about not being able to fight his own battles:\"I'm a soldier,\" Cal spits, shrugging away from his brother's touch. \"I can't just sit by and let others fight for me. I won't do it.\"He sounds like a child whining for a toy--he must enjoy killing. It makes me sick. I don't speak, letting the diplomatic Maven talk for me. He always knows what to say.\nDo you see why it was so easy to predict the outcome of this little shindig?Inconsistent:\n\"He thinks speeches are a waste of time. Cal likes action, not words.\"That makes two of us, but I don't want to admit I have anything in common with Maven's older brother. Maybe once I thought so, but not now. Not ever again.\n\nUmm . . . ? Her entire thought process there is mind-boggling. Then several pages later:And as much as I hate to admit it, I can't blame Cal for feeling caught between two worlds. After all, so am I.\n*headdesk* (hide spoiler)]"}, {"userName": "Alienor ✘ French Frowner ✘", "userReviewDate": "Jul 23, 2015", "userURL": "http://www.goodreads.com/user/show/31461418-alienor-french-frowner", "userReview": "[and this is what made the \"plot-twist\" not at all surprising. (hide spoiler)]"}, {"userName": "Lola  Reviewer", "userReviewDate": "Apr 12, 2015", "userURL": "http://www.goodreads.com/user/show/14596170-lola-reviewer", "userReview": "4 1/2 stars.\n‘‘You are not Silver. Your parents are Red, you are Red, and your blood is red,’’ the queen murmurs, prowling before the bars of my cage. ‘‘You are a miracle, Mare Barrow, an impossibility. Something even I can’t understand, and I have seen all of you.’’\nI can’t wait for this book to become a movie. Don’t get me wrong, I enjoyed this enormously, but I simply know I’ll love it even more on the big screen. That way, we will actually see, in colour and with all its intensity, the Silver’s abilities, superpowers. Plus, it would be interesting to see how the author imagined her world-building, for I had trouble visualising it while reading.There are cars and screens and cameras… so it can’t be an historical setting (despite the slight vibe of it), but I wouldn’t think it to be a science-fiction one either… or contemporary, for sure. Basically, the author created her own world – which is admirable – melding Dystopia and High Fantasy as genres. The result is pretty impressive, let me tell you.It was relatively easy to immerge into the storyline. I wasn’t surprised to discover that Miss Aveyard is in fact a screenwriter as well as a book author, after finishing this, for everything in the narrative flowed and was clear, aside from being fantastically written. Really, I stand by my claim that this will make a successful movie. Now we just have to wait and see.Mare – the heroine – is incontestably fearless, rather reckless, badass enough but… not a ruler born. She wants the best for her people and tries to free them with as much power as she can muster, but her taking rash important decisions draws affliction to her person and people around her. A lot. Lot. If becoming a queen is her destiny, then she requires some character development. I enjoyed her and her vision of a better world for Reds, but couldn’t exactly connect with her. I’m more of a thinker, ponderer, while she’s definitely a combatant. We could make a great team, heh, the two of us!You know what? There is a love triangle – almost… square? – but it wasn’t a bother. It made sense and, here and there, was actually strategic. Oh, manipulation corners every chapter. If you think that there will be no sacrifices/collateral damages to getting the freedom desired, well then you might be quite shocked! Not devious or as pitiless as the ones in the TV show Game of Thrones, but it wouldn’t please me to be in Mare’s place. I’ll just wait until the war is done to sneak into this world and conquer a prince’s love, *wink* *wink*.Red Queen deserves everything it acquired thus far: thousands of five-star ratings and reviews from readers of all over the world, a discernable tremendous hype that got to me with much force and… its standing as #1 New York Times Bestseller!BD | Blog | Youtube | Twitter | Instagram | Google+ | Bloglovin’"}, {"userName": "Khanh, first of her name, mother of bunnies", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/4527753-khanh-first-of-her-name-mother-of-bunnies", "userReview": "I'm sure it's great if you liked Red Rising. I did not like Red Rising.DNFed this around the 20% mark. I hated the main character. Stupid, selfish, destructive brat intent on destroying the lives of her loved ones with all the makings of a special snowflake. I cannot stand selfishness when it involves harming the lives of innocents. I can't tolerate this character. I can't finish this book. It's been a month since I tried to read on and it's just pointless."}, {"userName": "Ben Alderson", "userReviewDate": "Jan 30, 2015", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "OMG OMG AMAZING! I WILL BE REVIEWING SOON!"}, {"userName": "Steph Sinclair", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "YAAAAAASSSS VICTORIA YAAAAAASSSSSS. It's like an X-Men dystopia stuck in a high fantasy world on crack.Look, guys, don't worry about the love triangle. Actually, calling it a love triangle is very spoilerish and I wish I could further calm your feels, but alas, you must read it for yourself. Immensely loved this with very minor reservations and I can't wait for book 2! Full review to come!"}, {"userName": "Zoë", "userReviewDate": "Feb 19, 2015", "userURL": "http://www.goodreads.com/user/show/9303625-zo", "userReview": "Book 19/100 for 2015UPDATE: Giving it 3 stars because it's only been three months and I've already forgotten everything about this book. I enjoyed reading it, but it was so similar to many other YA books that it's not memorable. WOAH. That was an intense book and I really enjoyed it! I am a sucker for superpowers and this book had such a cool variety of them! I was so into this book that I stayed up very, very late two nights in a row so I could see what happened next. It was a little predictable at times and I can see why people say that it's really similar plot-wise to a couple of other books, but I still liked it very much! I just want a little more world building and a little more romance (I'm always going to vote for more romance, to be honest), but I'm almost positive that that will all happen in the next book!Also, I really want a map for the world! I feel like that would be such a cool addition to the book."}, {"userName": "Regan", "userReviewDate": "Jul 01, 2014", "userURL": "http://www.goodreads.com/user/show/19645927-regan", "userReview": "3.5, over hyped but entertaining enough."}, {"userName": "Sana", "userReviewDate": "Feb 16, 2018", "userURL": "http://www.goodreads.com/user/show/26402455-sana", "userReview": "[Hi, that plot twist was seen from miles away!!! I hope he finds Mare and Cal and then kills them and then rules ruthlessly, have a good day. (hide spoiler)]"}, {"userName": "Navessa", "userReviewDate": "Feb 20, 2015", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "[This seems waaaaaay too familiar *cough* Red Rising *cough* for me to be willing to give it a try. Who knows, mayhaps it's much less similar to one of my favorites than first glance leads me to believe. THAT FIRST GLANCE THOUGH.Red Rising- MC's name is Darrow- Caste society- Low caste is Red- MC is a Red- High caste is Gold- They have god-like powers- MC infiltrates their ranks- MC is key to the rebellionRed Queen- MC's name is Mare Barrow- Caste society- Low caste is Red- MC is a Red- High caste is Silver- They have god-like powers- MC infiltrates their ranks- MC is key to the rebellion  (hide spoiler)]"}, {"userName": "Aimee ♥ | Aimee, Always", "userReviewDate": "Jul 28, 2014", "userURL": "http://www.goodreads.com/user/show/5478965-aimee-aimee-always", "userReview": "Reading Red Queen was like receiving sour candy when you were expecting some glorious sugary sweets. I just felt so much disappointment after turning the last page, since I was expecting a fresh new story out of this one.This book had so much potential, but after a few chapters of reading, I got this sense of déjà vu, and yup, you guessed it, this book was a cardboard cut-out of all your favorite YA novels put together.Exhibit A: There are the Reds, slaves the Silvers, who are amazing beings with odd powers. The Reds don't do much to escape their current living states and go on being doormats throughout the book, until a certain figure of strength (the heroine) supports them. A very common dystopian trope.Exhibit B: Mare Barrow is the reckless \"Savior of All\" who is eventually blinded by her romantic interest. Yes, Mare can be considered badass with her unique ability and sassy attitude, but she felt like your typical Mary Sue for me. And when her two love interests come along, she thinks of them both constantly and rather obsessively.Exhibit C: Yes, the customary love triangle square is present. Mare is drawn to two brothers (should I mention that they're princes?) but is more attracted to the older, more mature one (who, by the way, I think is as interesting as a brick). I like the other brother's character, but there's definitely zero chemistry between him and Mare. There's also your resident Queen Bee, Evangeline, who seems to hate Mare the moment they lock eyes.Another iffy thing about the book was the lack of a backstory. Sure, I enjoyed all the Red vs. Silver propaganda, but I would've liked to find out how everything became the way they are now. Maybe the next books will give me that.Overall, if you're one of those people who reads and loves all those popular young adult books out in the market today (as well as The Selection-esque type books, I really believe that Red Queen will be a good fit for you."}, {"userName": "Wendy Darling", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/2745288-wendy-darling", "userReview": "Please be good, please be good."}, {"userName": "Lia Bonnibel  (pidgey) ", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/66222749-lia-bonnibel-pidgey", "userReview": "“I am finally learning my lesson. Anyone can betray anyone.”\nred queen by victoria aveyard? more like red queen by victoria graveyard, because that's where this book put me.No, okay, listen.Let me explain why this book was a no-no for me.We could say most of my problems with this book are to blame on wrong timing. I'm firmly convinced that if I read it something like six years ago, I probably would have liked it. Not loved it, but it would have definitely gained a couple more stars and a bit more attention from my part.Unfortunately, I picked it up too late, once I've eventually had my chance to read around and already managed to juggle my way out of the various The Hunger Games, The Selection,Divergent, Red Rising and the rest of the merry dystopian brigade.So it left nothing to discover and this book didn't bring anything new to my reading experience. It's not even about it being similar to other books, I promise. I mean, I don't mind parallels, but we're talking copy-pasting of plots, here. To me, Red Queen felt like large bowl of minestrone made from scraps of those novels above, with only the tiniest and faintest bit of originality that were still too weak to get me hooked. Maybe if it wasn't for all this, I would have found it entertaining and thrilling, instead of boring and dull, but being completely honest, if it wasn't for this, we would also be talking about a different book. Different being the word. You can change the factors only a determined number of times, but in the end, the final product stays the same. Want an example? I have tons. We have, in fact, the One not-like-other-girls girl who's going to save the day because who else could?; the caste system where the poors are poorer and the riches wear weird clothes; the brother-like best friend who is an obvious pining mess; the family fueds; the lies; the prince (even if this time we have even 2!); the cover marriages; the bitchy rivals; the rebels; the politics conspiracies; the inevitable love-*insert random geometrical shape*....Now put all this together and you could really be talking about any or every one of those books. Seriously. You name it, Red Queen has it.\nTo be honest, I'm not even sure the concept behind this book is that bad, after all, it just was deadly trite, and it definitely wasn't for me. Add to this that I didn't particularly like any of the characters (truth be told, I sort of don't dislike Maven, but only a little) enough to be interested on their lives, personal issues and developments, and you'll have an idea of what's keeping me, from this moment on, at least twenty feet away from this series. I liked the writing, though, reason for which I decided to give the author another chance. That is, as long as it doesn't involve dystopian worlds, cheesy romance and The Bachelor-like subplots. pre-reading review (which, if you ask me, turned out to be kind of accurate)Do I know what I'm getting myself into? Yep.Am I going to need therapy after this book? Maybe. Does the premise of a love triangle (square? pentagon?) bother me? Definitely. Is this book going to make me want to flip tables? Probably. Am I going to regret reading this book? Eventually.Am I really sure I should read it? AT ALL. Let's do this!"}, {"userName": "Mohammed Arabey", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/13592557-mohammed-arabey", "userReview": "10% 1984 + 15% Hunger Games + 10% X-Men + 10% Games of Thrones + 15% Divergent..That'd leave us with only 40% of Original Red Queen..Don't get me wrong, I enjoyed it ,I may even held extra +rating till part 2 if it gets more of the Original Red Queen storyline..What really bugs me here was the many Deja vus from HG and Divergent since I didn't like the latter's plot much.But let's see step by step with The Red..The Plot and the Setting--------------------1-10% of 1984In an Orwellian atmosphere of Destopia, we're in Norta, a country that in a constant war with neighbour countries..The Elite push the low class citizens into Poverty..and fight in wars..And to kill any think of a rebellion ,they're watching Everyone, even -specifically- those closed to the king in the Palace.'Camera's are everywhere' and the communication means between the low class almost nonexist..although there's a good technology there.\n\n2- 15% of Hunger GamesEvery boy and girl of the low class, once turned seventeen, must go to Conscription, unless working for someone... and they who just fights in the front lines onlyBy the time they finish their time they are lost an arm, a leg, or just dead..The workers always paid low of course, and there's this part of Norta -this district- where just factories and technology workers, it's very polluted that skies are dark with smoke , the people in this district can never see the sun..oh , and there's a nuclear polluted area -district-as well, that the elites and government 'believe' it can't be crossed -Does the revolutionaries believe that too?\n\nTo show how powerful the 'Elite' are , just to erase any rebellion ideas, every first Friday the low class are forced to gather and witness dangerous arena fighting between two of the elite...WHAT? HOW?3- 10% of X-Men The Elite are Silvers...Silver blood...they have supernatural abilities , mutant powers... such as one can control wind , one can move ultra fast, one can control metal, ....etc..\n\nat this world they are the elite, they who rule the normals, powerless humans, the Red bloods, Reds.4- 10% of Game of ThronesThe Silvers families are houses, Every house has a certain ability and power..They're all Elite , yes..but there's major big houses and some mundane ones..Every House has certain 2 colours or more, used for costumes..There's a big party for the King's son,the Prince..the heir of the Throne to choose a wife from one of the big houses, The chosen princess , the Future Queen..And every girl show the power of her house..so this party is actually a girlie Game of Thrones...What's really bugged me here that it supposed to be modern, in the future...a dystopia... but the whole references to villages, markets, houses,swords,places and Kings and thrones, and mixing that with cameras, electricity , guns..aeroplanes and under-trains made me keep distracted between visualising the novel in my head as old times, and new futuristic one..5- 15% of DivergentHERE comes our Mare, The Red... who is just a normal Katniss Everdean-like , law breaker, have a sense of rebellion..yet it's her sister who have work and support the family after her 3 brothers went to the army..so will she when she 17.\n\nBut everything change when she tried to save her best -kinda only- friend with help of some revolutionaries, and then meeting a charming Cal/the Prince...The Heir to the Throne..And only when he helped her to work at the Palace as a servant, and while the Game of the candidates princesses and future Queen is on, a huge revelation about Mare is just Out...She has Power..just like the Silver Bloods..She can control Electricity, and even more powerful than the Silvers...she , the Red , has powers of the silvers...She's the Little Lighting Girl..And by the story goes, you'll see how it like Divergents in the Divergent series, tracking and hunting them down...But with a new story of Love, some of it totally unconvincing. And a new Betrayal story that's totally very good written, although a bit predictable for me..So now you know all the basic story line..Can't say I didn't like it...I did since I love most of the elements , but the mix was confusing me a lot with the style of old kings era and the new tech.**********************The Characters-------------I didn't like Mare that much, her relation with her friend was very annoying to me , may be because of his shallow character ...but can't deny that I get attached to her by the final chapters which was thrilling.The rest of the characters were ranged from very good to very shallow or just similar to other characters of the previous 5 major novels..I liked Maven , he's very well written, Cal was perfect most of the times too...so does the Queen...who reminded me a bit with Queen Cersei Lannister from GOT. The Old master Julian and his back story was good to although remind me of The Giver's master Also I wished to shed more light into the world before...but can't hope much..Will wait for the next part..I really hope it'd be better and more original...PS: A big respect to the author for her 'Aknowledgement' part where she mentioned many authors, Directors and Screenwriters that inspired her..and mentioning J.K. Rowling and George R.R. Martin' ..Mohammed ArabeyFrom 1 Aug. 2015To 4 Aug. 2015"}, {"userName": "~Poppy~", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/59201076-poppy", "userReview": "“I am finally learning my lesson. Anyone can betray anyone.” \n\nOhhh Goddd!! What a plot twist. In the entire book I was like:hmmm team Cal. No!! Team Maven.. Hmm Team Cal.. Team Maven.. Team Cal&Maven :PAnd then:I did not see that coming.. Julian was so right!!!\n\n\"He is his mother's son.”\n\nWhy???Why?? Why did he do that to us??I loved him.. \n\n“I told you to hide your heart once. You should have listened.” \n\n\n\n\"Cal betrayed me, and I betrayed him. And you betrayed us both, in a thousand different ways. I choose no one.” \n\n I am sorry.I see Mare's betrayal and Maven's (obviously)... But I don't see Cal's betrayal. He never lied to her. She just assumed that he will go against his beliefs and his father? Okay!Elara!!!So, what team am I?#teamCal"}, {"userName": "Kiki", "userReviewDate": "Oct 29, 2014", "userURL": "http://www.goodreads.com/user/show/4074594-kiki", "userReview": "[I don't know why it's made out that electricity can stop projectiles, or cannot penetrate through water. Water is a conductor, and if Evangeline is hurling metal at Mare's head, a wall of electricity isn't going to stop it. I guess you could say that if Evangeline's power is to create magnetic fields, then Mare's lightning interfered with that, but that's really clutching at straws and there's no evidence that simply applying a shock of current to a magnetic field will block it. In fact, hardly anything can block a magnetic field; it's a powerful force. Can Mare create forcefields? That's never really solidified. (hide spoiler)]"}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Jun 14, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "A lot of people were mentioning that this was like a lot of different dystopian books and while I agree, I still think this is worth the read.I enjoyed the world, the magic system... even with the romantic bits.I definitely saw parts of the ending coming but it was still entertaining!Will be continuing the series!"}, {"userName": "Jess", "userReviewDate": "Jun 30, 2014", "userURL": "http://www.goodreads.com/user/show/17389678-jess", "userReview": "It’s getting a little hot in here, isn’t it? That’s because Red Queen has unearthed what I never thought could occur: A mini Darkling. That’s right. Yet another morally ambiguous character and I am sold.\n I’m a book pusher and I’m going to push this one right into your hearts. Red Queen is the fantasy that I’ve been searching for. You’ve probably all heard the comparisons before and honestly, they speak the truth. Red Queen took the best elements from all our favourites (and our not so much) tales and smushed them into one phenomenal book with an equally addictive storyline. Yes, this is indeed an Xmen high fantasy and yes, my heart did stop. Aveyard has ticked all the right boxes for me. She’s a heck of a debut. Red Queen begins as all high fantasy dystopias do, with a young unassuming girl slumming her way through her rather unfortunate situation only to discover that she’s special. Yes, that does sound mildly sarcastic. Yes, this did have the “You’re special” line. But you know what? I’ve come to a point in my life where I’ve realised, do YA fantasies do it any other way? It feels like a genre requirement at this stage and who am I to complain when a hundred and one others do the exact same thing. Mare Barrow is a highly agile pickpocket. It’s the only means with which she can support her family. But time is running out. Like her brothers, she sees a future of conscription for herself. Her eighteenth birthday is looming and without a job to pardon her, she is set to enter the frontline. And it scares her. The thought of war, the thought of leaving her sweet, innocent sister behind, the thought of waving goodbye to her parents, yet another member of the family unable to support them. However as life may have it, her seventeen years of familiar suffering are about to take a different turn. As in, she’ll suffer, just at different means. You see, Mare is discovered to be an impossibility, the secret that could topple an already precarious hierarchy. Society is ruled by the silvers. They are a race seemingly set apart by God. They themselves have usurped the title. As abnormalities defying the mundane genetic makeup, they are creatures to be feared. You can go either two ways with that—to the ditches or raised up on a throne. The Silvers are blessed with the latter. They are Gods in the arena of life. \n\n “Long ago he called us ants, Red ants burning in the light of a Silver sun. Destroyed by the greatness of others, losing the battle for our right to exist because we are not special. We did not evolve like them, with powers and strengths beyond our limited imaginations.”\n\nTheir inhuman capacity to bend the elements has crafted an illusion of invincibility. Reds however bleed red. They are mortals, cursed to a life of servitude. \n\n “…no one pays attention to another Red servant, another insect wandering past the feet of gods.”\n\nAnd a society without equality? It’s a dangerous tower, begging to topple over. As a Red with a Silver aptitude, Mare is dropped into a dangerous game. It is a political desire that keeps her alive. While her days are limited to however long she can keep in line, Mare is given a route out of the slums, away from her fate of war. In a bid to placate the hunger for a rebellion, she becomes a Red in disguise as a Silver, betrothed to the King’s second son. From there on out, it is a game of chess. \n\n\"A puppet. A show to keep people happy, quiet, and trampled.”\n\n Alliances must be won and bought. Secrets come at a cost. What I adored about Red Queen is the concept. It was delectable. The abilities reminiscent of XMEN add a unique flavour to the mix. The world building was neither underwhelming, nor overwhelming. Aveyard interweaves all facts and ideas into her intricate world in a fluid manner. We also see elements of The Selection added to the bag, only without the pettiness. We enter Aveyard’s world just as Crown Prince Cal is set to be engaged. The Queenstrial is set in place as a selection process. Only, instead of vying for the Princes attention, it is a little more of a family affair. These Silver women all hail from families equivalent to dukes and duchesses. It’s a bloodbath, not between the ladies, but between the families. And they’re all out to impress one person: the king. You see, it’s all a ploy, for the Queenstrial is merely a selection process for political ties. The marriage is a means to an end, an cementation of an alliance. And in that arena there is only one thing that prevails: strength. Power and strength are two concepts that could happily marry one another, and in Red Queen, they certainly do. The action sequences were incredible. Red Queen digs a little deeper, exploring political themes, alliances and the ultimate consequence of repressing a race. \n\n “This world is Silver, but it is also fray. There is no black and white.” \n\n It, like all dystopias, tells the tale of a fight for liberation. Humanity does not wish to be oppressed. It craves expression. And the structures that have carefully restricted the Reds, barricading them into one route in life, threatens to crumble with the dawn of every new day. \n\n“You believe you are the masters of the world but your reign as kings and gods is at an end.” \n\n Unlike other dystopias, we deal with life at court in Red Queen. And in that instance, there is a heavy influence of political ploys, deceit and games. It is a battlefield and it is the explicit who fall first. The shadows, those who play their cards, are the ones who ultimately have the upper hand. \n\n“I’m the shadow and no one remembers shadows.”\n\n Red Queensets a question for the new dawn: Can those who cheat one another overlook perfidy in order to band together against an ultimate enemy who has betrayed them all? For a debut novel, Aveyard writes stunningly. While she does not hold the outright lyrical styles of the likes of Bardugo and Stiefvater, she writes with a balanced combination of short, concise simplicity with an ounce of lyricism every now and again. It is a prose that will be likened by many. Often with high fantasy tales, humour can be disregarded, however I appreciated that Aveyard knows a little thing about sarcasm and banter and she incorporates it brilliantly.\n\n“You want me to pin my entire operation, the entire revolution, on some teenaged love story? I can’t believe in this.” \n\n I’m going to hug Aveyard. I love the dig she took at the conventional dystopia. My little heart is swelling with pride, considering this is a topic I tackled in a critical essay of mine (which I also refer to as my baby. You know, casually.) I enjoyed a good laugh here and there. The characterisation was fantastic. We have a set of characters that are tenuous in their beliefs but deep down they are flawed. Tragically, deeply and realistically. Mare Barrow reeks of desperation. She’s in it to survive. She knows the stakes and I appreciated her character growth as she realises that there is a greater cause at hand. Cal, the crown prince, lives under the delusion of hierarchy. It is a precarious structure that he is set to rule and he understands the pros and cons—it is easier to maintain dictatorship then it is to liberate. And he attempts to seek the easier route. Maven, my little puppy, lingers in the backdrop, the second son to a kingdom that will never be his. He is demure, quiet but he is steadfast in his belief. Despite his apprehensiveness towards Mare, he finds himself intrigued by her. And he’s just a little sweetheart. But I know that you’re all here to hear about the romance. I get you. We all know that there’s going to be one. And there is. One that I ship so incredibly hard. In fact, I may even ship the politically incorrect side because god knows I have a thing for sociopathic characters. They feed my curiosity. I’m intrigued by the unknown. \n\n“He knows what he is and, worst of all, he likes it.”\n\n Humbleness and good intentions do not faze me. Some may say that this is a love triangle. I’m going to go right ahead and say that it may not even be a romance, at this stage. If anything, Red Queen is playing down a dangerous path, one reminiscent of Bardugo’s infamous Grisha series. That’s right, I said it: We have a Darkling. You know how I feel about that. Of course I’d gravitate towards this book. That being said, this book reeks of betrayal. Love thrives off trust, connection, understanding. What brews in Red Queen is dark, delicious and destructive. Neither party will foster a healthy relationship. Now I don’t want to speak too soon, considering I did an incredibly silly thing by reading this in 2014, but Red Queen has got to be my favourite fantasy set for 2015 thus far. That’s a bold statement to make, considering we haven’t even entered the year yet. I am however willing to take that risk. You see, Red Queen just explores a winning formula for me. We are at the brink of a revolution funded by the desire for revenge. It is justifying darkness in hope of pursuing lightness, liberation and levelling the amount of pungent injustice. And that is begging to fail. And I want to see that unfold. Many thanks to the publisher for providing an advanced copy in exchange for an honest review. All quotes used were obtained from uncorrected proof that is subject to change in the final publication.___________________ \nTwo words: New Darkling. Read at own risk. Something's coming. Like my full review. \n In the mean time, I'll be quick and vague. This is Xmen put in a cake mix with Shadow and Bone and The Selection (DON'T BE PUT OFF. I mean this in that we have a Selection BUT it is not a petty, shallow, fickle show of swinging back and forth. DO NOT EVEN COMPARE IT TO THAT.) We have a protagonist we longs to survive, a crumbling hierarchy, a delusional view of justice and peace and a war of strength and power. The stakes are high. It is what appears to be a love triangle but honestly, it's not that in any sense. These characters are destructive, they are flawed, they shan't have a happily ever after. And they've cracked my heart in half, to be honest. I'm drowning in my emotions here. Go preorder or something. This is beautiful. I'm book pushing this for 2015, alright?"}, {"userName": "Adam Silvera", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/4050629-adam-silvera", "userReview": "Finished my reread on audio! Love the narrator. And this read was extra fun since I knew all the major twists and got to watch the characters barrel into danger and deception. Jumping into GLASS SWORD today for the first time. RED QUEEN binge, yay!Here's a review I wrote back in 2015 for Shelf Awareness: Victoria Aveyard's thrilling debut throws readers into a futuristic fantasy world of clashing countries, segregation and a rebellion that depends on a young thief.In the country of Norta, the Feats of First Friday are held every month in city arenas. Champions with Silver blood compete against one another using their supernatural abilities to entertain audiences of other Silvers and the lowly, powerless Red bloods that serve them. Mare Barrow, a 17-year-old Red, knows these fights are meant as a reminder that any act of rebellion will lead to punishment or execution via the Silvers' many abilities--mind control, telekinesis and super strength among them.To save herself and her war orphan friend, Kilorn, from conscription, Mare is pickpocketing Silvers in the small city of Summerton. There, a group of insurgents called the Scarlet Guard rise up against the Silvers, bombing a castle in the capital in the hopes of eliminating the Royal Court. She fails at her mission due to the ensuing riots, but an attempt to pickpocket a boy named Cal serendipitously lands her a job as a serving girl at the summertime castle of King Tiberias.Mare learns Cal is the crown prince, set to marry another Silver girl, but that surprise is superseded by Mare's discovery that she possesses lightning talents that no Red has exhibited before. The court covers up her talents by posing Mare as a long-lost daughter of a Silver war hero, to be engaged to Cal's brother, Maven, which they hope will placate the rebels. But if one lie from the king can save her life, another lie may take it.Class tensions run exceptionally high in this serie's first installment. Mare's suspicions keep her sharp throughout; even when she's aiding the Scarlet Guard in taking down the king, she remains wary of the rebels. (\"Anyone can betray anyone,\" she often reminds herself.) She commits to the charade of Lady Mareena not for her own life, but to save her three brothers and Kilorn. Cinematic fights aplenty and deception amongst characters propel readers deeper into this world of power struggles. For the players who survive this first round, Aveyard sets the board for the sequel. A gripping, high-stakes game of power and betrayal, Red Queen is an easy pick for those seeking electrifying action and royal settings with a touch of romance. ORIGINAL REVIEW IN 2014Full review to come in January, but for now, know that one minute my feelings were here, the next minute they were over there, and then a storm rolled through and demolished everything I thought I knew and killed someone I love. You've been warned, friends."}, {"userName": "Lainey", "userReviewDate": "Feb 18, 2015", "userURL": "http://www.goodreads.com/user/show/22889537-lainey", "userReview": "UPDATE: to watch my non-spoiler book review + book talk on RED QUEEN click below:https://www.youtube.com/watch?v=Cl0-p...I have a lot of feelings about this book. Few of them are good, some... aren't so good. I actually knew I wouldn't truly be able to rate it until after I thought about it for a few days, and I'm pretty content with my rating as of now.There is a lot of hype surrounding this book, that much is obvious. I read it for the Carpe Librum Book Pick of the Month for February. Overall, I'm a tad disappointed with all the hype because I was expecting this amazing new YA novel. In the end, I knew this wasn't the greatest debut novel, or start in the trilogy I've ever read. In the end, all I can really say is:I've read this story before.Many many times.Before I get into that, I wanted to first mention the characters. Mare was a typical wishy-washy indecisive YA heroine. To say she was annoying is putting it lightly. For the three main dudes of the story, Cal, Maven, and Kilhorn. I don't have too much to say without giving away plot details, but I think I liked Cal and Maven's interactions the most out of any relationship in the story. There was just something there between the two brothers that I really enjoyed.The world-building. Interesting enough, it wasn't until after I read it that the author actually envisioned a Grecian/Roman society with electricity. Yeah... I didn't get that at all. The \"battles\" in the beginning reminded me of gladiators, but the actual setting of the book? I didn't get Rome at all, which is a damn shame I didn't because I would have really liked that visual. Maybe the descriptions should have catered to a Rome/Greece setting which I don't believe it did. I ended up envisioning a Panem, which... didn't really help the cause (see below.)The powers. The Silvers are born with powers, the Reds are not, therefore the Reds are essentially the slaves. This was an awesome concept. However I felt like the rules on the Silvers' powers weren't explained, didn't have limits where there should have been. The Queen is a whisper, therefore she can root through people's minds, control them, etc. While I was reading it, I just couldn't buy into Mare's conspirating plans with the rebels when the queen is right. there. It left me thinking, 'Why isn't the Queen squashing all these plans?' It was a huge flaw for me because this is a major part of the book (and length of the book.) The powers for the Silvers worked to a point, but only when it benefited to the plot of the story. Then they went into the weird loop-hole, unexplained limbo. There needed to be cap on how much power was too much for these Silvers. It made them less human and left me thinking of too many plot-holes.However, this year, I have been paying A LOT of attention to the writing. I thoroughly enjoyed the way RQ was written. The pacing, transitions, everything was very well done. I honestly had a very hard time putting this book down once the action started to rise towards the climax. The book could have done with a lot less \"perfectly arched eyebrows\" tbh.The romance is pretty light in the book and meh... it didn't stir any feelings in me. I don't ship Mare with anyone. Actually, I preferred them all separate. Individually, they were ok characters and I didn't really think the romance was particularly necessary. I do wish the author would have built the relationship with Cal and Mare a whole hell of a lot more. I would have felt something at the end moreso than I did because I didn't... I don't know, feel those \"stakes\" as they were so-called \"raised.\" A few dance lessons and looks at dinner parties wasn't a \"love\" relationship to me.So, now onto the fact that I felt I already read this story. I was reminded WAY too many times of other YA fantasy/dystopian books. Just off the top of my head I thought of all these books while I was reading: The Hunger Games, The Gates of Thread and Stone, Cinder, The Darkest Minds, The Selection, Throne of Glass, and lastly Shadow & Bone. To me, that was just too many. I mean sure, books remind us of other books all the time, but this was the first time where I saw way too many similarities that it took me OUT of this story many times. There was a disconnect between me and the book. And I also want to list some of these similarities so below are some slightly spoilery plot points, but not huge ones that would ruin major plot twists:The Hunger Games:- Mare has a perfect younger sister named not-Prim, but she might as well have been.- The government is using Mare to distract from the real problems in the society.- Furthermore, the rebels are using Mare as the face of their campaign to take down the government.- Kilhorn is the pre-page one love interest aka Gale, who joins the rebellion because... he's Gale.- Tributes... I mean Silvers try to one-up each other in the training room before being put in \"arenas\" for one-on-one battles.- Maven is known for his words and speaking to the public (where is brother, Cal fails at,) much like Peeta is. (Also, Maven points out his favorite bakery to Mare when they get to the capital. Does he decorate cakes, too?)- Mare's government-issued speech to the Reds had me like, \"Panem today, Panem tomorrow, Panem forever...\"Shadow & Bone:- These similarities aren't as obvious as THG ones were, but the again Kilhorn reminded me of Mal, the fact that both were fast-tracking it into the army for this never-ending war just reminded me too much of Shadow & Bone.- Also the fact that Mare comes into her powers under strenous circumstances and because that special gurl people either hate or trip over was very much how Alina's character arc was formed.Cinder:- Meeting the Prince outside of the palace and forming this bond and special connection, giving no one else a chance.The Selection:- The Queenstrial is literally the entire Selection Trilogy summarized in like two chapters. (but bravo RQ on that one xD)So for me, RED QUEEN just... didn't feel original to me. It's YA recycling at its best. And that was a shame."}, {"userName": "l a i n e y", "userReviewDate": "Feb 15, 2017", "userURL": "http://www.goodreads.com/user/show/10752235-l-a-i-n-e-y", "userReview": "Time moves slowly when you're waiting for something good. The fact that Aveyard just bashed her own book,  in her own book  either means she's a real riot and cleverly self-deprecating OR she really had no self-awareness. Judging from the protagonist in her story, I'd lean on the latter. •••••••••••••••••••••••••••••••••••••••(semi) buddy read : Belle & Frankie"}, {"userName": "Steysha Kravits", "userReviewDate": "May 02, 2013", "userURL": "http://www.goodreads.com/user/show/9946057-steysha-kravits", "userReview": "Me after the end of the book:It`s soooo good, guys! Can`t say that for sure, but I guess it`s the best dystopian fantasy of the year! Everything you loved from The Selection, The Grisha trilogy, The Winner’s Curse can be found here! The plot is furnished with mystery and intrigues of the royal family, forbidden love, the will to win, the inequality between the two races and, most importantly, the revolution! Along with Mare, we will rise from the bottom of Reds to high top of Silvers. This book is simply must-read!Mare Barrow is Red, and this determines her identity. She's a thief from a large family, trying to survive in a cruel world, where her life is not valued. Soon she must go to the war – as usual, the battle for lands – where she will serve as cannon fodder while real warriors would sit in the palaces and dance at the ball. And she almost resigns to her destiny, if not for one thing - her best friend, who had formerly been safe, now has to go to the war too. She took care of him since their childhood, and she’s not going to change her habits now. Mare will do anything to save him. After an unexpected acquaintance, the girl is thrown in the royal palace, where she gets a job. But, in an instant, her life takes a new turn. After some accident, the royal family decides to replace her identity of the Red girl with the role of the missing daughter of one of the Silver war heroes, and to marry her to their younger prince. Mare has no choice: either she becomes a princess, or death.\nThey`ve pulled me inside out, swapping Mare for Mareena, a thief for a crown, cotton for silk, Red for Silver. This morning i was a servant, tonight i`m a princess. How much more will change? What else will i lose?\nSo, she falls into the maelstrom of intrigues, meets with two princes (yes, a love triangle), and joins the ranks of the Red revolutionaries, trying to save her country, people and herself. Let's talk about the world, created by Victoria Aveyard. Here, people are divided by blood: red and silver. Slaves and rulers.\nWe didn`t evolve like them, with powers and strengths in our own bodies. The world changed around us and we stayed the same.\nReds are ordinary peasants, working day and night to ensure the comfort of Silvers. They are people who have lost hope and strength for surviving. Because their blood does not give them supernatural powers, they are not important. Reds are used as a cannon fodder in the war, they don’t have proper equipment and thereby no real chance in battles. They work in factories, in areas with radiation, and the luckiest are allowed to work as a servants of bitterly hated Silvers.\nWe will rise, red as the dawn.\nLiving under such oppression, Reds decide to rise up and gather a group of revolutionaries – the Scarlet Guard. Despite the lack of special abilities, they believe that they will be able to overthrow Silvers and take their rightful place in the society. Regardless of the consequences...\nIn school, we learned about the world before ours, about the angels and gods that lived in the sky, ruling the earth with kind and loving hands. Some say those are just stories, but i don`t believe that.The gods rule us still. And they are no longer kind.\nSilvers are an X-men. Seriously, they control the elements, people's minds, metal, have a supernatural powers. Mare, albeit her red blood, controls electricity. They are special, privileged, live in luxury, and do not know fear. They are greedy, spoiled and always use their status in the society. Reminds me of this guy:Among them are telkys, greenys, nymphs, strongarms and many more. Throne is passed through the male line, and the queen is selected by her abilitys - because they are in a state of a war, and their kingdom should be ruled by the strongest. Generally, they don`t care about Reds - these people do not know mercy. But not all of them.Cal is a Silver Prince, heir to the throne, a great warrior and just a handsome guy. By all measures, he is suitable for the position of the king: he is not deprived of kindness and human qualities. But he grew up in a Silver family, and though he sympathizes with Reds, it doesn`t mean that he intends to change the history and make them equal to Silvers. Maven – the younger prince, the son of the most evil Queen and Mare`s groom. Because of his childhood trauma, he decides to help the rebellion, though it`s not easy, because by that he betrays his own kind.When Mare comes to live in the palace, she is torn between these two guys. She really likes Cal, but they cannot be together because of their political views. On the other hand, Maven - the perfect match. And if at first the advantage was on Cal`s side, with time, the girl starts to show more and more feelings toward her fiancé - because he is on her side. What I liked most is that Mare is not a naive fool. Forbidden love didn’t cloud her head, and she knew perfectly well that she could not be with Cal, so she didn’t try. Moreover, she decided to use his feelings to win a battle! That's what I call a plot twist! Overall, this love triangle is different from those we are used to, where the girl can’t decide who she loves and flings between two great guys.Luxury of Silver life didn’t change Mare, and even though she pretends to be Silver, she remembers where she came from. Shel struggles to fit into the royal family, while making plans to overthrow them with the Scarlet Guard. Along the way she finds new allies and new enemies. For example, Cal`s bride - Magneto - Evangeline. Their gladiatorial combats were gorgerous!All in all, this book offers excellent battle of titans, smart strategies that can compete with The Winner's Curse, a non-standard romance and everything you can ask for from a dystopian fantasy. Victoria's writing style is simply superb, and I can’t believe we have to wait so long for the sequel - it's hell of a torment!And don`t forget, in this story: \nAnyone can betray anyone."}, {"userName": "Maureen", "userReviewDate": "Jun 06, 2015", "userURL": "http://www.goodreads.com/user/show/10762033-maureen", "userReview": "3.5/5I went into this expecting it to be terrible and it really wasn't that bad! Definitely not the best, but not at all terrible. It's an interesting concept and story, but a few elements fall short. It's SUPER predictable, even if you don't catch onto foreshadowing most of the time, and the romantic elements were not great. You'll also need to suspend your disbelief at many points in time, but when don't you need to do that in a YA fantasy book? (Answer: not very often) However, I really enjoyed the world and the magic element (even if it probably needed a bit more development) of it as well as the writing! It moves really fast so it's a pretty easy read, and if you're looking for something quick and not difficult to get through, this is a good option!I'm interested to see what happens in the next book, but it won't be the end of the world if I never read it.REREAD THOUGHTS:I still give this a 3.5/5 stars. It was so close to a 4 but Mare is SUCH AN IDIOT sometimes that I couldn't. That being said, I enjoyed this so much this time?? The audiobook is A+ 10/10 would recommend. Even though I knew things were coming I was still SHOOK. Now I can read the rest of the trilogy since it's completed now so #funtimes."}, {"userName": "Jessica", "userReviewDate": "Mar 03, 2015", "userURL": "http://www.goodreads.com/user/show/12842423-jessica", "userReview": "3.5 starsDefinitely have some mixed feelings about this book.This started out SO GOOD. I LOVED the whole idea about being divided by blood, and the silvers having these awesome powers, etc.. (I'm going to love any story involving awesome powers like this - The Darkest Minds trilogy, The Shatter Me trilogy, X-Men, etc...)I loved (and hated) all the betrayal and the fact that you never really know who you can trust.. that ending. Man was I shocked......but then I found myself losing interest. Towards the middle I was just kind of hoping it would be over soon. I found that I wasn't invested in these characters which is HUGE for me.. I just wasn't connecting and I found myself thinking, who cares if she is with Cal, Maven, or whomever.Unfortunately, this story just kind of dragged for me, and although it ended with a bang, I'm a little let down by the book as a whole. I will be interested to pick up the next one though to see what happens! I have to after that crazy ending!"}], "description": "This is a world divided by blood - red or silver.The Reds are commoners, ruled by a Silver elite in possession of god-like superpowers. And to Mare Barrow, a seventeen-year-old Red girl from the poverty-stricken Stilts, it seems like nothing will ever change.That is, until she finds herself working in the Silver Palace. Here, surrounded by the people she hates the most, Mare discovers that, despite her red blood, she possesses a deadly power of her own. One that threatens to destroy the balance of power.Fearful of Mare's potential, the Silvers hide her in plain view, declaring her a long-lost Silver princess, now engaged to a Silver prince. Despite knowing that one misstep would mean her death, Mare works silently to help the Red Guard, a militant resistance group, and bring down the Silver regime.But this is a world of betrayal and lies, and Mare has entered a dangerous dance - Reds against Silvers, prince against prince, and Mare against her own heart...", "title": "Red Queen\n      \n          (Red Queen #1)", "url": "http://www.goodreads.com/book/show/17878931-red-queen", "average": 4.07, "cover": "https://images.gr-assets.com/books/1411472322l/17878931.jpg", "reviews": 34680, "authors": [{"url": "https://www.goodreads.com/author/show/7074943.Victoria_Aveyard", "name": "Victoria Aveyard"}], "type": ["Fantasy", "Young Adult", "Science Fiction", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/17878931-red-queen", "http://www.goodreads.com/book/show/22328546-red-queen", "http://www.goodreads.com/book/show/22706899-red-queen", "http://www.goodreads.com/book/show/22328558-red-queen", "http://www.goodreads.com/book/show/23174274-glass-sword", "http://www.goodreads.com/book/show/30226723-king-s-cage", "http://www.goodreads.com/book/show/25005214-queen-song", "http://www.goodreads.com/book/show/25944381-cruel-crown", "http://www.goodreads.com/book/show/25362018-steel-scars", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}