{"ratings": 3745, "userreviews": [{"userName": "Giselle", "userReviewDate": "Sep 22, 2011", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Inspired from the Love Story music video by Taylor Swift, Madow created this wonderful unique love story that will make you want to be young and fall in love all over again.I really loved the characters in this novel. I completely connected with Lizzie. She wasn't the most popular girl at school, nor was she a complete loser. She was your average American girl with normal teenage problems and worries. She has great friends and a not so perfect long term boyfriend - we'll get to him in a second. I could relate to her in a lot of ways. I had the same concerns as her when I got a bad mark, I would sit there and contemplate how it would affect my final grade. I also had a similar long term relationship where the spark just faded and the guy wasn't very… kind. Now on to Jeremy. I really enjoyed her portray of a dwindling relationship. At first I was really wondering why the heck Lizzie was with this guy. I wanted to slap him! He was so mean and selfish with her, but then we learn that they were friends since they were kids and that he wasn't always this way. Relationships evolve and people grow apart. I found it very accurate of how most teenage relationships turn out - in my experience anyhow.Apart from the main characters. The supporter characters - Chelsea, Keelie and even the smaller roles of Shannon and Amber - were very distinct in the story. They all were great additions to the story and actually acted like real friends; real people with flaws and personalities. I enjoyed the original premise of this story. Lizzie is having flashbacks of her past life with Drew. I always wondered about reincarnation and find the possibility intriguing. It gave a sweet twist to an already cute love story. I did have a problem with her reactions to finding out what her vision was. She accepted it too easily like it happens to everyone. I'm a bit of a skeptic myself. If anyone would tell me we met in a past life, vision or not, I'd be like \"You, sir, are bonkers!\". While Lizzie just went \"Oh ok, makes sense\". This was the only issue I had with the story though. I really enjoyed the love story. It's definitely an adorable, feel-good type of book.For a debut, the writing is excellent. It had a great flow and the story progressed at a nice pace. It never felt too rushed or too sluggish; It kept me absorbed the whole time. If you love romantic stories, this is definitely not one to miss.Check out my blog for an interview with Michelle Madow + Giveaway @ Xpresso Reads"}, {"userName": "Sarah", "userReviewDate": "Sep 15, 2016", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "“Whatever exists between us is powerful enough to transcend time, but instead you ignore it, date my best friend, and act like it doesn’t even matter!”\n\nThis was a YA contemporary romance, with a past-life twist.Lizzie was an okay character, although how she put up with Jeremy for 3 years I don’t know. I was pleased when she finally came to her senses though, even if lusting after her best friend’s boyfriend tarnished her reputation slightly.The storyline in this was about Lizzie recognising a new boy at school – Drew, and slowly coming to the realisation that she had met him in a previous life. Unfortunately though Drew started dating her best friend, and then both knew that being together would just hurt other people. It took a long time to get to this point though, and this just allowed the betrayal to feel even worse for Lizzie’s best friend Chelsea.The ending to this was pretty good, and I’ll be reading the next books in the series to find out what happens to Lizzie and Drew!7 out of 10"}, {"userName": "Michelle Madow", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/3909637-michelle-madow", "userReview": "Since I'm not going to review my own book, instead I'll share with you how I got the idea for Remembrance. Remembrance was inspired by Taylor Swift's \"Love Story\" music video.The “Love Story” music video premiered in the fall of 2008. The first time I watched it, I was entranced. Taylor sees a guy while walking through campus, and the moment their eyes connect, the scene flashes to the two of them dancing at a beautiful ball dressed in clothes that appear to be from around the year 1815. It’s magical to watch, and the video is so amazing that it gave me chills. I watched it over and over again, and a story started to piece together in my mind. A story about a girl reincarnated from Regency Era, England, who doesn’t realize it until her soul mate transfers into her school and triggers her memories to gradually return to her. In that semester at school, I was taking a class called Intro to Creative Writing. One of our first big assignments in class was to write anything we wanted and bring it in to share with everyone. Since the characters and scenes that came to me while watching “Love Story” refused to leave my mind, I decided that for the project, I would write the first chapter of what I then called “The Story Inspired by ‘Love Story.’” After completing the chapter, I stared at it for about an hour, worrying about what my classmates would think after reading it. I assumed everyone else would write about “normal” topics—not reincarnation and seeing your soulmate from the past for the first time! What if they thought what I wrote was weird? I nearly erased it in favor of turning something else in, but then I remembered something Taylor had said:\"If you’re lucky enough to be different from everyone else, don't change.\" I listened to her advice. Yes, what I wrote was going to be way different from what everyone else in class wrote, but I was okay with that. And after I read the chapter aloud to the class, I was amazed to find out that everyone in my class, including my teacher, loved it. Actually, they more than loved it—they wanted to read more! But I had never written a novel before, and the idea of making the plunge and going for it intimidated me. What if I failed and couldn’t finish it? That worried me, but again, I remembered something Taylor had said:\"To me, fearless isn't not having fears; it's not that you're not afraid of anything. I think that being fearless is having a lot of fears, but you jump anyway.\"So I jumped. And now, three years after I saw the “Love Story” music video for the first time, my debut novel Remembrance is finally available for everyone to read. I’m so happy to be able to share it with you. I can only hope that if you choose to read it, you end up enjoying it as much as I loved writing it!Thank you for taking the time to read my story about how “Love Story” and Taylor Swift helped me get to where I am today!"}, {"userName": "Sita", "userReviewDate": "Aug 26, 2011", "userURL": "http://www.goodreads.com/user/show/5831199-sita", "userReview": "Remembrance was a nice debut from a new author, I liked the plot and the main idea’s behind the book, I think the characters could have been improved (they were a bit one dimensional, not that believable), but other than that, a good book. I read it all in one sitting, so yeah it was interesting, it had just the right amount of twists and turns. I look forward to more books by this author."}, {"userName": "Carrie", "userReviewDate": "Sep 27, 2016", "userURL": "http://www.goodreads.com/user/show/36817401-carrie", "userReview": "Lizzie Davenport has been slowly pulling away from her boyfriend Jeremy for a while but hasn't decided just yet to end things since they have been together for so long. When a new guy, Drew Carmichael, shows up in school though Lizzie finds herself strangely drawn to him. Drew however seems to want nothing to do with Lizzie. But Lizzie just can't shake the feeling that she knows him from somewhere and her when her friend shows interest Lizzie is a bit jealous but can't stop her since she is still with Jeremy. As the two spend more time together Lizzie finds that Drew seems to be triggering memories from her past so Lizzie becomes determined to unravel mystery. Remembrance is the first book in the Transcend Time series by Michelle Madow. While I found this book a bit predictable I still completely enjoyed reading it. I was familiar with Michelle Madow's books and always seem to enjoy each of them. I would warn that this one probably wouldn't be for everyone though since you learn within the first few pages that there would be some kind of love triangle involved in the story. But at least in this one there is what I think of as an acceptable excuse, the rather mystic connection of past lives and the current boyfriend being a complete jerk. Overall, I enjoyed this one, a pretty quick read that started off a bit predictable in where it was going but has me rather curious as to where the story will go after this first book. For more reviews please visit https://carriesbookreviews.wordpress...."}, {"userName": "Carla", "userReviewDate": "Sep 19, 2011", "userURL": "http://www.goodreads.com/user/show/4161982-carla", "userReview": "Remembrance is VERY avarage YA book about love and reincarnation. It's about Elizabeth, a very normal girl who lives a calm and peaceful life until the day she meets Drew. She falls for him almost instantly, but it's not that simple: She has a boyfriend, and Drew starts to date Chelsea, her best friend.What can I say about this book? The writting is good, but the pace is too slow. Nothing ever happens. I put it away many times, and I just rushed to finish it because I wanted to be done with it.Also, the characters didn't really crave into me. They are too shallow and I just couldn't understand their attitudes most of the times. So I'm not even gonna bother to write a longer review. And no, I'm not gonna read the next book, I'm done with the series.\nRATING:\nStory: Pace: Characters: OVERALL:"}, {"userName": "Ariana", "userReviewDate": "Jun 30, 2012", "userURL": "http://www.goodreads.com/user/show/3564852-ariana", "userReview": "I am deeply sorry to give a bad rating to this book that most of my friends loved (also because the author seems really nice), but at this point I am really looking for something new to read, not necessarily to blow my mind but still to keep me interested and if possible in love with the story. Otherwise I'd read one of my favorite books again and get over with it.So, maybe a while back (quite some years back, to be honest) I would have found this book more compelling. See, this the problem when you read too much: you start to get bored if you read the same story twice .. or more times.And before you start to complain about my statements - yes, there must have been some originality here and there, but some cliché scenes appeared with a big red flag in my mind screaming \"Not again, not again!!!\"#1 Sparks of electricity at touching:I've seen this in too many books to count.Let's make a confession: This happens to me all the time on cold weather. Because of the clothing, from time to time, I touch my husband (or my car door for that matter) and *poof!* sparks of electricity are sent through my finger. Lucky me, I must be so in love!Truth being told: they are unpleasant, they hurt a bit, and I am not sure what can I make of those scenes afterwards, when I read about them in these books.#2 The \"shouldn't be friends\" cliché:I am getting tired of this. Let's make it clear, if you have any doubts about what this could possibly mean: If a guy tells you this, he really doesn't like you. No matter what this is supposed to be in a book, in real life this is a kind(ish) way to tell you to just go to hell.#3 Sitting together at school, but not talking at all:Forgive me, but this is called disrespect. People, please teach your brats some manners!We are social creatures, we like to interact, at least say \"hello\" or \"go to hell\". It's unnatural to sit next to a person and not say a word. How is this even possible (except for the case when someone is too shy to interact, for example)? Where did this idea come from? And what can we learn from this, that if someone doesn't care enough to interact with you, does it mean that he/she likes you? God help us all (if you believe in one).Do you see my eyes rolling?#4 This requires a quote:Girl: \"I'm not dropping this.\"Boy: He took a step forward. \"there is nothing to drop\"Girl: \"I don't believe you.\"I am really trying not to compare books here, but at this point it's becoming such a difficult task.#5 Another quote needed for emphasis:\"Stay away from me. Nothing good can come from this. I'm with Chelsea - not you. Just give up already\"There is \nthe real world\n where the girl would know to back off, get a life and be happy... And there is this 'scenario' where the girl thinks that even after saying those things the boy is deeply in love with her, so she keeps obsessing about him.Why am I even reading these books?!!! I sense a \"deep\" headache coming.#6 More clichés: the boy wearing dark jeans, leather jacket and having \"constant changes of attitude\".#7 The last quote from the book:\"Sorry, Elizabeth, but you are not my type.\"My eyes are doing a 360 around my head. You know why, because this girl still doesn't get it. *sigh*We assume that girls are smart and can see that these things are all wrong, but let's not take too many risks.Yes, this \nis\n fiction, this is a 'don't do that at home\" kind of book, but it sets the wrong example nevertheless and I can't keep this thought for myself.We cant pretend that young girls won't take this book as an example and won't start chasing after uninterested boys. They might think that when a boy says things like this, it's somehow romantic. They might think that a girl crying over a boy that made it clear he doesn't like her is a cool thing that might end with a happily ever after, when in fact they should just decide to move on and go for a better guy, one that likes them back.#8 There were many other things that bothered me in the interactions between Elizabeth and other characters that treated her quite badly, but my rambling is getting too long and we are only halfway through the story. We have a history that (partly) repeats once more, even though the characters tried so hard to change the course of things; there are bad decisions; there are more eye rolling scenes and I think that (as young as I am) I am getting too old for this kind of stories.I should probably say a few words about the plot and the characters:Plot: predictable, repetitive, lacking freshness and even originality.Characters: dull, childish, obsessive, naive if not insolent.Other than this, if you can live with the above, then you are safe to read the book and maybe even enjoy it. *crossing fingers for you*Happy midnight reading!\n * This review can also be found at ReadingAfterMidnight.com **Rating: 1.5 stars, because I keep the 1 star rating for the books I don't get to finish.____________________________________________Blog (EN) | Facebook | Twitter | Tumblr | Bloglovin' | Blog (RO)____________________________________________"}, {"userName": "Kimmy", "userReviewDate": "Oct 28, 2011", "userURL": "http://www.goodreads.com/user/show/6797622-kimmy", "userReview": "Oh my gosh, if a book contains a constant droning of rehashed, uncreative sentences like \"You know I'll always be here for you, right?\", \"Always and forever\", \"I've never been so sure about anything in my life.\", \"You’re everything to me—you always have been, and you always will be.\" and \"It would be like losing a part of who I am\", OMG, I think I would rather scroll through the list of Goodreads quotes to while away my time, and I can even get more decent and original quotes there. Of course if the storyline of the book sucks, then why even bother reading the book?First, I like to mention the revered literary masterpiece Pride and Prejudice. The book stands out because the female protagonist, Elizabeth Bennet, is the one of the earliest and truest embodiment of a heroine with a brain and guts, and is the ideal role model for all young girls to stand up for themselves on their own two feet without the need to cling onto a man. Hence, any reference to Elizabeth Bennet, especially to compare her to a modern day female protagonist should be done with caution and respect. Elizabeth (She is the narrator and the female protagonist of Remembrance. Yeah can you imagine, her name is Elizabeth, what a copycat to Jane's Austen's Elizabeth Bennet.) practically chants \"I am Elizabeth Bennet. I am Elizabeth Bennet. I am Elizabeth Bennet.\" throughout the whole 314 pages of the book. My my my, dear Ms Lizzie Davenport, do you know actions speak louder than words? Did you stand up for yourself when you were insulted by a guy (Drew) for no reason? (No, you wept buckets and moped for days, hoping that he would chivalrously come around and apologize.) Are you tough? Have you ever went through any form of hardship or emotional turmoil, such as losing a sister through a scandalous elopement? (No, the guilt from dating your best friend's boyfriend doesn't count, and neither does the suspense of waiting for your secret crush to cheat on his girlfriend.) Are you witty and clever in banter? Do you have a spine? Can you independently make it through your life single? Can you appear cool without the guy? Can you become all that you can be without needing the support of a man?To all the above questions, the answers are yes! (only for Elizabeth Bennet of Pride and Prejudice) Unfortunately, for Lizzie Davenport of Remembrance? No. Even to the question: Should readers read Pride and Prejudice? Yes definitely! Remembrance? No.There is no chemistry between Drew and Lizzie. Their love can transcend time? My ass! Their past life is the only reason why they are together. Other than that, I can see no reason why they are attracted to each other. Oh, it pisses me off to call Lizzie Elizabeth, when her very imagined existence is an insult to Elizabeth Bennet. She shall be henceforth known as Lydia, and Drew Mr Collins. Lizzie Lydia is horribly two-dimensional and shallow. The only thing that she is concerned about is Drew Mr Collins. There are books where the female and male protagonists are fated to be together due to some reason at the genetic level or conjured up by fate. Even then, the authors of those books artfully built up the chemistry and attraction between the girl and guy such that even if they were different as night and day, readers would still root for them to be together. Remembrance, sadly, is not one of those books.Remembrance fails to pull off a romance based on two elements, fate and redemption. For readers looking for books containing the above themes, I highly recommend Starcrossed, Everneath, Finding Sky and Stealing Phoenix over Remembrance any day. For readers searching for a strong-willed, powerful female character, you know which book to look for."}, {"userName": "Donita Luz", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/18877120-donita-luz", "userReview": "\"The moment my eyes met his, the other students in the room blurred into the background. My heart felt like it was pumping at a faster than normal rate, and my lips parted slightly as I took in the sight of the boy who looked so familiar, even though I couldn't remember where we'd met before.\"\n If overly cheesy lines and unbelievably awkward insta-loves are your kind of thing, then by any means, don't let my rant review to stop you from reading this soap opera of a novel, maybe I'am just not the right audience. I should've known that Remembrance isn't for me. I really should've seen that coming, seeing that it was talking about soul mate on the blurb and everything.. But.. Reincarnation dude. You probably don't understand, but I've always been fascinated with the idea of reincarnation. The insta love, cringe-worthy cheesy lines and the main story isn't the main reason why this book got a 1 star rating from me- which I almost never give if I can help it  -  It was the fuck'n MC.To say that I was surprised is an understatement, not in a good way, but I was shocked. Because Lizzie, the main character in this book, is a bitch. Sorry, but there is no better word to describe her. She's the kind of person I would definitely hate being friends with in highschool- or even forever. *She's selfish.She broke up with her long-time boyfriend after she met Drew, the new transfer in high-school. I mean, seriously I'm not angry over the fact that she met somebody else, they're still young after all, and let's face the bitter truth, this thing happens. I was angry because she was blaming her boyfriend- now ex-boyfriend- for the reason why they broke-up. \n\"He barely talks to me anymore, and when he does, it's either to brag about soccer or to criticize something I did. We couldn't stay together\"\n EXCUSES. There is no way in fucking hell you'd let a 3 yr old relationship go just like that without even making an effort to make it work, because I believe that if she really, really, wants to make the relationship work, she'll make a way, else, she'd make an excuse!- just like she did. I mean, her boyfriend was a jerk too, so I would've understand her for falling out of love for him, but really, she should've done it earlier, why wait for someone like Drew to show up?*She's self-centered and jealous.\n\"I tried to focus on trigonometry for the entire fifty-five minutes, but it was impossible to shake the image of Chelsea and Drew working together in chemistry. At least she would be stuck wearing those huge goggles that left strange marks on people’s skin afterwards.\"\n Seriously? How pathetic is that? She was referring to what she call as her BESTFRIEND FOREVER, just because she was upset that Chelsea, her bestfriend, has set her eyes on the transfer student, which she liked too the very first time she set her eyes on him. *She's a cheat.She was cheating on her boyfriend. I mean, you didn't have to kiss, have sex with someone to say that you're cheating on your boyfriend/girlfriend, I believe that if you're entertaining the feelings you had with someone and if you are keeping unreasonable secrets with your partner then you're already cheating. Sorry, but cheating is a very sensitive topic for me. I've seen people loose confidence because of a \"simple\" cheating  back in highschool days. So no fucking hell I'm just going to keep a blind eye and believe that what Lizzie and Drew did was acceptable.I didn't particularly like how Jeremy, Lizzie's ex-boyfriend, was portrayed as a jerk. It was like deliberate to make the readers sympathize with Lizzie, and gradually root for her and Drew together. Which may work on others, but not to me sorry. I love Taylor Swift's Love Story, which this story was inspired on, based from the author. I must say that it's pretty creative but the Cheating, unrelatable characters and messed-up attempt on love triangle messed everything up for me.\n\"There had to be something more significant in my life than meeting Drew, but I knew that the moment we first saw each other was a huge turning point in my life.\"\n No shit."}, {"userName": "Emma (BelleBooks)", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/4783841-emma-bellebooks", "userReview": "Firstly I want to say a massive thank you to the author Michelle Madow, who contacted me offering a review copy of Remembrance. If it wasn't for that email, I would probably have never came across this amazing book!Remembrance follows the story of high school girl Lizzie, just as the summer has come to and end and it's time to head back to school for a new term.As the story unfolds the reader meets Lizzie's boyfriend Jeremy who has recently been made co-captain on the school football team, and seems to be more interested in his new football star friends and being popular than spending time with his girlfriend.There is also a mysterious new boy who has transferred to Lizzie's school, Drew.For some reason, Lizzie is sure she knows him from somewhere, or has met him before, but for some reason she just can't seen to place him no matter how hard she tries.Lizzie soon begins to realise than she might be attracted to Drew, which of course shouldn't be happening. She has a boyfriend, Jeremy who has not been paying her much attention recently. And to make matters worse, her best friend starts dating Drew and Lizzie has to keep her thoughts and feelings to herself. There is no way she can jeopardize her relationship with her best friend, or her boyfriend. But still something is eating away at her, and she still can't remember what is so familiar about Drew.That is until one single dance with Drew and the school dance, and a flash comes back to her, slowly Lizzie starts to remember why Drew is so familiar to her. They met in the Regency Era of the 1800's!I loved this book and read it in one sitting. I literally could not put it down!The writing style in the book is straight forward, simple and easy to read. Which I loved, especially since there was a lot of talk of Jane Austin and the Rengency Era. You would think that all the history stuff could come off a little boring in a book. Michelle Madow manages to create just the right mix of olden ideas and themes along with modern language.The story itself pulls the reader in from page one. Personally I was so intrigued by the story that I didn't want to stop reading, I wanted to finish the book then and there in order to find out the full story.The characters are very well developed, especially the not so main characters, such as Lizzie's best friend, her boyfriend, the \"mean girls\" at school etc. Though they did have a large part in the book, to me the main focus was on Lizzie and Drew.Overall I am so glad I got the chance to discover this book, it is truly a little gem!"}, {"userName": "Fiona", "userReviewDate": "Oct 23, 2015", "userURL": "http://www.goodreads.com/user/show/15907431-fiona", "userReview": "I saw Remembrance free on Kindle, and I was awestruck on how beautiful its cover and intriguing the blurb was. That pique my curiosity into reading it. I wasn't really expecting anything on this book, so I was honestly surprised with just how beautiful the story is on the inside. Remembrance wasn't something mind-blowing or life-changing, but I found reading it addicting and has kept my interest throughout the end. It has saved me from my reading slump (hallelujah!), and that was really an A for me.Michelle Madow's writing was really pleasant. I think that the story was studied well, so the plot was able to flow nicely. Clearly, the story proved that Madow made a prominent effort in researching about reincarnation. The fusion of the worlds of past and present harmonized well and was paced perfectly. The overall story was enchanting and unique. It was cool and epic because we have star-crossed lovers that have transcended time, and were really perfect for each other.The characters were suited well. Elizabeth, the main character, is pleasant, good-natured and easy to relate to. She is this flirty, quirky, smart, teenage girl but not too much of any extreme in a sense that you would feel irritated and annoyed. Drew is a strikingly gorgeous man, sweet and endearing. Any typical teenage girl would swoon and become infatuated with him. The relationship between Lizzie and Drew was exceptional. The love they have for each other was beautiful and bizarre. It was crazy that while reading this book, I found myself realizing that sometimes ignoring how you feel towards the one you truly love is harder and painful than just letting love work between the two of you even if the circumstances are difficult.Remembrance had all the formulas for a swoon-worthy romance. It wasn't overdone, and it had just the right amount, texture, and awesomeness. It would give the readers almost anything they want in a mushy romance, while still making it a remarkable and refreshing read. Remembrance has shown that anyone may get a second chance to make things better than before, to mend heartaches and previous blunders, and to become better than what you were in the past."}, {"userName": "Tamara", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5004496-tamara", "userReview": "I love discovering new YA authors. And, when I got Remembrance from Michelle I was excited. This novel, I'm happy to say, lived up to my expectations. It is a story new to me, I've never read a novel with a theme like this, but it never disappointed. I mean, the story flew well, the characters were interesting, I liked how the author payed attention to the small details like names (you have to read the novel to see what I mean here ;)).Let me find one passage for you. Ah, here it is.But it was time to realize that I wasn’t Cinderella, and no matter how hard I wished it were true, life wasn’t afairy tale where everyone lives happily ever after.In the moment I read this sentence, I was struck by an unusual feeling. I don't know why, but I was. I think that Michelle can really hit you with her writing, and that's always a big plus :)So, without any more ramblings, because I can't form any more sentences about this novel, I give it... *drum roll*5 stars"}, {"userName": "oliviasbooks", "userReviewDate": "Aug 08, 2011", "userURL": "http://www.goodreads.com/user/show/2843533-oliviasbooks", "userReview": "I think, I have two and a half things to say as the selfpublished, paranormal YA romance 'Remembrance' and its half-eaten (I actually swallowed only 15% and regurgitated them for quotes and evidence) and dejected state on my plate is concerned:1) The moment my eyes met with his, the other students in the room blurred into the background. [...] A spark of electricity shot up my arm. Part of my dislike/boredom/urge to ridicule is probably at least partly not the book's fault. The author published it in 2011 riding the last waves of the post-Bella-and-Eddie-afterglow, without realising, that it takes more than one random insecure, normal or unconsciously special girl and one random hot, paranormal-secret-with-a-growl-or-a-smirk to have readers melt at your feet in ecstasy. And here I was, three years later, trying to enjoy the - unspectacular in the first place but rancid by now - exhibition of a recipe that to the unsuspecting aspiring novelist looked foolproofily yummy. Drew is not even of the usual inconsiderate sort. He acts aloof in front of the heroine's classmates - inspiring all sorts of female want and male territory markings - but encourages the heroine to value her talents more, to demand being treated well and to wake up that paranormal spark, remembrance, memory, power, whatever that is hidden within her and is connected to him by fate, of course. Well. Good for him.2) He accelerated the car more. “Relax, Liz. I’s time you ?got over your little fear of speed.“ […] “You don’t trust my driving?” he asked, offended. “Come on, you know I wouldn’t risk wrecking the jeep.””Why didn’t you straighten your hair today?”  he asked, unhappy with my decision to let it dry naturally. […] “I like it better straight,” he told me. “You look so young right now, you could pass as a freshman.”Yes, a fine example of YA paranormal romance cannot really do without a jerk, it seems. So, I had to meet him in form of the heroine's supercatch of a boyfriend she is supposed to be immeasurably grateful to have. Naturally, he is her mom's best friend's son, an athlete, who always has to lunch with his team - his arm-candy quietly broadcasting his manliness at his side. He laughs about her mistakes in class with his mates, doesn't get her art and behaves altogether assholish most of the time, but he and Liz are prefect for each other - according to the Gospel of BFF Chelsea, who has set her eyes on mysterious Drew, by the way. I cannot exactly fathom why Jeremy is portrayed as the most egocentric, whiny, insensitive and stupidly dangerous specimen among his kind (fictional American teenaged male). I can only guess, but my guesses do not make me particularly happy: He has to be of the despicable, throw-out-as-fast-as-possible-sort so the impeccable, nice heroine will not be labeled an immoral cheater or a fickle heart, when she falls hard for her real dream boy and starts to meet him and flirt and laugh and dance with him behind her boyfriend's back (see prologue). Seeing Jeremy-the-Ultrajerk in all his sneer-faced glory shall make the readers moan 'Poor Lizzzzz' in sympathy instead of clucking their tongues in moral contemplation. It doesn't work. At last not as my own, strange mindset is concerned: To me Liz's enduring, anxious-to-please and afraid-to-draw-the-line character comes across as extremely weak, so doormattily pathetic that I felt like chucking my chocolate. No \"Poorliz\" from me. No, no. Especially since she without doubt listens to the wrong bestie:2.5) “Her peasant skirt looked like it came out of the sixties, and she barely wore any make-up. She was a quiet girl – short, with mousy brown hair and a few freckles.\" Artsy Hannah Goldberg had been Liz's second best friend until she fell in love with the lunch-crowd-incompatible star of the drama group. But according to the narrator she disqualifies anyhow because she does not apply her talents on the freckled canvas fronting her head. And \"Poorliz\" has to suffer a second-best-friend-less state, because the stupid creature is unfortunately outfitted with the peasant skirt and the shortness the YA-character-cliché-guidelines for selfpublished of-the-rack ware dictate for girls of her category. Poor Hannah. I confidently say: 'Remembrance' doesn't deserve a recommendation, although I never even got to learn why Liz can speak French fluently and knows the Regency period from firsthand experience. I know Liz, I know Jeremy and I get Drew. That's more than enough. Believe me."}, {"userName": "Gilbert&Gomez", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/5177971-gilbert-gomez", "userReview": "I told Michelle that I think I found her book by fate. I happened upon it on Goodreads and I'm glad I did! I want you to go read this book, so I'll try not to spoil anything.If you were to take a dash of Romeo and Juliet, a handful of Pride and Prejudice, and pinch of a Disney fairytale you'd probably come up with Remembrance. No lie. AT least that's my opinion.Lizzie, short for Elizabeth of course, is like a real person. Actually all of the characters were pretty real. They weren't perfect and they didn't fit neatly into cliches- which deserves mentioning. Sometimes when I got frustrated with a character the little voice in the back of my head would go \"Gomez, normal people act selfishly, change how they feel, are stupid, and are just trying to be happy.\" But while they were all real, that doesn't mean I wasn't annoyed at (and a little sorry for) Jeremy or that I don't think Chelsea would ever win an award for Best Friend. I did enjoy Allistar, his scenes were like those mini Hershey bars that add just a bit of sweetness to your day. While Drew was tall, dark, and tortured (and handsome...with a handsome amount of dough to his name), I didn't have the immediate groan of \"not again\" I often get nowadays with those dark, tortured types. This may be because of my other emotions directed at said love interest. Sometimes I wanted to slap him, then shake him while saying \"stop this now, you ridiculous person! just be with her already! UGH!\". Other times I was left in confusion, and sometimes I would just sigh and go awww. And he had his knight-in-shining-armour/classic-lover-boy moments. A certain scene involving pieces of a pine tree had me in gleeful astonishment (along the lines of \"no. no way. ahhhh...awwww...so romantic\").The reincarnation aspect was done pretty wonderfully- I believed it, instead of thinking how this would never happen. And one the things I love most about this book was the Pride and Prejudice references and parallels. Amazing! Anyway go read Remembrance. It's a great romantic book that's sure to leave a smile on your face!"}, {"userName": "Steven Graham", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5688717-steven-graham", "userReview": "This isn't my usual genre but I decided to take a chance and give this one a read. The book was a very refreshing read and was written extremely well. The flow of the book kept me reading and reading. Excited to see more from this author in the future! I would definitely pick up more titles from this up and coming superstar in the YA genre :)"}, {"userName": "Annabelle Marie Veronica", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/1235083-annabelle-marie-veronica", "userReview": "****FINAL RATING: 4.40 STARS****\nCATCHALL\nOrdinarily, this book would probably sit on my review less shelf for longer than a day before receiving a review. I am drastically behind on my reviews, so um…yeah. I'll get to them eventually. The main reason I'm writing my review now is Project Tell Taylor. Even though Taylor Swift isn't exactly my favorite singer, I like doing giveaways and helping others. I was also, through this, offered the chance to read and review Remembrance. But wow! I thought Remembrance sounded intriguing, but I didn't expect to love it as much as I did!\nTHE HEROINE\nELIZABETH DAVENPORTI really liked Lizzie. She was cute and sweet. Not exactly my favorite heroine of all time, but still up there. She seemed genuine and real, unlike so many YA heroines I could name but won't, because I'm a nice person ;) I was kind of annoyed by her at times, however, when she keeps agonizing over Drew. I understand the feeling--but I don't necessarily want to hear about it for pages and pages. Also, she had some serious indecisiveness going on, and that kind of things grates on me personally. It created a little bit of a divide. But happily, in the end I knew I really liked her. It was her relatability that made her stand out and be special.\nTHE LOVE INTEREST\nANDREW CARMICHAELI really like the name Andrew, so I was somewhat upset that he goes by Drew. This is, however, a totally minor thing. Ah, he is definitely one of my new book boyfriends. He just oozes hotness in this totally amazing way and apparently makes me sound stupid, because I totally do. (And suddenly, I understand why my boyfriend gets so adorably jealous when I talk about guys from books.) Back on topic, Drew is probably my favorite character from Remembrance. I love how he's so protective of Lizzie--it goes to show that he really does love and care about her. The mistakes he makes make him seem stronger and all the more real. He's very human, and I love him for it :)\nTHE OTHER SECONDARY CHARACTERS\nJEREMYHe was a layered character. I completely wrote him off at first, but he surprised me. I didn't expect to find out some things about him that I did, and I most certainly didn't expect him to have such an important role in the story. I found myself pitying him but also admiring him in a strange way. I expect I'll be seeing more of him in future installments, and I'm looking forward to it. Villains can be so much fun, and Jeremy is no different. In a way, his character is heartbreaking.CHELSEAAh, Chelsea. I really didn't like Chelsea. I kind of hated her, if I'm honest. But I can't love every character ever, and I didn't love her. For most of the book I kind of wanted to slap her upside the head. She was annoying and far more selfish than any three people put together should be. I did get the vibe that she genuinely cared about Lizzie, but she cared more about a boy. This is the type of thing I can't stand in a girl. Chelsea was maybe the worst best friend character I've ever read. Unfortunately, I do understand that she kind of did have to be this way for the story to progress the way it did, so I'll cut some slack. I hope to grow to like her more later on.\nTHE PLOT\nI'm usually not a fan of reincarnation or soul mates, because it doesn't make a whole lot of sense to me. But for some reason, Michelle managed to make me accept the idea. Everything clicks into place flawlessly. The past lives meld with the present in a way that somehow manages to work. It is understandable--I didn't feel lost or confused more than I should have. Things that weren't stated outright were clear enough to see. In general, I liked the plot. It kept me interested. I barely put this book down at all, which resulted in further procrastination of my AP Physics homework, my worst class. That's how good and intriguing the plot of this book was. I almost never felt bored, and when I was bored the action quickly picked back up.There were a few things I didn't like, like how Lizzie's single mother doesn't care where she is or what she does. There's too much of this in YA, and I don't like these mysteriously absent-or-don't-give-a-damn parents. It's just too unrealistic. And then her mom does pop in randomly to have a \"meaningful\" conversation with her daughter, and I feel like this was extraneous. But oh, well.\nTHE ROMANCE\nOh, the romance here was so sweet. Unfortunately, it was a little underdeveloped, but this didn't take away from its beauty at all. The moments between Drew and Lizzie are just so sweet. The love triangles worked in this story as well--there are times when they don't, but in this case they needed to be ere exactly as they were. There's an especially tender moment near the end of the book that I really loved, and Drew and Lizzie's first \"date\" is going to always be one of my favorite romantic moments in the books. I found it completely gorgeous and absolutely lovely--the chemistry between them was undeniable.\nTHE WRITING\nMichelle has excellent writing, given that this is a debut novel. Even with considering the debut-novel-status, the writing is fantastic! Lizzie's voice is contemporary and easy--it flows and sounds natural, not forced. She sounds like any normal high school girl would, but with her own distinct little something. At times, she can be irritating, but unfortunately most YA heroines' voices are at some point. Still, this was kept to a minimum and the writing here wasn't flawless, but enjoyable. Overall, Remembrance was well-written.\nTHE ENDING\nThe ending of Remembrance was so sweet! I kind of didn't like how the conflicts are brought up again, however. I knew well what they were at that point, and that they would most likely be addressed later. I didn't feel I needed to be reminded again. But generally, the ending was pleasant to read. It is redeemed in the last few lines, which are a bit sappy but so sweet I couldn't mind. I genuinely liked this ending, and it definitely left me wanting more.\nWRAPUP\nOh, man, I really want to read Vengeance, the story that follows Remembrance, even though it features Chelsea. I just can't resist. I need to know more. And of course, I'll be wanting Timeless once it comes out (and has a cover!). Remembrance has left me aching in a good way. Reading the next books will be no chore.FINE.Read this review and more on Sparkles and Lightning!"}, {"userName": "HD Tolson", "userReviewDate": "Sep 10, 2011", "userURL": "http://www.goodreads.com/user/show/3503998-hd-tolson", "userReview": "A solid debut from an author that has a lot of promise. Michelle's writing style is light and well-done, but a few signature author pitfalls keep Remembrance from achieving it's full potential.\"I was extremely reluctant to start reading Remembrance. I knew the author was one of the nicest people I'd ever met, and when I got her book in my hands, I read the first chapter and...lost interest. Putting the book down, I noticed how Michelle seemed to try a little too hard to prove that she knew how to write. It turned me off instantly. So, I read many other books, and just recently picked it back up. Surprisingly, I read a good fifty pages within the next thirty minutes, and by the next night I was done. A light, fast read, and a solid, good jump into the publishing world for a debut, self-published author like Michelle. She's definitely gotten eyes on her book, and I've heard about it from a lot of bloggers and seen it on a ton of blogs. I think it's really, really cool how big this book is, and it deserves to be. Michelle has a nice writing style. It was easy to read, nothing to advanced, and i was able to connect and slip into the characters. She used a simple vocabulary, and the conversations and thoughts going through the character's heads were normal, relateable, and not awkward or stilted. Everything flowed well, everything was attached and well written. But there were a few problems with Remembrance, the first one being the overall lack of real plot. The book is 98 percent romance and about 2 percent about the whole reincarnation thing. From the very first chapter the main focus is how drawn our main character is to our new, mysterious boy, and her choice between the one she used to love and the new, mysterious love. Somewhere in the middle of the book, we have this odd thing happen, and suddenly our main character just knows she's been reincarnated? I thought that the big reveal of the story didn't have as big of an impact as I thought it would. When the \"flash\" from the past came to Lizzie, she went home and just went to Google and went to look for reincarnation. She's like: OMGZ guys I'm reincarnate...NBD <3! And it was just...dull? I wanted some big reveal, some huge, life-changing thing that would affect her. But all she seemed to care about was Drew, the boy who's mysterious and connected to her. The characters also kept me from totally loving this book. I get easily irritated about the stereotypes that Twilight and it's sequels have plagued many novels with, and I noticed a good one hundred pages into the book that Lizzie, our main character, was annoying backboneless and let her boyfriend, who was a total jerk, push her around. It annoyed me. And Drew, our mysterious boy who walks in on the first day of school, got many an eye-roll from me. The love triangle mixed with the hunky, mysterious boy who Lizzie is \"drawn\" to led to a little impeding in Remembrance reaching its true potential. The character development was crafted well, though. Lizzie changed over the course of the novel, and I found myself liking her a lot more now that she'd gotten a backbone and didn't flinch away when people insulted her. She stood up for herself and thought for herself, which was something she was unable to do for the first one hundred pages. Self published novels that are actually good are hard to come by. I just happened to stumble upon Remembrance, which is an enchanting debut that is written fabulously and characterized well. Michelle, like any author finding her feet, finding her voice, has fallen into the pitfalls of an every-other YA novel, but overall made up for it with good characterization. Michelle has room to grow, and I have no doubts she will, and I will be eagerly picking up the next installment in the Transcend Time Saga!"}, {"userName": "Joy (joyous reads)", "userReviewDate": "Oct 06, 2011", "userURL": "http://www.goodreads.com/user/show/4352734-joy-joyous-reads", "userReview": "I’m not going to lie. I had to listen to Taylor Swift’s Love Story for me to understand how this book was related to the song from which the author took her inspiration. I had to You Tube that baby and soon realized that the entire book was NOT based from the song but parts of the lyrics inspired some scenes in Remembrance. This book is pure romance. The subject of reincarnation was glanced over but never really explained. Basically, it’s about Lizzie and Drew who had shared a past – maybe even another lifetime, and met in the present where Lizzie was already involved with somebody else. They recognized each other immediately and have made a connection in an instant. In an attempt to avoid a repeat of their history, Drew treated Lizzie like a pariah while Lizzie vacillated between love and hate for this mysterious newcomer. In the end, their pull was too much to ignore. I have some problems. First: Drew cheated on Lizzie in the past life. Was this just an exchange of kisses or did it go deeper?Because of this, Drew was adamant to keep Lizzie away from him. I’m not sold. It’s definitely not cause for Drew to treat Lizzie like dirt, especially if he was the one who did the cheating. If Drew was trying to prevent her from getting hurt again, how was being a jerk so much better than trying to make amends? I mean, reincarnation is a chance to make another path for their lives but I don’t see how jerking Lizzie around could’ve avoided Drew from repeating history.Second: I honestly couldn’t empathize with the characters. Lizzie never showed a single backbone when it comes to Drew and to her best friend, Chelsea. How could I swoon over a jerk like Drew? By the time he switched personalities, it just felt forced to me. I had hopes that he would eventually redeem himself, but in the end, he failed miserably. I can’t even talk about Jeremy (the ex), and Chelsea (the ex best friend) without hurting the neighbor's cat. Lizzie has an annoying habit of hiding behind her hair (sorry, it’s a pet peeve).Third: The ending. Okay, picture this. You see your boyfriend standing not too far but not too close to your best friend and they were talking. All of a sudden, a memory comes over you, a memory of your past life where you saw the exact same thing, only your boyfriend was kissing your best friend. So what do you do? Do you: (A) Stick around and interrogate the jerk about the memory that he didn’t want you to remember? Or (B) Run away with your ex in hysterics? Which scenario do you think Lizzie picked? Once again, I’m a minority in this one. I have asked myself if I were reading the same book as everyone else because everybody else seemed to be in the same page. But try as I might, I really couldn’t love this book."}, {"userName": "ALEXA", "userReviewDate": "Nov 12, 2011", "userURL": "http://www.goodreads.com/user/show/4988733-alexa", "userReview": "Review posted on Alexa Loves BooksHonestly, I'm having the most difficult time trying not to gush about this book (because I could probably just type I loved it about a billion times instead of reviewing it properly). It's exactly the kind of book I love - a YA novel filled with romance, a swoon-worthy leading man and a hint of the impossible. And, as I suspected, I couldn't put it down!Michelle's book is entirely based on the premise of reincarnation and the possibility of two lovers meeting and remembering their past life, a theme that struck me as quite original. The story was written very well, with a nice steady flow that carried the reader from the first page to the last. Though it's very simple in terms of the plot, Michelle's great characterization and choice of what to show us and what to hint at helped keep me preoccupied wondering just what was going to happen next. It had some very predictable points, but a couple of twists caught me off guard here and there, which is an excellent thing.The strongest feature of the book was its characters. Lizzie was a protagonist that I could relate to - she's a perfectly ordinary teenager with a particular care for being cautious, whether that pertains to driving, her grades or her own emotions. I found the extra bits about Lizzie - her enjoyment of Pride and Prejudice, her interest in sketching and art - to be some of the most fascinating things about her.Drew, on the other hand, was swoon-worthy, period. When he and Lizzie interacted and sparks fly, I would find myself shrieking out loud or giggling or just smiling non-stop. He's mysterious, he's smart and he gave off a bad-boy-with-a-good-heart vibe at first (though we find out later on that he's really a good guy). Though there were occasions when I wanted to tell him off for his actions, I couldn't help falling in love with him as Lizzie did.A few more characters that I liked (and hope we get to see more of in the next two books) are Chelsea, Jeremy and Keelie. I have a feeling they each have their own story to tell (well, maybe not so much Keelie), and I'd love to hear it. (In fact, the next book Vengeance is told from Chelsea's POV!).If you're a fan of YA romance, then definitely go pick up this novel! Remembrance was an adorable and very unique love story -- and I honestly can't wait to see what happens next."}, {"userName": "Lindsay", "userReviewDate": "Aug 10, 2011", "userURL": "http://www.goodreads.com/user/show/5206569-lindsay", "userReview": "Overall, the story isn’t horrible, but that’s the extent of the good in it. I had a lot of issues with this book. Most of the issues originated from the similarities between Remembrance, Twilight and Pride & Prejudice. The similarities between Remembrance and Twilight ended by the 50% mark, but the similarities between Remembrance and Pride & Prejudice were prevalent throughout the whole story. It also didn’t help that the author kept bringing up the story and had Lizzy make comparisons of her classmates to characters in Pride & Prejudice. It became distracting. If the author’s goal was to make Remembrance a modern day Pride & Prejudice she would have been better off marketing it that way. Or she would have been better off sticking to the actual story instead of putting enough in to be a distraction. Reincarnation…was a copout for the plot. At one point in the story Lizzy tells Drew, “I loved you from the moment I saw you, but now I’m finally beginning to understand why.” I kept thinking…explain it to me, because I don’t understand why you love him and why he loves you. I was left feeling like the only reason they loved each other was because they were supposed to. There was very little interaction between them before they declared themselves a couple. I saw an attraction, but there was nothing beyond that to show me they actually had genuine feelings for each other. I don’t know if the author was unsure of why they loved each other or if she didn’t know how to portray them falling in love, but the reincarnation really missed the mark. There were some characters that I absolutely hated. I hated Liz’s boyfriend Jeremy and her best friend Chelsea. If the author’s intentions were for us to hate those two characters then she succeeded. I had no clue what Liz saw in Jeremy. He was abusive verbally and a couple of times I could easily see how it could escalate into physical abuse. When it comes to Chelsea…she is a horrible best friend. Last time I checked, it wasn’t required to check with your best friend, to see if it’s ok for you to break up with your creep of a boyfriend! Best friends are supposed to be there to listen to you and commiserate with you. Even before Drew broke up with Chelsea, Chelsea was horrible about Liz and Jeremy getting back together. She was not a friend. This story had promise, and it could have been good, or even great, but it fell flat on so many levels."}, {"userName": "Amanda", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/3889389-amanda", "userReview": "I literally just put the book down seconds ago. Jumping right into my review was definitely a must. I simply couldn't wait to gush about how much I loved it! Words I often use for books like these... Brilliant.. Amazing... Unforgettable.. I could go on and on! Everything I consider as \"must haves\" in a story... this book had it... and more! There's no doubt in my mind that Remembrance deserves to be ranked amongst my most adored reads. My two favorite parts of this book... the strong and beautiful lead personality that you simply can't help but fall for and of course the ever so irresistible, utterly mysterious, yet incredibly sweet love interest! Is there a Team Drew yet? If not... I'm so making one! Who doesn't love a good love triangle! I'm addicted to them it seems! :) The whole theory of love transcending time and past lives... I can literally feel my heart flutter just thinking about it! With a light and simple writing style that screams comforting... a story that buildings and builds till the very end... and an ending.... Oh wow the ending.. *prepare the tissues* and hold your breath! Those last few chapters are intense! But I'll guarantee you this... you'll be smiling once you've finished that last page. Gotta love when books leave you with that warm happy feeling inside! I know I do! : ) I'm giving this book five stars and more!!! I'll be rereading this book again soon! That's for sure!"}, {"userName": "Reading Vacation", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/5102733-reading-vacation", "userReview": "Remembrance is a story of love that transcends time. It is a story of a couple who belong together, no matter where or when their paths cross. A story that is presented in such a way, that I became entranced with the idea of reincarnated love.I imagine this is pretty typical of what goes on in high school romances and that is why I liked it so much. Lizzie is dating Jeremy and she has a crush on Drew; and Drew is dating Chelsea, but he has a crush on Lizzie. Ha! On the surface, Lizzie is a dreamer, Jeremy is stuck up, Drew is evasive, and Chelsea is a tease. Look a little deeper though, and you’ll see there is more to each of them.The element of reincarnation is presented as flashbacks to the Regency Era of England. Lizzie has these fantastic flashbacks to a life she lived back in that era. Not only that, but Drew begins to share with her his own flashbacks from the same era. These vivid scenes overlay the current scenes bringing the past into the present. It’s wonderful.Michelle Madow’s debut has an enchanting quality that left me feeling as though everyone has a true love that they are destined to be with.RATING5 LovedCOVER COMMENTSOne of 2011’s best covers! The masquerade mask is right out of the big party scene. Lizzie looks mysterious and pretty at the same time."}, {"userName": "Tiffany (About to Read)", "userReviewDate": "Jul 31, 2011", "userURL": "http://www.goodreads.com/user/show/2378348-tiffany-about-to-read", "userReview": "There were things I needed to while I was reading Remembrance—like eat breakfast—but I kept telling myself I would get things done after one more chapter. Lizzie and Drew have so much chemistry, even though it was sometimes hard to tell because Drew was so hot and cold. Michelle Madow’s engaging writing style really sucks you into Remembrance. The character development in this book is fabulous. I loved and hated things about every single character—sometimes they were sympathetic and sometimes they were so selfish or self-absorbed that I just wondered what was wrong with them.The emotions and imagery just leap off the pages of Remembrance. During Lizzie’s flashbacks I felt like I was being transported to the regency era. I could also feel Jeremy’s rage pulsating out of the novel whenever he got angry. My favorite character is probably Keelie because she never did anything to hurt anyone else, and she was clearly just a nice person. Jeremy was definitely my least favorite character because he was so obnoxious—even when I felt bad for him I still didn’t like him.Overall, Remembrance is perfect for anyone who loves romance and appreciates life-like characters. I can’t wait until the rest of Michelle Madow’s works are published!"}, {"userName": "Crina (Reading Addict)", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/4831915-crina-reading-addict", "userReview": "*Deeeep siiiiigh* Ok, I tried! Really! The cover looks good, the synopsis sounded kinda interesting, somehow cliche and nothing knew but I decided to try. Just nope.It's a very easy and fast read but at the same time is so slow paced and boring. Nothing much happens and I read 60%. I dragged myself through it from 20% saying to myself that is going to pick it up, that it will become better and interesting and engaging and bla bla. It didn't. Uni - dimensional, cliche, plain characters, high-school drama, new boy in town/school, more drama, cliche, boring and forced dialogue, no emotions. No suspense. No action. I dunno. Maybe I have a problem. Maybe, because I'm almost 22 and I've read a ton of YA I'm tired of all the tropes and cliches and recicled ideas, but my biggest problem was the writing style - plain, boring and monotone like everything in this book. Sorry not sorry but I won't finish this. If nothing big and interesting didn't happened 60% then what could happen until the end. Actually maybe it will happen something on the last page."}, {"userName": "Cora ☕ Tea Party Princess", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/4166936-cora-tea-party-princess", "userReview": "5 Words: lies, secrets, betrayal, friendship, highschool.I think I might have lost some brain cells reading this... Needless to say, if I had read this sooner I would never have touched this author again, which is a huge shame as I actually really enjoyed The Secret Diamond Sisters and I'm looking forward to Elementals: The Prophecy of Shadows.Out of all of the things in this book that I didn't like, Liz was the biggest. She's a terrible friend to Chelsea, constantly lying and going behind her back. She slut-shames other girls. She tries to rationalise her behaviour because of twu wuv. She's just an awful, awful person."}, {"userName": "Nasty Lady MJ", "userReviewDate": "Dec 22, 2013", "userURL": "http://www.goodreads.com/user/show/4026143-nasty-lady-mj", "userReview": "I just did not like this one. It involves a Mary Sue MC with a love triangle that is just too ridiculous for words. I mean, what love triangle? I can see this being appealing though to the right audience. I'm just not that audience. To see full review click on one of the following links:The BlogThe Booklikes Page"}, {"userName": "Jennifer", "userReviewDate": "Nov 13, 2011", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "I won a copy! So I guess now I will be reading it! WOOOOOO"}, {"userName": "Beckie", "userReviewDate": "Jul 30, 2011", "userURL": "http://www.goodreads.com/user/show/4560150-beckie", "userReview": "My Thoughts: (I gave the book 4 Stars)I feel completely in love with this book from the start. I am such a suckers for a sappy love story and Remembrance is just that with a twist. The book starts out where a new boy, Drew joins the school where Lizzie the female lead character attends. Drew Carmichael just transfers from a school in NY and meets Lizzie on his first day. Lizzie feels strangely drawn to Drew like she knows him from some where even know she has never meet him before. After that day weird things start happening to Lizzie. She has a project for class to draw a scene from Pride and Prejudice - But once Lizzie looks up from what she was drawing she was amazed of what she saw...(I won't spoil it). She starts to feel not connected to her long time boyfriend anymore and every time she is near Drew she feel so oddly more connected to him but does not understand why she keeps feeling this way even thought Drew is pushing Lizzie away. One of the main reason why is because he is dating Lizzie BFF, Chelsea. More and more Drew keeps away for Lizzie and she does not understand what is going on.... she feel like there is more than he is telling her. Besides all of this going on, now she is having flashes of memory from a past or of her past? Lizzie cannot be sure of anything anymore, why she is remembering things in the past that are not her memories and why she feels so drawn to Drew, but mostly why he acts so cold towards her. Well the answers lie within this amazing novel written by Michelle Madow. I adored this book and I think it would be a fast, fun and exciting read for any age group. There were parts where I just wanted to smack drew or cry for Lizzie. I loved being able to feel so many different emotions during the process of reading Remembrance. I just love stories of past lives they are so unique and refreshing to me to read. I really enjoyed reading it and I think my readers will to. I would love to applaud Michelle for such a brilliant novel and I am glad I had the opportunity to read and review your book for you!"}, {"userName": "Rachel Harris", "userReviewDate": "Aug 30, 2011", "userURL": "http://www.goodreads.com/user/show/2098460-rachel-harris", "userReview": "When Michelle Madow approached us to review her debut novel REMEMBRANCE, and then pitched it as Taylor Swift’s “Love Story” music video meets Jane Austen’s Pride and Prejudice, I literally squealed. I am ALL about Regency inspired historicals, romance, and magical realism, and this book proved to have it all.I simply adored this book. The connection between Lizzie and Drew was palpable, the romance between them completely swoon worthy. I went into my read with hopes of a love story—a few hours later, I emerged with warm fuzzies all over and a sense of having undergone an adventure. Putting the clues together about their shared past as well as a few unexpected twists and turns at the end kept me riveted and intrigued, while hottie Drew just kept me grinning.Lizzie was a great protagonist. Her struggle over her feelings for her best friend’s boyfriend while having a boyfriend of her own was completely authentic. It was a tough line to walk, exploring those feelings and urges without losing the reader’s sympathy, but Ms. Madow handled it flawlessly. I would’ve loved for this story to be extended even more, to really dig into Lizzie’s current home life and perhaps more flashback scenes from the past to show the connection even more and add a sense of whimsy, but the story is beautifully told and Lizzie is a wonderfully crafted character.Minor characters were also well-done. Ms. Madow completely nailed the high school experience, complete with the whole Mean Girl syndrome that is/was an unfortunate reality for many of us. Characters were flawed and made some bad decisions, but they all added to the authenticity of the novel. And a couple characters were just pure fun to loathe. The cover is gorgeous and I’m glad to say that after an unfortunate roll of reading books with great covers that fell apart once I cracked the spine, this one actually lived up to my expectations. It is an easy read that I recommend for all lovers of modern fairy tales and romance."}, {"userName": "Marissa", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/9251647-marissa", "userReview": "Madow’s debut novel, Remembrance, was beyond wonderful; I simply couldn’t put it down! The protagonist, Elizabeth (Lizzie) Davenport lives in Pembrooke, New Hampshire, is about 17 years old, and on the first day of school locks eyes with her meant to be love, her soul mate, Drew. The only problem is: she has a steady boyfriend of three years, Jeremy, and a best friend (Chelsea) that at the same time has her eyes on Drew. What a story right? But there’s more! When Drew and Lizzie lock eyes that first moment in first period, history class, they had locked eyes before, but not in this lifetime, but in early 1800’s England. I told you there was more to this remarkable story ☺ I have given some of the important elements that build this story, but you must read, because even though Lizzie and Drew feel like they should be together (but of course have not told each other yet…) they still have hefty obstacles, hurdles to go over, because there is Jeremy and Chelsea in the way. I got hooked from chapter 1! I think introducing Drew that early in the story really catches the reader, and it creates more emotions/feelings from Lizzie. Madow has a beautiful gift, and that is her writing style, everything flowed very nicely. There was a great amount action and feelings from the characters that made the story move along, and feel realistic with a mystical twist. I love the comparison of Lizzie and Drew to Pride and Prejudice’s Elizabeth Bennet and Mr. Darcy, very brilliant. This was all around a creative idea, and as mentioned in her about page, it was from Taylor Swifts beloved song “Love Story.” Yes, this is truly a novel not to be missed, I encourage you read it, you will most definitely not be disappointed!"}], "description": "Lizzie Davenport has been reincarnated from 1815, England ... but she doesn't realize it until she meets her soul mate from the past and he triggers her memories to gradually return. When Drew Carmichael transfers into Lizzie's high school, she feels a connection to him, like she knows him. But he wants nothing to do with her. Reaching Drew is more difficult because she has a boyfriend, Jeremy, who has become full of himself after being elected co-captain of the varsity soccer team, and her flirtatious best friend Chelsea starts dating Drew soon after his arrival. So why can't she get him out of her mind? Lizzie knows she should let go of her fascination with Drew, but fighting fate isn't easy, and she's determined to unravel the mysteries of the past. PRAISE FOR REMEMBRANCE: \"If you were to take a dash of Romeo and Juliet, a handful of Pride and Prejudice, and a pinch of a Disney fairytale, you'd probably come up with Remembrance!\" --Gilbert & Gomez \"The love between Drew and Lizzie is everything you could hope to see in a love pairing. It's honest and real. Romantic and agonizing. Sensual and heartfelt. I was drawn into these characters, their relationship, and the world Michelle creates.\" --Addicted to Words Reviews \"I loved everything about Remembrance. The dialogue was fantastic, the pace moved perfectly, the romance was charming, and the story was brilliant!\" --Shortie Says", "title": "Remembrance\n      \n          (Transcend Time Saga #1)", "url": "http://www.goodreads.com/book/show/12170873-remembrance", "average": 3.57, "cover": "https://images.gr-assets.com/books/1328114206l/12170873.jpg", "reviews": 634, "authors": [{"url": "https://www.goodreads.com/author/show/5028484.Michelle_Madow", "name": "Michelle Madow"}], "type": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/12170873-remembrance", "http://www.goodreads.com/book/show/12298777-remembrance", "http://www.goodreads.com/book/show/12177772-remembrance", "http://www.goodreads.com/book/show/11992012-the-prophecy-of-shadows", "http://www.goodreads.com/book/show/17160608-the-secret-diamond-sisters", "http://www.goodreads.com/book/show/28176867-the-head-of-medusa", "http://www.goodreads.com/book/show/26876374-the-blood-of-the-hydra", "http://www.goodreads.com/book/show/33385614-elementals", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}