{"ratings": 4, "userreviews": [{"userName": "Karen", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/7314984-karen", "userReview": "I was able to easily understand and enjoy this book despite having not read the first book in the series.Its premise is that somewhat intelligent zombies are walled into our nations capital and the repercussions that it brings to the United States.I liked that the author brought in the criminal and political groups into the story along with the military.It put an interesting spin on the zombie genre.The book finishes nicely without any huge cliffhangers,yet definitely leaves room for more books in the series.I received a copy of this book from the author in exchange for an honest review."}, {"userName": "Jeanineitsme", "userReviewDate": "Apr 02, 2016", "userURL": "http://www.goodreads.com/user/show/27308431-jeanineitsme", "userReview": "This is Book two of a three book series. If you have not read Gnash (Book 1) yet, I strongly encourage you to read it first. Boo two, Rend, can be read alone, but the story continues from Book one and Gnash was such a great read that I’d hate for you to miss out! The next portion is a spoiler if you haven’t read Gnash. In Gnash, a young couple in the Washington DC area are thrust full force into a nightmare as a terrorist group does the unthinkable and unleashes a combination viral and bacterial attack on the Pentagon. Grayson has travelled to Colorado and so he is away from his girlfriend Emory when the attack begins. A similar attack happens where Grayson is and Gnash takes us through the initial reaction to the attack and brings both Grayson and Emory through their stories as they deal with this horror from different points of view. Rend begins as Retired CIA operative Asher Hawke, one of the characters from Gnash, is called to assist in the removal of the country’s most precious documents from inside the Wall, an enclosed area that includes Washington, DC, as well as surrounding areas. The Wall was constructed to keep the remaining undead from the rest of the county in one secure place. The Wall has been guarded by the military, but there are areas where one military branch’s coverage ends and the other military branch begins- an unprotected area- that makes it easy for outsiders to dump things they don’t want found and for thieves to breach the Wall to get to the valuables left behind when the area was abandoned after being bombed. Again, Brian Parker manages to put us right in the hotseat, squirming more than once as the undead seem to be able to communicate and rally against Asher and his unit. The pace is quick and the addition of the military angle make this a story that will appeal to many. I can’t wait until his next book is out!"}], "description": "", "title": "Rend", "url": "http://www.goodreads.com/book/show/28251799-rend", "average": 4.75, "cover": "https://images.gr-assets.com/books/1456682781l/28251799.jpg", "reviews": 2, "authors": [{"url": "https://www.goodreads.com/author/show/2866160.Brian_Parker", "name": "Brian Parker"}], "type": ["Horror", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28251799-rend", "http://www.goodreads.com/book/show/25602402-a-path-of-ashes", "http://www.goodreads.com/book/show/30969665-the-immorality-clause", "http://www.goodreads.com/book/show/34875443-grudge", "http://www.goodreads.com/book/show/27797729-fireside", "http://www.goodreads.com/book/show/28966779-gnash"]}