{"ratings": 411, "userreviews": [{"userName": "Lauren Stoolfire", "userReviewDate": "Jan 16, 2018", "userURL": "http://www.goodreads.com/user/show/6857324-lauren-stoolfire", "userReview": "Ever since Chew introduced me to Revival, I knew I had to get my hands on this rural noir horror graphic novel. The two are quite different in style, but I'm so glad I decided to give this a shot because I think I can safely say that it's now a new favorite. While the \"revivers\" are technically zombies, I love how it doesn't go in more of a traditional route with them. Instead it's a very tight mystery with paranormal horror elements, but it's definitely noir at its core. It's great trying to put things together with the unique cast. By the way, this story features some fantastic character development, and brilliant artwork. I can't wait to continue on with this graphic novel series! I really hope the plans for the adaptation go through because this has so much potential as a film (or tv series) - I wouldn't say no to Naveen Andrews taking on the part of Ibrahaim Ramin!"}, {"userName": "GrilledCheeseSamurai", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/2729981-grilledcheesesamurai", "userReview": "Soooo it's a zombie story...but without the zombies.Or something?Okay - it's not a zombie story. It's about dead people coming back to life in a small Wisconsin town. Don't make the same mistake that I did writing this series off because it's just another zombie story. I mean really...how many more of those do we need?No...this isn't that simple. This is rural/noir/horror at its finest. This is about fucked up people trying to come to grips with a fucked up situation. This is about heavy character development and some damn fine supernatural mystery. There's a lot of 'what the hell' moments that leave you scratching your head only to slap yourself in the forehead when things all come together and shock the shit out of you.Really...what this is...is candy crystal meth sprinkled on top of cocaine cupcakes. Thank the gods I bought both of the large deluxe editions because I just didn't want to stop reading.At first I was like...meh.Then I was like...meh?And then I was like...OH MY FUCKING SHIT!!and now I'm here.A damn fine comic. And seriously...that artwork! o_O"}, {"userName": "Sud666", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/36890366-sud666", "userReview": "Revival brings to mind two different tv shows. One is the HBO show \" The Leftovers\" and the other is the Kirkman show \"Outcast\". The town of Wausau, Wisconsin is the epicenter of a very strange events. The dead are not staying dead. While they are not returning as zombies the fact that a deceased cancer patient, is happily strolling the hospital wards, greeting people is cause for consternation.So a full blockade of the city, a 'la Leftovers style, is causing Wausau to become a hotbed of strange and bizarre events. In the middle of all this, the story follows of the adventures of the Cypress family- a dysfunctional family of a father and his two annoying daughters. The events take place as seen through their eyes. The father and the one daughter are local police, so it is an informative look at the events. I will not spoil any more of the story- but suffice it to say there are some big questions here. Not to mention the idea of people who can not die is bound to cause multiple issues for the police trying to maintain control. More than this I shall not spoil.The artwork is good and fits the story well. So why 3 stars? Two things- the unexplained nature of the ghost spirit thing, the irritating people of Wausau (especially the annoying Cypress family-all of them) and the utter disbelief in the scenario that dead people are rising from death and the Federal government response is to send 1 CDC doctor and then leave the rest up to the 5 local police officers. Yeah? Really? As if 10,000 Federal Agents/troops/whatever wouldn't descend on Wausau in seconds and boot the local yokels to the curb (where they belong). Still it was an interesting read and has some potential. I will be interested in volume two as there are some huge unanswered questions from this story."}, {"userName": "Yasha", "userReviewDate": "Mar 24, 2015", "userURL": "http://www.goodreads.com/user/show/36307634-yasha", "userReview": "It should be 3.5 stars because of the first half of the volume which was quite boring. That was the reason for me to stop reading it some time ago. What a complete fool I was! Yeah this comic IS GOOD. Finally there is a story with dead people who come back to life without becoming a zombie. Finally something unexpected. The art is fine and the story itself is atmospheric. First it wasn't catching at all, somehow a little bit later I found myself reading the last page. I can't imagine what to expect from the next volume, more surprises I guess!"}, {"userName": "Alexa", "userReviewDate": "Feb 05, 2015", "userURL": "http://www.goodreads.com/user/show/17295220-alexa", "userReview": "I need a \"I'm only reading this because I love the cover\" bookshelf."}, {"userName": "Nancy", "userReviewDate": "Nov 26, 2016", "userURL": "http://www.goodreads.com/user/show/14386326-nancy", "userReview": "Outstanding first volume in what will most likely be a long running series, for the characters and plot lines are set up for growth. I will definitely be reading future volumes of this series to see how the idea of loved ones reviving, which could be a dream come true for some, will be a nightmare for many.Reviews can be found on my graphic novels blog: Volume One- https://graphicnovelty2.com/2016/04/0...Volume Two- https://graphicnovelty2.com/2016/08/0...Volume Three- https://graphicnovelty2.com/2016/11/2...Volume Four- https://graphicnovelty2.com/2017/04/2..."}, {"userName": "Sage", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/23269983-sage", "userReview": "Not a bad 'intro' storyline. I enjoyed the initial setup and I'm looking forward to reading Volume 2. Art is solid and not confusing (able to quickly ID characters and not confuse them), writing is good, (not great) and content is fun. A bit of mystery and suspense but not a huge page turner."}, {"userName": "Jonathan Maas", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/4837365-jonathan-maas", "userReview": "Great subtle twist on a familiar genre. Great art!"}, {"userName": "Miriam", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/5391043-miriam", "userReview": "3.5 something is missing for me... but I can't pinpoint what :("}, {"userName": "Michael", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/4486167-michael", "userReview": "Als Jugendlicher hatte ich einmal diesen Traum:Ich kam nach Hause und sah unseren Cocker Spaniel in der Garage. Dort ließ ich ihn eingeschlossen zurück und öffnete die Wohnungstür. Freudig mit dem Schwanz wedelnd begrüßte mich - - - unser Hund!Hatte die Continuity-Abteilung meines UBW geschlampt oder war der Traum hinterhältig und durch die kalte Küche von Anfang an als genuiner Albtraum konzipiert gewesen? Einerlei, der Horror beim Anblick des zweiten und doch selben Hundes war unbeschreiblich und noch heute abrufbar.Was das mit REVIVAL zu tun hat? Gar nicht so wenig. Zum einen zeigt es, warum ich immer noch ein Horror-Novize bin; ich kann auf viel Blut und Gewalt gut verzichten und \"grusele\" mich gerne auf die vielleicht herkömmlichere Weise, die eher Geistergeschichten zugrunde liegt. Zum anderen aber wirft sich die Frage auf, warum Identität so ein hervorragendes Schauermotiv ist. Ob im Paranoia-Kino der 50er Jahre oder im Doppelgängermotiv in der Literatur, es bereitet uns einmaligen Schrecken, wenn jemand nicht der ist, der er vorgibt zu sein oder der er sein sollte.REVIVAL verlagert das Motiv nun ins waschechte Horrorgenre. In dem kleinen Städtchen Wausau, Wisconsin, kehren plötzlich die Toten unter die Lebenden zurück. Seeley erzählt die Story aber nicht im Stile einer Zombie-Apocalypse. Unaufgeregt stellt er die Frage, wie mit den Verstorbenen umzugehen ist, die ihren Platz im Leben wieder einnehmen. Polizei, Gesundheitsamt, Presse, Kirche - alle Instituionen laufen auf Hochtouren und können doch nichts dazu beitragen, Normalität wieder herzustellen. Dabei verhalten sich die meisten Zurückgekehrten (Sleeper) unauffällig, nehmen ihre frühere Beschäftigung wieder auf und treffen sich in Selbsthilfegruppen. Gerade dieser Versuch, Normalität zurück zu gewinnen, macht für mich den größten Horror an REVIVAL aus. Natürlich verzichtet Seeley nicht auf waschechte Horrorszenen, und gelegentlich fließt (nicht wenig) Blut, Täter und Opfer finden sich unter den Sleepern genau wie unter der Bevölkerung.Gerade die Mischung aus scheinbarer Normalität und Unerklärlichem macht den Reiz der Handlung für mich aus."}, {"userName": "Megan", "userReviewDate": "May 01, 2014", "userURL": "http://www.goodreads.com/user/show/898236-megan", "userReview": "This story takes the whole \"dead returning to life\" concept, and instead of going the zombie route, turns it into a pretty great supernatural mystery. It does everything I had wanted Jason Mott's The Returned to do."}, {"userName": "Tokio Myers", "userReviewDate": "Apr 28, 2015", "userURL": "http://www.goodreads.com/user/show/28412182-tokio-myers", "userReview": "I wasn't I huge fan of hack and slash so I was a bit skeptical of Revival but I have to say this was a fantastic comic. It has great art, drama, creepy children, badass characters, weird alien like things and a kick ass story. Definitely continuing this series."}, {"userName": "Ken Reed", "userReviewDate": "Dec 09, 2013", "userURL": "http://www.goodreads.com/user/show/4343906-ken-reed", "userReview": "Want something different to read? Like a little \"WTF\" to your reading? Tired of the over use of zombie genre but still looking for that feel? This is your book. Not safe for kids under 16 or for people with a strong Christian belief. But if none of that bothers you, happy reading."}, {"userName": "Gaz Watson", "userReviewDate": "Mar 18, 2015", "userURL": "http://www.goodreads.com/user/show/16198096-gaz-watson", "userReview": "Wow! I think this is probably the best comic I've ever read, loved everything about it. Just ordered volume 2."}, {"userName": "Christine", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/1792675-christine", "userReview": "Interesting take on zombies, definitely want to continue the series. Loved the art."}, {"userName": "Cat", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/6709212-cat", "userReview": "A great graphic novel; the art is gorgeous, the unnerving mood is set, and I appreciated how the female protagonists are depicted. I look forward to the second volume!"}, {"userName": "Cristina", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/1849500-cristina", "userReview": "https://osrascunhos.com/2017/12/30/re...Numa pequena cidade americana os mortos retornam. Mas apenas nesta pequena cidade. Como seria de esperar, o fenómeno afecta o quotidiano dos moradores, tanto daqueles que voltam, como daqueles que os rodeiam. Os crentes pensam estar próximo do fim, os restantes procuram justificações científicas enquanto a polícia investiga e se prepara para comportamentos estranhos.Com o objectivo de pesquisar os processos pelos quais os cadáveres passavam, uma jornalista filma a entrada de um caixão no forno de cremação. Nunca pensa ir filmar uma das primeiras vezes em que ocorre o fenómeno que levou a que, de dentro do forno, saísse uma criança, ilesa, que solicita a presença da mãe.A partir daqui o fenómeno torna-se comum levando à desconfiança de uma parte da população – parece afectar apenas os seres humanos e aqueles que regressam voltam com forças renovadas, capacidades de regeneração e alguns comportamentos estranhos que podem ser atribuídos ao choque psicológico do retorno.Os elementos estranhos não se ficam por aqui. Figuras esguias e esbranquiçadas andam nas florestas, camufladas pela neve enquanto velhotas que retornaram à vida retiram constantemente os dentes que teimam em voltar a crescer. Aparecem pedaços de corpos nos poucos camiões que ainda saem da cidade e a polícia é chamada a resolver um assassinato quase impossível. O quotidiano na pequena cidade é afectado de diversas formas pelo retorno dos mortos, mas será ainda mais com o espalhar da notícia por todo o mundo!Revival não se destaca pelas personagens ou pelo seu desenvolvimento, possuindo pessoas quase banais de uma pequena cidade que são confrontadas com o imprevisto. Revival destaca-se antes pela premissa e pela forma como a explora, incluindo elementos estranhos e misteriosos que poderão ser explicados em episódios mais tardios – a origem do fenómeno é desconhecida, bem como a sua restrição à pequena cidade.Revival não transpareceu, neste primeiro volume, ser uma banda desenhada excelente, mas entretém o leitor e consegue fornecer elementos de surpresa em quantidade suficiente para o manter interessado, integrando, até, a resolução de um crime no meio da confusão provocada pelo fenómeno."}, {"userName": "Rolando Marono", "userReviewDate": "May 24, 2017", "userURL": "http://www.goodreads.com/user/show/65310071-rolando-marono", "userReview": "The good:-The gore visuals. Mike Norton does an spectacular job illustrating bloody scenes.-The tension keeps raising since issue 1.-Some of the characters, like Anthony brothers or Mr. Anders, are very interesting.-The poem of the 11# is gorgeous.The bad:-Tim Seeley has a very confusing manner of writing, but as the story moves, you start getting the grip of it.-Too many characters.-The plot it's not very original, too many clichés."}, {"userName": "Aleyna Akıncı", "userReviewDate": "Jun 07, 2018", "userURL": "http://www.goodreads.com/user/show/74472034-aleyna-ak-nc", "userReview": "Bunu listeme eklerken yorumları baktığımda okumaya çok heveslendim ama yorumların dediği gibi acayip gerilimlidir çok korktuk okurken gibi bir çizgi roman değildi benim için. Ama kötüydü diyemem, çok etkili bölümleri vardı. Yine de şuan seriye devam etmeyi düşünmüyorum."}, {"userName": "Ann Bickle", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/39199923-ann-bickle", "userReview": "I really loved the premise of this collection. I tried to pace myself so I could enjoy the artwork and the \"stories\" are amazing."}, {"userName": "Elizabeth", "userReviewDate": "Jun 28, 2017", "userURL": "http://www.goodreads.com/user/show/7551032-elizabeth", "userReview": "Not just another \"zombie\" comic. I love the diverse and unique characters. I love the art work and story which is very relevant for these times. Can't wait to read more."}, {"userName": "Chad Malkamaki", "userReviewDate": "Jan 23, 2018", "userURL": "http://www.goodreads.com/user/show/12840159-chad-malkamaki", "userReview": "An interesting take. Part Fargo, part Twin Peaks, and the Walking Dead but these folks that rise from the dead aren't mindless zombies. Can't wait to start reading Volume 2."}, {"userName": "Charlie", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/44591848-charlie", "userReview": "good read"}, {"userName": "Stanley", "userReviewDate": "Jul 06, 2015", "userURL": "http://www.goodreads.com/user/show/7436444-stanley", "userReview": "Really cool book about what would happen if people who died within a certain time period and perimeter were to rise from the grave without the normal drawbacks you normally see from things like zombies and ghouls.Not to say that everything is peaches and cream here though as some of the people who come back cannot come to grips with it, snap and begin carrying out brutal acts of violence upon themselves and others.This reminds me of a mix between Fargo and The 4400 with undead instead of superpowers. The setting of Wausau, Wisconsin makes it even cooler as there are few stories that take place in the state and hardly any that take place outside of Milwaukee or Madison.The dialogue and the stories that have unraveled so far have been really good, but it has been the characters created that are the real draw here. You have the sheriff and his daughter, who is our lead. Her sister with a hidden past, her son stuck in a world that he can't come to grips with, his father who has never been able to come to grips with life, the washed up B move maker, self help book guru, reporter who broke the story, and CDC representative along with a huge cast of others who weave in and out of the story.While I love out main character who reminds me allot of the female lead in season 1 of Fargo, it may be her sister who I am the most interested. There are just too many treads to pull on there for her not to be.There have been some great moments from the first case of Revival, to the grandmother turning bad, to the spirit hunter, to the un-vegitable, to the showdown in the barn, this first collection just kept punching.My favorite thing about it, so far, though, has probably been the open philosophical questions about life and death, what it means to be human, the oft monstrosity of human nature, family, what a soul is and does, and whether or not you should come back if you can.I would be remiss not to at least mention the art of Mike Norton. He depicts some truly horrific things in this collection, which often left me a bit grossed out and/or a little nervous and twitchy. There were a night or two when the images would come back to haunt me when I laid down to sleep.This was an amazing start to this series and it is presented in the best possible way in this over-sized deluxe edition on thick, glossy paper. I am a huge fan of these types of books and hope that it becomes more and more of a trend. They are cheap and of the highest quality.If you tend to like this genre, grab this one up now, you won't regret it."}, {"userName": "Alex Hernández", "userReviewDate": "Jan 27, 2017", "userURL": "http://www.goodreads.com/user/show/52502358-alex-hern-ndez", "userReview": "Lo considero con un buen concepto en cuanto a la trama.Algo que no me llama del todo la atención (más en el sentido de que no termina de gustarme del todo) es que se pierde bastante la formalidad en la edición de los textos, como el hecho de repetir palabras dentro de los mismos párrafos en los escritos de presentación y promoción del comic.Los trazos me llamaron mucho la atención y, sobre todo, algo que viene mucho poniéndose entre los primeros lugares de tendencias en las historias nuevas (o no tan nuevas): los personajes principales y que llevan la batuta de las decisiones son mujeres. Honestamente la Revival a la que se le pone más atención en casi toda la historia es una mujer normal, pero muy fuerte y rebelde que sigue sus propios instintos sin detenerse mucho por valoraciones intelectuales. Y aunque tiene unos cuantos elementos genéricos como muchos personajes que se venden muy bien en el mercado literario, no me pareció un dibujo plano que no inspire empatía.Aunque no entendí mucho todos los cambios de escenas y llegué a pensar en su debido momento que era un recurso mediocre para llenar y llenar páginas, tengo la esperanza de que los escritores hayan tenido la intención de hacerla así desde un principio. Pues, si es así, es completa su intención de adentrarnos en la historia y hacernos sentir como a sus personajes en un ambiente totalmente caótico donde nada de lo que está pasando tan drásticamente se puede entender con facilidad.A pesar de lo confuso que resultó el 90% de la lectura, me deja con ganas de darle la oportunidad al segundo tomo de la historia.Por cierto: es agradable encontrarse con historias viscerales en las que el sexo es el primer recurso barato al que los escritores recurren y que suele quemarse escena tras escena por no tener la creatividad para llenar más páginas con contenido digno."}, {"userName": "Xhale", "userReviewDate": "Dec 11, 2015", "userURL": "http://www.goodreads.com/user/show/50014287-xhale", "userReview": "Wanted to like this more but there are just too many things wrong with the pacing. The transitions from scene to scene are too abrupt to allow the reader to be vested in what's going on. And when things do get interesting it gets lost in the plethora of side stories. It should never have taken 9 issues for Dana to address seeking out her sister's killer again. Also, this book was pegged as being a mystery but I didn't get that much from reading it because there wasn't enough exploration of anyone's death. And had the later issues shown the actual murders like in the first issue, it would have gone a long way in sustaining the graphic tone. There's too much dialogue that does nothing to propel the story forward or garner interest in some of the secondary characters. Sheriff Cypress, to me, is the most consistent in his arc. I also love Em, but I feel the story should be centered around her and Dana more. The last few issues really got the ball rolling and their complex relationship with their father is a huge part of it. Had certain subplots been introduced sooner it would have made the payoff at the end that much sweeter.Still, there are several flashes of potential and \"OMG\" moments that kept me on the edge just enough to warrant a bit of patience. I hope volume 2 builds off the momentum of the last two issues. A very slow and lengthy set-up but everything SHOULD go downhill from here. I liked the art for the most part and the cover/chapter illustrations are AMAZING. By far my favorite hardcover in my collection."}, {"userName": "Diana", "userReviewDate": "Mar 07, 2016", "userURL": "http://www.goodreads.com/user/show/10479935-diana", "userReview": "Has been a long time since I read ath so magnificnet. I love that the characters are really fleshed out, are strong, are weak, good, evil... very much like real life. You have losers, fighters, good people, your avergade Joe... The characters per se are sth of the greatest I've ever seen. And then comes the story: people die but don't stay dead. Don't think zombies. They just come back as they were. Not all of them fare well. Some get mad because purgatory is deneid to them. Some just go on as always before. Some...And then, there is the chaos around sth like this happening. What will the world think if it was now? The town has to be kinda quarantined. All kept very hush-hush. Meanwhile, try to solve everything, now why it is happening. But... what is happening? And what are those ghost like creatures? AMAZING. AMAZING. AMAZING."}, {"userName": "Lady Bill", "userReviewDate": "Apr 19, 2015", "userURL": "http://www.goodreads.com/user/show/885189-lady-bill", "userReview": "Creepy and complex. One of those brilliant stories where the people are monstrous and the monsters are just people, unless they are monsters. The series is one part small town detective serial and two parts supernatural \"end of the world as we know it\" and we don't know why panic and chaos. The characters, for the most part, are well developed and the author keeps the mystery of the series running with out being overly cryptic. The art style is detailed and gorgeous, which can make for some beautiful, if graphic, death and crime scenes. I look forward to reading the next volume."}, {"userName": "Paul Allard", "userReviewDate": "Feb 08, 2016", "userURL": "http://www.goodreads.com/user/show/28012344-paul-allard", "userReview": "An intriguing and bloody taleThis story centres around the revival of the dead, the cause of which is unknown. Those brought back to life are called “revivers” and the rest of the world is understandably wary of them. There are a lot of different characters quarantined in this small town in Wisconsin and it is sometimes difficult to remember who is who. The scene changes from one to another far too quickly (maybe it’s an age thing!)Good characterisation, particularly of the Cypress family, and illustrations of a high standard make this a compelling tale. Recommended."}, {"userName": "Jonas Lee", "userReviewDate": "May 22, 2016", "userURL": "http://www.goodreads.com/user/show/24134605-jonas-lee", "userReview": "Found this in a sale category and, judging a book by its cover, was interested. The premise was interesting, people coming back from the dead, healing from wounds, strange soul-like creatures running around. Some of the living dead, revivers, have some mental issues trying to cope or they aren't quite like they were before they died. I enjoyed the entire volume. It has enough intrigue to keep me wanting to come back for more and the artwork is my kind of flavor."}], "description": "For one day in rural central Wisconsin, the dead came back to life. Now, it's up to Officer Dana Cypress to deal with the media scrutiny, religious zealots, and government quarantine that has come with them. In a town where the living have to learn to deal with those who are supposed to be dead, Officer Cypress must solve a brutal murder, and everyone, alive or undead, is a suspect. The sell-out hit series created by New York Times Bestselling author Tim Seeley and Eisner-winning artist Mike Norton is collected in this oversized hardcover featuring Revival #1-11 and the Free Comic Book Day 2012 short story, plus many behind-the-scenes bonuses and other features.", "title": "Revival Deluxe Collection Volume 1\n      \n          (Revival #1-2)", "url": "http://www.goodreads.com/book/show/18853321-revival-deluxe-collection-volume-1", "average": 4.11, "cover": "https://images.gr-assets.com/books/1387745209l/18853321.jpg", "reviews": 56, "authors": [{"url": "https://www.goodreads.com/author/show/37607.Tim_Seeley", "name": "Tim Seeley"}], "type": ["Sequential Art", "Sequential Art", "Horror", "Horror", "Graphic Novels Comics"], "outlinks": ["http://www.goodreads.com/book/show/18853321-revival-deluxe-collection-volume-1", "http://www.goodreads.com/book/show/18471559-revival-deluxe-collection-volume-1", "http://www.goodreads.com/book/show/16137205-revival-vol-1", "http://www.goodreads.com/book/show/17818457-revival-vol-2", "http://www.goodreads.com/book/show/18809215-revival-vol-3", "http://www.goodreads.com/book/show/22358440-revival-vol-4", "http://www.goodreads.com/book/show/2371219.Hack_Slash_Omnibus_Volume_1"]}