{"ratings": 4584, "userreviews": [{"userName": "Allison (The Allure of Books)", "userReviewDate": "Aug 20, 2009", "userURL": "http://www.goodreads.com/user/show/1637878-allison-the-allure-of-books", "userReview": "This book was recommended by a good friend of mine, and she hasn't steered me wrong yet. This book will break your heart. First it will make you sick, then make you mad, then you will fall in love...then you will repeatedly feel like you've been run over by tanks. For the past three days, I have been hard put to set this down, and I haven't been able to stop thinking about it. It was kinda surreal reading it, because the story of Quanah Parker is pretty well known to me, I learned about him in various Oklahoma history classes growing up, and the mall I grew up going to is even in the city Cynthia Ann and Quanah are buried, and the mall is on the Quanah Parker by-pass.Going into a book about the Indians' dying way of live will of course be sad, but the utter hopelessness and heartbreak of this ending left me upset and even vaguely unsatisfied. I'm not saying that as a fault of the book-it is what actually happened.Anyway, even after having my heart broken at the end...I have to say it was worth it, this is a BEAUTIFULLY written story, and I will undoubtedly be picking it up again someday."}, {"userName": "Annette2009", "userReviewDate": "May 25, 2009", "userURL": "http://www.goodreads.com/user/show/2353991-annette2009", "userReview": "A CAPTIVATING, HAUNTING GLIMPSE INTO TEXAS HISTORYMany of the paperback covers make this book look like a cheesy western romance novel. Do not be fooled! Ride the Wind is based on the true story of Cynthia Ann Parker, who was kidnapped in 1836 during a brutal raid by the Comanche Indians, then adopted and raised by the tribe. I was stunned by my change in perspective – at the beginning, I was horrified by the savagery of the Indians; by the end, I was furious with the savagery and ignorance of the Whites. Cynthia, renamed “Naduah,” (sometimes translated as “keeps warm with us”), is assimilated completely into the tribe, marrying a respected warrior and eventually giving birth to Quanah Parker, the last free war chief of the Comanches. The novel sticks with the true story, and it ends in heartbreak, but it is truly a captivating, haunting glimpse into Texas history. It made the “best-loved books” list for both myself and my 97-year-old grandmother, and will be a favorite for readers who love adventure, history, romance, and Comanche Indian culture. Bonus: you can visit Old Fort Parker near Mexia, an authentic recreation of the original frontier settlement, and Palo Duro Canyon, the “Grand Canyon of Texas” so memorably described in the last chapters of the book."}, {"userName": "Kathrynn", "userReviewDate": "Feb 18, 2009", "userURL": "http://www.goodreads.com/user/show/669573-kathrynn", "userReview": "Thought this was a romance, but it most definitely is NOT. The beginning depicts, in graphic detail, a large group of American Indians attacking a Fort. Gang raping, scalping, killing, trampling kids with horses for fun, etc. The few that were unfortunate enough to be taken captive are then repeatedly gang raped, burned and abused. Cynthia was 9 years old when she was taken as a captive by Wanderer who was 16. She was almost raped, but Wanderer prevented it. The author did not come right out and say this, but Wanderer and the others that Cynthia continues to live with, participated in the continued nightly rapes of her Aunt--who was pregnant and nursing a child. The book goes into excruciating detail of the Indian way of life. Endless pages of narration and mind-numbing detail of how to skin a deer, how to use a deer body part for a sack for honey, how to get honey out of a bee hive, how to unpack camp, etc. I just couldn't take it anymore and once I learned there was no HEA and what would happen at the end of this book, I lost all interest in continuing."}, {"userName": "Rebecca Huston", "userReviewDate": "Aug 21, 2010", "userURL": "http://www.goodreads.com/user/show/4091267-rebecca-huston", "userReview": "My favourite of the various books that Ms. Robson has written. Don't be fooled by the cover -- this is not a romance novel by any means. It's smart, intelligent and based around a real story -- that of Cynthia Ann Parker."}, {"userName": "Wayne Barrett", "userReviewDate": "Mar 10, 2018", "userURL": "http://www.goodreads.com/user/show/21372390-wayne-barrett", "userReview": "3.5There is a great deal of details involving the lives and customs of the plains Indians in this version of the Cynthia Anne Parker story. This was a very romanticized depiction, but there are some extremely brutal scenes throughout the story. Aside from the gushy romance, this novel was told with great adventure and detail. Good for details on the lives of the Native Americans, good for an adventurous story, not so good for the facts about the life of Cynthia Anne Parker."}, {"userName": "Lisazj1", "userReviewDate": "Mar 14, 2014", "userURL": "http://www.goodreads.com/user/show/5816343-lisazj1", "userReview": "I'm a big book loaner. Every time I read something I loved, my first impulse is to give it to someone else immediately, \"here, read this!\". And a lot of times, I never get that book back. If I really loved it, I go and buy it again, so I still have a copy. Consequently, I have owned 7 copies of this book (yeah, I am dumb, because I kept loaning it out). The last time I bought it, I was told it was out of print, so I held on to that copy.I've always been interested in Native American history, and I remember how that interest fired when I read the back cover of this. This is a fictional story based on factual events. Cynthia Ann Parker was 9 years old when she & her brother were captured by Comanches in a raid and later adopted into their tribe. Cynthia (later Naduah) grew up to marry one of the Comanche's fiercest chiefs, Nocona. Her son Quanah Parker grew up to be the last free Comanche war chief. Much of what Ms St. Clair Robson wrote of their lives was taken from published interviews with Quanah Parker, who by all accounts was quite charming and social and loved to talk about his mother.I think I was just a few years out of high school when I first read this, yet I can tell you everything that happened here. I remember all the names and what they mean. I remember the battles, nights laughing under the moon, the sickness, conversations, Pah-mo the gazelle, betrayals, and deaths. The hatred, tenderness, sorrow, love, violence and stunning brutality. Everything. I've read this several times over the years, but there always comes the point where I just can't read on, and eventually I stopped re-reading. *there's your warning that there is no friggin' HEA*If there is anything that I can think of that some might not enjoy, it's the detail of their day-to-day life, as it could maybe sometimes be a bit tedious, depending on how interested you were in the first place but I was always fascinated.Might not be a book for everyone but it's one of the most wrenching, memorable stories I've ever read."}, {"userName": "Tara", "userReviewDate": "Sep 04, 2008", "userURL": "http://www.goodreads.com/user/show/1365137-tara", "userReview": "One of my personal all-time favorites. Do not be put off by the rotten cover. This isn't a trashy sex romance. It is actually a true story - the major incidents did happen. You'll become deeply attached to the characters and be heartbroken, in more ways than one, when it ends. I have spoken."}, {"userName": "Kandice", "userReviewDate": "Aug 05, 2008", "userURL": "http://www.goodreads.com/user/show/1396160-kandice", "userReview": "This book is beautiful, uplifting, shocking, hopeful, desolate, almost any emotion possible to feel will be aroused. St. Clair Robson takes the kidnapping of a young plainsgirl, and tells the story that will live in your heart years after reading it. The white child who grows to marry a chief. Who bears the very last free Comanche chief in America. Is she still white?She pulls no punches. She shows us the brutalities with which the Indians were treated, but on the other side of the coin, in the most fair portrayal I have seen, she shows us how brutal they could be. Not only to their enemies, but to each other.She teaches you how harmoniously the Original Americans lived with the land. How they used every resource available to them and wasted nothing. They were so ahead of where we, as country, now want to be. They understood the value of the land, the animals, the human spirit. They valued their children as treasures instilled with their future.The end of the book is brutal. Not physically, but it brings up the question: At what point is a kidnapping victim no longer a victim? At what point can we be left to our own decisions, regardless of race, creed, beliefs? Are some not good or intelligent enough to know what's best for themselves? Who gets to decide where someone belongs? Where they are most needed, wanted, regardless of their personal wishes?I cry each time I come to the end. How could you not?"}, {"userName": "Liz", "userReviewDate": "Jul 17, 2009", "userURL": "http://www.goodreads.com/user/show/772358-liz", "userReview": "If you are looking for a book about what it would be like to live with Indians, this is the book. It is based on the true story of a 9 year old white girl that was captured by Indians. The story line is definitely fictional though, as there is no written account from Cynthia Anne, the white girl, only that information from her white relatives and her oldest son, Quanah, the last free Indian Chief. She was raised by a Comanche Indian family and married an Indian chief and had three children with him. She lived with them for 24 years before she was discovered and returned to her family. It was a really interesting book, covered many events in the history of the Indians in the mid to late 1800's, and definitely portrayed the good and the bad. It made me feel sympathy for the plight of the Indians... and not so much for the whites. I found myself rooting for the Indians despite the terrible things they often did."}, {"userName": "Tamara Silver", "userReviewDate": "Oct 05, 2010", "userURL": "http://www.goodreads.com/user/show/821163-tamara-silver", "userReview": "The cheesy cover had me very skeptical about this book, but I think this is a book that is going to stay with me for years and years. Yes, there is better writing, but man oh man, what a story! I learned about Native Americans, the Texas Rangers, and Westward Expansion, in a way that I never learned in school. Learned about daily life, motivations, and how the Indians and settlers impacted each other. The book doesn't whitewash Indian attrocities, you do not get a trite, \"at-one-with-nature\" view of the Native Americans. Yet even after reading about cruel and twisted acts by the Indians I feel much more empathetic to what happened to them. Oh, and it is based on a true story! A great work of historical fiction."}, {"userName": "Kaylea Cross", "userReviewDate": "Jul 30, 2010", "userURL": "http://www.goodreads.com/user/show/3164934-kaylea-cross", "userReview": "I read this book years and years ago, and it's still one of my favorites. I could not put this down. The descriptions are so vivid I could smell the prairie air, and the characters are done so well they've stayed with me all these years. I loved the hero, Nocona, so much I even named my next dog after him :)A warning though, this book is absolutely wrenching and not for the faint of heart. But I promise if you read it, you'll never forget it. Incredible piece of writing."}, {"userName": "Julie", "userReviewDate": "Jun 04, 2018", "userURL": "http://www.goodreads.com/user/show/3534502-julie", "userReview": "Still one of my all time favorite books! Based on historical events, this is a story of Cynthia Ann Parker’s abduction and assimilation into the lives of the Comanches that kidnapped her. It outlines the gradual fall of the people. Beautiful, yet haunting. The incredible sadness will stay with you for months, if not years."}, {"userName": "Stephanie Deaton", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/6113425-stephanie-deaton", "userReview": "One of my favorite books of all time! The story of Cynthia Ann Parker, so if you are into Texas history you will love it! The opening scene is extremely gruesome, so just be forewarned. After that, it isn't quite so graphic. Lucia St. Clair Robson does a brilliant job relaying this story in a captivating, compelling and compassionate way. . ."}, {"userName": "ChloeLeeNH", "userReviewDate": "Sep 08, 2008", "userURL": "http://www.goodreads.com/user/show/923550-chloeleenh", "userReview": "This was one of my books from my high school days in the 1990's. I read it several times. I was very into historical fiction/non-fiction. It was amazing how much life St. Clair Robson breathed into a real story. A must read for any Native American History fan!!"}, {"userName": "Karen", "userReviewDate": "Dec 04, 2010", "userURL": "http://www.goodreads.com/user/show/3715539-karen", "userReview": "One of my all-time favourite books. I still get emotional even though I have read it several times. A classic."}, {"userName": "Sue", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/1803012-sue", "userReview": "Excellent book on the life of Cynthia Ann Parker and the last days of the free Comanche. This is a true story with a lot of information added on the daily lives of the Comanche.This subject is close to my heart since Cynthia Ann (Naduah is her Comanche name) is one of my ancestors. However, that's not what makes this such a great book. St. Clair Robson is a wonderful storyteller. She is able to weave the true events of Cynthia Ann's life, and the daily details of the lives of the Comanche into a book that keeps the reader engaged and interested throughout the entire 600 pages. That's not an easy feat.I would recommend this book for those interested in Native American culture, historical novel readers, Texas and/or the Old west history lovers and those who like very sweet love stories."}, {"userName": "Kris Irvin", "userReviewDate": "Aug 03, 2012", "userURL": "http://www.goodreads.com/user/show/1940795-kris-irvin", "userReview": "This book leaves me in a quandary. It was so well written, and yet parts were SO BORING. And parts were amazing, but some parts were not. I thought the character development of everyone was so well done it was ridiculous. As I read the book I became one of the People and I fell in love with the characters. When they died, parts of me died with them. I thought the beginning was a little much. It was ridiculously graphic and could have been... not that graphic. Also, Rachel Plummer didn't need to keep making reappearances. That was weird and unnecessary. The sex and violence were not my favorite. It wasn't necessarily gratuitous sex as it was extremely detailed. Just as the violence was pretty detailed. Everything else was fascinating. The culture and the people and the story line. I did get pretty bored during the Texan soldier bits. I don't know why those were ever necessary because they were drop dead boring. The book could have been at least 100 pages shorter if we didn't have to read about random hairy soldier guys. Best love story ever. Well, how about best love story with the weirdest beginning ever. Yeah, that's more accurate. I don't know. I couldn't stop thinking about the book, I couldn't put it down but I don't think I'll ever read it again. It was a little much for me. But I'm glad I read it once. (Also what the heck happened to Pecan?!)"}, {"userName": "Amy (mrsAmy#s)", "userReviewDate": "Jul 27, 2009", "userURL": "http://www.goodreads.com/user/show/1544042-amy-mrsamy-s", "userReview": "I'm a little torn on this book between 3 and 4 stars. Part of me LOVED it. I'm a fan of historical fiction and this story about the last few decades of the \"free\" Comanches is something I was unfamiliar with. The plot was quite fascinating and I liked the Wanderer/Nadua love story.On the other hand, the first half of the book was markedly better than the second half. The second half was full of cliches,e.g., \"We're in love and our two awesome horses had TWINS that look just like their parents\". Cheesy. And certain things were totally rushed (one of the main character's friend is killed towards the end with hardly a mention). It also seemed to move a lot slower for me in the second half.Something I'm not sure about- the violence in this book. I'm not sure when I last read something with such potent images of rape, torture, killing. Now, don't get me wrong- I think these portrayals were necessary in the context of the story, but... yowza. Makes me glad I didn't live in Texas back then!"}, {"userName": "Roxanne", "userReviewDate": "Aug 06, 2016", "userURL": "http://www.goodreads.com/user/show/870392-roxanne", "userReview": "This book continues to remain one of my favorite books of all time. This is not a romance, it's one of one several historical fiction books written by this author that feature real people and real stories. Her research and portrayal of the Comanche is spot on. It's brutal and loving all at the same time. Robson doesn't sugar coat their lifestyle or the things they did, at the same time she shows their heart. It's a historical fiction because Cynthia Anne never spoke of her life. She was captured when she was 9, she spent 24 years with the Comanche and died within a few years of being rescued. This book has no happy ending, it's an unflinching look at the last years off their freedom and one white woman who became one of them so thoroughly she could not and would not adapt back to her original culture."}, {"userName": "Erin", "userReviewDate": "Dec 01, 2016", "userURL": "http://www.goodreads.com/user/show/17957823-erin", "userReview": "Despite the deceiving cover that makes it look like a cheap romance, Ride the Wind shares the story of a young girl who is adopted into a Native American tribe. As she grows, the American government's presence becomes even more prominent and threatens the traditional culture and way of life for her adopted family. I felt that Lucia St.Clair Robson really wanted readers to get a feeling for 19th century life, the dangers faced by early settlers, the life of the Native Americans etc. The good and the bad. Some readers might find the graphic violence, including rape and torture, to be too much to stomach. Speaking plainly, I was more bogged down by the description of menial tasks and the shifting of viewpoints of characters within chapters that slowed the pacing of the story.A thought out story, but one which I wouldn't revisit."}, {"userName": "Tama", "userReviewDate": "Jul 23, 2010", "userURL": "http://www.goodreads.com/user/show/4045332-tama", "userReview": "My Mom was really into Native American books, so I read this book when I was a teenager. I wasn't all that into reading novels at the time, but I loved this book. Afterward, I tried to read Follow The River (it's another historical fiction novel) and could not get interested in it because I just kept comparing it to Ride the Wind. I was very intrigued by the Native American lifestyle and it had a wonderful love story."}, {"userName": "Becky Ford", "userReviewDate": "Mar 22, 2018", "userURL": "http://www.goodreads.com/user/show/4714549-becky-ford", "userReview": "DNFing at the 50% point. I don't have a strong enough stomach for this book. I was warned that it was violent, and I thought I could handle it (I've read a Brief History of Seven Killings...twice, so I'm not exactly a lightweight). This was just too much. The writing style was also not that great. There was too much \"First, she did this, and then she did this, and then she did this, followed by doing this and then she did some more.\" AHHH!!! I was not enjoying this book at all, and would much rather be reading something that I did."}, {"userName": "Amystamps", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/2662251-amystamps", "userReview": "Well, I gave this 4 stars because it really is a great story and I enjoyed it for the most part. But, it was SO long! I felt like it was the book that never ended. It just kept going and going. I would have enjoyed it more if some of the needless details were cut out. But it really is an incredible story that was told really well."}, {"userName": "Beccalarge", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/1125138-beccalarge", "userReview": "It's been a while since I have given 5 stars, but this book is incredible and just might be a new favorite. My mom and sister have been telling me for a while to read it, but to be honest, the cover sort of put me off. When I finally cracked it open and started reading I COULD NOT put it down....it was like finding a treasure!This book is worth reading for the history alone. It's the true story of young girl who was captured by the Comanche Indians at 9 years old. I have always loved reading about the Native Americans and this is one of THE BEST I have ever read. I loved learning about the day to day lives of the People, and found that this book was acurate on so many levels. I knew that the story was true, but I was blown away by the details of the different tribes, the differences in raiding, hunting, moving, eating, even the way they abused and mutilated their captives (and themselves while grieving). I did a lot my own research while reading, because although I know the author obviously took liberty with the characters and even some of the timing of events, I really wanted to know how deep the fiction went. From what I could find, this is an extremely accurate account of events. Even Cynthia Ann, the young captive who quickly assimilates into the tribe and finds herself not only happy, but thriving among the people is supported by many accounts. It is true that she was deeply in love with the man she marries, the Chief of the Naconi band (he was one of the leaders of the raid at Parker's Fort where she was captured). Chief Nacona was every bit the great warrior and leader that he is in the book, and it is true that he did not take any other wives after Cynthia, something unheard of for a chief. It is also true that Cynthia was a healer in the tribe and was greatly respected. She always rode at the front alongside her husband and carried his lance and shield (a sign not only of her place but of her husbands love and respect for her).This book is not for the faint of heart however....and I have to warn you...it is GRAPHIC. This is the real story and the author does not spare the details of war or of life. I found myself appalled at times, the brutality of the Indians was hard to read and the way they mutilated their captives was more than I could take. And yet I loved them and felt sorry for them when the White men took their lands and the life they had known. I cried when the white buffalo hunters came along, killing off the buffalo in order to obtain their hides, and then leaving the meat to rot. It felt so wrong knowing that the Indians used every inch of the animals they killed, even the massive buffalo, leaving nothing behind (not even bones or brain), and knowing that without buffalo to hunt the Indians would not survive. This is a great book. For it's history and for the story surrounding it. Beautifully written with so many details and beautiful descriptions. The characters felt so real to me, I loved them, cried with them and even missed them when I finished the book. I think everyone should read this book, should know the story Comanche Indians. And this leads me to the only real issue I have with the book.....it's too graphic to recommend. I could handle the bloody war details and for the most part felt that their authenticity was important (although wished at times the author would have been brief), but there are a couple of sex scenes that are just too graphic for young readers (and even for me). And for that reason I feel like I can't recomend it to others without a strong warning. But it really is my new FAVORITE. And I will read it again...and again."}, {"userName": "Alexis", "userReviewDate": "Dec 29, 2009", "userURL": "http://www.goodreads.com/user/show/783473-alexis", "userReview": "Okay, so the things I liked about this book outweigh the things I didn't...I think. Thats why I gave it 4 stars. That and I'm patting myself on the back for finishing. I really enjoyed that this book was set in Texas, much of it where I'm from in the Panhandle. Loved thinking about what this area looked like not even 2 centuries ago. Cynthia Ann Parker, or Naduah, is absolutely facinating. I can totally understand why her life and death caused such a stir, even to this day. The whole White Man/Indian issue is so interesting to think about. What if things had just been a little bit different? Anyway, I love historical fiction because it so brings history to life. Makes you view events from the perspective of the people who may have actually experienced it. I'm ashamed to say I live about a stones throw away from Adobe Walls and have never visited. I shall remedy that!So for the things I did not enjoy. It was just too dang long! I think the author WAY over did certain topics. She was obviously very throrough, but there's only so much I want to know about tracking someone's hoof prints or finding water in what looks like a desert. Or what they may have eaten at EVERY single meal! It was also quick to turn trashy romance novel-ish. And her flowery descriptions of landscape would go ON and ON! I was relieved to find out she is from Maryland. She would write scenarios that I was like, there is NO WAY that happend in Texas! At one point Naduah's family is travelling through a blizzard right after a huge prairie fire...around Austin! When was the last time there was a blizzard OR a prairie in the hill country?? Umm, never! The Panhandle, maybe. But then another time the temperatures at Palo Duro Canyon are supposed to be -25 degrees. Now, we just came through a bitter cold spell, and maybe the wind chill got that cold, but definitely not the temp!So anyway, the good outweighed the bad. I would reccommend this book to anyone from Texas, especially the Panhandle, hill country or around Nocona or with ties to the Commanche tribe. Interesting."}, {"userName": " Olivermagnus  ", "userReviewDate": "Aug 28, 2014", "userURL": "http://www.goodreads.com/user/show/9919989-olivermagnus", "userReview": "What a great read this book turned out to be! It's the historical fiction retelling of the story of Cynthia Ann Parker, kidnapped at the age of nine by a Comanche war band who massacred her family’s settlement in Texas. She was adopted by the Comanche and lived with them for 24 years, eventually marrying a Comanche chieftain and having three children with him, including the last free Comanche chief Quanah Parker. When she was 34, she was finally \"rescued\" by the Texas Rangers and returned to her white family. She spent the remaining years of her life in lonely misery, refusing to adjust to life in white society. The author appears to have thoroughly researched the conflict between the Comanche tribe and the Texans. I appreciated the way she told both sides of the story and the way Cynthia Ann Parker (Naduah in Comanche) is portrayed. In reality she never told anyone about her life among the Comanche but based on the stories from her son, Quanah Parker, I would like to think that the author's version was how it happened.I enjoyed this book very much but it is very difficult to read in places. It's often violent, very shocking reading, and is not for the faint of heart. Some of the atrocities were very difficult to read through especially the deaths of the children and babies. They die from disease and from the elements but many of them are brutally tortured and murdered. This is a wonderfully written and readable book. The author does a great job of describing the culture and time period. In many ways it is a heartbreaking book that documents a time and way of life that is gone forever."}, {"userName": "Wendy", "userReviewDate": "Feb 09, 2009", "userURL": "http://www.goodreads.com/user/show/1730638-wendy", "userReview": "I read this book years ago, then couldn't find it. I recently found a copy, but upon re-reading it I found that it depressed me to read the plight of the American Indian and the injustices done to them and their culture. I feel that this book is a close to life depiction of what happened to their culture and the angst between them and white people. If your are looking for a true to life story (this is a fictional depiction of a true life story) of Comanche Indians and the loss of their culture you must read this book. If you want the fairy tale version you might want to pick a different one. I give this book 5 out of 5 stars."}, {"userName": "Cora", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/7482798-cora", "userReview": "Fantástico, interesante y muy bien escrito.Me ha gustado muchísimo y en algunos pasajes he sufrido bastante con la crudeza de la violencia. A pesar de ello me quedo con la maravillosa y triste historia de este pueblo."}, {"userName": "Sherron", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/1137192-sherron", "userReview": "WOW!!"}, {"userName": "Justine Klein", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/15229501-justine-klein", "userReview": "This book, \"Ride the Wind\", by Lucia St. Clair Robson, is a beautifully written historic fiction set back in 1836, when the tension between Native Americans and the Texans approximately began. Cynthia Ann Parker was taken kidnapped from her home by a group of Native Americans when she was only nine years old. She was taken back to a Comanche tribe, along with a few others, and developed a life. Cynthia, later known as Naduah (\"Keeps Warm With Us\"), learned the ways of the People quickly, and became part of their culture itself. Although this book showed the kindness of the People, it also showed the violence that was shared between the Texans and the Comanche as they fought for their freedom from one another. One main theme of this book portrayed the similarities between the Comanche and the Texans. The People did live differently, but the families were similar in structure. The morning after Cynthia's first night, she compared the Comanche to her Fort, \"Men and women laughed as they went about their morning chores. Above the everyday morning sounds the shrieks of children at play rose again\" (43). The quote showed the simliarities between the two completely different groups of people. Also, the feelings of the Comanche were identical to anyone else. If one of their brothers was hurt, they wanted revenge, just as people are like today. They wanted to protect their family, even though their ways of protection were different, it all has the same general idea. The Texans fought back similarly, to protect their people, but to also gain the precious land of the Native Americans. Seeing the comparison between the Comanche and the Texans is a major theme in this book because it shows that the think and feel the same way, they just act upon it differently.Another theme within the book is how opinions are raised from factors of life. Naduah's perspective changed as she became one of the People, but she learned to cherish and love them as her family. She believed their thoughts, and thought of the Texans in the same way as they did. But as a young girl, she knew what the Native Americans were capable of at the sight of them. But because she learned the ways of the Native Americans, her opinions changed from a white woman's point of view to a Comanche woman's point of view. Later in the book, when Naduah is surrounded by white women, a woman states, \"Poor, poor woman...you poor thing\" (544) at the sight of seeing Naduah as a Comanche. This woman believes that Naduah had a rough life living with the Native Americans, but Naduah knows no other way of living and doesn't want to know another way. The quote was very beneficial when seeing the comparison between the two. Factors, such as the setting around us, the people we are raised with, and the lessons we learn, all attribute to a person's perspective of life.I believe this book is meant for mature readers. It does have violence, and other scenes, that may be inappropriate to younger readers. Mature readers are also able to understand the similarities and the differences between the groups of people and how they coped with life- some harder than others. It's a great book, with beautiful imagery and a fantastic storyline."}], "description": "In 1836, when she was nine years old, Cynthia Ann Parker was kidnapped by Comanche Indians. This is the story of how she grew up with them, mastered their ways, married one of their leaders, and became, in every way, a Comanche woman. It is also the story of a proud and innocent people whose lives pulsed with the very heartbeat of the land. It is the story of a way of life that is gone forever....", "title": "Ride the Wind", "url": "https://www.goodreads.com/book/show/165446.Ride_the_Wind", "average": 4.37, "cover": "https://images.gr-assets.com/books/1320493238l/165446.jpg", "reviews": 435, "authors": [{"url": "https://www.goodreads.com/author/show/96160.Lucia_St_Clair_Robson", "name": "Lucia St. Clair Robson"}], "type": ["Historical", "Fiction", "Historical", "Westerns", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/165446.Ride_the_Wind", "http://www.goodreads.com/book/show/544369.The_Tokaido_Road", "http://www.goodreads.com/book/show/544368.Walk_in_My_Soul", "http://www.goodreads.com/book/show/544367.Light_a_Distant_Fire", "http://www.goodreads.com/book/show/187851.Shadow_Patriots", "http://www.goodreads.com/book/show/104439.Ghost_Warrior"]}