{"ratings": 335, "userreviews": [{"userName": "Kasandra", "userReviewDate": "Jul 02, 2009", "userURL": "http://www.goodreads.com/user/show/284714-kasandra", "userReview": "I. Should. Not. Write. Again. Ever. BUT YOU SHOULD READ THIS (especially, if, like me, you first read Rilke as a lovesick teenager writing horrible poetry and liked his work okay, and didn't think about him again for years)..."}, {"userName": "Vanja Petrović", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/17041796-vanja-petrovi", "userReview": "Pesme izvan mojih trenutnih interpretativnih mogućnosti."}, {"userName": "Louis", "userReviewDate": "Jan 18, 2018", "userURL": "http://www.goodreads.com/user/show/16754662-louis", "userReview": "Outstanding. This book is like medecine for my apathy. It humbled me, reminded me that in spite of the pointlessness that runs like a thread through our lives, in spite of all the anxiousness, the insecurities, the feeling of inferiority, of puniness, there is so much to live for, if only you can (dare to) see it. I love this so much."}, {"userName": "Chris", "userReviewDate": "Feb 07, 2012", "userURL": "http://www.goodreads.com/user/show/2764185-chris", "userReview": "I didn't get it. Seriously. Or...maybe I did, and I'm totally underwhelmed. I loved Rilke's \"Letters To a Young Poet\", and that's what made me want to look his poems up. Did I pick the wrong selection? I kept feeling like each poem started building momentum to reach significance, but I was robbed of my expectation each and every time. Only one poem that really seemed to reach me (The Dog), which was incredible. One! Could Rilke be too much of a romantic/surrealist to appeal to me? It was all so maudlin and hyper-sensitive, emotionally effusive and I would even say it indulged in emotive gluttony. I totally admit that I may be too crude and obtuse for Rilke's finer sensibilities and razor-sharp intellect...but it just felt way too florid and anemic. Poor Rilke. I didn't mean it. Or maybe I did. Just tell me one thing, did I understand you or not?To be fair, I only read about 60 pages before I started to think I was wasting my time. If anyone thinks I might change my mind on a poem I haven't read of his, please steer me straight. I want to believe. I want to believe. I want to believe."}, {"userName": "Jenna", "userReviewDate": "Mar 29, 2011", "userURL": "http://www.goodreads.com/user/show/1939917-jenna", "userReview": "If you're a fan of Rilke, you'll enjoy this compact book of his poems. The book contains poems from: The Book of Images; New Poems; Requiem for a Friend; Poems, 1906-1926; French Poems; The Life of Mary; Sonnets to Orpheus; The Duino Elegies; Letters to a Young Poet; and an index of first lines. My personal favorite is the French Poems, especially \"Child in Red\". To have a multitude of his poems from various books compiled into one creates an interesting view of Rilke's work as a whole."}, {"userName": "Friedrick", "userReviewDate": "Dec 13, 2011", "userURL": "http://www.goodreads.com/user/show/7115533-friedrick", "userReview": "My rating reflects my view of the relative merit of the translations. Frankly, I don't care for J.B. Leishman's translations, although they're better than some of the bizarre renderings others have put out."}, {"userName": "Justin", "userReviewDate": "Jul 12, 2014", "userURL": "http://www.goodreads.com/user/show/1305398-justin", "userReview": "I don't really \"get\" poetry."}, {"userName": "Lexi (Pink Jellyfish)", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/4218798-lexi-pink-jellyfish", "userReview": "Cornucopia..."}, {"userName": "Priti", "userReviewDate": "Feb 08, 2018", "userURL": "http://www.goodreads.com/user/show/26144869-priti", "userReview": "Is there anything better than Rilke to make you think about your life? And how you live it? And how others live in and out of your life? His \"Requiem for a Friend\" poem was given to me recently and I had forgotten how moving his work could be. I keep coming back to him, about every 10 years or so. There is no better sign of a classic than one that evolves with you."}], "description": "The Everyman's Library Pocket Poets hardcover series is popular for its compact size and reasonable price which does not compromise content. Poems: Rilke contains poems from The Book of Images; New Poems; Requiem for a Friend; Poems, 1906-1926; French Poems; The Life of Mary; Sonnets to Orpheus; The Duino Elegies; Letters to a Young Poet; and an index of first lines.", "title": "Rilke: Poems", "url": "http://www.goodreads.com/book/show/344157.Rilke", "average": 4.29, "cover": "https://images.gr-assets.com/books/1320508057l/344157.jpg", "reviews": 13, "authors": [{"url": "https://www.goodreads.com/author/show/7906.Rainer_Maria_Rilke", "name": "Rainer Maria Rilke"}, {"url": "https://www.goodreads.com/author/show/651931.J_B_Leishman", "name": "J.B. Leishman"}], "type": ["Poetry", "European Literature", "Classics"], "outlinks": ["http://www.goodreads.com/book/show/344157.Rilke", "http://www.goodreads.com/book/show/46199.Letters_to_a_Young_Poet", "http://www.goodreads.com/book/show/46201.The_Selected_Poetry_of_Rainer_Maria_Rilke", "http://www.goodreads.com/book/show/53111.Duino_Elegies", "http://www.goodreads.com/book/show/93405.The_Notebooks_of_Malte_Laurids_Brigge", "http://www.goodreads.com/book/show/467164.Rilke_s_Book_of_Hours"]}