{"ratings": 158, "userreviews": [{"userName": "Judy Lesley", "userReviewDate": "Feb 04, 2018", "userURL": "http://www.goodreads.com/user/show/4814399-judy-lesley", "userReview": "I received an ARC of this book through the Amazon Vine program.Cesar Ritz was already on his way to making a name for himself before Richard D'Oyly Carte convinced him to come to London for a short stay to help get the new Savoy Hotel on its feet. Ritz brought along Auguste Escoffier to take care of the food side of the service. Both men remained much longer than they had expected to and were instrumental in changing the old rules of accommodation and dining for their wealthy patrons. The juggling act of including new money patrons with the aristocratic customers was deftly handled by Ritz. Escoffier began to educate the palates of Englishmen who were more inclined to entertain at home. During these late years in the reign of Queen Victoria the social climate was changing as more and more money was being made through trade, not inheritance. D'Oyly Carte was content to allow Ritz and Escoffier to run the Savoy as they saw fit until the profits began to disappear. Through a combination of bad management and conducting business as it had always been done the men were on a collision course with disaster.Ritz and Escoffier worked so well together they established the standards for luxury and indulgence in hotels throughout Europe. This book is a look at what went wrong at the Savoy after everything had gone so right. From there Ritz and Escoffier continued to run hotels only now as owners or partners. Their willingness to use modern technology, such as 24 hour electricity throughout the hotel and elevators which worked round the clock, made their properties the destination of choice by those who could afford to stay there.This book gives readers a look at an important age of social change. Ritz was such a forward thinker he didn't hesitate to break down the old rules of who would be allowed access to the finest luxuries in lodging and food. His efforts were directly responsible for women dining in a public place when unaccompanied by a man. It seems that Ritz was constantly working to loosen the strictures of society in order to make his hotels more financially successful but also to give genuine pleasure and comfort to patrons. Escoffier changed the entire atmosphere of the kitchen and provided an example of how a kitchen could be run to remove the turmoil which had been known to rule there. These are food service standards which are still practiced today. Both men had a proven impact on how the two industries they represented were changing with the times. The hotel and food service industries would never be the same. The information is available in an easy to read narrative but I have to admit to finding the book easy to put down. This book might be of more interest to readers with a special interest in the food and lodging industries."}, {"userName": "Margaret Sankey", "userReviewDate": "Aug 11, 2017", "userURL": "http://www.goodreads.com/user/show/5861086-margaret-sankey", "userReview": "Have I mentioned lately how much I miss teaching the World of Food class? Before Ritz and Escoffier, \"hotels\" were either the house of someone from whom you could wrangle and invitation, or a crummy inn where you might sleep with strangers and bedbugs, or maybe an exclusive spa that refused to admit nouveau riche Americans or Jews. Cesar Ritz and Auguste Escoffier has begun their quiet revolution in hotels in Switzerland and along the holiday coast of France, but their paths crossed at the whim of Richard D'Oyly Carte in his new London Savoy hotel. D'Oyly Carte might know musical theater, but had no sense of the hospitality industry--giving Ritz and Escoffier the chance to institute the modernized kitchen brigade system, teach guests how to use flush toilets, put unaccompanied elite women in the dining room (in full view!) and invent the gentle art of celebrity management (Sarah Bernhardt has taken too much chloral in Room 473!)."}, {"userName": "Marks54", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5109654-marks54", "userReview": "Luke Barr, who has written before on high profile chefs, provides a dual biography of Cesar Ritz and August Eschffier, the hotelier and chef who together invented 20th century models for the luxury hotel with the world class restaurant attached to it and serving the most prestigious customers in the world. The book chronicles the rise of the duo from early successes in Europe to their breakout at the Savoy Hotel in London to their move back to Paris to found the Ritz Hotel to their subsequent expansions after 1900. Eventually the world changes (WW1) and time catches up with the pair. Their influence is still around both directly (Ritz-Carlton Hotels; Ritz Crackers) and indirectly (the Home Alone movies; Eloise at the Plaza; even the hotel environment in “A Gentleman in Moscow”). We take the combination of world class hotels and top flight dining as a given and yet Barr shows this is a fairly recent development dating from the last decades of the 19th century.What did I like about the book? The story about restaurants and hotels is a good one, but it cannot be the key. It cannot just be about the food, especially what we now know and what the scolds never tire of repeating about the health benefits of gourmet eating. Living well took its toll on many of the principals in this book. Mr. Barr provides lots of interesting detail into how all the different aspects of this complex product had to fit together for the overall result to be successful. This took to powerful integrating eye of Cesar Ritz to balance the impossible set of variables that were of potential interest for discerning and wealthy customers. A good example of this is the discussion of how Ritz decided on the lighting schemes for his Ritz Hotel before it opened in Paris.The product is indeed a fascinating one, and Mr. Barr’s book provides a lot of nifty detail about how the business works and how Ritz made his choices. Imagine how difficult of a business this must be, given the variety of different customers, the wide range of possible offerings, and the cutthroat competition in which an establishment would get one chance to captivate a customer and would lose them forever if the customer was not enthralled. Having said that, there was not enough said about the broader business model, including the financing, pricing, and broader supply chain. In a business where key ingredients are sourced globally and stakeholders are numerous and complexly intertwined, how does the business model generate profits for those who are good at it? This is far from obvious. I know that the world of financing and social media and suppliers has moved on to more modern conditions, the basic problem persists. How does one create, price, and sustain an adventure catering to those who literally have money to burn? Mr. Barr provides tantalizing hints of this world in his discussion of the situations that forced Ritz and Escoffier to leave the Savoy and go to Paris. They are only tasty tidbits, however, and more discussion of this would have helped the book. It is no doubt true that personal relationships dominate this sort of business, but the numbers involved in these businesses are no doubt staggering and telling the interpersonal narratives does not get to the heart of how this sort of business worked then or works today.Having said that, I will note that there are few if any books about high end restaurants that are really satisfying and Mr. Barr’s book is one of the better ones currently on offer."}, {"userName": "Dianne Everson", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/77651512-dianne-everson", "userReview": "I enjoyed this book, but it is not for everyone.The history is interesting, but Escoffiers menus were a little tedious after the second multi course one.It would make a fun movie, with the \"ritzy\" hotels and period costumes."}, {"userName": "Theresa Connors", "userReviewDate": "May 11, 2018", "userURL": "http://www.goodreads.com/user/show/1281056-theresa-connors", "userReview": "Well researched but the writing was meh. It didn’t draw me in."}, {"userName": "SundayAtDusk", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/18316640-sundayatdusk", "userReview": "This book provides an interesting look at the lives of hotelier César Ritz and chef Auguste Escoffier. Both left \"the continent\" to tackle the jobs of establishing a grand hotel with a grand restaurant in London. At that time in England, fine entertainment was usually done only in private homes and gentlemen's clubs, which of course excluded a lot of people. Also, it was debatable if the food served during such exclusive gathering could even qualify as \"fine dining\". The British were not seen as being very adventurous with their cooking by others in Europe, particularly those in France. Messieurs Ritz and Escoffier would go on to change the hotel and dining worlds in England, opening the doors for the acceptable presence of the nouveau riche, Americans, Jews, women unescorted by men, etc. César Ritz was also involved at the same time in other hotels throughout Europe. What he accomplished in a 24-hour day was astounding, but all that never-ending work had a steep price. While I did not find this book by Luke Barr fascinating, it was still interesting enough to keep me reading to the end, and now I know all that was behind the 1920s slang term \"to put on the Ritz\".(Note: I received a free ARC of this book from Amazon Vine.)"}, {"userName": "Lauren Albert", "userReviewDate": "Apr 14, 2018", "userURL": "http://www.goodreads.com/user/show/2828794-lauren-albert", "userReview": "This gives a very good sense of what it was like then for people with money and/or fame. He shows how Ritz stage managed a change from a world where women did not eat in restaurants to a world where anyone who could afford to ate in restaurants. And perhaps most significantly, a world where hotel rooms did not have bathrooms to a world where they did. 😉"}, {"userName": "Linda", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/2890071-linda", "userReview": "Hotelier Cesar Ritz and chef Auguste Escoffier transform the Savoy in London and later open the Ritz hotel. Their story is quite interesting as it exposes the prejudices and the rise of the leisure class."}, {"userName": "Deidre", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/7829591-deidre", "userReview": "A captivating and well-researched slice of Gilded Age life. Ritz and Escoffier are legends in the worlds of service, luxury, and style. The book captures the moment that the Savoy hotel became the place to be seen by London's elite. The details on Escoffier's famed elaborate menus, gossip at the time, and the tidal shift in wealth made this a fascinating read."}, {"userName": "Ronald Koltnow", "userReviewDate": "Mar 16, 2018", "userURL": "http://www.goodreads.com/user/show/25309621-ronald-koltnow", "userReview": "What does one think of when one hears the name Ritz? Cesar Ritz, the man behind the concept of ritzy, was a simple man, uneducated and insecure. He thought he had peasant hands. Yet, he knew the hotel business. When approached by the owners of the Savoy Hotel in London, Ritz took charge and modernized the concept of hotels and service forever. Ritz's first act was to install Auguste Escoffier as the hotel's chef. Escoffier, with his theory of brigade de cuisine, revolutionized the preparation of food and the philosophy of service. He fought to have cooks recognized as professionals. This is a compelling adventure story, as Ritz and Escoffier battle tight-fisted directors, old-world attitudes, and the sheer physical challenge of serving hundreds of fastidious diners at private parties and at evening service. This is a rarefied world of princes, lords, ladies, and the occasional courtesan. Ritz changed the social order by appealing to Jews and the nouveau riches (those who earned money). This slim narrative has color, excitement, history, and even financial scandal. Names are dropped, especially the Prince of Wales (soon to be King Edward VII), tons of truffles are eaten, and champagne flows throughout. This book may be about snobs but it is not for snobs. A delight!"}, {"userName": "Janet", "userReviewDate": "Oct 23, 2017", "userURL": "http://www.goodreads.com/user/show/7306509-janet", "userReview": "From the Publisher - In early August 1889, Cesar Ritz, a Swiss hotelier highly regarded for his exquisite taste, found himself at the Savoy Hotel in London. He had come at the request of Richard D'Oyly Carte, the financier of Gilbert & Sullivan's comic operas, who had modernized theater and was now looking to create the world's best hotel. D'Oyly Carte soon seduced Ritz to move to London with his team, which included Auguste Escoffier, the chef de cuisine known for his elevated, original dishes. The result was a hotel and restaurant like no one had ever experienced, run in often mysterious and always extravagant ways--which created quite a scandal once exposed. arr deftly re-creates the thrilling Belle Epoque era just before World War I, when British aristocracy was at its peak, women began dining out unaccompanied by men, and American nouveaux riches and gauche industrialists convened in London to show off their wealth. In their collaboration at the still celebrated Savoy Hotel, where they welcomed loyal and sometimes salacious clients, such as Oscar Wilde and Sarah Bernhardt, Escoffier created the modern kitchen brigade and codified French cuisine for the ages in his seminal Le Guide culinaire, which remains in print today, and Ritz, whose name continues to grace the finest hotels across the world, created the world's first luxury hotel. The pair also ruffled more than a few feathers in the process. Fine dining would never be the same--or more intriguing.Abit of history (from me) We all have heard of Ritz but few have heard of Escoffier unless you have read about or studied hotel and restaurant history. At the end of the Victorian era, snobbery was beginning to peak, although it would not really be over until the end of the Edwardian era. Caught up in this snobbery were the nouveau-riche and their \"dollar duchesses\", women (such as Consuelo Vanderbilt) who were married off to cash-poor gentry with titles. The nouveau-riche liked to show off their wealth and where better but a hotel and its famed restaurant where women could (gassssp) eat alone in full view? (We can also blame Escoffier for the kitchen brigade and despotism that led to tyrant chefs such as Gordan Ramsey.. thanks for that...not!)If you love social history and anything travel and food-related you will love this book. Deftly and highly entertainingly written you will be caught up in the founding of what we take for granted today whether we are camping out at Motel 6 or ensconced in the presidential suite at the Savoy in present-day London. I am still laughing at the thought of having to teach these snobs how to flush a toilet that (gasp) was IN THEIR ROOM vs. a w.c. down the hall or using a water closet. [fun fact - my husband's grandfather refused to have an indoor bathroom as late as the 1930s ... he thought that was the most disgusting thing on the planet.This is a great book for any reader of history, traveler, or foodie --- it is certainly being purchased by me and placed on my bookshelf once published.."}, {"userName": "Schuyler Wallace", "userReviewDate": "Oct 28, 2017", "userURL": "http://www.goodreads.com/user/show/1140776-schuyler-wallace", "userReview": "The stories of both a legendary hotelman and an exemplary chef make for a great read in Luke Barr’s “Ritz & Escoffier.” The late 1800s into the early 1900s was the period of the European grand hotel and two men, Cesar Ritz and Auguste Escoffier, were largely responsible for the proliferation of many fine hostelries at that time. Hotelier Cesar Ritz became famous as his travels around the world of hospitality took him through ever-increasing levels of responsibility as he created and maintained the highest levels of service in many fine hotels all over Europe. He met master chef Auguste Escoffier in Switzerland in 1873 and their tandem career of creating fine hotels with exquisite food preparation began. Some small accomplishments started a long and prosperous relationship.Their first major venture was the renovation of the Savoy in London in 1890. The transformation was an immediate success creating a major change in aristocratic lodging and dining. Ritz was able to exercise his managerial magic to attract the moneyed to the hotel’s swank confines and Escoffier created many famous dishes at the Savoy. Despite their success, both Ritz and Escoffier were fired in 1897 by the board of directors for improprieties with hotel properties and supplies as well as conflicts of interest as they attempted to expand their vision of fine hotels throughout Europe.Their reputations were not damaged, however, as they successfully opened Hotel Ritz in Paris and, in subsequent years, the Carlton and Ritz hotels in London. These, along with the Savoy, are still operating as first-class hotels today. Escoffier went on to oversee food preparation aboard the super liner SS Imperator and so impressed Kaiser Wilhelm II that the Emperor proclaimed him to be the “Emperor of Chefs” further establishing him as the pre-eminent French chef at the time. Several international culinary schools operate today under the Escoffier name. His cookbook is legendary and still in print.Luke Barr is an editor at “Travel+Leisure” magazine and author of “Provence 1970” His great aunt was M.F.K. Fisher, a prominent American food writer, giving him some foresight into the world of cooking. He is a great writer, presenting a complex biography of two complicated men and their lives in the hospitality business. I found the book to be fascinating and written in a style that provided the reader with details about a business that is full of intrigue and abstract ideas. Innovative ideas about managing hotels and the staffs and the creation of magnificent food are provided. Aside from absence of bedbugs and impeccable cleanliness, it’s hard to define what’s necessary in the hospitality world but Barr succeeds with great insight. It’s difficult to place a label on what it is that provides comfort and taste to those who eat and travel, or, for that matter, those who are merely away from home when its time to have a meal. The author has done that with great competence. This might be my favorite book of the year."}, {"userName": "Laurie", "userReviewDate": "Jan 17, 2018", "userURL": "http://www.goodreads.com/user/show/1050800-laurie", "userReview": "Cesar Ritz started his career as a waiter in Parisian restaurants. He worked his way up to better and better eateries, and finally made the step to being a hotel manager. He had an eye for improving things and a memory for what guests liked and didn’t like. Auguste Escoffier was a brilliant chef, with equal skills in creating food and managing kitchens. When he started, kitchens were mad houses filled with yelling, drunkenness, food that arrived with some bits already cold and some hot, and very slow service. He and Ritz would find they worked together like a fine machine. When they took over the Savoy in London, the world of hotels and restaurants changed. They brought the running of hotels and restaurant kitchens to the level of fine art. Before Ritz took over the Savoy, even expensive hotels had one communal bathroom per floor; he instituted en suite bathrooms. He insisted on modern plumbing and electric lighting (a new thing, just coming into use) and adopted the telephone for business use immediately. He filled the rooms and common areas with plants and flowers. He allowed anyone into the restaurant to dine, not just the aristocracy- unescorted women, actors, Jews, the nouveau riche, even ladies of dubious morals; basically, anyone who could afford evening dress. He and Escoffier worked together to produce over the top parties for people like the Prince of Wales, Escoffier producing new dishes for the guests of honor. Escoffier kept meticulous records of every menu and every recipe, eventually producing a massive cookbook that was the gold standard of French cooking for decades. Eventually, however, the fact that they worked without close supervision caught up with them. They were accused by the hotel stockholders and owners of charging personal goods to the hotel, taking kickbacks from suppliers, and other monetary malfeasance. They were both fired promptly. It didn’t hurt for long, however- they went on to open the original Ritz hotel, the first hotel under his name. It’s a fascinating look at social history at the turn of the 20th century, a time of huge changes in both technology and social ways. Americans were marrying into the British aristocracy, new millionaires were appearing all over, people in the theater were becoming acceptable, and the British aristocracy was at the peak of their popularity. There are several menus from special events reproduced, but I would have liked to have seen some photos included in the book, and maybe a couple of recipes. There is very little given about the personal lives of the two men. Four and a half stars."}, {"userName": "Jennifer Malinowski", "userReviewDate": "Oct 18, 2017", "userURL": "http://www.goodreads.com/user/show/41549696-jennifer-malinowski", "userReview": "Ritz and Escoffier by Luke Barr is a fascinating story of the rise of the famed Swiss hotelier Cesar Ritz and the French chef Auguste Escoffier. Barr's pleasant writing style made this narrative nonfiction book one I read in a little over a day. I enjoyed the descriptions of the opulence of the Savoy and Ritz Hotels and a glimpse into the life of the upper class who stayed at these hotels. However, I did not find that the book sufficiently explored the \"Rise of the Leisure Class.\" There was little/no discussion about the political and social unrests of the time or the technological advances (save the information about plumbing as it pertained to private bathrooms in the hotels) that made it possible for the bourgeoisie to take advantage of Ritz and Escoffier's offerings. I think that bringing more of this into the story, rather than simply referring to Ritz's rise in status from Swiss farmer to esteemed hotelier, would have been appropriate. Overall, this was a thoroughly enjoyable, well-written (and documented) book. Note: I received a Galley Proof from the publisher as a Goodreads Giveaway winner, but my review was critical and unbiased."}, {"userName": "Brian ", "userReviewDate": "Jan 25, 2018", "userURL": "http://www.goodreads.com/user/show/6841457-brian", "userReview": "Ritz and Escoffier is the story of the founder of the Rtiz Carlton empire and the chef that made the whole thing possible. Cesar Ritz figured out the rising luxury class of new money and the old monied classes of Europe were ready for a new form of travel with modern amenities and the finest dinging to be had. His chef Auguste Escoffier would provide those original dishes as the two managed a series of hotels until landing at the Savoy started by Richard D’Oyly Carte and his wife. They would take this fledgling hotel to new heights before being forced out in disgrace and scandal. It is from there that two engaged in the hotel Ritz which would coin a new verb of putting on the Ritz as they launched a hotel chain that would define luxury even to the present day. This book is fast paced, full of great anecdotes and a look into the gilded age greats on the European Continent. Well written and a page turner this is a great addition for those interested in the Gilded Age, hospitality history, cooking and leisure history or those who just want to read an interesting story."}, {"userName": "Richard", "userReviewDate": "May 22, 2018", "userURL": "http://www.goodreads.com/user/show/11646197-richard", "userReview": "Very nice read about Cesar Ritz (Swiss) et and Auguste Escoffier (French) and how their partnership changed the hospitality world w/ their hotels and restaurants. Initially at first, both of them were employed at the Savoy (London) conceived by a englishman and his investors. Their talents both drew aristocrats, the wealthy and upper-crusts to the Savoy. It was a place to see and be seen in. It was ahead of it's time. It was the first hotel to offer a bathroom in ALL rooms instead of a bathroom down the hall shared by others. As well, the first electric elevators ! The rooms were exquisite, the staff were professional and the hotel was grand in all other aspects i.e. - furniture, decorations, etc. The food was exquisite and so very french. Both of these men ( Ritz and Escoffier ) are well known in the 21st century, at least I know about them and are highly distinguished in their own professions ( hotelier / restaurant )."}, {"userName": "Marilyn", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/9775779-marilyn", "userReview": "A delightful read. The author says that at the Savoy Hotel, Cesar Ritz and Antoine Escoffier introduced fine dining and entertainment to the nouveau riche of England. Before Ritz, men of the upper classes dined in their clubs, men of the lower classes ate in pubs (if they could afford to eat out) and all women dined in their homes. But the industrialists, businessmen and bankers (most of them Jews) - the rich but not titled - were not allowed inside \"gentlemen's clubs\". There were also the wealthy Americans of the Gilded Age. And there was the Prince of Wales. He liked industrialists, businessmen, bankers and Americans financiers, and he like French food. He empowered his new friends by his cachet to ask for a \"home\" of their own - none but the best. And so they put up the money for the Savoy Hotel, and to hire the best hotelier and chef in Europe. Ritz and Escoffier."}, {"userName": "Kristine", "userReviewDate": "Apr 13, 2018", "userURL": "http://www.goodreads.com/user/show/4900654-kristine", "userReview": "Ritz and Escoffier by Luke Barr is a free NetGalley ebook that I read in early April.Hotelier Cesar Ritz and chef Auguste Escoffier debut in London at the Savoy Hotel during 1889 to draw in continental European clientele.  Both are motivated, inspired, full of ideas, focus on opulence and quality, and work hard to cater to their guests' extravagant whims. The arc of this book takes place over approximately 15 years while Ritz opens the Rome Grand Hotel in 1894, the Paris Ritz hotel in 1898, the Carlton in London in Carlton, the Italian spa hotel of Salsomaggiore while Escoffier writes a cookbook specifically for professional chefs (finished in 1902), before a quick tie-up ending to an overall speedy read with the progress of pop culture, technology, monarchy, and travel after their 19th-early 20th century success."}, {"userName": "Margaret", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/9321469-margaret", "userReview": "Lots of fascinating details here. Charmed by the cameo appearance of Rosa Lewis, whom I met collaterally via “The Duchess of Duke Street; much struck by Escoffier’s insistence on quit and civility in the kitchen — so different from the atmosphere demonstrated by some of today’s celebrity chefs; interested to learn more about D’Oyly Carte whom I knew only through Gilbert and Sullivan; much amused to find a Henry Higgins among the investors.I knew about the postponement of Edward VII’s coronation, but had not considered the impact on London’s premier hotels.But my goodness, this book needed some illustrations! I wanted to see the hotels, the restaurants, the rooms, not to mention the people."}, {"userName": "Theresafic", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/1758995-theresafic", "userReview": "Interesting;one of my favorite kind of book- history and the story of people who shaped it. I felt as though the book emphasized Escoffier more than Ritz. Although Ritz was a visionary when it came to hotels the book mostly described the restaurant, who ate there and what Escoffier made. The book discussed some how Ritz got a hotel up and running but little about what it is like to run a hotel except to anticipate the guests needs. I wonder how much of the profit is from the restaurant, how much the hotel. The book did not discuss I think it would have been interesting to delve into what it takes to run a hotel, what changes he made in the hotel business, besides the physical changes of lighting, bathroom. Telephones and plants everywhere."}, {"userName": "Sarah", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/7762510-sarah", "userReview": "I received this copy for free from Goodreads. Nonfiction is not a category i typically read, especially not about historical figures I’m not already familiar with, but I found the history and human aspects fascinating. It follows the rise of famous hotelier Ritz, and his counterpart restauranteur Escoffier. While I knew of Ritz hotels before reading this book I had no clue about the history, and this book definitely filled in any blanks on the details of this collaboration.In general, the book was very slow and dry. I found some of the endless lists of names about who attended what party a waste of time. Basically, it just wasn’t my cup of tea, but it was clearly well researched, and might be just the thing for anyone interested in opening a chain of hotels."}, {"userName": "N.R. Tomasheski", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/4160784-n-r-tomasheski", "userReview": "I received this ARC in a Goodreads giveaway. (And was quite pleased: I entered about 50 giveaways that day, but this was the book I was most interested to read.)It's an enjoyable volume; an easy read, full of charming detail about the period (1889 to 1901). It is well-researched, but never stuffy: the tone is conversational and upbeat. Ritz and Escoffier were indeed the primary innovators of what we know today as the luxury hotel experience, with pampered comfort and exceptional dining. In this book you will learn how and why they did it.Highly recommended for fans of the Victorian era, fine travel, and cultural history."}, {"userName": "Kelly Heyesey", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/67135903-kelly-heyesey", "userReview": "I won this book through a Goodreads sweepstakes. I was of course familiar with the name Ritz, but was not familiar with his background and how he revolutionized the customer service experience for the hotel industry. It was interesting to learn about his almost obsessive attention to detail. It was also equally enlightening to learn about Auguste Escoffier who I was unfamiliar with. The lists of the decadent menus he created left me wishing I could take a visit to Europe in the late nineteenth century. It may have been beneficial for more detail about the people that worked under both Ritz & Escoffier and how their lives compared to the denizens of the upper class they served."}, {"userName": "Linda Smatzny", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/14671807-linda-smatzny", "userReview": "Loved loved this book. It tells the story of Cesar Ritz and Auguste Escoffier and how they catered to the rich people of Europe and America. The book begins in 1889 thru 1902 when money was so important. It talks about how Ritz changed hotels by introducing modern conveniences like bathrooms in each room, elevators and other items. Escoffier rearranged a kitchen so that service flowed and meals arrived hot to the table. He also made menus just for special people and parties. The book was a quick easy read."}, {"userName": "Sherrie Pilkington", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/13652832-sherrie-pilkington", "userReview": "***I won this book in a Goodreads Giveaway***I don't know y'all...I just couldn't get into this book. It was fine, I guess, but not more than that. I did learn things that were fascinating, but I wish there had been more. I feel like the author started in the middle of the story and glossed over large swathes of Ritz and Escoffier's lives. It felt rushed. All in all, it's a great topic but a mediocre book."}, {"userName": "Zack", "userReviewDate": "Dec 21, 2017", "userURL": "http://www.goodreads.com/user/show/51722883-zack", "userReview": "Goodreads Giveaway - This was a very fun book to read. It’s a narrative history of the rise and success of the Hotelier and the Chef of the title. It goes over how their partnership at the Savoy hotel generated a new class of hotels and changed the expectations of dining out. If cultural history is of interest, this book is well worth time. Additionally, it is worth tracking down Escoffier’s cookbook, which is the definitive French cookbook."}, {"userName": "LillyBooks", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/21548113-lillybooks", "userReview": "This was such a fascinating book, and I enjoyed all the behind-the-scenes drama of the story of Cesear Ritz and Auguste Escoffier. The author kept it moving at a brisk pace, and I felt like we really got to know the personalities of these men although it's more weighted on Ritz than Escoffier. It's frothy and diverting but not just empty calories; it manages to give you enough historical research and detail in which to really sink your teeth."}, {"userName": "Shalaka G", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/76309554-shalaka-g", "userReview": "I will go with 3.5I am not a fan of non fiction but this book kept me hooked. I have always been curious, whenever I am came across the words Savoy and Ritz; they frequently appeared in old books. But this might not be for everyone. Read this only if you are interested in history and particularly hotel industry or social life in the late 1800s."}, {"userName": "Amber", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/8664505-amber", "userReview": "3.5 stars. I received a free copy of this book through Goodreads First Reads program. It made for an interesting peek behind the scenes of the luxury hotel industry, and the hotelier and chef whose names became synonymous with luxury. One caveat: probably not a good idea to read on an empty stomach, as some of the menu descriptions are mouthwatering."}, {"userName": "Kathy Cooley", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/11972592-kathy-cooley", "userReview": "Very good! If you have any interest in the time period or the aristocracy at that time, you will enjoy this. I'm not one to read nonfiction as a rule, but this is very well-written and avoids the pedantic slant of many nonfiction books."}], "description": "In a tale replete with scandal and opulence, Luke Barr, author of the New York Times bestselling Provence, 1970,  transports readers to turn-of-the-century London and Paris to discover how celebrated hotelier Cesar Ritz and famed chef Auguste Escoffier joined forces at the Savoy Hotel to spawn the modern luxury hotel and restaurant, where women and American Jews mingled with British high society, signaling a new social order and the rise of the middle class.In early August 1889, Cesar Ritz, a Swiss hotelier highly regarded for his exquisite taste, found himself at the Savoy Hotel in London. He had come at the request of Richard D'Oyly Carte, the financier of Gilbert & Sullivan's comic operas, who had modernized theater and was now looking to create the world's best hotel. D'Oyly Carte soon seduced Ritz to move to London with his team, which included Auguste Escoffier, the chef de cuisine known for his elevated, original dishes. The result was a hotel and restaurant like no one had ever experienced, run in often mysterious and always extravagant ways -- which created quite a scandal once exposed. Barr deftly re-creates the thrilling Belle Epoque era just before World War I, when British aristocracy was at its peak, women began dining out unaccompanied by men, and American nouveaux riches and gauche industrialists convened in London to show off their wealth. In their collaboration at the still celebrated Savoy Hotel, where they welcomed loyal and sometimes salacious clients, such as Oscar Wilde and Sarah Bernhardt, Escoffier created the modern kitchen brigade and codified French cuisine for the ages in his seminal Le Guide culinaire,  which remains in print today, and Ritz, whose name continues to grace the finest hotels across the world, created the world's first luxury hotel. The pair also ruffled more than a few feathers in the process. Fine dining would never be the same -- or more intriguing.", "title": "Ritz and Escoffier: The Hotelier, the Chef, and the Rise of the Leisure Class", "url": "http://www.goodreads.com/book/show/35747538-ritz-and-escoffier", "average": 3.94, "cover": "https://images.gr-assets.com/books/1507747921l/35747538.jpg", "reviews": 47, "authors": [{"url": "https://www.goodreads.com/author/show/7036083.Luke_Barr", "name": "Luke Barr"}], "type": ["History", "Nonfiction", "Biography", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/35747538-ritz-and-escoffier", "http://www.goodreads.com/book/show/17737022-provence-1970"]}