{"ratings": 8947, "userreviews": [{"userName": "Emily (Books with Emily Fox)", "userReviewDate": "May 13, 2018", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "Well that was painful…I loved Dark Matter and the Wayward Pines series so I might be extra salty here but, if I hadn’t read these books before this one, I would have DNFed it after a few pages.The premise was intriguing. People that saw an aurora borealis go crazy and kill people. Okay. I like post-apocalyptic books… But the premise was the only good thing here. That and the fact that the author is good keeping you at the edge of your seat but… The writing, the characters, the dialogues… were just straight up bad.I'm not a violent person and I would never wish harm to anyone... but I was hoping the children here would die. There were insufferable.The ending was not satisfying at all. I wouldn’t recommend this to my worst enemy. I think I’ll stick to reading his newer books from now on because they were much better."}, {"userName": "Zoeytron", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "Too dark. Too quiet. Everything wrong.This one grabbed me right by the nose hairs and would not let go. What you have here is a helluva of a thriller. Is it particularly believable? Maybe not. Did I care? Nope. The world has gone completely crazy. Cities are burning, people are being shot en masse. There's nowhere to go, but you can't stay where you are. Get food, water, gas . . . and RUN!Not sold on the ending, but the ride getting there was a real trip."}, {"userName": "Kelly (and the Book Boar)", "userReviewDate": "Aug 30, 2016", "userURL": "http://www.goodreads.com/user/show/11183856-kelly-and-the-book-boar", "userReview": "Find all of my reviews at: http://52bookminimum.blogspot.com/3.5 StarsOn page six of Run you learn that . . . . \n“There’s no decent place to stand in a massacre.”\nIt was about that point I remembered I was reading a Blake Crouch story and that . . . . \nBecause I am a baby.If you’re an avid Goodreader there’s little chance you have been able to avoid this summer’s barrage of reviews for Dark Matter or last year’s flood regarding Wayward Pines. At this point I think it’s safe to say that I’m a Crouch fangirl and if he’s writing it, I’m snorting reading it. Like his other works, this one starts off at 99 miles per hour and never slows down. (Oh and sidenote: I’m going against my usual advice and saying you should read the synopsis for this one. It explains very briefly the buildup to where the story starts off and things make more sense when you realize the beginning is actually the beginning and that the first chapter wasn’t accidentally torn out of your copy.) So as the blurb says, 5 days ago the poop really hit the fan. Fastforward to the present and the Colclough family seriously needing to get the eff outta Dodge. Note to my husband: If our name ever gets put across the radio dial as part of a kill list and not only am I moving at a sloth’s pace, but then my friggin’ LOVER is the person who shows up to kill us and our children, you have my complete and total permission to pull an Ice Cube and just say . . . . \nTo my fat ass.Now where was I? Oh yeah, Jack, his wife Dee, his way-too-realistic jerkoff pubescent daughter and young son need to skedaddle before they get offed. Their only option? Load up the ol’ Range Rover, put the pedal to the medal and hope to hell they can outrun the bad guys and find somewhere safe . . . \n“It’s bad, huh?”“Biblical.”\nIt didn’t take long before . . . . \nPer usual with a Crouch story, that’s about all that is safe to tell. I will provide a bit of a spoiler and channel my inner Ron 2.0 in order to tell you that parts of this tale were seriously farfetched. I mean, we’re talking . . . . \nThere’s zero chance these yay-hoos could’ve survived more than a minute and then when the stuff and things happened??????\nBut I was too busy calculating how many calories I had burned by bouncing my knee up and down like a lunatic for the last several hours to even give a shit."}, {"userName": "Sh3lly ⚔ tired of damaged heroines ⚔", "userReviewDate": "Jul 17, 2016", "userURL": "http://www.goodreads.com/user/show/25393430-sh3lly-tired-of-damaged-heroines", "userReview": "Survival. It's basically what this book is about. Running, trying to find food and shelter. It starts strong. A man and his family discover that because of some crazy aurora borealis lights in the sky, people are going psycho. So, man and family have to run away from the crazy psycho people.I listened to the audio version of this book and I was quite interested for about the first half. There are some fantastic, edge of your seat scenes where some crazy shizz goes down. Brutal, graphic. But then we got to the middle and for almost the rest of the book except for a couple decent \"thriller-ish\" scenes, it just never fully picked back up for me.It was basically just the family trying not to:And being all:I love Blake Crouch, but this was not my favorite. It's fine as far as your basic thriller goes. It definitely isn't bad. The narrator was Phil Gigante, who did a great job. At first, it took some time to adjust because he does distinct voices for every character, including females. But he has a very nice speaking voice, and I enjoyed it. Although the two main females (mother and daughter) came off a bit shrill, but that is probably due to the writing partly as well. I don't know if it's because I listened to it, but there are a boatload of f-bombs in this. I mean, don't get me wrong, if I was going through what they did, I'd be dropping them like crazy too. I just don't recall any of his other books having so many. I never really got into any of the characters themselves either, writing-wise. They were sort of generic. But it was free with Kindle Unlimited and definitely worth free!"}, {"userName": "Jennifer", "userReviewDate": "Feb 04, 2017", "userURL": "http://www.goodreads.com/user/show/2473504-jennifer", "userReview": "Here's a tidbit about me: I love AMC's The Walking Dead. I have followed every season through all the horror, group dynamics, and even the boring episodes. I can watch zombies kill and be killed all day long...but when it comes to people violently killing people on the show? OMG my stomach turns. Ahem Negan. Blake Crouch's Run has that same quality about it. People have been \"affected\" by something that causes them to target the \"unaffected\". Target meaning kill...brutally. It's not zombie-related or a viral illness, but it's definitely of pandemic, apocalyptic proportions all the same. It's insanity that makes perfect sense to the ones branding the weapons and that psychotic element made this book fit the horror genre to a T.Run is the absolute perfect title for this book. It's fast paced (like can't-catch-your-breath fast) and the suspense is intense. The horror consists of the overall situation obviously but also very graphic and violent scenes of people killing people in a variety of ways. No remorse, no hesitation. Just killing. And one family is on the run, trying their hardest to all stay alive.I ended this book with a few unanswered questions, but they were questions that the main characters never got answers to either so I could accept that. I have to admit that the wife/mother in this family got on my last nerve with her helplessness and putting constant pressure on her husband for everything. Seriously! Get your @ss up, work your brain, and at least help out with some problem solving solutions, but no. However, without spoiling the ending, she did redeem herself in a big way and I was not conflicted at all by her decision. I was standing there, eyebrow cocked, hands on hips, tapping my foot, thinking it's about d@mn time! Blake Crouch told this story through the 3rd-person POV of the male lead character (the father/husband) who was provided a stereotypical, although fairly dated, gender role with the need to protect/provide in order to feel validated and strong. This character element created that much more suspense as you feel the internal pressure he places on himself (not counting the pressure his wife is bombarding him with) as well as everything that is at stake for his family. \n\n“There was simply nothing in his experience that even compared with the thrill of killing to protect his family. In this moment, it was the purpose of his existence. He felt, possibly for the first time in his life, like a f@cking man.”\n\n I was glued to this book. Blake Crouch has his own goodreads shelf on my profile and he has not disappointed me yet. Whether it's Run or one of his others, seriously check him out!!My favorite quote:It’s cake from here on out.” “Honestly?” “Maybe cake is too strong a word. It’s shortbread. How’s that?” “I hate you so much.”2/20/2017:Omg this book is a high-adrenaline thrill ride of humanistic horror!I'll explain soon.RTC"}, {"userName": "Matthew", "userReviewDate": "Jun 23, 2012", "userURL": "http://www.goodreads.com/user/show/1355079-matthew", "userReview": "Positively putrid. I have no idea how this book is garnering so many 5-star reviews. It was tedious and boring and poorly written and had cardboard characters, but the premise was intriguing, so I kept reading. I kept waiting for it to get better, to change, to become something different, something other than simply getting in the car and running from one hiding place to the next, but it didn't. It just kept on going that way, and then -- suddenly -- it ended. The problem sorted itself out. No explanation was given. It was possibly the most unsatisfying ending that I have ever read. A tacked on epilogue showing the characters 20 years in the future just felt trite and out of place.I think a big problem with the book was the close point of view. We never left the family's side, but they didn't know what was going on, and so neither did we. OK, so a bunch of people saw lights in the sky and turned into crazy killers, but -- that's it? There's nothing deeper? No fulfilling explanation? No attempt to tie everything together? If you want to use the lights as an exploration of Why Evil Exists, that is one thing, but this seemed to be totally random. There was no moral, no lesson. Evil exists. Run. That seems to be the whole point of the book. And then (SPOILER) at the end, it just..... stops. People aren't evil anymore. ARE YOU KIDDING ME? I wasted several hours of my life for THIS?I wanted to put the book down several times. It was just so tedious and poorly written, strewn with bad dialogue and awkward sentence fragments. But much like the characters in the book, I soldiered on, because I thought things would get better. Guess what. THEY DIDN'T. Like the characters in the book, I went through hell and back and didn't really have anything to show for it other than some psychological trauma. Stay far away from this book. I will not be reading a Blake Crouch book again."}, {"userName": "Lisa", "userReviewDate": "Aug 08, 2017", "userURL": "http://www.goodreads.com/user/show/32081931-lisa", "userReview": "Really enjoyed Run by Blake Crouch a solid 4* read was compelling non stop action from start to finish this had it all great characters thought Dee was the real heroine kept the family together through a nightmare no family should be put through.a top notch thrillerRUN,RUN, RUN for your lives there is no turning back mass shootings city on fire where would you go & all you could do is RUN!!All I can say is that Blake crouch really knows how to keep the reader engaged his description of the scene was enhanced & you felt like you were right there with the family a top notch thriller that will keep you wanting more right to the very end.The only criticism I have is the ending was a little abrupt but that is just a minor glitch on my part just thought it lacked a bit of gusto to the normal Crouch endings."}, {"userName": "Nikki Wilde", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/3674844-nikki-wilde", "userReview": "Well damn. I don't think I can even put into words how much I enjoyed this book. I'm still reeling from it. All I have to say is that I'm so glad I started this on Saturday because had it been during the week I probably would not have made it into work.This book has definitely usurped Intensity for the most intense book I've read. I swear my stomach was in knots from beginning until end. Even now after having finished it I'm still trying to settle. I think you can tell a good book from just an alright one when you're finished and you can't stop thinking about it.Jack is packing up his families belongings and food when he hears his colleagues name and address being called out with direction to kill him. Hurrying as fast as they can to pack their Discovery they hear Jack's name next. Now him and his family are on the run.Wow. What a journey. This was such an exciting book from beginning to end. The nail biting intensity from this book was almost more than I could take. It was exceptional and thought provoking and is definitely now my number one favorite book. Goodbye Koontz, hello Crouch."}, {"userName": "Edward Lorn", "userReviewDate": "Apr 17, 2012", "userURL": "http://www.goodreads.com/user/show/8850418-edward-lorn", "userReview": "Many people have a problem with Crouch's stilted half sentences. I take it for what it is, just the author's style. With that being said, this was one of my favorite books of the past five years. The plot is unlike anything else I've ever read. Crouch is brutal and unapologetic in this book. The scenery is always changing and you never know where you'll end up next.I've heard complaints from people that some of the last minute rescues in the story got on their nerves. I didn't mind so much. Crouch had my disbelief suspended enough to where I didn't mind. This is one of those stories where anything goes. My favorite kind. Violent, thrilling, a nonstop thrill ride. I will definitely read \"Run\" again when I need a kick in the pants.***** 5 StarsE."}, {"userName": "Matthew", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "I have seen lots of good reviews and lots of bad reviews for this one.I thought it was excellent, exciting, interesting, suspenseful, mysterious, etc., etc., etc.!I think what hit home with me is that a lot of it took place in places in Wyoming and Montana where I used to live, work, and travel. Because of this I could see what the characters were seeing very well.One thing that I thought was weird, though, was that even though he referred to many cities, roads, and national parks by their name or designation, they obviously went to Yellowstone, stayed at the Old Faithful Inn, and watched Old Faithful, but that was one place where he did not refer to anything by name. It stuck out to me as very odd.But, that was just a small oddity in and otherwise great book. I can definitely say I will be checking out more Blake Crouch in the future."}, {"userName": "Eric", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/11828590-eric", "userReview": "What would you do if all a sudden the world as you know it went beserk and wanted to kill you? I listened to the audio book and it was a rollercoaster ride of white knuckled suspense. The narrator does a great job with the story.One evening a natural phenomenon displays in the sky and those who witness this event inexplicably become psychopathic killers. Jack, his wife, Dee and children flee their home in Albuquerque, New Mexico trying to escape the anarchy the place has become. From there, it is nonstop suspense to the end of the book. A subtext to the story is Jack is estranged from his wife and family. Dee is currently in an affair that she has told Jack about. Before the world went crazy, they were talking about getting a divorce. That was before the world went crazy. Now survival is the priority so Jack and Dee need to put all that aside to save their kids and themselves. The story is about a family facing adversity and situations that are alien to common sense. The little creature comforts that they expected in everyday life, like morning coffee and food to eat and water to drink, become extravagances they dearly miss. Where safety, when found, is a only a temporary condition of the moment. About enormous uncertainty that is contrasted by only a tiny thin thread of hope. Never giving up is the only option that they have. In spite of being dumped into this chaotic world they now struggle to survive, they find something that had been missing from before: each other.The suspenseful survival theme is certainly not something that is unique. Instead of flesh-eating zombies or velociraptors being mortal threats, here we have people gone nutters. The threat is only part of the suspense. The characters and the journey they take both geographical and emotional is the rest. There is a bit of sloppiness in the writing in places, but on the whole, Run worked for me and had me hooked from beginning to end."}, {"userName": "Marvin", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/2160536-marvin", "userReview": "This is the first solo work and first novel I've read by Blake Crouch. He is a no-frills but effective action writer and he kept me interested in his novel about a family running from a apocalyptic-styled event and from the people affected by it. It is imaginative and fast-paced. I liked it mainly for the interaction between the family especially in the sense of how a disaster brings them together. I kept having flashbacks to the great Corman B-movie, Panic in the Year Zero with Ray Milland. Take that film and wed it with Cormac's McCarthy's The Road, and you might get the idea of this bonk.Yet I wasn't convinced with the event that was the catalyst to the rest of the novel. I wanted more explanation. I wanted more of a apocalyptic tale than a fugitive escape story. Over-all I found it a very good read yet there wasn't enough to raise it from the dime-a-dozen other novel covering this territory. I do give it credit for not dredging up the same old zombie holocaust idea that is being done to death...but I wanted more. Three and a half stars"}, {"userName": "Bandit", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "I'm becoming such a fan, Crouch just continues to impress with his consistently and genuinely thrilling thrillers. This time it's the Walking Dead sort of apocalypse minus zombies and with a considerably smaller cast of characters. So basically one family surviving the insurmountable odds in the face of a peculiar apocalypse of sorts caused by an aurora, localized and only affecting those who saw it. And not right away, but eventually Crouch makes you really care about his survivors that he proceeds to put through various vicious wringers, so that you can't put the book down for wanting/needing to see what happens next. The fact that the pacing is bullet speed also helps, but this really is a character driven story and that's why it works so well. Plus Crouch can really write, it's action, action, action and then out of the blue this really moving scene that's just pure beauty...and then, of course, back to action, which is as vivid as visceral as some of the superlative aforementioned apocalypse awesomeness that is Walking Dead. Great read, very engaging, very entertaining, tons of fun. Recommended."}, {"userName": "Mizuki", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/16842102-mizuki", "userReview": "Blake Crouch's stand alone novel Run, is quite similar with his previous Wayward Pine trilogy. The story focuses on a married couple who are having relationship issues and how this couple reacts to a society-breakdown emergency, and how they struggle to get themselves and their children to safety.The story is action paced and thrilling, it is also an effective page-turner. You can easily fit yourself into the main characters' shoes and share their panic and suffering when they are enduring a crisis of society falling apart, people going nut all of the sudden and start actively killing other people for no reason (sounds a bit like The 5th Wave, I guess?) The details of their survival story are finely and realistically written enough.However, I have problem with how there is no moral lesson beyond the story and its characters. At least with the Wayward Pine trilogy, we have a moral lesson about 'humanity is fucked in a long run', but what is the moral lesson with Run? \n'Don't stare up at the Northern Lights because it will turn you into a mother fucking killer?'\n Are you kidding me?"}, {"userName": "Bill", "userReviewDate": "Jun 04, 2012", "userURL": "http://www.goodreads.com/user/show/5846407-bill", "userReview": "A pretty good and thriller from Blake Crouch. I have read a few of his works and have for the most part, enjoyed them all. He can definitely tell a heck of a story. This one was no different, but was missing something for me and I can’t exactly put my finger on it. The characterizations were good and the pacing was solid, however, it felt a little repetitive in content around the middle to ¾ mark. Not a bad story by any means, but ultimately just better than good for me."}, {"userName": "Megan", "userReviewDate": "May 14, 2011", "userURL": "http://www.goodreads.com/user/show/3783604-megan", "userReview": "Blake Crouch writes really good scenery. Usually, descriptions of places just bore me, but he has some real talented at bringing landscapes to life, making them engaging and unique. I don't see that in many novels, and I quite enjoyed the passages about the various settings employed by this book.That's the bulk of my praise. Otherwise, this book wasn't for me, and I found it unconvincing and unsophisticated. I'm trying to read more digitally self-published novels, and I chose this due to its popularity and good reviews, despite the book's main genre (horror) typically being an unappealing genre for me. So I was never the ideal reader for this book anyway, but I was hoping to find, in this and other digital self-publishing offers I try, some creativity and out-of-the-box writing that I could appreciate. A lot of the suspense was hook-y and meant to grab the reader, but lacking in rhyme, reason, and substance behind it. For example, lists of names of people to be killed, being read off on the radio. Why? Why did the murderous maniacs use these lists (given that the one we hear is a list of university faculty members, I assume these are employment records) to inform and instruct others infected people to kill the intended victims, when they were obviously sparing fellow infected people but had no way of knowing if any of these people were infected or not? To me, this seemed like a hollow hook, a way to get readers to go, \"Oh, that's scary\" but that didn't really make sense and didn't even matter in the long run, since it seems like murderers were just going all over the place to burn down all the houses anyway. IDGI.The characters were thread-thin, and the plot was banal and not at all character-driven. The personality (mostly non-existent) of the characters didn't really influence the mechanics of the plot for the worse; they were always just victims of circumstances, in one similar scrape after another. I'd have felt like this was more real and that who the characters were actually mattered, if, for example, the kids had actually caused trouble, or done something realistically human and selfish, instead of being dutiful and responsible and, at most, complaining a little and then moving on and behaving once the parents told them to stuff it. Or that the \"marriage in jeopardy\" emotional hook (which was, in the first place, one-dimensionally developed, and resolved basically through, \"Of of course, survival would make them come together and love each other again!\"-esque-ness) actually affected the wife and husband in interesting ways, instead of predictable ways.The supernatural force of evil that caused people to turn into murderous maniacs...meh. I don't read horror because I find flimsy supernatural explanations for evil really uninteresting, and this was no exception. Basically, the book seemed like an excuse for setting a genocide in middle-class America (the book's original title: American Genocide) without having to deal with an actual, believable explanation for said genocide. Having read enough nonfiction accounts of actual and recent genocides that occurred for reasons of power and prejudice and hate and oppression, I was left unimpressed and cold by this book's explanation. Blaming an astronomical phenomena for turning Americans into gruesomely violent murderers, it's so hard to even care about that, you know? It just feels so manipulative and unimaginative. I prefer thrillers where human psychology matters in the evil, and this book didn't have that. The \"Well, some of the infected people were able to resist turning into murderers but we don't know why, oh well!\" writeoff in the end was simplistic and unengaging as well.But I went into this book knowing I'd be a hard-sell and not an ideal reader. I was left pleasantly surprised by Crouch's talent with describing setting, but unimpressed and unengaged by the rest of this offering."}, {"userName": "Rose", "userReviewDate": "May 18, 2013", "userURL": "http://www.goodreads.com/user/show/7891507-rose", "userReview": "Try to imagine you and your family in your car. You're driving as fast as you can because people are trying to hunt you down to kill you. Not just some specific people but everyone. They are everywhere and they want you dead. You hear that there could be safety up north in Canada, but you're in Albuquerque, New Mexico. What choice do you have...the world as you know it has gone mad. You head north but no matter where you go, be it a mountain, the middle of a wilderness, an abandoned building, they end up finding you. All you can do is keep running despite the hunger, thirst and constant fear but with an overwhelming need to get your family to safety, if such a thing still exists.Blake Crouch had me totally wrapped up in this story after about the first chapter. I couldn't put it down. It was the first book of his that I had ever read and I can assure you it won't be the last."}, {"userName": "Bill", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/810550-bill", "userReview": "DNF'd at 14%. I can not get into this. I am in such a reading slump."}, {"userName": "Mihir", "userReviewDate": "Mar 16, 2011", "userURL": "http://www.goodreads.com/user/show/1229652-mihir", "userReview": "Full Review over at Fantasy Book Critic ANALYSIS: Not only was I fascinated by RUN’s blurb, but previously I had read Serial Uncut which was a collaborative effort between Blake Crouch and Joe Konrath. I very much liked the book’s mix of horror and thriller genres and therefore contacted the author for a review copy. Mr. Crouch gladly obliged and I immediately dove in wondering how the book would measure up against such a tantalizing blurb.RUN begins with an unnamed female arriving at an unknown site and we are left wondering what is going on? The book then shifts to Deanna “Dee” Colclough who has a scary encounter with her paramour Kiernan as he asks her to get away from him before anything happens to her. We are then introduced to Jack Colclough and his family which consists of his wife Dee, his teenaged daughter Naomi and his son Cole. Jack is a professor at the University of New Mexico, Albuquerque and Dee is a physician. They are packing their things and trying to get their bearings as they plan to flee the city when Jack’s name gets called out on the radio. Jack and his family then rush out of their house and are attacked rather brutally by people who are tracking the folks whose names have been announced.Thus begins their odyssey as they seek travel to the North not knowing who or what awaits them. The events which have caused this meltdown are alluded to and are a bit explained, but ultimately it’s up to the reader to decide what triggered this situation. There is much more happening, but to describe them would ruin the surprise. The action is shown throughout the lower continental US, Northern Mexico and southern parts of Canada with Jack and Dee’s journey taking them through the western half of the US as they try to avoid the ‘crazies’ and survive along with their children.Because the book focuses deeply on the Colclough family, specifically the story of a father striving to do right by his progeny, RUN is immediately comparable to The Road by Cormac McCarthy. However, there’s a crucial difference: the world featured in The Road is a post-apocalyptic one, whereas in RUN, the world teeters on the verge of collapse. RUN is also less dark than the Pulitzer Prize winner, although it has its moments of horror.Blake Crouch’s prose admirably fuels this high-strung tale as he showcases a slightly dysfunctional family: Jack, the father struggling to save his family; Dee, the estranged wife who has to choose between her feelings for her paramour and her family; and Naomi and Cole, the children who are shockingly thrust into a world where they have no control and no way to adapt... Mr. Crouch efficiently showcases the struggle faced by both parents as they try to explain the situation to themselves and their kids, with emotional family moments brilliantly juxtaposed by harrowing action scenes that will have readers turning the pages to see what happens next.Besides the Colclough family, we also get bits and pieces of information about the environment from other characters we meet during the course of the story, although they are fleeting. The affected people meanwhile, seem sane enough in understanding what they are doing and the author provides clues about their motivations, but nothing is clearly spelt out.There are very few drawbacks with the book. A few readers might get frustrated at the absence of a concrete explanation for what is happening, but like in real life, many things occur which have only theories instead of rational explanations. Lastly, the climax is a bit fantastical and detaches a tiny bit of credibility from the tale. Fortunately, the ending is not too over-the-top to ruin the overall effect.CONCLUSION: Blake Crouch’s RUN is a simple, but magical tale about survival, the bonds of family, and the endurance of the human spirit. RUN exceeded my expectations and is a book I will enjoy re-reading in the future. In short, the author is rapidly moving up my reading list and seems hell-bent on proving David Morrell’s words true: “Blake Crouch is the most exciting new thriller writer I've read in years.”"}, {"userName": "Lori", "userReviewDate": "Sep 03, 2011", "userURL": "http://www.goodreads.com/user/show/5255355-lori", "userReview": "**Takes a HUGE drink of water; wipes sweat from brow**Whew! THAT was an adventure! Those match my feelings exactly after blowing through the swift read, Run by Blake Crouch. As noted in my last book review on The Land of Painted Caves by Jean Auel, I spent much of the summer slogging through the entire Earth’s Children’s series. Run, was the PERFECT antidote to that exercise in perseverance. The premise is simple, what would happen if for some inexplicable reason a large segment of the US population went completely bonkers and tried to kill everyone else. What would you and your family do? RUN of course! If this book were made into a movie, it would be a Bruckheimer summer blockbuster resplendent with killer (literally) chase scenes heavy on CGI, a fair smattering (pun intended) of gore, likeable and slightly too competent heroes, and dotted with plot points just a little too convenient. Did I like it? Absolutely! I liked it for what it was. Keep in mind we didn’t walk into any installment of the Transformers movies expecting the type of storytelling and character depth found in movies like The Kings Speech or The Black Swan. No, we came to be entertained by a wild ride allowing quickly allowing ourselves suspension a period of belief suspension just so we could have a little fun. Open Run with that mindset and you’ll be just fine."}, {"userName": "Lisa Eirene", "userReviewDate": "Jul 23, 2014", "userURL": "http://www.goodreads.com/user/show/821464-lisa-eirene", "userReview": "Where do I start? This book was a wild ride from beginning to end. Heart pumping action. I would describe this book as a combination of The Road and how I imagine The Walking Dead to start--the downfall, essential. No, this isn't a zombie book, but it's a book about society completely breaking down and what one family does to survive. I love survival type stories like this. I constantly think, what would I do in this situation? And I also constantly remind myself that I need to take some basic survival classes! lol The \"cause\" of this downfall was unique and fascinating and I bought it. The character's fear felt real. The panic and desperation jumped off the pages. It was a great book. My one complaint is that the book starts in the \"future\" (or present day) with an unknown character and then the end of the book goes back to that time period and character (revealing who it really is) but by the end of the book I had completely forgotten that first chapter and how the book started and was so wrapped up in the survival story I was confused. Then I remembered. The ending fits but it was abrupt."}, {"userName": "Edward", "userReviewDate": "Feb 27, 2011", "userURL": "http://www.goodreads.com/user/show/1523496-edward", "userReview": "Wow. Been 2 or 3 months since my last five star read (a lot of solid 4 star ones though), but this one qualifies. started it last night, stayed up way too late, then finished it today when I should have been spending time with my family. I expected the book to be good - I didn't necessarily expect it to be great.It's fast-paced, relentless, just the right balance of simple and rich writing. A compelling conflict, compelling characters, and numerous twists. Basically, a large portion of Americans have gone crazy and want to kill (literally and ASAP) all the others. Yes, I know one could joke that we're already there, but read this and you won't be making those jokes any more.The book is from the point-of-view of a husband and wife and two kids who are trying to escape the people who want to kill them, which is just about everyone. And we feel their pain and their doubts, along with their bravery and persistence. The situation doesn't feel real of course, but the internal turmoil of the characters - that's as real as it gets. And that's the focal point of the book.There's plenty of action as well, but it doesn't dominate, it supports. And as I said, you can't put this book down."}, {"userName": "Lou", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "This is a story of a family on the run for survival where anarchy and mayhem has struck, end of days sort of stuff. I received this copy as an arc to review, it's my first reading of Crouch's solo work, I loved Draculas a collaborative work. I have not read but i think his other works like Abandon are better. There is some elements missing that make this on the run for survival story just a bit more thrilling. I suppose when I read these type of themed storis I try to par them alongside 'I am Legend' and 'The Stand'. I am sure they are not easy to write as so many writers have covered this ground, even Cormac's 'The Road' I felt was dull and many did not and liked it. I must give my honest opinion this needed little bit more supernatural or thrill injection in order to wow me. The writing on a whole was good and flowing."}, {"userName": " Simply Sam ツ", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/14235956-simply-sam", "userReview": "[but got this instead (hide spoiler)]"}, {"userName": "Javi", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/44334842-javi", "userReview": "Well, if you take into account that the original name of this book was \" American Genocide\", you probably have a good idea of what's going to happen once you start reading. The premise is absolutely terrifying: for some reason ( you find out at the end) large portions of Americans are turning against each other and killing people in droves. At first it's just a slightly elevated number of shootings, then double the usual, then...the power goes out and they start reading the names of those who are going to be killed on the Emergency Broadcast System. That's when our MC, Jack, hears his name and that of his wife and two kids. So of course, they run. The pace is neck breaking and it leaves very little room to breathe, such is the brutality of what they witness. What little relief we get comes in the form of very detailed descriptions of the beautiful scenery they drive through in Wyoming and Montana, but other than that it's brutal. It's not exactly a character driven story but that doesn't mean you don't get to know the family well and care about what happens to them. The writing is very good, maybe not Stephen King good but it's its own style. Other than that, this could have perfectly been a story told by Mr King. Jack and his family don't run forever, it all comes to and end, which is somewhat anticlimactic given the intensity of what the author put us through. And there is an ending with a conclusion and an explanation, just not very convincing. But if you try to enjoy the journey rather than wait for the destination, then you'll probably like this book. This was the first book by Blake Crouch I ever read and not surprisingly I immediately gravitated to the Wayward Pines trilogy, which is awesome. So I highly recommend this book to horror fans everywhere. You won't be disappointed."}, {"userName": "Adam Light", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/7004622-adam-light", "userReview": "Another mile a minute, face melting, pulse-pounding action suspense novel from Crouch. I was glued to my Kindle from the first page to the end. This one was my second from him after reading Pines and, while I loved the non-stop breakneck pacing of the plot, it was not quite as cohesive. Some reviewers are dettered by the unbelievable scenarios that are presented in Crouch's novels but he executes these impossible scenes with bravado and style which, for me anyway, means hellaciously fun reading. I fully expect his characters to narrowly avoid death over and over again, it's all part of the ride. The apocaplyptic setting provided plenty of action and nerve-wracking terror and there was gore aplenty. The one thing I didn't care for was the way it all wrapped up. I am becoming quite a fan of Crouch's writing style, though. I plan to read all of his books eventually. Although not as awesome and mysterious as Pines, this was a well written, fun and quick read. I highly recommend it despite my reservations about the end of the book."}, {"userName": "ijeoma Agbaje", "userReviewDate": "Jul 14, 2016", "userURL": "http://www.goodreads.com/user/show/16037420-ijeoma-agbaje", "userReview": "OMG!!!!!! This book was so freaking nerve racking. I lost it a couple of times.. The only thing that stops me from giving it 5 stars is just the explanation for the carnage was just not believable, I mean c'mon, was that really the best explanation the writer could come up with? Aside that little pesky detail it was a great and I mean a GREAT book!!!"}, {"userName": "Clark Hallman", "userReviewDate": "Mar 15, 2014", "userURL": "http://www.goodreads.com/user/show/12101662-clark-hallman", "userReview": "Run by Blake Crouch immerses the reader in a dystopian US society, where a large portion of the population suddenly begins to kill other people after viewing a cosmic event. The experience changed those people into murderous maniacs that are compelled to kill all people who did not witness the event and were not affected by it. The crazed killers can recognize those who were not changed by the event, and they work together to kill them all, even their neighbors, friends, and family members. The book focuses on a family of four that is forced to flee their home and their city to try to survive. However, they discover that they are not safe anywhere. They are repeatedly savage attacks and forced to endure incredible hardship, physical pain, exhaustion, starvation, and terror. It seems that there is no haven for them anywhere. This story is an incredibly-violent and painfully-suspenseful thriller, which elicits a hopeless feeling for the reader who emphasizes with the characters. It is not for the fainthearted, but it does entice the stoic reader to rebound and speed through the text after enduring each malicious blow. It’s is exciting novel and I believe I will read more Blake Crouch novels, but not until after a sufficient period of recovery."}, {"userName": "Angel Gelique", "userReviewDate": "Sep 28, 2012", "userURL": "http://www.goodreads.com/user/show/13230091-angel-gelique", "userReview": "I don't know what made me decide to read this book from my very lengthy \"to-read\" list, but wow...I'm so, so glad that I did. This book was amazing--well written and suspenseful. It's the story of a family of four trying to survive in the midst of chaos and danger following a bizarre cosmic phenomenon. I read this book in two days, neglecting my responsibilities just so I could find out what would happen next. I would love to see this book made into a movie."}, {"userName": "William", "userReviewDate": "Apr 17, 2011", "userURL": "http://www.goodreads.com/user/show/747711-william", "userReview": "I think this is the best book I have read this year. It is one of those stories that you hate to put down and then itch to return to once you do stop. WARNING: THIS IS A VIOLENT BOOK. That said, I think the story is well told. There is a new group of authors out there that I am really starting to appreciate. Blake Crouch is one of those!"}], "description": "For fans of Stephen King, Dean Koontz, and Thomas Harris, picture this: a landscape of American genocide...5 D A Y S A G OA rash of bizarre murders swept the country…Senseless. Brutal. Seemingly unconnected. A cop walked into a nursing home and unloaded his weapons on elderly and staff alike. A mass of school shootings. Prison riots of unprecedented brutality. Mind-boggling acts of violence in every state.4 D A Y S A G OThe murders increased ten-fold…3 D A Y S A G OThe President addressed the nation and begged for calm and peace…2 D A Y S A G OThe killers began to mobilize…Y E S T E R D A YAll the power went out…T O N I G H TThey’re reading the names of those to be killed on the Emergency Broadcast System. You are listening over the battery-powered radio on your kitchen table, and they’ve just read yours.Your name is Jack Colclough. You have a wife, a daughter, and a young son. You live in Albuquerque, New Mexico. People are coming to your house to kill you and your family. You don’t know why, but you don’t have time to think about that any more. You only have time to….R U NThis 80,000-word novel also contains a bonus interview with Blake, and excerpts from his other work.", "title": "Run", "url": "https://www.goodreads.com/book/show/10595576.Run", "average": 3.88, "cover": "https://images.gr-assets.com/books/1328317461l/10595576.jpg", "reviews": 911, "authors": [{"url": "https://www.goodreads.com/author/show/442240.Blake_Crouch", "name": "Blake Crouch"}], "type": ["Horror", "Thriller", "Fiction", "Suspense", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/10595576-run", "http://www.goodreads.com/book/show/16614630-run", "http://www.goodreads.com/book/show/15035778-run", "http://www.goodreads.com/book/show/10605098-run", "http://www.goodreads.com/book/show/25636782", "http://www.goodreads.com/book/show/27833670-dark-matter", "http://www.goodreads.com/book/show/20423680-the-last-town", "http://www.goodreads.com/book/show/15096164-pines", "http://www.goodreads.com/book/show/17920175-wayward", "http://www.goodreads.com/book/show/6049585-abandon", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}