{"ratings": 7, "userreviews": [{"userName": " Mummy Cat Claire", "userReviewDate": "Feb 21, 2018", "userURL": "http://www.goodreads.com/user/show/2648857-mummy-cat-claire", "userReview": "This is the second book in a series. I continue to enjoy Moxie and her adventures with Misty.In this story we find that Moxie and Misty know each other quite well. They have grown to love one another and often visit Dizzy and her animal shelter. This time, Moxie finds a family of feral cats on the farm. A mother cat shows up with three kittens but they are afraid of Moxie. They always run and hide from her. They enjoy the warmth of the barn though. Moxie wants to make the cats her pets but they don't ever seem to warm up to her. Meanwhile, Dizzy contacts Moxie to inform her of another girl in New York City who is struggling to feed a group of feral cats. Apple Maria Garcia is trying to take care of the feral cats in the city. The story goes on to tell all about what Moxie learns about feral cats and how to care for them.I found the story to be enjoyable. I think kids like the characters and the adventures. I also like how the book is educational in an entertaining way. Overall, this series is geared to 7-12 year olds but can be enjoyed as young as 5. The end of the book has more information on feral cats. There is also a note from the author about her inspiration for the story. There are still great pictures in this book.Content: cleanI received a copy of this book from the author in exchange for an honest review."}, {"userName": "Elissa", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/51576475-elissa", "userReview": "Ms Danforth has again created an enchanting children's book that is as delightful for adults--although we may have to suspend our disbeliefs a bit more. Flying horses and other magic notwithstanding, the core story this time revolves around domestic and feral animal rescue and provides a terrific amount of information slipped casually into the storyline. Following the main tale are a number of articles further discussing facts of feral cat rescue, grizzly bears, and more.I recommend you read along with your younger child and enjoy discussions with your older children on the topics covered. Among those, of course, are \"how cool would it be to have your own flying horse?\" And \"why would Moxie wave cookies around when she could be eating them?\""}, {"userName": "Susan", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/67169745-susan", "userReview": "A great pet rescue fantasy for young animal lovers. Moxie’s and Misty’s adventures continue as each adventure teaches some facts on animal care. The author’s imaginative plots add a young “super hero” flavor to the stories that I bet most children would love to have, so saddle up!"}, {"userName": "Amy", "userReviewDate": "Dec 28, 2017", "userURL": "http://www.goodreads.com/user/show/9945907-amy", "userReview": "Runaway Rescue: The Adventures of Misty and Moxie Wyoming is the second book of the series by Niki Danforth. I enjoyed this one as much as the first book. My daughter and I read it together, which was a perfect way to spend time with one another. Misty and Moxie are a fun pair. I love how the story has a wonderful lesson for everyone of all ages to learn.I highly recommend this book, as well, as the series for readers young and old.5+ stars.I received this book from the publisher. This review is 100 percent my own honest opinion."}, {"userName": "Stephanie", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/12336980-stephanie", "userReview": "What a great story about rescuing pets! A great fantasy adventure awaits the reader. I enjoyed the picture each chapter had in the ARC version. In my purchased copy none of the pictures are showing which is a disappointment.I was gifted an ARC in return of an honest review."}], "description": "Feral cats—and danger—are everywhere… 10-year old Moxie Wyoming and her magical horse Misty are at it again. This time, it's not one, but two daring rescues! There's a family of feral cats who've taken up residence at Moose Creek Ranch and are threatened by predators. But it's the urgent call to rescue a colony of city cats that requires Misty’s special powers and Moxie’s can-do attitude. With the clock ticking, can this adventurous duo get there in time?", "title": "Runaway Rescue: The Adventures of Misty & Moxie Wyoming 2", "url": "http://www.goodreads.com/book/show/36625646-runaway-rescue", "average": 4.57, "cover": "https://images.gr-assets.com/books/1511143608l/36625646.jpg", "reviews": 5, "authors": [{"url": "https://www.goodreads.com/author/show/7302052.Niki_Danforth", "name": "Niki Danforth"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/36625646-runaway-rescue", "http://www.goodreads.com/book/show/36638932-runaway-rescue", "http://www.goodreads.com/book/show/33098621-searching-for-gatsby", "http://www.goodreads.com/book/show/18584170-stunner", "http://www.goodreads.com/book/show/25440155-a-wild-ride", "http://www.goodreads.com/book/show/29084853-delilah", "http://www.goodreads.com/book/show/36122727-a-wild-ride"]}