{"ratings": 1179, "userreviews": [{"userName": "Orsodimondo", "userReviewDate": "Sep 21, 2012", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "PENSAVAMO CHE DALL'ORRORE CI SAREMMO DIFESI NON VEDENDOLO, NON GUARDANDOLO...Il titolo è una citazione dal capolavoro di Primo Levi.È un libro duro, che si fa fatica a leggere di notte perché nel silenzio l'orrore sembra ancora più acuto. Slavenka Drakulić è una scrittrice tosta e coraggiosa, affronta argomenti pericolosi, entra nel cuore nero dei fatti e lo racconta senza paura. Ma usando tatto, garbo, intelligenza, sensibilità, talento.Sarajevo 1993Una giovane bosniaca musulmana viene catturata da soldati serbi, chiusa in un campo di prigionia, ogni notte picchiata, umiliata, stuprata. Adesso è libera, a Stoccolma, partorisce in ospedale, vorrebbe liberarsi del figlio che non sente suo, ma…Il racconto dall'interno del campo di concentramento e dal centro della violenza di solito è fatto direttamente dalla vittima, dal sopravvissuto: qui invece è condotto in terza persona, raccogliendo quelli che si immaginano le confessioni della protagonista, vittima sopravvissuta all'orrore, alla psicologa. La terza persona sembra accrescere l’orrore: è una voce che solitamente rimarca una distanza, in questo caso sembra una distanza che aiuta a mettere a fuoco, a capire meglio, a muoversi nella tenebra.Andree Kaiser: Sarajevo 1993.L'orrore di cui qui si parla è la guerra di Bosnia e il racconto è ambientato nel 1993, nel pieno dell'assedio e massacro di Sarajevo, due prima di Srebenica.La protagonista non ha nome, e non l’hanno neppure le altre donne: hanno perso identità, dignità, umanità, insieme al corpo. È come se non esistessero, come se fossero scomparse.E gli stupratori, i torturatori hanno un volto noto, nella vita precedente, solo qualche mese prima, sono forse stati amici del fratello della vittima. Un elemento che intensifica l’atrocità.Siamo in un territorio circoscritto dove regna la morte e non si sente più il dolore, perché è più forte di te e ti divora, si può quasi tastarlo sotto la pelle, dolore per il quale non esiste conforto. Un territorio dove accettare la propria morte rappresenta una porta aperta verso il futuro.Dove la paura paralizza i pensieri, i gesti, le sensazioni.Dove per sopravvivere si deve obbedire a quelli che hanno le armi, perché la tua vita, proprio come la tua morte, non dipende più da una tua scelta.Dove si è ridotti a essere solo un corpo, e molto spesso neppure quello, molto spesso si perde ogni diritto su se stessi e anche il corpo viene espropriato, come succede alla protagonista di questo libro. Che è un romanzo, e anche un reportage.Drakulić riesce a spiegare e sondare e trasmettere anche quello che appare più oscuro. Gli assassini hanno bisogno del silenzio e dell'oblio, ma le vittime non devono concederglielo.Slavenka Drakulic ha deciso di descrivere l'indescrivibile. C'è arte magistrale nel suo coraggio. E ancora una volta forse solo l'arte può avvicinarci alla consapevolezza della nostra follia contemporanea."}, {"userName": "Lisa", "userReviewDate": "Sep 01, 2016", "userURL": "http://www.goodreads.com/user/show/32532774-lisa", "userReview": "This was the first Drakulic I read, and at the time, I felt incapable of writing a review, although I consider it both very well written as a novel and immensely important as a historical reflection on the routine of rape during wars. There was a double reason why I could not put into words what I thought. First of all, I struggled with the closeness of the atrocious events: both in a geographical and historical sense. This book took me to a war in Europe during my own lifetime, my teenage years, and it contained the whole spectrum of innocent civilians suffering that I can hardly bear to witness from a distance when reading about World War Two, for example. The graphic description of rape, and the information that there had been a routine of holding women hostage to use them as sexual slaves, not that far away from where I spent my safe adolescence, made a strong impact on me, stronger than I had expected. Now, when the book is not haunting me as vividly anymore, I find myself in the position to reflect on it more calmly and to appreciate the important message about the incredible vulnerability of women in unstable societies.The other reason why I had trouble with reviewing was that I felt I could not place the author properly. The topic was so extreme, the suffering described so harsh - I could not imagine what her writing would look like if she chose a different subject. Then a while ago, I read A Guided Tour Through the Museum of Communism, and was completely surprised by the wit and almost silly sense of humour displayed in the excellent short story collection. I would never have expected to pick up a book by Drakulic and actually have a good, lighthearted laugh, not after my first encounter with her. In a way, that humorous approach to Communist rule made the pain of \"As if I Am Not There\" even more tangible. Both books however are similar in the way they describe how people suffer from an oppressive system that they can't escape, either during a war or within a totalitarian political system. They also show a variety of different characters reacting to the system, using their individual survival skills. So I thought that might be the \"recipe\" to Drakulic' writing. But then I started to read Marble Skin, and I was again taken by surprise - being catapulted into a brilliant opening, describing a sculptress' creation of a female marble body as an introduction to a dark inner journey to get to terms with her mother and her sexuality. It feels like it is - again - an entirely new author I am trying out. What a versatile storyteller!I will continue to think about \"As If I Am Not There\" for a while, but the contrast to the other novels gave it even more depth, pain and acute relevance than it had when I first stumbled upon it.And I am curious to try the rest of Slavenka Drakulic' oeuvre as well, now definitely expecting to be surprised (if I may say so, well knowing that it is an oxymoron, kind of...)."}, {"userName": "Emily May", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "When your country is at war with another, or perhaps many others, you are aware of the risk to human life. You know soldiers will die, you know that some of these may be people you know or even your loved ones. But, though the civilians at home worry about those who are away fighting for their country, they rarely see themselves as part of the war. The threat to them seems far away, almost unreal. So when the occupying forces marched into the Bosnian village where S. lived, her immediate reaction is not of panic. She is mildly annoyed for having been woken up, but she still has faith in the human capacity for reason and she believes that if she surrenders her jewellry and valuables without making a fuss, then no one will do her any harm. In other words, she is naive.The civilians are captured and taken away to work camps, one for men and one for women. But deep within the female camp is the room that every prisoner dreads - the women's room. A room where women become objects to be used by the soldiers, a room of pain and despair where all hope dies and a person is forced to become empty. Being empty in your mind, abandoning your body at will, this is the only way to survive. Drakulic shows the extent of human depravity in one of the most disturbing accounts of captivity during wartime. Her use of the first letter in place of the women's names is important in understanding the ability to dehumanize the enemy, they become things and not people. It is repulsive, scary and sad. But the author, in my opinion, never slips over into the gratuitous because her focus is on S.'s inner turmoil. It is not just about the sexual abuse, the beatings and cruelty, it's about the effect this has on the victims, how they retreat inside themselves and the lengths they go to in order to keep their sanity in a world gone mad. Not only that, but she even looks at what it's like to be a soldier blindly following orders, dehumanizing yourself to find the ability to commit atrocities during war. It's easy to have enemies and it's easy to hate, but what does it take to make you someone who can torture another human being? What must they become in your mind? What must you become?When showing the crimes men commit towards women, when showing a group of male soldiers laughing at a woman's pain, it becomes so easy to delve into misandry. You hate the Serbian soldiers, you hate the things they do to the women. But this is only partly a gender issue. Drakulic wants to tell the many untold stories of women during the Bosnian war (there are an estimated 60,000+ rape victims), she wants us to know about the suffering they faced because of their gender. But, for the author, humanity has one common enemy regardless of your race, religion or gender... and that is war. War makes us all something other than human, it allows those with the power to become monstrous and it allows those without it to be seen as vermin.Though the author chose to focus on the Bosnian war and particularly the way women were treated during this war, the backbone of this story is universally applicable. She expertly tells a story about some of the vilest, most horrific things that can happen to a human being, she captures humanity at it's best and worst, showing exactly what we are capable of - both the good and the bad."}, {"userName": "K.D. Absolutely", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/2156200-k-d-absolutely", "userReview": "Slavenka Drakulic\n (born 1949) is a Croatian novelist, sociologist and a journalist who writes mainly on women issues. This is my opening sentence because when I picked up this book, I asked myself: Drakulic, who? and thought that this was a horror book. Hmmm. Drakulic=Dracula. Bosnia=Yugoslavia=Transylvania. Enough, K.D. Stop. Must be the Halloween spirit. This is a serious book.Very much, indeed. S: A Novel About Balkans a.k.a. As If I Am Not There is about rape, torture, and sexual slavery of Muslim women during the Bosnian War (1992-1995). During that war, the Serbian minority laid siege to Saravejo and began rounding up and massacring Bosnia's Muslim population. Then the Serbian rebels transported the Muslim people into concentration camps and did the atrocities similar to those committed by Hitler in Europe during the holocaust. Taking the scope or extent in terms of number of people aside, the only difference between the two was that the Serbian rebels sexually molested the women including young Muslim girls. German soldiers, unfortunately or fortunately, saw all Jews to be of lower class thus not worth sleeping with and not worth to bear their children. There is a scene in this novel when the Serbian soldiers (yes, most rapes here were done by 2-3 men to one woman) were raping a Muslim woman, one of them said that when the baby comes out, he/she is considered a Serbian which is a higher desired race compared to that of Muslim's. Since, this book is based on personal testimonies of several women who Drakulic interviewed as a journalist for a Croatian newspaper, you would feel that the events are exact and sincere. Being a journalist, however, you would not feel that you are reading a transcript of interviews or a history book. Her prose has no allegory or philosophical musings but her emotion as a writer of women issues was captured emphatically on the flight of these poor marginalized Muslim women.The protagonist name is simply S., 30-y/o, single and an English teacher at Saravejo when she was cornered and brought to a Bosnian concentration camp. She, together with around 20 other women and some girls as young as 13 years old, were kept in a \"woman's room\" as sex slaves. This reminded me of the \"comfort women\" that the Japanese kept during WWII not only here in the Philippines but also in other Asian countries. Those pigs!!! S. and other women, got pregnant. Since they hated all those who raped them (of course), they did not feel any love for the children they nurtured in their wombs. They did not know what to to with the babies lying on their cribs at Stockholm's (they were brought to Sweden when they were saved from Zagreb's concentration camp) hospital. I will not tell you what happened next as it is too much of a spoiler. Suffice it to say that the novel did not just focus on the Serbian atrocities during the war but also in the dilemma of the women who got raped and had to bear the Serbian children. This spin made this a different reading experience compared to the Holocaust novels that I've read and liked so far such as those of Anne Frank's, Ellie Wiesel's or Imre Kertesz's.This truly deserves its slot in the 1001 Books You Must Read Before You Die list. No doubt whatsoever."}, {"userName": "Tonkica", "userReviewDate": "Aug 13, 2015", "userURL": "http://www.goodreads.com/user/show/21285672-tonkica", "userReview": "Jako, jako, jako teska istinita prica. :( Tesko je dati ocjenu, jer osjecas samo tugu, bijes, nepravdu, zlo, strah, bol... Kako za takve osjecaje dati bilo kakvu ocjenu? No, Slavenka je i ovaj put dosla do srzi cijele price, te ju prikazala bas kakva je i bila - teska! Svaka cast svim zenama i muskarcima koji su uspjeli prezivjeti bilo kakav logor. Jos uvijek sam u soku od opisa sto covjek covjeku moze raditi! :("}, {"userName": "Ana", "userReviewDate": "Jun 01, 2018", "userURL": "http://www.goodreads.com/user/show/50899005-ana", "userReview": "Li esta obra em dois dias e ainda a estou a digerir. Como mulher, creio que ainda dói e fere mais ler relatos hediondos como este, mesmo que os mesmos sejam ficcionais, já que infelizmente a ficção não difere em nada da realidade, do que se passou entre homens, mulheres e crianças que até há pouco tempo eram vizinhos, amigos a até da mesma família. Não consigo, mesmo depois de ter lido tantos e tantos livros sobre este e outros conflitos, conceber como é que um ser humano é capaz de cometer tais atrocidades a outro ser humano. Sei que me estou a repetir, que já escrevi inúmeras vezes este último pensamento, mas nunca irei entendê-lo. Nunca.Opinião completa em:http://osabordosmeuslivros.blogspot.c...(é uma opinião em conjunto, um 2 em 1, se quiserem)"}, {"userName": "Steve Kettmann", "userReviewDate": "Apr 13, 2010", "userURL": "http://www.goodreads.com/user/show/1469927-steve-kettmann", "userReview": "My original review (2000) in the San Francisco ChronicleS. A Novel of the Balkans By Slavenka Drakulic Viking; 216 pages; $22.95Croatian writer Slavenka Drakulic has given the world a gift, digging into the twisted reality of the war that splintered the former Yugoslavia and emerging with ``S.,'' a searing story about a woman held in a Bosnian concentration camp. It is a haunting, difficult novel that is also somehow redemptive.In the past, Drakulic has demonstrated in essays such as ``Cafe Europa: Life After Communism'' an inspired knack for unlikely but telling details. She also has a restlessness and a moral imagination that give her work nuance and power and flavor -- this last quality being one she jokes about in the title of her I-loved-him-so- much-I-ate-him novel, ``The Taste of a Man.''But never has she combined her approach and her subject matter into anything like the cataclysmic power of this new novel, which makes her earlier novels look like secondary-school warmups. Drakulic not only pulls us into the world of this anonymous young woman, a teacher taken away by Serb soldiers along with everyone else in the town she works in, but she does it without manipulation.``The smell, the smell of dust in the dry air, that is what she will remember,'' begins an early chapter. ``The taste of coffee with too much sugar. The image of women quietly climbing on to the bus, one by one, as if going on an excursion. And the smell of her own sweat.''Some might call Drakulic's adroit use of sight and sound and fleeting impression manipulative, but when it works as well as this, the criticism seems misplaced.Drakulic takes us through the succession of horrors endured by S. in such a relaxed manner, it almost seems like travel writing. There is the uncertain young man who comes to take S. away. ``The black nail of his big toe is poking out of his torn cloth sneakers,'' she writes. There is the subdued horror of packing just a few belongings when S. has no idea how long she will be gone or where she's being taken. And there is the power of a good list, such as this one describing the villagers: ``These people are leaving behind uneaten food on the table, unwashed dishes, unfinished work, animals in the barn, radios playing, laundry for ironing, arguments.''Drakulic keeps her prose orderly and controlled. Simple impression follows simple impression. The cumulative effect makes the reader go from understanding the fracture of Yugoslavia by what was shown on TV to knowing it through benumbing verisimilitude.Because Drakulic always looks for the small, human moment that can offer respite from horror, the atrocities portrayed never seem gratuitous or polemical. That's saying a lot, given such passages as S. overhearing a ``young voice'' saying: ``I saw three dead girls in a ditch. I knew them from school. They were naked. Their breasts had been cut off. I covered them with leaves.''The book never drags, and no page stands out as less gripping than the next. But the story rises to another level of horror when S. moves into the ``women's room'' in the concentration camp. Drakulic juxtaposes the ordinary with the extraordinary to make these scenes so powerful:``S. tries to unbutton her blouse. Three pairs of men's eyes watch her movements as her trembling fingers fail to find the buttons. It is not that she does not want to obey their order. On the contrary, she is in a hurry to do so. At that moment she cannot even think about doing anything else -- but S. no longer controls her fingers.''What the soldiers do to S., the hows and whys of it, cannot fail to shake loose troubling perspectives on war and what it means. Drakulic could not have written a book this good, this free of cheap effect, if she had rushed herself. She had to spend time mulling over the war, gaining something to serve as ballast, something enabling her to see the truth in a line such as, ``But the soldiers are no longer people either, except that they are less aware of it.''Despite the dehumanization suffered, Drakulic's main character remains alive on the page, even if she doesn't have an actual name, just a letter, like all the women in the story. ``I'm alive, she thinks, as if this were a secret to be kept for herself.'' Later, ``(s)he jumps, suddenly, as if startled out of a dream.'' And still later, during the unnerving section devoted to S.'s odd liaison with the camp's sad, proper and yet ultimately debauched commander: ``Smells are a dangerous thing, they catapult you back into the past and she is afraid of forgetting where she is. She must focus on the captain.''Eventually, S. and the others are released from the camp. The psychology of what they face afterward has been explored elsewhere, but even so, Drakulic's take on psychological dislocation comes across as fresh. S. can't look back. She can't look forward. She can't even claim the present. ``But nothing is close enough to her yet, not the wet asphalt she is treading, not the cup of coffee she is holding, not the snowflakes falling on her face.''Only when S. resettles in Stockholm, that gleaming Swedish bastion of prosperity and social services, can she try to come to terms with living. Just what that entails can't be reduced to a few words, but her agonizing reflections, and where they lead, never feel less than honest.Steve Kettmann is an American writer living in Berlin.http://sfgate.com/cgi-bin/article.cgi...This article appeared on page RV - 10 of the San Francisco Chronicle"}, {"userName": "Nataliya", "userReviewDate": "Jun 19, 2017", "userURL": "http://www.goodreads.com/user/show/3672777-nataliya", "userReview": "\"Perhaps that happens to people in wartime, words suddenly become superfluous because they can no longer express reality. Reality escapes the words we know, and we simply lack new words to encapsulate this new experience.\"\"Only now does S. understand that a woman's body never really belongs to the woman. It belongs to others—to the man, the children, the family. And in wartime to soldiers.\"\"Now, however, she sees that for her war began the moment others started dividing and labelling her, when nobody asked her anything any more.\"\"In the meantime, her life has become something different, unrecognizable. Or perhaps unimaginable. Lying in her hospital bed in Stockholm she still does not know what to call it, although she knows that the word is: war. But for her, war is merely a general term, a collective noun for so many individual stories. War is every individual, it is what happened to that individual, how it happened to that individual, how it happened, how it changed that person's life. For her, war is this child she had to give birth to.\" \"It is their submissiveness that shocks S. more than anything else, their willingness to obey orders without question. She thinks this is so, not only because the men have guns, but also because these people are still in a state of disbelief, in some temporary state of numbness, that they refuse to understand what is happening to them. Or perhaps it is a kind of naivety, the belief that surely somebody must know what is being done and why, that there must be a reason for this action.\"\"Is it good to remember or is it easier to survive if you forget you ever lived a normal life?\""}, {"userName": "Ron Wroblewski", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/43565088-ron-wroblewski", "userReview": "This is a terrible yet realistic book about the way woman are used (misused) during war. It is very sad that things like this happen and the men who treat women like things to be used should be used on the gallows."}, {"userName": "verbava", "userReviewDate": "Jan 07, 2014", "userURL": "http://www.goodreads.com/user/show/2219641-verbava", "userReview": "At that moment in that room she realises that the camp is not just a place where she happens to find herself, it has become the condition of her body and soul.від \"с.\" іноді фізично нудить, у найпрямішому з сенсів. і для цього є купа причин: бо текст проникливий і реалістичний; бо тема його страшна і занадто актуальна; бо я жінка, і навіть якщо винести війну за дужки, там залишиться занадто багато жахливого, що залазить мені під шкіру.тому про \"с.\" непросто говорити. тобто так, можна стежити за розвитком тексту, за поступовим стисканням рефлексій (іноді здається, що думки витікають із героїні разом з тим, як витікає її життя, і в ній лишається сила тільки фіксувати деталі довколишнього світу), за \"зісковзуванням\" із третьоосібної розповіді в я-наратив (що дуже потужний художній прийом, як на мене. щойно заспокоюєш себе думками про художність тексту, як тебе хапають за волосся і знову занурюють у це жахіття. а чого ти хотіла, справді). усе це – досвід читання, про який можна розповісти. але \"с.\" змушує переживати себе, і цей аспект погано піддається проговоренню.During those few days and nights, pain had moved into S. as if into its own house. She felt occupied. A previously unknown illness had entered her and was now eating away at her. S. could not imagine that a man's body could do such damage to a woman, that it was so powerful, so unfairly overpowering that a woman had no defence against such force.___She wonders what else she will have to give up and what is the minimum of things with which one can survive without losing the feeling that one is human?___She is awake. Again she thinks about fear. Until then, she had not been aware of fear, she had been convinced that she did not feel fear, not even when they had taken the group of men out from the gym, or when she had heard the burst of gunfire. She listens. She knows now that fear is the absence of all emotion, it is emptiness, it is as if your whole body is drained of blood all at once.___A refugee is someone who has been expelled from somewhere but does not go anywhere because they have nowhere to go.___Her body lies in the bed like an inanimate object, an emptied bellow or shopping bag. Nothing has changed with her departure from the camp. Her body is still in their power, even more so now. Only now does S. understand that a woman's body never really belongs to the woman. It belongs to others—to the man, the children, the family. And in wartime to soldiers."}, {"userName": "Dan", "userReviewDate": "Mar 31, 2008", "userURL": "http://www.goodreads.com/user/show/722135-dan", "userReview": "this novel concerns the systematized rape and torture of civilian bosnian women during the conflicts in the balkans during the early nineties. it's deeply troubling stuff-- almost a psychosexual counterpart to a day in the life of ivan denisovich. which begs the inevitable question-- why am i reading this? certainly there's an impulse to somehow \"bear witness\" (however wishy-washy), and drakulic does a great job of emphasizing the necessity that such events be remembered (as well as, ironically, forgotten by their victims, to a certain extent). as might be expected, there's an intense discomfort to the entire reading experience. it extends far beyond the most atrocious events documented, and the book shows a decent amount of restraint regarding its most atrocious moments (unlike, say, kozinski's the painted bird which i found exploitative in that regard). the most remarkable thing about the novel (other than its social significance as a document) is drakulic's characterization of her protagonist's body. the physical markings of power and brutality are conveyed in great complexity, through a deceptively straight-forward prose style. aesthetically, the book is rather remarkable, though it's easy (perhaps even appropriate) to disregard aesthetics while reading it. s. manages to be illuminating in ways that deepen the superficial revulsion i felt following its brief description on the back of my paperback. the novel is an illuminating account of bodily terror, as well as a warning concerning racism, misogyny and mob mentality. it takes a strong stomach to get through, but i'm glad i put myself through it."}, {"userName": "Ruby Hollyberry", "userReviewDate": "Jan 17, 2010", "userURL": "http://www.goodreads.com/user/show/2463534-ruby-hollyberry", "userReview": "Not for the squeamish! An amazing novel that tells a fictional account based on the real experiences of Balkan women who were herded into the \"rape camps\" during the war. The narrator S. tells of how, as a secular townswoman of mixed Muslim/Christian ancestry, she was sent to a camp among other young women and girls and what went on there. The horrifying events unfold calmly one at a time, with no foreshadowing or anticipation of where it will all end, or how, which makes it seem very realistic. I'm sure none of the real women that were so treated had any idea what was about to happen to them at any stage. The narrator of course has to be one of the \"luckier\" ones - for her story to have an ending she must survive at least - and after a time she is selected by a man of some rank among the Christian Serbian army that set up and use the camp. He is far less violent and degrading to her, to say the least, than are some of the men to some of the women. But he is not portrayed as sympathetic, of course. Just survivable. Eventually the women who have survived become refugees, taken in nearly at random by relatives or strangers or distant and sympathetic countries. S. travels to Sweden where all her basic needs are met. The story ends with the last of the visible and obvious results of the theft of her life and her happiness - she is pregnant and must decide what to do with the child. The invisible, internal results, to herself, so many others like her, and her people and country, will never end."}, {"userName": "Ian", "userReviewDate": "Jun 30, 2012", "userURL": "http://www.goodreads.com/user/show/3652044-ian", "userReview": "This a great book but a really difficult one to read. It is set during the 1990's Bosnian war and is about the systematic rape and killing of Bosnian Muslim women by Serbian soldiers both in their towns and villages but later in the concentration camps. It is a story told by a woman only identified by the initial S. - the sad truth being that the women will never identify the rapists, for fear that they will be victimised even further after returning to the Muslim community."}, {"userName": "Bogdan", "userReviewDate": "Oct 25, 2015", "userURL": "http://www.goodreads.com/user/show/1679953-bogdan", "userReview": "I always thought that war atrocities are something from the distant past, when there was no human rights neither Geneva convention. Usually I imagine them to be part of wars from the Dark Ages, or even more distant, like Antiquity or Stone Age. But I always forget how relatively recent were World Wars (a meager 70 years), or the Bosnian War or even more recently, the War from Eastern Ukraine, about which if I will hear similar atrocities I would not be surprised.This is just what this novel and other of their kind are suppose to do: to not let us forget. It is so easy to forget this in normality of everyday life in which you don't need to worry about anything like the atrocities of war, but you are worrying about making money, paying everyday bills and how to buy that next thing you want so much. Absorbed by these trivial desires, we forget so easily about guns, atrocities committed by war criminals, genocide and so on. So this is why we need to remind ourselves that many such things have not happened so far away, neither in time neither in space and if we don't pay attention, we may allow them to repeat again sometime soon. Without any hesitation, I'll give it a 5 for premise.Regarding the form, there are some interesting choices that add up to form an interesting story. First of all and most obvious, characters have no names, just initials to denote authenticity. Secondly, it has the central character \"S.\" an intellectual young woman and this choice makes the introspection in her internal thoughts a lot more interesting than if it was a non-educated person. Lastly, the entire novel is written as a series of flashbacks from the main character. Quite interesting and good choices that make up a good novel, so I'll give it a 4 for form.In terms of originality, given the fact that I live in a country neighboring the ex-Yugoslavia and that the Bosnian War happened while I was in my late childhood, I always tried to find good books about it. This one is for me the first one I read about Bosnian War, so I will give it a 5 for the level of originality.On the characters, obviously the lead character as it is also the narrator is much more well constructed than the other characters. But even so, there were some interesting characters that proves Slavenka is a careful listener and understands human beings. For example the other women from the camp \"women's room\" or the Captain are quite intriguing ones. Apart from this, the author carefully stayed away from making a psychological treatise on guilt or victims recovery, without neglecting this aspect. In the end, it is obvious that the author worked as a journalist, and this is the reasons why I will give it a 4 for characters.Regarding the complexity and difficulty, there are a lot of traditional Chinese values and quite some sayings from popular wisdom or Confucius, but mainly Li tries it to make it accessible to any westerner. It is probably striking for the ones that did not lived under communism or are not accustomed with the terms or their full meaning used by those societies as \"counterrevolutionary\", \"pioneer\", \"self-criticism\" or \"denunciation\". I consider the author made a good mix between adding just enough of the local and time flavor so that we feel that the characters evolve in a world of their own, not just on a paper constructed world. That's why I will rate it with a 4 for complexity and difficulty.In terms of credibility, from all the information I have (unfortunately not too much as I was a teenager back when this war broke with little interest in international politics), this is very accurate. It was also probably influenced a lot by the material Slavenka created as a war journalist, interviewing people from the temporary camps created in Croatia. Simply it is impossible to say it was not inspired by facts so my rating for credibility is 5.The last criteria is edition. I purchased the novel already used and I was very glad it was in a quite good condition. I only noticed that the previous owner highlighted some passages and made some small comments on the sides of the highlighted paragraphs, but this did not bothered me too much. The translation it also feels very good, as if it was originally written in English. It is a nice paperback, so I'll give it a 4.To summarize, this proves that there are also many contemporary books talking about war standing at similar levels with the classics, like Hasek's Svejk (The Good Soldier Švejk) or Remarque's All quiet on the Western Front (All Quiet on the Western Front). All in all, my final rating for it is 4.57, which I will round it to 5 on Goodreads system.+--------------------------+-----------------+| Criteria | Rating |+--------------------------+-----------------+|Premise | 5 |+--------------------------+-----------------+|Form | 5 |+--------------------------+-----------------+|Originality | 5 |+--------------------------+-----------------+|Characters | 4 |+--------------------------+-----------------+|Difficulty/Complexity | 4 |+--------------------------+-----------------+|Credibility | 5 |+--------------------------+-----------------+|Edition | 4 |+--------------------------+-----------------+|Total | 4.57 |+--------------------------+-----------------+For more details on how I rated and reviewed this novel, please read these guidelines."}, {"userName": "Erik Graff", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/974210-erik-graff", "userReview": "This book was given to me as a Christmas present by my niece, Norwegian on her father's, Bosnian Serb on her mother's side. Based on interviews, it is a novelized account of one young Bosnian woman's life from the time of her capture by the Serbs, through her imprisonment to her resettlement as a refugee in Sweden--a period of just about one year. While imprisoned, the protagonist, 'S' in the novel, is, along with other young women and girls, repeatedly and often violently raped, her story beginning an ending with an account of her unwanted pregnancy.This may have been the most unsettling novel I have ever read..."}, {"userName": "Olivia Camp", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/67252558-olivia-camp", "userReview": "\"Their murderers need to forget, but their victims must not let them.\"What a powerful story. Never have I read something so horrific yet beautiful, with an emotional depth so unimaginable. I found myself constantly shocked as I continuously remembered the truth and nearness of its events. This novel will wreck you and leave you feeling utterly empty of all emotion over what thousands of women went through during the Bosnian war. Never have I ever felt such despair and connection over a story. I am in shock."}, {"userName": "Rob Withers", "userReviewDate": "Jan 09, 2018", "userURL": "http://www.goodreads.com/user/show/2206998-rob-withers", "userReview": "Devastating yet compelling. This one is definitely going back on my re-read list."}, {"userName": "Elisa Martínez", "userReviewDate": "May 14, 2018", "userURL": "http://www.goodreads.com/user/show/69800453-elisa-mart-nez", "userReview": "Desgarradora y arrebatadora"}, {"userName": "Shaun", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/2621599-shaun", "userReview": "\"S.,\" also know as \"As If I Am Not There\" -- a harrowing, haunting novel set in Bosnia in the years 1992 and 1993 -- is about the systemic rape and humiliation of a schoolteacher of mixed Serbian and Bosnian heredity. When Serbian forces enter her village, S. spends months in an all female compound of a Serbian concentration camp where she is subjected to continual sexual violence and beatings. The novel culminates with her arrival in Scandinavia as a refugee -- pregnant, homeless, and ambivalent about her unborn son, conceived during a gang rape in the camp. Sadly, S. is unable to find an individual or community who will listen to her story without judgment or condemnation.The Croatian journalist Slavenka Drakulic is one of the most insightful and evenhanded observers of recent Balkan history. I do not recommend reading this book in one sitting, although it feasibly could be done. The story is told in sparse, unflinching detail, without recourse to literary tricks. This is a haunting novel on par with \"Night\" by Elie Wiesel. Simply narrated but morally complex, \"S\" establishes powerful links between warfare, masculinity, sexual violence, and the female body, but artfully avoids offering simplistic conclusions or abject sentimentality. In one passage, the heroine wonders while coldly observing her illegitimate child, \"The children of war are in any case doomed to grow up living a lie. And should it happen that one of the mothers keeps the child, she will have to lie to it. She will have to invent for the child a father, a family, a past. Which is the greater, the right to a father or the right to the truth .... She senses the answer. To tell the child the truth would be to add yet another injustice to the one already done to it.\" Samuel Thomas, Ph.D. in Philosophy and English Literature from the University of Suffex aptly states, \"Most strikingly, the novel refuses to demonize Serbia in its depiction of the war, and the use of initials to identify characters means that questions of nationality and religion are handled with great subtlety. In effect, the initials ask us to see each character in his or her own light, as an agent and an actor, as flexibly rational, but possessing the potential for terrifying rationality.\" The title comes from a quote by Primo Levi from the novel, \"If This is a Man,\" \"It is an intense pleasure, physical, inexpressible, to be at home, among friendly people and to have so many things to recount: but I cannot help noticing that my listeners do not follow me. In fact, they are completely indifferent: they speak confusedly of other things among themselves, as if I was not there. My sister looks at me, gets up and goes away without a word.\"Read, reread again and enjoy the simplistic but beautiful, lyrical power of this novel about the human spirit triumphing over total desecration and destruction. Like the Bosnian War and the horrific, bloody century in which it occurred, this is a book I am not likely to forget now or forevermore."}, {"userName": "Kelly", "userReviewDate": "Apr 26, 2011", "userURL": "http://www.goodreads.com/user/show/5320659-kelly", "userReview": "Postmodern non-linear narratives are hard to read. You never know \"when\" you are. I love this in movies because visual cues always show me where I am. Non linear narratives mess up the story in compelling ways and show how our past and future often collide in our present. And yet, I always have trouble reading out of time. I miss the cues that are obvious to other readers. S. is a non-linear novel in the beginning and I certainly had trouble keeping in time.S.reveals the tragedy of war on women non-combatants. Death and violence stalk S. in the midst of the Bosnian war and genocide. Rape is central to women's stories of war, and Drakulic opens the novel with S. dealing with the birth of her son - a child conceived in rape and war.After the opening, Drakulic stays in the past and reveals the experiences of S. in a detention center in Bosnia. S.'s strategy is to become \"invisible\" to the men at the camp, but she is ultimately unable to do this. She winds up in a \"women's room\" where she becomes a sex slave to soldiers and guards in the war. She is raped and violently assaulted numerous times. One thing I really like about this novel is the way Drakulic thinks about how people survive disaster. Routine, small luxuries (like soap), friendship and small kindnesses make the day to day live-able for S. I often engage in these issues in my classroom when I discuss slavery and African American survival. Drakulic also tackles what the aftermath of war and rape are for persons. S. forgets to appreciate the kindness of others as she sinks into the terror of her past. {Spoiler alter} I'm slightly troubled by the end, when S. decides to keep her baby. She reasons that her child is not the men who raped her and decides to keep the baby. Drakulic sidesteps the trauma of parenting a child born of rape and the repercussions of lying or telling the child about its father. While I don't question the choice of a mother to do this, I think the narrative would have been more well rounded had the author dealt with the chaos of mothering this boy. Instead, Drakulic leaves the reader with a picturesque family. It's a strange end to an embittering novel. S. is a hard book to read. Tears rolled down my cheek and my heart sank at learning the horrors women experienced.(Drakulic got much of her inspiration from the war crime trials). Women's experiences in war often get sidelined by death tolls and men's soldiering. S. heightens my concerns about our nation engaging and worsening conflicts (Iraq and Afghanistan) abroad and the stakes of this for men and women. The cost of war is too much. I wonder if our nation would so readily engage in conflict if we had recent total war experiences on our own soil."}, {"userName": "Thurston Hunger", "userReviewDate": "Jul 21, 2009", "userURL": "http://www.goodreads.com/user/show/270341-thurston-hunger", "userReview": "A horrifying book, horrifying that is in terms of its topic/setting. The writing is hard to judge, for the simple reason that atrocities get stacked up so rapidly that I had to simply stop reading at times. The words disappear, but their story does not. Actually if anything the writing and the self-assessment of the lead character are as brutally plain, as the treatment of her in Bosnian camp is plainly brutal.At each chapter, I would look at the time stamp as part of the title and could not help but feel the recent whisper of history. 1992. Such a short time ago, not something we can write off as belonging to another time, another generation. Snipers in Sarajevo got more press in the US, and seemed mean, stupid and random...the accounts in this camp are personal and painful. I believe the author even contrasts the mercy of murder in contradiction to the torture that persists.As the months progress, the prison moves from the wretched confines of S, into a more insidious place. Inside her. Humans are amazing at adapting to extreme conditions, but other humans are amazingly appalling at how they treat their brothers, their sisters.So in the end, I am glad to be done with this book. Glad to have read it as well, hoping that it would give courage to those to stand up against what this world can do. But saddened that this feels like another sad chapter in ongoing history of man. This is a much different feeling than \"Sunday at the Pool in Kigali\" which placed love, bravery and hope amidst fratricide."}, {"userName": "J.", "userReviewDate": "Apr 19, 2014", "userURL": "http://www.goodreads.com/user/show/155482-j", "userReview": "I saw the Irish Produced film first, which is how I found out about the novel. The film was very similar, but the novel, of course, was better. The writing is effortless, and one has to read this in one sitting. The events seem absolutely inconceivable, but I suppose that is how all of these kinds of conflicts start. With a sense of disbelief. One of the best first hand account type works I have ever read. Even though it is fiction, it is clear that the author is very familiar with the subject matter, the region and the culture. This work deals with so many complex ethical issues, and one is left feeling that one cannot really ever judge another human being. I think it is a fascinating message to take away from a novel about genocide, rape, and humiliation. S. the main character is insightful and introspective, and struggles morally with her decisions much like other people who surround her. Overall an emotional, difficult, and incredible read."}, {"userName": "Ale Sandoval Tress", "userReviewDate": "Dec 09, 2016", "userURL": "http://www.goodreads.com/user/show/50171437-ale-sandoval-tress", "userReview": "Un libro terrible: a travé de entrevistas que hizo a las mujeres que vivieron la guerra de bosnia, la autora escribió después esta novela.Las protagonistas son mujeres que se vieron envueltas en el conflicto, que fueron secuestradas de su vivienda para ser llevadas a campos donde al principio solo eran prisioneras, pero después, serían el campo de recreo de soldados cada vez más crueles. Sometidas a violaciones y otras vejaciones, aprendieron a \"no estar en sí mismas\" para sobrevivir.Algunas quedaron embarazads de sus verdugos. Algunas mataron a los bebés cuando nacieron, otras los abandonaron, otras los tuvieron y se quedaron con ellos. En todos los casos las mujeres pensaban: ¿qué le diré a este bebé? ¿que fue el producto de un amor, que su padre murió como un héroe enfrentando al enemigo? ¿o le diré que es producto de una violación?Un libro que estremece."}, {"userName": "René", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/4638252-ren", "userReview": "Una guerra en la que según los cálculos \"más optimistas\" estiman que se violaron unas 40 mil mujeres. Hace unos días Rita Segato hablaba de cómo en los 80 en Guatemala las violaciones, vejaciones y humillaciones a las mujeres se hicieron de manera sistemática, al igual que posteriormente en los Balcanes. El libro de Slavenka Drakulic, una novela biográfica, expone esas formas de la guerra en las que estructuralmente hay que vejar a la mujer, para infligir más humillación al enemigo; la mujer es un objeto que hay que mancillar para que el enemigo se entere de que ha perdido la guerra. Como si yo no estuviera es una forma de entender esa sistematización de la violencia, los diferentes estados por los que pasan la mujeres. Y es que, dice S. \"la realidad elude las expresiones conocidas y no existen palabras nuevas que puedan definir esta experiencia, así de simple\"."}, {"userName": "Deanne", "userReviewDate": "Mar 17, 2012", "userURL": "http://www.goodreads.com/user/show/370475-deanne", "userReview": "Most books dealing with war seem to focus on life in the frontline, As if i am not there deals with what was happening to civillians in Bosnia and in particular to the muslims. The characters are referred to by letters, which makes them seem to stand for more than just any individual. People deal with what is happening to them in different ways, by pretending it's not them, or trying to seem invisible. It's harrowing and difficult to read, but it's also a book which ends with a glimmmer of hope."}, {"userName": "Chanell", "userReviewDate": "Nov 07, 2009", "userURL": "http://www.goodreads.com/user/show/369711-chanell", "userReview": "Terrifying yet enthralling! Amazingly well written account of war, torture, and rape in the Bosnian war. I remember studying this war in my history class sophomore year. As a sophomore I felt so detacted from the realities and emotional/physical accounts of war. As an American, I am still detacted. But this novel (for a moment) placed me at the forefront. I agree with my friend Alessandra - as a citizen of the world, you must read this book."}, {"userName": "Erma Odrach", "userReviewDate": "Jul 29, 2009", "userURL": "http://www.goodreads.com/user/show/1339678-erma-odrach", "userReview": "S. is about a Bosnian woman who finds herself in a prison during the Bosnian war of the early 1990's. She is repeatedly raped, dehumanized and starved. Drakulic paints a horrific picture and with great detail. It is a book not just about the suffering of female prisoners but also of how war can turn some men into animals. A very upsetting read, but necessary. Although this is a novel, I felt it would have faired much better in the non-fiction category."}, {"userName": "Sylvia", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/1603656-sylvia", "userReview": "Creo que esta es una de las novelas más fuertes que he leído en los últimos meses, y miren que he leído cosas duras. Es difícil leer más de dos capítulos de corrido. S y el resto de las mujeres en esta novela viven las más tormentosas experiencias en este campo, sitiadas por la guerra, por la violencia, por el poder del otro, estas mujeres buscan una sola cosa: sobrevivir y olvidar; pareciera que la muerte es en realidad la única forma de lograr esto."}, {"userName": "Julie", "userReviewDate": "Apr 13, 2009", "userURL": "http://www.goodreads.com/user/show/361674-julie", "userReview": "A dark, uncomfortable novel about a Bosnian Muslim woman taken to a camp where she is repeatedly raped by Serb soldiers. She becomes pregnant in the camps and must decide what to do with the child when she finally gives birth as a refugee in Sweden. As upsetting as it is to read, it is an important novel that gives insight into the mentality of people during times of war."}, {"userName": "Wendi", "userReviewDate": "Sep 19, 2010", "userURL": "http://www.goodreads.com/user/show/4128843-wendi", "userReview": "Truly haunting. The ugly picture of war. Painful to read at times. It was not a comfort remembering this book was fiction, as it came about from numerous interviews of women who lived through the Balkan experience-so somewhere it all could have happened or did happen or even worse."}], "description": "\"S. may very well be one of the strongest books about war you will ever read. . . .The writing is taut, precise, and masterful.\" Set in 1992, during the height of the Bosnian war, S. reveals one of the most horrifying aspects of any war: the rape and torture of civilian women by occupying forces. S. is the story of a Bosnian woman in exile who has just given birth to an unwanted child—one without a country, a name, a father, or a language. Its birth only reminds her of an even more grueling experience: being repeatedly raped by Serbian soldiers in the \"women's room\" of a prison camp. Through a series of flashbacks, S. relives the unspeakable crimes she has endured, and in telling her story—timely, strangely compelling, and ultimately about survival—depicts the darkest side of human nature during wartime.", "title": "S.", "url": "https://www.goodreads.com/book/show/278232.S_", "average": 4.18, "cover": "https://images.gr-assets.com/books/1490376751l/278232.jpg", "reviews": 148, "authors": [{"url": "https://www.goodreads.com/author/show/124613.Slavenka_Drakuli_", "name": "Slavenka Drakulić"}, {"url": "https://www.goodreads.com/author/show/3955549.Marko_Ivic", "name": "Marko Ivic"}], "type": ["Fiction", "Historical", "War"], "outlinks": ["http://www.goodreads.com/book/show/278232.S_", "http://www.goodreads.com/book/show/16038388-come-se-io-non-ci-fossi", "http://www.goodreads.com/book/show/278230.As_If_I_Am_Not_There", "http://www.goodreads.com/book/show/1611720.S_", "http://www.goodreads.com/book/show/22733414-kao-da-me-nema", "http://www.goodreads.com/book/show/12381336-como-se-eu-n-o-existisse", "http://www.goodreads.com/book/show/1835422.Como_si_yo_no_estuviera", "http://www.goodreads.com/book/show/6122923-s", "http://www.goodreads.com/book/show/278227.How_We_Survived_Communism_and_Even_Laughed", "http://www.goodreads.com/book/show/227541.Cafe_Europa", "http://www.goodreads.com/book/show/278229.They_Would_Never_Hurt_a_Fly", "http://www.goodreads.com/book/show/3988552-frida-s-bed", "http://www.goodreads.com/book/show/278231.The_Balkan_Express", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/26583370-life-and-other-near-death-experiences", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/20552595-how-i-became-a-famous-novelist", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/36004055-not-perfect"]}