{"ratings": 471, "userreviews": [{"userName": "Laurie Flynn", "userReviewDate": "May 19, 2015", "userURL": "http://www.goodreads.com/user/show/36678420-laurie-flynn", "userReview": "There’s a line I love from one of my favorite movies, Almost Famous: “They don’t even know what it is to be a fan. Y’Know? To truly love some silly little piece of music, or some band, so much that it hurts.” Music has a lot of powers. It soothes and it incites, motivates and empowers, empathizes and hurts, sometimes makes us feel that we’re less alone. For fans, music can be a companion, a friend, an escape. But does music have the power to save someone? That’s one of the themes in Jenny Manzer’s riveting debut, SAVE ME, KURT COBAIN. Nicola “Nico” Cavan, now fifteen, was abandoned by her mom when she was four years old. Her mother’s disappearance was never resolved, and when Nico finds some of her mom’s old CDs and a window is opened into her past, she wonders if there’s more to the story that nobody is telling her. On a ferry home from Seattle, Nico encounters a man she believes to be Kurt Cobain—a man who might be her real father. As a huge Nirvana fan, I have to say that this book was one of my most anticipated debuts of 2016. And I completely devoured it. I loved Nico’s voice—smart and intense, at times sad and wounded, at others snarky and sarcastic. I really liked the element of mystery in the plot and all of the relationships between the characters. But most of all, I gravitated to the fusing of real-life events—such as the Nirvana concert in Victoria in 1991—and fiction. Jenny Manzer has created such an intensely believable story wherein true facts about Nirvana and Kurt Cobain are interwoven beautifully with the events in the story. Many times, the details about Cobain are shared and placed so effectively that they made my heart hurt. This book kept me guessing up until the last page. Not only that, but there’s a line in the last chapter that made me tear up, and I’m not a book crier. There are only one or two other books that have ever brought tears to my eyes. Kurt Cobain’s fans loved his music so much it hurt. This book does him justice. It’s a song, a tribute, a brilliant piece of work. And for anyone who believes a song can change your life, put your headphones on and read this stunning debut."}, {"userName": "Ana ", "userReviewDate": "Nov 02, 2017", "userURL": "http://www.goodreads.com/user/show/13346584-ana", "userReview": "Ah, Kurt... Can you imagine his reaction to this book?    What if you discovered that Kurt Cobain is not only alive, but might be your real father?  Nah, I think I'm related to Eddie Vedder."}, {"userName": "Lynx", "userReviewDate": "Feb 13, 2016", "userURL": "http://www.goodreads.com/user/show/1654286-lynx", "userReview": "At four years old, Nico’s mother went missing. Over a decade has passed, and still all her questions remain unanswered. What was she like? What happened that day she left the house? Raised by her father, a man who keeps things close to the chest, Nico, with the help of her best friend Obe, relies on her trusted Ouija board for clues. Nico finally begins to get answers when she discovers a box of her mothers things in the attic. Turns out Nico’s passion for music, specifically early 90’s rock was something she inherited. Searching through the treasure trove of CDs, Nico comes across photographs of her mother at a Nirvana concert along with an unsent letter to Cobain himself. Is it possible her mother was more then just a fan?The Ouija board told her something big was going to happen while visiting her Aunt in Seattle. She just never imagined it would be spotting a man who looks exactly like Kurt Cobain on the ferry ride home. Could it be him? Does he have the answers she’s been searching for? Well, there’s only one way to find out….It seems I’m not the only one with 90’s nostalgia seeping through my veins. This is the 3rd novel I can think of in the last year which revolves around Cobain, or his persona (Leaving the Beach by Mary Rowen and Lynn Crosbie’s Where Did you Sleep Last Night) and I still never tire of it. Manzer packs in a lot of Nirvana related tidbits, sometimes repetitively so but heart and soul of this book is her lead character Nico and her journey to find answers while dealing with the grief and loneliness left by her mothers disappearance. Very moving and certainly worth a read.*Thank you Random House and Netgalley for this review copy."}, {"userName": "Robin Reul", "userReviewDate": "Jun 15, 2015", "userURL": "http://www.goodreads.com/user/show/4181512-robin-reul", "userReview": "I just finished reading an ARC of Jenny Manzer's debut SAVE ME, KURT COBAIN and OMG!! This book!! It should also come with a warning that you may not be able to get Nirvana songs out of your head for a good solid week after reading.First of all, let me start by saying she had me at the title. I love Nirvana, and the whole premise of the book sucked me in. I mean, hello, exploring the idea that Kurt Cobain may still be alive and possibly turn out to be the MC's father?? Jenny Manzer has a very fluid, engaging writing style that should hold wide appeal to teens. Each chapter is thoughtfully named after a Nirvana song. Even if you are not already a die-hard Nirvana fan, sit back and enjoy a crash course in the background of one of the most creative and intriguing artists to come out of the 90's music scene, interwoven with an imaginitive plot that puts in question his death, the main character's paternity, and a unique portrait of the ways we deal with loss. The author effectively leaves the reader guessing to the very last page, and I think this book will be a huge hit."}, {"userName": "S.M. Parker", "userReviewDate": "May 24, 2015", "userURL": "http://www.goodreads.com/user/show/8045003-s-m-parker", "userReview": "I was lucky enough to receive an ARC of Save Me, Kurt Cobain as part of The Sweet Sixteens ARC tour and devoured it quickly. You’ll want to get yourself a copy when this gem releases. It’s gold. The writing is beautiful. Fluid and commanding. The voice is so authentically teen but so crisp with poetic lovelies peppered throughout. Like what, you ask? How about this cool, slick number: “I could just slip into the ocean as if it were layers of cold black silk.” You do not have to be a Nirvana fan to enjoy this book. It will be an extra super secret cool read if you are a Nirvana fan, but not a prerequisite. Kurt Cobain fans will love this book. Fans of the 90s will love this book. People who love music and searching and promise will love this book. People who have been touched by grief and longing will love this book. Thank you, Kurt Cobain (and Jenny Manzer)"}, {"userName": "Kurt Dinan", "userReviewDate": "Aug 06, 2015", "userURL": "http://www.goodreads.com/user/show/166834-kurt-dinan", "userReview": "Manzer takes a big risk here, casting one of the most beloved pop culture / cult figures of the last 25 years as a central figure in her novel. Really, she's just asking for punishment from Kurt Cobain fanatics, of which there are plenty. Her gamble pays off though because the novel isn't about Kurt Cobain at all (okay, it is, sort of), but more the lengths we'll go to when dealing with great pain. In the novel, Nico creates a Nirvana-based explanation for her mother's disappearance year's earlier. This theory is not only conspiracy based, but heartbreaking as well. By the end of the novel, we're not hoping Nico's correct in her belief about Cobain, but that she finds relief for her suffering, It's a gutsy, creative, and amazing novel."}, {"userName": "Jeff Zentner", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/129306-jeff-zentner", "userReview": "This is a gorgeously executed exploration of the intersections between love, obsession, art, and loss. Nico is funny, vulnerable, sarcastic, and smart. She's the perfect YA narrator. I highly recommend this to lovers of excellent prose, vivid characterizations, and great music. This is definitely one of those YAs that would be as comfortable on the adult shelf as on the YA shelf."}, {"userName": "Ashley Blake", "userReviewDate": "Jun 28, 2015", "userURL": "http://www.goodreads.com/user/show/78935-ashley-blake", "userReview": "Beautiful story of healing and acceptance and how, sometimes, you have to get to both of those places in your own time and in your way."}, {"userName": "Amanda ", "userReviewDate": "Nov 25, 2015", "userURL": "http://www.goodreads.com/user/show/43671241-amanda", "userReview": "It was hard to decide whether I wanted to rate this 3 or 4 stars. I was so excited for this book. I preordered it, and I started reading it the day it came out. But I don't think it fully lived up to my expectations. The story was beautiful, yet tragic. Nico was forced to grow up most of her life without her mother. Her mother disappeared one day when she was 4 years old, and no trace of her had been seen or heard from since. This haunts Nico everyday of her life. She truly believed that her mother left because she didn't love her. Nico battles with her grief through the book with the help of her music. Her favorite obsession being Kurt Cobain. When she finds a box of her mother's old things in her attic, she finds out that not only did her and her mother enjoy the same music, but her mother may have been a bit more than just a fan of Kurt Cobain. I don't know. I love Nirvana. My favorite musician is Kurt Cobain. Naturally I scooped this book up. I annoyed everybody around me because I would not stop talking about this book in the last few days before it was released. But it wasn't entirely what I thought it was going to be. The Nirvana references throughout, and the chapter titles that were named after Nirvana songs, were perfect for a fan like me. Hence, thats why I think I decided on the 4 star rating. The overall plot was confusing to me though. This was a weird little story. Although it didn't entirely live up to my expectations, it was an enjoyable read overall."}, {"userName": "Kali Wallace", "userReviewDate": "Aug 01, 2015", "userURL": "http://www.goodreads.com/user/show/39236664-kali-wallace", "userReview": "Jenny Manzer's SAVE ME, KURT COBAIN is a lovely, sad book about a girl looking for answers and facing grief and learning about the mother she barely knew. It's also about music and how important it is to us, in so many different ways, and how the music that matters is part of the fabric of life. I feel like the book's description doesn't quite do it justice--although it's factually accurate--but I also don't know how I would improve it to really capture what the book is about. It's not the kind of story that lends itself to a two-paragraph summary. The main character Nico is lost and sad and struggling, even though she thinks she's getting by in life, and her evolution through grief and hope and loss and healing is incredibly touching. The book is so much more mournful and thoughtful and emotionally complex than I expected from the description and subject, and so stunningly atmospheric and steeped in its Pacific Northwest setting, and the writing is beautiful. Definitely worth a read, just make sure you've got Nirvana's discography dialed up and ready to go, because every page is going to put a musical craving in your head."}, {"userName": "Melissa Gorzelanczyk", "userReviewDate": "Dec 06, 2015", "userURL": "http://www.goodreads.com/user/show/5285139-melissa-gorzelanczyk", "userReview": "Where do I begin with Manzer's lush, enviable writing style? The mood of this novel permeated every page. It was a little sad and a little dark and a little hopeful. Just look at the cover and you'll find all of those things. Reading it felt like sitting down to a tasting. Something special, but like I mentioned above, also sad/dark/hopeful. There are so many quotable lines in this novel! You'll want to savor them. You'll want Jenny Manzer to write a hundred more books.  You'll want to blare Nirvana and research everything there is to know about Kurt Cobain and his art.A striking debut worth savoring a second time.I received an ARC of this book in exchange for an honest review."}, {"userName": "Nandini", "userReviewDate": "Jan 04, 2016", "userURL": "http://www.goodreads.com/user/show/23885269-nandini", "userReview": "DID SOMEONE JUST SAY KURT COBAIN?WHOOPS, THERE IT GOES IN MY TBR."}, {"userName": "Milena", "userReviewDate": "Mar 02, 2018", "userURL": "http://www.goodreads.com/user/show/47498686-milena", "userReview": "2.5 ★"}, {"userName": "Brian", "userReviewDate": "Jan 10, 2016", "userURL": "http://www.goodreads.com/user/show/854699-brian", "userReview": "I debate between giving this one and two stars. In this novel, a young girl named Nicola (Nico) is obsessed (and I can't use that word strongly enough) with both Nirvana and finding her mother. Nico likes to use her Ouija board, listen to grunge music despite it being 2006, and enjoys hanging out with her best friend Obe who may or may not be gay. She lives with her father, the meek and hard working Verne, who she has little respect for. Nico pines away for her mother, the lovely Annabelle who left abruptly when she was a child but promised she would one day return. But she didn't! Annabelle goes to visit her aunt and while on the ferry, she listens to her mom's old Nirvana CD and discovers not one, but two poloraids that have her mother at the concert, as well as a note from Kurt Cobain himself. Nico is convinced that Kurt MUST be her father and after visiting her aunt, she decides to follow a guy who resembles Kurt Cobain despite him being dead by hitchhiking in his car by hiding in the backseat and ends up in a remote cabin in the woods and gets snowed in. What follows is a very bizarre plot that seems to forget some of the side characters that had been focused on, only to bring them back on the fringe. I hope that this book gets a better editing job. It is mentioned not once, not twice but three times that the Nirvana song \"Sliver\" is about a boy who just wants to go home to his mother. There are a few other things repeated in this book as well, which got to be a bit annoying. There were several moments where I felt my heart rate go up because I was getting angry at this book. I felt that the book was almost half novel, half biography of Kurt Cobain. I think the author had decided to include these facts because kids of today may not know who Kurt is, but I'm not sure if a music history lesson should cover so much of what should be a novel. The ending was not satisfying, and at times, I questioned the mental sanity of our main character, but all in all this was a train wreck of a novel, but an enjoyable one at that."}, {"userName": "Morris", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/32911939-morris", "userReview": "“Save Me, Kurt Cobain” is not a book meant to be read by everyone (which is in no way a bad thing), but for those it is meant for, you will enjoy it immensely.At its heart, it is the coming-of-age story of Nico Cavan, a girl who has been lost in the world since the age of four. She is an extremely well-developed character who evokes both sympathy and, at times, rage. Believe me, sometimes the reader will truly want to shake her and ask what the heck she is doing. The auxiliary characters are developed to the perfect point of being both mysterious and understood. In other words, you see them as Nico sees them.The book is also a love story to music. While Nirvana is the central band, as is obvious from the title, there are many other good ones mentioned. I really hope some of the younger readers will give them a try. I grew up in the Kurt Cobain era, and the facts and stories about him brought an intense wave of nostalgia. Though I do have to admit I felt ancient when they were classified as oldies that parents listen to. Many of the facts presented I had never heard, and I found that to add quite a bit of enjoyment to my reading experience.My only complaint is that the beginning of the book seems to drag somewhat. All of it is important to where the story goes, so please remember that if you are tempted to stop reading. It is totally worth it.“Save Me, Kurt Cobain” will appeal to all of the audiophiles, artists, “freaks”, and the lost. It’s perfect for both young adults and adults.This review is based upon a complimentary copy provided by the publisher in exchange for an honest review."}, {"userName": "Wendy MacKnight", "userReviewDate": "Jan 19, 2016", "userURL": "http://www.goodreads.com/user/show/21824552-wendy-macknight", "userReview": "My confession: I know little to nothing about Nirvana, so I went into this book without any expectations or preconceptions about Kurt Cobain. I knew one Nirvana song. I didn't dislike Nirvana, but the whole grunge thing arrived when I was having kids. It was all I could do to keep up with REM and U2. But I didn't need to know anything, because Jenny Manzer's clear and compelling story catches me from page one and tells my everything I need to know along the way. Haunted by the disappearance of her mother ten years ago, Nicola Cavan has been living a kind of half-life with with her father Verne in Victoria, B.C. She has exactly one friend, Obe, and the only delight she finds in life is through her music, especially the music of Nirvana. And when a chance discovery leaves her with the impression that Kurt Cobain might actually be her biological father, Nico sets off on a journey of self-discovery that could get her the answers she wants - but at what cost?The writing of this book is evocative and gorgeous. Manzer's imagery is gorgeous. \"When Kurt Cobain played his guitar he looked weightless, like a blond marionette.\"There are so many surprises and twists and heart wrenches throughout this book, but throughout, you have the sense you are with a master storyteller. I can't wait for Jenny's next book!"}, {"userName": "mindy", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/24969213-mindy", "userReview": "Okay. this book took me 2 months to finish because it was SO BORING. It was a Kurt Cobain biography with a boring sub plot about a *really sad* and *super anti society* teenager. Seriously, she was like, SO not into anything but grunge music, and like, she totally wore flannel even though it was not in style. I THOUGHT this book was about a girl who talked to Kurt Cobain through a Ouija board and then finds love and herself and whatever.This book is ACTUALLY about a girl who makes terrible life choices. She follows a strange man to his cabin because she thinks he's Kurt Cobain. she's also convinced that Kurt Cobain is her dad. because her mom, who is now missing, went to a Nirvana concert in 1991. Yup. I think the reason I didn't enjoy it is because it is just so boring. there is so much information on Kurt Cobain, and I don't really care. it doesn't add anything to the story so why add it? The main character, Nico, doesn't really have a personality. she's just a talking Kurt Cobain biography who has a mother thay vanished.PLUS SHE'S MEAN TO HER DAD (Not Kurt Cobain) AND HER DAD, VERNE, IS TRYING REALLY HARD. There is an entire scene of her being mean to her dad for literally no reason. she's just a brat.should have taken Kurt's advice:Don't read, you'll judge"}, {"userName": "Laura.125Pages", "userReviewDate": "Mar 06, 2016", "userURL": "http://www.goodreads.com/user/show/35597285-laura-125pages", "userReview": "This review was originally posted on [www.125pages.com]\n When Nevermind released in 1991 I was in 8th grade. I remember seeing the cover of the cassette tape with the swimming baby and being intrigued. The album opened my 13-year-old mind to new ideas and sounds. I remember the \"cool\" P.E. teacher letting us play the tape on Friday Free Days. Nirvana and by association, Kurt Cobain, helped shape my musical taste for years to come. So when I saw the title of this book, Save Me, Kurt Cobain, I knew I had to read it. Nico has been motherless since she was 4-years-old, when her mother walked out one day and never came back. Now, at 15, Nico is trying to understand why, and who her mother really was. She finds a box that leads her on a path. A path to a slight man with blue eyes, who may just be the key to everything.Jenny Manzer has an interesting writing style. Less focused on outside details and more centered on emotions, this was just my type of book. As you know I hate to be bogged down in details, and Save Me, Kurt Cobain had enough to keep it moving but not too many to drag it down. The feelings jumped off of the page and helped bolster the characters who, at times, were self-centered and short sighted. The pacing kept a nice clip and I loved how the last part unfolded so seamlessly. And the world Manzer created was just perfect. I could remember how I felt listening to that music for the first time, and she tapped into that and crafted a very real experience.I am unsure exactly why this is listed under Thrillers & Suspense, as this was a coming of age story full of feels, not a tense read. But aside from that small quibble, I really enjoyed Save Me, Kurt Cobain. It brought back memories of a time of intense growth in my life. I know this is marketed to teens, but I believe a large contingent of 90's kids will enjoy reading this. Save Me, Kurt Cobain is a quirky read with a lot of heart and Manzer has a great deal of talent. I highly recommend this read and will be sure to read Jenny Manzer's next book. Favorite lines - I thought this: I could not take one more. I had been waiting for something, someone, to help me, and no one had. I was done. A yellow school bus soars off an icy road; divers search a lake for bodies; legs are crushed; a brain is dead. Sometimes the worst has happened. Sometimes done is done. Biggest cliché - You have loved and cared for me my whole life, so I must treat you like crap. Have you read Save Me, Kurt Cobain, or added it to your TBR?"}, {"userName": "Shawna", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/5016701-shawna", "userReview": "So as I gathered my thoughts together to review this book, I found myself wondering how many young adults today actually know who Kurt Cobain is. And I wondered if NOT knowing about him would diminish the quality of this book for them at all. In all honesty, probably. But that wasn't a problem for me because I'm old. Not really but still. Nico has always felt like a lost soul. I guess having your mother disappear when you're a young child will do that to you. Her greatest connection to her mom is their shared love of music. And when she discovers, accidentally, that her mom loved Nirvana and Kurt Cobain as much as she does, her imagination gets the best of her. Somehow she decides that Kurt Cobain is actually her father. And even better, she decides that he's actually still alive. Thus begins her journey to find him and solve the mystery of what actually happened to her mother. This was an excellent debut novel. Heartbreaking to imagining what young Nico must be feeling, but endearing at the same time. A great story!"}, {"userName": "Sonya Mukherjee", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/4572541-sonya-mukherjee", "userReview": "In Save Me, Kurt Cobain, Jenny Manzer says of Kurt Cobain, \"His voice could be harsh, or growling, or soft and sweet, or he could scream like a wounded crow.\" In a somewhat similar way, I found this book to encompass a wonderful mix of moods and tones, whose contradictions worked beautifully together. This book is full of very real sadness, and sometimes despair; yet it also has many funny and delightful moments, and a sense of fun mixed right through it. The narrative voice is unique, and that adds a quirkiness that helps those moods come together, I think. This book (which I was lucky enough to read in a borrowed advance copy) also made me feel compelled to listen to a great deal of Nirvana, which was a nice bonus."}, {"userName": "royaevereads", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/47333024-royaevereads", "userReview": "I wanted to like this, I really did. But it just wasn't good. The story didn't feel like a story, there was too much info dumping. I didn't understand the character's motivation - the story circulated around her mother's disappearance that happened when she was four years old, alllllll of her personality was based around this one event, like she wasn't a person at all. This made her unrelatable and unrealistic. It was also not really written as a YA, Nico seemed too childish which to me is a sign of the author being out of touch with youth. And the Nirvana/Kurt Cobain references - Nico was depicted as a huge Cobain fan. Fair enough. But the constant references to Cobain/Nirvana, attempts to relate Nico's state of being to Cobain's, was absolutely tiresome. I was expecting the references to be more subtle and that would've been a lot better. For a Nirvana/Cobain fan, having sometimes up to two and a half whole pages of facts about them spewed out at me at a time was not helpful or interesting and did not add anything to the story. It was actually irritating and kind of infuriating. For someone who is not a fan I can imagine it would just be incredibly boring. Wish I had something good to say but nope. Just nope."}, {"userName": "Saania Zee Jamal ϟ", "userReviewDate": "Nov 28, 2015", "userURL": "http://www.goodreads.com/user/show/10376232-saania-zee-jamal", "userReview": "The title had me curious, the blurb has me confused but consider me captivated."}, {"userName": "Julie", "userReviewDate": "Apr 30, 2016", "userURL": "http://www.goodreads.com/user/show/30472130-julie", "userReview": "*Warning if you don't want to see me bash this book please avert your eyes and don't read this review*This is probably THE WORST book I have ever read. It was absolutely awful. The writing did not flow at all. It would go off on so many tangents and just spout off all this unnecessary information that didn't add anything to the book and on top of that it was extremely repetitive and just plain BORING. Nico would go on and on and on about how she wanted to be an artist and how poor she was and how \"sliver\" was her fave nirvana song and how totally uncool she was because of her \"retro\"/\"grunge\" style and her totally outdated flannels and her \"retro\" music tastes. (OMG Nico it's 2006 not 1991 you're sooo uncool!!!) She thought every random stranger that glanced her way was judging her. Like come on get over yourself. Obe and Sean were totally unnecessary to the entire story line I don't know why Manzer even bothered to include them. Nico was certifiably insane and also just really fucking stupid. Like this girl was DUMBBBB. She made so many terrible decisions and she was an absolute brat. All she did was list off nirvana facts that didn't add anything to the story and random facts about her mom. She was an absolute bitch to her father and called him Verne because she didn't believe he was her real father. Even though, he literally gave up everything for her and was struggling to give her the best that he could. She used a Ouija board to ask really boring/stupid questions (c'mon girl dead people do NOT care about your personal problems) and basically the only reason she thought Kurt Cobain was her dad was because her mom went to a nirvana concert once. Then she sees some random blue eyed blonde guy and automatically assumed he was Kurt Cobain without any other evidence.Basically none of the theories that were talked about in the blurb had anything to back them up and it just made the story worse. The ending was extremely anticlimactic and convenient. Pushing myself to finsih this book was an absolute struggle. It was so painful to read. This honestly read like really terrible fanfiction except without any of the weird sex scenes. I don't understand why so many people rated it 5 stars cause I honestly don't see it at all. This book had no redeeming qualities. It just made me so angry and annoyed the entire time. I wasted 5 days of my life on this garbage that I'm never getting back. #OMGWeHoldOurPencilsTheSameWayHe'sTotallyMyRealDad #HeJustOfferedMeMac&CheeseThat'sDefinitelyKurtCobain"}, {"userName": "Jennie", "userReviewDate": "Feb 23, 2016", "userURL": "http://www.goodreads.com/user/show/126518-jennie", "userReview": "I read this in one sitting. It was impossible to put down, especially when you're trying to figure out whether (in the book's world) Kurt Cobain is still alive (I'd love to believe that myself), oh, and is he our main character's real father?It's not just a gimmick. Nico, our protagonist, is searching for answers: what happened to her mother? What was her mother like? Why did she disappear? If this book just focused on Kurt Cobain, it wouldn't work. Nico's obsessed with him and Nirvana (because her missing mother was obsessed with Kurt and Nirvana), but more than that, she wants to know who she is and where she belongs. Struggling with a star rating on this one (I really liked 85% of it, 15% didn't work for me), but overall, I'd say to read it. Especially if you were a musical misfit who spent your adolescence collecting facts about your favorite rock star while you were drowning in the music. *sigh*Full review at Forever Young Adult: http://foreveryoungadult.com/2016/03/..."}, {"userName": "Kathleen Glasgow", "userReviewDate": "Apr 10, 2015", "userURL": "http://www.goodreads.com/user/show/169442-kathleen-glasgow", "userReview": "This book was such a pleasure to read. Manzer's crafted a completely engaging YA debut that I can't recommend highly enough, even for adults (if you were there for Nirvana, this book is going to hit all your emotional hot spots). Nico is a complicated, interesting, vulnerable girl on the prowl for her missing mother and the man she thinks may be her real father (could it be Kurt Cobain?). What I liked most about this book is its sub-plot: how well do ever really know our parents? To us, they are one thing, but before they had us, they were completely different people, with different lives, dreams, mistakes, and messes. It's an intriguing, and painful, premise--one that Manzer handles deftly. Nico isn't perfect, her relationship with her dad is nuanced and complicated, and I flat-out loved her. This is a book that will reward re-reading. Looking forward to Manzer's next book."}, {"userName": "Stephanie Elliot", "userReviewDate": "Jan 30, 2016", "userURL": "http://www.goodreads.com/user/show/4007858-stephanie-elliot", "userReview": "You don't have to be a Nirvana fan to love SAVE ME, KURT COBAIN! With Nico as the main character, you're immediately drawn into her world and her life. She's a little bit of a lost soul, having a mother who deserted her at the age of 4, and she doesn't have a strong relationship with her dad. When she finds some old music of her mom's, it sets the stage for a journey she never thought she'd be on. This is a book that when I finished it, I had a few unanswered questions, but I enjoyed it so much and the heart of the story is discovering who your family is, who always has your back, and who loves you. A great YA read!!"}, {"userName": "Anush", "userReviewDate": "Feb 20, 2016", "userURL": "http://www.goodreads.com/user/show/2163209-anush", "userReview": "So I am stopping this at the 50% mark, right at the point where the main character follows a random middle aged man into his house and tries to convince him that he's Kurt Cobain. I guess it says right in the synopsis that the story is about the main character discovering that Kurt Cobain is alive and might be her father, but exactly half of the book was normal realistic fiction. And then I suppose you discover she is batshit crazy?"}, {"userName": "Tina ( As Told By Tina )", "userReviewDate": "Feb 19, 2016", "userURL": "http://www.goodreads.com/user/show/2988968-tina-as-told-by-tina", "userReview": "When I saw the bookings for Irish Banana tours and saw the title for this, I immediately wanted to read this. I need to read this. I wanted to read this because of Kurt Cobain. I became obsessed with Kurt Cobain after watching Montage of Heck a thousand times during the summer. When I was approved for the tour, I immediately jumped for joy and I couldn’t wait to dive it. I had some high expectations for this, but did the book live up to them? I was worried that Kurt Cobain/Nirvana wouldn’t really be present throughout the story. I thought Manzer might mention them here and there but not really have the story revolve around them. That was actually not the case; the chapters were titled after Nirvana songs and some of my favorites (Where did you sleep last night, Smells like teen spirit and Come Here). I loved how Manzer used facts about Kurt Cobain/ Nirvana and having them connect with the story. They weren’t out of place and worked well with the story. Save Me, Kurt Cobain is about Nico Caven whose mother disappeared when she was four years old without a trace. It is something that Nico has always wonder about and always wanted answers, you really can’t blame the girl. I’d want answers to. She’s a bit of a social outcast most of them at her own hand, she isolates herself and doesn’t really try to make an effort to know anyone outside of her friend Obe and her father Verne and aunt Gillian. She’s also into the grunge scene, which many will tell you died the day Cobain died. She is completely fascinated with Cobain (I mean so am I). I felt sorry for her, I understood her at times but other times I believed she had a mental breakdown. About halfway through the book I really wanted to shake her and ask her what was she thinking. The synopsis pretty much gives the story away although it does not happen until more than half way through the book. I felt like the story was pretty steady up until that point and after we got past the halfway mark it really took off and I could not put the book down. I was invested and I NEEDED TO KNOW WHAT HAPPENED. The writing had me hooked from the beginning, as I mentioned I liked how Manzer included Kurt Cobain/Nirvana facts and they felt well placed through the story. It really brought the story full circle and I liked how not only were Kurt Cobain/Nirvana included in the story but how it was connected back to Nico. It all made sense and I really liked that. None of it felt disjointed. Although the first part of the story was a bit dull, the second half really brings it home and when Manzer tied up every lose end I especially liked that. \nTo Sum It Up:\n I had really high expectations for Save Me, Kurt Cobain and at first I wasn’t sure that they were going to be met during the first half of the story but at the end of the story I can say they were met. I enjoyed this, I learned a little bit more about Kurt through the story and I added the books mentioned to my TBR and added their entire music to my Apple Music so I can jam out to. If you are a Nirvana/Kurt Cobain fan you may just enjoy this.  Do you listen/listened to Nirvana? What is your favorite song?  My absolute favorite was Where did you sleep last night. I don’t know what it is about that song but Kurt’s voice is just so beautiful in that song.  Disclosure: I received a copy from the author/publisher, in exchange for an honest review. This does not influence my review in any shape or form. Original Review Posted at Tina The Bookworm"}, {"userName": "ExLibris_Kate", "userReviewDate": "Oct 05, 2015", "userURL": "http://www.goodreads.com/user/show/5477262-exlibris-kate", "userReview": "What drew me to this story, initially, was a sense of nostalgia. I was in high school and early college during grunge’s heyday and I was excited to read about a teen in 2016 who loves this music. Each chapter is named after a Nirvana song and the main character, Nico, finds comfort in the music that her mother loved. Nico’s mom disappeared when Nico was four, and even though her father rarely speaks of her, her mother’s presence weighs heavily on Nico every day. As a result of a growing desperation and sense that there must be more to her story, she follows someone she thinks might have answers and embarks on a bizarre and cathartic quest to find out why; why her mother left her and why she can’t seem to let go. I loved the way her mom’s music gave her courage and was a security blanket, in many ways. It was a touchstone that resonated throughout the story. Her life in Victoria pretty much consists of flying under the radar as much as possible. She lives a small life, without really thinking abut whether college is really a possibility or if she can ever leave her home town. Slowly, though, her drive to find answers and what seems to be a longing for a better sense of who she is, starts to shape her character into someone new. I loved that transformation. The way Nico changes really made the book something special to read.I also loved the unexpected turns that Save Me, Kurt Cobain took. It was part emotional journey, part mystery and they were balanced so deftly that I was enchanted from beginning to end. The truth about Kurt Cobain, both real and in Nico’s mind, also resonated with her sadness about her mother and her inability to move on. In a way, his life was a sort of treasure map to Nico, and the way facts about Cobain’s life were woven into the story really made him feel like a character, as well. Save Me, Kurt Cobain was a fabulous story. I went in thinking I would be amused by the references, but found myself 100% invested in Nico’s questions and their answers. I am so excited to read more from this author!"}, {"userName": "Brooks Benjamin", "userReviewDate": "Nov 17, 2015", "userURL": "http://www.goodreads.com/user/show/13086075-brooks-benjamin", "userReview": "I received an ARC of this book in exchange for an honest review.Okay, this book whupped me. I cracked open the cover expecting a fun, quick read, but this was so much more. SO. MUCH. MORE. In honor of this story, I decided to list the top five reasons I loved this book, using carefully selected Nirvana tracks as my lead-ins.Here they are:1) \"Talk to Me\"The descriptions in this book floored me. They're fantastic. Poetic. Delicious. We live in the world Nico's in, yet Jenny drenches it in such gorgeous language that we want to take no line for granted. We want to read every single word.2) \"Plateau\"Sure, this story is a contemporary YA. But there are some moments that had me on the edge of my seat. There are edges of mystery and thriller inside this tale and it gives it just the right amount of suspense.3) \"Love Buzz\"I'm a sucker for any story where the main character is trying to reconnect with a parent. And this book has that in spades. Take that and slide it against the backdrop of the story of Kurt Cobain and I'm in it for the long haul.4) \"Lounge Act\"As serious as this story tends to be, as lyrical as the writing is, Save Me, Kurt Cobain is not without humor. Nico's and Obe's (her best friend) voice is delightfully witty and their conversations had me rolling at times.5) \"Drain You\"This was one of the most utterly satisfying stories I've read in a long time. It never even hinted that it was going to be one that dropped the curtains at the end with everyone in a gigantic group hug a la Disney, but its denouement was pure brilliance.So there ya go. Descriptions, suspense, relationships, humor, all leading up to an ending that doesn't need a gigantic bow to tie it up. Like I said, this book whupped me. But in the very best way possible. I honestly can't figure out who I wouldn't recommend it to. So do yourself a favor and pick this one up. Read it. Love it. And prepare to be whupped by it."}], "description": "What if you discovered that Kurt Cobain is not only alive, but might be your real father?Nico Cavan has been adrift since her mother vanished when she was four—maternal abandonment isn't exactly something you can just get over. Staying invisible at school is how she copes—that and listening to alt music and summoning spirits on the Ouija board with her best friend and co-conspirator in sarcasm, Obe. But when a chance discovery opens a window onto her mom's wild past, it sparks an idea in her brain that takes hold and won't let go. On a ferry departing Seattle, Nico encounters a slight blond guy with piercing blue eyes wearing a hooded jacket. Something in her heart tells her that this feeling she has might actually be the truth, so she follows him to a remote cabin in the Pacific Northwest. When she is stranded there by a winter storm, fear and darkness collide, and the only one who can save Nico might just be herself.", "title": "Save Me, Kurt Cobain", "url": "http://www.goodreads.com/book/show/22055480-save-me-kurt-cobain", "average": 3.49, "cover": "https://images.gr-assets.com/books/1430193409l/22055480.jpg", "reviews": 144, "authors": [{"url": "https://www.goodreads.com/author/show/8192745.Jenny_Manzer", "name": "Jenny Manzer"}], "type": ["Young Adult", "Contemporary", "Music", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/22055480-save-me-kurt-cobain", "http://www.goodreads.com/book/show/25739104-save-me-kurt-cobain", "http://www.goodreads.com/book/show/38507257-my-life-as-a-diamond", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies"]}