{"ratings": 14884, "userreviews": [{"userName": "Steph Sinclair", "userReviewDate": "Oct 16, 2013", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "[Also, she just happens to have sex and get pregnant from her first time. >_> (hide spoiler)]"}, {"userName": "C.G. Drews", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "This is definitely a diverse book. And for that, I should throw confetti, right? Well, I'll throw half a handful of confetti. Because I need to talk to you peoples about it first. I am literally at a loss right now.It's a beautiful book, don't get me wrong! I'm just not completely happy with how it dealt with a lot of topics. And before I say anything else: trust me, the author definitely knows more on these subjects than I do. I am just...a blogger. Plus I stalked researched the author, and she works with children with special needs and also has a child with autism. So she knows!We have two narrators. Amy has cerebral palsy and can't talk or walk properly. Matthew has Obsessive Compulsive Disorder. I think the tendency here is to say \"Amy is disabled and Matthew has issues.\" And I feel that's unfair. Now the book didn't send this message...well, it did and it didn't. This is why I'm upset! I feel like the book spent the whole time saying one thing (one thing I hated) and then in the last 25 pages it turned that around! So yay for turning it around...but, I spent most of the book angry and frustrated. That's not fun. And I wasn't 100% sure the book would end well. I wasn't even sure what message the author wanted to send. Having OCD is a very life-altering thing. It's basically anxiety. I was frustrated at how Amy was pushing Matthew and pushing and pushing...not to make him a better person, but to make him notice and want her. She loved him from day dot! But she felt the need to \"change\" and \"train\" him into being a person who could love her back. (Because he wasn't capable of it now???)They both had issues. But I felt the whole time the book said \"Amy has cerebral palsy and she can't help that.\" But Matthew had to move on from his ASAP, please, just hurry up already.That bothers me, okay?Mental illness is just as serious as physical illness. The book did cover this...but I almost felt it was too late. It was too late for me to love the book. After what it spent 250-pages saying, I couldn't negate that for a switch in tune.I have no idea what the author wanted to say in this book. I have no idea how individual people will react to it. I'm just one person! But it seriously chewed at me. I felt really angry at Amy all the time because I didn't feel like she understood anxiety. The world was rolling her way because people understood her illness. No one understood Matthew's. Maybe that's what the author was trying to say? The writing felt slow and thick to me. I like crispy writing. This seriously dragged, especially toward the end. And unfortunately I didn't ship Amy and Matthew. Maybe they just weren't mature enough for each other at first. But I felt Amy was really self-obsessed actually. Their relationship was filled with unsaid affections which then turned each other away and all in all was very sad. Dang, I almost need a tissue. So what did I love? Oh, I'm glad you asked. - I love that this is a book about older teens. - I love that it talks about deeper subjects like medication, parents, futures, college, sex, and unhealthy friendships. - I love that it explored how well-meaning-parents can be too controlling (but they still love you).- And how depressed parents do still love you and mean well (even if they can't show it). - I love the beauty of the quotes. - And how the characters grew. - I love the cover! Even though I won an ARC and therefore don't have it as a beautiful cover... 'scuse me while I sniffle.- I love that it's about real-life-messed-up-people.- I love this quote:It was about acceptance, he thought. About realising no one is perfect and no one can expect to change someone else.I have a mixed relationship with this book, obviously! I love it enough to give it 4-stars, but it really made me sad...right up until the last 10 pages. That is TOO long for me to be misunderstanding the book's direction. That could be my fault, of course. I'd loooove to hear your thoughts if you've read it!"}, {"userName": "Whitney Atkinson", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "I was skeptical going into this book because I know absolutely nothing about cerebral palsy (and eventually I did some research in the middle of this book), so I had no clue what to expect-- if this book was about friendship, or something extra. I think it definitely proves a great point that nonverbal people can still be intelligent and witty, and as someone who's never read a book about anyone with CP before, I appreciate that this story exists. But on the other hand, I think Matthew's OCD was done less cleanly. It's a huge task to write about two characters that both have very real disorders that are easy to trivialize or romanticize in YA fiction. Whereas I think the CP and OCD was well-written, I didn't appreciate how Amy had this idea that she could help fix Matthew. I didn't like the little \"tests\" she gave him to get over his OCD. I think books about mental illness really need to start stressing going to therapists and getting help instead of trying to get your friend/love interest to fix you. Otherwise, I was pleasantly surprised that this book wasn't as cliche as I thought it would be. It took some turns I wasn't anticipating, and they were events that really made me think and question myself. In the end, I didn't really feel enough connection between the two characters that I would have liked to see. This book was great to read because I got to be put into new experiences I'd never considered before, but also made me question if a friendship like this one would actually happen in the real world, or if it was just overly-romanticized for the sake of YA fiction."}, {"userName": "Aj the Ravenous Reader", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "[ overall, I think this is a surprisingly good book that offers YA readers a powerful message. I definitely recommend it.  (hide spoiler)]"}, {"userName": "Giselle", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/4800103-giselle", "userReview": "Say What You Will is a moving story about two people facing incredible challenges that fall in love and find hope in each other. It's sweet and wonderful, but also sad and frustrating at times. 3rd person is always hard for me to connect to characters in a book, and this is where my inability to love this one stems from. I also found it a tad long which is probably related to the latter. But it's a book I'm glad I read; the raw honesty of these people's harsh lives ended up being both eye opening and inspiring.Told in dual POV, we have Amy who has cerebral palsy, she needs the help of a walker to get around, and she can only speak using a computerized voice box. She's also extremely intelligent and highly aware of how people see her, not to mention very lonely. I found her characters highly compelling. I enjoyed how brutally honest she was with herself, and how she was bold enough to try and connect with people who simply did not get her. Not everyone would have her high spirits in her situation, and especially not her guts. She even had an amusing sense of humour that made me chuckle with regularity. Then we have Matthew who I didn't click with as much as I did her. I found him a bit frustrating, to be honest, even offensive at times. It's like he didn't even want to try and kept living in the past. I did find it interesting to look into the perspective of someone with OCD, but I simply didn't find him to be a very likeable character. He does go through a great deal of character growth by the end, however, which helped. Together is where they shine. They help each other overcome their fears and end up connecting in a way neither of them expected. This made for a sweet romance that is both cute and believable. I appreciated the true depiction of a first-love romance. It's filled with anxiety, confusion and insecurities, but also with excitement, anticipation, and forgiveness. There's a twist in the story that's heartbreaking, but gives the book that much more depth. I liked how realistically and delicately that was handled, as well. If only the book wasn't written in 3rd person, I would have felt much closer to the characters. As it lay, I was kept at a distance due to the narrative choice. My emotional attachment was not as strong as it could have been. I understood that it was a beautiful, heartbreaking journey, I understood the importance in the book's message, but I didn't exactly feel it, if you know what I mean. Similarly, the characters' personalities were not as well defined as they could have been - especially the supporting cast - and I didn't feel I got to really know them. Still, the power of this novel lays in its message of being the absolute best you can be, no matter how people see you, and no matter the hand life dealt you. Also, be kind to those who look different on the outside, because on the inside they're just the same as you!--An advance copy was provided by the publisher for review.For more of my reviews, visit my blog at Xpresso Reads"}, {"userName": "Blythe", "userReviewDate": "Jan 06, 2014", "userURL": "http://www.goodreads.com/user/show/5206717-blythe", "userReview": "Actual rating is 4.5 stars.In my experience, it’s a rare thing to find to find a novel that portrays physical disabilities and mental disorders as brilliantly as Say What You Will does. Nearly everything about Say What You Will is difficult to come across, with its searing emotion, sparkling wit, and beautiful writing; and I loved it all. Usually, a novel dealing with disorders or disabilities of some kind ends up feeling emotionally manipulative, but thankfully this is not the case with Say What You Will. Cammie McGovern is talented enough of a writer to not have to rely on cheap gimmicks to make her readers feel what she wants them to; a truly effective and emotional reading experience calls for strongly built characters and believably built relationships, and that is exactly what Cammie McGovern accomplishes with Say What You Will, and then some.Say What You Will is told from two alternating perspectives: that of Amy, a girl with cerebral palsy whose mother has assigned her peer helpers to guide her through her senior year of high school; and that of Matthew, a peer helper chosen to aid Amy, who suffers from an at times crippling case of OCD. As the novel progresses, as does their relationship, and what starts out as a friendship eventually turns into a relationship as realistic and sensitive as it gets. McGovern’s characterization is fantastic, especially with Amy, who I think will probably be at least in my top five favorite characters of 2014 by the end of the year. Her character arc is extremely impacting, and shows an amazing and poignant depiction of loneliness and depression unlike anything I’ve read before, and the same goes for the male lead, Matthew. Although I was less fond of Matthew than I was Amy, he is still a great and well-rounded character. His disorder—OCD, which I find is often portrayed irreverently—is written honestly and packs quite a few punches; it’s not pretty, but mental disorders rarely (if ever) are, and McGovern embraces that in her writing and characters. I can’t possibly put to words how much I ended up caring for both of these characters and their relationship, and despite the minimal “romance” in the relationship, I found myself swooning and cheering for its developments. Amy’s wit, unapologetic bluntness and her adorableness versus Matthew’s guardedness made for an interesting dynamic for their relationship, and I loved seeing Matthew’s character unfold as he got more comfortable with Amy, and her with him; it’s an extremely realistic and touching relationship, and in the end neither of the characters is defined solely by his or her disability, which I really appreciated. There are a lot of emotional twists thrown at us towards the latter half of the novel, but none of them manage to feel contrived for me. Every single one of the emotions I had felt while reading Say What You Will were authentic: when I cried, it didn’t feel like when you cry at a Nicholas Sparks book. I didn’t feel like I had been taken advantage of by a cheap ploy, even when in the cases of other authors and novels the exact same situation would be just that. Cammie McGovern gets you so involved in her characters’ lives such that when something had gone even slightly awry, it was as if I were right there feeling those emotions with the characters, and I cared so much about it all. The one thing keeping me from giving this the five stars I so want to give it is that Matthew is, at times, a bit harsh. His behavior in these instances are written off as side effects of his disorder, which I understand and again, appreciate in regards to the grittiness of how a disorder like OCD can shape aspects of one's personality, but his slut shaming was a bit too much for me at times. He’s a very good character, and one I do find likable overall, but the unfortunate (and entirely unnecessary) bits of slut shaming and other emotional manipulation from him were a bit much at times, and took away from his character in the long run. Plus all of it was directed at Amy, whom I've established earlier I have a bit of a bias for. At times heartbreaking and other times delightful, Say What You Will is pure emotion taking the form of an exceptionally well-written novel. With amazing writing, lifelike characters, and humor and characters that will appeal to fans of Robyn Schneider’s The Beginning of Everything (which I also loved), Say What You Will is an honest and thoughtful read that shouldn’t be missed."}, {"userName": "Hailey (HaileyinBookland)", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/21937982-hailey-haileyinbookland", "userReview": "This was a major disappointment for me. I thought it sounded great when I first read the synopsis and so I bought it right away when it first came out. It then sat on my tbr pile forever since I just kind of lost interest. Finally I decided to pick it up this weekend and wow... that was... I don't even know.This was much too juvenile for my tastes. It was very much \"HERE IS THE LESSON YOU SHOULD LEARN FROM THIS BOOK OKAY\" and that was just kind of annoying.The characters were okay although they made some pretty stupid decisions a lot of the time.The plot was just ?????? I really don't even know what happened.So yeah, this book was just weird. I'll be doing a spoiler free review as well as a spoilery discussion of my channel soon so stay tuned for that!"}, {"userName": "Stephanie (Stepping out of the Page)", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/2485722-stephanie-stepping-out-of-the-page", "userReview": "Just when I thought I was maybe growing 'out' of young adult books, along came Cammie McGovern, and alongside her came Amy and Matthew, reminding me exactly why I fell in love with YA in the first place. Amy and Matthew seems like a book that was written for me - it contains everything I love and most importantly, two imperfect protagonists who were easy to admire from the very beginning. Both characters have diagnosable 'disabilities', Amy has Cerebral Palsy and Matthew has OCD. Though both conditions can be very disabling, the characters certainly don't just sit back and let their problems dominate them, which is probably the main reason why I admired them so much. Their lives are undoubtedly affected, as anybody who has (or who has had) an illness will know, and it that's certainly a largely covered issue in the book, but I absolutely loved, and was so relieved, that the personalities of the characters were at the forefront. I enjoyed seeing how the two characters leaned on each other and how their relationship helped improve their wellbeing. Amy and Matthew learn a lot about themselves through each other and this creates such a perfect chemistry between the two and it's something very special. Amy and Matthew are, quite simply, perfect for each other. If I was Amy, I would love a guy like Matthew, and if I was Matthew, I'd love a girl like Amy. I don't think that anybody could deny that. The two characters are really quite different and that is patly why they work so well together. Though Amy is less physically able than Matthew, she's perhaps slightly stronger emotionally, where as Matthew is more physically able but has a harder time with his emotions. I was very interested to see what Amy was really like, what she really thought and felt, as she seemed like, and was, a very complex person. I can only imagine what it must be like to be in her situation, but I think that McGovern portrayed her amazingly well. I liked seeing how both characters changed throughout the book - I was particularly impressed with Matthew's improvements and recovery.As someone who has both chronic physical pain and mental illnesses, from what I understand of Amy and Matthew's issues, they were described well and I am glad that their issues were portrayed in a very frank, but not hyperbolic way. I sympathised with them, but didn't pity them. It is good to finally be able read a book about real people with real issues, trying to lead a normal lifestyle.I hope it's clear how much I loved this book! It's difficult to write in a review, as you really do have to 'meet' Amy and Matthew through reading. I can not thank McGovern enough for getting me back into this genre and reminding me of everything I love about contemporary YA. Amy and Matthew is definitely one of the top YA books out there at the moment. Move over, The Fault In Our Stars and make way for Amy and Matthew!"}, {"userName": "Melanie", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/10890208-melanie", "userReview": "See more reviews at YA Midnight Reads3.5 starsSay What You Will is hands down, the most surprising novel I've read so far in the year of 2014. Everything about it--the characters, the twists, the romance, the plot; all of it was remarkable. I do have my qualms, but this is going down as one of the most incredibly unique novels I've read. EVER.Cammie McGovern's novel is surprising and unique for one main reason: the characters. Amy was born with cerebral palsy and cannot walk without the aid of her walker or talk without a screen that speaks what she types for her. Her overbearing mother decides that for Amy's senior year that she should have peer helpers to look after her throughout the day and make friends. Matthew is one of those peer helpers. Matthew has problems of his own as well; he's got obsessive compulsive disorder and is constantly wanting to wash his hands and make sure no one is hurt. McGovern characterizes these characters brilliantly. Rarely have I encountered novels where such illnesses are written realistically and so unflinchingly. It has definitely left it's mark in that sense.My biggest gripe with Say What You Will is how it was written. The writing was beautiful and emotional. I could see that. But I couldn't really feel it. I wanted to laugh and cry and scream and curl up into a ball of anxiety for the protagonists. However, I just didn't really feel it. Say What You Will is written in 3rd person and that's what makes it so hard to connect to the characters. I found it to be a huge difficulty to get under the characters' skin despite them being so well written and authentic. Additionally,  I personally would have liked more on the other characters in the story. I felt like this book was a little too narrow with the characters. I wanted to know more about Matthew's family as well as Sanjay, Sarah and Chloe.The second half is definitely more eventful than the first. Both have their quirks; the first half is definitely more about setting up these two protags and watching them fall for each other whereas the second half was packed with shocking new truths and twists. I definitely got some odd looks thrown my way on the train when I was reading this. I can most certainly see people shedding a few tears in this novel. It does have emotional potential, but I guess I was the minority for that aspect.I guess I do agree with the pitch that was given to this novel. I don't like it when popular books are included in pitches because like...seriously? But this did feel like a dash of The Fault in Our Stars plus a bit of Eleanor & Park. This being said, they are not all that similar in the sense of characters or plot line but I can see where the pitch was coming from.In all, I really liked Say What You Will. It delivers a strong message and I know this book won't be leaving my mind any time soon.\n~Thank you HarperTeen for sending me this copy!~"}, {"userName": "Rashika (is tired)", "userReviewDate": "Apr 30, 2014", "userURL": "http://www.goodreads.com/user/show/8492956-rashika-is-tired", "userReview": "***This review has also been posted on The Social PotatoWhen I first heard about this book, I wasn’t sure how I’d feel about it but as the reviews started rolling in and many people I knew liked it, I became more and more interested, so that's why when I finally picked Say What You Will up, I had soaring expectations. They were met at first, but that eventually changed and a twist near the end of the book was too much for me. It made this book take on a soap opera-like feel and there was just too much unnecessary drama.Amy, at first, was a very fun character. In fact, the first thing I wrote down in my notes about this book was how I already liked her. She had an optimism surrounding her that was infectious and I liked that in spite of everything she could be cheerful.  EVEN when Matt told her that he saw right through her façade. And perhaps it was a façade, but she realized it and owned up to it and tried to make changes in her life to help change that. Her need to be a ‘normal’ teenager, however, got to me. I may sound harsh, but.. she wasn't a normal teenager and she won’t ever be one.Matt was absolutely adorable. He was shy and sensitive and so, so sweet. I loved his awkwardness and I loved seeing him finally admit to having a problem and then going so far as to actually get help. All the progress he made over the course of the book was admirable and I was so proud of him. The problem that I had with him was his insecurity. Sometimes, even though it added a dimension to his character, I just got fed up of him questioning everything. In fact, both of their insecurities led to so much drama that I really just couldn’t.They said they were best friends, yet at times I wondered why they were so insecure about their relationship. I understand their insecurities, but they are best friends and sometimes, sometimes, communication works wonders. With that said, their relationship was definitely interesting. They contrasted each other in many ways and it was so fun to watch the two support one another and help each other morph into people who were more confident about themselves.I also liked how although both had an air of maturity around them, they were still teenagers and prone to making many silly mistakes, because really, if you were perfect then you wouldn’t have the opportunity to grow as these two had.Another thing I really liked was that while Amy’s disability faded into the background at times, it was never really forgotten about. The reader was always aware of it. The author normalized Amy, but at the same time, she never made it seem like Amy was normal because she wasn’t.The secondary characters were an interesting set and perhaps not as well developed as I would have liked. Amy’s parents, though, played a major role. At first it seemed that her mother was annoying and would turn out to be a ‘bad parent’ (some of the things she did..) but the author never let that happen. Her mother could be too involved and overbearing but she was a mother who was just overprotective and with a child like Amy, you couldn’t really blame her.With me saying all these positive things, you might wonder why I didn’t enjoy this book. I mean, the narration wasn’t an issue, even the dual POV worked out pretty well, I didn’t have many issues with the characters and her parents were good, too, so what was my problem? My problem was the drama. OH SO MUCH DRAMA.Perhaps I sound insensitive but I am the kind of person who has never in her life enjoyed unnecessary drama. Drama is good, wonderful even if done well but in this book, it served no purpose or at least in my opinion it didn’t. I found myself getting annoyed that these two wouldn’t say the three words they both so desperately wanted to and they kept on messing up again and again. They’d make up and hide their feelings and then something else would happen that would tear them apart. The one ‘twist’ in the end was just so unbelievable for me and so dramatic that at that point I kind of just gave up. After a certain point, this book wasn’t fun and humorous; it was drama drama and DRAAAMAAA. It seemed like it was about all the obstacles the two would have to jump over to get to the HEA they both wanted.In the end, I fell out of love with this book and was sorely disappointed when I didn’t get what I had hoped for. There will be people out there who will love this but if drama for no reason is not your thing, I’d say skip it or if you’re curious, beware for you have been warned!"}, {"userName": "Thyago | MrsMargotBlog", "userReviewDate": "Mar 19, 2016", "userURL": "http://www.goodreads.com/user/show/36562929-thyago-mrsmargotblog", "userReview": "I don't know where to start. I didn't know what the book was about and I like to be surprised. When I started reading and saw that it was the story of a girl with cerebral palsy and a boy with severe OCD and socially inept, I soon realized that this novel was different, I had never read anything like it. It was a real learning, overturn prejudices, to see beyond the disability ... I liked it a lot and think it would be great if the schools students had to read this book, learn to respect the difference. And just I did not give 5, because he liked to have had a different ending."}, {"userName": "Sarah Wilsman", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/918750-sarah-wilsman", "userReview": "I could not put this down...the characters are genuine and captivating. Their struggles with their issues are honest and heart wrenching. This should be a Printz contender. For older teens or the New Adult category."}, {"userName": "Natalie (Never trust a duck)", "userReviewDate": "Mar 20, 2014", "userURL": "http://www.goodreads.com/user/show/12682794-natalie-never-trust-a-duck", "userReview": "I, like many of you sticklers out there who feel the need to compare previously popular books such as The Fault in Our Stars, Twilight, and The Hunger Games to new ones, have been shown up yet again. I completely expected a Fault in Our Stars knock off with cerebral palsy instead of cancer, because that's what a bunch of reviews told me. Suffice to say, it was not. A book about illnesses does not constitute a rip off of John Green. I mean it can sometimes, I've read some, but anyways!Amy has cerebral palsy and the left side of her body is unpredictable, causing her to rely on a walker and an aide to carry her books in between classes, use the bathroom, etc. It's her senior year and she's not exactly what you would call popular. In fact, she hasn't really got one friend. So she decides to switch out her adult aides for peers that will help, five different students for each day of the week. She let's her mom pick four, but Amy has her eyes set on making Matthew, the guy that inspired her idea, to be number five.Matthew is very compulsive. In fact, he's obsessively compulsive. He needs to check the faucet at least three times to make sure it is completely off, tap every other locker, and he prefers when things have an even amount such as the tiles on the wall or vowels in a word. He's surprised when he gets the call to be Amy's aide, a wee bit hesitant, but he does it since she emailed him directly telling him of her choice.A friendship ensues, and it's a rather cute one. Of course, the entire time I was screaming something along the lines of this. With a \"you\" instead of \"we\"And then something happens that I honestly did not see coming at all. It was really out of the blue. I was left gaping, completely dumbfounded at how unlucky Amy was.Then came the ending, where yes, I was pleased, but then I was like really? That's all I'm going to get. An almost promise of something more. I don't know about you, but I like seeing couples I ship get married at the end, gives me a sense of fulfillment. Okay, not necessarily married, but in this case, I would've liked more solid insurance. Instead....All in all, an enjoyable, humorous read!Happy Reading!!!"}, {"userName": "Melissa", "userReviewDate": "Jun 04, 2014", "userURL": "http://www.goodreads.com/user/show/14166925-melissa", "userReview": "Oh, how I had such high hopes for this book.I read the description on Amazon and immediately thought, \"I NEED to buy this book.\" So I did just that, the day it came out, and I read it essentially in one fell swoop, only pausing to sleep. And I was so very disappointed.The first part of the book was incredible; learning Amy and Matthew's story, watching their friendship bloom and transform into something possibly more, something neither of them had ever planned. It felt a little bit like Eleanor & Park by Rainbow Rowell, though definitely not as eloquently executed. But when I had read about half of it, I had no idea what was going to happen in the second half; and not in a good way. The story wasn't building in an appealing way, it was just continuing. And then the author threw in a plot point that seemed completely unlike Amy, a character I had grow to love, essentially ruining the story for me. Then, it continued with that plot point until the end, beating a dead horse into incalculable pieces. I'm trying not to be too spoiler-y, but this \"event\" that occurred is something that seems to pop up a lot in stories nowadays, and each time it feels contrived, cliche. Authors need to stop using this as a crutch in their novels and start creating more original plot transitions.So, in the end, the failure of the novel was that it didn't follow through. And it's a tragedy. This book had immense potential to be something incredible, but the second half of the story ruined the whole book entirely for me."}, {"userName": "April (Aprilius Maximus)", "userReviewDate": "Mar 03, 2014", "userURL": "http://www.goodreads.com/user/show/20658145-april-aprilius-maximus", "userReview": "All of my reviews are spoiler free (unless stated otherwise) so you can go ahead and read my review!This story is absolutely beautiful and I feel like there needs to be more books like this out there in the YA community! Amy has severe cerebral palsy and has to use a walker to get around and a special machine to speak for her. Amy is super intelligent and is sick of living in a shell, so for her senior year, she decides to get peer helpers instead of teacher aides in order to make friends and make the most of her final year of school. Matthew is one of her new peer helpers and they immediately have a connection. Matthew isn't your average boy. He's teased relentlessly for having severe OCD and their relationship really helps both Amy and Matthew with different fears and personal issues. Firstly, the writing is amazing and really brought to light a disease that people may not know about. Personally, I had a friend in primary school who had cerebral palsy and he was in a wheelchair and couldn't speak either, but he was such a lovely boy and he used to let me ride in his wheelchair. I regret not keeping in touch with him, because now I have no idea where he is or if he's alright or what he's doing, but I often think about him. This was a really realistic story with absolutely no instalove and it shows the progress of two people's friendship growth and also their own personal growth as individuals. The way this was done was absolutely stunning and eye opening. There were also some really unexpected twists in the book that I definitely didn't expect and it was so exciting and scary and askdfhakbh! The main thing that I took away from this book is to face your fears and communicate with people. TELL PEOPLE HOW YOU FEEL! The majority of the time, speaking up will solve your problem! This was one of the most beautiful and inspirational books I've ever read and I want everyone to read it and be enlightened and appreciate this beautiful work. <3"}, {"userName": "Chelsea (chelseadolling reads)", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/16219087-chelsea-chelseadolling-reads", "userReview": "Edit like a year later- thinking back, this book is nowhere near a 4.5 for me. Amy actions in the last half of this book really bothered me. Can't do it. Original review - 4.5 stars I think. I adored this book and these characters to pieces, but there's just something keeping me from giving it a full five stars. That being said, I still really liked the plot and I would definitely recommend this book to fans of Rainbow Rowell. So cute."}, {"userName": "Debbie Barr", "userReviewDate": "Feb 21, 2014", "userURL": "http://www.goodreads.com/user/show/17153-debbie-barr", "userReview": "I loved this. I loved Amy and Matthew. I can't remember the last time I read a YA book with such flawed but lovable characters. They both make bad decisions through the course of the book, but I love how they handled the consequences, and in the end isn't that what you want from your protagonists? For them to make mistakes and grow?If you liked ELEANOR & PARK you're not going to want to miss this one."}, {"userName": "Giselle (Book Nerd Canada)", "userReviewDate": "Dec 04, 2013", "userURL": "http://www.goodreads.com/user/show/5789353-giselle-book-nerd-canada", "userReview": "An Electronic Advanced Reader Copy was provided by the publisher via Edelweiss for review. Quotes have been pulled from an ARC and may be subject to change.Say What you Will spotlights disabled characters and that's something I was looking forward to reading in this one. I love the fact that we get to see a different perspective of someone with cerebral palsy and another with an obsessive compulsion disorder. Both points of views let the readers in on a glimpse of what it's like to live as someone who has a disability. Both refreshing and unique, I recommend this one for its sheer character development.Unfortunately, I was looking for a huge story-line. It's literally day to day interactions and I solemnly grew bored. Even if it meant for one of them achieve their goals like graduating to go off to college. But alas, I couldn't find a story that made it worth sticking to. I read 85% of the e-ARC, only to skim the rest of the book because I felt like it was extremely long. I did care what happened to them which is why I didn't just DNF the entire thing.As for the characters, I liked reading from their point of views. As for Amy I didn't like her at all. Amy is extremely bossy but she masks it with good intentions. She took Matthew's wonderful friendship for granted at EVERY chance she could get. I found her to be extremely selfish who would do anything to get what she wanted, eventually even cheating on someone she claims to love? Um no. I eventually didn't really care what she did because I knew I couldn't condone how she treated Matthew. Also, Amy's mom is insanely overprotective and yes I understand that she's different from other children, but how will she learn to be independent and grow up if she doesn't have her parents there 24-7? I was happy when she finally went off on her own. Matthew on the other hand had a thought process that I couldn't understand, but mostly I just thought he was extremely paranoid until he started to count and do OCD like actions. Even though he had this disorder, and Amy tried to help him, I thought her way was too forward. It felt like she just pushed him into the deep end, and he learned how to swim on his own. He was just so fond of Amy, and he treated her so nicely, even when she starts to get mad at him. I couldn't understand why he didn't see that either. I did love how incredible close they got, how their friendship blossomed, but I didn't see the romance at all.Overall, I would definitely give this one a try if you want to read more about characters with disabilities, but if you're looking for a cute love story, tr to find it somewhere else. It's more a friendship than anything.RATING 3/5QUOTES\"I don't know what it would feel like to be beautiful, but I can guess that it makes demands on your time.\"\"I have learned that some people who look fine are more crippled than I am, by fears they can't explain.\"\"I see the way some people handicap themselves.\"\"Just because you're too scared to take any risks doesn't mean the rest of us should be.\"\"I don't like them saying hi suddenly when they've spent the last eleven years ignoring me.\"\"Most boys aren't interested in models. It's girls who think they're beautiful. Boys look at that and see a paper-thin nothing. We're not interested in that.\"\"Even smart girls like me care about stupid things like prom.\"\"You aren't afraid of things and you're always true to yourself and I've learned a lot from you.\"\"If you care what they think, they have all the power.\"\"You're the only person I think about with any feeling like happiness.\"\"I don't think you have to tear up all your relationships to get away from people's expectations of you.\""}, {"userName": "Lucy Powrie", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/7733998-lucy-powrie", "userReview": "You can read more of my reviews at Queen of ContemporaryYou know a novel is truly flawless when you feel as if it’s natural; the words flow into one and you are witnessing the events through the characters’ eyes without fault. That’s how I felt when reading Amy & Matthew.One of the easiest ways to describe Amy & Matthew is to quote from the text itself: ‘there were many ways to be a freak. Amy had no choice, but other people did. If you worked hard and concentrated, you could hide your freakish thoughts.’ Amy has cerebral palsy, which limits her communication and movement. It’s her senior year and she decides she’s going to replace the aides who usually help her with students. Step in five peer helpers. Matthew has noticed Amy since they were young and so offers to help. The thing is, Matthew has his own problems to battle. For fans of Eleanor & Park and The Perks of Being a Wallflower, Amy & Matthew will blow you away.I think I fell in love with this novel from the first page. It was understanding and meaningful and it had me completely hooked. I can tell this book will touch a lot of people once released, just as it touched me. I was wary before I started reading it, I must admit. Books dealing with such subjects are becoming ever popular (and for good reason) but there is a certain atmosphere surrounding them that isn’t needed. As it’s only a recently emerging trend, it can always be worrying beforehand; you never really know what to expect. I didn’t need to be worried though, because I loved Amy & Matthew.The thing I loved most about this book was it wasn’t your typical romance book. From the title you would expect it, but it’s really not. To call it a romance novel would be a dishonour because it’s so much more than that. It’s the blooming friendship between two people as they discover themselves at the same time and explore the changes of the world around them; it’s the differences between the two and how they bridge the gap. In two words: truly stunning.I don’t want to talk too much about both Amy and Matthew because I think the brilliant thing about this book is discovering their personalities and hidden depths for yourself. I thought I knew who they both were but then things would happen and I had to reassess. It was such a refreshing way to read because you don’t often get that.Simply, you should go out and buy Amy & Matthew straight away. It challenges preconceived notions and will blow you away."}, {"userName": "K.", "userReviewDate": "Feb 21, 2016", "userURL": "http://www.goodreads.com/user/show/5663034-k", "userReview": "[Once Amy found out she was pregnant, it got almost...preachy? And I really hated that the adoptive parents she chose for her baby were basically the more able-bodied adult versions of her and Matt. Because that was like being hit over the head with the Anvil of Obvious Storytelling. (hide spoiler)]"}, {"userName": "PVPA Library", "userReviewDate": "Nov 05, 2013", "userURL": "http://www.goodreads.com/user/show/20979295-pvpa-library", "userReview": "I was so happy to get my hands on this book as an ARC.Sure, there are a few notable books about teens with disabilities--Marcelo in the Real Worldand The Curious Incident of the Dog in the Night-Timejump to mind--but never have I read a book like Cammie McGovern's latest, Say What You Will.Say What You Will gives us a typical teen-age love story. What is not typical, though, are the teens themselves. More often than not, teens with disabilities in fiction have wings, or can read minds or can taste emotions in their lemon cake. Matthew and Amy have no such disabilities, and their portrayal in this book is one of the most sensitive and honest I have ever seen. Because the author sees them as nuanced and flawed, the reader is invited to do the same while getting a look at the experience of young adults with physical disability and mental illness. All that aside--and it really shouldn't be; this is a progressive and important shift in the conversation around realistic fiction--the plot and style of the book are great. McGovern uses text messages and emails alongside her narration to fully immerse the reader in the world of her characters. A clever new discovery that might become a trope in fiction: the unsent emails written late at night and saved to drafts for fear of their ramifications. Never again will anyone have to read a chapter that starts, \"Dear Diary.\"And the ending! Oh, man, the ending. Some books hit you like a bus, knocking you flat. Cammie McGovern pulls the brakes just before collision and the shock is that we survive."}, {"userName": "Jessy MelodyofBooks", "userReviewDate": "May 26, 2015", "userURL": "http://www.goodreads.com/user/show/21154566-jessy-melodyofbooks", "userReview": "Meine Rezension: https://youtu.be/ym0u4OrlVCg"}, {"userName": "Casey Ann Books", "userReviewDate": "Feb 10, 2014", "userURL": "http://www.goodreads.com/user/show/4018158-casey-ann-books", "userReview": "o I'm not a Huge contemporary fan. I like books that are far away from the truth as possible. But when I read the summary of this book I felt a huge draw to it, and I am so glad I read it.Literally something I've never ever read about, never would think of reading. A girl with cerebral palsy and a boy with OCD. Sounds like a disaster love story yes? In some ways but in others an amazing tear jerker. I loved the writing style in this book. A lot of inner monologue which was so refreshing. Carries writing is very clever, addicting and a huge emotion jerker. I loved the characters. Amy the seventeen year old girl with cerebral palsy trying to get through high school. And Matthew who's OCD is effecting his life pretty badly. I found these characters so refreshing to read. Their not perfect they have issues like real people. They come together to help each other and end up falling in love. I think Cammie has handled cerebral palsy amazingly in terms of being so despcriptive, but not taking away from the story itself so much. This book felt really real. It brought out emotions I never thought I could feel. That little pain in your chest when someone is just so emotional literally happened every other page. It's just an all around epic love story not about the generic hot guy and non popular girl in school, this is so much better. A warm, magnificent and delicate love story that will break your heart and stitch it back together again."}, {"userName": "Brian", "userReviewDate": "Jun 29, 2014", "userURL": "http://www.goodreads.com/user/show/854699-brian", "userReview": "This book promised to be a cross between \"Eleanor and Park\" and \"The Fault in Our Stars\" and sadly, I did not think it delivered. Matthew takes on a job to be an aide to a disabled girl named Amy who has trouble walking and speaking. She had adult aides in the past, but she decided she needed to learn how to make friends so her mother hires students to help her in school. Amy is attractive but she drools and cant' speak. The book is about the relationship that develops between Amy and Matthew. The book moved VERY slowly and felt like it was 1000 pages instead of 300. Nothing really amazing happened throughout the book, and I found it to be not very emotionally involving. I also found that the CAPS WAS ANNOYING, I understand it representing a computer talking, but it felt like the old days on AOL when kids would use caps to be annoying."}, {"userName": "Aysha", "userReviewDate": "Sep 19, 2014", "userURL": "http://www.goodreads.com/user/show/15732427-aysha", "userReview": "The very first thing I'd like to point out in this review is that: this is NOT like the Fault in Our Stars. This is NOT like Eleanor and Park. This is NOT a story about 2 kids with cancer who fall in love and then they die and then they mourn and whatever. No. It's not even close to that. Say What You Will takes TFIOS and stomps on it, in fact it trumps it on so many levels I don't know why I'm spending so much time trying to convince you that this book is unique. It is. You'll know from the very first page, actually, from the synopsis alone, that this book is not what you expect it to be. Cammie McGovern did a very good job at releasing a debut novel that absolutely took my breath away. Of course I say this with no exaggeration at all, because books like these are the absolute epitome of YA contemporary and all its glory. The rawness, the reality, of this book is so true and so deep that it cuts you straight to the core. You're allowed into the mindset of Matthew who almost severely has OCD and it's nothing I've ever read before, he's worried about things a million times more than what any other person would be worried about, he's all over the place and at the same time he's not. I related to him on the basis of constant excessive worrying and you truly feel the realism this character has in the story. He has great friendship with Amy that you could just see blossom and bloom and he was so unbelievably frank about most things with her and whenever he held back it just makes you genuinely upset that he didn't tell Amy that ONE THING HE SHOULD'VE TOLD HER!!!! Okay, let me calm down for a bit... [5 minutes later] I'm fine. I can continue this review. The thing I loved about this book was that it took its time for the relationship/love to develop, from the very beginning you fall for their sweet friendship and the way Amy and Matthew just naturally communicated, it was wonderful. The thing about Amy was that you never felt like she had cerebral palsy because her thoughts were that of any normal teenage girl and I really felt like McGovern did her research because honestly everything was so accurately described I loved it. Amy had her faults as any human being should have and I felt like this is what made the book so enjoyable for me and so utterly painful to read about 65% of the time. This book was so heartwarming and surprising and I love a book that surprises me. The one thing that I might've really disliked about it was the abrupt ending, maybe because I was so engrossed in the story that I expected more but other than that I enjoyed this. A lot. I can't wait to read more of Cammie's YA-based books because this one sold me. P.S: if you're looking for a book with this long lasting impression & a lot of inspirational stuff that kind of just sticks with you and I don't mean the self-help book kind of inspirational I mean the kind that just takes your heart and fills it with good quotes and fluffy moments. Then read this. Read it."}, {"userName": "Brittany (brittanymariereads)", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/29017732-brittany-brittanymariereads", "userReview": "I picked up Say What You Will when I was feeling really sick and just wanted an easy read. I hadn’t heard a lot about the book, so I didn’t really have any expectations. I have seen it compared to John Green’s The Fault in Our Stars. I honestly hate this comparison, the only thing that they have in common is that it has kids with medical issues. I thought this was very different from the Fault in Our Stars but it was still a good book.Say What You Will primarily focuses on Amy and Matthew. Amy has Cerebral Palsy and is about to be a senior in high school. Her entire life she has had an aid that follows her around school each day. In an attempt to make new friends and prepare herself for college she decides that she wants to have peer aids. Her controlling mother takes over the project and after reviewing many applications and doing several interviews she picks five peer aids to assist Amy through the school year. Matthew is one of those aids. Matthew has O.C.D. that has been progressively getting worse over the past couple of years. He has not admitted to himself or others that he is sick or has a problem.As the story progresses so does the relationship between Amy and Matthew. They both find it easier to deal with their own illnesses if they focus on helping the other. They become close friends and then they both begin to hope for more. It was definitely an unconventional love story. (And for many more reasons than their illnesses.)Say What You Will was a very easy read. I flew through it and finished it in just a couple of hours. The character were so unique, totally different from the normal YA characters we always see. The author did a good job of portraying the supporting characters as well. The story was different from the average love story. There were times were I even felt uncomfortable, but I think that it added to the whole experience. This isn’t one of the great love stories of our time, and it isn’t going to go down in history as a great piece of literature but it is good. It was cute and fun and totally different from anything else that I am currently reading. It was a refreshing read and I do recommend it as long as you go into knowing not to expect greatness.You can read the full review and more on my blog!http://brittanymariereads.wordpress.com"}, {"userName": "Anna", "userReviewDate": "Sep 09, 2015", "userURL": "http://www.goodreads.com/user/show/4438781-anna", "userReview": "Amy, a senior in high school, has cerebral palsy. Pushed by her mother to excel academically, Amy has never truly had a friend or opportunities to experience the social aspects of school. So, for her senior year, she convinces her mother to hire peer helpers to assist her at school. One of her helpers is Matthew, an awkward boy who has OCD (Obsessive Compulsive Disorder). For each, daily life can be a struggle, but they both proved obstacles can be overcome. As Amy and Matthew navigate senior year, I felt I was walking the halls with them. I appreciated that the author allowed you into the thoughts and inner emotions of Amy and Matthew, and the window it offered on living with a disability. Though not a unique plot line, it's a worthy YA read.3.5 stars"}, {"userName": "Zoe MacIver", "userReviewDate": "Mar 22, 2014", "userURL": "http://www.goodreads.com/user/show/24489272-zoe-maciver", "userReview": "4.5 stars!This book was so beautifully written and had such amazing characters!I will say this book spoke to me on a more personal level as a lot of the issues in this book are things that are personal to my life!"}, {"userName": "Ashley (Loves Books)", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/1274448-ashley-loves-books", "userReview": "**This review will post to Ashley Loves Books at a later date.**There are so many things I can’t say about this book, simply because I feel like there are no words that can accurately describe it. If ever a standout in the YA genre, it is Say What You Will, in almost every aspect.The obvious way is that it deals with two characters who have their own handicaps: Amy, with her disability, and Matthew, who seems fine but you learn has his own disabilities that cripple him—perhaps not in the same visual way as Amy, but he has them, certainly. And it is astounding to see how they are handled in a young adult book, amongst all the usual drama and stress and emotions of a Senior year.These characters are also incredibly unique to any book I’ve read. They’re both quite strong, as people and as they are written. Their downfalls and their own handicaps are integrated really well into their personality, and I love that both are much more than their issues. Just as we always hope “cancer books” aren’t just about the cancer, this book is most certainly not just about Amy’s disability. I want to talk so much about Amy and Matthew, about how they are together and separate, how they really are better with the other…but I really can’t without saying what exactly ails Matthew, without saying what exactly they endure. So I’ll have to leave it at this: I’ve never met anyone quite like the two of them, with their quiet, strong demeanors. Who are somehow both closed off and entirely open to new people and things. Who confront being uncomfortable with a resolve I wish I had.But I can say that this story is beautiful, that this is a friendship built on so much more than days spent together. That it’s written so well, with their words and emails and texts and her Text. That I was caught by surprise in so many instances, both big and small, in big moments and small ones. There is so much heart and tenderness in these pages, I honestly thought I wouldn’t be able to control all the out-of-control beating of my own heart. And I can also mention that I was not impressed with all the parents in this book—not in terms of the writing, that was still great. But the parents themselves and what they do (and didn’t do) in the book make me very crabby when I think of it haha.Say What You Will is a stunning addition to the YA contemporary world, introducing new characteristics while retaining all the emotions and feelings we crave and love. It is a beautiful story of friendship and love, and friendly love and loving friends. It’s also about confronting and accepting faults and flaws, and learning to not necessarily overcome them, but absorb them into who you are. And that is a fantastic lesson for us all to learn."}, {"userName": "Soumi", "userReviewDate": "Mar 28, 2014", "userURL": "http://www.goodreads.com/user/show/6833452-soumi", "userReview": "3.5 starsAmy and Matthew...Yaah!! It’s a love story–-a story of two disabled high school students. Whereas Amy is a patient of cerebral palsy, Matthew is suffering from OCD. And it’s very clear that a love story of such central characters is a journey of searing sympathy, and so it is. It’s a story of falling in love for first time. It’s a story of soaring over fears and disabilities.Though the initial chapters was quite boring and sometime over-stressed but as the story progresses it snags the reader’s attention. Written from a dual point of view, the story is worth sharing positive reviews.The catchiest sides of the story are the spark in Amy, the wittiness in her dialogues and the courage in self. Sending her loved one in date with another girl just for the sake of him, despite knowing the possibility of losing her boyfriend, is a selfless act.The story starts with Amy, being a cerebral palsy patient, got her classmate Matthew, along with a few others, as an aid for teaching her the act of socialization that she might need for her college. The honest and straightforward Matthew was never so fond of doing this but applied on request of Amy. I think, initially, Matthew was sort of jealous of Amy’s smartness. The story then accelerates beautifully with different instances of their interactions which smoothly morph from friendship to relationship. With Amy helping Matthew to retrain his mind in getting out of OCD of hand washing (PS: Matthew used to wash is hand for over 30 minutes :-P) by use of regular tasks. A worthy line of Amy in this matter is “Your fear may seem real but the danger is not. You are safe.” – Such a simple and practical advice.With Matthew, truly speaking I don’t like such a thrower at the starting. But as the plot moves with more and more, unfolding Matthew’s character from every interaction with Amy, I couldn’t help but change my view point. An OCD patient behaves in a way his disease shapes him. That’s the case for Matthew. His possessive behavior like texting all the prom night after Amy left with Sanjay, is quite justified from an high school student who is suffering from OCD.The story gains its point again on the portrayal of first-love. Along with its possessiveness and confusion there lie the state of extreme excitement and careless anticipation. Personally, I could relate the feelings of being in my first relationship with Amy and Matthew--their behaviour, slowly falling in love with each other; their insecurities are so deep and practical.But despite all these, it had become a bit too dramatic. Though the author tried her best to fence the feeling and sequence of plots as much practical, but I think Cammie McGovern got either lost or rather baffled in her effort to make the readers sympathize. Still, Amy and Matthew will be in the first row of my bookshelf for rest of the year."}], "description": "John Green's The Fault in Our Stars meets Rainbow Rowell's Eleanor & Park in this beautifully written, incredibly honest, and emotionally poignant novel. Cammie McGovern's insightful young adult debut is a heartfelt and heartbreaking story about how we can all feel lost until we find someone who loves us because of our faults, not in spite of them.Born with cerebral palsy, Amy can't walk without a walker, talk without a voice box, or even fully control her facial expressions. Plagued by obsessive-compulsive disorder, Matthew is consumed with repeated thoughts, neurotic rituals, and crippling fear. Both in desperate need of someone to help them reach out to the world, Amy and Matthew are more alike than either ever realized.When Amy decides to hire student aides to help her in her senior year at Coral Hills High School, these two teens are thrust into each other's lives. As they begin to spend time with each other, what started as a blossoming friendship eventually grows into something neither expected.", "title": "Say What You Will", "url": "http://www.goodreads.com/book/show/18599754-say-what-you-will", "average": 3.69, "cover": "https://images.gr-assets.com/books/1392738015l/18599754.jpg", "reviews": 1993, "authors": [{"url": "https://www.goodreads.com/author/show/36320.Cammie_McGovern", "name": "Cammie McGovern"}], "type": ["Young Adult", "Contemporary", "Romance", "Fiction", "Realistic Fiction"], "outlinks": ["http://www.goodreads.com/book/show/18599754-say-what-you-will", "http://www.goodreads.com/book/show/21509651-say-what-you-will", "http://www.goodreads.com/book/show/22934458-say-what-you-will", "http://www.goodreads.com/book/show/18635084-say-what-you-will", "http://www.goodreads.com/book/show/20752817-amy-matthew", "http://www.goodreads.com/book/show/23590022-amy-matthew---was-ist-schon-normal", "http://www.goodreads.com/book/show/151685.Eye_Contact", "http://www.goodreads.com/book/show/24605853-a-step-toward-falling", "http://www.goodreads.com/book/show/25685283-just-my-luck", "http://www.goodreads.com/book/show/7718982-neighborhood-watch", "http://www.goodreads.com/book/show/30653839-chester-and-gus", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/31160055-the-last-cherry-blossom", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/40192858-dragon-rider"]}