{"ratings": 19558, "userreviews": [{"userName": "Warwick", "userReviewDate": "Oct 20, 2015", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "This rollicking adventure story about colonial India was beaten to the 2008 Booker Prize by The White Tiger, a novel that trades on its gritty realism but which is actually just as much a fantasy of Indian life as this one. On the face of it, Sea of Poppies seems the more enjoyable. It has a huge, Dickensian cast that includes a fallen Rajah, a Chinese opium addict, a European girl gone native, a cross-dressing reincarnated saint, an American freedman and a poppy-farmer's widow, and its plot takes in dramatic rescues, nefarious Brits, girls-dressed-as-boys, floggings and secret assignations and portentous items of jewelry. Yet somehow there seems to be little going on under the surface – it's thematically a bit hollow and I kept feeling that I should be liking it more than I was.At first glance, it's the sort of writing that should really appeal to me, because Ghosh's entry into this world and to these characters is all linguistic. Every character has their own ludicrous demotic, with our American second mate exclaiming, ‘Grease-us twice! What the hell you pesticatin me for,’ while Paulette, a young Frenchwoman, speaks in an entertaining but completely implausible Franglais – ‘you are just pleasanting me’, ‘he was quite bouleversed!’ The main narrative voice, meanwhile, is a hallucinogenic Anglo-Indian farrago that has been turned up to eleven, like Hobson-Jobson in an opium dream – the density of the following paragraph is not untypical:In this floating bazar there was everything a ship or a lascar might need: canvas by the gudge, spare jugboolaks and zambooras, coils of istingis and rup-yan, stacks of seetulpatty mats, tobacco by the batti, rolls of neem-twigs for the teeth, martabans of isabgol for constipation, and jars of columbo-root for dysentery: one ungainly gordower even had a choola going with a halwai frying up fresh jalebis.I have a high tolerance for (indeed love of) opaque vocabulary, but even I found it wearing here – the effect is too extreme to come across as anything but parodic. Tellingly, Ghosh reserves a special thank-you in his afterword for the ‘dictionarists’ whose work he so assiduously plundered – not just Hobson-Jobson, but also a variety of colonial-era slang-lists and glossaries, like A Laskari Dictionary or Anglo-Indian Vocabulary of Nautical Terms and Phrases in English and Hindustani. It's hard not to wish he'd been a smidgen more sparing in how he used this research.Though I found it strangely unsatisfying, there is a lot to like here, really – lush, gothic descriptions of an opium factory, a British jail, the hold of a slaving vessel are all well worth the cover price, and the characters are so bizarre that they rarely struggle to hold your interest. I had a lot of fun, but I don't feel in a mad rush to read the rest of the trilogy."}, {"userName": "Praveen", "userReviewDate": "Aug 22, 2016", "userURL": "http://www.goodreads.com/user/show/19760612-praveen", "userReview": "I give a high place to Ghosh among contemporary English Authors from India.A saga of a ship, the Ibis, in the Indian Ocean and beautiful depiction of local characters in typical Indian way enthralled me and it kept me engaged with its characters and story.This is a sprawling novel and its historical treatment is wonderful.I am sure, as Ghosh also acknowledges that he has toiled really hard, doing research of this certain period from the past. He has masterfully woven the economic hardship and elements of British imperialism of early 19th century India.This is very panoramic, rich in both suspense and satire.Story revolves around the opium trade and encompasses poverty and riches, expectations and despair in a very drunk language.Imaginative capacities of Ghosh are always awesome and the way he has written his sentences with full elements of local languages here in this novel engrossed me in the plot.It consists of everything ... Love interests, village atrocities, betrayal,voyage, comic scenes, lots of water and many more elements.During village weddings,it was always the women who sang when the bride was torn from her parents embrace....Men remain silent..as if they were acknowledging, through their silence that they,as men, had no words to describe the pain of a child who is exiled from home.\"How will it pass.  This night of parting?\" A must read polyphonic saga from Amitav Ghosh !"}, {"userName": "Arah-Lynda", "userReviewDate": "May 14, 2016", "userURL": "http://www.goodreads.com/user/show/5859453-arah-lynda", "userReview": "It has been said that the Ibis, a seafaring schooner, bound from Baltimore to Calcutta and destined to transport opium to China lay at the heart of this story and while I agree that the Ibis is central to the tale being told, the true heart of this saga and what ultimately brings together a diverse cast of characters is opium. Rich in historical detail and panoramic views of land and sea this story is set in the 1830’s just on the cusp of the opium wars in China. Ghosh expertly weaves together the back stories of a colourful cast including among many others: a widowed opium farmer from the banks of the Ganges, the mulatto son of a Maryland freedwoman, the orphaned daughter of a French botanist, a bankrupt raja and an opium addict from China, while deftly imbuing the readers involvement in and concern for the fate of these people and their loved ones. The narrative is peppered, most especially in the beginning, with slang, pidgin and many different dialects, which at first I found quite disconcerting and overwhelming as I struggled to understand every word. Fortunately though I realized soon enough that I was able to comprehend the gist of things just fine and decided henceforth to stop fretting about it and just allow the words and dialogue to wash over me. Ghosh paints a very dark picture of humanity at this time and place, showcasing how governments in this case (British) and Indian lord it over others of lesser means and status, both on and off board, the great ship Ibis. While no doubt accurate it can be difficult to have a front row seat from which to view the often inhumane treatment that some people willingly and righteously inflict on others. While I may have initially and through much of the reading of this first instalment been inclined to award this five full stars, the ending left much to be desired. Ghosh leaves the reader literally drenched and clinging to the storm swept deck of the Ibis, completely unaware of the immediate fate of the very people he has spent the last 500 odd pages making you care about. It is almost as though he stops telling his tale mid sentence. While this may have been okay for me now, given that I had the next book in the trilogy immediately available, I can well imagine how I might have felt had I not. Yes that would no doubt have quite successfully pissed me off. So be forewarned and arm yourself with River of Smoke before you set sail on this journey over the black water which I highly recommend you take."}, {"userName": "Tea Jovanović", "userReviewDate": "Feb 28, 2016", "userURL": "http://www.goodreads.com/user/show/3103000-tea-jovanovi", "userReview": "Sjajan pisac, divan čovek i prelepa knjiga... Imala sam to zadovoljstvo da se dva puta sretnem s autorom, jednom na sajmu knjiga u Frankfurtu (kada sam kupila prava za njegove knjige) i kasnije na sajmu knjiga u Beogradu (kada već više nisam radila kod njegovog izdavača)... On toliko odiše toplinom i skromnošću da želite da se što duže zadržite u razgovoru s njim... Nažalost, kao da je izdavač odustao od njega jer poslednje 4 godine ništa njegovo nisu objavili, šteta... :("}, {"userName": "karen", "userReviewDate": "Apr 05, 2010", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "donald harington recommended this book to me and now that he's gone, i can't even talk about it with him, and that is what i was thinking the whole time i was reading this book. if i hadn't had to read it for school, i would have waited until the other two books in the trilogy were published, so i could have had at them all at once, but again, school screws up my plans. it's an amazingly quick read - i was under the impression that i was supposed to have read it for yesterday's class so i zipped through it in a day and a half, which is way quicker than i read the known world, a less fun, and much shorter, book also for class. this book is just more vibrant - it, too, is a sprawling narrative with a huge list of characters, but this one has pirates, and drugs and a man growing boobs, so it's more familiar territory than slave-owning, for me. (shortest \"review\" ever, i know [you're welcome, dana:]) but i have to get back to my stupid paper about collection development and somehow write at least 5 more pages on a topic i feel i have already exhausted. cliffs notes for this review: it is fun and good. read it."}, {"userName": "Margitte", "userReviewDate": "Nov 14, 2016", "userURL": "http://www.goodreads.com/user/show/7481492-margitte", "userReview": "The title of this book is so spot-on. While an interesting cast of characters populated the story of opium: from the empoverished villages of India, to the compromised users in China, with the movers and shakers of colonialism in between, only one element dictated the outcome, and that was poppies. These happy little flowers invaded every single aspect of land, sea and all things alive, even innocent animals. There was not a soul, psyche or physical body devoid of its impact in the nineteenth century.I started this book two years ago but set it aside for a time which promised me more hours to proceed. The initial dialects, or should it be called forms of English, demanded concentration, but it formed such an intricate part of the plot, since it was a world in one story, that I wanted to be more prepared for the rest of the tale.And what a compassionate, gripping saga it turned out to be! All the hours invested in this 500+ pages was worth it. Textured, colorful, atmospheric, picturesque, descriptive, gripping, holistic. It is just a perfect historical fiction experience.However, after so much time spent in the lives of these intriguing characters, nobody wants to be left hanging at an abrupt, inconclusive cliffhanger ending. And that's where it lost a star. This book, as a stand-alone could have been a perfect read. Nevertheless, I already started the next book in this trilogy, so will catch up with my new family. Just be forewarned. You need to read all three.The author must be congratulated. This is an exceptional piece of word art. A masterpiece indeed."}, {"userName": "Grace Tjan", "userReviewDate": "Apr 16, 2009", "userURL": "http://www.goodreads.com/user/show/1889855-grace-tjan", "userReview": "A beautifully written historical novel about 1830's India in the grip of the opium trade. The characters are just as diverse as the British Empire itself, each with their own dialects and idiosyncracies, all brought together by the opium trade's many tentacled hands into the Ibis, on a voyage that will irrevocably changed them forever. The author has obviously done a massive amount of research into the period, and this novel is so rich with details that it could veritably serve as an encyclopaedia of early 19th century Indian life, both at sea and on land. However, this was never allowed to stifle the narrative, which deftly moves between a half-dozen main characters and different settings with ease. The novel is as chock-full of exciting incidents as a door-stopper 19th century adventure yarn, without abandoning a realism which makes it a compelling page-turner. The humorous episodes, largely supplied by the Falstaffian figure of Baboo Nob Kissin, enlivens the story between accounts of opium addiction, imprisonment and various corporal punishments.Ghosh's experiment with Anglo-Indian dialects adds tremendously to the authenticity of the voices of the characters, although sometimes it could be rather distracting, especially in the earlier part of the story. There is a glossary ('The Chrestomaty') appended to the end of the book, which is quite useful to decipher the various lingos, but regretfully, not all of the words used is included. Obviously, it would be more helpful if all the words are included so that readers wouldn't miss any bit of dialogue.Probably Ghosh's best and most impressive work to date. As this is said to be the first part of a projected trilogy, I'll be waiting with bated breath for the next installment.Write quickly , Mr. Ghosh!"}, {"userName": "Khush", "userReviewDate": "Feb 25, 2018", "userURL": "http://www.goodreads.com/user/show/76759105-khush", "userReview": "'Sea of Poppies' is a story of indentured laborers. We see all sorts of Indians huddled together in a ship called Ibis. We get to know the story primarily through its main characters Kalua and his wife Deeti. On this ship, there are people of different persuasions and background. Kalua and Deeti are no exception in this.Both Kalua and Deeti are running away from persecution. They have secrets. Kalua is a lower caste man, and Deeti a young widow. Soon after her husband dies, her in-laws want to do 'Sati' on her– which means they want to burn Deeti along with their son's body. Kalua, an able-bodied man saves her from the pyre and sails her through to a save destination. Deeti, though never happy in her marriage, happily accepts the unexpected change and agrees to be Kalua's wife. Caste transgressions are unheard of especially in rural India even today; one can imagine what it would be like then– two centuries ago. Therefore, they run and run and somehow finds themselves on Ibis in a pursuit of refuge where the demons of caste cannot seek them.One of the chief flaws in the novel is the depiction of the scene in which Kalua, though able-bodied and powerful, a low caste someone who has always lived on the periphery, saves Deeti from the pyre and disappears with her in broad daylight amidst a vast crowd of people. This becomes even more improbable that Kalua despite his immense strength can initiate such a fete. Just prior to this incident, quite in the beginning, we see how is brutally treated, insulted and almost raped by a few upper caste men in his village. So the whole scene in which Kalua acts like a James Bond reeks of a third-rate Bollywood film.Now, what is good about the book: its historical details, and varied themes. For instance, globalization plays a key role in the book. The movement of people, of good, culture, mingling of languages all play out on Ibis. In addition to themes of identity, alienation that emerge in the lives of several characters. There are also claims in the book that might seem untrue even to modern Indians but are historical facts such as that two centuries ago the Indian seamanship is the most advanced and sophisticated in the world.History is a strange creature that cannot be tamed into neat categories. This whole notion that British cruelly exploited Indians and India–though true–is not the Truth. In the novel, we see how vast majority of Indians are themselves engage in selling, managing, exploiting and trading the already impoverished Indians. And in hinterlands, a mass of the population is hugely burdened with local conflicts and regional politics, and is seeped in gender and caste-related atrocities. The book shows us unpleasing and queer dimensions of the world of yore and manages to draw parallels with the contemporary world. Globalization, with all its pluses and minuses, started much earlier than what we like to believe."}, {"userName": "Jaya", "userReviewDate": "Feb 05, 2016", "userURL": "http://www.goodreads.com/user/show/31691644-jaya", "userReview": "And this is how you write a historical fiction."}, {"userName": "Petra X", "userReviewDate": "Apr 26, 2009", "userURL": "http://www.goodreads.com/user/show/1237196-petra-x", "userReview": "If I had known this book was the first part of a trilogy - the other books as yet unwritten - and that the book was not complete unto itself, in other words, this saga is a serial rather than a series, I would probably not have bought it. And then I would have missed a book interesting for its historical period (the Opium Wars with China) about which I knew nothing, for its finely-drawn characters and general good-all-round storytelling. This is really a 5-star book, but I am only giving it 4-stars because any serious review would be a spoiler, and this book is so good I wouldn't want to do that, and because I am pissed off at the author for finishing the story quite arbitarily and without having published the next chapter, the next book in the trilogy. All I can say to Amitav Ghosh, is hurry up man, I'm waiting, what happens next???"}, {"userName": "Rebecca McNutt", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/36977686-rebecca-mcnutt", "userReview": "Sea of Poppies is an excellent and superb story of people thrown together in an adventure that will affect them all forever."}, {"userName": "Doug Bradshaw", "userReviewDate": "Nov 13, 2010", "userURL": "http://www.goodreads.com/user/show/808994-doug-bradshaw", "userReview": "This is quite a book and I have given it five stars because it is brilliant, well researched, beautifully written and right up there with some of the very best, similar in some ways, for example, to the Master and Commander series. However, I have a few observations and comments to make. The fat lady hasn't quite sung yet. 1. This is the first book in a trilogy. It ends with only two loose ends tied of dozens and dozens. There was some retribution in the end of the book but it came at a huge cost. I became emotionally tied to many of the characters and I love many of them and yet I don't think I ever shed a tear. I may, however, in the future.2. One of the main themes of the book was to show how unfairly governments (mostly the Brits), rulers, the caste system, people of greater status over those of lesser means, powerful businessmen, captains and officers on board the ship and many others, rule over other people. Although I believe this picture was a very accurate picture of reality, it's sometimes almost too much to bear. We have to go through every painful detail of every evil deed and the world almost seems like it's literally hell with very little heaven. That said, there are some very heroic and excellent moments of sacrifice and good. But it's primarily a very dark picture of much of humanity, at least of that era of India which was under British rule at the time.3. The book is full of slang, pigeon (pidgin), and many different languages and dialects that are all mixed into the text. Rather than spending a lot of time trying to sort through that, it's better to plough through it all because much of it isn't very important. It has it's own rhythm and authenticity, but I actually feel that it was a bit showy and even a little lazy. I remember one page early on in the book that had maybe twenty different Indian words for different foods, clothing and other non English words and I thought, how ridiculous. Is this written primarily for those few people who speak both languages and know the historical usages of these words? Oh you're such a scholar, Ghosh. I think an excellent addition to the book would be footmarks that clearly outline the usage of these words. He started doing that with the \"Chrestomathy\" in the the back of the book but I found it fairly unhelpful unless I were to make a real study out of it like he did.4. Although there is a lot of fairly graphic sex, violence and R rated material, it doesn't come across as X rated. It is couched in kind of a conservative and even naive approach to the activities that are going on. It seems to me that Ghosh's Indian roots and background come out more here, especially in the way he portrays sex and relationships, than in some of the obvious ways such as his phrasing and use of certain words, etc. His English is just excellent. But the almost scholarly and then practiced talk about crude things going on seems embarrassing to him but necessary to include to make it all appropriately told. I had to read a couple of pages twice or three times to make sure he is telling us that one of the main characters is gay (although don't think of modern day gay, think more of a twisted, uneducated creep who has never known what a male/female relationship is and is satisfied and trained to like whatever sex is between men in prison or on long voyages at sea). I would be interested to get a gay man's take on this. I have a lot of other thoughts that would be fun to discuss with someone who has recently read the book. Much of my judgments are held until I read the next two books. This could end out to be one of the top historical fiction series ever written. Or not. I think the rave reviews are deserved and that this book is a huge accomplishment. I'm looking forward to reading book two. I've searched the internet for updates on the second book. If you have one, please let me know. I wish it were available now."}, {"userName": "Fiona", "userReviewDate": "Nov 15, 2008", "userURL": "http://www.goodreads.com/user/show/1356469-fiona", "userReview": "First read: Nov '09Sea of Poppies is the first book in the Ibis trilogy and I simply can't wait to read the second. Unfortunately Ghosh took four years to write this one and according to an interview hasn't even started the next ones yet. I do hope he doesn't leave us hanging for too long because this book definitely leaves you wanting to read more.Ghosh is a fantastic author and I truly want to read more of his books. Sea of Poppies, compared to the other books of his I have read (The Hungry Tide and The Glass Palace feels a lot more 'novelish' then his others. I feel he had a lot of fun with this one more so then his others. Set just before the Opium Wars, the book takes you on a journey through India, drawing people from all over to bring them to the ship - the Ibis. Sea of Poppies introduces you to the cast of characters that will propel the rest of the trilogy onwards through the coming journey. Each of them some how, has been touched by the poppy seed, the opium trade which the British colonists forced India into producing.The British are represented by Ghosh as unsympathetic buffoons in a way that it a little too much like a caricature but I think this was his desired effect. He did not wish to give them personality or individuality. As a whole, they are not to be liked. Immediately upon starting this novel, you are wrapped in the smells, the touch and the language of India. Ghosh seems to have swallowed a dictionary and has given each character their own way of speaking. The language of the lascars I found to be a bit confusing at first but after a while you find yourself immersed. What’s interesting I thought was how a lot of Indian words infected the British people’s vocabulary. “dekko” meaning ‘to look’ for instance is quite commonly used. Such words become self explanatory in the context used and each add a little bit of colour to the way Ghosh paints his story. Each character has a different way of speaking – from educated English, Bhojpuri, Hindustani, Lascari among others.I really enjoyed this book, enough to give it a generous five stars. If GR had half stars perhaps it would have been a 4.5 instead. I think it will be a magnificent trilogy and I am just dying to read more. Maybe I will have to settle with reading the other books by Ghosh in the meanwhile."}, {"userName": "Chrissie", "userReviewDate": "Apr 28, 2008", "userURL": "http://www.goodreads.com/user/show/632247-chrissie", "userReview": "This book really disappointed me. I have always loved Ghosh's books, so I would have to call this a big let down. The book needs a glossary listing Indian terms. Perhaps the dialog was made more authentic through these terms, but it also became impossible to understand the what was being said. Most paragraphs had terms that were not defined - neither in Wikipedia or any dictionary I could find on the net. Only a few of the terms can be found on the net. A few I knew from previous reading, but MANY I could only guess at from the context. This was very annoying and wrecked the book for me. I did not enjoy the plot. In addition,, the book synopsis here on GoodReads is not correct. The purpose of the voyage of the schooner Ibis was NOT to fight the 19th century's opium wars. Not at all! Finally, I could not become attached to any of the characters since often I had difficulty understanding what they were saying. A big disappointment from Ghosh. Read his earlier books; they are very good."}, {"userName": "Praj", "userReviewDate": "Jul 21, 2010", "userURL": "http://www.goodreads.com/user/show/3381634-praj", "userReview": "Deeti, Kalua, Zachary, Serang Ali, Paulette, Neel and Baboo Kissin, I am afraid I have to abruptly dismiss our modest tea party. The biscuits are soggy, sandwiches are musty and the Darjeeling brew is insipid. So slip me some \"black tar\" and I’m off to the land of nocturnal rainbows bedecked with copulating gremlins.Sea of Poppies irrespective to the fact of it being the preamble to Ghosh’s Ibis trilogy and the onset ambience of the epic Anglo-Chinese Opium War,falls short in capturing my nomadic temperament through its plain narrative and wobbly interpretation of its characters. Ghosh enthusiasts would decidedly contradict this retort labeling my Machiavellian analysis as act of lunacy or vernacularism (as this book was highly recommended by several 'neighborhood bookworms'). With the prospects of burning torches likely to be flung, SCREW YOU FUCKERS!!!! Comprehending this manuscript was a dreary stupor compelling me to seek solace in Pynchon’s The Crying of Lot 49."}, {"userName": "Whitaker", "userReviewDate": "Jul 16, 2014", "userURL": "http://www.goodreads.com/user/show/1415047-whitaker", "userReview": "I thoroughly enjoyed this trilogy for its rich historical detail and its playfulness with language. Ghosh writes of the opium trade and the First Opium War. He’s clearly done a ton of research into all aspects of the trade, and it was a real history lesson not only on the events of the First Opium War but also the society, culture and economics associated with the opium trade. This is simultaneously the trilogy’s strength and its weakness. The opium trade and the First Opium War are the primary focus of the trilogy, and the story and its characters are shoehorned into a structure designed to cover all the main effects of the trade and the war, and especially its effect on Indians. Each instalment of the trilogy covers one key part of the opium trade and war. And, notwithstanding the dozens of subplots, in each instalment there are two main stories fitted into a setting that best allows Ghosh to talk about that part of the trade and war that the instalment is dealing with. The two main stories act as a counterpoint to each other: one is love story, and the other is a story of a life affected by the opium trade and war. The entire trilogy can be diagrammed as follows: \nSea of Poppies\nHistorical focus: The cultivation and manufacture of opium forced upon Indian peasants by the East India CompanyMain story 1: Love story of Deeti and Kahlua Main story 2: The framing and imprisonment of Neel Rattan \nRiver of Smoke\n Historical focus: The smuggling and trading of opium in China, in particular the Parsi merchant community in China selling their small quota of opium alongside the far greater trades allotted to the EnglishMain story 1: Love story of Robin Chinnery and JacquaMain story 2: The attempt by Bahram Modi to boost his family fortunes\nFlood of Fire\n Historical focus: The First Opium War and the seizure of Hong Kong, in particular the Indian soliders that helped to fight the opium wars against the ChineseMain story 1: The love quadrangle of Cathay Burnham, Captain Mee, Zachary Reid, and Paulette Lambert Main story 2: Kesri's experiences as a solider in the First Opium War I loved all the history but how you feel about the trilogy, especially its second and third instalments, will depend greatly on how you feel about the historical taking precedence over the purely fictional. The artificiality of the structure is less evident in the first. But if you go into the second and third volumes expecting to see the stories of the characters in the first volume continue and unfold, you are going to be sorely disappointed. As the diagram indicates, the key characters differ in each instalment and while Ghosh does more or less resolve the plot threads of each of the characters he introduces, these can be dealt with in a rushed and perfunctory fashion. For example, Robin Chinnery, a main focus in the second novel, is dealt with in a single line in the last novel. Other characters like Jodhu and Serang Ali, so important in the first novel, are reintroduced in the last novel but in an entirely half-hearted manner. In a sense, the characters are the backdrop to the history rather than the other way round. For all its historical focus, the driving force behind his tale is his anger about the greed and rapacity of capitalism. In the light of Trump, a presidential candidate whose main boast was wanting to be greedy for America, the following choice quotes feel a little too terrifyingly relevant to our time: … he remembered that Ma Taramony had always said that the present era – Kaliyuga, the age of apocalypse – was but a time of wanting, an epoch of unbounded craving in which humankind would be ruled by the demons of greed and desire. It would end only when Lord Vishnu descended to the earth in his avatar as the destroyer, Kalki, to bring in a new cycle of time, Satya Yuga, the age of truth. Ma Taramony had often said that in order to hasten the coming of the Kalki a great host of beings would appear on earth, to quicken the march of greed and desire. … …It is the destiny of the English to bring about the world’s end; they are but instruments of the will of the gods… inside [the warship, the Nemesis,] burns the fire that will awaken the demons of greed that are hidden in all human beings. That is why the English have come to China and to Hindustan: these two lands are so populous that if their greed is aroused they can consume the whole world. Today that great devouring has begun. It will end only when all of humanity, joined together in a great frenzy of greed, has eaten up the earth, the air, the sky. ….That view of capitalism is one I can definitely sympathise with. Highly recommended, but with the above caveats."}, {"userName": "Nancy Oakes", "userReviewDate": "Jul 31, 2008", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "Very broad in scope, Sea of Poppies is nonetheless an enchanting read, one that had me stopping normal routine so as to get back to it every time I had to put it down. Before you read this, however, you should know that it is designed as the first entry of what will eventually be a trilogy based on the ship Ibis and a group of people who, for whatever reason, found themselves aboard her. I say this because without understanding this point, you may feel a bit cheated by the ending of the novel.This was the first book I've read by Amitav Ghosh, and while he's writing his second book in the trilogy, I'm going to backtrack and read some of his other work. In Sea of Poppies, the story is divided into three sections: Land, River, Sea, moving the story along from the introduction to all of these very colorful characters to their assembly and journey on the Ibis (which used to carry slaves and now transports workers and convicts to Mauritius). The characters range from a young widow whose fate would have been to join her husband in death in sati, or throwing herself into his funeral pyre, which would elevate the status of her husband's family, to a group of lascars who will crew the Ibis, headed by a chief who seems to have his own agenda as regards the second mate, one Zachary Reid, a freedman from Baltimore. There are also a group of people being transported to work in Mauritius, many of whom were caught up in the cycle of being forced to grow poppies for the British opium trade with China. There is also a raja who has been brought down via a cocked-up set of false charges, and a half-Chinese opium addict who is the raja's cell mate in the brig. Others rounding out the list are the daughter of a French botanist who came late to colonial propriety, and one Baboo Nob Kissin, who feels that he has another's soul inside of him. Each one of these people has his or her own story, and these are woven into the fabric of the novel as the tale progresses. Underlying most of their stories is the hard and fast fact of British colonialism in India -- and all of its accompanying hypocrisy and self-imposed superiority.Sea of Poppies is a wonderful tale on a grand scale and I can recommend it very highly. Don't get frustrated with the ending, though; look at it as the start of an epic adventure."}, {"userName": "Kay", "userReviewDate": "Mar 07, 2011", "userURL": "http://www.goodreads.com/user/show/241691-kay", "userReview": "\"The truth is, sir, that men do what their power permits them to do. We are no different from the Pharaohs or the Mongols: the difference is only that when we kill people we feel compelled to pretend that it is for some higher cause. It is this pretence of virtue, I promise you, that will never be forgiven by history.\"Sea of Poppies wrestles with the complex moral questions of the opium trade in an unexpectedly emphathetic way. There are the producers, users, and traffickers, all with complex motivations and needs, and then there are the untold thousands simply swept up by the tide of the opium trade. Ghosh's magisterial novel connects the lives of a disparate set of characters, ultimately placing them on board a ship, the Ibis, headed for Mauritius. While the plot is too complex for neat summary, a resonant theme is transformation and rebirth. Several characters experience precipitous falls from grace and yet also find redemption. The central character, Deeti, is a simple woman who finds she has more strength than anyone ever expected, while another character, rajah Neel Rattan Halder, finds friendship and solace in the most unexpected of companions. Ghosh's characterization and pacing are superb, not to mention he wields effortless control over imagery and language. I never found myself growing impatient at the lyrical descriptive passages; instead, these somehow illuminate the very souls of the characters. Having recently come back from a trip to India, I was once again intoxicated by the sights, sounds, and smells of India as depicted in this gorgeous novel.Halfway through the novel, I discovered Sea of Poppies was the first novel in a trilogy. At this writing, the second novel has yet to be published. I'm hoping, of course, to find the second novel as rewarding as the first. I'm also hoping another audiobook version narrated by Phil Gigante will be produced, for he is an excellent narrator for this work."}, {"userName": "Nandakishore Varma", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/6237864-nandakishore-varma", "userReview": "For all the hype it has generated, this book was sorely disappointing. It is a very fast read, and a good adventure yarn...and that is all. From a booker prize nominee, I expected something more.The characters lack depth. The bad guys are evil, the good guys good. And some, like Nob Kissin Pander, are ludicrous. The story goes at a breakneck pace without stopping for a moment to consider, rather like a well directed bollywood movie (only the songs and dance numbers were missing)! There is a lack of atmosphere. All the while I found myself comparing this novel (to its disadvantage) to Paul Scott's The Raj Quartet, which was poignant in its capture of the dying days of the British Raj.And lastly...this is not a novel, but a part of one. The story stops too abruptly."}, {"userName": "Christopher", "userReviewDate": "Sep 30, 2008", "userURL": "http://www.goodreads.com/user/show/664158-christopher", "userReview": "I had forgotten how annoyed I was at The Glass Palace; only to be remembered during Sea of Poppies.A group of random individuals end up on a former slave ship as it makes it way from India to China during the opening years of the Opium Wars, in the first half of the 19th century. It's a good yarn, although intended as the first in a series of three, don't expect anything like a complete story here - Amitav Ghosh practically lets you off mid-sentence.Whilst a colourful story, the characters are somewhat generic, and I think his discourse on colonialism was simplistic to say the least. A strangely unfulfilled read - but then, so was The Glass Palace."}, {"userName": "Helen", "userReviewDate": "Jul 28, 2017", "userURL": "http://www.goodreads.com/user/show/33424987-helen", "userReview": "3.5 stars Sea of Poppies is set in the backdrop of the opium trade and serves as a brilliant example of how simply reading history books on a subject can sometimes only gives you a limited insight, whilst historical fiction can offer a more humane dimension to our understanding of a past event. I have briefly studied the Opium Wars in the past, but after reading this book I have a whole new understanding of the wider repercussions of Britain’s involvement with opium and how the trade affected everyday people in India as well as China, which traditionally gets the most attention. Much of the focus of the book is on the devastating impact the cultivation of opium had on Indian farmers, as fields of crops were forcibly converted into poppies which were then refined and sold by the British to Chinese markets. The story opens sometime in the 1830s, on the eve of the first Opium War between the British and Chinese. There is a huge cast of characters and every one of them has been affected by the opium trade in some way, however indirect or trivial. The cast includes, among others, a young French woman, an Indian widow to opium, an American freedman and a disgraced former high-caste landowner, all of whom converge on the Ibis, a ship bound for a plantation in Mauritius, at the apex of the novel. The writing can be a bit confusing for someone new to Indian culture because Ghosh doesn’t shy away from using the appropriate Indian term or title for something, but this just added to the novel’s authenticity. For the most part I understood what was going on but there was one character whose slang was massively over the top, making his dialogue utterly incomprehensible. It got to the stage that whenever I saw his name I would immediately skip onto the next paragraph and not even attempt to decipher his butchered attempts at English. My enjoyment and rating of this novel really fluctuated from one chapter to the next. Some parts of the novel, usually those from the perspectives of Deeti and Rajan, I flew through but others felt excruciatingly slow and were weighed down by unnecessary descriptions or information dumps about their childhood. Simply put, there were too many characters, a problem exacerbated by the fact that several had very similar sounding names so I kept thinking one description was referring to one character before finding out a chapter or so later that it must have been referring to someone else. Even though every character was given their own mini biography upon being introduced, I never felt particularly attached to any of them. In fact, any one of them could have been violently killed at any point in the story and I wouldn’t have given a fig. This is not the mark of a great novel. This really sums up my main issue which this novel. It was very informative and interesting, but it didn't make me feel anything. It was simply an informative way to pass the time and nothing more."}, {"userName": "Ana Ovejero", "userReviewDate": "Mar 12, 2016", "userURL": "http://www.goodreads.com/user/show/45220423-ana-ovejero", "userReview": "Being set in India, during the Opium Wars between England and China, this monumental story tells the lives of several characters, from different castes and ideological perspectives, narrating the tumultuos times they have to survive. Amitav Ghosh is a master of storytelling, unravelling a plot in which everycharacter embarks themselves in a journey that will lead them to a ship, the Ibis.The story begins with Deeti, a shy woman who struggles growing poppies to sell to the Opium factory. Unhappily marriage, she is devoteed to her daughter who she wishes would have a different future. With her, we learn of Kalua's fate, an untouchable ox man who takes Deeti's husband to work everyday.In the Ibis, we find Zachary Reid, a sailor, new to the business and the only survivor of the journey that finishes in India. With the support of the lascars, especially their leader Serang Ali, he becomes the second in command of the ship. This is to become an opium trader, but before, it will take coolies (Indian workers) to the Island of Mauritania.In Calcutta, we find Paulette, a French orphan, being taken care of by Mr. Bhurman, an important dealer in the opium trade. She has been brought up in an unique way, being her father a botanistin the Imperial Gardens. She considers Jodu, a young Indian boy, as her brother. He wants to become part of the crew of the Ibis, having to face dangers and perils to do so.We also have the story of the Rajah Neel Rattan Halder, who the previously mentioned Mr Brhuman forces to sell his properties in order to pay his late father's debts.As you can see, Ghosh introduces this diversity so as to display the multiculturality of India at the times of the colony in contrast to the imperialist view of one people talking English and having the ultimate desire to become like their English masters. This adventurous tale unravels magestically, the destinies of the different characters becoming one, sailing the Black Water, finding a future in an another land, a new home."}, {"userName": "Joshua Rigsby", "userReviewDate": "Jan 21, 2016", "userURL": "http://www.goodreads.com/user/show/12022033-joshua-rigsby", "userReview": "A wonderful book. Ghosh's attention to character and affection for language brim to the top of every page. It was wonderful to see the opium trade from a multiplicity of perspectives, classes, idioms, and ethnicities. He does get a little too specific with his jargon at times, leaving the reader to grope around the context for possible meanings, but this is my only minor qualm. I'd recommend this book to anyone. http://joshuarigsby.com"}, {"userName": "Daren", "userReviewDate": "Aug 18, 2012", "userURL": "http://www.goodreads.com/user/show/11995655-daren", "userReview": "I recently picked up a copy of the third in the Ibis Trilogy, Flood of Fire, and given it was about 6 years since I read Sea of Poppies, and perhaps 4 for River of Smoke, I thought I had better re-read these before the finale.I enjoy the writing of Amitav Ghosh a lot. I find his descriptive imagery builds up the setting and scenery as the story progresses excellent, and his depth of characters is great. While his writing s filled with words foreign to me - some common enough to be known, some not - including in this case a lot of nautical terms, I don't find this distracts from the narrative. If anything, this adds to the atmospheric writing, as in most cases these words are not central to the description, and not knowing exactly what they mean doesn't change the understanding of what is happening. Others may find the clutter of words distracting, or off-putting however, or be frustrated by being unable to find definitions for the unusual spelling of some of these words. For example:In this floating bazar there was everything a ship or a lascar might need: canvas by the gudge, spare jugboolaks and zambooras, coils of istingis and rup-yan, stacks of seetulpatty mats, tobacco by the batti, rolls of neem-twigs for the teeth, martabans of isabgol for constipation, and jars of columbo-root for dysentery: one ungainly gordower even had a choola going with a halwai frying up fresh jalebis.And to the characters - the novel covers a wide range of main characters, and it is fair to say that this first book is the background of these characters, woven is such a way that they all end up in the same place at the same time - on the Ibis, departing Calcutta for Mauritius. This book is almost fairytale in some of its characterisation - the good are good, and the bad are bad, but the woven stories are great. I enjoy the chapters being broken into small sections for separate characters, so we stay with each for only a few minutes of reading at at time. This allows the story to stay apace for each of them, and means we don't have to dip backwards and forwards in time, instead running over the various goings on almost concurrently.There a a lot of themes involving the characters of the book - caste is a major one, and of course the morals of the opium trade, British colonisation, and reinvention of ones self. There are betrayals, a fall from grace, an attempt at Sati (or a wife joining her dead husband on his funeral pyre), There is some well researched deception in the book too - two examples of this are the visit by Deeti to the Opium Factory, where the various buildings and their functions, as well as the workers jobs are explained in great detail; the other is on the Ibis, where the sailing, the terminology and the yelling of commands are all great. The prison, and the life in the hold of the ship are two other settings that come to mind as richly painted scenes. All come across as very believable for 1830's life.I have avoided comment so far on the abrupt ending to the book. For me this isn't an annoyance (although I remember it being the first time around), as the second and third books await, but it is fair to say that this book is really about starting the threads of the characters, building the background, and getting them all on their way out to sea. It gets us out of India, and sets up for the arrival in the new settings for book 2.I gave this four stars first time around, and that hasn't changed in my second reading."}, {"userName": "Ashley", "userReviewDate": "Jun 12, 2010", "userURL": "http://www.goodreads.com/user/show/3863644-ashley", "userReview": "I almost considered not reviewing this, but I’d made a resolution to myself that I would post about every book I read for the sake of crystallising what I took away from it. To put this book in perspective: I’ve started reading with post-it flags to mark passages I love or things that I want to come back to when I write about it later. I didn’t mark a single passage in Sea of Poppies. Not one post-it flag. The only thing I considered marking was a passage that was hilariously difficult to follow.I’m not saying it was terrible, but my overriding impression of it revolved around the use of outdated language. I assume what happened was that Ghosh spent months researching the precise way that certain classes of people would have spoken at the time of the book’s continuity. But rather than enhancing the realism of the book, it (a) feels like Ghosh got too bogged down in the details of language instead of making the character bounce off the page; and (b) completely blocks your ability to understand what’s happening in parts. E.g:There was green turtle soup, served artfully in the animals’ shells, a Bobotie pie, a dumbpoke of muttongosht, a tureen of Burdwaun stew, concocted from boiled hens and pickled oysters, a foogath of venison, a dish of pomfrets, soused in vinegar and sprinkled with petersilly, a Vinthaleaux of beef, with all the accompaniments, and platters of tiny roasted ortolans and pigeons, with the birds set out in the arrowhead shapes of flocks in flight. The table’s centrepiece was a favourite of the Bethel bobachee-connah.That’s just one example, and the first one that I came across while flicking through the book. I don’t see what the point is of a list like that is, other than setting a scene. And if the words themselves don’t correspond to an image (e.g. if you have no idea what the words mean), then it fails in that job. And to be honest, it takes quite a bit of digging to discover what these words mean (“dumbpoke” apparently correlates to “dum pukht”, or “slow cook”. “Petersilly” might be “petersillie”, which is German for parsley - when these are English people living in India, the reasons for their using German words for spices is beyond me. And I still have no translation for “bobachee-connah” -I assume it means something like ‘master of the house’, but any googling leads me to quotes from the book itself). And in some cases, they’re entirely useless (in this passage, “muttongosht” is used when “mutton” could suffice).We’re talking here about a 470 page book that’s written in this manner. It’s frustrating. I was always told that the more invisible the writing style, the better. If writing sutures you into the milieu of the book and allows you to forget that you’re even reading altogether, then that’s ideal. Sometimes I’m okay with a noticeable writing style if it’s clever (e.g. Special Topics in Calamity Physics), but if I notice it and I dislike it, I suddenly find it difficult to lose myself in, or even enjoy the book. Unfortunately, that was the case here."}, {"userName": "Richard", "userReviewDate": "Nov 05, 2008", "userURL": "http://www.goodreads.com/user/show/1047783-richard", "userReview": "t's good to hear (though it's unconfirmed,) that \"Sea of Poppies,\" is part one of a projected trilogy, because although it's a beautifully styled (I'd say extravagantly written,) completely engaging, well researched work of historical fiction, it closes without a satisfactory end. Three stars as a stand-alone, (despite its many merits, and because of the ending;) five stars if it is, indeed, installment one. Beautifully styled - extravagantly written. I've not read other works by Amitav Ghosh, so I'm not familiar with his stylistic strategies, but \"The Sea of Poppies,\" is written with the love of language I've come to expect from Indian novelists. Mr. Ghosh has captured both the English and the \"Hing-lish,\" of the Victorian Age, and enriched it with a delightful and descriptive patois and pidgin. I don't know how much Mr. Ghosh has invented whole cloth, and how much is a result of research, but it's hugely entertaining, and perhaps near genius. Yes, it does leave you slightly at sea in terms of full understanding, but I find that to be part of the charm. (I've nodded my head in befuddlement in many countries.) It reminds me of the language recorded in the Booker Prize winning, Sacred Hunger\" by Barry Unsworth, another beautifully written novel about fretful times. Well researched. Even as a student of India, the scenes and details of \"The Sea of Poppies,\" were new to me. Village life, city life; the tics, prejudices, and beliefs of the hoi polloi as well as the ruling classes; the facts and lore of the opium trade, the merchant life, and life at sea are all well limned and thoroughly convincing - and enchanting, though not in the whimsical sense that word is usually employed to describe. The description of a walk through an opium refining plant is worth the price of admission. Mr Ghosh engages all the readers' senses in his detailed portrayals of character as well as location. You can smell the ship, \"Ibis,\" not pleasant, but... Totally engaging. I can't say as I experienced a dull moment. It's a romance, an adventure, a history all combined with a colorful cast of characters and exotic settings."}, {"userName": "Dyuti", "userReviewDate": "May 31, 2013", "userURL": "http://www.goodreads.com/user/show/5486168-dyuti", "userReview": "The Sea of Poppies is the first installment of the Ibis trilogy, penned by one of the foremost story-tellers of modern India, Amitav Ghosh. This is my second tryst with him, (the first being The Hungry Tide which got me so emotionally engaged that I actually cried when of the characters died)so I was expecting some good stuff. I was not disappointed. I really liked this book too.Imagine India, 1838. The farmers are being forced to give up growing life sustaining crops like rice and vegetables, to make way for useless opium. Useless to the farmers, yes, but highly profitable to the East India Company. Soon, the lives of the farmers in North Central India to the landed gentry, or the zamindars of Bengal turn upside down, with the power of that intoxicating drug, which soon brings out the best in some men, and the worst in others... Thus, we join along in their lives, as they endeavour a journey to face what destiny has in store for them...Even though I'm not much of a fan of stories having multiple parallel sub-plots based on different characters (I always end up liking some more than the others, so feel bored when those less fortunate characters take up the space in the intervening chapters ), Ghosh made each of them so endearing that I was compelled to give them my fair share of notice individually. He is indeed a master story-teller. Not only was the book very minutely researched, it was deeply engaging. After spending two entire nights staying awake with the book, I found myself living the story. It was that real.Also, I found some of the scenes from the book really funny. Specially the ones concerning Nob Kissen and Zachery. Of course, you'll get the jokes better if you're an Indian, or acquainted with Indian culture.However, the end of the story left a lot of unanswered questions. I can't wait to read the second part, and know what happens next. So, I give it a double thumbs up, and highly recommend it! :)"}, {"userName": "Arvind", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/8676317-arvind", "userReview": "Flawless and unputdownable - The unusual setting in d 1830s, d varied cast (castes too !) drawn from all strata of society and from d US, Englishmen, Indo-French, African/Asian crewmen, Indian farmers, untouchables, aristocracy, bureaucracy... All of the threads getting complete attention and as usual the meticulous Ghosh detailing leaves u spellbound in d first half.However, after d setting is established, u realise that Ghosh is telling a fantastic story with episodes showcasing every human emotion and yet bound to a plot. Also, like a great story, u dont know whats going to happen next and d history/commentary is underplayed.This is surely d best Historical fiction i ve read, a notch above Follett's well-loved Century trilogy. And that reminds me, thanks to d author, because a trilogy does justice to his genius; The Glass Palace felt abrupt at times.PS:- Many like me maybe were scared of the dialect especially as it appears soon in d 2nd chapter itself. Plz brave out a couple of chapters and u will find urself enjoying d puns and ur mind will auto speak d same dialect when d character appears next. There is good comic relief too."}, {"userName": "Scarlet", "userReviewDate": "Aug 26, 2012", "userURL": "http://www.goodreads.com/user/show/3839903-scarlet", "userReview": "3.5I understand why this would be Booker nominated. Seriously, I do. Sea of Poppies is a great book; I just feel it wasn't the book for me. Some parts were absolutely memorable, some were not.What was great: The book features a multitude of characters - an eclectic mix of people from different backgrounds, religions, races, countries - and each has their own special place in the story.What was not-so-great: While I absolutely loved some of these characters, I couldn't care less about the others. Deeti's track was the standout. I didn't care much about Neel Rattan as a king, but his parts as a convict changed my mind. Zachary and Paulette were too predictable. And Baboo Nob Kissin was plain ludicrous.What was great: The book sweeps an immense landscape, whether on land, river or at sea.What was not-so-great: I'm not a fan of the jargon. Nearly everyone speaks in a mix of Hindustani and English, and there were so many words that I didn't understand. Deciphering the lingo was sometimes annoying.What was great: Without question, the star of the show is the Ibis. I loved how the ship connected everyone together, how it linked each of their stories with the others, how it bred some beautiful and dynamic relationships among all these seemingly disparate personas. Everything fit in seamlessly.What was not-so-great: Just when the story started to grow on me, the book ended. Just like that.Bottomline: I'm more impressed with the author than the book. The amount of research that's gone into writing Sea of Poppies is stunning, and I'm in awe of Amitav Ghosh. I would love to read some of his other works...The Calcutta Chromosome, maybe??"}, {"userName": "Shayantani Das", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/5686305-shayantani-das", "userReview": "Read it as part of my literature of contact, comparative lit course. It is remarkable in its lucidity and attention to detail. I can not even imagine the amount of research that goes into writing a book like this. Character developments could definitely have been better but I love Ghosh's rendition of the landscape and his experimentation with the language. The book ended very abruptly, so might as well get a hold of the entire trilogy before you begin this journey."}], "description": "At the heart of this vibrant saga is a vast ship, the Ibis. Her destiny is a tumultuous voyage across the Indian Ocean shortly before the outbreak of the Opium Wars in China. In a time of colonial upheaval, fate has thrown together a diverse cast of Indians and Westerners on board, from a bankrupt raja to a widowed tribeswoman, from a mulatto American freedman to a free-spirited French orphan. As their old family ties are washed away, they, like their historical counterparts, come to view themselves as jahaj-bhais, or ship-brothers. The vast sweep of this historical adventure spans the lush poppy fields of the Ganges, the rolling high seas, and the exotic backstreets of Canton.", "title": "Sea of Poppies\n      \n          (Ibis Trilogy #1)", "url": "http://www.goodreads.com/book/show/1330324.Sea_of_Poppies", "average": 3.93, "cover": "https://images.gr-assets.com/books/1327376395l/1330324.jpg", "reviews": 2112, "authors": [{"url": "https://www.goodreads.com/author/show/3369.Amitav_Ghosh", "name": "Amitav Ghosh"}], "type": ["Fiction", "Historical", "Cultural", "Historical", "Cultural"], "outlinks": ["http://www.goodreads.com/book/show/1330324.Sea_of_Poppies", "http://www.goodreads.com/book/show/27241258-sea-of-poppies", "http://www.goodreads.com/book/show/6328854-sea-of-poppies", "http://www.goodreads.com/book/show/4912414-sea-of-poppies", "http://www.goodreads.com/book/show/3619371-sea-of-poppies", "http://www.goodreads.com/book/show/11866478-sea-of-poppies", "http://www.goodreads.com/book/show/3424867-sea-of-poppies", "http://www.goodreads.com/book/show/6216379-sea-of-poppies", "http://www.goodreads.com/book/show/4912413-sea-of-poppies", "http://www.goodreads.com/book/show/77103.The_Glass_Palace", "http://www.goodreads.com/book/show/4950.The_Hungry_Tide", "http://www.goodreads.com/book/show/9783627-river-of-smoke", "http://www.goodreads.com/book/show/109307.The_Shadow_Lines", "http://www.goodreads.com/book/show/67100.The_Calcutta_Chromosome"]}