{"ratings": 198, "userreviews": [{"userName": "Amanda NEVER MANDY", "userReviewDate": "Nov 23, 2015", "userURL": "http://www.goodreads.com/user/show/36873041-amanda-never-mandy", "userReview": "For work I have to get so many education hours in a year and thankfully reading to obtain them is an option. Too bad it's not from a list of my choosing because we all know how absolutely relatable that would be.Two second in a title for an educational book sounded perfect. Not enough to bore, just enough to enlighten. True to it's name, it was a quick and painless read. What I walked away with, throw out your waste. What my imagination heard and will forever link it to, \"BRING OUT YOUR DEAD!\"Thanks Monty Python for making me the office leper yet again."}, {"userName": "Lori", "userReviewDate": "Feb 09, 2016", "userURL": "http://www.goodreads.com/user/show/647632-lori", "userReview": "3.5 stars. Paul Akers is quite enthusiastic about Lean and his enthusiasm is infectious. This is the perfect book to read if you are interested in Lean principles and how to incorporate them into any aspect of your life- but you tend to fall asleep reading technical books, looking at statistics, and trying to interpret various charts and maps. The chapters of Akers' book are brief, written in layman's terms, include color photos, sum everything up at the end, and are actually pretty entertaining. He also includes several links to YouTube videos and other relevant, illustrative information.Noteworthy quotes:\"Lean does not make things more difficult. Lean is focused on intentionally simplifying any process....Lean is not about working harder and more frantically, but about making things simpler. It is not just about making everything faster, but about improving the quality of everything you do. It's rarely a huge or drastic change, but baby steps in an endless drive to continuously improve everything every day.\"\"Lean is about fixing what bugs you.\"\"Everybody wins- another benefit of Lean.\"\"...I asked the VP of (of Toyota) a very direct question, 'What is the most important thing for Toyota?'...Without hesitating, he said, 'The most important thing for Toyota is people. Toyota is all about teaching and training people and building a culture of continuous improvement.\"\"My mistake had to do with my incorrect focus on processes. I needed to focus on building a culture of people who understand and embrace continuous improvement.\"\"He understood that if you made things simple, there was a much greater chance of people understanding and implementing the ideas.\"\"When money is no object we abdicate our most powerful resource: our ideas. It just gets too easy to throw money at problems and yet we see time and time again that money often creates problems rather than solving them.\"\"When humility becomes a central attribute of the Lean leadership, a vortex of creativity and buy-in will follow. When there is a culture where people know there is not an egomaniac in charge, they begin to grow and thrive.\"\"This is the spirit of a Lean culture. When the leader is willing to be corrected and has no ego issues with sharing credit, that same generous and supportive spirit flows between everybody.\"\"...I should have been making videos six years ago, but I got paralyzed because I wanted everything to be perfect. I bought all kinds of film gear and lighting and software, but I never made a video because I was waiting for everything to be perfect. Then I realized the folly of that. If you just do it, you'll learn so much by 'just doing it.' That is really the story of 2 Second Lean. If you just make a small improvement, you'll learn so much that the next improvement will be that much better.\"\"We are very deliberate in how we hire people. We look for two characteristics- people who are humble and curious. We want people who don't act and feel like they know it all. We want people who are naturally curious about life.\"\"Focus on you. Focus on eliminating your waste.... When people see how much your area has improved, how much easier your work is, how much more they can depend on you, how consistent you are and how the quality of your product improves, they will want to know how you are doing it. Then you can show them. And then they will be eager to learn and begin their own Lean journey. But do not try to get your wife, your dog, your hamster, your cat, or your co-workers to do Lean.\"\"My Favorite Principles: Make people the center focus of your life. Pursue the right thing over profit. The profit will follow. Teach and train...\"\"You can organize waste.\"\"Lean has been misunderstood to be the methodology of taking away jobs, making things sterile with little or no creativity. Lean is the opposite of that. Rarely, if ever, does it take away a single job. It creates boundless opportunities and continual employment, adds longevity for existing employees and growth for new people to be brought into the company.\"\"When I go to hire someone, I always hire for character and teach for skill. I can teach anybody to do the job, but character is a rare commodity.\""}, {"userName": "Tyson", "userReviewDate": "Feb 02, 2016", "userURL": "http://www.goodreads.com/user/show/42066312-tyson", "userReview": "Poorly written and full of dumb jokes and shameless self-promotion. My boss required my team read this book."}, {"userName": "Emily", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/43763403-emily", "userReview": "I had to read this book for my industrial arts class. It was interesting how small improvements can help your daily routine, even small ones, and how if something is bothering you, fixing it can help a lot. The first half of the book was pretty interesting but as nearing the end, it seemed to go on forever. This book is more for business owners and workers than for students but this book really connected to what my teacher is trying to do to our industrial arts classroom. Our shop class takes place in two shipping containers. Sometimes it is hard to find a place for everything. We try to consistently make two second improvements to the classroom and eventually we will be more organized and processes will be simpler. One example of a great improvement we made was putting velcro on hand sanitizer and attaching it to the wall. That way we can easily find it and it is not taking up space."}, {"userName": "Sarah Bradshaw", "userReviewDate": "Feb 15, 2018", "userURL": "http://www.goodreads.com/user/show/75571244-sarah-bradshaw", "userReview": "Entertaining, and mindset-shifting. Many applications don't apply to my life or work culture, but the mindset shifts presented in this book are challenging me to rethink my workflow and processes. How can I reduce waste? Wasted time, wasted energy, wasted resources, wasted money, wasted relationships... a lean culture is all about focusing on value-add, serving customers, and reducing waste."}, {"userName": "Joe Gee", "userReviewDate": "Mar 08, 2018", "userURL": "http://www.goodreads.com/user/show/4189093-joe-gee", "userReview": "A quick, easy introduction to lean thinking. Don't pay for it, google it. He gives it away for free, audio book too. I found his speaking energy in the audio book to be a bit distracting as he always has a \"selling\" tone. Don't stop before the extra chapters, though. He readdresses and fixes some of the gaps in the first edition."}, {"userName": "Aaron Dutton", "userReviewDate": "Oct 07, 2017", "userURL": "http://www.goodreads.com/user/show/20168356-aaron-dutton", "userReview": "When I saw the cover for this book, I expected something very cheesy. Instead I got an incredible read and my mind was opened to the world of lean. I listened to the audio edition, which I highly recommend. Akers' energy and passion are obvious and infectious. Be sure to view the videos on the website. I am not much of a video guy but they're great."}, {"userName": "John Baker", "userReviewDate": "Jan 05, 2018", "userURL": "http://www.goodreads.com/user/show/75993076-john-baker", "userReview": "AWESOME! Written at a level that EVERYONE can easily comprehend."}, {"userName": "Kollster", "userReviewDate": "Jan 12, 2018", "userURL": "http://www.goodreads.com/user/show/17682637-kollster", "userReview": "Skemmtilegt konsept sem ég er að fræða mig um þar sem vinnan er að koma þessu í kerfið hjá sér. Hentar sérstaklega vel ferköntuðu fólki eins og mér."}, {"userName": "Joaquim Reis", "userReviewDate": "Jun 02, 2018", "userURL": "http://www.goodreads.com/user/show/67538154-joaquim-reis", "userReview": "Exemplo de implementação, coragem de procurar o sucesso."}, {"userName": "Bill Whalen", "userReviewDate": "Oct 16, 2017", "userURL": "http://www.goodreads.com/user/show/47002216-bill-whalen", "userReview": "it was okay."}, {"userName": "Malik Aljabri", "userReviewDate": "May 09, 2018", "userURL": "http://www.goodreads.com/user/show/6589130-malik-aljabri", "userReview": "Finished as #AudioBook#MalikAlJabri"}, {"userName": "Melisa", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/39818764-melisa", "userReview": "High energy, easy to read with lots of good ideas .... even if you've been in Lean a while."}, {"userName": "Mtbike40", "userReviewDate": "Mar 17, 2017", "userURL": "http://www.goodreads.com/user/show/1679875-mtbike40", "userReview": "This is a great \"Lean\" read that gets to the point and helps you understand the key principles of lean thinking and lean leadership. This is the starting point of my lean learning journey and I am impressed with the ideas and concepts. I and my team could really benefit from this type of thinking, but it would be a cultural shift within our organization. Glad I read it and recommend it to others."}, {"userName": "Martin Wilson", "userReviewDate": "Aug 04, 2016", "userURL": "http://www.goodreads.com/user/show/13800883-martin-wilson", "userReview": "There is a diamond in here, but a lot of rough to sift through too.I read this book because I'm genuinely interested in continuous improvement / \"lean\", and not because I was forced to. A colleague recommended it, saying it was much more readable than the Toyota Way which he considers \"too academic\". I am now regretting my choice as 2 Second Lean is full of fluff. There are a few good pieces of advice on how to implement lean, but they are buried in long winded anecdotes and a constant barrage of boasting. You might think that would make the book too long. On the contrary, it's totally anemic, a very thin read even in the third edition with multiple extra chapters. Unfortunately being short does not mean that the scant pages are packed with good information.Most worrying, to me, is the cult-like attitude Akers adopts. A lot of his advice sound like the precepts of a religion rather than practical advice. For instance, he speaks repeatedly about how one should not try to force others to be Lean, but instead focus on one's own waste. Never criticise others for being wasteful! Look first to the waste in thine own eye. Except, I guess, if you're a manager or own your own company, at which point you have to force all your employees to undertake Lean and fire those who don't. This sounds like a very nasty setup to me, one that forbids you from criticising anyone above or around you, but encourages criticising those below you.Akers, who has never attempted Lean at any position lower than owner of his own company, has no useful advice for low level grunts pursuing Lean in a culture that has not embraced it. Instead he says, if you are a lean superstar you will very quickly succeed and be promoted to a level where you can implement lean reforms. Pray to Lean, worship Lean and you will be rewarded...One anecdote near the end stuck out to me particularly. Akers insists that anything that stops work is bad, and cites as an example, traffic lights. But what is better than the traffic light? Why, the noble roundabout of course! Roundabouts are magical and everyone always understands them. As someone who has actually lived with roundabouts, I had to shake my head hearing this.There are a few useful titbits in the middle and it does give you a broad overview of the concept of continuous improvement. If you are interested in CI/Lean but afraid of reading, this book should serve as a good primer on the subject, but I would definitely treat Akers' boundless enthusiasm with a pinch of salt.Also, don't pay for this book like I did. The eBook and Audiobook are available for free off his website."}, {"userName": "Travis", "userReviewDate": "Dec 23, 2015", "userURL": "http://www.goodreads.com/user/show/28849804-travis", "userReview": "This book should be re-named \"Lean: My Excuse for Living an OCD Life\". While it's fun to hear Paul's passion for Lean, for his company and for life in general, the contents of the book are half-baked at best. Paul shares a lot of interesting stories, most of which are self-promoting. Through all the stories, the takeaway is, unfortunately, limited to reducing waste. While it's true that reducing waste is a key component of Lean if that's where it ends the entire point of Lean is missed. Lean is about maximizing customer value through a reduction of waste, not just eliminating waste. In fact, the definition of waste is any product, process or system for which the customer would not pay.Unfortunately, Paul spends a lot of time talking about eliminating things that bug him or are less efficient and very little time talking about what the customer values and focusing on that."}, {"userName": "Suhrob", "userReviewDate": "Nov 17, 2016", "userURL": "http://www.goodreads.com/user/show/1859963-suhrob", "userReview": "A very simple, basic book written in a completely straightforward, layman language.It is totally unpretentious and down to earth.I also know my rating is biased upward because I listened to the (free) audiobook narrated by Paul Akers himself and he is comes over as a very likable and enthusiastic character (which I'm sure helps his consulting career selling almost trivial stuff - I know it sounds cynical, but I think it is pretty accurate and I don't mind - this is all ok with me! :).Do I think this approach to lean is better than the other sold by other consultants... not really (I think NOBODY actually knows - there are no studies). But I don't mind... this is nice, simple, but still... neat."}, {"userName": "Peyton", "userReviewDate": "Sep 23, 2016", "userURL": "http://www.goodreads.com/user/show/3916277-peyton", "userReview": "I am researching different process improvement methods to present to my manager for review. I saw one of Paul's 'Lean is Simple' talks on Youtube and thought I'd give his free ebook a shot. It's a light read for sure, lots of boasting and anecdotes. I still enjoyed his enthusiastic tone, particularly when he offered specific methods for implementing a Lean Culture. He has a manufacturing company and I work at a nonprofit, but I still found some useful ideas that should be able to cross over."}, {"userName": "Joe Lucas", "userReviewDate": "Jan 29, 2012", "userURL": "http://www.goodreads.com/user/show/7437727-joe-lucas", "userReview": "A really fun book. Paul's enthusiasm shines thru on every page. He boiled Lean down to its basics and set out a very implementable system. I am going to apply the lessons learned in this book to my own shop."}, {"userName": "Matthew John", "userReviewDate": "Aug 29, 2016", "userURL": "http://www.goodreads.com/user/show/18678905-matthew-john", "userReview": "What a fantastic book! I really enjoyed Paul's passion for lean! FastCap is an amazing looking facility and I am going to take up the challenge of building a lean culture!"}, {"userName": "MJP", "userReviewDate": "Feb 27, 2015", "userURL": "http://www.goodreads.com/user/show/40725220-mjp", "userReview": "Very simple. Very effective."}, {"userName": "Krystal", "userReviewDate": "Feb 20, 2012", "userURL": "http://www.goodreads.com/user/show/3341349-krystal", "userReview": "An easy read, and surprisingly entertaining. I will go start on the bathroom now!"}, {"userName": "Melissa", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/2516207-melissa", "userReview": "Love the idea of a Lean Culture at work (and home). Quick, useful read."}, {"userName": "Ruth Wendt", "userReviewDate": "Feb 03, 2016", "userURL": "http://www.goodreads.com/user/show/39344795-ruth-wendt", "userReview": "Excellent book, simple and profound."}, {"userName": "Eliot Burdett", "userReviewDate": "Jan 13, 2017", "userURL": "http://www.goodreads.com/user/show/5500034-eliot-burdett", "userReview": "Consistent Incremental Improvement = huge compound returns.Four key measures of impactSafetyQuality Simplicity Speed"}, {"userName": "Dan Francis", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/3055208-dan-francis", "userReview": "He is a great speaker and his excitement about improvement is infectious."}, {"userName": "Dana", "userReviewDate": "Feb 24, 2016", "userURL": "http://www.goodreads.com/user/show/4036456-dana", "userReview": "Fantastic book about Lean"}, {"userName": "Nathalie Karasek", "userReviewDate": "Apr 11, 2015", "userURL": "http://www.goodreads.com/user/show/34691975-nathalie-karasek", "userReview": "Paul Akers has such an intoxicating and inspiring way to narrate his book that you cant help getting excited about improvement & lean. It´s real fun!"}], "description": "2 Second Lean will flip your world right-side up. It’s a practical way to improve your life every day by making a simple 2 second improvement. Join author, business expert, radio show host, and international speaker, Paul A. Akers, as he takes you on a LEAN journey that will transform every aspect your life... from your home to the office. “Ten years ago I began my Lean journey. I had never even heard the word before, but what happened was nothing short of astounding. Lean thinking has propelled my business from a small operation in my garage into an international, multi-million dollar enterprise. Welcome to my world of Extreme Lean thinking. Once you have experienced the vast benefits of Lean, you will crave it, want it, and do anything to get it. Lean thinking has made an enormous difference in my life – personally and professionally.”“This book is not intended for MBAs or those interested in manufacturing theory or flow charts. This book is intended to blast open the door of opportunity for people who want to improve their daily life, be it in their workplace or home. Lean is not as complicatedas all the experts and textbooks make it out to be. In fact, as you learn to incorporate a Lean approach to your life, you will see that the more Lean thinking you have in your life, the more you will enjoy life.” ~ Paul A. AkersRead this book and be inspired by how easy and fun it can be. No flow charts or graphs – just the real life journey of one company and the astounding results Lean thinking can produce. Take a few hours, read 2 Second Lean and change your life!", "title": "2 Second Lean: How to Grow People and Build a Fun Lean Culture", "url": "http://www.goodreads.com/book/show/13444671-2-second-lean", "average": 3.9, "cover": "https://images.gr-assets.com/books/1374082675l/13444671.jpg", "reviews": 29, "authors": [{"url": "https://www.goodreads.com/author/show/5615116.Paul_A_Akers", "name": "Paul A. Akers"}], "type": ["Business", "Nonfiction", "Self Help", "Buisness"], "outlinks": ["http://www.goodreads.com/book/show/13444671-2-second-lean", "http://www.goodreads.com/book/show/20623357-2-second-lean---2nd-edition", "http://www.goodreads.com/book/show/19416380-2-second-lean", "http://www.goodreads.com/book/show/29333715-lean-health", "http://www.goodreads.com/book/show/32051057-2-second-lean---3rd-edition", "http://www.goodreads.com/book/show/28501380-lean-health"]}