{"ratings": 7, "userreviews": [{"userName": "Hock Tjoa", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/4705351-hock-tjoa", "userReview": "This long novel tells of the reincarnations of Elijah Levy. It seems a good pretext to dip into the history of the world, mostly western and all male, although there are scenes of childbearing and a queen-regent has a role to play.Gomer, son of Japheth, the son of Noah, is the first incarnation. His birth is confidently dated 2104 B.C. What does this mean to those who lived in that time? Is it the year of Pharoah X or King Y, of a big flood or fire or locusts or great harvests? If the author writes of myths, why bother with the date? If the date is important, does it matter that it is disputed?I must lament the lack of a plot or organizing principle. It is (more or less) wonderful to read what Gradner thinks are interesting tidbits of human history or folk belief. But did Marco Polo try to bring holy oil to the court of Kublai Khan? Was there any love interest between him and the princess he escorted to Persia? Did/do the Arabs believe the Kaaba to be one of the stones found by Adam in Eden - that he gave (ultimately)to Abraham/Ishmael? Do Arabs/Muslims believe it turned black because of the sins of the pilgrims? Soon we meet Nostradamus who himself had a great interest in the occult and studied Jewish mysticism. He believed in reincarnation but did not know what to make of someone who was able to remember the other lives. This might have been a topic to follow up, but no.Just past the halfway point of this book, we get to Elijah Levy. It is the near future [2020] when he experiences his fourteenth incarnation. There are signs of contemporary culture: \"their phones pinged together ... fist pump emoji ... wink face ... they laughed together ...[the] nah-nah-nah-nah...[repeat] mimicking the X-Files title theme music.\" Something of a plot appears at this point for readers who persevere. The bad guys have been trying to find the \"Wunder Waffe\" since 1944. Dr. Hermann Oberth was recruited by the Nazis, Himmler himself. Find this stone that has the power of the sun; with it we shall power the \"sun gun.\"This is the stone that became the Kaaba, the stone that Gomer remembers, that Adam had given to ... and so on.Those who have listened to late night radio might recall the stories. An audio version of this book might serve a similar purpose."}, {"userName": "Ramona Plant", "userReviewDate": "Feb 06, 2018", "userURL": "http://www.goodreads.com/user/show/31375582-ramona-plant", "userReview": "Servant of Memory is a very different kind of book that is well written by Richar Gradner. The first half of this book is basically a blast through the past, giving you a peek through our history, covering a lot of religious historic events, but also some interesting scientific ones as well as some other ones and end up in the near future, where the real story finally begins. The first half kind of breezes through these shorter stories of each of the different reincarnations of our main character in the end, Elijah Levy. The pace there is fairly swift since the author has a lot of ground to cover. Once he arrives in the near future, his pace settles beautifully and he lets you enjoy the \"true\" story in my eyes, which required the set up in the first half.Elijah is an interesting character who is mystified by his own history and is trying to figure out what it all means and how he can find his true purpose. He is very determined and tries his hardest. He is a very likable character and the author does a good job in his character development throughout.I admit this book is very different from anything I have read and you have to be ready for it. I was not sure at first how I felt about the different historic little stories and wasn't sure where it was going. Once I realized it was a set up for the real story I enjoyed it much more since now they served a purpose. All in all I did enjoy this book. It was neat to see history in a different angle and it was intriguing where the author took it in the end. The book was very well written. and is definitely worth the read!Voluntary review of Advance Reader Copy. I was given a complimentary copy of this book by the publisher."}, {"userName": "Heidi Sinclair", "userReviewDate": "Feb 02, 2018", "userURL": "http://www.goodreads.com/user/show/20004676-heidi-sinclair", "userReview": "Another great book by mythical fiction author, Richard Gradner, which, beside the stylish prose, lively with adventurous spirit, portrays his passion for writing and the thoroughness in his research.“Servant of Memory” is not a tale of one person, on one continent, during one lifetime, but a tale of several interesting characters on different epic quests to different ends but who all had one unique thing in common. The intricately woven mystery gripped me, while with all the interesting historical and cultural detail, the book also completely hooked the history buff in me.The facts are seamlessly interspersed with creative imaginary events and genuinely believable responses. It was also an interesting experience to identify modern and universal themes occurring in a mystery spanning over thousands of years and it most certainly managed to expand my thinking.And, though there are also thoughtful and reflective underlying spiritual themes in “Servant of Memory”, and Gradner at times explores the nature of Jewish/Muslim/Christian/Buddhist relationships throughout the ages, the book never seeks to lecture about morality or about what one should (or should not) believe. This is an absorbing, intelligent book which was also great fun to read. It hooked me from the start to the finish, it enriched and entertained me and I would recommend it to anyone who enjoys reading truely fine mythical and historical fiction, as well as mystery and fantasy books."}, {"userName": "Kathleen Mckee", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/61601802-kathleen-mckee", "userReview": "Servant of Memory is a masterfully crafted epic novel of the mythical fiction genre. Richard Gradner brings together a journey of the soul by weaving threads of the spiritual fabric that encompasses the mantras of all religions.The first half of Servant of Memory is a compilation of stories seen through the eyes of important religious and secular characters of history. From Biblical Noah’s grandson, Gomer, and Abraham’s nephew, Bethuel, to Buddha, Muhammed, Marco Polo, Bartholomew Columbus, Paul Revere, and others, Gradner creatively intertwines their experiences as memories of Elijah Levy’s past lives. In the second half of Servant of Memory, Gradner plots a fast-paced tale of power and destruction as Elijah discovers his purpose in life. In the end, Elijah learns that he must find the Primordial Stone and save the world.I’m in awe of Richard Gradner’s creativity. Servant of Memory is an amazing story of the quest we all have to know our destiny. Why are we here on this earth at this time and place? What are we to accomplish in our lifetime? What legacy will we leave to posterity?In addition to the vast amount of research needed to bring reality to Elijah’s history, Gradner has an enviable gift for expressive writing. His similes and sensory descriptions are superb. He also has a depth of perception that, I think, must be fueled by his own quest of the soul. Not everyone will get that, but I was touched to the core of my being."}, {"userName": "Mehreen Ahmed", "userReviewDate": "Feb 22, 2018", "userURL": "http://www.goodreads.com/user/show/6832434-mehreen-ahmed", "userReview": "Servant of Memory by Richard Gradner, is a biblical history, also written in biblical proportion. However, what sets it apart from a religious book or the bible if you like, is the myth and the mystery of an ancient world and of course the romance. It was a great read."}, {"userName": "Rosie", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/45648862-rosie", "userReview": "I would like to thank the Author for an advance readers copy for my honest and unbiased review.'Servant of Memory' was an interesting read and was unlike anything I have read before. The plot description intrigued me and I was very much ready to dive into the story.The first part of the story follows Elijah's past lives, covering many different historical and religious events which were super fascinating. I felt that I had stepped back in time, witnessing these events before me. Understandably these many different chapters were building up to the main plotline - there was a lot of them. Personally, I would have preferred the main present-day plotline to be intertwined with Elijah's past reincarnations, as for a while I really struggled to see where the story was going. I felt that the first part of the story had a steady pace, as there was a lot of ground to cover but once reaching the present day, the story switched becoming fast-paced, action-filled which I very much enjoyed. I did question people's very swift acceptable over Elijah's \"condition\" finding it, unfortunately, not believable. Overall I enjoyed this book. I was hooked from the beginning, though I did struggled a little throughout, it was worth the read. The story very much reminded me of Ubisoft's Assassin's Creed, so if you are a fan of this gaming series or just Historical fiction, then I would recommend giving this book a read."}], "description": "Bound by the shackles of time, Elijah Levy is in his 14th reincarnation, and on the brink of a sensational discovery that will give him the power to share his accumulated memories with the rest of the world.But there is one memory, in particular, that attracts the attention of an evil organisation who threatens to embroil him in its iniquitous affairs. It concerns the Primordial Stone, a mythical talisman, infused with the power that was used to ignite the universe into being.Elijah finds himself in the centre of a mystery far larger than he could ever have imagined when he must fight to discover his true purpose and save the life of Katy Saunders, the beautiful girl of his dreams.", "title": "Servant of Memory", "url": "http://www.goodreads.com/book/show/38257021-servant-of-memory", "average": 4.14, "cover": "https://images.gr-assets.com/books/1517330490l/38257021.jpg", "reviews": 6, "authors": [{"url": "https://www.goodreads.com/author/show/9795277.Richard_Gradner", "name": "Richard Gradner"}], "type": [], "outlinks": ["http://www.goodreads.com/book/show/38257021-servant-of-memory", "http://www.goodreads.com/book/show/40059086-return-to-lemuria", "http://www.goodreads.com/book/show/40068249-unicorn"]}