{"ratings": 19203, "userreviews": [{"userName": "Darwin8u", "userReviewDate": "Mar 20, 2016", "userURL": "http://www.goodreads.com/user/show/2294090-darwin8u", "userReview": "\"Physics opens windows through which we see far into the distance. What we see does not cease to astound us. We realize that we are full of prejudices and that our intuitive image of the world is partial, parochial, inadequate.\"― Carlo Rovelli, Seven Brief Lessons on PhysicsAt the highest level a discussion of physics doesn't just operate on a mathematical level, but a poetic and philosophical level as well. Look closely at the writings of Aristotle, Lucretius, Einstein and Feynman, and one discovers not just some code to the operation of the Universe, but love songs to that Universe, a desire to connect to and explain the beauty and transcendence of Nature and our role in this complex and amazing world.This book reminds me of a funeral I went to for a former (obvious) client of mine. He was the first nuclear medicine physician in my state and had his PhD and MD. He was a friend and an amazing person. At my table in the church's cultural hall, after the service (but before the burial) was his son, who had his PhD in genetics, a Pulitzer Prize winning political cartoonist, and a theoretical physicist from UC Santa Barbara. The conversation drifted from music to politics to art to nature. It was random, beautiful, and one of those moments that happens by accident and you cherish for years to come. I am reminded of this meal when I read this book. This book is short. It is 7 chapters (Six lesson and a conclusion) of about 10 pages each. Imagine you are having a nice, elegant, six course Italian meal with physicists past and present, poets, and philosophers outside in pricy Roman restaurant garden. It is night. It is dark. The canopy of the heavens spins above your heads. Each course brings a new topic. You discuss Einstein and the theory of relativity while eating the appetizer, you move onto Quanta as you eat the soup. The pasta is served just as the conversation turns to the architecture of the Cosmos. When the main course is served, people are already talking about Quarks and the Standard Model. The discussion gets intense. A Romaine salad is served and the host interrupts to talk about the grains of space and, since he is paying, he also talks about loop quantum gravity. Things are slowing down. It is late, the discussion jumps to probability, time, and the heat of black holes as the desert dishes are set down. Finally, as everyone is given their bitter digestifs, they move away to the table to walk in the gardens to discuss everyone's favorite subject: ourselves. Poetry and alcohol flow quickly, conversations grow hot and cold. The center cannot hold. The company departs.Anyway, I loved it."}, {"userName": "Brian Clegg", "userReviewDate": "Nov 11, 2015", "userURL": "http://www.goodreads.com/user/show/6100646-brian-clegg", "userReview": "This strikes me as the kind of book that would really impress an arts graduate who thought it was giving deep insights into science in an elegant fashion, but for me it was a triumph of style over substance - far too little content to do justice to the subject. It is, in effect, seven articles strung together as a mini-book that can be read comfortably in an hour, but is priced like a full-length work.Don't get me wrong, Carlo Rovelli knows his stuff when it comes to physics and gives us postcard sketches of a number of key areas, mostly in the hot fields like cosmology and quantum gravity (though interestingly focussing on the generally rather less popular loop quantum gravity). However he's not so good on his history of science, and can, as scientists often do when writing for the general public, over-simplify.The last of the articles is different from the rest - rather than take in a specific field (quantum physics, say) as the earlier articles do, it looks at how people and science interact. In some ways this is the freshest and most interesting part of the content... it's just hard to see why it's a 'lesson in physics.'This book came across to me like a taster menu from a fancy restaurant. It will certainly hit the mental tastebuds, and contains a number of delights - but it is insubstantial and leaves you wanting far more. I can see the title doing very well as a gift book. It looks pretty and is handsomely bound, but there are plenty of better options out there if a reader really wants to be introduced to the wonders of modern physics."}, {"userName": "Kevin Kelsey", "userReviewDate": "Jun 02, 2017", "userURL": "http://www.goodreads.com/user/show/10445368-kevin-kelsey", "userReview": "This book explained the basic concepts of physics, and major breakthroughs in the field over the years in such an effortlessly poetic way, that I couldn't help but be drawn in and understand them a little bit better. Really fantastic stuff."}, {"userName": "☘Misericordia☘  ⚡ϟ⚡ϟ⚡⛈   ❂❤❣", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/6603759-misericordia", "userReview": "Ok, I admit to some of my sins. I picked this up to make myself feel better on my loafing, which is something that keeps happening often! I might be deluding myself... or not.The fabrics of reality, as we try to understand it now, is described in this book in a visionary language. We are able to follow a journey through centuries, to see links between the greatest mind influencers of all ages.I do too feel better about myself and my lapses in 'daily toil'. Cheers!!!Q:In his youth Albert Einstein spent a year loafing aimlessly. You don’t get anywhere by not ‘wasting’ time – something, unfortunately, which the parents of teenagers tend frequently to forget. He was in Pavia. He had joined his family having abandoned his studies in Germany, unable to endure the rigours of his high school there. It was the beginning of the twentieth century, and in Italy the beginning of its industrial revolution. His father, an engineer, was installing the first electrical power plants in the Paduan plains. Albert was reading Kant and attending occasional lectures at the University of Pavia: for pleasure, without being registered there or having to think about exams. It is thus that serious scientists are made. (c)Q:Einstein became a renowned scientist overnight and received offers of employment from various universities. (c)Q:It would take ten years to resolve. Ten years of frenzied study, attempts, errors, confusion, mistaken articles, brilliant ideas, misconceived ideas. (c)Q:‘The General Theory of Relativity’, his masterpiece and the ‘most beautiful of theories’, according to the great Russian physicist Lev Landau.There are absolute masterpieces which move us intensely: Mozart’s Requiem; Homer’s Odyssey; the Sistine Chapel; King Lear. To fully appreciate their brilliance may require a long apprenticeship, but the reward is sheer beauty – and not only this, but the opening of our eyes to a new perspective upon the world. Einstein’s jewel, the general theory of relativity, is a masterpiece of this order. (c)Q:Undistracted by schooling, one studies best during vacations. vacations. I was studying with the help of a book that had been gnawed at the edges by mice, because at night I’d used it to block the holes of these poor creatures in the rather dilapidated, hippy-ish house on an Umbrian hillside where I used to take refuge from the tedium of university classes in Bologna. Every so often I would raise my eyes from the book and look at the glittering sea: it seemed to me that I was actually seeing the curvature of space and time imagined by Einstein. As if by magic: as if a friend was whispering into my ear an extraordinary hidden truth, suddenly raising the veil of reality to disclose a simpler, deeper order. (c)Q:an extraordinary idea occurred to him, a stroke of pure genius: the gravitational field is not diffused through space; the gravitational field is that space itself. (c)Q:The student in question, Bernhard Riemann, had produced an impressive doctoral thesis of the kind that seems completely useless. The conclusion of Riemann’s thesis was that the properties of a curved space are captured by a particular mathematical object which we know today as Riemann’s curvature, and indicate with the letter ‘R’. Einstein wrote an equation which says that R is equivalent to the energy of matter. That is to say: space curves where there is matter. That is it. The equation fits into half a line, and there is nothing more. A vision – that space curves – became an equation. (c) I love how this allows a layman (a laywoman in my case) to get a rare glimpse into the inner sanctum: the workings of the mind of a visionary!Q:But within this equation there is a teeming universe. And here the magical richness of the theory opens up into a phantasmagorical succession of predictions that resemble the delirious ravings of a madman, but which have all turned out to be true. To begin with, the equation describes how space bends around a star. Due to this curvature, not only do planets orbit round the star, but light stops moving in a straight line and deviates. Einstein predicted that the sun causes light to deviate. In 1919 this deviation was measured, and the prediction verified. But it isn’t only space that curves; time does too. Einstein predicted that time passes more quickly high up than below, nearer to the Earth. This was measured and turned out to be the case. If a man who has lived at sea level meets up with his twin who has lived in the mountains, he will find that his sibling is slightly older than him. And this is just the beginning. (c)Q:In short, the theory describes a colourful and amazing world where universes explode, space collapses into bottomless holes, time sags and slows near a planet, and the unbounded extensions of interstellar space ripple and sway like the surface of the sea … And all of this, which emerged gradually from my mice-gnawed book, was not a tale told by an idiot in a fit of lunacy, or a hallucination caused by Calabria’s burning Mediterranean sun and its dazzling sea. It was reality.Or better, a glimpse of reality, a little less veiled than our blurred and banal everyday view of it. A reality which seems to be made of the same stuff which our dreams are made of, but which is nevertheless more real than our clouded quotidian dreaming. (c)Q: Perhaps anyone reading this will still be able to appreciate its wonderful simplicity:Rab − ½ R gab = Tab That’s it.You would, of course, need to study and digest Riemann’s mathematics in order to master the technique to read and use this equation. It takes a little commitment and effort. But less than is necessary to come to appreciate the rarefied beauty of a late Beethoven string quartet. In both cases the reward is sheer beauty, and new eyes with which to see the world. (c)Q:Quanta ... The work of Einstein was initially treated by colleagues as the nonsensical juvenilia of an exceptionally brilliant youth. (c)Q:Heisenberg imagined that electrons do not always exist. They only exist when someone or something watches them, or better, when they are interacting with something else. They materialize in a place, with a calculable probability, when colliding with something else. The ‘quantum leaps’ from one orbit to another are the only means they have of being ‘real’: an electron is a set of jumps from one interaction to another. When nothing disturbs it, it is not in any precise place. It is not in a ‘place’ at all.It’s as if God had not designed reality with a line that was heavily scored, but just dotted it with a faint outline. (c)Q:This lesson is made up mostly of simple drawings. The reason for this is that before experiments, measurements, mathematics and rigorous deductions, science is above all about visions. Science begins with a vision. Scientific thought is fed by the capacity to ‘see’ things differently than they have previously been seen. I want to offer here a brief, modest outline of a journey between visions. (c)Q:A world of happenings, not of things. (c)Q:So, for the moment we have to stay with the Standard Model. It may not be very elegant, but it works remarkably well at describing the world around us. And who knows? Perhaps on closer inspection it is not the model that lacks elegance. Perhaps it is we who have not yet learnt to look at it from just the right point of view; one which would reveal its hidden simplicity. (c)Q:A handful of types of elementary particles, which vibrate and fluctuate constantly between existence and non-existence and swarm in space even when it seems that there is nothing there, combine together to infinity like the letters of a cosmic alphabet to tell the immense history of galaxies, of the innumerable stars, of sunlight, of mountains, woods and fields of grain, of the smiling faces of the young at parties, and of the night sky studded with stars. (c)Unexpectedly poetic.Q:A university student attending lectures on general relativity in the morning and others on quantum mechanics in the afternoon might be forgiven for concluding that his professors are fools, or have neglected to communicate with each other for at least a century. In the morning the world is curved space where everything is continuous; in the afternoon it is a flat space where quanta of energy leap. The paradox is that both theories work remarkably well. (c)Q:It is not the first time that physics finds itself faced with two highly successful but apparently contradictory theories. The effort to synthesize has in the past been rewarded with great strides forward in our understanding of the world. Newton discovered universal gravity by combining Galileo’s parabolas with the ellipses of Kepler. Maxwell found the equations of electromagnetism by combining the theories of electricity and of magnetism. Einstein discovered relativity by way of resolving an apparent conflict between electromagnetism and mechanics. A physicist is only too happy when he finds a conflict of this kind between successful theories: it’s an extraordinary opportunity. Can we build a conceptual framework for thinking about the world which is compatible with what we have learnt about it from both theories?Here, in the vanguard, beyond the borders of knowledge, science becomes even more beautiful – incandescent in the forge of nascent ideas, of intuitions, of attempts. Of roads taken and then abandoned, of enthusiasms. In the effort to imagine what has not yet been imagined. (c)Q:The illusion of space and time which continues around us is a blurred vision of this swarming of elementary processes, just as a calm, clear Alpine lake consists in reality of a rapid dance of myriads of minuscule water molecules. (c)Q:We realize that we are full of prejudices and that our intuitive image of the world is partial, parochial, inadequate. ... If we try to put together what we have learnt in the twentieth century about the physical world, the clues point towards something profoundly different from our instinctive understanding of matter, space and time. Loop quantum gravity is an attempt to decipher these clues, and to look a little further into the distance. (c)Q:Why does heat go from hot things to cold things, and not vice versa?It is a crucial question, because it relates to the nature of time. In every case in which heat exchange does not occur, or when the heat exchanged is negligible, we see that the future behaves exactly like the past. For example, for the motion of the planets of the solar system heat is almost irrelevant, and in fact this same motion could equally take place in reverse without any law of physics being infringed. As soon as there is heat, however, the future is different from the past. While there is no friction, for instance, a pendulum can swing forever. If we filmed it and ran the film in reverse we would see movement that is completely possible. But if there is friction then the pendulum heats its supports slightly, loses energy and slows down. Friction produces heat. And immediately we are able to distinguish the future (towards which the pendulum slows) from the past. We have never seen a pendulum start swinging from a stationary position, with its movement initiated by the energy obtained by absorbing heat from its supports. The difference between past and future only exists when there is heat. The fundamental phenomenon that distinguishes the future from the past is the fact that heat passes from things that are hotter to things that are colder.So, again, why, as time goes by, does heat pass from hot things to cold and not the other way round?The reason was discovered by Boltzmann, and is surprisingly simple: it is sheer chance. Boltzmann’s idea is subtle, and brings into play the idea of probability. Heat does not move from hot things to cold things due to an absolute law: it only does so with a large degree of probability. The reason for this is that it is statistically more probable that a quickly moving atom of the hot substance collides with a cold one and leaves it a little of its energy, rather than vice versa. Energy is conserved in the collisions, but tends to get distributed in more or less equal parts when there are many collisions. In this way the temperature of objects in contact with each other tends to equalize. It is not impossible for a hot body to become hotter through contact with a colder one: it is just extremely improbable. (c)Q:Einstein wrote a moving letter to Michele’s sister: ‘Michele has left this strange world a little before me. This means nothing. People like us, who believe in physics, know that the distinction made between past, present and future is nothing more than a persistent, stubborn illusion.’ (c)Q:Within the immense ocean of galaxies and stars we are in a remote corner; amidst the infinite arabesques of forms which constitute reality we are merely a flourish among innumerably many such flourishes. (c)Q:Myths nourish science, and science nourishes myth. But the value of knowledge remains. If we find the antelope we can eat. (c)Q:The information which one physical system has about another has nothing mental or subjective about it: it’s only the connection that physics determines between the state of something and the state of something else. A raindrop contains information on the presence of a cloud in the sky; a ray of light contains information on the colour of the substance from which it came; a clock has information on the time of day; the wind carries information about an approaching storm; a cold virus has information of the vulnerability of my nose; the DNA in our cells contains all the information in our genetic code (on what makes me resemble my parents); and my brain teems with information accumulated from my experience. The primal substance of our thoughts is an extremely rich gathering of information that’s accumulated, exchanged and continually elaborated. (c)Q:It is not against nature to be curious: it is in our nature to be so.One hundred thousand years ago our species left Africa, compelled perhaps by precisely this curiosity, learning to look ever further afield. Flying over Africa by night, I wondered if one of these distant ancestors setting out towards the wide open spaces of the North could have looked up into the sky and imagined a distant descendant flying up there, pondering on the nature of things, and still driven by the very same curiosity. (c)Q:I believe that our species will not last long. It does not seem to be made of the stuff that has allowed the turtle, for example, to continue to exist more or less unchanged for hundreds of millions of years; for hundreds of times longer, that is, than we have even been in existence. We belong to a short-lived genus of species. All of our cousins are already extinct. What’s more, we do damage. The brutal climate and environmental changes which we have triggered are unlikely to spare us. For the Earth they may turn out to be a small irrelevant blip, but I do not think that we will outlast them unscathed – especially since public and political opinion prefers to ignore the dangers which we are running, hiding our heads in the sand. We are perhaps the only species on Earth to be conscious of the inevitability of our individual mortality. I fear that soon we shall also have to become the only species that will knowingly watch the coming of its own collective demise, or at least the demise of its civilization. ...And it’s certainly not the first time that this will have happened. The Maya and Cretans, amongst many others, have already experienced this. We are born and die as the stars are born and die, both individually and collectively. This is our reality. Life is precious to us because it is ephemeral. And as Lucretius wrote: ‘our appetite for life is voracious, our thirst for life insatiable’ (De rerum natura, III, 1084). But immersed in this nature which made us and which directs us, we are not homeless beings suspended between two worlds, parts of but only partly belonging to nature, with a longing for something else. No: we are home.Nature is our home, and in nature we are at home. This strange, multicoloured and astonishing world which we explore – where space is granular, time does not exist, and things are nowhere – is not something that estranges us from our true selves, for this is only what our natural curiosity reveals to us about the place of our dwelling. About the stuff of which we ourselves are made. We are made of the same stardust of which all things are made, and when we are immersed in suffering or when we are experiencing intense joy we are being nothing other than what we can’t help but be: a part of our world. (c)Q:It is part of our nature to love and to be honest. It is part of our nature to long to know more, and to continue to learn. Our knowledge of the world continues to grow.There are frontiers where we are learning, and our desire for knowledge burns. They are in the most minute reaches of the fabric of space, at the origins of the cosmos, in the nature of time, in the phenomenon of black holes, and in the workings of our own thought processes. Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world. And it’s breathtaking. (c)"}, {"userName": "Elizabeth", "userReviewDate": "Jul 12, 2016", "userURL": "http://www.goodreads.com/user/show/8287397-elizabeth", "userReview": "This review was originally published on the books and pieces blog. In those moments of life when the grim figures of anxiety, stress, or panic grip me tight and threaten to never let go, I have learned that the one thing sure to scare them off is a nice little face-off with the end of the universe.That’s my super casual way of saying I’ve been having a bit of a hard time with anxiety recently. Anxiety is a fucker because it messes with my ability to concentrate which is something very necessary for actually reading and enjoying books rather than continually picking them up and putting them down and wandering around the house worrying about the fact that you haven’t read any damn books to talk about on your book-related social media and feeling like you should be doing something productive instead but not actually being able to do it and then worrying about that as well. BASTARD.But back to the subject at hand: science books!When none of my fictional favourites can hold my attention I find that often a little non-fiction does the job. And so on my latest foray to the book shops I spotted SEVEN BRIEF LESSONS ON PHYSICS by Carlo Rovelli and snapped it up. It’s such a wee little thing and yet so intriguing with its evocative title that it seemed perfect. 78 pages of basic science, what could possibly be more innocuous. Little did I know.The tiny size of SEVEN BRIEF LESSONS ON PHYSICS belies the size of the utter mind-fuck that is held within.Allow me to explain. It starts amicably enough:\"These lessons were written for those who know little or nothing about modern science.\"That’s me, right there. Little to nothing; me and Jon Snow are with you. The principle of the book is to give a tiny “overview” of the revolutions in the understanding of physics that have happened in the past century or so. It begins with lesson one – Einstein that fluffy haired moppet, who changed the world by suggesting that space isn’t, well, space. It’s not an empty area populated by waves and forces and things – it literally IS those forces. There was some visualising of rubber sheets which left me a little cross-eyed but essentially getting the gist of it. But then Rovelli happily hopped onwards to lesson two where he calmly announced that quantum mechanics means that reality only sometimes exists.OKAY THEN, RIGHT, THAT’S FINE. YOU CARRY ON. I’LL LEAVE MY BRAIN IN THIS PUDDLE.By lesson five time itself had gone out the window and the entirety of the universe followed shortly thereafter. Physics, it seems, does not fuck around. But it was the seventh chapter that really leaves you staring into the void.Rovelli uses this final lesson to grapple with the relevance of physics to our lives. Or, more accurately, of the relevance of our lives in the vast and uncaring strangeness of the cosmos. With the same sparse simplicity of words that he used to set out the mind-bending reality that is revealed by physics, he touches on the concepts of thought, learning, philosophy, ethics, and, of course, of death. Like many of the books where science meets philosophy, the wording gets close to religious in its solemn beauty.\"We are born and die as the stars are born and die, both individually and collectively. This is our reality….\"That’s dark stuff, man. COLD. But actually I found myself weirdly comforted. Rovelli takes pains to explain that however dark and weird the universe may seem, we are not alien to it, but part of it. We are at home in its weird unreality. It’s quite a moment when you can look into the void and the only thing that comes to mind is that old song by Simon and Garfunkel…\nHello darkness, my old friend. I've come to talk with you again.\"\nIt reminded me of The Good Book: A Humanist Bible, that strange and lovely conglomeration of scientific ideas, literature and philosophy compiled and presented by A.C. Grayling as a secular bible. Like a religious person seeking succour in a religious text I find my calm in the place where science meets philosophy.\"Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world. And it’s breathtaking.\"The concepts set out in this book are mind-bendingly weird. I’m not sure I really comprehended the full meaning of it all (which is probably the point, temptations to learn more and all that) but it was completely and utterly engaging. My only criticism was, really, its brevity. For some of the more complex concepts just a little more time spent trying to give me a better mental grasp of these slippery thoughts would have been perfect. A page, maybe two. No more.The writing style is excellent – elegant, flowing, and measured. And a translated text I can only suppose that this is a sign of both an excellent author and some damn fine translators. It balances the need for simple explanations of complex ideas with evocative, beautiful prose – it’s a science book written for readers, not scientists after all.It’s worth reading for the madness of the physics alone but for my anxious brain it was the strange, warm bath in the restaurant at the end of the universe that it needed. And for that, Carlo Rovelli, I thank you.This review was originally published on the books and pieces blog."}, {"userName": "Sean Gibson", "userReviewDate": "Apr 04, 2017", "userURL": "http://www.goodreads.com/user/show/20955173-sean-gibson", "userReview": "It should be noted as a point of fact that “brief” does not mean “simple.”I really like physics. It explains how everything works, and it’s a discipline that doesn’t dogmatically cling to outmoded ideas when new evidence suggests that everything we thought we knew was completely and totally erroneous (I, conversely, very much enjoy clinging dogmatically to outmoded ideas, including, but not limited to, the idea that parachute pants are cool, Van Hagar was the best incarnation of Van Halen, and it’s not a crime to wear socks with sandals). Do I understand physics? Heck no. If you could have seen my brain (insert microscope joke here) as I read this slim but enlightening tome, it would have looked distressingly like one of those delightful taffy pulling machines you see at quaint, old-fashioned candy stores on Mackinac Island or a boardwalk somewhere.That said, for someone who hasn’t read much on physics in about 20 years, this is an excellent (and mercifully high-level) overview of the current state of the field and includes brief forays into topics ranging from general relativity to cutting-edge loop quantum gravity theory. Of particular note is the current thinking on the dimension of time and how our perception of time may, in fact, be just that—a perception and not a fixed value (reading that section was the point at which my poor taffy puller exploded and left me all sticky…insert atrocious double entendre here). If you’re an armchair science enthusiast like me, this is probably just the right amount of detail; if you’re smarter than I am (likely) or more well read on what’s going on in physics these days, though, you may want to look elsewhere for a dose of enlightenment."}, {"userName": "Jamie", "userReviewDate": "Jan 15, 2017", "userURL": "http://www.goodreads.com/user/show/40898015-jamie", "userReview": "Quick read. I felt the author talked about himself more than any of the theories he was trying to convey in his book. These are such complex theories, that were so dumbed- down it was impossible to read at times."}, {"userName": "Warwick", "userReviewDate": "Nov 22, 2016", "userURL": "http://www.goodreads.com/user/show/53165-warwick", "userReview": "Engaging but over-slight summary of a few foundational concepts of modern physics, including special relativity, quantum theory, the standard model, as well as some leading hypothetical ideas like loop quantum gravity.It's always welcome to read someone who's working from the conviction that these ideas should be accessible to everyone, not just a coterie of science graduates, and Rovelli certainly has an appealing turn of phrase. For instance: talking about Hawking radiation in the context of competing descriptions of the universe, he writes thatThe heat of black holes is like the Rosetta Stone of physics, written in a combination of three languages – Quantum, Gravitational and Thermodynamic – still awaiting decipherment in order to reveal the true nature of time.The problem is that these chapters are so brief – they began as a series of weekly columns for Il Sole 24 Ore – that they are only really of use to someone who has had no exposure to these concepts whatsoever. There is no room to touch on any but the most preliminary of introductory points. It's like scanning the headlines. The ‘lessons’ are fine, they're nicely written, they're suitably curious and awe-struck – but they're somehow unsatisfying.And at times, he can perhaps be a little disingenuous. To illustrate the concept of loop quantum gravity, he talks about a hypothetical entity called a Planck star, something whose existence, as far as I know, has only ever been proposed by one C. Rovelli….But overall, you're left with the impression that you just spent half an hour chatting with a particularly engaging lecturer at a party, without getting the chance to hear him actually lecture. Oh – and his wide-eyed, cheerful demeanour makes it all the more sobering when he sums up the prospects for our immediate future as follows:We belong to a short-lived genus of species. All of our cousins are already extinct. What's more, we do damage. The brutal climate and environmental changes which we have triggered are unlikely to spare us. For the Earth they may turn out to be a small irrelevant blip, but I do not think that we will outlast them unscathed – especially since public and political opinion prefers to ignore the dangers which we are running, hiding our heads in the sand. We are perhaps the only species on Earth to be conscious of the inevitability of our individual mortality. I fear that soon we shall also have to become the only species that will knowingly watch the coming of its own collective demise, or at least the demise of its civilization."}, {"userName": "Panagiotis", "userReviewDate": "Jun 07, 2016", "userURL": "http://www.goodreads.com/user/show/11979363-panagiotis", "userReview": "Ο Ροβέλι είναι μια εξέχουσα μορφή της θεωρητικής φυσικής. Πέραν της καθαρά ερευνητικής του δραστηριότητας, γράφει σε μια Ιταλική εφημερίδα, φέρνοντας τον καθημερινό άνθρωπο λίγο πιο κοντά στα επιτεύγματα της φυσικής. Σε τούτο το βιβλίο μαζεύει τα πιο σημαντικά του άρθρα, τα εμπλουτίζει και φτιάχνει έναν τόμο.Το βιβλίο είχε εξαιρετική επιτυχία, πέρασε σε πωλήσεις μεγαθήρια. Δεν μου κάνει εντύπωση. Πέραν του ότι στην χώρα του ο Ροβέλι έχει μεγάλη απήχηση, γράφει με πάθος αλλά και σεμνότητα. Μέσα στα έξι κεφάλαιά του, ισάριθμα μαθήματα/διαλέξεις σε συμπυκνωμένη μορφή, θα φέρουν σε επαφή τον αναγνώστη με την πρόοδο της φυσικής. Η θεωρία της σχετικότητας, η αντιμαχόμενη κβαντική θεώρηση της ύλης, η κοσμολογία και η σωματιδιακή φυσική, οι σύγχρονες προσπάθειες για μια κβαντική θεώρηση του χωροχρόνου (στην προμετωπίδα των οποίων είναι και ο Ροβέλι ενεργός) και τέλος μαύρες τρύπες, χρόνος και θερμότητα.Η γραφή του Ροβέλι και η δομή του βιβλίου δημιουργεί μια ανεπανάληπτη αφηγηματική ροή. Τα κεφάλαια διαδέχονται το ένα το άλλο σε μια εξιστόρηση μυστηρίου. Ο ενθουσιασμός του Ροβέλι μεταδίδεται στον αναγνώστη που θέλει να δει \"τί έγινε παρακάτω\". Ποιό ήταν το επόμενο βήμα του ανθρώπου μέσα στους λαβύρινθους του αγνώστου. Η συναρπαστική αυτή ιστορία κορυφώνεται στον πρόλογο, τον έβδομο μάθημα, όπου η φυσική συναντάται αναπόφευκτα με την φιλοσοφία.Είμαι φυσικός και ασχολούμαι με ένα παρακλάδι της ως ερευνητής. Όταν τελειώνω ένα τέτοιο βιβλίο που απευθύνεται στο ευρύ κοινό, πάντα είμαι σκεπτικός: θα καταφέρει ένας άσχετος να καταλάβει κάτι; Θα το έδινα, για παράδειγμα, στην αδερφή μου; Αυτά τα επιτεύγματα μέσα από τους αγώνες λαμπρών μυαλών, είναι κτήμα όλων μας. Είναι η πεμπτουσία της ανθρώπινης περιέργειας, που μας έβγαλε από τις σπηλιές και συντέλεσαι σε μια εξέλιξη ραγδαία, με ό,τι καλό και κακό συνεπάγεται αυτό. Και ένα τέτοιο βιβλίο σαν του Ροβέλι, διασκεδαστικό και ανθρώπινο, είναι ο καλύτερος τρόπος για έναν άνθρωπο δίχως τριβή στις θετικές επιστήμες να γνωρίσει που έχει φτάσει η κατανόησή μας για την πλάση."}, {"userName": "Joey Woolfardis", "userReviewDate": "May 21, 2018", "userURL": "http://www.goodreads.com/user/show/4639825-joey-woolfardis", "userReview": "The first thing that needs to be said is that I have overrated this book by at least one star, maybe two. And I reason thusly...It is at times poetic, always interesting and forever thought-provoking. It is a beautifully bound hardback (if you have that copy), small enough to take with you everywhere and enjoy anywhere, and tactile enough to let you enjoy what you have just read in a way many books do not allow.However...Carlo Rovelli is the Italian version of our beloved may he never go back to the d:ream of keyboards Professor Brian Cox. He is a physicist who writes to help the everyday man understand what he does on a daily basis. This is a good thing. You can't just go talking to people about quarks and expect them to know their neutrons from their neurons and their neutrinos.The science is-as science can be-accurate and wonderful. It's the basics, without going in to entropy, but Rovelli does not have the best bedside manner. His explanations are not on point and he seems to run over himself a few times. Once or twice I lost the train of thought, because, even though atoms make up molecules, they are different things in essence, but they're the same as well, and Rovelli doesn't quite get this across in a way that doesn't make me want to just start reading Alan Bennett in Alan Bennett's voice and to hell with atoms.It's also focused heavily on space, which is the of-the-moment sexy side of physics (and science as a whole). It's popular, so here's a book on it. \"Let me tell you about gravitational waves and these quarks I got... *eyebrow wiggle*\" Space is sexy right now. Eau de Elon Musk. Base notes of glandular secretions etcSeven Brief Lessons on Physics was also originally written in Italian and has been translated in to English, and that always presents a problem. It seems ridiculous to wonder why it couldn't have been written in English in the first place, because almost 99% of the poetry and wonder will have been lost. Unless someone who speaks both English and Italian fluently and has read the both of them can tell me otherwise, I'd say this is a pointless book in it's current format.A beautiful book, nonetheless. Which brings me on to why the stars are shining more. And the reason is, this book will bring in the readers who read it purely for the pretty cover. Or because Emma Roberts was seen reading it on Instagram. And I like that.Popularity very rarely touches at the heart of the deserving and, whilst it may not be perfect, it is accurate (as accurate as theories can be, aye? (that's a physicist joke #sorrynotsorry)) and will either spark the imagination of the reader, make them wonder about the world and want to find out more... or will make them continue as they were before.But to be given the chance, in this world of over-paid talentless fecks, where women who can't string a sentence together get paid millions because everyone is horny but won't admit it and people who make stuff with their own hands still are labelled weirdos...To know that I've kept the average 5-star rating quite high and that anyone who bases a book on the average of its stars on GoodReads might pick this up (the exact kind of person who needs to read this). Well done me.So why not the ever-elusive five stars? Because I'm a sparkly lion not a sheep. And I'm not your mam."}, {"userName": "Roberto", "userReviewDate": "Mar 21, 2015", "userURL": "http://www.goodreads.com/user/show/15956368-roberto", "userReview": "Chi sa sa, chi non sa continua a non sapereQueste sette lezioni (che poi sono sei più una parte dedicata a riflessioni generali sull’uomo) sono parzialmente tratte da una serie di articoli pubblicati dall’autore sul “Sole 24 Ore”.Le lezioni trattano, in 88 pagine complessive, cosucce come la relatività generale di Einstein, la meccanica quantistica, le particelle elementari, l’architettura del cosmo, i buchi neri ed altro ancora.Arrivato alla fine del saggio mi è venuta in mente una freddura che lessi tempo fa su un libro inglese: “ho letto Guerra e Pace con la lettura veloce: parla della Russia”.Gli argomenti trattati, indubbiamente complessi, sono spiegati con un linguaggio semplice. Ma è sufficiente un linguaggio semplice per fare comprendere cose notevolmente complicate? È facile dire che il tempo non è universale, che le cose cadono perché lo spazio s’incurva, che il campo gravitazionale è lo spazio stesso, che il tempo passa più velocemente tanto più ci si allontana dalla Terra, che l’energia si distribuisce nella materia in maniera discontinua? Questi concetti sono veramente comprensibili a tutti?La mia sensazione è che al termine della lettura chi conosce questi argomenti, per quanto incuriosito dalle considerazioni filosofiche esposte in merito alle teorie scientifiche, non ne saprà di più. Chi ignora la fisica contemporanea continuerà a ignorarla.L’unica nota positiva del libriccino è il tentativo di avvicinamento della cultura scientifica con quella umanistica, normalmente troppo (e purtroppo) separate."}, {"userName": "Barbara", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/2172096-barbara", "userReview": "These seven brief lessons about physics are interesting, enlightening, and (more or less) accessible to non-scientists. The author, Carlo Rovelli, is a theoretical physicist with great enthusiasm for his subject matter. The lessons (which I'm greatly simplifying) include:Special Theory of Relativity: The faster you move, the slower time passes. This would be really obvious if you could travel at the speed of light. General Theory of Relativity: Space is not empty, but composed of particles of some kind. The sun bends space around itself, and the planets circle around the sun because they follow the curve of space (like marbles that roll around a funnel). This explains the 'force of gravity' that prevents the planets from flying off into the galaxy.Quantum Mechanics: The energy of a field is distributed in 'quanta', or packets of energy, like electrons in an electrical field. But quanta only exist when they're interacting with something else - so they bleep in an out of existence. Moreover, quanta move randomly so we can't know where they'll manifest themselves. (If you can't wrap your mind around this don't feel bad. Albert Einstein couldn't either. LOL)The Architecture of the Cosmos: Our sun is one star among billions of stars in the galaxy.....and there are billions of galaxies.....and so on. There may even be more than one universe, but we don't know.Particles: The universe is teeming with particles called electrons, quarks, gluons, photons, neutrinos, and Higgs bosons. Rovelli explains that these particles are 'like bricks in a Lego set' that make up the material things surrounding us. Moreover, 'the nature of these particles and the way they move is described by quantum mehanics'.....so they're always winking in an out of being. All the particles, fields, and forces in the universe are summed up in 'The Standard Model of Particle Physics' which no one understands. Ha ha ha.Quantum Gravity: Unfortunately the theories of general relativity - where the universe is a continous curved space, and quantum mechanics - where the universe is composed of particles that bleep in and out of existence, contradict each other. But both theories work well. So physicists are trying to merge the ideas in a field of study called 'loop quantum gravity.' One combined theory suggests that space is not continuous but made up of infinitesimally small 'grains of space' called loops.....connected somewhat like a chain link fence. This theory has repercussions that mess with the reality of time - so it needs a lot more of work.Probability, Time, and The Heat of Black Holes: The notion of 'time' is elusive and has been the subject of much debate among physicists. Rovelli points out, though, that heat distinguishes the past from the future. As time goes by, heat passes from things that are hotter to things that are colder (for example, a teaspoon heats up in hot tea). The science of heat is called thermodynamics.We don't know what happens to a gravitational field when it heats up, but a clue might be found in a black hole - a collapsed star with a gravitational field so strong that nothing (not even light) can escape. Black holes are hot - in essence hot 'spots' of space-time. Thus they combine quantum mechanics, general relativity, and thermodynamics. Eventually, scientists might be able to use black holes to reveal the true nature of time.Ourselves: If humans are composed of ephemeral particles, the same stuff as the rest of the universe, where do we get our sense of ourselves......of being conscious and making decisions. Scientists studying the brain are trying to shed light on this.I liked the book - which is short and sweet - and recommend it to readers interested in the subject.You can follow my reviews at http://reviewsbybarbsaffer.blogspot.com/"}, {"userName": "Riku Sayuj", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/1651956-riku-sayuj", "userReview": "Short and sweet. Six extremely brief lessons on six crucial areas of Physics and a final one on where we fit into all of it. Rovelli starts with General Relativity and shows us how elegant and simple it is - to re-imagine space as a place that bends, stretches, and interacts with the stars. What a leap of imagination it must have taken to think of emptiness itself as an object which interacts. Rovelli says that that is a key to modern physics, the realization that it is all about interactions and not about absolute properties - maybe all properties arise form interactions and nothing has intrinsic properties? We move onto quantum mechanics and see how it gradually got muddier - muddy enough that even Einstein, chief-imaginer, couldn’t fathom its weirdness anymore. At this point, the reader would be excused in thinking that each lesson is a bit shorter than warranted… The next lessons takes us to the architecture of the cosmos itself and shows us that unless we figure out a way to reconcile relativity and quantum mechanics, we will never figure out this weird place we find ourselves in. The sixth lesson about thermodynamics, turns the focus to the grandest mystery of modern science - time. Time might just be an illusion, arising out of our sensory limitations and might require science to allow us to look past it - just like how the movement of the stars and the surface of the earth looked different once we substituted the lens of of our senses with the lens of science. We might learn to ignore time, in time. The last chapter gets a bit fuzzy and philosophical, but that is from where we summon the sense of grandeur required to plod on in the face of all the weirdness that modern science is - to keep exploring this strange, multicolored and astonishing world which we inhabit – where space is granular, time does not exist, and things are nowhere."}, {"userName": "RK-ique", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/8930751-rk-ique", "userReview": "One brief book on modern physics for those of us who know nothing of the subject. I recall a friend talking excitedly about quantum physics in 1968. I paid little attention at the time and since. Now I want to understand a bit of this, just a bit. Rovelli does a good job of explaining complex concepts in plain language. Some of it did not come through very well but the book has served its purpose - to give me a sense of the basic problems and concepts of modern physics. In 80 pages, I cannot expect too much. My next step will be to read Rovelli’s ‘Reality is Not What It Seems’ and then his ‘The Order of Time’. A bit more detail. Then I shall see. Recommended for those who, like me, have ignored all of the hoopla - the Higgs what?"}, {"userName": "Manny", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/1713956-manny", "userReview": "Carlo Rovelli considers that everything is relational, and things only exist in virtue of their interactions with other things, so it's perhaps appropriate that I read Setti brevi lezioni di fisica in the way I did. Rovelli knows physics and Italian, and has used that knowledge to produce the book, so there is a relationship R between the book, physics and Italian. Most readers will know Italian, have the book in front of them, and make use of R to obtain knowledge about physics. I'm in a different position: I have the book, and I know the physics, but I want to use R to obtain knowledge about Italian, where I'm still a beginner. It turns out that this works too!How much have I learned? I'm not sure either, so I'll give myself a quick test. I'll use a random number generator to choose a paragraph and see how well I understand it. Here goes...My random number generator picks page 27, 63% of the way down the page. The paragraph is as follows:Ma c'è di peggio: questi salti con cui ogni oggeto passa a un'interazione all'altra non avvengono in modo previsibile, ma largamente a caso. Non è possibile prevedere dove en elettrone comparirà di nuovo, ma solo calcolere la probabilità che appaia qui o lì. La probabilità fa capolino nel cuore della fisica, là dove sembrava tutto fosse regolato da leggi precise, univoche e inderogabile.I certainly don't understand everything, but quite a lot. Let me see...But this is ?the point?: these jumps with which each object passes from one interaction to another do not happen in a predictable way, but largely by chance. It is not possible to predict where an electron will ?turn up? again, but only calculate the probability that it appears here or there. Probability makes ?? in the heart of physics, there where it seemed all was regulated by laws precise, unequivocal and unbreakable.Well, I seem to be making progress. I think I will reread the book, and see if R can fill more holes in my still extremely uncertain vocabulary..."}, {"userName": "Douglas", "userReviewDate": "Jan 11, 2016", "userURL": "http://www.goodreads.com/user/show/3020662-douglas", "userReview": "As a poem, this is quite beautiful. As a brief lesson, I'm confused. If the purpose was to ignite curiosity, I suppose this book met its objective. If its purpose was to distill the laws of physics into a comprehensible narrative, I'm afraid it did not work for me. I'm more confused now than when I started. I'm admittedly just starting my exploration of physics, but so far to me it seems like a subject you need to do a deep dive. Though this writing is poetic, the towering concepts seemed ethereal and inaccessible to me, a novice to the world of physics. And listen to this doom and gloom of a conclusion:\"We are perhaps the only species on Earth to be conscious of the inevitability of our individual mortality. I fear that soon we shall also have to become the only species that will knowingly watch the coming of its own collective demise, or at least the demise of its civilization.\" So, if I'm reading this correctly, there's all these wonderful and beautiful theories of physics that have been developed over the last few centuries that have changed the way we observe the universe and ourselves, but in the end, it's not going to matter because we're (mankind) insignificant, weak, and unable to change course. Well, based on these lessons and observations, I have no choice (and please forgive me if it goes astray) but to heed the advice of another great observer and theorist: The sky was all purpleThere were people runnin' everywhereTryin' to run from the destructionYou know I didn't even careThey say two thousand zero, zeroParty overOops, out of timeSo tonight I'm gonna party like it's 1999I guess what I'm saying is that after reading this book I'm grappling with the question of whether to read more introductory books on physics or just spend the time listening to my complete collection of Prince albums. Prince. Definitely Prince."}, {"userName": "Neva", "userReviewDate": "Dec 14, 2016", "userURL": "http://www.goodreads.com/user/show/2604564-neva", "userReview": "Прочетох я бързо, преведох я бавно, редактирах я мууудно... Но какво е това във Вселена, в която \"Хайзенберг допуска, че електроните невинаги съществуват...\"? Нищо :)Много поучителна и със забавни моменти като този, в който авторът (кликнете, кликнете, ще чуете и него на английски, и любимите му Джанис и Джана :) прави сравнение по повод двете несъвместими, но верни теории (на относителността и квантовата): \"Природата се отнася с нас като онзи стар равин, при когото отишли за съвет двама спорещи мъже. Щом изслушал първия, равинът казал: „Прав си”. Вторият настоял също да бъде чут, та равинът изслушал и него, след което заявил: „И ти си прав”. Тогава съпругата му, която надавала ухо от съседната стая, се провикнала: „Ама не може да са прави и двамата!”. Равинът се позамислил, кимнал и отсякъл: „И ти си права”.\""}, {"userName": "Nooilforpacifists", "userReviewDate": "Mar 04, 2016", "userURL": "http://www.goodreads.com/user/show/26071992-nooilforpacifists", "userReview": "Why is everyone so crazy for this book? It's written on in the most abstract generalities (yet he can't resist including the general relativity equation for gravity without explanation). It's a high-level history almost anyone could have written, with one chapter expressing the favorite European flavor of the day: \"we're doomed.\" Without footnotes pointing to the more exacting details of physics, what is the audience for this book? The Sunday Supplements? The readers won't learn much--for example, the first chapter purports to be about special and general relativity, but doesn't explain it. The next chapter is about Quantum Mechanics, and says: yes, there are a lot of elementary particles (quarks, gluons, Higgs Boson), but no one has the foggiest idea how to simplify it--at least that chapter was honest, if potentially confusing to the uninitiated. There's a very short chapter on cosmology, saying space is curved and expanding, but then he's off talking about black holes, without mentioning the \"Schwarchild Radius\", where even light cannot escape. I say again: who is the intended audience?"}, {"userName": "Matteo Fumagalli", "userReviewDate": "Nov 16, 2017", "userURL": "http://www.goodreads.com/user/show/41077867-matteo-fumagalli", "userReview": "\"Non siamo curiosi contro natura, siamo curiosi per natura. [...] Nasciamo e moriamo come nascono e muoiono le stelle, sia individualmente che collettivamente. Questa è la nostra realtà. Per noi, proprio per la sua natura effimera, la vita è preziosa.\""}, {"userName": "Sam Quixote", "userReviewDate": "Jul 26, 2016", "userURL": "http://www.goodreads.com/user/show/5759543-sam-quixote", "userReview": "I wish I was more interested in reading about science because every time I hear about a science story or read a random article in New Scientist, I’m always impressed – science is great and my knowledge of it is pitifully lacking. But when it comes to tackling even a 200 page science book, I know I’m setting myself up for a fall and I inevitably abandon it. Still, as Carlo Rovelli writes, “It is part of our nature to long to know more, and to continue to learn”, and it’s good to get out of our comfort zones and try something different, which is why I gave this book a shot – and I’m so glad I did because I loved it! Italian theoretical physicist Carlo Rovelli has written the ideal book for someone like me with Seven Brief Lessons on Physics. The title says it all with seven short chapters eloquently explaining some basic physics to people with next to no knowledge in this area. It’s accessible, interesting, and easy to devour at 79 pages long – though I purposely slowed down my reading to absorb as much information as I could. Rovelli explains the Theory of Relativity well but the chapter on Quantum Physics still left me wondering what the subject is about – then again I think it’s partly meant to be an unknowable subject! I read this book last week and I’m surprised how much information has stuck – I thought I’d forget it all within hours of reading it! – like how space is curved and constantly moving like an ocean, what black holes are, and the Big Bounce idea, where the universe exploded but will at some point contract, then explode again, and so on, as an alternate theory to the Big Bang.He also manages to cover the history of physics, showing how the discipline has evolved over time, in a mere chapter, effortlessly tying together Galileo, Newton, Einstein, Hawking, and a number of less famous but no less important figures into a coherent sequence. Rovelli’s writing style is a huge reason why this book works so well. It’s not just clear and direct, but also conjures up some fantastic imagery. I know the universe is a big place but the way he talks about it really impresses the vastness of it and how utterly insignificant Earth is in the greater scheme of things – and that’s not even touching on the idea of parallel universes! His closing chapter also talks about how humanity is doomed, talking about how humans just haven’t evolved in the same way as a turtle has (who’ve been around for millions of years in the same state as they are today) so that one day Earth will inevitably be without humans – but the planet and other animals will endure. It sounds like depressing stuff but it’s strangely comforting – at least to me – and makes our own lives all the more interesting, unique and special. The visions of the universe, of incomprehensibly large space clouds made of substances we haven’t discovered yet, right down to the mysteries of our wonderful blue marble of a planet, and our still largely unknown brains, are brought vividly to the reader with Rovelli’s words. It’s almost poetic! He writes \"Physics opens windows through which we see far into the distance\" and that’s the book’s biggest strength: not necessarily throwing as many facts at the reader as it can in a short space but rather allowing them a glimpse into the breath-taking scope that this subject explores. Obviously anyone who’s well-versed in the subject won’t find anything worthwhile in this book but for laymen like me who’re happy to splash about in the kiddie pool end of this subject, Seven Brief Lessons on Physics is a perfect read."}, {"userName": "Orsodimondo", "userReviewDate": "May 18, 2015", "userURL": "http://www.goodreads.com/user/show/10490224-orsodimondo", "userReview": "DE RERUM NATURASono pagine che raccontano di gente che con lo sguardo sapeva spaziare oltre l’orizzonte.Sono pagine sulla bellezza. E su occhi nuovi per vedere il mondo.Il mondo continua a cambiare sotto i nostri occhi, man mano che lo vediamo meglio.Siamo polvere di stelle."}, {"userName": "Melora", "userReviewDate": "Mar 14, 2017", "userURL": "http://www.goodreads.com/user/show/5586131-melora", "userReview": "I adore the ideas of quantum mechanics and particle physics, and I have yet to find an author capable of explaining them to me in a way that sticks in my brain for any length of time. While I'm reading or listening, I'm absolutely entranced, but once the “interaction” is over my understanding flickers out of existence like one of those elusive little Heisenberg particles. I have “quantum understanding.” Still, given this handicap, I found Rovelli's book absolutely delightful. He simplifies difficult concepts as far as they can be simplified (and then, I suspect, a fair lot farther), so that even readers of ploddingly ordinary intellect such as myself can briefly imagine that we understand these amazing ideas he's explaining about how the universe works, or might work. As other reviewers have noted, he's a popularizer for liberal arts majors, each chapter a delicious little morsel of “physics” stripped of math and presented as story. Though I did become more than usually muddled in chapter 5, when he described his own area of special interest (according to his book jacket bio), “loop quantum gravity theory,” for the most part he managed to make impossibly complicated ideas seem, briefly, nearly comprehensible. Fun stuff, ranging, as I understand it, from real, accepted science to recent speculations about how things may be."}, {"userName": "Kaitlin", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/19126246-kaitlin", "userReview": "Hmm this one was an interesting read. It's basically a rough introduction to Physics told through 7 different mini lessons. The ideas within the book are of course pretty complex, but the author has 'dumbed-down' or simplified it as much as possible to make it as accessible as possible.First up, let's discuss the fact that the cover of this is plain stunning. I have to say that the cover art was the initial reason I had an interest in reading this book, and once I heard what it was I was intrigued (Physics was my least favourite Science in school even though I found it fascinating as I found it to be most difficult). I wanted to go into this and learn lots of quirky new ideas, theories and ways to explain our world, but what I actually got was a book with some ideas explained, but most of them were already things I knew from just my basic GCSE secondary-school level classes (but then I did have a great Science teacher so that's possibly why). I do think that the author worded things well so you could grasp them quickly, and I liked reading about the origins of the universe through imagery, but there wasn't a whole lot of 'new' ideas, mostly just re-hashings of other theories through the ages.The last section focuses on how Humanity fits into all of this science and nature. I didn't really like this section as I felt it all became a bit too metaphorical and theoretical, and I want to have facts and theories when learning, not so much speculation. I am sure with time some of the ideas will prove true, some false, but until we get there we'll never know for sure...On the whole this is just what it says, a very brief look at some of the Physics behind our Universe and our Earth. I liked bits of it more than others but on the whole I'd give it a 2.5*s. It was okay."}, {"userName": "Paulo Pires", "userReviewDate": "Oct 06, 2015", "userURL": "http://www.goodreads.com/user/show/8466347-paulo-pires", "userReview": "4.7Um livro surpreendente ... Este é um livro pequeno em tamanho mas grande no potencial e na mensagem que transmite. Recebi ontem e li no mesmo dia!Achei deliciosa a forma como é apresentada a física, como de uma forma simples nos é oferecido o universo e aguçada a curiosidade para os assuntos abordados.Apreciei o cuidado que o autor teve no discurso, no privilegiar de uma mensagem clara, limpa e perceptível (dentro do possível) ao comum dos mortais.Para mim são muitas as revelações, e é interessante ter uma pequena noção do que os nossos cientistas lutam por conseguir.«Este mundo estranho, variegado e espantoso que exploramos, onde o céu se esfarela, o tempo não existe e as coisas podem não estar em lado nenhum, não é algo que nos distancie de nós: é apenas aquilo que a nossa curiosidade natural nos mostra a nossa casa.»Adorei o livro que me (...)Ler mais em:Opinião: Sete Breves Lições de Física de Carlo Rovelli |Livros e Marcadores"}, {"userName": "Amin", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/35276649-amin", "userReview": "بزرگترین ویژگی این کتاب کوچک به عنوان اثری برای معرفی مفاهیم فیزیک این است که با تئوری نسبیت عام شروع می کند. یعنی به تاریخ و مفاهیمی که شاید بارها از فیزیک نیوتونی و مکانیک شنیده ایم باز نمی گردد و مبنا را از فیزیک مدرن میگذارد تا در حجمی اندک به آخرین دستاوردها بپردازد. از این لحاظ اثر مقدماتی بسیار مفیدی است که به آخرین دستاوردها و مهم تر از آن ارتباطات منطقی و مفهومی بین نظریه های نسبیت عام، مکانیک کوانتومی وگرانش کوانتومی حلقوی می پردازد و بحث را به پیچیدگی های تعریف مکان و زمان در مقیاس کوانتومی و همین طور رابطه شان با مفهوم حرارت و ترمودینامیک می کشانداما دو نکته قابل بهبود وجود دارد: در برخی درسها گاه جزئیاتی ارائه شده است که کمی به قول معروف بحث را بازتر می کنند، اما آنقدر رویشان بحث نمی شود که سوالات و پیچیدگی های ایجاد شده مرتفع شوند و بر این اساس گاهی روانی و سلیسی متن را کاهش می دهند. از طرفی فصل آخر شبیه به تاملات فلسفی نویسنده است که پیوستگی و سازگاری معنایی و مفهومی با سایر فصول ندارند و گاه خواننده با خودش فکر می کند این هم یک شکل دیگر از مغلطه روشنفکران و متخصصین است که تمایل دارند فهمشان از دانش تخصصی خود را به حوزه های دیگر تعمیم دهند"}, {"userName": "TS Chan", "userReviewDate": "Jan 29, 2018", "userURL": "http://www.goodreads.com/user/show/30279227-ts-chan", "userReview": "Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world. And it’s breathtaking.\nBrief though these lessons may be, simple they are not. The preface elucidates that these are lessons for those who have little to no knowledge of modern science and serve to provide a quick general overview of “the most fascinating aspects of the revolution that has occurred in physics in the twentieth century”. My formal science studies stopped after high school and while I’ve always had the curiosity and thirst for more knowledge, it was not a subject that I believe I can tackle at a higher academic level. I was intrigued by both the title and size of the book, or basically how the author is going to distil these theories of physics into a 79-page book. Although the title mentioned seven, the book only contains six lessons of scientific theories and one of ourselves. These lessons commenced with what Rovelli terms as “the most beautiful of theories”, Albert Einstein’s General Theory of Relativity, which was then followed by the most confounding quantum mechanics. And from these two revolutionary aspects of physics at the start of the twentieth century, emerged the understanding of the vast and endless cosmos and the study of the infinitesimally small elementary particles. It then progressed to loop quantum gravity which attempted to combine both general relativity and quantum mechanics. The last scientific topic is on probability, time and the heat of black holes; three seemingly unrelated subject matters, that is until one has read this chapter. While these principles of physics are in no way simple, the lessons are presented and written in a manner that can be comprehended by anyone who has a general interest in science. Let me iterate that one MUST have an interest in the first place to appreciate this book. I am also astounded by how beautifully written a book on physics can be, and this is the translated text. For example, the author described Einstein’s General Theory of Relativity as follow.\n\nIn short, the theory describes a colourful and amazing world where universes explode, space collapses into bottomless holes, time sags and slows near a planet, and the unbounded extensions of interstellar space ripple and sway like the surface of the sea… And all this, which emerged gradually from my mice-gnawed book, was not a tale told by an idiot in a fit of lunacy, or a hallucination caused by Calabria’s burning Mediterranean sun and its dazzling sea. It’s real. Or better, a glimpse of reality, a little less veiled than our blurred and banal everyday view of it. A reality which seems to be made of the same stuff which our dreams are made of, but which is nevertheless more real than our clouded quotidian dreaming.\n\n The closing chapter of “ourselves” and the roles humans play in this world draws in a more philosophical view in the vein of many of the forefathers of physics who marry philosophy, religion and science. The concluding words are so stunning and impactful that upon finishing this really short book, I was filled with a sense of wonder and oddly, emotion - from a book on physics! \n\nNature is our home, and in nature we are at home. This strange, multicoloured and astonishing world which we explore – where space is granular, time does not exist, and things are nowhere – is not something that estranges us from our true selves, for this is only what our natural curiosity reveals to us about the place of our dwelling. About the stuff of which we ourselves are made. We are made of the same stardust of which all things are made, and when we are immersed in suffering or when we are experiencing intense joy we are being nothing other than what we can’t help but be: a part of our world."}, {"userName": "Veronique", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/12371602-veronique", "userReview": "3.5\"It is not against nature to be curious: it is in our nature to be so.\"This was an interesting little book. I am not a scientist, far from it, and spend most of the time in Humanities subjects. I was however curious to see what the author could communicate in such a short format. Well, still not entirely sure... Rovelli goes from the 'macro' perspective of cosmology, gravity and Einstein's famous theory of relativity, to the 'micro' one of quantum mechanics, focusing on particles. The articles are indeed brief but often not all that easy or clear for a novice. I could follow certain aspects, only to be lost by others. It did however pique my curiosity. Finally, the last chapter took on a different route, adding the human element into the equation, one that I could appreciate."}, {"userName": "Chiara", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/24781351-chiara", "userReview": "Qui, sul bordo di quello che sappiamo, a contatto con l'oceano di quanto non sappiamo, brillano il mistero del mondo, la bellezza del mondo, e ci lasciano senza fiato.\nMeraviglioso. Carlo Rovelli mi aiuta, tra i tanti, in quel processo di riconciliazione con la fisica che purtroppo è iniziato tardi. E lo fa andando oltre l'enunciazione delle varie teorie che compongono i vari quesiti della fisica moderna: la panoramica offerta vaga dalle più profonde domande esistenziali che l'uomo si pone dalla sua nascita alla probabile interpretazione di entità misteriose come il tempo, la coscienza e la soggettività.L'unica pecca di queste lezioni è forse la brevità: sono talmente affascinata che avrei potuto continuare a leggere per ore."}, {"userName": "Frabe", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/69961173-frabe", "userReview": "Rovelli, mi si dice, ha il pregio rarodi spiegare la materia in modo chiaro.Io leggo, mi arrovello e... non imparo,sicché il mio finale è molto amaro:in fisica son proprio un gran somaro!"}, {"userName": "Charlotte Jones", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/8943949-charlotte-jones", "userReview": "I was really excited about reading this book and unfortunately I was completely disappointed with this one.The book itself is gorgeous; a jacketless hardback with copper foiling, this intrigued me from the first time I saw it.This is marketed as a simple starter book of physics, told in seven lessons. However, I felt that this book was extremely superficial, giving too much of the authors own bias despite being extremely simple. I also found that though every other scientist in the book was described through their scientific work, the author felt the need to define Stephen Hawking with the following: \"...the physicist famous for having continued to produce outstanding physics despite a medical condition which keeps him confined to a wheelchair and prevents him from speaking without a mechanical aid.\"Who doesn't know who Stephen Hawking is?Why isn't he described through his scientific breakthroughs instead of his disability? (granted the author then goes into his development in black hole theory but this introduction to a world-renowned physicist made me feel uncomfortable)Why was this description even relevant to the book?I felt that this book took simplicity to a level where the author was almost talking down to the reader and although I am no expert when it comes to science and physics, I think if you've read or watched science-fiction or anything to do with science or space, you will not take much away from this. The only good thing I could say about this (apart from the beautiful packaging) is that it has made me want to read something more in depth about these topics.Overall I couldn't recommend this book to be honest. I think there are other books out there that would explain these scientific theories in a better way.1 out of 5 stars!"}], "description": "Everything you need to know about the beauty of modern physics in less than 100 pages.In seven brief lessons, Italian theoretical physicist Carlo Rovelli guides readers with admirable clarity through the most transformative physics breakthroughs of the twentieth and twenty-first centuries. This playful, entertaining and mind-bending introduction to modern physics, already a major bestseller in Italy, explains general relativity, quantum mechanics, elementary particles, gravity, black holes, the complex architecture of the universe, and the role of humans in the strange world Rovelli describes. This is a book about the joy of discovery. It takes readers to the frontiers of our knowledge: to the most minute reaches of the fabric of space, back to the origins of the cosmos, and into the workings of our minds. “Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world,” Rovelli writes. “And it’s breathtaking.”", "title": "Seven Brief Lessons on Physics", "url": "http://www.goodreads.com/book/show/25734172-seven-brief-lessons-on-physics", "average": 3.96, "cover": "https://images.gr-assets.com/books/1443551746l/25734172.jpg", "reviews": 2303, "authors": [{"url": "https://www.goodreads.com/author/show/108952.Carlo_Rovelli", "name": "Carlo Rovelli"}, {"url": "https://www.goodreads.com/author/show/3519611.Simon_Carnell", "name": "Simon Carnell"}, {"url": "https://www.goodreads.com/author/show/943264.Erica_Segre", "name": "Erica Segre"}], "type": ["Nonfiction", "Science", "Science", "Philosophy"], "outlinks": ["http://www.goodreads.com/book/show/25734172-seven-brief-lessons-on-physics", "http://www.goodreads.com/book/show/26810258-seven-brief-lessons-on-physics", "http://www.goodreads.com/book/show/28284636-seven-brief-lessons-on-physics", "http://www.goodreads.com/book/show/25485216-seven-brief-lessons-on-physics", "http://www.goodreads.com/book/show/23355493-sette-brevi-lezioni-di-fisica", "http://www.goodreads.com/book/show/35083032", "http://www.goodreads.com/book/show/26874156-sete-breves-li-es-de-f-sica", "http://www.goodreads.com/book/show/20617550-la-realt-non-come-ci-appare", "http://www.goodreads.com/book/show/35201488-l-ordine-del-tempo", "http://www.goodreads.com/book/show/12632657-the-first-scientist", "http://www.goodreads.com/book/show/187088.Quantum_Gravity", "http://www.goodreads.com/book/show/19284982-et-si-le-temps-n-existait-pas", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}