{"ratings": 15, "userreviews": [{"userName": "Jason Dias", "userReviewDate": "Dec 08, 2017", "userURL": "http://www.goodreads.com/user/show/47401438-jason-dias", "userReview": "Nice work.Alicia is a friend. I've known her about four years, only read her book today.When I got it from her, having heard her describe it, I wondered if it were a mystery. \"Yes?\" she said. Maybe literary? Again, an uncertain \"yes?\" Literary mystery, then. And that fits. In the story, we're trying to solve a 30 year old murder mystery, and the only witness is the confessed killer who herself is busily dying. Out of prison on compassionate discharge, she rests in her brother's house, talking with her niece: the daughter of the sister she confessed to killing.What makes it literary is the nature of the challenges. There isn't the simple task of solving the crime; there are the additional and more important, more central tasks of coming to terms with the events as they happened; with learning about forgiveness; and with growing into certain kinds of freedom.Some of these problems seem to be solved too quickly for my taste, too easily... but the author seems to reach the same conclusion halfway through the book, escalating the personal stakes. It isn't life and death on the line, but life with a conscience we can live with.There are emotional highs and lows. I cried a couple times reading this. The prose is competent, disappearing under the story. The plot is tidy.So there we go. Seven Days of Grace. I read it in three - fast for an old humbug like me."}, {"userName": "Carina Bissett", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/22143313-carina-bissett", "userReview": "This debut novel by Alicia Howie takes a look into the life of a woman suffering from the betrayal of her husband. The narrator's rage and despair over her broken marriage is interrupted with the news of her aunt's failing heath. Kathryn takes the incentive to face this dying woman with the plans to get an answer to a question that has haunted her for decades -- the reasons behind the murder of her parents committed by her Aunt Grace when Kathryn was still an infant. Grace reveals a troubling past, bringing Kathryn to terms with her own domestic problems. As the story unravels, so do Kathryn's preconceived notions of family and revenge. Howie does a lovely job building these complex characters. She gives insight into many of the issues we all share. Is it possible to forgive the betrayal of someone you loved and trusted? Can people love an adopted child as much as their biological children? Do we ever really change? What lengths will people go to in order to protect the ones they love? Howie balances intensely emotional scenes with contemplative narrative that gives added insight into the lives of her intimate cast of characters. The rural setting shifts from innocence to decay and back again with ease, mirroring Kathryn's conflicting emotions. All and all, \"Seven Days of Grace\" is a strong debut novel. Look forward to more from this promising author."}, {"userName": "Jeanne Truesdell", "userReviewDate": "Mar 17, 2015", "userURL": "http://www.goodreads.com/user/show/21068263-jeanne-truesdell", "userReview": "I wanted so much more from this book. It got so close, but then didn't quite reach its potential. I kept wanting her to decide to use her photographer skills to help save her hometown. I also wasn't sure I wanted her to return to her husband. I found her, Grace and Joy's story kind of far reaching to the point of not being realistic. Just fell short everywhere."}, {"userName": "Kristi Lloyd", "userReviewDate": "Mar 05, 2016", "userURL": "http://www.goodreads.com/user/show/20994022-kristi-lloyd", "userReview": "The main characters were so easy to relate to; not too perfect, but not completely innocent, either. I loved how the author blended present day with the past. Though this was a non-paranormal book geared toward adults, I still found a similarity to the Harry Potter/Voldemort relationship. With twists, turns, and surprises, this book would appeal to a wide reading audience."}], "description": "The most pressing issue in Kathryn's life is her husband's new girlfriend. The last thing she wants to do in the middle of her divorce is go to her hometown to confront family skeletons. But, this particular skeleton has a name, Grace, and Grace is the only living person who has the answer to a question that has haunted Kathryn for nearly her entire life. Why are her parents dead? Why did Grace murder them?It’s been nearly 40 years since that fateful night. Kathryn has never met Grace, and now time is running out. Grace is dying and Kathryn has only a few days to get her answer. She comes face to face with the murderer to ask the question, “Why?”The revelations will forever change her life.", "title": "Seven Days of Grace", "url": "http://www.goodreads.com/book/show/19311656-seven-days-of-grace", "average": 4.07, "cover": "https://images.gr-assets.com/books/1386614675l/19311656.jpg", "reviews": 4, "authors": [{"url": "https://www.goodreads.com/author/show/7519462.Alicia_Howie", "name": "Alicia Howie"}], "type": ["Mystery"], "outlinks": ["http://www.goodreads.com/book/show/19311656-seven-days-of-grace", "http://www.goodreads.com/book/show/19441371-the-key-of-katahdin", "http://www.goodreads.com/book/show/27414986-caped"]}