{"ratings": 222625, "userreviews": [{"userName": "Emily May", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "This is not a dystopia, it is a romance. This is not a novel, it is a collection of similes and metaphors, most of which do not make sense. I originally gave Shatter Me two stars because that's my sort of kneejerk reaction to books I don't like, but after thinking it over for a while, I can't recall anything positive about it that would justify a rating of more than one star.You're probably assuming - correctly - that I went into this book with low expectations. This is completely true. Any so-called \"dystopia\" with a runway model on the front cover leaves me feeling sceptical. However, I was also prepared to allow myself to be surprised; a lot of my friends loved this and one of the biggest criticisms didn't actually bother me - purple prose. I think there's a fine line in writing between the pretty and the purplish and different readers will define it in their own way. For example, some reviewers thought that Lips Touch: Three Times was just a mess of bloated purple prose, whereas I thought it was one of the most beautiful books I read last year. I have a high tolerance level for flowery writing. But...Shatter Me's numerous metaphors, similes, and endless descriptions just didn't make sense. What is this?:\"Hate looks like everybody else until it smiles. Until it spins around and lies with lips and teeth carved into semblance of something too passive to punch.\"I just... WHAT??? This is one example floating around in there, but every second sentence is like this! That's not even mentioning the annoying strike-outs. Trust me, no really, trust me, I thought people were being overly picky when they said the crossed out sentences were annoying. I actually thought it sounded interesting, unusual, especially because the whole thing is meant to be written in a notebook and I cross stuff out in mine all the time. But you have no idea how bloody annoying this is to read. All the effin' time. People didn't exaggerate: it will most likely drive you crazy.However, there was one thing that for me was even more annoying than the descriptions, the similes, the strikes, and that was the stupid repetition thing: \"and then and then and then...\" Again, if it had been used once, or sparingly even, then it wouldn't be so bad. I may have thought it was an interesting literary technique. But Shatter Me had way way way too much of everything (see what I did there?).And story? What story? *sigh* It's about time we just opened up an entirely new genre called \"Dystopian Romance\" or alternatively \"Romantic Dystopia\", though I don't wish to be pessimistic, I'm pretty sure half the new releases of 2012 will make it into that category. If there was a story then it drowned amidst the waves of overenthusiastic and flowery prose. This reminded me of Article 5 in that the dystopia was there to make the romance interesting. One was certainly there to complement the other, but it was the wrong way around.Also... kissing when you are fleeing for your lives?? I'm sure this is not the correct way of things, right? And yet it occurs in way too many young adult books. I'm like: \"run, run, run!\" but the characters are too busy swapping saliva. I must be old-fashioned in my thinking that staying alive is kinda important.There are a lot of things that, had they been there, could have convinced me to up this to two stars. One star ratings make me feel sucky. But I'm sorry guys, I wasn't even entertained. The beginning was intriguing but there was so little plot beyond the romance that it quickly became tedious. I hated the prose, I felt nothing either way for the characters, this series ends here for me."}, {"userName": "Haleema", "userReviewDate": "Jan 11, 2012", "userURL": "http://www.goodreads.com/user/show/4336293-haleema", "userReview": "I know many found this book to be oh so romantic, but I can't help but think how gross it was.The writing:Mafi's style of writing varies. Let me categorize.This doesn't even make sense writing:\"I catch the rose petals as they fall from my cheeks, as they float around the frame of my body, as they cover me in something that feels like the absence of courage.\"\"He says it with a small smile the size of Jupiter.\"I'm picturing this in my head and it's not pretty writing:\"Every organ in my body falls to the ground.\"\"There are 400 cotton balls caught in my windpipe.\"\"My mouth is sitting on my kneecaps.\"\"My jaw is dangling from my shoelace.\"\"My stomach drops onto my knees.\"\"I blush through my bones.\"\"My spine is conducting enough electricity to power a city.\"Repetition gone wrong writing:\"I blush.\"\"I blush.\"\"His lips part. Close.\"\"I blush.\"\"I blush.\"\"His lips part. Close.\"\"I blush.\"\"I blush.\"\"His lips part. Close.\" Really just shit writing in general writing:\"I am an old creaky staircase when I wake up.\"\"Warner thinks Adam is a cardboard cutout of vanilla regurgitations.\" Do I need to explain how shitty this writing is?The characters:Juliette does nothing but sulk around, wait for death, whine, and has very creepy thoughts of Adam. Adam is just there...Warner is a pathetic excuse for a villain.I must admit that a few times, he had potential to be a good character. I thought he was the only character that actually had a purpose. He made me cringe with his insanity. He made me angry, made me feel uncomfortable. He was getting there. Then he would say something so cheesy, so inconsistent with his character, and just downright stupid that I lost all hope in him.Kenji was just fucking annoying. The plot:Besides Juliette's constant whining and lameness and the cringeworthy romances, this story was just a sadder and lamer version of X-Men. It had too many X-Men vibes going on. On the whole:Mafi, if you wanted to capture me with I'm just trying way too hard to sound cool unique prose, thinking that if you repeated phrases fifty times every once in a while, had painful metaphors, and an unnecessary abundance of irritating striking texts, then*reads acknowledgments*You've filled my days with shooting stars, and one day I will pluck the moon from the sky and put it in your mailbox.She speaks like that in real life...?"}, {"userName": "Rachel E. Carter", "userReviewDate": "Jul 06, 2014", "userURL": "http://www.goodreads.com/user/show/29482005-rachel-e-carter", "userReview": "[TeamWarner. TeamWarner. TeamOhMyGawdILoveHimWarner!!! (hide spoiler)]"}, {"userName": "Whitney Atkinson", "userReviewDate": "Nov 10, 2012", "userURL": "http://www.goodreads.com/user/show/14457130-whitney-atkinson", "userReview": "November 2017I picked this back up on a whim because I've been dealing with anxiety lately and wanted to return to something comforting, so I decided to annotate one of my paperback copies. And I gotta say, It's.... weird returning to book one. Ignite Me is my favorite book of all time, and rereading that book is such an immersive experience that I always come out of feeling empowered. This book, on the other hand, holds such a special place in my heart because it's so relatable that it hurts. From Juliette's panic to her awkwardness to her resilience to the writing style, everything just hurts so good. There's parts of me that I see in Juliette, and there's parts of Juliette that I wish I could be better at. It's just such a refreshing and inspirational book to read because it's about someone who has been handed the shittiest circumstances and still looks for the best in others, perseveres, and demands what's right for her. It's about learning to trust and realizing your worth and giving people second chances. FUCK i'm about to cry typing this review. I love Juliette so much and I love Tahereh even more for sharing a story that touches the deepest corners of my heart. It's truly a life-changing book for me. I’ve always read this as the story of a sad, self-conscious, self-loathing girl learning to see past obstacles to find love in herself and to let others in. however, i haven't read this since summer 2016, so my experience of reading this after the election & other #stressful political happenings opened my eyes to a completely new underside of the story. It had always been visible to me but was it never at the forefront, but this time I noticed it so vividly: this is also the story about a deeply hurt and angry girl who wants justice. People always criticize Juliette for being weak and annoying, especially in Unravel Me, but when she pushes back against her fear and stands up for herself, it's jaw-dropping. I envy her ability to know what's best for her and hold others' happiness and safety above her own even though she's gone through so much turmoil and deserves to be the person being looked out for. I used to think that Juliette gets suddenly really strong in Ignite Me, but reading this closely just showed how ready she was for that transformation. In my annotated editions, I use blue highlighter to mark parts where Juliette is really badass, and I didn't expect to use it a ton in this one, but it's everywhere. Juliette is a pure and fearless motherfucker. Even in book one she has powerful quotes like \"I'm not yours to want,\" and it challenges all the ideas Warner tries to install into her head.Which is where this book gets slippery. It's getting really, really difficult for me to reconcile Warner's actions in book one. I've definitely had others question how I ship Juliette with Warner after all he's put Juliette through in this book, and it's a valid concern. Every time I think about this book, i'm just kinda like “hahaha problematic warner but whatever.” But the more I reread, especially after ignite me came out, and ESPECIALLY during this particular reread, the more questions I have that I can only hope will now be explained in restore me. Don't get me wrong, this book still means so much to me because of juliette, but there’s no possible way for me to read this book with the mindset “omg i love warner!!” because he’s literally the villain and he does and says so many problematic, manipulative things. Honestly, I don't think it's fair to justify everything Warner does. While rereading this I was actually shocked at the amount of nasty things he says to her, that I obviously must have forgotten or blocked from my memory. Things like telling her she'll be miserable if she leaves him because no one else will want her, calling her a monster, professing his love for her even when she's clearly uncomfortable. In Unravel Me and Ignite Me he explains why he did these things and says that he regrets doing it, but... it seems to go so far in this book. I almost theorize that Tahereh must have written warner in book 1 to continue being a villain throughout the series, but there's way too many threads that suggest otherwise (ie. the introduction of the angst behind warner's mom, the fact that she felt \"electricity\" during their kiss, etc.)I feel like I could write an essay about this topic: the inconsistencies of Warner's personality, and whether or not it's justifiable to forgive him for his \"misjudgments\" of Juliette. It's just so strange to me that Adam & Kenji can say \"Warner is a lot of things, but he's not stupid,\" and yet Warner misreads her SO horribly. I mean, in the scene that he corners her and kisses her, he's literally saying \"I want you to choose me\" and \"I love you\" and later admits that he thought she was into it, EVEN THOUGH she literally said \"You're sick/you're a monster/etc.\" and physically tried to punch him before he pinned her to the wall. If he's so smart, then why couldn't he tell that every time he talks to her, she's afraid and disgusted? Is it really that easy to mistake fear for excitement? Disgust for nerousness? His behavior is so coercive and manipulative, and even though I know he was just trying to get a reaction out of her so that she would abandon her fear and finally use her power, there's not nearly enough of an apology as I would expect for things of this magnitude. The reason why I don't consider Warner an outright misogynist is an incredibly nuanced (and long) discussion, but the difference between him and, say, a Colleen Hoover character is that while Warner is saying and doing problematic things, he is also being cast in a problematic light. He is literally the villain of this story for putting her in those situations. Had Juliette been like \"omg he's pinning me against a wall and threatening me, he's so dominating <3\" then that would a lot more concerning. But I'm gonna have to reread Unravel Me as well to refresh my memory on how Warner addresses these actions and words because I really don't think he apologized or explained himself well enough, and I think it's totally valid for Juliette to absolutely roast him in Restore Me for treating her so shittily. My outrage about it is fresh though, and maybe Juliette comes to terms with his actions in a later book that I've forgotten about.Also? Drag me, but Adam doesn't get enough credit in this book. I know we all love to shit on him--myself included--for the direction he goes in Ignite Me, but his place in her journey of self-discovery is vital. Imagine this book without Adam, without that glimmer of hope and self-love that he installs in her. He's the first person to reassure her of herself and humanize her. Sure, they're not right for each other in the end, but it's not okay to dismiss their entire relationship as bullshit, because he DID help her see herself as something other than a monster, and I can't even imagine what this series would have been like if it were only Juliette brooding alone in her room, dreading Warner, stuck there until Warner was forced to tell her the truth about his mom or until Anderson showed up to ask what was taking so long. Idk. There's so many important quotes from Adam in this book. Sometimes it falls into the type of narrative that feels like \"ugghhhh, she needed a boy to 'fix' her,\" but in reality, sometimes your friends have your back and reassure you of your worth, and sometimes your friends are more than your friends. I could make a LIST of all the positive things Adam said to Juliette in this book that caused her confidence to sky rocket, whereas almost everything Warner said installed panic and fear in her. So clearly I have conflicting feelings, but none of them intercede with the fact that I still cannot get over how much I adore this story. Sure, Warner sucks and I unironically wrote \"ew\" by half the things he says to her in this book, but watching Juliette's transformation and relating to her insecurities and thought process, as well as remembering how much I adored this book as a young teen, it's always going to be a priceless experience to me.July 2016I think this is my fourth or fifth time rereading it? I didn't plan to but my aunt showed interest in reading it and I jokingly offered to read it out loud to her, and she said yes. Thus, I proceeded to read this entire book out loud to her. And it was worth it.And what can I say? I love this book. I fucking love Juliette. Reading it out loud made me slightly more aware of how lame her stream of consciousness can sound, and how the metaphors become exhausting after a while. But I've sort of accepted that book one is always going to be slightly uncomfortable to reread just because of the fact that so much has changed by book 3 that this is almost cringe-worthy. There's so much set-up for world building that never occurs. Honestly this book is more of a 3 star rating, but I can't bring myself to lower it. It was due for a reread since it had been just about two years, and, like always, I noted several things that I had missed or forgotten since I read it last! August 2015I'm not quite sure why i've never uploaded a review on goodreads for this book. I mean, I feel like it kind of goes without saying how I feel about it but ya know. This is my favorite series. If you're sick of dystopian and never want to read one ever again, make an exception for this one. Ignore the fact that the entire fandom (and myself) has probably majorly spoiled you. But this book. Holy shit. The writing. YES. The characters. YES. The plot. YES. The range of emotions. YES. I could tell you the things wrong with it, but no book is perfect. But if you want a book with characters that you will not be able to get out of your head and with a plot that will have you reading an entire trilogy in one sitting, this book is your friend. reread: July 2014"}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Apr 15, 2011", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "Juliette describing Adam’s eyes“...perfect shade of cobalt, blue like a blossoming bruise, clear and deep and decided”“…careful, curious”“… 2 buckets of rainwater; deep, fresh, clear”“…blue and bottomless like the deepest part of the ocean”“…tight” “…as tight as his fists as tight as the strain in his arms”“…bottomless blue”“…blue blue blue”“…midnight moment filled with memories, the only windows into my world”“… always shining the darkness”“…two pools of perfection, open, honest, humble”“…a shade of blue in a midnight sky”Juliette describing Adam’s gaze“…like a white-hot poker pressed against my skin”“…touching every inch of my body”“…locked into mine”“… is fixed on me: calm, unflappable; 2 buckets of river water at midnight. I’d like to cry into his eyes”I’ve never been a purple prose type of girl. A book that will forever remain nameless spoke of “leaking wombs” and well it made me shiver. It also introduced me to the entire concept of purple prose. Prose can be beautiful. I’ve read plenty of books where the writing touches me deeply and the author is simply writing about the sunset, or a walk in the park, or the plight of the poor. If the author is able to actually tell a story without distracting the reader with the prose, I’m all for it. That is not the case with “Shatter Me”. “Shatter Me” was like my first attempt at cooking a turkey  over-done. It was  like climbing Mount Everest  tiring, watching kids play outside your window while you are taking a test  distracting, and my dog throwing his bone at me silly. At some point, I was drowning, desperately searching for land overwhelmed by the prose and eager for the story. And don’t get me started about the crossing out of passages in the book. It was irritating,  annoying stupid  a cheap trick  dumb, something I did not enjoy. Overall-I won’t read the next book.I might read the next book if I get a free copy.I’m curious to see where the author can go since it is clear that she can write. I think someone needed to  put a leash on the over playful puppy edit her prose down to a more controllable level so that people could enjoy the story rather than cringe with every every every  regurgitation  eruption  spewing  listen you need to stop crossing me off or I’m gonna sick some nasty virus on your ass incident of prose."}, {"userName": "Val ⚓️ Shameless ⚓️ Steamy Reads", "userReviewDate": "Mar 04, 2018", "userURL": "http://www.goodreads.com/user/show/11626803-val-shameless-steamy-reads", "userReview": "I deserve a medal for finishing this book.Like, the Olympic gold medal in the Anti-DNF Games, people. *Rant Ahead*It took me three months to finish this book.THREE. (Not 3, Miss Mafi)Now, normally, I would have tossed this book out the window like an overwrought Silver Linings Playbook Bradley Cooper, being that I AM the queen of the heartless page 15 DNF; however, I find that I have a harder time DNFing something when I am 1) Reading a physical copy as opposed to a digital copy, and 2) When I already OWN books two and three and am hoping to FUCK I didn't waste my money. That said, this book annoyed me on several different levels. 1) Juliette's \"power\" or \"glitch\" or whatever the hell it is, is never fully explained in detail. It's skirted around in a mass of overwrought metaphors and complete bullshit. 2) Said overwrought metaphors.3) The writing itself in general. Despite having a degree in English and Literature, I am usually pretty easygoing about typos and grammar, especially when it comes to self-published stuff. I mean just LOOK at the slang and vernacular I use in my reviews. I am NOT a hard ass about this stuff. HOWEVER.When I am holding a professionally published, FINISHED copy of a mass produced book and it contains strikeouts, sentences starting in lowercase letters, and numbers one through ten incorrectly placed in number form, e.g., \"Juliette has 2 hands and 0 1 brain,\" my inner grammar maven's granny panties get twisted so far up her ass, it's impossible to focus. I mean, I GET that this was all a stylistic choice, etc. That the sporadic, all over the place, SHITTY sentence structure was supposed to reflect Juliette's instability, or whatever the fuck it was supposed to reflect, but I just can't get behind starting a sentence with \"4,\" my friends. Add to that the insta-love between Juliette and Adam and the spindly world-building of a completely unclear and poorly wrought dystopian society and you have a wreck of a book that merely has a pretty cover. Now I am left with the crushing decision of whether or not I try book two (since I, like an idiot, already bought it) or if I just march the whole trilogy down to my favorite used book store and hope the fact that this series is about to have a new book published gets me top dollar. Decisions, decisions."}, {"userName": "Kat Kennedy", "userReviewDate": "Feb 11, 2012", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "[– the end­ing? That pissed me off the most! Xavier’s school for Mutants in Rebel­lion of the Oppres­sive Dystopian Régime? FML! And the suit, using that word loosely, that they pro­vide for her at the end? Yeah, that’s great…Doesn’t EVERY woman look at this suit and just say to them­selves, “Yes! I can’t wait to wear this! This doesn’t objec­tify me as a woman, degrade me as a human being and make an embar­rass­ment out of every­one involved. Not. At. All.It’s like the mutant ver­sion of fan­tasy armour for women. And as we all know, Women’s armour sucks.” (hide spoiler)]"}, {"userName": "Shannon", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "I always wonder about raindrops.I wonder about how they’re always falling down, tripping over their own feet, breaking their legs and forgetting their parachutes as they tumble right out of the sky toward an uncertain end. It’s like someone is emptying their pockets over the earth and doesn’t seem to care where the contents fall, doesn’t seem to care that the raindrops burst when they hit the ground, that they shatter when they fall to the floor, that people curse the days the drops dare to tap on their doors.Let me translate what Mafi was trying to say; \"It was raining.\"This is one of, if not THE major problem of Shatter Me; she tries too hard to be clever and poetic and the story gets muddied along the way.I apologize for not going more in depth with this review, but I read this book over three months ago now and all I remember is that I hated it and it was incredibly poorly written. I think my status updates should show this pretty clearly, but to make this easier to see, I've decided to write this somewhat brief review and sort through a few of my updates as well.A device Mafi chooses to use early on is crossing striking out the words that \"crazy\" Juliette is \"really\" thinking. As the story goes on this device gets used less and less and so it feels more like Mafi just used it in the beginning for fun and to make her book look different from the rest of the young adult books out there, which, unfortunately, it is NOT, especially when you get to the romance. And that is what this story is: a romance, and a disgustingly sappy one at that. I don't think you'll be able to believe these favorite quotes of mine until you read them for yourself:\"I'd like to cry into his eyes.\"\"His body presses closer and I realize I'm paying attention to nothing but the dandelions blowing wishes in my lungs.\"\"I'm suddenly desperate to drink in every drop of his being, desperate to savor every moment I've never known before. I suddenly worry that there's an expiration date on this phenomenon.The possibility of losing himThe possibility of losing himThe possibility of losing him is 100 years of solitude I don't want to imagine.Realization is a pendulum the size of the moon. It won't stop slamming into me.\"\"His heart is racing so fast I can't distinguish it from my own. It's 5,000 degrees in the air between us.\"\"I've run out of words. My pockets are full of letters I can't string together.\"\"I want to fall asleep to the sound of his heart beating in the atmosphere.\"\"His eyes are a midnight moment filled with memories, the only windows into my world.\"\"My heart fails for a moment.There are 400 cotton balls caught in my windpipe.\"\"James and Adam glance back at me and I melt into pink Play-Doh.\"\"I'm up.Spinning.Scanning.Scared.They found us is the only thing I can think of. My stomach is a flimsy crepe, my heart a raging woodpecker, my blood a river of anxiety.\"\"It's raining today. The sky is weeping for us.\"\"His lips are spelling secrets and my ears are spilling ink, staining my skin with his stories.\"\"The sun is revolving around the moon when he responds.\"\"I offer him a smile. Try to keep my organs from falling out. Hope the holes in my head aren't showing.\"\"My mouth is sitting on my kneecaps.\"\"My neck snaps up to meet his dark eyes, his smooth voice, silky and strong.\"\"My jaw is dangling from my shoelace.\"\"I'm blushing through my bones.\"\"Adam pulls back just a tiny bit. Kisses my bottom lip. Bites it for just a second. His skin is 100 degrees hotter than it was a moment ago. His lips are pressed against my neck and my hands are on a journey down his upper body and I'm wondering why there are so many freight trains in my heart, why his chest is a broken harmonica.\"And that, my friends, is that. I thought it was awful. Even if I didn't think the writing was trite and overwrought, later on it really starts to feel like she's borrowing heavily from the X-Men mythos (even though she claims she's never even seen the movies.) If you read the few quotes I've listed above and they're not your cup of tea, I'd say skip this one and try something else. Or maybe watch one of the X-Men movies instead; you'll get a much better portrayal of Rogue and a steamier love story. Mmm ... Wolverine."}, {"userName": "Steph Sinclair", "userReviewDate": "Nov 05, 2011", "userURL": "http://www.goodreads.com/user/show/4642710-steph-sinclair", "userReview": "“I always wonder about raindrops.I wonder about how they're always falling down, tripping over their own feet, breaking their legs and forgetting their parachutes as they tumble right out of the sky toward an uncertain end. It's like someone is emptying their pockets over the earth and doesn't seem to care where the contents fall, doesn't seem to care that the raindrops burst when they hit the ground, that they shatter when they fall to the floor, that people curse the days the drops dare to tap on their doors.I am a raindrop.My parents emptied their pockets of me and left me to evaporate on a concrete slab.” \nHere lies Steph Sinclair, slaughtered by metaphors raindrops."}, {"userName": "shady boots | #20gayteen", "userReviewDate": "Sep 12, 2011", "userURL": "http://www.goodreads.com/user/show/4972138-shady-boots-20gayteen", "userReview": "By the way, check out this fan made poster for the movie, if there ever was one.Made by skellingt0n on deviantART.I looove it! Exactly how I would picture a movie poster for this book._________________I read this book in one sitting.For five hours, I read this. It was a school night and I stayed up all night. That's how much this book pulled me.I know that there are many people who didn't like this book, some even hate it, but... Gah, it was just so awesome to me! It's definitely one of those books that pulled me in and refused to let go. I loved every minute of it, and I guess I see why it's getting all the hate─insta-love, lack of world-building, the writing style, etc etc─but... I don't know, something about this book just really really wowed me, and it was fucking awesome in my eyes.Also, the author herself is awesome as well. <3 Here is her YouTube channel where you can see all of her adorableness. :DOverall, in spite of all the hate this book is getting, I absolutely loved it, and can't wait for the sequel."}, {"userName": "Virginia Ronan ♥ Herondale ♥", "userReviewDate": "Jul 03, 2017", "userURL": "http://www.goodreads.com/user/show/69106439-virginia-ronan-herondale", "userReview": "I seriously don’t know why it took me so long to dig my claws into this book, but I definitely know that I don’t regret doing it! ;-)“Shatter me” was an awesome read and I enjoyed it immensely! There were so many things I loved about this book and whilst it is true that many people complained about the writing style, I have to admit that I actually loved it. “Hope is hugging me, holding me in its arms, wiping away my tears and telling me that today and tomorrow and two days from now I will be just fine and I'm so delirious I actually dare to believe it.”I think it was something new and extraordinary and I loved the way Juliette described her world. The repetitions, her thoughts, the things she thought and even the truths she vehemently refused to admit. It all gave me a very good picture of her character and her mind, the many things she must have gone through shaping her into a person that distrusts everyone and desperately tries not to feel anything. XD Of course she’s failing but this actually only made her even more likeable. *lol*See where I’m getting at? Tahereh Mafi knows exactly what she’s doing and she really managed to drag me into her world. Yes, I confess! I’m officially hooked now and I’m soo going to read all of the other books! ;-PSo be prepared to read many reviews! *LOL*Okay, enough of the threats and right back to the characters! Oh, the characters! There’s so much to tell! XD\nFAIR WARNING: Mild spoilers lying ahead of you! ;-)\nJuliette: At the beginning of the book you don’t even know her name. Everything you know is that she’s been imprisoned for ages and that she’s more than just a little insecure. Considering her ability this is no surprise though, the fact she can hurt and even kill people with just the touch of her fingertips making it kind of hard to be all too sociable. Juliette may not talk a lot but she sees everything and she’s more than just observant. She obviously also seems to have a knack for poetry and I really enjoyed the way she used her words. “All I ever wanted was to reach out and touch another human being not just with my hands but with my heart.”Adam: That boy is hot as hell and Juliette’s new cell mate! Could a girl ask for more? Dark hair, blue eyes, awesome and muscular body! *drools* Okay, okay! I’m back on track! *lol* Yeah, as you can see Adam is just awesome boyfriend material and it’s no wonder that they kind of hit it off! He’s caring and gentle and he always tries to understand Juliette’s thoughts. I liked him from the beginning and I’m really curious to find out how things are going to proceed in the next books. =)Sidenote: Is it just me or does he never tell Juliette that he loves her? O_o I thought this was kind of odd. Juliette told him she loved him but as far as I could read he never returned it…. Did I miss anything? xDGod, Juliette, I'd follow you anywhere. You're the only good thing left in this world.”Warner: Oh my god! Warner! Gosh! Warner! Argh! Warner! *babbling mess* That boy, that boy gave me all the feels! Good and bad! Happy and angry! Disgusted and longing for more! *lol* I wanted him to touch Juliette and I wanted her to touch him! I just couldn’t decide if I wanted it because I wanted him to hurt or because I wanted them to make out! *LOL* What is it with me and the villains? Why do I love them so much!? XD First Maven and now Warner, I think I’m going to die! >_< Oh, well I think I’m supposed to say something about his character as well so here I go: He’s ruthless when he is with his soldiers but he is gentle whenever he is with Juliette. He seems to care about her a LOT and he even admitted that he loved her! But why does he hurt her so much? Warner is a big question mark and some sort of mystery I’m determined to solve. So yesh, I’m so going to read “Destroy me” after I wrote this review! XD His smile is laced with dynamite. \"Go to sleep.\"\"Go to hell.\"He works his jaw. Walks to the door. \"I'm working on it.”\"I'm nineteen years old.\" He clarifies. \"I'm a fairly impressive specimen for my age, I know.\" Kenji: I loved Kenji! That boy is so funny and I really enjoyed his sassy demeanour. He’s constantly hitting on Juliette and his character gives the book a hilarious edge. I want more of him and actually can’t wait to meet him again! =)His grin is crooked. \"I don't know why, but I kind of like it when you threaten me.\"\"That's because you're an idiot.\"\"Nah.\" He shakes his head. \"You've got a sexy voice makes everything sound naughty.\"So, if you haven’t already figured it out: YES I liked “Shatter me” and I can easily recommend it to anyone who’s looking for a nice and short-lived page turner! =)Enjoy! ;-P"}, {"userName": "Etnik", "userReviewDate": "Sep 22, 2014", "userURL": "http://www.goodreads.com/user/show/34369915-etnik", "userReview": "You can find the full review and more about this book on my blog!This was something...and I liked it.Okay so the first 200 pages were like the dullest,cheesiest romance bullshit,like the level of cheesiness was above normal,and you know how I feel about that.I sometimes thought to quit,but god,I am glad I didn't.You know when you loose all the hope but then one things clings and you see the light again? Omega Point was that for me.Like my thoughts about this book changed 100 percent.There are 3 things that I truly cherish in life: 1.Girls in tight outfits, 2.Dragons, 3.Superpowers and that's what I got in the last 50 pages and it is enough for me,enough to continue with the series.I don't know why but I got a vibe of fantastic 4,maybe with Wilson hugging himself twice if you know what I mean.One thing I can't wrap my mind of,one things I can't get is the hype for Warner.He is like the worst character in the book ,he is like Joffrey from Game of Thrones for me and if you know me just a little you would know how much I truly deeply hate him and I am hoping he gets killed.But absolutely get the hype for Kenji,like that guy is a legend.I feel like we are already buddies.Such a cool humor,got me laughing out loud.In the other hand Juliette,I don't know why but I got the feeling like I remember her from somewhere.I like her like a lot,she cries much,and she literally has a million chances to kill people she wants to kill but doesn't,but god she is beautiful.I don't know some people are just beautiful,now in what they look,not in what they say,just in what they are,and she was beautiful to me that way.I will definitely continue the series.I like the plot,and now with superpowers it is a million times better.I recommend this book to every reader out there,it has a different writing style,some call it beautiful and unique,and I can't disagree,it's just that I didn't find it beautiful.It was annyoing like hell,especially at the beginnings.I know I will get a bunch of replies for not liking Warner,but seriously people what's there to like?"}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "(2.5?) The lack of world building is one of my main issues with this book (even though it seems like things will be explained in book 2... a full book with little world building is boring!).I didn't love the writing and the characters felt very one dimensional.Kinda felt like another YA dystopian world with a love triangle and an incredibly pretty main character - even after spending over 6 months isolated, underfed... and the fact that she hasn't seen herself in the mirror in 3 years... Her beauty is mentioned in pretty awkward moments.If it wasn't for the fact that people say the series becomes way better after book 1 I would stop but I'll give the second book a try!"}, {"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "I was going to take this down one star but I'm too lazy to change it on my blog so there! Re/read on audio for the upcoming continuation of the series ♥Picture by George Redhawk Holy butt-crack! I loved this book! Yay! Another trilogy for me. I already have the other books. You can seriously go broke on Goodreads! Sooo.. I think I'm going to have to add **SPOILERS**! Read at your own risk :) This book captured me from the start! Juliette has lived in a type of mental ward for 264 days. She doesn't get to talk to anyone or do anything. It takes a good bit of time for them to tell you why her parents threw her in this place. She killed a little boy just by touching him. If she touches you, she sucks the life right out of you. Soooo... she hasn't touched anyone in 264 days either. She was devastated, she just wanted to try to give the little boy some comfort when his mom was being horrible to him. I love the way the author has her repeating sentences two or three times to herself or in her little notebook. I do that myself when I'm in one of my moods! It made her seem real. I mean who wouldn't be a little nutzy cuckoo locked up alone for that long and knowing you couldn't touch anyone. Well, it would come in handy for your enemies!! Out of the blue one day they announce they are going to give her a roommate. She gets Adam. Lovely, yummy Adam :) Come to find out she has known him all of her life, from childhood. Anyhoo, then we find out Adam is a soldier to some wicked dude that pulls her out of the place. This man named Warren wants to use her as a weapon to kill people. I mean what evil villain wouldn't right? He also has a little crush on her but he's a jerk and evil so that's a no go. She is in love with Adam and he with her. They have loved each other all of their lives and guess what? He can touch her without being killed :) They break out and go to Adam's home to see his younger brother. It's in a place where the bad people don't generally go. Some other soldier ends up coming to the house all shot and what not and telling them he knows of a safe place for them to go. They start to head out as the bad guy finds them, Adam gets shot but will be ok. And for some reason that jerk can touch Juliette now too. She shoots him, but we all know he's not dead! They make it to the safe house and all I can say from there is it reminds me of X-Men. There are a whole crew of \"different\" peeps there. I'm excited to find out what will happen with all of these new friends. Awesome book! Happy Reading! Mel ❤️MY BLOG: Melissa Martin's Reading List"}, {"userName": "Zemira (Kylo Ren fangirl) Warner", "userReviewDate": "Jul 14, 2011", "userURL": "http://www.goodreads.com/user/show/4995937-zemira-kylo-ren-fangirl-warner", "userReview": "[image error]"}, {"userName": "Warda", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/30036082-warda", "userReview": "So, surprisingly, this book wasn't as shitty as the first time I read it. This time I found myself really enjoying the book. A lot. The writing didn't irritate me. Neither did Juliette. Or the plot.Favourite thing about this book: Adam (BABE!) and Kenji (I can see myself falling for this guy. He is hilarious!).Now, Warner better go through some incredible and logical character development, because he's a fuckin sadist in this book and as a villain, I love him. As a love interest... for now, no. I rather his balls be sawed off. I cannot fathom what the transition will be. I really can't, so I'm intrigued, but also worried BECAUSE WHAT IF I FALL FOR A SADIST WHAT DOES THAT SAY ABOUT ME I AM WORRIED AND RESISTING RIGHT NOW!There was a moment where Warner and Juliette kissed in the book and I felt sick to my stomach, because my girl apparently felt some fuckin chemistry between them, which pissed me off. I MEAN HOW! THAT FUCKER IS USING HER AND HE HAS THE AUDACITY TO TELL HER TO CHOOSE HIM LOVE HIM AND THEN GOES ON TO MAKE HER DO EVIL SHIT AND HE SHOVES HIS TONGUE DOWN HER THROAT PRETENDING TO CARE AND THE CYCLE CONTINUES LIKE WHAT THE FUCK THOUGH! Like I said, as a villain I can tolerate all this crap. I love it and think it's genius. But him having any sort of bond with Juliette just creeps me out.Adam for life.Over and out. ---------------------------------Because of the hype (damn you people for being so convincing!) I re-bought Shatter Me and the other books, which I never read initially, but now that book four is due to come out and everyone was losing their mind over it, I'm giving this series another shot. A lot are saying that it gets better after book one and I'm hoping that is the case for me as well. I want to join in and swoon over Warner, darnit!----------------------------------INITIAL REVIEW.Other than its addictive quality and how fast-paced it was, this book is slightly overrated. The relationships developed way too quickly. The male characters fawning over Juliette was just unnecessary and stupid. I get it: she's beautiful. Is there anything else to her? More world building and better introduction to the plot and characters was needed. It all just felt too rushed. People have loved Mafi's writing style, but I don't see it. It's over the top. And slightly cheesy."}, {"userName": "Brittney ~ Reverie and Ink", "userReviewDate": "Jun 04, 2016", "userURL": "http://www.goodreads.com/user/show/50044222-brittney-reverie-and-ink", "userReview": "MKAY. First of all. I actually liked this but I must rant.. I must... then I promise to go to book 2 immediately.WHY. WHYWHYWHYWHY. I swear, if the writing hadn’t been so awkwardly aghhh… this book would have been a 4 star book. No, it was not just the strikeouts and crazy reputations. It wasn’t even the unfinished sentences.Please please please explain to me how you come up with sentences like this…\n\n“He’s so wrong he’s so wrong he’s more wrong than an upside-down rainbow”\n\nor \n\n“He smiles with teeth so white it looks like snow falling on the chocolate valleys of his face”\n\nUm. Okay? I swear this book was littered with those.. I don’t even know what to call them… on every single page. I’m really sorry but I just needed to rant about that. Why Mrs. Mafi.. WHY. Okay. Moving on.So OK. I’m kind of ashamed to admit that I was totally into the story. Ugh whatever. I’m not ashamed. Maybe I am. Whatever. It wasn’t the most original story ever and it certainly had its very…odd… parts… but I’m totally curious about book two and I’ll definitely be continuing. Maybe because the promise of something more from friends? Who knows. I can’t help it… I got into it. (Harriet, girlfriend.. thanks for being there for me.) As I continued powering through...I found that I never got less annoyed with the writing SO I just started skipping the unnecessary sentences… thus the book was a little more enjoyable. ***************This is where I’m going to get somewhat spoilery so stop here if you haven’t read this book…The CharactersJuliette. I feel very meh about her. I mean I feel for her- I do, but I’m waiting to see what she’s made of. Adam. Yeah, yeah. Ok. I’m sad for him. I like him. The whole taking are of your family, living through abuse— I feel you bro, I feel you. Thats some tough crap. Warner…. well alright. I don’t know if its because of all the crazy fandoms over this guy but I’m interested. Clearly we haven’t the foggiest on whats going on in his little brain. Right now he seems like an over obsessed lunatic… but who knows. Kenji - Congrats dude. You’ve won my favorite character for this book award. (This dude is basically Jax’s close (from the Air Awakens series.) Lets call you Mr. Personality. Juliette + Adam’s rather quickly escalating relationshipDon’t hate me guys but I have some issues with this. YES there are feels… and I would have totally been on board for them EXCEPT FOR THE FACT that how can you be so focused on lust when you both are literally fighting/running for your life?? I’m sorry, but making out is the last thing that should be on your mind if you are trying to keep each other alive. Ughhh Tamlin much? Like you guys were apart for years and you never talked to each other in the first place (AND YES THAT BUILD UP WAS SWEET… I genuinely appreciated their connection..) but come on - talk first! Survive first! Chill your dills. \nSeriously, I liked these two together.. but that just made me uncomfortable. \nWhatever, I know what happens to them in book 2. The WorldbuildingSo this was really only mildly developed- we’re only told bits and pieces. Honestly this didn’t bother me though- I’m typically much more interested in the characters. It feels like a fairy generic dystopian world but whatever. I anticipate much more from this in book 2.Okay but really WTF is with elastic boy?? Da fuck? Lasting ImpressionsSo despite my little rants... WHATEVER OK.. I'm ready for book 2 because well... you guys convinced me. You win, friends, you win. My Blog ~ Instagram"}, {"userName": "Lia Bonnibel  (pidgey) ", "userReviewDate": "Oct 14, 2017", "userURL": "http://www.goodreads.com/user/show/66222749-lia-bonnibel-pidgey", "userReview": "This is gooooooooood. \nI'm not giving it 5 stars because, even if I admire the shit out of the author's style and talent, the writing is a bit too pretentious at times (hyperbole thy name is Tahereh Mafi), and I really don't care much about the whole Adam/Juliette thing, which unfortunately, occupies a huge part of the story. If you know me, you know I am a pro at ignoring ships that the authors clearly want you to root for. I don't trust Adam and his and Juliette's feelings for each other are so desperate and all over the place that it's really easy to confuse love with a typical hormonal storm. Also, Adam is super boring, and this seems like one of those romances you often encounter in first books and which only purpose is to prepare you for the abominable love triangle that's inevitably going to be rubbed in your face, later.As if the presence of a love triangle wasn't a problem of its own already... But I'll try to endure it, for the sake of a good book such as this one. Just give me a bit more consensual interactions with Warner -because of course I had to fall for the stunning and stunningly cold-blooded sociopath-, fill up some plot holes, bless us all with some more Kenji sass, let Juliette not become a self-centered and stubborn bish, and I'm sold for the rest of the series. Can't wait to read book 2!"}, {"userName": "Sofii♡ (A Book. A Thought.)", "userReviewDate": "Dec 25, 2015", "userURL": "http://www.goodreads.com/user/show/50405799-sofii-a-book-a-thought", "userReview": "Re-Read (11/02/2018)I enjoyed it as much as I thought I would. I missed the characters a lot so I spent a great time accompanying them in this adventure, I know that it is not the best book in the world and I know that alot of people can't stand it, but personally, even though I'm aware of certain problems in it, I can't stop loving it. Shatter Me is one of those books that have made me love reading even more and will always be in my heart. I can't wait to continue with my re-reading in preparation for Restore Me, which I hope doesn't breake my heart lol.Read about Kenji and Warner again, it makes me so happy!\nOriginal Review: (23/06/16)\n\n“I have a curse.I HAVE A GIFT.I'm a monster.I'M MORE THAN HUMAN.My touch Is lethal.MY TOUCH IS POWER.I am their weapon.I WILL FIGHT BACK.”\n\nI thoroughly enjoyed reading this!.Like many I had said, yes , I finished attached to the characters !. From Adam to Juliette and Warner they are all very good characters with very well-defined personalities.But my heart has been with Warner from the beginning and I need to know more about him RIGHT NOW ! Omg is so interesting!The plot is very interesting from the start, of course that highlights the incredible of the writing of this book, because guys, I've been in love with the way of writing that has Tahereh!. So beautiful, unique and completely addictive!if it has taken me a while to finish reading it, it was simply because I have no time to read (universal dilemma of most LOL), because this book is mainly characterized because, once you start with it is very difficult to leave it !. I had read it in one sitting if I could.Juliette is a great main character for the story, from the beginning won my heart, for the difficult things she has been through (for his \"condition\"), how hard it has been her childhood and the relationship with her parents, just, broke my heart.There were moments in which I thought, \"Why you does this or Why you say that?\", I think she was a little lost in some pretty obvious situations to understand, from my point of view, but then you think she's been locked up for a while and has not had intimately contact with anyone in her life, and her actions have much more sense.\n\n“I spent my life folded between the pages of books.In the absence of human relationships I formed bonds with paper characters. I lived love and loss through stories threaded in history; I experienced adolescence by association. My world is one interwoven web of words, stringing limb to limb, bone to sinew, thoughts and images all together. I am a being comprised of letters, a character created by sentences, a figment of imagination formed through fiction.”\n\nAdam is a character that I liked, but it took me a while to love him, I liked more in the end, in the action scenes, but for others things I consider him as the typical hero of the story, quite stereotype, handsome boy, who saves te girl and I don't know yet I'm not convinced about it. But I have faith on him, and I hope revelations for this character , maybe change my mind :)\n\n“His lips soften into a smile that cracks apart my spine. He repeats my name like the word amuses him. Entertains him. Delights him. In seventeen years no one has said my name like that”\n\nWarner is my love lol, I feel a great connection with this character, it is dark and hides a mystery that catches my attention. It is so interesting and sexy , I'm dying to know more of its history, really, I know it is something perverse in this book but you can't deny that his scenes with Juliette are INCREDIBLE. High Voltage guys!,even when only they speak to each other. So Good! . I don't know how she resists to him!\n\n“His smile is laced with dynamite. \"Go to sleep\"\"Go to hell.\"He works his jaw. Walks to the door. \"I'm working on it.”\n\n So I'm dying to continue the story I loved it, especially the last pages and the plot twist has surprised me !. I love the whole powers thing . Very clever twist! YAY!."}, {"userName": "Megs ♥", "userReviewDate": "Oct 30, 2011", "userURL": "http://www.goodreads.com/user/show/5691412-megs", "userReview": "Didn't finish. I simply stopped reading this book today, and it wasn't because it was boring or anything like that. I just did not care for Mafi's writing style. The over use of metaphors and strikeout tools caused a constant distraction, and the book was just not interesting enough for me to want to struggle through something that annoyed me so much. The book (well what I got to, anyway) read like a super annoying IM by a 12 year old girl that just learned what a metaphor is. Do we REALLY need 50 to 100 different ways to describe his eyes? She repeats things so many times as well, and it's like she used a bunch of tools that could have been great devices had she used them once or twice. Instead she chose to beat the metaphors, strikeouts, and repetitions into your head so many times you just end up  really, really, really, really  wanting to  kill yourself stop reading.This book was one of the biggest disappointments of 2011 for me, and I still cannot understand why anyone would enjoy this book, let alone say this author has talent. When I read the synopsis, I thought this book sounded so good. This could have been an amazing story, but sadly the execution was horrible."}, {"userName": "Jillian -always aspiring-", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/3085436-jillian--always-aspiring-", "userReview": "(Note: Goodreads friends and followers, you know me by now. You know that, even as much as I love a book, my reviews aren't always a resounding, \"Oh my goodness, you need to READ THIS NOW! YOUR LIFE WILL BE SO MUCH FULLER BECAUSE OF IT!\" I'm not that naive or arrogant to think that the books I love will be the books you love. Instead, my reviews are...chronicles of the experiences I had with books, and if that can help you decide whether certain books will be for you or not, then I'll be all the happier. However, sometimes I am a gushing mess with books I love, and I don't note the flaws present. I will try to be mindful of this tendency of mine as I write this review.)Hope is hugging me, holding me in its arms, wiping away my tears and telling me that today and tomorrow and two days from now I will be just fine and I'm so delirious I actually dare to believe it.Two years ago, I had my first experience with a young adult dystopian novel: Suzanne Collins's The Hunger Games. I fell in love with the characters, found myself fascinated yet horrified by the circumstances of the world, and became invested in a wonderful story that still makes me feel a tangle of emotions to this day. In some respects, Tahereh Mafi's Shatter Me gave me some of the same emotions I had back then as I stayed up to the wee hours of the morning just to read what happened next to Katniss, Peeta, and everyone else. Shatter Me left me expectant, worried, and intrigued with every page I turned. It was a stressful reading experience, definitely, but all the stress I felt was pent-up through the heroine, Juliette.Juliette, you see, hasn't been touched for 264 days. Inside of her is a curse gift that brings deathdeathdeath agony to anyone she touches, and this strange ability has led to her being locked away in an asylum. Isolation takes its toll on Juliette, and her only real solace is writing away in a notebook and spinning phrases in such a way that they seem overwrought and not entirely rational or \"normal.\" Then the unthinkable occurs: Juliette is given a cellmate, and everything she thought she knew begins to expand and spin out of her control entirely.Shatter Me is a dystopian novel but, unlike others of the genre, the novel is less about external conflict (though there is some of that; it wouldn't be a novel if there weren't) and more about internal conflict. To make my meaning more clear, let me explain with a comparison: one of my friends recently directed me to a script called Maggie about a teenage girl bitten by a zombie and her slow change into one of the undead. What do zombies and one girl's transformation into one have to do with this novel? Because that script is about a big idea (zombie infestation worldwide) narrowed down to a character (Maggie) and her experiences. In some ways, Shatter Me, is much like that: it's about a big idea (a dystopian world headed by a secretive totalitarian government), but instead it focuses on one character's role in it (Juliette). Given how so many writers focus on the \"big ideas\" and sacrifice deep characterization because of it, I was very happy with the way this first novel developed, driven by Juliette and her ramblings thoughts.Another hurdle of this novel is the prose, something that I feel will probably alienate many readers since...it's not exactly typical to read novels with lines like I'm catapulted across the room by my own fear or My mouth freezes in place. Also, the strike-outs may become a teensy-bit annoying to some readers. As for my experience, I was surprised: the prose didn't bother me. It actually reminded me of a verse novel (which, I know, many people don't like...but I find some of them very lovely, albeit a bit thin plot-wise). And it also helped that the prose fit the character. Juliette is an isolated girl, left alone with nothing but her own thoughts and words. Her thoughts, eccentric and detailed as they are, are coping mechanisms. The words help her to distance herself from her situation, and even after her life begins to brighten she still relies on her old habits of describing things and actions in an unnatural way. What would have bothered me is if Juliette hadn't seemed a bit \"different\" after spending so much time alone. Then I would have thought her a robot, and the story would not have drawn me in nearly as much.The hero, Adam, and the antagonist, Warner, also managed to get my heartstrings all tangled. I couldn't help noting some of the sweetness and tenderness I had seen in Peeta Mellark's character within Adam Kent. In contrast, Warner...is a sadistic bastard of a character, but his obsession with Juliette and her powers is as sorrowful as it is pitiful and disturbing. Though a part of me dreads the love triangle already beginning to form, a greater part of me finds the dynamics fascinating since Adam and Warner are two opposite ends of the spectrum. One is heroic and kind; the other is cruel and nearly mad during certain moments. Even though it's a no-brainer who the \"right\" choice is, one must wonder how this will all play out if Juliette begins to look at herself as a monster again.I'm not going to lie: the direction this novel takes is familiar yet still a bit surprising. When I opened this book, I hadn't known what to expect...but, near the end, I found myself at a complete one-eighty from what I had first expected. That in and of itself is a good thing, so I'm hoping that the rest of the trilogy will continue to bring surprises to the table. With the ending, I actually felt that I had a glimpse of what Tahereh Mafi had been hoping to accomplish with this novel. It's an origins story of transformation and healing amid darkness, despair, and loneliness.The only major thing that irked me a little in this first novel was that the lack of other female characters was...quite noticeable. It gets a tad annoying that all the other characters (who matter) are boys in this first installment. No matter how strong Juliette becomes as a character, somehow it will feel a little lacking if she's the lone girl amid adoring males. I love strong heroines even more when they have a few other strong females around them. As much as I really enjoyed this first installment, my reading experiences with the next two novels may be hindered as far as enjoyment goes if Juliette remains the one girl who matters in the story.Mixed though the opinions may be about this novel, Shatter Me really surprised me with its take on the dystopian genre, narrative style, and characterization. I look forward to seeing what will happen as the story progresses throughout the trilogy, so here's hoping the ride will continue to be exhilarating to me as a reader. As for whether you should try this one for yourself...I advise making use of preview chapters before committing to read the entire novel. Shatter Me isn't going to be for everyone, but I hope that it will find the readers who will appreciate and savor it for what it is and be able to ignore the flaws that may hamper full enjoyment of this novel."}, {"userName": "I am Bastet", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/1303975-i-am-bastet", "userReview": "This book is pretty darn bad. This book is pretty darn bad.Oh, darn, did I miss the point of the strikethroughs?"}, {"userName": "Nenia ✨ Queen of Literary Trash, Protector of Out-of-Print Gems, Khaleesi of Bodice Rippers, Mother of Smut, the Unrepentant, Breaker of Convention ✨ Campbell", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/2190064-nenia-queen-of-literary-trash-protector-of-out-of-print-gems-khalees", "userReview": "Instagram || Twitter || Facebook || Amazon || PinterestIt's not easy being Queen of Literary Trash. Between YA and bodice-rippers, I read more \"bad\" books than most elitist snobs will see in their entire lifetime. But then, I consider myself a connoisseur of the so-called trashy arts. There are two kinds of \"bad\" books. There are the books that tell good stories and while they aren't highbrow literature, they are still fun to read and if you can let go of your snobbery long enough to enjoy them, will perform quite serviceably as quality entertainment. Then there are the books that are just bad, and have no redeeming value at all.I had friends warn me about SHATTER ME. It's apparently infamous for the \"creative\" metaphors that the author likes to use. It's also yet another attempt to cling to the coattails of THE HUNGER GAMES (although it's more like DIVERGENT than THE HUNGER GAMES, which if you know my thoughts on DIVERGENT, you will know is not a compliment, coming from me). The premise is pretty undeveloped. Juliette has been in captivity for just under a year when she accidentally killed a boy by touching him. Her touch, you see, is deadly. She's like Rogue, from X-men. One touch, and your life force is hers.It's set on a dying Earth but why and how it's dying are incredibly vague. We've apparently allowed a fascist-tolerant (if not outright fascist) regime to gain power, which I would say is not really giving the world a whole lot of credit, but on the other hand I'm a liberal living in the United States right now, so on the OTHER hand, maybe future Earth is totally stupid enough to do that. It seems to happen a lot in YA dystopians, to the point where the reader begins to wonder if all it takes to start a fascist regime is a kickstarter and a special license. What matters is that resources are thin and there is not a lot of food and there are parts of the world that are radioactive(?) and for some reason, some people (especially Juliette) have mutant-like powers for Reasons and this is the world we live in.Both love interests are, conveniently, immune to Juliette's power. Because I guess it wouldn't be much of a romance if the book took the MC Hammer \"Can't Touch This\" approach to courtship. There is instalove up the wazoo in here, and even when Juliette finds out that Adam was put in her cell to spy on her under the guise of being a fellow prisoner, she forgives him stunningly quickly, and is constantly telling us how much she wants to touch him. She wants to touch the villain, Warner (I'm sorry but I can't take you seriously when I'm picturing the dancing frog mascot of the WB), too, although it's a traitorous body sort of desire to touch, the I-love-to-hate-how-I-hate-to-love-you type. Warner was the biggest potential sell of this series to me because I love villainous love interests but he's too creepy, even for me. Between the constant unwanted pet names and the really disturbing \"I could just take a bite out of you\"-type comments, this dude was about one villain notch away from singing a Tim Curry song.Then there's the writing itself, which can be broken down into three categories: OMG, WTF, and LOL.OMG:Every organ in my body falls to the floor (68).I want to rip up the carpet and sew it to my skin (163).My jaw is dangling from my shoelace (310).WTF:I'm wearing dead cotton on my limbs and a blush of roses on my face (6).There are 15,000 feelings of disbelief hole-punched in my heart (40).My throat is a reptile, covered in scales (172).I'm blushing through my bones (326).LOL:I wondered if your eye color meant you saw the world differently (151).My heart is parasailing in the springtime (286).The author also makes two other attempts at being creative, which are overuse of the strikethrough tool and overuse of numbers, written as numerals instead of being spelled out. Which, if you ask me, is 1 bad idea because not only does it look unprofessional as 0 other writers do this, but 2, comes across as overly gimmicky and makes you feel like you're reading cast-offs from a teenager's poetry journal as she tries - and fails - to channel Ellen Hopkins and/or Rupi Kaur.If you like this book, good for you, I guess. I personally couldn't stand it. It felt incredibly derivative, and from the woe-is-me beginning to the yay-I've-got-a-hypersexualized-supersuit ending, there was just way too much I ended up side-eying in this book for me to enjoy it. I don't think I'll be reading the sequels, not even for the lols.1 star"}, {"userName": "may ➹ (semi hiatus)", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/68157476-may-semi-hiatus", "userReview": "[Oh wait, look at us, all mutants with special powers and we’re going to rebel! And oh em GEEEEEEE, the exceptions to my powers are the two guys I might possibly be in love with!!! (hide spoiler)]"}, {"userName": "Cait • A Page with a View", "userReviewDate": "Nov 16, 2015", "userURL": "http://www.goodreads.com/user/show/47412532-cait-a-page-with-a-view", "userReview": "3.5 stars. Ok, this is the part where I eat my words. I KNEW I would probably love this series if I gave it another chance at the right time since so many of my friends with similar taste adore it!! This was like my fourth or fifth time trying to get through the first book in the past few years, except this time I flew through it in a few hours like \"whaaaaat was my issue before?!\" This first book isn't the strongest story in itself, but I'm seriously loving the setup. The love triangle works. The dystopian world is awesome. The writing is so raw and carries Juliette's mindset perfectly. It's definitely a wee bit angsty, but it's also something I think my younger teen self would've been super into. Juliette feels totally realistic. If she stays the same then I might be annoyed by the third book, but I'm pretty sure this is setting up some epic character growth. So we're good.I'm just laughing at how I could be so annoyed with the writing style before, yet SO into it this time. I could not put this down and am thrilled I kept my books to try again.ORIGINAL 2-STAR REVIEW:Wtf did I just read. This book is not for me.I called it a DNF last year but decided to try again after hearing only rave reviews from people with similar taste. I feel like I should love it. I really want to love this book, butI just cannotget pastthe writing style.The writing does do an excellent job of putting the reader inside Juliette's unstable mind, but apparently that was not a place I wanted to be. Dystopian books are really hit-or-miss with me and I'm just not feeling this world.I mostly read this to see the Warner guy everyone keeps talking about... and I do get some of his appeal now, but he also kind of creeped me out? Maybe I was zoned out in a few parts where he redeemed himself.The covers for this series are absolutely gorgeous and I STILL REALLY WANT TO LIKE THEM. I have not given up yet. I'm planning on coming back to this book later because I've seen nothing but praise. So this is just me checking back in to say that I still haven't made it past the first book..."}, {"userName": "Aly (Fantasy4eva)", "userReviewDate": "Oct 07, 2011", "userURL": "http://www.goodreads.com/user/show/1491042-aly-fantasy4eva", "userReview": "[I mean, not only is there this whole institute of sorts like the cartoon, but for heavens sake they even have their own Xavier. A man who helps them control their powers. Ironically, that very man can move things with his mind, well, like Xavier. *sighs* I'm all for powers since its a lot more interesting than a lot of other things out there right now, but I wish it wasn't so close to home. I would have preferred things to have not to been so obvious in being similar. And did anyone else find it awfully ironic that Adam could touch her? (hide spoiler)]"}, {"userName": "Jessi ♥️ H. Vojsk", "userReviewDate": "Mar 23, 2017", "userURL": "http://www.goodreads.com/user/show/66224803-jessi-h-vojsk", "userReview": "“Raindrops are my only reminder that clouds have a heartbeat. That I have one, too.”  Story ⭐️⭐️⭐️⭐️Juliette was in a prison cell for nearly one year trying to survive her life in a dark, lonely room. There was no one to talk to, nothing to read, to do. She only had a small notebook where she wrote down her feelings, her thoughts. She poured her heart out into this pages. The guilt, the loneliness of never touching anyone. But then she got a new cell mate. A boy with blue eyes, that she remembered and a name she always liked, Adam. Shortly after she gets a cell mate they’re being brought to a young man - Warner who rules this sector and is making Juliet a great deal. Did you hear that Shatter me will become a series on TV? I’m super excited for that, even though I can’t really understand how they’re gonna put the first book on screen. In the end not much is happening. But we get a lot of Juliette’s thoughts. Throughout this book is mostly character driven in my opinion. But it is still really really addictive. There is some action, that’ll make you gasp out loud and there are scenes with so much passion/love/fear/anger that you’ll love this book even more. Characters ⭐️⭐️⭐️⭐️Even though Juliette isn’t the perfect character, she still has her good parts. Of course she is a little bit weak and cries sometimes, but that’s only because she is afraid. Of the world, her skills and herself. She has such a big, kind and wonderful heart that she doesn’t want anyone get hurt. Especially the ones who are kind to her. Being trapped in a prison cell for nearly a year and never seeing kindness or love in the eyes of others, I’m not surprised that Juliette tries to seek out good and bad people she meets. Oh Adam, you were never my favorite character. You always seemed like a protective, romantic guy, but after reading this whole trilogy a few times I see you clearly. I see that you love the weak side of Juliette. The side that needs protection. You don’t see how strong she can be. That, sometimes, she doesn’t need the saving or protection from others. She needs someone to support her. To show her that she can be more than the weak, locked up girl, that can’t be touched. But then you always protected her when she needed protection. You were kind to her when no one was. You searched for her years of your life, because you wanted to see her, you wanted to know her save. In the end you were always a nice guy with a kind heart. Warner is our “villain” in this story and as I said a lot of times: I love the “villains” of stories. Nearly always. For me they seem to be the most interesting character. And that’s exactly what I love about Warner. He is young and he is ruthless. He is strong, but he is also extremely intelligent. He knows how to hold his power. And even though you could think he is the perfect villain of this story he is also supportive of Juliette. He tries to show her that she is capable of more, that she has so much potential to be great. Even though she doesn’t want to see it sometimes. Oh and of course we have the best and most amazing side-character there could be. Kenji ♥️He’s just so funny and I loved him from the start. World ⭐️⭐️⭐️The world building in this one is really really little. It seemed like a introduction to the whole world. We can be sure that this is a dystopian novel, but we don’t know what happened to the world and why it is the way it is know, but we know that it’s not right. That there is a regime that shouldn’t be ruling and people lose hope for a better world. Relationships ⭐️⭐️⭐️⭐️Even though I wasn’t really fond of our main character and love interest Adam, I can’t say he isn’t madly in love with Juliette. The things he says to her, even though we all know it can’t be this wonderful true love on first sight he says it was, were filled with so much love, romantic and happiness. It was beautiful. If you love unconditional sometimes irrational but beautiful love, then this is the book for you. (But definitely continue the series, there’s something better coming our way) Writing style ⭐️⭐️⭐️⭐️⭐️The first time I read this book, the thing I liked the most about it was the writing. It was so poetic, so full of beautiful descriptions of feelings. The second time I read it, I wasn’t in the mood for this book or his writing. That’s why I felt it was too much. But now I changed my mind, like all human being do sometimes, and now I fell in love with it. Again. If you’re a person who don’t really like unrealistic metaphors, then you probably don’t like this writing. But if you have a huge imagination and love absolutely weird metaphors and description, then this is the book for you. And if you tried it once and you hated it, just wait a little bit maybe in another time with another mood you’ll like it."}, {"userName": "Amber Robertson", "userReviewDate": "Apr 26, 2016", "userURL": "http://www.goodreads.com/user/show/30813900-amber-robertson", "userReview": "THIRD ATTEMPT AT READINGI actually got through it. Full review to come. RE-READINGSECOND REVIEWI skimmed read this so bloody hard but here are some notes I took before my brain shit itself and couldn't handle the idiocy. The writing is beautiful, definitely but I hate both the plot and the characters. So, without further ado, here are my notes:- \n“My parents emptied their pockets of me and left me to evaporate on a concrete slab.”\n- I hate Adam- I hate Juliette - \"You could love me, you know.” He’s smiling a strange sort of smile. “We would be unstoppable.”- Warner is creepy af with that quote - seriously - wtf - how is this guy romantic he seems like a creep - YOU WANT TO TELL ME YOU WOULD TREAT ME LIKE A QUEEN AND I COULD LOVE YOU? BOY NO- he also wants to use her for his gain???? i'm so confused by this how is this not mildly abusive??? - i really hope his character changes because if not no thank you- such a classic Edward Cullen and Jacob Black vibe between Adam and Warner too - Still hate Juliette - ok but why is it that the two love interests have the ability to touch her? TOO CONVINENT I don't know, I just found everyone either creepy or having absolutely no personality. 🤷🏻‍♀️FIRST READ REVIEW2.75 - SPOILERS. Shatter Me confused me. I've seen heaps of reviews recently, praising this book and it's understandable why - but I was left more confused than not. I'll probably finish this series purely to try and understand the hype. I really wish I'd enjoyed this. I mean, I did in a way but for the most part I was confused. The writing felt jerky, Juliette's inner monologue was strange, the romance came out of nowhere, and the world building took me almost 75% of the book to work out. I think the only character I actually liked was Warner. I felt he was the most realistic for this dystopia like setting. He wanted power and I could understand that. Juliette could be used as a weapon and be easily moulded too considering the lack of love and attention she had experienced in her life. She was fragile and naive in so many ways, something that wasn't shown. In my opinion, after the bullying, murder and abandonment that all featured in her life Juliette should have acted differently. However, the author seemed to want to portray her as strong, which isn't what came across to me. Also, of course our special little snowflake Juliette is beautiful - absolutely stunning from the definition provided when she looks at herself for the first time in ages. If I could punch a female character in the face it would be her. Adam was even stranger to me. I just can't even put in words my feelings towards him. He rubbed me the wrong way and every time he came up I cringed. I didn't understand why Juliette and Adam were so infatuated with each other. They'd known each other at 14 and they're now 17. It felt underdeveloped and immature. “H-how could you possibly care about someone . . . like me?” I’m barely breathing, nervous and petrified but somehow staring at his lips, studying the shape, counting the drops of water tumbling over the hills and valleys of his mouth.“Because I’m in love with you.”This quote basically made me sick. I can't stand weak heroines and I can't stand an under developed romance that leaves me wanting to run head first at a brick wall. It's one of my pet peeves in books that drives me absolutely mental. Onto my main problem with the book: the writing. I couldn't stand handle the constant strikeouts through every other word or words words angerangerwordswords Trying to look like poetry. It made my brain hurt. Was the book meant to be a representation of Juliette's diary? Was it meant to just be the childishness of her underdeveloped mind? I have no idea. I also couldn't imagine anything. Too many similes and metaphors that made me feel like I was back in high school and deconstructing the assigned book. There were inconsistencies as well. Juliette states that her parents moved her around lot in shame, because she'd be kicked out of school or because she'd done something weird. However, when Adam and Juliette are taking he refers to several years of schooling which aren't consistent with the statement uttered before. If Juliette was always doing weird things happen how would it be possible for her to stay at a school for several years and only be pulled out once she killed a small child? Also, there was minimal remorse for the death of child that left me speechless. I killed a fish by accident when I was 11, I still think about it to this day which is 8 years later. When I was 9 I had a rabbit and he died within days of getting him, I still wonder what I could have done to save him ten years later. But Juliette only mentions this young boy when suited to her. Maybe she's insane? Maybe isolation in no way helped her? I'm not sure. But I'm quite furious about it. To continue the inconsistencies, if earth is becoming a wasteland why is technology so advanced? Like I don't understand how Warner had a room just out of high tech torture chamber but no one is able to supply food for themselves?There were may too many time lapses as well in which we aren't informed what's happening either. It left me wanting to slam my head against a wall repeatedly. I didn't know what was happening but I was disappointed by this book. Maybe I went in with expectations too high, but overall I'm going to rate this book a 2.75."}, {"userName": "Helen 2.0", "userReviewDate": "Nov 30, 2015", "userURL": "http://www.goodreads.com/user/show/39575951-helen-2-0", "userReview": "Time for a Reread of Shatter Me aka 300+ pages of Hyperbole aka Juliette Whines for 3 weeks and I Endure It aka I'm Really Only Here for WarnerThis reread has been very helpful in informing me that yes, I do still hate Juliette with the fiery passion of a hundred nuclear detonations.She speaks in riddles, to the point where any self-respecting reader has to rest their eyes & brain every 3 pages to recover. There's no way to escape this issue because first person narration - thrice cursed be whoever came up with fucking first person narration - means that we spend the whole book locked inside Juliette's neurotic mind. So, every other line is some insane hyperbole describing Juliette's heart-wrenching inner turmoil about whatever minor event just occurred.And the metaphors get pretty gross. See for yourself: \"These words are vomit. This shaky pen is my esophagus. This sheet of paper is my porcelain bowl.\" Ew.\"Every organ in my body falls to the floor.\" EW.\"My skin is still steaming. My bones are bandaged in the tight folds of this strange dress, the zipper the only thing holding me together.\" She really should get that checked by a doctor.\"I'd like to cry into his eyes.\" No, seriously, GROSS.All of this because Juliette's been on her own all her life and thus lives inside her head. And I get it, Tahereh Mafi wanted to pull the reader into the unique mind of a girl who is, by all professional opinion, clinically insane. But the abstract language is so abundant and so downright weird that it threw me for a loop every time. The author should have reigned it in a little, edited out the superfluous metaphors and left only the really meaningful ones, the ones that help give life to the characters and the world.For example, leave phrases like this: Warner whisks into the room like he treads air for a living. And cut ones like this: My face has been slapped by a hundred hands. That's just distracting.So now we get to the second, and more important, issue with Juliette: her self-esteem (or lack thereof).There's nothing wrong with creating a heroine who struggles with her self-image; this is a natural thing to add to a book targeted at teens. Writing about a journey towards self-acceptance and -love is always a good bet for YA.Things get problematic when we look at how Juliette gains confidence in herself, namely, through the attention of men. At the beginning of Shatter Me, Juliette hates herself and her abilities fiercely, to the point where she has thoughts like these: \"I am a monster. He doesn't want me near him. Of course he doesn't. I should never forget my place.\" Then Adam comes along and solves her inner turmoil - caused by a lifetime of abuse - within a few weeks! By doing nothing more than complimenting and touching her! \"He's kissing away the pain, the hurt, the years of self-loathing, the insecurities, the dashed hopes for a future I always pictured as obsolete.\" Nu-uh, Juliette, that's not how it works!!My point is that Tahereh Mafi shouldn't be teaching her young readers that a man will come along and magically fix their self-image. She should be teaching girls that lasting confidence is something you need to discover for yourself, and not by defining yourself based on the men who claim to love you. The moral of Shatter Me is very far from healthy.The last problem with the book is the world built by the ominous \"Reestablishment\". Who are these people, what are their goals, how and in what world did they manage to rise to power? We get answers to none of these questions, and answers don't seem to be on the horizon for book 2 either. For now, Shatter Me's setting is a nebulous 1984esque fascist regime with no apparent means or motive. We need more clarification about the world where this story takes place. So all-in-all my only reason for continuing the series is my baby Warner  who really deserves a hug."}, {"userName": "Jeff", "userReviewDate": "Jul 11, 2017", "userURL": "http://www.goodreads.com/user/show/68159473-jeff", "userReview": "I read this in 2 days. 2 DAYS!!Not bragging or anything, but for a slow sloth like me, that's a pretty good accomplishment, don't ya think??This story didn't have a lot of pages, but for some reason, you're just compelled to finish it. Is this a magical spell? No, it's because this book was BRILLIANT. Mafi creates an entire world with action, suspense, crazy hot boys and all that shit.Now, a lot of people said that they liked Warner, but for me, my childish brain fell in love with the first boy my eyes set on. Yup, it was Adam.For some reason, this dude happened to capture my attention and made me absolutely despise Warner. I HATED Warner. I thought he was a pervert, honestly. XDAnd with this hatred, I absolutely LOVED it when Juliette escaped with Adam to a sort-of happily ever after. Now you see why I finished this in two days??And not only that, the action and just plain awesomeness of this book made it a terrific read. You'll love it. :)"}], "description": "I have a curseI have a giftI am a monsterI'm more than humanMy touch is lethalMy touch is powerI am their weaponI will fight backJuliette hasn’t touched anyone in exactly 264 days.The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.Juliette has to make a choice: Be a weapon. Or be a warrior.", "title": "Shatter Me\n      \n          (Shatter Me #1)", "url": "http://www.goodreads.com/book/show/10429045-shatter-me", "average": 3.99, "cover": "https://images.gr-assets.com/books/1310649047l/10429045.jpg", "reviews": 23300, "authors": [{"url": "https://www.goodreads.com/author/show/4637539.Tahereh_Mafi", "name": "Tahereh Mafi"}], "type": ["Young Adult", "Science Fiction", "Romance", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/10429045-shatter-me", "http://www.goodreads.com/book/show/11809168-shatter-me", "http://www.goodreads.com/book/show/13455782-shatter-me", "http://www.goodreads.com/book/show/11472297-shatter-me", "http://www.goodreads.com/book/show/13062413-shatter-me", "http://www.goodreads.com/book/show/17177392-shatter-me", "http://www.goodreads.com/book/show/13104080-unravel-me", "http://www.goodreads.com/book/show/13188676-ignite-me", "http://www.goodreads.com/book/show/13623150-destroy-me", "http://www.goodreads.com/book/show/17331518-fracture-me", "http://www.goodreads.com/book/show/18481271-unite-me"]}