{"ratings": 201, "userreviews": [{"userName": "Kobe Bryant", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/5783219-kobe-bryant", "userReview": "19th century Americans, they were just like us"}, {"userName": "Osiris Oliphant", "userReviewDate": "Oct 20, 2017", "userURL": "http://www.goodreads.com/user/show/2374907-osiris-oliphant", "userReview": "Philadelphia Gothic. Uses the framing device of metempsychosis, the main character can at the moment of death transmigrate into any other body he chooses, to satirize philadelphia of the time through a series of characters like a broke dandy rogue, a comfortable slave whose reads an abolitionist pamphlet freaks out, etc.. edgar allen poe wrote a review. it was very positive but correctly pointed out how much better it could have been had the main character,maintained his own original personality even as he changed bodies.bird's other novels include Nick Of the Woods. called the first serial killer thriller, or romance. a pascifist quaker preaches love during the day but at night murders native americans for what they did to his family. mark twayne said it was the horror highlight of his young reading. obviously heavily indebted to charles brockden brown though he publicly denounced CBBs works. i just read the first volume of Bird's Peter Pilgrim sketches which i liked and are based in some of my favorite early americanic folklore. the hypnotic power of snakes, ancient races of cyclopian giants, pre columbo old world visitors, insanity, etc."}, {"userName": "Mathieu", "userReviewDate": "Dec 15, 2017", "userURL": "http://www.goodreads.com/user/show/5912137-mathieu", "userReview": "Voici un roman bien singulier. Publié en 1836 aux USA, il vient d'être réédité là-bas, et traduit pour la première fois en France. Il s'agit d'un mélange de conte philosophique et de satyre de la société américaine de l'époque.On nous y relate l'histoire de Sheppard Lee, jeune homme aisé du New Jersey, qui suite au décès de son père, hérite d'un riche domaine maraîcher. Bien décidé à se la couler douce et à dilapider la fortune familiale, Sheppard Lee ne tarde pas à se retrouver désargenté, insatisfait et harcelé par ses créanciers.Alors que sa vie semble lui échapper, Sheppard va alors découvrir (dans des circonstances que je ne détaillerais pas pour cause de spoil) qu'il est capable de transférer son esprit dans des corps morts et d'ainsi les faire revenir à la vie. Commence alors pour Sheppard Lee de nouvelles vies puisqu'il va à partir de ce jour se chercher un hôte capable de lui apporter le bonheur.Ces divers transferts vont être autant d'occasion pour l'auteur de dresser des portraits ironiques de la société américaine de l'époque. Bons bourgeois, jeunes dandys cherchant le mariage d'argent, usuriers, esclaves, ce bon vieux Sheppard va ainsi expérimenter diverses enveloppes et surtout diverses personnalités, cherchant à chaque fois une condition qui le satisfasse.Je ne vais bien sûr pas rentrer dans les détails, mais le récit ne manque pas de saveurs. Le texte est sacrément irrévérencieux envers la société américaine, et chacun en prend pour son grade. Plusieurs passages sont mêmes extrêmement critiques ou provocateur pour l'époque. Je pense notamment à un passage où Sheppard Lee propose de recycler les cadavres humains pour en faire de l'engrais afin de ne pas laisser perdre tous ces corps. On imagine fort bien l'effet d'une telle proposition en 1836...De même, certains passages font étrangement écho avec certaines problématiques contemporaines. Lorsque l'auteur (par la bouche de Sheppard) parle de politique et notamment du processus démocratique par exemple, ou lorsqu'il évoque l'intérêt pour lui de taxer les profits de la bourse et des banques pour les réinvestir dans les hôpitaux et les écoles publiques.Il est troublant (et aussi un poil déprimant) de croiser ces problématiques dés 1836, et de se dire qu'elles restent à l'heure actuelle encore en débat. Cela rend en tout cas le texte étonnamment moderne, malgré son grand âge et sa narration un peu datée.Ce roman souffre bien sûr de quelques défauts, son époque de rédaction n'étant pas des moindres. La langue est bien sûr datée, et souffre de quelques longueurs et digressions dispensables. Cependant, le texte est aussi intéressant pour le portrait de la société américaine qu'il dresse. Les travers des uns et des autres y sont habilement mis en scène, non sans humour, et sans toutefois écarter les conflits en germe de cette même société.La question de l'esclavage revient plusieurs fois das le cours du roman, et la fracture entre Sud esclavagiste et Nord abolitionniste est également très présente, montrant quelques décennies avant le début de la guerre de Sécession (24 ans avant pour être exact), les vives tensions déchirant déjà la population.Un roman narquois donc, mais pas que, et qui vaut le coup d'œil tant pour son sujet que pour son traitement, ainsi que pour le portrait qu'il donne d'une Amérique balbutiante en ce début de XIXe siècle."}, {"userName": "Tony", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "SHEPPARD LEE Written by Himself. (1836). Robert Montgomery Bird. ****.I stumbled over this book at the library, not having heard of it previously. I learned that the author had trained as a doctor, but later turned to writing to make his living. This novel was one of his best-selling efforts, and was even reviewed by Edgar Allan Poe for the paper he was working for at the time. Poe liked it, and felt that it boded well for the future of American literature. What it is is a satiric chronicle of the life of Sheppard Lee, written in the style of a Swift or a Fielding. Sheppard was a common man who had taken up farming on the land that he had inherited. He wasn’t good at it, however, and soon got into debt. Worse yet, he didn’t like farming and turned responsibility for it over to an overseer. As you might expect, he was soon brought to the brink of poverty. He lost his money and his farm. He became desperate, and attempted to flee from his problems. Then he discovered that he had a certain power that lifted him away from his current troubles: He could inhabit the body of a recently dead man and become that man – leaving himself behind as a corpse. There’s not a great deal of explanation on how he did this, but he could…and did. This was termed, by Mr. Poe, metempsychosis. I haven’t looked it up, but I’ll take the reviewer’s word for it. Sheppard Lee manages to make his way through several different bodies, representing several different professions and life styles. Lee always had the impression that the grass would be greener on the other side of the fence, but it was never true after he resided for a while in whatever new body he was in. Things always seemed to go from bad to worse for him. Not only is there a recitation of hard knocks in this history, but there is also a generous smattering of humor. I was particularly impressed with his last incarnation: a Negro slave on a plantation in Virginia. I’m not sure if the author was trying to take a stance with this section or not. It can be interpreted in several ways. All turns out well in the end, as you might expect, with Mr. Lee having learned a lot about life and his expectations from it. This is a sleeper novel that I can heartily recommend."}, {"userName": "Nancy Oakes", "userReviewDate": "Apr 17, 2015", "userURL": "http://www.goodreads.com/user/show/900340-nancy-oakes", "userReview": "published 1836. For a longer view of what I thought about this book, you can click  here. It's definitely one of the more bizarre novels I've read as I'm going through Early American fiction this year. Sheppard Lee, Written by Himself is a mixture of satire and comedy, but each has a purpose in this novel. Just briefly, the titular character Sheppard Lee is a sort of grown-up ne'er do well who is left a prosperous estate upon the death of his father. Because he is so lazy and doesn't tend to things he needs to do, the long and short of it is that he loses pretty much everything his father had worked so hard for. Because he wants a quick out, eventually he gets the idea to go and dig up some legendary pirate treasure said to be buried close to his farm. An unfortunate accident while doing so leaves Lee in a sort of a trance; when he awakens, he looks down at\"...that eidolon, or representative, or duplicate of me, that was stretched on the grass\" and realizes that he's actually looking at his own corpse. Running off in an unsuccessful effort to find help, he returns to the scene and his body has vanished, with only a \"torn and bloody\" shoe remaining. As luck would have it, a certain Squire Higginson with whom Lee has had words, has also met his end, setting Lee to thinking:\"Why might I not, that is to say, my spirit, -- deprived by an unhappy accident of its natural dwelling, -- claim, and thus uniting interests together, as two feeble factions unite together in the political world, become a body possessing life, strength and usefulness?\"In short, Lee decides that it would be a good thing to \"inhabit\" Higginson's body -- and wishes it so. Soon he finds himself in the now-reanimated body of the Squire -- congratulating himself because now he is a \"respectable man, with my pockets full of money.\" But through a series of adventures, Higginson's body is just the first stop on Lee's soul/self/spirit journey (and I learned a new word to define this concept -- metempsychosis) -- and along the way he moves into various bodies whose owners all have one big thing in common: their lives are centered around money, each desiring to improve his own situation either through speculating, credit, expectations of good inheritances, or marrying into a better station. Lee lives quite a few different lives and in each one, makes a number of discoveries as he seeks out happiness. The novel is a satire and serves to skewer familiar types of the period: the dandy who plays a great game yet has not even a penny, a moneylender whose miserly qualities are very well known, an abolitionist philanthropist who spends his life trying to help the less fortunate and who does so ultimately at his own expense. What lesson does he ultimately learn? I leave that for the reader to discover.Robert Montgomery Bird was an anti-abolitionist, so when he comes to talk about slaves in the South, things get pretty intense. He had me laughing up until that point, but then his paternalistic attitude toward slavery sobered me up. Considering his stance on abolition, I get where he's coming from, but it is definitely not pretty. The rest of the book, however, is actually quite funny and Sheppard Lee is a character I'll definitely remember."}, {"userName": "Redeyedndogtired", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/2631943-redeyedndogtired", "userReview": "Anderson Dean (fellow reader whom you all may take good advice from) recommended this title, which- much like Melville's \"big book\" shows that Modernity was invented long before the modern age- bends the mind and begs questions about what, exactly, an individual is. There is much which is disguised as period-didactic and even more which seems period-racist, but the book (while not necessarily undated or unracist) is much, much more than it's obvious flaws."}, {"userName": "K.L. Richardson", "userReviewDate": "Feb 20, 2013", "userURL": "http://www.goodreads.com/user/show/16867632-k-l-richardson", "userReview": "I had to read this for my Literature of Philadelphia course and I thought it was outstanding. Montgomery Bird does an excellent job of humorously painting a picture of how aristocratic, antebellum Philadelphia was. When people think of Philadelphia during and immediately after slavery, they automatically assume that it was such a great place. It had its moments, but Sheppard Lee takes you inside of the pompous, lazy and dangerous society that was aristocratic Philly."}, {"userName": "Frank", "userReviewDate": "May 07, 2010", "userURL": "http://www.goodreads.com/user/show/3465678-frank", "userReview": "Interesting if dated. Prefigures a favourite theme of American popular fiction and (especially) film: supernaturalism as morality tale. Pretty racist by modern standards in a couple of chapters concerning black slaves, which makes it difficult to really revive this as a classic central to the canon. And the writing itself isn't particularly compelling. So it's interesting to read as a product of its time rather than being a perennial classic masterpiece with universal appeal."}, {"userName": "Jenn F.", "userReviewDate": "Mar 22, 2012", "userURL": "http://www.goodreads.com/user/show/8245768-jenn-f", "userReview": "Robert Montgomery Bird is a forgotten contemporary of Melville, Poe, and Hawthorne. This book is a treasure that allows us to view several different aspects of 19th Century life through the eyes of Sheppard Lee as he pops in and out of bodies. Sheppard Lee should be considered a classic American novel along with Moby Dick and A Scarlet Letter."}, {"userName": "Caroline", "userReviewDate": "Jul 02, 2011", "userURL": "http://www.goodreads.com/user/show/5261455-caroline", "userReview": "Interesting. Frequently amusing satire and a picture of several milieus of ante-bellum America. But for me it never really takes off. However, I agree that it is unique for the period and may be worth reading as an aspect of the development of the American novel."}, {"userName": "Emma Probst", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/3307593-emma-probst", "userReview": "I thought this book was funny, thought-provoking, and certainly had some traces if science fiction to it as well. It was pretty slow for the first part of the book, but right around page 50, things really get interesting. There is some great satire, and while I wish that Bird had been more abolitionist in his portions on slavery (His discussion of \"the happy slave\" can get nauseating sometimes). He walks an interesting line by exploring the issue of slavery without using abolitionist Sentimental writing or racist, pro-slavery literature. He finds an interesting way in this segment of the book to present both positions and leave the reader to decide for himself. When Sheppard Lee is dwelling in the bodies of others, he acquires much of their mannerisms and opinions without fully losing his initial identity. His identity is buried at times, and constantly in flux, but he seems to maintain both consciousnesses to some extent. I particularly liked Bird's sections on the Philanthropist, the mentally unhinged Southern gentleman, the miserly father, and the slave. Also, while the text claims to avoid philosophizing, there are some chapters that are Melvillesque in their musing."}, {"userName": "Bill FromPA", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/6370216-bill-frompa", "userReview": "[I - Sheppard Lee. A Bildungsroman, a young heir of a successful New Jersey farmer on the banks of the Delaware squanders or is cheated of his patrimony.II - John Hazelwood Higginson. A domestic character sketch, a successful middle-aged brewer of Philadelphia plagued by gout and a termagant wife.III - Issac Dulmer Dawkins. A romantic farce, a penniless young dandy seeks a fortune through marriage. Some longueurs here. IV - Abram Skinner. Melodrama, a usurer and stock market manipulator sees his children's lives end in tragedy.V - Zachariah Longstraw. A cautionary tale, a philanthropic Quaker has two young men who stand in the place of sons, his nephew and heir and a reformed convict.VI - Tom. A minstrel show (literary black-face) / slave narrative, a group of previously contented slaves on a Virginia plantation are inspired by an abolitionist pamphlet to revolt against their undemanding and indulgent master. Relies a good deal on racist stereotypes, probably inevitable in any contemporary treatment of the subject by a white writer. Bird's attitude toward slavery is hard to pin down, not surprising given the volatility of the subject, as depicted in this very novel. He definitely portrays the slave rebellion as a much greater crime than any injustice it is meant to redress.VII - Arthur Megrim. A tale of the fantastic, the delusions and occupations of a wealthy, extremely idle young man. Sheppard Lee re-occupies his original body, perfectly preserved by Doctor Feuerteufel's embalming process. Somewhat anticlimactic after the previous section.VIII - Sheppard Lee returns to New Jersey and the possession of his father's forty acre farm. His brother-in-law insists his adventures have been the delusion of a twenty month spell of madness. (hide spoiler)]"}, {"userName": "Christian Schwoerke", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/24022721-christian-schwoerke", "userReview": "Eminently readable tale by an early 19th century author. The premise of a sort of transmigration allows the narrator to inhabit the lives/bodies of numerous different levels of society, and it proves an interesting portrait of the author's time and place."}, {"userName": "Tonia", "userReviewDate": "Mar 14, 2010", "userURL": "http://www.goodreads.com/user/show/3436143-tonia", "userReview": "Re-reading this for a course. It will not be a chore to re-read this. Reading the introduction now, which provides some great insight into the comtemporary philosophies Bird was working within. Fascinating is Hume's idea of the fiction of \"self[hood].\" This notion provides an interesting way to consider self, especially interesting after just having read Poe's novel, Arthur Gordon Pym and his idea of 'self.' Unlike some reviewers, I didn't find this book to be racist. I read it as Bird satirizing his contemporary society."}, {"userName": "Katie", "userReviewDate": "Feb 27, 2014", "userURL": "http://www.goodreads.com/user/show/13131931-katie", "userReview": "Read for 19th Century American Lit. Body swapping and a \"grass is greener\" moral, with interesting subtext about madness and satire of politics & religion."}, {"userName": "Lulu", "userReviewDate": "Apr 14, 2008", "userURL": "http://www.goodreads.com/user/show/1080629-lulu", "userReview": "This one was neat. Digestive apparatuses, dunning, science fiction, Dr. Feuerteufel, thinly veiled racism, and Quaker grammatical humor."}, {"userName": "Jacob Meiser", "userReviewDate": "Oct 10, 2013", "userURL": "http://www.goodreads.com/user/show/5826292-jacob-meiser", "userReview": "A book about a man whose spirit is able to travel to different bodies. Interesting to read as a critique of sentimental literature, but I found it a little repetitive."}, {"userName": "Brian", "userReviewDate": "Aug 09, 2011", "userURL": "http://www.goodreads.com/user/show/5971574-brian", "userReview": "The combination of sarcasm and humor with pre-Civil War politics and perspectives was engaging. The writing style is from the early 1800's."}, {"userName": "Ashima", "userReviewDate": "Mar 03, 2008", "userURL": "http://www.goodreads.com/user/show/329481-ashima", "userReview": "Originally published in the 1830's and recently reprinted, this book has held up pretty well."}], "description": "Sheppard Lee, By Himself is a work of dark satire from the early years of the American Republic. Published as an autobiography and praised by Edgar Allan Poe, this is the story of a young idler who goes in search of buried treasure and finds instead the power to transfer his soul into other men's bodies. What follows is one increasingly practiced body snatcher's picaresque journey through early American pursuits of happiness, as each new form Sheppard Lee assumes disappoints him anew while making him want more and more. When Lee's metempsychosis draws him into the marriage market, the money market, and the slave market, Bird's fable of American upward mobility takes a more sinister turn. Lee learns that everything in America, even virtue and vice, are interchangeable; everything is an object and has its price.", "title": "SHEPPARD LEE: Written by Himself Volumes I and II", "url": "http://www.goodreads.com/book/show/23252946-sheppard-lee", "average": 3.75, "cover": "https://images.gr-assets.com/books/1411190561l/23252946.jpg", "reviews": 22, "authors": [{"url": "https://www.goodreads.com/author/show/462367.Robert_Montgomery_Bird", "name": "Robert Montgomery Bird"}], "type": ["Fiction", "Classics", "Gothic", "Literature", "Literature"], "outlinks": ["http://www.goodreads.com/book/show/23252946-sheppard-lee", "http://www.goodreads.com/book/show/902287.Sheppard_Lee_Written_by_Himself", "http://www.goodreads.com/book/show/37542706-sheppard-lee", "http://www.goodreads.com/book/show/1521009.Nick_of_the_Woods", "http://www.goodreads.com/book/show/9492791-gladiator", "http://www.goodreads.com/book/show/2832988-calavar-or-the-knight-of-the-conquest", "http://www.goodreads.com/book/show/20809614-the-infidel-vol-ii-or-the-fall-of-mexico", "http://www.goodreads.com/book/show/20747652-the-infidel-vol-i-or-the-fall-of-mexico"]}