{"ratings": 572, "userreviews": [{"userName": "Krista Baetiong Tungol", "userReviewDate": "Jul 25, 2016", "userURL": "http://www.goodreads.com/user/show/13624574-krista-baetiong-tungol", "userReview": "This book by Elizabeth Chadwick is not one of her finest, but it is certainly a pleasant recourse to fending off my reading slump and inane habit of randomly picking up books when bored. She sets the story during the time of Henry the Young King’s rebellion against his father, Henry II, and while it details the romance between a reputable mercenary and a widow with a gloomy past, what stirred up in me is the memory of reading Sharon Kay Penman’s Devil's Brood and the antipathy I’d harbored towards this particular bunch of ungrateful Plantagenet brats because of it, and it’s never a good thing to dwell on from a book like this one that should be, by rights, light and romantic."}, {"userName": "Misfit", "userReviewDate": "Aug 20, 2008", "userURL": "http://www.goodreads.com/user/show/1375548-misfit", "userReview": "Not the author's best, but still a good read. Although in my opinion Chadwick's second best is heads and tails above most of the rest. One of Chadwick's earlier books, this is the story of mercenary Joscelin de Gael, the illegitimate son of a promient knight and Linnet de Montsorrel. Linnet's abusive husband dies in an accident and Joscelin is given the care of Linnet's holdings and young son, and marries her. The story then focuses on the after affects of the abuse Linnet suffered at the hands of her now dead husband and father in law, along with the constant plotting of Joscelin's treacherous half brother (the heir) and step mother. As always with Chadwick's books, the way she brings the medieval period to life in such a graceful and effortless way, be it the sights, sounds, smells, food, clothes and battles is just awesome. I see that it's been revised by the author and republished in the UK and Canada and finally listed at Amazon US."}, {"userName": "Iset", "userReviewDate": "Feb 04, 2012", "userURL": "http://www.goodreads.com/user/show/4973578-iset", "userReview": "[after Joscelin and Linnet married, but before the exciting events of the climax which once again turn everything upside down, they face a couple of obstacles that kind of felt a little bit like a predictable up-and-down obstacle-and-resolution formula, but only because I really sensed that nothing was going to tear the couple apart once married and so from that place of security the obstacles they faced in that section of the book felt a little bit arbitrary or not quite as tense or thrilling. (hide spoiler)]"}, {"userName": "Alaine", "userReviewDate": "Oct 11, 2008", "userURL": "http://www.goodreads.com/user/show/1051989-alaine", "userReview": "When I purchased this book I thought that Elizabeth Chadwick was a historical writer, I didn't realise that she was previously a historical romance writer. If this book was written as a historical romance than it was ok, I've read so much better, if it was written as a historical then it lacked any historical content. I was familiar with the setting and the time period because of all the Plantagenet novels I've read but that was not really a big feature in the story. I have to be honest and say that I was really disappointed in this book. The first hook was around page 50 and it was a romantic hook and that was the only thing that kept the story interesting. I am glad it wasn't a long book but I really wanted to love Elizabeth Chadwick. Everyone has recommended 'The Greatest Knight' so I will try reading that down the track and hopefully that will be better."}, {"userName": "Nisareen", "userReviewDate": "Jul 04, 2012", "userURL": "http://www.goodreads.com/user/show/3694607-nisareen", "userReview": "Shields of Pride is set amidst the ill-fated rebellion of the young king Henry against his father, Henry II. The story focuses on Joscelin de Gael, illegitimate and oldest son of William de Rocher. After the death of his mother when Joscelin is only four years old, he's sent to live with his father and step family who deeply resent his presence. He runs away at fifteen to join his Uncle Conan and fight as a mercenary. He returns seven years later to his father's delight, but the relationship between him and his half brothers and step mother remains strained.Returning from a mission Joscelin comes across a broken cart and the ungrateful Giles de Montsorrel. While offering his assistance Joscelin meets Linnet and her son Robert and takes pity on their predicament. When Giles later falls from a horse and dies, Joscelin is asked to escort Linnet and her son Robert home, and soon finds himself nominated as Roberts warden and offered Linnet's hand in marriage. Linnet has spent the past six years of her life in an abusive marriage and is hiding a dark secret of her own but gradually she comes to trust and love Joscelin. Joscelin has had his own heartache in the past, having lost a young son to the bloody flux as well as his beloved mother Morwenna. His father William has never gotten over the death of Morwenna either and as a result his wife Agnes and sons have harboured ill intentions towards both William and Joscellin. When Ralf finally makes his move to get rid of William and Joscellin once and for all, Linnet must use all her wits to save them all.I almost didn't read this book as I was put off by the abuse suffered by Linnet at the hands of Giles at the beginning of the book as well as the other unpleasant characters i.e Ralf and Agnes. I'm so glad I persevered however as once the marriage between Joscellin and Linnet took place the book really took off. The last half of the book was particularly hard to put down as the book reached it's climax.The books biggest strength lies in the flawed, complex characters. My favourites were Joscellin, William and Conan. William's relationship with Linnet was especially interesting to read and poignant at times as she saw underneath the gruff exterior. The added bonus was the presence of the ghost of Morwenna which I though was a stroke of genius. Even Morwenna's gown at the end played a crucial role during the scuffle with Ralf and seemed like Morwenna was reaching out from beyond the grave! A must read."}, {"userName": "Julie Reynolds", "userReviewDate": "Nov 08, 2017", "userURL": "http://www.goodreads.com/user/show/36334133-julie-reynolds", "userReview": "Extremely well written historical fiction. A really enjoyable read. Had trouble putting it down."}, {"userName": "Oriana", "userReviewDate": "Sep 29, 2008", "userURL": "http://www.goodreads.com/user/show/150227-oriana", "userReview": "Josceline de Gael is the bastard son of William de Rocher, the Ironheart. His father’s wife and half-brothers never forgave him the circunstances of his birth and he finally leaves home for several years.While returning to his father’s house, he meets the unpleasant and jealous Gilles Montsorrel and his wife Linnet. After the accidental death of Gilles, Joscelin is chosen to protect his wife and son. But even if Linnet and Gilles start slowly trusting each other and eventually marry, some hidden secrets could change their relationship forever…I have to confess that my favorite character is Joscelin. He is truly a wonderful, honest and strong man. There’s some shades of gray here and there which makes him even more charismatic and the way he treats Linnet and her son is truly heartwarming.Linnet is more difficult to like but her flaws only make her more human. A battered wife, used and abused at her husband’s hands, she doesn’t trust men. Her secret creates some difficult moments with Joscelin but it’s impossible to blame her for her past actions. I couldn’t help feeling frustrated by her situation as a rich widow and mother of an heir. Just free from a monster and immediately forced to marry, unable to choose her husband or even take any decision for her future.Shields of Pride is one of the earliest works of Elizabeth Chadwick and even if not her best, it’s still a magnificent weaved story. I’ve read some of the author’s other books like Shadows and Strongholds, The Love Knot or The Champion and every one of them is a delight, even the Hunt trilogy (it’s what I call The Wild Hunt, The Running Vixen and The Leopard Unleashed) which is slightly different from her more recent works (they tend more towards the historical romance). For those who are really into this historical period, do not miss Elizabeth Chadwick’s books!"}, {"userName": "Rebecca", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/52608370-rebecca", "userReview": "This is one of Chadwick's earlier novels and it does show. She notes that she was able to revise it for this new edition, but it is not as complex or as vivid as her more recent work. Interestingly though, it is set in an era which she has since explored in more detail in other novels - and you can spot names of characters whose stories will be explored. It's as if the seeds of those ideas and that interest were being sown in this 1994 book (although it is possible she may have added them later during the revisions).The story itself is a fairly straightforward romance, a little predictable if I'm honest, but it is nice to have a medieval novel that is focused just as much on the women, where other authors would neglect them. It is something I'm noticing (and enjoying) more in historical fiction, that there are increasing numbers of female authors, such as Elizabeth Chadwick, telling the stories of historical women. Some are fictional women, but many were real and a few, like Eleanor of Aquitane - featured in three of Chadwick's most recent books, are well-known. It certainly starts to balance things out in a genre that has previously seemed focused on the stories of men."}, {"userName": "Iain Reid", "userReviewDate": "Apr 20, 2018", "userURL": "http://www.goodreads.com/user/show/79509675-iain-reid", "userReview": "Sure it's a light romance: gazes are cast, swords are wielded, and bodices are ripped, but looking past that, EC still has a plenty to say about family. How bonds are formed and broken and change over time and how different sorts of family relationships impact different character and behaviors.It's a fun book, not too serious, but not completely dumb either."}, {"userName": "Laura", "userReviewDate": "Apr 23, 2018", "userURL": "http://www.goodreads.com/user/show/37475550-laura", "userReview": "A simple family conflict story with a little historical context in the background. But better than expected based on reviews. As always, Chadwick does a great job of painting the picture of medieval England for us. Enjoyable and light."}, {"userName": "Okidoki", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/7103418-okidoki", "userReview": "Spänning och kärlek. En välskriven och underhållande medeltidsberättelse."}, {"userName": "Mandy Foster", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/66027299-mandy-foster", "userReview": "Loved It!Fast paced, could not put it down! Another fantastic tale of love, war and family feuds. Another fabulous historic tale."}, {"userName": "Kelly", "userReviewDate": "Apr 26, 2015", "userURL": "http://www.goodreads.com/user/show/8545345-kelly", "userReview": "I have had this novel on my 'To be read' shelf for absolutely years. Honestly, at least four house moves. It was always one that I saved for a rainy day, but on rainy days I always found something more exciting to read instead. However, I have been in somewhat of a book-slump and I wanted to try anything and everything to break it.I had never read an Elizabeth Chadwick novel before but recognised her as having a large back catalogue of novels which is a positive. Medieval isn't often my favourite setting for historical novels because I find that they can sacrifice plot and development for blood and gore. Medieval authors also seem to challenge themselves to how many times they can use the word 'wench' in any one story. This novel was no different really, though I will say that it was very well written and the characters were enjoyable.Do you feel my  however  coming? However,  I felt that I was reading a novel. I didn't ever feel 'swept away' with the novel, I liked the characters but I didn't really get  emotional  or  involved  with them. I thought the plot ticked along but I was never at the edge of my chair or gasping with worry, frustration or with love. I would recommend it as a well-written historical novel, and I would certainly read another Elizabeth Chadwick novel, but at the same time I wouldn't describe it as entertaining or absorbing."}, {"userName": "Jacey", "userReviewDate": "Mar 10, 2012", "userURL": "http://www.goodreads.com/user/show/8133175-jacey", "userReview": "Another impeccable historical novel from the back-catalogue Elizabeth Chadwick with a strong romance plot combined with a hefty dollop of family feuding, relationships-gone-wrong, jealousy, ambition and revenge. This time her characters are fictitious and she has invented a couple of castles but placed them firmly in the area of South Nottinghamshire and set them amidst real events – the ill-fated rebellion of the young king Henry against his father, Henry II.Bastard mercenary Joscelin de Gayle, favourite son of William de Rocher, the baron they call Ironheart, is given the opportunity to marry the young widow Linnet de Montsorrel and take over the running of Rushcliffe. Linnet is a survivor with a guilty secret. She's given no choice in marrying Joscelin and they are betrothed even before her husband is buried. Rushcliffe has been badly maintained by Linnet's cruel first husband and Joscelin has to set the keep straight, get rid of the rotten retainers who have been robbing it blind and turn the men at arms into a decent fighting force at the same time as wooing Linnet.When Joscelin is elevated to the status of Baron and given Linnet and Rushcliffe all in one giant leap, he falls foul of his half-brothers. This is a rich and complicated study of family jealousy set against a detailed and accurate background of 12th century England."}, {"userName": "Bryn", "userReviewDate": "Nov 26, 2009", "userURL": "http://www.goodreads.com/user/show/784920-bryn", "userReview": "Joceline is the illegitimate son of a noble, Linnet is married to a rather nasty nobleman, and a chance meeting on the road makes it obvious that far too much stands between these two, and no way could they end u together. But times are uncertain, the King's sons are rebelling, loyalty is rare... and the chaos brings possibility.This is a fast paced, action laden tale full of intrigue, gripping fight sequences, heart breaking romances, and old ghosts. Some of the ghosts are more literal than others.Its enough the historical romance to please girly readers of such (forigve the sterotyping) but its also enough of an action adventure story that blokes who go for that sort of thing might well enjoy it too. If it was a film, it would be the perfect date-movie.Elizabeth Chadwick has a lovely story telling style, her heroes and heroines are flawed enough to be human, and deeply sympathetic. Her bad guys make sense as people, have motives you can believe, and are so icky you can't help but hope they get some serious poetic justice!It's an excellent read and I heartily enjoyed it."}, {"userName": "Favirah", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/28580739-favirah", "userReview": "While the book focuses on the abuse Linnet faced from her husband I cannot forget the abuse Jocelyn's stepmother (Agnes) endured from his father. Jocelyn is a good warrior. He is a bastard son but is loved by his father. And the villains in this family are supposed to be his half brothers and the stepmother. The problem I have with this book is that I cannot forget the fact that his father is responsible for all the animosity between Jocelyn and Agnes and his half brothers.While Jocelyn father loved his mistress ( Jocelyn's mother) he treated his wife cruelly. Imagine comming home from his long absence and bring a pregnant mistress home. And continues to mistreat and shames the wife even after the mistress died. What wife would not feel hatred. And despite his mistreatment of his wife he is considered as one in the \"good team\" in this book. And not once did Jocelyn ever acknowledge this flaw in his father. With this in mind I found that I couldn't really get into the story or root for Jocelyn."}, {"userName": "Bonnie", "userReviewDate": "Jun 02, 2009", "userURL": "http://www.goodreads.com/user/show/1876124-bonnie", "userReview": "This is my first Chadwick book even though I’ve got like a dozen on my TBR list because the covers are SO DAMN GORGEOUS. It’s like a trick. This book started off better than average for historical romance, I’d say. I like that the hero and heroine were a little different than the norm – he’s a bastard son (Josceline de Gael), she’s a battered wife with a young son (Linnet de Montsorrel). Linnet’s husband dies, she’s a rich widow and Josceline’s family decides he should marry her. Chadwick seems to have done her historical research and I thought she handled the “forced to marry a stranger” bit pretty well. But this leaned more to the romance side of historical romance than I wanted and once Joscelin and Linnet married and then it turned into this weird convoluted kidnap/conspiracy part I tuned out. Still, going to try Chadwick again because I don’t think this is considered her best book and she’s not a bad writer."}, {"userName": "Laure Estep", "userReviewDate": "Apr 08, 2011", "userURL": "http://www.goodreads.com/user/show/4997475-laure-estep", "userReview": "Thoroughly enjoyable, easy read. 1173, during the reign of Henry, mercenary Jocelin de Gael wins on the battlefield, but loses his heart to Linnet Montsorrel. Somehow the pair must find their way through threats of jealousy, pride, even reaching beyond the grave.  The only reason this didn't rate the 5 stars an Elizabeth Chadwick novel rightly deserves is that it is a bit shorter and doesn't have the same scope as her later work. This is every bit as well written and researched as her later works. Jocelin's a wonderful hero, and you root for he and Linnet to find their happily ever after."}, {"userName": "Laura", "userReviewDate": "May 27, 2009", "userURL": "http://www.goodreads.com/user/show/1206477-laura", "userReview": "Because of all of the good things I had heard about Elizabeth Chadwick, I think I was expecting more from this book. To me, it was more of a historical romance than historical fiction. Boy meets girl, they fall in love but moust overcome many obstacles before living happily ever after. It did have more period details than your average romance however. I think this was one of her earlier books and the first one of the author's that I was able to find. I heard that a few of her books were going to be published in the US so I will try to read those and see if other books of hers are different."}, {"userName": "Melanie", "userReviewDate": "Oct 13, 2008", "userURL": "http://www.goodreads.com/user/show/391073-melanie", "userReview": "Great story quick read. Story of Joscelin de Gael, illegitimate and oldest son of William de Rocher. Joscelin's mother dies when he is only four and goes to live with his father and step family who abhor him, except the youngest son. He runs away from home when he is 15 to join his uncle and fighs as a mercenary.[return]He returns seven years later to his fathers delight. The oldest son is not in the least happy to see him. [return]The story begins when Joscelin meets Linnet her son Robert and her treacherous husband the baron named Giles de Montsorrel. [return]From page one I was engrossed in this novel and very much enjoyed the characters."}, {"userName": "Jeanette", "userReviewDate": "Apr 15, 2014", "userURL": "http://www.goodreads.com/user/show/2016189-jeanette", "userReview": "This is the first book I have read by Elizabeth Chadwick and shall look forward to reading more of her books. Set in 1173 during the rebellion of Henry II's sons and wife, Shields of Pride is about Joscelin de Gael, illegitimate son of William de Rocher and a mercenary soldier. Quick to anger, he feuds with de Rocher's jealous sons. He meets Linnet de Montsorrel, widow, and they marry, although it is not until later that they fall in love."}, {"userName": "Helen", "userReviewDate": "May 23, 2012", "userURL": "http://www.goodreads.com/user/show/2330369-helen", "userReview": "I wish I could give this a 3 and a half - it's worth more than a 3 but not quite a 4. Elizabeth Chadwick is one of my favourite authors - her historical novels are ALWAYS a good read for the reasons I've given in my previous reviews and this is no exception. 'Shields of Pride' is just lacking that half because I didn't feel as if the history of the period played a strong enough role compared to her other novels."}, {"userName": "Dangermousie", "userReviewDate": "Apr 08, 2013", "userURL": "http://www.goodreads.com/user/show/19199742-dangermousie", "userReview": "A novel set in the 12th century, following Joscelin de Gael, a mercenary and a bastard son of a nobleman, and Linnet, a noble widow who is given to him in marriage once her awful husband dies. It's really good - both romantic and gritty, and delves a lot into social and other mores of the time. Plus, I really like the characters. Chadwick is always always good."}, {"userName": "Loraine", "userReviewDate": "Mar 23, 2011", "userURL": "http://www.goodreads.com/user/show/5101137-loraine", "userReview": "Not as long as others I have read by Chadwick. Once again though the historical detail brings the tale to life and makes you feel like you are really there with the characters. This was more of a romance story this time and there was not so much detail regarding the war and King Henry. A quick, easy read but I wouldn't say it was one of Elizabeth Chadwick's best."}, {"userName": "Deb B.", "userReviewDate": "Jul 03, 2011", "userURL": "http://www.goodreads.com/user/show/2929429-deb-b", "userReview": "...and yet another engaging medieval story by Chadwick; set in 1173, mercenary soldier and illegitimate son of a well-known knight, Joscelin de Gael, is given custody of Linnet de Monsorrel; their relationship develops amidst treacherous family members and painful wounds from the past; as always, an enjoyable and satisfying read."}, {"userName": "Janine", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/7233733-janine", "userReview": "Not my favorite E.C. book, but still worth the read. It's a little more romance than historical, but the characters are interesting and the time period, early on in the ongoing rebellions of the sons of Henry II, is ripe for drama which the author captures well."}, {"userName": "Anna", "userReviewDate": "Apr 23, 2013", "userURL": "http://www.goodreads.com/user/show/1423892-anna", "userReview": "While Shields of Pride was an entertaining well written story, filled with great detail on life in the 12th century, I only gave it two stars because Ms. Chadwick's writing has improved by leaps and bounds over the years."}, {"userName": "Brian", "userReviewDate": "Apr 26, 2009", "userURL": "http://www.goodreads.com/user/show/2041430-brian", "userReview": "I somehow missed this the first time out - apparently it was not issued in paperback when first produced, that may explain it.A very good read, with an interesting plot that surprised me in places."}, {"userName": "Sonya Wanvig", "userReviewDate": "Dec 28, 2010", "userURL": "http://www.goodreads.com/user/show/4715077-sonya-wanvig", "userReview": "It was great! Such a great climax and ending!"}, {"userName": "Laura", "userReviewDate": "Feb 13, 2010", "userURL": "http://www.goodreads.com/user/show/1022824-laura", "userReview": "Good storytelling, although it breaks no new ground, its definitely a quick and easy read."}], "description": "The year is 1173. King Henry's efforts to crush his rebellious sons ignite bloody border skirmishes throughout the land. Yet it is a time of triumph for mercenary Josceline de Gael, bastard son of the king's most trusted ally. Victorious on the battlefield, de Gael suffers sweet defeat when his heart is conquered by the lovely Linnet de Montsorrel. But their love will find its greatest challenge as the torments of jealousy, suspicion, pride -- and an enemy from beyond the grave -- threaten all they hold dear.", "title": "Shields of Pride", "url": "https://www.goodreads.com/book/show/1306846.Shields_of_Pride", "average": 3.92, "cover": "https://images.gr-assets.com/books/1252195407l/1306846.jpg", "reviews": 46, "authors": [{"url": "https://www.goodreads.com/author/show/25765.Elizabeth_Chadwick", "name": "Elizabeth Chadwick"}], "type": ["Historical", "Romance", "Historical", "Romance", "Historical"], "outlinks": ["http://www.goodreads.com/book/show/1306846.Shields_of_Pride", "http://www.goodreads.com/book/show/2445577.Shields_of_Pride", "http://www.goodreads.com/book/show/29423825-skuggornas-borg", "http://www.goodreads.com/book/show/19273479-shields-of-pride", "http://www.goodreads.com/book/show/4835331-shields-of-pride", "http://www.goodreads.com/book/show/5969571-shields-of-pride", "http://www.goodreads.com/book/show/414641.The_Greatest_Knight", "http://www.goodreads.com/book/show/9864637-lady-of-the-english", "http://www.goodreads.com/book/show/1309082.The_Scarlet_Lion", "http://www.goodreads.com/book/show/16125281-the-summer-queen", "http://www.goodreads.com/book/show/7103352-to-defy-a-king"]}