{"ratings": 15637, "userreviews": [{"userName": "trivialchemy", "userReviewDate": "Sep 05, 2009", "userURL": "http://www.goodreads.com/user/show/108138-trivialchemy", "userReview": "A funny story about Dirk Pitt, #13. I headed down to Hermosa Beach last weekend for some debauchery at a friend's condo, and took my bike along so I could do some riding along the sea down the Palos Verdes loop on Sunday Morning. I took along also a backpack, with my jersey and shorts, a change of clothes, some bike tools, a spare tube, an MP3 player, that sort of thing. I also throw in Shock Wave and The Culture of Narcissism American Life in an Age of Diminishing Expectations in case boredom struck. When I got to the condo, I took the bike inside and left the backpack inside my truck.Now, a word about my truck. I drive a beige, 1988 Mitsubishi MIGHTY MAX. Yes, that is the actual name of the truck: MIGHTY MAX. It has a cracked windshield, no AC or power steering, 206,521 miles on, and either door can be opened with a well-placed side-kick, irrespective of how I have attempted to lock it. It's not much for safekeeping, so I try not to leave valuables in it.Anyway, sure enough, I wake up on Sunday morning and go out to my truck to find it has been jimmied open and rifled through. There was very little to steal, except the bag with all my biking gear which was indeed gone.However, apparently this criminal fuckin' mastermind, before making off with my bag, opened it up to see what was inside. He must have been interested in a couple tire wrenches and a pair of spandex shorts that stink of testicle sweat and that could have value only to me, but he actually removed the books and left them inside the truck. That's right, apparently Dirk Pitt, #13 is not worth stealing. No. More than that. Apparently it is worth taking special effort out of your day, in the very middle of an act of criminal larceny, to specifically AVOID stealing Dirk Pitt, #13.------------------------Arguably the best book I've ever read. Before 10 pages have passed, over 130 convicts have cannibalized each other on a raft, and a great white shark affectionately named THE EXECUTIONER has been eaten by -- I shit you not -- A GIANT SEA-SERPENT. I'm not yet 100 pages in, and 2 buxomous babes have been rescued from certain death by our protagonist, DIRK PITT. One from an out-of-control cruise ship, and one from an abandoned antarctic island.He's got a craggy face, and I'm pretty sure he's gonna get to porking before part II. At least I hope so."}, {"userName": "Bob Milne", "userReviewDate": "May 26, 2016", "userURL": "http://www.goodreads.com/user/show/2224905-bob-milne", "userReview": "Lucky number thirteen in the Dirk Pitt series Shock Wave actually has a few surprises to offer, elevating it from the standard Clive Cussler formula. Not that there's anything wrong with that formula - it's immensely successful for a reason - but it's refreshing to find some new twists in the read.The novel opens on an historical note, with the 1856 journey of the Gladiator. Under the command of Charles “Bully” Scaggs, it's on its way to deliver a load of prisoners to the penal colony in Australia when a typhoon strikes amidst the Tasman Sea. The wreck of the ship, the desperate construction of a raft, and the brutal battle that follows between sailors, soldiers, and prisoners is intense, matched only by the final journey of the raft and its few pitiful survivors. Cussler has done historical bits before, but never as well as this. Fantastic stuff.The contemporary story is a bit odd, in that it casts a billionaire diamond tycoon as villain, introduces what feels like a very science fiction threat, and hinges it all on a bold financial move to manipulate the diamond market. It sounds preposterous, but it's the characters who make it work. Arthur Dorsett is a genuine monster, a brutal tyrant who treats his rebellious daughter just about as well as his illegal Chinese mining slaves. This is a man who shrugs off the impending death of hundreds of thousands of people, all so he can add an extra zero to the legacy of billions he'll leave to his family. As for that daughter Maeve, she is not only an admirable young woman and a pretty decent heroine, but a legitimate romantic interest for Dirk Pitt. Dorsett's two other daughters are largely cartoon caricatures, with Boudicca unnecessarily (and illogically) over-the-top, but important in demonstrating their father's ruthless power and control over them.While the story is book-ended by some massive action pieces, involving daring rescues and last minute escapes from certain doom, Cussler does something different in the middle of the tale. First of all, he creates a genuine romance for Dirk Pitt, something we haven't seen for a very long time. You can almost allow yourself to believe he'll sail into the sunset and settle down with a woman worthy of his adventurous soul. Second, he allows Admiral Sandecker and NUMA to carry much of the story, putting their efforts to prevent Dorsett's shockwave from decimating the population of Hawaii at center stage. There's a lot of technical discussion and political maneuvering involved, but Cussler keeps it interesting. Lastly, he strands Dirk, his buddy Al, and Maeve on a derelict boat in the middle of stormy seas for a good portion of the story, creating a sustained level of dramatic intensity that really pays off. You know they're going to survive, but there is some read danger here, and some genuine doubt as to whether all three will escape intact.There's no underwater archaeology or salvage this time around, trading the Indiana Jones feel of the earliest books for the James Bond feel of the most recent, but the entire story is built around life (and death) at sea. Shock Wave isn't quite the breathtaking ride we've become accustomed to from Clive Cussler, but it's a more well-rounded tale, and one with some real depth to it. Definitely recommended.Originally reviewed at Beauty in Ruins"}, {"userName": "Pamela", "userReviewDate": "Dec 24, 2011", "userURL": "http://www.goodreads.com/user/show/3007527-pamela", "userReview": "\"The green-and-yellow beech-leaf sail filled out like a woman's tattooed breast\"This is possibly one of my *favorite* quotes from Shock Wave . I had to reread that sentence a few times before I could actually believe it had been written, evidently in all earnestness and seriousness. As far as I know, and I'd like to think that I have this on good authority, women's breasts do not inflate and billow like sails. Also, why a \"tattooed breast\"? Do tattooed breasts behave differently from non-tattooed ones (no experience here, sorry)?For the most part, I do give credit to Cussler and/or his editor for removing most of the mind-boggingly weird and usually exploitative sexytimes so oft present in the earlier Dirk Pitt novels. However, I do feel bad for Dirk, because I think he probably now has every STD known to man and then some. Poor guy. Yet, while the book was blessedly free of Cussler's sexytime writing, we still get some really strange, what the frijole moments. One is noted above. Describing the obligatory love interest during a car chase, Cussler offers this gem of insight into the female mind: \"Whatever it was, the thrill, the fury of the sounds, the speed, she was not the first woman to fall under the exciting spell of adventure. And what such women desire on the side was a good man to share it with.\" I kid you not, I rolled my eyes when I read that. Literally. As other readers have noted, this is a very James Bond-esque Dirk Pitt novel. Dirk, of course, escapes from certain death about 86 times in the novel, MacGyvers gadgets up the wazoo, and goes up against  Dr. No  an evil diamond merchant on a secluded island in the middle of nowhere, guarded by a sea serpent that eats great white sharks for funsies. Arthur Dorsett has nefarious plans to do ... well, nefarious things. People and sea life are also dying like crazy from a mysterious \"plague\" all over the Pacific Ocean. NUMA to the rescue!The dialogue between Dirk and Al is pretty snappy, and made me smile. Cussler needs to cut down on the weird generalizing remarks, and I think the whole intro section was totally unnecessary. In general, I like the Dirk Pitt novels that involve him looking for a treasure or sunken ship, and not so much the ones where he, Al, and Admiral Sandecker save the world (again)."}, {"userName": "Eric", "userReviewDate": "Apr 15, 2018", "userURL": "http://www.goodreads.com/user/show/11828590-eric", "userReview": "Every so often I like picking up a good adventure tale. Clive Cussler's Dirk Pitt/NUMA books are a great series to check out. Shock Wave is an epic (500+ pages) story that I found to be an interesting and entertaining read.The story starts out with an event that leaves fish, penguins and people mysteriously dead. A cruise ship drops some people off on a shore excursion to Seymour Island in the Antarctic. All of a sudden, people on the excursion suffer an intense headache. A few people die and one person is unwell. Also, even though it is the Antarctic summer, the weather turns cold. The shore party finds shelter in a cave and waits for the cruise ship to return. It does't. Just when things get desperate, Dirk Pitt and his pal Al Giordino shows up to rescue the people inexplicably abandoned on the island. The fate of the cruise ship and massive kill of wildlife is a mystery. Dirk and his friend Al are ruggedly handsome men and all around good guys. They are men of many talents and are able bodied seamen. Admiral James Sandecker is the head of the National Underwater and Marine Agency (NUMA). The Admiral is a well connected. He is always calling in debts and pulling strings to get what he needs for his group. Dirk is the Admiral's friend. The defacto leader of Seymour Island shore excursion is Maeve Fletcher. She and Dirk have a mutual attraction for one another.The story is rich with details and backstory. Maeve is one of the daughters in a family that operates diamond mines throughout world. Arthur Dorsett and Maeve's two sisters (Maeve changed her name) are famous for their treachery and violence. They go about business without regard to anyone or environmental impact. In other words, they are a nasty lot.Adventures abound in the story as Dirk gets in one predicament after another. Some are little over the top. That is what makes these stories so fun to read. Certain parts of the story are predictable. Then there are \"Hollywood moments\" in the story. Like when the bad guys get the drop on Dirk, a long dialog ensues promising Dirk that he is going to experience a long and painful death.In all, Shock Wave is a great adventure thriller!"}, {"userName": "Corey", "userReviewDate": "Jun 23, 2013", "userURL": "http://www.goodreads.com/user/show/12949855-corey", "userReview": "I didn't know what to expect from Shock Wave because it got mixed reviews, but I was very amazed! In this entry of the Dirk Pitt series, Pitt is up against a ruthless Diamond Businessman who has devised a deadly threat to the world. I found this one to be very different from the previous books, I think it's because we normally find Pitt searching for Treasure or sunken ships, and this was totally different, but in a good way.And Shock Wave also shows us Pitt's softer side, and some emotional moments, Cussler really didn't focus on that in his earlier books. It's got everything you'd expect from Clive, Dirk Pitt is my hero!!"}, {"userName": "Greg Strandberg", "userReviewDate": "Jun 13, 2014", "userURL": "http://www.goodreads.com/user/show/19382532-greg-strandberg", "userReview": "Wow, the 13th book in the series. Will it be unlucky for Pitt? I think we both know that won't be the case.The formula is set and you know it by now. So do millions of others around the world, and that's why we buy and read these books. They're fun and a great escape from the same-old same-old.This book is another in the line. You start out with your historic opening and then move to today. Cars and women and rich tyrants - what's not to like? I'm confident you'll enjoy this book, just like you enjoyed the others. Have fun!"}, {"userName": "Kristen", "userReviewDate": "Apr 16, 2008", "userURL": "http://www.goodreads.com/user/show/1071692-kristen", "userReview": "In the 13th installment of Clive Cussler's Dirk Pitt NUMA series, Shock Wave, Dirk and Al return to save the day in another wild and crazy action-adventure. When Dirk investigated the baffling deaths of marine animals in Antartica, he stumbled on sonething more chilling. The passengers and crew of the cruise ship died, leaving stranded on a remote island whaling station, a small party of tourist led by Maeve Fletcher. And it lead him to her estranged father and sisters of the global diamond cartel Dorsett Consolidated Mining. From an escape of a Canadian mine to shark infested waters, it was up to Dirk to thwart Dorsett's plans before an unthinkable disaster happened."}, {"userName": "Barbara ★", "userReviewDate": "Mar 07, 2009", "userURL": "http://www.goodreads.com/user/show/1968285-barbara", "userReview": "OMG what a fabulous installment in the adventures of Dirk Pitt and Albert Giordino. This is non-stop action from page 1 all the way through page 537. At no point does this story drag. There is absolutely no filler. This is 500+ pages of pure adrenalin filled, life threatening adventure.Dirk Pitt rescues a cruise ship (and 20+ passengers) circling an island in the Antarctic Ocean after an horrific plague has killed nearly everyone onboard plus all the animal-life surrounding the island. Two of the passengers (Maeve and Deirdre) are related to Arthur Dorsett a diamond mining kingpin with grand designs of ruling the diamond world regardless of who is killed in the taking.Dirk is tasked with solving the riddle of this plague that kills indiscriminately. Somehow through determination and great research it comes back to the kingpin and his deranged family. His daughters - Maeve, Deirdre and Boudicca all play a role in this spectacular saga. Maeve, the good girl/blacksheet of the family. Deirdre and Boudicca both firmly under Daddy's thumb and clearly having the familial gene of insanity.Clive Cussler is my new favorite author!"}, {"userName": "Daniel", "userReviewDate": "Jan 15, 2012", "userURL": "http://www.goodreads.com/user/show/3562414-daniel", "userReview": "I can't believe it but Clive Cussler out did himself with this Dirk Pitt novel. What made this book surpass the other I've read in the series is seeing a different side of Pitt. He actually falls in love with a women and wants to spend the rest of his life with her, this is what separates this book from the others. It added a depth to the Pitt that wasn't there yet even with the Pacific vortex novel. Best book in the series so far!"}, {"userName": "D.L. Thomas", "userReviewDate": "Dec 17, 2013", "userURL": "http://www.goodreads.com/user/show/26690637-d-l-thomas", "userReview": "This was easily my least favorite Dirk Pitt story to date. It's still good, just not what I've come to expect. Things started off well: action in the ocean! Then a bunch of weird stuff happened, some parts were still in the ocean but it a lot of the action had disappeared. Then the end almost got things back on track: more action, funny back and forth between Dirk and Al, even a more human side of Dirk (not sure if that's good or bad). All in all, not my favorite but better than a sunburn."}, {"userName": "Paris Reynolds", "userReviewDate": "Apr 09, 2009", "userURL": "http://www.goodreads.com/user/show/2205404-paris-reynolds", "userReview": "Dirk Pitt is my hero! I love, love, love Cussler's Dirk Pitt adventures. This was the 1st Pitt adventure I read and I had to read the rest."}, {"userName": "Edwin Kort", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/8132712-edwin-kort", "userReview": "Ook dit boek volgt het bekende stramien van de overige boeken uit deze reeks. Het eerste deel van het boek, het verhaal van kapitein Scaggs het meest interessante. Het verhaalt het avontuur van het schip 'Gladiotor', de struikrover Dorsett en de dievegge Fletcher. Het schip raakt tijdens een zware storm ernstig beschadigt en zinkt. De bemanning en de opvarenden (allemaal veroordeelden die naar de straf-kolonie Australie werden gestuurd) werken met man en macht om een vlot te bouwen. Het lukt de kapitein om alle opvarenden op het vlot te krijgen, maar door stormen, vechtpartijen en ziekten overleven slechts een handje vol mensen de helse tocht en belanden op een afgelegen eiland.In het hedendaagse blijkt het eiland een bron te zijn van vele diamanten en de basis van het Dorsett-imperium. De nabestaanden van Dorsett en Fletcher proberen om de diamantmarkt in te laten storten door in een keer al hun diamanten op de wereldmarkt te gooien. Hier voor hebben zij een speciale procedure ontwikkeld die echter een dodelijk gevaar bevat.Het verhaal wordt op een gegeven moment langdradig, en herhaalt zich soms. Hoevaak moeten we horen/lezen dat Al en Dirk elkaar al vanaf hun schooltijd kennen. Dat alle vrouwen vallen voor Dirk. Dirk en Al ontsnappen een paar keer op het nippertje aan de dood. Samen met Meave Fletcher overleven zij lange tijd op een reddingsboot in de oceaan, maar weten toch nog op tijd te komen om de wereld te redden."}, {"userName": "Charles", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/75851750-charles", "userReview": "This was another good Dirk Pitt book. It was a fascinating look into the world of diamonds, and how driven someone can become by greed. And at the end, yes, sea serpents do exist! I always enjoy the Dirk Pitt series."}, {"userName": "Gerald Kubicki", "userReviewDate": "Mar 30, 2018", "userURL": "http://www.goodreads.com/user/show/8702803-gerald-kubicki", "userReview": "Older Dirk Pitt book, but very enterntaining. Cussler is a little wordy here."}, {"userName": "Steve", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/62076021-steve", "userReview": "Vintage Cussler, though a little bit more emotional than I was expecting. I had hoped he would get to sail off into the sunset but alas it wasn't to be."}, {"userName": "Cik Aini", "userReviewDate": "Sep 03, 2009", "userURL": "http://www.goodreads.com/user/show/1091055-cik-aini", "userReview": "I read Vixen 03 before reading this. I agree with one of the Goodreads member, regarding the resemblance to James Bond, the difference only lies between the scenery/actions-packed adrenaline rush are being played out at the sea instead. Pitt would come across to me between Mc Gyver and James Bond (the recent ones, without the over reliance to gadgets) Be warned though, the prints are small, but as I was reading this, the characters seemed to leap out of the pages. That's how fast it's moving! The story starts off with the story of Maeve's ancestors - Betty Fletcher who was among the convicts sent to serve her sentences, and the groups of convicts were sent on a ship. A storm battled the ship, from the 200++ convicts plus the officers in charge, only 8 survived after foods depleted, battles within them due to starvation and fresh water, being pushed out from the fish into the sea and eaten by the sharks! And that's the only starting part of it!The first part was quite intriguing, with Pitt as usual became a hero while doing his research. He saved a group of people including Maeve, and then, the twist started. An epidemic caused hundreds of people to drop dead and they try to search for a reason why that happened! And then, as the story moves along, we found that Maeve's father (a diamond billionaire) and her sisters are in charge.The crooks here are extremely bad. Sometimes I feel reading through the pages feel akin to watching a movie with gory murder details, ewww! The most interesting part would be when Pitt, Al & Maeve were left on a small boat in a middle of nowhere and trying to survive. Now this is one action packed novel. I was trying my best to read this as soon as possible, but I couldn't skip any part of the book. So, it was a bit slow moving for me :P (not the novel!)..Was trying my best to guess how they survived the ordeal. Definitely, I'll be looking for his other novels too!"}, {"userName": "Sarah", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/5644240-sarah", "userReview": "My husband is a Clive Cussler fan. I found myself between books and needed something that wouldn't be too challenging but would keep me interested. Cussler's Dirk Pitt is an action hero and supposedly based upon Cussler's own experiences in life. I was intrigued and knowing how much my husband liked the Dirk Pitt books -- I jumped in. The plot is different than I've read before - there's a plague affecting the animal and human population but it isn't based on normal disease causing elements - this time it is noise. Cussler comes up with a potentially plausible method and it is up to Dirk to stop it. Well, sort of... but that's the story that Cussler tells.I enjoyed reading this and it was fast paced as well as action oriented. I could see this being a movie some day. Not being familiar with the Dirk Pitt aura and mystique, I found some of the fight scenes and superhuman heroics a tad bit stretching my credulity but since this is fiction - I'll let it go. I'll read another one or two of Cussler's tales now that I have \"met\" Dirk Pitt - I'm curious about the back story which was referred to in this book. I also am curious about how this fits into the series. Having picked it up randomly, I don't have a sense if this is book 4 or book 10 - I know Dirk has a history and the book had other characters who clearly had a past connection with Dirk so there's more to explore.Overall, I liked it. It wasn't my favorite adventure but it wasn't bad. It was entertaining, I learned a little and had fun following the adventures and mis-adventures of our gallant hero."}, {"userName": "Adarsh", "userReviewDate": "Nov 19, 2008", "userURL": "http://www.goodreads.com/user/show/25721-adarsh", "userReview": "Clive Cussler's protagonist Dirk Pitt is a James Bond style hero, but one that prefers sea to land. In this book, Pitt takes on the wealthy owner of a diamond empire whose secret mining operations are causing scores of unexplained deaths across the Pacific.I found the first part of the book incredibly exciting. The two centuries old tale of Captain Scaggs at the seas is simply fantastic. The story gets a little less exciting as we return to the present, but the author managed to keep my attention till the very end of the long book. Perhaps makes for a good movie script. Although I enjoyed reading the book, I wasn't too impressed. Simply because I like my characters more down-to-earth, more human, more real. Pitt in the other hand is one of those too perfect characters that I can't really believe in. However, if you enjoy reading Bond, you might like this too."}, {"userName": "Gable Van Cleave", "userReviewDate": "Aug 27, 2015", "userURL": "http://www.goodreads.com/user/show/46164675-gable-van-cleave", "userReview": "This was a masterfully written piece, a long read and very complex but nonetheless a page turner. The imagery in this book was stunning, even though it is third person, the reader still feels like they are really there while the complexity makes it really fun to read, there are often up to seven characters in the story at one time, so there is never a dull moment. The author seems to have an impressive knowledge about, be it a car, aircraft, or ship, the author knows all about, bringing the reader even closer into the story. The historic value of this book also made it very interesting, most of the time the ship or shipwreck the author is talking about is real. I recommend this book to anyone who enjoys action, adventure, history, and a little suspense."}, {"userName": "José Ramón", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/12009971-jos-ram-n", "userReview": "Otra de las novelas de Clive Cussler que trata sobre este maravilloso personaje de Dirk Pitt, aunque debo reconocer que es de las que el argumento me ha parecido más flojo. No la elaboración de la novela, que me parecio muy interesante.Pero debo de reconocer que el argumento de crear una saturación del mercado de diamantes para poder subir el precio de las otras gemas de color, me parecio un poco flojo. Quiza lo que no me gusto es que no haya el tipico misterio histórico por detras, que suele aparecer en todas las novelas. Es cierto que trata el misterio de la aparición de la la familia en el transporte de prisioneros a Australia, pero no sé... me parecio un poco flojo. Me encanta que haya como dos tramas al mismo tiempo, pero que sean en dos épocas diferentes. Lo eche de menos.Pero al final, como siempre me gusto. Es la tipica novela que necesito cuando estoy de vacaciones y alejarme del mundano ruido del trabajo. Nada mejor para distraerse como remontarse a los problemas dentro de un mar tormentoso por Oceania, y la aparición de toda una serie de misteriosas muertes que resolver."}, {"userName": "David Hamilton", "userReviewDate": "Apr 16, 2018", "userURL": "http://www.goodreads.com/user/show/75546515-david-hamilton", "userReview": "This was a thrilling read! Dirk Pitt, a cross between James Bond and Jacques Cousteau, is on the trail of an evil diamond tycoon who uses new acoustic wave technology in his mining operations with the unfortunate side effect of killing any living creature in its way. The writing is crisp and thoughtful. Cussler is an expert researcher as evidenced in part by Pitt's activity in Ottawa and the Queen Charlotte Islands with the Haida. I found this the most interesting part of the story, especially the local Ottawa connection when Pitt has to meet with officials from Environment Canada.I'm not a huge fan of 3rd person omniscient narration, but I like what Cussler does with it. Never dull or boring.The only minor bothersome part was the fact that this novel is longer than it really needed to be. The first part - the back story - is fascinating and could develop into its own story. But it's stapled on to this one and really doesn't need to be there. Still, I'm hooked. This is a thrilling ride!"}, {"userName": "John", "userReviewDate": "Apr 06, 2018", "userURL": "http://www.goodreads.com/user/show/375083-john", "userReview": "A typical Dirk Pitt book. Ruthless supervillains. Beautiful women. Impossible situations that Dirk somehow escapes. Lots of fun - a really enjoyable read. In this particular book, the ruthless supervillain is a diamond mogul who has a plan to destroy the world diamond market, and oh by the way, might accidentally kill a few million people along the way.As with most (all?) Dirk Pitt books, the first few chapters of the book are a historical accounting of something that happened a long time ago (usually some truth mixed with some fiction) that ends up being relevant. That particular story (about 10% of the book) was 5-star worthy - some of the best reading I've done in a long time. The rest of the book was very good too."}, {"userName": "Tom Kristan Jr.", "userReviewDate": "Nov 11, 2017", "userURL": "http://www.goodreads.com/user/show/38792052-tom-kristan-jr", "userReview": "Review of SHOCK WAVE by Clive CusslerA excellent escape read. Many of Clive Cussler novels are believable and could possibly occur, that is not the case with SHOCK WAVE. It is really quite far fetched. The possibility that 2 rafts would survive enormous storms at sea during different generations is extremely difficult to fathom. However this occurs in this novel, as well as Dirk Pitt so close to death on 2 occasions, yet somehow finding it the ability to overcome enormous odds and defeat an extraordinary adversary. This novel receives a 3 star rating, because it us too far fetched, yet it keeps the reader not wanting to put book down and discover how the hero Dirk Pitt overcomes, survives and ultimately wins."}, {"userName": "Wendy", "userReviewDate": "Apr 22, 2018", "userURL": "http://www.goodreads.com/user/show/18870347-wendy", "userReview": "Reading this book more than two decades after it's written, one sees some issues with it. It's very much a macho, man saves helpless woman kind of novel. The main female character is supposed to be this independent woman who defied her family. She's supposedly strong enough to make it on her own. However, through the novel she constantly needed Dirk Pitt to rescue her. I understand that he is the hero, but it did get annoying. There are quite a few sexist, some homophobic remarks scattered throughout that irked me too. The romance is not all that believable, in my opinion. I did not really care for it. The action is what one would expect from a Clive Cussler book, a bit over-the-top. I usually enjoy his novels, but this one: not that much."}, {"userName": "Cara W", "userReviewDate": "Apr 10, 2018", "userURL": "http://www.goodreads.com/user/show/38621505-cara-w", "userReview": "A Dirk Pitt novel. He gets the girl, saves the day, loses the girl and nearly dies -but doesn't die.But I do enjoy the Clive Cussler novels!An unnatural acoustic wave has destroyed life in the ocean, on islands, and on boats. The evil company Dorsett Consolidated is causing this by using sonic waves to mine diamonds - an unintended event. But Dorsett doesn't care and won't stop.Dirk is tied up being abandoned at sea with Al and the girl, so Sandecker and Gunn have to save Hawaii since the next acoustic event will take out Honolulu. They do save the city and island, and reflect the wave to destroy Dorsett's island - almost taking Dirk and Al with it."}, {"userName": "MIG_ASE", "userReviewDate": "Jun 27, 2017", "userURL": "http://www.goodreads.com/user/show/47757318-mig-ase", "userReview": "Como todos los de Clive Cussler muy entretenido. Aventuras trepidantes sin descanso entre una acción y otra, y un final en el que (como siempre) gana el bueno de forma milagrosa.La verdad es que, si bien es una novela que seguro que la olvido en breve, no por ello deja de ser divertida. Para fans de Dirk Pitt estupenda, y para los que no lo conocen una buena novela para iniciarse (no, no es necesario empezar por al primera para disfrutarlas, realmente están escritas de manera que la parte de historia que pasa de novela a novela sea mínima ... como un capítulo de CSI, no hace falta seguir la aserie desde el capítulo 1 de la temporada 1 para disfrutarla"}, {"userName": "Diane Burton", "userReviewDate": "Apr 24, 2018", "userURL": "http://www.goodreads.com/user/show/6952559-diane-burton", "userReview": "A rip-roaring adventure. Maybe too much historical background at the beginning. I wanted to get into the story right away. But, it all gave a good foundation for present day. I think Pitt is getting too old to keep coming back (easily) from being beaten within an inch of his life. But, hey, he's a tough guy. Just when you think he and his team will finally get away from the bad guys, they out think Pitt et al. who fall into a trap. Some of Pitt's solutions were quite inventive. Good action story."}, {"userName": "Diane M. Dobranski", "userReviewDate": "Sep 18, 2017", "userURL": "http://www.goodreads.com/user/show/50180231-diane-m-dobranski", "userReview": "Loved itI'm am sure I read this book twenty years ago but the second time around was even better...love all Dirk Pitt books..This was non stop action and could not put this book for down had to find out how Dirk and Al came out of bad situations....I was so sad that Mauve died and the Marvelous Mauve was brought to his hanger.....Plan on rereading some of the old DIrk Pitt books again....I saw this book as republished for kindle at a very cheap price and bought it with Flood Tide.....Great books highly recommend the Dirk Pitt books."}, {"userName": "Geoff Battle", "userReviewDate": "Jun 22, 2017", "userURL": "http://www.goodreads.com/user/show/67231576-geoff-battle", "userReview": "Shock Wave's plot is fresh, however the ongoing torture that Pitt endures through the book is somewhat over the top. In the past Pitt has been through some pretty gruelling experiences and in Shock Wave Pitt faces his toughest challenges yet. Cussler tends to stretch the scenes out, creating a heavy going action novel, with the required cliffhangers peppered throughout. The good news is that the villains of the piece are nefarious and loathsome - just right. Overall, Shock Wave isn't the easiest Dirk Pitt adventure to read, however it will keep you going until the end."}, {"userName": "Neil", "userReviewDate": "Aug 25, 2012", "userURL": "http://www.goodreads.com/user/show/11192244-neil", "userReview": "[ Arthur is mildly disgusted with himself for experiencing sexual arousal in regard to his second oldest child and, technically, first daughter  (hide spoiler)]"}], "description": "A hundred and forty years after a British ship wrecks on the way to an Australian penal colony and the survivors discover diamonds on the tropical island where they wash up, Maeve Fletcher, one of their descendants, is stranded on an island in Antarctica with a party of passengers after their cruise ship seemingly abandons them.Dirk Pitt, on an expedition to find the source of a deadly plague that is killing dolphins and seals in the Weddell Sea, finds Maeve and the passengers and rescues them from death. When Pitt later uncovers the cause of the plague, he discovers that Maeve's father, Arthur Dorsett, and her two sisters are responsible because of their diamond-mining technology. A deadly race develops to stop Dorsett from continuing his murderous mining operations and to head off a disaster that will kill millions. Pitt's struggle to foil Dorsett's ruthless plan to destroy the market for diamonds and thus gain a monopoly of his own takes him from harrowing adventures off the west coast of Canada to being cast adrift in the Tasman Sea.", "title": "Shock Wave\n      \n          (Dirk Pitt #13)", "url": "http://www.goodreads.com/book/show/35903129-shock-wave", "average": 3.99, "cover": "https://images.gr-assets.com/books/1501724007l/35903129.jpg", "reviews": 343, "authors": [{"url": "https://www.goodreads.com/author/show/18411.Clive_Cussler", "name": "Clive Cussler"}], "type": ["Adventure", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/35903129-shock-wave", "http://www.goodreads.com/book/show/41704.Shock_Wave", "http://www.goodreads.com/book/show/3410304-shock-wave", "http://www.goodreads.com/book/show/361082.Shock_Wave", "http://www.goodreads.com/book/show/818373.Shock_Wave", "http://www.goodreads.com/book/show/3777814-shock-wave", "http://www.goodreads.com/book/show/6033961-schokgolf", "http://www.goodreads.com/book/show/5807388-shock-wave", "http://www.goodreads.com/book/show/7990853-amenaza-bajo-el-mar", "http://www.goodreads.com/book/show/41716.Sahara", "http://www.goodreads.com/book/show/198332.Inca_Gold", "http://www.goodreads.com/book/show/41707.Atlantis_Found", "http://www.goodreads.com/book/show/41706.Raise_the_Titanic_", "http://www.goodreads.com/book/show/198331.Valhalla_Rising"]}