{"ratings": 1021, "userreviews": [{"userName": "Aj the Ravenous Reader", "userReviewDate": "Mar 09, 2016", "userURL": "http://www.goodreads.com/user/show/30248594-aj-the-ravenous-reader", "userReview": "A pretty SICK zombie book. A jaw hangs loose from its skull, a fist-sized hole in a throat gapes wide, facial skin slides away from the bone and kids go and be like cannibalistic lawn mowers while corpses of students litter the sidewalk. This is how graphic it gets and it was quite entertaining especially with the easy to read, funny at many places writing amplified by the pages of the book blotted out with blood-like splatters at their edges. It’s quite creative and it certainly achieved its very purpose, that is to crumple the reader’s face (in this case, mine) worse than a dried plum the whole time I was reading (glad my husband wasn't around while I was reading it, it'd be a major turnoff for him, lol!) Best read this while having a gooey blueberry pie, yum!It has a fast-paced plot although predictable and far-fetched at times (read it in one sitting), a likeable hero-narrator, diverse characters with emphasis on human relationship and amusing references to the classic novel, The Lord of the Flies which had me feeling all smug and earning me a well deserved fist pump since I have just recently read the said classic novel. I was like “Ha! I know that conch shell reference!” I was just really bummed out by the death of a favorite character and a bit bothered by the boys’ obsession on wanting to use their male parts as weapons of destruction. Gross! Anyway, it’s kind of a blend between World War Z and Lord of the Flies so yeah, it’s pretty cool. My awesome friend, (Ate) Shelbs read the novel too and liked it enough. Do check out her short but convincing review.^^"}, {"userName": "karen", "userReviewDate": "Sep 08, 2013", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "[for all the buildup about tara's dad getting torn to pieces (in what was, admittedly, a really harrowing scene) and \"who will tell tara??\" etc, we never get any closure to it. not that i was really interested in reading a tear-jerky emotional scene like that, but it did remain oddly open-ended for all the buildup. (hide spoiler)]"}, {"userName": "Anne", "userReviewDate": "Nov 04, 2013", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "I'm going to warn you right off the bat that this review is probably biased and emotionally skewed. And it's all because of my youngest daughter.Why would a book about teenagers running around during the Zombie Apocalypse have anything to do with my 5 year old?I'll get to it...So this kid Brian is sort of a slacker, but not in a bad way. Just, you know, in the regular loveable slacker kind of way. He's recently broken up with his longtime girlfriend, mainly because she's got some issues that he's, quite frankly, tired of dealing with.Her phobias (large crowds being one) bring on panic attacks, and the medication to stop them leaves her (no pun intended) a sort of sexual zombie. Ok. That sounds like a sucky reason for a guy to break up with the girl he loves, but I can totally see a teenage boy doing that. He's not a dick, though, and the two remain friends. Even if it is a bit awkward for him.After all, he still loves her, but he's...you know...an idiot.The story begins with him feeling kind of proud of her for facing her fear of crowds, and going to a school pep rally with his sister. He also feels a bit guilty, because instead of going and supporting her, he and his buddies are sneaking off campus to go hang out at one of their houses. 'Cause they wanna do...slacker stuff.Enter the zombies!After a confusing encounter with a friend (and a weird news report), they realize something is potentially very wrong with some of the people in their area. It appears there is some kind of contagion spreading through the community. Spreading, um, fairly quickly. Naturally, they head back to school where it's safe. The original goal is to try to check up on Brian's little sister and their other friends.And then everything goes to shit.They end up trapped in the theater building with a bunch of kids that they normally wouldn't have much of anything to do with. Which (ta-da!) is where you get the 'Breakfast Club' reference from the blurb.At this point, you've got all your stereotypes lined up and ready to learn an all-important lesson.Underneath everything, we're all exactly alike!Don't expect to be blown away by this new and different idea, and you'll probably enjoy the book a lot more.Ok. Now what Brian should do is hunker down in this fairly protected area, and wait for the calvary.But.His little sister is out there somewhere (hopefully) with his ex-girlfriend (that he still loves), and he's not going to let them get chomped on by these new sparkly zombies.Sparkly?Yes. They sparkle because the UZA (United Zombie Association) was getting a little pissed that the vampires were the only ones being portrayed as 'glittering in the sun'. They also sparkle because this virus has gout-like qualities that causes the skin to crystallize. This makes me really nervous, because my husband has gout in his big toe. And now I'm worried that he's going to turn into an undead diamond and rip my throat out in my sleep. Seriously. Last night he started snoring, and instead of whacking him with a pillow (like I normally do), I just curled up into the fetal position and prayed that he wasn't growling...So, Brian starts making plans to rescue the girls. Now, I know what you're thinking. Is a teenage boy really going to take on a zombie horde for his annoying little sister?Evidently, yes. And here's where I got the emotional sucker-punch from this book. See, Brian's sister was a childhood cancer survivor, and because of what she and their family had been through, they were especially close. Not only that, but his sister had the same form of leukemia that my daughter has...sorry, had. See, my little girl just finished her last chemotherapy treatment yesterday.Ah. Now you see where the zombies and the 5 year old are starting to make sense, huh?Ok. So my first thought after reading that?I will totally 1 star this book if his sister survived cancer and then gets eaten by zombies!I know, I know. That wouldn't really be fair of me.Guess, what? Life's not fair.Mwahahahaha!Anyway, the rest of the book was a nail-biter for me. Nobody was off limits when it came to getting eaten, and there were quite a few characters that I just knew were going to make it out that didn't. There was one in particular that I was really sad to see go...To me, this was a good ya zombie novel. No, it's not high literature, but I think it would be a good book for teenagers. Or maybe even an adult looking for Zombie-Lite?At any rate, to all the kids (like mine!) who managed to outrun the zombies?You guys are tougher, cooler, and more beautiful than anyone else in the world. You rock!And to all the kids who are still running?There's a lot of people smarter than me looking really hard for a cure for zombieism. But in the meantime, you just gotta hang in there.Fuck zombies. They suck.This review can also be seen at Addicted2Heroines"}, {"userName": "Rachel Maniacup", "userReviewDate": "Mar 16, 2016", "userURL": "http://www.goodreads.com/user/show/37103769-rachel-maniacup", "userReview": "When my little sister got her new books including this..she said this one's about zombies,and I was like,\"Yay! I want that,I want that! I'm gonna read that!\". And seeing the title made me more excited to read this book,wondering how sick this could be,especially when this is my first of Tom Leveen.So yes,this is a story of teenagers who got stuck in their school in a zombie apocalypse..If you want to know how and when it started,you've got to read this book! The strange thing is that,they're not dead..they're just really sick with \"sparkling\"skin,faces that melt,and with distorted bent backs(how could they even move and run fast?!) Well,aren't they so gruesomely horrifying?*shudders*What I liked here were the characters,particularly the secondary characters(because they're more interesting)starting with Jaime, the Latino kid who is the smartest and the coolest, and who practically lead his group (Drama department) in protecting them.Then there's Travis, who wanted to prove to his father that he is a brave man(something to make his dad proud of), Cammy, the kick-ass cheer leader(Hollis'girlfriend),who I wished showed up already during the first \"Kenzie and Laura\" search mission. And of course,there's Chad, the \"hot-tempered\"and the meanest bestfriend of Brian(the MC here),who I adored later,during the search mission. So yes,the secondary characters did most of the \"zombie-combat action\".Yet at least,Brian did something \"heroic\" at the last part of the story.The only reason why I'm giving this a rating of 4 is because,the story ended abruptly(hope there's a sequel). Overall, I loved how the author originally created his zombies,how the plot went along reasonably fair,the setting was great and the story was intense. I also liked that the author added a unique and touching story of love,friendship and loyalty into the story. So to those who are zombie fans..this book's for you! Thanks to my dearest sis who lent this book to me! Love you,girl!^^"}, {"userName": "Greg", "userReviewDate": "Aug 08, 2013", "userURL": "http://www.goodreads.com/user/show/42508-greg", "userReview": "Am I supposed to say thank you to netgalley and let people know that I got the book for free to read? I know everyone does this. In the interest of full disclosure I guess I should mention it, too. I guess I should also mention that almost every book I've read recently has been a free book I've gotten directly or indirectly from a publisher and that I kind of only want to read ARC's anymore because I'm too lazy to spend the minute it takes to sign in a non-ARC into work. So disclosure said. I should also say that I'm not promising an honest review. I sometimes lie in reviews. So I asked for this book because it was compared to a cross between The Breakfast Club and Walking Dead. I'd had good results with the Breaking Bad meets Walking Dead, so whose to say that I wouldn't have good luck again. I enjoyed the methed out zombie book much more.Yeah, there is a Breakfast Club thing going on here, but it's not as angsty or 'cool' feeling as the mid-80's movie that I could possibly quote over 90% of, and which I saw probably over a hundred times as a middle school student. Instead it's Breakfast Club like because you get a whole little cross section of a high school population thrown together having to deal with shit they would rather not be dealing with. You've got theater geeks, a gooney sXe kid, a cheerleader, a basket-case, a sophomore version of Avril Lavigne, and some other types, all mixed up with genders, race and sexual orientation. It's like a photograph from the cover a college recruiting brochure. But with zombies, or zombie like creatures. Did I like the book?Not so much. It's possible that part of the problem with the book was that there was a formatting glitch in the epub version I read. Every page (numbered page, not reading page) had at least one sentence in the wrong place. Like an experimental fiction non sequitur thrown in to break up the reading experience. Since the physicality of ebooks is already somewhat alienating to me, this just made getting at all immersed in the story almost impossible. It was like some third-rate Brechtian shit going on, always letting me know, you are reading a book, you are reading a book on a device, reading a book reading a book. Ignoring the unsatisfactory basic reading experience, I still had some problems with teh book. Two main ones.One. Maybe it was because I'd just read a book that did an amazing job at voice that I was more attuned to this problem, but none of the characters sounded very believable when they spoke. They didn't sound like teenagers, they kind of sounded like what I imagine my dad might have made teenagers to sound like if I could have gotten him to write some teen dialogue back when I was a teenager, and convinced him to at least drop the embarrassing words like phat, which he'd heard the kids said, but which neither my sister nor I ever used (I think).Two. I get that in this zombie saturated cash cow culture you've gotta give the walking dead a new twist, and this was a fairly ingenious little twist to the zombie condition, but it was almost like too much of a twist. Early on in the novel a zombie literally punches a whole in a kids face. They can also move quite fast, and they are animal like in being able to sense a potential meal lurking around. With all of these strengths it's sort of unbelievable that there are any survivors at all. The creatures are made too lethal, too bad-ass or whatever you want to call it. I'm fairly certain that if you can punch a hole in someones face, you can also punch through a door, especially if things like shattered bones and pain aren't concerns because all you want to do is eat some living people. The creatures also aren't that great at finding more victims once the initial carnage is over. The book did have a nice George R.R. Martin element to it though and once the action started there did have the feeling that no character was safe from possibly becoming the next victim to the creatures roaming around the high school campus turning students into piles of gore. Will kids like this book? I have no idea. I guess it depends on their age. I can see younger teens with a taste for horror enjoying it, older teens might smell bullshit in the way the characters talk and act. This probably would have been fine back when I was a teen and YA literature didn't really exist except as warning novels like Go Ask Alice to make sure we just said no or else our lives would become unbearably boring shit if we succumbed to the lure of sex, drugs, and Satan; and we'd become addicted to writing a diary, and getting more and more into that diary as we did more and more drugs. Just for the sake of not having to jot down every stupid thing in a notebook, the safest thing back then was just to say no and maybe just waste your time listening to Faster Pussycat while playing say Galaga on Nintendo. Or maybe that was just me. How did I come around to that? Right. YA novels didn't really exist back in the days when I was a teen. Back then I probably would have thought this was pretty cool, but don't take my teenage self's opinion about anything to matter."}, {"userName": "Jon", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/4277731-jon", "userReview": "Check out Scott Reads It! for reviews, giveaways, & more! I had been longing to read Sick ever since I saw that it was being marketed as \"Breakfast Club meets The Walking Dead\". Sick was even one of my \"Waiting On Wednesday\" picks in July and I was dying to read it. Sick just might be my most disappointing book of 2013 by a long shot. Don't believe Sick's description at all, the marketing for this book is built on false pretenses. When I read \"Breakfast Club meets The Walking Dead\", I should have known it was a gimmick because that comparison is too good to be true. Sick is nothing like The Breakfast Club at all and doesn't deserve to be compared to such a classic movie. The only element of Sick that remotely resembles The Breakfast Club is the fact that kids from different cliques and walks of life are stuck in the same room. That's where the similarities to The Breakfast Club start and end. Sick is NOT a coming-of-age story despite the comparison and the characters don't progress morally at all to justify the comparison.I can definitely understand the comparisons to The Walking Dead and it's a pretty accurate comparison. There is a lot of survival aspects of this story and there are a ton of gory zombie moments in this book. I love gore in books, but Sick felt excessively gore to the point where I didn't feel so well. The zombie aspects of Sick are executed well for the most part. Leveen has created a new type of zombie, these buggers are hunched and have crystalline features. At one point in the story, the zombies were described as sparkling and I couldn't help but be reminded of Twilight. I appreciate Leveen's efforts to create a new type of zombie, but we have enough sparkling paranormal creatures, thank you very much. Zombies don't need to sparkle, it's unnecessary and I'm not ready for zombies to be ruined for me. Vampires were taboo for me for a long period of time and I refuse to let that happen to zombies.Sick has some of the least intelligent characters I've read about ever and they frustrated me to no end. In addition to this, some of the characters also enjoy racist jokes. Here are some lovely quotes from this glorious book: Exhibition A: Let's be offensive and racist! I didn't know being a bigot was in season?\"I didn't know a black kid could be pale, but Hollis is.\" \"Maybe they're bustin' him for somethin'\" \"Like what?\" \"Bein' black\" \"Good point\"\"Are you, like one of those high-functioning retards?\" he asks.\"Because I'll kick your Mexican ass square into next week, ese.\"\"This is the United States of America,\" Kat says, pretty calm under the circumstances. \"We're not in Rwanda here, you guys. Someone'll show up, we've just got to sit tight.\"Exhibition B: Let the idiocy begin! \"What the snap crackle fuck you talkin' about?\"\"Let's go fuck this monkey\"\"Say the world, and we're off like a prom dress.\"\"It's Chad o'clock, motherfuckers.\"\"Just out of curiousity, is there a Spanish word for zombie?\" Jamie considers this a second before suggesting \"Zombrero?\" I wish I could say that these quotes made sense when in context, but that's not the case. This book gives teenagers a bad image and makes all teens look brain-dead. I kid you not, my e-ARC was filled with random quotes that made me want to weep for humanity. None of the characters are likeable at all and the MC never ceased to irritate me with his constant need to judge everyone. If you're questioning whether to read Sick or not, it really depends if you'll be offended by racism, prejudice, and mindlessness.I wish I could say the plot makes up for the horrendous dialogue and frighteningly unlikable characters. The plot is nothing special at all and is an average zombie story. There is a lot of running around, panicking, planning to escape, and people trying to figure out how the zombies were created. Sick stoops lower and lower as the book goes on and even manages to use a bunch of cliches. The characters even made a Lord Of The Flies joke, how clever! Not to mention that I've seen this story countless times and I just couldn't really immerse myself in this book. Luckily, I read Sick pretty quickly considering how much I hated it. The plot is extremely fast-paced and it always seems like there is something going on. I may not have enjoyed Sick, but I give credit to Leveen for making sure there is never a lull in the plot. Sick by Tom Leveen is definitely one of the worst books I've read all year. I honestly couldn't handle the excessive racism, offensive humor, and goriness. I'm not sure if I would recommend this one to anyone at all; I'm still not sure who the target audience for this one is because it manages to offend people from many different walks of life. Sick never ceases to be crude at all and I'm still questioning why this book is going to be published. Yikes!"}, {"userName": "Kimberley doruyter", "userReviewDate": "Jan 02, 2014", "userURL": "http://www.goodreads.com/user/show/23952659-kimberley-doruyter", "userReview": "makes you scared to go to school. kinda wanna know how other people got throught that crap.and how did it all start.would really read a sequel/prequel if there ever came one."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "Not the best zombie book I've read but most certainly not the worst. It did have it's moments. It's marketed as a young adult novel so it did come across sometimes as juvenile but I still likey it. Plus it did have zombies in it."}, {"userName": "Laura", "userReviewDate": "Jun 26, 2013", "userURL": "http://www.goodreads.com/user/show/4844873-laura", "userReview": "[ There was a comment late in the story that did not sit right with me. A comment Brian made about Travis. Maybe Mr. Leveen was trying to break the “nice guy” stereotype as well there, but it was too close to the ending for me. I really didn’t know where to put it in my head and heart. In short, I did NOT like it.  (hide spoiler)]"}, {"userName": "Dayla", "userReviewDate": "Sep 04, 2013", "userURL": "http://www.goodreads.com/user/show/5039340-dayla", "userReview": "Review first appeared on my blog: Book Addict 24-7I received a copy via NetGalley in exchange for an honest reviewSick by Tom Leveen is an unconventional zombie read that is getting some backlash on Goodreads for a few of the characters’ comments and behaviors. I’m going to state this from the get-go, just so my opinion is clear: I do not think Leveen’s intent was to be unknowingly racist or for his writing to be portrayed as one of a bigot. His book’s “heroes” are in fact anti-heroes, which aren’t your conventional heroes that shine like the sun and crap rainbows. They are imperfect characters (teenagers, which is even more important to note) that grow throughout the novel. They are offered the ultimate redemption as the apocalypse strips more and more of life’s normality from them. Also, they’re kids in an affluent community with a sudden influx of lower class students. Come on. And I will mention this as well: Protagonists aren’t always made for a reader to love them—this notion is both incorrect and highly naïve.Not every hero is perfect, so to expect as such in a character is ridiculous. Authors don’t write a hero for your benefit, but for the benefit of the story. If the story begs for a character to be redeemed, then it will happen, but the character will not be a white-toothed perfect citizen to begin with. And if people looked beyond the so-called racism that allowed for this fun book to be rated lower (all due respect to people and their opinions), they would see that these horrendous characters were either redeemed or were given a heavy dose of humanity when the time called for it. Also, may I mention that there are instances where these “bigoted” characters showcased their change in attitude? These changes are visible in the small moments of interactions between these kids. As for the whole The Breakfast Club relation, it is like the film because it showcases kids from different social statuses coming together as one to solve one common problem: how to escape. It doesn’t have to be exactly like the iconic 1980s film for it to share several aspects.It’s so easy to classify a book one way or another from the first glimpse, from the first racial or sexual orientation-related slur, but if given the chance, books like Sick can offer so much insight into humanity, especially when it is at an imminent end. The pacing in this book is quick, the action addicting, and the friendships are touching. The kids are realistic because they are imperfect. There is a glimpse at the possibility of romance, and there is a heck of a lot of redemption. Leveen is actually pretty genius for including so many different kinds of kids (who by the way, face exactly what normal teenagers face in high school).At first, I was going to talk about how fun the story was and how I love unique zombie novels, but then I saw the rating on popular pages like Goodreads and the reviews this book was receiving and felt myself getting angry. I agree that everyone has their own opinion and I DO respect those opinions, but this reminds me so much of what happened to September Girls by Bennett Madison that I decided to comment directly on the negative comments circulating about this novel.I’m not telling you to go out and buy this book and read it—all I’m asking is that you give it a glimpse yourself before basing your entire choice on whether you want to read this book or not by reading the reviews on pages like Goodreads. Sometimes the author’s intention for a novel is lost in the background noise of society’s obsession with calling everything or everyone a racist or a bigot. It’s like what happened to The Adventures of Huckleberry Finn by Mark Twain. Such a classic story had the “N” word in the text as a way of showcasing the racism of the time, yet instead of looking beyond that, people naturally assumed the worst and censored it. It’s scary to think that we live in a society where literature is either getting censored for something that adds to the story, or getting put aside because of a character’s characteristics that actually give the character a reason to better him/herself later on in the story. Might as well ban almost every book—since they all touch on the topic of race, sexuality, and abuse in one way or another.But I digress. I enjoyed Sick for what it was and while a couple of the characters’ actions and words were a bit shocking, it didn’t give me a reason to throw the book away with anger and misplaced self-entitlement. If you like young adult zombie stories full of imperfect characters who DO change as the story progresses, then check this one out."}, {"userName": "Melanie (TBR and Beyond)", "userReviewDate": "Jun 23, 2016", "userURL": "http://www.goodreads.com/user/show/47129377-melanie-tbr-and-beyond", "userReview": "\"The parking lot is a killing field.\"\n\nThis book is a mixed bag for me. While it was a fun read, I can't claim that it was anything special. There are minor spoilers in this review.Sick features a cast of highschoolers who are suddenly all getting \"sick.\" At first they think it's just a flu until their flesh start falling off and they go on a murderous rampage, eating everyone in sight. Our protagonist, Brian, is stuck at the school with his best friend Chad in the drama room with a bunch of other students. He's been separated from his sister and ex-girlfriend and he can't get ahold of either of them. This book is all about survival of the fittest and what you are willing to do to save the people you care about. I was so on-the-fence about what rating to give this. I don't know that it is a three star book, the writing isn't very good. It's quite clunky at parts and sometimes that was hard to ignore. I also had a horrible time liking the main character, to the point that I almost stopped reading the book in the first few chapters. I can't think of a character right now that annoyed me as much as this one did. I tried to cut him some slack because he was a 17 year old boy, but ugh. The fact that he had broken up with his long-time girlfriend because she had anxiety issues and \"wouldn't get over them\" just made for a very unsympathetic character. He kept mentioning that he broke up with her for her own good, so that she would start becoming more independent. I guess supporting her never crossed his mind. Jerk!The gore in this book is very graphic - we are talking body parts being chewed up and spit out, people being mowed down in lots of fun ways and blood, oh so much blood. If you are a gore fiend then you will certainly get your fill in this one. The action was pretty decent in the book, it really didn't drag and for the most part I enjoyed the read for what it was. There was one glaring issue with this book though that drove me MAD!The fact that Brian was risking everyone's life constantly to save just his sister and ex-girlfriend made no sense. Why would the group of kids care about them when I'm sure they had people they were worried about as well? I mean a lot of people died trying to get these people safe for Brian and they had no motivation to do so. I can understand that some might be brave but there is a difference between brave and stupid and too many of them were willing to sacrifice themselves for Brian's needs. Overall, I would say this is a fun read if you are into the horror genre and specifically zombies. It's not anything new but it's good way to kill a couple of hours."}, {"userName": "Karin", "userReviewDate": "Jun 21, 2013", "userURL": "http://www.goodreads.com/user/show/72729-karin", "userReview": "SICK by Tom Leveen This is a one-sitting read. SICK is fast paced and action packed. I LOVE Brian and his tough, mohawk wearing best friend, Chad. After a virus spreads through their town, they end up stuck in the theater department with a few of their classmates.  The main problem is staying away from the very violent killers outside of their portion of the school. The second problem is, Brian is separated from his younger sister and girlfriend, Laura. We see a TON of violence as Brian and Chad, along with the theater kids, fight their way through the zombies in their attempts to rescue the two girls and eventually escape the confines of the school grounds. (They are locked in with a HUGE metal fence) THIS IS NOT A TEST by Courtney Summers would be a good pairing with SICK. Both books involve a group of students trapped inside a school avoiding dangerous zombies and deciding whether or not to attempt escape."}, {"userName": "Zombieslayer/Alienhunter {Don't do school, and stay in drugs}", "userReviewDate": "Mar 28, 2016", "userURL": "http://www.goodreads.com/user/show/36608006-zombieslayer-alienhunter-don-t-do-school-and-stay-in-drugs", "userReview": "The fence around Phoenix Metro High is for the students' protection. But it also keeps them trapped-Unless you're in with Brian and his friends, who know how to break out better than anyone.November of senior year. No matter what Brian and his friends do now, what they do and who they are, here in high school, it won't matter six months from now. Six months from now they'll all be off- Brian at college, white trash punk rocker Chad in the Marines of all places.So none of this matters.Which is good.Because the sky is falling.\"What the snap crackle fuck are you talking about?\"Allow me to rephrase.The zombies are coming.Things have been weird ever since Brian Murphy and his friends ditched school this morning. A heavy, ominous haze has hung over the city, over their school, over them all day.They debate even going back. There's a stupid pep rally that'll keep everyone busy for a while, and they have stagecraft, muscle work that puts a drama credit on their transcripts. So they go.Things go along normally, Chad making not-quite racist and not-quite homophobic remarks concerning the drama rats, the drama rats willing to throw down, and Brian struggling to keep the peace, his mind on his mentally unstable ex-girlfriend, who seems to be improving, and might want to remove the 'ex' which marks the spot.Then Brian's friend Hollis tries to eat him.Through sparse conversations with his county M.E mother, Brian and his friends learn that a virus, somehow genetically related to arthritis, has been steadily spreading through Phoenix from the smaller town of Arroyo for a few days.The National Guard has been activated, and a state of emergency will in hopes be declared.Brian and his friends have to hold out.But tensions run high as cliques and groups clash, fights break out and the monsters grow closer.And hungrier.But they aren't monsters. No, they can't be. They're just...They're all just so sick.This is the third zombie book I've read this year.And this first one I've actually enjoyed.Volume three of Robert Kirkman's The Walking Dead and Walter Greatshell's Xombies left a bad taste in my mouth, so for the past few months I've been avoiding one of my favorite genres.Couldn't have picked a better one to jump back in with.I can't believe this is Tom Leveen's first horror book. It was fast-paced, with the whole book taking place within one school day, plus a few hours. It was even funny at points.And I, personally, think comic relief in horror is essential.I hate it when things are blurbed \"The Breakfast Club meets...\"I mean, come on. I know that's an iconic movie, but seriously, enough.This was not \"The Breakfast Club meets The Walking Dead.\"It was nothing meets nothing, because it was incredibly unique.The only thing I would dare compare Sick to is Stephen King's Cell. It remains my favorite zombie novel after all these slays, and Sick is the closest you can get to that level of awesome.What I really loved so much about Sick is that it doesn't try to guilt-trip you. These kids do not frakking care about the world outside, okay? They just want out. Like any of us would.They're not heroes and they're not (internet speak alert) BAMF, okay?They're scared kids.And sometimes being a senior in high school is the scariest thing you can imagine.I am 100% ready for more Tom Leveen. A fast, hard writing style that doesn't hit you over the head, if you know that I mean.Maybe someday I'll feel human."}, {"userName": "Charley Cook", "userReviewDate": "Aug 11, 2014", "userURL": "http://www.goodreads.com/user/show/4001587-charley-cook", "userReview": "When I started this book I was hoping for The Walking Dead meets The Breakfast Club but yeah, it definitely isn't that. Sure this book is good, it has unique 'zombies' (more like mutant monsters) and the action scenes are pretty damn gross and cool at the same time. Unfortunately I felt very little connection to the characters, Brain was an 'okay' commentator for the book and told the story nicely but I didn't feel like I really cared about what he cared about. His ex-girlfriend Laura has a severe panic attack disorder and at some points I wanted to smack Brian for his insensitive thoughts (maybe it just struck a nerve with me...)All in all it's a good zombie book but not for those who actually want to know a lot about the 'turn' or any major details. This whole book only spans a few hours and the characters know very little and never really learn very much at all. part of me was hoping this would be part of a series (rare for me to actually want that) because I wanted to see where this misfit group would go and what the hell caused this outbreak. So yeah, good, not great."}, {"userName": "Brandon Dupont", "userReviewDate": "Sep 11, 2013", "userURL": "http://www.goodreads.com/user/show/20720650-brandon-dupont", "userReview": "This book was amazing! :D I wish this was a trilogy!! I want to keep reading about these characters! I loved each and every one of them (except for John). This is why I don't like stand alone books. :'( I wanna revisit this world again (I don't like to re read books lol). The characters were great, the writing style was good. It was a very quick and fun read, everyone should pick it up. This book is not for kids under 14 because there is a excessive amount of swearing, and even some racist remarks. The writing style did have a couple of flaws though because sometimes it was hard to picture what was going on. Overall this book was fantastic and for this being Tom Leveen's first Sifi novel, it was a great start and I hope to see more Sifi books published by him. This book gets a 100% in my book, even though the writing style was a little off."}, {"userName": "Colleen", "userReviewDate": "Mar 13, 2015", "userURL": "http://www.goodreads.com/user/show/6838583-colleen", "userReview": "An awesome zombie novel, with a unique spin!!! I really like Leveen's approach to detailing the events that happen during an outbreak of an infection that turns people into zombies. The details of the infections: it's causes, affects, and how it is spread are also really well done and heighten the intensity of the novel. The setting is great and the characters are relatable-- especially as they deal with the moral dilemma of do you kill or immobilize your friends that have turned into monsters? All around a horrific (in a good way) read that is action packed the whole way and it also doesn't shy away from the terror of zombies!"}, {"userName": "Christal", "userReviewDate": "Dec 10, 2015", "userURL": "http://www.goodreads.com/user/show/36203686-christal", "userReview": "more like a 4.5"}, {"userName": "Ben Alderson", "userReviewDate": "Sep 21, 2013", "userURL": "http://www.goodreads.com/user/show/15850647-ben-alderson", "userReview": "HERE IS MY VIDEO REVIEWNO SPOILERS :)https://www.youtube.com/watch?v=Oactt..."}, {"userName": "Jodie \"Bookish\"  Cook", "userReviewDate": "Dec 29, 2016", "userURL": "http://www.goodreads.com/user/show/62766804-jodie-bookish-cook", "userReview": "Book ReviewTitle: SickAuthor: Tom LeveenGenre: Zombie/Horror/ApocalypticRating: *****Review: The first thing I noticed while flicking through this novel is that the whole story is told over the course of one day which I found really unique in other zombie novels I have read the story is set usually over weeks so to see a story that just deals with initial chaos which was a very unique setting and I haven’t read a lot of books like this. The opening chapter introduces us to the majority of the main characters, they are a rag-tag and slightly wayward group each with their own teenage problems and hopes with no idea that anything is amiss. Brian is a 50/50 character for me, initially he seemed like a good guy but at times he can come across as a little bit of an ass, especially when he talks about his ex-girlfriend and her anxiety problems – this was the reason he dumped her. In the second chapter the seeds of the outbreak are planted but we haven’t seen any of it yet except for some early stages of infection. So we are only 10% into this novel and the chaos is already unfolding especially in the hospitals and possibly the school too. I have to say I was a little skeptical about this novel as the zombie thing has been done so many times as it becomes very repetitive over time especially if you read a lot of this genre like I do, but I was pleasantly surprised with the layout and format of this novel.By the time the real chaos ensues at nearly 3pm there was an insane amount of build-up and subtle hints at what was to come and I was really excited for this book to move forward at a fairly rapid pace which is common in zombie novels. Within half an hour the entire school and possibly the country has gone to hell, literally, the infection is spreading like wildfire and everyone is in a complete state of shock and panic with no idea of what to do. At the 1/4 mark in the novel the plot seems to be following the generic plot of every zombie novel but it has a slightly different feel and by this I mean when I have read other zombie novels they are gory but you don’t quite get the scary vibes from them, this one you can literally feel the panic each and every character is experiencing, you feel ready to run yourself and the slightest sound. Within an hour of the chaos beginning a small group of students have managed to barricade themselves in a classroom away from the madness, but Brian is determined to find his sister, Mackenzie and his ex-girlfriend, Laura who were in the eye of the storm when it began.As we reach the half way point in the novel, Brian and a small group are leaving there haven to rescue Mackenzie from the library and possibly escape the school for good but a portion of their hope is dashed when Tara’s dad who could have accommodated more students is killed and the kids immediately begin to realize how dire the situation actually is and with no sign of help on the way and the entire city going to hell they are on their own and can’t rely on any backup to arrive in a desperate situation. After completing the insane rescue mission to rescue Mackenzie and Cammy where some of the group are lost, Brian beings planning to rescue Laura from a different part of the school where Mackenzie thinks she ran. I was also surprised that it is only about this point in the novel where the word zombie is starting to be used. One of the main objectives of the group is to get a gun stored in one of the boys (now deceased) car and to get out of the school, but Brian knowing this is taking place all over the city is beginning to question whether the city is any safer than the school. After surviving the rescue mission despite losing one person it also comes to light that Chad was bitten and is going to turn but Brian’s mother provides some ways of slowing down the infection.As we approach the 3/4 mark in the novel Brian comes up with a plan to allow them to escape the school and to find their loved ones but he refuses to do it without Laura who may or may not still be alive within the school. His plan includes sacrificing some of their group which now stands at over 20 but Chad’s truck can only hold 12 people at a push, this may seems cruel but given their situation it is absolutely vital as they can’t risk putting themselves into the firing line. I loved how even though Brian isn’t currently dating Laura he won’t leave her behind despite the fact he has a better chance of surviving if he did. But given the type of book this is I highly doubt the author is going to kill off the protagonist in the last section of the book. As the night draws in the group manage to find Laura but she doesn’t have her medication with her to help Chad and its beginning to look like Chad will be checking out very soon as his symptoms have been rapidly worsening but Brian is steadfast in his determination not to lose anymore friends and to get out of the school alive.The ending of this novel was amazing, when Brian thinks all hope is lost as he sacrificed his last chance at survival to save his sister, the police and his mother come to the rescue. While 90% of the school is being dealt with by the police there are small pockets of survivors like Brian’s group. Overall there was no rejoicing or celebrating but there was sad and sullen mood and as Brian puts it they feel like monsters for hurting and killing their friends and classmates and even though they survived they all feel like they lost a portion of their humanity which they will never recover. I really hope there will be a sequel to this book detailing what happened next whether they found a cure, did the epidemic gets worse and what happened to the characters. My favorite characters were Brian and Mackenzie and they propped each other up even when it felt like there was no more hope but they found it, I also felt that these two were the most developed characters in the whole book as they had the most backstory. I would highly recommend this book to everyone that likes zombie novels, survival novels or even just wants to try something a little different to what they normally read."}, {"userName": "Colin Hooley", "userReviewDate": "Feb 24, 2017", "userURL": "http://www.goodreads.com/user/show/60440159-colin-hooley", "userReview": "Sick by Tom Leveen is an action-packed zombie book centered on several mischievous high schoolers. Everything in the story seemed normal at first- the main characters cut class, the readers got a feel for rowdy high schooler's personalities, and the romance interests were introduced- and then the zombie apocalypse strikes. The contagious zombie disease spreads and eventually reaches the main character's high school. Among all the chaos and confusion, the unruly individuals fight for their lives, as well as their family and friends' lives. Although the whole zombie epidemic aspect was appealing, there were a few things that made it hard for me to read this book. One of these things were that the main characters weren't relatable at all. I get that they are rebellious, imperfect teenagers that despised going to school, but they were the kind of stereotypical misfits you would find in a cheesy movie your parents used to watch."}, {"userName": "Tara", "userReviewDate": "Nov 15, 2013", "userURL": "http://www.goodreads.com/user/show/7878772-tara", "userReview": "I received this book from RiffleYA in a giveaway. It was a free, uncorrected proof.I wouldn't call this a \"zombie\" book. They're zombie-like but they're not corpses that came back from the dead.The synopsis on Goodreads, I feel, does a disservice to the book, mainly the \"Breakfast Club meets The Walking Dead as a group of unlikely allies tries to survive a deadly outbreak.\" tidbit. I'm a fan of both The Walking Dead and Breakfast Club and both, I feel, are pretty hard standards to live up to. The Walking Dead is all about character development and does such an incredible job and has the luxury of taking place over months, letting the characters either prosper or spiral. Sick doesn't have the luxury of that much time nor are there any profound differences in a number of the characters. There are some distinct transitions for the characters, namely Chad and Laura, but apart from that, I don't think the few hours over which the story takes place allow enough time for significant developments. I can see the similarities in fighting off \"zombies\" though.I made more connections to The Breakfast Club. The non-sick few that Brian's stuck with are similar to The Breakfast Club because they're a bunch of different kids from different groups thrown together. There aren't any real clear stereotypes presented other than \"the drama kids\" in Sick but, through the characters actions, we get the idea that most of them aren't friends. Much of what I appreciated most about this book though was the way the kids came together at the end. They didn't pretend as though they were all best friends forever now, much like in The Breakfast Club, but they saw that they had more in common than they didn't. Brian especially got to see sides of his peers that he didn't know existed.Admittedly, I had to wrestle with myself to finish this book. Not because I didn't like it - once things started going insane, I had to finish - but because of the offensive things Chad said. I know people say things like that in real life because I've been right there during those moments, listening to the offensive things people say about/toward members of a different ethnic group/with a different skin color or different romantic interests, but it was equally hard to swallow while reading. This story takes place in Phoenix so it made me wonder if it's a particularly prevalent issue there or if Leveen was making a point or if the remarks were there to serve as a character arc for Chad. Whatever it was, it was still hard to accept.My favorite part of this entire book - other than beating up the \"zombies\" - was the idea behind their \"illness.\" People are infected in a stereotypical zombie-like fashion by being bitten but it's more of an illness than anything else. There's some actual science to it. Hating biology and all, I don't know how likely it is that something like this could happen but I bought it. i bought whatever sickness Leveen was selling and went with it. The presentation of the \"zombies\" was strange but realistic given my familiarity with other aspects of it, such as what arthritis does to a person, which was what I enjoyed. I'm a big fan of new/different takes on the same old story and Sick was a novel that did that. Leveen took a pop culture idea and spun it into a story that was action-packed, a little romantic, and almost apocalyptic. Which brings me to my next point, my absolute favorite aspect of this story was that there was no solution. I'm a fan of endings that leave things to the imagination and don't tie up loose ends and Sick did that. We're left with the idea that there could be a cure for the illness but we're also left unaware of the scale of the outbreak and what's going to happen now that Phoenix seems to be overrun with these zombie-like people."}, {"userName": "Suzanne", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/1581374-suzanne", "userReview": "(This is rounded up for the book's appeal to a certain kind of YA uber-reluctant reader .e-ARC provided for review purposes from NetGalley)I wanted to like Sick, wanted it to slake my zombie thirst, the survival genre hunger that many of us have rumbling in our guts, especially the last year or two. What do I feel like eating tonight? Putrid undead flesh and human resourcefulness fueled by unbridled fear. Sadly, Sick did not sit well with me.On an ordinary Tuesday in November, semi-slacker Brian and his blue-Mohawked, Marine-bound buddy Chad are skipping class to scrounge lunch, and they’re not that jazzed about making it back to school for a pep rally and their stagecraft class (Wait, football pep rally on a Tuesday? Attempt authenticity.) They run into Brian’s sister Kenzie and Laura, his ex; and both guys demonstrate low opinions of those not in their tribes: football players, a gay drama dude Travis, and the rest of the school at large. Their return to school after dining on frozen pizzas on Chad’s roof comes after a disturbing news report about attacks at area hospitals and a call from Brian’s doctor mother about her travel to a town with some violent incidents. These early scenes would ordinarily get me invested in the characters, but here Brian comes across as a slightly vanilla asshole, and Chad is a screaming asshole. Already I am weighing the gratuitous colorful epithets, like “cockgobbler” and “juicebox” against the merit of the novel and finding that it would have to be damn good for me to risk having it on my school library shelves. Is this a book I could champion if a parent decided to challenge it? Could I risk credibility with the teachers and parents who serve on my media committee as my selection oversight by saying we must provide access to this book at the secondary school? Over the course of the rest of the novel, I didn’t find enough to recommend it. If I were buying for a public library, I might get it as an adult book for less discerning or reluctant readers or teens with no parental blocks on their access, but it seems like asking for trouble in a place where access age goes as low as 13 and the book just isn’t very good. Where are the redeeming and worthwhile qualities that would make such casual obscenities just verisimilitude? Not there. I’ve worked with teenagers and in high schools for over 20 years, but these characters just seem like words on the page meant to conjure a print version of a poor movie.Brian and Chad get back to campus for last class just as the strange infection begins to race through Phoenix. They end up barricaded with various drama peeps in the theater areas and manage some dangerous forays to attempt to find and save Brian’s loved ones, often losing others in the process before a deus ex machina sort of ending brings at least a temporary resolution. Leveen attempts a variation on the standard zombie patter by having his infected getting an extreme sort of arthritis that’s very painful and causes them to stoop into what sounds like a hunchback posture, knuckles to toes. They also form some crystalline skin scales and have an unfortunate face-melt effect. They appear, from what Brian can observe, to seek the healthy marrow inside human bones for some reason; and their bites kill some and infect others. Seeming contradictions annoy me in their depiction. If they are hunched and brittle, can they race and rampage and throw themselves at the uninfected? Give me a zombie rationale that works better and a story that works better, and I will dine on brains, marrow, whatever, but here, I would rather go hungry."}, {"userName": "Melissa Wehunt", "userReviewDate": "Feb 11, 2014", "userURL": "http://www.goodreads.com/user/show/2285690-melissa-wehunt", "userReview": "Overall, I liked it. Not overwhelmingly so, but not too bad. Likes: 1. Zombies. Who doesn't like zombies? And these were fast, scary zombies. Even if the author has his characters hesistate to call them that, thats what they are. 2. Fast paced/Easy read. I couldn't read this in one sitting because I can never pull that off. But it wouldn't surprise me if many people could. And even though the story wasn't totally awesome, it was fast paced and interesting enough to keep me reading. And that says quite a lot in my book. 3. Realistic portrayal of characters. While I didn't overly care about our characters, I at least enjoyed the characters authenticity. The interaction between the teens and the language used by the author felt authentic and in its own way, a welcome reprieve from the usual \"i'm old and this is how i think kids talk\" books.. 4. Gore/Violence. I did not think this was overly violent. However, at the same time I was impressed that Leveen did not shy away from some use of gore and by deciding to end some of the key characters lives. That's not something you usually see in YA books. So I was impressed by that decision. 5. Discussion material? And while i hesistate to say this book makes a good discussion book because of the violence, the swearing, and the general horror fluff of it all...the author does manage to bring up several issues regarding humanity, murder vs. survival killing, and sacrifice for others. 6. Great for boys. This is told completely from the male, older teen perspective. Dislikes:1. Sickness/Curing the \"zombies.\" I didn't really think this was necessary. Other than to have a reason for the lead characters mother to be a part of the plot, I can't figure out why they kept thinking that it might be possible to find a cure. Or at the very least, I guess I just didn't care. 2. And this is a dumb complaint that goes hand in hand with complaint #1....the hesistancy to call them zombies. Even though I totally bought the teen characters, I have a hard time believing their first thoughts while watching their friend suck marrow out of bones wouldn't be, \"holy crap, zombies!\"3. Oh and the other complaint revolving around this is the insistance to only incapacitate the zombies rather than kill them. You know, cause they might find a cure. I dunno. While I respect Leveen for making us think about what makes us human, and what sickness is and all that jazz, it would have made for a better horror book to just have the kids realize they have to kill them to survive....at least faster/earlier than they did."}, {"userName": "Celine", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/3387843-celine", "userReview": "Action-packed and brutal, Sick is the archetype of young-adult zombie fiction with an intelligent background.What would you do when one of your schoolmates all of a sudden starts nomming your drama teacher? The world has turned upside down for Brian and his friends, when an infection gets on the loose inside their fenced-in school. It turns innocent drama geeks into hunched-over monsters with no concern for their own safety, and Brian is stuck in the middle, his sister and girlfriend on campus somewhere.When you've read one zombie book set in a high-school, you kind of know the drill. The kids can't rely on teachers (since they are usually the first to go down) and hole up somewhere, and eventually try to fight their way out, maybe trying to save some loved ones in the mean time. When the book is also suspenseful, you've got your standard zombie book. It takes originality and heart to make the book good, and Sick delivered that.Apart from the zombies in Mira Grant's Newsflesh series, I haven't come across a believable explanation for zombie-ism. Sick provides an interesting new angle - instead of zombies being the walking dead, they're humans in so much pain that they don't act as humans any more. Once the human is dead, the zombie won't get up. The monsters are still human, and I loved how Brian still sees them as human. It brought along a whole set of emotions for him; are you allowed to kill another human being to save your own life? This is usually glossed over in zombie fiction, where they see zombies as essentially dead humans, with no chance of rescuing them.Brian is of course part of the leaders of a small survivors pack. The power dynamics were quite realistic, but weren't much of interest to me. Neither was the discussion whether or not the army was coming. Everything from the extremely locked up school to that kind of political struggles are so thoroughly American and therefore alien to me that it kind of goes past me. My school had a gate that went to about your navel. It didn't have any security except for the school's assistants that also figured as concierge. There was no sneaking out, you just walked away if you wanted to skip class; the gates only closed at night. My personal experiences are so opposed from Brian's that the first few chapters didn't hook me.When disaster strikes though, I got engaged in the story of Brian looking for his sister and girlfriend. The book is the perfect length - long enough to get some feels in there, but short enough so the action isn't drawn out. Fans of zombie fiction will eat Sick up."}, {"userName": "Paul", "userReviewDate": "Oct 08, 2013", "userURL": "http://www.goodreads.com/user/show/4164688-paul", "userReview": "Zombies are one of my favourite monsters. There is just something so deliciously creepy about them, they properly freak me out. The best way I have found to combat this particular fear? Read as many zombie novels as I possibly can, I’ve opted for the kill or cure approach. I’m always on the lookout for a new interpretation of this particular mythology. Zombies in high school? Hell, why not.The cast of characters in Sick include your usual high school geeks and goofballs. Everyone from the cheerleaders to the drama club gets caught up in events.Brian is a typical high school kid. Most days when he wakes up, his biggest concerns are his relationship with his ex-girlfriend and figuring out the easiest way to cut classes. Today is different, by lunchtime everything will have changed. Large chunks of the student population are dead set on ripping their classmates apart. The rules have evolved overnight and Brian and his friends are fighting for their lives. Suddenly, it’s kill or be killed.Of all the kids it was Chad who turned out to be a particular favourite. He backs Brian, the main protagonist, to the hilt in every decision. Chad always goes the extra mile for his friends. It helps that Chad is a bit of a nutter as well, the perfect person to help lead the charge against the violent horde. I can entirely respect any character who chooses a blue Mohawk as his hairstyle of choice.We never really discover why the outbreak has occurred, but I don’t think this actually detracts from the story any. This is all about how people react. Who rises to the challenge and who isn’t prepared to face their fears.Ok, ok. I suppose strictly speaking this isn’t a zombie novel, your zombie purists probably certainly wouldn’t think so anyway. The monsters here are those who are infected, not dead, but I’ll be honest I’m not going to pick hairs. That same sense of claustrophobia that I’m always on the lookout for in zombie fiction is most definitely present; the feeling of impending doom that I relish. The entire book takes place over the space of just one day and this keeps the plot suitably tense. Things start nice and slowly but build to a delightfully dark conclusion.Sick isn’t a massive book, only a couple of hundred pages long, so this is the perfect introduction to horror/zombie fiction for any teen. I’d happily recommend this to any reader who enjoys a bit of quality zombie entertainment. When the inevitable zombie apocalypse does finally happen, it’s only a matter of time you know, reading this sort of book might just save your life. That, and a good pair of running shoes."}, {"userName": "Megan (The Book Babe)", "userReviewDate": "Sep 24, 2013", "userURL": "http://www.goodreads.com/user/show/5342034-megan-the-book-babe", "userReview": "Sick was kind of a weird read for me. I went into it expecting this awesome, kick-ass crew of people fighting terrifying zombies that are in lockdown with them. But I didn't really get that, to tell you the truth. While there was zombies, and there was a group of people fighting them, most of the story centers around Brian and his problems with that. I felt like Chad (my personal favorite) would have been a better main character, because he was enlisting, and it seemed like he was doing a lot of the planning/fighting. But since Brian was the main character, I'll talk about him. I didn't actually particularly care for him. He was so... indecisive. I felt like he didn't really know what he wanted, besides getting his sister safe. Which is a noble cause, yes. But once his sister was safe, it was his ex-girlfriend. It's like he didn't really care who got hurt trying to save \"his\" stuff. (Which it seems mean to call them stuff, but I'm just trying to make a generalization.) I tried to like Brian, but... I enjoyed his friend Chad so much more! He was sweet, and even if he was prone to being a total jerk sometimes, it's still obvious that he cares. And I love what they start calling him towards the end... \"Ten Ball\". Like a billiards (#10 is blue stripe) ball, because of his mohawk. <3Now, towards the end, all sorts of things started to get weird. I generally like zombie books (gross, rotting flesh eating monsters chasing people is so me), but... I felt like the zombies were kind of shallow-ish. Their part of the story wasn't as... filled out as I would have liked it to be. Not enough action or grotesque-ness, I guess. And to be honest, I never really understood where this \"plague\" came from. There was some kind of explanation, but I didn't really get it.This could have been a lot more dramatic, in my mind. And the ending.. don't even get me started. I thought that the ending would be the clincher-- the thing that solved all of my problems with this book... but it wasn't. All in all, Sick just wasn't the read that I hoped it would be. Chad was the absolute best part... and I can't talk about him right now."}, {"userName": "Julial", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/34560743-julial", "userReview": "In the novel Sick, the author Tom Leveen wants to show that in the face of danger sometimes one is more concerned about someone else, which may end up saving him as well. The reader can assume that Tom Leveen is someone who believes in putting other people before himself. In this book the protagonist is a boy named Brian, a senior at Phenix Metro High School. Brian and his friends are used to jumping the fence surrounding the school because they regularly ditch class, or go home for lunch. One day a dangerous plague spreads throughout the country and many of the kids are infected. To save themselves from the \"sick\" Brian, his friend Chris and the whole drama group barricade themselves inside the auditorium, but Brian's ex-girlfriend, who has major anxiety attacks, and his sister are hiding somewhere else on the campus. Brian is determined to save them, so he risks getting infected to go out and find them. This novel is told in third person limited, focusing on Brian's perspective, so the reader knows more about Brian and why he is risking his life for his friends and family. My favorite character is Chad; I admire his concern for Brian and his sister, who he has a crush on. When Brian and Chad wonder out of the safety of the auditorium in order to find Brian's ex-girlfriend, they encounter one of the \"sick\". In the process of getting away it leaps onto Chad and bites him. The infection is known to pass through saliva and blood, so Chad knows that he is going to change, but he doesn't know how long it will take. When the students come up with a plan to escape the school and climb over the fence, Chad helps fight off the \"sick\" that are trying to prevent their escape with no intention of escaping himself. I think I that this is very brave and shows loyalty to his friends when some people may loose hope and give up. Even though Chad knows that he has a very slim chance of surviving, he still helps his friends until his very last moment. For Chad his friends are like family, and family often chooses to save others rather than themselves because of the empathetic bond in relationships. Especially in this dire situation it is essential to work as a team and figure out a problem together.This book would be great for anyone who likes scary books!"}, {"userName": "Danielle", "userReviewDate": "Feb 17, 2014", "userURL": "http://www.goodreads.com/user/show/24502058-danielle", "userReview": "So disappointed.I was so excited for this book because apocalypse books are my favourite and it's Halloween time so I thought this would be perfect but nope. Not at all. I was wrong. A lot of the characters were so problematic for me and I felt like Brian the main character didn't exactly have your standard 'character development' because on one page he was like this badass, tough kid who didn't stick by the rules and then his personality kind of changed within a couple of pages and he was super caring and listened to everyone and wanted to save everyone's lives like make up your mind on how you want your character to be portrayed, PLEASE. I didn't hate any of the characters, in fact my favourite was probably Travis, he was pretty cool. I really wish, like 50% of this book had been done differently, it was pretty dull in the middle and I completely lost interest when they weren't doing anything. (Normally this is something I love in apocalypse books because it allows for character development and friendship bonding) I'm not sure whether it was just me being really tired but I found that I got super muddled when trying to figure out where in the school they were because nothing was described properly? Also, the ending fell totally flat for me, it was just kind of over and yeah there was a big last fight but wow it took like 5 pages and then it was all done and everyone was reunited, happily ever after I guess? Gah, I don't know, I really hoped for something more."}, {"userName": "Maddy Shornak", "userReviewDate": "May 02, 2014", "userURL": "http://www.goodreads.com/user/show/28242059-maddy-shornak", "userReview": "I think Sick by Tom Leveen is 3 stars. Personally I liked the book but I didn't love it. I thought it was a fun book to read I just thought it took a long time for problems to be solved and it was to spacey. Basically the book starts at a Middle School nicknamed PMS. The school has lots of security and fences due to previous security issues. A boy named Brian and his friends regularly skip school and hop the tall fences during lunch. Brian and his friends are trouble makers and they are not part of the cool crowd. A deadly virus breaks out that is caused by a bite from an infected person. When bitten you will get sick and start to glow like crystals. After a couple hours your back will start to bend and then you will turn into a monster that craves blood. Sick was really racist and there was a lot of qoutes that were prejudice and im not sure if some people would really be into it. For example one qoute says \"I didnt know a black kid could be pale, but Hollis is.\" This shows just one example how racist the book is. Personally it didn't bother me because i thought it went well with the context but for others i dont know how you would feel about Sick. Another quote says \"stupid Mexican kids!\" This is another example of racism. I personally do not mind the racism because I know it is just a book but for some viewers it may be too much to handle."}, {"userName": "Angie", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/4756329-angie", "userReview": "Imagine you go to a huge high school in Phoenix. Imagine this high school gets locked down everyday; it has a huge fence with spikes on the top and locked gates. Now imagine the zombie apocalypse starting during an assembly at this school. That is what happens in Sick. Brian and his friends are in the last period of the day when all hell breaks loose. Kids are sick; infected with something that turns them into zombies determined to suck your bones and eat your flesh. Brian and crew barricade themselves in the drama department, but he is determined to find his sister and girlfriend and get out of the school. There is nothing revolutionary about this take on the zombie apocalypse, but it was definitely a fun, exciting read. The zombies are a little different in that their skin crystallizes and they start walking on all fours. I thought the tension in the book was great, the horror was just right and the kids were all written perfectly. Everyone reacted differently to the circumstances and I thought everyone's reactions were justified. There were no weird revelations or stereotypes to deal with. This is just a straight up zombie book for teens and it is worth the read. I received a copy of this book from Netgalley."}], "description": "Breakfast Club meets The Walking Dead as a group of unlikely allies tries to survive a deadly outbreak.Brian and his friends are not part of the cool crowd. They’re the misfits and the troublemakers—the ones who jump their high school’s fence to skip class regularly. So when a deadly virus breaks out, they’re the only ones with a chance of surviving.The virus turns Brian’s classmates and teachers into bloodthirsty attackers who don’t die easily. The whole school goes on lockdown, but Brian and his best friend, Chad, are safe (and stuck) in the theater department—far from Brian’s sister, Kenzie, and his ex-girlfriend with a panic attack problem, Laura. Brian and Chad, along with some of the theater kids Brian had never given the time of day before, decide to find the girls and bring them to the safety of the theater. But it won’t be easy, and it will test everything they thought they knew about themselves and their classmates.", "title": "Sick", "url": "http://www.goodreads.com/book/show/17290253-sick", "average": 3.62, "cover": "https://images.gr-assets.com/books/1369870709l/17290253.jpg", "reviews": 247, "authors": [{"url": "https://www.goodreads.com/author/show/2843647.Tom_Leveen", "name": "Tom Leveen"}], "type": ["Horror", "Young Adult", "Horror"], "outlinks": ["http://www.goodreads.com/book/show/17290253-sick", "http://www.goodreads.com/book/show/20701982-sick", "http://www.goodreads.com/book/show/6251198-party", "http://www.goodreads.com/book/show/18629767-random", "http://www.goodreads.com/book/show/10869590-zero", "http://www.goodreads.com/book/show/23309575-shackled", "http://www.goodreads.com/book/show/15705311-manicpixiedreamgirl"]}