{"ratings": 461, "userreviews": [{"userName": "Michael Huang", "userReviewDate": "Mar 26, 2018", "userURL": "http://www.goodreads.com/user/show/11375563-michael-huang", "userReview": "This is really not a book as in edited monologue but a transcript of some sort based on two lectures Einstein gave."}, {"userName": "Mario García", "userReviewDate": "Feb 28, 2012", "userURL": "http://www.goodreads.com/user/show/5205758-mario-garc-a", "userReview": "An exceptional historic document composed of two distinct addresses by Albert Einstein.Firstly, recounting the stumbling of Physical Science from Newton's theory to his own: the intrinsic relation of matter and energy; and how the influence of problems derived from Hertz's investigations in electro-dynamics made this possible, thanks to Lorentz through Maxwell's equations. Secondly, the fundamental question for the character of Mathematics as a valid description of reality -particularly in the field of Geometry. Plus a beautiful explanation of what an infinite universe, that is, an unbounded sphere, means.Perhaps equally important, there remains the question of how physics experiments are tainted by wrong philosophical approaches -now, at a time in which Philosophy is unconsidered or relegated to the dark places of Theology.Accessible to anyone (as for the large part of Einstein's public work) this is a beautiful document and a personal recommendation for lunch time!"}, {"userName": "Derek Davis", "userReviewDate": "Nov 20, 2010", "userURL": "http://www.goodreads.com/user/show/1950709-derek-davis", "userReview": "If you want to know anything about the basics of relativity, Einstein's pretty much the only one to read. He brings an unusual and remarkable clarity to his own work without grandstanding.This short bit combines two lectures from the early 1920s answering some of the inherent queries on his recent work. The first deals with the idea of the \"ether\" which his work both discredited and, as he shows, retained in its essence. The second shows, remarkably, that you CAN envision a finite unbounded universe. The analogy he uses also hints at the holographic outlook on the universe that popped up some decades later. There was little that Einstein didn't presage in one way or another. There's also in quick side comment that indicates he was not so put off by quantum theory as is sometimes suggested."}, {"userName": "Squatting Erudite", "userReviewDate": "Nov 01, 2012", "userURL": "http://www.goodreads.com/user/show/5361322-squatting-erudite", "userReview": "Short but very interesting and surprisingly clear! It really brings out Einstein's ability to explain difficult concepts in a way which pretty much confirms one of his quotes:\"If you can't explain it to a six year old, you don't understand it yourself.\"(At least I think he really said it, you can never be sure these days.)"}, {"userName": "Arthur", "userReviewDate": "Sep 07, 2017", "userURL": "http://www.goodreads.com/user/show/735341-arthur", "userReview": "I explored this with the feelings that I am reading Albert Einstein's point of view. It holds true in being as concrete as much as his work bares to be. A masterful work translated here to help undestand what or why his belief in relativity is and written in a modernist simple terms using physics involved to greatly inform readers it's encompassing impact to the world as we know it."}, {"userName": "Grace", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/2254007-grace", "userReview": "Another audiobook listened to in the lab. It was like getting a lecture from Einstein himself, but read by someone else."}, {"userName": "BookDrunkard", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/4687484-bookdrunkard", "userReview": "The man was a genius and probably a bit insane, but this was an interesting read!"}, {"userName": "Jason Kirk", "userReviewDate": "Jan 16, 2013", "userURL": "http://www.goodreads.com/user/show/4641394-jason-kirk", "userReview": "Comprised of two lectures delivered at the University of Leyden (1920) and the Prussian Academy of Sciences (1921), \nSidelights on Relativity\n is probably best served to gluttons. (I count myself among them.) \"Ether and Relativity\" is his rebuttal of the idea of a universal \"ether\" through which things move, and \"Geometry and Experience\" applies the ideas of what was then the new geometry to the concept of a finite universe. Like I said...The are also a few more inclusively phrased nuggets of interest -- \"As far as the laws of mathematics refer to reality, they are not certain; as far as they are certain, they do not refer to reality,\" an idea being radically challenged these days by Max Tegmark and others -- but if you don't either make a living from or otherwise geek out on physics theory, you're more likely to have an inspiring time with Einstein's \nOut of My Later Years\n.(Quoted from \n#SmallBooksMonth\n)"}, {"userName": "Pam", "userReviewDate": "Jul 09, 2012", "userURL": "http://www.goodreads.com/user/show/3220056-pam", "userReview": "The essays were a bit hard to understand, especially the first one where Einstein talked about the idea of the \"luminiferous ether\" which is no longer accepted today. But I had read Carl Sagan's explanation of it (and of Maxwell's Electromagnetic Theory) in both Cosmos and The Demon-Haunted World, and that made understanding Einstein's essays easier for me -- though it certainly wasn't a walk in the park. The popularization of Science really goes a long way into making hard concepts easier to digest, and in a way more fun, for the general public. :)"}, {"userName": "Preston Lee", "userReviewDate": "Oct 26, 2010", "userURL": "http://www.goodreads.com/user/show/2671794-preston-lee", "userReview": "Fascinating lay explanations of Einstein's relativity theories from the man himself, including contextual (and competing) information relevant to the breakthroughs. No prerequisite mathematics knowledge needed, though comfort with basic kinetic Euclidian/Newtonian celestial motion (such as basic geometry and gravity) as well as abstract critical thinking skills are highly recommended.Overall: 4 of 5."}, {"userName": "M Pereira", "userReviewDate": "Jan 15, 2011", "userURL": "http://www.goodreads.com/user/show/2529578-m-pereira", "userReview": "This book is for anyone. This gives a nice context to Relativity, without actually explaining much about it, but by through two relevant stories (one about the theory of light and the other about the transition to non-euclidean geometries), Einstein, the man himself, gives an accessible potted scientific history of the past century and a half.Most recommended, I dont have a maths or science background and you don't need one for this book."}, {"userName": "Mark Kreider", "userReviewDate": "Sep 15, 2007", "userURL": "http://www.goodreads.com/user/show/113956-mark-kreider", "userReview": "A skinny little book containing a pair of lectures on, well, sidelights on Relativity. Interesting notes on the historical development of scientific theory and on visualizing non-Euclidean geometry in a meaningful way. When I first read it back in school, I found it to be a great appendix to our assigned readings. It is less valuable standing on it's own."}, {"userName": "Jesus Cruz", "userReviewDate": "Jul 16, 2015", "userURL": "http://www.goodreads.com/user/show/16343621-jesus-cruz", "userReview": "este libro que por primera vez entiendo completamente contiene dos presentaciones en universidades distintas de la visión de Einstein sobre lo que son los problemas teóricos y su hobbie, los problemas teóricos mentales, como llegó a la idea de la relatividad y lo que las matemáticas le aportaron a su pensamiento. Gran libro!"}, {"userName": "Arya Ptb", "userReviewDate": "Jul 21, 2013", "userURL": "http://www.goodreads.com/user/show/49466-arya-ptb", "userReview": "A great deal of its I didn't understand, not deep enough at least.I really loved his temper of mind, though. Despite of him being a \"natural scientist\", he sounds much more Platonic and aesthetically obsessed than most British philosophers do."}, {"userName": "Raul Carpio", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/22496941-raul-carpio", "userReview": "Interesante lectura pero no para los no iniciados."}, {"userName": "Ahlam", "userReviewDate": "Jun 09, 2015", "userURL": "http://www.goodreads.com/user/show/21843217-ahlam", "userReview": "A very concise document of two addresses by Einstein in the early 20th century. Fascinating and thought provoking!"}, {"userName": "Gary Patella", "userReviewDate": "Sep 27, 2012", "userURL": "http://www.goodreads.com/user/show/12269600-gary-patella", "userReview": "Sadly, this short book does nothing to really expand on Einstein's theory. It was more like a brief summary of Relativity rather than any independant sidelights."}, {"userName": "Shane Hall", "userReviewDate": "Jul 30, 2013", "userURL": "http://www.goodreads.com/user/show/22262554-shane-hall", "userReview": "A fascinating look into the thinking of a great mind in the midst of his time."}, {"userName": "Alejandro Sánchez", "userReviewDate": "Dec 31, 2014", "userURL": "http://www.goodreads.com/user/show/30719165-alejandro-s-nchez", "userReview": "I really liked it. I'm by no means a physics expert but Einstein's approachable style made it illuminating and entertaining."}, {"userName": "Simon Kao", "userReviewDate": "Dec 21, 2014", "userURL": "http://www.goodreads.com/user/show/35576711-simon-kao", "userReview": "A rather educational ride."}], "description": "In 1905, a German technical journal, Annalen der Physik, published a remarkable paper by a young clerk in the patent office at Berne, Switzerland. The clerk was Albert Einstein. The paper outlined his Special Theory of Relativity, a revolutionary physical theory which discarded the concept of absolute motion in favor of relative motion in the context of a four-dimensional continuum of space-time. It proved to be the most profound revolution in physics since Newton.About ten years later, building on his earlier work, Einstein formulated the General Theory of Relativity in which he offered a new solution to the great problem of gravitation, postulating the non-Euclidean character of the space-time continuum. Together, the two theories constituted a radically reoriented way of looking at the physical universe, an approach that solved many of the unresolved difficulties of classical mechanics and paved the way for great advances in 20th-century physics. This concise volume contains two addresses by Dr. Einstein outlining aspects of the theories. Ether and Relativity (1920), delivered at the University of Leyden, discusses the properties demanded of the ether of space by the theory of relativity. Geometry and Experience (1921), given at the Prussian Academy of Sciences, describes the limits within which the Euclidean or any other practical geometric system can be held to be approximately true in connection with the concept of a finite universe.Both lectures are reprinted here complete and unabridged; both express elegant ideas in simple prose devoid of complicated equations or abstruse terminology; both offer scientists and laypeople unparalleled insight into the seminal thinking of the 20th century's greatest physicist.", "title": "Sidelights on Relativity", "url": "http://www.goodreads.com/book/show/1000548.Sidelights_on_Relativity", "average": 4.14, "cover": "https://images.gr-assets.com/books/1328868740l/1000548.jpg", "reviews": 21, "authors": [{"url": "https://www.goodreads.com/author/show/9810.Albert_Einstein", "name": "Albert Einstein"}], "type": ["Science", "Science", "Nonfiction", "Writing", "Reference"], "outlinks": ["http://www.goodreads.com/book/show/1000548.Sidelights_on_Relativity", "http://www.goodreads.com/book/show/6584127-sidelights-on-relativity", "http://www.goodreads.com/book/show/15852.Relativity", "http://www.goodreads.com/book/show/231610.The_World_as_I_See_It", "http://www.goodreads.com/book/show/497195.Ideas_and_Opinions", "http://www.goodreads.com/book/show/867462.The_Evolution_of_Physics", "http://www.goodreads.com/book/show/571211.The_Meaning_of_Relativity"]}