{"ratings": 6980, "userreviews": [{"userName": "Florence (Lefty) MacIntosh", "userReviewDate": "Jul 11, 2013", "userURL": "http://www.goodreads.com/user/show/10856439-florence-lefty-macintosh", "userReview": "[ Turns out John's a jerk so her plans fall apart like a house of cards, and now I’m expected to sympathize. (hide spoiler)]"}, {"userName": "Sally", "userReviewDate": "Mar 12, 2010", "userURL": "http://www.goodreads.com/user/show/1577947-sally", "userReview": "I could not engage with this book. I found it trite and superficial. I hung in through the end, though, hoping it would redeem itself. It is the first book I have read by Alice Hoffman, and I don't feel inspired to pick up another, though I know I should probably consider it, as Hoffman comes up a lot on people's favorite author lists. From the beginning, I couldn't connect with Arlyn. Following the death of her father, she's devastated and on her own, and decides arbitrarily that she is going to fall in love with the first man who walks through the door. (Do women really do that?!) She seduces a man who appears on her doorstep hours later, he is \"lost\" -- they have a superficial affair, and yet she marries him and has two children with him -- no surprise that the marriage is a mess and a failure. Her son Sam has the potential to be interesting because he's an odd child who doesn't fit in -- but he just becomes a depressed, boring self-absorbed drug-addicted young man I don't care about. Arlyn dies of cancer following the birth of her daughter, and several years down the line in enters another lost character -- a young woman who is bright but disengaged with life because she hasn't fully dealt with a childhood tragedy -- who decides to become the nanny of Sam and his sister because she is intrigued by her visions of Arlyn's ghost haunting her husband.It's not that Hoffman's prose was lacking or I can't deal with serious, sober story lines or characters. But Skylight Confessions really fell flat. The magical elements seemed contrived, unable to revive the story. Fans of Alice Hoffman: recommend a book you think I'd have a better chance of liking, and I'll give her one more try."}, {"userName": "Deborah Edwards", "userReviewDate": "Dec 29, 2009", "userURL": "http://www.goodreads.com/user/show/1377720-deborah-edwards", "userReview": "(Please note: my rating is actually three and a half stars)Anyone who mistakenly thinks reading an Alice Hoffman novel will be a light and enjoyable bit of fluff, has obviously never read one. Even at her most buoyant and optimistic, Ms. Hoffman writes books that will haunt you forever. And \"Skylight Confessions\" (a truly awful title for a book that deserved better) is not a buoyant and optimistic book by any stretch of the imagination. It is a sad book full of damaged people living lives full of secrets and regrets. It is, at its core, a book about loss. A book, in fact, about death. Hoffman is clear about this; the novel starts with a funeral and ends with one. We lose several characters along the way. But, like so much of Hoffman's \"Yankee fantabulism,\" it is also a book filled with the magic of the inexplicable. Make no mistake, none of this magical fairy dust is going to save any of our characters, but without the quality of the unknown, the twists of fate that define a life, the strange turn of events that can rewrite a history, there is no Alice Hoffman novel to be had. You might as well read the newspaper. But \"magic\" is not the stuff of Harry Potter in a Hoffman novel, it can merely be the \"spell\" someone feels he is under when he behaves in an uncharacteristic way, or how a character may feel bewitched by a moment in time. Why did my car take a wrong turn and end up in this place that led to a marriage? Why was I looking out the window just in time to see an event that would change my life forever? The inexplicable \"what if's?\" haunt our characters and also Hoffman's readers, because how much of what qualifies as \"magic\" in the lives of these characters also qualifies as magic in our own lives, how much of it is fate, and how much of it simple free will? Hoffman likes to play with the concept of destiny. She likes us to consider if our actions are guided by destiny or simply our own, if events can have a synchronous manipulation or if they are merely coincidences or things we will into being through our own creations. Like most of her novels, this one has a ghost. You need not believe in ghosts to accept the presence of this one, because it could all have a perfectly terrestrial explanation. Couldn't it? Several of our characters are the victims of lore, tied to the one story their deceased mother told of a race of people who could sprout wings and fly at the moment of imminent disaster. Our characters also happen to live in a glass house. No, not a metaphorical glass house. A real one. And it all seems perfectly natural, since it was designed by the father of one character, a famous architect known for his fusion of glass and metal. Here, the world of dark fairy tales meets the real world. Some children make it out of the woods and some do not. Some princesses make it out of the glass house and others remain captive there. But the evil stepmother is sometimes kind, the prince is rarely charming, and the character who finally sprouts wings cannot really fly. Life is an inconsistent jumble of people who have good and bad in each of them, who are the pawns of fate but cannot be saved by it, who live and die not having achieved their happily ever after. You know. Like life."}, {"userName": "Lesley", "userReviewDate": "Mar 08, 2015", "userURL": "http://www.goodreads.com/user/show/3430178-lesley", "userReview": "all I can say is I am on an Alice Hoffman readathon!! This book was depressing and slow but brilliant and sad."}, {"userName": "Alayne Bushey", "userReviewDate": "Dec 10, 2010", "userURL": "http://www.goodreads.com/user/show/2889926-alayne-bushey", "userReview": "Every time I pick up an unread Hoffman novel I am amazed by her skill with the written word. The way she can form a sentence, twist it into something ethereal and beautiful, it always leaves me breathless. I always feel cleansed and well-read after a Hoffman novel, as though the books I finished leading up to her works were trivial and here is something of worth to spend my time on.Following four generations of the Moody family who live in the Glass Slipper in suburban Connecticut, Skylight Confessions begins with Arlyn Singer and John Moody as they meet under strange circumstances and form a bond that will affect their children and their grandchildren to come. Under the glass roof and clear walls of their house, secrets are kept and hidden. Mysterious occurrences are swept under the rug, and lives are forever changed by the decisions of others. Following the Moody children into their separate lives as they’re drawn back to the Glass Slipper, Hoffman tells a truly character driven story, so intent are we upon Arlyn and John, and the residents of the glass house that we easily forget there’s a world beyond them.Skylight Confessions contains the usual hint of magic that Hoffman is known for, but the writing is a little less sad than the previous works I’ve read by her. Or maybe I’m just accustomed to her tone now. The story of the Moody children is beautiful and touching, and in such a short book it’s amazing that we come to know them as well as we do.Another remarkable Hoffman with all my favorite trademarks, empathetic with a hint of magical realism. All in all, a fabulous book and another great addition to my library. Highly recommended to those who have not read an Alice Hoffman novel yet."}, {"userName": "Laurel-Rain", "userReviewDate": "Aug 09, 2008", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "The story begins with an introduction to the character Arlyn Singer, who at age seventeen has just lost her father. And as she stands on the porch after the funeral, gazing outward, she vows that the next person walking by will be \"the one.\"Then a stranger stops by, asking for directions, and they are drawn together. Even when circumstances appear to step in and interrupt what has begun, Arlyn persists. She follows John Moody, the architecture student, to his university and waits. Then she goes to his family home, The Glass Slipper, meets his parents, and makes their destiny happen.Years later, they are living in The Glass Slipper with their unusual son Sam. And they are miserable. But they persist (or at least Arlyn does) in the belief that they are living out their destiny.Each individual's destiny unfolds, including that of Sam, the brilliant explosive artist. Then comes little sister Blanca, the bookish \"good\" girl. Her destiny is to keep Sam out of trouble.When a tragic twist of fate takes them all off the course they had envisioned for themselves, their lives seem to spin off, flying into some other self-destructive pathway.Watching the devastation as it shimmers and spins, like a legacy of broken pieces or a mysterious puzzle—it is like watching some kind of train wreck.Much later, we see evidence of ghostlike visitors who leave behind broken glass, soot, and feathers.Hoffman weaves this family tale in and out through the generations, until finally we reach a kind of resolution.I was completely swept away by the plight of the characters—almost obsessed. And through it all, the imagery (glass house, broken glass, birds flapping) formed a haunting backdrop for lives gone awry.If I could, I would give \"Skylight Confessions\" a 6 or 7 star review."}, {"userName": "Mary", "userReviewDate": "May 05, 2014", "userURL": "http://www.goodreads.com/user/show/15849662-mary", "userReview": "Another heartbreakingly beautiful story from Alice Hoffman."}, {"userName": "Kristen", "userReviewDate": "Jan 29, 2011", "userURL": "http://www.goodreads.com/user/show/1000189-kristen", "userReview": "i liked this one but did not love it. i do consider myself a fan of alice hoffman, but this one just wasn't on the top of my list. i liked the first portion of the book, but then it just fell flat. i couldn't really relate to any of the characters. i loved sam's character initially but the teenage sam, i really didn't care for. he was just self absorbed & uninteresting, in my opinion. now that i think about it, i really didn't like ANY of the characters. cynthia was a bitch but hoffman tried to portray as caring as well. john moody was the distant father who still cared for his children but never showed it. meredith was a directionless grad student who happened upon the glass slipper (their house) and became part of the family as a nanny. i think the characters just felt forced. this was supposed to be a story of tragic loss and grief and how several generations of a family had to deal with that & it had potential but it just never really fleshed out. i think the other thing about this book that makes me just \"like\" it is the fact that i never got totally absorbed in this book while i was reading it. i read it but i never really *fell into* the story the way you do with a good book. all in all, an okay read - not my favorite. glad i got this one at the library. not the best alice hoffman, start with some of her older books!"}, {"userName": "Tamara", "userReviewDate": "Nov 27, 2010", "userURL": "http://www.goodreads.com/user/show/3665864-tamara", "userReview": "As an avid fan of Alice Hoffman and her \"magic realism\" I order her books hardcover I am so sure of their enjoyment. I know the prose will be a lyrical, colorful, elegant and memorizing while tackling dark issues. I know I will be utterly consumed and unable to read just a bit here and there. I know I will come away pondering and appreciating the read for all it's beauty and ugliness. \"Skylight Confessions\" did NOT let me down. Based on the premise of do we destine our fate or is it predestined for us, this story starts with Arlyn and John Moody and a marriage that both forced into being. From this union a prodigy of unhappiness, discontentment and violence explodes. Indeed dark subject matter, it is beautifully projected in what may be or not be. Are their specters? If so then is there presence to revenge or guide? Is there true evil? Are the sins of the father visited upon the sons or are the sons excused by the sin? Is destiny fated or do our decisions determine our future? Are we responsible for our actions or are we forced to play them out to their appointed destiny? I read this book in an evening and into the wee hours as I could not put it down. Hoffman's lyrical prose tenderizes the rough grist of a story told with raw realism as well as magical. Her conjectures open the mind of the reader to introspection without imposing her own dogma. A magnificent read that exercises mentally as well as entertains with liquid prose."}, {"userName": "Dina", "userReviewDate": "Jan 02, 2009", "userURL": "http://www.goodreads.com/user/show/108227-dina", "userReview": "This novel starts as an interesting story of a troubled Connecticut family. In a boring moment, it becomes a ghost story. The characters play only one note each, but there are enough of them to keep the story moving at first. When the ghost is doing something uninteresting single-mindedly, you recall that everyone here is single minded. The house of cards falls down, and the book goes on the \"I give up\" list.Is it just me, or is the physicist apparently unemployed _because_ all of his research is on ghosts getting stuck in time. Who would hire such a goofball?People who live in glass houses shouldn't throw stones. Novelists who refer to the large glass house inhabited by the family on almost every page maybe shouldn't throw stone metaphors in every chapter. Maybe it would get heavy-handed."}, {"userName": "Diane", "userReviewDate": "Sep 02, 2011", "userURL": "http://www.goodreads.com/user/show/3015634-diane", "userReview": "Either this is not one of Alice Hoffman's bests or I have just tired of Hoffman's flowery style and silly plots. The story of a woman who impulsively marries the wrong man, they have a child, she gets pregnant with another man, she dies, the husband has an affair with the neighbor while his wife is dying, needless to say, the two children are totally messed up. The problem is not only is the plot riduclous but I didn't like any of the characters, so their tragedies and tramas didn't evoke much sympathy. I only finished the book because I was desperate - away from home, visiting friends whose bookshelves were full of books I had read. This was the only one I could find that I hadn't read. I should have reread one of the others. Don't waste your time on this one."}, {"userName": "Ashlie", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/374491-ashlie", "userReview": "I used to say that Alice Hoffman was one of my favorite authors. \"Used to\" as in have always, ever since I first fell in love with the book \"Practical Magic,\" which is SO much better than the movie, which is really damn good it its own right, but for the record, only covers about 1/3 of the content of the book.Initially in my late teens I read her books with a voracious appetite, and regularly recommend her to others.  There are elements of magical realism present, be it ghosts, or people with powers, or just mysterious elements that go unexplained. She writes well, tells stories of whole and flawed characters, love gained, love lost, and pain. Sometimes triumph over said pain, but sometimes only time to heal the wounds, if at all. This book is no different, but somehow it fell flat for me.Arlyn has just suffered the loss of her father, her whole world, and a wayward traveler finds his way at her door. She, by way of decision or destiny, falls in love with this stranger and thus her life is set, as is the stranger. They are reserved and resolute to their circumstance of being with each other, for better or worse, aaaaand it mostly seems to be worse. Rather than find this story of generations and a fragmented family engaging, I spent most of the time just annoyed that people were clearly unhappy, but reluctant to put a name to it and try anything different. I feel like Alice is still the same, though saying \"still\" seems funny as this book was written in 2008; somehow I missed it in my initial dive into her work. But, alas, I just think that maybe the stories aren't what I have a hankering for any longer. I still will recommend her and like her as an author, but I believe I have moved on to other literary tastes."}, {"userName": "Peg", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/3619122-peg", "userReview": "The title comes from the spectacular glass house which is almost like a separate character with a pull on its occupants. I think of this novel as a fairy-tale for adults. It even has the evil stepmother in its cast of characters! It's about family relationships through three generations. There is plenty of grief and many heartbreaking scenes. The characters are well-developed as we read about life's complications as family members try to connect.It held my interest throughout even though it was a downer at times. Reading about a teenage boy's addiction to drugs made me so sad. Alice Hoffman has a way of magically pulling you in and making you become intrigued with her characters even when you don't particularly like them. It's evident that Ms. Hoffman is a distinguished writer and I plan to read more of her work."}, {"userName": "*The Angry Reader*", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/840454-the-angry-reader", "userReview": "First and foremost, ignore that stupid title. Second, I have earned a few happy books, and I plan on indulging. Holy crap. This book was bleak. Filled with that pervasive New England moroseness - death so matter of fact. Stiff upper lip and whatnot. I'm reeling from reading this thing. Plot - Arlyn thinks her marriage is fated, and then it turns into a disappointment and awfulness happens to pretty much every character. It wasn't a teary-book. I didn't get attached to the characters. But I do feel like I want to lie here and stare at my ceiling and contemplate everything. My angsty 15-year-old self has emerged for a visit. I think it may take me some time to shake this one. It was like less awesome Steinbeck. A pervading sense of fatality that's left me a little adrift. Time to move on to something cheerful...or maybe just go to bed."}, {"userName": "Britni", "userReviewDate": "Jun 18, 2011", "userURL": "http://www.goodreads.com/user/show/389139-britni", "userReview": "Skylight Confessions by Alice Hoffman is the first book I've ever picked up based on an author's recommendation. During her Literary Salon Series interview Jodi Picoult mentioned that one of her favorite authors ever is Alice Hoffman so I of course jumped on Paperbackswap.com and immediately ordered one of Hoffman's books that sounded interesting. I was wrong.The basis synopsis of the book from the back cover is three generations of a family haunted by love, although now that I think about it I really don't know which three generations those were - John's parents, John and Arlyn/Cynthia, Sam and Amy, or Will? Maybe that's why I just didn't get the book. I really can't give you much more about the book than it's about an extremely dysfunctional family trying to figure out why they are so dysfunctional. But I could tell you. It's the:Mom that thinks people have wings and can fly away at any timeSon that is high throughout the book and draws scary images (think the possessed artist in Heroes)Dad who is not around, cheats on his wife, and is haunted by his wife after she diesNanny who sees said wife haunting dad and decides she can and should save druggie sonI know there is a lot more to the book and I'm sure I'm missing the profound meaning and incredible writing, but I just didn't get it. Or to be more clear, I just didn't like it. I'm not a big fan of novels like this that are based more in fantasy than real life (or maybe real life from the perspective of someone high on heroine) and I just couldn't relate.I'm sure there are a ton of people out there that love Alice Hoffman, including Jodi Picoult, but I just couldn't wrap my head around this one and it definitely did not make me immediately order another one of her books right away. I will give her three stars though because the way the story all tied together was intriguing and yes, I'll admit the writing was good."}, {"userName": "Lisa", "userReviewDate": "Oct 29, 2007", "userURL": "http://www.goodreads.com/user/show/568109-lisa", "userReview": "This book is a venture into a fairy tale where it might be possible to fly away from life if it is damaged like this book's mythical people who can fly. Like in fairy tales however, this whimsical tale hides ugly realities such as dsysfuctional families, drug use etc.Many methaphors hide in the pages such as the use of a glass house. Something about people who live in glass houses echos as you read it.At the same time you know that glass is transparent, you can see all the stuff that builds up. Glass like people is a fragile thing, you have to constantly give attention to its care or it becomes damaged, dirty and you can see all imperfections in it.My favorite part of the book is how it asks the question: is there one event that affects all other events that will happen from that moment on? The whole \"Path not taken\" question of existance. Arlyn's definition of the future, \"People often disappear right into it and all anyone could do was hope for the best\" is a thought that I have wished I could put words to for some time. If you take a wrong path then is it possible to shift too far off a path and you are somewhere that you can never get back from, can never find true happiness again?You can ask yourself countless questions while reading this book or you can just read it for its tale. Either way the characters stay with you far longer than the time it takes to read the words. This is, to me, the mark of a great book. People like Blanca in \"Skylight Confessions\" use books for more than just a passtime. Sometimes they become a \"buffer between the real and imagined world\". The theme of books as a shelter, and escape is a well used idea in fiction."}, {"userName": "Machel", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/3820228-machel", "userReview": "Why I am reading Alice Hoffman right now after experiencing tragic losses of two dear friends last year under the age of 40, I don't know. Do we find the book we are meant to read at the certain time? Are there signs given to us from our subconcious or could it be God leading us to a lesson that will help us heal when we read inside the pages of a book? I think these things at the end of a novel like this. I think and ponder why, just like all of Alice Hoffman's characters did in \"Skylight Confessions.\" I feel sucked into the beauty of her prose, her words, her dark voyager side of life that lifts up the rocks and looks beneath them to find what's hidden underneath. Alice Hoffman writes like that. She conjures up the intense magical side of this world that many are too afraid to examine. They would rather look away. I can be like this, too. Nothing wrong with wanting pink champagne and bubbles, frills and without heartache. However, AH, her storytelling abilities delicately weave in a thin veil of hope at the very end of each novel. If you can recognize it as a reader, you are left with a sense of reprieve, like the sunlight will come and the characters will feel the light shining in their souls again. I like that she does not tie up the story nice and neatly because ...After pain, after loss, after the tears, and the missing ache of losing those you love, there will come a moment of silence when peace will find you in your sorrow, and the a new day will begin again, just like in an Alice HOffman novel.***2013 just getting ready to read story sisters."}, {"userName": "Cheryl", "userReviewDate": "Nov 21, 2012", "userURL": "http://www.goodreads.com/user/show/11255849-cheryl", "userReview": "Whenever I need a moment to leave the real world and enter the magical, I go to authors like Alice Hoffman and Kate Morton. Once again, Hoffman does not disappoint. This is a book that is as real as it is magical. Starting with a young girl whose sick father has just died so she tells herself that the next man who walks down her street will become her husband, the book will have you bemused and electrified. It is an American fairy tale based on reality and set in Connecticut. The fabulous house: the Glass Slipper. The rich suburban couple. The dysfuntional family. The mystery that stars with the red-haired mother, Arlyn (my favorite character). Her mysterious and melancholic son, Sam. Her daughter, Bee (or Blanca) my second favorite character. The father, John Moody--how appropriate of a name because John was indeed moody. What happens when your true love was right before your eyes and you never saw or appreciated her all along? Alice Hoffman said that she writes from \"a subconscious place, it's almost like the elements of a dream.\" That's exactly how I feel when I read her books and though I didn't like this one as much as I did The Dovekeepers, I like how she never fails to take me away."}, {"userName": "Kelly Ballard", "userReviewDate": "Jun 25, 2009", "userURL": "http://www.goodreads.com/user/show/2053965-kelly-ballard", "userReview": "Hoffman again creates moving, real characters engaged in the messy business of life. The book revolves around the Moody family and of course, the name fits. This is an unhealthy, struggling family – secrets, affairs and drugs abound, but also truth. What happens when fathers ignore their children? Is this a choice or is it a left over wound? Born of your own longing for a life not lived…And better yet, where is grace found? Can the unforgivable find forgiveness? As always, yes, grace can find you in the strangest of places. Be fairly warned though, I would not read this book if you are looking for something “happy, feel-good.” However, the characters and the rawness of their experience stay with you in a good way. In my own life, it has taken me years to discover – in every experience - I can only see in-part. It takes many different voices to see all and even then it may take years. For peace is only found when you choose to be peaceful. It’s an annoying truth that you and only you, can transform your life from one of pain to peace. It sounds almost too easy, possibly condescending, but blaming your past for where you are today only binds you to a broken place that could be, if you choose, to be left behind."}, {"userName": "Alison", "userReviewDate": "Nov 18, 2010", "userURL": "http://www.goodreads.com/user/show/2049804-alison", "userReview": "A really good book from an author I am never disappointed by. The book is divided into three parts, no chapters. I have to admit that after the first part, I was a little down. It was just a lot of sadness, maybe a little overboard. But the second and third parts were a little more uplifting, in my opinion. I wasn't crazy about the ending. I felt like she ended the other two parts naturally, and I would have been happy with that in the third part. But she kind of left it awkwardly hanging: \"...she waited for whatever would happen next.\" I didn't really like that line.That said, the characters are really fabulous. Sometimes she sinks into narration and there are just pages without dialogue, which I normally don't like, but I found her narration in this book extremely well done. Everything was smooth and natural. You might not love all the characters (I don't think you are meant to) but they are all bright and sharp in their own ways. I especially loved Meredith - even when she didn't know herself, she was a really amazing person. A person with an amazing heart that you hope exists, but you aren't really sure.Look forward to reading more."}, {"userName": "Margaret", "userReviewDate": "Aug 14, 2013", "userURL": "http://www.goodreads.com/user/show/22899077-margaret", "userReview": "Alone in the world after the death of her father, Arlyn makes a promise to herself – the first man to walk down the street will be the love of her life! That man is John Moody, a student of architecture, who does not wish to get seriously involved with anyone, but seems to be unable to resist the charms and persistence of the freckled red hair girl. Arlyn and John finally get married and move into an original glass house. But life as a family is not easy and tragedy seems to be looming above the glass roof…This is a tear jerking story which I read in one afternoon for I just couldn´t put the book down! Although all the characters have their flaws and do some terrible stuff, you feel their pain so vividly that your heart seems to crack - why is life so unfair? Why do we only value things after we lose them? Why do people choose a path of self-destruction? Alice Hoffman has the true ability to weave a story which captures your heart, without being to “mellow”. It is hard to define; the characters just seem to haunt you after the end of the story. Very, very good!"}, {"userName": "Julie", "userReviewDate": "Nov 04, 2012", "userURL": "http://www.goodreads.com/user/show/1307115-julie", "userReview": "When I was younger I loved Alice Hoffman. I loved that characters felt things so intensely that they literally burst into flames. Now that I'm older and less inclined to start on fire, I moved away from magical realism. I was prompted to read this one for a book club which was ironic because I've been plodding through her newer book The Dovekeepers for a different book club so I am drenched in this author after a long hiatus. It's not the same. Skylight Confessions is a strong story and the complex characters propel it along through multi generations of people who make poor decisions when they are feeling lost. Arlyn and John Moody fall together during a lost state. Arlyn wants to make it work and John doesn't try. The ensuing dysfunction results in achingly destroyed kids and miserable adults. It gets 2 stars from me because I didn't care about any character and even though I know there are families that are that sick, the story leaps and character connections felt unrealistic. Kind o messy book."}, {"userName": "Amber Stosz", "userReviewDate": "Aug 04, 2013", "userURL": "http://www.goodreads.com/user/show/2539395-amber-stosz", "userReview": "Well I cried twice within the first ninety pages of the book, So I expected to love this book. And though I love her prose as always, this book I found frustrating as well. I just wanted to tell the characters to move on with their lives. To pin your ultimate happiness on another human being is useless and utterly disastrous. I also had a hard time with her characters stance on addiction which is a whole other topic of discussion... let's just say I side with the father... there is only so much one can do for an individual after that its up to ourselves to make our lives or break them as it were. SO I guess I was a opposed to the sentiment behind the whole book...I read the book in one weekend... would of finished it in one night had I not started it at ten thirty. Anyway if you are into Hoffman and into sad love stories with a dash of questioning destiny and spirit haunting then this is the book for you."}, {"userName": "Sharon Huether", "userReviewDate": "Mar 24, 2014", "userURL": "http://www.goodreads.com/user/show/3534528-sharon-huether", "userReview": "Skylight Confessions.By Alice Hoffman.. A family lived in a glass house where there was little love. The young son became uncontrollable after his mothers death. He was so angry and tormemted with grief, he turned to drugs. A nanny asked to help, she also saw the ghost. She almost but couldn't quite reach the son. The baby sister to young to remember her mother. The father showed no love or attention to his son. The father was haunted by the ghost of his dead wife, seeing her everywhere. He married the lady next door, which didn't help matters. There were always fights and disagreements between her and his children. It was a sad story, but you didn't mind it, because it was so well written."}, {"userName": "Emily", "userReviewDate": "Jul 30, 2009", "userURL": "http://www.goodreads.com/user/show/237216-emily", "userReview": "Maybe I need to go on an Alice Hoffman diet, just like, not read her for a while, because I start to feel like. . .I don't know - the husbands will be bastards, the women will realize it at some point and something magical will happen. HOWEVER, that said, this one was pretty surprising. It did all of those things, sure - but the set up was different. And the magic was pretty ordinary. And then some very unpredictable stuff happened. I thought the book was going one place and then it took a crazy left turn, and then a crazy right, until I just had no idea what was going to happen next. That's kind of hard to do. So my hat's off to Ms. Hoffman, who of course, I love. This one just ain't at the top of the list somehow. All those crazy turns left me a little dizzy and also sad."}, {"userName": "Maria", "userReviewDate": "Apr 24, 2011", "userURL": "http://www.goodreads.com/user/show/2262926-maria", "userReview": "I believe Alice Hoffman is officially my new favourite writer. There's something about the way she writes... the relationship she establishes with the words she uses... I think it's brilliant and it makes it so easy to feel the mood of the book, to get into it, to breathe through its characters!I love how this book is divided and how the parts work together. They complete each other so perfectly. It's beautiful. The story and the way it is told is incredible. Makes you think, makes you dream, makes you see everything so well... makes everything so touchable. These characters become your family during this book and you feel their pain in your bones. It's amazing to watch and walk with them, from the darkness to the light, and beyond. Memories.Absolutely in love."}, {"userName": "Bob Walenski", "userReviewDate": "Oct 19, 2015", "userURL": "http://www.goodreads.com/user/show/12407639-bob-walenski", "userReview": "I read 4 books this week on vacation, 2 were amazng and 2 others slightly less so. This was the best of the best 2 and one of m,y favs ever.I've just been introduced to Alice Hoffman as a writer, what little I knew about her was wrong. I FOUND THIS AS A USED HARDBACK COPY, signed by the author in the sale rack at a New Hampshire bookstore. What Luck!!!!!The story is compelling, interesting, believable and poignant. The writing totally magnificent. Wonderful character development and a story that encompasses 3 generations of a family who have all the beauty, strength and weakness of all humans. Peotically woven like a tapestry, Hoffman takes you on ride that is so absorbing I couldn't put this down. OMG I loved this book!"}, {"userName": "Rebecca", "userReviewDate": "Sep 29, 2007", "userURL": "http://www.goodreads.com/user/show/317383-rebecca", "userReview": "Hoffman's last few books haven't piqued my interest- I found myself reading them reluctantly. But this one proves she's back on her game again! The novel delves into the darker sides of families- it looks at addictions, death and affairs. All of these themes are tied together with Hoffman's famous mystical elements. The most heartbreaking character by far is Sam- a young man dealing with heroin addiction and obsessed with the stories his mother told him about a rare group of people from Conneticut that can fly. The jacket of the book promises \"you will never look at families the same way again\" and I'm somewhat inclined to agree. You will find elements of your own family in this book. It's wonderful."}, {"userName": "Omaira", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/31468262-omaira", "userReview": "\"Aunque al principio no lo parezca, es una historia con una parte dramática muy importante que no dejará indiferente al lector. A lo largo de todo el relato se conocerá la evolución de la vida de diversos personajes y la importancia tan grande que las decisiones y los remordimientos pueden tener\"Reseña completa: http://entrelalecturayelcine.blogspot..."}, {"userName": "Linda Lipko", "userReviewDate": "Feb 23, 2012", "userURL": "http://www.goodreads.com/user/show/1544522-linda-lipko", "userReview": "I've read all of Alice Hoffman's books. This is one of the finest. It is a hauntingly moving story of a dysfunctional family unit at its best...and worst.Alice Hoffman is the master of character protrayal and writes with an in-depth, moving way about the threads that hold us together and then frustratingly become unraveled along the journey of life.This is not a happy, feel good book. It is however, worth the read."}], "description": "Writing at the height of her powers, Alice Hoffman conjures three generations of a family haunted by love.Cool, practical, and deliberate, John is dreamy Arlyn's polar opposite. Yet the two are drawn powerfully together even when it is clear they are bound to bring each other grief. Their difficult marriage leads them and their children to a house made of glass in the Connecticut countryside, to the avenues of Manhattan, and to the blue waters of Long Island Sound. Glass breaks, love hurts, and families make their own rules. Ultimately, it falls to their grandson, Will, to solve the emotional puzzle of his family and of his own identity.", "title": "Skylight Confessions", "url": "http://www.goodreads.com/book/show/22889.Skylight_Confessions", "average": 3.62, "cover": "https://images.gr-assets.com/books/1464252640l/22889.jpg", "reviews": 835, "authors": [{"url": "https://www.goodreads.com/author/show/3502.Alice_Hoffman", "name": "Alice Hoffman"}], "type": ["Fiction", "Magical Realism", "Contemporary", "Fantasy"], "outlinks": ["http://www.goodreads.com/book/show/22889.Skylight_Confessions", "http://www.goodreads.com/book/show/2073654.Skylight_Confessions", "http://www.goodreads.com/book/show/899211.Skylight_Confessions", "http://www.goodreads.com/book/show/10238818-skylight-confessions", "http://www.goodreads.com/book/show/1081181.Skylight_Confessions", "http://www.goodreads.com/book/show/899197.Skylight_Confessions", "http://www.goodreads.com/book/show/10868078-confesiones-bajo-el-cielo", "http://www.goodreads.com/book/show/10950924-the-dovekeepers", "http://www.goodreads.com/book/show/22896.Practical_Magic", "http://www.goodreads.com/book/show/5159.Here_on_Earth", "http://www.goodreads.com/book/show/23492741-the-marriage-of-opposites", "http://www.goodreads.com/book/show/18144053-the-museum-of-extraordinary-things", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}