{"ratings": 109, "userreviews": [{"userName": "Janice Garey", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/7160841-janice-garey", "userReview": "Review Title: True Freedom Rallies Compassion (review of Slave Again by Alana Terry)Reviewer: Janice S. Garey*****5 StarsThis is another wonderful tragedy (redeemed by God) tale from the talented story weaver, Alana Terry. If you read the first book in the series, Beloved Daughter, you will not be disappointed in this book. You do not need to read the first to get the full impact of this book. It is a stand alone as well as an enhancement to the first book.The book has heroes and victims, those who rise above and those who fall to the curses of the environment in which they exist.The innocence of children is clearly depicted as stolen away by slavery within the sex-traffiking industry or through the captivity for use by a dictatorship's military service. It was interesting to see the various forms of slavery contrasted and showing the results were similar in the ways they damaged the individuals caught up in such misuse of human potential.The danger involved in the rescue of the ones caught up in slavery requires special types of individuals. The burden of wanting a better life for the many involved against their will is tenderly portrayed. Another contrast is made between Christians from a western culture perspective and those who have grown up in great poverty void of religious training. The priorities of the two groups could not seem farther apart. Yet faith in Jesus and the forgiveness He makes possible is shown to overcome obstacles in cultural and economic realms. Transformation takes place over a long time frame like one grain of sand at a time moving through an hourglass. Change is hardly perceptive yet it eventually occurs. This made the book very realistic to me.This book is very beneficial for those who wish to in some way help the plights of those caught up in modern day slavery whether through financial or personal time commitment. You will view how the tragedy is turned for good by our loving God who knows that those who suffer will ultimately desire to help others who suffer similarily to themselves.I received this book from the author with a promise that I would read and review it. I was under no obligation to do a positive review. I have given my honest review of this book."}, {"userName": "Reet Champion", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/23889801-reet-champion", "userReview": "Mee-Kyong has done a lot of things in her life and to be honest she doesn't really regret too much of it. Growing up in a North Korean camp didn't exactly offer her a promising future and what she has done got her as far this. But resorting to murder? Well that's a different story entirely. As she flees to freedom - or what she had hoped would result in freedom - guilt wracks her mind as she struggles to push it away. Extra work in the field of survival comes when she meets a girl whose childhood has ended far too soon. Can the pair make it just a little bit longer in order to reach true freedom?As action-packed and riveting as \nThe Beloved Daughter\n, fans of Alana Terry's talent with the pen will not be disappointed with the second installment of an exceptional series. Though, be warned, this is a not a tale for the lighthearted. It's gritty and at times a little tough to read as Alana examines the different forms of slavery. I was surprised by the different turns the story took as well as the ending. The ending alone wishes that I already had the third book in my hands and flipping through to find who makes their peace and who doesn't. Another job well done.DISCLAIMER: In accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising” we would like to note that we received an electronic copy of “Slave Again” from the author in a giveaway.reetchampionbookreviews.wordpress.com"}, {"userName": "Jasmine", "userReviewDate": "Nov 01, 2015", "userURL": "http://www.goodreads.com/user/show/14933619-jasmine", "userReview": "An emotionally moving story, Slave Again is almost hard to listen to at times. It has its rather dark moments but it is ultimately a story of faith and hope.Mee-Kyong lives a life so far removed from my own that sometimes it's hard to imagine and I kept turning the next page and the next. The choices she must make are beyond impossible and not only does she survive day after day but a tiny seed of compassion is kept alive. That tiny seed just might grow into something amazing.\nAlana Terry\n has once again penned a story that transports readers and listeners to a land some might say has been forgotten by God, and yet it is so apparent that He is constantly moving in the lives of it's inhabitants.I actually read Slave Again about a year ago but jumped at the chance to hear the words and characters come to life. The Audible audiobook was excellent! \nAlana Terry's\n great writing is highlighted by the narrator's voice. The spacing between chapters and scenes is very good, easy to follow. I even found myself slipping my Kindle and speaker into my bag wherever I went so that I could listen.I would note that the book does deal with mature and tense situations so this would probably be a better novel for much older kids and adults. It is, however, not a story to be missed.(I received a copy of this audiobook from the author in exchange for my honest review. All opinions are entirely my own.)"}, {"userName": "Lou", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/19770032-lou", "userReview": "I have read \n and I felt a little bit sad about the ending. This one had a better ending but I feel that I need another book...WHERE'S THE NEXT BOOK??The story is touching and very very emotional -even in the violent parts- It´s impossible to read this book and not be moved by the hard life that lead some people. Read reminds us that we must act and do something for this people.The characters are strong and each of them are well defined. The whole story is addictive and makes you want more and more.I had been waiting for Chung Cha's appearing but nothing happened... Despite of that, I really loved this story.I think that I have to add to Alana Terry to my list of favorite authors.Thanks to the author for providing this copy . This fact did not influence the review."}, {"userName": "Wall-to-wall books - wendy", "userReviewDate": "Nov 10, 2014", "userURL": "http://www.goodreads.com/user/show/2281076-wall-to-wall-books---wendy", "userReview": "Wow, just wow! This is a very powerful story. If you judge a book by how many tears you shed for the characters this would rate a 100. I was bawling by the end of this book and had to stop several times to wipe my face of tears. I love a story that holds so much emotion that it will do that to me. This is definitely a book that will stay with me a long time. This story will keep you on the edge of your seat wondering what will become of the characters. And - there is a little twist at the end which I loved! Of course its what put me into a fit of tears, but I loved it.This is a follow up book to Beloved Daughter, but to be honest it totally can be read as a stand alone. But I do recommend you also read Beloved Daughter just because it is also so good!Alan Terry has proven to be a very good author indeed.I am really looking forward to her next book - Torn AsunderThank you Alana for sending me this e-book for my honest review!"}, {"userName": "Staci", "userReviewDate": "Mar 26, 2015", "userURL": "http://www.goodreads.com/user/show/11909124-staci", "userReview": "In the author's note, she shared 70% of females that flee North Korea for China became a part of the sex industry. So heart breaking to leave one difficult situation for another. Slave Again is a novel based upon the 70%.Slave Again continues the story of North Koreans that began in Alana Terry's first novel of the series, The Beloved Daughter. Slave Again is not only about North Koreans Mee-Kyong and Sun, but also about two empty nester Americans living in China. This novel is just as much about how stifling Christians can be in their effort to be the light of Christ as it is about the plight of Mee-Kyonk and Sun.Both of Alana Terry's novels about North Koreans, The Beloved Daughter and Slave Again shine a light on what life is like in that part of the world. Her novels are short, engaging and thought provoking. I highly recommend them. I look forward to reading the third novel in this series, Torn Asunder."}, {"userName": "Sandra", "userReviewDate": "Aug 15, 2016", "userURL": "http://www.goodreads.com/user/show/35503288-sandra", "userReview": "Poignant, sad, thought-provoking, mysterious and joyous all at once. Alana Terry has the amazing ability to draw readers right inside her characters' minds. After reading this book, I just want to sit here, think and prayer. I want to cry, I want to be thankful, I want to do more. At this point I can't say more than \"Well done, Alana Terry!\""}, {"userName": "Lora Connor", "userReviewDate": "Oct 29, 2017", "userURL": "http://www.goodreads.com/user/show/6382543-lora-connor", "userReview": "Awesome book!A well written book with a plot that makes it difficult to put down. It brings awareness to the suffering of the North Korean people."}, {"userName": "Carrie Newman", "userReviewDate": "Feb 07, 2018", "userURL": "http://www.goodreads.com/user/show/77483143-carrie-newman", "userReview": "Another heartbreaking and beautifully written book."}, {"userName": "Beverly", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/12799564-beverly", "userReview": "This novella is an in-between book, almost like a pre-quel. Though each of Ms. Terry's books can be read alone, they lend support for each other, beginning with Beloved Daughter, then \nSlave Again\n, and finally Torn Asunder. The novella is short enough to be read quickly. Since I am already reading Torn Asunder, I noticed that what is introduced in this book is continued in that one. So if the story seems a little disjointed, there are several threads being introduced that will continue later in subsequent books.The suspense and action in this book is tough as nails and somewhat graphic. The worst of it is implied, but our imaginations can easily fill in the details. This is not meant to be a feel good, tender read. The events portray the horrors of living in North Korea, how some try to cross the river into China out of desperation just to earn some money to send back to their starving families. The major thread follows Pang and Mee-Kyong after they have escaped Camp 22. They are about to cross over the border, guided by a sleazy, greedy border broker. Before crossing, Mee-Kyong gives birth to a dead baby; she is considerably weakened by the bleeding but crosses anyway. The broker sells her and another girl into a hotel that prostitutes them. Mee-Kyong adopts the young girl, Sun, and tries to protect her as best as she can.Eventually she escapes and finds the home of an American couple operating a business in the area. But they also operate a secret seminary for refugees who desire to return to North Korea and offer hope to their friends, neighbors and families. The work is very dangerous, and only a few pass over the border at a time to minimize the risk. Mee-Kyong arrives at the house after the last group has already departed. This is where we become acquainted with Roger and Juliette Stern, the American couple who reach out to North Korean refugees as much as they are able. At first, Mee-Kyong doesn't know how to react to the couple. The cultural differences are great, and being a fighter, she finds it hard to lower her guard and trust them. She decides to stay with them for awhile. This book is filled with danger, suspense, and gritty reality. The author's talents are crystal clear, as she keeps her readers on the edge all the way through. Our emotions are all over the place as we feel alternately repulsed and heart-broken by the ugly life the North Koreans face, the slavery they sometimes enter when reaching China, the indulgences of the Americans living in China, and the futility of everyone's efforts to right the wrongs, in contrast to the little bit of hope as we see Mee-Kyong's life transformed. There are plenty of surprises in this story, including the identity of a spy for the North Korean government in the Stern's home. Finding the identity of the agent only intensifies the suspense because it impacts the characters in the next story, Torn Asunder. What I like most about the author's writing style is that she writes in a brutally honest manner, not pulling her punches in the way she confidently displays the ugly reality of refugee life and the blatant trafficking that goes along with it. While this is written from a Christian viewpoint, you don't have to be a Christian to be swept in the poignancy of the story and tragic realities. I am looking forward to reading more books from this author.Disclosure of Material Connection: I received a complimentary review copy of this book from the author. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255: “Guides Concerning the Use of Endorsements and Testimonials in Advertising.”"}, {"userName": "Emily", "userReviewDate": "Nov 14, 2014", "userURL": "http://www.goodreads.com/user/show/23343364-emily", "userReview": "As you may have noticed, suspense is not my usual genre. However, I found that Slave Again was a wonderful book. I won’t attempt to write a long summary of the book this time because Alana did such a good job of it and I don’t want to reveal any more than I already have to in the review. Suffice it to say, human trafficking is a major theme in Slave Again, and the main character, Mee-Kyong and a few of the other characters are trapped and trying to escape from being trafficked in China and North Korea.Slave Again kept me on my toes. Everything would be going fine or you thought you knew where the book was going, then BAM! something horrible or unexpected happened. I couldn’t even guess what would happen next. A little over halfway through the book, however, nerve-wracking occurrences calmed down a little bit. The characters were recovering and adjusting. There was a little suspense on account of the overheard phone calls between a government spy and his/her superiors. The ending was suspenseful, I was glad to note, but I won’t give it away.The way Slave Again ended was more than satisfactory but disappointed me a little because there were so many loose ends. Several characters I had begun to care about were never heard from again within the book, and several instances. However, I assume that many of those loose ends will be taken care of in the next book, Torn Asunder, which is due to be released in December and which I will be reviewing and hosting the blog tour.Alana Terry showed the characters’ faults in ways I do not usually think about. All the characters were selfish. Even the sweet missionary couple was portrayed as helping others partly only to get something from the situation; the husband helped Mee-Kyong in order to make his wife happy which in turn helped him be happy. This made me think deeply about whether my own motives about helping others are selfish. Also, the missionary woman was often mentioned as being naïve, which makes me wonder whether I too would be considered naïve in such a situation and whether I could still be effective as a missionary if I was naïve.Slave Again helped open my eyes to the realities of human trafficking, particularly sex trafficking. The women and children who are trafficked suffer more than anyone should. I applaud anyone who helps stop the practice and hope to join the fight myself. I am quite certain that Alana Terry has information for anyone willing to help end human trafficking in the world if you ask her. Because of the theme is human trafficking, the characters are desperate, and the genre suspense, the book was only relatively clean. Slave Again included non-gory, violent scenes and a few implied sex scenes.Overall, I applaud Alan Terry for a well-written, informative, and suspense-filled novel."}, {"userName": "Beckie Burnham", "userReviewDate": "Dec 15, 2014", "userURL": "http://www.goodreads.com/user/show/2952739-beckie-burnham", "userReview": "Slave Again is a the first book in a new series by Alana Terry. Terry revisits the people of North Korea, this time focusing on the women who are sold into slavery in China. While prostitution is officially illegal in China, there are many levels to the sex trade in that country. In Slave Again, the women are trapped in the hotel district of a town north of the North Korean border. Though written from a Christian worldview, Terry’s book is not like most books written for that genre. The images are brutal and the emotions raw. Most characters are not Christian and their actions are formed by the brutality of their world. If you are looking for a gentle read, this one is not for you. But if you want an honest look into the ruthless North Korean regime, then Slave Again would be a good choice.Mee-Kyong (introduced in Beloved Daughter), has escaped from the North Korean prison camp that has been her home since birth. But she soon finds herself forced into another prison — a Chinese brothel not far from the border. Her survival skills keep her alive, but her hardened heart is touch by a young girl stolen from her family. Slave Again details the horrors and hopelessness of the sex trade. However, the hope for escape and a new life in Christ is included in its message.There are a lot of story lines in Slave Again, many of which are left incomplete. I am hoping that they will develop in the next books in the series. There is a good deal of suspense, and you never really know just what is coming on the next page. I would have liked a bit more character development — I had a hard time understanding the motivations of several of the characters. But if you are looking for characters that are based in reality, then Slave Again is for you. All the characters have warts, including the Christian characters. The contrasting points of view are enlightening — from characters just trying to survive, to those who are struggling with the way of Christ and those who are trying desperately to help the lost and desperate. There is a great deal of adult content — abuse is not sugar coated. So if you don’t want to read about the realities of human trafficking, don’t pick up this book. But for those who want an honest portrayal of the subject, Slave Again is eye-opening.Alana Terry is passionate about the people of North Korean and that passion is reflected in her writing. After reading Slave Again, you just might join her cause.Recommended.Audience: Adults (violence and human trafficking portrayed)(Thanks to the author for a review copy. All opinions expressed are mine alone.)"}, {"userName": "Wanda", "userReviewDate": "Nov 21, 2014", "userURL": "http://www.goodreads.com/user/show/5171656-wanda", "userReview": "Mee-Kyong is wise for her age and she is a fighter. She fought her way out of Camp 22, a ... and now she is fighting to survive slavery in a motel across the Chinese border. With blood on her hands and anger in her heart she takes a young girl under her protective wings. Sun, at the tender age of fifteen, left home to earn money to help her family survive. She never realized what she was getting into until it was too late but she had her very own guardian angel in Mee-Kyong. Take this journey with Mee-Kyong as she fights for survival in a country fueled by hate.One of the things I loved about this book was the character development. In The Beloved Daughter Mee-Kyong turned her back on Chung-Cha who considered her a good friend. Out of all the characters I have formed a dislike for, Mee-Kyong was in the top five. She redeemed herself in this book. The transformation was beautiful as Mee-Kyong went from a girl that only looked out for herself to a young woman that risked her life for a girl she barely knew. That's what character growth really means and I have to give the author a high five doing it so well. There are several \"main\" characters in this book and some I found endearing in their own individual way. Some I developed an immediate dislike for. It was a love/hate relationship which made the storyline more interesting. Alana Terry brings the horrible act of slavery to light while entertaining the reader in an engaging way. It was a page turner that kept me engrossed in the story and the only negative thing I can say about this book is I'm not too wild about the format. Each chapter was full of what I call \"mini chapters\". Mini chapters are very short scenes featuring a different character contained within the main chapter itself. It felt as if I were jumping from character to character a bit too much which detracted from the story for me.Being it's a spinoff of The Beloved Daughter I couldn't help but compare the two. The Beloved Daughter is an award winning book, and rightly so. I fell in love with it immediately. But, while I don't feel Slave Again has quite the same level of suspense, I did find it entertaining and enjoyable. I am looking forward to the next book! If you like suspense I recommend checking out this book and the author, Alana Terry!Disclaimer: I received a complimentary copy of this book from the author for my honest review and no monetary compensation was received."}, {"userName": "Emily Wrayburn", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/6068439-emily-wrayburn", "userReview": "Originally posted on A Keyboard and an Open MindQuick disclaimer: I received a free copy of this book in exchange for an honest review.As with her 2013 novel, The Beloved Daughter, Alana Terry pulls no punches as she once again visits the topic of young women in North Korea. In Slave Again she focuses on human trafficking, and the situation faced by so many women who struggle to cross the border into China, only to end up in the sex industry.While the book’s blurb only mentions one character, Mee-Kyong, the book really has more of an ensemble cast. Mee-Kyong has escaped from the prison camp she was born in, but she knows that once she reaches the border, it doesn’t necessarily mean that everything will be fine from here on in. There is also the naive Sun, who believes she is going to find a job across the border to help her struggling family. There is her brother, who is trying to find her and bring her home. And there are also Juliette and Roger, American missionaries living in China and secretly assisting North Korean refugees.The book is often violent and harrowing; even when events are not specifically described, it is easy to tell what was happening to these characters behind closed doors. Some characters die, and sometimes it will take you by surprise exactly who the author was willing to kill off.Mee-Kyong and Sun’s stories were definitely the ones I had the most investment in. I really wanted to see them escape to some kind of freedom. Mee-Kyong’s outlook later on in the book, after she has met Roger and Juliette, is also very interesting and raises some deep questions, such as the real meaning of freedom.I actually felt a bit uncomfortable about Roger and Juliette, not because they were Christian (I’m a Christian, so that didn’t bother me), but because they seemed to treat the refugees they took in more like pets or projects to be worked on, rather than real human beings. Maybe that was an intentional character trait given them by the author, but I wasn’t entirely sure.That was really my only qualm, however. Alana Terry’s writing is wonderful and this book is truly an eye-opener. I gather Alana has another installment in this series already in the works, and I look forward to it as well."}, {"userName": "Sharee", "userReviewDate": "Jun 26, 2015", "userURL": "http://www.goodreads.com/user/show/11039623-sharee", "userReview": "Slave Again by Alana Terry is a fantastic read!! There aren’t enough words to express the incredible story within its pages. Although it is the book following The Beloved Daughter, it is a stand alone story.Ms. Terry touches on the crucial roles of women even in oppressed societies. Through the stories of three women, she intertwines a tale of espionage, human trafficking, and rescue. In Slave Again, survival and strength are just among a few of the lessons.Mee-Kyong has been through a nightmare of a life and now survival is her motivator. The man she has given her heart to has become not only her lover, but her enemy. She must decide between survival and loyalty to him. Although he rescued her from prison, he has in fact, imprisoned her again in a life with him. But Mee-Kyong has lived in the chasm between heaven and hell and she will do whatever it takes to survive…including murder. Sun is a sweet, innocent girl who wants to help her family. She’s persuaded to find work but her persuader is an evil man with nothing good on his mind, especially for her. Taken from her simple but poor home life she is promised a better future and one that will help her family as well. Willingly, she accepts this promised future not realizing the danger she has placed herself in.Roger and Juliette are Americans who have a heart for rescuing the improvised they see all around them. Without purpose, Juliette finds depression too close a companion. Determined to help spread the gospel, they work together to teach the people they rescue. Once they’ve completed their training they are sent out as lambs among wolves. Doing all they can to make a difference in the world, they willingly accept danger as part of their daily lives for the sake of the gospel.Three very different stories that become intertwined in a tale so suspenseful, the reader will not want to put the book down. Alana Terry is a writer with not only great storytelling ability, but a heart for the innocent ones caught in a war and a world filled with devastation and destruction. Definitely a must read!I received this book from Alana Terry in exchange for my honest opinion which I’ve provided here."}, {"userName": "Jasmine", "userReviewDate": "Nov 27, 2014", "userURL": "http://www.goodreads.com/user/show/14933619-jasmine", "userReview": "Another powerful story from Alana Terry!An emotional and moving story that left me thankful, but also convicted to pray for and do what I can to raise awareness about the persecuted Church.Slave Again isn't always easy to read. It's not light and fluffy. It's truth. People in North Korea and China live through horrendous things that we Americans can only imagine. And yet, God places people like Juliette and Roger in key places for such a time as this.Readers are introduced to Mee-Kyong in The Beloved Daughter and in Slave Again we find out more of what happened to her later. She lives a life so far removed from my own that sometimes it's hard to imagine and I kept turning the next page and the next. The choices Mee-Kyong must make are beyond impossible and not only does she survive day after day but a tiny seed of compassion is kept alive. That tiny seed just might grow into something amazing.This book has it's rather dark moments but it is still a story of faith and hope. Readers never lose sight of the hope we all have in Christ even when everything seems hopeless and lost.I will say that this book is not for young kids, personally I'd give a general age range of 16+.I loved the suspense angle of trying to figure out who was reporting the actions of the Graduates to the authorities, and I kept second guessing myself on who the guilty party might be.\nAlana Terry\n has once again penned a story that transports readers to a land some might say has been forgotten by God, and yet it is so apparent that He is constantly moving in the lives of it's inhabitants.Slave Again was heartbreaking to read in places but one that will definitely make it on my list of favorite books read in 2014.(I received a copy of this book from the author in exchange for my honest review. All opinions are entirely my own.)"}, {"userName": "Nancee", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/5786956-nancee", "userReview": "After surviving preposterous torture in a North Korean prison camp where she was born, Mee-Kyong escapes only to be sold into the Chinese underworld. Her story is one of extreme oppression, insurmountable torment and abuse. Life as she knows it is survival through her own will and determination to live. This is a story of human trafficking and sex trade in its rawest form. This is written with a strong Christian conviction, but the realities of the abhorrent and inhumane treatment of young girls and women around the globe are not to be denied. There is no graphic sexual content, but there is some violence in this realistic portrayal of young Mee-Kyong and others like her. This story could not be told without depicting some of the violence that accompanies this topic.Alana Terry is to be commended for her sensitivity and strong Christian convictions, composing another story of the gruesome realities of a practice that has reached mammoth proportions. The inhumanity relating to these atrocities exists around the globe. Ms. Terry describes the topic with an openness that is brutally honest and indisputable, but she is careful not to cross the line into forbidden territory in Christian writing. As in \"The Beloved Daughter\" the author conveys the message regarding human trafficking in truth and honesty, sharing the inner strength and sheer willpower of a her character in a brilliant manner. I highly recommend \"Slave Again.\" The exposure that is provided by Ms. Terry's writing is a testament to the existence of an intolerable condition.Disclaimer: I received a copy of this book from the author in exchange for my honest review. All opinions expressed are my own, and no monetary compensation was received for this review."}, {"userName": "Sheila", "userReviewDate": "May 09, 2016", "userURL": "http://www.goodreads.com/user/show/2039269-sheila", "userReview": "Slave Again by Alana Terry pairs together the stories of a struggling North Korean family and American Christians living and working in China. The novel is strongest in its unflinching portrayal of sex trafficking and women's broken lives. A Korean schoolgirl seeks to earn money for her family and finds herself betrayed into the ultimate horror. Meanwhile a young woman, escaping her own life of horrors, takes desperate measures. And a rich American, familiar with saving souls, tries to save lives.The author provides an intriguingly thought-provoking view of failed proselytizing, offering the honest complaint that “The platitudes and Bible verses... doled out didn’t ease the pain...” But a pleasing thread of hope breaks through the terror of slaves and mistakes of defenders, leading to a surprisingly satisfying conclusion.The characters are unflinchingly real in this story, with all their flaws exposed. Dangers lead, as dangers often might, to death and despair. And faith leads to false assumptions, broken dreams, and too many chocolate bars. But there is true faith underneath it all, and perhaps it doesn’t take a hero to carry the torch.Slave Again is a long dark tale of wounded, frequently unsympathetic characters, blessed with hope.Disclosure: I won a copy and I offer my honest review."}, {"userName": "Rachelle", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/8704544-rachelle", "userReview": "***Trigger warning***Book opens with a graphic murder scene.This book sucked me in from cover to cover and is simply amazing! I was hesitant in the beginning, as several different characters are introduced in the first three or so chapters. While at times things did get confusing, overall Alana Terry does a fine job weaving the lives and subplots together.The main two story lines consist of Sun, a teenage girl who is tricked into sex trafficking, and Juliette and Roger Sterns, a married couple living in China near the North Korean border. The Sterns run an underground seminary program with students who were refugees. The next book in this series features two of the seminary students mentioned briefly in this book.Like I said above, the writing flowed well, and Terry writes in a way that brings things to life. Sadly, this includes matter-of-factly speaking about sex trafficking. The ending brings vindication, though I was left with a huge question. To ask it here would cause a major spoiler, and I can only hope that Terry will answer my unspoken question with Book Two in the Whispers of Refuge series.I received a copy of this book in exchange for an honest review."}, {"userName": "Brittany", "userReviewDate": "Dec 09, 2014", "userURL": "http://www.goodreads.com/user/show/18727044-brittany", "userReview": "Slave Again is about the horrific reality of the sex trade industry in China. This is a tough, gritty subject and the author handles it well. There are many things in this book that are hard to read about and some twists that will surprise the reader. It is definitely an edge-of-your-seat read!Alana Terry is good at portraying the depravity that humanity is capable of, while still staying within the bounds of Christian fiction. Even those who are “good” in this book have their weaknesses. Be aware that this book does have some violent situations in it and be prepared to shed tears.Slave Again definitely stands alone, however, I believe that my reading of it was enhanced by the fact that I had read The Beloved Daughter last year. Mee-Kyong was not a character I liked in The Beloved Daughter and as I began this book, I still did not approve of her actions. But there is some amazing character growth in this story, which was refreshing.My thanks to the author for providing a complimentary copy of this book for review purposes.This review will post on my blog on 12/13/14 at:http://wp.me/p3o95H-NF"}, {"userName": "Marilyn Johnson", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/15660359-marilyn-johnson", "userReview": "It is hard to say that I \"enjoyed\" this book, being that it is about Human Trafficking, sex slavery and all that is involved with those. Alana Terry does a great job explaining what takes place without going into too much detail. It is a difficult read knowing that this truly does go on in many places. With that being said I did enjoy reading it. It is very eye opening, especially if you had no idea this kind of thing actually does happen.Mee-Kyong has been through much in her life and must face much more. She feels responsible for Sun, even though they just meet. Is there even a God in such hard times? What has he ever done for me?Juliette and Roger Sterns, are missionaries helping refugees from North Korea in China. We see some struggles that they too must face. Honestly Juliette got on my nerves, however I think there is more to her story than we know.Alana Terry does a tremendous job giving details and personalities to all the many characters in her book. Even the most difficult, you can see their point of view many times. She does a great job in telling a very difficult story. This book is filled with heartache, mystery, surprises and God's love."}, {"userName": "Margaret Tidwell", "userReviewDate": "Oct 07, 2014", "userURL": "http://www.goodreads.com/user/show/7037554-margaret-tidwell", "userReview": "Slave Again by Alana Terry was an amazing book. It did live up to those hopes and even surpass them. This book at times was hard for me to read because of what the poor women & children have to go through. Her books also have opened my eyes to what really goes on over there and it breaks my heart because things like this shouldn't still be happening in our world.Anyway lets get on to the review of this book. Like I said this book was amazing and it lived up to everything that I thought it would. There are parts of this book that broke my heart and were hard to read but none of it made me want to stop reading. This book did have a rough start for me but that isn't because nothing happened. Alot happened right at the start but I think the subject matter made it hard for me to read right in the start but once I was a few chapters in I didn't want to put the book down. I have to say that there are twists in the book and some of them I saw coming and others I didn't which always makes for a good read. I do wonder what happened to some of the characters in the end but all in all I loved this book and it is one that I am going to keep in my collection."}, {"userName": "Katie Edgar", "userReviewDate": "Dec 13, 2014", "userURL": "http://www.goodreads.com/user/show/20664906-katie-edgar", "userReview": "The suspense in this book made me keep guessing at every page turn, but I did have to take it slow and put the book down to digest and think. Sex trafficking is not an easy topic, especially when you know the author did her homework and portrayed this as real as fiction can get. I’ve some reviews where people questioned the character development, but I disagree with that. I think some the characters were kept a bit secretive on purpose for the suspense and others had to protect themselves with how they had been treated their whole lives and were trying to figure out who they could trust and wouldn’t/couldn’t open up. This to me made the characters seem more real. Christian fiction usually does portray characters as very translucent and they are not in this book, which made it more interesting to me. The message behind this book is the most important part and I think that comes across loud and clear. I hope it prompts many of us to at least pray for these women in real life and maybe get involved in getting women out of sex trafficking. I know it has been laid heavy on my heart."}, {"userName": "Martha", "userReviewDate": "Dec 17, 2014", "userURL": "http://www.goodreads.com/user/show/6966032-martha", "userReview": "Slave Again is a Unique look at the story of sex trafficking between North Korea and China. There is graphic violence right off the bat, which makes this book more of an adult read. The violence is not meant for entertainment value, but to tell the story of the issues facing the young women held in slavery. Kidnapping, rape and murder are all a part of this story. In it, you read the torment that is inflicted upon this young soul, Mee-Kyong. Her search for the truth throughout the story is not always apparent, but becomes clear in the end. I found the book unique as you do not read a lot of books with this type of subject matter. I always appreciate an author that is willing to step outside the box and give us an inside view of the not so pretty life. However, if you are sensitive this book may not appeal to you. If you are interested in the fight to stop human trafficking here in the USA and in other countries, this book is the one to pick up."}, {"userName": "Sheila", "userReviewDate": "Sep 14, 2014", "userURL": "http://www.goodreads.com/user/show/7284284-sheila", "userReview": "Within about 24 hours, I had read the story--it was that gripping and powerful!! This is the first book I have read by Ms. Terry, but it won't be the last--she is a powerful and terrific writer! It makes my heart so sad that human trafficking exists, and this story inspires me to want to do more for those who have been caught up in this terrible thing. The characters are so authentic, and in several places I found that the dialogue was so human--not contrived but was the dialogue you would really hear between people talking. It truly made me think about how platitudes and pat answers that we as Christians offer to those who have seen the grittier side of life are not enough--and to those people do not seem authentic. We need to meet people where they are--at one time we were once lost too. This story really is impacting--read it--you won't be disappointed! Thank you to Alana Terry for allowing me to review her book--the opinions and thoughts are my own."}, {"userName": "Phyllis", "userReviewDate": "Apr 25, 2015", "userURL": "http://www.goodreads.com/user/show/10430278-phyllis", "userReview": "Alana Terry has become one of my favorite authors. I was privileged to read her book The Beloved Daughter http://phyllis-sather.com/?p=5541 last December. It left me wanting more, even though it was a book about a very difficult topic – life in North Korean prison camps. It opened my eyes to what was happening in the real world – right now! Her book Slave Again is equally compelling although it takes place after the escape of Mee-Kyong when she is in the Chinese underworld. Her life doesn’t improve much – just becomes a different nightmare. The story switches back and forth between a missionary couple and Mee-Kyong’s lives. The tension grows as Alana tells both their stories and as the hope for redemption grows. Even though I thought I was familiar with Alana’s writing the ending still took me by surprise, and left me wanting more. No spoilers here – you’ll have to read it yourself. You won’t be disappointed."}, {"userName": "Bethany Marks", "userReviewDate": "Sep 16, 2014", "userURL": "http://www.goodreads.com/user/show/5294659-bethany-marks", "userReview": "Alana Terry takes you from North Korea to China and into the heart of human trafficking. She pens amazing, living, breathing characters; you get behind their eyes, inside their thinking and understand their plight and decision-making. Seeing various aspects from the initial person respected in authority who plants the lie, to the broker, the trafficked and, ultimately, the rescuers, Slave Again gives a wide scope culturally and a view into this growing global horror.Hope is woven in generously and this story is tastefully told, so don't hesitate to read this book. I thoroughly enjoyed reading Alanna Terry for the first time and you will too. She portrays cultures beautifully. She has the perspective of both missionaries and also business, moneymakers in the human trafficking industry. You, too, will fall in love with her characters and have a hard time putting this book down. Enjoy!I received a complimentary book from Alana Terry in exchange for my honest review."}, {"userName": "Elaine Jeremiah", "userReviewDate": "Sep 13, 2014", "userURL": "http://www.goodreads.com/user/show/23292965-elaine-jeremiah", "userReview": "This novel is the second by Alana Terry, her followup to 'The Beloved Daughter'. I enjoyed 'Slave Again' as much as 'The Beloved Daughter'. Terry writes beautifully and draws you into the story.Dealing as it does with human trafficking, and unflinching in its descriptions of the physical and emotional torment faced by the young women it depicts, 'Slave Again' has scenes which are brutal at times. But the violence is not gratuitous, just realistic and wonderfully written.As the reader I felt such sympathy for many of the characters in the story - even those who at times weren't likeable - as Terry manages to make all of them feel real and human. They're not black and white; they make mistakes, even do terrible things but I could connect with them and feel their pain.I would recommend 'Slave Again' to anyone who enjoys a well written, pacy and exciting novel, full of suspense and intrigue.* I received a free copy of this novel in exchange for a fair and honest review."}, {"userName": "Emerald Barnes", "userReviewDate": "Sep 20, 2014", "userURL": "http://www.goodreads.com/user/show/2582314-emerald-barnes", "userReview": "Slave Again is one of those novels that makes you think that you haven't done enough to help out these people who desperately need liberty and freedom from the situation they're in. It follows the character Mee-Kyong who goes from being a slave in the gulag to being a slave in the sex-slave trade just because she wants to get out of North Korea and into China. In a strange turn of events, after lives are lost, she ends up meeting a nice Christian couple who are trying to help refugees find safety and God. But they don't quite understand what the refugees have gone through. Still, the book in and of itself sort of has a happy ending, and I was happy about that. I think everyone should read this book because it goes to prove that we have limited our thinking to avoid the reality of the situation. It makes me want to do more, if it's just pray."}, {"userName": "Cherie Kasper", "userReviewDate": "Sep 29, 2014", "userURL": "http://www.goodreads.com/user/show/15661660-cherie-kasper", "userReview": "After reading Alana Terry's book 'The Beloved Daughter' I was not surprised to find the same quality of writing in this new book. During the reading you will not be lacking in suspense as the story unfolds. I know this is fiction, but it seems so real, which makes it even harder to read, emotionally.The story's of the the two different girls who end up in the same place is captivating. You can't put the book down because you want to find out what happens next. I felt all the characters were well described and the actions of all very believable.I would recommend this to all who love some suspense in your christian fiction."}], "description": "She traded in her prison uniform for shackles of a different kind. After escaping a North Korean prison camp, Mee-Kyong is hustled over the border and sold into the Chinese underworld. She vows to survive, but sheer determination and willpower won’t save her this time. Is she fated to remain a slave forever? Slave Again is written by Christian suspense novelist Alana Terry, winner of numerous awards, including the Women of Faith writing contest and the Readers’ Favorite gold medal for religious fiction. It is offered at this special introductory price for a limited time. * This book has some Christian characters and themes but was written with a broad audience in mind.", "title": "Slave Again\n      \n          (Whispers of Refuge  #2)", "url": "http://www.goodreads.com/book/show/23202955-slave-again", "average": 4.18, "cover": "https://images.gr-assets.com/books/1410469488l/23202955.jpg", "reviews": 43, "authors": [{"url": "https://www.goodreads.com/author/show/7048073.Alana_Terry", "name": "Alana Terry"}], "type": ["Christian", "Fiction", "Christian Fiction", "Suspense", "Young Adult"], "outlinks": ["http://www.goodreads.com/book/show/23202955-slave-again", "http://www.goodreads.com/book/show/27411121-slave-again", "http://www.goodreads.com/book/show/23202950-slave-again", "http://www.goodreads.com/book/show/25335376-unplanned", "http://www.goodreads.com/book/show/17798886-the-beloved-daughter", "http://www.goodreads.com/book/show/27423786-paralyzed", "http://www.goodreads.com/book/show/30296610-policed", "http://www.goodreads.com/book/show/36242150-what-dreams-may-come"]}