{"ratings": 5991, "userreviews": [{"userName": "Nancy", "userReviewDate": "Feb 12, 2013", "userURL": "http://www.goodreads.com/user/show/1731678-nancy", "userReview": "A few years ago, before I joined GoodReads, I read 2 or 3 of the Eve Duncan books on the recommendation of a friend--can't remember titles, as they all seemed pretty formulaic. Haven't picked one up since then.And maybe this wasn't the right one--but...very unimpressed.There are problems all through what should be a taut thriller: a massive overdose of goes-nowhere, inane dialogue; a plotting timeline that doesn't make any sense; lead characters who do things no sane person would do; a kitchen-sink approach to cramming random stuff into the story--like a villain who appears to come from another series, perhaps just because there wasn't any voodoo in the book already. Plus--Johansen's characters never hang up a phone. They \"press disconnect\" (four times, in three chapters).I immediately remembered Eve Duncan, and her little girl, and her passion for recreating the faces of victims. Maybe Johnansen's tired of Eve and can't find anything more for her to do, but this book was a mess."}, {"userName": "Patricia L.", "userReviewDate": "Nov 11, 2012", "userURL": "http://www.goodreads.com/user/show/6854478-patricia-l", "userReview": "The book was hard to stay with after the first 200 pages when conversations became stilted and repetitive. Some of the murders may have happened with the movement of a wand, as they were dismissed with a sentence or two, and not credible. I think I'm finished with these characters. Perhaps Ms. Johansen will invent a more believab;e plot with a new group of people, but I won't be rushing to read this author any time soon."}, {"userName": "♆ BookAddict  ✒ La Crimson Femme", "userReviewDate": "Sep 08, 2012", "userURL": "http://www.goodreads.com/user/show/3089655-bookaddict-la-crimson-femme", "userReview": "Is there life after Bonnie for Eve? Apparently so. In this latest installment in the romantic suspense series, Ms. Johansen introduces us to a new character - Beth Avery. Beth's tie into Eve is a surprise to all. It's a nice addition and Bonnie's visit to Eve is lovely.There has to be a suspense of disbelief for many of the \"woo woo\" stuff in these stories. Once that happens, these stories are quite lovely. I enjoyed this well edited if predictable plot. Joe and Eve are like a pair of comfortable slippers for me. See them together again while trying to solve a mystery is great. I'm a bit surprised how often Joe can just take off from work though. I didn't realize cops, even detectives could do it so easily w/o losing their job. What I really enjoyed about this story is the fact that there are several strong women in this book and they aren't bitches to each other. Sure, they rub each other a bit, but they aren't fighting for male attention. New character Kendra is one I really like and I wish it were true. Kendra's ability to process information from all her 5 senses is impressive and I liked how Ms. Johansen wrote her. Kendra's interaction with Eve is realistic and fun to sit back and watch. Eve's relationship with Beth is also one of realistic ups and downs. This is probably what I like best about Ms. Johansen's characters. While they may have some \"woo woo\" stuff, their actions and responses ring true to how she created them. They don't behave in illogical manners.This story is recommended to romantic suspense readers."}, {"userName": "Jodi", "userReviewDate": "Oct 25, 2012", "userURL": "http://www.goodreads.com/user/show/667420-jodi", "userReview": "This book will be far more interesting if you first read Close Your Eyes which she wrote with her son Roy Johansen, but you won't really lose anything if you don't. Eve receives the extraordinary news that she has an older half sister who has recently escaped the sanitorium that she has spent the last 17 years. Eve is stunned but can't help but be drawn into her unknown sister's plight, particularly when it becomes clear her sister has been medicated and hypnotized into submission for years. Her father is a man on the verge of political greatness, perhaps the presidency. Except for nagging habit of liking pre-teen girls. When a hitman goes after Eve's sister and bungles the job, a lot of other people start dying. The plot is preposterous (except for the secret sister angle) but it was fun and action-packed and Kendra Michaels, from Close Your Eyes, is a great character and I was happy to see her again. The plot may not have been so crazy if the political angle had been a central facet of the story but since we didn't see any of that, it didn't hold together for me. But since I couldn't put it down, that deserves credit too."}, {"userName": "Sarah", "userReviewDate": "Feb 24, 2013", "userURL": "http://www.goodreads.com/user/show/1781097-sarah", "userReview": "This is only getting 3 stars b/c of the suspense...it kept me sucked in. But I'm really not sure why: Johansen is getting a bit repetitive with her plots. Family member in trouble? Check. Eve putting herself in danger against Joe's advice? Check. Presidential candidate involved? Check. Crazy dangerous killer? Check. Seriously, didn't Catherine Ling just save a good presidential candidate? Guess that doesn't count since it wasn't technically an \"Eve Duncan\" book. The timeline really bugs me too. It's been totally thrown off. Eve had Bonnie when she was 16, and Bonnie died at age 7. That puts Eve at 22. I'm pretty sure it had been 7 years since Bonnie's death when the FIRST Eve Duncan book came out. That puts Eve at 29. She was with Logan for a year. 30. She finally gets with Joe and adopts Jane (little cloudy on the timeline here since it's been awhile since I read the early books)...we'll be generous and say she's still 30. Jane was 10. Pretty sure at last count, Jane was in her mid-twenties. Again, I'll be generous and say early 20s. That puts Eve at least at 42. And if I was being more accurate, probably older than that. So let's look at \"Sleep No More.\" Beth had her accident at 17. At one point, it says she's been in the hospital for two decades, which would make her 37 (although they lose a decade halfway through the story and say she's been in the hospital for ten years). She's at least a year older than Eve, so that makes Eve 36. See why this drives me crazy???And really...I could go on. Don't get me started about Catherine Ling and John Gallo and THEIR ages!!!So as you can see, I spent most of the book stewing about Eve's age discrepancy. If Johansen had put a little caveat at the beginning and said she messed with the timeline a bit (SEP did it and I was fine with it), I would have accepted it and moved on. Grrr."}, {"userName": "Linda Alexander", "userReviewDate": "Dec 28, 2012", "userURL": "http://www.goodreads.com/user/show/12133120-linda-alexander", "userReview": "This book had a great story line and I greatly enjoyed it. It really snags the reader into being fearful for the life of the young girl they've kept sedated and mentally out of it for more than a decade. One questions whether/not her father truly loves and cares for her, and particularly since he hasn't been to see her for many years because of the pressure from his mother to avoid having any ties to the girl, for fear it will damage his political career. Sort of makes one wonder how any father could be that heavily influenced by anyone to detach himself from his daughter in a mental institution to that degree. It is shocking to learn the girl is also Eve's sister, and Eve and Joe take her under their wing while trying to investigate and get to the bottom of what truly happened. I enjoyed the actual story but was not impressed with the writing style....very simplistic in my personal view, and this is the reason for only giving it 4 stars rather than a 5 star rating."}, {"userName": "Sidnie", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/1328906-sidnie", "userReview": "Characters are stilted and formulaic. Dialogue dull. If I had to read one more \"dammit\" by joe and eve, or read one more scene where one protects the other by going it alone.... It's the same thing over and over. Eve has evolved into an almost unlikeable character, and yet everyone loves her and does her bidding. I think I will be finished with this series."}, {"userName": " Danielle The Book Huntress (Back to the Books)", "userReviewDate": "Aug 29, 2012", "userURL": "http://www.goodreads.com/user/show/1570669-danielle-the-book-huntress-back-to-the-books", "userReview": "This was a quick read with an interesting storyline. I liked it!Reviewed for Affaire de Coeur magazine in the October issue. http://affairedecoeur.com."}, {"userName": "Heather", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/5049881-heather", "userReview": "Title: Sleep No More (Eve Duncan Series #12)Author: Iris JohansenSynopsis:Forensic sculptor Eve Duncan knows what it’s like to be haunted by the past. For years after her daughter Bonnie was stolen from her, she fought for closure. But now as she’s striving to begin anew, she can’t shake the feeling that something terrible is about to happen—or maybe already has. When her mother, Sandra, asks for help in finding a missing friend named Beth Avery, Eve is sure that she’s hiding something. It’s odd that Sandra would get involved at all, and the fact that she adamantly refuses to go to the police for help reinforces Eve’s suspicions that something is very wrong.Eve learns that Beth has been locked away in a mental hospital for years, which makes it even harder to understand how she could have disappeared. As Sandra reluctantly reveals small pieces of the truth about Beth’s identity, Eve is shocked to discover that their lives are strangely entwined, and Beth’s disappearance now puts them all in grave danger.Desperate, Eve enlists a secret weapon to pick up Beth’s trail: rogue profiler, Kendra Michaels. With an uncanny ability to detect clues and solve puzzles, Kendra begins to uncover the bizarre circumstances of Beth’s escape from what should have been the safety of her hospital room. Beth is on the run, and as her mind clears—detoxing from the drugs that have held her prisoner—she begins to see the threads of a twisted plot within the powerful Avery family, threatening to destroy Beth and anyone else who might jeopardize the high-stakes game that is already in play.My thoughts: Welcome to the 12th installment of Iris Johansen’s Eve Duncan series which chronicles the life and work of Eve, a forensic sculptor. Overall, I really enjoy this series and really enjoyed this book. My only huge complaint with this book is the author’s clear lack of research about what a music therapist is which I will go more into below.This book was definitely a fast read for me. As someone who has read this entire series including the Bonnie, Eve, Joe trilogy in between, I am very happy that we have finally solved the Bonnie issue and that the author is moving on. I felt the series was just getting bogged down by the the “who killed Bonnie?” storyline and was losing its excitement. Bonnie was certainly still mentioned and a part of this book, but certainly not to the level as past books. I was glad that the author started introducing some new charachters in this book as well including Beth Avery, Eve’s half-sister who was unknown until this book. I see this storyline developing in future books. This book also introduces us to Kendra Michaels, a music therapist, who has special sensory abilities since being cured of her 20 year blindness. I did not know that Kendra was actually introduced in another book, Close to You, I believe. Had I known this I definitely would have read this first to get to know her better. I see the author breaking off to another series starring Kendra in the future as well as she did with the character of Catherine Ling. These new characters are exciting to me and am looking forward to how they are incorporated into future books in the series.Now that we have taken care of the Bonnie situation, I am wishing that the Eve Duncan books would go a bit more back to focusing on her forensic sculpting cases. I know this is why I fell in love with this series reading about how she did a reconstruction and the case that developed from this missing person. The series seems to have drifted away from this which is disappointing.Now, all that being said, I have to comment on my huge frustration with the author’s clear lack of research on music therapy and music therapists. Yes, I myself actually am a board certified music therapist (MT-BC) who works with patients in a hospital setting, so I know what I am talking about. Yes, this makes me a bit more in tune with this issue, but I think authors have a responsiblity to research and characterize people correctly. Music therapists and music therapy as a field is already highly misunderstood in the world, so mischaracterizations in popular media is not helpful. So here goes my education and advocacy for all who care. The author fell right into some common misconceptions about music therapy throughout the book. It seems that this charachter Kendra, a music therapist, has all sorts of education in psychology, etc. (PhDs), but no formal education in music therapy specifically. Yes indeed to be a music therapist you must actuallly study and get a degree in Music Therapy, not simply related fields. A very small point, I know, but it bugs me. Also the author committed a carnal sin in the music therapy world by having one of her characters refer to Kendra as a “musical therapist”. This phrase drives us MUSIC therapists crazy, it is music therapy, not musical therapy. This book doesn’t really talk much about Kendra’s clinical work, which is fine, but also which brings up the question for me, why did she even make this character a music therapist? It seems out of place since her work in this area is not at all important to the book. Was it because music therapy has been more in the media lately with Gabby Giffords, etc? Does she know a music therapist in real life? Did she want to jump on the band wagon on other popular authors having characters in their books who were music therapists, i.e., Jodi Picoult in ”Sing You Home”, who by the way did a FANTASTIC job of realistically portraying a music therapist? I don’t know the answer, but if you aren’t going to do the research, don’t put it into your book. Ok, I’m off of my Music Therapy education and advocacy soap box . . . for now Overall, a strong offering in the Eve Duncan series. Can’t wait for the next ones to come out in 2013!Happy reading,And remember,Books are Life,Heather"}, {"userName": "Madeline Dahlman", "userReviewDate": "Nov 18, 2012", "userURL": "http://www.goodreads.com/user/show/7159634-madeline-dahlman", "userReview": "I'm even surprising myself with that 1 star rating..but I can't in good conscience say it was \"ok\"...This is labeled as an Eve Duncan novel and I think it would have worked SIGNIFICANTLY better if it had been a stand alone...the premise is that Eve Duncan finds out that she has a long lost sister, Beth Avery, who has spent 20 years in a sedated state in a mental hospital. The news makes its way to Eve after Beth has managed to escape the hospital. Without spending an hour explaining all the details that made this possible and necessary, I'll just say that the book revolves around Eve finding Beth and trying to stop the violent cycle while understanding the reasons that Beth was shut away. What ruined this story for me is the lack of believable reason for Beth AND her boyfriend Joe to go on this wild bloody goose chase. They risk their lives and careers on more than one occasion (shocker) and almost every time justify it with the reason \"I can't allow someone to have been treated like this\". Ok, that makes sense as a statement once. But over and over and over? Not to mention the 10 other characters that were thrown in the story for a small role that links one shoddy set up to another. It was like characters used as band aids for a lousy story. This story would have been ten times better if 1 of 2 things had happened: 1) Eve had always known she had a sister, loved her, but just didn't know the evil reason she was institutionalized. or 2) The story had been a standalone where the sisters knew of each others existence. Obviously, you can't rewrite the entire Eve Duncan series to include this sister storyline, so it would have to be a standalone....Iris Johansen, you had a great story idea. But you bungled it by trying to capitalize on a popular series character. You sell enough books that you didn't have to do Eve the disservice of attaching her to this mess. More than disappointing."}, {"userName": "Alasandra Alawine", "userReviewDate": "Feb 28, 2015", "userURL": "http://www.goodreads.com/user/show/8706109-alasandra-alawine", "userReview": "Sandra reveals that she had a illegitimate child (Beth Avery) before she gave birth to Eve. Beth's Father came from a wealthy family and they were desperate to cover up the fact he liked young girls. Sandra was forced to give Beth up and was warned never to speak of the child, and she didn't for years. But after Bonnie was kidnapped she hired a private detective to find Beth. Beth was given to relatives of Rick Avery (Beth's Father) to raise, and they packed her off to boarding schools as soon as she was old enough. Rick refused to stay away from him and she knew he was her Father, but understood it had to be a secret. Then she was supposedly in a skiing accident and was packed off to a mental institution from which she has now escaped, with help from Billy Newell. Sandra begged Eve and Joe to help find her. Eve and Joe leave for California and enlist the help of Kendra Michaels. Not only is Beth missing someone is trying to kill her.Eve and Joe barely get to Newell in time to save his life, with his help they find Beth but then the killer starts tying up lose ends and the people that can confirm that Beth was kept drugged up and confined against her will start dying. Someone is terrified that Beth will remember what happened the night before her accident. Rick Avery comes to California and contacts Beth he insist on seeing her alone, but Eve insist on going with her to meet him. Beth realizes everything Eve told her about Rick liking young girls is true and insist on leaving but the killer is waiting in their car, when Rick intervenes the killer shoots and kills him against his orders. He takes Eve and Beth to his shack where he has a particularly horrifying death in store for Eve, if Bonnie can't summon help in time.Event though Eve and Beth manage to survive the mastermind behind the killings gets away as no one can prove her involvement."}, {"userName": "Joel Anderson", "userReviewDate": "Nov 16, 2012", "userURL": "http://www.goodreads.com/user/show/7623527-joel-anderson", "userReview": "Having read all of the Iris Johansen books detailing Eve Duncan's search for her missing daughter Bonnie, I wondered where she would take the story and the characters once the mystery of Bonnie's disappearance was solved. In Sleep No More, she introduces a new character into Eve's life, a character who adds more mystery to the story of Eve, Joe and Eve's mother.The story is fast-paced as Eve tries to understand and relate to the new member of her family, and the high stakes game of murder intended to protect the political aspirations of a powerful family bent on burying old secrets forever. The story brings the regular \"good guys\" and several obvious bad guys together in a battle to protect Eve's new family member...though there seem to be some other bad guys behind the scenes. In the end, good seems to win, but evil is not totally erased. So, is the victory final or is there more to come?Well worth the read. I look forward to future stories of Eve Duncan and seeing how the new characters, good and bad, develop and their impact on Eve's life."}, {"userName": "Jodi", "userReviewDate": "May 24, 2013", "userURL": "http://www.goodreads.com/user/show/7517910-jodi", "userReview": "This is the first book I've read in this series. It sounded good on the back cover, kind of like a Kathy Reichs style of characters but that is where the similarities ended. I hated this book. The characters were moody and immature. At first her police officer/lover wants to be kept out of anything that would bypass the law, then he gets peeved (a whines about it for the rest of the book) that he wasn't included in the illegal break-in they conducted. Also, if a killer is after you and you know you just shot him badly enough to send him for medical help wouldn't you have gotten the hell out of dodge? He knew where you were holed up but NO, don't go back and say, \"Quick! We gotta get out of here!\" Instead take a shower and let everyone sleep through the night. Really? There were also too many characters in and out. And a Sherlock Holmes type character that was blind but got her sight back and now can use all her super senses to easily lead the main characters along is a bit silly. Especially, when that character is in and out conveniently. This book is a mess."}, {"userName": "Erin Pauley", "userReviewDate": "Jan 28, 2016", "userURL": "http://www.goodreads.com/user/show/25406729-erin-pauley", "userReview": "I was in the back seat of a car and it was a long drive so I picked this up and I have to say the first couple of chapters snared me. This is not a book I would ever pick up on my own at the store or anywhere except in a period of bored desperation and I wouldn't recommend it. The whole thing is just one huge cat and mouse game with characters that at times were so unbelievable I feel like this should be considered fantasy. I read the whole thing going back and forth between \"good guys\" and \"bad guys\" and when I got within the final thirty or so pages the ending was still nowhere in sight. Then, out of nowhere, the finale is just thrown together and forced on the reader. 340 pages of chasing each other and a bunch drek later, BOOM it was over. It ended in the most anti-climatic way possible and wouldn't you know it the ending was a happy one. This book made me feel like I could be a writer, as long as I didn't care that well read people would give this sort of review to my books."}, {"userName": "Shiela", "userReviewDate": "Nov 13, 2012", "userURL": "http://www.goodreads.com/user/show/1442342-shiela", "userReview": "If you get past the formulaic plot (and with Johansen, you HAVE to get past the formulaic plot because every single one of her books follow the same formula), this book wasn't half bad. I enjoyed learning about Sandra's past and it'll be interesting to see what she does with the two sisters. What I really don't like is the jilted dialogue and personality each new female character takes on. They are always stand-offish, bossy and generally someone you don't want to be around, although Eve ALWAYS wins them over, and their dialogue sounds as if it belongs on a day-time soap opera. You can be a strong, determined person without the attitude and the \"I don't need help from no one\" personality her characters always seem to portray."}, {"userName": "Ernest Martin", "userReviewDate": "Mar 19, 2015", "userURL": "http://www.goodreads.com/user/show/30632513-ernest-martin", "userReview": "Surprised this book has such a high rating as I didn't think it was very good. The characters were just too ... out there. Not a single character is normal, even though the story is to be odd and extreme but possible in today's world. And very much a let down on major events in the book, the author builds up the situation and then disposes of it in a couple of sentences. Overall, I read the whole thing so it wasn't so bad I didn't want to finish it but I wouldn't recommend it to anyone."}, {"userName": "Andreasoldier", "userReviewDate": "Oct 19, 2012", "userURL": "http://www.goodreads.com/user/show/5632437-andreasoldier", "userReview": "I told myself I was going to drop this author because these novels have lost their emotion and rely more and more on slick tricks to pull the story along. I gotta say the writing is tight ,moves fast and has some red herrings, but I'm not hanging on every word. Eve is started to bore, and new character Kendra is a little too woo-woo to be believable.At least I got it at the library."}, {"userName": "Michelle Cable", "userReviewDate": "May 17, 2012", "userURL": "http://www.goodreads.com/user/show/7829815-michelle-cable", "userReview": "It is a Eve Duncan book, what more do I really need to say. I felt like I learned more about Eve and Joe as a couple outside of the impact Bonnie had on them. I wasn't sure how the series was going to continue after Bonnie had been found, but this was a great way for that to happen."}, {"userName": "Richard", "userReviewDate": "May 17, 2013", "userURL": "http://www.goodreads.com/user/show/6185442-richard", "userReview": "Wasn't impressed."}, {"userName": "dragonsdy", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/5365602-dragonsdy", "userReview": "I adore this book. It was so great to be with Eve and Joe again soling a mystery. Love the new twist with Beth. It was an amazing read. I read it straight through. Wonderful. Will read again!"}, {"userName": "Fran", "userReviewDate": "Oct 19, 2012", "userURL": "http://www.goodreads.com/user/show/1032865-fran", "userReview": "Sleep No MoreIris JohansenA hired assassin paid to eliminate a mental patient because she is in the way. A killer quietly steals down the corridor of a mental institution, the nurse on duty on a break and the coverage nurse has not arrived. Unguarded, no security in sight, yet this is a high maximum facility, private nurses round the clock for special patients and yet no one sees this man. Creeping into Beth Avery’s room with the sole purpose of killing her and completing the job he was being paid to do. Bed plumped, body supposedly beneath the covers, imagine his surprise when she was not there. Hiding in a corner and quite agile she springs at him. The silent killer has no idea who or what he is up against being told that she was kept sedated and heavily drugged. Beth Avery proved to be quite an adversary. With the help of someone in the hospital and following his guidance and instructions Beth flees to freedom. But, now she is alone. Enter Eve Duncan and her mother Sandra who has an unusual request for both Joe. But, first Eve has a nightmare that takes her deep into the forest where Beth is running for her life and the nightmare mirrors the events that are taking place. As she recounts some of the nightmare to Joe they discuss the possible causes and her fears. We return to the killer and we meet more players that have a lot to lose if she is not found. Beth is not returned to the hospital but somehow those in charge have to make it look like she was. Rationalizing that she is not capable of fending for herself and trying to understand why Nelda Avery wanted her dead, his job is to find her, take her out and inflict pain and revenge on her for escaping. No one to trust at this hospital and no one on the outside to help her. Wherever you turn all they want is to put them to sleep: some soundly and others permanently: Sleep No More: Iris Johansen.As Sandra, Eve’s mother enters the picture and arrives at the Lake Cottage the events that happen will change Eve’s life forever. Sandra requests Joe’s help in finding Beth. You won’t believe the reason why and what she reveals as the link to this young woman on the run. An accident that caused her to incur brain damage and someone that wants her silenced. So, why does Sandra need their help? Why is she so bent on finding her? What makes both Eve and Joe suspicious of the conditions surrounding Beth’s accident? Sleep No More: Not if the pills wear off and Beth never gets caught. Iris Johansen at her best in this first rate novel but there is much more to come.Nelda Avery is vicious, devious and smart. Anyone standing in her way will be blown away in a puff of smoke. Nelda is concerned about only one thing, her son Ricky’s run for President. As long as her husband George funds the campaign he is useful. Foolish to think he matters to her and naïve to think she would keep him if he denied her what she wants. Thinking about Beth and planning to meet Joe to enlist the help of Kendra Michaels Bonnie appears. As Eve talks with Bonnie she learns more about Beth, why she is being drawn to her and her need to connect with her. Knowing where Bonnie is and that she was finally brought home does not make it any easier for her nor does she miss her less. But, Bonnie wants her to connect with Beth and helping Sandra seems to be the answer. When Joe goes to the mental hospital to see Beth he is stonewalled. Checking the person in the room he realizes that it is a decoy and not Beth.Kendra Michaels is devoted to her students and her mission is to help kids that are autistic and do music therapy. So, how was Eve going to convince her to help find Beth? Confrontations are interesting when Eve and Kendra come up against each other and Eve presents her own doubts as to whether she can help or not. As Kendra gets her back up against the wall and let’s Eve know that her tactics are old and used before. Then, Kendra relates to Eve more about her own life in the few minutes since meeting her that changes her perspective. Asking Kendra how she not only knew about Bonnie, her job and where they were staying and gives her an assessment of Joe that literally floors her. The discussion interesting and the end result quite remarkable as Kendra agrees to help them learn more about the mental hospital, what might really be going on and how she was able to manipulate her way in. As things progress Eve and Kendra learn more about each other and at times you cannot tell who is ahead. Kendra sees things in both Joe and Eve that they neither one notices or wants to admit. Eve sees through much of Kendra too. Going to the mental hospital should prove interesting and learn the truth behind Beth’s accident has not been revealed. When Joe, Eve and Kendra team up they find Beth and now the danger really begins? What are the plans to finally rid the world of this woman? Just how far will Drogan to complete the job he was being paid to do? What is Nelda’s real mission?As we hear the transcript from the doctor working with Beth and making sure that her memory is fogged and the facts remain twisted in her mind, what happens will definitely let you know that she is smart, not weak and will not allow him to overtake her again. What happens to Stella the nurse working with Pierce and what is Pierce’s final fate? Just how many are killed in order to do Nelda’s bidding? Will she pay the price?Betrayals, deceits, lies and cover ups all make up this outstanding novel as one woman’s life hangs in the balance and one woman tries to manipulate to end result. As you read pages 294-295 you hear the voice of Dr. Gelber trying to manipulate the subject meaning Beth with interjections by both Joe and Eve understanding what this man was doing and why he was considered a great hypnotist. Then, the accident is revealed in the transcript, the truth about Rick and his follies in black and white and the end result about Beth’s accident is finally revealed. Nelda Avery is a dangerous, evil and conniving woman who is not only rich but also thinks her power is so strong she is untouchable. As Kendra and Eve make their way through the mental hospital pretending to want to fund some money into it for music therapy, they become more attuned to what is going on there and hoping to find Beth. With the help of Sam Zackoff they hope to break into the hospitals records and find Beth. When the end is almost near both Beth and Eve are taken by this sadistic killer and what he intends to do to them will make your skin crawl. Just what he plans you have to read for yourself and how Bonnie comes to Eve’s aid will surprise not only Eve but the reader too. What is Rick’s fate? What finally happens to Beth? Why did they put Beth away? What does Rick finally reveal and will he be the next victim? Why did Rick allow Beth to be placed falsely in a mental institution? Why didn’t he fight his mother? What exactly did Drogan have planned? How far will Joe go to protect Eve? What is the final outcome? What is the fate of the hospital? When Kendra reveals that Beth was being poisoned, hiding her pills in her mattress and assesses her hospital room will the end be the same for Beth? Read Sleep No More and find out what happens when one forensic sculptor, one detective and one astute music therapist team up to find some that does not want to Sleep No More. Once again Iris Johansen has written a five star novel filled with suspense, twists, turns and definitely a surprise ending. What is next for Eve? Will she and Kendra team up again? Only the author knows the answer to that question and I guess we will have to wait for her next release? Fran Lewis: reviewer"}, {"userName": "Meghan", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/9300205-meghan", "userReview": "Talk about a shocker!! Eves Mom is the queen of secrets...qween! As expected with an IJ Eve Duncan novel Rhee is intrigue, shockers, love and friendship and some really cool friends that have neat abilities. I loved this story in general, as it has bits of action, suspense. Romance and more that should make it fun for all who read it, but I also appreciate the fact that this series has multiple strong women who work together to solve issues. Great series and enjoyable read."}, {"userName": "Evelyn", "userReviewDate": "Nov 21, 2017", "userURL": "http://www.goodreads.com/user/show/20233174-evelyn", "userReview": "Sleep No More (Eve Duncan #15) by Iris Johansen. When Eve's mother wants her help to find an missing mental patient, Eve calls a friend to help. A friend who has special instincts who was blind for many years and now sees what most people miss. Who is this mental patient? and why is it so important to her mother that this patient be found?"}, {"userName": "taylor", "userReviewDate": "May 17, 2017", "userURL": "http://www.goodreads.com/user/show/9029373-taylor", "userReview": "I am quite a big fan of the Eve series, this was an interesting book from what I remember I read it quite awhile ago. I liked the whole secret sister angle and her being in the asylum for her entire life and not knowing about anything. I just want to say I loved this book and enjoyed it."}, {"userName": "Ruth Ellen", "userReviewDate": "Sep 04, 2017", "userURL": "http://www.goodreads.com/user/show/8680384-ruth-ellen", "userReview": "Eve's mom show up and reveals that she (Eve) has a sister. She is missing from a mental facility. Eve and Joe go and try to find her. Eve is introduced to Kendra Michaels inn this book. See what happens."}, {"userName": "Charice Lind mehring", "userReviewDate": "Aug 22, 2014", "userURL": "http://www.goodreads.com/user/show/17840812-charice-lind-mehring", "userReview": "This book was a total mind bender. It goes to show how far people will go to get what they want out of life no matter the cost or who gets hurt in the process. Bodies pile up throughout the book and keep you on your toes to the very end."}, {"userName": "Grace Mcmann", "userReviewDate": "Sep 28, 2017", "userURL": "http://www.goodreads.com/user/show/19128764-grace-mcmann", "userReview": "I really enjoyed this Eve Duncan adventure...I liked that the author has expanded Eve's family and also included Bonnie appropriately. It would be interesting to revisit the characters in a future novel."}, {"userName": "Sandy Gurile", "userReviewDate": "Feb 13, 2018", "userURL": "http://www.goodreads.com/user/show/40556673-sandy-gurile", "userReview": "Interesting book ... I enjoyed it very much!"}, {"userName": "Trudy Speelman Derryberry", "userReviewDate": "Mar 09, 2017", "userURL": "http://www.goodreads.com/user/show/5408041-trudy-speelman-derryberry", "userReview": "I read poor reviews, but I enjoyed this book!"}, {"userName": "Joe", "userReviewDate": "Apr 07, 2018", "userURL": "http://www.goodreads.com/user/show/589610-joe", "userReview": "I enjoyed this book very much.I like the character of Eve Duncan, a forensic sculptor, but I was really interested in Kendra Michaels who has a very small part in the book. I like the book ."}], "description": "From the #1 New York Times bestselling author Iris Johansen comes a new thriller that will have Eve Duncan questioning everything she thought she knew about her family and her past\nOne woman held captive for decades…\n\nAnother one freed by the truth…\n  Forensic sculptor Eve Duncan knows what it's like to be haunted by the past.  For years after her daughter Bonnie was stolen from her, she fought for closure.  But now as she's striving to begin anew, she can't shake the feeling that something terrible is about to happen—or maybe already has.  When her mother, Sandra, asks for help in finding a missing friend named Beth Avery, Eve is sure that she's hiding something.  It’s odd that Sandra would get involved at all, and the fact that she adamantly refuses to go to the police for help reinforces Eve’s suspicions that something is very wrong.Eve learns that Beth has been locked away in a mental hospital for years, which makes it even harder to understand how she could have disappeared. As Sandra reluctantly reveals small pieces of the truth about Beth's identity, Eve is shocked to discover that their lives are strangely entwined, and Beth's disappearance now puts them all in grave danger.Desperate, Eve enlists a secret weapon to pick up Beth's trail: rogue profiler, Kendra Michaels. With an uncanny ability to detect clues and solve puzzles, Kendra begins to uncover the bizarre circumstances of Beth's escape from what should have been the safety of her hospital room. Beth is on the run, and as her mind clears--detoxing from the drugs that have held her prisoner--she begins to see the threads of a twisted plot within the powerful Avery family, threatening to destroy Beth and anyone else who might jeopardize the high-stakes game that is already in play.", "title": "Sleep No More\n      \n          (Eve Duncan #15)", "url": "http://www.goodreads.com/book/show/13538710-sleep-no-more", "average": 4.07, "cover": "https://images.gr-assets.com/books/1339076545l/13538710.jpg", "reviews": 367, "authors": [{"url": "https://www.goodreads.com/author/show/32498.Iris_Johansen", "name": "Iris Johansen"}], "type": ["Mystery", "Suspense", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/13538710-sleep-no-more", "http://www.goodreads.com/book/show/15794861-sleep-no-more", "http://www.goodreads.com/book/show/78131.The_Killing_Game", "http://www.goodreads.com/book/show/272264.The_Face_of_Deception", "http://www.goodreads.com/book/show/94299.The_Search", "http://www.goodreads.com/book/show/272279.Body_of_Lies", "http://www.goodreads.com/book/show/8702806-eve"]}