{"ratings": 133, "userreviews": [{"userName": "Carolyn", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/4886644-carolyn", "userReview": "This book is about Pentwater, written by someone who loves Pentwater as much as I do...is it any wonder the book gave me warm fuzzies, even though it's about winter?"}, {"userName": "Tomi", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/63185771-tomi", "userReview": "The premise of the story was good - a writer finding her mojo. But the main character had to be the whiniest, most self-pitying person on the planet. The characters were so one-dimensional, the author had to create drama filled conversations that really went nowhere. The book tried really hard to be chick lit, but the snow storm scene was awful and the book really went downhill from there. No point and a pointlessly boring conclusion."}, {"userName": "Linda", "userReviewDate": "May 26, 2017", "userURL": "http://www.goodreads.com/user/show/2558245-linda", "userReview": "Ok bookI found this book hard to get into for awhile. It was easy for me to put it down and leave it for a couple days. For me, the story picked up about the last quarter. I did notice there are quite a few spelling and grammar errors which drives me crazy."}, {"userName": "P M", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/15776166-p-m", "userReview": "I really liked the theme of the book. I'm fairly certain a lot of women who have let marriage and kids take over their lives and have put their priorities on the back burner can relate to this book. I also liked the fact that the author has delved into a topic where the protagonist tries to bring together two cultures and tries to keep hers from withering away even though she lives elsewhere. The idea of self-conflict and self-resolution is something that everyone goes through at some point in life and I liked reading about it in a book.That being said, right from the start, I felt the book lacked a natural flow. I felt the author had roughly put together ideas without weaving it together. I had to go back and forth several times to get things right. There are instances where the past is being reminisced and I understand that but then there should be a link between that and the present and I felt that lacking throughout this book.It took me a while to understand what the basic theme was. I was under the impression that the main character is off to find her family history or to renew her old ties for a long time at the beginning of the book.I also felt that the addition of other characters and their conflicts and emotions should have not been delved in with this amount of detail. It distracted me from the actual story line. I felt Kate's saga of self-discovery was somewhat derailed by the amount of time spent on irrelevant issues.I felt the title too was a little misleading. The story is of one woman's journey into herself and the various relationships she holds dear but the title almost makes it feel like a couple of friends and their respective lives. The term has been mentioned multiple times in the book but I couldn't make the connection.Last but not the least, I found a lot of errors in spelling and grammar. It is really distracting and these are all avoidable mistakes, something that could have all been corrected had the book been edited properly.I would like to encourage the author to continue writing without getting side tracked by too much of attention to detail and also to pay attention to the small things in the book like grammar."}, {"userName": "Terri Tinkel", "userReviewDate": "Feb 17, 2013", "userURL": "http://www.goodreads.com/user/show/7323772-terri-tinkel", "userReview": "This story is about an American female writer who had written one book. She falls in love, gets married, has children, moves to Ireland and suddenly has created a different life from the one she had expected to live. She goes back to a summer home in America, with her husband's blessing, to try to find her way back and write again. As she spends time in the small town, during the off-season, she finds some information that gives her an idea for another book. However, she has to return to her life and try to carry out her writing plans. She doesn't want to offend anyone and often, supresses her own interests to please others in her life. In the end, she finds out what really matters. It reminded me of a Ricky Nelson song ~ GARDEN PARTY.\"But it's all right now, I've learned my lesson well You see, you can't please everyone, so you've got to please yourself.\""}, {"userName": "Diane", "userReviewDate": "Feb 24, 2015", "userURL": "http://www.goodreads.com/user/show/5246393-diane", "userReview": "I enjoyed this book about friendships and families. The term Snow Soldiers is a shared expression between two friends. As they age and make choices, each one reflects on the good and bad they have experienced. Some paths in their lives are determined by family, and not necessarily what they thought their life would become.Although I thought Kate's being 'exiled' to her family vacation home to find her focus was a bit extreme. It worked, but how many spouses would really support a mother being away from family and home to have the solitude to examine her future focus for life?The book is a good read and the story sends a renewal of hope for any mother who has put aside her own talents and career to devote herself totally to the family.Enjoy!"}, {"userName": "Wendy", "userReviewDate": "Jan 19, 2013", "userURL": "http://www.goodreads.com/user/show/9293627-wendy", "userReview": "I loved this idea! I really was jealous of the main character getting the time out of being a busy mom to go find herself again. There wasn't a lot of suspense or any real drama. Just someone finding out who she used to be before the craziness of mother hood takes over. There are a lot of typo errors and some grammar things that made me feel like this wasn't quite ready to be published. We should still hold ebooks to the standards of something in print...we wouldn't expect a printed book to have a lot of errors (maybe a few, but not this many), so why are we expected to overlook that in the ebook format? Still a good story, could have been beefed up a bit more."}, {"userName": "Heidi", "userReviewDate": "Mar 31, 2013", "userURL": "http://www.goodreads.com/user/show/897066-heidi", "userReview": "This book made me think about about how I view myself. It made me think about my roles in life and how I fulfill them. It made me wonder if I have changed in ways I wouldn't want to.That being said, it could have used a good editing. There were so many mistakes it drove me crazy. The author was also quite liberal with her use of adult language and it never was necessary. Also, every person in the book had 2 children or just one sibling. It seemed very unrealistic and annoying. I understand that is pretty normal, but I have friends that have 3, 4 and more children. Anyway, it was the little details that threw it off."}, {"userName": "Charlotte", "userReviewDate": "Feb 01, 2013", "userURL": "http://www.goodreads.com/user/show/580517-charlotte", "userReview": "Athough the book kept my interest throughout, I found the spelling and punctuation errors annoying. I am not counting the British spellings of words; those I understand. However, it seems every time the author meant to say \"where\", the word \"were\" appeared instead. Instead of the plural \"parents\", the word appeared as \"parent's\". Instead of \"their\", the book had \"they're\". The commas were omitted in compound sentences.  However, the author did a good job of character development and let us readers see inside the mind of the main character, Kate."}, {"userName": "Dana Kennedy", "userReviewDate": "Dec 31, 2012", "userURL": "http://www.goodreads.com/user/show/14327614-dana-kennedy", "userReview": "There were parts of this book that I loved and would have given 4 or 5 stars, but other parts made my mind wander and I had a really hard time getting through. I could really relate to the idea of losing yourself in motherhood and marriage, and I also have the same struggles with my family and friends and the place that I love being across the ocean...I on the other hand have only had the opportunity to visit once, so I had a hard time feeling sorry for her once a year visits."}, {"userName": "Heidi", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/13455508-heidi", "userReview": "The kindle edition was so poorly edited that it impacted my enjoyment of the book. Too many grammatical and spelling errors to count. If they could go back and re-work this story with proper spelling and grammer then update it for kindle readers I would consider finishing the title. At this point I'm removing it from my kindle and moving on to another book."}, {"userName": "Áine", "userReviewDate": "Jan 02, 2013", "userURL": "http://www.goodreads.com/user/show/5905725-ine", "userReview": "The story was not bad, but the writing was in need of editing. There were a lot of grammatical errors (missing words, incomplete sentences, run-on sentences) and there could have been some improvements on certain aspects of style. Nonetheless, it was a free ebook, and as such it was an enjoyable read."}, {"userName": "Michelle Lafreniere", "userReviewDate": "Jul 05, 2013", "userURL": "http://www.goodreads.com/user/show/16135598-michelle-lafreniere", "userReview": "Loved loved loved this book! Not something I can explain other than I live in michigan have my whole life. Reading this I can picture the towns that I have actually been to. All in all I loved reading this book."}, {"userName": "Joni", "userReviewDate": "Jan 05, 2013", "userURL": "http://www.goodreads.com/user/show/5196563-joni", "userReview": "A story of a young mother who was gifted (by her husband) some time to herself to rediscover her identity as an individual. A beautifully written story of how friends, family, memories and most of all, love, shape our lives."}, {"userName": "Claudia Harrington", "userReviewDate": "Jan 21, 2013", "userURL": "http://www.goodreads.com/user/show/1004847-claudia-harrington", "userReview": "I don't know what I was expecting with this book, but it was like reading someone's Journal. I was mostly curious as to where the story was going, but like a journal entry it was just someone's life story and not that interesting at best. So I really don't know what to say about this book."}, {"userName": "Kari Stern", "userReviewDate": "Jan 17, 2013", "userURL": "http://www.goodreads.com/user/show/14525177-kari-stern", "userReview": "the story wasn't bad, but the spelling and grammatical errors were very distracting. a little more sappy than the books I usually prefer."}, {"userName": "Kathy", "userReviewDate": "Jan 22, 2013", "userURL": "http://www.goodreads.com/user/show/7746159-kathy", "userReview": "It was OK but there were a lot of grammatical errors and misspellings that were distracting."}, {"userName": "Chris Caughey", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/21849819-chris-caughey", "userReview": "Excellent book about life, backward steps we all take and find your way back with a friend."}, {"userName": "Lynda", "userReviewDate": "Feb 15, 2013", "userURL": "http://www.goodreads.com/user/show/522549-lynda", "userReview": "Enjoyed"}, {"userName": "Nikki Grant", "userReviewDate": "Feb 03, 2013", "userURL": "http://www.goodreads.com/user/show/13786436-nikki-grant", "userReview": "It was ok. I was looking for more of a plot or maybe a little more excitement."}, {"userName": "Jen", "userReviewDate": "Jan 04, 2013", "userURL": "http://www.goodreads.com/user/show/2676364-jen", "userReview": "I enjoyed the book. It is about a woman who has lost herself in the 're of mother & rediscovering herself. My only issue was the need for editing."}, {"userName": "Staci", "userReviewDate": "Jan 03, 2013", "userURL": "http://www.goodreads.com/user/show/6174228-staci", "userReview": "This is a book that goes no where. The plot never takes off, some of the writing is redundant and there are multiple grammatical errors."}, {"userName": "pcb", "userReviewDate": "Jan 14, 2015", "userURL": "http://www.goodreads.com/user/show/2056915-pcb", "userReview": "Interesting premise. Kindle edition needs editing."}, {"userName": "Cindy", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/2184751-cindy", "userReview": "A young woman returns to the home her family spent summers at to try to get back into writing. It's a good story of how she found herself and her interaction with her best friend and her relatives."}], "description": "Kate seemed to have an idyllic life. A husband she loved, two little boys that were the center of her life, and even a mother-in-law who adored her. So why was she being packed up and shipped off from her home in Ireland back to her own country? Was it really up to everybody else to tell her she needed to find herself again?But, when she's reunited with her best friend and the other women in her life she left behind, the key to the person she once was dangles in front of her enticingly. Will she be able to reach out and grab it?", "title": "Snow Soldiers", "url": "https://www.goodreads.com/book/show/17191738-snow-soldiers", "average": 3.32, "cover": "https://images.gr-assets.com/books/1361897317l/17191738.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/6473056.Carrie_Crafton", "name": "Carrie Crafton"}], "type": ["Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/17191738-snow-soldiers", "http://www.goodreads.com/book/show/18877685-after-home", "http://www.goodreads.com/book/show/27774168-holding-back-daylight", "http://www.goodreads.com/book/show/20404251-something-found", "http://www.goodreads.com/book/show/18347362-something-found", "http://www.goodreads.com/book/show/17252771-something-found"]}