{"ratings": 4862, "userreviews": [{"userName": "C.G. Drews", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/11375137-c-g-drews", "userReview": "[frikkin' tattooed his girlfriend's name on his arm when she was lowkey avoiding and fobbing him off. LIKE MATE, GET THE SIGNALS. SHE'S ABOUT TO DUMP YOU. DO NOT TATTOO ANYTHING FFS. (hide spoiler)]"}, {"userName": "HFK", "userReviewDate": "Nov 25, 2017", "userURL": "http://www.goodreads.com/user/show/52263626-hfk", "userReview": "The whole time I was reading Solo, I was thinking someone extremely talented, sexy and beautiful. Thinking was not enough though, I had to blast this extremely talented, sexy and beautiful out of my speakers with an addition of extra bass.That is probably due to all the Lenny Kravitz references Solo has that makes me picture our main character Blade Morrison as younger version of Lenny. And that ain't a bad thing. I mean is there anyone who does not a) like Lenny Kravitz and b) think he is damn and too beautiful for a man?Even Solo is a story of Blade's (a son of a addicted rock star and guitar virtuoso) journey of finding himself from the hills of Hollywood into the jungles of Ghana, what Solo ultimately is, is a poetic love song to everything Rock and Roll.Solo is quite a lot of this, only the miserable side of it that we can't much laugh about:Solo is quite a lot of guitars:Solo is quite a lot of the teenager love that hardly ever ends good:Solo is told in poetic verses, and even though I did not find much beauty in it, I adored how rock and roll references moved the story along. If you know your rock, you will no doubt enjoy this one quite a much.(although one could argue that Metallica references should be done through Master of Puppets instead of Enter Sandman, but then again, it would not be never-never land).From the first world problems to the third world problems, I truly enjoyed this piece of only few words. There is a lot of things that should annoy me, there is a lot of things that speak favor for critical eye when mirroring humanitarian aid, and this was a very welcomed point of view from my part.Sometimes it does not require a lot of words to tell a meaningful story, and Kwame Alexander is an great example of that.Fan of rock? Need some books for your boys? Keep on rockin' with this one, and you should be more than fine."}, {"userName": "Kate Olson", "userReviewDate": "Jul 29, 2017", "userURL": "http://www.goodreads.com/user/show/13650342-kate-olson", "userReview": "Thank you to the #kidlitexchange network for the review copy of this book - all opinions are my own. SOLO is a rip-through-the-pages, can't-put-it-down poetic YA masterpiece. Told in text messages, song lyrics and conversations in verse, it tells the story of an alcoholic and addict rock star's son. Blade has been burned by his father time after time and is still actively mourning the death of his mother years before, when he receives life-changing news that sends him on a quest across the world. This book completely blew me away and showed me a side Kwame Alexander I haven't read before, and introduced me to the work of Mary Rand Hess. The soundtrack of this book is a who's who of classic rock and roll and stuck in my head the entire time I was reading. For teen readers, this would be a great introduction to the rock classics they may have not been introduced to yet. Required purchase for high school libraries."}, {"userName": "Sesana", "userReviewDate": "Aug 19, 2017", "userURL": "http://www.goodreads.com/user/show/5172893-sesana", "userReview": "[The \"you're actually secretly adopted\" plot is about twenty years out of date. Private adoption or no, it's vanishingly unlikely for anybody to hide from their own child that he was adopted until he was 18 anymore. (hide spoiler)]"}, {"userName": "Jodi Meadows", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/4011205-jodi-meadows", "userReview": "I absolutely loved this book. It was so beautiful and moving, and I'm really happy I listened to the audio. Not only is Kwame an excellent writer, he's an amazing reader as well. I really fell into this story. There was so much passion and emotion behind the words: the way music heals, the force of family, and the magic of finding oneself. I can't wait to recommend this book to everyone."}, {"userName": "Kim Clifton", "userReviewDate": "Aug 04, 2017", "userURL": "http://www.goodreads.com/user/show/27894457-kim-clifton", "userReview": "I think what gets me in Kwame Alexander's books is how relatable the characters are, even if their lives and interests are completely different from mine. This book, however, had characters who were so outlandish I found it hard to even want to care about them. I understand that the book is about Blade's self-discovery, but does he really need to travel halfway across the world to realize he's got a good thing at home? His sister calls him out on \"first world problems\" almost immediately, and things don't sink in until he's in Ghana. Oh, honey. One more criticism: Everyone talks about how brilliant Blade's songs are, but the samples we get are pretty bland. Alexander knows how to write poetry, and there are some beautiful sections in Solo, but none of them show up as lyrics. It's kind of a let down, actually. The audiobook tries to make up for it by turning Blade's lyrics into actual songs (with guitar and everything), but they get repetitive real fast."}, {"userName": "Bridget", "userReviewDate": "Mar 28, 2017", "userURL": "http://www.goodreads.com/user/show/4823153-bridget", "userReview": "Kwame Alexander has a thing, poem (or in this case lyric) packed books with particular appeal to teenage boys. That is such a wonderful thing! The boys at my school lap up his books, he writes sport so beautifully and he has such great things to say to his audience, thing like, you can be great even if you are not the greatest at this one thing, it is ok to show weakness, you don't have to be That Guy all the time - you can be you and it will be fine. This particular book is the story of a young man who has it all, he has money, he is loved, has talent and who is the son of one of the world's most famous rockstars. He is about to graduate high school and it should be the beginning of fabulous new and exciting times at college, unfortunately the challenges in his life have become more than just annoying, his dad is living the rock and roll lifestyle to it's extreme and has used every rehab available, his sister has made the most cringeworthy record and there is plenty more to deal with, but that is ok, life is still ok, isn't it? Then love makes a fool of him and his poor hurt heart needs to heal. The next bombshell hits and he realises that there is healing to do that he can only do by himself. What he decides to do is brave and wild and will change his life forever.It is a really good book, I liked it slightly less than The Crossover, but that was always going to be a hard act to follow. Kwame is awesome. Thank goodness for Kwame and for his making reading cool for some of the most non-readerly boys. Thanks to Netgalley for giving me access to this great book."}, {"userName": "Amanda", "userReviewDate": "Dec 12, 2017", "userURL": "http://www.goodreads.com/user/show/5476515-amanda", "userReview": "4.5 stars. This was fantastic. I highly recommend the audio (available on hoopla) read/sung by the author."}, {"userName": "Gerardo Delgadillo", "userReviewDate": "Sep 15, 2017", "userURL": "http://www.goodreads.com/user/show/8226952-gerardo-delgadillo", "userReview": "Phew. What a ride. I listened to the audiobook and, man, it's SO good. Highly recommended."}, {"userName": "Amy Nicole", "userReviewDate": "Jul 24, 2017", "userURL": "http://www.goodreads.com/user/show/4750774-amy-nicole", "userReview": "This book was all over the place, just like my feelings towards it. I loved The Crossover, but this book seemed to be overly dramatic with the plot. I didn't connect with these characters much at all because they felt much more like caricatures instead of genuine people. Positives & Negatives - + I love the way real songs are scattered throughout the book. I pulled them up and listened to them while reading and it made for a really interesting experience.+ The idea that this is a music family fits perfectly with the verse format since it’s so lyrical. + I absolutely loved the little music trivia bits dropped into the story. If the story was more that and less angsty drama, I would have been happy.- The characters are really really cartoony and stereotypical. Some of the events just seem over the top. - The PK is literally named Chapel… and Blade & Chapel's romance is very toxic. - Is he really going to have cell phone reception in a village so remote he had to walk 3 miles to get there and without changing his SD card to an international card?- The plot was all over the place and didn’t flow well…. Hard to explain more than that without spoiling it, but the “conflict” changed about five different times without any real resolution. Lenny Kravitz - Thinking of You The Black Keys - When the Lights Go OutRobert Johnson - Cross Road BluesBob Dylan - I Was Young When I Left HomeGuns N’ Roses - Welcome to the JungleMetallica - Enter SandmanFela Kuta - Zombie Don McLean - American PieJimi Hendrix - The Star-Spangled Banner (Live)U2 - With or Without YouVan Halen - Right NowAretha Franklin - (You Make Me Feel Like) A Natural Woman"}, {"userName": "Lata", "userReviewDate": "Dec 29, 2017", "userURL": "http://www.goodreads.com/user/show/13126933-lata", "userReview": "Enjoyed this story of a young man dealing with his father’s addictions and other pressures, as well as lingering grief over his mother’s death years earlier. Blade’s family is famous and wealthy, thanks to his father’s music career, so Blade has a level of comfort and privilege in his life, giving him time and the means to travel to Ghana when a long held family secret comes to light. Blade is grieving and confused and angry when he arrives in a small town in Ghana, looking for answers. There, he becomes aware of the disparity between his life and those in the town, but Blade also begins dealing with his mental turmoil. Though Blade and his father manage to deal with a little of the pain between them, there are no neat bows on the end of this story, which I liked.Kwame Alexander’s verse is lovely, and Blade’s poetic self is beautifully expressed. I listened to this book, and was able to appreciate the author’s words and the rhythms of the feelings of the characters."}, {"userName": "Patrick", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/5843194-patrick", "userReview": "Loved it. Prose. Poetic. Beautiful. A son. A father. Rock and Roll. Addiction. Africa. Finding home and family..."}, {"userName": " ✨ Dianna ✨ (mylifeasannaidreading)", "userReviewDate": "Dec 07, 2017", "userURL": "http://www.goodreads.com/user/show/22594701-dianna-mylifeasannaidreading", "userReview": "3.75/5 stars\nSolo\n tells the story of seventeen-year-old Blade Morrison, the son of rock superstar Rutherford Morrison. He's kind of have a lot going on his hands, like trying to juggle sneaking with his girlfriend (her parents hate him) and keeping up life with his father and his many addictions. Paparazzi bombard his life one embarrassing news of his father after another, making their family a tabloid laughingstock. Blade can barely keep up, what with the turmoils of young love and family problems and then one day everything he believed in became a lie. So comes a journey of finding meaning in life and music halfway around the world. And finding happiness in unexpected places.This is a YA story, told in a somewhat poetic-verse, text messages, and song lyrics. At first, I didn't like it because it felt like the author is trying to make the story seem a lot more special, extraordinary than what it really is: just a privileged teenager whining about everything wrong in his life. You see, the writing style struck me somewhere between Michael Faudet's and Lang Leav's style. The whining sounded like Faudet, just a lot more innocent and not perverted in any way. And the more profound and lovesick parts reminded me of Leav. The protagonist was kind of annoying to me, at least until 40% through. Blade's a bit self-absorbed, lost in his so-called \"end of the world problems\" and never seems to realize that he's acting like a jerk more often than he could admit. He's also super privileged, thanks to his father's rock and roll stardom. And although he declares that he despises everything about his father, he can't make up his mind about the comforts it brings to his life. Like when his girlfriend was upset, he offered \nto take her shopping in his father's Maserati.\n Hmm...I'm just glad his old friend Robert took him on that and called out his bullshit: let me get this straight. You're living up in Hollywood Hills with a pool and tennis court, and a lady to clean your underwear and cook you tacos on Tuesdays, and you're living in hell. You got first world problems, Youngblood.\"And still, Blade shoved a wad of hundreds of dollars in his friend's trumpet case even after he said he don't do charity. *facepalms*He can't own up to his actions and gets upset when people call him out. Like when his sister Storm said, \n\"I'm sick of his holier-than-thou-we're-all-bad-and-he's-a-saint attitude. He benefits from our lifestyle, and pisses on us.\"\n And Blade never said sorry after bursting on his father and sister, and making them crazy worried after he busted out. Dude, you're sick.I'm probably making it sound way worse than how it really is. I'm sorry, I just really have a low tolerance for whiny-ass characters. PLEASE DON'T BE DISCOURAGED BECAUSE IT GOT BETTER! THANK HEAVENS!My favorite bit has got to be Confession: Everybody loves music, Blade. Music is story.It is the language of love and happiness.Me and love have not gotten along too well; happiness isa foreign country, and my passport hasexpired.Blade quickly matured before my eyes. He's thrust upon a life-changing journey where he got to make new friends, repair his relationship with his family, see life in a different light, and the disproportionate correlation of money and happiness.Now I liked it way more than I thought I would.But why only 3.75 stars? That must be because there were so many rock and roll/music references for my taste. If you're well versed in those, then I think you'll like this even more. Also, I wished there was was more. Not enough of an ooomph for me to give it a higher rating. But it's good."}, {"userName": "Lorrea - WhatChaReadin'?", "userReviewDate": "Jul 31, 2017", "userURL": "http://www.goodreads.com/user/show/7471412-lorrea---whatchareadin", "userReview": "Blade Morrison has reached a pivotal point in his life. He's graduating from high school, about to turn eighteen and has his whole life in front of him But with a famous father who is always in the media and a girlfriend whose parents can't stand you, it's hard to find your place. When Blade discovers something about his past, it will change his future forever. Set on two continents, inspired by rock and roll, and written in poetic verse Solo is one of the best books I have read this year. Thank you to Kwame Alexander, Mary Rand Hess, and Blink YA for the opportunity to read and review this book and be a part of the Solo Launch Team.This is the first book I have read by Kwame Alexander or Mary Rand Hess and I have already picked up another at the library. This book was built on a love of music. Every character has a connection to music in some way shape or form. Blade is your\u007ftypical teenage boy, but for the fact that he has a famous father, Rutherford Morrison who is a rock and roll star who has fallen from grace. Often in the media because of an incident involving drugs or alcohol, Blade is tired of being there to pick up pieces that eventually fall apart again. After the loss of his mother Sunny, the family was never the same. When Blade discovers something about his past and given a letter his mother wrote to him for his 18th birthday, he sets out on a quest to find out where he really belongs. Full of love, loss, addiction and music, Solo, although written for the YA crowd is a book people of all ages can enjoy.\u007f"}, {"userName": "Amanda - Cover2CoverMom", "userReviewDate": "Oct 03, 2017", "userURL": "http://www.goodreads.com/user/show/28169716-amanda---cover2covermom", "userReview": "Feelings in a few thoughts: YA book in poetic verse ¤ the writing in parts of this book were absolutely stunning, but not as much in others - made the flow of the book feel messy ¤ I feel like this book would be appealing to teenage boys - which isn't always easy to do ¤ I enjoyed the second half of the book much more than the first - especially when Blade arrives in Ghana ¤ really enjoyed how rock music is such a big part of the book ¤ audiobook well done - made it feel more authentic"}, {"userName": "Miss Nuding C8B", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/64760507-miss-nuding-c8b", "userReview": "If you're looking to learn how to effectively narrate through verse, Kwame Alexander is your man. His writing style is like no other and you can hear his voice through the words on the page.This wasn't my favorite story line, and I found myself getting frustrated with Blade's dramatic character quite often throughout the book. Kwame's writing is what pushed the story along, though."}, {"userName": "Krista Regester", "userReviewDate": "Dec 22, 2017", "userURL": "http://www.goodreads.com/user/show/53724042-krista-regester", "userReview": "Kwame Alexander sure does have a way with words. This book was much different then what I thought it would be, and I am SO glad that I read it. Blade is not exactly the average teenager but his experiences definitely have a familiar tone. As he matures in age and mind he discovers that not everything revolves around him and his small world."}, {"userName": "Kristy K", "userReviewDate": "Jan 27, 2018", "userURL": "http://www.goodreads.com/user/show/32383826-kristy-k", "userReview": "4.5 StarsKwame Alexander can write a novel in verse better than anyone. He has those gut-punching moments interspersed with comedy and his characters are incredibly relatable."}, {"userName": "Mimona masarwi", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/22131104-mimona-masarwi", "userReview": "Honestly, in the end, I got really confused! The book is unquestionably is written nicely.\"Blade\" the main character, his emotions and his thoughts were portrayed too real, that anyone will get from where he is coming, yet the book doesn't really have a lot of stressful points. There were some turning points here and there, except I was curious if the last pages will have a more stressful event, but that was not the case!In the end, there were tears and sad emotions, however, that's not what I really wanted to see!again, I did enjoy reading it, but I think I have expected more since the book received a lot of attention when it came out!***Anyway, the book is nice and cool, I didn't feel that there was a hole in the way the author portrayed the emotions, it is just that I had expected more..."}, {"userName": "Joyce Yattoni", "userReviewDate": "Sep 24, 2017", "userURL": "http://www.goodreads.com/user/show/15743014-joyce-yattoni", "userReview": "If you like rock and roll this book is for you. A book in verse by one of my favorite authors, Kwame Alexander. Blade's story is one about heartache, disappointment, love. The author uses a rock and roll soundtrack to compare what Blade is going through in his life. An 18 year old who has a drunk for a father, lost his Mom then finds out he is really adopted and gets played by the \"love\" of his life. I enjoyed Blade's character. He is a very talented musician and song writer, tops in his class, loves hard, responsible, respects all kinds of people and grounded. When Blade has had enough he treks off to Ghana 🇬🇭 to find his bio mom."}, {"userName": "Susie", "userReviewDate": "Jul 26, 2017", "userURL": "http://www.goodreads.com/user/show/5358527-susie", "userReview": "I wanted to love this, like I loved The Crossover by this same author. Unfortunately, it just didn't meet my expectations."}, {"userName": "Cassandra", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/22224742-cassandra", "userReview": "This was inspiring and heartbreaking, like all good books about music, finding yourself, and in this case, exploring the world around us. I’ll type up a coherent review once I’m no longer on a taxiing airplane."}, {"userName": "Brooke", "userReviewDate": "Nov 09, 2017", "userURL": "http://www.goodreads.com/user/show/13662036-brooke", "userReview": "Blade Morrison dislikes his life. In fact, it's pretty much safe to say he hates it. As soon as he graduates HS, he can't wait to leave his family behind. Coming from a \"rockstar\" family, including his father struggling to stay sober, & a sister who's trying to follow in her parent's footsteps, Blade would do anything to get away from them. Enter convenient plot lines! Blade finds out that *gasp* he's adopted. His wish has been granted, now all he needs is to sever the ties with his girlfriend, Chapel, which isn't really a problem anyways considering the fact she's seeing another guy. Now Blade is free to head off to Ghana (don't forget there's no planning to this; just running off & not thinking about anything) to track down his biological mother. It's difficult to enjoy books with characters that are so self-absorbed (his sister even mentions the privileges Blade holds but he refuses to see it)- I guess in some sense I can feel a *twinge* of empathy for him since there's a small part of me that understands wanting to stay away from a parent fighting addiction. But still. The whole of this book is just ridiculous & it takes Blade going halfway across the world just so he can see the grass isn't always greener on the other side? Seriously!?! Thankfully, it was a fast read. It's clear Alexander can pen poetry & I enjoyed the soundtrack/musical facts incorporated, but unfortunately it wasn't enough to overlook my loathing for the Morrisons. Also, for a verse novel, the pacing is a bit inconsistent. Rapid, then slow (I felt a chunk of 30- 40 pages dealing with Blade & Chapel's relationship could have been cut out entirely & no substance would have been lost), then rapid in going to Ghana, finding his mother, then realizing he's got a pretty good life back home. BOR-ING. I hope his other books are better."}, {"userName": "Ashley Holstrom", "userReviewDate": "Aug 16, 2017", "userURL": "http://www.goodreads.com/user/show/271569-ashley-holstrom", "userReview": "Yes, yes, yes. I nearly missed my exit while I listened to this gorgeous book, read by the author. Blade Morrison is sick of living in the shadow of his rockstar dad, who has a tendency to ruin the good things in Blade's life lately. At just the right (or wrong?) time, a family secret comes out, and Blade travels across the world on a mission to find his roots. Solo is my first novel in verse, and oh me oh my, am I sold on this form.From the Best Books We Read in August 2017 at Book Riot."}, {"userName": "Rita Shaffer", "userReviewDate": "Aug 09, 2017", "userURL": "http://www.goodreads.com/user/show/9751430-rita-shaffer", "userReview": "Listened to the audiobook and all I can say is WOW! Beautiful story, characters I connected to and meaningful message! Kwame reading is a definitely plus and at some points I couldn't tell where a new poem started. Definitely heard some \"lines that make me linger\" - anxious to open the print version and look at them more closely! This one is a little more mature that some of the other works by this author ..."}, {"userName": "Amy Leigh", "userReviewDate": "Aug 22, 2017", "userURL": "http://www.goodreads.com/user/show/68872651-amy-leigh", "userReview": "Soulful story of a 17 year old experiencing the ups and downs of life. Mature YA (16+) novel written in poetry format."}, {"userName": "Lauren Murray", "userReviewDate": "Apr 11, 2018", "userURL": "http://www.goodreads.com/user/show/13876041-lauren-murray", "userReview": "I gave this an extra star because the audiobook included original song recordings."}, {"userName": "Charlie", "userReviewDate": "Mar 07, 2018", "userURL": "http://www.goodreads.com/user/show/60350689-charlie", "userReview": "The theme of this book was sort of to never give up but also to just let things go the way they are going. Things just keep getting worse for him but he keeps trying and he finally accomplished some of his goals. After he accomplished his goals, he realizes that his dad was actually trying to raise them well and he gradually starts to feel worse for being mad at his dad for being a bad dad."}, {"userName": "Kiki Cole", "userReviewDate": "Feb 24, 2018", "userURL": "http://www.goodreads.com/user/show/44738596-kiki-cole", "userReview": "I'm too tired and lazy to right a full review of this book, but I'm just gonna say that this book was amazing and I highly recommend it!"}, {"userName": "Beth", "userReviewDate": "Mar 24, 2017", "userURL": "http://www.goodreads.com/user/show/9550934-beth", "userReview": "Thank you to NetGalley and the publisher for a copy of the ebook!I really love Kwame's books. They are so easy to relate to for kids and adults, especially reluctant readers. I live in a rural community, so the kids don't check them out as much in my public library, but they are checked out a lot in the school one. His recent books have all been middle grade, but this newest is young adult for sure! I really, really hate to say this, but this book was just okay for me. I feel like it needed to be more focused on one specific thing instead of about three to four different things. Seriously, he had me at music, especially since it is the type of music I really enjoy, and I am fascinated by rockers who have lavish lifestyles...BUT...I am concerned that the teens are not going to relate to the music. If the teen is a music buff, it will be okay, but the others will be put off by it. This book is also more far-fetched than his others. If it had just focused on the relationship with the dad, I would have really enjoyed it. Even if it had focused on his girlfriend, or going to college, I would have liked it...BUT...(I'm not giving anything away.) the other part of the story a world away was too much for me. It was just too much going on for me to really like it. All of that being said, I think it will be very popular. It might be more popular with a specific group of teens, but I'm sure it will be read by a lot of people. *Note to librarians...in my opinion, because of the subject matter, this book is for teens. It's not graphic, but it talks about more mature subjects.*"}], "description": "When the heart gets lost, let the music find you.Blade never asked for a life of the rich and famous. In fact, he’d give anything not to be the son of Rutherford Morrison, a washed-up rock star and drug addict with delusions of a comeback. Or to no longer be part of a family known most for lost potential, failure, and tragedy. The one true light is his girlfriend, Chapel, but her parents have forbidden their relationship, assuming—like many—that Blade will become just like his father.In reality, the only thing Blade has in common with Rutherford is the music that lives inside them. But not even the songs that flow through Blade’s soul are enough when he’s faced with two unimaginable realities: the threat of losing Chapel forever, and the revelation of a long-held family secret, one that leaves him questioning everything he thought was true. All that remains is a letter and a ticket to Ghana—both of which could bring Blade the freedom and love he’s been searching for, or leave him feeling even more adrift.", "title": "Solo", "url": "http://www.goodreads.com/book/show/33004289-solo", "average": 3.97, "cover": "https://images.gr-assets.com/books/1479444350l/33004289.jpg", "reviews": 1125, "authors": [{"url": "https://www.goodreads.com/author/show/326609.Kwame_Alexander", "name": "Kwame Alexander"}, {"url": "https://www.goodreads.com/author/show/4099715.Mary_Rand_Hess", "name": "Mary Rand Hess"}], "type": ["Poetry", "Young Adult", "Realistic Fiction", "Music", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/33004289-solo", "http://www.goodreads.com/book/show/33004293-solo", "http://www.goodreads.com/book/show/39350441-solo", "http://www.goodreads.com/book/show/36130073-solo", "http://www.goodreads.com/book/show/35093671-solo", "http://www.goodreads.com/book/show/18263725-the-crossover", "http://www.goodreads.com/book/show/25897953-booked", "http://www.goodreads.com/book/show/35999004-rebound", "http://www.goodreads.com/book/show/31193387-the-playbook", "http://www.goodreads.com/book/show/26265899-surf-s-up"]}