{"ratings": 2319, "userreviews": [{"userName": "Laurel-Rain", "userReviewDate": "Dec 02, 2010", "userURL": "http://www.goodreads.com/user/show/1402123-laurel-rain", "userReview": "Against the backdrop of a gorgeous Central California Coastal town, this story begins with an historic moment in the past: a man, his wife, and his daughter are set to partake of the golden riches of the new land when tragedy strikes in the form of a swollen Nacimiento River.From there we open on another world, in another century, and a woman named Glory Solomon, whose life and joy have centered on this land and near this huge white oak tree named Solomon's Oak. Here she had shared a wonderful time with her husband Dan—until he abruptly and unexpectedly died.Putting her life and her finances back together in the year afterwards comes to be her biggest challenge yet. But near the old oak tree is a small chapel her husband built. And an unconventional couple pleads with Glory to allow them to have their \"pirates wedding\" there. From this beginning, a new business of hosting weddings for unconventional couples is born.And on that first day, she meets two other damaged souls: Juniper McGuire, a broken teen, abandoned by her family and the plight that took them under; and ex-cop Joseph Vigil, wounded and still in critical pain, who drops onto the scene unexpectedly to photograph the oak tree.Juniper is Glory's latest foster child (and first girl), and even though they almost immediately connect, there is so much trouble on the horizon. Will Glory be able to improve this girl's life without taking herself down too? And what will the newly developing bond between her and Joseph bring into their lives? And how will Glory's rescue dogs and horses add or subtract from the scene?Watching Glory's struggles with Juniper was the most enjoyable part of the story to me. And while the somewhat predictable romance brewing between Glory and Joseph felt like something that could and even should happen, I didn't really \"feel\" any chemistry between them. To me, it just seemed like one of those plot points that was tossed in there to give Glory something to help her move on. Which is why I deducted one star.What I loved most about \"Solomon's Oak: A Novel\" was the descriptive language that brought the oak tree alive until I could almost see it bending over the people in its wake, as if it were some kind of warm, embracing, and spiritual presence.A four star read that is sure to captivate many, \"Solomon's Oak: A Novel\" was definitely an unforgettable read."}, {"userName": "Denise", "userReviewDate": "Oct 21, 2010", "userURL": "http://www.goodreads.com/user/show/2673817-denise", "userReview": "Another beautiful book from Jo-Ann Mapson! Solomon's Oak is an ancient white oak, growing in California, where no white oak should be able to grow. When Glory Solomon is widowed at an early age she unwittingly becomes its caretaker. Her new foster daughter, Juniper, arrives just as Glory is hosting her first wedding in the chapel her husband built under its branches. Close on Juniper's heels comes Joesph, an injured cop who is there to photograph the famous tree. Together, the three of them will weave a story of healing under the patient gaze of the ancient tree.I absolutely fell in love with this book from the very beginning! The background is laid with rich California history, it is fleshed out with flawed, realistic, deeply felt characters, and finished off with a perfectly paced plot. I was especially impressed with the rendering of Juniper, a deeply troubled teenage girl. Jo-Ann Mapson gets just right the fierce emotions, hot and cold temper, striking intelligence and complete lack of common sense that is a teenage girl. Everything that is infuriating and lovable is there. She also perfectly captured how three emotionally wounded people can together pull each other out of the pain and find the way back into life. Sorry if I'm gushing, but I loved this book! Arguably one of Jo-Ann Mapson's best!"}, {"userName": "Petunia", "userReviewDate": "Aug 23, 2011", "userURL": "http://www.goodreads.com/user/show/5981633-petunia", "userReview": "Mapson is an author I turn to like comfort food when I get tired of rich fare. Her chaaracters are real people with flaws, ones you can love and appreciate. In Solomon's Oak, Glory is a grieving widow whose's part-time job at Target might provide just enough money to get by--if she didn't take in strays. Glory and her husband of ten years had fostered teenaged boys, whome they loved and sent on their way better prepared for life. She also fosters dogs, that she loves and trains for a permanent home. Why not? The dogs don't eat as much as her horses, they have space to run, and they help take Glory's mind off her loss. Glory's already short of time, money, and energy, when she agrees to foster a teenage girl--a troubled vulnerable girl who lies--but Glory won't say no. She starts a wedding business to help with the bills; she can cook and organize but she's no good with a camera. Luckily for all involved, Joseph, an amateur photographer, is visiting from Albuquerque to take ictures of California trees, one of which, the Solomon oak is on Glory's property. But Joseph is also an injured cop, slowly recuperating, and planning to leave soon. Is he the man for Glory or is Joseph another stray? Maspson has an excellent back list too; all are recommended for readers who want a well-written, intelligent, cointemporary romance and friendship story."}, {"userName": "Lucia", "userReviewDate": "Oct 27, 2012", "userURL": "http://www.goodreads.com/user/show/6637160-lucia", "userReview": "It was an enjoyable book, except for the lame use of Spanish all over the book. The Spanish that many of the characters used in between their sentences was wrong. I don't mean that it wasn't proper Spanish, I mean that it was painfully obvious that the author AND the editors had no knowledge whatsoever of Spanish. This made the reading very annoying for me, being bilingual."}, {"userName": "Carol", "userReviewDate": "Feb 16, 2012", "userURL": "http://www.goodreads.com/user/show/993611-carol", "userReview": "A book about famliy dynamics and the forming of new relationships. The theme of abuse and abduction of children nearly hit the limit of my comfort level, but I did manage to finish the book.Also need the authors recipe for twice-baked potato casserole!"}, {"userName": "Charlene", "userReviewDate": "Jul 13, 2012", "userURL": "http://www.goodreads.com/user/show/2114681-charlene", "userReview": "loved this book. I couldn't put it down ..well written, realistic ending, very engaging. I stayed up late to read it and got ul early to read it. looking forward to reading more from this author"}, {"userName": "Shannon", "userReviewDate": "Sep 12, 2014", "userURL": "http://www.goodreads.com/user/show/11048196-shannon", "userReview": "Original review found at: http://awesomebooknuts.blogspot.com/SPOILERSI enjoyed reading this book, but I thought I would enjoy it more. It is an easy, well written novel that follows the lives of three individuals whose lives intertwine in interesting ways.Glory Solomon is a widow coming up on the first anniversary of her late husband’s death. She is asked by a couple if they can have their wedding at the chapel that her husband finished building shortly before his death. She accepts after she discovers the reason that the couple has been turned down by every other church is that they want a pirate themed ceremony.Meanwhile, Glory is asked by social worker/friend Caroline (whose motives become known later in the book) if she can host a troubled 14 year old named Juniper for the night until she can find a “forever home” for the girl. Glory hesitantly agrees. During the aforementioned pirate nuptials, former forensic lab worker Joseph Vigil is taking pictures of the famed Solomon’s Oak when he sees a duel during the ceremony and his police instinct kicks in. He crashes the wedding and draws his gun, demanding that the dueling swordsmen drop their weapons. Glory quickly cuts in and explains that it is all part of the ceremony and calms the situation. Joseph, now embarrassed, holsters his gun and apologizes for his instinct overtaking him. Fortunately for Glory, whose camera isn’t working, Joseph agrees to take pictures of the ceremony in exchange for a plate of leftovers to take home.From there, Glory, Juniper, and Joseph’s lives are brought together in interesting ways. Glory struggles to form a relationship with Juniper, whom she truly believes in and wants to help, but can't seem to get a grasp on it. Joseph becomes an unlikely hero, if you will, in the situation and helps bring Juniper and Glory together and closer than they would've imagined.As I said, I thought this book would be better. Don’t get me wrong, it is good, just not as good as I was expecting. The historical tidbits are accurate, the writing is great, and the ending is very fitting and a great conclusion, but my expectations were higher."}, {"userName": "Regina Spiker", "userReviewDate": "Nov 09, 2011", "userURL": "http://www.goodreads.com/user/show/4274600-regina-spiker", "userReview": "Solomon's Oak - the words alone invoke strength and character...photographers come from miles away to capture the beauty of the lovely, huge White oak that sits on Solomon's farm in California, where White Oaks should never grow. Glory Solomon, now a widow, owns the farm where once her and her beloved husband took in foster boys and taught them to be kind, responsible men. Now alone with only her horses and dogs, Glory is faced with the dilemma of possibly losing the farm. On top of all this worry and grief, she is ask to foster a teenage girl, angry, broken 14 year old Juniper McGuire with her own passel of problems and Glory has trouble, even under the circumstances, saying no. When a couple approaches her with a crazy idea of hosting a pirate wedding under the famous oak, Glory runs with it - baking, preparing food, and decorating the small chapel her husband had built - all with a pirate theme. Unlucky for a her, a former policeman (with a body and a mind full of pain), Joseph happens to arrive when the \"pirates\" are at their worst - with guns and swords drawn! On the other hand, lucky for Glory, he also has his camera and is willing to take photos for Glory of the fun, wild wedding. Will Solomon's Oak shelter and mend all three heartbroken souls?Real life characters with real, gritty life problems. You will cry with Glory, Juniper, and Joseph, but laugh with Glory's zany friend, store owner Lorna.You may wonder at the beginning to this novel, but loose threads will be tied in the end."}, {"userName": "Donna", "userReviewDate": "Oct 09, 2013", "userURL": "http://www.goodreads.com/user/show/7892984-donna", "userReview": "I really enjoyed this book. First of all, I fell in love with the idea of Solomon's Oak being a tree that was not expected to live, let alone flourish for hundreds of years in their area. I absolutely adored the character of Glory Solomon since, like me, shoe loves animals. She has three dogs who she rescued and has trained to help her out on the farm. She also has s couple of horses. She is grieving the loss of her husband of twenty years. Now she wishes that they had children of their own in addition to the sons they fostered over those twenty years. She is working at Target and trying to get creative and begin a new business to keep up with her financial obligations when caseworker Caroline calls and asks her to keep a young lady named Juniper, just overnight. Juniper is alone now since her father has disappeared and her mother died after Juniper's sister, Casey, went missing one day while walking her dog. Guess what? Glory rescued Casey's dog and named him Cadillac. When he and Juniper are reunited, it feels as if they were meant to be together. However, Glory has a lot of doubt about whether she can raise this girl without the help of her beloved husband, Dan. Throw in an ex-cop on a disability who is visiting the area and ends up rescuing Glory when her camera isn't working and this is a great story."}, {"userName": "Grace", "userReviewDate": "Mar 20, 2011", "userURL": "http://www.goodreads.com/user/show/2395921-grace", "userReview": "Liked the characters - a new widow, a foster child, a retired policeman - great relationships. Glory Solomon, a young widow, holds tight to her memories while she struggles to hold on to her Central California farm. Fourteen-year-old Juniper McGuire is the lone survivor of a family decimated by her sister's disappearance. She arrives on Glory's doorstep, pierced, tattooed, angry, and homeless. When Glory's husband Dan was alive, they took in foster children, but Juniper may be more than she can handle alone. Joseph Vigil is a former Albuquerque police officer and crime lab photographer who was shot during a meth lab bust that took the life of his best friend. Now disabled and in constant pain, he arrives in California to fulfill his dream of photographing the state's giant trees, including Solomon's Oak.In Jo-Ann Mapson's deeply felt, wise, and gritty novel, these three broken souls will find in each other an unexpected comfort, the bond of friendship, and a second chance to see the miracles of everyday life."}, {"userName": "Denise", "userReviewDate": "Jun 05, 2012", "userURL": "http://www.goodreads.com/user/show/2953994-denise", "userReview": "I really found Jo-Ann Mapson's book Solomon's Oak to be a great read. The characters are wonderfully developed and the struggles rang true. Glory is struggling through her first year as a widow and adjusting to her new realities and trying to start a new business. She becomes a sole foster mother, a role she has extensive experience in while she was married but this time the child is a girl and she is going it alone. Juniper, the foster child has a voice that rings true for children who have seen too much sorrow and abandonment. Joseph is recovering from a police shooting and from losing his long time best friend. He is in California to spend some time in his grandmother's cabin to reconnect before it is demolished to make way for a new development. These three characters are able to connect after significant effort and mis-steps. I was happy to spend some time with them and see the connections grow. I am not much of dog person but this book would certainly appeal to someone who loves animals as they play a supporting role that shapes the novel."}, {"userName": "Kay", "userReviewDate": "Feb 23, 2011", "userURL": "http://www.goodreads.com/user/show/4833867-kay", "userReview": "The characters were wonderful--almost too good to be true. And the plot was compelling, though there were probably too many coincidences, such as the fact that the heroine becomes the foster mother to the sister of a missing person whose dog lives at Solomon's Oak. And how did she become a foster mother without going through months of red tape, especially in California?I have enjoyed other books by this author, but somehow the writing wasn't quite good enough to rate 4 stars. It had a thrown-together quality. Nevertheless, it certainly qualifies as a good read, especially for \"chick lit\" fans. I liked it much better than Michael Cunningham's \"By Nightfall,\" a highly acclaimed novel, which I read last week. That book was beautifully written, but populated by self-absorbed people about whom it was hard to care."}, {"userName": "Anne", "userReviewDate": "Aug 13, 2011", "userURL": "http://www.goodreads.com/user/show/546484-anne", "userReview": "I finished reading Solomon's Oak this evening, and on the whole I did enjoy the story. The story is pretty slow to start, with a gentle introduction to each character, and although the pace never becomes particularly fast, the characters develop wonderfully. Although recommended by Jodi Picoult, Jo-Ann Mapson's writing and style is really not similar to Picoult at all. This didn't put me off, but some readers may be looking for a similar genre and be disappointed. The three main characters; Glory, Juniper and Joseph take turns to narrate the story, which is basically a small-town tale about three people who are very different, but have sadness and loss in common. Throw in some rescue dogs with gigantic characters of their own and a cast of supporting characters, a wedding chapel and some tasty sounding food and you are left with a heart-warming, well written story."}, {"userName": "Diana", "userReviewDate": "Aug 25, 2014", "userURL": "http://www.goodreads.com/user/show/4900962-diana", "userReview": "Jo-Ann Mapson is one of my favorite authors.  The plot of this book was slow to develop, but once it got started it was another great story. Glory Solomon is a recent widow. She and her husband had ran a small farm and raised foster boys, among other things. In one of their meadows is a big, old, beautiful oak tre...Solomon's oak. Glory's husband had built a small chapel before he died. Someone asks if they have their wedding there and thus begins a new business for Glory. During the first wedding at the chapel, a man is taking picture of Solomon's Oak. Glory's camera fails and the man helps takes wedding pictures. Also on this day, social services calls and asks Glory to take 14 year old girl,who has many issues. Juniper brings joy but great challenges. Glory doesn't know if she is up to raising this girl."}, {"userName": "Kirsten Feldman", "userReviewDate": "Mar 21, 2014", "userURL": "http://www.goodreads.com/user/show/24777290-kirsten-feldman", "userReview": "Solomon's Oak in three lines. Jo-Ann Mapson beautifully, if slowly and often predictably, maps the spaces between Glory, a recent, struggling widow, and Juniper, her happenstance foster daughter, as deftly as she fills out their piecemeal lives on a California ranch. The titular tree, which shouldn't even grow in that part of the country, never mind for over two hundred years, anchors the story that undulates around it, collecting oddball and stalwart characters as treasures and trash catch in its branches. Some of my favorite interactions in the book took place between human and animal--dogs, horses, goats, birds, and slugs, to name a few, and I'll seek out Mapson's other books for more of the same."}, {"userName": "Lynn Pribus", "userReviewDate": "Feb 11, 2013", "userURL": "http://www.goodreads.com/user/show/2546121-lynn-pribus", "userReview": "A Hallmark-ish book with few surprises and unexciting writing. I was tempted to quit, but there was a cattle dog in it and I'm a cattle dog fan. A 15-y-o girl whose sister disappeared (while with said dog) some years ago is placed with a widow (of 8-9 months) who fostered boys while her husband was living.She herself has an antagonistic relationship with her own sister and I was constantly annoyed that, although she kept the needy girl, she was terribly inept handling her. She never once agreed with the poor girl (\"School sucks\" \"Well, you have to have an education to get ahead in life.\")A man enters the scene and, surprise!, the widow and the man spar and feint before.....Plot steps telegraphed. Things tidied up. Happy ending all around. As I said, very Hallmarkish."}, {"userName": "Sharon", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/1005685-sharon", "userReview": "2.5 starsA struggling young widow, an abandoned and angry teenager, and a former police officer who is losing his battle with his physical and emotional pain find that their lives have become entwined as each seeks to heal themselves and find some peace. This story had a great premise and a lot of potential, but it was mostly unmet. The plot seemed a little disjointed, the narrative often seemed stilted and characters not fully realized. There was just something missing, and I found myself turning the last page with a feeling of disappointment that the story wasn't better."}, {"userName": "Rebecca", "userReviewDate": "Jul 15, 2013", "userURL": "http://www.goodreads.com/user/show/1391629-rebecca", "userReview": "I enjoyed this book told from three varying perspectives, a young widow, and ex-cop photographer, and an abandoned teenager. It's a touching, but not sappy, story of how their lives became intertwined and move toward healing. I'd give it 4 1/2 stars if I could."}, {"userName": "Ed Goddard", "userReviewDate": "Apr 08, 2016", "userURL": "http://www.goodreads.com/user/show/38933588-ed-goddard", "userReview": "Most excellent book. Good character portrayal. I would rate this a 6 out of 5 if that was possible."}, {"userName": "Mich", "userReviewDate": "Aug 05, 2015", "userURL": "http://www.goodreads.com/user/show/1173346-mich", "userReview": "Well worth the read. I've had this for a long time, don't know why it took me so long to read it!"}, {"userName": "Ann Miller", "userReviewDate": "Sep 09, 2013", "userURL": "http://www.goodreads.com/user/show/3825295-ann-miller", "userReview": "The story and writing are deep, true, and beautiful--moving at a glacial pace. An excellent read for the savoring reader. Juniper as the broken teen especially shines."}, {"userName": "Becki Basley", "userReviewDate": "Aug 31, 2017", "userURL": "http://www.goodreads.com/user/show/3102623-becki-basley", "userReview": "I feel this book is a tribute to foster parents who have the tenacity, strength, and genuine love of the children in their care. However, it doesn't paint a rosy picture of the challenges the parents face nor does it give a watered down perspective of the real trauma that the child endures and the scars this placed on them. I feel this book is one of survival and endurance on all the main characters so it's very appropriate to compare them to the oak tree.The only part I had an issue with was at times the book seem disjointed, there seemed to be times when it needed a smoother transition between topics. However this is a minor criticism and I feel the ultimate message of the book makes up for this. It points out that not all foster parents are bad, that no child is hopeless and that the social stigma against children in foster care is alive and well."}, {"userName": "D.j. Lang", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/16161833-d-j-lang", "userReview": "Easy to read. Fits the definition of a novel (according to Oxford online). Ends as expected in one way, in two other ways, it does not (won't explain why so as not to spoil the ending if you have not read it). Starts off like a Christian romance novel but turns out that it is not. Writing is good, details are good and realistic. I know the area so that was a plus. I have a longer review on my blog if you want to see more: https://englishpoiema.blogspot.com/20... I'm not going to buy the book so I won't give it a 5 star (unless I end up checking it out of the library so often that I finally give in and buy it), but the essay by foster child Juniper makes this a definitely-worth-reading book."}, {"userName": "Kelly Gladney", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/26874686-kelly-gladney", "userReview": "For me, Jo-Ann Mapson books are like comfort food. I always want to live in them and be friends with her characters. It's not all rosy, but there is still something about her worlds that make me want to be a part of them. Somehow I had read both the somewhat sequels to this book and had really wanted to read this one. I guess I really wish I was the Glory character despite her hardships. Now I feel like I need to go back and read the other two to refresh my memory on what happened to these people. At first I start reading her books in big gulps, but then I want to savor it and make it last. I'm always a little sad when they're done."}, {"userName": "Bee", "userReviewDate": "Apr 01, 2018", "userURL": "http://www.goodreads.com/user/show/5737895-bee", "userReview": "I really enjoy this author typically but this book was a bit of a mess. It read like an early draft. The perspectives shifted rapidly and randomly, with no over-all consistency (example, the \"reports\" and the final few interjections from Juniper). I'm also not a huge fan of characters from other books making very forced and unnatural cameos. It had a lot of potential, as the story itself was solid and interesting, but it just wasn't quite there."}, {"userName": "Onceinabluemoon", "userReviewDate": "Aug 03, 2017", "userURL": "http://www.goodreads.com/user/show/1840592-onceinabluemoon", "userReview": "For the month of August for every new book I read I must read an old one I own... to be honest, not thrilled about that since some feel so age inappropriate now. This is one, I am sure I bought this because of being a familiar location, but I am so over this type of book..."}, {"userName": "Hawley", "userReviewDate": "Oct 22, 2017", "userURL": "http://www.goodreads.com/user/show/32397197-hawley", "userReview": "Just wasn't very interesting."}, {"userName": "Rosie", "userReviewDate": "Jan 26, 2018", "userURL": "http://www.goodreads.com/user/show/2179661-rosie", "userReview": "Ok..."}, {"userName": "Deann Eckdahl", "userReviewDate": "Dec 14, 2017", "userURL": "http://www.goodreads.com/user/show/34051715-deann-eckdahl", "userReview": "This book was enjoyable, an easy read.Great relationships in this book, I particularly loved the beginning of the book with the Pirate Wedding."}, {"userName": "Ania", "userReviewDate": "Mar 12, 2018", "userURL": "http://www.goodreads.com/user/show/78664279-ania", "userReview": "Dobra powieść w klimacie \"Wzgórza Dzikich kwiatów\". Gdyby tłumacz i korektor bardziej się postarali, czytałoby się jeszcze przyjemniej."}], "description": "Solomon's Oak is the story of three people who have suffered losses that changed their lives forever.", "title": "Solomon's Oak\n      \n          (Solomon's Oak #1)", "url": "http://www.goodreads.com/book/show/9816996-solomon-s-oak", "average": 3.76, "cover": "https://images.gr-assets.com/books/1302025638l/9816996.jpg", "reviews": 378, "authors": [{"url": "https://www.goodreads.com/author/show/28397.Jo_Ann_Mapson", "name": "Jo-Ann Mapson"}, {"url": "https://www.goodreads.com/author/show/2782161.Emily_Durante", "name": "Emily Durante"}], "type": ["Fiction", "Romance", "Womens Fiction", "Contemporary"], "outlinks": ["http://www.goodreads.com/book/show/9816996-solomon-s-oak", "http://www.goodreads.com/book/show/7925361-solomon-s-oak", "http://www.goodreads.com/book/show/9431145-solomon-s-oak", "http://www.goodreads.com/book/show/9805835-solomon-s-oak", "http://www.goodreads.com/book/show/19477971-solomon-s-oak", "http://www.goodreads.com/book/show/39171953-drzewo-solomon-w", "http://www.goodreads.com/book/show/50458.The_Owl_Moon_Cafe", "http://www.goodreads.com/book/show/13538813-finding-casey", "http://www.goodreads.com/book/show/87210.Bad_Girl_Creek", "http://www.goodreads.com/book/show/7551438-hank-chloe", "http://www.goodreads.com/book/show/87212.Blue_Rodeo"]}