{"ratings": 1035, "userreviews": [{"userName": "Farshad Asl", "userReviewDate": "Jun 30, 2013", "userURL": "http://www.goodreads.com/user/show/9961096-farshad-asl", "userReview": "I truly enjoyed this book. You always can go from \" failure\" to success but you never can go from \"excuses\" to success.It's a great book and John is sharing what he has learned from his own and other people's mistakes. I love the book...I would recommend!"}, {"userName": "The Book Man", "userReviewDate": "Sep 20, 2013", "userURL": "http://www.goodreads.com/user/show/7949606-the-book-man", "userReview": "If you have experienced failure and it still holds onto you, then this book is for YOU! :)I would like to share some of my favorite notes I took while reading,~ “How does a humble person learn from mistakes? By pausing and reflecting. I strongly believe that experience isn’t the best teacher; evaluated experience is.”~ “Wisely humble people are never afraid to admit they were wrong. When they do it’s like saying they’re wiser today than they were yesterday.” ~ “Responsibility is the most important ability that a person can possess.”~ “Positive thinking must be followed by positive doing.”~ “The habits you practice every day will make you or break you. If you want to become a teachable person who learns from losses, then make learning your daily habit. It may not change your life in a day. But it will change your days for life.” ~ “One of life’s important question is ‘Who am I?’ But even more important is ‘Who am I becoming?’”~ “Winning isn’t everything, but learning is.”P.S: I want you to become a continual winner by being a habital learner."}, {"userName": "Denise Morse", "userReviewDate": "Oct 03, 2013", "userURL": "http://www.goodreads.com/user/show/3120187-denise-morse", "userReview": "This book couldn’t have come at a better time for me. I was dealing with a difficult work situation and getting very angry and reading this book helped put it all into perspective. Life isnt easy but it can be better and more fulfilling if you look at negatives as a way to learn and grow. It is all about perspective and looking forwards to self improvement. From the opening beautiful into by the late John Wooden through the amazingly inspirational quotes sprinkled throughout, John C. Maxwell does a wonderful job of laying out the case for learning and growing through failures and disappointments. I really loved how the book was set-up with each section being specific to one of his eleven elements that make up people who learn from mistakes:1. Humility - The Spirit of Learning2. Reality - The Foundation of Learning3. Responsibility - The First Step of Learning4. Improvement - The Focus of Learning5. Hope - The Motivation of Learning6. Teachability - The Pathway of Learning7. Adversity - The Catalyst of Learning8. Problems - The Opportunities of Learning9. Bad Experiences - The Perspective for Learning10. Change - The Price of Learning11. Maturity - The Value of LearningOne of the most important takeaways is the need for personal accountability which is a trait that is sorely lacking from American society. I truly feel like I have a better handle on how to tackle change, problems and failures thanks to this book, and I know that I will be re-reading this often. I also plan on purchasing at least one copy for the office as well as for my coworkers, this is an important book especially during turbulent times. http://anovelnosh.com/book-review-som..."}, {"userName": "Laura Thompson", "userReviewDate": "Sep 11, 2014", "userURL": "http://www.goodreads.com/user/show/29945462-laura-thompson", "userReview": "While there were some great nuggets in this book, there is nothing new or original. In fact, the author spends most of his time quoting others. The title could be \"Everything Everyone Else Said About Learning\"."}, {"userName": "Gh .", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/57467562-gh", "userReview": "Thank u Dr.Rana"}, {"userName": "Alexandra", "userReviewDate": "Feb 18, 2018", "userURL": "http://www.goodreads.com/user/show/351830-alexandra", "userReview": "2/18/18 $1.99 for Kindle."}, {"userName": "Bill Donhiser", "userReviewDate": "Jan 26, 2014", "userURL": "http://www.goodreads.com/user/show/4732447-bill-donhiser", "userReview": "Another great book by John Maxwell. I am impressed by this author with every new book he writes. Easy to read full of easy to understand information. It is a great resource for those of us who have to lead and any one who wishes to be a leader"}, {"userName": "Debbie", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/16361490-debbie", "userReview": "Lots of positive advice and practical suggestions for learning everyday. Filled with several humorous and touching antidotes about real people. The ultimate learning experience is evaluating and proceeding forward with a flexible plan. The title was attention - getting for me."}, {"userName": "Beverly", "userReviewDate": "Mar 05, 2014", "userURL": "http://www.goodreads.com/user/show/8680028-beverly", "userReview": "Learned alot with this book."}, {"userName": "Dan Albrecht", "userReviewDate": "Jun 04, 2014", "userURL": "http://www.goodreads.com/user/show/30309144-dan-albrecht", "userReview": "Short, simple, profound, phenomenal. If you have experienced failure and it still holds onto you, read this. This book is the one. And it's funny!"}, {"userName": "Susan", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/3181679-susan", "userReview": "Great book!"}, {"userName": "Jad Dizon", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/14533630-jad-dizon", "userReview": "Life Changing Read! :D"}, {"userName": "Melissa", "userReviewDate": "Jan 09, 2017", "userURL": "http://www.goodreads.com/user/show/8575263-melissa", "userReview": "This book was full of cliches. At times I was like hey did this dude sit down at my last training for work and takes notes cause the stuff he was presenting in this book is super similar. Add to that that he relies a lot on quotes from others (who often say his point better than he does) and it's like right all of this has been said before. Not to give him no credit at times the information is presented in an interesting way. And there are some useful things in here. But overall this is nothing new. He tells a lot of stories which really up the page count. And didn't always feel necessary.Further, this dude glorifies adversity and yet seems super disconnected from what others experience. He points out that some folks would say that \"it's more difficult for people who are underprivileged, facing adversity, or suffering pain\", but he doesn't think so. And you are like, but it would be more difficult. I used to work 70 hours a week. Commuting 1.5 hours to work. I had no time to even think. I was tired all the time and it would have been super difficult to meet his guidelines for being teachable. It's shows his privilege in him assuming that folks have time for this stuff. He talks a big game about adversity, but his examples of his struggles just don't click. You spent 20k to have a passport delivered to you? Cool thats about what I make in a year. You lost a million dollars in a bad decision you made and you couldn't really afford to lose so much money and had to sell some of your investments? I've never had a million dollars to invest. I won't say losing your mother isn't a struggle, but you had her for 62 years of your life. You are an adult and thats a lot of love you got to receive. And it is part of life that parents die. I just see a lot of privilege, a lot of wealth and a disconnect from the lives that others lead in this book. He brings up depression in passing, but doesn't really address how a depressed person might be able to utilize his advice (just that they lack energy because they have no hope). Overall, he came off as someone who isn't presenting anything really new, he rehashed his own ideas multiple times throughout the book and he seems disconnected from others experiences. It just wasn't what I had hoped to read."}, {"userName": "Taiba Physics", "userReviewDate": "Jan 28, 2018", "userURL": "http://www.goodreads.com/user/show/45257947-taiba-physics", "userReview": "It's one of the best books I've ever read. I like it and I definitely recommend it to every person who wants to improve his/her self. But there are 2 things which I didn't like about: 1 - It's somehow too long so I couldn't read it day after day so after I finished reading almost half of it, I started another book then I returned back to it and continued reading ^^2 - In 2 chapters of it the author used MUCH MUCH of quotes so that made me feel bored. IT'S APPROPRIATE FOR ENGLISH LEARNERS SPECIALLY WHO'S IN THE INTERMEDIATE LEVEL IN READING AS I AM.الكتاب رائع واحد من أفضل الكتب اللي قرأتها في حياتي في مجال تطوير الذات .. تقريباً شغلتين ما حبيتهم فيه أولاً : الكتاب عدد صفحاته كثير فما قدرت آقراه كامل بشكل متواصل وفي منتصف الكتاب توقفت عن قرائته وقريت كتاب ثاني و من ثم رجعت له ثانياً : في فصلين من فصول الكتاب الكاتب استدل بأقوال شخصيات أخرى بشكل مبالغ فيه بصراحة فحسيت فيهم بملل ولكن بشكل عام الكتاب لا يفوت .. الأشخاص متعلمين اللغة مثلي واللي في المستوى المتوسط تقريباً أو فوق المتوسط الكتاب سهل الفهم ومناسب جداًبشكل عام أنصح بالكتاب وبشدة .."}, {"userName": "Ernesto Osorno", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/8841347-ernesto-osorno", "userReview": "De todos los libros que he leído de este autor, considero que este es uno de los mejores ya que mediante técnicas muy fáciles de aplicar uno puede maximizar el aprender de sus propios errores para el logro de objetivos a corto, mediano y largo plazo; dichas técnicas son desglosadas de forma muy elocuente por el autor mediante situaciones o historias de vida que fueron casos de éxito una vez que los errores fueron asimilados por cada uno de los personajes.Sin lugar a dudas es uno de los libros que recomiendo de este autor que todos deberíamos leer para lograr nuestros objetivos personales."}, {"userName": "Lisa", "userReviewDate": "Feb 28, 2018", "userURL": "http://www.goodreads.com/user/show/865868-lisa", "userReview": "This is my first John Maxwell book and it's like having an educational chat with your kindly, older pastor, experienced in psychology and humanity. The message of the book is in the title. Maxwell outlines 11 traits that successful people develop to learn from their mistakes and losses to create a successful life. The text is liberally sprinkled with quotes and stories and his outline is clear and easy to follow. Worth the read, though not destined to be a classic in the personal growth genre."}, {"userName": "Toby Brennen", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/6464362-toby-brennen", "userReview": "John Maxwell in “Sometimes You Win, Sometimes You Learn” presents the case that our learning comes from our failures and to be successful we need to be able to learn from our mistakes. Filled with every ‘positivity quote’ that I’ve heard over the past 15 years, it is uplifting, thought provoking and motivational. Although an easy read, I found the style stiff and formal - like I was reading a puffed up outline."}, {"userName": "Shirin", "userReviewDate": "Feb 07, 2017", "userURL": "http://www.goodreads.com/user/show/19220807-shirin", "userReview": "\"Optimism is the belief that things will get better. Hope is the faith that, together we can make things better. Optimism is a passive virtue, hope an active one. It takes no courage to be an optimist, but it takes a great deal of courage to have hope.\"_This is only one of the many inspirational quotes in Maxwell's book that deeply touches the soul. Highly recommended for anyone facing hardships in career, life etc. and needs positive mentoring."}, {"userName": "Paulo", "userReviewDate": "Mar 23, 2018", "userURL": "http://www.goodreads.com/user/show/12013441-paulo", "userReview": "Um bom livro, mas, na maioria, conselhos de bom senso.Comodismo, excesso de confiança, medo, ... Nossos defeitos elencados ao longo do livro, acrescidos às experiências próprias do autor e de outras pessoas famosas.Contudo, fica o de sempre: saber usar o bom senso acima de nossas convicções e paradigmas.Nenhum insight fantástico, mas bem escrito."}, {"userName": "Sandra", "userReviewDate": "Sep 25, 2017", "userURL": "http://www.goodreads.com/user/show/2341213-sandra", "userReview": "This book was the first that began my appreciation for John Maxwell's encouraging style of writing. Very easy to read and very motivational. He tells lots of stories and helps you to realize life is full of ups and downs. It is what we do with them that makes our life move forward or stay in one place."}, {"userName": "Joshua Lawson", "userReviewDate": "Jan 01, 2018", "userURL": "http://www.goodreads.com/user/show/58214950-joshua-lawson", "userReview": "Maxwell pulls together a lot of inspirational material in this book to show that failure is an inescapable part of life and the only legitimate path to success. How long it takes to find our way on that path ultimately depends on the attitude we take toward failure--in other words, on how we choose to deal with it."}, {"userName": "Erica Bruce", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/68958691-erica-bruce", "userReview": "This is a great book and great read. I enjoyed reading it and I think I learned from it. I've always believed that learning is important. Learning from mistakes, failures, troubles, and losses is what this book is about."}, {"userName": "Lance McNeill", "userReviewDate": "Feb 09, 2018", "userURL": "http://www.goodreads.com/user/show/62230814-lance-mcneill", "userReview": "Great read-only inspiringI enjoy Maxwell's writing. It's an enjoyable read with useful lessons. I do grow weary of too many basketball and other sports references, but there are many other interesting examples."}, {"userName": "Manuel De La Cruz", "userReviewDate": "Jan 02, 2018", "userURL": "http://www.goodreads.com/user/show/62849042-manuel-de-la-cruz", "userReview": "Great BookThis is my second John Maxwell book. Very easy read but do not underestimate the valuable lessons it has. Would definitely recommend the book for anyone looking for a different take on what to do when life doesn’t go as planned."}, {"userName": "Rugengamanzi Van Eülådè", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/73454841-rugengamanzi-van-e-l-d", "userReview": "Sometimes You win--Sometimes you learnOne of very absorbing book I've ever read,educated me on thing i ignored before.i learned how to learn from my losses, failures, mistakes, challenges, and bad experiences. another thing Success cant teach you.he tackles every aspect of life."}, {"userName": "Akita", "userReviewDate": "Jan 13, 2018", "userURL": "http://www.goodreads.com/user/show/41827566-akita", "userReview": "Everything is in the title."}, {"userName": "Ahmad Nazeri", "userReviewDate": "Oct 24, 2016", "userURL": "http://www.goodreads.com/user/show/1339750-ahmad-nazeri", "userReview": "This book includes some great insights toward the end, but most of it is John Maxwell's ramblings on the topic."}, {"userName": "Prachi Dawer ", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/52259566-prachi-dawer", "userReview": "I liked different anecdotes in the book, but other than that it didn’t have much to offer."}, {"userName": "Paul_t", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/4185329-paul-t", "userReview": "Sometimes find Maxwell makes assumptions he cannot justify other than from his own assumptions! A good read but has holes that need clarification."}, {"userName": "Sushanti Madkaikar", "userReviewDate": "Nov 19, 2017", "userURL": "http://www.goodreads.com/user/show/29147669-sushanti-madkaikar", "userReview": "John C maxwell always keeps me engaged ... nice book and reminder of wonderful things."}], "description": "John Maxwell believes that the greatest lessons we learn in life are from our losses. Everyone experiences loss, but not everyone learns from it. In Sometimes You Win--Sometimes You Learn, Dr. Maxwell explores the most common lessons we learn when we experience loss. He then explains how to turn a set-back into a step forward by examining the eleven elements that make up the DNA of Those Who Learn:1. Humility - The Spirit of Learning2. Reality - The Foundation of Learning3. Responsibility - The First Step of Learning4. Improvement - The Focus of Learning5. Hope - The Motivation of Learning6. Teachability - The Pathway of Learning7. Adversity - The Catalyst of Learning8. Problems - The Opportunities of Learning9. Bad Experiences - The Perspective for Learning10. Change - The Price of Learning11. Maturity - The Value of LearningLearning is not easy during down times, it takes discipline to do the right thing when everything is wrong. This book provides a roadmap to doing just that. As John Maxwell often points out--experience isn't the best teacher; evaluated experience is.", "title": "Sometimes You Win--Sometimes You Learn: Life's Greatest Lessons Are Gained from Our Losses", "url": "http://www.goodreads.com/book/show/17333532-sometimes-you-win--sometimes-you-learn", "average": 4.29, "cover": "https://images.gr-assets.com/books/1373226619l/17333532.jpg", "reviews": 129, "authors": [{"url": "https://www.goodreads.com/author/show/68.John_C_Maxwell", "name": "John C. Maxwell"}, {"url": "https://www.goodreads.com/author/show/23041.John_Wooden", "name": "John Wooden"}], "type": ["Business", "Nonfiction", "Self Help", "Leadership"], "outlinks": ["http://www.goodreads.com/book/show/17333532-sometimes-you-win--sometimes-you-learn", "http://www.goodreads.com/book/show/17333477-sometimes-you-win--sometimes-you-learn", "http://www.goodreads.com/book/show/18878095-sometimes-you-win--sometimes-you-learn", "http://www.goodreads.com/book/show/18266083-sometimes-you-win---sometimes-you-learn", "http://www.goodreads.com/book/show/24145642-a-veces-se-gana---a-veces-aprende", "http://www.goodreads.com/book/show/17333544-sometimes-you-win--sometimes-you-learn", "http://www.goodreads.com/book/show/27993721-s-vezes-voc-ganha-s-vezes-voc-aprende", "http://www.goodreads.com/book/show/815716.The_21_Irrefutable_Laws_of_Leadership", "http://www.goodreads.com/book/show/183554.Developing_the_Leader_Within_You", "http://www.goodreads.com/book/show/628070.Failing_Forward", "http://www.goodreads.com/book/show/7538.Winning_with_People", "http://www.goodreads.com/book/show/183396.The_360_Degree_Leader", "http://www.goodreads.com/book/show/16498123-a-guide-to-the-present-moment", "http://www.goodreads.com/book/show/40198297-hunting-eichmann", "http://www.goodreads.com/book/show/40193094-the-breaks-of-the-game", "http://www.goodreads.com/book/show/5312677-celebration-of-discipline", "http://www.goodreads.com/book/show/40243434-soul-keeping", "http://www.goodreads.com/book/show/22561514-the-autobiography-of-eleanor-roosevelt", "http://www.goodreads.com/book/show/31391295-how-to-be-a-bawse", "http://www.goodreads.com/book/show/8143199-how-remarkable-women-lead", "http://www.goodreads.com/book/show/5440602-how-soccer-explains-the-world", "http://www.goodreads.com/book/show/40193421-dry", "http://www.goodreads.com/book/show/40204948-a-truck-full-of-money", "http://www.goodreads.com/book/show/40229444-animal-liberation", "http://www.goodreads.com/book/show/19485478-a-woman-in-charge", "http://www.goodreads.com/book/show/38272015-the-measure-of-a-man", "http://www.goodreads.com/book/show/40203910-32-yolks", "http://www.goodreads.com/book/show/40193675-recovery", "http://www.goodreads.com/book/show/18880380-enemies", "http://www.goodreads.com/book/show/36693639-victoria", "http://www.goodreads.com/book/show/40203983-being-nixon", "http://www.goodreads.com/book/show/20960501-100-days-of-real-food", "http://www.goodreads.com/book/show/40268935-barbarians-at-the-gate", "http://www.goodreads.com/book/show/26064021-things-no-one-will-tell-fat-girls", "http://www.goodreads.com/book/show/29465033-whipping-girl", "http://www.goodreads.com/book/show/19730030-a-history-of-warfare", "http://www.goodreads.com/book/show/22844509-best-friends", "http://www.goodreads.com/book/show/40205082-everything-is-horrible-and-wonderful", "http://www.goodreads.com/book/show/18939110-let-it-go", "http://www.goodreads.com/book/show/40192801-future-crimes", "http://www.goodreads.com/book/show/13576617-still", "http://www.goodreads.com/book/show/35525893-sick-in-the-head", "http://www.goodreads.com/book/show/40205119-paris-1919"]}