{"ratings": 6283, "userreviews": [{"userName": "Vicki", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/2624532-vicki", "userReview": "I'm reading Someday (Sunrise Series-Baxter 3, Book 3). This is a series that is best read in order and focuses on the Baxter family. There are 3 sets of books about the Baxters. The first set is called the Redemption Series. Karen Kingsbury co-wrote it with Gary Smalley. The next set is the Firstborn Series, and Karen wrote these on her own. Then, she wrote the Sunrise Series. The book I'm reading now is the 3rd book in the Sunrise Series. It's unusual to have so many books about the same family (14 books).I find this family is easy to love, and I feel compelled to read to the last book to find out what happens to them. Some of the story lines throughout the series took a little while to grow on me especially in the Firstborn Series. The story line with Dayne and Katy is the only one that seems to drag at times. I think Karen is an extremely talented writer. When I worked at the library, we couldn't keep her books on the shelf. This is one of the few authors that writes books that make me cry. Her stories are so realistic that it's easy to transport yourself to her world. All the books in this series are hard to put down after you start reading.Karen Kingsbury does something unique. She raises funds for charity by including characters in her book based on real people. The winner of the bid at the charity gives Karen the name and details about a person they want to honor. She creates a character in her book to honor the person. In Someday (Sunrise Series-Baxter 3, Book 3), Karen creates 3 characters based on the life of three people. To read more about it go to Karen's website and click on the 'Forever in Fiction and Karen's Trademark' link.The current book, Someday (Sunrise Series-Baxter 3, Book 3), follows Ashley, John, Brooke, Luke, Katy, and Dayne. I am enjoying it so far. I can't give too many details as I don't want to spoil it for those of you who haven't read it yet and possibly not read any of this series. Usually when a book has too many story lines in one book, I don't like it. It doesn't bother me in this book, probably partially because I know the characters from the other books and partially because of Karen's gifted writing. I like the fact that Ashley takes the lead in keeping the family connected. She has a big heart and a strong faith in God. She has her flaws, but she cares deeply about her family. Ashley is my favorite character in the whole series."}, {"userName": "Reagan Soper", "userReviewDate": "Feb 06, 2017", "userURL": "http://www.goodreads.com/user/show/47738522-reagan-soper", "userReview": "this book definitely fits the title. someday we will be fine from the death of our daughter. someday we can get away from the fame. someday I will ask Elaine to marry me. someday I'll see baby Sarah again. someday Cody will come back to Bloomington. someday CKT will run again. and it was ends with a someday. truly amazing book, Karen. you never disappoint!"}, {"userName": "Kathryn", "userReviewDate": "Feb 22, 2009", "userURL": "http://www.goodreads.com/user/show/1329275-kathryn", "userReview": "I really liked the baxter series and this wasn't a disappointment. It continued the storyline of the famous actor and his new wife that have to wade through the changes and adjustment of being married, being in public eye and learning to trust each other. They also try to make the short life of a baby have meaning by showing how miracles can come of the experience. Can't wait to read the next and last book. I like that christian values are displayed."}, {"userName": "Catherine", "userReviewDate": "Mar 21, 2016", "userURL": "http://www.goodreads.com/user/show/39360447-catherine", "userReview": "The Baxter family is a large close knit family. Like so many, they have their troubles and heartaches. However, their faith in God helps each of them to heal and return to their families. Ashley, who just lost her newborn baby girl seems to be the bond that holds them to each other and their faith. Since this is my first Karen Kingsbury novel. I am sure I will be reading more."}, {"userName": "Wendi", "userReviewDate": "Mar 06, 2009", "userURL": "http://www.goodreads.com/user/show/1629963-wendi", "userReview": "Dayne and Katy drove me a little crazy in this one. Although their actions were realistic, I wanted to reach through the book and shake them. Still a very good read though."}, {"userName": "Becky Ames", "userReviewDate": "May 09, 2015", "userURL": "http://www.goodreads.com/user/show/6022693-becky-ames", "userReview": "Loved! Once I got half way through this book I seriously couldn't put it down!"}, {"userName": "Emily", "userReviewDate": "Apr 07, 2009", "userURL": "http://www.goodreads.com/user/show/1461224-emily", "userReview": "Cheesy yet encouraging fiction..."}, {"userName": "Rebecca Ray", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/44239460-rebecca-ray", "userReview": "Dayne and Katy Matthews are under intense pressure from their careers and from the press. Now, they're going to be separated from each other for ten weeks, and rumors of infidelity are swirling as the tabloids look for the slightest sense of trouble in their marriage. Will their marriage survive?The Flanigan family feels a deep loss as the children try to navigate their high school lives without CKT. They also have seen the detrimental effects of not having the CKT program in their friends' lives. Will they be able to pull together? Will CKT come back to their hometown? Will their friends continue down the wrong paths that they set out on?John is considering marriage. He wants to marry Elaine, but has difficulty letting go of his house and his life with Elizabeth. Will he continue on with Elaine or retreat to his memories of Elizabeth?Someday is a good theme for this book. Someday Katy and Dayne will have a normal life. Someday John will be able to move on from his past and ask Elaine to be his wife. Someday Ashley will heal from the death of little Sarah. Someday all this will happen. However, much of the book is spent waiting and in pain.Having said that, this is a book I really enjoyed. It's a book that has a lot of turmoil and pain, but it is also a book that had a strong message for me. I was reminded that life is only as fun as I make it, and that I can choose to find joy in every day of my life and of all of my circumstances. I can choose how to respond to life and to the people in it, and I can choose grace, forgiveness and love. Several of the characters in this book need to make these kind of choices, and it's interesting to see them play out in different ways.Here are my thoughts on the major point of view characters. There may be some spoilers included, so read on at your own risk.John: He's thinking about marrying Elaine. In fact, he thinks this is the right move and even buys an engagement ring. However, he finds as he makes plans to build a life with Elaine, that he is having difficulty putting aside the pain and pushing on to the future with Elaine. He's not even sure if building a future with her is the right thing to do. I get it. I do get it. I love that he finally realizes by the end that he has room in his heart for both his memories of Elizabeth and his new life with Elaine.Dayne: He's trying to walk the straight and narrow and stay away from even the hint of impropriety in the 10 long weeks that he's away from Katy. However, a picture implicates him in having an affair with his co-star, and even though it is not him in the picture, no one believes him, including Katy. He spends much of the rest of the book attempting to overcome this crisis and to show his wife how true his devotion is to her and to their marriage. He receives some help from his friend Bob, and after spending time with him (and reading through some letters that Elizabeth wrote), he comes through big time in the husbands trying to fix their marriage department. It's truly a beautiful thing.Ashley: She's healing and mourning the loss of her baby. She's trying to find the good that Sarah's short life caused. There are so many miracles happening with her relationship with Brooke, her acceptance of Elaine, and with the new pregnancy center that she's helping to establish in Sarah's name. Yet, there are still miracles that she's hoping for, and some healing to come. Her story is very poignant in this part of the series, and I've enjoyed seeing her develop as a character in recent books.Katy: She's back to annoying me. In this book, Katy chooses to spend time doing her own thing, instead of being a good and supportive wife. She goes off to make her own movie, spending ten weeks in London. She gets completely disconnected from Dayne, believes the worst about him from the tabloids, and nearly decides that the right thing to do was to end her marriage. I found myself really frustrated with her.Jenny: She is a friend and confidant of Bailey's teenage drama. She's a supportive wife and is busy raising her own children. There are two places in the book where she really shines. First, she reminds Katy that the distance and strain in her and Dayne's marriage is self-inflicted. She caused her own troubles. Second, after hearing about Bailey's friend's abortion, she is burdened with the need to re-open the pregnancy crisis center. This leads to a beautiful story arc for Brooke, and I'm really enjoying.Brooke: Brooke repents of her sins in regarding life so lightly. She repents of her sins in recommending abortion for patients and becomes highly involved in opening a pregnancy crisis center in town. Even better, we see some really tender scenes of her with some of her young patients. She really shines in these scenes.Randi: Sometimes it's good to get inside the head of an antagonist. It's delightful to see here some of the motivations of rebellion and of not feeling loved that led Randi into being the person that she is. We also get to see her repent of her ways and ask God for forgiveness of her sins. We see through her that Jesus completely changes all that he touches.Reagan: Her children are quite the handful. She's lonely in her marriage and feels unloved. She finds herself growing closer to a fireman and allowing herself to separate from her husband. Her husband soon ends the separation by coming home, and she learns that he has truly been unfaithful to her. Things are not happily ever after, and their marriage is still a mess. However, for now they are back together.Luke: He's unhappy in his marriage. He attempts to escape it by long work trips and flirtations with other women. He finds himself making out with Dayne's costar and allowing Dayne to take the fall when the photos are published in the tabloids. He doesn't feel much guilt about the whole thing until he reads some letters that his mother wrote. He feels crushed with guilt and pain and returns home to attempt to make things work with his wife. We don't know if they will work, but they are currently together, and for now, it's enough.Bailey: She's pained by a friend's abortion. She misses Cody. She has other boys on her mind, including Tim Reed. She misses CKT and prays that it will come back to town. In other words, she's a complete mess and I roll my eyes at her teenage drama.Cody: He misses the Flanigans, especially Bailey. He's adjusting to life in the army, and he has a near brush with death. He realizes that God is looking out for him. His portion of this book is small, but sweet and good.Kari: She's still an emotional center in this family as she hosts her sisters for dinners and builds relationships with each of them. She's incredibly sweet as she flits through the book, just holding one or two perspective scenes.Landon: He compliments Ashley's craziness so well. His perspective scenes are sweet, showing him at work and with his father-in-law. He's a true rock and a husband any woman would love to have.All in all, I loved this book and was very excited about it. Looking forward to reading future entries in this series!"}, {"userName": "Anne Marie", "userReviewDate": "Sep 14, 2017", "userURL": "http://www.goodreads.com/user/show/11986319-anne-marie", "userReview": "In this book, Dayne and Katy go to their separate locations to film their movies. Everything is fine until a tabloid picture comes out of a man who looks like Dayne kissing the leading lady in the film, Randi, on a secluded beach. Dayne and Katy's relationship is tested once again until Katy finds out who the man on the beach really is. It's Dayne's brother, Luke, whose marriage is having hard times. His wife Reagan is at home with their two young children while Luke has been going on numerous trips for work. John Baxter is having a rough time deciding what the next step should be in his relationship with Elaine Denning. John will always love his deceased wife, and will of course cherish the memories he has of her. He has put together scrapbooks for each of his children of letters written by their mother. They are thankfully not damaged in a fire that starts in the Baxter's house attic. They are welcome gifts that seem to come just in time when their inspiration is needed the most. Ashley and Landon are still trying to get over the loss of their baby Sarah. Ashley has asked God to help Sarah's life and memory to be lasting and a help to others. Her sister, Brooke, reopens the crisis pregnancy center calling it Sarah's Door, a place where hopefully life will be the final decision. Finally the right decision has been made about the CKT theater!! Dayne, with the help of making probably millions of dollars as a movie star, at the very last possible minute for dramatic purposes, buys not only the theater building, but the buildings around it, so Katy never has to worry again about losing CKT.The only adding of my two cents I'd like to add is the Baxter home, being that it will have to be put up for sale so John and Elaine can start a life in a new place without emotional memories, I think should be sold to Erin and Sam and their four daughters who are moving back to the area. Maybe in the next book..."}, {"userName": "Angela", "userReviewDate": "Aug 20, 2017", "userURL": "http://www.goodreads.com/user/show/14692769-angela", "userReview": "Hmmm not my favorite but I don't know if it's just because of all the bad stuff that occurred in the story that made me angry or the annoying repetitive paparazzi parts....it's a toss up."}, {"userName": "Sylvia", "userReviewDate": "Feb 26, 2018", "userURL": "http://www.goodreads.com/user/show/3668242-sylvia", "userReview": "I loved this book!! Great story!!! couldn't belive luke cheated on Reagan Hope they work it out!! love this author!!"}, {"userName": "Cortney", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/5211086-cortney", "userReview": "gave up on this book"}, {"userName": "Tracy", "userReviewDate": "Jun 08, 2018", "userURL": "http://www.goodreads.com/user/show/1950889-tracy", "userReview": "This story followed the paparazzi story more closely. That is my least favorite part of this series so not my favorite book in the series."}, {"userName": "Sara Fite", "userReviewDate": "May 20, 2018", "userURL": "http://www.goodreads.com/user/show/81010330-sara-fite", "userReview": "This one was my least favorite book in the Sunrise series. Dayne and Katy once again got on my nerves and frustrated me. I didn't like their story line at all. I felt like nothing major really happened in this book and that it was very slow moving. I had to force myself to keep reading this one at times and the only reason it got 3 stars instead of 2 stars was because I just really love the Baxter family."}, {"userName": "LadyCalico", "userReviewDate": "Nov 06, 2009", "userURL": "http://www.goodreads.com/user/show/2288360-ladycalico", "userReview": "This book was a let-down after Summer--I thought the characters had grown some, but in this one they regress again. I have a great deal of ambivalence about Karen Kingsbury books. Generally I find the stories soap-operaish, juvenile, and often contrived and unrealistic. Often I find the characters immature and get disgusted when 30-ish Christians respond emotionally and hurtfully to a contrived difficulty with the maturity of a 13-year old. (Yes, I am extremely left-brained.) They do way too much emotional reacting and not enough pro-active thinking--most Christians in my life are way more mature than that. However, when the characters finally do get around to thinking, forgiving, seeking answers in prayer, Scripture, and counseling, I suddenly love Karen Kingsbury and her biblical insights--they just take way too long to get there! I would highly recommend her stories and writing style to adolescents and young adults, but for someone who's been around the block a few times, the characters' often silly immaturity can get very annoying. The Bible lessons she works into the solutions to her problems are so right-on and really touch me where I live. So, hate her soap-opera. dragged-out writing/love her theology. Just for the Bible insights, I will probably continue to read her books, even if I have to skip over parts where 30-year-olds are reacting like adolescents. I will have to read every Karen Kingsbury book twice--the first time just to know what idiotic parts I can skip over and what deep parts to re-read for the Bible and life lessons."}, {"userName": "Amy", "userReviewDate": "Sep 09, 2012", "userURL": "http://www.goodreads.com/user/show/7718083-amy", "userReview": "\"A DESPERATE SITUATION: Pressures of the celebrity lifestyle weigh heavily on Dayne and Katy Matthews as they take on separate movie projects. Tabloid rumors talk of trouble and unfaithfulness between the two. And then a dramatic cover photo threatens to destroy everything they've worked to build together. Only Dayne knows the truth about the photo, truth that would help Katy believe him. But the truth will also cause devastating damage to the people he loves so dearly - the Baxter family.A HEARTBREAKING LOSS: The Flanigan family recognizes the deep loss of the Christian Kids Theater, and Bailey and Conner see their CKT friends fitting in with the wrong crowd, making decisions that will harm them. The Flanigans begin to pray for a miracle - that even without the theater, somehow CKT will go on.A SEASON OF HOPE: John Baxter takes the next step in his relationship with Elaine, giving him a season to contemplate selling the Baxter house - and losing a lifetime of memories. As the rest of the family considers the future, they must pull together like never before. Only their undying love for each other can help them overcome today's trials for a life they know is possible...someday.A story about God's unending faithfulness and the promise of tomorrow - in life, love, and the legacy of family.\""}, {"userName": "Tamara Tilley", "userReviewDate": "Jun 22, 2012", "userURL": "http://www.goodreads.com/user/show/1383724-tamara-tilley", "userReview": "SOMEDAY by Karen Kingsbury, the third in the Sunrise series allowed us a glimpse at Dayne and Katy, a Hollywood couple the paparazzi are determined to break up. While SOMEDAY also touched on Luke’s troubled marriage, Ashley’s heartache from the death of her infant daughter, the loss of the CKT (Christian Kids Theater), and the growing relationship between John Baxter and Elaine, Dayne and Katy were the main focus.The ups and downs of Dayne and Katy’s relationship/marriage were pretty predictable. At times, I felt Katy’s character was a little off the mark. Katy I feel is a person who loves with all she is. And at times, she seemed to give up too easily on Dayne. I appreciated the growth we saw in Dayne, and his desire to get right with the Lord.I don’t know what to think about Luke. Before the 911 scenario he was such a passionate, straight arrow type of person. Since then, he just seems to jump off the deep end whenever life gets tough. I found myself not liking him when he was portrayed as a husband not wanting to deal with the everyday family trials. He acts like he is trapped by his circumstances instead of embracing family life.I am off to read the last in this series."}, {"userName": "Terri Tinkel", "userReviewDate": "Jan 06, 2013", "userURL": "http://www.goodreads.com/user/show/7323772-terri-tinkel", "userReview": "I picked up this 3rd-in-a-series book. Most of the time when you pick up a book in a sequence, there is a little bit of back history to bring you up to speed. I was very disappointed that this book had so many characters (over 7 main characters plus various spouses and/or friends) and so many back stories that I was caught up in trying to figure out what was going on. Suffice to say that all the characters were part of a large family and all of them had a deep faith that seemed to carry them through almost every thing that happened to them. This is a good book for light reading. I don't mean to be disrespectful when I say there was a lot of praying and religious teachings in the book. It all was meant to direct the reader towards the finish...which was so obvious that I probably didn't need to complete the story.This author has written several series of stories so obviously she knows how to come up with plots even if they are not always unique."}, {"userName": "Kimberly", "userReviewDate": "Jan 29, 2008", "userURL": "http://www.goodreads.com/user/show/314156-kimberly", "userReview": "Book 3 in the Sunrise series. This one picks up right where Summer left off. Ashley and Landon are trying to move on after the death of their daughter Sarah. Her short life truly touched all the Baxter's and has brought inspiration to open up a new crisis center in town. John is struggling with the emotions he is facing in his relationship with Elaine. Does he want to take the next step with her? Would that be betraying Elizabeth's memory? Katy and Dayne are in different countries working on movies. Their marriage is already strained by the separation and is put to the test when a questionable photo makes the headlines. There are a lot of struggles and challenges to face not only in the Baxter family, but in Bloomington as well. Just a wonderful story. Only sad thing is one book remains in the series :("}, {"userName": "Laura Beasley", "userReviewDate": "Oct 10, 2015", "userURL": "http://www.goodreads.com/user/show/3424861-laura-beasley", "userReview": "Another wonderful book and as I have done thru all the others it made me cry several times. So many wonderful life lessons and wonderful scripture to remember. Dayne and Katy go in different directions to make movies and their love is tested. Reagan and Luke 's marriage is falling apart and Luke's behavior will affect Dayne and Katy. The theater is sold and will be torn down and the children of CKT are so sad. The truth comes out and Dayne and Katy get together and he buys the theater and has plans for the future and Katy tells him she is pregnant. Luke and Reagan go for counseling to save their marriage. John and Elaine are engaged. A pregnancy center is opening and will be called Sarah's Door. Ashley and Landon believe the short life of their daughter Sarah was a miracle and affected their lives, family and will affect others in the community."}, {"userName": "Grace Ganah", "userReviewDate": "Sep 09, 2016", "userURL": "http://www.goodreads.com/user/show/59481514-grace-ganah", "userReview": "this book is AWESOME"}, {"userName": "Nicole", "userReviewDate": "Nov 17, 2008", "userURL": "http://www.goodreads.com/user/show/700852-nicole", "userReview": "Once again, Karen has outdone herself. I love this series and these characters, and really enjoy reading about them.Can't wait for the next book, although I'm not at all thrilled it will be the last book in the series!Good quality, clean fiction that manages to draw the reader in by the strength of the characters and their stories, without having to resort to sex scenes, graphic violence, drug abuse or sci fi / fantasy. I enjoy the Christian / religious element to these stories, and like how it gives me a new perception of how Christian people live their lives.I think every fan of this series will agree with this statement:I'd love to visit with the Baxters one day !!!!!"}, {"userName": "Rhonda", "userReviewDate": "Jul 28, 2008", "userURL": "http://www.goodreads.com/user/show/831331-rhonda", "userReview": "Karen Kingsbury has done her usual, exceptional job of writing with this book. She manages to spin a story line that keeps the reader on the edge of his/her seat for awhile, then it seems to resolve itself. I am looking forward to her next book to find out what happens to one couple who seemed to be left hanging in this book. I just can't say enough about how much I enjoy Karen's books and the new perspectives they have given me on some controversial issues. They have also helped me to have a better insight into the trials and failures Christians face and how God can use these situations for His glory."}, {"userName": "Sarah", "userReviewDate": "Sep 07, 2016", "userURL": "http://www.goodreads.com/user/show/40147342-sarah", "userReview": "I'm going to be sad when all these stories are over. I have to admit to being a little jealous of Bailey's relationship with her mom. I wish I could talk to my mom about anything and everything. I hope my daughters will one day have an open relationship with me. Whew! What a roller coaster in this book! Dane and Katy are almost destroyed by lies, Luke and Reagan are almost finished by the beginnings of affairs, and then there is all the stuff with John and Elaine. I'm not thrilled that they're getting married and the Baxter house is being sold, but it's just a story. Yes! Dayne bought the theatre!!!!! I was so hoping he would. And he and Katy are having a baby"}, {"userName": "Kristine", "userReviewDate": "Aug 02, 2010", "userURL": "http://www.goodreads.com/user/show/490559-kristine", "userReview": "This book picks up when Ashley and Landon leave the hospital after the death of baby Sarah. Their prayer is that her short life makes a difference and even a miracle in the lives of those she touched. Katie and Dane struggle with their new marriage as they must make movies in two different continents. Luke and Regan's marriage weakens as both look to others for companionship and affection. John Baxter considers the idea of asking Elaine to marry him but wonders how he could ever leave all the memories of the Baxter House. Christian Kids Theater is doomed, because the building they always performed in has been sold and about to be demolished. In all of this and more, God is at work."}, {"userName": "Jennifer", "userReviewDate": "Apr 27, 2011", "userURL": "http://www.goodreads.com/user/show/837447-jennifer", "userReview": "Good book to read if you enjoy Christian fiction, which I do. The Baxter family is a big family and you get to see each of the family members going through different challenges in their lives and see how they resolve them based on their faith in God and belief that God has good plans for them and can do miracles. It's a good reminder to go to God about everything I face in my own life and to be still and know that God has a plan for me, to have faith and ask for miracles. Very positive and uplifting reading."}, {"userName": "Tammi", "userReviewDate": "Dec 27, 2015", "userURL": "http://www.goodreads.com/user/show/29622799-tammi", "userReview": "I've enjoyed most of this series but I to be honest that I can hardly take the Katy and Dayne story. I like their characters, but I get burned out on the \"Whoa is me\" mentality. And that they always jump to believe the tabloids before talking with each other is just riduculous.That being said, there are still amazing and emotional storylines in this book. Even though I claim parts irritate me, Kingsbury still can manage to make me cry like a girl. I'm looking forward to the final book of these four."}, {"userName": "Sheila", "userReviewDate": "Aug 04, 2009", "userURL": "http://www.goodreads.com/user/show/570070-sheila", "userReview": "A good read showcasing the struggles of the characters particularly with their marriages- issues arising from misunderstanding and infidelity particularly with Luke and Reagan as well as Katy and Dayne. Made me realise how weak humans can be without God and how central He is to everything in life...and how much He wants to teach and guide us if we'll just be still in listen. While there were painful moments in the book the ending was a satisfying one with most of the characters finally attaining their 'someday.'"}, {"userName": "Diane Buzzard", "userReviewDate": "Sep 20, 2016", "userURL": "http://www.goodreads.com/user/show/50103560-diane-buzzard", "userReview": "The BaxtersIt's my pleasure to review this # 3 book in the sunrise series. The way that Karen Kingsbury weaves the characters in & out of trials that most people go through in one way or another while also experiencing the highs of life. Including God's word as guidance & inspiration through the story is something I look for in a book.If I had to criticize anything it would be that Karen repeats a circumstance occurring with one character or another. Also too much description of the settings. I find my self doing a bit of skimming at times."}, {"userName": "Darcee", "userReviewDate": "Dec 08, 2011", "userURL": "http://www.goodreads.com/user/show/2888790-darcee", "userReview": "Again, what a great story! I loved the story with Dayne and Luke...so spicy! Poor Katy though, I don’t know how she hung in there through all the drama. I just love the happy ending and the message of how important family truly is regardless of the stage of life we’re experiencing. What a great blessing! But, she does a great job of making it very realistic. The Baxter family is by no means perfect, but they try their best!"}], "description": "Pressures of the celebrity lifestyle weigh heavily on Dayne and Katy Matthews as they take on separate movie projects. Tabloid rumors talk of trouble and unfaithfulness between the two, but finally something drastic catches Dayne's attention and makes him realize the destruction they're playing with. But will it be too late? The Flanigan family recognizes the deep loss of the Christian Kids Theater program, and they lead a final effort to keep the theater from being torn down. Meanwhile, John Baxter takes the next step in his growing relationship with Elaine, giving him a season to contemplate selling the Baxter house and, along with it, losing a lifetime of memories made there. As the rest of the family considers the future and what may lie ahead, they must pull together like never before. Only their undying love for each other can help the Baxters get past the trials of today for a life they know is possible . . . someday.", "title": "Someday\n      \n          (Sunrise #3)", "url": "http://www.goodreads.com/book/show/1816825.Someday", "average": 4.41, "cover": "https://images.gr-assets.com/books/1348693993l/1816825.jpg", "reviews": 164, "authors": [{"url": "https://www.goodreads.com/author/show/3159984.Karen_Kingsbury", "name": "Karen Kingsbury"}], "type": ["Christian Fiction", "Christian", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1816825.Someday", "http://www.goodreads.com/book/show/8266608-someday", "http://www.goodreads.com/book/show/11433.Redemption", "http://www.goodreads.com/book/show/289644.Even_Now", "http://www.goodreads.com/book/show/35332.Remember", "http://www.goodreads.com/book/show/97862.One_Tuesday_Morning", "http://www.goodreads.com/book/show/8139321-leaving"]}