{"ratings": 1551, "userreviews": [{"userName": "Katie(babs)", "userReviewDate": "Jan 12, 2010", "userURL": "http://www.goodreads.com/user/show/179852-katie-babs", "userReview": "Jessie Shimmer lives with a man who excels in magic and uses that supernatural talent to bring in the rent money. Cooper Marron helps Jessie tap into her very unskilled powers as both her mentor and lover. She also has a spirit guide, a familiar ferret named Palimpsest or Pal as she nicknames him, who doesn’t talk to her just yet. Cooper has been having some bad nightmares and she’s concerned. He doesn’t think it’s a big deal and has them working on their next score that will net them easy money. Cooper, along with Jessie as his aid, will bring forth a rainstorm to break a drought that’s causing major problems for the farming community outside of Columbus. As Cooper goes through his typical ritual, something goes very wrong and he ends up opening a portal to Hell. Cooper is pulled in, leaving Jessie alone to fight a demon that has come out of the portal. Suddenly, Jessie's dead aunt calls her on her cell phone, and Pal starts talking to Jessie. It’s up to Jessie to subdue the demon formerly known as Smoky, Cooper’s familiar fox terrier and stop it from causing destruction in the downtown area. But, Jessie is still a novice and barely stops the demon and ends up almost dying and losing an eye and part of her left arm.Even though it seems things couldn’t get worse for Jessie, they do. The leader of the governing circle of the seven powerful witches and wizards, Benedict Jordan, places a magical gag order on Jessie to stop her from rescuing Cooper. Jessie has to sign a magical binding contract or she will become an outcast leaving no one who can help her. She knows something is off with Jordan, and along with Pal, a ping-pong ball she uses for an eye and the help of Cooper’s brother, Warlock, she’ll channel more magic and power so she’ll be able to walk through the fires of hell to get her man back and find the answers she needs. With enough willpower, she hopes to get her old life back, and hopefully grow back a new eye and arm so she doesn’t look like a freak. Spellbent should have been another action packed urban fantasy combined with a bit of humor and on the edge of your seat action. Unfortunately, this debut by Lucy A. Snyder was an utter train wreck of unbelievably bad dialogue and badly edited scenes. Half the time I couldn’t figure out what was going on. Also, Pal the ferret, who’s a combination of reason and condescension, brings nothing mentionable to the plot or with helping Jessie. Pal's voice is described as a Canadian Librarian, which for the life of me, I am still trying to figure out what that sounds like and why would we care?The story is cluttered with descriptions that are so amazingly over the top and not in a good way. I thought it was bad enough when Jessie goes rooting through the garbage can for a used maxi pad for a magic spell, but I was mistaken because it gets worse. When Warlock and his girlfriend, Opal end up making some special creatures due to the combination of Opal’s menstrual period and Warlock’s sperm that was mixed together in a toilet that was it for me. Among other scenes like this, I couldn’t figure out if Snyder was going for a more dark comical fantasy tale, where she tried to succeed in writing something differently that stands out from the normal urban fantasy series being published. If so, she hasn’t accomplished that in any way.Jessie is annoying and very immature. There is really nothing to recommend her. The villain Jordan makes a very forgettable appearance. Warlock had his moments, but he was written as such a sad sack and as close to a drugged out hippie character as you can get.The overall plot of Spellbent is in a word- dull. The motions Jessie goes through to find Cooper don’t deliver in any way and has a major lack of focus and the push needed to keep the reader interested. The writing is very much surface writing, as in there is no meat or depth, and by the time I finished reading, I couldn’t remember half of what happened. Spellbent is a very weak book that strives to be something more and fails in every way."}, {"userName": "Kelly", "userReviewDate": "Feb 03, 2010", "userURL": "http://www.goodreads.com/user/show/2276205-kelly", "userReview": "4.5 stars.It’s just a routine rain spell. Jessie and her teacher and lover, Cooper, head to the city park to call up a storm and make a few bucks. But something goes horribly wrong. By the end of the night, Cooper has been sucked away into a Hell realm, and Jessie has suffered devastating injuries. Then, things get worse. Benedict Jordan, the leader of the city’s magicians, gives Jessie a choice: either she agrees not to rescue Cooper, or else she becomes anathema. Jessie is definitely not the kind of girl who’ll leave her boyfriend to rot in Hell, so she chooses anathema. Jordan proceeds to ruin her life and leave her with nothing. Nothing, that is, except her never-give-up attitude and Palimpsest, an uptight ferret familiar who is described as having the voice of a Canadian librarian. (Not knowing any Canadian librarians, my brain has substituted an unholy cross between Rupert Giles’ voice and C-3PO’s.) Pal provides much of the comic relief in Spellbent.Together, Jessie and Pal do everything within their power, first to survive, then to save Cooper. Jessie’s tenacity and resourcefulness make every step of her journey compelling. Jessie could be forgiven for wallowing in angst, given what happens to her, but she doesn’t. She never stops moving toward her goals. I read Spellbent in a single afternoon and evening, unable to tear myself away. I had to know what happened next!It’s a good book even before we get to Hell, and then it’s the Hell scenes that really blew me away. I was expecting the usual flames and pitchforks, but Snyder doesn’t go that conventional route. Cooper’s Hell is an intensely personal one. And wow, is it dark. I think my jaw was on the floor when Jessie (and I) learned about the horrific events that lay at the root of the entire plot.Spellbent is dark enough that it won’t be for everyone; an Amazon reviewer compared the gore level to that of Ilona Andrews’ first Kate Daniels book, Magic Bites, and that’s a pretty accurate parallel. This comes in part from the horror elements and in part from the magic system that Jessie and Cooper use: ubiquemancy, the art of finding the magic in everything. This sometimes means unsavory ingredients, like bodily fluids. It can get a little gross. But at the same time, it adds a verisimilitude that I can’t help but respect. Ancient and medieval “spell recipes” often called for ingredients that would make most of us squeamish.A minor aside: There’s an odd little editing glitch in my e-ARC (it may be corrected in the published book). Jessie remarks that she’s “not afraid of some third-string football-player rapist,” which had me rereading earlier pages to make sure I hadn’t missed anything. I hadn’t; we meet the football-playing rapist in the next scene. It has no bearing on the plot, so all it did was make me scratch my head for a few minutes.Jaded urban fantasy fans should consider giving Spellbent a try. Snyder adds together a determined yet flawed heroine, fun secondary characters, a plot with tons of forward momentum, and one seriously creepy Hell, and the end result is a visceral, powerful modern-day Orpheus myth."}, {"userName": "Ann", "userReviewDate": "Dec 30, 2009", "userURL": "http://www.goodreads.com/user/show/57722-ann", "userReview": "FYI: I know the author. :-)Reading this was a bit like being on a roller coaster. You strap yourself in, and away it goes, pretty much from page one and drops you back on the platform, breathless and giddy on the last page. It's also something different than I've read in a lot of urban fantasy. Yes, there's the kick-ass heroine, Jessie Shimmer. But she never really whines despite the unfairness of the situation she finds herself in... nope, she puts on her big-girl panties and plunges on. Because her goal--free her lover Cooper from hell--is the thing that drives her. Jessie has some pretty horrific things happen to her right away, and life just doesn't get any easier after that. She's tough, but not above listening and learning.I should say that this is a dark urban fantasy--it's gritty and blends a lot of the things I like about horror into fantasy. It's not a fluffy, happy UF. It's a gritty, these-things-will-really-kill-you romp.But it's a delightfully fun romp, with a lot of humor and a unique magic system. And devils and things that make you go ew. And a well-crafted world. With a ferret familiar.And who can beat that?"}, {"userName": "Ithlilian", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/4793655-ithlilian", "userReview": "I'm not sure about Spellbent. On one hand I loved the action, the magic, and the story, but on the other hand some of the characters bothered me, and parts of the plot were strange. Our heroine, Jessie, is strong, tough, and doesn't take crap from anyone. She has a good sense of humor, overcomes adversary quickly, and makes the best of any situation. She is not impervious, she can, and does get hurt, and she isn't cold and unfeeling. In other words she has everything I could want in a heroine, including an interesting back story that was only touched on in Spellbent. One of my favorite things about this novel is that it made me laugh out loud a few times. The humor may not appeal to everyone, but I certainly enjoyed it. The magic system was also a plus. Everything was explained really well with no holes, it felt realistic, and it wasn't too easy to cast a spell. The plot was fairly simple, and involved a rescue mission, but I enjoyed everything I read. Some may have been bored by the fairly straightforward one event leads to another storyline, but I wasn't. During the journey from lost to found we meet some interesting characters such as Jessie's familiar, Pal, Warlock, Opal, and some college kids. I'm on the fence as to whether I really like Pal. Part of me thinks the story would have been just as good without him, but part of me liked his conversation with a kitten and his ability to point Jessie in the right direction and help get her out of bad situations. For a few hundred year old being from another realm, he acted a bit airheaded at times, but as he said, he has had a long time to learn human customs, so his character didn't bother me too much. Those who did bother me, however, were Warlock, and Opal. When Warlock was first introduced I expected him to be sophisticated, intelligent, and helpful, not cowardly, burnt out, and immature. His girlfriend Opal was just as unlikable, and Jessie's college roommates were pretty bland. Also, none of the characters were as interesting or as strong as Jessie, even the bad guy was weak. In the end, it doesn't really matter how much I liked Warlock and everyone else, because they may have only been included in this book to serve a purpose. If their presence continues in the series, all I can hope for is that they grow, but personally, I don't think that supporting characters don't have to be as likable as the main characters. My last issue is that the place Jessie visits to rescue her lover is not as scary or dangerous as it should be. The entire thing was just a bit too easy in my opinion. Maybe with a bit more danger, a bit less help, and some better supporting characters, this book could have been a five. Still, Spellbent is an exciting urban fantasy, with no vampires or werewolves, and a likable heroine. I would definitely recommend it."}, {"userName": "Nick Cato", "userReviewDate": "Dec 29, 2009", "userURL": "http://www.goodreads.com/user/show/1194742-nick-cato", "userReview": "Snyder (author of the great short story collections SPARKS AND SHADOWS and CHIMERIC MACHINES) delivers her first novel. SPELLBENT is another entry in the urban fantasy/sexy occult genre, yet where others lean more on the sex and romance, Snyder's world is more centered around the magic its characters practice as well as the bizarre creatures and situations they face.Jessie Shimmer is new to the Craft and lives with her mentor/lover, Cooper Marron. When he's hired by local farmers to summon rain (a spell he needs Jessie to complete), they accidentally open a dark portal, releasing a demonic-centipede creature into the world. The local overseeing council of \"Talents\" manage to place the town under a protective barrier, but not before Cooper is sucked into the portal and Jessie is left alone to try and find him with little knowledge of her own skills and a new ferret familiar named Palimpsest (Pal to his friends).Barely surviving her encounter with the deadly creature (now with one arm and one eye less), Jessie attempts to find her man, despite the magic community being on the verge of banning her and her standing among them suspended. Being a faithful familiar, Palimpsest agrees to help her on her quest despite the repercusions. As Jessie learns to use her powers (with Pal's help), we're introduced to all kinds of memorable characters, and some of the gifts Jessie learns to use surprise even herself.Snyder's first Jessie Shimmer novel is a lot of fun to read, is loaded to the brim with action, monsters, and surprises around every corner. Shimmer is a tough-as-nails, smart female lead who I think most genre fans will take to before the second chapter ends and while Pal is a fantastic side-kick, I'm hoping he returns in the next book in his creepy, post-ferret form."}, {"userName": "Michele Lee", "userReviewDate": "Dec 10, 2009", "userURL": "http://www.goodreads.com/user/show/778299-michele-lee", "userReview": "I requested this book from the author.\tJessie Shimmer is an apprentice wizard who wants nothing more than to spend a pleasant afternoon with her lover and Master, Cooper. Instead their spell to summon rain goes wrong and Cooper vanishes, leaving Jessie alone in a park suddenly torn apart by magic. Despite being sealed off and left to die by the other magic users of the city, Jessie defeats the demon that came through the tear that took Cooper, taking severe damage herself.\tWhen she wakes in the home of Mother Karen, her friend and a healer things only get worse, for the magical ruler of the city wants Jessie silenced and Cooper to remain gone, permanently. With Mr. Jordan trying to crush her will and her desire to see Cooper back safely in her arms Jessie must risk losing it all, suffer the guilt of her past that she didn't even know about and try to save Cooper from his.\tSpellbent is a fast paced, hard to put down novel. Somewhere between Jim Butcher's Harry Dresden and Terry Pratchett's magical sections of Discworld, Snyder takes readers on a ride through strange creatures, powerful magic, true evil and personalized hell dimensions. \tAccompanied by her familiar, a sometimes ferret, sometimes something else altogether, and motivated by family and love Jessie is a lead that gets things done. Many urban fantasy novels have begun to display themes of friendship or defying the odds. Snyder gives her characters a familiar dark past, save that the focus is far more on their modern life and current survival than on a constantly circling cycle of dealing with the trauma of their pasts.\tA strong, enticing debut for Snyder in urban fantasy, this one is definitely on my list of must reads for the year."}, {"userName": "Kathy", "userReviewDate": "May 14, 2012", "userURL": "http://www.goodreads.com/user/show/7226271-kathy", "userReview": "Phenomenal Dark Urban Fantasy Debut!Since this book has already been reviewed in-depth, my review will be brief. This book instantly made it to the top of my favorite authors list. Its titillating originality completely stands-out within the vast array of novels, in the urban fantasy genre.The story and world building were dark, gritty and flowed nicely; the action was intense, magic was plentiful with lots of sinfully twisted humor. I was completely riveted to each page from start to finish.When the story first began, Jessie was a disciple, a follower, however by the end of the story she transformed into a confident and courageous fierce leader. She never whined, pout or stomped her feet but instead was a tenacious force to be reckoned with. For those readers looking for a novel with an authentic, hardcore heroine, who won't cry over annihilating someone in the name of self-preservation, then look no further, Spellbent is it!I highly recommend this book to fellow dark urban fantasy readers; and I am eagerly awaiting the next book Shotgun Sorceress due out 10/26/2010.I also recommend:On the Edge (The Edge, Book 1)The Better Part of DarknessBitter Night: A Horngate Witches BookHallowed Circle (Persephone Alcmedi, Book 2)Thorn Queen (Dark Swan, Book 2)"}, {"userName": "Shelley", "userReviewDate": "Aug 16, 2011", "userURL": "http://www.goodreads.com/user/show/3081722-shelley", "userReview": "*Rating* 4.0*Genre* Fantasy/Horror*Full review coming shortly*I had such a good time with this book that I actually had to restrain myself from spoiling things with my updates. Jessie Shimmer is a really interesting heroine who doesn't let little things like losing an eye or an arm stop her from rescuing her lover from hell.I also adore Pal (Palimpseet) Jessie's familiar who goes against the establishment to help Jessie and Cooper from those who stand in their way. Pal is so much more than just a little pesky ferrett.I am definitely looking forward to reading more about Jessie, Cooper, Pal, Mother Karen, Warlock, and the Council who was made to look stupid by Jessie and Pal.Lucy A. SnyderJessie Shimmer1. Spellbent (12/29/2009)2. Shotgun Sorceress (October 26th 2010)3. Switchblade Goddess (December 27th 2011)"}, {"userName": "Carien", "userReviewDate": "Jun 06, 2010", "userURL": "http://www.goodreads.com/user/show/3817527-carien", "userReview": "I loved this book. Jessie is one kickass heroine and I got sucked into the story right from the start and couldn't put the book down before I finished it. I must say that if you really look closely at the story at times there's not much happening besides Jessie trying to figure out what to do next, but still it feels really fastpaced and action packed which I think is an amazing feat. The one thing I can say against this story is that Cooper disappears quite early in the story, before I could really get a feel of Jessie's relationship with him. I'd have loved to read a bit more about the two of them together and just about Cooper. But there's going to be a sequel to this book in Oktober (Shotgun Sorceress) so I might get my wish."}, {"userName": "Craig", "userReviewDate": "Jan 02, 2010", "userURL": "http://www.goodreads.com/user/show/83180-craig", "userReview": "SPELLBENT is an excellent first novel, a well-written and fast-paced contemporary fantasy adventure. The wise-cracking and ass-kicking urban heroine has become something of a cliche, but that pitfall has been avoided here with the inclusion of a very wide range of supporting characters, many of whom are in no way \"good guys\" of the traditional sense, and by the clever twists and turns of plot. There are some nasty-gritty bits and some uproariously funny scenes and lines that contrast and heighten the effect each to the other very skillfuly; I was reminded of very well prepared Chinese sweet-and-sour dishes. I'm looking forward to the sequel."}, {"userName": "Melindeeloo", "userReviewDate": "Jan 28, 2010", "userURL": "http://www.goodreads.com/user/show/2766907-melindeeloo", "userReview": "Yes, gross does come to mind at multiple points in the story (re: not only heroine Jesse's maiming, but especially, making human-tadpoles and finding blood to fool a spell -don't ask), but still I enjoyed this life-goes-to-hell (literally) story of an apprentice who looses her mentor in the middle of a sex-fueled rain spell and then ends up loosing pretty much everything else (home, job, friends) when she survives the resulting demon the spell inadvertantly freed."}, {"userName": "Ibrahim Z", "userReviewDate": "Mar 25, 2010", "userURL": "http://www.goodreads.com/user/show/413547-ibrahim-z", "userReview": "I only read this book because it appeared on Locus's \"Best Books of 2009\" list. The only way I can explain that is that they're straining to stay relevant with Twilight in the public eye because this book was awful. This quote says it all:\"I think I'm handling the situation with sangfroid and joie de vivre and je ne sais quoi and all other kinds of Frenchy cool\""}, {"userName": "Karissa", "userReviewDate": "Dec 30, 2010", "userURL": "http://www.goodreads.com/user/show/4057501-karissa", "userReview": "I have been wanting to read this book, it sounded right up my alley and I had heard great things about it in the reviews I read. This book is incredibly creative, action packed, and relentlessly paced the whole way through. I read this book in just about one sitting, had trouble putting it down, and loved every second of it! There are going to be at least two more books in this series, Shotgun Sorceress releases tomorrow, and the third book, Switchblade Goddess is slated for release some time in 2011.Jessie is a witch of sorts who is in a hot relationship with her teacher, (also a wizard) Cooper. When they go to perform an incantation to bring some rain to the area things go horribly wrong. Cooper is pulled into Hell and Jessie is left horribly injured. Jessie will stop at nothing to hunt Cooper down, even when big-wig wizard Benedict makes her anathema to the magic community. Now with next to no resources and awful injuries, Jessie is left with only her familar Palimpsest (a rather mouthy ferret) to help her in her quest to get back her boyfriend.This book was one awesome ride. It's not a book for those who are squimish at heart, some of the descriptions are pretty gory and detailed...even the sex scenes are down and dirty. It is definitely non-stop action from beginning to end though, and the action scenes are very, very well done. For example in the first 30 pages or so Cooper gets pulled into Hell, Jessie faces off a demon with a dagger and a shotgun, Jessie gets horribly...uh...eaten up, and saves the whole city. That's just the first 30 pages, now imagine what the rest of the book is like.Jessie is not the most likable character; she doesn't have a lot of respect for the law, her relationship with Cooper is a bit off (that whole student-teacher thing is a kind of wrong), and she is definitely not miss perky. Still you have to admire her; the girl has guts and is darn determined to get what she wants. She will let nothing, not even Hell itself, get between her and her goals. She ends up having so little to work with that I admired her resourcefulness...even if it did border on distasteful at times.Her sidekick, Palimpsest, is another awesome character. He is an incredibly intelligent familiar that is willing to go out on a limb for Jessie; and he really is a steadfast friend to her. The book is filled with interesting characters that have interesting stories behind them.The world Snyder has created is an interesting one. There are different ways to do magic and different systems for them; it is a creative and interesting system that I enjoyed learning about and am curious to learn more about in future books.The book ends on a very satisfying note and does a great job wrapping up the story.Overall a wonderful urban fantasy series with great characters, loads of action, a creative world, and a well thought out plot. I loved this book and can't wait to read Shotgun Sorceress. If you are a fan of Kate Daniels, Jane Yellowrock, Elemental Assassin, or Jaz Parks check this out. It is a bit more on the gory side than some of the aforementioned books, but very well done."}, {"userName": "Lexie", "userReviewDate": "Apr 21, 2014", "userURL": "http://www.goodreads.com/user/show/712966-lexie", "userReview": "There's just something about SPELLBENT that seemed...off to me. I read it twice through, with a couple months between reads, but it wasn't until the second read through that I understood what it was. The main character, Jessie, is unbalanced as a 'person'. She goes from one extreme (emotional anguish) to another (she barely bats an eye at losing a limb), but doesn't seem to connect with those emotions. Premise wise, SPELLBENT worked as a good start up to Lucy's new series. I'm a sucker for novels that have a girl going all-out to save her lover, and the book doesn't disappoint on this. Jessie is tough and ballsy and powerful. She's also a resourceful person who knows more ways to screw a person using what she can find in the average trash can than anyone else I've read about. Sometimes her spells verged on the too much information side, and I didn't really need to know what one could do with a maxi-pad.Yet, through it all, Jessie remains vague. Not her intentions or motivation, but more who she is. The fight against the demon went badly the first time, and that's when there was two of them, so why is she so set on going another round? I'm all for flying by the seat of your pants, but when another option is given—a much more reasonable one, where the chances at succeeding are higher--shouldn't she have paused to think?In the end, SPELLBENT didn't satisfy my curiosity and left me with more nagging questions than is healthy. The next book, SHOTGUN SORCERESS, is due out in the fall, so maybe more answers will be given then."}, {"userName": "Anita", "userReviewDate": "Dec 14, 2011", "userURL": "http://www.goodreads.com/user/show/940248-anita", "userReview": "Damn good! (That's actually a bit funny, because she spends time in a hell dimension...never mind.) I really enjoyed this urban fantasy. It has a hint of romance, but that's not the focus at all. I liked the characters and the almost-dorky-but-not-quite moments of humor juxtaposed with moments of horror. And the overall story is great - it sets Jessie up for bigger and badder things, establishes her core group of friends, and hints at an interesting backstory to discover. The setting is modern day Ohio where magic lives among us in hiding. Jessie discovered her powers a bit late and hasn't had the usual instruction. She fell in love with one of her magic professors (Cooper) and now they live and work together - he was asked to leave teaching and she's too busy for school. Their private lessons are unorthodox - they use a kind of magic that is based on improvisation. During one spell (involving sex in a park to call rain), they accidently unleash a demon and Cooper is sucked into a hell dimension. Jessie defeats the demon just barely, and immediately finds herself on the shit list of the most powerful magic user in the region. It doesn't make sense why he's demanding she not go into the hell dimension to rescue Cooper. Eventually, everything ties together with a logical explanation and Jessie rescues Cooper after collecting some special powers along the way."}, {"userName": "Reed", "userReviewDate": "Jul 26, 2010", "userURL": "http://www.goodreads.com/user/show/1113585-reed", "userReview": "Urgh. Ever read a book just to pass the time until a better book comes along? It's so rare that my \"to read\" pile gets small, but nothing was calling to me from said pile, so I decided to try Lucy Snyder's \"Spellbent\" that's been sitting there for quite some time.I've vague memories of picking it up because it had been compared to Tim Pratt and Jim Butcher--high praise in my mind. When I saw the cover and read the blurb on the back, I had second (third, & fourth) thoughts about reading it, eventually tossing it on a shelf.In any case, NO, this is not an urban novel as good as Butcher and Pratt. The exposition is excruciating. The characters are clumsy and seem like piecemeal creations of many other urban fantasies. The magic system is arbitrary and WAY too powerful. It doesn't make sense for a neophyte mage to start off this strong in a series opener.And strangely enough the novel is often crude, sometimes excessively so, for no apparent reason. If you need an example, check out page 220-221 for the Warlock's explanation of his \"children\"--accidental toilet creations from the mixing of male and female fluids. I can handle crude situations, but this is so out of place that it really bothered me.Not recommended, unless trapped for hours in a waiting room with nothing but this book, and years old People magazines."}, {"userName": "Pete Allen", "userReviewDate": "Jan 16, 2010", "userURL": "http://www.goodreads.com/user/show/276841-pete-allen", "userReview": "I've only recently found any urban fantasy books worth reading - generally I find the genre to be very derivative of fantasy gaming - elves with guns, dwarves running drugs, etc. But since Jim Butcher's Harry Dresden books saved the genre for me, I've been hoping for more.This first book of a new series promises to keep the bar up for the genre - the heroine is a gutsy practitioner of ubiquemancy, a sort of free-wheeling school that uses the magic present everywhere and in everything, less disciplined than your traditional schools and snubbed by the stodgy old folks of the Arts. The characters make the book in this one, and the action and dialogue are equally snappy. The suspension of disbelief is made easy by the author, who has a very real and consistent set of rules for her world, and a deep love for the people in it. Very much looking forward to the next in the set."}, {"userName": "Jenna", "userReviewDate": "Feb 28, 2010", "userURL": "http://www.goodreads.com/user/show/1292929-jenna", "userReview": "I loved this book! It is the story of Jessie, who is magically talented, and the search for her boyfriend, Cooper who was pulled into hell through a portal. The magical powers that be don't want Cooper found and do just about everything to prevent Jessie from rescuing him from getting her fired at her job to not allowing her healing treatments to fix terrible injuries she sustained battling a demon.The characters are full of life and have a sense of humor, including Jessie's familiar, a ferret named Pal. The plot was complex and original and kept me hooked in enough that I wasn't bored.I'm looking forward to a sequel!"}, {"userName": "Lolly's Library", "userReviewDate": "Mar 10, 2010", "userURL": "http://www.goodreads.com/user/show/2649865-lolly-s-library", "userReview": "Raw, gritty, dark, bare-knuckled, down-and-dirty, lightning-paced and action-packed...this is urban fantasy at its best. What more can I say? If you like heroines who kick ass and take names, who don't sit back and wait for the action to come to them, but choose instead to grab it by the balls and hang on for the ride; heroines who will literally go to Hell and back to do what they believe is right, then this is the book for you."}, {"userName": "Michelle, the Bookshelf Stalker  Queen of the Undead", "userReviewDate": "Dec 20, 2009", "userURL": "http://www.goodreads.com/user/show/3039709-michelle-the-bookshelf-stalker-queen-of-the-undead", "userReview": "What a crazy book and I absolutely ate it up! The author has a great imagination and I was wondering how in the world she was going to bring the story, the characters, and all the elements together but she managed! Definitely urban fantasy with a touch of romance. Great characters especially Pal the ferret (yes, I did say ferret)."}, {"userName": "Arlene", "userReviewDate": "Feb 09, 2010", "userURL": "http://www.goodreads.com/user/show/1773830-arlene", "userReview": "With the heroine's missing eyeballs and stump, this read is not for the faint of heart. Gory details notwithstanding, this is a great read and characters that will keep your nose glued to the pages."}, {"userName": "Gef", "userReviewDate": "Sep 06, 2011", "userURL": "http://www.goodreads.com/user/show/2433254-gef", "userReview": "Usually, the women on the covers of urban fantasy novels look flawless, so when I spied the cover to Lucy Snyder's debut novel and saw her lead character, Jessie Shimmer, bandaged and bloodied, that caught my eye. A nice twist on the familiarity that comes with UF book covers. The artist responsible, Dan Don Santos, can take half the credit for making me buy this book. The other half, of course, goes to Lucy with her enticing premise and cool-sounding character, Jessie.Jessie Shimmer and her boyfriend, Cooper, are living under the radar in Ohio, so to speak. Cooper is an accomplished magician, but kind of on the outs with the council, so he and Jessie make ends meet by performing spells and other enchantments for the locals who are in the know, while Cooper teaches Jessie to tap into her own supernatural abilities. During what should be a routine rain spell to take care of a drought, Cooper gets sucked into a portal, and Jessie is left behind to contend with closing the portal back up--and killing the demon that came through it.It's when Jessie resolves to go after Cooper and rescue him from whatever dimension he's trapped in that things really go haywire. The council head, Benedict Jordan, comes down heavy on her, forbidding her from trying to save Cooper, and basically puts her black list. Even her closest friends, what few she and her lover have in the magic community, are ordered to deny her help of any kind, which is made all the worse due to her physical scarring from her run-in with the demon. She does have her familiar, an inter-dimensional entity in the body of a ferret named Pal, to help her muddle through her outcast existence.Jessie is a pretty cool, pretty flawed character. She seems content acting as her lover's sidekick on magic jobs, learning as she goes, then really has to strike out on her own when he disappears. Her world is turned upside-down, not only on an emotional level, but almost literally as she ostensibly becomes a fugitive. The situations she finds herself in are exciting as she muddles her way from place to place and tries to figure out how to save her lover. There are some moments in the book that strained credulity with me, namely the almost instant prowess she attains with each spell she casts. For a system of magic that seems fairly free of exactness--a pinch of this and a dash of that--Jessie manages to avoid creating catastrophe. The deftness she displays in wielding magical spells, learning them on the fly at times, seemed a bit too convenient, even with her burgeoning innate abilities.Overall, the book runs at a fast clip, and the lulls are tempered with enough humor and hijinks to keep things interesting. Helping a house full of stoners get an enchanted marijuana plant as a way for Jessie to earn some room and board was particularly entertaining--possibly because I went to school with a couple of those characters. Some of the supporting cast are glossed over, but the ones that really matter (namely Cooper and Jessie's familiar, Pal) are fleshed out really well. Pal even narrates a few chapters, while Jessie is incapacitated.I'm interested to see where the story goes from here in the second book, Shotgun Sorceress, as stakes are set and some characters are irrevocably changed, including Jessie."}, {"userName": "Bunnycore", "userReviewDate": "Jan 04, 2017", "userURL": "http://www.goodreads.com/user/show/50919516-bunnycore", "userReview": "So I really enjoyed this book, Jessie is a mage or a witch, either way, you look at it. She does magic with household things. Look I love this because of the fact that the practitioners do not need to go out to some store and buy things I never heard of before. She uses things like cinnamon and mustard. her familiar Pal, hilarious. I wish Cooper played a bigger part because let's face it, he was hot as hell. I adored Warlock, he was funny and snarky and really full of himself. I recommend this book I think it is a entertaining fun read. Jessie was snarky:“I know I'm immature in some ways, but inside me, there's a cranky old lady yelling at the damn kids to get off her lawn. She's been there awhile. I've decided to call her Mabel.” She isn't afraid to say what is on her mind. “So, um, where's your broomstick?\" he countered, his face turning pink from his effort at not laughing.\"Broomsticks are *sooo* 1695,\" I replied, rolling my eye. \"Modern witches use vibrators and drop acid just like everyone else.\"\"What?\" He frowned, looking confused.\"Yeah, *flying on broomsticks* equals a big-ass euphemism for pagan women getting their freak on with broom handles greased up with morning glory butter,\" I said. \"Sometimes strychnine. Not a good idea, but hey, back in the day they used to think a wolf's testicle wrapped in a greasy rag was a good barrier contraceptive. So, yeah, no broomsticks for me. But thanks *ever* so much for asking about my sex life when we've only just met.” Cooper -just sighs- “Cooper can be pretty fierce when he gets angry. To me, that's one of his sexiest traits. It's not just about being able to tear the house down; it's about being willing to do it in a heartbeat to protect the people who genuinely need your help.”Pal“I was a vegetarian of sorts,\" he replied, \"but the difference between animal and vegetable isn't as clearly defined in my homeworld as it is here.\"\"How do you mean?\" I asked.\"Our plants can get out of the soil and move to a new location if they don't like where they're growing. Some of them are sentient. I tried not to eat those sorts of plants\" he replied.\"Oh. Well, I'm sure they found that very thoughtful of you,\" I replied."}, {"userName": "CJ - It's only a Paper Moon", "userReviewDate": "Nov 10, 2009", "userURL": "http://www.goodreads.com/user/show/1357098-cj---it-s-only-a-paper-moon", "userReview": "[ it's not his fault that his family was insane and he's not responsible for any of the crap that happened to his brothers, mother and Coop's dad but like Jessie said \"the moment you became a real wizard, the moment you decided you were so important you should run the whole city, the day you decided you knew what was best for the rest of us - every day after that, what happened to them was  entirely  your fault, because you were the one who should have stopped it  (hide spoiler)]"}, {"userName": "Kerry Allen", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/4129714-kerry-allen", "userReview": "This one was hard to rate. Split the difference between 3 and 4 and call it 3-1/2 stars.Characters with Mysterious Backgrounds: check. Well-conceived and interesting magic: check. Action sufficiently nonstop to compensate for the obligatory \"let's stop and explain the fundamentals of magic\" passages: check. I always regretted having to put this book down.But other than the ferret familiar and two minor secondary characters, I disliked the people I was supposed to be rooting for. I was hoping the heroine would get to Hell to rescue her boyfriend, discover he was the evil mastermind behind everything, and have to kill him. The heroine had an excuse for every negative thing she did. Sleeping with her professor--but only AFTER she was done with her class. Transferring an inconvenient spell upon her onto random bystanders--but they were NOT NICE and so no doubt deserved any misfortune that befell them as a result. Freeing the spirits of kittens and butterflies from an enchanted gazing ball--because that's OBVIOUSLY WRONG. It was like charging into Hell to rescue someone was inadequate to indicate a noble and honorable soul, so RESCUE FLUFFY GHOST KITTIES!!! to make sure readers understand she's The Good Guy. I love morally ambiguous characters, which it seemed she was intended to be but fell far short. It read like a child who knew she'd been bad trying to convince an adult she hadn't done anything wrong, rather than a desperate and determined woman willing to do anything and face any consequences to complete her mission.Enjoyed enough to finish, but won't read another one in the series."}, {"userName": "Kitten Blue", "userReviewDate": "Oct 13, 2010", "userURL": "http://www.goodreads.com/user/show/4413111-kitten-blue", "userReview": "Well, now, this book is just BRILLIANT! :D Disgusting, shockingly disturbing, definitely quite gruesome ... but also very very good.Apart from the writing, which is excellent - seriously, every sentence is clever and / or funny, and you can tell how much thought has gone into it all - and sets the book apart from others in the same genre on its own merits, the story's ACTION PACKED and just stupendously imaginative. It's freaking bat-shit crazy stuff; the kind of plot that has you scratching your head and wondering how the heck someone in her right mind can come up with a story this unique and bizarrely amazing!Now, I am Karen Marie Moning's biggest fan, no joke (seriously, I'm constantly obsessing over her Fever world); but Lucy Snyder is definitely giving her a run for her money in the *Best Urban Fantasy Author EVER!!!* contest running inside my head. Yes. She's that good. Their books are very different (if you don't count the *Our World Has Gone to Shit, Here's My Story* aspect they share), but they both stand out as being 200% worth reading. And that's more than you can say for at least half of the Urban Fantasy and Paranormal Romance authors out there pumping out crap faster than a leaking oil tanker and trying to pass it off as Good Reads.Anyway, this book's good! It's kind of *Enemy of the State* meets *Harry Potter*, with some added gruesome and disturbing, as well as an incredible cast of characters, including a strong, feisty and intelligent heroine to root for. If you think that sounds like it might be your thing, you'll love it! ENJOY!!! (\",)"}, {"userName": "Emma Southee", "userReviewDate": "Apr 08, 2011", "userURL": "http://www.goodreads.com/user/show/4523929-emma-southee", "userReview": "I picked this book up purely because of the name and threw it in the cart without even reading the cover.I'm glad I did. I loved the way the world worked in this book. From the Familiar connection to the policing force I was hooked. I actually found myself getting mad at Jessie and some of her decisions, but I find that appealing in a book. I love when the author can make me feel for the characters. After I kept reading though it was like ... OOOOohhhh okay I forgive you.LOVED the way Lucy brought a new twist to magic. Loved the world. LOVE LOVE LOVE The familiar!!! even as I got creeped out reading I could envision what was going on and found myself ducking when I wasn't paying attention... Yes I'm that big of a nerd. I started to feel like I was walking behind Jessie and was ducking while I read LOL Anyway, if you like Urban fantasy, Magic and looking for a new twist to the genre, I recommended this all the way. I used to love reading LKH's Anita Blake novels but got tired of her always whining about having her life. Jessie's life is FUBAR like crazy and she has no idea what to do, and she still manages to do whats needed without crazy porn cutting into her life."}, {"userName": "Beth Cato", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/8706020-beth-cato", "userReview": "In this urban fantasy tale, Lucy Snyder presents the sassy heroine Jessie Shimmer. Jessie is no stranger to magic. Since she spontaneously set her bedroom on fire as a teenager, she has been a practicing Talent. Her boyfriend, Cooper is a master. As the work together on a contract job to break a drought, the gates of hell burst open and yank Cooper away. If that wasn't bad enough, the local magical bureaucrats not only forbid her from saving him, but do everything possible to soil her reputation and run her out of town.[return][return]Spellbent is a fast read. The balance feels a bit odd, as much of the book revolves around Cooper even as he is Missing-In-Action; at the same time, I never felt like I completely knew Jessie in her first person narrative. As there are more books in the series, I'm sure they will delve more into Jesse's mysterious past. The subject matter is dark and gruesome at times, but is softened by Jessie's wit and the Jiminy Cricket-like advice of her ferret familiar."}, {"userName": "David Wyatt", "userReviewDate": "Mar 30, 2013", "userURL": "http://www.goodreads.com/user/show/83472-david-wyatt", "userReview": "Jessie Shimmer is a hero for modern times, clever, honest, often funny and determined as hell to get her man back from the alternative dimension in which he was trapped. A great, fun read with a terrifying villian. Top rate."}, {"userName": "Kim", "userReviewDate": "Feb 26, 2014", "userURL": "http://www.goodreads.com/user/show/7912153-kim", "userReview": "The writing in this book is disjointed. The characters are nothing great and the way the author would throw in thoughts here and there throughout just made it seem even more discombobulated. It was unfortunate. Wish I could say better things, but this book was not for me."}], "description": "In the heart of Ohio, Jessie Shimmer is caught up in hot, magic-drenched passion with her roguish lover, Cooper Marron, who is teaching her how to tap her supernatural powers. When they try to break a drought by calling down a rainstorm, a hellish portal opens and Cooper is ripped from this world, leaving Jessie fighting for her life against a vicious demon that's been unleashed.In the aftermath, Jessie, who knows so little about her own true nature, is branded an outlaw. She must survive by her wits and with the help of her familiar, a ferret named Palimpsest. Stalked by malevolent enemies, Jessie is determined to find out what happened to Cooper. But when she moves heaven and earth to find her man, she'll be shocked by what she discovers—and by what she must ultimately do to save them all.", "title": "Spellbent\n      \n          (Jessie Shimmer #1)", "url": "https://www.goodreads.com/book/show/6500152.Spellbent__Jessie_Shimmer___1_", "average": 3.61, "cover": "https://images.gr-assets.com/books/1388899420l/6500152.jpg", "reviews": 126, "authors": [{"url": "https://www.goodreads.com/author/show/948181.Lucy_A_Snyder", "name": "Lucy A. Snyder"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Fantasy", "Paranormal"], "outlinks": ["http://www.goodreads.com/book/show/6500152-spellbent", "http://www.goodreads.com/book/show/7094480-shotgun-sorceress", "http://www.goodreads.com/book/show/10376185-switchblade-goddess", "http://www.goodreads.com/book/show/2101819.Installing_Linux_on_a_Dead_Badger", "http://www.goodreads.com/book/show/27181342-while-the-black-stars-burn", "http://www.goodreads.com/book/show/22246364-soft-apocalypses", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/25353286-provenance", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}