{"ratings": 47682, "userreviews": [{"userName": "Christian", "userReviewDate": "Oct 04, 2009", "userURL": "http://www.goodreads.com/user/show/2167526-christian", "userReview": "Do you remember when you first saw Star Wars? If you are a certain gender and a certain age, it was THE defining movie of your childhood. You were either Luke or Han when you played. You craved everything Star Wars.Then The Empire Strikes Back came out and it added so many layers. You were blown away. “No....I am your father” rocked your little mind. Yoda letting the audience know “No. There is another” led to rampant speculation for a few years about where the story was going to go next.And then we got Return of the Jedi which pretty much showed us that George Lucas was just making this stuff up as he went along. Luke and Leia are brother and sister and it was always Lucas' intention? Watch the kiss in Empire again and tell me if you believe that. And then he made the “real” first three and things get out of control. Chewbacca and Yoda are “old friends”? Kenobi and Anakin are enemies for about 30 seconds before Obi Wan runs and hides for twenty years but watch the first one and Kenobi is calling Vader “Darth”, as if it was his name and they knew each other for awhile.Basically, Lucas was winging it. Granted, it is probably one of the most successful wing its in wing it history but still....A long winded way to get into this review, but “Split Second” was the first novel where Michelle Maxwell and Sean King meet each other, but it is the fourth of their adventures I have read. Some of their back story has been hinted at in the other novels I read but all of those novels were accessible so I didn't really worry about it.Now having read this story, I am even more appreciative of the “world” that David Baldacci has created. The narrative thread is strong and while some of the situations are obviously a little far fetched (kidnapped Presidential candidates, underground bunkers, and villains renovating derelict buildings while no one notices) the story is engaging and keeps you guessing.I seem to be in a rut as to the type of story I am reading these days but I am really okay with that.Next three: “The Race” by Patterson, “Hell to Pay” by Pelecanos and something by Michael Connely."}, {"userName": "Erin (PT)", "userReviewDate": "Jun 18, 2013", "userURL": "http://www.goodreads.com/user/show/2285338-erin-pt", "userReview": "[A spurned and obsessed auteur manipulates events and politics and people just to try and make his former lady-love/muse (who is also dead before the book even begins) come back to him through absurdly elaborate plots involving dozens, if not hundreds of people, over a period of decades? (hide spoiler)]"}, {"userName": "Jonetta", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/4876540-jonetta", "userReview": "Secret Service Agents Sean King and Michelle Maxwell watched their careers go up in smoke in a split second. Though their events occurred eight years apart, they become connected by the events that altered their courses. It also seems now that the two events might have their own connection. I enjoyed the story, especially the pace as there was rarely time to relax before the next challenge was presented. I liked the murky characters and odd directions the story would take, sometimes making it a bit convoluted but always interesting. While I figured out the villain, the motivation wasn't something I could have ever deduced. Scott Brick's narration set the right tone for King and Maxwell's relationship dynamics. I'll continue listening to the series as I liked the interplay between the two characters. This was a good start to the series."}, {"userName": "Linda I", "userReviewDate": "Dec 31, 2009", "userURL": "http://www.goodreads.com/user/show/2968341-linda-i", "userReview": "A good quick read by a very talented storyteller. \"Split Second\" is the beginning of another Baldacci storyline called the \"King and Maxwell Series\". Sean King and Michelle Maxwell are two disgraced Secret Service Agents whos presidential candidate's both were either killed or kidnapped. Through an elaborately connected chain of events, though not seeming at the time, Maxwell and King team up to discover who is responsible for the conspiracy. Admittedly, I like Baldacci's later \"Camel Club Series\" much, much better. This was an engaging read, and maybe I shouldn't be so quick to compare it after having only read the first book of the series, but I thought even the first book of the Camel Club storyline was superbly written and meticulously plotted. Though not hard too hard to follow, I thought the intricacies of the conspiracy in this book were a bit overdone. But, still a good read nevertheless."}, {"userName": "Rajan", "userReviewDate": "Jun 13, 2013", "userURL": "http://www.goodreads.com/user/show/11662595-rajan", "userReview": "I bought it in India international trade fair at Pragati Maidan, New Delhi. I wanted to read a new thriller writer and the salesman suggested this. I am thankful to him.All it takes is a split second to ruin your career. Maxwell and king of secret service has this is common. Now both unite and try to redeem themselves. will they b successful?I enjoyed it thoroughly. It is a page turner. Kept me engrossed. Highly recommended.Sean is very fastidious and judicious. Michelle is very unorganised and spontaneous. Though Sean is more experienced and older but he is equally energetic. They complement each other and form a good team of investigators. The relationship is platonic though is wished it should be somewhat romantic. The pace is breakneck and mystery is satisfying. It gives very good thrill. Climax explains everything and ties up loose ends.Some excerpts:It only took a split second, although to Secret Service agent Sean King it seemed like the longest split second ever. They were on the campaign trail at a nondescript hotel meet-and-greet in a place so far out you almost had to use a satellite phone to reach the boonies. Standing behind his protectee, King scanned the crowd while his ear mike buzzed sporadically with unremarkable information.--------Michelle raced through the wreckage, dodging flames and smoke and screaming out his name. “Sean! Sean!”------Another explosion rocked the structure, and she jumped off the front porch a few seconds before it came tumbling down. The concussive force of a second explosion knocked her through the air, and she landed hard, all the breath squeezed from her. She felt all sorts of heavy things hitting all around her, like mortar fire. She lay there in the dirt, her head cut, her lungs drowning in lethal fumes, her legs and arms bruised and battered.-------"}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "Feb 08, 2014", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "I have completely forgotten to review this book. Read it this summer thought it was ok, nothing really special. The two main character felt a bit boring to be honest it was nothing like reading about Patrick and Angie by Dennis Lehane. Will perhaps read the rest of the series if I run out of books...lol..."}, {"userName": "kartik narayanan", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/4070035-kartik-narayanan", "userReview": "Split Second is a typical Baldacci first book in a series. It has interesting characters and excellent writing but the plot is a bit weak. I have seen this trend across his various books and this one is no exception.As always, the lead characters are extraordinary individuals (secret agents in this case) who have had to deal with a personal/professional tragedy. This time around, it is the loss of the VIPs they were supposed to protect.I loved the chemistry between the leads. And the reversal of roles too. The woman is the superior ass-kicker while the man is the superior analyst. They have differing views on life and this makes their interactions interesting.The plot was weak though. There is this huge conspiracy and a complicated plot that is hinted at. In the end, the plot fizzles out. But, regardless, I still enjoyed the book because, you know, it's Baldacci."}, {"userName": "Terri Lynn", "userReviewDate": "Oct 12, 2013", "userURL": "http://www.goodreads.com/user/show/5699299-terri-lynn", "userReview": "I loved this. I had read other Baldacci books but none about Sean King and Michelle Maxwell but now I have to read them all. Sean King is a former Secret Service agent whose split second lack of attention 8 years ago caused a tea party type presidential candidate to lose his life (before there even was a tea party)when a brilliant professor working at a third rate college (he was a UC Berkeley PhD who had fallen from grace after his activism over the Vietnam War and Watergate) stepped up and shot him while Sean was being flashed from an elevator by the female agent he was screwing (someone sent her a phony request from Sean). He now leads a quiet life after being dumped by the Service as a lawyer in a country town and has a nice home on the water. The quiet erupts into pandemonium when another agent- Michelle Maxwell- loses another presidential candidate and is disgraced. She shows up at Sean's door just as the dead bodies start arriving at his office and home. Soon they, along with the flasher agent from years before, all realize that the two cases are linked and someone intends revenge on Sean and others so the three link up with a crooked US Marshal and this leads to an explosive conclusion (literally).I enjoyed watching them try to unravel the tangle of past and present evidence and really liked the ending. If mystery, suspense, thrills, and action is your game, you'll like this. If you are like me and like to see intelligent, strong, and capable women you'll love this as Joan and Michelle (who both leave the Secret Service for better careers) are all that and more."}, {"userName": "Ami", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/134600-ami", "userReview": "[it goes down to the mastermind carrying a grudge because the woman he loved was married to someone else. It is insane! (hide spoiler)]"}, {"userName": "Corey", "userReviewDate": "Jun 13, 2017", "userURL": "http://www.goodreads.com/user/show/12949855-corey", "userReview": "The first book in the Sean King & Michelle Maxwell series, and a good start to a seemingly good series! The book started out kind of slow, and jumped around a lot, and hard to follow, but after about 100 pages it started to pick up, then it got really good!Split Second follows former US Secret Service Agent Sean King who's career ended when a Political Candidate who he was guarding is gunned down right in front of him, and failed to stop the assassin. Now 8 years later, young Secret Service Agent Michelle Maxwell is guarding another Political Candidate, who had vanished without a trace while Maxwell was supposed to be guarding him at all times. Now with Michelle's career on the line, she teams up with Sean King who is now working for a small law firm after his career with the Secret Service ended. Learning of King's past and seeing similarities between the present disappearance of one candidate, and the assassination of another 8 years earlier, King and Maxwell form a Lethal Weapon-type partnership and work to find the missing candidate, and discover the motive of the assassination 8 years earlier, and also learning of a deadly conspiracy.A great first entry to the series, now onto book #2, Hour Game!"}, {"userName": "Kristy James", "userReviewDate": "Sep 24, 2011", "userURL": "http://www.goodreads.com/user/show/5815849-kristy-james", "userReview": "Just finished Split Second and, as with The Winner, was very impressed with Baldacci's style. The research and planning that went into this book was amazing. Unlike The Winner, I did figure out who 'the bad guy' was about a third of the way in, even when he tried to make it look as though I was wrong a bit later. I was, however, wrong about his accomplice. It will be interesting to see if Total Control, next on my list, is similar to these two books. David Baldacci seems to have a thing about his villains being masters of disguise...and that could get a little old. Still, it's fun to try and figure out who it might be. All in all, because it kept my interest-from start to finish-I'll give it a five. I think the very end kind of sucked and should have gone a different way, but that's coming from the perspective of someone who's been writing romance novels for a long time. A final note...I hope that this author continues with this genre...and stays away from romance in the future. After reading The Christmas Train, I was a little hesitant to read anything else by him. Fortunately Split Second was every bit as good as The Winner."}, {"userName": "Josen", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/3660423-josen", "userReview": "Sean King and Michelle Maxwell have one thing in common, albeit 8 years apart. As secret service agents they both had harrowing incidents while guarding their protectees who, coincidentally, were both presidential candidates. This is my first Baldacci and I don’t know why I’ve never picked him up before. This story had a really good pace and made you think (because there were a butt load of characters, lol!) Sean is the older of the two and even though his situation happens first, he is somehow intertwined with the later incident involving Michelle. Once it’s realized that he’s entangled in the whole thing that’s when things get interesting. There’s action, suspense and again, enough characters to keep you guessing as to who’s involved. Sean and Michelle are just getting to know each other in this book but I liked their budding friendship and they complement each other well. He is smart & has refined taste and she is just a strong, female character. (I’m a Buffy fan so I always love a girl who can take charge, lol!) I’m looking forward to reading the other books with these two. Thrills, mystery and action are just my cuppa tea. :)"}, {"userName": "Mark", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/6755739-mark", "userReview": "NCIS: Los Angeles creator Shane Brennan created the show based on David Baldacci's novels, which was the main reason to pick up this book. I did enjoy the first season of this series so decided to have look in the literary origin and see how much the actual difference would be.Mr Baldacci has been read by me before but those books were more of the one offs written by the writer and as thrillers they did not fail to entertain me. So on that note it would be a great choice in reading about Maxwell & King, who now have the faces of Romein & Tenney.Well having finished this book I discovered that this tale of Kings' past and how it finds its solution does feature in the 10 part TV series only to find its solution in the final episode of season 1, albeit a different solution.Having read the book I can see how this was screaming for a TV reworking. The tv show decided to go for the duo to be already a PI partnership when we first meet them.The book starts with the assassination of Kings' presidential candidate and how he got the blame. Jump 8 years and all is well in his live outside of he secret service and into the life of a lawyer. When he sees how a colleague from the secret service has fallen from grace through the kidnapping of her presidential candidate. he can sympathize with her experience.His life then gets vastly more difficult when an employee is found dead in his office and somehow he could be considered the perpetrator of this crime. It gets worse when it turns out that his employee is in the care of the US marshals in a program called WITSEC.Michelle Maxwell now disgraced by the kidnapping of her protectee is looking for answers which turn out to be kind of similar to questions asked by King. When the two of them team up to find out what did happen in both cases they find out that both cases are connected and the lives of all involved in the search are in danger.A well written thriller that is by no means a detective as the writer keeps some clues close to his chest and does remark how the characters see some truth but does not tell what that would be. So it is a decent thriller with detectivesque moments. Mostly the banter between King & Maxwell is enjoyable but they do not yet know & trust each other and that shows. That they make a great duo shows early on but the reason they will continue as partners is not yet clear and the book tells why and adds some mystery and action. And of course the writer would be amiss to leave out some romance and love, even if it is where you would least expect it.A fun read that passes the time, a great beach read."}, {"userName": "Alex Shrugged", "userReviewDate": "Dec 27, 2013", "userURL": "http://www.goodreads.com/user/show/10404161-alex-shrugged", "userReview": "\"Split Second\" by David Baldacci is a murder mystery/thriller and my first read of the author. He gave me a good impression. I generally don't read murder mysteries unless they are Jewish murder mysteries but my mother-in-law raves about his books so I decided to try one. This is the first in the series of Sean King/Michelle Maxwell novels where two former secret service agents team up to solve a murder and in this case a kidnapping as well.The story: A Secret Service agent, Sean King, has his primary (protectee) assassinated while standing right next to him at a hotel reception. A video shows the agent looking away, distracted at the moment the gunman takes his shot. He does have the presence of mind to shoot the assassin though. Years later he is out of the Secret Service working as a lawyer in a rural Virginia town. Michelle Maxwell is currently a Secret Service agent and while her protectee is not assassinated, she is blamed for his kidnapping and she wants to get him back. Remembering Sean King, she seeks him out and together they discover there might be a connection between the two misfortunate events. As they investigate people start dying all around them.It's actually a reasonably good story once you get into it and a very good ending that ties up everything is a satisfying manner. It was a good read. (And one of the guys on my suspect list was the one who did it although he was low on my list and people not even on my radar were part of it. Very good misdirection by the author...you sneaky devil.) I'd read it again even knowing how it ends. That is the problem with mysteries. Often when you know how it ends, it spoils the reading, but I think this book can hold up under that. It's fun watching the investigation roll out even knowing how it will end. I'm sure of it.Any problems with the book? It is an adult book. I suppose if you let your kids watch Prime Time TV they've seen worse. The murders are not gruesome in the sense that the murderer is not chopping anyone's head off. I wouldn't exactly read it to my kids at bedtime, but really... this is for full-grown adults, folks. There are a few sexual situations in the book though not any outright sex. It's not prurient but let's not kid ourselves.I've already started on Baldacci's next book in the series, \"Hour Game\". This one is turning out to be gruesome....hunting down a serial killer who is copy-catting some of the famous serial killers of the recent past. If you are over 50 you will remember all of these serial killers and recall the shock and fear they created. So far it's a pretty good read. I'm about a fourth of the way through the book."}, {"userName": "Julie", "userReviewDate": "Nov 12, 2012", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "This was the first Sean King and Michelle Maxwell book in the series.Eight years ago, Sean King's career as a Secret Service Agent came to a screeching halt when a presidential candidate was killed on his watch. Now, eight years later, Michelle Maxwell gets a taste of what Sean felt like when a candidate she's in charge of is kidnapped. Sean has worked hard to put his life back together after the Ritter assassination. He's a sucessful lawyer now with a nice house on the lake. Then the man working with Sean is found murdered in Sean's office. Michelle seeks Sean out after her own failure with the secret service. The two soon begin to link the two incidents together. They both become targets as ghost from the past come back to haunt Sean King.This was not my favorite David Baldacci novel. I was reading this one with my husband as a buddy read, and felt the same way I did. It was good, don't get me wrong, but it it lacked something. Sometimes there were too many things going on at once and sometimes the story just stalled. Overall this one is a C."}, {"userName": "Cheryl", "userReviewDate": "Dec 02, 2016", "userURL": "http://www.goodreads.com/user/show/22026875-cheryl", "userReview": "Abandoned after 100 pages. This author's writing style is just not for me. I couldn't get interested in the main characters."}, {"userName": "&#x1f52e;⚡️Voracious", "userReviewDate": "Apr 01, 2017", "userURL": "http://www.goodreads.com/user/show/45724173-x1f52e-voracious", "userReview": "Sean King and Michelle Maxwell - a formidable duo. I enjoyed this first book in the King & Maxwell series although I'll admit that I do prefer the ultimate kick ass partnership of Robie & Reel more. However, I'm definitely planning to continue with this series, as there is no doubting that David Baldacci writes an action packed thriller."}, {"userName": "David Highton", "userReviewDate": "Dec 17, 2017", "userURL": "http://www.goodreads.com/user/show/48750300-david-highton", "userReview": "Overall, an exciting debut for King and Maxwell, with strong character histories to help build the partnership, but I thought the plot was overly complex and the main protagonist's motivation lacking credibility. I look forward to reading the next one, though."}, {"userName": "Emilie Hendryx", "userReviewDate": "Mar 03, 2017", "userURL": "http://www.goodreads.com/user/show/6086309-emilie-hendryx", "userReview": "As an avid Baldacci fan I'm so happy to go \"back\" in time to this series! Love Maxwell and King already and can't wait to read the next book! Great, riveting plot (as I've come to expect from Baldacci) with enough twists and turns to keep you guessing. I enjoy Maxwells snark and Kings no-nonsense attitude! My rating: 4.5*---This was an audio book read for me."}, {"userName": "Josy", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/25995061-josy", "userReview": "~ 4.5 stars ~Even though I figured out part of the mystery early on, I enjoyed this book a lot and I'm looking forward to the rest of the series."}, {"userName": "Gill", "userReviewDate": "Dec 18, 2008", "userURL": "http://www.goodreads.com/user/show/1301812-gill", "userReview": "Michelle Maxwell, a Secret Service agent assigned to a presidential candidate, sees her rising career slip away when the candidate is kidnapped. Eight years earlier, Agent Sean King was assigned to a candidate who was killed. With their professional lives similarly shattered, the two meet and uncover unlikely coincidences between the two events. Suspense mounts when a body appears in King's law office and when they are violently attacked.A decent-enough premise, but I found it disappointing. Maxwell's an interesting character but insufficiently developed and the attempt to build a will-they/won't-they aura of sexual tension between her and King feels false and forced."}, {"userName": "Brenda H", "userReviewDate": "Sep 20, 2015", "userURL": "http://www.goodreads.com/user/show/2852709-brenda-h", "userReview": "My online reading group plans to read the second book in this series in July. Since I do not like to read a series out of order, I decided to read this in preparation. Once I started the book, it seemed somewhat familiar but I was unable to decide if it was because I had already read the book or if I knew things because of the tv series. Turns out, that I had read the book before but so long ago that I forgot most of it...most importantly - the big reveals. :). Despite being a re-read (something I typically don't do), I found the book, an interesting, enjoyable mystery that kept me guessing until the end.Rating: 4 stars"}, {"userName": "Mike", "userReviewDate": "Jan 27, 2014", "userURL": "http://www.goodreads.com/user/show/545336-mike", "userReview": "Great travel, beach, bedside reading. Short, pithy chapters and action that seldom slows down. Two Secret Service agents who make little mistakes on the job with big consequences. The mistakes are related but the plot is pretty complicated and will keep you interested to the slightly hokey end. I might be a little generous at 4 Stars as there were flaws. But I want to see King and Maxwell carry on in future adventures. Maxwell is great, she kicks butt. King is more of the braniac and moody. Should be a great pairing."}, {"userName": "☼♎ Carmen the Bootyshaker Temptress ☼♎", "userReviewDate": "Jun 25, 2013", "userURL": "http://www.goodreads.com/user/show/16935457-carmen-the-bootyshaker-temptress", "userReview": "This was an awesome beginning to a series. There was twist at every turn with a strong female character. I will definitely continue with the series. I want to see what other trouble King and Maxwell will get into."}, {"userName": "Margaret", "userReviewDate": "Oct 21, 2017", "userURL": "http://www.goodreads.com/user/show/30664214-margaret", "userReview": "Michelle Maxwell and Sean King, both shining stars in their field, have something in common. They both, as Secret Service Agents, were charged with protecting a presidential candidate when in a split second and eight years apart their careers collapse around them when they both lose their charges, one candidate is killed and the other is kidnapped. Michelle seeks out Sean because of their similar stories and as they try to make sense of the facts they have the two combine efforts to find the kidnapped candidate before he is a dead candidate and answers to what really occurred and who is puling the strings. Their lives are in danger as they come closer to the truth and the clock is ticking."}, {"userName": "Esra", "userReviewDate": "Nov 28, 2017", "userURL": "http://www.goodreads.com/user/show/65254630-esra", "userReview": "Surukleyiciydi, sayfaları hızla cevirdim.Bir başkan adayının cinayetiyle başlayan hikayemiz sonunda oyle yerlere gidiyor ki inanın aklınız almıyor. Bu kadarda olur mu diyorsunuz ama oluyormuş.Maxwell ve King'i çok sevdim ama Kate'e de aynı zamanda çok üzüldüm."}, {"userName": "Ronja", "userReviewDate": "Jul 01, 2017", "userURL": "http://www.goodreads.com/user/show/46139043-ronja", "userReview": "Solid thriller, easy to read and definitely keeps you turning the pages. The characters remain somewhat flat but the book kept me entertaines enough that I'm going to want to read Vol 2."}, {"userName": "Tracy", "userReviewDate": "Jul 22, 2013", "userURL": "http://www.goodreads.com/user/show/328052-tracy", "userReview": "I shouldn't actually mark this as \"read\", because I read about six pages and was disgusted by how bad a writer David Baldacci is, or at the very least, is in this first book in the \"King & Maxwell\" series. I only wanted to give the book series a try because earlier this summer TNT started a series based on these books. I like the TV series, in spite of being wary of what sounded potentially boring: politicians' business, CIA nonsense and ex-Secret Service agents turned private detectives. The TV series has Jon Tenney, an actor I know well from \"The Closer\" and \"Major Crimes\" and Rebecca Romijn, and the two of them have great on-screen chemistry. And the show is not boring at all. Those six pages I read of this book were trite, with simple, cliched language. There was no setting of the scene, hardly any descriptive details, and I was bored to death. I couldn't imagine finishing the chapter (which was two pages more), let alone reading to my standard 50 pages to \"give the book a chance\"."}, {"userName": "Al Datum", "userReviewDate": "Jun 03, 2013", "userURL": "http://www.goodreads.com/user/show/5292677-al-datum", "userReview": "This was my first David Baldacci book, and it reads like a mixture between your standard police procedural looking for a mastermind criminal and a political thriller. Within either genre it works, and I'll be reading Baldacci again. His writing is crisp, plot driven, with lots of dialog. The main characters are Sean King (ex-Secret Service) and Michelle Maxwell (current Secret Service). It deals with a past Presidential assassination, and a modern assassination plot reminiscent of the one in the past.Sean and Michelle must stop the new plot, and in the process they find they work well as a team. This is the first of a series of novels featuring Sean and Michelle, and I enjoyed it a lot. The story was plausible and suspenseful enough to keep me reading late into the night. It has great descriptions, and sets a fast pace throughout.After completing this book, I am excited about future books featuring Sean and Michelle, and I'm happy to have found a new author whose writing style I thoroughly enjoy."}, {"userName": "Bill", "userReviewDate": "Jan 31, 2015", "userURL": "http://www.goodreads.com/user/show/4380068-bill", "userReview": "This is the first King and Maxwell mystery/ thriller, the story where Michelle Maxwell, a Secret Service agent, whose charge, a presidential candidate, is kidnapped from under her nose, meets Sean King a former Secret Service agent, whose candidate was assassinate while under his protection. Both cases seem to be related. It's an action-filled thriller, with many deaths and explosions. King is now a lawyer, who finds his relatively sedate new life turned upside down. There are many suspects in this mystery; although over all, it's probably not that complex. There were some things I found irritating; why, oh why do they always go off by themselves when anybody on their own seems to get killed!! Or just when things get ticklish, someone's cell phone falls off that person's belt and is lost!! But these were relatively minor matters, it was a nice intro to the two intrepid agents. I wonder what the future will hold for them."}], "description": "Michelle Maxwell has just wrecked her promising career at the Secret Service. Against her instincts, she let a presidential candidate out of her sight for the briefest moment and the man whose safety was her responsibility vanished into thin air. Sean King knows how the younger agent feels. Eight years earlier, the hard-charging Secret Service agent allowed his attention to be diverted for a split second. And the candidate he was protecting was gunned down before his eyes. Now Michelle and Sean are about to see their destinies converge.Drawn into a maze of lies, secrets, and deadly coincidences, the two discredited agents uncover a shocking truth: that the separate acts of violence that shattered their lives were really a long time in the making – and are a long way from over….", "title": "Split Second\n      \n          (Sean King & Michelle Maxwell #1)", "url": "http://www.goodreads.com/book/show/204276.Split_Second", "average": 3.99, "cover": "https://images.gr-assets.com/books/1432495543l/204276.jpg", "reviews": 1992, "authors": [{"url": "https://www.goodreads.com/author/show/9291.David_Baldacci", "name": "David Baldacci"}], "type": ["Mystery", "Fiction", "Thriller"], "outlinks": ["http://www.goodreads.com/book/show/204276.Split_Second", "http://www.goodreads.com/book/show/6465455-split-second", "http://www.goodreads.com/book/show/3210180-split-second", "http://www.goodreads.com/book/show/946366.Split_Second", "http://www.goodreads.com/book/show/19081510-split-second", "http://www.goodreads.com/book/show/12268127-split-second", "http://www.goodreads.com/book/show/820585.Split_Second", "http://www.goodreads.com/book/show/886189.Split_Second", "http://www.goodreads.com/book/show/31844684-kader-an", "http://www.goodreads.com/book/show/21020519-split-second", "http://www.goodreads.com/book/show/18170301-split-second", "http://www.goodreads.com/book/show/15159.Absolute_Power", "http://www.goodreads.com/book/show/15158.The_Camel_Club", "http://www.goodreads.com/book/show/12849385-the-innocent", "http://www.goodreads.com/book/show/23153154-memory-man", "http://www.goodreads.com/book/show/11007587-zero-day", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}