{"ratings": 48, "userreviews": [{"userName": "Michelle", "userReviewDate": "Jan 17, 2015", "userURL": "http://www.goodreads.com/user/show/7957821-michelle", "userReview": "Stage 6 has to honestly be the worst book I have ever read. I'm sorry to be so blunt, but it had to be said. I see that it was self published. Did anyone take a look at this before it was published? Any beta readers? Editors? Anyone with a degree in literature? I'm thinking not. Here are the problems:1. The book read like a set of instructions to build something. First Jack did this, then Jack did that...There was absolutely no imagery or description into whatever scene was happening. These characters had very little emotion.2. Speaking of characters, they were the most unbelievable set of characters I have ever come across. I find it very hard to believe that a 17 year old with very little leadership skills has the ability to lead a group of people into a backyard much less anywhere during a zombie apocalypse. Jack, the MC comes off as Rambo in a kids body. I don't think so. How old was Lucy. No age was given but I suspect she was little since she skipped. Someone is really going to hand this a child this young a gun and have her sit watch? 3. No research went into this book at all. I'm sorry, but a zombie is not going to fly 50 feet away from the hood of a car when it suddenly stops. I don't care how fast your going. In location 159-161 someone with a message came on TV to talk about the outbreak and then says that within the next two weeks all power, water, and electricity was going to be cut off. Well if only 20% of the population was infected why in the hell would they shut anything off. If people are still around to take care of this stuff than why shut it off? If more of the population was infected I could see that happening.After about 30% of the book I just stopped caring and continued to read to just get through it. This book has a whole lot of potential, but it needs some serious help before I would ever recommend it to anyone."}, {"userName": "Paulette Waters", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/65319428-paulette-waters", "userReview": "GreatLoved the book great read will be rereading this book over and over, loved the rhythm of the writing. Will be reading more of your books in the future."}, {"userName": "Candy", "userReviewDate": "Sep 01, 2013", "userURL": "http://www.goodreads.com/user/show/2290766-candy", "userReview": "Here's a confession for you - I love zombie novels. I love post apocalyptic. Okay, not really a confession, most people know by now that I love a good flesh eating fun. This book did not disappoint my love of the end-of-the-world. This time, the end of the world takes place in my very own backyard - Austin, TX! It was kind of neat to hear the author talk about the end of the world here in my own little city. Ah, Camp Mabry!I've read good zombie books and bad zombie books - some REALLY bad ones. This one was excellent. The characters were interesting and woven into the story, there was enough information to learn about them and enough left out that a sequel could easily develop them further as they continue on.The writing was well done. There were no dead (oof, excuse the pun) spots. The story kept moving forward at a good pace and there weren't times that I could have put it down and moved on to another book without wanting to know what happened next.The book has a mood to it. It all seems to take place at a \"dusk\" like feeling. Almost hazy or smoky. I wish I knew how to fully explain, but it was definitely a tone that added to the book. It also had some quirky lighthearted moments thrown in (dude, it's a zombie book).I really enjoyed this, obviously and recommend it for all zombie fans."}, {"userName": "Bex 'n' Books", "userReviewDate": "May 17, 2014", "userURL": "http://www.goodreads.com/user/show/7480532-bex-n-books", "userReview": "Reviewer: BexDisclosure: This ebook was provided by the author in exchange for an HONEST and not necessarily positive review.Stage 6 was a solid read. the storyline is creative and offered me an entertaining read. There was lots of originality to the storyline and I especially enjoyed the main character, Zack.There were time that the I was a little confused by the lack of a thorough introduction to secondary characters, but this tended not to interrupt my enjoyment of the narrative."}, {"userName": "Candice Mckinney", "userReviewDate": "Mar 10, 2014", "userURL": "http://www.goodreads.com/user/show/5164278-candice-mckinney", "userReview": "At age 17 Jack is thrust into a leadership role when a lot of people all around him suddenly become infected, they are turned into Zombies. Jack tries to protect himself, his mother and survivors who join him as they travel around looking for help. He makes quick decisions that affect all of those around him, trying to do the best he can.Good book, good story. I throughly enjyed."}, {"userName": "carol", "userReviewDate": "Mar 27, 2014", "userURL": "http://www.goodreads.com/user/show/27366891-carol", "userReview": "Was a good read.I think it was a good book not great but good. it was kinda all over the place in certain spots.and new characters get brought in and we are just supposed to know who they are. I would hope their will be a second book because really the best part of the book was that last few chapters."}, {"userName": "Joelle Groff", "userReviewDate": "Jul 20, 2014", "userURL": "http://www.goodreads.com/user/show/16826363-joelle-groff", "userReview": "I just can't get into the book. It reads more like an ongoing list rather than an actual book. I can usually overlook spelling mistakes and grammatical errors but these, coupled with the style of writing really made it hard to get past the first couple chapters."}, {"userName": "Samantha Parrish", "userReviewDate": "Apr 03, 2014", "userURL": "http://www.goodreads.com/user/show/30244035-samantha-parrish", "userReview": "Good zombie bookdoesn't deal with the gory killings of zombies, or the in-depth means of survival during a zombie apocalypse. rather, it is more about forging relationships and rising to the challenge of proceeding during a zombie outbreak."}, {"userName": "Raemona", "userReviewDate": "Apr 25, 2014", "userURL": "http://www.goodreads.com/user/show/5765415-raemona", "userReview": "I liked the story. I just truly wish it was edited better. The Kindle edition was free,so I won't complain too much. Still a fun zombie book with a protagonist you can root for."}], "description": "There is no time to think, no time to plan. There is only time to act as it slowly approaches you, sniffing, scanning, and hunting. It knows you’re there and it’s only a matter of time before it finds you and begins to feast.Confronted with a shocking and horrific new world in which a contagious virus is suddenly transforming people into vicious predators, 17 year old Jack fights to lead his friends and family to safety. After narrowly escaping the city, Jack travels the apocalyptic USA in search of a safe haven. Along the way, he meets other survivors, including Kevin, a pessimistic lawyer with a phobia of “zombies”, and Steve, a former Navy Seal. Surprised at the terrible things he finds himself willing to do to survive, Jack struggles with his sense of morality. Constantly thrust into deadly situations, he makes quick decisions that determine the fate of others around him. Ultimately, Jack and the other survivors must ask themselves: is it possible to rebuild after such a widespread catastrophe? If it is possible, is it really worth it?At 200 pages long, Stage 6 is a thrilling YA novel that explores what a modern “zombie apocalypse” might look like if it happened tomorrow.", "title": "Stage 6", "url": "http://www.goodreads.com/book/show/18402219-stage-6", "average": 3.73, "cover": "https://images.gr-assets.com/books/1378067815l/18402219.jpg", "reviews": 10, "authors": [{"url": "https://www.goodreads.com/author/show/7245718.Dylan_James", "name": "Dylan James"}], "type": ["Horror", "Young Adult", "Apocalyptic", "Horror", "Adventure"], "outlinks": ["http://www.goodreads.com/book/show/18402219-stage-6", "http://www.goodreads.com/book/show/18873005-stage-6", "http://www.goodreads.com/book/show/18663114-stage-six", "http://www.goodreads.com/book/show/32672822-polyamory"]}