{"ratings": 66, "userreviews": [{"userName": "Sandi *~The Pirate Wench~*", "userReviewDate": "Oct 26, 2013", "userURL": "http://www.goodreads.com/user/show/1849875-sandi-the-pirate-wench", "userReview": "Setting: 1800s American WestSteam Factor: Mild to sometimes \"Hot\" In hopes of accompanying her mother cross-country, Boston Heiress Emily Highfill Grant hides out in the family's private Pullman car. Little does Emily know her impulsive sister has followed her, nor does she realize that the car that she has sneaks into holds Wyoming rancher and short line railway owner Lucien Delator. Lucien has worked his up by his bootstraps so to speak and is heading home to save his railroad from saboteurs like none other than Charles Highfill. And little does he realize that his lovely stowaway is Highfill's granddaughter. So when the Pinkerton detectives try to collect the girls once found, Lucien claims Emily as his bride with her sister along as company to her. But when Lucien finds out her true identity, he is torn between making his marriage work or keeping his dream alive. Can he do both? And at what cost to all involved? Stowaway Bride was an entertaining Western that immediately captured my attention. A feisty Heroine and a darkly handsome Hero whose first meeting sets the stage for this stormy romance. The multidimensional characters were an added delight, but it was the quick pace and lively plotline with a bit of added suspense and humour that added the final touch to this story. This is the first book I have read from this author and look forward to more."}, {"userName": "Angie", "userReviewDate": "Dec 11, 2013", "userURL": "http://www.goodreads.com/user/show/5724579-angie", "userReview": "Stowaway Bride was another super fun, Western Romance! Emily desperately wishes to go to San Francisco. Not just to see her sister and be there when the baby is born. Emily craves adventure! So when her mother forbids her from joining her, Emily sneaks into their family’s traincar and hides out. What she doesn’t know is that her mother cancelled the trip, her younger sister followed her aboard, and a strange businessman is now renting the car! But Emily is going to get her adventure no matter what.Stowaway Bride was a delight to read. I adored it from the first chapter with Emily falling asleep under the table. It has a bit of an enemies to lovers feel to it as Lucian despises Emily’s grandfather, but he doesn’t know that she’s his granddaughter. She keeps that bit of information to herself so he won’t throw her out of the car. Then it takes on a fake relationship turned real plot! Emily and her sister are being pursued, and the only way for them to not be returned to their parents, is if a husband claims them! Of course, Lucien and Emily have to get married for real in case those men return. It was just nonstop trouble and excitement!I even liked the side plot involving Lucien’s railroad that he’s building. He needs investors to get it finished, but he refuses to let Emily’s wealthy grandfather invest. And if he does, other backers will….back out! There’s also the matter of sabotage! Someone is literally trying to blow up all of his hard work. Throw in his quickie marriage to his enemies’ granddaughter, an annoying contract claus, and an angry housewife and you’ve got the makings of high quality entertainment!I really enjoyed Stowaway Bride. It was so much fun! Emily was a great character and I loved how she would do anything to achieve her goals. She also doesn’t let anyone push her around! The ending does feel a bit rushed and anticlimactic, but it’s a happy one, so I’m alright with that.Read more of my reviews at Pinkindle Reads & Reviews."}, {"userName": "Christi Snow", "userReviewDate": "Nov 21, 2013", "userURL": "http://www.goodreads.com/user/show/715656-christi-snow", "userReview": "My Review:There was a time in my life....a long, LONG time ago...when all I read was historical romance. I'll be honest. Anymore, they really aren't usually my thing and I flat out don't enjoy them as much as I used to. BUT the publisher sent me this one for review so I decided to give it a chance. I was going to read to the 25% point, then if I wasn't enjoying it, I just wasn't going to review it. Well, you're reading my review right now... so guess what?? Hehe...I liked this one.Through a series of unusual events Emily and Lucien...and Emily's sister, Annabelle...all ended up traveling on the train in the same Pullman car headed toward the west. Emily and Annabelle are trying to protect their reputations so they don't tell Lucien who their family is. Lucien doesn't care who they are...he just wants them gone, until he hurts his ankle and by then he's fighting an attraction to Emily so he uses his ankle as an excuse to keep them close. Emily is after adventure and wants to see the world. She's been fairly sheltered but is 20 yo and very confident in who she is and what she's capable of. That comes across the page in a great way. Even in circumstances when she's way out of her element, she squares her shoulders and goes on. She's smart and witty and quick-thinking. I really loved her and her lack of reservation about going after whatever it is that she wants. Lucien wants one thing...his railroad to get built. He's been back east looking for investors and has no idea that he's headed back home with his enemies granddaughters in tow. He and his partner, Chuck, are sure that it's Emily's grandfather who's been sabotaging their construction because he wants the railroad for himself at dirt cheap. Of course, the revelation of who Emily is comes out at the absolute worst time, but this is romance...what's a little happily ever after if you can't have some good high drama first and the second half of the novel is filled with high drama...from the sabotage that is happening to meddling neighbors and family, Emily and Lucien have to fight for what they finally realize they want. By the end of this novel, I was FULLY INVESTED in their HEA and loved the way that all those final scenes were written. I couldn't put it down. A great novel and a good reminder of why I used to love historical so much!!I received a complimentary copy of this book in return for an honest review."}, {"userName": "WTF Are You Reading?", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/3603515-wtf-are-you-reading", "userReview": "Stowaway Bride may be a romance, but the real draw is the story! Emily Highfill Grant is a sheltered Boston socialite, desperate to break free of the confines placed on her by family and station. When a plan to stowaway on her mother's cross country train trip to San Fransisco has the unintended consequence of throwing her and her sister together with the darkly intriguing Lucien Delatour; she must use charm, wit, and her lightening fast intellect to make herself indispensable to her reluctant host, while keeping the identities of both young women secret.Half the fun of this read lies in the fact that romance is clearly not its main focus. In fact, it is only through a series of miscalculations on the part of our intrepid adventures, that they find themselves together at all.Lucien Delatour is a self made man in the making. That is of course if he can get out West in time to insure that the railroad that he and a partner are building is completed.It is quite clear from the start that it is going to take more than a soft voice and a pretty face to pierce the steely armor surrounding the heart of this railway man.All Emily Highfill Grant wants to do is to have a little adventure before resigning herself to the teas, balls, and marriage to which a young lady of her station is bred to aspire.What she gets is adventure, friendship, and so much more...in the form of one very formidable budding rail baron.To add to all of the cat and mouse and banter shared between Emily and Lucien; there is the Emily's ever present vixen of a sister, Annabelle; the ever present threat of Emily's family secret; plot twists that drive Lucien and Emily closer in unbelievable ways and with even more jaw-dropping consequences; and revelations about both Lucien, his company, and his friends that not even the greatest psychic could see coming.If you like your romance full of intelligence, wit, roguish gentlemen, and women with \" backbone and pluck\" to spare. Stowaway Bride is just the book you'll want to hide in."}, {"userName": "Cocktails and Books", "userReviewDate": "Jan 04, 2014", "userURL": "http://www.goodreads.com/user/show/3769521-cocktails-and-books", "userReview": "Stowaway Bride is smart, funny, sweet, and it's a historical romance novel. I didn't think I could find a historical that was true to its period and funny, but this novel is a rare treat that shouldn't be missed.Annabelle and Emily are sisters that polar opposites. Annabelle is the beauty and Emily is the smart one. Each is comfortable in their established roles. Annabelle is the younger more adventurous one, but Emily surprises her by slipping aboard a train car meant to take her mother west. Never one to miss an adventure Emily also steals aboard the train and both are surprised to learn that the passenger isn't their mother. Lucien Delatour intends to write letters to investors and work out a strategy to make his railroad a success. However, he finds two obviously well-bred young ladies aboard his Pullman car and can't wait to be rid of them. However, a fortuitous injury means they must continue to journey together. Lucien hastily decides to marry Emily, but he still doesn't know that she is the daughter of a man he believes is sabotaging his railroad. They face a load of adventure, a hoard of naysayers, and none of it matters because love triumphs over everything. This was my favorite historical romance. Emily was a strong, witty, resourceful, and intelligent character. Lucien was smart, sexy, and clumsy...but it all worked out for him. I loved all of the characters and felt they were very well developed. I loved that there wasn't a lot of pretense, and the romance between Emily and Lucien was very straightforward. I was totally vested in their story after the first few pages. I really admired Emily for how she was able to think through situations and turn them in her favor. I liked Lucien, but I think I fell in love with him when he burst in with guns blazing to save the day. The plot was familiar, but it was the depth of the characters that made the storyline take on a life of its own. Don't miss this historical romance treat. Reviewed by Michelle for Cocktails and Books"}, {"userName": "Princess Thuy", "userReviewDate": "Oct 31, 2013", "userURL": "http://www.goodreads.com/user/show/23972144-princess-thuy", "userReview": "This is my first Adrianne Wood book. I won this in a goodreads contest and didn't really know what to expect but the story was really good. I don't normally read historical westerns because they're not as glamorous as historicals set during the 19th century in England with all the dukes and other nobilities, but I really enjoyed this western. It was a cute story and the heroine Emily Highfill Grant was a real likable character. She was just so sweet and adventurous but also had a strong sense of herself. She tries hard to accomplish things and never gives up. I like that about her. And Lucien Delatour was pretty sigh worthy as well. I'm not sure if this book is in a series but I'm hoping there will be a story for Emily's younger sister Annabelle who was a secondary character in this story. I believe Badland's Bride is the previous book that is the story about Emily's older sister so I am definitely going to find that book and read their love story as well. I'm so happy there is a new author for me to read now."}, {"userName": "Diane", "userReviewDate": "Nov 16, 2013", "userURL": "http://www.goodreads.com/user/show/21474266-diane", "userReview": "I enjoyed this story. I liked the characters and would have been okay if the story had gone a little faster or longer so we could have gotten to know some of the other characters a bit more. I would read more if she wrote about these people again.I received this book from the author after being selected in the First Reads Goodreads Giveaway as a winner. I'm not required to leave a review but it seems only fair that I do. If you like this genre than I recommend this book to you. I'm fairly sure that if the main character was real she would be a good friend to have (in that time period; she would be eaten alive in ours). The story surprised me with the train setting as I was expecting a ship but after that I got right into the gist of things and it flowed rather well. It sure would be nice to fall into a romantic situation like that in my life ;)"}, {"userName": "Angela Dillard", "userReviewDate": "Nov 01, 2013", "userURL": "http://www.goodreads.com/user/show/24571577-angela-dillard", "userReview": "Awesome read! I actually took this book with me to finish my Christmas shopping and every line I waited in I read a few pages. Best way ever to pass the time. I absolutely loved the characters. Lucien was amazing and Emily was freaking hilarious, they were just meant to be together. Jacqueline was a real ass. I'm glad she turned out to be so villainous. Every good book needs one. I'd definitely purchase more from this author and I recommend for all those who love a good old fashioned romance. This one rocks!hint hint ...Would love to actually read more about Lucien and Emily and to know what happened with her quirky sister Annabelle. P.S. I won this book in a goodreads giveaway! Yay!"}, {"userName": "Zahra'a Al-dabbagh.", "userReviewDate": "Nov 24, 2014", "userURL": "http://www.goodreads.com/user/show/15822272-zahra-a-al-dabbagh", "userReview": "at the begging i was annoyed that it was a classic novel, and written from second point of view, it wasn't my type of books at all, but i decided to give it a shot, and try to read it, and than god i did!greatly written, the details and how the author described everything inside the novel was delicate that i imagined its characters and theme.full of twisted details, great love story, and passionate one."}, {"userName": "Deadlyfish", "userReviewDate": "Nov 25, 2013", "userURL": "http://www.goodreads.com/user/show/13401610-deadlyfish", "userReview": "Three stars - not bad.I picked up this book as I was going through a self-imposed book diet and needed to read something that would satisfy my appetite.It worked well.This one won't become a favourite, but was a good light read. Some of the writing didn't quite come together, but the heart was there."}, {"userName": "Kim", "userReviewDate": "Aug 18, 2015", "userURL": "http://www.goodreads.com/user/show/3061310-kim", "userReview": "Review Coming"}, {"userName": "Phoenix77", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/5491880-phoenix77", "userReview": "3.75 stars"}, {"userName": "Elizabeth", "userReviewDate": "Nov 18, 2013", "userURL": "http://www.goodreads.com/user/show/24844758-elizabeth", "userReview": "I am a huge fan of historical romance so I knew I would love this book. Emily was what made this book great for me. She was hilarious!"}, {"userName": "Janice", "userReviewDate": "Jun 10, 2014", "userURL": "http://www.goodreads.com/user/show/30360456-janice", "userReview": "A sweet, fun, easy read. Rich, likeable, funny characters. Nice to get out of regency era London where it seems most historical romances take place."}, {"userName": "Michelle", "userReviewDate": "Dec 06, 2013", "userURL": "http://www.goodreads.com/user/show/2616403-michelle", "userReview": "This book was a DNF for me. You can read my review here."}, {"userName": "ROMANTIC HISTORICAL REVIEW BLOG", "userReviewDate": "Jan 23, 2014", "userURL": "http://www.goodreads.com/user/show/5526768-romantic-historical-review-blog", "userReview": "Review by: SebinaReview Rating: 4.5 StarsLink to Review: http://www.romantichistoricalreviews...."}], "description": "A steamy Western set in the Colorado badlands, featuring an heiress seeking adventure and a businessman looking for a saboteur.Emily Highfill Grant is living the life most young women would envy: fashionable picnics on Boston Common, parties with eligible bachelors, and the wealth of her grandfather Charles Bertram Highfill assuring her a fine marriage. But what Emily wants more than anything is to go West—and break free of the cage her name and fortune have built for her. When her mother decides to travel to San Francisco, Emily sneaks aboard their private railcar, planning to surprise her once they’ve left the station. But Emily is the one who’s surprised: the railcar has been leased to Lucien Delatour, and she’s now traveling cross-country in a cozy private car with a handsome stranger.Lucien Delatour hasn’t had it easy. Raised in an orphanage, Lucien built his hard-won fortune with sweat and determination. Now a saboteur’s deadly actions threaten to destroy the rail line that he and his business partner have spent a fortune to create. Racing west, Lucien is determined to prove that the saboteur is his old nemesis—Charles Bertram Highfill.When Emily’s family sends agents to retrieve her, Lucien marries her to keep her safe. But when he finds out who her grandfather is, Lucien can’t help but feel betrayed…and soon he is torn between saving his railroad and saving his marriage.", "title": "Stowaway Bride\n      \n          (Western Brides #2)", "url": "https://www.goodreads.com/book/show/17571088-stowaway-bride", "average": 3.97, "cover": "https://images.gr-assets.com/books/1385341745l/17571088.jpg", "reviews": 16, "authors": [{"url": "https://www.goodreads.com/author/show/5372889.Adrianne_Wood", "name": "Adrianne Wood"}], "type": ["Romance", "Westerns", "Romance", "Historical", "Adult"], "outlinks": ["http://www.goodreads.com/book/show/17571088-stowaway-bride", "http://www.goodreads.com/book/show/18687729-stowaway-bride", "http://www.goodreads.com/book/show/13178628-unruly-hearts", "http://www.goodreads.com/book/show/16008504-mind-tricks", "http://www.goodreads.com/book/show/13438348-badlands-bride", "http://www.goodreads.com/book/show/26838278-fugitive-bride", "http://www.goodreads.com/book/show/20143902-and-they-thought-it-only-science-fiction"]}