{"ratings": 267, "userreviews": [{"userName": "Jake Cooper", "userReviewDate": "Dec 21, 2011", "userURL": "http://www.goodreads.com/user/show/7214023-jake-cooper", "userReview": "Too many sentences like this: \"Seth Redfield, now at Wesleyan University, and colleagues sighted sodium at last in 2007 in HD 189733b, with the 9.2-meter Hobby-Eberly Telescope in west Texas.\""}, {"userName": "Ryan Curry", "userReviewDate": "Oct 16, 2016", "userURL": "http://www.goodreads.com/user/show/7396031-ryan-curry", "userReview": "I thoroughly enjoyed this book.Jayawardhana did a very good job of presenting a clear and easy to understand history of exoplanet discovery. He takes the reader through the major techniques that have and continue to be used in the hunt for exoplanets and does a nice job at the end summing up what the future might look like. In the final chapter Jayawardhana also presents a brief summation of how we might attempt to determine whether or not a distant exoplanet harbours life. I recommend this book to anyone interesting in exoplanets or space in general. It is a good read that I found very accessible."}, {"userName": "Hadrian", "userReviewDate": "Feb 12, 2011", "userURL": "http://www.goodreads.com/user/show/4100763-hadrian", "userReview": "A very quick and well-explained guide to the search for extrasolar planets.It's a very exciting and rapidly changing field - the book is barely a year old and some of the information could be updated!Best suited for those who want a good introduction."}, {"userName": "Laura", "userReviewDate": "Apr 01, 2011", "userURL": "http://www.goodreads.com/user/show/861650-laura", "userReview": "I read this one because the author was coming to speak at the Harvard-Smithsonian Center for Astrophysics observatory night and I wanted to get some background ahead of time.Seriously, wow. I'd been only passively following the search for exoplanets in the news and I had NO idea how far they'd come. Scientists have found over a thousand planets outside our solar system, and they've gone so far in some case as to begin analyzing their atmospheres. From thousands of light-years away. How mind-blowing is that?Jayawardhana brings in a number of little anecdotes which make the story of exoplanets more personal, like how an amateur astronomer housewife in Australia helped locate the first planet by micro-lensing (using the space-time warping effects of gravity. I said this stuff is mind-blowing, right?). The writing is very inconsistent, sometimes clearly aimed at an audience with no background in astronomy and sometimes waxing extremely dry and technical. I sense an editing conflict. But the subject matter is so interesting, it didn't overly bother me.On a personal note, it is extremely cool to read a book chronicling discoveries that all occurred since I was old enough to read about them in the news as they happened. This was an awesome way to bring it all together and get up to speed."}, {"userName": "Devero", "userReviewDate": "Jul 30, 2015", "userURL": "http://www.goodreads.com/user/show/13447391-devero", "userReview": "Sui quotidiani di qualche giorno fa è stata riportata la notizia della scoperta di un pianeta (gemello?) similterrestre in orbita attorno alla stella Kepler 452.Se siete interessati alla storia ed alle tecnologie che stanno a monte di questa e di altre scoperte, questo è il testo che fa per voi. L'autore è un astrofosico che si occupa proprio della caccia ai pianeti extrasolari, è molto bravo nel divulgare il suo lavoro e quello dei colleghi e non calca la mano sugli aspetti tecnici."}, {"userName": "Christopher Obert", "userReviewDate": "Sep 29, 2011", "userURL": "http://www.goodreads.com/user/show/1833319-christopher-obert", "userReview": "This book by Ray Jayawardhana stayed true to its name. The author gave us a quick history lesson and described the current state of searching for new worlds orbiting other stars. The text was not overly complicated but not too weak. Giving us a good description of the difficulties involved in finding planets light years away. Ray indeed took us to Strange New Worlds. I look forward to a follow up book as new worlds are discovered."}, {"userName": "Jose Moa", "userReviewDate": "Nov 26, 2015", "userURL": "http://www.goodreads.com/user/show/47021487-jose-moa", "userReview": "In the line of the book by Kastings but lest exaustive an easy to read, tells the histhory ,future and techniques of search the exoplanets,focusing on earthlike planets and markers of life"}, {"userName": "Ian Brown", "userReviewDate": "May 21, 2017", "userURL": "http://www.goodreads.com/user/show/11633008-ian-brown", "userReview": "(Cross-posted from my blog.)I was excited going into Strange New Worlds. I’m a sucker for astronomy, but I don’t keep up with it as much as I should, so I was looking forward to getting to hear about the new techniques and results in the field. Especially as relate to exoplanets and alien life, something I’ve been acutely interested in since I started working on a science fiction RPG.I got what I asked for, and I wish I hadn’t.The book, to its credit, does a good job of covering the entire field, from the first tentative steps to the newest techniques, including near-future techniques that are currently under development. The problem is that the author doesn’t seem to see fit to delve into any depth or engage in a single bit of speculation. Prime opportunities to fire the imagination with ideas of what the distant worlds could be like are instead replaced with a monotonous drone of: “Person Z, at institution W, used technique X to examine planet Y.” Over and over again. Evocative language is ignored, the author instead choosing to name-check and move on. It becomes history without a real sense of narrative, and as a result is as dry as a rock on Mercury.There is also an issue of at least a few women being dismissed as merely “helping” their husbands or brothers without discussing the women’s unique contributions to field. It feels very dismissive of what they contributed, but there are at least a few modern female astronomers who are given more time on the page. Still, it feels like the author just accepted a very male-centric narrative of the field. I would have liked to see some more digging and more women given the credit I’m sure they deserve. Or at least proper credit given to the historical women already mentioned in the book, instead of lumping their achievements in with that of their male relations.The narration of the book didn’t help with the monotonous narrative problem, either. Pinchot tries gamely to inject some emotion into this flat timeline of events, but when there’s no real excitement to be found in the text, there’s only so much a reader can do. The end result is like a college professor who thinks he’s a good dynamic speaker because he’s using a few techniques he read about in a book. He only gets about halfway to giving the text any life, and the emotion that is added is as robotic as Data without Brent Spiner. Meanwhile I was sitting in the stands, wondering if I was trapped in purgatory and if the book was ever going to finish. No mean feat, given that the runtime is relatively short in the audiobook world, clocking in at under seven hours.All of that said, this book could be a lot worse. It’s an effective overview of the history of the field, and covers everything from the oldest of techniques to the modern day. It does a good job tying in historical discoveries and incidents with modern developments, showing how sometimes a thinker from a couple hundred years ago was very, very close to discovering something and only lacked a critical piece of technology or insight to do it. There’s even some interesting tidbits about exobiology, like the color of the star of a world affecting the likely color of the plants on that world.In the end, I think this is a good book for an academic student of the field. It gives, essentially, a list of the key discoveries in the field, which could be an effective jumping off point for further, deeper research. But as a casual student of astronomy, it left me cold, mostly due to its presentation. Which is a shame, because there’s some interesting stuff here. It’s just all buried under a foot of dust.Score: 2.5/5"}, {"userName": "Doctor Moss", "userReviewDate": "Apr 08, 2018", "userURL": "http://www.goodreads.com/user/show/73419547-doctor-moss", "userReview": "This is a general audience book about one of the most exciting astronomical developments of our time -- the emergence of our ability to detect the presence of planets outside our solar system. The search for extrasolar planets is one of those fields which has explosively bloomed in our lifetimes, just in the last decade. Jayawardhana gives a compact history of the methods and achievements of planet detection, pausing to explain in laymen's terms each method as it develops, with its drawbacks and its advantages.A book about the search for extrasolar planets is a prime example of a book doomed to be out of date as soon as it hits the shelves, no matter when it hits the shelves. That, though, can also be what makes the book compelling -- the field is hot with new discoveries, new methods, new characters. Its time has come. There are currently over 700 confirmed expoplanet discoveries. Even though the book went to print just as the Kepler telescope mission began to bring in huge results Jayawardhana is able to put us in position to appreciate its discoveries and understand the need for their confirmation by other means. He supplies what we need in order to appreciate the announcements that come now on an almost weekly basis.The search for extrasolar planets is inevitably bound up with the search for alien life, but Jayawardhana doesn't let the cart get in front of the horse. Our ability to detect planets runs far ahead of our ability to detect life, or to understand the conditions under which life may develop and flourish. While not ignoring the question, Jayawardhana presents himself neither as an unbridled enthusiast nor as a disinterested planetologist -- of course we'd love to know where to look, how to look, and what we're going to find, but it's going to take us a while to get to that point.All in all, this is a very readable, relatively non-technical guide to a developing field that transcends the interests of professional scientists, that addresses truly mind-boggling questions about our place in nature."}, {"userName": "Kirsten", "userReviewDate": "Mar 27, 2011", "userURL": "http://www.goodreads.com/user/show/4131417-kirsten", "userReview": "This book was awesome. I would have given it five stars if I liked the author's writing style a little better. It seemed a little weird to me, but I guess I should cut the guy some slack, I don't think his native language is English. Besides that, great book! The first probably 2/3 are devoted to the history of extrasolar system planet searching, mostly failures. Then he starts getting into the success stories, explaining the evolution of various technologies along the way (said technologies allowed the successes). Mostly it focuses on American efforts, but since he works out of a Canadian university, Canada, Europe, and Japan get honorable mentions as well. He also tries hard to use examples that put things into perspective for the reader to help imagine the both enormously large and tiny measurements being made.Once he has established how planets in other solar systems are found (in quite a lot of readable detail), he then explains the criteria that have been laid out for planets scientists feel have the best chances of harboring life. Interestingly, they don't rule out moons. The last couple chapters are devoted to this criteria, findings thus far, and ideas that may yield results (or not) in the future with more exploration and funding. The geology of our own solar system that he describes is fascinating, especially about why Venus, Mars, and Earth all diverged in their atmospheres, etc. Very cool stuff. He describes the commonality of various planets that have been discovered by comparing them to planets in our own solar system, which was pretty neat. If you don't know the planets...you should brush up on them or you'll be confused.I love planetary science and space both, so this book was an ideal fit. Very readable and fairly concise (about 225 pages) with a glossary at the back for those who are a little rusty on their space terms, or have a hard time tracking all the ones he uses. He also included a lot of very helpful illustrations/charts, both of physics concepts and planets. The way he explains how we might look for life on other planets using the Earth as the standard to measure by is interesting too. The different ways we know Earth is living besides the obvious, and the fact they trained a space probe back on Earth to measure these things so we can compare to foreign planets is pretty rad, too. A very worthwhile read if you're interested in planetary science, astronomy, space, whatever. If you devoured every book on the solar system you could as a child, this book is for you. If you believe in aliens, this book is also for you.Side note: I think the cover art of the book pretty much sums it up. The big planet talks about strange new worlds, which is the theme of the book, next the search for alien planets which is a fair chunk, and the smallest planet talks about life beyond our solar system, which is a pretty small chunk. The proportions are accurate, so good work whoever created the cover art!"}, {"userName": "Charlene", "userReviewDate": "Feb 26, 2016", "userURL": "http://www.goodreads.com/user/show/2531665-charlene", "userReview": "What a difference between Jayawardhana's writing in this book and his later book on neutrinos! Without question his style changed for the better. This book is great, but not as relatable as Neutrino Hunters. Planet formation is a favorite subject of mine, but I had to make myself pay attention. The history in the first few chapters didn't really grab me. But, then Jayawardhana began to discuss brown dwarfs and I was hooked, so much so, I started over at the beginning so that when he got to brown dwarfs, I would have really taken in everything he included in the book up to that point. Brown dwarfs are one of my favorite things in the universe. They are not a star but not a planet. They are planet-like but also star-like. They confuse and awe me and I want to know everything I can about them. Jayawardhana discusses how he and other researchers came to discover them and understand the traits they possess -- e.g. star like formation and star-like activity when young, but then as they get older, they develop an atmosphere like a planet. The author spends a lot of time drilling home the message that size matters, not just with brown dwarfs, but all celestial objects. It is the size that determines if a clump of matter becomes a star, a brown dwarf, a huge gaseous planet, a tiny rocky planet, or a measly comet. Size determines if there will be an atmosphere on a planet and how thick that atmosphere will be. Size determines if a planet will be geologically active, and possess moving plates. In addition to providing information about brown dwarfs, Jayawardhana details past and future exploration missions that have allowed us to begin to understand what types of solar systems exist, if there are other earth-like planets, and how systems form in general. He should put out another addition of this book and include Hawking's exploration mission in which he plans to send nanoships to Alpha Centauri in search of a habitable planet. I am extremely fond of Phil Amitage's work on planet development and \"feeding zones\". Sadly, you won't read about it in this book because Armitage's work was conducted after this book was written. My hope is that Jayawardhanawill will write a new book, which includes the new strides being made in space exploration and includes Armitage's work as well -- and, I hope he does it using the writing style he employed in Neutrino Hunters (which was one of the most spectacular books of all time). For anyone who is interested in planet formation and feeding zones (coolest idea ever), here is a link to Armitage's talk:https://www.youtube.com/watch?v=Yp4Dz..."}, {"userName": "Sharmin", "userReviewDate": "Sep 19, 2012", "userURL": "http://www.goodreads.com/user/show/12637104-sharmin", "userReview": "Though most of the far far a way universe is out of sight of most of us, it definitely is not out of mind of the curious, thanks to books like Strange New Worlds. Hollywood has given us the fantasy of how strange other worlds can be but learning about the possibilities of the existence of other worlds that can support life as we know it, makes fact more thrilling than fiction. In this book Ray Jayawardhana has bridged the subject from fiction into non-fiction in a story telling style. I have learned since how long ago strange new worlds are being sought after and what were the speculations about extra solar planets in the days of no-telescopes. Now that we have the technology, how is it possible to find and determine their existence from so far away? What are we looking for exactly and how? Author also covered why are we looking for these strange new worlds. This book has satisfied my curiosities about exoplanets and still held my interest to keep up with future discoveries and information in this field. In the process I learned a bit of astrophysics too. I read about different telescopes and how are they being utilized. Came to know about on-going researches I have never heard of before; more particularly fascinating was to read about the Virtual Planetary Laboratory. Very interesting was to learn how our own earth's shine is being observed from space. Realized the significance of Carl Sagan's \"pale blue dot\" as the author pointed it out. Strange New Worlds by Ray Jayawardhana is an easy read and is not at all intimidating with science jargons. The little help I needed, was available right at the back of the book, in the well-built glossary. Ray J. structured the book for all levels of readers. To me it read like a long article rather than a science textbook. I have thoroughly enjoyed it. The closing three lines gave me goose bumps! After reading this book, following news of the discoveries by Kepler telescope is more interesting and thrilling because I now understand the significance and the efforts behind it! Strange new worlds no longer feel to exist in another universe! Would the engineers please start building \"Starship Enterprise\"!"}, {"userName": "Kend", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/6854780-kend", "userReview": "As one of eight books related to \"space\" (loosely defined so as to include human spaceflight, astrorobotics, exobiology, and so on) available on-shelf in my incredibly posh local library, I decided to check this one out first since it had the most recent copyright date. Given that I'm fairly up to date on the latest news regarding exoplanets and exobiology, I was hoping to find a book that spoke to the actual hard science. What I found was a readable, but fairly general, introduction to the science of astronomy––not a bad book, but not necessarily a book that pushed or developed my understanding of the topic any further than what I could easily pick up from Wikipedia in thirty minutes to an hour. The science that Jayawardhana gives his readers here is actually nothing new, but it was presented succinctly and well enough for a new initiate to understand, so I don't want to be too hard on him or this book. I think it's probably exactly the right book for a lot of people, and probably exactly the right book to stock in a library that clearly doesn't put much priority on nonfiction dealing with the applied sciences."}, {"userName": "Nathan", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/549698-nathan", "userReview": "An excellent (re)introduction to the history and practice of astronomical observation, and the ways that astronomers have been learning more about other stars and planets. I find that, because I'm not pushing myself and studying like I might have when I was a university student, I typically exhaust my will to comprehend part-way through physics books. Jayawardhana writes so well that I survived this book until easily 2/3 of the way through. I definitely recommend this book: the stories are interesting, the science is interesting, and the writing is clear and engaging.An interesting stylistic note: the book seemed to suffer once the author became a figure. In the last third, the author writes about work a team did, and then frequently will quote newspapers quoting him. It's a weird construction and doesn't work: you're writing the book I'm holding, you can just say what you think--there's no need to quote yourself. I don't think it was done as ego, but I'm not sure why it was done."}, {"userName": "Jarrell Fisher", "userReviewDate": "Nov 03, 2015", "userURL": "http://www.goodreads.com/user/show/6124914-jarrell-fisher", "userReview": "Somewhat interesting. The author gives an account of the history of astronomy, and then quickly gets into details about how they detect planets. The methods are fairly complex, but at heart simple, and the author does a good job explaining them. He also conveys his own excitement. If your a science fiction fan you'll enjoy reading about space. His writing isn't that stimulating, you get the sense that he is used to writing dry scientific papers, which is condemnation of contemporary science, at least when it comes to writing. Wasn't easy to get through. But, I do enjoy learning about planets and stars."}, {"userName": "Davide Nole", "userReviewDate": "Dec 26, 2015", "userURL": "http://www.goodreads.com/user/show/20069551-davide-nole", "userReview": "Il libro, in relazione a quello recensito in precedenza (che ora non ho sotto mano quindi aggiungerò a gennaio) è molto meno cronologicamente marcato. Se prima questo poteva essere visto come un difetto di forma, la mancanza totale di una demarcazione di argomento in questo libro è praticamente oscena. Sembra di star parlando di qualcosa di sensato, quando l'autore tira in ballo una cosa che non c'entra niente, ma che prima o poi verrà richiamata. E' una sorta di stile romanzato, che però non è funzionale alla narrazione che si sta facendo.Per il resto il libro è molto chiaro e spiega tutto molto bene."}, {"userName": "David James", "userReviewDate": "Dec 10, 2012", "userURL": "http://www.goodreads.com/user/show/5039501-david-james", "userReview": "A clearly written summary of how astronomers are discovering new planets. Jayawardhana is able to explain complex ideas in language that anyone can grasp as he guides us through the universe, explaining the techniques being employed to find planets in far away solar systems. He presents the sometimes conflicting views of what is being learned and gives readers a solid understanding of the way information that is being gathered is processed and why the conclusions being drawn from it should be sound. Highly recommended for space geeks."}, {"userName": "Christopher Myrick", "userReviewDate": "Feb 13, 2014", "userURL": "http://www.goodreads.com/user/show/6707949-christopher-myrick", "userReview": "Nice, detailed history of astronomical exploration. Spiced with short biographies of astronomers, and personal anecdotes, breaking up and enlivening what could have been a story about filters, lenses and equations. Opening and closing chapters harken to Sagan's \"Pale Blue Dot,\" in the latter with explicit reference. Much easier physics than what is found in \"Neutrino Hunters,\" though Jupiter-sized objects are more comprehensible than the sub-atomic. As with many of my favorite science writers - such as Matt Ridley and Olivia Judson - Jayawardhana hut his teeth at \"The Economist.\""}, {"userName": "Daniel R.", "userReviewDate": "Jun 08, 2013", "userURL": "http://www.goodreads.com/user/show/2130032-daniel-r", "userReview": "A wonderful exploration of the science and scientists behind the search for planets outside our solar system. The chapters walk through various techniques being used to detect planets, the discoveries and controversies with that technique, and the scientists performing the work. The names of stars and planets can get a bit cumbersome at times but overall it is a very readable and enjoyable book that provides insight into this exciting area of scientific exploration."}, {"userName": "JodiP", "userReviewDate": "Dec 30, 2011", "userURL": "http://www.goodreads.com/user/show/7247043-jodip", "userReview": "This was such an interesting, concise yet thorough read on our search for other planets. The author doesn't get bogged down in detail and is chatty without being too personal. I have of ocurse read news stories about this work but it was great to review the whole story. It was a quick read, and I would seek out Jayawardhana for other material."}, {"userName": "Katie", "userReviewDate": "Dec 04, 2011", "userURL": "http://www.goodreads.com/user/show/5549944-katie", "userReview": "This actually wasn't a bad book. It did get dry at some parts - I mean, come on, it's a science book - but I actually enjoyed parts of it. It's so amazing to think that we're so close to discovering other worlds, and other life forms. It's not just science-fiction anymore - this stuff is really happening, and it's mindblowing."}, {"userName": "Todd", "userReviewDate": "Jun 18, 2014", "userURL": "http://www.goodreads.com/user/show/7952148-todd", "userReview": "A brief, clear, and entertaining rundown of the search for extrasolar planets. The book is around three years old, which is a lifetime in the absurdly fast-moving field of planet hunting, but it's a great summary of a really exciting period in science, and it really leaves you excited for what's coming up in the next couple of decades."}, {"userName": "Heather VanWaldick", "userReviewDate": "Aug 18, 2013", "userURL": "http://www.goodreads.com/user/show/9404506-heather-vanwaldick", "userReview": "Fun and interesting. The writer kept it simple, so you can understand everything he says as long as you have rudimentary grasp of science. I was already familiar with everything he covered here, but reading more about the subject definitely helped to solidify my understanding."}, {"userName": "Corinna Bechko", "userReviewDate": "Aug 19, 2011", "userURL": "http://www.goodreads.com/user/show/2948172-corinna-bechko", "userReview": "Really enjoyed learning the ins and outs of where we're at with finding planets, and what might be possible in the next couple of decades. Seriously interesting stuff explained in a down-to-earth matter. The author is clearly passionate about the subject (one he is quite expert in) and it shows."}, {"userName": "Kadri", "userReviewDate": "Sep 08, 2013", "userURL": "http://www.goodreads.com/user/show/3321431-kadri", "userReview": "This book is about exoplanets. It goes to great detail in the history of searching for exoplanets, to the different methods that are used and there's also some parts about SETI and radioastronomy. It was really interesting!"}, {"userName": "Alex", "userReviewDate": "Jun 27, 2011", "userURL": "http://www.goodreads.com/user/show/3144945-alex", "userReview": "Kirsten dug this, and I've been looking for a book about this. Looks very promising."}, {"userName": "Christopher", "userReviewDate": "Dec 22, 2012", "userURL": "http://www.goodreads.com/user/show/11889175-christopher", "userReview": "Very clear, concise, and to the point. A good introduction to extrasolar planet hunting and the methods used to do it."}, {"userName": "Heather", "userReviewDate": "Aug 05, 2016", "userURL": "http://www.goodreads.com/user/show/1586418-heather", "userReview": "Accessible, conversational style, covering the history of the search for exoplanets in a way that covers a lot of ground without ever feeling too general."}, {"userName": "Pepe", "userReviewDate": "Jul 31, 2015", "userURL": "http://www.goodreads.com/user/show/23077548-pepe", "userReview": "'Di maniera che non è un sol mondo, una sola terra, un solo sole'"}, {"userName": "Olivierco", "userReviewDate": "Jun 29, 2011", "userURL": "http://www.goodreads.com/user/show/1355869-olivierco", "userReview": "A very informative book giving the state of the art on the subject. The author didn't seem to have chosen between writing a very technical book and a popular science book."}], "description": "In \"Strange New Worlds,\" renowned astronomer Ray Jayawardhana brings news from the front lines of the epic quest to find planets--and alien life--beyond our solar system. Only in the past two decades, after millennia of speculation, have astronomers begun to discover planets around other stars--thousands in fact. Now they are closer than ever to unraveling distant twins of the Earth. In this book, Jayawardhana vividly recounts the stories of the scientists and the remarkable breakthroughs that have ushered in this extraordinary age of exploration. He describes the latest findings--including his own--that are challenging our view of the cosmos and casting new light on the origins and evolution of planets and planetary systems. He reveals how technology is rapidly advancing to support direct observations of Jupiter-like gas giants and super-Earths--rocky planets with several times the mass of our own planet--and how astronomers use biomarkers to seek possible life on other worlds.\"Strange New Worlds\" provides an insider's look at the cutting-edge science of today's planet hunters, our prospects for discovering alien life, and the debates and controversies at the forefront of extrasolar-planet research.In a new afterword, Jayawardhana explains some of the most recent developments as we search for the first clues of life on other planets.", "title": "Strange New Worlds: The Search for Alien Planets and Life Beyond Our Solar System", "url": "https://www.goodreads.com/book/show/17130588-strange-new-worlds", "average": 3.81, "cover": "https://images.gr-assets.com/books/1356085748l/17130588.jpg", "reviews": 35, "authors": [{"url": "https://www.goodreads.com/author/show/332874.Ray_Jayawardhana", "name": "Ray Jayawardhana"}], "type": ["Science", "Nonfiction", "Science", "Space", "Science"], "outlinks": ["http://www.goodreads.com/book/show/17130588-strange-new-worlds", "http://www.goodreads.com/book/show/10317070-strange-new-worlds", "http://www.goodreads.com/book/show/25985164-strani-mondi-la-ricerca-di-nuovi-pianeti-e-della-vita-oltre-il-sistema", "http://www.goodreads.com/book/show/20608127-strange-new-worlds", "http://www.goodreads.com/book/show/17332273-neutrino-hunters", "http://www.goodreads.com/book/show/615041.Star_Factories", "http://www.goodreads.com/book/show/32951094-cacciatori-di-neutrini", "http://www.goodreads.com/book/show/5323714-young-stars-near-earth"]}