{"ratings": 31613, "userreviews": [{"userName": "Shannon", "userReviewDate": "Feb 10, 2009", "userURL": "http://www.goodreads.com/user/show/2016128-shannon", "userReview": "I had a really difficult time with this book. I went back and forth from really liking it and then really hating it. In the beginning I could sympathize with Faythe; nobody wants their life decided for them. But as you start to learn exactly what she's running from - responsibility and family obligation - the sympathy turns to annoyance. Faythe is one of the few female werecats in the United States. For some reason females are very rare, although it's never really explained why. Faythe wants to go to college and try to have a career and a life separate from her Pride. She doesn't want to be stuck in the role of mother and housewife so she tries to run away from it all. The thing is, someone is hunting the tabbies, female werecats, and so Faythe's Father makes her come home from college so she can be protected by her numerous brothers and the enforcers working for him.At the best of times, Faythe is mildly retarded. A tabby was found beaten and raped and very much dead, and then soon after another tabby goes missing. So naturally, Faythe's family decides that they need to protect her at all costs. But Faythe gets it into her head that she wants to live outside the Pride so she tries to negotiate with her Father to leave. Um, hello? Did you miss the part about the kidnapping and rape? Why not wait for a better time to throw a temper tantrum?There are countless times where Faythe does the one thing that she shouldn't do, resulting in her own kidnapping, attempted rape, beating, and so forth. Some of the situations she gets into are so ridiculous that you almost have to think that the author didn't know how else to move the plot along.Also, Faythe fights her attraction to Marc for most of the book, so much so that she bites his leg to the bone in cat form when he tries to rub his scent on her. But then she gets drunk and sleeps with him. So not only is she stupid, she's also a stupid cheating whore (she has a human boyfriend back at college.)One final thing, this book was over 600 pages long and honestly there was so much description, explanation, and world-building included that really could have been shortened or even altogether left out. I found myself skipping over parts because they just weren't important, and I don't think I've ever done that before unless I'm reading a textbook.All in all, this was a pretty mediocre book. The only thing that makes me want to read more are the male characters. Faythe makes me want to strangle her though so I don't know how much more I can put up with."}, {"userName": "Galla", "userReviewDate": "Jan 20, 2011", "userURL": "http://www.goodreads.com/user/show/4445010-galla", "userReview": "*cuing guitar riff for musical review*MARC & JACE:Well we guess it would be niceIf we could lick your cat fur'Cause you can make a tom purrNo hotter furry than you.JACE: But I've got to think twice Before Marc beats me 'til I dieThat shit hurts; I ain't gonna lieMaybe a kiss or two...FAYTHE:Oh, but I need some time offTo go to grad schoolI'll read some books and send my dad the bill.And when the mean EnforcersDrag my ass home, yeahI'll forget about my boyfriend,And get all up in your grill.'Cause I gotta be Faythe... Stray-beh.I know you're on a kidnap spree But that just can't apply to meThe special snowflake that I am. Stray-beh. Oh crap, you weren't fucking aroundI'll talk some shit until I'm foundI'm lucky that I'm pretty good in a jamand can hit like a man.GALLA:Before this plotlineThere comes an oceanOf TSTL moments I abhor.And so I reconsiderMy TBR pileWell I need a new book, GoodreadsBut I don't think I'll read more... Of the hot mess that's Faythe.She's gotta be Faythe.She's gotta be Faythe. She's gotta be Faythe, Faythe, Faythe.2.5 stars."}, {"userName": "Navessa", "userReviewDate": "Apr 03, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "I’m Too Stupid to Live and So Can You!\nA Checklist, By FaytheWhen sensing a threat to your person, I find it’s best to do the following:1. Get rid of any potential witnesses. If you’re about to get your ass kicked they could double as rescuers and how can you expect to get kidnapped or die a grizzly death with that type of pesky interference?2. Forget calling for backup. Who wants to be told to do boring things like “Stay in a well-lit area” or “Get inside and lock the doors”?3. Find the darkest alley possible and proceed directly to it, especially if it’s nighttime and you’re somewhere with heavy foot traffic, like a college campus. You’ve already gotten rid of your witnesses if you know what’s good for you but you can never underestimate those good-for-nothing Samaritans. You’ll only be safe from them if they can’t see you.4. Assume that your mere presence will be enough to scare off your unknown assailant. After all, you’re under five and a half feet tall and weigh less than 125lbs, who wouldn’t be scared of you? 5. When you reach the darkest part of the alley, stop. This is the PERFECT spot to fight because your attacker won’t be able to see a goddamn thing. Neither will you but that’s not the point. 6. As soon as you catch the scent of your assailant, busy your hands. I find the best way to do this is to fumble with your phone to call for that backup you don’t really need. Oh, but make sure you don’t actually follow through with this because who wants to hear bad advice like “Run” or “Call the cops” when you have bigger things to worry about?7. If the person who wants to kidnap/rape/kill you doesn’t take advantage of your busy hands and downcast eyes, start walking forward again. Don’t forget to shuffle your feet. This serves the dual purpose of keeping you from bumping into anything and also making as much fucking noise as possible so your attacker knows EXACTLY where you are. 8. When your loud shuffling and intimidating physical stature successfully scares your attacker into running away from you (trust me, he’ll run), chase that motha fucka down. 9. Don’t pause to wonder whether or not his running is a ruse to lure you closer to HIS backup (silly girl, he doesn’t have any) or to the chloroform laced rag he wants to shove into your face. Give yourself a pep talk instead, I find it’s much more helpful. 10. While your internal monologue runs on repeat about your awesomeness, take this time to also lose track of your assailant. That way, when he kicks you in the head it will catch you completely off guard and give you the advantage of being dizzy and also sprawled out on the ground. Everyone knows this is the best position to fight from when outweighed and outclassed. 11. If for some reason he gains the upper hand and manages to land a few more punches you should start to think about getting back up and fighting. I find doing something unexpected, like breaking his nose, works well to give myself some breathing room from the onslaught of fists. 12. You’ll know you’ve succeeded when you hear that satisfying crunch of bone. You might want to press your advantage here because he’s now doubled over and bleeding profusely but there are better things to do. LIKE MONOLOGUE!Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Jessica", "userReviewDate": "May 01, 2010", "userURL": "http://www.goodreads.com/user/show/3283298-jessica", "userReview": "This is me being excited about Stray:I guess you get the picture.Alright, let’s see...what’s to say about this book? For starters: I didn't even finish it. I stopped at page 340 of 618. I think I gave it a fair chance, didn’t I?Our heroine in this story is a 23-year-old werecat named Faythe. Werecats are basically organized like wolves, they’re living together in packs with an Alpha as its leader and they look like panthers. No wait. They can't look like panthers because there is no such thing as panthers. Those are all werecats. What you see in the jungle, in zoos...yep, all werecats.Anyways, Faythe is the daughter of the pack’s Alpha and is supposed to succeed him in leading the pack some day. The problem: Faythe doesn’t want to become the Alpha and she doesn’t want to marry Marc, one of the pack's enforcers, whom her dad has “chosen” for her. She wants to live on her own somewhere far away from her pack mates because she feels like she’s not respected among them. Anyways, she managed to talk her dad into letting her go away to study after graduation but when one of her fellow tabbies goes missing (they are very rare and therefore extremely valuable to the packs) her Dad decides he wants her back home under the protection of the pack. Of course Faythe is less than thrilled by this idea and ends up being dragged back kicking and screaming. Even after she got attacked herself, I might add. Back home, she’s restless and unhappy and shows her disapproval of the general situation by being a major pain in the ass and to make things at least a little bit interesting for her she decides to kill some time by playing with the feelings of the two guys who love her. Marc, her ex-boyfriend, and Jace, another one of her father’s enforcers. Even though Jace has always been like a brother to Faythe he now became interesting to her in a forbidden fruit kind of way. May I introduce you to an old friend of mine? I’m sure you’ve heard of him before, his name is Mr. Love Triangle.It’s hard to nail down what exactly kept me from getting sucked into the story but somehow the whole thing was just lacking. I also had a hard time relating to Faythe. She really is a piece of work and more often than not she’s just a selfish bitch. She does irrational stuff like going for a joyride in the middle of the night all by herself without paying a thought to the gang of psycho murderers that is out to abduct tabbies, beat the shit out of them, rape them and eat them afterwards. Nooo, Faythe isn’t concerned at all by this because she’s oh-so though and independent. *facepalm* So yeah, I had a hard time relating to her and to be honest, I couldn’t have cared less whether she gets eaten or not. To sum it up: The story was kind of ok but neither could I relate to the heroine nor could I swoon over the two guys. Seeing as I bought all 5 books of this series in a fit of book mania I'm really kicking myself right now. Hard."}, {"userName": "Kat Kennedy", "userReviewDate": "Sep 28, 2010", "userURL": "http://www.goodreads.com/user/show/3270188-kat-kennedy", "userReview": "When I put this book onto my TBR list, I was immediately asked to confirm suspicions that Faythe was a horrible name. It's true. So very, very true. Especially when her first name is a perfectly respectable Katherine or some such derivative spelling!This book is a lot like her name. It's a horrible bastardization of an otherwise sound concept. Faith is a perfectly acceptable name apart from the Pavlovian upchuck reflex it gives me when it reminds me of Faith from Buffy and Angel.The concept is of an over protective Pride of werelions and the pride daughter, Faythe, who is desperately trying to assert her independence when a psycho tabby kidnapper (they call female werelions \"tabbies\" because I can only assume their feline natures makes it impossible to treat women with any kind of respect or equality) show up and forces Faythe back to her family home for another good ol' fashioned dose of being oppressed and held captive by her own family.Right. This should be a book I would really enjoy. A book where the character's name is Faith and she sets about teaching them all some damn respect and manners before kicking ass and catching the criminal.So where does it all go wrong?Well it starts with Vincent's baffling decision to use the spelling of \"Faythe\" and it just doesn't stop there.The main problem is with Faythe. Yes, this is a coming of age story, kind of... I mean, we are supposed to be representing a rebellious young soul desperate for freedom here! But she acts like she's sixteen years old when she's actually twenty-three.It's hard to respect a female protagonist who begs for freedom but spends five years of university on daddy's dime without so much as trying to find a job to even pay her own rent. Then there's the fact that she is easily the most childish and ridiculous person I've yet read in the PNR genre. Get this, right. She knows who the next victim is going to be. She's on the phone to her father who is begging her for the name so that they can go rescue her, but Faythe won't hand the name over until her father agrees to let her in on the hunt. They even go through a long-ass bargaining process. She's casually negotiating the terms of her agreement while her cousin is locked in the basement underneath her feet. Her cousin who has been kidnapped, beaten, raped and terrorized for like three days!She has a boyfriend who she barely remembers while she's making out with two other guys within a couple of hours of each other. It's not until she sleeps with her old fling that she even has a single pang of regret.The whole story was eerily similar to Bitten by Kelley Armstrong. The Overbearing supernatural family that the MC has avoided in order to maintain her independence, her arrival and feelings that her reasons for staying away weren't very good, the lack of other females in the species rendering the MC special, the kidnapper and self-solving the heroine performs.It's got a very similar ring to it but there is no way that Faythe could ever compare to Elena who was totally kickarse.And that's where the biggest problem was. Elena's management and careful negotiation with both Clay and Jeremy makes Faythe look like a schemeless moron. I had very little pity for Faythe in the end, believing that her family's overprotectiveness of her was entirely in order because they'd only be protecting her from herself.Her love interest Marc was little better and the book finished up with a very corny little ending without any body in this entire book actually really learning or growing at all. So here's my problem. Faythe’s all hardcore feminist but that doesn't mean that she REALLY wants to be treated like an equal. It means she wants to be treated better than anyone else. She fools around with Jace, having very little regard for the consequences to him for leading him on. She bites Marc’s leg through to the bone, barely resisting the urge to break it. Okay, he may have definitely deserved a nip, but not an almost maiming! She loses her temper, underestimates and looks down her nose at her mother, lashes out at other people and expects her precious Lady Garden to stand between her and any kind of comeuppance that she deserves. She almost kills a human. Any other werelion would be declawed or punished in some way but she gets away with it with little more than a harsh scolding.Look honey, you can't have it both ways. Either you stand up and say the same standards for the boys apply to you too and you play by the rules, or you shut up and nut up! (Zombieland is awesome by the way...)So basically this was an extremely 'meh' read for me. There were some parts a little sexy, some a little compelling but overall it was far too formulaic, and the characters, writing or plot nowhere near made up for it."}, {"userName": "Jacqueline", "userReviewDate": "Feb 11, 2016", "userURL": "http://www.goodreads.com/user/show/9659631-jacqueline", "userReview": "June 12, 2016Yup still 5/5 stars duh but Rogue here I come!Feb 11, 20165/5 starsY'all I don't even know how to express how much I enjoyed this damn book.Already ordered the rest of the books in the series!!"}, {"userName": "Emily May", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "There are a good many reasons why this book was lucky to get 4 stars from me, but also equally as many reasons why it could have possibly got more. I'll start at the beginning by explaining the general plot. So... Faythe Sanders is a werecat in a world where female werecats are rarities and also highly protected by the males in an often teeth-grindingly annoying fashion (but more of that in a bit); after 5 years at college, she is summoned back home in a bid to keep her safe from a wild, tabby-killing stray and his gang of murderous followers.Well, for a start, this Were book was a million and one times better than Moon Called, Faythe was far easier to relate to than Mercy (a college girl battling for independence rather than a mechanic) and definitely likeable. Unlike Mercy, I actually gave a damn what happened to her. But I spent half of this book wanting to sing it's praises and half of it seriously contemplating throwing it at the wall. The misogyny of the werecat society was painful, if I'd have been Faythe I would have locked myself in a room and screamed. For a start, the possibility of leaving the Pride is a luxury only open to the males; the women, on the other hand, have no say in the matter of where they wish to live. It's so bad that Faythe's father even threatens to lock her in a cage for a year if she tries to run away. I think the author took some steps towards redeeming both her mother and father as the book progressed but it never really worked for me. They'd already become one of the enemies in my mind when they tried to bully Faythe into marrying Marc, and her father enjoyed asserting his authority over her and proving that he would always 'win'.I've come to accept that a lot of Were novels play on the idea that women are seen as weak and inferior within a Pack or Pride (whether true or not), but I repeatedly wanted to tear my hair out in frustration when Faythe's wishes were laughed at because she is female. There is one part of the novel where her father orders her to 'sit', she refuses and so then her brother forcibly knocks her to the floor and throws her onto the couch. Eek. In my opinion, her family and Marc are misogynistic to the point of being abusive. And that's another thing...Marc. Marc is the big strong hero to her quirky, strong-willed heroine. He's good-looking, intelligent, strong, brave, good in bed... and a complete dick. I didn't like him. At all. So yeah, he got a bit better as the novel went on but he was all about expressing his dominance over others, including Faythe. I can't see them in a proper relationship, or at least not one that I personally would put value on (i.e. equal), but Rachel Vincent left the book in a way that would suggest that there is to be a future for their relationship. But there are quite a few books in the series so I'm hoping Faythe comes to her senses and gets together with the one guy who is sexy, funny and considered her wishes and opinions from day one...Jace. Now, there's a good hero for you. For me, there's absolutely no contest between him and Marc. He's not even the 'good guy', he's the sexy, dirty talk kinda guy... and yet, he treats Faythe better than her father, her brothers and Marc combined. As it stands at the moment, I really want her to be with him. Or maybe she'll finally find a way to break free from the constraints of the Pride and discover that she needs no one: man, woman or cat.The story was good too, not the most original one I've ever read but I was kept interested throughout, which isn't that easily done when a book is 600+ pages. What I really can't understand is why so many people shelved this book as 'young adult'. It isn't, to put it plainly. It has graphic sex, graphic violence and some seriously awful rape/attempted rape scenes. This is not in any way a young adult novel. Even though Faythe is a college student, the majority of the main characters are upwards of twenty-five so I don't really see how it could be mistaken for one.Even with the frustrating men in the book, I loved Faythe and I really enjoyed Vincent's writing. I definitely intend to read Rogue, I'm just keeping my fingers crossed for Jace."}, {"userName": "Samantha", "userReviewDate": "Jul 02, 2015", "userURL": "http://www.goodreads.com/user/show/10067920-samantha", "userReview": "I finished this book in one sitting. I could not put it down. I grew up reading urban fantasy and this felt so nostalgic to me. I loved our sassy main character and the witty banter between all of the characters. There were parts of the plot that were a little predictable, but I was okay with that and found it as more of a comfort. I adore urban fantasy and am so happy to have rediscovered the genre with this series."}, {"userName": "Penny", "userReviewDate": "Apr 05, 2015", "userURL": "http://www.goodreads.com/user/show/7463065-penny", "userReview": "DNF. I had only 1 hour and 25 minutes left of the audiobook when I decided I wasn't curious enough to care about the resolution of the plot, so I quit. After a few hours of listening I started to lose interest in the book since the storyline was very predictable, the book had way too much unnecessary information and there were mayor issues with the main character and the foundation of the story.Faythe The female main character. I don’t believe her character was well formed and that affected the way her personality was reflected. Her behavior was more suitable to a teenager than a 23 year old woman. I found Faythe to be extremely annoying. She is incredibly shelf-center and immensely mentally-challenged. One of the big problems I have with her character is the way she sometimes talks as if she had grown up in a different world instead of in an environment surrounded by felines, she thinks as an outsider, as a human who suddenly finds herself in a world of shifters, instead of as someone who belongs to that world. This fact to me shows lack of character development or lack of character achievement, Faythe should have come across as someone more open-minded to other ways and as someone who wants more and different from what she has or is expected of her, not as someone who is constantly surprised, frustrated and resisting something she should have seen as normal, accepted and simply tried to find a way to mashed with her mindset and search of a different way of being.Story The plot is more or less that tabbies are being killed and Faythe has to go back home so she can be protected; but the real story revolves around Faythe, around the fact that she is resistant to her fate, resistant to whom she was born to be due to where she was born and what she was born as. That struggle is one that many face (putting aside the werecat part of course ;) ) so is fine, there is nothing wrong with it. My problem comes back, ones more to Faythe. The approach of the story is just not well set out, not well developed. It is ok that Faythe is trying to run away from a life she doesn't want, I believe that, but if there is someone out there killing female cats and here comes your family telling you they want to protect you, then you go with them and be protected because any sane person would want to stay alive no matter what. Only when the crisis is resolved, you can go back to flying from your birth-imposed fated life and making one chosen for yourself if that is what you really want. It is not however, the time to rebel, affirm your independence and be reckless, I just don’t believe that can be going through anyone’s minds in a moment when people are dying around you. Survival comes first, then the rest. On this wise we have that the story is based on genuinely hard to believe grounds and the main character is incredibly idiotic and senseless who she herself, against all rational is responsible for the bad and predictable things that ended up happening to her. In conclusion: the whole book is untenable (and astonishingly reminiscent of Bitten by Kelley Armstrong).Audiobook The narrator Jennifer Van Dyck, is good but she doesn't fit the voice of a 23 year old girl, the voice sounds older and since Faythe acts childlike it’s a bit wear.Since I didn't finish this first book and I had so many issues with it I think is quite obvious that I will not be continuing this series."}, {"userName": "♥Christina", "userReviewDate": "Feb 01, 2016", "userURL": "http://www.goodreads.com/user/show/52207144-christina", "userReview": "1 Barley Deserving ★'s“A smart woman would have shut up. Did I? Hell no. Intelligence is overrated anyway.”This book was sooo not for me! I had such a difficult time with it. The main characters are terribly annoying. Especially Faythe, who is the 23 year old heroine in this story and I couldn't handle how goddamned immature she acted. I have read heroines who have acted more mature at the age of 15. On top of that she was stupid, irrational, obnoxious, cocky, acted like she was better than everyone else and down right selfish. NO HEROINE should act like that... EVER. Faythe has all shitty personality traits and I really wanted to punch her in the face the whole time too. Ugh!! As for the hero, I absolutely did not like Marc either. He was blah in every way possible and Marc wasn't swoon worthy at all! Stray was such a long drawn out book and it was full of nonsense. The plot was crap, the story telling was crap, it was complete and utterly predictable and it was...Boring. Boring. Boring. I have nothing good to say about this book. There for if it's not obvious, I will not be continuing with this series. *I don't recommend this torture to anyone*"}, {"userName": "di", "userReviewDate": "Nov 27, 2011", "userURL": "http://www.goodreads.com/user/show/2633899-di", "userReview": "This book is Bitten but with werecats. (Yes, werecats.) In fact it has almost exactly the same premise as Kelley Armstrong's book...Girl flees uber-intense 'were' family to live alone in the 'real' world. Yet, despite her best efforts to lead a normal life she never truly feels like herself. Girl is forced (literally) to return home to a house full of domineering male 'were-creatures'. Were-females are slim pickings so, of course, all the males fight over her. And there is this one super intense alpha male...her ex. She thought she left him for good but really she is still in love with him and just not admitting it to herself. He obsesses over her, refuses to imagine any kind of life without her, and believes they will end up together once she gets over her issues. So we spend the whole first half in a back-and-forth between the two and throw in a few wrestles and naked bush runs with the other 'were-brothers' in tow. AND THEN the rest of the book is spent dealing with the stray or pack-less 'weres' who have been creating problems in the neighborhood. Generally, girl disobeys orders and flees and ends up kicking ass all on her own, thank you very much. So everyone now believes in her and she finally has an epiphany and realizes that she was in love with 'alpha male' all along.Yup. Formula is formula though and it sells for a reason: mindless escapist entertainment. And it is entertaining, the first half especially. So two stars for that."}, {"userName": "Stacia (the 2010 club)", "userReviewDate": "Jul 15, 2010", "userURL": "http://www.goodreads.com/user/show/4013351-stacia-the-2010-club", "userReview": "Had to redo this review after reading my original review from last year and finding it to be pretty crappy and non-informative.Stray is the start of a fun, action packed series featuring a very kick butt heroine and a yummy love triangle. The female lead can hang with the boys (and pretty much does, since there aren't many females hanging out at their compound). Faythe can fight like a man, and has the balls of a man when it comes to bravery. She has her stupid and selfish moments, but I also feel like she had to go on the journey to become a better a person in the end, even if it meant making decisions that came across as self-serving to start.Comparisons have come up between this book and book 1 of Kelley Armstrong's Women of the Otherworld series. There are some similarities, but after the first book, both series branch off into opposite directions. It seems that people tend to have preferences based on which one they read first. Since I read this one first (even though Armstrong wrote her book first), I prefer Stray. Both Jace and Marc are appealing for different reasons, and the black panther/werecat concept is so much more fun than \"overdone\" werewolves. I also prefer Faythe's family structure hands down over Elena's. I didn't care for the side characters in Bitten, whereas I love every single side character in the Shifters series (except for the one sadistic brother). Something about being in Faythe's head every time she shifts also sends chills through me. Vincent made me feel as if I was shifting right along with Faythe.I actually enjoyed the series from book 1, but some people don't start feeling the love until around the third book. The first in the series is the weakest of all the books, and they do get progressively better, but I still felt hooked on my werecats from the start. Even with this being over a year later and reading other series that I have liked better, I refuse to drop my original 4 star rating for book 1. These books will always hold a special place in my heart for being the first adult UF series to get me excited about the genre."}, {"userName": "Lainey", "userReviewDate": "Oct 31, 2015", "userURL": "http://www.goodreads.com/user/show/22889537-lainey", "userReview": "I like this series!"}, {"userName": "Anzu The Great Destroyer", "userReviewDate": "Oct 16, 2010", "userURL": "http://www.goodreads.com/user/show/2278800-anzu-the-great-destroyer", "userReview": "Warning. Review might contain minor spoilers. Read at your own risk.I have to admit that I wasn’t happy about starting this book because of that horrid cover. I don’t know what it means to represent? Surprise buttsecs? Hos’r’us? Bad tattoos stay with you forever? I don’t know. Horrible cover is horrible.What made me go ahead and buy this thing is the fact that more than half of my Goodreads friend list gave it either 5 or 4 stars. Well hello mister popularity. I guess we ended up reading different books because I sure as hell can’t find anything good about this one.Stray starts out with the worst introduction on the face of the planet. I mean if you actually manage to get past Chapter 1 I respect you greatly. Let me demonstrate the MCs idiocy.\n\nI could have called my father to report the intruder. I probably should have called him, so he could send the designated spy-of-the-day to take care of the problem. But calling would necessitate speaking to my father, which I made a point to avoid at all costs.\n\nSo I’d rather be stupid and get myself killed. I’m not daddy’s little girl anymore!!\n\nUnlike most of my fellow tabby cats, I knew how to fight; my father had made sure of that. Unfortunately, I’d never made the jump from theory to practice, except against my brothers. \n\nSo unlike those amateurs you know how to fight. But only theoretically. And against your brothers who most likely go easy on you. Sure. Be cocky. You have all the reasons to be.\n\nMy resolve as stiff as my spine, I stepped out of the light and into the darkness. \n\nWhat the hell is she doing? Does she want to commit suicide and doesn’t know the best way to do it? Obviously TSTL.\n\nI glanced quickly behind me, looking for signs of life from the quad. It was empty now, as far as I could tell. There were no potential witnesses; everyone with half a brain was either studying or partying. So why was I playing hide-and-seek after dark with an unidentified stray? \n\nIt was your fucking decision to go there in the first place.\n\nI was feeling foolish now, chasing a stranger down a dark alley at night, like some bimbo from a bad horror film. \n\nI couldn’t have said it better myself.\n\nThe difference between the movies and reality was that in real life, I was the hairy monster, and the only screaming I ever did was in rage. I was about as likely to cry for help as I was to spontaneously combust. \n\nDude, I highly doubt that. I’m still in the first chapter and I can tell you’re not even remotely close to a monster.\n\nAfter what I’d done to his face, this one should have run screaming from me in terror. It was because I was a girl, I knew it. \n\nWha-\n\nShifting my weight to my left leg, I let my right foot fly, hitting him in the chest with a high side kick. \n\nI thought she never fought. Is this a special night or what?And, I repeat, that’s only your first chapter. I made it through four chapters and things didn’t change. This book is full of mindless \"action\", contradictions, horny (and devilishly handsome) guys who want to get their hands on our brilliant MC – because what’s a book without a bunch of hot horny guys? Nothing. What else? Forced everything – story, characters, “romance”. Lots of cheese. Not for me. Really. I can’t handle 400 pages of this. And wait, this is only book one. Thank you, but no thank you.What a waste of time and money.Review also posted on"}, {"userName": "Jennifer", "userReviewDate": "Mar 04, 2017", "userURL": "http://www.goodreads.com/user/show/4581159-jennifer", "userReview": "Really good! Ended nicely although the whole series is out and in my hands so a cliffhanger doesn't bother me now anyway. I love Faythe and Marc. I hope they aren't gonna be on again off again through the whole series."}, {"userName": "MLE", "userReviewDate": "Dec 08, 2015", "userURL": "http://www.goodreads.com/user/show/2761976-mle", "userReview": ""}, {"userName": "AH", "userReviewDate": "Apr 18, 2010", "userURL": "http://www.goodreads.com/user/show/3255548-ah", "userReview": "Before I began reading paranormal and urban fantasy books, I didn’t really know about the variety of “were” worlds out there. I’m glad to have discovered them. Stray is the story of a Pride of werecats. The werecats are led by Faythe’s father, in a kind of mafia-like arrangement of leadership and enforcers. There are very few female werecats of breeding age; most of the werecats are male. In Stray, someone is kidnapping the tabbies (female werecats) and our heroine Faythe Sanders becomes a victim.Faythe is forced to go home after she is attacked on campus and her cousin Sara vanishes. Her family and her father’s enforcers are at her home, set to protect her. This is where I had problems with her character. Faythe is in danger, yet she decides that this is the right time to negotiate with her father for her independence and freedom. As for the boyfriend department – Jace is all over her, Marc is very possessive of her, and well, there’s also a boyfriend back at college. A love square. I have a love/hate relationship with Faythe. For the most part, she is likable except when she is being annoying. Confused? That is a perfect description of Faythe. Faythe is independent (at times), impulsive, petulant, and a little bit spoiled. When we are first introduced to Faythe, she is away at college working on her post graduate degree. She is living like a human girl – she has a human boyfriend, she has a human roommate, and she is a typical 23 year old. Except that she does have a little security detail hiding in the shadows. The story is told in the first person, from Faythe’s point of view. Usually I find that this style makes the story difficult to follow, but I liked it this way. I felt that just enough information was revealed and that I had my a-ha moments about the same time as Faythe did. I loved the descriptions of the werecats, their changes, and their mannerisms. There is a point in the novel where Faythe is describing the reactions of humans to her group as they walk by. I could just imagine the humans changing directions and allowing the werecat people through. I can’t wait to read the next book in the series. Update - May 2011 - I finished reading Alpha (book 6) at the end of April. I wanted to add that those of you out there that may be annoyed by Faythe - keep reading - the last 3 books in the series were quite an emotional and action packed ride."}, {"userName": "Sarai", "userReviewDate": "Sep 26, 2007", "userURL": "http://www.goodreads.com/user/show/358682-sarai", "userReview": "Well I have to admit I couldn't finish it. It was so long that I finally gave up. I was tired of hearing about poor me I need my independence and I will do anything to get it including risking the lives of my friends and family. And don't think for a second that I will see the error of my ways or compromise. AND MY GOD this book was long... way longer then it needed to be so this is a no. Maybe next time she could cut it in half. I did like how she described the shifting but she didn't get the cat mentality down. Cats don't mate for life that's wolves but she has them doing just that and then doesn't explain it? She also took alot from Bitten by Kelley Armstrong about limited women born and what not... seriously? Explain why there were only so many woman born or just give up and say you took the idea from Kelley who did a much better job at writing it."}, {"userName": "Shannon (Giraffe Days)", "userReviewDate": "Nov 24, 2009", "userURL": "http://www.goodreads.com/user/show/395599-shannon-giraffe-days", "userReview": "What was that book where there's a rare female animal-shifter, who has a hottie guy-shifter practically obsessed with her who is convinced she'll eventually say \"yes\" to him and going all moody on her; who lives with a bunch of other guy-shifters in a pack, who enforce shifter laws in their area and who aren't to be crossed with - who gets kidnapped because of who she is and locked in a cage, and who throws a mean punch? Yeah, exactly. It's Bitten by Kelley Armstrong (and the sequel, Stolen, for the locked-in-a-cage part). Not that I'm accusing Vincent of plagiarism, not at all - the publisher was wise enough to get an endorsement from Armstrong for the inside cover. But please, this story has already been written, and so much better too!Let's try again: Faythe (I'm already cringing at the name and its spelling) is one of only eight female werecats in North America - single female cats, or \"tabbies\", that is. The only daughter with four older brothers (or was it five? Hard to tell, they were all pretty much the same), Faythe is resistant to her birthright: to marry a strong werecat male, and have lots of kittens. Her father is the leader of a territory and its Pride, and she grew up with her brothers and several Enforcers: other males who work as security and bodyguards and live on the main property. Faythe, though, is determined to have her own life and manages to convince her father to let her go to university.On the same day that Faythe is attacked by a stray, one of her father's Enforcers comes to take her back to the family estate: one of the other tabbies has disappeared, possibly kidnapped, and the men are locking down the hatches to protect their own women. Faythe doesn't respond well to having her freedom curbed any more than she's happy to be in close proximity to Marc, one of the Enforcers and her ex-boyfriend. It's clear Marc hasn't given up on her, and it's just as clear her parents want her to pick him. But then there's hot Jace, and she wants a bit of him too.Faythe has a history of running away, and it's this habit that sees her easily captured by the Bad Guys and locked up in a cage in a basement - along with her cousin Abby, who's also been abducted. Much attempted rape ensues before Faythe rescues herself and plots to catch the Bad Guys.This is me sighing, long and loud. This is me, having sighed, launching into my mean and nasty bitch-moan-fest:Strike #1: it's highly unoriginal. Aside from being a blatant rip-off of Bitten, it reminds me of several other urban fantasy series that feature weres. I enjoy them, because they each offer something new. Nothing new here, not a thing.Strike #2: oh the soap opera, the self-indulgent, over-the-top melodramatics! PLEASE someone shoot me and put me out of my misery! No, better plan: someone SHOOT FAYTHE - before she procreates. I shudder to think of more Faythes running around.Strike #3: Faythe. Oh MY GOD could there be any character in the world of fiction more annoying, more obnoxious, more selfish, more stupid, more self-indulgent, more ... there aren't enough of these words in the English language, we need more! Christ. I can't get over how much I want to slap her. How on earth anyone could be attracted to her, much less love her is beyond me. It certainly doesn't make sense. And what kind of idiot Pride leader would want her to take over from him? I'm not buying that bit of flimsy plot-device.Strike #4: the plot. Aside from being HUGELY predictable, it's also incredibly boring. The first half of this way-too-long \"novel\" revolves around Faythe, back at her parents' home, taunting the boys; snapping at Marc; leading Jace on; explaining ad nauseam the history and backstory of the Prides and cat behaviour (which leads me to think Vincent doesn't know much about cats); trying to build up some kind of sexual tension between her and Marc; explaining Marc's past; shouting at people and interrupting intelligent conversations with inane, narrow-sighted and petulant comments; and resenting her mother. Later it tries to be hard and gritty but is just stupid - and still predictable.Strike #5: how many stereotypes can I perpetuate? From the scarily obvious use of South America to explain away the Bad Guys (with obligatory traitors-in-their-midst so it doesn't look too much like racial (and political) profiling), to the Grown Men acting like fourteen-year-olds - how many brand names can we fit into Faythe's description of their abode, where they eat pizza, drink beer and play video games - and never clean up, of course, 'cause that's just not manly - except WAIT! They really can clean, when it's part of their job. This is me, rolling my eyes. Not to mention her mother, who's comical in her obviousness. Vincent doesn't even try to make that one remotely believable. This entire book is like a walking American cliché, and not the kind that I think needs any more books written about. You're Texan (or whatever), you drive Big Cars and Drink Beer and are Family Orientated and Don't Like Foreigners - I get it.Strike #6: Why are they so white? Following logically from Faythe's explanation of where the werecats came from - that they arrived in North America long before the natives did - why are they white? Especially considering they turn into black panthers. Oh yes, I know, anyone can be \"infected\" and become a Stray, like Marc who's Mexican (just to prove that they do like foreigners - ha!), but the Pride cats are the \"real\" ones - there's a great deal of classism going on here - and they're all very white. The explanation doesn't really make sense, and the whole were-cat premise seems more like an excuse for the characters to have obsessive and violent behaviour. Lots of hormones running rampant, lots of beating each other up and punching holes in walls when they throw wobblies. Animals = primitive behaviour. I'm sorry, but animals behave with more reason and logic than this - there're reasons behind their behaviour, even instinctual behaviour. Have more respect for our fellow animals, please! This is more like stereotypical red-neck behaviour as far as I can tell.Strike #7: the writing. I've read worse, believe me. One thing in particular made me grimace here: Vincent's habit of turning what's meant to be a strong, decisive or poignant scene into a deflated balloon. Her descriptions and narrative are belaboured and clumsy. This kind of thing:A hand settled on my shoulder, heavy and warm. I looked up, fighting back tears. Marc stood in front of me, with a plate in his other hand and concern in his eyes where there had been only anger moments earlier.Embarrassed by my near collapse and still furious with Marc, I slapped his hand away from my shoulder. The sound echoed throughout the room for much longer than I thought it should have. His eyes widened in shock as his arm dropped to hang at his side.\"Don't touch me,\" I whispered through clenched teeth, glaring at him. He had no right to try to comfort me after the stunt he'd pulled in the woods.Marc's cheeks flushed with humiliation as his expression hardened into anger.The others stared openly, their food apparently forgotten.My chair made a harsh scraping sound as I shoved it back from the table. All eyes were on me as I stood. I turned away from them, letting my hair fall to shield my face. The only thing worse than having the guys witness my little breakdown would be having to accept their comfort. I didn't want comfort, I wanted solitude. I had to get away from them all, but especially from Marc. \"Excuse me, guys,\" I mumbled. \"I've lost my appetite.\" (pp127-8)Way to make a scene lose steam! Aside from losing patience with Faythe, as usual, I felt like I was being sucked into a bog, reading this. Time ... suddenly ... moved ... very ... slowly ... and ... no ... detail ... was ... forgotten ... Sometimes there isn't enough detail in genre fiction, and you never feel like you've got a grasp of the world or characters. Here there was too much, and none of it useful. I still didn't feel like it was giving me a connection to the world or the characters. It was a struggle to get through. I really felt like I was wading through mud that tried to hold me back.If I haven't got across the many flaws of this book and how much I despised it - yes, despised it; I came close many time to throwing it at the wall in disgust - let me just recap: this book is terrible. From what I understand, the series - and Faythe - doesn't improve. If you like soap operas, yeah you'll probably like this. If you've never read Kelley Armstrong (she who rules the Otherworld), you might find this to be original *cough cough*. But I don't know how you could ever, ever, get past how incredibly obnoxious Faythe is, how awfully tiring she is. She warrants numerous italics. And a kick up the bum. What a horrible person. What a stupid idiot! I can't get over it.This is not a series I shall be continuing."}, {"userName": "Cyna", "userReviewDate": "Aug 18, 2010", "userURL": "http://www.goodreads.com/user/show/4171731-cyna", "userReview": "I’ve had Stray on my shelf for like half a goddamn decade waiting to be read, but I still knew almost nothing about the series going in except that it had pretty covers, and was apparently popular enough to spawn like a bajillion sequels. Now, having given up exactly 163 pages in to the first book, I can’t help but wonder why NOBODY HAS EVER WARNED ME ABOUT HOW FUCK-OFF AWFUL THIS SERIES IS.SERIOUSLY. HOW IS THIS BOOK NOT, LIKE, SAVE THE PEARLS-ESQUE INFAMOUS? This is some of the most racist-ass worldbuilding I’ve ever read!I mean, okay, I didn’t think it was going to be great going in, cuz jfc look at that blurb, right? It’s like that one shitty Mercy Thompson plot thread turned into a series. And it doesn’t help that the book kicks off with your standard late urban fantasy misogyny, like the Exceptional Female Protagonist who looks down on all things feminine/any other women who’re into that, and exerts her Keille Independence by just hitting all the people and things that make her angry, because that’s what Strong Female Characters do, I guess.But I mean, it’s late ’00s werewolf crap, misogyny is basically a requirement. It’s obnoxious, but not much of a surprise. Although, I have seen this series being touted as ‘feminist’, and like, uhhhh no?Ostensibly, Stray is ‘feminist’ because our lead, Faythe, lives and rebels against the most laughable and cartoonish of all werewolf – I mean wearcat – patriarchies, in which female werecats – called, I shit you not, fucking tabbies – are not only SUPER RARE, but also VITAL to the stability of werecat society…in that the men they choose as mates are the ones who become the Alphas and lead the Prides, make all the decisions, uphold the werecat Masquerade, etc, etc.So you know, they’re a PRECIOUS COMMODITY, MAN, and tradition has kept them home, barefoot and pregnant, under the guise of keeping them safe from all those dirty “strays”, or Pride-less werecats who lurk in cities, looking for women-cats to rape.Man, I thought I knew Cartoonishly Extreme World Rules Set Up to Make Bare-Minimum Female Agency Seem Revolutionary, but I did not truly know that thing I just said until I knew Stray.Anyway, naturally our protagonist Faythe – presumably pronounced “faith” and not rhymes-with-lathe – doesn’t want to deal with any of that shit. She, quite understandably, wants to live her own life and do her own thing and not spend all day every day locked away on a ranch, so she talks her father into letting her go to college, and then grad school, where she’s getting along fine until the plot sucks her back into Werecat Shenanigans.So here’s the thing: the premise is utterly stacked in Faith’s favor, in terms of reader sympathy. Her father, her love interests, her society, they are all just hands-down, balls-to-the-wall awful. They ignore her will and deny her agency, up to and including literally locking her up “for her own protection”, and it should be the easiest thing in the world for the book to make us sympathize with Faythe and want her to triumph.The problem is that Faythe is just literally the worst. The worst. Faythe is snotty and obnoxious, but she also gets hella gaslit by the people around her, especially her Obviously Endgame Love Interest/Alphadouche Sexual Assaulter Marc, so it just becomes this running contest of Who Do I Want to Die Least This Paragraph.Anyway, feminism, right. It’s not like there isn’t potential – I mean, obviously, the world is literally set-up for it – but as executed, Stray has got the most Zach-Snyder’s-Suckerpunch-level misunderstanding of ‘feminism’. I mean for Jesus fucking Christs’ sake, you can’t exalt one kind of womanhood while you actively shit on all the others and call it “FEMINIST!!!”. This is BASIC SHIT, come on, people. And you ESPECIALLY can’t do that when that womanhood is being exalted specifically because it spurns all things ‘girly’ and classifies anything even remotely useful as ‘masculine’ things that men do, not girls, just men and one woman who is Not Like Other Them Other Women.Fuck OffffffffffExceptional Women, and female protagonists who insist they’re ‘just one of the guys’ – that shit isn’t feminist. It’s just internalized misogyny masquerading as empowerment.And that’s ignoring the queer erasure built into the women-legitimize-Alphas system (never mentioned: even the possibility of lesbian werecats), and OH YEAH DID I MENTION THE RACISM?So I thought it was weird when Faythe’s first-chapter attacker spoke to her exclusively in Spanish. And I thought it was gross when it was revealed that Obvious Endgame Love Interest Marc’s mother had been attacked, raped, and killed by a Hispanic werecat. But I thought, no way, that couldn’t possibly be, like, an intentional thing.And then I read this:Marc shook his head. “Danny knows all the other south-central Pride cats, if not by name, then by scent. He said this one had a foreign smell to him. Central, or maybe South American.” His eyes held mine captive, waiting for his meaning to sink in.My heart leapt from fear bordering on terror, as I thought of the stray on campus. He’s a jungle cat. And he’s collecting tabbies, but killing humans.South American cats were an entirely different kind of animal. They formed no councils, acknowledged no political borders, and suffered no negotiations. With the Amazon rain forest at their disposal, the Prides in most of the southern hemisphere indulged their feline instinct at the expense of their humanity, meaning they lived more like actual jungle cats than like people, as if over the past few hundred years, the world had moved on without them. Their territorial boundaries were in a constant state of flux, swelling and shrinking with the slaughter of each Alpha and the rise of his successor.The only rules jungle cats submitted to were the laws of nature, namely that you claim only that which you can defend. They fought to the death on a regular basis for the two things that mattered most to them: the right to control a territory and the right to sire another generation of savage monsters. It was a violent and chaotic existence, defined by a lack of stability and a short life expectancy.Jungle cats were my secret fear, my version of the bogeyman in the closet. But unlike the bogeyman, they were very, very real.There are no words for the fuckery that that excerpt contains, but a few thoughts:– I love how thinly, but carefully coded that exposition is. “South American”, grouping by continent rather than nationality, race, or skin color. South American vs. North American, because it’s just a matter of continent, you know, definitely nothing to do with skin color or race. LOOK WE HAVE A BROWN MAN IN OUR PRIDE, HE’S EVEN THE LOVE INTEREST! WE ARE DEFINITELY NOT RACIST YOU GUYS.– Look at how on the nose those descriptions are. Lathe is describing an entire content of people as animalistic, uncivilized, “savage monsters”, inherently less than their North American (white) counterparts. Those are shitty racist stereotypes used for hundreds of years to justify discrimination and actual real-world violence against people of color, and this series makes it CANON WORLD LORE.– Like I can’t emphasize that enough, this is CANON WORLD LORE. In this world it is CANON that all South American werecats are “savage monsters”. That was a creative decision that somebody made, writing this book. And then somebody edited this book, and thought “Ah, cool, South American werecat rapists, sweet, looks like the only thing we need to change on this page is that misspelt word!” And then somebody published this book, in which all South American werecats are uncivilized jungle rapists. And then the series ran for FIVE MORE BOOKS, and apparently nobody gave two shits that this was a world in which all South American werecats are “savage monster” bogeyman rapists, because when I Googled “Stray Rachel Vincent “racist”” LITERALLY ALL I GOT WAS THE ONE STATUS UPDATE THAT I WROTE LIKE A WEEK AGO. WHAT THE FUCK? THIS BOOK HAS BEEN OUT FOR NINE YEARS, WHY HAS NOBODY TALKING ABOUT THIS???– But hey, look at u, Shifters series, calling up that centuries-old “savage brown men gonna rape our pure white women” white paranoia to propel the plot in the very first book. I appreciate up-front racism, because at least this means that I don’t have to suffer through even one of pieces of shit before I get some SURPRISE! BROWN TERROR. Thank you, Stray, for wearing your shitty racism on your sleeve.Kill it with fucking fire.I was ready to DNF even before I hit the racism part, because it’s all just so fucking trite, you know? The rebel princess, the Alphadouche love interests (plural), the murder-of-the-week plot, the werewolf crap (search-and-replace “wolf” with “cat” and you have literally any other werewolf UF book), the pack politics, even the internalized misogyny is so goddamn been-there-done-that. There was no reason to keep going. I’ve read this book before, you’ve read my review of this book before, why draw it out, you know?But after reading that? Not only am I done, I am fucking done. I don’t need this. You don’t need this. Literally nobody needs this. Fuck this series, fuck this book, it’s going in the garbage where it belongs. For more reviews like this, check out You're Killing.Us"}, {"userName": "Misty", "userReviewDate": "Feb 03, 2011", "userURL": "http://www.goodreads.com/user/show/1124284-misty", "userReview": "Honestly, I was disappointed in this one.  First of all, it's SO EFFING LONG.  It doesn't look like it because the pages are super thin (damn you, marketing ploys! *shakes fist*), but it tops 600 pages.  Very few authors can sustain a book that long well enough to keep me fully invested.  In fact, only 1 comes readily to mind, where I didn't feel anything should have been cut, it was perfect as it was.  Stray needed some serious trimming with a sharp pair of editing shears.  For real.  There was so much info-dumping through out, and a lot of it only marginally expanded on ground that had already been covered.I also didn't feel like there was anything in the story or world-building that I couldn't have gotten elsewhere. Hell, I didn't even find the characters all that likeable.  A lot of PNR/UF runs the risk of falling into cliche territory, and sometimes flat-out biting other storylines, but there's got to be some twist or redeeming quality that makes me want to read this over that -- what does one offer that another doesn't, that makes me need to read it?  I never really got that extra something from this, even though I help on for 620+ pages.  I have an inkling there may be something coming that will interest me, but do I want to slog through 5 more books to get it? In the (small) plus column, I thought the story picked up when Faythe* went home to the ranch and was thrust back into the paranormal element she'd been trying to escape** and when the ball finally got rolling and the Big Bad came in, I liked it.  But it was a long, sometimes torturous road getting there, and I almost set the book down many times along the way.  I think I could eventually like the series, and may read more if someone assures me Rachel Vincent learns to cut the dreck and get to the goddamn point, but until then, I'm shelving them.* I'm not even going to address the ridiculous name-spelling.** sound familiar?"}, {"userName": "Pam Nelson", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/15402332-pam-nelson", "userReview": "4 Stray Stars This was a reread, I only read the first book before and its had been so long that it felt like the first time. I really enjoyed this shifter book. I am used to wolves and what not being the main kind of shifter's so when reading about cat shifter I was pretty intrigued. Faythe, has some back bone boy I tell you. I love that she is a strong female from the get go. She has a few males interested in her Mark her first, is now back in the picture. But also Jase. I like em both. A lot of action in this book keeps the story going.And this book was so engaging I wanted more. Glad I am on to book 2! *You don't have to like my review but its 100% my opinion, and I am allowed to have it.*"}, {"userName": "FlibBityFLooB", "userReviewDate": "Aug 03, 2009", "userURL": "http://www.goodreads.com/user/show/2505272-flibbityfloob", "userReview": "Re-read in 2010: Still loved the book. If anything, re-reading made me like the character of Jace even more...---I stayed up all night reading this book. It got to be too exciting and I had to know how the main character would get out of the situation she was in.I will say that I liked the secondary love interest better than the main one. I don't know if the next book in the series features the same characters, but if it does, I will cheer him on. Go Jace!"}, {"userName": "Ezinwanyi", "userReviewDate": "Aug 25, 2011", "userURL": "http://www.goodreads.com/user/show/4386752-ezinwanyi", "userReview": "liked this one. Faythe is a cat shifter wanting some autonomy from her pride. She tries to live among humans until a crisis forces her home. Faythe has to deal with who she is, who she wants to be and who she can be in the future. A good book 1 so I went ahead and bought book 2."}, {"userName": "Leah", "userReviewDate": "Feb 27, 2010", "userURL": "http://www.goodreads.com/user/show/3050338-leah", "userReview": "Stray is the first book in Rachel Vincent's Shifters series. It is about a werecat named Faythe Sanders and her struggle to accept life in the Pride. She wants nothing more than to escape and have her freedom, from her father, from her \"responsibilities\" to the Pride, from Marc. However, when one of her fellow tabbies, Sara, is kidnapped, one of her father's enforcers come to college and take her home. When she gets there, she is faced with all the things she wanted to leave behind. After a few days, her cousin Abby, another tabby, is kidnapped, and the council congregates at Faythe's house to work out how to deal with the issue. Sara is found, naked, propped up against a tree behind her house for her brothers to find after being beaten, raped, and murdered by her captors. After a night of drunkenness and having sex with Marc, Fathye goes out to the barn \"to think\" and ends up getting kidnapped herself. She is drugged and then dumped in a cage in a house in Mississippi. She stops Abby from getting raped, fights Miguel, chats with her brother who happens to be one of the captors, and eventually kills Eric and escapes. After getting out of her cage, she traps Ryan in her empty cage and searches for the key to Sara's cage, while talking to her father about what's doing. Her father sends Parker, Marc, Ethan, Owen, and Lucas to go get Faythe and Abby, making Jace stay at home since Marc beat him badly, and then talks to Ryan, working out a small deal with him. After the guys come to get them, Parker, Marc, Ethan, Lucas, and Faythe fly to where the next girl about to be captured lives and meets up with Sara's brothers, Vic and Anthony. They go and set up a trap for Miguel and Sean. However, Faythe falls into Miguel's trap and almost gets taken again. In the end, Faythe frees herself, Marc and Ethan kill Miguel, and Faythe ends up with Marc, much to my chagrin (I love Jace).Overall, I liked Faythe. She was a good, strong female character. I understood her need for independence, but I did not understand her reckless need for independence. She wanted to leave the ranch at a time when it was extremely dangerous for her to, and it was proven that she would not have been able to take care of herself by the fact that she was kidnapped. I liked that she eventually accepted that she liked being back at the ranch and starts working for her father. I, however, did not like that she led Jace on and then hurt him by sleeping with Marc, and when Marc threw him into the wall, she did nothing to help Jace, not that it would have done much but she should have tried to help him.I'm not sure how much I like or dislike Marc. To a certain extent, I like him and appreciate his loyalty to Faythe and her father. However, I did not like that he often seemed to use his power as second-in-command to boss around the other guys and hurt Jace. He really needs to get his jealousy and anger under control and stop hurting poor Jace. I did not like that Marc gets his way in the end with Faythe choosing him.Jace, however, I completely love. Some of it, I know, is because he's the \"underdog\" and her family doesn't approve of him as Faythe's mate, but he's funny, gorgeous, smart, and loyal. I loved that he was able to get that steamy kiss in with Faythe (that was one of my favorite parts), but I hated that Marc came in and ruined the moment and threw Jace into the wall. I teared up when Ryan told Faythe about how badly Marc had hurt Jace because he thought Jace had given her the keys to his car so she could leave. I wanted to cry at the end when Faythe told Marc she loved him and Jace was the one who heard, the witness. Also, I loved Jace's sensual greeting to Faythe when she first got back to the ranch.In the case of Miguel's death, I was rather unhappy. I mean, don't get me wrong, I'm glad the bastard is dead, but I didn't like that Ethan and Marc were the ones who got to kill him. While it's true that he beat on Faythe and tried to rape her and Marc and Ethan were avenging her, I feel that Vic and Lucas should have been the ones allowed to kill Miguel. Their sisters were the ones who were raped and abused, and in Sara's case, murdered.In the beginning of the novel, I think there were some parts that had way too much description and not enough dialogue, but I quickly got over that as I moved through the novel. There was a conspicuous lack of sex in Stray, the only sex scene being between Marc and Faythe with a small sexual encounter with Faythe and Jace."}, {"userName": "Sarah", "userReviewDate": "Jul 29, 2015", "userURL": "http://www.goodreads.com/user/show/3344685-sarah", "userReview": "1st Read - February 20102nd Read - July 2015Original ReviewStray is a fantastic start to the Shifters series & I'm really looking forward to reading the rest of the books. Faythe is one of only 8 unmarried female werecats in America which makes her a very important member of her Pride. Her family are very keen to see her settled & married so she can start producing the next generation of werecats but this is the last thing Faythe wants to do. She is very independent and determined to have a life of her own outside the Pride. For the last 5 years she has been at college but when she is attacked by a stray this gives her over-protective family the perfect excuse to bring her home.Faythe is a brilliant character - she is smart & tough but she has plenty of flaws too. She can come across as selfish but it is easy to understand the motivation behind her actions. The fact that she isn't perfect makes her easier to relate to and made her feel more real to me. Back at home Faythe discovers she isn't the only one who has been attacked - 2 of her fellow tabbies are missing and she is determined to find out what has happened to them. Her family are equally determined to keep her safe and she is practically under house arrest, under 24 hour supervision from her brothers and her ex-boyfriend Marc. I absolutely loved Marc - he is madly in love with Faythe and wants her back. He has an incredible jealous streak but apart from that is he is pretty much my ideal man!Feeling stifled by her family & Marc, Faythe tries to find room to breathe but ends up putting herself in danger. It is going to take all her strength and cunning if she is going to save herself and her fellow tabbies. Once the main action started I couldn't put this book down although there were times when I was almost frightened to read what was going to happen next - it was like watching a horror film where you can only watch by peeking over the top of a cushion! I think I went through every emotion possible when reading this - a sure sign of a good book. I'll definitely be going back for more of this series._____________________2nd ReadI fell in love with this series 5 years ago and it's still one of my favourites. I'd forgotten how pig headed and stubborn Faythe can be but I find that surprisingly easy to ignore - I guess I can forgive anything from characters I have such fond memories of."}, {"userName": "I ♥ Bookie Nookie (bookienookiereviews.blogspot.com)", "userReviewDate": "Oct 21, 2009", "userURL": "http://www.goodreads.com/user/show/1488662-i-bookie-nookie-bookienookiereviews-blogspot-com", "userReview": "I really liked this book. I was a little nervous about reading it because it is so long and I have seen such mixed reviews about the series. Well, let me put it to you this way--it is 600+ pages and I read it in 2 nights. Faythe is the daughter of an Alpha who is also the lead Alpha for all the US werecat territories. She is also one of only 8 unmated tabbies or females in the US. Of course, she is very valuable as there are probably hundreds of unmated males to their one. Faythe has 2 potential love interests, Jace and Marc--I am torn between the 2 they are both so likable. Based on the Alpha's opinion, I am pretty sure I know which one she will end up with in the end. Then again, she isn't really one to follow...She is very independent--in fact, she has been away from the pride for 5 years attending college like any normal 20 something. Single tabbies are being kidnapped and her father forces her to come home for her safety. Being the feisty little wildcat that is her nature, she is determined to make her own decisions and run away. Wouldn't you know it! There is a little hitch in her plan and as the story unfolds, it is almost impossible to put it down.I am looking forward to the next in the series. I thought this book had a great mix of action and pretty good amount of romance. As with most strong female protags, she can be a major pain in the arse because she is so intent on being \"independent\" (as her father pays her tuition, living expenses and phantom-like bodyguards 24-7) . It is like it is Faythe against the world even when she know in her mind it is not the best thing for her well being.All in all a great read.✳✳ Reviewed on I ♥ Bookie Nookie Reviews___________________________________________________If you like this type of book, you might enjoy one of these groups. Check us out!Menage ReadersErotic EnchantsBookie Nookie's Erotic Lending Group"}, {"userName": "Erin ☕ *Proud Book Hoarder*", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/3048260-erin-proud-book-hoarder", "userReview": "3.5When I dig into Urban Fantasy, I prefer shapeshifters to be part of the background, blending in, doing their thing to propel the plot while other supes shine as the star players. I rarely invest in series which focus on shapeshifters as the mains – just not my thing (although Kate Daniels has proven to be a nice exception). This book is pure shapeshifter material – instead of werewolves, you have werepanthers, and there’s no other supe in sight. Still, the back blurb promised an entertaining story that seemed right up my alley – a woman as the protagonist, prized because she’s rare, forced home to a pack she’s trying to escape because of danger tearing through her newly established safety net.The shapeshifter world in the Rachel Vincent novels are woven creatively enough; society has no idea the creatures exist behind the human faces and swift justice is delivered to those who dare risk the species unmasking. There are divided territories led by one alpha male, who is part of a family unit. Werepanthers are usually born, almost always through the alpha pair since females are so rarely made.At the timing of the story, there are six tabbies total in population of the civilized surrounding societies. A rogue is on the loose killing kidnapping and killing the valuable females. Faythe is forced home not to just to stop her from becoming another casualty, but to help the pack track down the culprit.There’s a lot working in the favor for the first novel of the series. Rachel Vincent’s writing style is enjoyable to devour – her writing has humor when it’s needed but gives proper respect to serious moments and solemn tragedy. It’s dark, it’s gritty, it’s intriguing. The ending is an especially fierce one because the story doesn’t shy away from brutality. I didn’t enjoy hunting scenes much – again, not a shapeshifter fan, but I do like how werepanthers are portrayed. The family bond is strong and I loved the parents and brothers. Having two strays in the house with their own backgrounds made interesting reading. Of course there is to be a love interest she left behind – could you expect different? – and Marc is worthy as a lead. He’s alpha, yummy, although a little too serious sometimes. I especially liked her mother and father and their different outlooks in shaping everything.Faythe…well, not as likeable. She’s courageous, sarcastic, and comfortable in her own skin, but she’s also overly abrasive, bitchy, and smug. I really, really hate smug. That is one of the biggest pet peeves I have for real life folks, and this pet peeve bleeds into books to include paper people. That smugness is a turn-off, and I still think she went too far with the foot bite. I mean, ouch? Sure, get irritated, but being smug about it later and still not remorseful? Dialogue is well written in general, but I don’t like her outlook not her lines. Nope, not liking her.Even if her personality didn’t fit what I like reading, the story was intriguing, with side characters fun enough to make the story work. A large plot obstacle that opens the first book is already resolved at the end of it, which surprises me as I thought it would continue to be an issue longer. For a first novel to open the series, it’s relatively large in length, but action keeps up enough to make it readable. There IS of course emotional downtime and mental exploration, but the author thankfully avoids making it angst-filled. Oh, and the covers for all books in the series are spiffy. They have an urban, grunge appeal."}, {"userName": "Sarah", "userReviewDate": "Jul 10, 2014", "userURL": "http://www.goodreads.com/user/show/7591340-sarah", "userReview": "I think this is the fourth time I’ve read this book and I still love it. I love Faythe, I love Marc, and I also love Jace! Faythe does have her moments when she really shouldn’t be arguing or negotiating and thinking instead, but she’s still such a great character.The storyline in this is really good! It can be a little slow in places, but most of the time there’s action and sexual tension. So good!"}, {"userName": "Natasha", "userReviewDate": "Jul 19, 2009", "userURL": "http://www.goodreads.com/user/show/2496802-natasha", "userReview": "Stray is the first installment in the Shifters series by Rachel Vincent.Stray is an urban fantasy/shape-shifter romance, which are two of my favorite genres. It’s told in the first person. With a first person narrative that is wonderfully written and make us really feel for the characters. Vincent's debut is fast paced and highly addictive. Faythe is you typical graduate student in many ways, except one...she's a werecat. Faythe is a kick-ass heroine. Her father(the Alpha of the Southwest territory) taught her how to fight when she was a child and being one of so few female were-cats, she is used to being surrounded by too much testosterone from tomcats, so knowing the ropes helps. But that doesn't put her down, she can handle them and she can keep her own. Fathye is trying to grow up and be in control of her own life, but even though she has been away from home for five years at university, she is never left to total freedom. Greg(The alpha male and her father) has constant watch on Faythe to protect her, but Faythe feels she doesn't need any protection, and has proved that a time or two. But now she must return. Someone is hunting tabbies and someone close to her was taken. And not all reunions are a blessing with Faythe's history. There's lots of tension along with her loving welcome and she finally realizes she has to deal with her past and not hide from it. With everything that's happening with Faythe you'd think she'd have her plate full, but the men in her life don't make it that easy for her. Faythe is stuck with life alternating decisions and finds herself in the wrong place at the wrong time..now everything else is the least of her problems when she's kidnapped by the same ones who kidnapped her cousin and now she might have finally found something she cannot kick her way out of.  If your a fan of Paranormal romance/Urban fantasy and lots of action, this is the book for you. I enjoyed every bit of it and found myself sitting on the edge of my seat most the time. I love Vincent's writing and how she adds twists and secrets that end up with a bang! I don't know why I took so long to read this series, but I'm really glad I finally started! I'm off to read Rogue(book 2 in the Shifters series). :)"}], "description": "I look like an all-American grad student. But I am a werecat, a shape-shifter, and I live in two worlds.Despite reservations from my family and my Pride, I escaped the pressure to continue my species and carved out a normal life for myself. Until the night a Stray attacked.I'd been warned about Strays--werecats without a Pride--constantly on the lookout for someone like me: attractive, female and fertile. I fought him off, but then learned two of my fellow tabbies had disappeared.This brush with danger was all my Pride needed to summon me back...for my own protection. Yeah, right. But I'm no meek kitty. I'll take on whatever--and whoever--I have to in order to find my friends. Watch out, Strays--'cause I got claws, and I'm not afraid to use them....", "title": "Stray\n      \n          (Shifters #1)", "url": "https://www.goodreads.com/book/show/7996881-stray", "average": 3.79, "cover": "https://images.gr-assets.com/books/1270750670l/7996881.jpg", "reviews": 1951, "authors": [{"url": "https://www.goodreads.com/author/show/415967.Rachel_Vincent", "name": "Rachel Vincent"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/7996881-stray", "http://www.goodreads.com/book/show/793399.Stray", "http://www.goodreads.com/book/show/6536175-stray", "http://www.goodreads.com/book/show/8141064-stray", "http://www.goodreads.com/book/show/6315602-my-soul-to-take", "http://www.goodreads.com/book/show/6763961-my-soul-to-save", "http://www.goodreads.com/book/show/7476122-my-soul-to-keep", "http://www.goodreads.com/book/show/4583888-pride", "http://www.goodreads.com/book/show/2314315.Rogue", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}