{"ratings": 38608, "userreviews": [{"userName": "Dirk Grobbelaar", "userReviewDate": "Jan 23, 2013", "userURL": "http://www.goodreads.com/user/show/3102740-dirk-grobbelaar", "userReview": "\"We may be teetering on the brink of a whole new world. Are you ready for it?\"This review is complicated for me. Dean Koontz’s Strangers is an amalgamation of many things: techno-thriller; psychological horror; science fiction. It’s quite unlike DK’s other 1980s novels. The book does contain some pretty creepy scenes, but the terror generated here is vested in the not knowing; the “something terrible happened to me but I don’t know what” scenario. Strangers is a longish book, at 700-or-so pages, and the great many characters lend it an epic sweep, while the story reminds more than a little of something Spielberg might have come up with. Of course, any story that revolves around a motel in the middle of nowhere is always going to appeal to me.But is it scary?And in the morning, he virtually exploded out of sleep with a shrill scream and found himself in total, claustrophobic darkness. Something had hold of him, something cold and clammy and strange and alive.Koontz manages to wring some very real chills from his story, but this isn’t a full-blooded Horror novel. It’s ominous and sinister at times, but it never crosses into the realm of the macabre. I’m not mentioning this as criticism, but if you’re purely looking for a Koontz Horror fix you may want to explore something like Phantoms or Midnight instead. The horror element in this novel runs out of steam once most of the mysteries are solved. On the other hand, if you’re looking for a good story that just happens to contain some chilling elements and a dash of the paranormal, then Strangers is the book for you.I will say this, though: there is a depiction of a medical procedure that literally had me squirming.The less you know about the premise of Strangers, the better. The novel is 90% build-up and 10% reveal, so you really don’t want to know too much beforehand. It is a (fairly cinematic) novel about obsession, the fear of the unknown and the search for answers, but it is also a novel about the value of friendship and one which brims with a sense of wonder.“What frightens you so?\"\"I don't know. Something in my nightmares.\""}, {"userName": "Paul O'Neill", "userReviewDate": "Feb 14, 2013", "userURL": "http://www.goodreads.com/user/show/17331573-paul-o-neill", "userReview": "Changing my rating on this since I remember that it was just awful! And that Koontz' writing is dire. I found that I enjoyed this in the same way that you enjoy a terrible film. It is entertaining because it is so bad. That being said I might pick up a Koontz book again just for the lolz."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Apr 21, 2013", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Picture me beating my head against a wall...or a table....or a desk, or something. Dean Koontz can write a good book, he's written several that rate among my favorites. This isn't one.To be fair different books by DK rate high and low with different people. I've read that this was his first best seller. Cool. I see that there are a lot of people who love it and for them I'm happy. Really.For me this book was too long for the story it told. The disparate characters of the story each struggling with and/or suffering from their different \"situations\" was a good idea, but he dragged (drug?) it out too long. FAR TOO LONG. I was so sick of the individual stories bouncing around and seemingly getting no where meaningful chapter after chapter I was just burned out. By the time I got to the climax I just didn't care any more.I mentioned elsewhere that when I lay a book aside and find myself looking for something to watch amid the drek on TV instead of getting back to the novel it may be time to lay the book aside completely. I was getting there. I did skip forward a few times.So if you like this, good for you. I would suggest that DK fans look for themselves as we all tend to disagree about his best works. For me I find this book to have a vastly too long \"fore-section\" that took way too long setting up the story. When it got there the climax was hokey and disappointing (to me anyway). I can't really recommend this one highly, but it's...okay."}, {"userName": "Maciek", "userReviewDate": "Apr 14, 2010", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "Strangers (1986)\"Strangers\" is not your typical Koontz book. It was his first hardcover bestseller and the first book he wrote without resorting to outlines.Plus it bears a glowing endorsment from Stephen King, who states that it's \"The best novel he has written!\".The novel is concerned with a group of strangers from all over the USA - a surgeon, a writer, a motel-keeper, a priest and a thief - who are troubled by different phobias - nyctophobia, somnambulism, anxiety. They have nothing in common - except for one hot summer night at the Tranquility Motel.Strangers is a skilfully woven tale, though it has its flaws. Koontz characters only seem to have nothing in common - they all suffer from Koontz's \"trademark\" black and white personality disorder. The good guys are ideal; the writer is the author of touching bestsellers, the doctor is devoted to her task of saving lives, and the thief is basically a modern version of Robin Hood. The novel captures the attention of the reader and keeps him involved in the first two parts, but it looses the steam in part three. His simple minded moralising and heavy preaching about the importance of values such as love and friendship is annoying. The final action sequences, as always with Koontz, are cop-outs and hard to accept by a serious reader, but since this is no serious fiction I guess this can be overlooked.The ending in itself is very poignant and moving, if only he could keep his standard blabbering to minimum...Overall, the main issue with \"Strangers\" is that it could have been so much more. The topic tackled by Koontz is extremely interesting, and with a good editor it could have been executed much better - but I still liked it very much, mainly because it's better than all the garbage he's been putting out recently and it created vivid images in my head. The moon !"}, {"userName": "Tressa ", "userReviewDate": "Sep 21, 2009", "userURL": "http://www.goodreads.com/user/show/226335-tressa", "userReview": "I picked up a bag full of old Koontz books, and this is the one I chose to read first. I'm glad I did. Although it's a dense book, it was worth the wait slowly getting to know the characters and having their fears revealed little by little, one by one. When the strangers convene once again at the Tranquility Inn to get to the bottom of what happened one July night a year before and end their nightmares, the tension and fear of what they saw and heard from the skies is palpable. The ending is just beautiful and very poignant and I kept wishing that I could have been one of the lucky few to witness the event."}, {"userName": "C. Lorion", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/1089945-c-lorion", "userReview": "I read Strangers years ago, and it's probably about time for a reread. For me, it's that good, my second favorite Koontz book behind Watchers which was written in 1987, the year after Strangers was published.Dominick Corvaisis, authorGinger Weiss, surgeonErnie Block, U.S.M.C. (ret.), and his wife, Faye BlockBrendan Cronin, priest and curateJack Twist, former Army Ranger and P.O.W., professional thiefJorja Monatella, formerly Rykoff, Las Vegas casino cocktail waitressSix people, six...wait for it...Strangers!, each afflicted by different and...wait for it...strange! maladies, each unable to figure out on his/her own what is causing the somnambulism, fugue states, nyctophobia, loss of faith, among other...yeah, here it is again...strange happenings. Strangeness all around. And just in time for Halloween! Strangers is a doorstopper of a book, the paperback version hefting 681 pages of ink. And that's just fine with me. If an author does it correctly, the longer the book the better. Koontz does it correctly here. What I love about this story is that it pulled me into each character's life, peeling away layer after layer, exposing the hopes and fears and anxieties of the characters, but it's not just their hopes and fears and anxieties, it's also ours. We all have those hidden parts of our lives that we dare not let anyone else discover. No, no. We keep those areas in the back corners of our hearts, not daring to expose our weaknesses and worries. Not daring to become vulnerable, never quite understanding that we're already vulnerable, no matter how much we may fight against that. All of us are vulnerable. It's when these six characters come to terms with what their suffering, admit their vulnerability, and rely on each other for help, comfort, and strength, where the story really takes off. Again, we all need the help offered by others at times, the comfort of family, and the strength that comes from the numerous friends we all have. I loved watching this band of strangers come together, find strength in each other, press forward to discover the common secret they all share (even though they don't at first know what that secret it) and confront their common enemy. And when they find out that their common enemy is a lot closer than any of them imagined...well, enough said on that. If all you've read of Koontz is the stuff he's put out the past ten years, and you'd like to get a taste of what he used to write before he fell in love with golden retrievers and Odd Thomas and single-sentence paragraphs, check out Strangers. It just may be a breath of fresh air and spur you on to more of Koontz's earlier works. Next up in the review queue, I'll write about an Orson Scott Card novel that had me crying like a baby during the last ten pages. And no, it's not Ender's Game. You know, the man has written a bunch of other books beside the Ender series!"}, {"userName": "Wendi", "userReviewDate": "May 10, 2009", "userURL": "http://www.goodreads.com/user/show/844658-wendi", "userReview": "I used to love Koontz, when I was in junior high. What happened? Oh, I know, I grew up and realized that his characters are absolutely ridiculous. Dean Koontz, much like his mid-life crisis make over from bald mustached guy to full of head of hair and clean shaven face, is just one big old cliche. There, I said it. This book had promise. Again, I had read it years ago, but it didn't stick with me, so when I saw it at the used book store I had to pick it up again. I should have kept the three dollars and gone to the library. But I was all, \"It's Koontz! It's summer in Florida already, gotta get my summer horror reading on!\" Yeah, no. After reading some of the books I've been reading lately - see Bee Season, Bastard Out of Carolina - Koontz just doesn't live up to my tastes anymore. So I'm sad to say I'm just going to have to let him go. So what's so bad about Strangers? Oh, everything is hackneyed. The heroes and heroines are perfect. He doesn't come out and say they are perfect, but he might as well because they have absolutely no flaws or faults. None. Dom Corvaisis is a soon to be highly toted and celebrated fiction writer who's handsome, but not a lick of personality. Ginger Weiss - she's short and spunky and incredibly smart skipped grades in high school and graduated from medical school at the top of her class- workacholic. Even the supposed bad guy has a heart of gold and turns good guy at the end. It's just too much! Where's the internal struggle? Where's the meat?That's just it. There's really no meat to Koontz's books. All the characters are the same just in different situations. It's all so formulaic and I'm done with formulas unless it has to do with shopping (my mom sent me that Shopaholic book a couple of weeks ago)."}, {"userName": "Karen B.", "userReviewDate": "Mar 01, 2015", "userURL": "http://www.goodreads.com/user/show/5230033-karen-b", "userReview": "This was probably my fourth time reading this book and I have to say this is one example of Koontz at his best. Maybe it's because of my advancing years causing me to be forgetful, but I think it's Koontz magic that makes this book just as exciting as that first night in 1986 or 1987 when I stayed up much too late just to finish it. It bristled with excitement with each new piece of the puzzle trying to figure out what exactly happened to these strangers that links them together. I loved all of the main characters who were not necessarily perfect but good-hearted. At various times both the characters of Ginger's father Jacob, through her remembering what he'd taught her, and that of Father Wycazek bring home the message of the book and sum up its theme. I liked how this book differs from Koontz's more recent writings where everything happening is brought together by the end of the book. The questions left for me after this reading were now \"why did...?\" or \"how does ...?\" but more of a \"What If?\" It's also a very different book from the more recent dystopian fiction coming out lately. Dean Koontz at his finest."}, {"userName": "Cody | codysbookshelf", "userReviewDate": "Apr 02, 2018", "userURL": "http://www.goodreads.com/user/show/56352820-cody-codysbookshelf", "userReview": "A shockingly bad novel from Dean Koontz’s “classic” period, Strangers is a big, dumb, plodding creature overstuffed with banal characters and pointless storylines, all which converge to form a predictable, distinctly Koontzian ending. While Koontz’s novels that focus on a couple of characters are typically fun (albeit brainless) reading, with this the author bit off more than he could chew. Lifeless and insufferable, I could barely make it through what Stephen King once called Dean Koontz’s “finest novel.”"}, {"userName": "Melissa", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/9185509-melissa", "userReview": "I enjoyed this book. It had some suspenseful moments. I wish I could have given it more than 3 stars. However...It was long. Too long. There were many unnecessary characters and events which had absolutely no point except to add to the word count. And everything was described with such meticulous detail. Too much detail.I was disappointed with the ending. It could have been so much more. Thankfully everything wrapped up nicely, but all that momentum built up in the beginning of the novel came to a somewhat unsatisfying climax. I found myself saying \"REALLY???? That's it??\". Having said that, I did enjoy most of the characters. I loved Dom and his sleepwalking, Ginger and her fugues, and Jack. I was genuinely hooked at the start of the novel. Unfortunately not impressed enough to give it more than three stars at the end.I will defiantly give Koontz another try and look forward to reading more of his work."}, {"userName": "Hyejung", "userReviewDate": "Mar 10, 2007", "userURL": "http://www.goodreads.com/user/show/22610-hyejung", "userReview": "This is not one of his best books. It drew you in because you wanted to know what happened to the characters to connect them, but I thought the end was anti-climatic. The actual story of the event that occurred to the characters was sort of boring; an interesting concept, but not told in an interesting way. Even the characters, who were interesting throughout most of the story, seemed to become less so during the main \"action\" part. He's had better."}, {"userName": "Dustin Crazy little brown owl", "userReviewDate": "Mar 02, 2010", "userURL": "http://www.goodreads.com/user/show/2454496-dustin-crazy-little-brown-owl", "userReview": "Courage, love, friendship,compassion, and empathylift us above the simple beastsand define humanity. -The Book of Counted Sorrows"}, {"userName": "Jane Stewart", "userReviewDate": "Jul 23, 2012", "userURL": "http://www.goodreads.com/user/show/3789528-jane-stewart", "userReview": "Weak 3 stars. Neat characters and ideas, but I grew tired of too much “I can’t remember.”The first 80% or more is stories about a handful of unrelated people living in different parts of the U.S. Ginger is a Boston surgeon. Jack is a New York thief. Dom is a Los Angeles writer. Brendan is a Chicago priest. Ernie owns the Tranquility Motel in Nevada. Each story is broken into maybe eight pieces, and the reader is jumping around among the various stories. I am not a fan of jumping around, but I can see how it was necessary for this story. But I would have preferred less jumping. Some of the characters have recently begun having psychological problems. Ginger occasionally goes into a fugue, losing consciousness. Ernie fears the dark. Dom sleepwalks with troubling results.I felt the book was too long. I was soooo tired of hearing characters say “I can’t remember” or “I remember this, but I can’t remember any more” or “What is going on?” For most of the book pieces of someone’s memory come out, but never enough to provide answers. Finally at the end, we get the full story of what happened to these people. It was not a fun structure. It reminds me of other books where a psychic gets partial clues and never the whole story until the end. However most of these stories were interesting even though I did not like all the “I can’t remember”s. Characters were good. I loved Jack’s talents, skills, and actions. He made things happen. Ginger had strength, logic, and some good scenes. But most of her time was suffering and wonderingI also liked the ending even though I would have liked more details. I liked the idea of what the future was going to be like for these characters and others. It was thought provoking.NARRATOR:The narrator Dick Hill was very good. But he sounded weird doing a couple of the females.DATA:Narrative mode: 3rd person. Unabridged audiobook reading time: 29 hrs and 25 mins. Swearing language: strong but rarely used. Sexual content: none. Setting: current day various U.S. locations. Book copyright: 1986. Genre: sci-fi mystery suspense. Ending: happy for most of the main characters."}, {"userName": "Tracy", "userReviewDate": "Dec 17, 2011", "userURL": "http://www.goodreads.com/user/show/5044465-tracy", "userReview": "I have had this book on my TBR for fur years and really not sure why. Koontz is by far my favorite author and it takes me more than usual to read a Koontz book since I love to savor the words on the pages. I read this one in a little under two weeks and I love it.As usual, Koontz writes an appealing, unique plot about humanity. He brings together the most unlikely characters that bond in the most unlikely way. To say that this story is very thought provoking is a little mild because Koontz always provides us with the stories that probe at our minds and emotions.Koontz uses an extremely diverse cast of characters to tell this story.Jack- thiefJorja- waitressMarcie-Jorja's daughterBrendan- priestDon-autorGinger-surgeonErnie-ex-marine and hotel ownerFaye-Ernie's wifeNed-restaurant ownerSally-Ned's wifeParker-artistI loved each and every one of them."}, {"userName": "Jim C", "userReviewDate": "Apr 09, 2017", "userURL": "http://www.goodreads.com/user/show/10296231-jim-c", "userReview": "This is a book by Dean Koontz. Even though this author is known for his suspense thrillers, this novel is more like a mystery book with supernatural aspects. In this one, different people from different areas of the country are suffering meltdowns. Some are sleepwalking, others are afraid of the dark, and others are scared of the moon. All of these people have a shared experience.This book had a X-Files feel to it as the author gives us one piece of the puzzle at a time. I liked this change of book from this author as this author usually writes about good versus evil and the chase between them. This was a mystery book that the reader goes along for the ride as the characters discover each piece of the puzzle and they attempt to put all the pieces together. This novel does have a lot of set up but I was never bored with it. I was interested throughout as I was wondering where the mystery led to. And I would have never guessed the result even though it makes sense knowing this author as I am a fan. There is a large cast of characters in this book and the reader should be able to connect with some of them.For the majority of this novel this is not your typical Dean Koontz book. It really felt like a mystery book but it isn't your typical mystery book either. There wasn't a ton of action but I always wanted to read more because of the mystery and I was curious to find out what happened to this cast of characters. This is a lengthy book but a very enjoyable one."}, {"userName": "Bandit", "userReviewDate": "Nov 12, 2010", "userURL": "http://www.goodreads.com/user/show/4528663-bandit", "userReview": "In an effort to give Koontz one last try I opted for this one, since it was better reviewed in general than his other books. Even King said that this was Koontz's best, but then again maybe he has a low opinion of his other works. This exhausting massive door stopper consists of three parts, first two are the size of a novel each and the last one the size of a novella. All this reading basically amounted to a giant waste of time. Koontz is capable of creating a somewhat decent plot, but not the characters or a compelling narrative. In his black and white claustrophobically narrow world view he creates protagonist men who are manly and good and women who are lovely and maternal and an antagonist who is just irredeemably horrible. The good characters even pair up with each other just to make it all that much neater. The reader never has to worry about what's gonna happen, because in a Koontz book the good is unfailingly going to triumph. The moral, in this case the wrongness of xenophobia, is driven through with the power and subtlety of a freight locomotive. The main thing is that Koontz is just not an interesting writer, his writing like his characters is consistently flat and by the book. It's serviceable, but there are no nuances, no excitement, no life behind the words, no colors. This book is particularly tedious because of its overwhelming and completely unnecessary verbosity, it's as if the author is trying to overcompensate for lack of quality with quantity and pointlessly detailed digressions to show that he does in fact do some research. . There is a market for Koontz, hence his books keep popping up on bestseller lists, but he caters to the lower denominators, his books are equivalent of a fast food meal, which are always going to be popular and never going to be good. If you're interested in a story about strangers meeting up in a hotel for a mysterious reason, watch Identity. If you're interested in reading a scary or exciting story, read another book, by another author, there are so many good and great ones out there. This book was a waste of time and paper."}, {"userName": "Checkman", "userReviewDate": "Sep 21, 2015", "userURL": "http://www.goodreads.com/user/show/5117003-checkman", "userReview": "2.5 StarsDean Koontz isn't a terrible writer, but he isn't a great writer either. However he is a very consistent and smooth writer. Amazingly commercial and very successful. Perhaps some of this is simply sour grapes because I will readily admit that I am a middle-brow reader with mainstream tastes, but something about Koontz rubs me the wrong way - though I did enjoy Phantoms. Honestly I don't know why I keep reading his books. The only good thing is I pick them up at yard-sales and thrift stores so I'm not paying full price for them. Koontz is prolific in the extreme (I have to wonder if he has a ghost writer following a template)and his books are just variations on a handful of themes. Actually there are aspects to his books that reminds me of repertory theatre. Similar characters being played by the same actors. They take turns playing the different roles every couple of weeks in a different production. Comfortable in their sameness. Another comparison that comes to mind is 1970's television. Okay so now that I'm done with all my griping lets get to the book. It's okay. Starts off strong, but within a couple hundred pages it gets weighed down by the endless details of the various characters trying to figure out what happened to them the \"summer before last\" (which is repeated Ad nauseam). Two-thirds of the novel consists of this. The big reveal is actually rather predictable and anti-climactic. There is the usual Koontz sermonizing with his stock characters (though the super intelligent dog is missing) and it plays out as one expects. It's forgettable and mediocre, but it isn't awful (I'm contradictory aren't I). I read it during one of my son's football games (it wasn't a good game) and during a couple doctor visits and what not. It reads fast and goes down easily - like a glass of cool flat soda minus the ice. Maybe that's why I keep reading Koontz. His books aren't demanding and can be read with only half of my concentration. The nice thing is the big old thick novel really keeps up my stats here on Goodreads. LOL"}, {"userName": "Billy Maise", "userReviewDate": "Jun 02, 2009", "userURL": "http://www.goodreads.com/user/show/2301568-billy-maise", "userReview": "Ok. Strangers is definitely tied with Watchers for My Favorite Koontz Book. Let me break it down for you. Sleepwalking. Telepathic signals. Multiple plotlines all being dragged inexorably towards a creepy hotel in Nevada. Healing powers. A government conspiracy. Nail-biting suspense. And then...AND THEN...EXTRATERRESTRIALS!What?YEAH, ALIENS!Are you sure you've got the right author?YEAH, MAN! KOONTZ THREW SOME SCI-FI SPICE ALL UP IN THAT CASSEROLE!So there's no vicious monster?Nope.There's not a cloud of deadly ectoplasm?Nah, man. Just an alien species traveling in cryostasis across the galaxy to make contact with other intelligent lifeforms.Wow.I know. Who woulda thunk it? Anyway, unlike the alien twist in Indiana Jones 4 (LAME.), this one worked out spectacularly. The characters were deep and realistic. The build-up was top-notch and culminated in the biggest shocker in Koontz history. I mean, bravo."}, {"userName": "Brett", "userReviewDate": "Jul 12, 2008", "userURL": "http://www.goodreads.com/user/show/436346-brett", "userReview": "Maybe I'm getting soft in my old age, but I seem to be having a hard time summoning the energy to really hate Dean Koontz novels the way I used to. This one has the same mechanics as most of his others, except that it is a couple of hundred pages longer than your typical Koontz story. There are some pretty cliche charcters, a government conspiracy, brainwashing, etc. Also, if you think about the title of the book--Strangers--it's not hard to figure out what the answer to the big mystery at the end is. That took a lot of suspense out of it for me.So I don't really recommend this book to anyone, though it's no worse than any other Koontz fair, and better than some."}, {"userName": "Kirstin", "userReviewDate": "Sep 28, 2016", "userURL": "http://www.goodreads.com/user/show/30037960-kirstin", "userReview": "Just not a fan of these basic thrillers. I still have about 20 pages left to read but I just don't care. How sad is that?"}, {"userName": "Sherri", "userReviewDate": "Apr 21, 2018", "userURL": "http://www.goodreads.com/user/show/41497357-sherri", "userReview": "I had to extract one star because the story was very boring and slow-moving for the first 75 pages or so, then it picked up its pace. Also, the language was very male-biased. You cannot use the word 'men' to encompass all of humanity; it just doesn't work for those of us who are more liberal-minded and aware. 'He' was the default pronoun used throughout the novel. This book was written in 1986, so that may have been the leading factor - I don't think political correctness was a big issue....yet.That all being said, the majority of the book was interesting. While the premise of this novel is not a new topic, I liked the manner in which it was portrayed. It raised a lot of hope for humanity. The villain was deliciously insane and an asshat. The lead male and female protagonists were likeable. The other supporting characters were all likeable, too.This was a long book at over 700 pages. Character-building was slow in the beginning. But it all came together beautifully. I think that this was one of Koontz's better books, as a whole."}, {"userName": "Eve Nolon", "userReviewDate": "Aug 27, 2014", "userURL": "http://www.goodreads.com/user/show/33592909-eve-nolon", "userReview": "I must have forgotten how much I hate this book because here I am reading it again. There's a lot to hate, I mean, A LOT TO HATE, but I'll focus in on Koontz's utter contempt for Native American cultures and people this time. There's the ending diatribe but I'll get to that when I get there. Let's take a look at Koontz's writing of Jack Twist, the thief with a heart of gold, who is a former army ranger. Twist is thinking back to his last, or one of his last, assignments in Central America where he planning to rescue a few hundred Miskito from a School of the Americas-type place but before the reader starts to think that Twist really does have a heart of gold, or a FUCKING SOUL, Koontz is sure to educate the reader that Twist knows the real score:Nevertheless, twenty Rangers in mufti would not have been committed to such a dangerous raid merely to save Miskitos. Both left- and right-wing dictatorial regimes routinely slaughtered their citizenry in every corner of the world, and the United States did not—could not—prevent those state-sanctioned murders. But in addition to the Indians at the Institute, there were eleven others whose rescue, along with the Indians, made the risky operation worthwhile.Those eleven were former revolutionaries who had fought the just war against the now-deposed right-wing dictator, but who had refused to remain silent when their revolution had been betrayed by totalitarians of the left. Undoubtedly, those eleven possessed valuable information. The opportunity to debrief them was more important than saving the lives of a thousand Indians—at least as far as Washington was concerned.Well, as long as it's just Washington. What the fuck is this? Gah. Koontz, just shut the fuck up. Go back to describing sofa cushions and wallpaper. More to come as I read through this garbage.Thank god I am almost finished with this disaster. But I do have something else to comment on besides Koontz's self-inserted racism that doesn't make a lick of sense. Am I really supposed to believe that Ned and Sandy are in love and have a happy marriage? He married her to fix her; she told him nothing about herself and her past until they were married 8+ years. Yeah, she was not interested in sex but they did have it... and she never ever orgasmed before being Touched By An Alien? Seriously? Ned never ate downtown? Never?! That's not a happy marriage above and beyond my first points.I am not even going to both to comment on the following passages. If you don't see what's wrong with them, I can't help you on Goodreads.And anthropologists tell us that when an advanced culture interacts with one less advanced, the less advanced culture suffers a loss of confidence in—and often a complete collapse of—its traditions, institutions. The primitive culture loses respect for its religions and systems of government. Its sexual practices, social values, and family structures deteriorate. Look what happened to the Eskimos following their encounter with Western civilization: soaring alcoholism, family-destroying generational conflict, a high rate of suicide.... It’s not that Western culture is dangerous or evil. It isn’t. But our culture was far more sophisticated and richly textured than the Eskimo culture, and contact led to a serious loss of self-esteem among the Eskimos that they’ve never regained and never will.” [This from a Catholic priest which makes complete sense and infuriates me at the same time.]Again from the priest: “But part of Jesuit education involves a hard look at both the good and bad results of the Church’s efforts to spread the faith to backward cultures throughout history. The general feeling is we did a disturbing amount of damage even as we brought enlightenment. Anyway, we study a lot of anthropology, so I can understand the concern of the CISG.” [This is about as much weight as Koontz will give to the idea that western culture is not the be-all and end-all of ALL THE GOOD THINGS IN THIS WORLD.]“Consider the American Indian. Ultimately, the white man’s guns didn’t destroy them; the clash of cultures did them in; the influx of new ideas forced the Indians to view their comparatively primitive societies from a different perspective, resulting in a loss of esteem, a loss of cultural validity and direction. According to what Mr. X told Father Gerrano, the CISG believed contact between mankind and very advanced extraterrestrials could have those same effects on us: the destruction of religious faith, a loss of faith in all governments and other secular belief-systems, a rising feeling of inferiority, suicide.”Right. So \"comparatively primitive\" that the US Constitution took many ideas from the Iroquios Confederacy. Should I even try to get into the fact that indigenous cultures are extremely different through out the United States but even in all of those differences women and children typically fared better? And elders too. JFC this is infuriating to me on so many levels. After a while, Parker sighed and said, “Personally, I think the CISG was full of crap. First contact wouldn’t destroy us.”“I agree,” Stefan said. “Their fallacy lies in comparing this situation to our contact with primitive cultures. The difference is that we aren’t primitive. This will be the contact between one very advanced culture and another super-advanced culture. Yeah, well, I can't say that I agree with advanced meeting the super-advanced. Not even a little bit. All of this blah-blah yay aliens bullshit instead of something that might actually challenge the reader? I know, asking too much and all of that. Seriously, had I not read a bunch of Koontz novels that I seriously enjoy (present tense because I do and will continue to re-read them) and read this POS first, I'd never ever have picked up another Koontz. However, just the mere existence of STRANGERS always has me hesitating to fork over cash for a Koontz novel - I do not want to subsidize this sort of ignorance."}, {"userName": "Siobhan", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/35855553-siobhan", "userReview": "This is another great Koontz book. Yet another of his books which keep you second guessing until the truth comes about – a truth which may not be what you expect. With this one there is a lot of time put into the characters, ensuring that you know everything there is to know about them. Whilst this isn’t odd for Koontz there is more than usual in this, especially so that you can understand the strange phenomena which are occurring. Each of the characters has been given their own unique strange event, leaving your mind running off at all the possible explanations for how these are connected. Even when a supposed link appears there are still a variety of ways in which you could be wrong, hence why your mind is running around until the very end where all becomes clear.I only have one small problem, which I feel I should point out. The font in this book is smaller than average, and with it having such large chapters (and being another of his larger books) it can be rather hard on the eyes. Do not let such a thing push you away from the book, however, just keep it in mind whilst reading that you could very well (as I did) invoke a headache through reading masses of it at once."}, {"userName": "DeAnna Knippling", "userReviewDate": "Feb 11, 2017", "userURL": "http://www.goodreads.com/user/show/3166570-deanna-knippling", "userReview": "Uh....Did not like. 600 pages of setup for 100 pages of plot. Atheists are evil psychopaths, Native Americans weren't butchered, they just lay down and died because their culture was inferior, and you're sure brave, little lady. The big revelation is not a surprise and the ending lacks logic. Umm...Yep, those atheists. Fighting against everything good. Dang Ol Atheists.The techniques are good. I did a lot of skimming, but was forced to keep turning pages to find out what happened. And the characters are mostly excellent, real people reacting in a variety of ways to an improbable situation. It's just that the MESSAGE is so crude and clumsy that it felt like an imposition, like the author was unwilling to play fair.Now, say, Intensity, by the same author, gets much of the same point across--but does so in a way that I personally found enjoyable. This was just...a two by four of shouting and bad logic."}, {"userName": "Thomas Strömquist", "userReviewDate": "Jan 11, 2015", "userURL": "http://www.goodreads.com/user/show/32669562-thomas-str-mquist", "userReview": "My second Koontz following the brilliant Phantoms. This was similar in outset (\"what happened here/to these people?\") and the first half is really thrilling. Somewhere you realize you're actually reading a sci-fi when you thought you grabbed a horror, and then again, it's pretty horrific. The bad news is that the background story (when revealed) does not live entirely up to expectations, and the main gripe is that the book is too long. Other than that, it is a great effort and recommended."}, {"userName": "ScottK", "userReviewDate": "Oct 19, 2007", "userURL": "http://www.goodreads.com/user/show/234101-scottk", "userReview": "Dean Koontz is one of my favorite authors,and this book is one of the reasons why. Although some of his works are hit or miss this one was very well written. You couldn't help but feel sorry for the characters as they all went through their own various ways of coping with what happened to them all. And not until almost they very end did I figure out exactly what it was that did happen to them. This, along with Lightning, are two of my all time favorite reads."}, {"userName": "David Haynes", "userReviewDate": "Oct 03, 2016", "userURL": "http://www.goodreads.com/user/show/12509312-david-haynes", "userReview": "I thought this was too long. It took an age to get into the guts of the story and it wasn't until the last third that there was any tension. That said, I am judging it based on the excellent Watchers which I thought was one of his best."}, {"userName": "Stephen McQuiggan", "userReviewDate": "Apr 10, 2017", "userURL": "http://www.goodreads.com/user/show/43003708-stephen-mcquiggan", "userReview": "A group of people are suffering from terrifying fugues and phobias; strange dreams that draw these strangers together in the Tranquility Motel where they begin to realize they also share a world changing secret. A very good, if overly long book - you could cut a good two hundred pages from this and not lose the story. Plus the secret, revealed in the last fifty or so pages, is not exactly a big surprise. Yet it is well written and enjoyable and quite addictive. The section on the salt cellar, how on a molecular level things are in constant flux, stuck with me for days."}, {"userName": "Logan Derby", "userReviewDate": "Sep 01, 2014", "userURL": "http://www.goodreads.com/user/show/34523087-logan-derby", "userReview": "Strangers is the kind of book that you'd enjoy if you read books that don't actually do anything. Strangers is around 700 pages, in which there where exactly two parts I actually found interesting, and they were both with the same character, Jack Twist. Aside from that, it's about 670 pages of talking, a random death of someone who doesn't matter and is never mentioned again, and hyping the finale of the book to be something great, which you better fuckin' believe that's the last thing it'll ever be. Dean Koontz, in his infinite writing wisdom, ended the book making it seem as though there'd be a sequel, which of course (and thank every deity I know) there isn't. Dean Koontz isn't a fan of killing off main characters, as every single one of the \"Strangers\" survives, and the only other important character is killed on page 630. On top of that bit of wondrous info, Dean states he wasn't sane when he wrote this absolutely incredible piece of literature. Strangers gets 1 star, entirely because that's as low as I'm allowed to make it. I was under the impression that I was reading book about aliens, since they hint at it a bunch throughout while at the same time not actually telling you jack or shit. Anyways, at the end of this garbage you find out that the Aliens were dead literally the entire fucking time, making all of this, a COMPLETE waste of my time. Strangers might not be the worst book written, since, to be fair, it was written well, he made it easy to picture what was happening. Although, thats all in waste because not a single god damn thing was worth picturing.To sum it up, I hate this book. I hate it with a fiery passion.I'm going to end it here, because I can, and don't need to explain anything further about this absolutely gripping novel."}, {"userName": "Bettie☯", "userReviewDate": "Jan 25, 2009", "userURL": "http://www.goodreads.com/user/show/1108123-bettie", "userReview": "Unabridged, and read by Dick Hill2.5 Strangers2* Phantoms2* Intensity2* Phantoms1* The Taking4* The Good Guy3* The Door to December3* Tick Tock2* The Darkest Evening of the Year3* Whispers2* By the Light of the Moon3* Mr Murder2* The FaceTR Darkfall3* Icebound3* Winter MoonTR Shadowfires3* The Voice of the NightTR The Vision3* Black River2* Fear Nothing (Moonlight Bay #1)TR Odd ThomasTR Forever OddCR October Skies3* Dark Echo3* Strangers (2.5*)"}], "description": "Six strangers are unaccountably seized by nightmares, attacks of fear, and bouts of uncharacteristic behavior. The six begin to seek each other out as puzzling photographs and messages arrive, indicating that the cause may lie in a forgotten weekend stay at an isolated Nevada motel. Koontz has topped a fine roster of horror and suspense novels with an almost unbearably suspenseful page-turner. His ability to maintain the mystery through several plot twists is impressive, as is his array of believable and sympathetic characters. With its masterful blend of elements of espionage, terror, and even some science fiction, Strangers may be the suspense novel of the year.", "title": "Strangers", "url": "http://www.goodreads.com/book/show/15676.Strangers", "average": 3.99, "cover": "https://images.gr-assets.com/books/1308458895l/15676.jpg", "reviews": 651, "authors": [{"url": "https://www.goodreads.com/author/show/9355.Dean_Koontz", "name": "Dean Koontz"}], "type": ["Fiction", "Horror", "Suspense", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/15676.Strangers", "http://www.goodreads.com/book/show/3154795-strangers", "http://www.goodreads.com/book/show/157529.Strangers", "http://www.goodreads.com/book/show/1519921.Strangers", "http://www.goodreads.com/book/show/6571917-strangers", "http://www.goodreads.com/book/show/64954.Strangers", "http://www.goodreads.com/book/show/7025945-strangers", "http://www.goodreads.com/book/show/3745771-strangers", "http://www.goodreads.com/book/show/959361.Strangers", "http://www.goodreads.com/book/show/24447250-fr-mlingar", "http://www.goodreads.com/book/show/14995.Odd_Thomas", "http://www.goodreads.com/book/show/32423.Watchers", "http://www.goodreads.com/book/show/32439.Intensity", "http://www.goodreads.com/book/show/32435.Phantoms", "http://www.goodreads.com/book/show/16433.Forever_Odd", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}