{"ratings": 390, "userreviews": [{"userName": "Richard", "userReviewDate": "Sep 27, 2011", "userURL": "http://www.goodreads.com/user/show/4677640-richard", "userReview": "Goodis is known for writing gloomy books, and this is definitely one of them. It starts at the bottom and stays there. Whitey was once a famous singer whose precious throat gets ripped to shreds after he refuses to let go of his love for Celia, a dancer and gangster's girl. Now he's a down-and-out drunk living on Skid Row for seven years and going nowhere. One night, he decides to actually go somewhere and finds himself on a dark adventure in the Philly \"Hellhole\" neighborhood on one eventful night. You can't help but feel sympathy for Whitey knowing what he's been through and to root for him now that he's finally found a purpose. And although he's prone to rambling, Goodis really knows how to evoke an atmosphere, and knows how to give a voice to characters who are at their lowest point.\"...yesterday could never really be discarded, it was always a part of now. There was just no way to get rid of it. No way to push it aside or throw it into an ash can, or dig a hole and bury it. For all buried memories were nothing more than slow-motion boomerangs, taking their own sweet time to come back. This one had taken seven years.\""}, {"userName": "Carla Remy", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/3318055-carla-remy", "userReview": "Very dark and more unpleasant than not, but ending on a very satisfying note, with the depth that Goodis always seems to have."}, {"userName": "Josh", "userReviewDate": "Oct 12, 2012", "userURL": "http://www.goodreads.com/user/show/1108056-josh", "userReview": "'Street Of No Return' is one of my favourite Goodis novels. It's multi layered, has an interesting central character and a deep interlocking plot. Goodis views race riots, alcoholism, murder, police corruption and a deep seeded longing for a better place all through a tainted glass beer bottle. Whitey, a bum amongst bums, is mistaken for a murderer after trying to aide a felled police officer in a dark alleyway. His trip to the station house brings insight into the world around him. Danger and breathing go hand in hand. The world is not a nice place and the boys in blue have a hidden agenda.I was surprised at how complex Goodis made 'Street Of No Return'. Not only did he maintain an interesting plot set in the present but also enveloped the reader in the past - a time when Whitey wasn't a street dweller and his clothes not insect infested. Even more interesting to read is how that past, and a women named Celia impact on the race riots happening around him in the present tense. 'Street Of No Return' is a fast paced crime novel - set primary at night to hold true to the noir theme. The protagonist is a helpless drunk, the good guys are bad, the bad guys are bad and the riots are only the tip of a much larger and deadlier iceberg. The speed at which the story is delivered is not without its filler content with some passages coming across as dialogue heavey and perhaps unwarrented. The only thing that really holds 'Street Of No Return' back is the typical Goodis internal dialogue by which the character has a tendency to over think a situation and analyse every possible move and outcome. Some of this introspection detracted from the story at hand - which is a shame as the plot itself was excellent. That aside, I really enjoyed 'Street Of No Return' and have no hesitation is saying that this will be a future re-read. 4 stars.This review of 'Street Of No Return' is from the Library of America single bound hardcover collection 'David Goodis: Five Noir Novels of the 1940's and 1950's' - http://www.goodreads.com/book/show/12..."}, {"userName": "Ed", "userReviewDate": "May 18, 2012", "userURL": "http://www.goodreads.com/user/show/1077703-ed", "userReview": "David Goodis's star is ascending in the noir writers' skies. He had a Library of America volume of his five novels appear this year. Goodis is an ace on several fronts. For instance, I like his breezy dialogue that sounds authentic to my ear. I like his characters, especially the protagonist Whitey in STREET OF NO RETURN. Once a promising golden-throated crooner (did his career remind you of a young Sinatra?), Whitey's life has wrecked, but the Skid Row lush still rises to the occasion to do one more heroic act. I like Goodis's social commentary underpinning the story. Yeah, life sucks a lot more for some us. His secondary characters are unforgettable, especially Bertha and Chop, the pair of muscle goons. The three-hundred-pound Bertha is as hardboiled a \"dame\" as they get in noir. Great stuff. Loved it."}, {"userName": "Tony", "userReviewDate": "Apr 10, 2012", "userURL": "http://www.goodreads.com/user/show/1361000-tony", "userReview": "STREET OF NO RETURN. (1954). David Goodis. ****.\tSet in the seedy sections of Philadelphia, including Skid Row, this novel is one that really shows Goodis’s talents as a writer. It is not a murder mystery, per se, but addresses the plight of the poor and race relations at the time. As a native Philadelphian, I can remember the big headlines in the papers in the 1960s (I’d have to look it up to get the exact dates) that announced that Philadelphia was planning to move Skid Row from its then present location along Race Street to one of three possible sites. There was an uproar from each of the potential sites. I kept wondering, “How can they move Skid Row?” Anyway...we meet Whitey, one of several winos who habituate Skid Row. Turns out that Whitey was really Eugene Lindell, a (fictional) ex-singer who lost his voice through an encounter with some toughs over a woman. While walking out one night, he discovers a severely injured policeman in a back alley. As he is leaving to get to a call box for help, cops arrive and find him and the now dead cop in the alley. The cops add one and one and get three, and Whitey is carted off to jail. He’s not treated very well at the jailhouse because tensions are strained. There’s a race riot going on between the whites and the Puerto Ricans that has stretched the capabilities of the police to contain it and put a stop to it. Whitey manages to escape from the precinct house, and later learns more about this “race” riot and the real force behind it. With what he knows, he becomes a local hero, but now has to face a choice as to what to do with his life. Well written and well plotted, this is one of the best of Goodis’s novels that I have read. This novel is included in the new Library of America issue of “Five Noir Novels of the 19402 & 50s.” Recommended."}, {"userName": "Tosh", "userReviewDate": "Sep 20, 2007", "userURL": "http://www.goodreads.com/user/show/133661-tosh", "userReview": "David Goodis is the 3:00 A.M. poet of the lost and the forgotten - in other words the damned. Remarkable novelist that reads like a noir as a feverish nightmare. Wonderful book."}, {"userName": "Curt Buchmeier", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/26579657-curt-buchmeier", "userReview": "This was my first experience with a David Goodis book and, thinking about the story and the style over the last couple of days, it's better than three stars. Goodis does a great job of establishing most of the characters, none were predictable or stereotypical. And, after a so-so start, he does a good job of taking the reader on a wild, if not quite believable, ride over the course of one night in the late-forties, in what were then the rougher parts of Philadelphia(Precinct 37, I think). Our hero, Whitey, doesn't fit what I was expecting for a hero. I use the word hero but, in all honesty, Whitey is the most reluctant hero I've come across since Holden Caulfield. He meets and falls for the femme fatale, Celia, early on. Then he loses her in what has to be one of the most half-hearted attempts in literature to steal the girl. The word lazy comes to mind but, it was less than that. It was like he didn't care; about anything or anyone. Without giving it away, it plays like this. After Celia's boyfriend finds out that Whitey and Celia are more than friends, he meets Whitey one night, even eats dinner with him, all pretty civil and calm, considering. This guy is connected with the syndicate (mafia), or was and wants back in again, or whatever. Anyways, the mob-boyfriend straight up tells Whitey; leave Celia alone or he will mess him up. And he can make that happen, there's no doubt. So what does Whitey do? Whitey dreams up this terrible plan to flee with Celia, just pack what they can carry, meet at the train station at pre-arranged time and place and catch a train somewhere south the very next night.  Well, the boyfriend is still suspicious, he'd just met with him. He's keeping close tabs on Celia. The half-assed plan fails miserably and Whitey is taken for a ride to the country by several people, severely beaten and left for dead. He barely survives and is a shell of the man he once was; messed up bad and permanent. So, over the next several years, he takes to drink, spends all his money, burns all his friends. Classic slide to skid row, life by the drop. He's homeless and pitiful and likely mentally ill. Thing is, I was rooting for the guy, hoping he would do something to 'save' himself, or at least to try. It was frustrating the first third of the book watching this apathetic hero keep giving up every chance he got. Then one night, seven or eight years later, he gets in a tight situation; he's wanted for killing a Cop. He's innocent, of course, but it's not looking good for old Whitey. He ends up on the run from the Police and others. Along the way, he meets up with a wide variety of characters, all in the same night. Goodis' talent is undeniable throughout the last half of the book.  Take these couple lines describing how Whitey, who is sober, feels about himself. He has been beaten, he's hungry, scared and cold, and is trying to move north through the poorer neighborhoods, keeping out of sight using backyards and alleys. He happens to look at a house with the lights on over a backyard fence. And who is standing in the kitchen window but Celia. Our hero is dumbstruck and begins telling himself how there is no way he can reach out or try to talk to her now; his situation is hopeless and he's likely a dead man. \"So now you're getting to see. You're in that same bracket, buddy. You're one of them less-than-nothings who like the taste of being hurt. That makes you lower than the mice and the roaches. At least they try to save their skins, they got a normal outlook. But you, you're just a clown that ain't funny. And that's a sad picture, that's the saddest picture of all.\"On that cheerful quote, I'll wrap it up. I'll recommend it. Goodis was unique, I found plenty of things to like in this book but, I'm betting he had more success in others."}, {"userName": "the gift", "userReviewDate": "Oct 07, 2010", "userURL": "http://www.goodreads.com/user/show/3403278-the-gift", "userReview": "second review: this is the last of five novels of the goodis anthology, here republished by library of America, again i up the rating, for this one seems almost like his particular template- fast, lean, pathetic, poetic. or maybe just the archetype for him, all the usual suspects: sensitive artist type, thin frail blonde, criminals, cops, and then same plot: artist blindsided by love, girl held back by criminals, ruined and debased world vs transcendent purity of love, lost, lost, lost... maybe i was mistaken in calling it 'nihilistic' because, though he loses out, there is tragedy, there are ideals, there is love... but yes, this is a bleak book, this is a vision of the 1950s far not only in era from the comfortable uptown suburbs i grew up in and always already thought the whole world...first review: sad, sad, sad. walk with the destitute, the indigent, the loser locked into a spiral of self-destruction, all- of course- triggered by love of a woman. short, bleak, existential. possibly most nihilistic of the roman noir i have read."}, {"userName": "Eddie Watkins", "userReviewDate": "Jan 18, 2010", "userURL": "http://www.goodreads.com/user/show/1131783-eddie-watkins", "userReview": "A \"better\" written Goodis novel - more care per sentence, more strategic distribution of plot shifts and tensions - and also possibly an attempt at wider appeal by shifting focus from within his characters' haunted psyches to social conditions - race relations, public corruption - of an external world and the characters' positions therein, perhaps attempting to move beyond what I read were his typical readers - men seeking dark, cheap thrills - but as gripped as I was by his usual street-level authenticity and knowing and compassionate rendering of down-and-outs haunted by viral pasts, using his own tortured soul as template, I prefer (at the moment) his cheaper, (even) tawdrier tales written with less care and more dark recklessness and interiority."}, {"userName": "Andy", "userReviewDate": "Sep 24, 2008", "userURL": "http://www.goodreads.com/user/show/764075-andy", "userReview": "Some outrageous business about a Frank Sinatra type crooner who gets his vocal cords mangled, so since he can't sing anymore he becomes a Skid Row lush in Philadelphia (Goodis Town). He's stuck in the middle of a race war between Puerto Ricans and the cops. It doesn't get more depressing than this."}, {"userName": "Daniel Polansky", "userReviewDate": "Mar 31, 2018", "userURL": "http://www.goodreads.com/user/show/5934250-daniel-polansky", "userReview": "A crooner turned alcoholic bum is framed for killing a police officer during a race riot. It’s weird that the most revered genre writers, at least when it comes to mystery, tend not to have any of the qualities that genre books are supposed to have. Chandler, for instance, couldn’t plot a narrative to save his life and Chester Himes’s stuff similarly has a weird tendency to run out in strange directions. Not that I’d put Goodis in that category, but he does have that interesting quality of a slumming ‘literary’ writer. His experiences as being basically, a miserably impoverished alcoholic in Los Angeles, shines (glooms?) through the narrative, and the slice of life bits, about drinking shoe polish to get high or whatever, they really work, in a depressing sort off fashion. But the genre bits in this – the mystery, the action, etc., frankly didn’t interest me in the slightest, and the back story is incoherent, and there’s more of that then there is the good stuff. Library, but drop."}, {"userName": "Christopher Fulbright", "userReviewDate": "Jul 08, 2012", "userURL": "http://www.goodreads.com/user/show/6873108-christopher-fulbright", "userReview": "STREET OF NO RETURN by David Goodis is an addictive, compulsively readable book from a giant of the pulp crime era. Open on River Street, Skid Row, a tenement’s front steps with a circle of bums staring at an empty bottle of booze, wondering where the next one’s gonna come from. The way the book starts you’d never guess that in another few pages, after learning their stories, you get the feeling you could end up like one of them. But the star of this ensemble turns out to be a bum named Whitey, and it’s his story you’re gonna know best of all. And boy, does he have a story. You don’t really learn much of it before Whitey gets up and heads down the road. His bum pals are baffled, see, because Whitey has followed this mystery man into a place called the Hellhole, where no one in their right mind ever wants to go. It’s the underbelly of the city, torn by racially-motivated gang riots and violent crime. But Whitey doesn’t care. The mystery is tied to his story, which comes a little more unraveled bit by intriguing bit so a reader can’t help but hang on. This seemingly meek bum named Whitey with a raspy soft voice ends up on Hellhole street corner on his lonely mission when a bloody cop groans for help from a dark alley. Whitey goes to the dying cops’ aid, but too late. Too late and too bad, because the cop dies in his arms, and just as he does, a squad car pulls up at the end of the alley and puts the spotlight on Whitey. If you think you know where it goes from here, you’d only be partly right.THE STREET OF NO RETURN delivers on a higher level than a lot of crime novels because this book isn’t about a crime, it’s about a man -- not only how he ended up like this, but what he does with it all after he’s there. The story has a lot of great hooks that keep you going in deeper with Whitey until you just can’t put it down. I started reading this book when I was getting my car’s oil changed, and I was pissed off when my car was ready. I took every spare moment that day glued to this book until I’d finally followed it around its last twisty-turn to its bracer conclusion. Perhaps the real zinger here is that this book, and a few other books by Goodis, are available for free online for all e-readers. I’m someone who initially dug in his heels against e-book revolution, but now I’m an e-book addict, mainly because so much great stuff like this is available for free. I don’t condone illegal downloading, but public domain works are free game, and it seems that several of his books are now in the public domain. So, really, if you have an e-reader and are a fan of crime fiction, there’s no reason at all that you shouldn’t be reading David Goodis.Wikipedia gives us a nice glimpse into Goodis’s career. After his first novel saw print in 1939, he wrote a staggering amount of fiction for pulp magazines and even wrote for some old time radio shows like House of Mystery and Superman. In his time, Goodis met with a good deal of success. His books in the 1940s and ‘50s were bestsellers that drew interest from Hollywood, where he later ended up writing scripts for Warner Brothers. At the time of his death, all of his books were out of print, and remained so unti lthe 1980s when those saints of underground crime fiction Black Lizard/Vintage Crime brought some of the titles back. Finally, this year, the Library of America compiled five of his novels into an omnibus edition, cementing his name in the litrary equivalent of Hollywood’s walk of fame. It’s good when stuff like that happens. It gives you a little faith. It even kind of implies that old addage “the cream rises to the top” might actually be true."}, {"userName": "Stas", "userReviewDate": "Mar 27, 2010", "userURL": "http://www.goodreads.com/user/show/392269-stas", "userReview": "By the third page I realized that I'd seen the Sam Fuller film (with Keith Carradine). There is a matter of broken vocal chords and broken heart. This book is a hard gem; be careful swallowing it, sometimes it chokes you."}, {"userName": "John Wilson", "userReviewDate": "May 21, 2014", "userURL": "http://www.goodreads.com/user/show/7985686-john-wilson", "userReview": "A skid row vagrant goes in search of a drink one night..."}, {"userName": "Andrew Vachss", "userReviewDate": "Nov 15, 2009", "userURL": "http://www.goodreads.com/user/show/2610991-andrew-vachss", "userReview": "An obsessed genius who didn't last long, but he could put Jim Thompson on the trailer anytime he wanted."}, {"userName": "Robin Friedman", "userReviewDate": "Jan 11, 2018", "userURL": "http://www.goodreads.com/user/show/22269025-robin-friedman", "userReview": "Skid Row Meets HelltownDavid Goodis' 1954, \"Street of No Return\" is the final work in a collection of five novels by Goodis in a recent Library of America volume: \"David Goodis: Five Noir Novels of the 1940s and 50s\". Goodis (1917 -- 1967) was living in his parents' home in Philadelphia when he wrote \"Street of No Return\" which was published as an inexpensive pulp paperback. In his younger years, Goodis had written for Hollywood and his novels have the movies in view. In 1968, Samuel Fuller directed a movie version of \"Street of No Return\" starring Keith Carradine and Valentina Vargas. Edited by Robert Polito, the LOA volume preempts the 1987 edition of Goodis' novel I am reviewing here, which included Polito's valuable and still-accessible introduction.This is a poetical novel of lonely, failed people and outcasts set in a cold late November in the Philadelphia slums of the late 1940s or early 1950s. It it is set in two adjacent neighborhoods along the river: Skid Row, the home to derelicts and alcoholics with no place to go and no prospects and Helltown. The latter community, three blocks from Skid Row, is in a condition of racial ferment, as new residents from Puerto Rico and the earlier residents come to violence and rioting against one another.The book tells the story of Eugene Lindell, 33, a seven-year resident of Skid Row who goes by the name of \"Whitey\" due to his prematurely white hair. Lindell has two companions, Phillips and Bones. As the novel begins, the three men are outdoors on a frigid day and thirsting for alcohol. When Lindell chances to see a man from his past on the street, he follows him to Helltown, beginning the connection of the two communities in Goodis' tale. With the ongoing Helltown riots, Lindell stops in an effort to assist a policeman who has been clubbed to death. The policeman dies in his arms, and two arriving patrolmen arrest Lindell for his murder.As the book develops, the reader learns a great deal about Lindell. He had been a popular singer with a promising future before he fell for a dancer and former prostitute, Celia, the common law wife of Sharkey, a small-time gangster with large ambitions. Sharkey's two thugs, Bertha and Chop, beat Lindell to a pulp, almost destroying his voice while totally destroying his ambition.The book turns on character and atmosphere. Goodis makes the reader feel the poverty and hopelessness of lonely streets and people in Skid Row and Helltown. In a short novel, Goodis develops place through character. Besides Lindell and his two Skid Row companions, Goodis introduces many other failed, isolated individuals who are formulaic in part but sharply and individually etched in the mind. The characters include a police captain and his two lieutenants, Sharkey and his minions, a Puerto Rican gang leader, Gerardo, and his cowed, frightened assistants, and an aged African American man, Jones Jarvey, who understands Lindell and recounts his own story. Jarvey begins:\"Every man has an ax to grind. Whether he knows it or not.... I've been on this earth a long time... I'm eighty-six. That makes me too old to grind the ax. But the Lord knows I did it when I was younger. Did it with all the strength in my body. And don't think I wasn't scared when I did it. So scared I wanted to turn and run and hide in the woods. Much safer that way. Much healthier. Buth there's some things more important to a man than his health.\"The plot of the book is contrived. It turns on coincidence, a lengthy scene of eavesdropping, and an implausible twist to the story of racial tension and rioting in Helltown. \"The Street of No Return\" remains a strong, brutal and sad novel with its rawness, depictions of place and character, and lyricism.I have enjoyed getting to know the novels of David Goodis through the Library of America volume. Writing in a formulaic medium, he captured a world of sadness and isolation in books of a strange beauty and insight.Robin Friedman"}, {"userName": "Daria Dykes", "userReviewDate": "Oct 25, 2014", "userURL": "http://www.goodreads.com/user/show/18294376-daria-dykes", "userReview": "If I could, I'd give it 2.5. But I won't round that up to 3.This was an okay noir - the story unfolds over a single night between about midnight and 6 a.m., and describes the adventures of a skid row bum who catches sight of and follows a figure from his past - and gets led into trouble. This is a nice set-up and structure; I like the \"real time\" feel of the whole thing and I liked the gritty feel of the landscape. However, the dialog is very badly written and the protagonist is not clearly developed. His motivations are stated, but they don't sound recognizable in any way. Of course, perhaps I have been spoiled by too many Jim Thompson books with all of their complex internal dynamics. Street of No Return left me feeling that this was a good idea executed poorly - perhaps the worst book by a generally very good writer."}, {"userName": "Tim E Ogline", "userReviewDate": "Jan 24, 2016", "userURL": "http://www.goodreads.com/user/show/8440608-tim-e-ogline", "userReview": "Take a white knuckle thrill ride down the Street of No Return.David Goodis takes the reader on a dark passage into the night cloaked, whiskey soaked mean streets of Philadelphia of 1954. This is a part of Philly on the wrong side of the tracks and at the bottom of the ladder... and as far from Rittenhouse Square as you can get. Bums and thugs and crooked cops struggle for the scraps cast off by polite society and battle to be king of the hill of the trash heap.This genre defining classic tells the story of a golden boy whose rise to the top careens wildly off course when he crosses paths with the dark angel who would change his life forever. This is the story of his fall and his struggle for redemption on his own terms.Samuel Fuller harnessed his maverick genius to adapt this story as his final film in the 1989 epic of the same name starring Keith Carradine."}, {"userName": "Lisa Ciarfella", "userReviewDate": "Dec 13, 2015", "userURL": "http://www.goodreads.com/user/show/44321941-lisa-ciarfella", "userReview": "Interesting, intriguing, hopelessly sad yet compelling read here! Goodis mastered capturing the flavor and tone and utter sense of desperation of both skid row and Helltown in the darkly tragic noir tale. Found it hard to keep reading, yet impossible to put down, all at the same time. Finished it in a few hours. Whitey is the most tragic character, doomed from the start and his femme fatale is inevitable as she takes him down without so much as a glance backwards.Madge is one brutal thug. Pig like eyes buried in a sea of 300 pound flesh, beating the crap out of Whitey is a sight to behold...Makes you want to read, and not read, and yet reading prevails!A master of the dark, the dubious, the dreadful...Goodis tale is not one for the weak."}, {"userName": "Esme", "userReviewDate": "Mar 11, 2011", "userURL": "http://www.goodreads.com/user/show/5056466-esme", "userReview": "Gossenpoesie und Slumromantik Drei Clochards an eine Häuserwand gelehnt überlegen, woher sie noch einen Tropfen Alkohol bekommen können. Einer von ihnen - Whitey - sieht eine Frau aus seiner Vergangenheit und nimmt fast wie in Trance die Verfolgung auf. Diese Nacht wird für ihn zu einer Reise in die Vergangenheit, in der er sich schmerzhaften Erinnerungen stellen muss. David Goodis schreibt in \"Street of No Return\" (\"Straße ohne Wiederkehr\") über die Verlierer und die Verlorenen. Sie haben nichts, als den Alkohol und ihre Träume. Und mit dem Mut der Ausgestoßenen hängen sie an ihrem Leben, ihrer Menschlichkeit.Eine Reise ins Herz der Finsternis. Tiefschwarz und melancholisch..."}, {"userName": "Brad", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/4151846-brad", "userReview": "What a great piece of 'noir' writing. We start off with three drunks sitting around scheming for their next drink. Suddenly, the quiet and wistful of the three, Whitey, sees something, stands up, and walks off. His sudden, mysterious departure takes him on a wild ride through his anonymous present and unexpected past. I'd been meaning to read more David Goodis since I read Down There in a Library of America Crime Noir collection. I read this book in two sittings. It was completely captivating. Highly recommended."}, {"userName": "Michael", "userReviewDate": "Sep 29, 2010", "userURL": "http://www.goodreads.com/user/show/2631425-michael", "userReview": "A good Goodis!As usual, the main character's obsessional relationship with a woman is the start of his problems, and his refusal to give her up the catalyst for his downfall.I liked the use of flashback to tell the story of Whitey's descent. It was reminiscent of the Paris flashback in \"Casablanca\", but dark, twisted and without a trace of noble sentiment at the end.I really liked Lieutenant Pertnoy and wish Goodis had made more use of him: a very unusual police officer."}, {"userName": "Doug", "userReviewDate": "May 16, 2011", "userURL": "http://www.goodreads.com/user/show/4869278-doug", "userReview": "I didn't like this title as much as Goodis's Cassidy's Girl. It still has some great feverish Goodis prose, and the protagonist Whitey is well done (as are the villains, Chop, Bertha, and Sharkey). The plot -- murder, race riots, coincidences galore -- is a little too stretched, but again nice set pieces."}, {"userName": "Hari Brandl", "userReviewDate": "Jun 14, 2016", "userURL": "http://www.goodreads.com/user/show/10806871-hari-brandl", "userReview": "David Goodis has become a new favorite of mine. This one was a quick read, but no less a great story for that. I enjoy this view of life through the eyes of a writer from the 40's, not as a steady diet, but I can tolerate it occasionally. Social mores were quite different then, and the treatment of his women is of the times, but not offensive."}, {"userName": "Robbin", "userReviewDate": "Sep 25, 2012", "userURL": "http://www.goodreads.com/user/show/7684989-robbin", "userReview": "Not bad for noir. A little slow at first, but then everything quickly comes together and ends. In a nutshell, this one's about a man who was poised to be a huge national or international singer until he fell in with another man's woman and throws his career out the window to be with her. Pleasant reading. Not the best, but decent."}, {"userName": "Kylo", "userReviewDate": "Sep 28, 2007", "userURL": "http://www.goodreads.com/user/show/383537-kylo", "userReview": "This isn't Goodis's best but it's still well worth a read for a Goodis fan. Usual combination of his noir ethos, subtle characterization, and post-war's seamy side still works the charm. This one adds some nail-biting scenes, and has an all-in-one-night schtick that adds to the fun of the reading."}, {"userName": "Michael S", "userReviewDate": "May 09, 2014", "userURL": "http://www.goodreads.com/user/show/15040923-michael-s", "userReview": "Great stuff. Really enjoy Goodis's noir. More complex than Jim Thompson (pop 1280, killer inside me). This one approached Algren in grittiness and despair. Prose not as good but an enjoyable quick read with nice plot twists."}, {"userName": "Carla", "userReviewDate": "Oct 22, 2015", "userURL": "http://www.goodreads.com/user/show/3872950-carla", "userReview": "This was my favorite of the Goodis novels in the Library of America collection. The blend of politics, crime, doomed (of course) love, and alcoholic despair make this unforgettable, and a true page-turner. I couldn't put this one down."}, {"userName": "Scoats", "userReviewDate": "Jun 20, 2012", "userURL": "http://www.goodreads.com/user/show/1026793-scoats", "userReview": "Another very typical Goodis work. Typical yet unique. Being a lifelong resident of Philadelphia, I find the settings of places now very changed, especially interesting. If you love Goodis, you'll love this one."}, {"userName": "Henry", "userReviewDate": "Aug 25, 2010", "userURL": "http://www.goodreads.com/user/show/4160911-henry", "userReview": "Usual Goodis: Musician in the gutter, drinking, gangsters, skinny blonde, fat brunette. Some exceptional Goodisisms, especially in the inevitable passage on just how the lead drunk ended in the gutter, but pretty much rote."}], "description": "“David Goodis is the mystery man of hardboiled fiction.”—Geoffrey O’BrienIn Street of No Return, we meet the pathetic figure of Whitey. Once upon a time Whitey was a crooner with a million-dollar voice and a standing invitation from any woman who heard him use it. Until he had the bad luck to fall for Celia. And then nothing would ever be the same.In Street of No Return, David Goodis works the magic that made him one of the most distinctive voices in hard-boiled fiction, creating a claustrophobic universe in which wounded men and women collide with cataclysmic force.", "title": "Street of No Return", "url": "https://www.goodreads.com/book/show/648535.Street_of_No_Return", "average": 3.95, "cover": "https://images.gr-assets.com/books/1348811121l/648535.jpg", "reviews": 36, "authors": [{"url": "https://www.goodreads.com/author/show/7623.David_Goodis", "name": "David Goodis"}, {"url": "https://www.goodreads.com/author/show/7625.Robert_Polito", "name": "Robert Polito"}], "type": ["Mystery", "Fiction", "Mystery", "Mystery", "Novels"], "outlinks": ["http://www.goodreads.com/book/show/648535.Street_of_No_Return", "http://www.goodreads.com/book/show/25200029-street-of-no-return", "http://www.goodreads.com/book/show/16082004-street-of-no-return", "http://www.goodreads.com/book/show/9422219-street-of-no-return", "http://www.goodreads.com/book/show/42589.Shoot_the_Piano_Player", "http://www.goodreads.com/book/show/844793.Dark_Passage", "http://www.goodreads.com/book/show/383324.Nightfall", "http://www.goodreads.com/book/show/383322.The_Wounded_and_the_Slain", "http://www.goodreads.com/book/show/35830.The_Burglar", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}