{"ratings": 306, "userreviews": [{"userName": "Jaime (Two Chicks on Books)", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/3722438-jaime-two-chicks-on-books", "userReview": "Another amazing book from Elizabeth Briggs! Everything I’ve read of hers has been awesome and I’m so happy she decided to get into the reverse harem Fantasy genre! I adored getting to know Kira and her 4 mates and can’t wait for the second installment in this series!!!"}, {"userName": "Marguerite (Lady RH) ❀", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/56373733-marguerite-lady-rh", "userReview": "Rating : 2 starsand review to come soonish~"}, {"userName": "Jessica Robbins", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/31026663-jessica-robbins", "userReview": "*I received a free copy of this book which I voluntarily chose to write an honest review for.Book one in the brand new Her Elemental Dragons series and what incredible start it is too. I am totally hooked now and have been from the very first page where we are drawn into an incredible fantasy world that I wished I lived in. We get to meet Kira a seemingly normal girl until her twentieth birthday when everything changes. Four men are drawn to her whether they want to be or not and together they discover a destiny that none of them saw coming. I cannot get over the world building in the this book and the characters just made it even better. If you enjoy fantasy reverse harem novels and dragons then you really have to go read this. I highly doubt you will regret it. I loved every single minute of it so I give it 5/5 stars."}, {"userName": "Nancy The book junkie", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/5102896-nancy-the-book-junkie", "userReview": "Rating: 3.25/5Review to come!"}, {"userName": "Joann", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/59441770-joann", "userReview": "I’m sorry but I’m not going to give away any spoilers of any kind because I’m not the type that does that. So all I’m going to say about this book is that it’s a very good, it kept me interested from the beginning right up until the very end. First time reading anything by Elizabeth Briggs and I got to say she’s good at her story weaving so good I’ll be checking out more of her work in the future.So yes I do recommend this book to anyone who’s looking for a good story to climb into and get lost within its pages."}, {"userName": "Michelle ", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/11618764-michelle", "userReview": "This was great and I am looking forward to the next one. Full review soon!! 😊"}, {"userName": "Jennifer G", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/48984948-jennifer-g", "userReview": "Kira has been a lot of things since her parents were killed when she was 13; a bandit, a traveling merchant, a servant to an innkeeper. Most of all she's tried to blend in, to not be noticed. That all changes on her 20th birthday when her fate finally catches up to her, set in motion by a strange encounter and a lightning strike. After several weeks of vivid dreams about beautiful men, the actual men start arriving in her village looking for her; all telling the same story. Jasin, the arrogant soldier. Auric, the scholarly prince. Slade, the protective blacksmith. Reven, the cold assassin. According to them, they’ve each been chosen by the gods to become the next elemental dragons and Kira is their mate, the Black Dragon of the Spirit Goddess, the most powerful of all. They need to mate, master their powers, and overthrow the current Black dragon and her mates to right the lands. Stroke the Flame is a dragon-fantasy Reverse Harem. It's wonderful. The descriptive world-building, the complex characters, the multi-layered story are all nicely done. The pacing is perfect. The attention to detail is exact. There are attraction and infatuation but it's not insta-lust or insta-love. In fact, it's almost the opposite in two cases. It's a complicated dynamic with not everyone in agreement to being part of this mission or the relationships. Kira is a worthy successor to the Black Dragon. She's traveled every realm, she's smart, a fighter, kind, vulnerable, and caring. Her life has been forever damaged by the current dragons. Jasin is the man-whore of the group. He's bedded women in every town the military has passed through. This changes once he is chosen to be the Crimson (Fire) Dragon but his past still causes pain and distrust. Auric, The Golden (Air) Dragon is a nobleman by birth but of no importance to his family and more interested in his scholarly pursuits. He is smitten with Kira immediately. Slade is an enormous man with a bruised heart. He was content in his life and has no desire for change but once chosen as the Jade (Earth) Dragon is determined to do his duty for the world and protect Kira. He is equally determined to shield his heart from her. Then there's the assassin, Revel. He wants no part of being the Azure (Water) Dragon, no part of saving the world, no part of Kira. He is only interested in himself and has no plans to fulfill this destiny. Five strangers brought together by the Gods. Little in common. They have each felt pain in their past, either losing or disappointing loved ones but the only common ground they share is that they were each chosen. They set out on their path, uneasy, untrusting of one another, and with little control over their powers. When danger is immediate they are forced into a closer alliance but each gain is hard-fought. I enjoyed every minute of this dragon story. This book is the first in the series and while it does not have a cliffhanger the story is definitely in progress. It ends after the first bond but there is still much to do before facing the final battle. I eagerly await book two."}, {"userName": "Sian Jennings", "userReviewDate": "May 28, 2018", "userURL": "http://www.goodreads.com/user/show/58863557-sian-jennings", "userReview": "Stroke the Flame is the first in Elizabeth Briggs new series Her Elemental Dragons. This novel is marketed as a “steamy reverse harem” fantasy, however it is anything but. I went into this novel expecting a lot of sex and not much plot, which I was more than okay with. What I got was lukewarm at best and damn cold at worst. That isn’t to say this is a terrible book, it’s not, it just didn’t quite live up to expectations. Kira is a red headed huntress with a dark past. She is calm, competent, and able to remain uniquely feminine in her role as the hero. As a main character, she is wonderfully interesting and never comes across as being forced. We are then introduced to her four main love interests; Jasin, Auric, Slade, and Reven. If this was one of those novels where literally everyone was just getting it on all the time, I could have forgiven the two dimensional aspects of these characters. Each one can be reduced down to a single line, their stories barely interesting enough the keep the audience engaged. Jasin - The cocky soldierAuric - The clever princeSlade - The protective blacksmithReven - The mysterious assassin I thought the reverse harem aspect of this story would breath new life into what is a standard fantasy novel. The characters move from point A to point B with a few obstacles along the way that are easily overcome and nothing much, apart from bickering, takes place. The world Elizabeth Briggs has built is rich, though still doesn’t feel fully developed. When it came to the world, I was left with way more questions than answers. A few simple throw away lines really would have helped to round this world out a lot more. My biggest problem with this book is that it never seemed to go anywhere. There was no real tension between the characters, there was no sense of urgency that their mission mattered, and at the end you’re left with the feeling “oh was that all.” It started out so strong, there was plenty to keep the reader engaged, but it soon became really boring, really fast. If the author didn’t continuously change points of view the book would have been a lot shorter. I thought the perspective changes were really unnecessary and all they did was reinforce whatever it was Kira had said in her own chapters. A lot of the dialogue felt like it belonged in a screenplay, especially when the male characters interacted. “Let’s do this” “No let’s do that” “NO! LET’S EAT”. It almost felt like a choose your own adventure book and really brought me out of the story. This really is the white bread of books. It’s perfectly fine but it was missing flavour. I really, really wanted to like this book. But I just couldn’t. The best thing about this book is that it cured me of my insomnia. Which is unfortunate because Elizabeth Briggs has a wonderful writing style that flows so beautifully."}, {"userName": "Alimac ", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/70887872-alimac", "userReview": "I received this book as an ARC in return for an honest review!!On her 20th birthday Kira is hit by lightning and survives, little does she know that from this moment on her life changes completely: She has been “chosen” as the new black dragon to rule over the kingdom with her four mates.Kira has lost her parents when she was young due to the fire dragon burning her home and has been traveling ever since. She is strong, knows how to fight, is compassionate and stands up for what she believes in. Even though she is suddenly confronted with four men that she didn’t know before and with the mission to bond with all of them in order to fulfill their fate, she doesn’t shy away from the task and grows even more throughout the book. Her four mates —representing each element fire, wind, earth and water— are not all happy with their new fate. But through out the book they slowly accept their role, the other men and Kira. We get little glimpses into the characters’ past, and we can see that they all have secrets of their own and that they carry baggage with them, that they will hopefully all be able to overcome together! I can’t wait to read the next book to find out more about each one of them.I can recommend this book to anyone who likes fantasy, dragons, magic, medium-slow burn RH and story building!"}, {"userName": "Anne ", "userReviewDate": "May 01, 2018", "userURL": "http://www.goodreads.com/user/show/28373344-anne", "userReview": "New and interesting fantasy reverse harem in our midst. The story was engaging with its medium pacing but picked up even better at its last 30%. The world building is simple, just enough snippets to cover the basics. The politics. The history. The system in general. As if it was easing me onto what would happen later in the series-the proverbial calm before the storm scenario. The heroine was such a beautiful mix of the strengths of each elements. The passion from the fire, the intelligence from the air, the kindness from the water and the stability from the earth. There was no doubt she was the representative for the Spirit element. She was also selfless to let any of them go if ever one of them did want to reject the role. (Because, yes, there was one from the men who didn't want the responsibility). But she was never too prideful to admit she did need them. The heroes were a bunch of...sissies. They were one colossal, chaotic mess. Their elements clashed at one another. But the series was just starting so I'd like to see them grow later. The sooner, the better."}, {"userName": "Laura Cozicar", "userReviewDate": "Apr 28, 2018", "userURL": "http://www.goodreads.com/user/show/60842851-laura-cozicar", "userReview": "I received this book for free and was asked to leave an honest review.Kira is strong, independent and resourceful, but she is loyal to a fault, caring more for others than herself. Her life isn’t perfect but everything changes on a stormy evening. She meets a strange old woman with a criptic message and then she is struck by lightning but all it does is knock her into the mud. That night the dreams begin and I like how we are introduced to each of the four men through her dreams before they all descend on her. The five must follow the path laid out before them, dodging soldiers, dragons, thieves, and their pasts to fulfill their destinies. We come to know bits and pieces of each of the characters and find out that every one of them is hiding something. Will they be able to come together as a team and trust each other?The story threw a lot of information at you at the beginning but it all comes together to give you an intriguing story that draws you in and keeps you on the edge of your seat wondering what comes next."}, {"userName": "Melanie", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/4409346-melanie", "userReview": "Actual rating: 4.5 starsStroke the Flame is a must read for anyone looking for a well written fantasy RH novel. I couldn't put the book down until I finally reached the end.Kira is a wonderful main character. She's been living on the run and in hiding since the death of her parents. That all changes when she finds out she's got a big role to play in a destiny she's reluctant to take on. Not to mention, there's not one, but four guys who have also unexpectedly found themselves tied to Kira, and not all of them are happy about it.This book features chapters alternating between Kira and one of the guys' perspectives, though it's mostly from her POV. The relationships develop at different paces and it's mostly a slow burn with one sex scene near the end. There's no insta-love here, though the attraction is there. The book does not end on a cliff hanger, but is set up to lead into the next book in the series so I'd recommend waiting until closer to the release date of book 2 to read book 1 if patience is not your strong suit."}, {"userName": "T.", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/9274125-t", "userReview": "Ever since Reverse Harem became a genre, I'm finding the books are gravitating toward the same personality types: bold/aggressive, shy scholar, strong silent-gentle giant, and anti-social-ass…check, check, check…and, check. As with all the numerous RH I've read in the past months, I'm annoyed by the bold, cocky hot-head, rooting for the shy-guy to gain confidence, loving the strong, silent, watchful lover, and hoping to uncover the secret to the resentful assassin. Most of all, I', wishing that, at some point soon, these guys will start working together to present a united front against their enemies. While the story is great and the plot fast-paced, the heroes are becoming tropes and the books are starting to blend with each other. A perfect, but unsurprising example of RH that is good, but dulls by comparison to so many similar stories win this genre. Hoped for something fresh, but enjoyed the read nonetheless."}, {"userName": "Cassandra Cobb", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/69342776-cassandra-cobb", "userReview": "A great read from Elizabeth Briggs! Loved this book so much. This book was written well, from the multiple POVs to show each persons own journey on this new life to the development of trust between each character who formerly did not know each other. The story flowed well, with everything feeling realistic rather than rushed. I also loved that we got to learn about the Black Dragon and how she came to be, alongside Kira rather than having the backstory given to us beforehand. Can't wait to read book 2 Kiss The Sky: A Reverse Harem Dragon Fantasy!I received a complimentary copy of this book for review consideration."}, {"userName": "Puna", "userReviewDate": "May 07, 2018", "userURL": "http://www.goodreads.com/user/show/44171138-puna", "userReview": "This was my first time reading from this author. I LOVE dragons! And I'm loving RH. This was a great first start to the series. Kira- Main Herione. Strong, protective, been on her own for a long time.Jasin- the playboy soldier. He's the funny, laid back one of the bunch.Reven- the assassin. He's closed off, distant, hard to like him but also hard not to like him.Auric- the prince. The golden boy whose got a whole lot of secrets we still need to uncover.Slade- the blacksmith. He's also not completely in this with them. He has a past.Most of the men have had a loved one that they've lost. So meeting Kira and knowing what's going to happen is making them very closed off and resistant. I kinda like that since I'm not too much of a fan of insta-love but sometimes it gets annoying. But I still enjoyed this read. I will continue this series.Overall: 4/5"}, {"userName": "Sairaika Naidoo", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/37274877-sairaika-naidoo", "userReview": "An electrifying read!Four sexy dragon shifters... A huntress with a dark past...A bond that could save the world...Holy gods! What a fantastic fiery read and a hellva ride for these characters. I am so impressed by the author and this world she created. A world filled with the gods, elementals and an oppressive regime. The story was absolutely wonderful and progressing so well that I am impatient for the next book. Once I started this book, I couldn't stop - it is currently way past midnight when I finished this book. Once I read that blurb, I knew I needed to read this book and, boy, did it not disappoint at all. So intrigued and curious for the next book and what is to come.Full of gods, elementals, dragons, action, adventure, attraction, bonds, enemies, destiny and romance.Perfect for readers of fantasy reverse harem romances."}, {"userName": "Taylor Banuchie", "userReviewDate": "May 05, 2018", "userURL": "http://www.goodreads.com/user/show/57353693-taylor-banuchie", "userReview": "Tightly written spin on dragonsThis was my first Elizabeth Briggs book, and I really enjoyed it. I'm looking forward to the continuation of the series.The MC and her mates are individual and they each have distinct personalities. Sometimes RH can be a little one dimensional, so I was pleased to see character development for not only the MC but all four men, as well. I hope this trend continues and the author takes every opportunity to flesh out these characters in the next book. I also felt EB's take on dragons was different enough from all the rest to not feel tired. The different Realms definitely gave me Avatar: The Last Airbender feels, in a good way. All in all, a solid first installment that had steady action and enough character development to make sure readers are invested."}, {"userName": "Hannah Michaels", "userReviewDate": "Apr 29, 2018", "userURL": "http://www.goodreads.com/user/show/42294424-hannah-michaels", "userReview": "Stroke the Flame is the first in a new series, and it gives you a quick introduction to the world and what happens in it. While at times it felt a little rushed, the pacing was quick enough that it kept you moving along and didn't leave you with a chance to get bored. I think some of the events could have been elaborated more, but the smaller scenes were brief while still giving you all the information you needed to understand what was going on. All the characters were unique and were easy to tell apart just from their speech, which I always love when there's more than one or two points of view. Definitely a good beginning to the series, and I'm interested to see where it goes!**I received an advanced copy of this book in exchange for my honest review.**"}, {"userName": "Pike Perrie", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/74549189-pike-perrie", "userReview": "A wonderful first enstallment in this slow burn Reverse Harem Series. Kira is just a normal girl who hunts to keep her best friend's father from abusing either of them. Little does she know, her life is about to change. With one strike of lightning (literally) and an encounter with an elderly woman, she is thrown into a whole new life. She is destined for greatness if she can survive long enough. But she has four gorgeous elemental men joining her on her journey. Each of these are so different, but you can't help but love them all. The plot flows seamlessly and the world around them is portrayed beautifully."}, {"userName": "Kate", "userReviewDate": "May 04, 2018", "userURL": "http://www.goodreads.com/user/show/251067-kate", "userReview": "This was my first Elizabeth Briggs novel and I am thrilled that I found her because I loved this book. I really enjoy good reverse harem novels but it is not always easy to find well written ones. This book not only tells a believable reverse harem romance it also tells a compelling and fully fleshed out fantasy story. I like how we get to know each of the male leads as a their own complete and complex person. Kira was the highlight for me though I loved her and I am super excited to see where the story takes her in the books to come. This book was a great start to a series I am very eager to continue reading."}, {"userName": "Pamela Love", "userReviewDate": "May 26, 2018", "userURL": "http://www.goodreads.com/user/show/50291738-pamela-love", "userReview": "TerrificFirst time reading a reverse harem book, I'm not one for tons of romance in a book, but sometimes a short steamy scene is nice. Ms. Briggs did a fantastic job with this title opening book! I enjoy fantasy, but mainly anything with dragons usually does me in. She did a fantastic job with the characters individually and story telling. You start to like the characters wiggly and the pulls you in. I finished this book in less than 24 hours and wish it were longer. Truly a great read and cannot wait to finish the series!!"}, {"userName": "Rachel", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/6100321-rachel", "userReview": "I absolutely loved this story. The way Elizabeth transported you into the different realms and entranced you with fire, wind, earth, water enchanting men, made this book a super fast paced couldn’t put down page turner. I love how fiercely loyal Kira is and how skeptical she is in the begging of the book. ( such as a women should be) I can’t wait to read more from Elizabeth, hopefully more reverse harem. I’m super excited there’s going to be a second book and can’t wait to read it. It’s such a great, refreshing change, from a one women one man story."}, {"userName": "Kyles", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/5865705-kyles", "userReview": "This was a fantastic book!It may seem a little slow to start with, but it allows you to get to know the sort of person Kira is -how selfless she is and how she cares more for others than herself.I really loved her mates - they’re not perfect, and some are still getting used to the idea of being elemental dragons and mating with Kira.All 5 of them are still getting to know each other so we can look forward to finding out more of their pasts.Looking forward to the next book!"}, {"userName": "Shana Pare", "userReviewDate": "May 10, 2018", "userURL": "http://www.goodreads.com/user/show/36733306-shana-pare", "userReview": "Very entertaining.I look forward to Book Two of this series. Why? Because if it follows the patterns of this first book, it will be a most enjoyable read. The plot line is pretty straightforward and the characters make sense. It is a joy to watch them begin to work together as a team and not just hurdle into the biggest bed they can find.I recommend this series and anxiously await the next three or four books."}, {"userName": "Karmen", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/40845230-karmen", "userReview": "This is a fantasy reverse harem and the first part of a series. Our heroin is just a normal girl in a world dominated by five dragons who rule with terror and force. But their leadership has to come to an end and Kira and her guys could be the ones to make that happen. Their journey is long and full of challenges.This was a great book and there is lots of room for character development. I can’t wait to see where the story goes next."}, {"userName": "luz berrios", "userReviewDate": "May 06, 2018", "userURL": "http://www.goodreads.com/user/show/70698894-luz-berrios", "userReview": "Truly enjoyed reading this book. It was well written, the characters growth throughout the book was interesting. I truly loved how the kira was not a damsel in distressed she was a fighter with her only weakness and fear of fire. I loved of the mates didn't get along automatically with each other or with kira and their destiny. They all had to work on their relationships together and on their own. I truly cannot wait for book 2 to come out."}, {"userName": "Connie Fogg-Bouchard", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/26009119-connie-fogg-bouchard", "userReview": "feeling the heatKira had been hidden away for years in the various realms, running from her burning past. now the dragons that terrorized the land had become the warmth in her dreams. a very different burn with dragons never seen before.light-hearted, and fun to read. lots of story over sensuality. characters that breathe"}, {"userName": "Deb Le", "userReviewDate": "Apr 30, 2018", "userURL": "http://www.goodreads.com/user/show/58869663-deb-le", "userReview": "This book is just an amazing start to a series. I was sucked in from the first words. The reverse harem is pleasantly introduced, the dragon shifter theme too. I loved the characters - especially Reven. Fantastic plot and world construction. Can't wait to explore this series in more detail. I voluntarily received an ARC of this book."}, {"userName": "Cynthia", "userReviewDate": "May 02, 2018", "userURL": "http://www.goodreads.com/user/show/47267246-cynthia", "userReview": "This is the first book in the stroke the flame series. I really liked this book and liked the character development. This story is about Kira and her five mates. It’s about her finding out she is the next black dragon and that she has to mate with her four mates before that can happen. I am eagerly waiting for the second book in this series. I received this book for an honest review"}, {"userName": "Ashley Bullock", "userReviewDate": "May 03, 2018", "userURL": "http://www.goodreads.com/user/show/48538270-ashley-bullock", "userReview": "When the dragons that run the earth have gotten out of control, the gods choose new dragons. Kira and her men have to travel the realms to each Gods temples to receive all their powers. Then... they have to take down the current black dragon and her men. The characters of this book are great and can’t wait for book 2."}], "description": "Four sexy dragon shifters. A huntress with a dark past. A bond that could save the world.I’ve spent my entire life running from my past and staying out of trouble. That’s how I’ve kept alive ever since my parents were killed by the Black Dragon, who’s ruled the world under her oppressive talons for as long as anyone can remember.But it’s hard to keep a low profile when four handsome strangers turn up in your village claiming you’re destined to save the world. According to them, they’ve been chosen by the gods to become elemental dragons—and I’m their mate. Which means one day I’ll be the most powerful dragon of all, able to control all four elements. Assuming I can unlock my powers first…by getting intimate with each of my sexy mates. Auric, the clever prince. Jasin, the cocky soldier. Slade, the protective blacksmith. Reven, the mysterious assassin. And me. We’re the only ones who can bring balance to the world and overthrow the Black Dragon—if she doesn’t tear us to shreds first.STROKE THE FLAME is the first book in a new steamy reverse harem fantasy series.", "title": "Stroke The Flame\n      \n          (Her Elemental Dragons #1)", "url": "http://www.goodreads.com/book/show/39005858-stroke-the-flame", "average": 3.95, "cover": "https://images.gr-assets.com/books/1520290025l/39005858.jpg", "reviews": 54, "authors": [{"url": "https://www.goodreads.com/author/show/6315922.Elizabeth_Briggs", "name": "Elizabeth Briggs"}], "type": ["Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance"], "outlinks": ["http://www.goodreads.com/book/show/39005858-stroke-the-flame", "http://www.goodreads.com/book/show/22137739-more-than-music", "http://www.goodreads.com/book/show/26722944-future-shock", "http://www.goodreads.com/book/show/23484829-more-than-exes", "http://www.goodreads.com/book/show/38140856-hollywood-roommates", "http://www.goodreads.com/book/show/22434327-more-than-comics", "http://www.goodreads.com/book/show/19755140-embassytown", "http://www.goodreads.com/book/show/32858845-off-to-be-the-wizard", "http://www.goodreads.com/book/show/33616599-beneath-the-shine", "http://www.goodreads.com/book/show/10931746-the-stepford-wives", "http://www.goodreads.com/book/show/22583196-time-s-divide", "http://www.goodreads.com/book/show/13604418-the-long-earth", "http://www.goodreads.com/book/show/20526820-gilded", "http://www.goodreads.com/book/show/26580636-infinity-lost", "http://www.goodreads.com/book/show/34111309-the-man-of-legends", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/40193375-fellside", "http://www.goodreads.com/book/show/18108877-timebound", "http://www.goodreads.com/book/show/25071002-the-banished-of-muirwood", "http://www.goodreads.com/book/show/40204943-muirwood", "http://www.goodreads.com/book/show/18806963-prayers-to-broken-stones", "http://www.goodreads.com/book/show/18126623-2061", "http://www.goodreads.com/book/show/29425329-alas-babylon", "http://www.goodreads.com/book/show/40193696-3001", "http://www.goodreads.com/book/show/40205002-fractured", "http://www.goodreads.com/book/show/29103028-the-queen-s-poisoner", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/9409759-powers", "http://www.goodreads.com/book/show/38213061-leviathan-wakes", "http://www.goodreads.com/book/show/18162904-dreams-and-shadows", "http://www.goodreads.com/book/show/36316055-touch-of-eternity", "http://www.goodreads.com/book/show/35106805-touch", "http://www.goodreads.com/book/show/40192858-dragon-rider", "http://www.goodreads.com/book/show/23249416-an-unwelcome-quest"]}