{"ratings": 1048, "userreviews": [{"userName": "Chocolate Panda", "userReviewDate": "Dec 25, 2017", "userURL": "http://www.goodreads.com/user/show/32910487-chocolate-panda", "userReview": "The stories in the book are mostly Christianity moral lessons.At some parts, I felt like the author was being biased. You know, wearing a short skirt and a thick make-up doesn't make someone lousy or bad. It was a cliché thing to do to make readers feel oooh that character's amoral. *poker face*And no constancy in characterization. Levi's character was like this:rough, straightforward, naive, flirty.and he goes on a trip and returns and turns out to be like this:educated, gentle, nerdy, know-it-all.and that just happened. Imagine \"Catwoman\" from Batman went on a trip to somewhere and then returned home wearing granny's clothes and saying \"I'm not the Lady I used to be\" without no clear reason. That's something that happened with Levi. he goes to a trip and returns *tadaaa* a completely different person. It's not a character development, it's a character killer!"}, {"userName": "Jaime Aleshire", "userReviewDate": "Dec 26, 2012", "userURL": "http://www.goodreads.com/user/show/14140655-jaime-aleshire", "userReview": "First things first I was so hoping Merry would've chosen Levi! He was a great loyal friend for many years and Merry had also grown to love him in a romantic fashion. Whereas Jon dated Merry's friends frist which made it seem like Merry was nonexisitent to him. Overall I absolutely love this book. It was a page turner for sure. I loved Merry's character she was genuine selfless sensitve caring and a lover of Jesus. The amish neighbors, the Zook's and the englishers the hanson's both had an unbelievably cozy warm loving safe home environment. Although they had differences in their religious practice, the most common thread that they both shared was Jesus Christ. He was the core foundation in both households which in turn definitely help them whether through any storms of life that came thier way. Jesus brings unity as he did on summerhill lane."}, {"userName": "Courtney", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/64111391-courtney", "userReview": "This novel is set in the eyes of a adolescent teenager as she begins to realize that not everything is always as it seems. This novel shows that even people, the one's that you trust, can betray you and there is nothing that you can do about the decisions that they make for themselves. Very moving and inspiring, makes me glad that I didn't face what she has had to deal with when I was her age."}, {"userName": "AlixJamie", "userReviewDate": "Jun 12, 2010", "userURL": "http://www.goodreads.com/user/show/3862413-alixjamie", "userReview": "The first one was good, this one fell flat on its face and further. I had to force myself to finish it. First of all, I was very disappointed to see that Mrs. Lewis had run even further into the ridiculously impossible with her \"normal\" teenager. Merry does not live a normal life. She can't get past a school year or summer vacation without running into a myriad of problems that receive interesting and varied action from Merry and her pack of friends. I was really angry that Levi didn't get Merry. He was ten times more interesting than Jon. Practically all these stories were fake and contrived. I especially thought that whole thing with their neighbor's \"mysterious\" computer room and the tacky and utterly ludicrous falling-through-the-ice-and-forgetting-only-about-the-boys-she-was-puzzling-over episodes were very stupid. For pete's sake, if you can't come up with a better way to solve a boy problem than temporary forgetfulness, I think you need to take a break and refresh your mind. Also, what in the world did both those boys see in Merry? She's nothing fantastic. In fact, she's really dull and quirky. Another thing that really frustrated me was the fact that they brought that whole grief issue over Faithie back into this book. I thought that had been resolved in book no. 1. She did take that picture of her tears on the gravestone and gave up her grief in \"Whispers Down the Lane\", didn't she? So why put us all through that again? I didn't care about Faithie. I had never been introduced to her personally, so when she wallows so much in grief, I just roll my eyes and scan the page for the point when she stops.The whole alliteration thing got me too. It's so tacky! Enough said. I'm just glad there isn't a third one."}, {"userName": "AlixNicolee", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/2666096-alixnicolee", "userReview": "This series of books was like riding a roller coaster. Sometimes the cart would take me up and above all so I could see everything that was happening, and then it took me down into a tunnel, and I became completely oblivious of the things around me. A part in this book made me want to cry and smash something, becuase it was so frustrating and I knew what was supposed to go on and the main character didn't have a clue-but she made an incredible turn around and I became content again. Merry Hanson goes through many challenges throughout these books, all coming together for a peaceful ending, one that I thought could be better, but was meaningful in a way, considering all that Merry had been through. And, like the roller coaster, it looped around and gave me butterflies, then came in to a sudden halt and it was over. And what good is a roller coaster if you don't go on it again and again?"}, {"userName": "Kaylie", "userReviewDate": "Jun 03, 2010", "userURL": "http://www.goodreads.com/user/show/3823552-kaylie", "userReview": "I hated the ending Levi should have ended up with merry in my opinion."}, {"userName": "Godsprincess", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5949683-godsprincess", "userReview": "love it relly enjoyed definetly recommend..helped me view some of lives chalanes in a different way...worth the read!"}, {"userName": "Tinydancer714", "userReviewDate": "Feb 28, 2011", "userURL": "http://www.goodreads.com/user/show/3269177-tinydancer714", "userReview": "It was a really good book. It gave a great view of God and Merry's belief. Definetly one I would reccomend for you to read :)"}, {"userName": "Tabitha", "userReviewDate": "Jan 09, 2013", "userURL": "http://www.goodreads.com/user/show/10228875-tabitha", "userReview": "Loved this book! It was Christian, had some clean romance, and overall jut fun to read! The first one was, no doubt, better than the second, but the second is still awesome!:D"}, {"userName": "A", "userReviewDate": "May 08, 2018", "userURL": "http://www.goodreads.com/user/show/78837603-a", "userReview": "Merry Hanson, young, strong and living her life throughout the many difficulties it brings. A general summary of the book is Merry Hanson and the aid she gives to her friends that are in need; even though she struggles at times with her own personal life she still gives all she can to help those in need. The author Beverly Lewis does an amazing job showing the internal struggles and fights that goes on in the inside; and we're able to see these personal struggles due to the first person view. This book is a genuinely good read that remains encapturing from beginning to the end. I enjoyed the book very much because although long, I was able to laugh and enjoy the large story line about Merry and her many triumphs. One factor I believe that should have been altered was the inconsistency with some of the characters traits, for example Levi and his changes from start to finish. I would recommend this book to my friends because of it's great detail and intense stories."}, {"userName": "Mary Painter", "userReviewDate": "Mar 14, 2018", "userURL": "http://www.goodreads.com/user/show/29193272-mary-painter", "userReview": "very good book"}, {"userName": "Hannah Schuck", "userReviewDate": "May 30, 2018", "userURL": "http://www.goodreads.com/user/show/75350434-hannah-schuck", "userReview": "Well..... *gasps* That was an unexpected ending! But I liked it! ^.^"}, {"userName": "Adrienne", "userReviewDate": "Oct 18, 2012", "userURL": "http://www.goodreads.com/user/show/7272352-adrienne", "userReview": "Crunched for time in late 2012, so short review... 1. I would recommend reading the first volume before reading this one. In addition, please note that these volumes were originally released as small novellas, so this affects quite a few things--some mentioned below. 2. There were several parts during which I almost set the entire second volume down (never to return). I was simply bored--and with so much reading material available in the world, this will definitely drive some readers away. 3. The writing level fluctuates--in some sections, the writing is good (never great). In other sections, the writing is poor. Part of this is likely due to the fact that volumes were originally released as novellas. 4. Plot--To be fair to the author, she has quite a bit to juggle. However, some plots are overly-simplistic or overly-obvious. Others are handled poorly or left dangling. 5. In my opinion, the relationship between Levi and Merry drives the story--plus, the Amish characters add an excellent extra component to the stories. The relationship (or lack there-of) between Johnathan and Merry is an annoying distraction--not because many teenage girls are not fickle in real life (Boy, are they ever!), but because the author fails to develop Johnathan's character. This causes the reader to care little for their relationship or Merry's pining over him. 6. Do not get me started on \"Alliteration-eze!\" 7. For me, it is a disappointing ending, and the lack of an afterword is also disappointing!"}, {"userName": "J.E.B. Spredemann", "userReviewDate": "Jun 16, 2013", "userURL": "http://www.goodreads.com/user/show/15523369-j-e-b-spredemann", "userReview": "First of all, I think Beverly Lewis is a gifted writer. She is talented with adding what I call \"fluff\". I enjoyed the two-volume series of Summerhill Secrets, but I was VERY disappointed with the ending. I'm hoping that Beverly Lewis will write a third volume and give readers the end we were expecting and wanted. Both of my daughters read the series and have the same sentiments.I'm thinking that perhaps the publishers didn't want her to write a third volume? We can only guess...I would have given this book 5 stars, but the outcome was just too disappointing. :(P.S. I enjoyed the alliteration game!"}, {"userName": "Nicolette (FallingOverBooks)", "userReviewDate": "Jun 03, 2012", "userURL": "http://www.goodreads.com/user/show/9970130-nicolette-fallingoverbooks", "userReview": "I was an okay book. I wouldn't recommend it to anyone really, unless you love novels written about Amish folks or you love God. I did however enjoy the message of the book. No matter what happens in life God will always be there, pray and everything will be alright. I thought it was pretty boring at some parts and I wish Beverly Lewis would have had more story about *spoilers* Merry losing her memory, it was kinda forgotten and never mentioned again, I just wish there was more about that. But other than that, the book was pretty boring, I don't think I will be reading this book again, or any books written by Beverly Lewis."}, {"userName": "Emily", "userReviewDate": "Jul 16, 2012", "userURL": "http://www.goodreads.com/user/show/10657646-emily", "userReview": "I really enjoyed the Summerhill Secrets series. Mary is an inspiring girl, because she has such a strong faith in God. The book is almost like a diary, with entries in Mary's point of view. I liked all of the short stories equally- some were funnerier than others, some more serious, but they were all great. As you read the different stories you can see that Mary is growing up and maturing. The Alliteration Game is a nice touch to the book."}, {"userName": "Kirsten Joanna", "userReviewDate": "Jan 19, 2012", "userURL": "http://www.goodreads.com/user/show/7444015-kirsten-joanna", "userReview": "Oh my goodness, one of THE best books I have ever read. I loved Merry Hanson and felt that in the book you could really connect with her. The way that Merry was with her cats was absolutely adorable. Since I am a cat person also, I was on the edge of my seat until she found Abendigo. I really felt for Chelsea when her mom joined that cult. Beverly Lewis You are my newest fav author! :D"}, {"userName": "Rae", "userReviewDate": "Apr 02, 2014", "userURL": "http://www.goodreads.com/user/show/8368365-rae", "userReview": "Okay I really liked the first volume and I had really high hopes for this book. The author did a great job and I loved it. Except, !!SPOILER!! Levi and Merry don't end up together!! Nooooo!! I really loved them as a couple. While the author did do a good job of explaining why not and having Merry deal with it. I still wanted Levi and Merry Zook! So that's why this book gets a lower rating from me."}, {"userName": "Jennifer", "userReviewDate": "Dec 31, 2011", "userURL": "http://www.goodreads.com/user/show/4139457-jennifer", "userReview": "The alliteration game, part of the never ending Jon or Levi question, drags down a couple of the books, as does the overdose of cat moments -- far too much of which is just filler. But the characters remain nice people to visit, and though the plots are generally devoid of interpersonal dramatic conflict, each novel leaves the reader feeling good. The best book by far in this collection is Hide Behind the Moon."}, {"userName": "Jennifer", "userReviewDate": "Jul 19, 2014", "userURL": "http://www.goodreads.com/user/show/29045554-jennifer", "userReview": "Volume 2Volume 2Some say these books r just for young people but I did enjoy this series myself of course it didn't end the way I would have wanted it too. I like the way Merry kept her faith through very situation . for a young person that is a lot to say. sometimes I think these characters. are real people. that what likeability Beverly Lewis writing."}, {"userName": "Carole B", "userReviewDate": "Apr 24, 2009", "userURL": "http://www.goodreads.com/user/show/1810641-carole-b", "userReview": "I probably should've read the first one first. A friend let me borrow this one, and it was alright, the plot moved along, but it failed to really engage me. Merry is sixteen, or so the author says, but her preoccupation with boys is the only thing that makes her seem that old. If you left out all the references to age, she could pass for about thirteen."}, {"userName": "Katy Goodwin", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/7714098-katy-goodwin", "userReview": "Spoilers Ahead for the End of the Series: Ugh. This volume was doing very well until about halfway through. Let me say... Jon is a jerk. Merry shoulda chose Levi. It was almost my very favorite series when I was little except for that.Even now, looking back on it, Levi was just so much better to her. That aside, check back on my review for Summerhill Secrets 1 for more on these books. :)"}, {"userName": "Jill", "userReviewDate": "May 25, 2010", "userURL": "http://www.goodreads.com/user/show/3782332-jill", "userReview": "I liked this book. It's really 5 books in one, sort of a collection of the whole series. I plan on sharing it with a friend in h.s., as the main character is a high schooler. I'm glad I read it, but it's not my favorite. I couldn't relate to the main character as much as I could with other main characters in Beverly Lewis' series."}, {"userName": "Kasey ", "userReviewDate": "Dec 01, 2009", "userURL": "http://www.goodreads.com/user/show/2170236-kasey", "userReview": "It's amazing! I have learned a lot about the Amish from this book. I also have learned a lot about God and faith and jumping back into life after a tragedy. It was hard for Merry to overcome her twin sister's death several years ago. But, she managed to have friends and love and be able to get through life. I love it so much and I wish there were more books to this series."}, {"userName": "ANNETTE", "userReviewDate": "Aug 11, 2016", "userURL": "http://www.goodreads.com/user/show/43204327-annette", "userReview": "This was an easy book to read and loved Miss Merry and Jon , Levi. A very clean romance . Some of the stories I wish were a little longer or continued with another volume.This book had God and love all wrapped in it."}, {"userName": "Mylinda", "userReviewDate": "Apr 25, 2009", "userURL": "http://www.goodreads.com/user/show/1427063-mylinda", "userReview": "these books were deffinitly writen for a Jr. High age crowd. While it was an interesting story, there were a lot of little things that bugged me. I guess to a young teenager they might just relate but to me it was annoying. Anyway, it was an OK book."}, {"userName": "Rachel", "userReviewDate": "Aug 04, 2008", "userURL": "http://www.goodreads.com/user/show/1231694-rachel", "userReview": "I love these stories! I wish I had great friends that close like Merry does."}, {"userName": "Jennifer Love", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/5896158-jennifer-love", "userReview": "Fantastic! I wish there was another volume after this one!"}, {"userName": "Anna Oldham", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/23211583-anna-oldham", "userReview": "I live the whole book but I didn't like the ending of it. But that depends on who you like in the book. But I recommend tween or teenager, or even adult Christians to read this book! It's awesome!"}, {"userName": "Shelley Whiteside", "userReviewDate": "Sep 13, 2010", "userURL": "http://www.goodreads.com/user/show/4284028-shelley-whiteside", "userReview": "Excellent book, and just love the writer's style."}], "description": "Set in rural Pennsylvania's Amish country, SummerHill Secrets follows the true-to-life struggles and heartfelt triumphs of sixteen-year-old Merry Hanson. Teen girls will come to love, laugh, and cry with the impulsive Merry as she encounters intriguing mysteries while also struggling to be the best she can be in God's eyes. Volume Two contains House of Secrets, Echoes in the Wind, Hide Behind the Moon, Windows on the Hill, and Shadows Beyond the Gate.", "title": "Summerhill Secrets: Volume 2\n      \n          (Summerhill Secrets #6-10)", "url": "http://www.goodreads.com/book/show/1241571.Summerhill_Secrets", "average": 4.21, "cover": "https://images.gr-assets.com/books/1441048450l/1241571.jpg", "reviews": 56, "authors": [{"url": "https://www.goodreads.com/author/show/34227.Beverly_Lewis", "name": "Beverly  Lewis"}], "type": ["Amish", "Christian Fiction", "Christian", "Young Adult", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/1241571.Summerhill_Secrets", "http://www.goodreads.com/book/show/6570991-summerhill-secrets-volume-2", "http://www.goodreads.com/book/show/20438671-summerhill-secrets", "http://www.goodreads.com/book/show/508413.The_Shunning", "http://www.goodreads.com/book/show/80750.The_Covenant", "http://www.goodreads.com/book/show/141679.The_Betrayal", "http://www.goodreads.com/book/show/913437.The_Confession", "http://www.goodreads.com/book/show/65134.The_Sacrifice"]}