{"ratings": 190, "userreviews": [{"userName": "B K", "userReviewDate": "Apr 25, 2013", "userURL": "http://www.goodreads.com/user/show/19781019-b-k", "userReview": "Best Zombie book ever. I have friends and relatives who are not Zombie fans and they loved it too. Needs to be made into a movie or TV series like The Walking Dead."}, {"userName": "Kelli", "userReviewDate": "Jul 07, 2017", "userURL": "http://www.goodreads.com/user/show/31122437-kelli", "userReview": "3.5I enjoyed this. The POV is from at least 6 different characters. I typically prefer fewer, and most often a single POV. However, that worked nicely here. This is a nice consistent fast pace. It's not the greatest zombie series I've ever read, closer to average. However, it's a solid average zombie book, that extends into 3 additional books. It follows same characters. I'm not sure 4 books were necessary. However, I liked being able to see the story over a significant time frame, first days through 10+ years following. I enjoyed it enough that I continued to read the next books. Do I feel any different from prior to reading series and today, no. It's not a series that's very rememberable. It's simply a decent zombie read, that can help you easily pass some time if needed."}, {"userName": "Dave", "userReviewDate": "Nov 04, 2017", "userURL": "http://www.goodreads.com/user/show/11895814-dave", "userReview": "4starsEngaging story from start to finish. Firstly I've read some reviews of people complaining about to many characters in the book but in my opinion all the characters have a roll to play to make the story come together in the end.This is where Kindle excells in my opinion use the x.ray feature. Back to the book. 4 stars for me. Like the way the zombie apocalypse started and how it was explained how it started.will be reading the rest of the series for sure. scary, bloody, gruesome. Loved it."}, {"userName": "Jeanette", "userReviewDate": "Oct 01, 2017", "userURL": "http://www.goodreads.com/user/show/31528104-jeanette", "userReview": "Survival...This is a really good series. My favorite genre for now. The characters are really well written. The author took the time to actually give us a glimpse of who they are.The storyline was carried thru out the book and that must have taken some time as there were multiple characters to deal with. Some who didn't make it & some you wish hadn't made it.I especially liked the vignettes of people in between chapters. Some smart about surviving while others don't even know where to start.Enjoyable read...off to the next...🐱"}, {"userName": "Ernest Godfrey", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/54880961-ernest-godfrey", "userReview": "Don't waste my timeBoy was i wrong with this missed the zombie thing have up on page 13 total rubbish not worth reading"}, {"userName": "Robin S.", "userReviewDate": "Jul 30, 2017", "userURL": "http://www.goodreads.com/user/show/13167162-robin-s", "userReview": "Great readA very good read love the way the people were woven into the story would recommend to anyone. In fact i already have."}, {"userName": "Ozsaur", "userReviewDate": "Oct 27, 2015", "userURL": "http://www.goodreads.com/user/show/17781193-ozsaur", "userReview": "Soooo many characters! There are at least 10 POV characters, plus all their friends and family members, plus acquaintances, plus everyone they ran into, plus people who got names but never actually appeared in the story, then a few dogs, and a goldfish. I think the goldfish is the only one that didn't get a name.On the plus (heh!) side, the action never quits. The story moves forward at a relentless pace in spite of the frequent POV changes. There's always something happening - escapes, sneaking around, fights, searching for someone, hiding etc. And there's plenty of zombie action. I liked the clever reasoning behind why there were both fast and slow zombies, and why some were higher functioning than others.Another thing I liked was this was a good, long, juicy read. No weeny novella pretending to be a novel - and charging novel prices. You get a lot of bang for your buck with this one.I do have to say, there was one thing that nearly knocked this down to two stars for me. One character cracks up toward the end, and I didn't think it worked for that character. The way the insanity was expressed was repugnant, and made no sense to me. The graphic rape scene didn't help. There were a few other flaws, but this is the only place where I felt the writer really slipped up.With that said, I'll probably read other books by this writer."}, {"userName": "Erica Goetz", "userReviewDate": "Dec 31, 2015", "userURL": "http://www.goodreads.com/user/show/50367596-erica-goetz", "userReview": "Survival Instinct by Kristal Stittle came across my kindle with my kindle unlimited plan. I read dozens of zombie books these days. The blurb of the book describes the main plot premise, city, virus, rats, people and survival. I found this book ok. It wasn't the best or worst of zombie books I have read. The writing was tight and moved very quickly. There was enough to give you a sense of the characters, BUT, there was simply too much bouncing around between individuals without knowing who the protagonist is. Granted, several characters can be the valiant hero of the story, but there was just something about the number of characters, the level of focus on them, then the randomness which some died off while others lived on. Usually, I sit down and just consume a book in one sitting. This simply didn't keep my interest enough. I've started the second one, as I prefer not to leave a series unread. But I'm dragging my feet to finish it."}, {"userName": "John Mccrory", "userReviewDate": "Dec 23, 2013", "userURL": "http://www.goodreads.com/user/show/17100129-john-mccrory", "userReview": "I thought this was an okay Zombie book. My main problem with this one was that they're so many people to keep up with it gets confusing at times with all the jumping back and forth from person to person. Once you figure out who's who it is an enjoyable read. I read this book in 2 days and started the next one right after. Would recommend to read if you like zombie books."}, {"userName": "Mark Vargo", "userReviewDate": "Sep 11, 2015", "userURL": "http://www.goodreads.com/user/show/5122735-mark-vargo", "userReview": "No better or worse plot than many under-edited zombie books, but suffers from the annoying habit of describing every action as a sign of the actor's deeper character. How about you tell us what the characters do (and maybe even what they think) and, if you're any good at it, we'll figure out who they are?"}, {"userName": "Shelley Deuso", "userReviewDate": "Apr 28, 2013", "userURL": "http://www.goodreads.com/user/show/7066604-shelley-deuso", "userReview": "I loved this book and totally wish the author would consider a part two. I was a little disappointed that it ended like it did. I was so into the book that I wish it could just go on so I can find out what happens to everyone."}, {"userName": "Brian", "userReviewDate": "Mar 16, 2014", "userURL": "http://www.goodreads.com/user/show/19493456-brian", "userReview": "4/5 for what it is, 3/5 in general. The cover makes it clear exactly what you're getting with this book. Overall, this was a fun read with a straightforward narrative; I enjoyed the style of shifting POVs each chapter. I'm sure Faulkner would be pleased."}, {"userName": "Kelly", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/9063433-kelly", "userReview": "I really enjoyed this book. It takes you through various characters journeys to eventually all coming together ... ATLEAST the survivors that is. Sizable read that keeps your interest ."}, {"userName": "Sacha Stonge", "userReviewDate": "Aug 12, 2013", "userURL": "http://www.goodreads.com/user/show/21405350-sacha-stonge", "userReview": "It was a great book with great characters, a great plot and great writing!!"}, {"userName": "Stephanie Chadwick", "userReviewDate": "Mar 04, 2014", "userURL": "http://www.goodreads.com/user/show/15950642-stephanie-chadwick", "userReview": "Probably the best zombie book I've ever read. I'll be getting the sequel ASAP."}, {"userName": "Ruger95", "userReviewDate": "Jan 16, 2014", "userURL": "http://www.goodreads.com/user/show/5991006-ruger95", "userReview": "Great idea, didn't like the execution. Have to go through many chapters to meet the characters. Eventually they become connected. Last 1/3 of book was enjoyable."}, {"userName": "Cathy Harris", "userReviewDate": "Jan 09, 2016", "userURL": "http://www.goodreads.com/user/show/14105987-cathy-harris", "userReview": "Great readFive stars on this book. I loved the characters. It looks like the beginning of a great series. Read on."}, {"userName": "Andrea", "userReviewDate": "Feb 02, 2014", "userURL": "http://www.goodreads.com/user/show/6608084-andrea", "userReview": "Might be the best zombie book I've ever read."}], "description": "On the surface, the city of Leighton is just like any other city: tall buildings, busy streets, and populated by a wide variety of people. It also has rats. These vermin are unlike the average pest, because they are carrying a deadly contagion. Havoc ensues as the devastating virus seeps into the unsuspecting populace, turning friends and family against each other. Atrocities of savage behavior are spreading faster than people can outrun, and the citizens get recklessly desperate. Whether by joining forces, or by standing alone, survival is on everyone’s mind. Unfortunately, not everyone will escape with their life.", "title": "Survival Instinct: A Zombie Novel", "url": "http://www.goodreads.com/book/show/17665107-survival-instinct", "average": 3.97, "cover": "https://images.gr-assets.com/books/1364546575l/17665107.jpg", "reviews": 19, "authors": [{"url": "https://www.goodreads.com/author/show/6473254.Kristal_Stittle", "name": "Kristal Stittle"}], "type": ["Horror", "Horror", "Science Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/17665107-survival-instinct", "http://www.goodreads.com/book/show/18934334-survival-instinct", "http://www.goodreads.com/book/show/19181393-adaptive-instinct", "http://www.goodreads.com/book/show/23786636-fighting-instinct", "http://www.goodreads.com/book/show/29453553-defensive-instinct", "http://www.goodreads.com/book/show/30328206-merciless", "http://www.goodreads.com/book/show/36030794-yellow-line", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}