{"ratings": 45823, "userreviews": [{"userName": "Melissa ♥ Dog/Wolf Lover ♥ Martin", "userReviewDate": "Sep 29, 2016", "userURL": "http://www.goodreads.com/user/show/17438949-melissa-dog-wolf-lover-martin", "userReview": "$1.99 on Kindle today 6-10-17Once again, thank you to goodreads friends for finding me another book to love! There are so many people I fell in love with in the book. Also, Mule and Killer! Let's just begin. . . The book is about us stupid humans trying to bomb each other into extinction, but I digress. I fell in love with Sister Creep, Swan and Josh. I also loved Artie and Paul and Mule and Killer and . . . . there are so many. We start out with each person's story, where they are in the world and what is going on when the shite hits the fan. And how they all come together at some point in the book. Swan is living with her mom and the latest boyfriend when they leave and decide to go to another state for reasons. Josh is a gynormous wrestler that is finished with his latest match and is traveling to the next state. Sister Creep is just preaching and wandering around doing her thing (she's homelesss). The people I was the least interested in, were Macklin and Roland, they were doing their military stuff and they were pretty much evil. The devil/demon/man/thing is watching a movie about death and destruction over and over at the theater. The story then takes us to what happens after everything hits and what every one is doing after the fact. Sister meets up with Artie who was at a shoe convention. Artie and Sister decide to travel together and on their way out of town, Sister finds this piece of glass with diamonds and stuff in it outside of Tiffany's. Correction - what used to be Tiffany's. She finds some other stuff too but this is a magical ring/crown/ thing. The ring can make you see things when you hold it. This is what sets Sister on a goal, she sees something inside every time she touches it. She being led somewhere. Other people can touch it and see different things, like food or water and they feel better. It's like it really happened. And of course the evil man wants it for himself. He knows what the ring, Sister and Swan can do with it. Meanwhile, Josh stops at a gas station and ends up meeting Swan and her mom there. They all end up buried underground in PawPaw's little home below the ground. There is a reason why he lives under his store and it will tell you in the book. They stay down there for quite some time before a little gopher shows them a way out. The main thing is that Sister and Artie and Swan and Josh all meet new people on their travels. Some are not very nice of course and others are great. Some that you love part ways and others take their places. People are killed, I mean you know that's going to happen. Swan and Josh pick up Killer and Mule along the way. They are the horse and the dog. Sister is out to find Swan, but she's not sure for years who or what it is she's actually supposed to find. I mean seven years traveling across the country trying to find one person with the demon on your tail. Swan, Josh, Mule and Killer actually start traveling with an old clown named Rusty. There are just so many things to the story that you can't even imagine or even talk about in a review. I can tell you that this story made me cry and it didn't get boring to me accept when ole Roland and Macklin came into it. I don't know, it was just me. I didn't like them. I would read it and want to hurry to the better parts of the book. If your worried about reading a tome like this one then don't. The chapters are short and they move from person to person, but it's not confusing in the least. One chapter will leave you on a cliffhanger and change to something else going on in the world. Lol It doesn't matter, I loved it and I hope anyone else that reads it loves it too. ♥ For Mule and Killer, you were around for many years you sweet babies, in the middle of a war to boot! The second part of the book takes place 7 years later and there is all kinds of weird stuff going on with Swan and Sister. I can't tell you what all, just read it! READ IT! MY BLOG: Melissa Martin's Reading List"}, {"userName": "Emily (Books with Emily Fox)", "userReviewDate": "Mar 21, 2018", "userURL": "http://www.goodreads.com/user/show/58160628-emily-books-with-emily-fox", "userReview": "This is one of the darkest post-apocalyptic books I've read in a while... totally satisfied that craving. I may have had a few bad dreams about it!What I would have liked knowing beforehand:- Nuclear war with Russia- There are fantasy elements in here- Yes, it's long...- There's a war going on so if you're not really into military fiction... won't be for you!- Overall it was almost too realistic...- Did I say it was really dark?I would recommend it!"}, {"userName": "Dan Schwent", "userReviewDate": "Aug 22, 2008", "userURL": "http://www.goodreads.com/user/show/870755-dan-schwent", "userReview": "What if the apocalypse that befell the poor souls in The Stand was nuclear instead of viral in nature and the whole thing was written in a style more like Richard Matheson's than Stephen King's? Well, you'd probably have Swan Song.Comparisons with the Stand are inevitable. Both are about the survivors of an apocalyptic event and both have a devil type figure walking around stirring things up. Swan Song doesn't have that final battle between good and evil thing going like the Stand did, although some of the events could be interpreted as such.Swan, the title character, starts off as a little girl who's strangely good with plants before the bombs drop. As the story unfolds, she's joined by Black Frankenstein, aka Josh Hutchins, a professional wrestler. They're wandering, looking for other survivors. Josh has been tasked with protecting Swan and does his best. The other main protagonist is a former homeless woman called Sister, who has a glass ring with unusual abilities. Their paths eventually cross with the Army of Excellence, led by Colonel Macklin, an unhinged Vietnam war hero, and Roland Croninger, a young millitary enthusiast caught up in playing soldier for real. Throw in crazies like Lord Alvin and the ever-present Man with Many Faces and you've got a winner on your hands.I'll just come out and say it: This book held my interest more than the Stand did. The style was much more gripping and I got attached to Sister, Josh, and Swan. I almost let a tear escape my eye at the end but fought it back.I'd recommend this book to anyone who liked the Stand and other post-apocalypic stories."}, {"userName": "Stephen", "userReviewDate": "Oct 03, 2008", "userURL": "http://www.goodreads.com/user/show/1413439-stephen", "userReview": "4.5 to 5.0 stars. I am a big fan of The Stand by Stephen King and I thought it was the \"standard\" in apocalyptic fiction...UNTIL NOW. Swan Song is THE BEST apocalyptic science fiction book I have ever read. At over 950 pages, this book could have been a chore to get through but that was not the case at all. I flew through it and never found my attention wandering or my interest waning. A truly spectacular novel with a superb cast of really good peeople and REALLY BAD PEOPLE!! Highest possible recommendation!!! Winner: Bram Stoker Award for Best Novel (1988)Nominee: World Fantasy Award for best Novel (1988)Nominee: Locus Award for Best Fantasy Novel (1988)"}, {"userName": "Becky", "userReviewDate": "Dec 08, 2008", "userURL": "http://www.goodreads.com/user/show/1376766-becky", "userReview": "Taking a quick glance through reviews of this book, they seem to have two things in common. One, they all start with a reference to the book's size. And two, they all remark about the comparisons to The Stand. And now mine is no different. Holy SHIT, this was a long ass book... but it doesn't at all compare to The Stand, in my opinion. Was it good? Yeah, good, but for a book this ambitious and huge, I expect more than just good. Part of that is that I think I'd have appreciated it a lot more had I read it before reading The Stand, because I just couldn't quite manage to not compare them, and that did not end up favoring Swan Song. The characters, the plot, the 'characters connected by dreams or visions' thing, the Walkin' Dude... King did it first, and better. Sorry to all the McCammon fans out there... but it's true. I liked the story enough to finish it, but for so very freaking much of it, it felt like nothing was happening. If there's going to be a huge amount of time in between little pockets of tension and excitement, then that time should be spent making me fall in love with the characters. It should be spent making me dread the possibility of their untimely demise. Or it should be spent making me feel like I'm really living in a nuclear winter. (And shit, that wouldn't even be hard, considering this winter has been like Snowpocalypse. So. Tired. Of. Winter. *sob*) What that time should not be used for is repetitive scenes only included in the book to show us Swan's ability... which we had learned about and understood from like... page two. How many times do I need to be shown that Swan \"holds life inside her\"? Because going through it every time we hop back over to a Swan chapter felt like maybe one or two times too many. Although, maybe it wasn't me that McCammon was trying to fill in... maybe it was Swan herself. Not exactly the brightest bulb there, considering how long it took her to figure out that she'd be key in healing the damage that humanity brought upon itself. To be perfectly honest, I didn't really care about any of these characters except Josh, and I'm not sure if that's due to the book, or the reading (I loved the way the reader did his voice), or because I just love big cuddly bearlike men, or even that I just needed SOMEONE to like in this book. Maybe a little bit of all of those. But the rest of the characters I disliked in varying degrees. Evil Dude was Evil. *shrug* What more is there to say? Sister felt... wooden to me. It was only rarely that she displayed any personality at all, and I just couldn't warm up to her. Besides finding and carrying the glass-a-ma-jig, I am still trying to figure out what her role was in the book. Swan... Well, I already talked about her. Roland should die in a fire and then be reincarnated only to die in a fire and be reincarnated only to die in a fire again... and so on, forever. Macklin was just crazy and I kinda felt bad for him, but he was piece of shit crazy, not sympathetic human crazy, so he can die in Roland's fire too. He doesn't have to be reincarnated more than... oh, two or three times. El Presidente. You know, I kinda felt bad for him. In the beginning when we meet him, you can tell he's not prepared for what's happening, he's shit scared of the events that are outside of his control, and he's just trying to cope. But then, all that sympathy that I had for him just evaporated toward the end. Crazy or not... FUCK HIM, man. Who gets to decide to do THAT? Why is that even a thing that would ever, EVER, EVEREVEREVER be developed and actually put in place? Shameful and disgusting. The mere concept of... THAT is worse to me than anything else in this book. By far. He should have died in the fire. However, as much as I loathed El Pres at the end, he's the only character that I felt actually wrestled with their humanity at all. He wasn't a \"Good\" character or an \"Evil\" character. He was flawed and conflicted and just doing what he thought was right for the good of all. Still should have died in a fire though. Coming back to the concept of Good and Evil, I have to say that there was never even a hint of a flicker of gray in any of these characters, with the exception I mentioned above. They were either all GOOD, or all EVIL. The chasm between the two would have to be traveled by goat, three mules, and a barge, and you better pack a lunch because it's a fucking hike to the other side. The fact that McCammon THEN needed to literally show people's \"true faces\", as if we were unclear which side they were on, was again, overkill. All the GOOD people are so beautiful, and all the EVIL people are hideously deformed. Because that's original. One last thing before I wrap this up. I really expected the glass-a-ma-jig to have a vital purpose in the book, and I was very disappointed to learn that I was mistaken in this, especially after ALLLLLLL of the build-up I trudged through, including the 10 minute long (at 3x speed!) 'crowning' scene. For the thing to be relegated to be nothing more than a Rosetta Stone after all of that kind of makes me incredibly angry. So, so very mad. Oooh! ...wonder what this big red button does...?"}, {"userName": "Fabian", "userReviewDate": "Dec 11, 2014", "userURL": "http://www.goodreads.com/user/show/1036893-fabian", "userReview": "Percentage composition of previous or later works of postapocalypse (of a sort) in the DNA of R. McCammon's enormous horror epic \"Swan Song\":41% The Stand novel10% The Road novel (which is actually, in itself, like 7% Mad Max--a source which must NOT go completely ignored)10% Blood Meridian novel (so about 60% of S.S. can be found in King and McCarthy alone)10% Lord of the Rings (6% Two Towers battle + 4% magic ring emblem)5% Lonesome Dove novel5% Dawn of the Dead films (mall battleground, motorcycle gangs...)4% Cold Mountain novel/film3% Death Race/Death Race 2000 film2% Battle Royale film3% Hunger Games (duh) franchise3% (Silvester Stallone's) Daylight1% Poseidon Adventure1% Pocahontas (the colonization tale in the new Wild West)1% Sleeping Beauty (kiss of maiden)1% Snow White (apple symbol & love's kiss)Yeah, the \"whole country's been nuked\" (130) by them lethal Russians. We all knew it would happen, and do it does. After everything is dead and gone, the unlucky remnants begin to establish feudal groups and erect new structures of power and control. Evil forces unite, heroes are made, and characters are killed off in that adorably \"Walking Dead\" fashion. The vigilantes suffer greatly, and its a true blast to read about dead babies & crushed miners, about the annihilation of all humanity... I'm kidding. The gruesome factor is quite high. Superbly, the violence is violent; the blood and gore is supreme.It is too long. It begins to steadily lose steam to a tepid conclusion, something the reader had already expected would occur, but does only at an even later stage.Monoliths of horror: Gotta love 'em!"}, {"userName": "The Pirate Ghost (Formerly known as the Curmudgeon)", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/5555043-the-pirate-ghost-formerly-known-as-the-curmudgeon", "userReview": "Swan Song by Robert McCammon\tEvery now and then, you come across a book where it seems that the complexities of life have been disassembled from reality and reformed within the pages and text. A story that, sometimes in its simplicity, captures the moving parts and varying angles of spirituality, psychology, physiology and sociology like a prism, separates them by colour, strength and depth. Then uses the differing colours to paint a kaleidoscopic tableau that opens our minds to that which is known to be there, but can hardly be seen or touched or felt. An hourglass where all the strength and beauty of humanity dances on fine white sand as it slips slowly from underfoot. How do you describe courage? How do you describe tenacity? Fear? Or desperation? What does hope feel like? Or Evil? It never fails to surprise me how these things sprout out of a fertile imagination in the most unlikely of places. It’s a pleasant surprise.\tFor me, Swan Song, by Robert McCammon is one of these books. This is a tale of survival and desperation, conquest and freedom, kindness and brutalities, good versus evil, and hope versus despair. Now, I know that finding philosophic, symbolic or coded messages in text is a lot like seeing images in clouds. No two people look at clouds the same. A storm arises and the golfer is angry because he can’t play while the farmer is pleased because it will slake the thirst of his crops. Sometimes only a very few people are able to hear the message that lies beneath the text, like my son seeing ice cream scoops in the bloom of fireworks while I only see sparkling lights in the night sky. The ability of a person to perceive a wonderful gift of understanding wrapped in a dark, but powerful story does not prove the author’s intent to put it there. It’s like the crabs off the coast of Japan that Carl Sagan spoke about while cruising the universe in his “spaceship of the mind’s eye.” Crabs with faces on their carapace that resemble the face of a samurai put there by semi-natural selection because of superstitions sailors who did not want to anger the gods. A practice of tossing back any crab that seemed to resemble a face over the centuries produced an entire sub species of marine life that now, as a biological marker in its gene pool grows something resembling the face of a samurai warrior on its carapace. The warriors did not intend to create a species of face bearing crabs. They only wanted to appease angry gods. Yet, the faces are there. Like the crabs, some stories take on a second life that their author never intended, and, over time, the meanings are formed held for a while, and then lost within the pages and lines of type that a writer had never intended. So let it be with Swan Song. I don’t know if McCammon intended to write a spiritually conscious story, or not. I do know that the characters were rich. It was as if the players were tuning forks and with minimal effort but exquisite precision McCammon found perfect pitch in only a few words. Break this story down and you will find nothing complex. The characters are rich but there are many and each one fits into the tableau like the tiny cogs and gears of a precision watch. Some so tiny as to be insignificant on their own, almost invisible, yet, together they mark the passage of time. I’d liken this story to a post apocalyptic “Crash” (Oscar wining Movie) where nobody could see the entire picture until the end. The characters were gritty, hungry and so desperate. I felt like weeping at the horrors that befell them, and feared the villains at their heels. “The meek shall inherit the earth?” Not on your life, they’ll have to take it. The strong want everything. Most walks of life were represented here and no group or social standing too the burden of the heat. McCammon left the earth so scorched and dark that I felt pangs of regret, then, at the last moment, there would be a single ray of hope, or blossom of sunshine. Admirable people that started the story as we are, simple humanity, then they became champions of heaven to lead the rest from purgatory or trying to swallow their souls and condemn to burning black of hell. , Josh’s strength, Swan’s Hope, Sister’s faith, Rusty’s Kindness, Rolland’s crazed loyalty, Macklin’s black heart with the Shadow Soldier looking over his shoulder. I even liked the wickedness of the villainy. Yet, amid the spectrum of humanity, broken down into its rainbow form through the characters, McCammon wove a tail of good versus evil. Faith versus the devil with mankind as the tools of righteousness and destruction, weakened by the same free will that is both a blessing and a curse. I haven’t gone into detail about the plot or story because I don’t want to spoil it for you. Surprise is much of the fun in this story. I will say, McCammon gave the most mind blowing ground zero view of the apocalypse I’ve ever read. FANTASTIC! This is down as one of my “five star reads.” The story is long, but you’ll be on the edge of your seat from cover to cover. Where the action isn’t whipping at your soul like a riding crop, it’s playing your heart like a harp. It’s recommended.WarningsShort this time. There is every kind of violence you can imagine in this book. I believe it’s well written, but, I have to concede that it is gritty, and realistic. There is gore in this book. It’s not for the faint of stomach any more than the faint of heart. However, like other reads, there is hope which, for me, overcame the horror and made it all worthwhile. I probably need to add a statement about some of the background characters. I listened to an audio book. I thought the Narrator was very good. However, some of the ethnically black characters spoke in what, as a young man born and raised in the south in the 1970s, remember to be ethnic accents that I heard every day as I'm sure Robert McCammon did, growing up in the Alabama. Now days, these are the voices and words that are used to ridicule those of African heritage. I found these characters to be courageous, dignified and more human than most others. In fact, the ethically black supporting cast, is where McCammon went to show that Humanity still lived, and there were people who cared about others left in the world. He does not belittle these people but, as I understood it, put them ahead of the Caucasian America on the road to regaining humanity. Don't let the dialect of our rich cultural south mislead you. These are wonderful characters who are well cared for and respected. I would add, that where there is such obvious distinction as a dialect makes in a book, the enemy uses those phrases and words that are intended to incite hatred and anger in People of African decent. Their bad guys, just let em be bad and the story will be wonderful. If you are sensitive to words, and some people have legitimate reasons for that, then, as this book gets towards the end, you will hear some of the uglier side of our cultural rich southern heritage. Do not be discouraged. If you see these racially charged words, don't let them blind you like the man with the red eye, follow them and you'll see more hope and strength in those voices than anywhere else in the book. I say this because, as I listened to the Narrator, who was wonderful with voices, my head almost snapped around when I heard these patches of ugly dialog. Either the Narrator, or McCammon (or both) dragged these out of memory with an authenticity that could only come from a person who had actually heard these words and phrases in person. For the record. I believe the Narrator is also black. Trust me...the audiobook is very good also as audiobooks go. Five stars."}, {"userName": "Bark", "userReviewDate": "Sep 23, 2011", "userURL": "http://www.goodreads.com/user/show/2905339-bark", "userReview": "I read this book back when it was first published in the ‘80’s. I was still in high school, had big frizzy hair, wore too much blue eyeliner and pretty much hated my life. I spent most of my free time haunting the local Osco drug for the newest horror paperbacks to escape it all. When I saw this huge tome (900+ pages) I scurried back home with it thinking I had just hit the jackpot. And I had. It turned out to be one of the best horror novels I’d ever read and I was reading a lot back then. This is why I was hesitant to revisit it, some 26 years later, afraid I’d tarnish my memory of fiction perfection. But I did it anyway. I can’t read 900 page tomes anymore because my brain shuts down at the thought but I can read them on unabridged audio. Swan Song became my driving companion for over three weeks and now that I’m finished I already miss the soothing voice of Tom Stechschulte. I’ll have to snap up something else he’s narrated. Maybe “The Road” if I can bring myself to listen to it.If you’ve read this you already know it’s one of the best end of the world novels ever written, if you haven’t read it yet and you’re a fan of the new apocalypse books flooding the shelves, you really need to do yourself a favor and read this one. It is set in the 80’s and we are at war with Russia, trigger fingers set off nuclear bombs and kaboom the world as we know it is gone. The rest of the book focuses on a cast of characters as they make their way in this entirely new world void of all creature comforts like fresh water, sunshine, and warmth. But out of the destruction, a little magic blooms too. Two camps basically evolve. There are the murdering, raping pillagers and the decent people who want to restore the earth and rebuild. The two have an epic, classic collision of good vs. evil. Those are the bare bones of the story but it’s so much more than that. It’s heartbreaking and full of loss as well as hope and it so worth your time.A few notes that you should be aware of before digging in:1.\tThe book doesn’t start with a huge bang. There’s enough setup and character back story here for 3 or 4 modern day books. Woo hoo for me because I can never get enough of that stuff (when it’s good) but maybe not for everyone?2.\tThe action takes a little bit to get going but once it starts there is a lot of it and it’s described in vivid detail. I’m not a huge action fan and I admit I did doze off when the military maneuvers went on (and on). 3.\tThe book skips around from group to group. There are a lot of characters to wrap your head around and I was a little confused here and there but eventually you get to know most of them very intimately. Many of them are flawed people and they’re all changed by their time on the road. I think I enjoyed that aspect most of all. Be warned though, some of these people who you will grow to love will die and you will probably cry. Maybe for a few days.4.\tThis sucker is a 34 hour listen. I thought the narrator did a fantastic job with most of the characters. For the most part, he gave them distinctive voices with the exception of the villains at the very end (to me they all sounded the same screeching out their scratchy-voiced commands). You may want to find a sample online and give it a listen before committing. 34 hours is a long freaking time if the narrator isn’t working for you.5.\tThere’s a hell of a lot of violence and it’s not the prettified, glossy kind. Be prepared.6.\tThere is a strong, 50ish female character as a lead. Where can you find that nowadays? If you find one , tell me so I can buy it.7.\tThere is even a little smidge of a sweet romance amidst all of the chaos. See, there’s something for everyone! Now go read it."}, {"userName": "Mike (the Paladin)", "userReviewDate": "Jun 21, 2010", "userURL": "http://www.goodreads.com/user/show/2187043-mike-the-paladin", "userReview": "Well, I approach this review with some trepidation. A large number of readers here love this book, including a \"Goodreads friend\" whom I usually agree with...(sorry Stephen, Stephanie, Rose). But I just didn't care for it. I found it a \"poor man's The Stand\". The book is full of stereotypes, cliches and tropes. There are old hackneyed ideas \"guns are BAD\", if you look nonthreatening your less likely to be threatened, war is evil...on and on. Some of the story telling put me in mind of the old \"what would happen if they gave a war and nobody came\" idea spouted back in the \"wonderful\" late 60s and 70s. Nobody ever seems to answer that, well I will. What happens? They bring the war to you...We start out with ANOTHER wipe the world out to tell the story scenario, only this is one where we use nukes rather than a germ. The people (characters) other than Swan, Josh, and poor crazed broken Sister are hard to identify with, the story doesn't really hang together within it's own bounds...it just seems to fail on so many levels. The \"Bad Guys\" are basically the remnants of the military (\"military baaaaaad\".). The good guys? kids and a crazy lady (crazy, but of course innocent and nice)...it goes on and on...the characters and plot show the marks of a cookie cutter. I'm sorry all you who love this book, I just don't.I want to interject here that McCammon wrote one of my all time favorite books, Boy's Life Boy's Lifeand I've read others by him I liked a lot, so when I saw the glowing reports on this one I searched it out. But I just found it not nearly up to his standards or to the standards of other post-apocalyptic novels. Read The Stand, Alas Babylon, Earth Abides (more of a downer), this one \"for me\" just doesn't measure up...that's in my opinion of course. Sorry.I will be reading other books by Mr. McCammon, as I've read good books by him, books I really like, but this one goes on my to be sold, traded, or whatever pile."}, {"userName": "Bradley", "userReviewDate": "Feb 14, 2017", "userURL": "http://www.goodreads.com/user/show/4213258-bradley", "userReview": "Maybe if I'd have read this one before I had read The Stand or Lucifer's Hammer, I might have given this a full five stars, but epic length and nuclear holocaust doesn't automatically make a perfect book.However. If you like your dystopias full of a long buildup and full cast and a slow decline into being in the evil camp versus learning you're in the good camp, then I totally recommend this book to you. It's the journey more than anything else that makes this a good read.And then there's also the cool tarot themes and actual inclusion of the tarot reads (and other twists) as well as a whole Christian metaphor springing up all over the place, including the horsemen of the apocalypse and even a huge dose of the resurrection of life, so we've got a pretty cool collection of fantastical elements. Especially Swan, herself, who's definitely magical. :) She's the Greater Mystery, after all, the renewal, the restoration of life. It's kinda sweet.My main problem with this post-nuclear wasteland, however, is one that's been explored so very well in practically every other writer or game designer, (Thank you, Fallout) about the availability of food. Aside from a few big nods to farming, later on, I'd have thought that the acquisition of food might have taken on a bit more of a deadly turn. As it was, all these strangers sharing meals kicked me out of the book.This is no The Road. It's Road lite. With a TON of people and PoVs. And a much heavier dose of magic over the realism. :) And yet, it was quite enjoyable and it's long enough to satisfy anyone's craving for an immersive post-apocalyptic wasteland. :) Horror writers always make the most interesting SFs, imho. :)"}, {"userName": "Lou", "userReviewDate": "May 09, 2010", "userURL": "http://www.goodreads.com/user/show/3699303-lou", "userReview": "An epic story it made me reminisce of other epic stories with similar good versus evil characters, like those of Lord of the rings and the dark tower series.The black Frankenstein, is what he used to be called in his wrestling days, known as Josh and the Bag lady known as Sister creep are two memorable characters that are courageous with plenty of heart. They really made the story that much more great, and obviously Swan a young girl who is a main character through the whole story. She can rightful be placed in the hall of fame of young gifted courageous girls like that of Matilda and the girl from the Firestarter by Stephen King(seen the movie not read yet).The story starts of with a bang literally, two nations engage in a war and cross a point of no return, that results in mass destruction and annihilates most of the country into apocalyptic status.In the post apocalypse setting a band of pilgrims, survivors of the destruction are put to the tests of their lives. They are set out on a journey, a few groups are to cross paths and their destinies intertwine together. Swan a girl that sees the kindness and beauty within all ugliness really gives the dispirited souls and destroyed hearts hope for a better and prosperous future. Will the world blossom again and plant life once more spurt out it richness and fill the stomachs of the starved?There is a dark evil force still present, evil started the ball rolling and it won't leave until every soul is wiped from the earth and the land totally destroyed. This evil does have many faces.Good and evil cross paths many times in this story, war and death is still ever present after the great destruction as groups fight for control and power over land and food. There will be more blood, will there be peace? Finally I completed this novel i was holding off this novel for a special time for some time, it is lengthy but every page worth it. I even listened to this simultaneously via audiobook so that's twice I covered the story.Even more of a great reason was my interview with this humble writer Robert McCammon.Visit my webpage to read the interview during March 2012 >>>>http://more2read.com/review/interview-with-robert-r-mccammon/"}, {"userName": "Algernon", "userReviewDate": "Jan 17, 2012", "userURL": "http://www.goodreads.com/user/show/4728718-algernon", "userReview": "I have read some 15 years ago The Stand by Stephen King. There are some parallels that could be drawn between that story and Swan Song. Both novels are dealing with the collapse of civilization following an apocalyptic event (virus infection in one case, nuclear war in the second) , both are set in the North American Midwest and follow the struggles of scattered bands of survivors. And both books feature supernatural beings as avatars of the forces of Good and Evil fighting for supremacy.Stephen King might be the better writer in terms of character development and prose, but I think The Stand came unglued in the final third and fizzled out in a confusing , unconvincing finale. Not so with Swan Song. Robert McCammon has a much better control of the overall plot, even if his characters felt less subtle and rather unidimensional. The narrative drive sagged a little in the middle of the story, but the action picked up by the end into a real page turner.Swan Song is a much darker tale than The Stand, and Robert McCammon managed an impressive rendering of the destruction wrecked on the landscape and on the human psyche. The battle between the forces of good and evil is slightly too Bible flavored for my tastes and heavy handed in treatment with a too clear separation between the two sides and with little grey areas, but the author has confirmed his natural born storyteller credentials that have impressed me in \"The Wolf's Hour\". His action scenes have the cinematic feel of a high octane thriller, and I think his books would translate well into this medium.[edit for spelling]"}, {"userName": "Joe Valdez", "userReviewDate": "Dec 12, 2014", "userURL": "http://www.goodreads.com/user/show/26876584-joe-valdez", "userReview": "The next stop in my end-of-the-world reading marathon was Robert McCammon's post-apocalyptic epic Swan Song. Published in 1987, nine years after Stephen King's The Stand, the story follows two bands of survivors -- one representing good, the other evil -- as they make their way across what used to be America while a supernatural being no less than Old Scratch himself seeks to undermine the good souls and shift the battle onto the side of evil. Yes, kids, eeriely similar to The Stand. More on that later.The tale begins on July 16 with the President of the United States, a former astronaut, facing a world in crisis. Eight months ago, the Soviet Union unleashed nuclear and chemical strikes on Afghanistan. A twelve-and-a-half kiloton nuclear device has leveled half of Beirut, with dozens of terrorist groups claiming responsibility. India and Pakistan have exchanged nuclear and chemical strikes, and Iraq and Iran follow suit. American and Soviet naval and air forces shadow each other over the Persian Gulf, while off Key West, a trigger happy U.S. fighter jet sends a missile into a crippled Russian sub. The U.S.S.R. responds by blinding American satellites. The President is adamant that he will not start World War III but his advisers remark that the world is already at war. In a game of brinkmanship, he reluctantly gives the A-OK to intercept Soviet submarines on the seas ...Meanwhile, several Americans go about the last day of their rest of their lives:-- In Manhattan, bag lady Sister Creep, whose regular life ended with drunk driving and its aftermath, opens up a razorblade on two men who assault her. Sister uses her last bit of change to enter the subway, where she seeks shelter in a tunnel, plagued by bad memories of what sent her here in the first place.-- In Concordia, Kansas, professional wrestler \"Black Frankenstein\", alias Josh Hutchins, resorts to some stagecraft when his opponent injures himself and risks allowing the bad guy to win the bout. Unlike his character, Josh is one of the good guys, with a wife and two sons in Mobile and a love for donuts.-- In Wichita, Sue Wanda Prescott tends to a garden she's planted outside the mobile home she shares with her stripper mom Darleen and \"uncle\". Swan, who has a gift for growing things and seeing into people, unnerves her mom's latest boyfriend, and after he slaps Darleen, mother and daughter hit the road.-- In Idaho, the Croninger family wind their RV up Blue Dome Mountain, where they're bought a two-week time share in Earth House, an underground compound managed by Vietnam veteran Colonel James Macklin. The young Roland Croninger, a geek for computers and strategy games, is not impressed with the middle-aged war hero, while his mother observes numerous drainage problems in the mountain fortress.These are the unlucky ones who survive the global thermonuclear war that begins at 10:16 a.m. EST.Sister Creep emerges from the subway to find her favorite spot in the city -- a glassworks shop -- destroyed along with all the other buildings. Amid the ruins, she discovers a ring of glass forged by the nuclear fire into a priceless jewel which seems to enable the bearer to \"dreamwalk\" great distances and see fantastic things. The ring gives hope to each of the shellshocked survivors Sister reluctantly gathers up to lead through the flooding Holland Tunnel to safety. Josh meets Swan & Doreen at a gas station near a cornfield in Kansas where the locusts seem to sense something headed their way. Swan feels it next but is unable to alert the grownups before missile silos in the cornfield open and fire ICBMs into the atmosphere. In the retaliatory strike that follows, Josh, Swan & Doreen are buried in a fallout shelter under the gas station.Colonel Macklin and the staff of Earth House track World War III in real time and seal the mountain as they've drilled for countless times. Located far from any likely targets, they watch in disbelief as a U.S. missile headed for Russia malfunctions and explodes close enough to hit the compound with a shockwave. The faulty drainage system turns the mountain in a tomb, separating Roland from his parents. The boy loses his mind but finds a new patron in Colonel Macklin, whom he rescues from the rubble and helps escape to the surface.In New Jersey, Sister Creep encounters a survivor who gives the name of Doyle Halland and claims to be a priest. Something about the man and the way he appeared suddenly makes Sister uneasy. He becomes fixated on the ring she's carrying after seeing the effect it has on other survivors. Halland reveals himself to be something less than human and far worse, a creature of many different faces and names (The Man With the Scarlet Eye among them) who's taken a front row seat to every genocide in history. Sister manages to escape and using the ring, begins to experience visions of a special girl in Kansas.This takes us through page 267 of 956 or roughly one third of the book. By the conclusion, I kept hoping it would never end.In Stephen King's anthology Four Past Midnight, the story The Library Policeman features an exchange between librarian Mrs. Lortz and a realtor named Sam Peebles, who feels the librarian's borrowing instructions to the kids seem harsh. She replies, \"Their favorite novel was a paperback original called Swan Song. It's a horror novel by a man named Robert McCammon. We can't keep it in stock, Sam. They read each new copy to rags in weeks. I had a copy put in Vinabind, but of course, it was stolen. By one of the bad children.\" If that's not an endorsement from Uncle Stevie, I don't know what is. I first read Swan Song in high school and revisiting this 25 years later, am happy to say that I was even more enthralled the second time around. Once I quit comparing it to The Stand, which I read recently for the first time and still had very fresh on my mind, and simply submitted to McCammon's fits of imagination and gift of majestic storytelling, I never looked back.With The Stand, King's characters all seemed to me like they could be found in the same hardware store in Maine, and while King knows those characters, their pasts and their personalities extremely well, McCammon jets the reader out of the hardware store and scatters us to four corners of the country, introducing characters I found much more diverse and almost as compelling.The Man with the Scarlet Eye, alias Doyle Halland, alias Friend, is as close as I've seen an author get to using \"Sympathy For the Devil\" by The Rolling Stones to bring a character to life. He's introduced in a sleazy theater in Times Square watching Faces of Death III, laughing at the carnage, looking for himself on screen and giving the employees the creeps. Strangely, none of the staff members can agree on what the man looks like, and are reminded of painful memories while in proximity to him. Spook Central.One aspect of Swan Song I found wonderfully novel was the introduction of a skin condition among some of the survivors that becomes known as Job's Mask, which starts off as facial warts that begin to connect through tendrils and eventually wrap the sufferer's entire face in a thick mask. Those afflicted suffer great pain over many months and years as their facial structure itself begins to be altered ... altered into what becomes one of the great questions in the book.My only complaint about Swan Song is one that I reserve for every paperback I've picked up with McCammon's name on the cover and that's how awful the art is. Granted, McCammon's output in the '80s and '90s trafficked in demons, aliens and werewolves, but these covers look like something a demon, alien or werewolf coughed up. Any illustrator with a love for these novels could do a certifiably better job of capturing the majesty and scope of the storytelling. When reading a McCammon book in public, I actually turn the cover over so nobody will see what I'm reading. That's how bad this artwork is.Swan Song is not for the faint of heart, but what I found most remarkable about it is the lengths McCammon goes to render the country barren and why. The United States is cloaked in nuclear winter. The earth and bodies of water have been polluted. Rats are a good meal and for water, melted snow, which often makes those forced to sip it ill. At night, wolves come out of the woods to feed and later, things that no carnival freakshow could conjure up. Sunlight has vanished and along with it, hope. What happens when the characters finally come together in Missouri and begin to build a community -- where previously there were only survivors waiting for neighbors to die so they could steal clothes or food -- is I was watching them like a kid would some string beans he'd planted. I was invested emotionally in the transformation of the wasteland into something resembling a home and when it comes under attack, I was hooked into seeing it protected. I haven't come this close to talking to a book in some time."}, {"userName": "Sadie Mother Horror", "userReviewDate": "May 18, 2018", "userURL": "http://www.goodreads.com/user/show/28225370-sadie-mother-horror", "userReview": "So in a month and a half, I finished Swan Song.This epic, apocalyptic story has been a part of my life, forever in the background of my mind for so many days, it will feel weird for awhile to not be continuing on in the journey-but I know that it doesn't really completely go away. Now it's a part of the framework.I've heard a lot of people compare this book to Stephen King's The Stand.I have no idea why, other than this is a story that is both apocalyptic and horrific. There is a prolific antagonist that may or may not be the devil, but for me, that's where the similarities end.McCammon leans a little heavier on fantasy/magical realism here so in a way, I found this book to be more comparable to the Lord of the Rings, actually.We follow a few groups of travelers who go through tremendous trials in order to meet their end goal. Both groups of travelers are protecting a very special gift.The gifts are supernaturally trying to come together and for 900+ pages, it is our very special treat to watch events unfold and experience Robert McCammon's unique talent of both exceptional storytelling and character building.In particular, I found McCammon's \"bad guys\" immensely compelling. Especially the character Roland, who we meet as a child (a creepy child) and get to watch him grow into a monster. I looked forward to the chapters with Roland's story.Other favorites were our protagonists/heroes: Swan, Josh and Sister.---Not going to go into the plot or overshare here because truly, if you're a fan of horror and epic dystopian adventures, this one is a MUST and it needs to be full of individual discovery---My own feelings:This is my third Robert McCammon novel and I'm falling in love with his writing style. He's much warmer on the details than Stephen King, actually. His wheelhouse is drawing the reader into a strangely intimate headspace where the experiences the characters go through feel familiar; nostalgic and easy to relate to.Swan Song is an emotional read for me. I disappeared into its pages in an unexplainable, immersive way--it was almost unreadable at work because time would go by so quickly, it felt as though I didn't even have a lunch break-so I mainly read this one at home-at night in my bed. Readers who have a faith in something bigger than themselves, a spiritual background will enjoy the way Robert McCammon handles that with some of his believing characters.So I'll leave with my recommendation here:This book is amazing. I loved every page of it. The book never felt idle--each word bore intention and purpose. I was never bored or confused. I felt like I was sitting at the feet of an experienced storyteller telling me the most epic, fully fleshed out story of his career. Boy's Life is still my favorite though, hahahah. The Listener would be second and this book is a solid third favorite. If you haven't read this one, you must buy it and carve out ample space in your TBR to enjoy it. Savor it."}, {"userName": "Maciek", "userReviewDate": "Jan 10, 2011", "userURL": "http://www.goodreads.com/user/show/2969647-maciek", "userReview": "Now this was a big monster of a book. Swan Song is huge, huge like the Xbox. My copy spans 850 pages and is hard to carry around because of its size - it'll never fit into a pocket and will take significan space when deposited in a bag (why it was released by a publishing house named \"Pocket Books\" then?).It's about the end of the world. Written in the 80's, when words like Cold War were used often, it's no wonder that in the novel the relationship between Soviet and American governments has deterioriated. Soviet and American submarines play cat and mouse, India and Pakistand destroy each other with nuclear weapons, and when reports of more and more Soviet submarines reach the Americans every base swtiches to DEFCON 1, and then everything goes to hell.And I mean literally. Swan Song opens with wild, vivid descriptions of the end of the world. And the world ends with a BANG. Everything explodes, buses with charried bodies fly through the air, DJs at radio stations scream into their mics as cities become obliterated. Borders disappear, and the whole of America (because that's where our story is set) becomes one big wasteland.Obviously, there are survivors. The picture looks grim, but cockroaches aren't going to rule because few of our kind are still walking. The characters that we met seem to be tad a little too banal and stereotyped, but the adventure, the adventure they set on is grand. Similarly to The Stand, a group of people needs to contact another group of people, while trying to stay alive and not fall prey to scavengers and the lone Dark Figure, which seems to relish in destruction that just took place.McCammon is a terrific writer and the pace he sets up is an achievement in itself, as there's no stale moment in the first section. His imagination is broad, and he shares it with us generously. His prose is unpretentious and delivers exactly what it promises - a gorgeous painting of a postapocalyptic America, and the people and creatures that inhabit it. The story just mounts an mounts and mounts, and although there are cliches and a few schmaltzy moments McCammon pulls no punches and there are shocks that put a succesful shadow on any eye-rolling moment.HOWEVER, in approximately half of the text, the novel takes an unexpected jump of seven years to the future. And it never really regains the thrills and sheer imaginative achievement of the first part, though it keeps a steady level of suspense. But the outcome becomes more and more predictable, and the suspense slowly starts fizzling and gradually disappears completely. The ending reaches just a bit too far into feel-good territory for me, and was a culmination of all those moments of schmaltz which I disliked.If I were 13 and haven't read The Stand - which has to be named here, and I'd say why in a moment - I would have loved this book. Loved it! But now aspects of it irritate me, especially considering the writer's talent and skill at constructing and pacing his tale. As for The Stand, aside from the basic premise - survivors of a nuclear holocaust try to live in the charred world, and there's a Big Evil Guy to stop them - the similarities are largely superficial, and save for a few scenes Swan Song is a much different work. Much more...optimistic, much simpler in characterization. It's not bad, it just didn't meet my expectations, as I've read that it's a favorite among the author's fans. McCammon is a terrific writer, and both Boy's Life and Gone South are gorgeous efforts. Blue World is a great collection of short tales with one sublime novella. Swan Song was his breakthrough novel from the horror genre, and it is an impressive achievement when you consider the theme and the size, but in the end it went out with a whimper, not a bang, and I don't think a re-read is in order."}, {"userName": "Zoeytron", "userReviewDate": "Mar 23, 2013", "userURL": "http://www.goodreads.com/user/show/12656534-zoeytron", "userReview": "'All that was is lost.' The trees are burning in Central Park. Grand Central Station and the Empire State Building - gone. Mountains of ruined debris tower over everything. Wait . . . the electric lights on the marquee at the Empire State Theatre are still merrily twinkling, the movie house itself seemingly untouched. Currently showing is the film 'Face of Death', while a lone cinema patron sits in the front row giggling manically. Swan is a little girl with an old soul and a knack with growing things. Josh, a giant of a man and a former pro wrestler, is trying to protect her from the evil that inevitably surfaces at a time like this. Sister, who was homeless long before the nuclear bombs did their dirty work, carries a melted piece of junk with her that just may be magical. As radiation blows across the sunless desolate land, wolves are howling in the woods. Evil is thriving."}, {"userName": "Jennifer ☼", "userReviewDate": "Jul 31, 2008", "userURL": "http://www.goodreads.com/user/show/1384646-jennifer", "userReview": "Here's the bottom line: Swan Song is one of my favorite books of all time. It stills impacts me every bit as much as the first time I read it.Swan Song is very dark, and it's scary, but it's also one of the most beautiful and hopeful books I have ever read.Weighing in at 956 pages, it's a huge story in every sense of the word. There are characters you will hate and fear as well as characters you will fall in love with and care about long after you've finished reading. There is magic, evil, goodness, hope, ruin, and beauty throughout the pages of Swan Song.If you are a fan of post-apocalyptic fiction, Swan Song is an absolute must read. I give it my highest recommendation."}, {"userName": "David", "userReviewDate": "Jul 16, 2010", "userURL": "http://www.goodreads.com/user/show/3335664-david", "userReview": "[I'm pretty sure even 30 25-megaton nuclear bombs will not melt the ice caps and they certainly will not \"throw the earth off its axis.\" (hide spoiler)]"}, {"userName": "Karl", "userReviewDate": "Feb 22, 2014", "userURL": "http://www.goodreads.com/user/show/1935255-karl", "userReview": "This is copy 252 of 650 signed numbered copies."}, {"userName": "Latasha", "userReviewDate": "Aug 30, 2015", "userURL": "http://www.goodreads.com/user/show/8253900-latasha", "userReview": "this was fantastic! I listened to this for a buddy read. I never would've picked this book out myself. I'm not really into the apocalyptic scene. but I'm sure glad I joined them! it's so intense through most of the book.listened to this again in 2017 and loved it just as much this time as I did the first time."}, {"userName": "Jenna ", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/24806763-jenna", "userReview": "One of my trusty goodreads friend's recently recommended Robert McCammon to me and I am so grateful she did (thanks Jennifer!). I will be honest though that when I read \"Boy's Life\" that I zoned out at times because it seemed to become too wordy at times but I didn't find that to be an issue at all with Swan Song. Wow! Robert McCammon is truly a very talented storyteller and I was immediately wrapped up in this dystopian story of survival after a nuclear holocaust.Most people, including myself, feel that long books can be a drag especially for those who have a shorter attention span but with Swan Song, I enjoyed it so much that I viewed it as a series all wrapped up into one book so that I wouldn't have to wait for the next one! The writing is superb and the characters are so well-developed that I felt that I really knew them and still do. I am ultimately sad that that book ended. I highly recommend this book!"}, {"userName": "Claudia", "userReviewDate": "Jun 24, 2017", "userURL": "http://www.goodreads.com/user/show/45870338-claudia", "userReview": "McCammon ist ein großartiger Erzähler. Er versteht es, die Spannung von der ersten bis zur letzten Seite zu halten. Sternabzug gibt's für die mystischen Elemente, die es nicht gebraucht hätte, z.B. den Teufel in Menschengestalt, der hinter Swan und 'Sister' her ist.Diese Geschichte ist wirklich düster und mit epischer Wucht erzählt. Mich schaudert's immer noch, wenn ich z.B. an die 'Dreckwarzen' denke, die unterirdisch leben und dem Kannibalismus frönen.-----------Menschen in Ausnahmesituationen. Was Menschen Menschen antun können, ist sowieso unbeschreiblich. Das Schlimme an dieser Geschichte ist, sie könnte, ohne die Mystik, ähnlich stattfinden.Der 2. Band ist schon bestellt."}, {"userName": "Kandice", "userReviewDate": "Mar 15, 2010", "userURL": "http://www.goodreads.com/user/show/1396160-kandice", "userReview": "I enjoyed this, and I feel almost bad giving it three stars instead of two, but there were a few things that bugged me enough that I just had to. There has been a nuclear holocaust (seems to be the theme of my reading lately) and we see the aftermath through the eyes of what eventually become two main groups. Simply put, the good guys and the bad guys.Almost every review I've seen compares this to The Stand by Stephen King and there's a good reason for that. In The Stand it's a disease that brings about the end of civilization as we know it, but really that's the main difference. I know a lot of fans of this book say the similarities end there because in this the world is decimated. There is little life, no sun, little fresh water, etc. but that isn't belabored. McCammon dwells on these things so little that when the sun comes out at the end I wondered why it was such a big deal until I remembered it had been pretty dark all along.One of the issues I had with this are just how bad the bad guys are. I mean bat shit crazy, wackadoodle nut jobs. The bad guys almost always are, but there were almost ridiculously so here. In the end, when given a chance to leave, only three men leave the evil camp for the good. Three out of thousands. We're talking universally bad, not just following a leader for food, security and some semblance of a tribe. Just evil.Very near the beginning two \"magical\" pieces are introduced as plot anchors, but by the time the story is finished one is gone with little fanfare and the other has done very little except look pretty and give a few dreams. There is a hint of more power in this particular talisman, but McCammon doesn't explore this. I felt almost as if he were setting the stage for a sequel or follow up novel.After griping for the last few paragraphs I feel I need to say I did actually enjoy the novel. It felt clumsy at times and very far-fetched, but it was compelling. I generally have no problem suspending disbelief, but when characters developed growths on their faces I could see where it was going because of the broad brush strokes he used to paint the two opposing sides. When it finally happens it felt almost cheezy, but again, it was still a compelling read.I think this book was a bit like Hamburger Helper. Is it gourmet or refined? Hell no, but it fills you up and you eat it guiltily despite how bad it is. It eventually satisfies and sometimes that's all we need. Satisfaction."}, {"userName": "Carol. ", "userReviewDate": "May 20, 2011", "userURL": "http://www.goodreads.com/user/show/3978225-carol", "userReview": "Feels like The Stand, only with greater amounts of mysticism and nuclear war instead of disease. Not quite sure why McCammon needed to jump 7 years into the future. Further degeneration of societal breakdown? Need to age the lead characters? What was he thinking? If the nuclear winter lasted 7 years, I think there'd be almost no one left--there's only so much scavenging one can do for canned food and gasoline. Shelf life, people, shelf life. That jump tested my patience. Fairly believable until then.Negatives: polarizing, simplistic viewpoints: the sociopath, the split personality disorder, the innocent daughter of a 'ho and the giant fearsome but gentle man, the street person with a vision of the future, personification of evil. That said, within the confines, they are done well enough."}, {"userName": "Emma", "userReviewDate": "Oct 02, 2015", "userURL": "http://www.goodreads.com/user/show/8575414-emma", "userReview": "Talk about 'condemned by faint praise'! This book was okay. It was too long and too predictable.I enjoyed the first 2/3 of this book but when I realised the author really was going to go for the saccharine ending, the wind was taken out of my sails.. Until then my only real niggling doubt had been the plausibility of some of the story line. Would there really still be so much canned food and fizzy drink lying around after 7 years? Would they really still have gas left for their vehicles? Would the settlement of Mary's Rest really go from being a feral, brutal, violent bunch of muggers and rag tags, to a loving and supportive community, literally over night?Ultimately this book was reductive and moralistic in a way I didn't much care for. Take Job's Mask, for example : a hard and crusty face covering developed over the years by victims closest to the point of the nuclear explosions. When these masks crack and fall off, all the good guys have developed smooth and flawless skin and a healthy head of hair, ' their true souls shining through'. Can you guess what happens to the villains?! They end up with very ugly faces because they have been very, very bad! No shades of grey for this author, no siree!The characters develop predictably as does the whole story. The 'crown' hailed as the main magical saviour of all the good people, seems to just ebb away. Items that were almost too much for me: the reappearance of the president, the sunshine and the stars, 'though I think the author forgot the rainbows and unicorns.....I thought this book would be better, from the reviews I read. It's not a great indictment that at 83% of the book I wasn't sure I had the will to go on, especially when the book is such a lengthy one. I'd come so far...In the end, it was an interesting enough account of a post apocalyptic world. I have seen it compared and contrasted to The Stand. To my mind they are about the same in terms of quality and interest and in their possible use as a door stop. Ultimately though, The Road is a superior post apocalyptic account and it's much more concise and spare and therefore effective in its delivery."}, {"userName": "Randy", "userReviewDate": "Sep 09, 2009", "userURL": "http://www.goodreads.com/user/show/2597509-randy", "userReview": "I came close to liking this. Look, the dialog is...awful. There are weird factual errors. For example, wolf packs roaming the I80 corridor near Hazleton Pennsylvania. I live here. I can tell you...not even close. But I have a bigger problem with this text.Okay, so here we have a writer that takes Chekhov's 'Loaded Gun' postulate, tears it out with his teeth, rips it up, craps on it, then puts it in a burning paper bag, drops it on your porch, knocks on the door and runs away. What do I mean? Without giving anything away (haha), Character A finds a Meaningful Object early in the book. It is clearly intended for Character B. In fact, you get the impression that once the Meaningful Object and Character B finally get together, things are gonna happen. Really cool things. So The Meaningful Object does some minor stuff throughout the narrative while Character A carries it. Meanwhile, the Evil Baddie really wants it really bad so you know its gonna be good at the end...the Meaningful Object is bad news for Evil Baddie.Sooooo....in the final pages, Meaningful Object and Character B finally meet and its magic. I mean that. It really is magic. It imbues Character B with a cool power that would be useful in a showdown with Evil Baddie and his Minions of Badness. Yes! How will she use it? What effect will it have on him? On her? I mean, I finished this book largely to see how those questions would be answered.Well, you never find out. The have a showdown. Somehow the good guys win. But Meaningful Object sits on the sidelines in somebody's backpack or something.Look, I'm all for irony and unpredictability if that's what's intended. But I don't believe that's the case here. Everything else happened pretty much by rote. It's like the author didn't know what to do with the Meaningful Object at the end, so he just wrote something different instead. An 'Ahh..Fuck it' ending. I HATED it. Not because the climactic battle was objectively bad, but because it subverted a great deal of what you read before. So writers, take note. If you build something up for 800-odd pages, respect your readers enough to find something useful to do with it. Please. Rant over."}, {"userName": "Evans Light", "userReviewDate": "Nov 20, 2011", "userURL": "http://www.goodreads.com/user/show/7008067-evans-light", "userReview": "Okay, I made it! Finished SWAN SONG tonight.If reading anything negative about this book would make your head explode, then stop reading now. You've been warned. Just my opinion, and I'm entitled to it.Overall, I would say this book was only about a 3 and a half star read for me. I can definitely see why so many people love it, and I imagine it would have been a hell of a lot better for me personally had I read this back in the late eighties as a teenager when the cold war was at its peak and nuclear winter was a widely accepted theory.Still, I did find a lot to enjoy in the book. The first couple hundred pages were my favorite, really like a time capsule back into the RED DAWN and DAY AFTER TOMORROW era. Though a higher level of suspension of disbelief was required than I expected from the book, I went with it and had a lot of fun. It was definitely more \"BOOK OF ELI\" than \"THE ROAD\" if I were to make apocalyptic movie comparisons.It began to lose me, however, around the point when the travelers arrived in Mary's Rest. The cast of characters expanded too rapidly for me to genuinely care about anyone, and the pace slowed to a crawl for the last third of the book. The random mix of reality and completely unexplained supernatural events subconsciously grated at me the entire way.And the events in WV towards the climax of the book? *sigh* I think that whole sequence could have been chopped and the book would have been the better for it. The entire ending went out with more of a whimper than I had hoped.McCammon can certainly craft a mighty phrase, though he does use eloquence sparingly (which is a good thing), and I ultimately preferred this version of THE STAND to Stephen King's, but both could have benefited by much tighter plotting IMO.Enjoyed reading with everyone, but glad to say I've experienced the mighty SWAN SONG and lived to tell the tale! It's probably not the book that is lacking in any way, most likely just my personal preference for reading material that is economical in its use of words, tightly coiled tales with little to no wasted space."}, {"userName": "Ctgt", "userReviewDate": "Aug 31, 2015", "userURL": "http://www.goodreads.com/user/show/3787451-ctgt", "userReview": "This is definitely old school PA and by old school I mean BZ(before zombie). Folks of a certain age will remember the old days of the cold war, ICBMs, nuclear arsenal buildups and the idiotic idea of crawling under your desk at school to protect yourself in the event of an attack. A familiar trope with multiple groups and POVs who converge for a final confrontation where the whole world seems to teeter on the edge of chaos or hope. Not much subtlety in the characters, they are either good or evil with only a moment or two where some shades of grey come through. The book was long, over 900 pages and I think several hundred pages could have been taken out without compromising the story. While this never grabbed me like Boy's Life did, this was still very enjoyable and was it kinda fun to be able to cheer for one group and despise another.7/10"}, {"userName": "Kathryn", "userReviewDate": "Jan 08, 2009", "userURL": "http://www.goodreads.com/user/show/1497350-kathryn", "userReview": "No spoilers, though I'm sorely tempted...I originally rated this book 4 stars but now that I’ve slept on it, I have to rate 3 stars and try to keep my reasons short. Swan Song is a mix of apocalypse, horror, and fantasy. Lovers of any of these genres might consider giving the book a try. I recently read The Strain and my feelings about both books are similar.My main problem with this book is the Hollywood feel and the zero room for interpretation since every little bit is explained for the reader. I felt as though I were wading through cliché after cliché, stock characters, and obvious setups. Predicting when a new character would die was easy, no big questions or revelations about human nature, often associated with apocalyptic fiction, were asked, and much of the horror was simple gratuitous violence and gore. Now, I like violence and gore when I can’t see it coming from a mile away.I had purposefully avoided spoiler reviews of this book and I really had no idea before starting that so many fantastical elements would be included. This book is so much like The Stand, but without the superb characterizations. Not that the characters are unadmirable in Swan Song. They were overly simple, either overly heroic, innocent, or grotesque, depending on the stock characterization mold.A tarot deck played big in the book and I honestly felt that the author had a tarot deck on hand and said to himself, I’ll create a character for every card. The character trials felt fabricated and rehearsed. I would have loved this book as a teenager but not so much now. There is a time jump in the book that I was not fond of. I also wonder about the author’s research involving nuclear war and the after effects of the scale covered in the book.The more I think about this book, the more I become annoyed with myself for choosing to spend so much time on it and the more I want to lower my rating. I feel stupider for having read this."}, {"userName": "Unapologetic_Bookaholic", "userReviewDate": "Oct 29, 2008", "userURL": "http://www.goodreads.com/user/show/1125077-unapologetic-bookaholic", "userReview": "A massive journey you’ll end up loving or hating. Robert McCammon does not waste time padding his chapters. He sets a rapid enough pace with a story that needs to unfold rather quickly. Characters that need to be introduced and understood fairly fast. Granted, this was written in the 80’s. So no cell phone, iPODs or Internet. Yet he still maintains a vivid connection between characters, worlds’ away.The beginning is the end and people are bracing nuclear war. Fallout shelters are built, the President of the United the of States is being briefed for an imminent nuclear war. Before the main characters are able to adapt to the effects of a post-apocalyptic world. Their introduction hold a glimpse into who they become. Age, unique talent and skill, male or female. If you have a car, canned food, able to wield weapon or a strong will to live. Certain parts of the country acclimate to varying degrees, creating an almost alien landscape. Swan/Sue Wanda is a little girl who can hear the hurting sound plants make when they die. She also has life thriving in her fingertips beyond just being able to tend a garden. Black Frankenstein/Josh the Wrestler. His family is miles away and his loneliness is filled with food binges. His massive size attributes to his stage name. Sister Creep had a breakdown that lands her on bad times. A crazy homeless woman who later becomes a hero.However, even after a nuclear war. The survivors struggle to return to society. There is no governing body, every man for him self. An underlying fantasy element and the human condition is what kept me loving every minute and want to re-read it years later."}], "description": "In a wasteland born of rage and fear, populated by monstrous creatures and marauding armies, earth's last survivors have been drawn into the final battle between good and evil, that will decide the fate of humanity: Sister, who discovers a strange and transformative glass artifact in the destroyed Manhattan streets; Joshua Hutchins, the pro wrestler who takes refuge from the nuclear fallout at a Nebraska gas station; and Swan, a young girl possessing special powers, who travels alongside Josh to a Missouri town where healing and recovery can begin with Swan's gifts. But the ancient force behind earth's devastation is scouring the walking wounded for recruits for its relentless army, beginning with Swan herself.", "title": "Swan Song", "url": "https://www.goodreads.com/book/show/27389959-swan-song", "average": 4.28, "cover": "https://images.gr-assets.com/books/1446151067l/27389959.jpg", "reviews": 2622, "authors": [{"url": "https://www.goodreads.com/author/show/5244478.Robert_R_McCammon", "name": "Robert R. McCammon"}], "type": ["Horror", "Fiction", "Apocalyptic", "Fantasy", "Science Fiction"], "outlinks": ["http://www.goodreads.com/book/show/27389959-swan-song", "http://www.goodreads.com/book/show/11557.Swan_Song", "http://www.goodreads.com/book/show/31416946-swan-song", "http://www.goodreads.com/book/show/12972591-swan-song", "http://www.goodreads.com/book/show/13155477-swan-song", "http://www.goodreads.com/book/show/15023281-swan-song", "http://www.goodreads.com/book/show/6458635-swan-song", "http://www.goodreads.com/book/show/151357.Swan_Song", "http://www.goodreads.com/book/show/11553.Boy_s_Life", "http://www.goodreads.com/book/show/462658.They_Thirst", "http://www.goodreads.com/book/show/11551.The_Wolf_s_Hour", "http://www.goodreads.com/book/show/11548.Mine", "http://www.goodreads.com/book/show/1525997.Speaks_the_Nightbird"]}