{"ratings": 973, "userreviews": [{"userName": "Christine", "userReviewDate": "Mar 11, 2017", "userURL": "http://www.goodreads.com/user/show/9809518-christine", "userReview": "I simply cannot get enough of black comedy. Black comedy, with a smattering of crime, is the bees’s knees. Sweetpea is blacker than a black thing. It’s quirky, hilarious, totally refreshing and bold.Things you will do when reading Sweetpea:Laugh out loudScare the cat laughingLaugh even louderAgree with some of Rhiannon’s thoughtsWorry that you have a teeny bit of Rhiannon in you!Sweetpea is Rhiannon’s journal, following her adventures through life. It is told in a dry witty style. She make lists of things that drive her around the bend or people she wants to kill. They are spot on! Hugely entertaining. Bloody marvellous. She has a dark side. From time to time, she kills people. She is kind to animals and children though. Probably best to be nice to her eh?! Give her whatever she wants, promote her at work and make sure you stay friends with her. Apart from that murdery inclination she is fairly normal, living with her boyfriend and dog and working as a kind of skivvy on the local newspaper.This is just fabulous. FABULOUS! Sweetpea is a must read in 2017 for all fans of black comedy. Join in the love fest for Rhiannon, a girl who knows how to use a knife!Recommended, if you want a guaranteed laugh!"}, {"userName": "sue", "userReviewDate": "Mar 07, 2017", "userURL": "http://www.goodreads.com/user/show/7377874-sue", "userReview": "I've heard good things, bad things about this book. So I went into it with a Marmite peep!The story itself builds up really well. Most of it is in the form of a diary. It did make for fascinating reading as well as having the \"shock factor\"If you don't like too much bad language.It's not for you.If you don't like explicit scenes.It's not for you.The woman in this is a butch, but boy, I had times when I laughed out loud with her thoughts. Warped, out of this world and totally alien to me.Its a thriller, but, it has elements of other genres mixed in which make it palatable for some and I think (like me) certain parts not.My thanks to Harlequin UK and Net Galley for my copy"}, {"userName": "Matt", "userReviewDate": "Jan 30, 2018", "userURL": "http://www.goodreads.com/user/show/5903843-matt", "userReview": "After having written a number of Young Adult novels, C.J. Skuse turns to her darker side in penning this piece, rich in angst and homicidal actions. Rhiannon Lewis hates her life and most of those who cross her path. Using a series of diary entries, she explores this hatred by tipping her hand to the reader. Many of her entries begin with a list of those she despises the most and why they rub her the wrong way. Be it people from the news, those at her place of employment, or people with whom she must interact in public, Rhiannon cannot let things flow off her back. As the narrative progresses, the reader learns that Rhiannon was once famous for being the sole survivor in a horrific attack on a daycare facility, though she suffered significant injuries. These injuries seem to have numbed her ability to truly care for others, while also helping to foster a sense of vigilante behaviour, which she uses to restore balance in the world. Rhiannon has many secrets, but none darker than the need to punish those who have wronged the innocent and to harm people who do not serve a useful purpose in her day to day life. The narrative is full of these struggles and the list of personal enemies that Rhiannon finds troublesome seems to grow as time passes. That being said, a personal event turns everything on its head and forces Rhiannon to reassess her life and the choices she’s made; a new feeling for this seemingly cold and emotionless woman. Whatever the struggle, Rhiannon Lewis will not be the same by the end, though no one can truly tell how she’ll turn out. Skuse offers a very dark and demented path through this novel, sure to interest those who enjoy personal struggle and protagonists with deep and homicidal secrets.I chose this book on the recommendation of a friend, who knows how much I enjoy a twisted tale. I was not entirely sure what to expect, but did hope for some psychological thriller that would keep me up well into the night. Instead, I pushed through this personal journal of a twenty-something woman who has a hit list a mile long and many deep secrets she wants to keep from others. Rhiannon is quite the repulsive character, particularly because of her attitude towards the outside world. As she mentions throughout the narrative, she has a ‘me’ side and a public persona to uphold, a difficult act to support through troubling times. However, her Dexter-like duality might serve to better underscore her struggles on a daily basis. The reader cannot help but feel a ray of sympathy for her, though surely dislikes her ongoing attacks on anyone who is not perfect. With a cast of varied secondary characters, Skuse is able to prop up her novel with a vast array of fodder to fuel Rhiannon’s fire, though no one can be sure when things will take a significant turn. The story itself is decent, though there are surely segments that drag and left me wondering how long it would take to push through. This is definitely not a fast-paced piece, nor is it something with mysterious crumbs left throughout the narrative. The reader must dedicate themselves to getting to the very end, where more surprises lie in wait. I am happy to say I made it, though the journey was anything but simple. Still, Skuse kept me wondering and guessing, with some significantly curious means of tying up loose ends by the final few entries.Kudos, Madam Skuse, for a great piece, which differs greatly from your usual fare. I am eager to see what else you might bring up for publishing in the coming years. I know I’ll keep an eye open!Love/hate the review? An ever-growing collection of others appears at: http://pecheyponderings.wordpress.com/A Book for All Seasons, a different sort of Book Challenge: https://www.goodreads.com/group/show/..."}, {"userName": "Tracy Fenton", "userReviewDate": "Feb 12, 2017", "userURL": "http://www.goodreads.com/user/show/18478389-tracy-fenton", "userReview": "OMFG – This book is OUTRAGEOUS – it’s dirty, disgusting, crude, rude, inappropriate, tasteless and I f*cking LOVED IT. The main character Rhiannon has to be the funniest psychopath I’ve ever read about, I was practically salivating from the first page until the last and was shaking my head in disbelief at the things she was saying and thinking. The story is told via diary entries and each day Rhiannon writes her Kill List – OMG – some of her observations are priceless. I do need to point out that this book is without doubt a Marmite book and if you are easily offended then I would avoid this like Genital Herpes. In the meantime I am going to track down and stalk CJ Skuse and make her my new bestfriend because I think I LOVE her and her brutal wit."}, {"userName": "Blair", "userReviewDate": "Apr 15, 2017", "userURL": "http://www.goodreads.com/user/show/272909-blair", "userReview": "Sweetpea is an absolute fucking scream. Profanity very much necessary; if you don't think I needed to use 'fucking' in that sentence, you definitely shouldn't read this book.If there are awards for 'x meets x' descriptions in book blurbs, some HQ copywriter deserves the equivalent of an Oscar for hitting on 'Fleabag meets American Psycho'. Part journal, part internal monologue, replete with swearing and ironically deployed slang, Sweetpea chronicles the uncensored thoughts and confessions of Rhiannon. An editorial assistant in her late twenties, she's frank and gleefully non-PC about her sex life, cheating boyfriend, boring job/friends, weirdo colleagues/neighbours... and the fact that she's a serial killer. That's right: when she isn't fantasising about offing her patronising boss or reordering the list of people she most wants to murder, Rhiannon gets her kicks by going out at night with her Sabatier knife and seeking suitable victims.What makes this work? It helps that Rhiannon is oddly relatable and endearing. Aside from the murder thing, her life is so normal, right down to the fact that she shops at Lidl. She's smart and funny but hamstrung by ordinary frustrations: friends who talk about nothing but their kids; a promotion that never materialises; a nagging feeling that she 'needs' to lose weight. And on a deep, sick level, isn't Rhiannon just living every misanthrope's dream? Instead of running away from a would-be rapist, she plays along until she gets the chance to... well, I won't go into it, but it definitely makes her worthy of the 'female Patrick Bateman' label. She extracts prolonged, violent revenge on the girl who made her life hell at school. She doesn't have to suffer Tube perverts because she can threaten to slit their throats (and give them a glimpse of the knife to back it up). And if we've all mentally sketched out our kill lists every now and then, well, Rhiannon might just follow through on hers.There may be a lot of blood and a bit of a dive into Rhiannon's troubled past, but this is definitely more black comedy than thriller. (There's also quite a bit of sex. Sweetpea is basically what I imagine that book Maestra would have been like if it was actually entertaining.) Rhiannon's blunt-and-breezy voice is a masterstroke, and her kill lists (Regina George meets The Bride? Adrian Mole meets Dexter?) repeatedly made me laugh out loud. I found it so hilarious, and loved Rhiannon so much, that the rating could have been five stars – but I was disappointed in a development towards the end, and the out-of-character behaviour that results in the wimpy ending.Still an ENORMOUS amount of fun, though. Sweetpea is nearly 500 pages, but I flew through it in no time, pausing only to note down my favourite Rhiannon one-liners. Now I just need a sequel and a true-to-the-book film version.I received an advance review copy of Sweetpea from the publisher through NetGalley.TinyLetter | Twitter | Instagram | Tumblr"}, {"userName": "Lisa *OwlBeSatReading*", "userReviewDate": "Apr 11, 2017", "userURL": "http://www.goodreads.com/user/show/4695379-lisa-owlbesatreading", "userReview": "\"I don’t want to talk any more about today. I just want to overeat and shit myself and die. Or shit myself after I die. Apparently that happens. And when you give birth too. Ugh. What a world.\"Although her childhood was haunted by a famous crime, Rhinannon’s life is normal now that her celebrity has dwindled. By day, her job as an editorial assistant is demeaning and unsatisfying. By evening she dutifully listens to her friend’s plans for marriage and babies whilst secretly making a list. A kill list.From the man on the Lidl checkout who always mishandles her apples and squashes her sliced loaf, to the driver who cuts her up on her way to work. And then there's the people who really deserve to die.This story had me roaring with laughter like the mad woman I am. It is 100% my kind of humour, for which I am 100% not sorry for. It's certainly NOT your average humour, and it could very well offend and disturb a lot of people. But not me, I loved it!So, in order to try and lead a relatively normal life, Rhiannon, creates The Act. This is basically her way of fitting in with her colleagues and her group of friends. (aka 'The PICSO's'. You'll have to read it to find out what that stands for. It's absolute class, and everyone has a PICSO or ten in their lives!) They have no idea that she is a psychopath with uncontrollable murderous tendencies.The story is told in diary format, which I love because it's so easy to follow. What I loved about it most of all though was the humour. It was dark, deeply disturbing and very un-pc. Worryingly, I heard my own thoughts countless times throughout!\"Got on the scales first thing – still not lost the Christmas poundage. Googled ‘West Country Liposuction’. Can’t afford it. Had an eclair.\" (Yes! Cake IS the answer!)Had I have read this in a public place, I'd of got very strange looks because I was laughing and snorting and nodding my head in agreement all the way through. Rhiannon, you're a gem, albeit a murderous one!!Without giving too much away, here's a couple of tasters of her many Kill Lists which cropped up throughout the story;1. People who walk in groups along the pavement so no one else can get past, like they’re fucking in Reservoir Dogs. (Why do people do this?!)2. Middle-class people who believe it’s their God-given right to bring their babies into restaurants and allow them to squawk all through a meal. (Ugh, don't get me started on this one!)3. Interrupters. (Yep, totally agree!)I know it's a pretty harsh attitude to have, but I'm certain loads of people think these things, the older I've got, the less tolerant I've become, so these felt very relatable for me! Not to the extent that I want to kill anybody though, I'd like to point out!! Rhiannon, you're my kind of girl. But I value my life far too much to be your friend! C J Skuse has created incredibly believable characters with such depth and imagination that every single one of them stood out for one reason or another. Sweetpea was an absolute joy to read. However, it certainly won't be for everyone because there's violence, profanity and stuff that is quite simply, very, very wrong. But, for me, entertainment-wise, it was very, very right. I just hope the author will be writing another instalment, because, damn it, that ended on a cliff-hanger! I need to know what happens to Rhiannon next! This gets a well-earned 5 stars from me, mainly because I can't stop thinking about it and I end up chuckling to myself!Oh, and here's what would be on my Kill List, just for the record;1. Boasters.2. Upstairs neighbours who think it's a grand idea to have laminate floors with insufficient underlay and 3 tap-dancing kids.3. People who lick the wooden stick of an ice lolly. 4. The previous tenant of MY flat, who insists on getting 'payday loans' under MY address with no intention of paying it back. YOU DO NOT LIVE HERE ANY MORE. THEY WILL FIND YOU. AND KILL YOU. Or maybe just insist you pay it back in manageable instalments of £1.21 a month.I'd like to thank the author, C J Skuse, and the publisher, HQ (UK), for the opportunity to read this via NetGalley in exchange for an honest review. The pleasure was all mine!"}, {"userName": "Sarah", "userReviewDate": "Feb 27, 2017", "userURL": "http://www.goodreads.com/user/show/27246754-sarah", "userReview": "This is probably going to be a love it or hate it book, but I for one absolutely loved it! It certainly isn’t one for the faint hearted lets put it that way.Rhiannon is just the most fabulous character. Each chapter starts off with a list of people and things she hates. It’s like watching an episode of Grumpy Old Men, apart from it’s a young female serial killer. Not sure I should be worried as there were so many things that I agreed with on her daily lists.To be honest it’s not shocking that Rhiannon is slightly damaged. She has been through quite a lot in her life. If anything it has left her quite un attached from things and people. There’s only really Tink her dog that she seems to have any affection for. She’s someone you certainly wouldn’t want to get on the wrong side of that’s for sure!Sweetpea is without a doubt a deliciously dark and twisted read that had me well and truly gripped. Everything is very much a matter of fact in Rhiannon’s world. People who do wrong to her or to others in society deserve to die, simple as that. Whilst it may be a dark read it is actually a very humorous one also. Without a doubt Sweetpea is going to be THE much talked about book in 2017. Brilliant just brilliant!My thanks to Netgalley and Harlequin (UK) Limited for a copy of this book. All opinions are my own and not biased in anyway."}, {"userName": "Liz Barnsley", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/16471876-liz-barnsley", "userReview": "Ok having just finished this one tonight I can tell you its going to divide opinion!I'm giving it 5* and a big fat YAY because it made me laugh and laugh and then go ewwwww then laugh and laugh some more.It is brutal when it comes to the violence, it is quite definitely irreverent and it embraces its own heart - the psychopathic serial killing main protagonist will have you falling in love with her even as she does the most horrendous things - but she has enough redeeming features that you feel you can love her anyway. Plus the kill lists are classic - you will find yourself nodding along although for most of us these things form a mild annoyance rather than a distinct and sometimes unstoppable urge to commit murder...I loved it. And will review it in more depth nearer to its publication date."}, {"userName": "Mandy White", "userReviewDate": "Feb 05, 2018", "userURL": "http://www.goodreads.com/user/show/33018840-mandy-white", "userReview": "Well... that was different! Not what I was expecting but I did enjoy it. It made me laugh, it made me cringe. Can see that this not for everyone.... but my goodness it was funny!"}, {"userName": "Liz", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/23068367-liz", "userReview": "Who is Rhiannon? Simply put she is a killer and that’s not even a spoiler. She loves her pet dog and her Sylvanian family doll house. Her parents are dead, her older sister gone to the US of A. When she’s not at work as an editorial assistant for a local newspaper, she has a number of side activities. Apart from walking her dog (even though it’s questionable as there is some overlap), growing herbs, dreaming of the Honey Cottage in Wales and adding to the Sylvanian family, she could be slapped with quite a hefty criminal record. Rhiannon might not have the heart or empathy, but she is cunning and she doesn’t hurt any innocents (except that one time). Completing the picture of Rhiannon’s life is her BF Craig. BF Craig who is plugging Rhiannon’s workmate, Lana.Rhiannon is just so over the top full of sarcasm, black humor and retorts. I know the girl has an issue and what not, and while it definitely made her distinctive, I feel her ‘voice’ wasn’t an underlying creepy kind of cool. It was the slightly obnoxious Johnny Bravo type of cool. At times I did wonder whether I was able to take it all in, especially since Sweetpea is delivered in first person and in sort of a diary form which did let the story down for me a bit as they come across a bit comedy stand-up’ish. You know the ones where there is one anecdote after another, instead of a fluid storytelling? I know, this is a journal type format, so I can’t really blame the delivery.There is a lot happening in this book, what with a healthy cast of characters, and Rhiannon’s special brand of free-time-activities. I feel like I should tell you more, but I won’t… in terms of plot, let’s just say that as she works in the newspaper she has access to information and her kill list is there for a reason. How she deals with each item/person on her lists? For you to find out… The plot doesn’t feel all over the place. Everything is explained, the timeline flows smoothly and if you’re willing to take it with a pinch of incredulity at times, then have at it. Just beware, if you are highly empathic, you may get an owwie or two along the way, lots of profanity and cussing. As for me? I had to definitely shut a bit of my brain off. Sometimes ignorance truly is bliss.As such, I am absolutely certain that a number of readers may and/or will find this book completely and utterly wrong. There will always be someone who takes a comment in the wrong way. These comments, Rhiannon’s mental monologue, didn’t affect me. It was what got her off that screamed: a) I have found my limit when it comes to psychos and Rhiannon is one step too far gone for me, and b) I was wondering if it was one of those cases where ‘Here, this is outrageous already, lets add more fuel to the fire’.While I have come across a number of reviews who were praising the book for it’s humor and funny content, I can’t say I, personally, was belly-laughing my way through it. Can’t argue over a sense of humor I guess… But I did find a common ground with Rhiannon. Her kill lists included quite a number of things I couldn’t help but agree with. For example, a group of people taking up the whole pavement (I have resulted to just barrel my way through, really!), wrongly packed shopping bag by those volunteer people who collect money for various things (I drop a few coins in their bucket, but tell them to get their mitts off my shopping bag), office peeves (lunch time!!! lunch time surrounded by men!!!), etc.Overall… who would have thought I would find my limit when it comes to psychotic characters? This book was slightly too much even for me at times! Especially the acts involving a character called AJ and the ending. These made me gag bit… OK, I lie… They made me gag a lot. Sweetpea, I hereby declare you, The Shock Factor! 3*- I liked it. I liked it because the story flowed well, the plot was legit, there was plenty to keep me occupied plus them kill lists. Discounting 2* because the humor left me, most of the times, neutral, and I was entirely too grossed out by certain events."}, {"userName": "Mandy", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/14938021-mandy", "userReview": "Ha great fun, if you don't mind lots of sweary language and dark psychopathic ramblings which you can't help but agree with at times (often?). Lots of laugh out loud moments and I loved it."}, {"userName": "Bee (Heart Full of Books)", "userReviewDate": "Apr 23, 2017", "userURL": "http://www.goodreads.com/user/show/18364457-bee-heart-full-of-books", "userReview": "DNF'd at 52%Unfortunately, I just don't think this story was for me. The psycho narrator was funny and her bluntness was really refreshing, but the plot wasn't gripping me! Things weren't moving very quickly, and even if the end is intense, I don't have the willpower to continue."}, {"userName": "Joanna Park", "userReviewDate": "May 03, 2017", "userURL": "http://www.goodreads.com/user/show/26160119-joanna-park", "userReview": "Also featured as a guest review on The Book Review Cafe Blog. ‪ https://thebookreviewcafe.com/2017/05...‬ To the outside world Rhiannon seems like a shy, retiring girl. Just a normal girl working in a job where she isn't appreciated, has friends that she hates and her boyfriend is cheating on her. Everyone thinks she is a real Sweetpea. However hiding just beneath the surface, Rhiannon is very angry. Angry at rude people and loud noises. For Rhiannon hides a dark secret, she us a serial killer, killing those who dare to annoy her or try to cause her harm and who knows who her next victim will be?This was a fairly unusual bookj for me as I found myself actually feeling sorry for the serial killer. Rhiannon is very funny and some of her observations/ comments had me laughing out loud. She has a very astute way of looking at the world and telling things exactly as they are. At first you think her comments are unfair or unjustified but as you learn more about her life, both past and present, you realise that there are good reasons for her being like she us. As you learn more about her, you start feeling sorry for her and hoping that she will gave a happy ending. It was interests to get inside the mind if a serial killer and find out more about what makes them tick and what motivates them to kill. The book is written in the easy, intimate style of a diary which helps trick the reader into thinking that they are reading a normal persons diary. This helps the murdersceens seem more shocking and violent. Fair warning some of these scenes are quite gruesome with what's happening to the victims being described in vivid detail. Some of the language throughout the book is a bit offensive so if you are easily offended it might be best to avoid. This is quite an easy to read book. The general tone and flow of the book means you are able to read it quite fast. The fact that the main character is quite likeable, despite being a serial killer, means that you want to keep reading to find out what will happen next. I limed the 'kill lists' or summaries at the beginning of each chapter. It made it easier to keep up with everything that's going on. There is quite a lot of tension throughout the book which increases as more murders are committed and the story hurtles towards its conclusion. I was constantly wondering what would happen next and worrying she was going to get caught. The twist towards the end really took me by surprise as I really wasn't expecting it. I think the ending was a very good and appropriate way to end the book, though it wasn't the way I wanted it to end! The blurb describes this book as a cross between Bridget Jonbes and Dexter which is a really good description of it! This is the debut book from this author and I loom forward to reading many from her. Thank you to Anna Baggaley and HQ stories for my copy of this book."}, {"userName": "C.J. Stark (Random Melon Reads)", "userReviewDate": "Apr 22, 2017", "userURL": "http://www.goodreads.com/user/show/10247419-c-j-stark-random-melon-reads", "userReview": "5.047942 starsErm… well… err… gosh… umm… What did I just read?!Let me try and summarise. Rhiannon is as mad as a box of frogs. Done – end of review. ONLY JOKINGAfter becoming a survivor of a high profile tragic event, she became somewhat of a child celebrity. Of course, as she got older her celebrity status wore off and she started to get bored with everyday life. She writes a kill list at the beginning of each journal entry, mostly of people that have irked her somehow that day (understandable). Crazy shit then happens. Lots of very crazy shit. Lots of very explicit crazy shit. This whole story is completely batshit crazy… and wonderful. I think this is either going to be a book you love, or hate, or are somewhat indifferent to. I love dark humour but it is very rarely done well. This is an instance of it being done well. I listened to a large amount of this as audiobook (I often do the whispersync thing). On three separate occasions I laughed out loud in public and looked like a crazy person. There is no getting away from it. This book is very explicit. There isn’t really too much romance – it’s just straight up sex. In lots of detail. Normally romance/sex annoys me and just gets in the way of a good story. But the sex in this is very different. It is described factually and wittily and therefore added to the humour. I didn’t really need to emotionally relate to it for it to have its intended effect. Rhiannon is incredibly sarcastic (on everything) and I love her!... well, I also really don’t like her. I’m so torn – so much internal conflict. I would make a good character in a story. Normally I would add blockquotes throughout my reviews, but I’m not going to go there with this one! I feel there really isn’t anything I could quote that wouldn’t either be a spoiler or wouldn’t give a true feel for the story. Just read it, and you will see why.If you enjoy the TV series Dexter, you will probably like this. Fun fact, I learnt about Dexter when a work colleague once said to me “Oh my god, you need to watch Dexter – he reminds me so much of you!” I was this person’s boss. This tells you what kind of ship I run. I really enjoy being facetious during ‘very professional, serious discussions’ at work. Back in the dark days of Facebook I used to do a ‘CJ’s hatred of the day’ which often started with ‘CJ’s hatred of the day is people who…’ Rhiannon’s Kill List reminded me of this. I AM NOT A PSYCHOPATH – shut your face. Peace and Love.There are a couple of moments that feel like they should be ‘reveals’ but they are very obvious and I saw them coming from a mile off, because I’m so clever.. Overall though this story is funny, witty, clever, shocking, predictable in parts and completely unpredictable in others. I wouldn’t necessarily recommend it to everyone. But if you like very dark, inappropriate humour, and the stabby stabby (not a euphemism, but it could work as that too) – go for it!"}, {"userName": "Kirsty &#x1f4da;&#x1f4d6;❤️", "userReviewDate": "Apr 05, 2017", "userURL": "http://www.goodreads.com/user/show/5390112-kirsty-x1f4da-x1f4d6", "userReview": "Originally I was going to say this book was American Psycho meets Bridget Jones but after reading a few more chapters I'm now thinking more of Fox TV's Dexter. The avenging serial killer...but English...and with boobs.Rhiannon is a editorial assistant at the local paper, a victim of a killer who left her childminder and all the other children dead when she was a young girl and it's affects on her have her angry at the world. Every day in her diary she makes lists of all the people she wants to kill if she had the chance. And with some of them she does.It's full of deliciously dark humour, the diary style makes it easy and fun to read. For an angry murderer she has a great sense of humour and it was interesting to read about firstly a female killer and secondly just the mind of a killer in general. What do they do when they're not out stalking their prey or keeping the old school bully in their dead parents house, tied up and tortured??? Watch Masterchef and walk the dog apparently.And that's another reason for loving the book. She's utterly normal. Or rather she has pretend normal down to an art and who hasn't faked happiness or being nice to people at some point (you know you have!). I love the fact that she researches whether she's a psychopath with Buzzfeed quizzes. I love how no matter what acts she commits herself there's no way she would ever hurt animals or children. And I love the fact that at some parts she recognises that she can be different and doesn't go on murderous rampages.I had a free ARC from netgalley. I'd happily buy it and I believe from 20th April you can too :)"}, {"userName": "Sandra", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/49091035-sandra", "userReview": "So ignoring the fact that she kills people I absolutely adored Rhiannon. I really love books with a strong female main character and this book did not disappoint. She is hilarious, smart and quite the complex character. I laughed out loud A LOT which, even though I am generally a giggly, silly person, doesn't happen often when I am reading. The fact that this book is ACTUALLY funny is a huge plus. I'd describe the humor as dry and smart. This book is told in the form of diary entries and each chapter (or at least majority if I remember correctly) starts with a list of people she wants to kill on the day. I could actually relate to some of the things that annoyed her so that made the list aspect even more amusing for me. If I'd had the time I would have finished this book in two, maybe three sittings but unfortunately life got in the way. The twists and turns and the way the story progressed were engaging and well done.Up until the last page this book was really entertaining and challenging and I hope someday I'll get to find out how Rhiannon's story continues."}, {"userName": "Lainy", "userReviewDate": "Apr 12, 2018", "userURL": "http://www.goodreads.com/user/show/3642368-lainy", "userReview": "Time taken to read - 1 dayPages - 384Publisher - HQSource - Gift from O/HBlurb from Goodreads The last person who called me ‘Sweetpea’ ended up dead…I haven’t killed anyone for three years and I thought that when it happened again I’d feel bad. Like an alcoholic taking a sip of whisky. But no. Nothing. I had a blissful night’s sleep. Didn’t wake up at all. And for once, no bad dream either. This morning I feel balanced. Almost sane, for once.Rhiannon is your average girl next door, settled with her boyfriend and little dog…but she’s got a killer secret.Although her childhood was haunted by a famous crime, Rhinannon’s life is normal now that her celebrity has dwindled. By day her job as an editorial assistant is demeaning and unsatisfying. By evening she dutifully listens to her friend’s plans for marriage and babies whilst secretly making a list.A kill list.From the man on the Lidl checkout who always mishandles her apples, to the driver who cuts her off on her way to work, to the people who have got it coming, Rhiannon’s ready to get her revenge.Because the girl everyone overlooks might be able to get away with murder… My review Rhiannon is working as an editorial assistant for a newspaper, once Rhiannon was the news, front page now she can't get a chance to write something proper. But Rhiannon has bigger issues than bitchy colleagues and a crappy set of stories to write. Rhiannon is a killer, brutal but always in control, well almost always. Every day she has a list of people she could kill, if an opportunity presents itself she takes it all whilst juggling her own problems. A boyfriend who is playing away, work colleagues who either don't value her or can see through her mask, Rhiannon needs to up her game. Especially when some of her \"activities\" have started to make the news themselves.You know from the offset who the killer is, sure it tells you in the blurb. We hear from Rhiannon in first person narrative so we know her thoughts/feelings/insights which some will love some will hate, I enjoyed it. The warnings, if you are easily offended this is not the book for you. Graphic sexual references, crude, dirty ooft she has a mouth on her that would make a sailor blush. Brutal killings, infidelity, sex, violence, unpc humour, she is hilarious at points but it is one of those you laugh and think oh I shouldn't. I will check out more by this author, if bad language, brutal gutter mouth and unpc humour makes you uncomfortable then this isn't the book for you. If you don't mind a book that pushes it, rude, crude, funny, brutal then this one ticks the boxes for you. 4/5 for me this time!"}, {"userName": "Olga Kowalska (WielkiBuk)", "userReviewDate": "Sep 13, 2017", "userURL": "http://www.goodreads.com/user/show/5400141-olga-kowalska-wielkibuk", "userReview": "Po „Złotko” warto sięgnąć, kiedy szukamy lektury lekkiej, krwawej oraz smakowitej w swoim fabularnym pomyśle. C.J. Skuse wykreowała postać, której można się obawiać, którą można potępiać, ale której jednocześnie nie sposób nie kibicować. Ten zwyrodniały obraz świata, który przekazuje czytelnikowi Rhiannon, jest zaraźliwy, a od jej sposobów zabijania nie sposób odwrócić wzroku, chociaż „Złotko” nie szczędzi czytelnikowi brutalnych opisów, nie oszczędza też przypadkowych ofiar. Jest w tej opowieści czarny humor, jest mrok opętanej chorobą duszy, co sprawia, że powieść C.J. Skuse czyta się z narastającym zainteresowaniem oraz mieszanką radości i obrzydzenia na twarzy. I są dreszcze, które zostają jeszcze długo po lekturze."}, {"userName": "Susan Hampson", "userReviewDate": "Apr 12, 2017", "userURL": "http://www.goodreads.com/user/show/36613708-susan-hampson", "userReview": "Well dark humour just got a few shades darker with this novel, which at times I was left thinking can you really get away with saying that? but it just wouldn't be Rhiannon if she didn't because this psychopathic young woman is like a wild beast with it's prey in sight and nothing will stop the frenzy of madness. It is like her drug, the fix that she gets off on including her self gratification with the dying and dead. She can justify her reason to kill  these people as they are not the cream of society. The awful thing is, so can I!Told in the form of a diary by Rhiannon, it begins each day with a list of people that have jarred her off the day before. The seriousness of her thinking is hilarious, as I found myself laughing at the most inappropriate reasons, why someone could be living on borrowed time. She isn't a woman you really want to upset, in fact she isn't someone you really want to know at all.  Rhiannon, being a true psychopath, liked her own company but knew that she had to fit into society and so she had a boyfriend but as a reader I was in Rhiannon's head, I knew the wicked thoughts  that were behind the kind smile she gave him. It was the same at work, where she has to really try to remember to play nice and appear part of the crew at the Newspaper Office.  She is quite the chameleon, not really standing out but blending into the environment where ever she is.This is a very brutal and violent story that won't sit easy with some readers but the further you read the more the past unfolds and the more you understand. Cee Jay Skuse has her own unique writing style which I felt was so very refreshing. I loved the bluntness of the writing which captured the internal workings of Rhiannon with perfection.  Totally wicked entertainment that I loved."}, {"userName": "Lauren James", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/4254869-lauren-james", "userReview": "As a big fan of Hannibal and the dark sociopaths of shows like Fleabag, I was excited to read this - and it definitely paid off! From the first page, the protagonist is shocking and unlikable in the most refreshing way. At times it felt a little unrealistic - surely psychopaths aren't thinking about murder constantly, even when they're in the bath or eating ice cream, right? RIGHT? (What do I know, though) - I think that's the point of books like this. You have to embrace the awfulness. The freedom of a character who kills everyone they want to meet. Sweetpea provides. Oh, boy does it provide. Warning: Skuse also writes YA, but this is definitely, definitely an adult book. I don't really believe in putting age categories on books, but I would say that don't read this unless you're above 18 - or are fully prepared for the contents. It's not pretty."}, {"userName": "Inn Auni", "userReviewDate": "Sep 30, 2017", "userURL": "http://www.goodreads.com/user/show/63953198-inn-auni", "userReview": "The best part was when she killed people. Really, I'm not kidding. Sweetpea (I know her name but I'll just use her nick instead) listed every annoying people that crossed path with her. I was excited because hey, she's going to start killing right? She got a plan some where right. By 20% of the book, she killed 2 people unplanned minus the one she did years ago (there're probably more but, that's all I know) and she had someone hostage in her late parents' home.Sweetpea hated everyone and I was hoping she just made a bomb and blow them all up. All I got was her being angry all the time. At one point I just want her to end her life. Like slice your wrist or something because shut up, just shut up and do something about it.It's either you do something about it or let go. But, Sweetpea never let go. So, she kept going on and on being angry. I have no sympathy for her even knowing she was bullied in childhood and that was partly the reason she was what she is now.Skuse made it bearable though. I cannot stop reading and wanted more. I wanted someone to die. I'm craving for blood. Because it got me angry the more I read about Sweetpea anger. If Sweetepea became who she is by being bullied, then I became what I am because of her.Sweetpea was those people who you knew and vented to you so, you sat there and listened with a smile because deep down you knew she had a tendency of hurting people. But, once she left, you will forget everything because it doesn't matter who die as long as it's not you.P/s: There'a mentioned about a guy named Paul who went mountain climbing in Malaysia. So, he wanted Sweetpea to write about his adventure in Kuala Lumpur and how he lived with tribespeople. I kid you not.\"Paul wants me to help him write up his ‘life-changing’ adventure in Kuala Lumpur where he got to live with tribespeople.\""}, {"userName": "Shell Baker", "userReviewDate": "Apr 07, 2017", "userURL": "http://www.goodreads.com/user/show/27220623-shell-baker", "userReview": "This is the first book that I have read by C.J. Skuse and certainly won't be my last. A psychopath with an hilarious sense of humour...absolutely priceless. I have read some books in my time but nothing quite like this it is hilarious I couldn't help but laugh out loud.Rihanna is a psychopath and tells a twisted, shameless outrageous story written in diary entries. With an opening of her kill list. Rihanna is a normal average woman which people can relate to. I certainly could I freaking loved her crude, witty, sarcastic sense of humor, she’s totally on my wavelength. I will say this book isn't for readers that are easily offended.The Murder scenes are very brutal and twisted and not for the faint hearted but are told in a way that made me laugh.Yes laughing at a murder…. OMFG what is going on...seriously you won't believe it until you read it yourself.And the ending...I was like OMG has my kindle broke...cannot wait for the follow on. Sweetpea has gave me book hangover that for sure.This is one unique refreshing read that had me laughing from start to end. I must say it isn't going to be everyone's cup of tea. But I bloody loved it. All the stars from me."}, {"userName": "Craig Allen", "userReviewDate": "Feb 13, 2017", "userURL": "http://www.goodreads.com/user/show/2731841-craig-allen", "userReview": "3.5 stars. This was a uniquely written story of a girl named Rhiannon who is a serial killer that seems to target bad people, such as rapists and pedos, but also has an ongoing diary of people she'd LIKE to kill...sort of a fantasy kill list. The book is dark and all sorts of wrong, but she is actually a very entertaining main character. I'm also sad to say I kind of related to her thoughts on annoying people, obviously not to her extent, but she had a comical view of the world overall. I thought the book dragged in parts and could have been a bit shorter, but it was overall pretty good. I'll definitely not forget Rhiannon anytime soon and wonder if there's any potential in a sequel down the road, in some form."}, {"userName": "Carol Peace", "userReviewDate": "Apr 21, 2017", "userURL": "http://www.goodreads.com/user/show/4088622-carol-peace", "userReview": "Rhiannon is not your everyday serial killer and in fact not an everyday sort of person at all, she is very complex due to an incident in her past and although she hasn't killed for a while she seems unable to stop herself. The book has quite a few profanities and quite gruesome kill scenes but it also gives us insight into Rhiannon's gentler side or what counts as it after all she collects Silvanian Families figures and there are so many laugh out loud situations that you cannot help yourself from agreeing with her in places. I loved this book and can see that some might not but if you do decide to read it be prepared for a roller coaster of emotions that might be better dealt with at home and not on public transport.The kill lists that are at the start of every chapter make you realise that some of the people there you can see her reasoning why she would pick them. I can't wait to see what CJ Skuse comes up with next as I for one will be waiting eagerly for the next book. Thank you to NetGalley for my copy of the book."}, {"userName": "Karen Barber", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/38841409-karen-barber", "userReview": "We’re introduced to Rhiannon by learning about her ‘kill list’ (her daily list of people she’d like to dispose of) and her grumpy gripes about her friends that she feels increasingly alienated from. This might sound like a new Bridget Jones...until we see Rhiannon getting caught up in a no-strings sexual encounter that does not quite go as we’re expecting. The opening chapter ended in such a way as to make it clear that Rhiannon is no passive female. In fact, she’s a killer...and we’re given a unique and unedited insight into her mind.Scarily, there are moments when you find yourself agreeing with some of her comments. She has a definite streak that is a little appealing, though totally unconventional.Watching Rhiannon go about satisfying her urges was scary stuff. Yet Skuse manages to present her as not wholly unlikeable.There’s no getting away from the fact that there’s a lot of gruesome detail about the killings. I’m amazed she gets away with it for as long as she does, though we’re given hints about her past that help explain this.Oddly, when she finds herself pregnant things take a more menacing turn and we get a sense of a mind in decline. Heaven only knows where this goes next, but I’m assuming it won’t go well for some of those caught in Rhiannon’s web."}, {"userName": "Pamela Lilley", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/32732734-pamela-lilley", "userReview": "Whoa! There is nothing, and I mean, nothing, sweet about Sweetpea. Rhiannon has some major issues, issues resulting from her past, her family and the fact that she's a little psychopathic. Killing appears to be her release, and it would also appear she has a very addicting personality, because she can't seem to stop. I've got to say there are some truly gruesome scenes, which actually had me cringing as I read them. Other scenes had me laughing and some scenes had me worried!! Why? Well, basically because I agreed with some of her grumbles, I understood her 'kill list', I get peeved off by many of the things that Rhiannon does. Thankfully I'm not up for killing someone! Although I understood her revenge/vigilante killing spree, she upped the anti when she started feeding her addiction with innocent people. An extremely clever story that had me hooked from the first page. With a few twists and turns on the way, along with some fabulous writing, I've got to say, I really enjoyed this book. I was provided with an advanced copy of this book from the publisher via NetGalley in exchange for an honest review."}, {"userName": "Marilyn Belsham", "userReviewDate": "Jan 08, 2018", "userURL": "http://www.goodreads.com/user/show/3623644-marilyn-belsham", "userReview": "To be entirely honest, I didn’t actually read this cover to cover, I read half of this and then gave myself permission to skim the rest. It was at the point that I realized I was physically grimacing as I read this that I questioned my need to finish what I had started. The protagonist is a horrible person and I didn’t find her funny in the least. Even before we got to the first murder, I disliked her immensely. She’s a hateful, unappealing person masquerading as someone with “wit”. It was tiring being with her and frankly I found her a bore. Ive read weird. And I’ve read weird descriptive deaths before and they aren’t always bad. (Thinking of “Library at Mount Char” - that I loved) It is possible that this was either the wrong book/wrong time or it just was genuinely terrible with nothing to redeem it. I’m going with the latter."}, {"userName": "Janel", "userReviewDate": "Mar 30, 2017", "userURL": "http://www.goodreads.com/user/show/55771094-janel", "userReview": "Warning: don’t read this book is you don’t like your humour on the darker side of life. If you enjoy black humour, read this book, it’s over-the-top, crude, fun, a tad murderous but oh so funny – it’s bloody brilliant!If you don’t like people staring at you for breaking out into fits of laughter, don’t read this book in public. Skuse knows how to write black comedy, and she’ll have you laughing out loud for sure.Told in a series of journal entries, we journey with Rhiannon through her life as she documents the people she’d like to kill, manages to kill a few of them, all the while keeping up ‘The Act’ of appearing normal. I won’t divulge any more about the plot but I’m quite concerned that I wish Rhiannon was my friend. Wanting a serial killer for a friend is quite worrying but it’d be so worth it, if she was herself that is. Wait, wait, wait, let me clarify that, by herself, I don’t mean the serial killer part, I mean the sarcastic comments, the dry wit and the downright funny sense of humour.Rhiannon is a wonderful character, and okay, she may have a few murderous tendencies but it makes for entertaining reading, and we all have our flaws, anyway, most of the people she kills are bad, so that’s okay right!? I mean, who doesn’t get annoyed when the person in front of you at the checkout has finished paying for their shopping, their bags are packed and they have their change but they still stand chatting to the cashiers for ages, while you’re impatiently waiting, and then to top it off the cashier has the cheek to thank you for waiting when she eventually serves you – like you had a choice in the matter! Don’t fret, Rhiannon doesn’t kill this customer, she’s just list-worthy, she tends to turn her fantasies into realities on the people who commit crimes of a more heinous nature. Yes, I’m shamelessly trying to justify having a serial killer for a friend but read this book and you’ll fully understand why. While this is crime fiction, it can be enjoyed by anyone who enjoys black humour.I highly recommend this book, it’s hilarious, full of profanities, has some explicit scenes, it’s definitely adult reading material, it won’t be for everyone but it was perfect for me; come and see what a day in the life of Rhiannon is like – just don’t call her ‘Sweetpea!’*My thanks to the author (C. J. Skuse) and publisher (HQ) for granting me access to a digital copy of this book via Netgalley*"}, {"userName": "Aoife", "userReviewDate": "Apr 19, 2017", "userURL": "http://www.goodreads.com/user/show/16768476-aoife", "userReview": "I received a free digital copy from the author/publisher via Netgalley in exchange for an honest review.Rhiannon is a 27-year-old receptionist working at a local paper who seems happy in her life and domestic bliss with her boyfriend Craig. However, deep down Rhiannon is a bit of a psychopath who lists down the people on her Kill List everyday in her diary and has a flip that can switch a bit too easily. As Rhiannon's blood-lust grows and her anger deepens, it's only a matter of time before she snaps for good.This book is crass, outrageous and just absolutely batshit crazy and I think anyone who likes You by Caroline Kepnes and/or The Girl in 6E by AR Torre should think about picking this up as it might be up your alley. I did think I was really going to enjoy this book but unfortunately it did end up a being a bit of a dud. I'm not actually sure what it was that didn't connect with me - whether it was that my mood wasn't right which made me feel a disconnect with the character or whether i had read similar before and done better. I think what threw me off at first was just how angry Rhiannon was from the get go. She was so full of rage at everything and I felt like she was shouting at me from the pages, which I really didn't like. I started this after a long day of work and maybe my body and mind was just too exhausted to be able to handle a crazy character shouting her Kill List at me. I also just didn't understand how Rhiannon didn't get caught with the numerous murders she commits throughout the book - she gets messier and messier and while the slight twist at the end was good and made me go \"wow\", I do feel like the story was a bit unbelievable and scoff-worthy at times.There was a twisty humour to this book though that definitely earned a chuckled from me a few times. Her Kill List is often full of all sorts of people that everyone encounters at some point during the week or another and people whom everyone has vented about. This book is great for anyone wanting a bit of a shocking read and something that will keep them on their toes. Unfortunately for me at this time, it just wasn't what I was looking for."}, {"userName": "Julie Smith", "userReviewDate": "Mar 26, 2017", "userURL": "http://www.goodreads.com/user/show/57579364-julie-smith", "userReview": "The Blurb:When she was good, she was very, very good. When she was bad, she was deadly.Rhiannon is your average girl next door, settled with her boyfriend and little dog…but she’s got a killer secret.Although her childhood was haunted by a famous crime, Rhinannon’s life is normal now that her celebrity has dwindled. By day her job as an editorial assistant is demeaning and unsatisfying. By evening she dutifully listens to her friend’s plans for marriage and babies whilst secretly making a list.A kill list.From the man on the Lidl checkout who always mishandles her apples, to the driver who cuts her off on her way to work, to the people who have got it coming, Rhiannon’s ready to get her revenge.Because the girl everyone overlooks might be able to get away with murder…When I started this book I wasn't sure whether I'd like it, but I carried on anyway and I loved it! I loved Rhiannon's darkness. I also loved C J Skuse's turn of phrase. I read bits out to my husband and he was laughing too. 5*"}], "description": "The last person who called me ‘Sweetpea’ ended up dead… \nI haven’t killed anyone for three years and I thought that when it happened again I’d feel bad. Like an alcoholic taking a sip of whisky. But no. Nothing. I had a blissful night’s sleep. Didn’t wake up at all. And for once, no bad dream either. This morning I feel balanced. Almost sane, for once.\n Rhiannon is your average girl next door, settled with her boyfriend and little dog…but she’s got a killer secret. Although her childhood was haunted by a famous crime, Rhiannon's life is normal now that her celebrity has dwindled. By day her job as an editorial assistant is demeaning and unsatisfying. By evening she dutifully listens to her friend’s plans for marriage and babies whilst secretly making a list. A kill list. From the man on the Lidl checkout who always mishandles her apples, to the driver who cuts her off on her way to work, to the people who have got it coming, Rhiannon’s ready to get her revenge. Because the girl everyone overlooks might be able to get away with murder…", "title": "Sweetpea\n      \n          (Sweetpea #1)", "url": "https://www.goodreads.com/book/show/33847005.Sweetpea", "average": 3.99, "cover": "https://images.gr-assets.com/books/1487542972l/33847005.jpg", "reviews": 266, "authors": [{"url": "https://www.goodreads.com/author/show/3188620.C_J_Skuse", "name": "C.J. Skuse"}], "type": ["Thriller", "Fiction", "Mystery", "Contemporary", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/33847005-sweetpea", "http://www.goodreads.com/book/show/33229410-sweetpea", "http://www.goodreads.com/book/show/35925802-sweetpea", "http://www.goodreads.com/book/show/13482839-rockoholic", "http://www.goodreads.com/book/show/9842947-pretty-bad-things", "http://www.goodreads.com/book/show/16126716-dead-romantic", "http://www.goodreads.com/book/show/23126437-the-deviants", "http://www.goodreads.com/book/show/23126431-monster", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}