{"ratings": 1649, "userreviews": [{"userName": "Michelle", "userReviewDate": "Feb 29, 2008", "userURL": "http://www.goodreads.com/user/show/369732-michelle", "userReview": "I wasn't sure what to expect with this story. At first I thought it would be a straight chick lit, and in some ways it was. However, Sweet Caroline touched me in a deeper place than most lits do. I actually got choked up a few times. I rarely do these days. There were some very funny moments, some truly enjoyable girl times, and some romantic interludes that sizzled and popped. Best of all, though, was a spiritual awakening and a discovery of one's place in this world that was breathtaking and yes, sweet.I loved this story. It was hard to put down once I got past the first few chapters. I loved the old folks, the lowcountry charm, and the author's voice. The honesty and self-examination Caroline had to deal with in order to grow was truly inspirational. She was strong, yet totally emotionally vulnerable, and for good reason. I loved how Caroline was so perceptive of other people's needs. She was also brave and willing to tackle her issues.When she helped her brother tackle his bitterness there was a genuine God moment that was unforgettable. I am rarely as moved as I was during that pivotal point in the story. Of course I'm being vague so as not to spoil the surprise. At any rate, this story is probably my favorite story penned by Hauck. Does it get any better than this??? Seriously.Sweet Caroline was published by Thomas Nelson and released in February 2008."}, {"userName": "Margaret Chind", "userReviewDate": "Feb 25, 2008", "userURL": "http://www.goodreads.com/user/show/226769-margaret-chind", "userReview": "Sweet Caroline is quite the book, and she is quite the person. She is a normal human being, in a normal life. Tough decisions need to be made, and only Christ knows if she is making the right choices. This book grips your heart and doesn't let it go. I love it from the heart-head-ear conversations to the screaming in my head what I thought she should do. :) This story of a girl in her late twenties growing up is something that anyone could benefit from reading. Caroline's situations remind me of some of Jane Austen's tales, where you really want it to end one way, but with more thought you want it how it is, and then you go back to the other. Over all this book was a comfy read and caused more giggles and grins that I care to admit. The whole cast of characters was a hoot and found a warm place in my heart. I cannot wait to read more through  Love Starts with Elle.  Rachel Hauck has a real winner here and I'm definitely putting her future books on my TBR lists."}, {"userName": "Candice", "userReviewDate": "Mar 19, 2013", "userURL": "http://www.goodreads.com/user/show/13459122-candice", "userReview": "I LOVED this book! I, literally, laughed out loud in at least every chapter. The main character was hilarious. I have to admit though, the surprise ending threw me for a loop. The ending was satisfying, all loose ends were tied by the last page, but I'm dying to know what becomes of the characters next. Maybe it mentions this in \"Love begins with Elle\"? I will have to read it to see. :)"}, {"userName": "Mandi", "userReviewDate": "Oct 09, 2017", "userURL": "http://www.goodreads.com/user/show/47738498-mandi", "userReview": "Loved this book! I laughed, I cried, I enjoyed. I've already read the other books in the series (also great!) so it was nice to finally read the 1st one & get the full story 😊 (they are not fully stand-alone books)"}, {"userName": "Becki", "userReviewDate": "Sep 22, 2017", "userURL": "http://www.goodreads.com/user/show/4070808-becki", "userReview": "I read the ebook. The breaks in time weren't really clear within the chapters, and I think that messed with the flow and enjoyment of the book for me. I did really like the characters."}, {"userName": "Cheryl", "userReviewDate": "May 11, 2017", "userURL": "http://www.goodreads.com/user/show/3083059-cheryl", "userReview": "Something was lost in translation between print and ebook with this. Words were hyphenated in the middle of lines and scenes changes without warning. I was reading words like managed as man-aged and they didn't make sense. Also one minute Caroline and Mitch would be walking together and all of a sudden Caroline would be climbing her tree to think. What! Where did that come from!As for the story itself, Caroline was too indecisive for me and the religious part felt really forced at first. I did like Mitch but I kept forgetting who Kirk was and I still don't know who Luke was. I didn't like the ending either. Imagery was really good and the meals sounded good.Not sure I will read any more of the series but if I do it will be in print not ebook."}, {"userName": "Susan", "userReviewDate": "Jul 24, 2015", "userURL": "http://www.goodreads.com/user/show/10770583-susan", "userReview": "I picked this book up at a sale some time back and placed it in my \"to-be-read\" pile. I found it a great summer read and am glad I picked it up now. For those who enjoy Christian Fiction, it has the faith element woven into it, but not in a cheesy way that some books in this genre do. In fact, I felt this book was about real people with real problems and real feelings. I like that about Hauck's writing. This book was published in 2008 and is followed by two more romance novels set in the Lowcountry of South Carolina. The ending was unpredictable and did leave me wishing for a more tightly wrapped package with a pretty bow...but that's not how real life is, is it? I will be picking up more of Hauck's work to read in the future for sure!"}, {"userName": "Kristen", "userReviewDate": "Jul 27, 2013", "userURL": "http://www.goodreads.com/user/show/1049422-kristen", "userReview": "2 1/2 Stars - Very slow start for me...picked up a little in the middle-end.I don't know if it the kindle version (probably), but it was very confusing at times. We would be in one place with characters talking, then all of the sudden in the next joining paragraph we are in a totally different situation... The Christian aspects were a little too preachy. Romance was a little weak, didn't give a good happy concluding ending, don't know if this is going to be a sequel or not...just ok for me. Moral Note: Talk of moving in together, sex before marriage. Cheating - friends with benefits, that sort of thing."}, {"userName": "Jaclyn", "userReviewDate": "Feb 26, 2011", "userURL": "http://www.goodreads.com/user/show/794912-jaclyn", "userReview": "This book was a good distraction for me when I needed a fast, easy read. Caroline is a people pleaser who can't say no to anyone, and always puts off her own plans and dreams for others. Now she's been offered the opportunity of a lifetime, a job in Barcelona with one of her best friends. The only problem is: she's just inherited the Cafe she used to work for, and her long time love is back in town. Will Caroline finally put herself first? And what does that mean exactly?"}, {"userName": "Deanna", "userReviewDate": "Jan 28, 2011", "userURL": "http://www.goodreads.com/user/show/4861334-deanna", "userReview": "Cute at times, but just to over the top for me. The main character has to choose between two completely hot guys who are after her (one a famous country star). Also whether she should take a job with the Donald Trump of Europe who thinks she's wonderful, despite the fact that she has no experience, education, foreign travel background, connections or even lived out on her own, or stay and own her own business that she received for free and starts doing great under her Midas touch."}, {"userName": "Nancy H Vest", "userReviewDate": "Jul 21, 2012", "userURL": "http://www.goodreads.com/user/show/1381441-nancy-h-vest", "userReview": "Even though this is categorized as a romance, I didn't see it as one. To me, it was a story of a woman facing some difficult choices. The ending was not what I was expecting, but it was believable and left several possibilities open for what could happen next.The story is told with a single POV and it is told in present tense. I liked that! It's different!"}, {"userName": "Jenny", "userReviewDate": "Jul 03, 2013", "userURL": "http://www.goodreads.com/user/show/1046081-jenny", "userReview": "Started out okay and then went downhill slowly but gradually all the the way to an unsatisfying end."}, {"userName": "Chesney", "userReviewDate": "May 22, 2013", "userURL": "http://www.goodreads.com/user/show/18311086-chesney", "userReview": "I liked the book. Great characters and I love that is has a South Carolina feel. I was disappointed in the end though. It left you you hanging and I didn't like it."}, {"userName": "Jenny", "userReviewDate": "Jan 23, 2010", "userURL": "http://www.goodreads.com/user/show/3193888-jenny", "userReview": "Fantastic!!! funny love story and friendship too. And let's not forget car naming. Great Novel I love her!!"}, {"userName": "Cookielover", "userReviewDate": "Feb 06, 2013", "userURL": "http://www.goodreads.com/user/show/16569148-cookielover", "userReview": "Perfect mix of something totally more than sweet. I loved the characters and everything."}, {"userName": "Cathy Daniel", "userReviewDate": "Apr 16, 2013", "userURL": "http://www.goodreads.com/user/show/7218096-cathy-daniel", "userReview": "What an amazing, wonderful book! I cried and laughed ( the racing scene was hysterical to me lol) I can't wait to read book #2!"}, {"userName": "Grace Tolman", "userReviewDate": "Jul 05, 2017", "userURL": "http://www.goodreads.com/user/show/4256497-grace-tolman", "userReview": "First off, I wished I would have read this one first. I read the second one in this series last year so now I am so eager to reread it just because the ending in this one felt like it was not totally finished yet. That being said, I felt like Caroline was a character that was very relatable and likable. Her need to help out everyone but herself seemed like a weakness sometimes, but overall you cannot really find fault with someone that is that charitable and kind. I felt the storyline taking me through different curbs. In the beginning, it was the mystery with her getting his boss' business. Then there was the fact that the two men in her life \"seemed\" to be good guys but then later one one proved to be the better catch than the other. Then you have the fact that Caroline had the job offer in Barcelona. Is she going to take it or not? The author wrote it in a way where at times I thought she would let it go and then there were times when I knew she would go for it. Overall I think the story was really good. The way the author divided the story and scenes made you want to read more and more. I like it when an author can do that effectively. I was just sad that the love story did not have quite the happy ending like most books. This was the first one from Rachel Hauck that I have read that the story did not end when the book ended."}, {"userName": "Sharon", "userReviewDate": "Jun 06, 2018", "userURL": "http://www.goodreads.com/user/show/1037909-sharon", "userReview": "Top Ten favorite bookI am a romance novel addict! My day is not complete without at least a few chapters of a good clean happily ever after. So when I say this is in my top ten, that’s not for lack of serious competition! I just read this book for the second time and think I loved it even more than the first. Love Caroline’s big heart and crazy humor. Love the unique characters and South Carolina charm. Love the friendships from all ages. Love that good always triumphs over evil. Love that virtue and integrity are treasured. Love that God is the miracle to set everything to rights. Thank you for such a treasured book!"}, {"userName": "Mary Schenk", "userReviewDate": "Mar 17, 2018", "userURL": "http://www.goodreads.com/user/show/57396929-mary-schenk", "userReview": "I enjoyed parts of this book however, there were more parts I didn't enjoy! First of all I didn't enjoy the narration because it jumped back and forth between a third person narrative to regular narration. Second I'm not a fan of how God was brought into this book! A majority of what I read is Christian fiction and there are so many other books that bring God to light in a better way. Lastly I don't know about anyone else but that ending was horrible very disappointed! I have read dining with Joy from this Series and loved it this was a let down!!!"}, {"userName": "Katie", "userReviewDate": "Sep 16, 2017", "userURL": "http://www.goodreads.com/user/show/64407765-katie", "userReview": "I'm SO torn over this one! Really enjoyed it almost all the way through but hated how it ended. I'm a big fan of \"guy-always-gets-girl\" and \"everybody lives happily ever after.\" Although, I do understand where the Author was taking it and I still enjoyed the storyline. Rachel Hauck is extremely talented and totally made me feel like I was right there with the main character. I'm excited to read the 2nd book in the series."}, {"userName": "Johazel Ehnes", "userReviewDate": "Sep 11, 2017", "userURL": "http://www.goodreads.com/user/show/53112649-johazel-ehnes", "userReview": "I did enjoy reading this book. Caroline has such a big heart to help those that really have a need. She is a great example for anyone. While we as individuals need to take care of ourselves we can do that better if we keep being kind in this world. Our needs will be taken care of."}, {"userName": "Tina Cobabe", "userReviewDate": "Aug 30, 2017", "userURL": "http://www.goodreads.com/user/show/30502959-tina-cobabe", "userReview": "Great StoryI enjoyed the book. It had a great story line that included the strength of the main character and romance."}, {"userName": "Laura", "userReviewDate": "Apr 26, 2018", "userURL": "http://www.goodreads.com/user/show/3671198-laura", "userReview": "Knocked down from 4 to 3.5 stars because I wanted the HEA."}, {"userName": "Lynda", "userReviewDate": "Mar 18, 2017", "userURL": "http://www.goodreads.com/user/show/52620485-lynda", "userReview": "Caroline\"s high school sweetheart (the one who promised her the moon and stars and marriage) goes to Nashville and becomes a big star, leaving Caroline behind. Caroline stays in Beaufort waiting and helping friends and family with their problems and businesses. At age 28 Caroline gives up on Mitch and decides to take a job in Spain that has unexpectedly come up. You knew it!! Mitch comes home and wants her back.Romance is not my genre but this was a good and quick read. I picture it being a good book for early teens."}, {"userName": "Tina", "userReviewDate": "Feb 23, 2010", "userURL": "http://www.goodreads.com/user/show/1552211-tina", "userReview": "Original post at One More PageI had reservations with Rachel Hauck's other novels because my reaction to her first novel, \nLost in Nashvegas\n was just lukewarm. I liked it, but it didn't amaze me or blow me away and I haven't picked it up again since I read it the last time. I read Sweet Caroline with low expectations, just so I won't be disappointed with this buy.I'm kind of glad that I didn't have much expectations, because I was really pleasantly surprised by this novel. Sweet Caroline is quite...well, sweet, for the lack of better words. Everything in this novel is just sweet and charming, from Caroline to the Frogmore Cafe staff to the other secondary characters to the town itself. This is one of the few times I really appreciated the setting of a novel, and it's in a Southern town again. I love the quirkiness of the town, the Frogmore Cafe and everyone else in the story, as it provided me with a very warm feeling, almost like I was one of the Beaufort residents. It was almost like the book was welcoming me into its arms, inviting me to join them in their different town adventures.Caroline is definitely a character, one I'd love to be friends with myself. In a way, I think a lot of women in their 20's could relate to her, because I definitely did. She's far from perfect, and most of the times, she had no idea where to go or what to do. But when extraordinary opportunities come knocking, she felt overwhelmed, and she didn't know what to do. Don't we all have that same reaction? She had a big heart, one that learned to forgive as she got to know the God of forgiveness. I loved how she came to know God, how she got to know God and how she learned to believe that God loved her so much. It was something out of the ordinary, yes, and I guess some people won't believe those things happen anymore...but then who knows? I've heard more drastic stories, and if God wanted to get someone's attention, then I bet He'd go all out on it. It almost felt like the words uttered to Caroline were for me -- and maybe they were? I'd like to believe that they were lessons for me, too. For example, I could replace Caroline's name with mine in this line, and relate to it almost 100%:\n\"You are so blessed, Caroline...I mean this: God is looking out for you.\"\n (p 195)\nDespite its sparse prose, the novel was still well-written, and easy to understand. There were no complicated words or long descriptions, and most of the lines were funny and crazy. I especially loved Caroline's Head and Heart conversations:Head: Interesting development.Heart: For once, I agree with you.Head: What do you think he's up to? And, we've agreed before.Heart: Do we risk it?Head: No. Stay in neutral, heart.Heart: But he's changed. Really.Head: Don't make me come down there. (p.225)These conversations were just right for Caroline because for other characters, I don't think it would work. :PThe romance factor is also very, very juicy. This is a little bit of a spoiler, but I can't not share this:As the house lights dim for the second half of the performance to begin, Mitch offers his hand. \"May I hold your hand, Caroline?\"Gulp. I nod.His hand is firm and broad; his fingers lock perfectly with mine. \"Mitch,\" I say, barely above a whisper. \"I'm afraid of falling.\"He presses his lips to my ear. \"Don't worry, I'll catch you.\" (p. 235) I practically swooned when I read that part! :) Heeee. But if you think it will end up the way it seemed from that part...well, there were still more surprises down the end, and those made the novel stand apart from others. It's not really just a love story between two people. It's a love story between a woman and her God, and a story of how a woman found herself through the love of Someone who loves her more.Sweet Caroline is sweet, from the first page up to the last. I laughed, cried, and felt like I lost a friend when I closed the book. Good thing Rachel Hauck gives us another chance to visit Beaufort with a companion novel for Sweet Caroline, Love Starts with Elle. And it's good that I have a copy of that. :PI'm glad I read this novel, and I'm glad I gave Rachel Hauck another try. :) Sweet Caroline is a light, thought-provoking read, and in some instances, the title would make you break out into song, too. :)"}, {"userName": "Emily Joy", "userReviewDate": "Mar 19, 2017", "userURL": "http://www.goodreads.com/user/show/58705150-emily-joy", "userReview": "Good book. Not so happy about the ending. However, with that being said, the ending made the book slightly more realistic than others."}, {"userName": "Teresa", "userReviewDate": "Sep 24, 2016", "userURL": "http://www.goodreads.com/user/show/4792595-teresa", "userReview": "This was a sweet Christian romance. She's a few tears and had a few moments of laughing out loud. Just a good quick read and worth the time."}, {"userName": "Stacy", "userReviewDate": "Aug 12, 2012", "userURL": "http://www.goodreads.com/user/show/2443798-stacy", "userReview": "This is a nice story that feels like the South Carolina low country it is set in. The writing was good and kept me reading into the night. There were many storylines woven together with real skill. The finding God storyline was one that I found moving without being preachy. That being said, some things were a little too good. I’ve never had a car dealer make a deal with me and then throw in an extra $1000 because he thinks I’m a good person and I know there are many virgins in their late 20′s, but they and their dates have issues with it that never really came up in this book. So there were a few things that didn’t ring quite true for me.I would recommend this book. I think you’ll really like Caroline and her story. Essentially, it’s one woman’s quest to make her way in the world on her own terms. I will gladly read more inspirational fiction, especially when I need to be reassured that the world is not always the cynical place it’s made out to be.there's more on my blog http://stacybuckeye.wordpress.com/200..."}, {"userName": "Becky", "userReviewDate": "Feb 08, 2017", "userURL": "http://www.goodreads.com/user/show/1480966-becky", "userReview": "It's a 3.5. The \"Come to Jesus\" moment is bizarre, and I'll never understand why feeling the Spirit is equated with being \"saved.\" I'll get off my doctrinal high horse and say I did like the story, but also felt like the ending left you a bit hanging."}, {"userName": "Hayley", "userReviewDate": "Mar 07, 2015", "userURL": "http://www.goodreads.com/user/show/4192442-hayley", "userReview": "Sweet Caroline was a really endearing story about a young woman who needs a little \"push\" in life. She's lukewarm in life, her faith, and caters to everyone around her, before herself. That's before she is handed the keys to a Beaufort Cafe, The Frogmore, in Jones' will. She doesn't know what to do or which way to turn and decides immediately she should sell it. Should she sell it? She is also given a chance of a lifetime to work in Barcelona! Should she stay in her home town and struggle making ends meet with this broken down fixer-upper cafe? Or should she take a plunge and go to Spain? I really like Caroline. I loved that in the end she did what was best and in her heart she listened to what Jesus called her to do.This is a great Christian Fiction/romance book. It's not too \"preachy\" if that isn't your style, but has just the right amount of Christian roots in it to make it a great inspiration to others :)."}], "description": "Caroline serves others with little time to enjoy the sweeter parts of life. Until her old boyfriend returns to town--and she's given a second chance at first love.Life hasn't always been so sweet for Caroline Sweeny.She's sacrifice her desires for others--unlike her mother who abandoned their family years ago. But when a friend challenges her to accept an exciting job adventure in Spain, Caroline says \"yes\" to a new destiny.But before she can pack her bags, Caroline suddenly finds herself the new owner of the run-down Frogmore Café--and forced to choose between her friends and her future.Then her first love, Mitch O'Neal, returns home and encourages her to seek God's desires for her future. With his help, she may just discover the true sweet life.", "title": "Sweet Caroline\n      \n          (Lowcountry Romance #1)", "url": "https://www.goodreads.com/book/show/2288199.Sweet_Caroline", "average": 3.94, "cover": "https://images.gr-assets.com/books/1441507149l/2288199.jpg", "reviews": 117, "authors": [{"url": "https://www.goodreads.com/author/show/257934.Rachel_Hauck", "name": "Rachel Hauck"}], "type": ["Christian Fiction", "Christian", "Romance", "Womens Fiction", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/2288199.Sweet_Caroline", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/9154827-sweet-caroline", "http://www.goodreads.com/book/show/6953899-sweet-caroline", "http://www.goodreads.com/book/show/11942639-the-wedding-dress", "http://www.goodreads.com/book/show/16164030-once-upon-a-prince", "http://www.goodreads.com/book/show/18224923-princess-ever-after", "http://www.goodreads.com/book/show/22574070-how-to-catch-a-prince", "http://www.goodreads.com/book/show/25316736-the-wedding-chapel"]}