{"ratings": 34636, "userreviews": [{"userName": "Emily May", "userReviewDate": "Nov 02, 2016", "userURL": "http://www.goodreads.com/user/show/4622890-emily-may", "userReview": "This is my second Zadie Smith book and I find myself disappointed once again. I saw a comment somewhere that summarized my feelings on Smith's novels: she should write less, say more.Smith is, in some ways, a fantastic writer. Her social commentary is witty and insightful, her detailed and complex characters drive her work, her little observations about human nature ring true. But oh my, does she waffle on about everything. She brings themes of race, gender, colonialism, capitalism, celebrity culture, and dance theory and mixes them all together, touching on each in turn but leaving all of them a little flat. Swing Time skims the surface of these topics but, for me, it doesn't do anything truly memorable with any of them.This is the second \"literary\" work I've read recently that felt like a series of disconnected but beautifully-written pieces, all floating around without direction or focus. The other one being The Nix, which I actually enjoyed more. Both authors throw in some perfect characterization and wonderfully-written scenes, but the two lengthy books each left me feeling like \"is that it?\"Swing Time constantly jumps between different times and places, making it honestly quite difficult to stay invested in any of the wandering roads it takes. Tracey is by far the more interesting character, which makes the Aimee chapters noticeably boring and hard to get through. The story promised by the blurb - of two young brown girls who want to be dancers - makes up the first part of the book and is interesting, but the story quickly moves away from there and gets lost. There's a real lack of focus throughout the book and I spent a lot of it feeling like I was drifting around aimlessly.The unnamed narrator seemed like an interesting technique at first, but it made for a very distant, impersonal narrative. Maybe it was because we were never encouraged to warm to her that the novel felt so aloof and intellectual - delivering its interesting concepts without any pull or life to them.On the more positive side, I liked how the author explored the ways rich people throw money at causes with little thought to if and how it helps. I also liked how she shows divisions within races - issues of race are never as simple as black or white, there are many different aspects such as location, wealth, class, education and whether the individual is entirely black or mixed race. Not all individuals from the same race share the same experiences. BUT the negatives outweighed the positives for me. Parts of the book were interesting, but my overall lack of connection, paired with the unfocused exploration of so many different themes, made it a boring experience. Maybe this author just isn't for me.Blog | Facebook | Twitter | Instagram | Youtube | Store"}, {"userName": "karen", "userReviewDate": "Dec 26, 2016", "userURL": "http://www.goodreads.com/user/show/45618-karen", "userReview": "this is a three and a half star that i am unapologetically rounding up to four.is it zadie smith's best book?far from it.a great book is like an egg - it is round and firm and full of burning life-bits held in place by a narrative design both delicate and strong enough to sustain its beating heart.but this book, if you will permit the metaphor, is an egg slightly scrambled. the larger story is lost in the specificity of particular moments that never seem to adhere into a coherent narrative intent. fittingly, in an exchange between the narrator and another character:\"I don't know how you do it.\"\"Do what?\"\"Deal with the drops when you can see the ocean.\"this is a book preoccupied with the drops. and for me, that's not a dealbreaker, because zadie smith's writing is strong enough that i'm truly a reader captivated. when she describes a childhood friend as a fragile blonde…who had scars all up her arms and looked like a broken cat left out in the rain, even though that friend never makes an appearance outside of that sentence, i know that character perfectly. and the \"drops\" that feature here are huge: race, family, fame, wealth and poverty, responsibility, rivalry, motherhood, history, perception - these aren't small themes, and they aren't dealt with as small themes, but it's hard to look back after you've read the novel and understand what all the moments add up to.part of the difficulty is with the narrator. she isn't particularly likable so the reader isn't emotionally invested in her success, but she's not unlikable enough to feel delighted when she fails. in a book where race is such a focus, it's fitting that the biracial narrator comes across as tonally beige. she's not even given a name. but she is given many excellent lines, as in her observations upon visiting kunta kinteh island:All paths lead back there, my mother had always told me, but now that I was here, in this storied corner of the continent, I experienced it not as an exceptional place but as an example of a general rule. Power had preyed on weakness here: all kinds of power - local, racial, tribal, royal, national, global, economic - on all kinds of weaknesses, stopping at nothing, not even at the smallest girl child. But power does that everywhere. The world is saturated in blood. Every tribe has their blood-soaked legacy: here was mine. I waited for whatever cathartic feeling people hope to experience in such places, but I couldn't make myself believe the pain of my tribe was uniquely gathered here, in this place, the pain was too obviously everywhere, this just happened to be where they'd placed the monument.i mean, phoar. so, for me, even though i didn't get some grand takeaway from this novel, i enjoyed so much of the writing and the small developments that i can overlook its flaws. it's not a personal best for smith, but it's not even close to a dud."}, {"userName": "Diane S ☔", "userReviewDate": "Oct 07, 2016", "userURL": "http://www.goodreads.com/user/show/4159922-diane-s", "userReview": "My first Zadie Smith and perhaps not the best one to have started with. The prose itself was fine but the story left me cold. It started promising enough, our narrator and her friend Tracy, two brown girls dream about being dancers. Our narrator, however, has flat feet and little talent for dance, though she can sing. Tracy is the one with dance talent and her acceptance into a dance school with serve to start the separation of our two friends.Forward to the future, our narrator is an assistant to popular dancer/singer, maybe a Brittany Spears type of entertainer who wants to build a girl's school in West Africa. We go back and forth in time, the past, the present in Africa. I should have loved this part but I found the characters flat, our narrator little changed from her youth, and the pacing incredibly slow. It is hard to overcome the fact that a secondary character, Tracy is so much more interesting, that the parts that include her pulled me in, while the other characters just seem wooden.Cultural identity is explored, old movies, dance but not as much as the title of the book leads us to believe. I found myself skimming, never a good thing, and at the end there were finally a few noteworthy and redeemable events. I will try to read another of her books, as I said the prose itself was worthy, just wished for more interesting aspects in the plot itself. There are many four and five star reviews for this book, keep in mind, this is just my reaction to it and may not be yours.ARC from Netgalley."}, {"userName": "Violet wells", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/4196681-violet-wells", "userReview": "Some novels are brilliant all the way through and the ending is of no elevated consequence; with others the ending is all important and can either make it or kill it. This for me falls in the latter category. There was a point about half way through where I felt this was going out of focus. That Smith had assembled an exciting and topical panorama of material but that her storytelling wasn’t quite doing it justice. In short, not for the first time, I had the feeling that she’s a better writer than she is novelist. However the clarity with which the last fifty pages brought all her themes into focus changed my mind to some extent. The ending redeemed some of the mid-point meandering. No question Ferrante has had a big influence on Zadie. The template for this novel bears lots of similarities with the Elena and Lila saga. The two friends who grow up together; the more talented hampered by social deprivation; the less talented able to move away from the poverty of her background and reinvent herself. Except Smith’s two characters are downgraded versions of Ferrante’s. Tracey is raw talent rather than genius (and infinitely less compelling than Lila as a character) and her friend, the narrator (do we ever learn her name? I don’t think we do), piggybacks on the talent of others rather than ever develop any talent of her own. Also, like Ferrante, this is narrated in the first person.  As is usually the case with Zadie Smith the finest attributes of this novel all centre on her remarkable gift for identifying the changing nature of social and cultural guidelines. She investigates many topical themes – online trolling, celebrity charity, globetrotting, networking, national identity, the adult world becoming increasingly more adolescent. An interesting facet of this novel is perhaps the ascendency of ego in women to the detriment of men. The men in this novel are a hapless bunch. Usually depicted as completely out of their element and unable to make any inroads with regards to ambition or desire. Where it was less successful for me was the narrator herself. She is perhaps too neutral, too passive, too emotionally anaemic. She’s a modern day Nick Carraway – except Fitzgerald used the brilliantly self-effacing Nick to tell the bigger story of Gatsby while Smith’s narrator is way more egotistical and often puts the focus on herself rather than on the more compelling characters around her. This was especially the case in the African section of this book which for me was by far the least successful and where the focus went foggy. And, also like Fitzgerald but again less successfully, Smith keeps the character who supplies most of the novel’s plot a mystery. This is Aimee, a somewhat generic pop megastar for whom the narrator works as a personal assistant. Aimee has about the same GDP as the African country where she sets up a charity to help female school kids. That this ostensibly worthy gesture will degenerate into petty personal bickering is perhaps an emblem of the novel’s prevailing conflict – ego vs genuine nurturing care. Interestingly it’s only the novel’s minor characters who succeed in the latter and they’re all men. In Zadie’s world women have ceased to be nurturing. They are too busy pursuing professional ambition or drenched in bitterness for its demise (though the ending partially contradicts this thesis). The narrator herself is emotionally inarticulate throughout the novel but only realises it on the last page. It may, as some have said, be her best book. But I still don’t feel she has quite lived up to the enormous promise of White Teeth and am still waiting for the masterpiece I think she’s got it in her to write."}, {"userName": "Matthew", "userReviewDate": "Aug 02, 2017", "userURL": "http://www.goodreads.com/user/show/16254355-matthew", "userReview": "Nope . . . not for me . . .•\tDrags on . . . and on . . . and on . . .•\tDisjointed and confusing plot•\tOne-dimensional characters•\tRandomly preachy (and not in a way that made me think)•\tBizarre and gratuitous sex stuff (I don’t mind sex at all in books if it advances the plot or even if it is part of a cheesy romance and is there to titillate the reader. In this book, it is just weird)•\tNot very clearly delineated time jumps•\tEvents that don’t really make a lot of sense•\tLack of resolution•\tI wanted to DNF this about ten times. I usually never have a desire to DNF, even when I don’t like a book. So, that speaks volumes!I can see that some like this book, and that is great. But, for me, this will be my last Zadie Smith."}, {"userName": "Hannah Greendale", "userReviewDate": "Aug 14, 2017", "userURL": "http://www.goodreads.com/user/show/43377498-hannah-greendale", "userReview": "Click here to watch a video review of this book on my channel, From Beginning to Bookend."}, {"userName": "Emma", "userReviewDate": "Sep 08, 2016", "userURL": "http://www.goodreads.com/user/show/28602001-emma", "userReview": "Brilliantly written, this novel from Zadie Smith is a mishmash of modern culture and timeless themes. Ideas about female friendship, family, and identity are interwoven with music and dance from pop and musical to African and hip hop. What Smith gets very right in the book is the way relationships between characters are based upon their relative power; the way superstar Aimee is a vortex around which all other lives are determined; the power of language, what is said, or how and when speech is withheld; the removal of agency or belonging when all those around you are speaking another language, literal or metaphorical. Again and again, this leads to miscommunication, misunderstanding, or outright manipulation. Language and power is threaded into each person's identity and underlines their relative role to each other and within the book as a whole. The narrator may seem to hold the top spot, it is through her eyes that all others are visible, but she isn't even given a name. It's an imbalance that illuminates the overarching idea of the novel.At times the novel meanders too far from its core themes, though perhaps it was a reflection of the main character getting lost in her life as much as the story being lost in itself. Overall I think my main issue was that she never seemed to learn anything, still as much a naive and somewhat self absorbed child at the end of the book as at the beginning, despite the passing time and enough life events that she should have changed something in herself. This is not a criticism of Smith, this nameless girl acts perfectly within the scope of her character, I just wished more for her. Like her mother, I felt that if she'd just.... My hopes for a character and their life story has, obviously, no effect on the actuality of the story, yet it didn't stop me from feeling disappointed by the end. If anything, it's this that likens the novel to real life, this feeling of wanting something better for a friend or acquaintance is something we all recognise. And how often does that bear fruit? Still, it shows how invested I was in a unnamed girl I didn't even really like.I chose to read this ARC from Netgalley. All opinions are my own."}, {"userName": "Hannah", "userReviewDate": "Jan 28, 2017", "userURL": "http://www.goodreads.com/user/show/41788446-hannah", "userReview": "I am conflicted: while the language is impressive and there were plenty of parts that I truly enjoyed immensely, the overall reading experience was uneven and a bit of a dissappointment for me. I was super pleased to receive an arc of this book as Zadie Smith is one of those authors whose work I have intended to get to at some point, sooner rather than later. Now I am not so sure anymore if this was the best way to start reading her.\"Swing Time\" is a story told from the perspective of an unnamed mixed-race woman, both of her younger years and her intense friendship with Tracey, another of the mixed-race girls living at the estate she's growing up at and of her being in her mid-30s and working for a ficticious international pop-star with philanthropic plans of building a girls' school in West Africa. Threading through both timelines is her love for dance and her inability to find a place in the world (or even herself). As other reviewers have already noted, the parts with Aimee, the pop star, and the visits to Africa are by far not as interesting as her life before - and especially Tracey's life. My main problem with the book was the main character. Even after spending more than 400 pages in her head, I am still not sure who she is and what she is like; however, this flatness of character might very well be intentional. The protagonist only ever defines herself in relation to other people: to Aimee, to her mother, and most of all to Tracey - that other girl so similar to her and still so different, with a trajectory so contrary to her own that there might not be a way for them to connect again. Nevertheless, that flatness bothered me and her naivety did not endear her to me - it rather proved how much her world revolved around herself and it made her a difficult protagonist to empathize with. But at the same time, some of the secondary characters were fully fleshed out, flawed people that I would have loved to spend more time with. I enjoyed Tracey as a character and would have loved for her to be at the centre of the book (especially because the description made it sound like she would be). I loved the interactions the protagonist has with her mother; even though she is aggrevating as well their relationship felt real. It is in those scenes that Zadie Smith's tremendous talent shines and those are the reason why I am still overall glad to have read this book. ___I received an arc curtesy of NetGalley and Penguin Books UK in exchange for an honest review. Thanks for that!"}, {"userName": "Trish", "userReviewDate": "Dec 08, 2016", "userURL": "http://www.goodreads.com/user/show/1826682-trish", "userReview": "Wow. This huge, powerful novel is so minutely observed that readers can be forgiven for occasionally missing the forest for the trees. Sex, race, and class are backdrop here, setting and makeup for half-a-life of self-abnegation performed on a world stage. Dichotomies between first world/third world value sets, the insular self-preserving life of huge celebrities, the influence of money on impulses of every kind, the debts we owe another, how generosity manifests, who “family” really is— these life-critical issues are part of Zadie Smith’s latest novel. It bowled me over. The story begins with two young girls, both fascinated with musical theatre and dance, as closely entwined as stems from the same seed, growing apart as they grew up together, the result of outsized talent and personality on one side, and a confusion of identities and timidity on the other. One takes a job dancing on stage, the other handmaiden to a dancer on a bigger stage. The confusion of identities is not challenged for years, during which time the handmaiden begins to observe cracks in the world she sought to manage.She is nameless, the narrator. By dint of parental steering, she finished university and managed to find her way into managing logistics for a superstar, a singer/dancer. Descriptions of her work grow less enthralled as she ages out of the job ten years on, after discovering along the way that she may have been hired or kept on because she was a “woman of color” and filled a slot rather than for any perceived talent. In fact, the one time she does display an actual talent—for singing—her boss threatened to fire her. Looking at a changed world without the prism supplied by the superstar, she realizes there is little she can take away from that time. The lessons she learned may not be ones she wants to keep, and she is not sure if she knows how to speak to a person dying, or how to be friends, or how to care, or how to make people around her feel benefit from her success. Smith raises many issues in this novel but doesn’t solve many of them for us. The thing she does do so beautifully is poke a mixed London heritage and point to those little moments we recognize: anguish over unequal opportunity disguised as childish jealousy (Tracey); admiration for someone's ability to draw people into their orbit with generosity and joy (Hiwot in West Africa, her mother in London); how to be just who you are without designators like age or race or education or accomplishments (her father, James & Darryl in NYC). The narrator is a shadow yet, in the beginning and at end of the novel, by her own admission, and not grown into her own persona. But we are there the moments she begins to see, to recognize who she is, what she believes, and what she has missed. \n“Now everyone knows who you really are.”\n We do, and we feel so many other things as well. She is vulnerable, but suddenly able to see, hear, think, feel. She is in danger, but instead of being frightened, she feels a tingle…that’s blood rushing. Why does it take so long for humans to develop their sense? She is on her way, and she’ll do fine. The last thing her mother says to her is that she would make a good mother. And she would. But so will many others, even those who look incapable of it. Even Tracey. Even Aimee. Even her. She did learn something about love after all. \n“The future is the same as the past.” \n What did Lamman mean when he said this to Fern? Perhaps he meant our future is in our past, or the future is created from the past or the past determines the future.I listened to this novel, published by Penguin Random House Audio and read by Pippa Bennett-Warner. Bennett-Warner was amazing. She made a plethora of accents perfectly distinguishable, at least five London accents alone, two Australian, Jamaican, West African, along with NYC and generic American, male and female. That’s pretty grand, no matter how you cut it. I took my time over this, did not mark my place as I listened, so often listened twice to any section to catch up to my last heard scene. I was never bored. Smith packed so much seeing in each scene, I was thinking the entire time. Impressive in every way, and tons to talk about if readers choose this for a reading group. Which I recommend."}, {"userName": "paulie", "userReviewDate": "Jan 21, 2018", "userURL": "http://www.goodreads.com/user/show/62509034-paulie", "userReview": "4.123 stars\na story that reads longer than its 453 pages, yet leaves desire for a few more details to\n a couple of angles, this is swing time. a story spanning multiple decades and countries, leapfrogging back and forth without warning, such is swing time. a mixed race londoner female narrator [name withheld], a desire to dance, a desire for acceptance, whether it's with her complicated cum somewhat distant mother, her friend/\"friend\", tracey (who naturally excels at dancing), or people she encounters during her ten yr stint as assistant to australian mega pop star, aimee - swing time is fred astaire to the reader's ginger rogers, leading you through a ballroom of a girl/womanhood full of dreams, unexpected realities, questions of truth, self, and intentions. two particularly strong chapters were part four (middle passage) chapter three, where our narrator is in west africa learning how the village views her as a posh individual incapable of doing anything requiring labour or of a lower status, and part five (night and day) chapter three, a conversation between she and fernando, project manager for a girls' school being planned for the village. these chapters, in particular, not only give us an intimate look into how she sees herself as a person, but how others see her as well."}, {"userName": "Hugh", "userReviewDate": "Sep 08, 2016", "userURL": "http://www.goodreads.com/user/show/32318315-hugh", "userReview": "Zadie Smith can be brilliant and frustrating in equal parts. This book certainly doesn't lack ambition, it is always readable and entertaining and parts of it are excellent, but once again I was left feeling this is not the great work that such a talented writer should be capable of, and for me none of her subsequent novels have matched her debut White Teeth.To start with the positives - I really enjoyed the first part in which the unnamed narrator describes her childhood friendship with Tracey. They meet in a dance class and share a love of old musicals, Tracey is the more talented dancer but without the narrator she lacks direction and struggles to escape her broken family and her largely absent criminal father. The narrator has a caring but ineffectual white father and an ambitious self-taught mother who becomes a politician. Tracey achieves some success as a dancer but fails to make a long term career of it in the face of impossible odds.For me the problems concern the character Aimee, a megastar singer and dancer who is Australian but shares many of the attributes, the career trajectory, lifestyle and aspirations of Madonna. The narrator works for her and is exploited to the point of having no life of her own, and is involved in a vanity project to build a school in West Africa (in a country which is not named but can only be Gambia). For me it is impossible to create such a character and make her completely separate from the real figures who embody the characteristics she does. Smith has a lot to say about exploitation, black history and the realities of working in Africa, and these ideas are almost sufficient to compensate for the weaknesses. There are some fascinating asides about the careers of some of the black dancers (Jeni LeGon, Bojangles and others) who played bit parts in classic song and dance movies, and how they were exploited.For all its faults this is an accomplished work, more fully realised that some of Smith's previous novels, and I can see why it made the Booker longlist, but there are too many stronger books on the list for me to see it as likely shortlist material, let alone as a potential winner."}, {"userName": "Maxwell", "userReviewDate": "Nov 06, 2016", "userURL": "http://www.goodreads.com/user/show/1381728-maxwell", "userReview": "This was my 3rd attempt at a Zadie Smith book, and my 2nd time finishing one. I've come to the conclusion that I might just not be intelligent enough for her books.This has that quality you see when you look at fine art and think, \"I understand it's special and important, but I just don't fully understand it.\" And that's fine. I can read a story like this—one with really natural writing with characters that are well developed, but maybe with a plot that just loses you and themes that are obviously there and getting at something that you don't quite comprehend—and just not 'get it.' At least, I'm okay with that because Smith is a really good writer; I can see that. But her stories just don't do it for me.I've heard good things about  On Beauty and  White Teeth, so I might give one of those a try sometime."}, {"userName": "Seemita", "userReviewDate": "Dec 07, 2016", "userURL": "http://www.goodreads.com/user/show/34622220-seemita", "userReview": "[Originally appeared here: http://timesofindia.indiatimes.com/li...]There is something about every life: ripe with memories, rife with punctures, crowded yet distinct, deceptively omniscient but a puzzle to its only custodian. Zadie Smith’s narrator in ‘Swing Time’ attempts to hold this fleeting, substantial thing in her hand and poke it for its secrets over a good 35-40 years.This is a story primarily about a brown girl in London, whose life arcs diverse places, people and emotions, keeping, somehow, another brown girl, Tracey, at its epicentre. Narrated in first person, she opens her rendezvous with Tracey at the tender age of seven, when all that mattered to the duo was dance, at which, Tracey was much better. This unequal ledge of talent, sets precedent to the rest of the story and throughout her life, our narrator registers experiences, always a tad less vibrant than she had hoped would come by.Right from abandoning her ambitious mother and genial father and gravitating towards Tracey in her teens, to landing a job at a music channel by severing ties with the very same girl, from rapturously following a teenage pop sensation, serving her fashionable cause of educating children in a remote West African village, to returning, in her mature years, to her own mother and Tracey’s children, our narrator lives a life oscillating at the hems of reward and agony. And this undulation is captured with a sharp lens, at times and a shaky hand, at other.A prominent thread that one might notice in this expansive narrative, is the non-linear time line. The narrator keeps swinging between today and yesterday, and day after tomorrow and day before yesterday. The casualty in such arrangements is usually empathy, which is suspended much before its formation due to the breckneck pace of its beholders. But Smith’s skill lies in her smart writing, which bridges the gaps to some extent. Her seamless fusion of cultural elements belies the sharp sting of race fallout: the friendships and relationships she depicts are not devoid of the disjoint perspectives that emerge from exercising different racial hegemonies. There is a certain tenderness in her narrator’s call, almost like an impervious actor defeated from inside. But the overdose of details robs a considerable sheen off the reading pleasure. Some portions, especially in the middle, are tediously drawn, where the elements appear doing nothing else but fill the pages. Perhaps, the superfluity did what the overlapping timelines did not – overshadow the narrator.Despite all, ‘Swing Time’ is a good outing; one that brings some vital air, if not a piece of fresh memory to take back home.[Note: Thanks to Netgalley and Penguin Books (UK) for providing me an ARC.]"}, {"userName": "da AL", "userReviewDate": "Mar 27, 2018", "userURL": "http://www.goodreads.com/user/show/50966750-da-al", "userReview": "The accolades garnered by Smith made me excited to read this. Without revealing the story, those stellar notices made me press on despite how the first quarter of it is hard to warm to.Toward the middle of it, the story became more compelling. My hope that this would be an all-time fave soared. Here was brilliant writing studded with genius perception! The author, I marveled, takes no prisoners! Everyone/everything/everywhere gets stripped naked of sentimentality and tossed into the fire of truth!Wait -- the annoying Australian Madonna-ish character was barely singed, and the U.S. way she was rendered made me wonder whether the author believes that North Americans are superior to people from other countries. Worse, the one Persian character was a bigoted buffoon.The book is entirely first-person. By the last third, the protagonist wore on me worse than she had at the start -- her passivity, her self-serving emotions, and opinions, her perpetual cynicism, her lack of empathy for those working toward their dreams, her lack of feeling even for those who treated her lovingly.There seemed to be an overriding theme, but by the end, I could only guess at it. Was it that ‘life sucks and then you die’ or that some people really really need anti-depressants or that pursuit of goodness is a waste of time or that neither can we control our destinies nor can anyone help us?Four stars for enough educational and excellent writing to make me grateful that I read this, yet there was potential for much more."}, {"userName": "Snotchocheez", "userReviewDate": "Dec 16, 2016", "userURL": "http://www.goodreads.com/user/show/1899836-snotchocheez", "userReview": "3.5 starsI'm trebly daunted to write a coherent review of Zadie Smith's  Swing Time. A) It's hard to be objective when I've got a serious crush on Ms. Smith's writing style (only a select handful of authors can make me swoon just by their effortless sentence construction, and she's one of them). B.) Novels with racial dynamics at their core (particularly those written from a black perspective about the white world around them) certainly pique my interest, but my inability to put myself completely in a black person's shoes (be it a mixed-race 'estate'-girl from London like  Swing Time, a Nigerian woman émigré to the US in Americanah, or a girl grappling with Deep South prejudice, poverty, and Hurricane Katrina in Salvage the Bones) makes me a terrible arbiter of such works. And C.) My GR friend Jenna has already written an amazing 3-star review of this book (which I'd love to link you to, but HTML utterly confounds me) that really captures the essence of the book, and its faults) way better than I ever could.  Swing Time is pretty wonderful when Ms. Smith sticks with her two principal protagonists: Two mixed race young girls in the '80s living in the \"estates\" (Brit-speak, I think, for lower class tenement buildings) in London, both with aspirations to be famous dancers. Tracey, with a boorish white mom and absentee black dad (and supposed Michael Jackson touring dancer), is the natural talent of the two friends; and the unnamed narrator, with a Nefertiti-looking civic-minded black mom, a milquetoast white dad, a love for old musicals (particularly those with Fred Astaire), and, thanks to flat feet, very little talent. Ms. Smith is all about dichotomies of duality here: Whites vs. Blacks, Haves vs. Have-nots, Americans vs. British, Celebrity vs. Anonymity, Tracey vs. Ms. Narrator. As long as Ms. Smith stays within her bailiwicks of London and class and race awareness, the novel soars.As the friendship drifts apart and the girls zoom through adolescence toward their adult lives, though, when Ms. Smith introduces an internationally famous pop singer named Aimee to the mix (who the narrator lands a job with as a personal assistant), the novel starts to sputter. Though still quite readable, these parts of the novel (particularly when an enlightened Angelina Jolie-esque celebrity like Aimee decides out of nowhere to establish a girls school in the wretchedly impoverished Gambia, West Africa) that things start feeling flimsy and contrived, throwing the book out of kilter. (It doesn't help matters that the narrative bounces back and forth in time, triangulating from London, New York and Africa; the differences in the quality of the narrative are glaring with each chapter bounce back and forth: London sections vibrant, Africa sections meh) A salacious ending (actually two endings, hinted at from the beginning) between both Ms Narrator and Aimee and Ms.Narrator and Tracey  both kinda fizzle. The central dancing theme got somewhat lost in the drama.Still, I liked parts of this enough to be glad that I read it; I just wish it could've evoked in me a Snoopy \"happy dance\" rather than the Michael Jackson's  Thriller Zombie Shuffle-feeling I'm left with instead."}, {"userName": "Jessica Woodbury", "userReviewDate": "Oct 05, 2016", "userURL": "http://www.goodreads.com/user/show/4271946-jessica-woodbury", "userReview": "It is hard when you really love an author and their book just doesn't really work for you. Especially when the premise of examining female friendship was so promising.I am not sure what exactly didn't work, the early chapters went well, though the structure jumping around held me back from connecting strongly with the characters early on. The second major story arc comes late and never really worked for me at all. The \"Aimee\" chapters lack the loveliness of the \"Tracey\" chapters, which may well be purposeful, but as a reader it made for a disconnected experience. Just when things start getting interesting in the Tracey story, we leave it and never return to it in a satisfying way.One thing I did note is that this novel suffers from the same kind of problem that most novels have when their narrator is less interesting than the other main characters. The narrator's lack of self can't expand to fill the story. This type of novel is often hard for me to really enjoy, especially with a first person narration. It's also noteworthy that I rarely see a book about a very famous or charismatic fictional person that really helps you feel that person's pull or magnetism. The \"Aimee\" chapters in particular suffer from this, the \"Tracey\" chapters early on are much more successful. (The only book I can think of that I like that fills either criteria is A Prayer for Owen Meany, which devotes the entire book to making its main character very very interesting and helping the narrator become something bigger than he was at the beginning.)It's painful to not enthusiastically love a new book from one of your favorite writers. Sigh."}, {"userName": "Ron Charles", "userReviewDate": "Nov 09, 2016", "userURL": "http://www.goodreads.com/user/show/1384944-ron-charles", "userReview": "Madonna? Beyoncé? Angelina Jolie?Which pop star inspired Zadie Smith to create the celebrity who bends the universe to her will in “Swing Time”?But that’s hardly the most interesting question raised by this thoughtful new novel, which moves across the years and oceans — from London and New York to West Africa. This is a story at once intimate and global, as much about childhood friendship as international aid, as fascinated by the fate of an unemployed single mother as it is by the omnipotence of a world-class singer.Smith, who rocked the literary establishment while still in college with a partial manuscript for “White Teeth,” opens her fifth novel to the toe-tapping tunes of Fred Astaire’s 1936 musical comedy “Swing Time.” But a darker bass line thrums beneath that happy melody. In the prologue, the narrator, a young woman recently fired from her job, seeks solace by Googling an old video clip of Astaire performing “Bojangles of Harlem” — and quickly discovers that. . . .To read the rest of this review, go to The Washington Post:https://www.washingtonpost.com/entert..."}, {"userName": "Jenna", "userReviewDate": "Nov 30, 2016", "userURL": "http://www.goodreads.com/user/show/38727943-jenna", "userReview": "Oh, man. What a letdown. Awarding a Zadie book a lackluster rating elicits a very uncomfortable and unfamiliar feeling from me, sort of like going to the polls and finding you've just accidentally cast your vote for the opposite candidate than intended. (Not that I expect any voting or poll-related similes to have any great resonance in fall 2016 USA.... Also, that was just metaphorical speaking; you can bet I triple-checked my vote for accuracy before submitting it this month!...which already feels a year long...but I digress.)I'm disappointed with myself for not loving this book given my general love for Zadie Smith and her other works. NW is one of my favorite novels of all time, and one that captured better than anything I've read my own specific experience in growing up navigating the \"blocks\" of poor/working class community housing. It's such an amazing book in my view that I can't even bring myself to describe my appreciation: it left me feeling that I wasn't fucking worthy of even attempting to articulate her brilliance. Maybe on my deathbed I'll try to review it, was my ultimate conclusion, when I can hopefully channel the spirit of Virginia Woolf to express my admiration, which is the level of support I feel I'd need. Unfortunately - the books that fall flat are always a little easier to talk about....I'd rather be disappointed with myself than with anything Zadie-related, but after reading a bunch of GR reviews, I had to admit that I'm among many readers who found this book disappointing for reasons they were able to cogently identify (and with which I fully agree). (Of course, there are eloquent proponents of the book as well; would that I were among you, my people from whom I've apparently self-exiled!) Since there are already so many other strong reviews that capture what this book tries to do and how it falls flat, I'll limit myself here to itemizing my top five gripes rather than launching into a full-on takedown. Perhaps this will also alleviate my guilt at betraying Zadie.1. When word spread that Zadie had a new book coming, there was much rejoicing - and then an additional wave of rejoicing that this book would be about dancing. Through GR, I know I'm among many readers who love a good dance-related book; perhaps we are all still mourning the premature demise of Bunheads (anyone?). But, for a book in which dance supposedly functions as a central metaphor, Swing Time seems frightfully deficient in notable literary or philosophical writing about dancing. This is an especially egregious error in that Zadie Smith is certainly capable of doing the most elegant, affecting, poetic, and deft things with language. And wow, it seems like a passionate and visceral subject such as The Dance would have been an amazing target for her dazzling linguistics and insights! Sure, there's dancing going on IN the book: it's a recurring plot device in both the \"Tracey/London\" and \"Aimee/Africa\" sections, and as indicated by the book's title, the narrator references significant moments in the history of dance and their racial and cultural implications. But this is all as dispassionate and dry as the term paper it sounds like. There are no passionate descriptions, or even especially descriptive descriptions, of actual dance. There is much talk of the importance of dance and the love of dance, but absolutely no showing of it. A YA potboiler about vampire ballerinas would probably contain more fascinating writing about actual dance. The power of dance as conveyed through this book would be comparable to reading Billie Holiday's biography - a sad story, to be sure - but without ever actually hearing her songs or voice to bring that story to life.2. You know how everyone is annoyed by Nick Carraway, especially when played in a film by Tobey McGuire, since in my experience everyone also seems annoyed by Tobey McGuire?...no, just me and the folks I know? Anyway, my point is that a passively observant (but not especially insightful or perceptive), shallowly characterized and non-evolving cipher of a narrator can be hard to love, and in Swing Time we have an excellent specimen. The narrator is unnamed, leading myself and others to consider the possibility that this character is \"meant to be this (bland) way\" in service of some grander big picture literary project. Maybe, but if you have to consider granting a special concession to the author on this kind of basis, then that literary project just didn't work.3. Oh, and even if you don't mind the narrator, never fear: there are many other under- or un-developed characters to choose from. Specifically, most of the characters in Africa, Aimee and her entourage, and quite honestly, even Tracey (especially post-childhood). With most of these characters, I didn't get a solid sense of how they talked, looked, or behaved, what they believed, or what motivated their actions, which often seemed incongruous and came out of nowhere. In some of Zadie's other books, we get vivid stream-of-consciousness internal monologues from a diversity of characters, which worked a hell of a lot better for me than having everything filtered through the limited no-name-ator of this book. As others have observed, the narrator's mother is by far the most developed, multi-dimensional, interesting character, and I enjoyed parts of this book as a kind of novella about her. 4. The character of Aimee warrants a special critique. If, of all possible jobs that exist, you decide as an author to make your narrator/protagonist the personal assistant of a huge international pop star, then I feel like you have a responsibility to do more with the international pop star character than merely use her as a plot mechanism to send the narrator on periodic visits to Africa. Surely there are other ways to accomplish this, or even to incorporate the themes the Africa sections attempt to address. Aimee appears in only a few short scenes in the book, and her instant transformation into a clueless would-be humanitarian isn't discussed or described but rather a thing we are simply meant to understand and accept - again, lots of telling with no showing. Aimee is so shallowly characterized that getting any idea of what she is like relies on the reader's own ability to collage together attributes of various known celebrities (something I wasn't really able to do because I just don't give a shit about them). I know Zadie Smith is a hardworking author, so I was confused because this technique just seems super lazy and pointless. Also, I was resentful that I was forced to try to conjure up thoughts of people like Angelina Jolie when a big reason I read in the first place is to try to get away from pervasive celebrity culture that I don't give a crap about.5. There are authors people read for plot, and Zadie Smith isn't one of them and doesn't need to be. So I was dismayed at how this book ultimately resorts to cumbersome plot devices, which toward the conclusion especially become dramatic and contrived. Without giving spoilers (and btw: having to worry about spoilers in a Zadie Smith book? Damn, that's cray-cray!), more stuff happens in the final chunk of pages than in large preceding swaths of the book. Even the whole shuttling back and forth in alternate chapters between London and Africa, past and present, and trying to tie together various loose ends, all feels belabored and forced. Like many readers, I came to dread the non-London chapters because their execution seemed so inferior in comparison.What makes me saddest overall is that I really liked this book in its earliest pages, where Zadie uses her characteristic portrayal of diverse working-class London girlhood to begin exploring the themes and big ideas with which this book is concerned. I honestly think she could have continued on in this vein and wound up with a more effective and powerful book in the tradition of NW and White Teeth. I respect the author's right to embark on a new kind of project, but unfortunately, this book, and the reading of it, felt exactly like a project in the end."}, {"userName": "Barry Pierce", "userReviewDate": "Aug 01, 2017", "userURL": "http://www.goodreads.com/user/show/4593541-barry-pierce", "userReview": "'Swing! Dig the rhythm! Swing! Dig the message!' - 'Swing' from Bernstein's Wonderful TownPossibly Zadie Smith's most divisive novel to date, Swing Time is a tale of two brown girls, both dancers, dreaming of being the Ginger to someone's Fred. Both girls, Tracey and our unnamed narrator, grow up on the estates of North London (or, as Smith herself puts it, a North London of the mind). Our narrator lives with her black activist mother, she is something of a mix between Assata Shakur and Diane Abbott, whilst Tracey lives with her white Croydon facelift'd mother who seems to be a somewhat more mature Vicky Pollard. As with most Smith novels, class divides all. The novel follows the two girls and our narrator's eventual career in the media as an assistant to Madonna standee, Aimee.It's a road well-worn. A novel about two girls from different class backgrounds magically kindling a friendship. Just off the top of my head I can recall numerous other authors who've written books on the exact same subject; Maeve Binchy, Edna O'Brien, Toni Morrison, Elena Ferrante. However, with Smith, it didn't feel like I've been here before. The sections of the novel dealing with our narrator's relationship with Tracey are by far its saving grace. Never a chore to read (unlike other sections) everything is so naturalistic between them and Smith writes this relationship with such intimate detail that at times one forgets that this novel is fiction. The girls' love of the golden age of musicals obviously aided in my adoration of these sections, with numerous references to Gypsy, Show Boat, and Guys and Dolls, I felt right at home laughing at every joke and understanding every reference.However, this novel is not without flaws. The largest flaws for me were the West Africa sections. In the novel, the superstar Aimee (to whom our narrator is a PA) funds the building of a school in a West African nation and thus our narrator must make numerous trips there to make sure that everything is going smoothly. Whilst these sections did serve as foils for our narrator's naivety, they are also the sections in which a whole lot of nothing happens. Often slid in between sections detailing the narrator's friendship with Tracey, these sections eventually became utterly labourious. I must admit at times skimming a couple of these sections in order to get back to Tracey and her life. Another flaw of the novel is its sheer scale. There is absolutely no reason for this book to be the behemoth it is. Honestly, you want to save the trees? I've a solution. Hire better editors. This novel could have been cleaned up a lot more and could've lost maybe 150 pages. If Orwell managed to do Animal Farm in 95 pages then you have no excuse Zadie. This novel had an interesting time with the press. The Guardian called it 'her finest novel' whilst The Irish Times said it is 'lacking a consistent narrative drive, an interesting voice or a compelling point of view'. I think I fall somewhere in the middle of these reviews. Is it Smith's best? God no. Is it a good starting point with Smith? Dear god no. Swing Time is a minor novel in Smith's oeuvre. I'm starting to feel we'll never reach the heights of White Teeth ever again. I would align this novel more with The Autograph Man, another Smith novel which had a hard time with the public but which I found to be throughly enjoyable. And just like The Autograph Man, I think Swing Time is more a Smith novel for Smith fans. A notch on the bedpost for completionists. Because for every Middlemarch, there has to be a Silas Marner."}, {"userName": "Sam", "userReviewDate": "Nov 03, 2016", "userURL": "http://www.goodreads.com/user/show/59357213-sam", "userReview": "\"I saw all my years at once, but they were not piled up on each other, experience after experience, building into something of substance - the opposite. A truth was being revealed to me: that I had always tried to attach myself to the light of other people, that I never had any light of my own. I experienced myself as a kind of shadow.\"\nThis quote from Zadie Smith's Swing Time is very early in the novel, and for me calls out the difficult choices and construction that led me to give the work a 3.5 star review, with a round down to 3 stars. Her prose is excellent, some of her characters very compelling, and she finds creative ways to explore differences and nuances and make observations on race, class, education, and worldview, with her cast of characters interacting and colliding, speaking and not speaking to reveal these ideas and truths. But our guide to this world and this story, the narrator, is very flat, boring, and from child to adult is more or less the same, experiencing little personal growth. And the jumping around through time, instead of following in a linear fashion the narrator's experience, seems like a construction for its own sake but it hinders rather than helps the narrative.Let's start with what works: the writing itself is beautiful. Mostly soft, slow, calming prose, but with deft observations and little twists of phrase to keep you going. Her grasp of the power complexities of relationships is great, and she shows us the various ways these power imbalances express themselves in many of the key relationships between the characters: narrator/Tracey, Aimee/everyone, narrator/mother, narrator mother/narrator father, and the list goes on. The narrator's mother and Tracey in particular are very well drawn, compelling, forces of nature that captivate and hold the narrator's attention (and ours). And the representation of race and class and education level across the board is extremely varied and presented with some sharp, smart ideas, revealed by the narrator and other characters mainly via their interactions rather than direct quotes. Smith is clearly a talented writer.And now what didn't work as well for me: the narrator. That first quote really encapsulates my issues with her, she is far less compelling and memorable than many of the other characters she interacts with, and her journey from childhood to adulthood, with all the trials and tribulations she and family and friends endure, doesn't result in any real character growth or awareness or anything. She's a shadow, a cipher, with flashes of real feeling and personality but too often a cardboard cutout to observe into other characters' lives. And maybe that was Smith's point in making her the narrator, but it can lead to a somewhat stifled, irritating read.The other main issue was the time jumping, and divide of experiences between childhood/focus on Tracey and adulthood/focus on Aimee. Tracey and Aimee are the two bodies the narrator orbits around, with characters like her formidable mother bridging the gap. With Tracey, we get school and much of the dance and early family dynamics; with Aimee it's adult relationship turmoil and celebrity culture and white (and mixed) do-gooders in Africa; for both Smith's commentary on race and class follow. The main problem is that the Tracey parts are far more interesting than the Aimee parts on the whole. Tracey herself is magnetic: spoiled, broken, talented, cruel, petty... just as the narrator can't look away from Tracey when she is on stage dancing, it's hard to tear away from Tracey when she's present on the page. And the accompanying observations and distinctions made, between Tracey's mother and narrator's mother, the role of fathers (one white, one black), the class and education intersections, are light, smart, fascinating. By contrast, some of the Aimee parts are plain boring. There's interesting commentary and observations, sure, when they are setting up the school. But you're never as in tune with the personalities and interactions of Hawa, Aimee, Fern, and Lamin as you are with the narrator's family and Tracey's family. And some of the observations lack as subtle a touch when it comes to undermining perceived know-better and privilege. And so, find myself interested in/caring for half the characters, and somewhat bored by the narrator, it could make some chapters feel very slow and I got bogged down more easily than I thought I would, though others would fly by.I suppose I went into this book expecting more, and was mildly disappointed. It's my first Zadie Smith novel, and I will pick up others down the line since I did like her writing and it's entirely possible another story will call to me. But for me, the best books, the ones I give 4 and 5 stars to, they move the head and the heart, resonate intellectually and emotionally. Swing Time had plenty that worked in terms of the former, but completely missed for me in terms of the latter."}, {"userName": "James", "userReviewDate": "Jan 26, 2017", "userURL": "http://www.goodreads.com/user/show/41609617-james", "userReview": "This is a great novel and I think one of the strongest (if not the strongest) of Zadie Smith’s already impressive body of work.The story works on many levels and takes in multifarious themes, which although are generally familiar territory for Zadie Smith, are approached in what feels like a very focussed, new and intelligent way.There is so much in this novel, it is difficult to know where to start, challenging to encapsulate – but in an attempt to try and convey… This is a story of friendship, family, betrayal, ambition, life and death, race and racial politics, power, class and gender; but it is much more than that – questions are suggested concerning – what is success, what is privilege – what is it and what does it actually mean to any of us? The story moves from North London, to the USA to Africa and raises questions about belonging….not just geographical or racial belonging, but family belonging, friendship and community belonging…The story tracks through the 1980’s and 90’s and whilst very evocative (particularly of London) successfully avoids the usual clichés of lazy nostalgia. Concerning the power of celebrity, think Madonna, Shakira, Angelina Jolie, Oprah Winfrey et al. But this is no polemic or diatribe – instead as with all great books, questions are raised, thoughts are provoked and judgements are not made.You very much feel as though you have been on a journey – I think that’s possibly the best way to describe this novel. It’s a very satisfying, compelling, thought provoking, challenging, emotionally engaging and memorable journey – of great reality, humanity, meaning and authenticity."}, {"userName": "Julie", "userReviewDate": "Mar 16, 2017", "userURL": "http://www.goodreads.com/user/show/5210022-julie", "userReview": "Swing Time by Zadie Smith is a 2016 Hamish Hamilton publication. I picked this book out while reading through some of 2016’s award nominees, eager to read outside my comfort zone for a while.  The story begins with the childhood friendship between two ‘brown girls’ who forge a strong bond, despite their difference in upbringing and approach to life. Tracey is a talented dancer, while her unnamed friend dances to the beat of a different drummer, so to speak. As we follow the paths these two embark on in life, the friendship that once cemented them together, begins to crack. Still, no matter what transpires for each of them, that bond seems indestructible and impossible to ignore completely. This book is truly multi-layered. Tracey has a goal, a purpose, despite her troubled home life. But, her undisciplined childhood promotes unflattering behaviors in her. Our narrator, may not possess the natural talent of her friend, but her life is grounded by a father who loves her and a strong mother who works hard to achieve her own goals, set an example for her daughter, and hopefully provide her with a better life in the process. The story is filled with lush locations, introduces us to different cultures, and even has musical soundtrack. The writing, of course, is exceptional, and characterizations vivid and alive. The women featured are so exotic, each with a distinct and profound sense of themselves, except perhaps for our narrator who is still on that path of self -discovery. The pop star the narrator works for might conjure up an image or two of real life divas, the mother is a character who leaves a strong and forceful impression on her daughter, and there is no question that Tracey’s friendship has had an impact. Hawa is a unique character, as well. A woman who embraces her life despite the cultural judgements our sensibilities might balk at. All these women make an impression on the narrator in some way and will help her chose her path. I hope I’ve taken from the book what the author was attempting to express, but for some reason, I find it difficult to articulate what that might be.  I think our storyteller was so focused on leaving her old neighborhood behind, once she manages to do that, she seems to struggle with her selfhood. She attempts to wear several hats, but they don’t always seem to fit. “I saw all my years at once, but they were not piled up on each other, experience after experience, building into something of substance—the opposite. A truth was being revealed to me: that I had always tried to attach myself to the light of other people, that I had never had any light of my own. I experienced myself as a kind of shadow.”Ultimately, I think our narrator will find her calling, her niche, will embrace her heritage, her roots, and make peace with who she is deep down and maybe even find a common ground with her old childhood friend, in the old neighborhood where they first danced. Overall, this is a well written story, which I think is open to various interpretations. It’s a serious character analysis, it’s about personal convictions, friendship, race, and individuality. This is my first novel by this author, and I’m impressed enough, I want to have a look at her previous releases and will look forward enjoying her future efforts. 4 stars"}, {"userName": "Monica ", "userReviewDate": "Jan 31, 2017", "userURL": "http://www.goodreads.com/user/show/4739465-monica", "userReview": "[The story is of two young girls both bi-racial and both lower middle class (Tracey and the narrator). Even the form of bi-racial existence seems to have meaning. Tracey has a white mother while the narrator has a white father. There seems to be an implicit assertion of stability here. Not sure of the intent. Smith seems to imply that the blackness introduces some instability restlessness into the home. In Tracey's life her mother is ever present and her father is unreliable and mercurial sometimes violent. Because of his inconsistency he is also exotic and exciting to Tracey. Tracey's mother is uneducated and unambitious. As a single parent, she is overwhelmed with trying to build a life for her daughter. She is supportive of her daughter by cultivating her dancing abilities which she believes is hereditary. In contrast the narrator's mother is Jamaican. Coming from humble beginnings, she is restless and driven towards a better life. She believes that is through education and spends the novel bettering herself and ensuring that her daughter has the similar opportunities. The narrator's father in contrast is present, steady, dependable, patient and supportive. He like Tracey's mother, seems to be irresistibly attracted to the exoticism and restlessness of the \"other\". Both embracing a fantasy to the detriment of their own lives. As the girls grow, they start to diverge and the differences and impacts of their upbringing becomes more apparent.The middle deals with the narrator experiences with Aimee (a popstar ala Madonna. The narrator becomes one of her personal assistants) with periodic flashbacks to childhood to highlight the narrators perspective. What struck me about the Aimee portions of the book was the shift in messaging. The point of view of the narrator becomes an avatar for first world order; the embodiment of how Great Britain (and the USA) see themselves on the world stage. Aimee is aging rich and fit and full of energy. Aimee is a force of nature oblivious to her cultural footprint. She decides to fund an all-girls school in a small village in Africa. This seemingly benevolent act creates much more chaos and barriers for the village than help but Aimee doesn't see a downside. Mostly because she doesn't want to and she is rich enough to create that reality in sphere of influence. She even starts a fantasy love affair with an African (Lamin) who is much younger. The affair is symbolic of colonialism In return Aimee exploits the African rhythms and drums which she incorporated into her album. But wealth and prosperity are measured differently in different cultures. Eerily reminiscent of the Indians being offered trinkets and TB infected blankets in exchange for food to keep the colonists alive. The reality in the African village proved quite different. The school created divisiveness within the village. The boys came to resent it because their needs were not addressed. Since the village was getting money from Aimee; the government stopped providing government services to the village putting the resources elsewhere, thereby overall disadvantaging the village. Just like the first world, oblivious to unintended consequences. Then once they are made aware, they shrug their shoulders and try and save a few. On to the next. Tracey ends up being a bitter, unemployed single mother. She seems to believe that the narrator's mother owes her. It was unclear why she felt that way. It was also unclear why the narrator's mother felt such an obligation to Tracey, in the end telling the narrator that she should raise Tracey's kids. It's almost like she saw much of herself in Tracey (the smart, restless, exuberant), but the narrator was more of the person she strived to be (smart, capable, accomplished). Obviously there is a lot more to unpack there. Interestingly enough I also got a subtle bit of misandry in Smith's characterizations. The males in the book do not come across very well. For example when Tracey was asked about why she couldn't continue working after her mother died. Where were their fathers? Tracey replied: \"Well, as you can see, I tried vanilla, café au lait and chocolate and you know what I figured out? On the inside, they're all the fucking same: men.\"Not even the narrator's father though rock steady with his daughter, he had questionable priorities with 2 kids from a previous marriage that he never saw and the rather fetishistic (though potentially false) accusation from Tracey. Even though none of the women are that nice either, they are better characterized making their flaws more comprehensible.Meanwhile the narrator is exposed to what should be life altering experiences. She meets really deep and thoughtful people and travels all over the world. She helps to run a multimillion dollar business and yet at the end of the novel shows absolutely no personal growth. Doesn't see the world through different eyes. This for me was symbolic of cultural indifference and a huge lack of social (self) awareness. In the end narrator comes across as emotionless and completely oblivious to her privilege. This lack of emotional substance seems to be Smith's way of enabling readers to impress their own reactions upon the character to fill the void. Doggone it, prior to reading this novel, I was pretty confident that I liked me, but the narrator comes off as shallow and superficial (much like my perception of American and British foreign policies).  (hide spoiler)]"}, {"userName": "Sandra", "userReviewDate": "May 18, 2016", "userURL": "http://www.goodreads.com/user/show/9100259-sandra", "userReview": "*religiously counts the days until November*"}, {"userName": "Rebecca Foster", "userReviewDate": "Oct 13, 2016", "userURL": "http://www.goodreads.com/user/show/5875398-rebecca-foster", "userReview": "Smith’s fifth novel spans 25 years and journeys from London to New York City and West Africa in tracing the different paths two black girls’ lives take. The narrator (who is never named) and Tracey, both biracial, meet through dance lessons at age seven in 1982 and soon become inseparable. The way this relationship shifts over time is the most potent element of the novel, and will appeal to fans of Elena Ferrante. The narrator alternates chapters about her friendship with Tracey with chapters about her work for pop star Aimee in Africa. Unfortunately, the Africa material is not very convincing or lively and I was impatient for these sections to finish. The Aimee subplot and the way Tracey turns out struck me as equally clichéd. Despite the geographical and chronological sprawl, the claustrophobic narration makes this feel insular, defusing its potential messages about how race, money and class still define and divide us. A new Zadie Smith novel is an event; this one is still worth reading, but it definitely disappointed me in comparison to White Teeth and On Beauty."}, {"userName": "Marie", "userReviewDate": "Sep 17, 2017", "userURL": "http://www.goodreads.com/user/show/51069187-marie", "userReview": "A sweeping multi-layered novel that reads like a dance through childhood into adulthood, across cultures, exploring race, class and gender issues. At the heart of this novel is the friendship between two “brown girls” growing up in public housing estates but in school with a largely white community in London. They see each other at dance class and are immediately drawn to each other, to the same tone of skin, similar but opposites. They are opposites in that one has a white obese doting mother that lathers her daughter with praise and attention while the other has a black mother subsumed with leftist politics and educating herself seemingly hardly noticing her daughter. The narrator feels like an accessory to her mother. She feels barely noticed and out of place until her friendship with Tracey begins.The narrator is unnamed throughout the novel and her childhood friend is Tracey, who is boisterous, adventurous, fun loving and narcissistic. The narrator seems to float through the novel on the energy of others. First and foremost, there is Tracey’s energy that dictates their play and social lives. Tracey is a brilliantly talented dancer and though the narrator loves dancing, she lacks Tracey’s talent. They spend countless hours watching videos of Fred Astaire, Ginger Rogers, Michael Jackson to name a few.The narrator’s Jamaican mother, a modern day Nefertiti, is a left wing feminist and activist studying politics and philosophy. The father lacks motivation, but is loving and doting towards his family. This is in sharp contrast to Tracey’s family, where there is an absent father. Tracey creates stories to explain where he is and what he is doing, but it seems he left them and has a new family. Though the narrator’s mother criticizes Tracey’s mother and her habits, the narrator enjoys the quiet of Tracey’s home compared to the anger in her own home where her mother no longer wishes to be married to her father.Jealousies arise and tensions result. The girls in childhood had written stories of “ballet dancers in peril.” Tracey would create and dictate these stories while the narrator transcribed. Always, just as it seemed the happy ending would arrive, disaster would result. Thus, Tracey’s stories foreshadow the end of the beautiful friendship of Tracey and the narrator. Tracey tells the narrator a story about her father, which may be fact or fiction, that causes them to cease speaking to each other for over a decade.The narrator goes off to college and leaves behind Tracey and their friendship. After a few gigs as a dancer, Tracey’s dancing career fades and she is a single mother to three children all by different fathers and is still living in the public housing estates, a fate the narrator’s mother warned against. The narrator begins working for a big name singer/dancer named Aimee. Aimee’s life is large. She has many people who work for her, numerous boyfriends, children by various men, she travels widely, and becomes interested in opening a girls’ school in an un-named country West Africa. The narrator again is living in the shadow of another large personality, not living a life of her own, running on the energy of another. The narrator travels back and forth getting to know the inhabitants this West African country, watching the fall out of diaspora that occurs there as people (especially men) begin to leave.The narrator is eventually drawn back to Tracey through her mother who has been working for Parliament. The narrator’s mother reaches out to the narrator pleading with her to ask Tracey to stop harassing her with countless letters that initially ask for help, but then begin to criticize the government, and her mother, and the inability of anybody to help with her situation. Her mother becomes consumed and tortured by these letters, unable to think of anything else. She is guilt ridden and seemingly identifying Tracey rather than the narrator as her daughter as she is dying,When the narrator confronts Tracey, Tracey asks her who she is trying to be. The narrator’s voice has changed, her life has changed. After leaking the childhood video, Tracey sends it to the narrator with a note saying, “now everyone knows who you really are.” Are we our childhood selves? Is who we are defined by who we connect and interact with? Is that identity forever changing? How much of that identity is tied to gender, class and race? How much of our childhood identity, our moral core, do we keep with us?This novel is beautifully written, incredibly expansive and brings up awesome philosophical questions. There are so many layers to this novel, that one could go on dissecting this for a very long time. I highly recommend this book to everyone. It would make a superb book club book. My one wish for this novel is that the narrator had more presence, but I think that is part of the point of this book. She floats on the energy of others, she is visible in the shadows of her relationship with others. Class, race and gender issues are often seen in reaction to the narrator.For discussion questions, please see: http://www.book-chatter.com/?p=2040."}, {"userName": "Jenny (Reading Envy)", "userReviewDate": "Dec 12, 2016", "userURL": "http://www.goodreads.com/user/show/68030-jenny-reading-envy", "userReview": "This book took me a while to read because I took breaks from it to read other things. The fact that I found it so easy to put down is probably not a good sign, and I kept coming back to it because everyone kept saying how good it was. It ended up on a lot of year-end best-of lists. Zadie Smith herself is well-respected and an excellent speaker and purveyor of all things feminist. I kept feeling like I was supposed to like this novel more than I actually did.Part of it was the storytelling technique, I think. The story of the two girls who grow up into different lives on the outskirts of London was interesting, but the story is told at arms length. The emotions and inner workings are never on display until they come to the surface in an emotional outburst. I never felt connected to the two women. Then the central character ends up working for an aging pop star and her charity work in Africa, and somehow the lessons I felt we were supposed to \"learn\" there didn't have the punch they could or should have. It is a novel about race and privilege and how that varies from place to place, also about how strong our parents are effects us whether or not we notice it while we grow. But just the same, I find it somehow forgettable.It probably didn't help that I was also reading The Story of a New Name at the same time, also about two girls who were friends and grew into womanhood with different amounts of privilege. Only in that case, the emotional complexity changes everything. I had no empathy with the characters in Swing Time. Thanks to the publisher for providing a review copy through NetGalley."}, {"userName": "Jesse", "userReviewDate": "Jan 24, 2017", "userURL": "http://www.goodreads.com/user/show/1432036-jesse", "userReview": "To my mind the allusion of the title—to the beloved Astaire/Rogers RKO musical from 1936—is much more than a resonant reference to the protagonist’s lifelong passion for the classic Hollywood movies, but actually signals the overall structure and spirit of the book: this a novel of movement and rhythm and not precision, of giddy expansiveness and not meticulousness. And as anybody who watches and loves musicals know, imperfection is just part and parcel of the form: that single bummer song in a score, one routine that just doesn’t quite come off, a narratively jarring pretext for a dance number, retrogressive attitudes and social behaviors that mar technically flawless scenes. Smith’s Swing Time functioned very similarly for me: some of the storylines riveted me, others made me long for more judicious editing. Characters I wanted to get to know better would disappear off of stage right and cede the stage to less compelling ones. But that is kind of the beauty of the entire enterprise: this is a big, messy, sprawling novel full of ideas and subplots and individual moments of sparkling radiance—but sometimes one has to accept some of the rote stuff needed to string them all together. And my god, those moments when everything comes together: just magical. And I found more than enough of them to keep me reading through some 450+ pages.Perhaps I’m coming off too much as an apologist—and I fully admit to being a Zadie Smith fanboy—but I’m also instinctually sympathetic to what I sense is the overall project. Like many great writers before her Smith has opted to hone a more rigorous analytic style for literary and cultural criticism (see her excellent collection Changing My Mind: Occasional Essays) while fiction continues to serve as a realm for experimentation. No, Swing Time is not a masterpiece, but it feels quite obvious to me that Smith is moving toward one—like the dancers she celebrates through the novel Smith is feeling out prose rhythms, stretching stylistic muscle, undergoing the hard work necessary to scale the dizzying heights of the extraordinary (one need only recall, say, the multi-volume process implied between the raw talent of Virginia Woolf’s The Voyage Out and the indisputable mastery of Mrs. Dalloway and after; I suspect Smith is on a similar trajectory).And I get it—not everyone particularly wants to see what goes on behind the curtains and between the acts. Fair enough. But I certainly wouldn’t want to miss it myself.  “She measured time in pages. Half an hour, to her, meant ten pages read, or fourteen, depending on the size of the type, and when you think of time in this way there isn’t time left for anything else…”"}, {"userName": "Helene Jeppesen", "userReviewDate": "Nov 29, 2016", "userURL": "http://www.goodreads.com/user/show/21992464-helene-jeppesen", "userReview": "While reading \"Swing Time\" - my first novel by Zadie Smith - I felt conflicted. Some parts of it I loved and I could really appreciate the beauty of the characters' story and the writing. Other parts felt dragging to me, and while they were not unimportant they didn't get the attention from me that they maybe needed. Basically, this is a story of growing up, identity, facing toxic persons as well as learning about yourself and your place in the world. I liked how it deals with so many diverse topics, but at the same time I felt rootless throughout - where was this going and how was I feeling about it? Our main character goes through an interesting journey, but while I liked reading about her I liked reading about other characters - such as her mother - more. All in all, I definitely see why Zadie Smith is a well-loved author because she definitely has talent. The structure of the plot and the diversity of the themes are strong, there was just something about the novel all in all that made it less appealing to me than what I was hoping for."}, {"userName": "Brandon Forsyth", "userReviewDate": "Mar 01, 2016", "userURL": "http://www.goodreads.com/user/show/19133785-brandon-forsyth", "userReview": "There's a lot going on in the Queen of Letters' latest; thoughts on belonging, of being authentic, of what makes a good parent or friend or community; a lot of interweaving of the timeline, and musings on the way we perceive time; and a fair bit on race, on the way it separates and/or unites and/or is defined. The copy provided on my ARC says \"ambitious\", and I think it's fair to use that adjective, as fair as to say the whole thing never really achieves its lofty aspirations. It's still Zadie Smith, though, so there will be frequent moments where you have to re-read a sentence, just to savour the way it floats on a thermal, then swoops down and kills with devastating precision."}], "description": "Two brown girls dream of being dancers--but only one, Tracey, has talent. The other has ideas: about rhythm and time, about black bodies and black music, about what constitutes a tribe, or makes a person truly free. It's a close but complicated childhood friendship that ends abruptly in their early twenties, never to be revisited, but never quite forgotten, either.Dazzlingly energetic and deeply human, Swing Time is a story about friendship and music and stubborn roots, about how we are shaped by these things and how we can survive them. Moving from northwest London to West Africa, it is an exuberant dance to the music of time.", "title": "Swing Time", "url": "http://www.goodreads.com/book/show/28390369-swing-time", "average": 3.57, "cover": "https://images.gr-assets.com/books/1514344635l/28390369.jpg", "reviews": 3842, "authors": [{"url": "https://www.goodreads.com/author/show/2522.Zadie_Smith", "name": "Zadie Smith"}], "type": ["Fiction", "Contemporary", "Literary Fiction"], "outlinks": ["http://www.goodreads.com/book/show/28390369-swing-time", "http://www.goodreads.com/book/show/31743745-swing-time", "http://www.goodreads.com/book/show/29424969-swing-time", "http://www.goodreads.com/book/show/30308970-swing-time", "http://www.goodreads.com/book/show/32997236-swing-time", "http://www.goodreads.com/book/show/33871691-swing-time", "http://www.goodreads.com/book/show/29734992-swing-time", "http://www.goodreads.com/book/show/3711.White_Teeth", "http://www.goodreads.com/book/show/3679.On_Beauty", "http://www.goodreads.com/book/show/13537891-nw", "http://www.goodreads.com/book/show/3710.The_Autograph_Man", "http://www.goodreads.com/book/show/6425404-changing-my-mind", "http://www.goodreads.com/book/show/39928984-mercy-among-the-children", "http://www.goodreads.com/book/show/20620995-take-me-with-you", "http://www.goodreads.com/book/show/6565401-five-quarters-of-the-orange", "http://www.goodreads.com/book/show/25600623-the-diver-s-clothes-lie-empty", "http://www.goodreads.com/book/show/18867378-the-traveler-s-gift", "http://www.goodreads.com/book/show/40198373-big-stone-gap", "http://www.goodreads.com/book/show/40198387-friendship-bread", "http://www.goodreads.com/book/show/40193401-the-little-giant-of-aberdeen-county", "http://www.goodreads.com/book/show/35963775-her-sister-s-shoes", "http://www.goodreads.com/book/show/22617980-the-rock-harbor-collection", "http://www.goodreads.com/book/show/35269080-a-thousand-tomorrows", "http://www.goodreads.com/book/show/40204902-caravans", "http://www.goodreads.com/book/show/31192689-shoeless-joe", "http://www.goodreads.com/book/show/40204877-a-hero-of-france", "http://www.goodreads.com/book/show/6473113-death-in-venice", "http://www.goodreads.com/book/show/40266651-the-tilted-world", "http://www.goodreads.com/book/show/33117501-blonde", "http://www.goodreads.com/book/show/36546758-ever-after", "http://www.goodreads.com/book/show/40193580-rescue", "http://www.goodreads.com/book/show/22032837-the-pearl-that-broke-its-shell", "http://www.goodreads.com/book/show/36589911-the-lords-of-discipline", "http://www.goodreads.com/book/show/11963271-the-sheltering-sky", "http://www.goodreads.com/book/show/25596951-the-dressmaker-s-war", "http://www.goodreads.com/book/show/35120598-gena-finn", "http://www.goodreads.com/book/show/29550710-a-charles-martin-collection", "http://www.goodreads.com/book/show/19977229-remember-tuesday-morning", "http://www.goodreads.com/book/show/8530701-a-town-like-alice", "http://www.goodreads.com/book/show/35414455-the-other-alcott", "http://www.goodreads.com/book/show/18800554-the-scavenger-s-daughters", "http://www.goodreads.com/book/show/40205036-under-the-udala-trees", "http://www.goodreads.com/book/show/32861105-the-streets-have-no-king", "http://www.goodreads.com/book/show/39929534-the-passion", "http://www.goodreads.com/book/show/35654710-this-dark-road-to-mercy", "http://www.goodreads.com/book/show/11513574-breath-eyes-memory", "http://www.goodreads.com/book/show/21942189-the-language-of-hoofbeats", "http://www.goodreads.com/book/show/18165412-house-of-bathory", "http://www.goodreads.com/book/show/37984397-we-own-the-sky", "http://www.goodreads.com/book/show/36004055-not-perfect"]}