{"ratings": 22730, "userreviews": [{"userName": "Pouting Always", "userReviewDate": "Feb 09, 2017", "userURL": "http://www.goodreads.com/user/show/48650982-pouting-always", "userReview": "I really was just being generous here with the three stars because I really had to drag myself through this book. It wasn't bad but it wasn't good either. The writing was mediocre and I couldn't bring myself to like any of the characters. I literally figured out the plot line in the beginning and the view point changes were annoying and unnecessary. I know it's a genre books but it was just so derivative of every other mystery book I've read, there was nothing original or good about it. You can't be a mediocre writer with boring cliched characters and a predictable plot line like come on man give me something."}, {"userName": "Eve", "userReviewDate": "Oct 15, 2015", "userURL": "http://www.goodreads.com/user/show/1283951-eve", "userReview": "“I think most sociopaths are born, not made. Very few are created by life events.” – Kate Burkholder, Chief of PoliceIt’s a dark, quiet morning, the kind I usually relish while drinking a hot cup of coffee at my kitchen table with warm puppies at my feet. Today, I shiver in my onesie while I wait for my pot of coffee to brew. I’m facing the kitchen window that looks onto the otherwise idyllic, peaceful neighborhood, and thinking about the book I finished reading the day before. I wonder if someone’s secretly peeking back at me, possibly planning to ambush me later in the shower and murder me. Brrrrrr. If you’re planning on reading this, I believe Samuel L. Jackson’s Jurassic Park warning should be heeded: “Hold on to your butts.”Painters Mill, Ohio–sleepy farming community where a third of the population are Amish. Kate Burkholder, Chief of Police has childhood ties to the community, which come back to haunt her when a string of serial murders resurface after sixteen years. Who is the killer? Why the hiatus? Why the escalation in murders and change in MO? Burkholder and her patchwork team of sidekicks are on the trail, but everyone’s got secrets.I will be honest. There is something about cozy settings and brutality that fascinates me. Not that anything really shocks us anymore, right? One never really knows who one’s neighbors are. But the idea that something can happen in a quiet, peaceful community is always attention grabbing, and Castillo does an excellent job of really drawing in the reader. She shocks you! Lures you into pacivity, and then assaults you again. You’re never really comfortable reading through this. I may just do something I never do, and jump into the next book in the series. I don’t know if my nerves can handle it this week, but what have I got to lose other than sleep?"}, {"userName": "Rosie", "userReviewDate": "Oct 24, 2015", "userURL": "http://www.goodreads.com/user/show/8375418-rosie", "userReview": "This was such a good read. Lately I have been struggling to find a good crime thriller book that keeps me guessing and really in suspense. I'm really glad I stumbled across this one. The pace is fast and there is a lot of suspense. I found the book very difficult to put down. I really liked the main character, Chief Kate Burkholder. She is a strong, independent woman with an Amish background. I enjoyed learning a little bit about the Amish way of life and thought it clever how the author worked this into the storyline. I was never bored at all through the story and I even didn't mind the small bit of romance thrown in towards the end (I normally don't care for it). The crime scenes were described in quite graphic detail, so I probably wouldn't recommend this if you don't like reading that sort of thing. However, I enjoyed the story and look forward to reading the rest in the series."}, {"userName": "Mary Beth *Traveling Sister*", "userReviewDate": "Jun 25, 2015", "userURL": "http://www.goodreads.com/user/show/14233569-mary-beth-traveling-sister", "userReview": "This is the first book in the Kate Burkholder Series and Ijust loved it. One of the many reasons that I loved it so much is that I live in the Columbus, Ohio area where some of the setting is taken place. Kate is an eight year veteran for the Columbus, Ohio Police Force, who returns to her home where she grew up in Painters Mill,Ohio, where I have visited several times. She becomes Police Chiefthere. She knows the Amish town and residents very well. Since she left the Amish way of life, she is not very well liked there in thecommunity. A horrible mutilated body is found of a young woman in in a field. A similar series of crimes had occurred in the community16 years ago, where four young ladies were murdered. Thekillings had stopped, and now it appears that the killer has come back. Kate doesn't believe though that the killer has comeback, due to a secret that she and two others had kept since shewas 14 years old. If the same person has returned then everything she knows is wrong. Also if the murder case is reopened, she risksnot only losing her career but also the lives of those that had kepther secret. Two other victims are discovered and Kate becomes firedfrom her job, but she stays on the case on her own time while seeking the identity of the killer and putting her own self up asthe victim.What makes Sworn to Silence such an awesome read is that Castillo's descriptions of the quiet and tranquil surface of life in the rural County with the undercurrent of the violence that dramaticallyreveals itself without warning. I recommend this book to all thatlove a great and fantastic thriller. I cannot wait to read the rest ofthe series."}, {"userName": "Phrynne", "userReviewDate": "Aug 12, 2017", "userURL": "http://www.goodreads.com/user/show/8655084-phrynne", "userReview": "New author to me and I enjoyed it very much! The main character, Kate Burkholder, was interesting and likeable. She made mistakes but persevered and eventually got her man. The story was excellent, lots of really gross murders, lots of police work and then a great twist at the end. I was just beginning to wonder if it could be a certain person when it turned out to be so. I also very much enjoyed the Amish angle to the plot. It added an extra something to the whole and I learned a little about their way of life.Altogether a really good book and an excellent start to another series:)"}, {"userName": "Tim The Enchanter", "userReviewDate": "Feb 16, 2014", "userURL": "http://www.goodreads.com/user/show/5654692-tim-the-enchanter", "userReview": "Posted to  The Literary Lawyer.ca   A Chilling Tale in a Beautiful Place - 4.5 Stars  I am going to start this review with a confession. For reasons now lost to the ravages of time, I long had a prejudice against female authors. My impression was that books by female authors would be sappy, romantic, emotional or uninteresting. I went to university, got married and had two girls. Once the I got the aforementioned out of the way, I got back into reading and asked myself why it was I didn't read books by female authors. I have to say I was a stupid man for holding a stupid prejudice. The majority of the best crime/mystery fiction I have read in the past several year have been written by women. I have discovered Tana French, Sharon Bolton, Chelsea Cain, Belinda Bauer, Denise Mina to name a few. These women have written intricate tales with deep and nuanced characters. They have avoided many stereotypes and have skillfully written male and female characters. Their female characters are at times tragic and broken while encapsulating strength and determination. To the other female authors whose wonderful books I will soon discover, please accept this as my sincere apology.Now that my soul has been laid bare, on to this book.Should you ever want to vacation in a peaceful and idyllic place, let me suggest Holmes County Ohio and the surrounding towns and cities. There you will find small towns with wholesome names such as Sugarcreek and Walnut Creek. The towns are a mix of modern and traditional with dollars stores and clothing shops run by \"English\" residents and quilt shops, bake shops and furniture stores run by local Amish residents. My wife and I have vacationed here several times and we look forward to returning again. Now imagine that a brutal killer is terrorizing this beautiful and peaceful place, abducting and killing young women, English and Amish alike. To me, this type of terror in this setting is far more horrific. Plot summary Kate Burkholder is the main character and police chief of the small town, Painter's Mill. The town, like much of the surrounding area, is made up of two distinct cultures, the English and the Amish. Kate is a product of both cultures. Until her teens, she grew up and was raised Amish. After living through some horrific events in her teens, she left the Amish way of life and live the \"English\" life. Although a part of both worlds, she doesn't belong to either but is tasked with keeping law and order in both. A woman is found dead with roman numerals carved into her stomach. This shocks the town and spreads panic as this appears to replicate a series of murders 16 years earlier. The old murders, dubbed \"The Slautherhouse Killings\" are personal to Kate and despite the fact everyone believes the old killer has returned, she believes someone else is at work. As a result, her judgment is impaired and she make a series of poor decisions. Murders continue to pile up until the chilling and gripping final confrontation. The Good  Best of Both Worlds I thought the setting and setup of the novel was fascinating. The novel was series of contrasts that flowed from beginning to end. Kate was a product of two cultures, neither of which truly accepted her. This made her both compelling and relatable. Who hasn't felt as if they didn't fit in at some point in their life. The author expertly weaves this theme throughout the story while providing interesting and telling insights into both cultures.In my opinion, the most interesting characters are those that have elements of strength and fragility. While Kate is a strong character, she is haunted by the events in her past. These events lead her to make decisions that the reader knows are wrong, misguided or selfish. While she retains a strong sense of morality from her Amish upbringing, he past has allowed her to justify bad behavior. Without a doubt, Kate Burkholder is one of the most interesting main characters I have read in a very long time. The Bad  &%!# It Kate is not the only broken characters. Early in the novel we are introduced to John Tomasetti another officer of the law with a recent past as an avenging angel. There are many ways to make your character seem rough around the edges, troubled, tortured or broken. The author chose to use adult language to punctuate his lack of care for the world. It got to the point that I was simply annoyed and put off with the language. If he shows up in future novels, I hope he is forced to spend a few months with an Amish family and he is shamed into cleaning up his mouth. Overall, the adult language was excessive and detracted from the rating. Audiobook Notes I listened to the audiobook version of this novel. In this case, the narrator impacted on the overall rating. For the first quarter of the book I found her narration to be unappealing and lacking in emotion. The voice she used for John Tomasetti was a bit painful. She attempted a deep gruff voice that came off as more grating. Fortunately, she came into her own as the story progressed and her narration in the final confrontation was stunning and was dripping with emotion. It made for a powerful scene. Despite a rough start and a bad voice for one character, her narration was a 4 of 5. Final Thoughts I should note that the subject matter is dark. If you see that this is set amongst the Amish and are expecting a \"cozy mystery\" in the like of some book like \"A quilting circle murder\", you will be very disappointed. There is a dark edge to our killer that would fit right into an S.J. Bolton novel. This is an excellent book and about as close to five stars as I can get without going the whole way. If you like tense thrillers with a dark antagonist, this book is for you.  Content Advisories  It is difficult to find commentary on the sex/violence/language content of book if you are interested. I make an effort to give you the information so you can make an informed decision before reading. *Disclaimer* I do not take note or count the occurrences of adult language as I read. I am simply giving approximations.Scale 1 - Lowest 5 - Highest Sex  -  3.5 While there is no graphic sex, there is significant discussion of sex as related to assaults. Victims are sexually assaulted and there is some discussion on how sexual assault and torture were related. There is a scene where there is an attempted sexual assault that is moderately graphic. There is sexual tension between some characters and there is some \"lead up\" to sex and sex is ultimately implied. Language  -  4.5 As stated above, I took some issue with the language in the book. There was the entire gambit of language moderate to high use of mild obscenities, scatological terms and religious exclamations. There was also moderately high use of the f-word. This book is not suitable for younger readers. Violence  -  4 As with most crime thrillers, violence is an integral part of the story. I gave this a 4 as most of the violence inferred through the examination of the victims bodies and was, for the most part, moderately graphic. The final confrontation is quite graphic and will be disturbing for some readers. Readers who are not comfortable with sex crimes should avoid this novel."}, {"userName": "Thomas", "userReviewDate": "Mar 24, 2018", "userURL": "http://www.goodreads.com/user/show/24360539-thomas", "userReview": "A solid 4 starsThis is book 1 in the series about a small town Ohio police chief in Amish country. Kate Burkholder was raised Amish, but left the community and became a police officer in Columbus, Ohio. She has returned as chief, hired because of her Amish background. The book opens with a gruesome torture/murder scene. It reminded me of the opening scene in the tv show Criminal Minds. When the body is discovered, there is a Roman numeral carved on the body, the same as a series of serial murders that stopped 16 years ago. Kate has a secret. She believes that she killed that murderer 16 years ago. The mystery mounts as more bodies are found with the same signature, and I could not put this book down. I did not suspect who the killer was was until near the end.I discovered this series when I won book 8 in a GR giveaway last year and resolved to read more. Both my wife and I enjoy this series.There is some graphic violence. This is not a cozy mystery.Some quotes:Kate--\"I groan inwardly at the power and speed of the Painters Mill rumor mill. If it could be harnessed to generate electricity, no one would ever have to pay another utility bill again.\"Ohio BCI(Bureau of Criminal Investigation) agent Tomasetti describing Kate -\"A gun toting, cursing, former Amish female chief of police. I'll be damned.\"I read this library book in 3 days."}, {"userName": "K", "userReviewDate": "Oct 09, 2011", "userURL": "http://www.goodreads.com/user/show/13779-k", "userReview": "Rrrrripppp! Rrrrrrrippppp!That's the sound of me ripping this book. If you loved this and have troll instincts, stop reading now because I will not be kind.I really have to stop reading mysteries. I keep hoping this one will be the next P.D. James or Elizabeth George (in her good days); multidimensional interesting characters circulating in a truly gripping and suspenseful plot. Well, wrong again. \"Sworn to Silence\" was incredibly predictable and cliched, with stock, one-dimensional characters. Not to mention annoying and unnecessary viewpoint switching, excessive and repetitive hyping of events' drama (how many times can this be the first time in someone's long career that they were so deeply affected by whatever?), repeated gratuitous detailed scenes (how many times do we have to read yet another scene where some unsuspecting citizen finds the body, witness the victim's devastated parents learning the news of their daughter's death in an excruciating play by play, or hear all about the latest victim's evisceration?). Even the Amish angle failed to redeem the book's pedestrian qualities, especially since it felt stereotyped. What's more, reading this book felt at times like reading a sequel to a possibly more interesting but unfortunately unread book as some of the action and intrigue surrounded events that took place before the present story.Kate, the central character, is chief of police in a small town with a large Amish population. Kate herself was raised Amish and left the fold at eighteen; yet she works in the community in which she grew up. This might have given rise to some interesting complications; sadly, the author did not develop this aspect of the story sufficiently and relevant encounters between Kate and her former compatriots were handled superficially. Kate is Kinsey Milhoune to the tenth power; a tough-as-nails female cop who both intimidates and inspires passionate loyalty in just about everyone who meets her (unless they're bad guys). I've met tough people in real life and admired their competence but not necessarily liked them personally, and also noticed that they were capable of irritating the people working under them. Not a problem for Kate, clearly, who is dearly loved by her subordinates and colleagues. Of course, her tough exterior masks a secret blah blah blah and the right guy (you'll never guess who!) will finally break down her defenses. Mr. Macho Hero is also a tough-yet-wounded figure -- no, really -- and love magically overcomes a lot of his issues which should really be a bit harder to fix.So much for characterization. As far as the plot goes, it plods over well-worn Nancy Drew lines of red herring (which went on forever and wasn't all that interesting) followed by getting closer to the killer, followed by a dangerous confrontation with the killer (will Kate be rescued?), whatever whatever.Once again, the high goodreads rating suggests that I'm in the minority but if you're a curmudgeon like me, you might want to look for something else."}, {"userName": "Christine", "userReviewDate": "Jul 08, 2014", "userURL": "http://www.goodreads.com/user/show/26175098-christine", "userReview": "This book hooked me in the prologue and did not let go until the very last page. Whew!!!!! Easily a 5 star rating from me and tied for first place (with S.J. Bolton's Now You See Me) as my favorite read (of 45 books) in the last 12 months. Honestly, I cannot recall the last time a book pulled me in so deep that there was not a single break in my attention. Cover to cover immersion. Ms. Castillo has a number of romances/romantic suspense novels under her belt. Sworn to Silence, I believe, is her first attempt at a mystery thriller, which makes the wonderfulness of this book all the more remarkable. Furthermore, I have heard from others that some of the subsequent books in this 6 book (so far) series are even better; I can't imagine!Why did I like this book so much? As noted above, my attention was unwavering. In addition, the setting was different with the action set in Amish country. The mystery was very well plotted out with the revelation of the bad guy a big surprise to me. I especially loved Ms. Castillo's character development. The protagonist, Kate Burkholder, is an extremely complex being. The author is slowly peeling away the layers of her personality, something that I suspect will continue as the series progresses. I love Kate Burkholder, flaws and all. There was good initial character development of other supporting players who I also suspect we will learn even more about in subsequent books. The pace of the book was perfect, always a big plus. There was no agonizing set up taking the first 15-33% of the pages, yet I did not feel any necessary background was missing. This is a rare find these days, in my experience. There was a small sidelight of romance (couldn't help yourself, could you, Ms Castillo?) which was totally nongraphic and nonintrusive to the story. I personally thought it was done perfectly. One warning, the crime scenes ARE graphic and very dark. To say the villain was deranged is an understatement. I cannot think of anything I did not like about this book.I strongly recommend this to all mystery/thriller fans except those who like cozy mysteries only. This is a \"can't miss\" novel in the genre. I repeat, DO NOT MISS THIS BOOK. I look forward to reading much more of Linda Castillo's works."}, {"userName": "Shelby *trains flying monkeys*", "userReviewDate": "Sep 04, 2009", "userURL": "http://www.goodreads.com/user/show/1053760-shelby-trains-flying-monkeys", "userReview": "When you go to work and can't concentrate because a book you left at home keeps calling your name-shows a great book! That's exactly what happened to me with this book."}, {"userName": "Sue", "userReviewDate": "Sep 21, 2014", "userURL": "http://www.goodreads.com/user/show/3908840-sue", "userReview": "\"Sworn to Silence\" by Linda Castillo is the first book in the Kate Burkholder series. After reading two recent novels in the series that I won through Goodreads Giveaway, I was so impressed with the writing , I went and ordered all her other books in the series. This is the review of her first novel, a gripping,tense story of a sexual serial killer in Painters Mill in Ohio, home of the Amish community. I am now hooked on the series.After sixteen years, it appears that a serial murderer is back, torturing and killing young women in the area of Painters Mill, Ohio, a community where Amish and English people have live side by side. Kate Burkholder, the Chief of police, grew up in an Amish household in the area but, after a traumatic experience as a teenager, she left the faith and moved to Columbus to become a policewoman and, later, a homicide detective. Now, back in the community, she must live in both worlds. Kate with her background understands the pacifistic culture of her jurisdiction, and the Pennsylvania Dutch language...but she doesn't belong in either world.Assisting Kate in tracking down the murderer is John Tomasetti, agent for the Ohio Bureau of Criminal Identification and Investigation. John also has a traumatic past and is as lost as Kate is. The two are drawn together professionally and personally as they work to identify the murderer.This is an intriguing story and very well-written. Sworn to Silence is written in two “voices” - the traditional third-party past tense and Kate’s first-person present tense. These two viewpoints, add strength to the plot and allow the two voices to blend together.I highly recommend this fast-paced quality novel. I now look forward to reading Pray for Silence, the sequel."}, {"userName": "Sean Peters", "userReviewDate": "Mar 12, 2014", "userURL": "http://www.goodreads.com/user/show/14058345-sean-peters", "userReview": "My first book by this talented author, and her first book, so a great place to start.Another one of our monthly Book Pals books, so thank you Sue for picking this book for me.A powerful, strong gripping, tense, chilling story of a sexual serial killer in Painters Mill In Ohio, home of many Amish residents.Former Amish girl and now Chief Of Police has a case on her stands, and her past that might come back to haunt her.A very well written, great paced, great strong characters.The last few chapters charge at furious pace, I personally just had to read the last 50-70 pages and I guessed the serial killer correctly.Another author I just have to read more!!Highly recommended, great writing, great tension, great personalities."}, {"userName": "Anniebananie", "userReviewDate": "Jul 10, 2016", "userURL": "http://www.goodreads.com/user/show/47587994-anniebananie", "userReview": "Gelungener Auftakt! Die Zahlen der Toten hat mich von Anfang an gepackt mit einem spannenden Mord, vielen Verdächtigen und komplexen Beziehungen der einzelnen Charaktere untereinander. Kate und ich waren uns zu Beginn zwar nicht so grüne (ich fand sie etwas zu plump und übellaunig, fast ein bisschen kindisch-trotzig manchmal), weshalb ich auch einen Stern abziehen muss. Die Story war super geplottet und hatte genug Wendungen um dauerhaft spannend zu bleiben. Noch dazu möchte ich den Schreibstil von Linda Castillo gern, man kam flüssig durch die Seiten, die Story war sinnvoll in viele Kapitel angeteilt und es gab interessanten Perspektivwechsel.Ich freue mich auf alle Fälle (Wahnsinns Wortwitz auch an dieser Stelle!) auf den nächsten Fall mit Kate Burkholder und hoffe auf noch etwas mehr Einbeziehung der Amish."}, {"userName": "Kirsten ", "userReviewDate": "Jun 03, 2015", "userURL": "http://www.goodreads.com/user/show/833700-kirsten", "userReview": "Great book! Katie Burkholder is a sensitive (yet damaged) and kick-ass Chief of Police in a small town in Ohio with a large Amish population. Being formerly Amish herself, she has a special insight. Of course, it can't be too idyllic. So, a serial killer has to come to town. Thing is, he'd been there before. This is a great mystery/thriller with wonderful pacing. The characters are quirky, but not too quirky and then there is the stereotypical small town politics where politicians put the tourist trade above the police work.Can't wait to see more of Katie Burkholder."}, {"userName": "Noeleen", "userReviewDate": "Jan 22, 2016", "userURL": "http://www.goodreads.com/user/show/5333773-noeleen", "userReview": "Rating: 3.5 StarsI really enjoyed this book, the first in a series and the first time I’ve read this author. It was very well written and I enjoyed the vast array of characters associated with the police department, most especially Kate Burkholder. The small town setting coupled with the Amish background really attracted me to this series. The story was fast paced and kept my interest from beginning to end. I don’t know why, but I had the impression that this story and the series itself was slightly cosier and tamer than it actually was. I was surprised that I was sitting down with a serial killer thriller rather than with a cosy murder mystery! I did find the descriptions of the murders a little overly graphic at times but not enough to ruin my enjoyment of a very good serial killer story! Kate Burkholder’s character was feisty and gutsy and I liked that. I look forward to reading more of this series in the future. The small town setting and characters really appealed to me."}, {"userName": "Jonetta", "userReviewDate": "Sep 15, 2011", "userURL": "http://www.goodreads.com/user/show/4876540-jonetta", "userReview": "Painters Mill, Ohio Police Chief Kate Burkholder is suddenly faced with what looks like the re-emergence of a serial killer who hadn't struck in the last 16 years. The killer's signature is to leave Roman numerals carved on the murdered victim. Kate's conflicted as she's harboring a secret that relates directly to the case. Painters Mill is a town where the Amish and \"English\" have coexisted for years. Kate straddles both cultures as she was raised Amish but left when she was a teenager. I've had this book on my shelf for a long time even though it was strongly recommended by friends. Thinking it was on the cozy side of the mystery genre (not my favorite side), I backburnered it until now. Let me make this clear...this story is polar opposite of a cozy; gritty, gruesome and gnarly. I really liked this story with its flawed characters and unusual setting. Kate's still trying to come to terms with her past, which shapes her perspective in the present. John Tomasetti, the Ohio Bureau of Criminal Investigations (BCI) agent sent to help Kate, has his own demons and forges an uneasy alliance with her. The cultural aspects of the Amish community are interesting, especially when contrasted with the realities of the coexistence with those outside of their world. While Kate makes many errors of judgment driven by her personal involvement in the case, she's still an admirable character. The case wasn't easy to resolve and kept my interest through the end. The narration by Kathleen McInerney was exceptional and I plan to continue the series in audio format. I'm officially hooked and could smack myself for putting off reading this book."}, {"userName": "Magdalena aka A Bookaholic Swede", "userReviewDate": "May 30, 2016", "userURL": "http://www.goodreads.com/user/show/1379514-magdalena-aka-a-bookaholic-swede", "userReview": "I was lucky enough to get Sworn to Silence, the first book in the series cheap as an Ebook after being rejected on NetGalley for Among the Wicked the latest book in the series. So, all and all it was probably for the best since I did enjoy starting this series from the beginning instead of the latest book. Police chief Kate Burkholder, ex-Amish, has to stop a vicious killer in this book that may be a copycat or a killer that murdered several women 16 years ago. However, she has personal reasons for believing that it has to be another killer. It doesn't get easier for her when her role as police chief is getting questioned as more people are killed while she is trying to figure out who the killer is. Some local people just don't think she is trying hard enough... I found the book to be very good, and very different from other crime novels. I like that Kate Burkholder has a history with the Amish community and I liked that she is a complex character with a dark past. Also, this case really brought back bad memories for her. The case also brought agent John Tomasetti into her life as he who was hellbent on wrecking his life and career seems to have finally found someone that can get his life back on track. I quite like the chemistry between them. The case was interesting, is it the same killer or a copycat? What is really going one and what happened to Kate all those years ago? I did, however, figure out the killer when Tomasetti listed the killer profile, it was actually quite easy to do so I thought and then I just kept on reading to see if I was right, and I was. But, it did not take away the enjoyment of reading the book. I still found the book pretty good, despite not being surprised over the killer's identity.It was a good first book and I'm looking forward to reading more books in the series!"}, {"userName": "Michelle", "userReviewDate": "Dec 27, 2017", "userURL": "http://www.goodreads.com/user/show/23229945-michelle", "userReview": "Sworn to Silence was my first Linda Castillo book and it did not disappoint. She is such an amazing storyteller! I was hooked at every turn. Now to start the second in the series, Pray for Silence."}, {"userName": "Carol", "userReviewDate": "Dec 27, 2009", "userURL": "http://www.goodreads.com/user/show/1166663-carol", "userReview": "Just recently I was talking about violent acts against women in books and how sometimes, if gratuitous, it can turn me off. There's a fine line for me in what moves the plot forward and what is over the top and just plain too much. I got turned off on James Patterson for just this reason. Right or wrong this bothers me even more when women write violent scenes, as is the case in Linda Castillo's Sworn to Silence. I have to weigh the merits of the violence to the overall story. Would the story have had the same impact with less descriptive murders. In this case, I'd have to say yes. I was immediately hooked on the broken characters of Kate Burkholder, Chief of Police of Painters Mill, and John Tomasetti, Special Agent who together try to solve a series of horrific serial murders similar to those committed years ago by a fiend dubbed The Slaughterhouse Killer. Kate's character sings true. She harbors haunting secrets from when she was a teen living the plain life of the Amish and as an adult is now under a bann, having left the Amish life behind. Tomasetti, is dealing with his own nightmares after the murder of both wife and daughters to someone trying to get back at him in the most awful way. Burkholder and Tomasetti make a great team and I'm rooting for them both from the get-go. But the violence of the crimes in the end turns me off. Ok, the prologue hooked me. I see the monster, I feel the terror and I am hooked. I get it; I did not need to be graphically reminded throughout of the killer's depravity. Still, I'll give Kate and John another chance as I'm certain there will be a sequel. It's a brutal tale and if you can skip over man's inhumanity to women in this case, an engrossing debut."}, {"userName": "Lisa Kay", "userReviewDate": "Sep 16, 2012", "userURL": "http://www.goodreads.com/user/show/2459470-lisa-kay", "userReview": "★★★★½ Edge of my seat the whole read and left the lights on."}, {"userName": "Jim", "userReviewDate": "May 15, 2017", "userURL": "http://www.goodreads.com/user/show/36199787-jim", "userReview": "Chilling, Tense, Gripping, non-stop page turnerSixteen years ago a serial killer terrorized the small Amish community of Painters Mill, Ohio. Fourteen year old Kate Burkholder thought she survived the terror of the Slaughterhouse Killer but left Painters Mill and her Amish faith behind when she was eighteen. She also carried a secret from that terrible time. Now she has returned ... as Chief of Police. She thought she had come to terms with the past. Until the body of a young woman who had been tortured, raped, and killed by exsanguination is dumped in a farmers field. This is only the first of several brutal murders. All of the murders appear to be the work of the Slaughterhouse Killer. The evidence seems indisputable. But Kate believes she knows why the killings stopped sixteen years ago. She vows to get at the truth even if it means the truth could destroy her. But while she and her small police department work around the clock trying to solve the murders she is forced to deal with the mayor and town council. They believe she is overwhelmed and too inexperienced to deal with a serial killer. She reluctantly calls in Sheriff Nathan Detrick and the Holmes County Sheriff's Department. Then the politicians call in Ohio Bureau of Criminal Identification and Investigation (BCI) and they send field agent John Tomasetti. Kate is trying to work with outside agencies and deal with politicians and meanwhile the killings continue and their brutality escalates.This is the first book in the Kate Burkholder series. It was a fun and enjoyable read. Much of the book was a constant page turner, one more chapter reading experience which I enjoy in suspense and thriller novels. I was able to correctly identify the serial killer but that did not detract from an enjoyable reading experience and I look forward to reading other books in this series. Great characters. Highly recommend."}, {"userName": "Jean", "userReviewDate": "Jul 25, 2014", "userURL": "http://www.goodreads.com/user/show/28831526-jean", "userReview": "Sworn to Silence begins with a horrific murder. A young woman is tortured, raped, and killed – exsanguinated – and her body is dumped in a field where a police deputy finds it.Kate Burkholder is a young, ex-Amish woman. As police chief in her hometown of Painter’s Mill, Ohio, she commands a small force and must investigate the murder. There is a detail, however, that only the police know: Roman numerals carved in the victim’s abdomen. Has a serial killer returned? Is Kate in over her head?Kate hides a deep, dark secret from years ago when she was a 14-year-old girl. Only her estranged brother and sister know the truth. Is her secret related to the brutal murders terrorizing Painter’s Mill once again?4 starsAgent John Tomasetti of the BCI could be on his last case. He is hooked on booze and pain pills, and he has declined an offer of early retirement. His assignment to Painter’s Mill is a sink or swim situation– and his superiors are betting on the former. Chief Burkholder resents his presence as well. Do they remain at odds, or do they find a way to work together to solve the case?Two officers of the law with heavy personal baggage and a race against time. Can they catch the killer before more young women die?Castillo creates tension using wintry scenes with snowstorms and impassible roads, conflicts between Chief Burkholder, the town council and the sheriff, and within Kate’s own mind as she struggles with the skeleton in her childhood closet. Overall, Castillo did a good job of keeping me absorbed in the story, and I had only a slight inkling of who the killer might be (almost at the same time Kate begins to put it together). This was my first time reading Linda Castillo, and I enjoyed this book very much. The major problem for me was that Kate did not seem the least bit Amish to me. Yes, she had rebelled and had been shunned by her community when she was 18. Not infrequently, she is derided as an “Amish bitch.” Other than displaying understanding and sympathy for her Amish family and neighbors, I did not detect the remains of Amish-ness in her. It seemed to me that she would feel more ambiguity or seem less “English” than she is portrayed after only a dozen or so years away from the Amish community. However, I did find her quite likable and otherwise very human with both her intelligence and her flaws and the way that she relates to her officers. Tomasetti is even more flawed, but when he teams up with Kate, he begins to find himself again, and I suspect that he reappears in subsequent books.I definitely plan to read the next Chief Kate Burkholder novel, as I think this is an excellent beginning to a wicked good series."}, {"userName": "Fictionophile ", "userReviewDate": "May 27, 2014", "userURL": "http://www.goodreads.com/user/show/4428094-fictionophile", "userReview": "Wow! How lucky to find another great first of a series! Just when I thought I was running out of authors, I discover another one who is young and talented. (by that I infer lots of wonderful reads ahead!)With a great cover scene of dead cornstalks in a snowy farmer's field, \"Sworn to silence\" grabs you right away. Set in Ohio's Amish country, this mystery/thriller features a unique protagonist. A female police chief who was formerly Amish.Kate Burkholder has chosen to leave the Amish way of life and is shunned by her family. She leads a somewhat solitary life but enjoys her job largely due to her loyal employees.Kate maintains a devastating secret from her youth which comes back to haunt her when a body is found in a wintery farmer's field. The setting is so well depicted that the cold is almost palpable... Loathe to call for assistance from outside law enforcement agencies because of her secret, Kate is called to task by the town's council who employ her. When the case becomes even higher profile with the discovery of a second body, they go over her head and call in an agent from the BCI. Agent John Tomasetti is a damaged individual. His posting to Kate's case is probably his last chance at salvaging what is left of his formerly illustrious career. He lost his wife and children to a psychopath and doesn't want anyone else to suffer what he has had to...When Kate does not follow protocol and fails to find the culprit, the town council remove her from her duties. Knowing nothing else in her life will fill the void, Kate continues to work the case with the help of John. There is an attraction between them which is largely due to all the baggage they carry with them.When Kate is eventually captured by the murderer, both she and John fear for her survival. Her ingenuity with the help of sound police work, bring the culprit to justice bringing about a most satisfying ending to the novel."}, {"userName": "Sandy *The world could end while I was reading and I would never notice*", "userReviewDate": "Sep 25, 2014", "userURL": "http://www.goodreads.com/user/show/30817744-sandy-the-world-could-end-while-i-was-reading-and-i-would-never-notice", "userReview": "This was my first ever Linda Castillo book. It won't be my last.Kate Burkholder, of Painter's Mill, Ohio, is not your regular Police Chief. She was brought up in Painter's Mill in the Amish faith, but left both when she was 18.Now back, she is faced with a serial killer, one she thought she had dispatched 16 years earlier. Not only is she battling the killer, and Amish prejudices against the English, but a multi-jurisdictional task force set up by the town council, some of whom seem more intent on hindering her investigation than helping it.Tightly written, with great characterisation, this thriller will keep you on the edge of your seat."}, {"userName": "Irene", "userReviewDate": "Aug 12, 2016", "userURL": "http://www.goodreads.com/user/show/1887310-irene", "userReview": "Young women are being tortured and killed in a small town with a large Amish population. This police procedural follows the typical trajectory. The pacing was good and the romance did not over take the murder mystery."}, {"userName": "Kelly ", "userReviewDate": "Oct 18, 2009", "userURL": "http://www.goodreads.com/user/show/1943394-kelly", "userReview": "Sworn to Silence is a snow-filled thriller that will chill you to the bone... perfect for crawling under a blanket with on a cold winter day. Kate Burkholder grew up within the Amish community of a small Ohio town, but left that life behind when she turned 18. Now many years later, she has returned to Painters Mill to accept the position of Police Chief of the town. At 30 years old, Kate is only peripherally involved with the people of the Amish community, and serves as a go-between of sorts between the \"English\" and Amish folk. When a brutalized body is found in an Amish farmer's field one cold winter night, Kate begins the hunt for what appears to be a serial killer. The killings are similar to a string of murders that occurred 16 years before, and issues from Kate's dark past are brought to the surface. I very much enjoyed reading this and would definitely recommend it. The writing is good, the characters are interesting and full of depth, and the mystery will have you on the edge of your seat. I can't WAIT for the next book in the Kate Burkholder series to be released later this year!! But for now, I think I'm ready to read something that takes place on the beach in the middle of summer. Brrrr!!!"}, {"userName": "Emily", "userReviewDate": "Oct 11, 2011", "userURL": "http://www.goodreads.com/user/show/126498-emily", "userReview": "So, what you're saying is:1. Kate Burkholder leaves her Amish home at 18 with an eighth-grade education and has no problem getting a police dispatcher job with no high-school diploma.2. She goes from dispatcher to homicide detective in less than eight years.3. She then comes back to her small town to become chief of police.4. With *eight years* of experience.5. Total.6. And oh, the serial killer who terrorized her town 16 years ago is back!!7. But nope, can't be the same guy, because Kate was nearly his victim and shot him in self defense.8. And her father and brother buried him.9. And nobody said WORD ONE to the ministry or the police.Yeah. One star."}, {"userName": "Freda Malone", "userReviewDate": "Mar 20, 2015", "userURL": "http://www.goodreads.com/user/show/6938113-freda-malone", "userReview": "My first Linda Castillo read and it was good! I like that the lead detective, Kate, has an interesting history having grown up Amish turned English and keeps the peace between the two cultures. A typical and unoriginal serial crime occurs in Painters Mill, Ohio, but still engaging and I was riveted throughout the whole book. Another great series of novels I will be picking up this year.I'll probably watch the movie at some point in time just to get a good visual of the characters and scenes of the town."}, {"userName": "Jenni Boyd", "userReviewDate": "Mar 22, 2015", "userURL": "http://www.goodreads.com/user/show/12380743-jenni-boyd", "userReview": "The story opens with a chilling scene of a woman bound and blindfolded, stripped bare of her clothes and dignity, exhausted from struggling, demoralised by the horrors inflicted upon her, she knows her death is imminent, but so desperately wants to live, determined to fight to the end, calling upon her mother for strength.When Kate Burkholder the Police Chief of Painters Mill Ohio, is called to the scene where the naked body of a woman has been dumped in the snow, there is no doubt in anyones mind that she has been tortured, but a mark that is left upon the woman's body sends another chill down Kate Burkholder's spine, sparking memories of a serial killer from sixteen years ago, 'The Slaughterhouse Murderer'.Kate is not only under pressure to catch a serial killer as the body count rises, but struggles with a dark secret from her past that links her to 'The Slaughterhouse Murderer', one that could not only destroy her, but her career if exposed. I really enjoyed this book, and was able to get a feel for all the characters. Linda Castillo kept me guessing as to who was the killer, finding it hard to put the book down has the story built to a crescendo until Kate finally unravels his identity, and suddenly finds herself at the mercy of this gruesome killer.I highly recommend this book, and will certainly be reading more of Linda Castillo's books."}, {"userName": "Bücherwunder", "userReviewDate": "Sep 26, 2016", "userURL": "http://www.goodreads.com/user/show/38110480-b-cherwunder", "userReview": "Nach all den positiven Stimmen musste ich einfach auch mit der Thriller-Reihe von Linda Castillo beginnen und ich wurde nicht enttäuscht. Ich mochte das Setting unter den Amish und auch Kate Burkholder als Ermittlerin fand ich interessant und sie hob sich von anderen Ermittlern durch ihre Geschichte positiv ab.Auch der Fall war spannend und ich wusste bis zur Enthüllung nicht, wer der Täter ist. Ich werde die Reihe also weiter verfolgen."}], "description": "When a serial killer strikes bucolic Painters Mill, Ohio, the killer's signature -—Roman numerals ritualistically carved into each victim's abdomen- —matches the MO of four unsolved murders from 16 years earlier. Police chief Kate Burkholder, who's reluctant to dredge up the past, must keep secret that she knows why the old murders stopped. Not satisfied with the case's progress, local politicos set up a multijurisdictional task force to assist, including a law-enforcement agent battling his own demons. The added scrutiny and the rising body count threaten to push the chief over the edge. Adept at creating characters with depth and nuance, Castillo smoothly integrates their backstories into a well-paced plot that illuminates the divide between the Amish and English worlds.", "title": "Sworn to Silence\n      \n          (Kate Burkholder #1)", "url": "http://www.goodreads.com/book/show/6115138-sworn-to-silence", "average": 4.0, "cover": "https://images.gr-assets.com/books/1388818184l/6115138.jpg", "reviews": 2615, "authors": [{"url": "https://www.goodreads.com/author/show/54958.Linda_Castillo", "name": "Linda Castillo"}], "type": ["Mystery", "Thriller", "Fiction", "Mystery", "Amish"], "outlinks": ["http://www.goodreads.com/book/show/6115138-sworn-to-silence", "http://www.goodreads.com/book/show/6602025-sworn-to-silence", "http://www.goodreads.com/book/show/6530859-sworn-to-silence", "http://www.goodreads.com/book/show/7005142-sworn-to-silence", "http://www.goodreads.com/book/show/6530858-sworn-to-silence", "http://www.goodreads.com/book/show/9329409-sworn-to-silence", "http://www.goodreads.com/book/show/9263190-die-zahlen-der-toten", "http://www.goodreads.com/book/show/6507440-sworn-to-silence", "http://www.goodreads.com/book/show/7315153-pray-for-silence", "http://www.goodreads.com/book/show/9954597-breaking-silence", "http://www.goodreads.com/book/show/13130847-gone-missing", "http://www.goodreads.com/book/show/16044965-her-last-breath", "http://www.goodreads.com/book/show/18404195-the-dead-will-tell", "http://www.goodreads.com/book/show/37581710-the-company-of-demons", "http://www.goodreads.com/book/show/40024832-empire-of-sin", "http://www.goodreads.com/book/show/8343548-the-bricklayer", "http://www.goodreads.com/book/show/40193155-among-the-wicked", "http://www.goodreads.com/book/show/23818400-the-snow-garden", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/23157833-almost-dead", "http://www.goodreads.com/book/show/33555347-crime-scene", "http://www.goodreads.com/book/show/30249521-fatal-frost", "http://www.goodreads.com/book/show/40266676-remains-of-innocence", "http://www.goodreads.com/book/show/34330657-finding-claire-fletcher", "http://www.goodreads.com/book/show/28824403-outfoxed", "http://www.goodreads.com/book/show/23957469-huntress-moon", "http://www.goodreads.com/book/show/40204087-the-deepest-secret", "http://www.goodreads.com/book/show/35115882-what-the-dead-know", "http://www.goodreads.com/book/show/40267317-ragdoll", "http://www.goodreads.com/book/show/35914878-pretty-dead-girls", "http://www.goodreads.com/book/show/40269681-zeroes", "http://www.goodreads.com/book/show/39791173-the-girl-before", "http://www.goodreads.com/book/show/40205081-last-witness", "http://www.goodreads.com/book/show/40205040-dead-weight", "http://www.goodreads.com/book/show/18903409-weekend-warriors", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/40193809-eye-for-an-eye", "http://www.goodreads.com/book/show/27239265-the-short-drop", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/17623604-you-only-live-twice", "http://www.goodreads.com/book/show/17377392-thunderball", "http://www.goodreads.com/book/show/17284593-casino-royale", "http://www.goodreads.com/book/show/17623578-for-your-eyes-only", "http://www.goodreads.com/book/show/40193858-the-cuckoo-s-calling", "http://www.goodreads.com/book/show/17304110-live-and-let-die", "http://www.goodreads.com/book/show/18780375-dr-no", "http://www.goodreads.com/book/show/40192926-black-flowers-white-lies", "http://www.goodreads.com/book/show/17379070-moonraker", "http://www.goodreads.com/book/show/18799804-diamonds-are-forever", "http://www.goodreads.com/book/show/40205231-the-spy-who-loved-me", "http://www.goodreads.com/book/show/17377384-from-russia-with-love", "http://www.goodreads.com/book/show/40243961-the-cape-refuge-collection"]}