{"ratings": 1363, "userreviews": [{"userName": "Elaine", "userReviewDate": "Sep 07, 2013", "userURL": "http://www.goodreads.com/user/show/23742503-elaine", "userReview": "This one did not do much for me. I wouldn't recommend it. I found most of the characters to be kind of irritating and several of them made some really questionable decisions. It bothered me how these supposed \"friends\" are also constantly trying to outdo each other by making fancier food. I suppose it could be a friendly competition, but it doesn't really feel like it. This was one of those instances where I cared what happened just enough to keep reading, but then once I was finished it was all right, I'm done with these people. I don't really care what happens to them now."}, {"userName": "Peace Maker", "userReviewDate": "May 15, 2018", "userURL": "http://www.goodreads.com/user/show/68702937-peace-maker", "userReview": "This is going to be short but I'll do my best. It starts off with a couple named Will and Fran that decided to throw a dinner party for New Years. They invited their closest friends and next door neighbor. The dinner party was such a hit that they decided to have one every month taking turns hosting. They called it Table For Seven. Will, Fran, Leland, Audrey, Mark, Jamie, and Coop. What started off as a good time slowly turned into drama for the Table of Seven. Relationships were destroyed and there was one death. But it wasn't all bad, we live and we learn. I love the way the book ended, this was a great read, I will be reading more of Whitney's books in the future😀"}, {"userName": "Keisha McCollum", "userReviewDate": "Jan 25, 2013", "userURL": "http://www.goodreads.com/user/show/4851224-keisha-mccollum", "userReview": "Table For Seven was a good read. The novel is about seven people that decided to start a dinner club. What starts out as a dinner club soon turns into an interesting turn of events. As each member gets to know more about each other they learn even more importantly about themselves. Fran and Will have what seems to be an idealistic marriage but over time it has turned into a less than ideal life together. Jamie and Mark are a blended family. Jamie has a tough time dealing with Mark who has had a previous marriage and spends lots of time with his stepdaughter. Jamie has growing suspicions that Mark's stepdaughter isn't the only person he is seeing when he is away. Audrey is a widow of seven years that lost her husband and isn't too excited about reentering the dating poll. Coop is a bachelor with sex appeal and a reputation with the ladies. Leland is a seventy-five year old widower that has years of wisdom and a great personality. All the characters come together to create an interesting read that keeps you captivated until the end."}, {"userName": "Vanina Jepperson", "userReviewDate": "Apr 02, 2017", "userURL": "http://www.goodreads.com/user/show/55892122-vanina-jepperson", "userReview": "This was a quick, easy read. I enjoyed some of the story but overall found the characters and life situations very superficial. The story is about a group of friends that decide to have a monthly dinner party where they rotate who hosts the party. I loved reading the monthly menus but I wish they would have spent more time on the foodie side of the book as it seemed to me like that side went somewhat underdeveloped."}, {"userName": "Charlotte", "userReviewDate": "Apr 20, 2013", "userURL": "http://www.goodreads.com/user/show/650832-charlotte", "userReview": "http://charlotteswebofbooks.blogspot....Table For Seven was a nice leisurely read. The characters seem a bit more three dimensional than some \"fluffy\" books, but don't seem to take themselves to seriously. I enjoyed watching the relationship between Coop and Audrey develop and I was rooting for them the whole way. And I really enjoyed Leland, the retired neighbor. He was a unique character added to the mix and I am glad the author introduced him to us. The ending was good, without being too predictable, which sometimes happens. Bottom line, if you are looking for a good book for a leisurely afternoon read, then you would likely enjoy Table for Seven. It will hold your interest and connect you to the characters without being too strenuous or emotional, so pretty much perfect for a lazy afternoon"}, {"userName": "Katherine", "userReviewDate": "Oct 26, 2012", "userURL": "http://www.goodreads.com/user/show/4105926-katherine", "userReview": "Whitney Gaskell is one of the better women's fiction/'chick lit' writers I've read. Her characters, their conversations and their relationships are relatable and well written. And I have to admit that I literally laughed out loud during some of this book (in a good way, not a bad way). Will definately be a book I recommend next year."}, {"userName": "Amy", "userReviewDate": "Apr 04, 2013", "userURL": "http://www.goodreads.com/user/show/16048908-amy", "userReview": "I loved this story! I am so glad won a first-reads copy of it. It was a wonderful story of friendship, romance, and life in general. It was a light read, moved at a fantastic pace, and as a foodie myself, I appreciated the culinary details the author included. I definitely would recommend this book and will share the copy with many friends."}, {"userName": "Beth", "userReviewDate": "Aug 30, 2013", "userURL": "http://www.goodreads.com/user/show/284410-beth", "userReview": "Focuses in the dynamics of a supper club -2 couples in challenging marriages, a young widow, a ladies man, and an elderly widow. Each take a turn preparing and hosting a dinner. Each chapter is preceded by a delicious sounding menu - alas, no recipes! Reads like: The Blue Bistro by Elin Hilderbrand"}, {"userName": "Irina", "userReviewDate": "Jul 29, 2013", "userURL": "http://www.goodreads.com/user/show/6431549-irina", "userReview": "This book took my a day to read. I thought it was a good book and I would recommend it. It actually made me feel emotions.. I don't always have emotions for books. The writing was not flat. I will look at other books from Whitney Gaskell in the future."}, {"userName": "Yasmin", "userReviewDate": "Jul 02, 2013", "userURL": "http://www.goodreads.com/user/show/687724-yasmin", "userReview": "Predictable read about two couples and their single friends (one male, one female) and the standard issues of life...marriage, family, blended families, ex-spouses...really no new terrain covered. Quick, easy read for a lazy day at home or the beach. The dinner parties/menus were a nice addition."}, {"userName": "Linda Klager", "userReviewDate": "Oct 10, 2017", "userURL": "http://www.goodreads.com/user/show/30001467-linda-klager", "userReview": "The reasons I wanted to read this book were:1. The title of the book was interesting.2. The cover of the book was illustrated very well.3. I liked that each month 7 people got together. Each hostess or host would prepare a meal to share with these friends.4. These 7 people drew closer together because of their monthly gatherings.The only thing I did not like about the book was all the heavy drinking involved each time these friends got together. I was glad that the love scenes were not descriptive."}, {"userName": "Kelly", "userReviewDate": "Oct 08, 2017", "userURL": "http://www.goodreads.com/user/show/25364556-kelly", "userReview": "A satisfying experienceThis story is written with exceptional skill. Despite the wide number of characters, the individuals central to the story are well developed and original. Each character is distinct and memorable.As the group meets every month for dinner, they grow closer and new friendships develop. This was an absorbing tale, written well. I hated to see the book end."}, {"userName": "Jenny Beasley", "userReviewDate": "Jan 21, 2017", "userURL": "http://www.goodreads.com/user/show/56235251-jenny-beasley", "userReview": "I picked this up from the front display in my library on a whim, and was thoroughly surprised at how much I enjoyed it. The characters were well developed and very relatable. Despite the fact that it took place over a year's time, the storyline flowed easily and I found myself wanting to know what happened to each of them."}, {"userName": "Crystal", "userReviewDate": "Mar 25, 2018", "userURL": "http://www.goodreads.com/user/show/3435574-crystal", "userReview": "I really enjoyed this book. The characters were all very easy to relate to. I am looking forward to reading more from this author."}, {"userName": "Charlotte Maxwell", "userReviewDate": "Dec 23, 2017", "userURL": "http://www.goodreads.com/user/show/31918416-charlotte-maxwell", "userReview": "I enjoyed this book. The characters and relationships were well done. A pretty quick read."}, {"userName": "Molly M", "userReviewDate": "Jun 05, 2018", "userURL": "http://www.goodreads.com/user/show/75699198-molly-m", "userReview": "This book was amazing!! There were twists and turns at every corner. I really felt connections with the characters. Gaskell is an amazing author, she is one of my favorites."}, {"userName": "Summer", "userReviewDate": "Aug 28, 2017", "userURL": "http://www.goodreads.com/user/show/39824342-summer", "userReview": "Really enjoyed this book. Characters were engaging and the plot moved forward nicely. Great descriptions of food and cooking technique were a bonus."}, {"userName": "Emma", "userReviewDate": "Apr 17, 2018", "userURL": "http://www.goodreads.com/user/show/76171163-emma", "userReview": "A great beach time book. It was interesting, but typical story line. Good writing, but properly won't recommend."}, {"userName": "Kathy", "userReviewDate": "Oct 06, 2017", "userURL": "http://www.goodreads.com/user/show/10988685-kathy", "userReview": "The idea of a dinner club with friends made this book enjoyable. The characters were well developed but the story lacked luster"}, {"userName": "Cyndi", "userReviewDate": "Apr 27, 2018", "userURL": "http://www.goodreads.com/user/show/4418536-cyndi", "userReview": "This was good..a story about couples and families and what goes on behind closed doors. A good read"}, {"userName": "Leslie", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/5818251-leslie", "userReview": "great little story....maybe instead of book club we should have a monthly dinner club?"}, {"userName": "Shannon Bell", "userReviewDate": "Sep 23, 2017", "userURL": "http://www.goodreads.com/user/show/40143199-shannon-bell", "userReview": "Table for SevenI didn't want this book to end! It offered a unique setting into a year in the life of seven very interesting, imperfect people."}, {"userName": "Book Binge", "userReviewDate": "Aug 01, 2013", "userURL": "http://www.goodreads.com/user/show/1660591-book-binge", "userReview": "I’ve read and enjoyed Whitney Gaskell’s writing before, so I was looking forward to reading Table for Seven.It features two couples and three single friends. Bring everyone together is Fran and Will Parrish. They’re having a New Year’s Eve party and in an effort to do something different, Fran preps a multi-course meal to count down to midnight. She’ll serve one course on the hour leading up to midnight. No one really wants to go, but they end up having so much fun they decide to start up a very informal dinner club, with someone different hosting every month.I thought this was a very interesting set up. And with so many characters, the story flowed very well. There was no confusion of who or what because each person is going through something very different. Will and Fran have been married for just under 20 years. Fran’s world is rocked that New Year’s day when Will tells her to invite Cooper, his best friend. You see, Fran and Cooper had a moment very early on in her marriage. Nothing happened…but she thinks if Will hadn’t woken up when he did that day on the boat that Cooper would have kissed her. Ever since then, she’s kind of had a little teeny tiny flame going for Cooper. They haven’t seen him too much over the years and she’s excited to learn he’s moved to their coastal town. Maybe too excited?The other couple is Jaime and Mark. She’s his second wife and she’s struggling with Mark’s schedule and his daughter’s demands on his time. They have two young children together but she feels Mark is always off for Emily’s tennis practice or tournaments. She thinks it’s too much time and wonders if that’s all he’s doing.Audrey is Fran’s best friend. She owns a successful spa and she’s been a widow for 7 years. She’s sick of Fran’s attempts to set her up. Fran knows this so when she invites Audrey to that first dinner party, she doesn’t want Audrey to think she’s setting her up with Coop so Fran tells her he’s gay. LOL That led to a few funny moments. But Audrey has trouble opening up. Her first husband was an alcoholic and she’s refused to see the truth of her marriage…and that’s preventing her from opening up to anyone new. Coop hasn’t had a real, long-term relationship ever in his life. He’s definitely a bachelor through and through and he’s definitely intrigued by Audrey (especially at first when she was super friendly with him, thinking he was gay). But she refuses to date him and his persistence definitely challenges both of them and their beliefs about relationships.The seventh member of the group is Leland. And he was my favorite. He’s a retired judge, in his 80s and he was a great character. He was a great observer of the group dynamics and he gave gentle nudges where they were needed. He loved bacon. Cute character.So yeah, there were a few interesting things going on with this book. With Fran and Will, I was caught up in Will’s obliviousness to what was going on with his wife. She was taking better care of her appearance and working out and dressing better. Everyone noticed but Will. So her getting caught up in a fantasy flirtation with Cooper makes sense. And then you realize she’s getting ready to make a move and you just feel so bad for her, because you know he’s fallen for Audrey. And Audrey is so the opposite about being open with her feelings, she doesn’t even tell her best friend she slept with the guy. LOL I also enjoyed Jaime’s path she took. She was so sure her husband was cheating on her she even followed him at one point and there was nothing to see. She really matured as a character. Same with Audrey. She really didn’t want to deal with what happened with her husband and it was preventing her from moving on. It was so easy for her to rebuff Coop’s charm…something that made him try harder, something he hasn’t had to do in a while.I liked all the characters (except one…and no one cared for him either) and I liked the way all the stories unfolded. Because the author did a good job of giving us pieces of each story I read this pretty quickly. It was very engaging and I recommend it for when you need a break from all the New Adult you’re reading. LOLTable for Seven gets a 4 out of 5 from me.This review was originally posted on Book Binge by Tracy."}, {"userName": "tbears", "userReviewDate": "Mar 06, 2017", "userURL": "http://www.goodreads.com/user/show/1266127-tbears", "userReview": "I think I really enjoyed this book because it time for some fluffy chick lit for me. It was an easy read and I have a penchant for stories revolving around friendships."}, {"userName": "Kim", "userReviewDate": "Apr 15, 2013", "userURL": "http://www.goodreads.com/user/show/19464014-kim", "userReview": "On New Year’s Eve Fran and Will Parrish host a dinner party for a few of their friends and have the idea that they will serve a course on the hour every hour until midnight and so the party begins. All the guests have a lovely time and agree that this is a great way to spend an evening. That is when the Dinner for Seven Club is born. As time goes by and the dinner parties become monthly events, it soon becomes clear that there is much more going on in the lives of the Table for Seven Club members than it first appears. Will and Fran’s marriage seems rock solid, but, the strain of dealing with an uncommunicative teenage daughter and what seems to be the methodical, uneventful passing of the years starts to produce cracks in their relationship. Audrey, is usually the target of Fran’s well intended match making but she needs to find her own way to move on after being widowed seven years previously. Audrey and Fran’s perfectionist friend, Jamie, the second wife of Mark, suspects him of having an affair. Will’s oldest friend, Coop, is a confirmed bachelor and doesn’t know how to handle being in love so steers well away from it. Will and Fran’s neighbour, Leland, a retired Judge, enjoys the company. It is a change for him to spend time with younger people and he brings wise counsel and insightful guidance to the group. The Dinner for Seven Club changes all of their lives forever.This is a lovely book about friendship, relationships, love, emotional support and of course, food! Whitney Gaskell weaves the characters together perfectly and it is instantly clear how each person is connected to the other. As the story develops so the relationships between them all change and grow. Some bonds get stronger, some start to fracture and some break altogether. It is because of the prose and realistic conversation that this book is so enjoyable. It is funny and poignant at times and provides the reader a great way to escape for a few hours. Table for Seven is the first book of Whitney Gaskell’s I have read and it will not be the last. I checked out her website to see what else she has written and found that she writes a really funny blog too. I love her sense of humour, wit and the frequent, seething road rage she feels when in the school drop off queue. She doesn’t mind using the odd profanity to make a point clearer and sharper, which in my mind puts her right into the “my kinda gal” category. Check out her website here: http://whitneygaskell.com Table for Seven will be released in April 2013 and is available for pre-order on Amazon.comTable for Seven: A NovelWhitney Gaskell"}, {"userName": "Sabriena", "userReviewDate": "Mar 02, 2013", "userURL": "http://www.goodreads.com/user/show/5325245-sabriena", "userReview": "Table For Seven was a delicious story of a group of friends who begin a dinner club party after Fran and Will host a dinner party for New Year’s Eve. The group of friends had so much fun that they decided to make it a monthly thing. You get to see the menus in the beginning of each month, each couple (or single) has everyone over and cooks for them. They take a turn so it isn’t a big deal. The food seemed absolutely delicious although I loved Leland’s menu the most as it seemed more I could relate with.Each person or couple had a set of problems they were dealing with such as Fran and Will, having to face their marriage turning stale. Jaime and Mark, the thought of an affair in the mix. Coop, who is single and seems to fall for also single Audrey. Audrey who is still getting over the death of her husband 7 years prior and isn’t ready to date or fall in love. Loveable Leland who is a widower himself and also seems to be the guy that dishes out the very wise advice when people need it.I kind of wished there was more of Leland in it because I really enjoyed his parts. There was a lot of foreshadowing about what his end would be but it still had me in tears anyway. I really liked following the different couples problems and anyone that has been in a relationship for any amount of time has faced a majority of the issues touched on in Table for Seven.The only problem that I had with a good majority of the book as well as their dinner parties was that they drank so much wine and alcohol during these dinner parties but yet, there was really no mention except towards the end on how they made it home in one piece. It bugged me a bit. It was mentioned some times that the others were driving someone home, someone had started on water earlier in the evening and things like that.Jaime and Mark’s situation was the most surprising to me, not because of what happened but rather who was involved. Fran and Will, they were a little different and it is a common thing to take your marriage for granted and I liked that it shows that you have to keep working at it and not let it go stagnant or someone might stray.In the end, the book was fantastic and made me hungry! I had no problems visualizing the food they were eating because the details were there. I loved the menu’s at the front of the chapters, I thought it gave it a fantastic touch. This is definitely a book anyone can relate to and love. Highly recommend it."}, {"userName": "Becca", "userReviewDate": "Jun 19, 2013", "userURL": "http://www.goodreads.com/user/show/16209653-becca", "userReview": "I got this book for free in a Goodreads First Reads giveaway.I loved this book. I loved how the food sounded so detailed and how it sounded so good. I loved how the characters interacted with each other. I loved how everyone in the book got along until the end. Let's start with the characters. Will and Fran are married and they have two kids, Iris and Rory. Iris is tough to handle, with her dating a senior in high school and getting arrested in the book. Jaime and Mark are married, but I was mad and sad when they got divorced in the end of the book. I was mad at Mark for cheating on Jaime with his ex wife, who always barged into things that didn't involve her. Mark even talked bad about his wife, so he didn't seem like he was having an affair with her. Mark and Jaime have two children, Logan and Ava. Mark had a child with his ex wife, Libby, and her name is Emily. Emily is obsessed with Tennis, which makes Mark obsessed with it too. Leland is an old man that is widowed. He can cook, and he has a dog that snores. Audrey is also a widow. Her drunken husband died in a car accident seven years earlier, and Audrey still grieves him. Lastly, Coop (Preston Cooper) is a flirt. He's dated many girls, and is known by being self-centered. In the end of the book, Fran has a crush on him and almost ends her marriage with Will. Let's get to what happens in the book. The characters start the dinner club at the New Year's Eve party hosted by Will and Fran and call it the Table For Seven. Each of the members and their spouses take turns on hosting the dinner club. All goes well so far. Well, not exactly. Mark starts cheating on his wife with Libby, his ex wife. This ends their marriage. Leland gets a heart attack or a stroke and dies at the end of the book, and Audrey takes his dog and takes care of it. Coop falls in love with Audrey and they get together as boyfriend and girlfriend. Fran falls in love with Coop, but Coop isn't in love with her and turns her down. Fran feels bad and goes to confess to her husband. Will isn't sure he wants to be with Franny anymore. Iris, Will and Fran's daughter almost gets arrested by driving without a license and speeding. She doesn't go to jail but instead has to do community service.I hope you enjoy my review and the book Table for Seven by Whitney Gaskell!"}, {"userName": "Helen Barlow", "userReviewDate": "Mar 29, 2013", "userURL": "http://www.goodreads.com/user/show/18846512-helen-barlow", "userReview": "Originally published on my blog My Novel OpinionThe Table for Seven Dinner Party Club is established when Will and Fran, a seemingly happily married couple, host a New Year's Eve dinner for some close friends. Their neighbors Jaime and Mark, parents to two young children, as well as Mark's daughter from his first marriage. Audrey, Fran's friend who is finding her way as a young widower following her husband's untimely death. Will's handsome, destined to be a life-long-bachelor friend, Coop, is invited so that Audrey doesn't feel awkward with being the only single person at the dinner party. Finally, Fran also invites Leland, their elderly neighbor, upon realizing that Audrey may think she is being setup with Coop.As the months go by, we learn that Will and Fran's marriage perhaps isn't as happy and perfect behind closed doors as their friends are led to believe. Jaime is convinced that her husband Mark is having an affair and proceeds to follow him in an effort to prove herself wrong. Audrey wonders if she will ever be able to love again, and she tries to learn how. Coop's bachelor, chain-dating lifestyle may be coming to an end, as he finds someone he can't live without. And Leland offers words of wisdom and insights in to the others lives that they are too close to see themselves.Can Fran and Will's marriage be saved? Is Mark having an affair and who with? Can Audrey take a chance and stop idolizing her not so perfect dead husband? These are just some of the questions I was asking throughout reading TABLE FOR SEVEN and hoping that I got the answers I wanted.Whitney Gaskell has developed characters that feel very real, and which almost anyone can relate to. The entwining of the every day lives of seven people was captivating and left me wanting to read more as I came to the end of each chapter. The end offers closure, and I was satisfied with the outcome of each of the characters storylines. One other aspect of the book that I liked was the listing of the dinner party menu at the start of each chapter...now if only recipes were included too."}, {"userName": "Charlene", "userReviewDate": "Sep 23, 2013", "userURL": "http://www.goodreads.com/user/show/6087199-charlene", "userReview": "probably 3.5, if not a 4-star.I saw this book somewhere and ordered it through the local library. The author really liked to tell how meals were prepared as she narrated the chapters, each with a complete menu as the heading. The book, set in Florida, begins when one couple decided to have a dinner party on New Year's Eve.Because they did not want to seem to be setting up their widowed friend, they included an elderly widower and a forty-something single man, along with another couple, as their holiday guests. All the people, except for the elderly gentleman, were in their forties.It took a while for me to get the characters in the two marriages and their situations in mind. While each chapter was based on one of the monthly meals that followed their New Year's Eve Dinner, the reader was invited into the lives of the people between times -- their jobs, their families, and so forth. By the middle of the book, the actions of each individual and the relationships among the seven became quite interesting as their times together were reflected between the monthly get-togethers. The \"Table for Seven\" group took the summer off and began again in the fall. Relationships began, ended, faltered, and some were reconfigured. Most of the narratives about their lives seemed believable and sounded like authentic possibilities. From the author, there was an economy of words used, never did any part seem overstated. Although it was not a difficult read, it did require some thinking about the consequences of thoughts and actions among friends. I liked most of the people in the group, and I was not quite ready for the book to end. I will definitely want to read something else written by Whitney Gaskell, since TABLE FOR SEVEN was my first encounter with her books."}, {"userName": "Patty", "userReviewDate": "Oct 13, 2013", "userURL": "http://www.goodreads.com/user/show/2281353-patty", "userReview": "Table For SevenByWhitney GaskellMy thoughts before reading this book...Not sure I wanted to read this couples dinner club drama...but...it surprised me and I loved it!My thoughts after reading this book...This book takes place in a sweet Florida community. Friends and neighbors sort of accidentally decide to start a casual monthly supper club. The dinners starts out casually but eventually the menus and wines get more and more complicated. Home chefs begin to want to outdo each other in a gentle way. They still have fun but they are just a bit competitive. The menus will make you yearn to start a supper club of your own. The couples are going through various stages of ups and downs with their relationships and these are fun and complicated. Fran and Will have lost their spark and are dealing with a really difficult 13 year old daughter. Coop is Will's BFF and Fran thinks she wants to have a fling with him. Audrey is recently widowed and Coop is interested in her. Leland is an elderly fragile widowed gentleman...the friend everyone loves. Jaime and Mark...this is Mark's second marriage...have two new children and issues with his daughter from his first marriage. He has also begun spending too much time away from home. This is truly just the beginning of all of these issues!What I loved about this book...I loved the dinners, the problems, the characters. Everything felt real. What I did not love...Not one thing!My final thoughts about this book...I have looked at this book for months and finally something made me want to read it. It was fun, delightful and written in a lovely and appealing way."}], "description": "On New Year’s Eve, Fran and Will Parrish host a dinner party, serving their friends a gourmet feast. The night is such a success that the group decides to form a monthly dinner party club. But what starts as an excuse to enjoy the company of fellow foodies ends up having lasting repercussions on each member of the Table for Seven Dinner Party Club.Fran and Will face the possibility that their comfortable marriage may not be as infallible as they once thought. Audrey has to figure out how to move on and start a new life after the untimely death of her young husband. Perfectionist Jaime suspects that her husband, Mark, might be having an affair. Coop, a flirtatious bachelor who never commits to a third date, is blindsided when he falls in love for the first time. Leland, a widower, is a wise counselor and firm believer that bacon makes everything taste better.Over the course of a year, against a backdrop of mouthwatering meals, relationships are forged, marriages are tested, and the members of the Table for Seven Dinner Party Club find their lives forever changed.", "title": "Table for Seven", "url": "https://www.goodreads.com/book/show/14838452-table-for-seven", "average": 3.58, "cover": "https://images.gr-assets.com/books/1344371744l/14838452.jpg", "reviews": 166, "authors": [{"url": "https://www.goodreads.com/author/show/116611.Whitney_Gaskell", "name": "Whitney Gaskell"}], "type": ["Womens Fiction", "Fiction", "Romance", "Womens Fiction"], "outlinks": ["http://www.goodreads.com/book/show/14838452-table-for-seven", "http://www.goodreads.com/book/show/17409096-table-for-seven", "http://www.goodreads.com/book/show/16113429-table-for-seven", "http://www.goodreads.com/book/show/199911.True_Love", "http://www.goodreads.com/book/show/561748.Mommy_Tracked", "http://www.goodreads.com/book/show/2956997-good-luck", "http://www.goodreads.com/book/show/499087.Testing_Kate", "http://www.goodreads.com/book/show/561747.Pushing_30"]}