{"ratings": 450, "userreviews": [{"userName": "Cara", "userReviewDate": "Oct 09, 2009", "userURL": "http://www.goodreads.com/user/show/2021933-cara", "userReview": "I've read and liked a few others by this author, but in this one, the stupidity overwhelmed the \"fun read\"ness. Here are a few flaws that totally defeated my willfull suspension of disblief:- Deidre and her arch-enemy Marla go on tv together. Marla slips on the wet floor and ends up falling down and getting covered with cake batter. Later, Marla gets her revenge by loaning Diedre a too-tight dress, which rips while Deidre is wearing it at a fancy shindig. Stoooooopid.- Deidre gets pregnant. Her gay best friend comes over for lunch one day and noticies. Yet her fabulous wonderful caring boyfriend, who presumably eats with her regularly and sees her naked on occasion, completely fails to notice anything amiss for nine weeks! But they have a fabulous relationship and he's the bestest man EVAR.- Deidre's business completely falls apart AND she gets in a car wreck. Yet she doesn't call Mr. Fabulous to let him know any of this. He's not mad or hurt when he finds out he had no clue about the major events in her life. But we're still supposed to believe they have this great relationship. Does not compute.- The final conversation of the book, which can be summarized thus:Kevin: Will you be my wife?Deidre: Yes. Will you be the father of my child?Aside from the remarkably clunky way Deidre words her question, it's completely stupid. The guy already is the father of her child, and has been for nine weeks. He just didn't know it. I get what she was trying to say, but this couldn't have been expressed more awkwardly.There were still fun parts of the book, but overall Deidre comes across as an idiot with low self-esteem. Furthermore, most of the plot complications in this book are straight out of junior high. Kevin's sister calls in his ex to try to break up the relationship? Really?? Come on."}, {"userName": "Leah ", "userReviewDate": "Aug 28, 2009", "userURL": "http://www.goodreads.com/user/show/2432818-leah", "userReview": "I was disappointed with this book - definitely not as good as the first! Deidre in \"Good Things\" was a strong, businesswoman who went after what she wanted. Deidre in this book got wishy-washy, jealous that her boyfriend was spending time with a beautiful womand and impulsive. I also did not like that she got pregnant AT ALL. What was the point of that? I felt like there were too many story lines and none of them were developed well."}, {"userName": "Staci", "userReviewDate": "Aug 08, 2009", "userURL": "http://www.goodreads.com/user/show/177641-staci", "userReview": "I loved her first book, Good Things, which introduced me to Deidre McIntosh and she quickly became a character that I really felt an affinity to. I was happy to hear that King decided to write a sequel to tie up the loose ends from her first book. I again, loved Deidre, but there were times when I felt the writing wasn't as tight as it should've been and that this was written as an after-thought. Don't get me wrong, it's a fun book to read. But, the plot was cliche at times and I know King can do so much better than that. I know it feels like I'm thrashing this book doesn't it???.....I'm really not trying to be negative, I enjoyed it, but I wish it would've matched the first one in the caliber of writing."}, {"userName": "Keri Daskam", "userReviewDate": "Sep 16, 2009", "userURL": "http://www.goodreads.com/user/show/2446230-keri-daskam", "userReview": "This book was pretty much meaningless. But it was fun and nice."}, {"userName": "Emily", "userReviewDate": "Aug 03, 2011", "userURL": "http://www.goodreads.com/user/show/5001610-emily", "userReview": "Predictable yet satisfying. A good read while traveling."}, {"userName": "Carrie Turner", "userReviewDate": "Aug 13, 2017", "userURL": "http://www.goodreads.com/user/show/7496016-carrie-turner", "userReview": "Predictable."}, {"userName": "Gaby", "userReviewDate": "Aug 15, 2009", "userURL": "http://www.goodreads.com/user/show/1185483-gaby", "userReview": "Synopsis:Mia King's Table Manners opens just a few months after the first novel, Good Things, ended. Deirdre has her television show up and running but her gourmet cookie line is stalled in production. Deirdre's friend William is preparing for his commitment ceremony with his live-in partner. Lindsay is recovering from illness but has lost interest in her diner Wishbone. While Kevin and Deirdre are still very much in love, the sudden appearance of Kevin's ex-fiancee Sabine causes Deirdre anxiety. Is Deirdre's happy ending starting to unravel?Review:I had loved Good Things and was so excited to read the sequel Table Manners. But just as I was about to start, I was worried that I wouldn't enjoy the sequel as much as the first book because Good Things was just so fun. I couldn't see how Mia King could add to Deirdre and Kevin's love story. I was wrong again!Mia King does just that! In Table Manners Deirdre continues to care for her many friends, bond with Kevin's family, and support Kevin with the same humor and spirit that endeared her to readers in Good Things. Meanwhile, Sabine and Marla Banks add just enough spice to the story for us to worry.If you enjoy books that incorporate food into the plot, you'll love that food is an important part of the story in Mia King's books. As in Good Things, this book includes recipes of dishes mentioned in the novel. Here are some of the recipes you'll find: Leek and Proscuitto Tart, Summer Beef Bourguignonne Skewers, Pan-Seared Rainbow Trout with Warm Summer Tomato-Olive-Caper Salad, Hunan-Style Marinated Lamb Lollipops with Nicoise Vegetable Ragout, Ricotta Cheesecake with Fresh Seasonal Fruit, Green Tea Tart with Lychees and Raspberries, Macarons Chocolat, Sparkling Pomegranate Lemonade, Lemongrass Green Tea, Lychee Martini with Crystallized Ginger.I highly recommend Table Manners to anyone looking for a fun love story. It's a great summer read! If you haven't read Good Things yet, start the love story from the beginning. Here's the link to my review of Good Things http://startingfresh-gaby317.blogspot...Publisher: Berkley Trade (August 4, 2009), 336 pages.Courtesy of the author and publisher."}, {"userName": "Lydia Laceby", "userReviewDate": "Feb 21, 2010", "userURL": "http://www.goodreads.com/user/show/3322071-lydia-laceby", "userReview": "I enjoyed this single girl tale. It was well written, full of mouth watering recipes (there’s even a recipe section in the back) and I enjoyed the character and her adventure, however this book just didn’t grab me and I thought this it was relatively average.We follow Deidre McIntosh as she’s working on developing her own cookie line while navigating her boyfriend’s wealthy family where she doesn’t quite fit in, especially around his sister who becomes determined to see the back of her.This is chick lit with a heroine who has drive and determination and a career she loves. There are laugh out loud moments and some mouth watering descriptions of high end cookies and meals she creates. I got the impression throughout the novel that Deidre would have landed on her feet if she was unsuccessful at saving her new company, her man and/or both and I found that refreshing, while at the same time I don’t think it gave me enough to latch onto. The stakes didn’t seem particularly high maybe.I didn’t get sucked in or emotionally involved as I would have liked to and although I had fun watching Deidre flounder to try and save all that was dear to her, I just wasn’t blown away by this novel.I thought Table Manners was a solid 3 Star. I didn’t hate it and would gladly read another of Mia King’s novels, but I didn’t adore it either, so it’s smack dab in the middle. ***After updating my Goodreads review and reading the other reviews, I found out this novel is a sequel. Who Knew? Certainly not myself nor my review partner when we ordered it, nor me when I read it. Maybe that's why I felt something was missing? I just pulled out the book and it doesn't state it anywhere. How aggravating because I certainly would have read them in order had I known."}, {"userName": "Mary", "userReviewDate": "Jun 17, 2009", "userURL": "http://www.goodreads.com/user/show/254596-mary", "userReview": "From the moment I finished reading Good Things by Mia King I've been keeping an eye out for the sequel. I finally got my hands on a copy of Table Manners and am pleased to tell you that Ms. King gives readers a sequel that is sweet, fun and satisfying.Deidre's life, although good, has become hectic. She's helping her friends William and Alain plan their commitment ceremony; launching a new pastry line; and then travels to help another friend in dire need of her assistance in Jacob's Point (a small lakeside community and location of Kevin's vacation home). Toss into the mix Kevin's ex-fiancee and you've got a recipe for disaster.Will Deidre and Kevin's relationship survive the challenges and obstacles in their path? Well, you'll just have to find out for yourself. Table Manners could be a stand alone novel but I recommend reading Good Things first. You'll want to read about Deidre and Kevin from the very beginning. One more thing: stock your pantry because you're probably going to want to bake or cook after reading these books. There are recipes!"}, {"userName": "Jenny", "userReviewDate": "Apr 14, 2013", "userURL": "http://www.goodreads.com/user/show/1332648-jenny", "userReview": "This was a good, mindless read. Somewhere in the first few pages, I thought to see if this was a sequel - which it is - so then I felt like I was coming into the story halfway through. (Which I hate - I'm always that person to start a series from book #1 and go through them chronologically.)At points this was ridiculous. When an author jumps between characters irregularly or too frequently, it seems amatuer, like the author doesn't have enough character development or plot to drive one character's perspective and needs to jump to others to fill in plot. (I had a similar compaint in Before You Know Kindness.)I couldn't quite figure out the point of the book. I guess it was the success of Sweet Deidre? And the \"excerpts\" from Rosemary's gossip column were stupid. Does the world REALLY care that much about this chef? Not even the Iron Chef warrants a gossip column and this woman is far less famous."}, {"userName": "Becky R.", "userReviewDate": "Aug 13, 2009", "userURL": "http://www.goodreads.com/user/show/1836567-becky-r", "userReview": "I really have grown to love Mia King's clear writing style and voice. This style really helped me learn to love her main character, Deidre even more in book two. The one part I found surprising and satisfying was Deidre's reactions to really difficult situations or strife. In my head I could see the main character lashing out, showing what a strong woman can do, but Deidre didn't need to do that. Somehow this character continued to make choices that felt low impact, not as emotionally ridden as I would have thought the author would take them. I kept waiting for tears, yells, or quiet wallowing. Instead, Deidre methodically faced her circumstances, and I really admired that. Also, even though I felt like I sometimes knew the storyline, it still surprised me. For me, I found Mia King's second novel to be a fun, sweet success!"}, {"userName": "Connie", "userReviewDate": "May 30, 2012", "userURL": "http://www.goodreads.com/user/show/5364077-connie", "userReview": "Deidre McIntosh was developing a new line of cookies after starring in a successful cooking show on TV. She was also seeing Kevin Johnson, a successful wealthy bachelor. Life seemed good until she had to deal with Kevin's sister who does not want her to be a part of Kevin's life. Then, Kevin's ex-fiancee comes back to town. On top of that, her cookie line is not getting rave reviews from the test audience.I felt that some of the characters seemed like caricatures, especially Kevin's sister who resembled Cruella de Ville. There were quite a few of the story elements that seemed very predictable, such as when Deidre is googling on her cell phone when driving and gets into an accident. It's a light read, but there are more entertaining chick lit books out there to take to the beach."}, {"userName": "Jenn O'Brien", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/2054052-jenn-o-brien", "userReview": "I enjoyed this sequel as much as I did the original. The characters are not stagnant, they are growing and changing in a natural progression, they are facing new problems and challenges, which makes it a fun read. My only question is what happened to Claire? Except for one sentence mentioning her, she has all but disappeared from the family.I’m glad the reader learned more detail and background about characters who were background in the first book. Several new characters were introduced in this book and some of the storylines were left dangling - paving the way to a third book in the seriesI like the sparring between Deirdre and her frienemy Marla. If there is a third book, it is going to be interesting to see Marla’s reaction to “the news.”"}, {"userName": "Kathryn", "userReviewDate": "Apr 25, 2010", "userURL": "http://www.goodreads.com/user/show/2600090-kathryn", "userReview": "I discovered Mia King about three years ago and I find her such a refreshing author. This is the sequel to Good Things and it was just a fun read. The books have recipes and are light and believable. They take place in Seattle which I love as I lived in that area for close to 30 years. I emailed her after reading Good Things and she replied so warmly and we discussed her coming to eastern Washington on her book tour. She's not made it, but I understand she's got a new book coming out, so maybe then!!"}, {"userName": "Kelly Olexa", "userReviewDate": "Apr 30, 2010", "userURL": "http://www.goodreads.com/user/show/3570157-kelly-olexa", "userReview": "This book is the sequel to Good Things and was just as charming. I definitely enjoy books that weave in any storyline around food/cooking/entertaining and this is no exception. I'm so glad to have discovered Mia King- I think she is a fantastic writer, good stories that are essentially a \"romance\" and perhaps a dash of \"chick lit\" but it feels several steps above that. The story line seems REAL. I love a good chick lit book but sometimes the story can get so outrageous it can be insulting to one's intelligence. I definitely LOVE Mia King, as a nice light but addicting read with real characters - characters that could easily be plucked out of my own life."}, {"userName": "S", "userReviewDate": "Aug 10, 2009", "userURL": "http://www.goodreads.com/user/show/1839488-s", "userReview": "This is an enjoyable quick chick lit novel. However I feel as though it is a sequel, since it appears that there were references to a previous time without much back story. Might be worth it to find the previous book.Deidre, the protagonist, just seems to have lots going on in the right direction - she is about a cookie line, she purchased a condo, and she's dating one of the richest men in Seattle. Then things start to go in the wrong direction - focus groups don't like her cookies and then her boyfriend's ex-fiancee returns to the picture. All this on top of planning her best friend's commitment ceremony."}, {"userName": "Heather", "userReviewDate": "Aug 13, 2010", "userURL": "http://www.goodreads.com/user/show/1215183-heather", "userReview": "Using every girly cliche in the handbook, Mia tells a woefully predictable tale of middle-age second chances. This book filled the time, alright, but its unimaginative cast of stereotypical characters (the gay male friend who gets overly excited about food! The shady ex-girlfriend! The scheming, not-what-she-seems sister-in-law! Burf.) made me throw the book down more than once and ask my husband, \"God, why do I READ this crap?\"That being said, I did finish this book, which is better than I can say for some books."}, {"userName": "Betsy", "userReviewDate": "Aug 09, 2010", "userURL": "http://www.goodreads.com/user/show/3709956-betsy", "userReview": "This book seemed very forced, even from the very beginning. The character's story lines did not mesh well, creating a disjointed storyline that lead to confusion. I was also startled to find multiple typos that should have been caught during the editing process. I probably wouldn't really recommend reading this book to most friends. I was about 60% of the way through this book, and considered putting it down. I really wish the author had broken this book into two stories, because the character story lines were just too much of a stretch to intermix."}, {"userName": "Kendra", "userReviewDate": "Apr 18, 2013", "userURL": "http://www.goodreads.com/user/show/13808049-kendra", "userReview": "I really enjoyed reading this book it was quick, easy, and relatively mindless. I didn't realize that it was a sequel until I re-read a friend's review. I thought the author did a good job of explaining the background story so you don't need to read the first one to understand the current story line.Books like this always make me want to start cooking, or in this case go to France and stuff my face with puff pastries. The excerpts from the tabloid newspaper reminded me of Gossip Girl and I could have done with less of those, but they did help the story line along."}, {"userName": "Nikki", "userReviewDate": "Feb 19, 2011", "userURL": "http://www.goodreads.com/user/show/1538380-nikki", "userReview": "Having read the first book, Good Things, I was looking forward to this sequel. I was not disappointed. I do agree a bit with other reviewers here that some of what happens is so unbelievable, and would never occur that way in real life. That being said, I still enjoyed it a great deal - after all it's fiction, right? I continue to like the characters, and hope that her next book will include them in it!"}, {"userName": "Holly", "userReviewDate": "May 02, 2015", "userURL": "http://www.goodreads.com/user/show/1744565-holly", "userReview": "I'll admit it...I wanted a beach read! After having just read two rather intense books (on child molestation and mass shooting) I really just wanted to relax for an afternoon with a book that would simply amuse me, nothing more needed. Well, this was a good book to choose because it's light and frothy. It's not going to win any awards but was there for light reading when I needed it. Chick lit that works; enough said."}, {"userName": "Mary", "userReviewDate": "Dec 31, 2009", "userURL": "http://www.goodreads.com/user/show/2223797-mary", "userReview": "It was like revisiting home reading this book and catching up with Dierdre and the characters from Good Things. I loved reading what was happening to them and how they were all evolving. I see new characters that could lead to another sequel.... I enjoy the character of Dierdre and how she bounces back when she looks like she's hitting bottom."}, {"userName": "Ann", "userReviewDate": "May 02, 2011", "userURL": "http://www.goodreads.com/user/show/4116512-ann", "userReview": "Didn't realize this was a follow up to her other book called Good Things. Well, now I know I definitely don't have to read that one. I did like her book Sweet Life (perhaps I was a little biased since I was in Hawaii when I read it and it takes place in Hawaii) so that is why I picked up this one. This just didn't thrill me. Chick lit from a template is what it seems like."}, {"userName": "Gretchen", "userReviewDate": "Apr 17, 2013", "userURL": "http://www.goodreads.com/user/show/11152023-gretchen", "userReview": "I am a mia king fan but this book didn't impress me much. it was all wrapped up a little too neatly. everything fell into place and that is just so unreal. I know that it is entertainment but it was so predictable. I still gave it 3 stars because the characters are very likeable and I had to see what happened to them. the 1st book \"good things\" was much better."}, {"userName": "Lea", "userReviewDate": "Oct 02, 2009", "userURL": "http://www.goodreads.com/user/show/1073701-lea", "userReview": "Great follow up story to Good Things, which I enjoyed. Deidre is a likeable character from the beginning in this chapter of her life (unlike Good Things). The story is a great combination of a business and romance. Good Read."}, {"userName": "Heather", "userReviewDate": "Jan 15, 2014", "userURL": "http://www.goodreads.com/user/show/5219350-heather", "userReview": "Noteworthy:“Good manners will open doors that the best education cannot.” – Clarence Thomas“Sometimes you just need another perspective,” Deidre said. “And it helps to have help. It’s just too hard to go at it alone, sometimes. Doable, but hard.”“A good dinner menu is a balance of richness and simplicity.” – Peggy Post, Emily Post’s Etiquette"}, {"userName": "Kim", "userReviewDate": "Feb 01, 2010", "userURL": "http://www.goodreads.com/user/show/951334-kim", "userReview": "I thought that King's second book was part of a series with this character, but it is not, so I can now honestly review this book. It is a good follow-up to \"Good Things\" and it is hopefully the second of more with this character. It is a nice light beach read or for a nice afternoon of relaxing."}, {"userName": "Amy", "userReviewDate": "Mar 20, 2010", "userURL": "http://www.goodreads.com/user/show/2309442-amy", "userReview": "Typical, predictable chick lit. I read it in about 2 days - it was enjoyable, but not nearly as good as my favorites in this genre (Confessions of a Shopaholic, Slightly Single, anything by Candace Bushnell). I am glad I checked it out of the library rather than buying it as it wasn't memorable enough to want to read again."}, {"userName": "Jude Caserta", "userReviewDate": "Apr 29, 2014", "userURL": "http://www.goodreads.com/user/show/11463180-jude-caserta", "userReview": "Wimpy women tick me off. I have already forgotten the main character's name. I found myself wanting to shake her. It was read (Audible.com) by a good narrator and her occasional French accent made it tolerable. If I was reading it I would likely not have finished it."}, {"userName": "Michele", "userReviewDate": "Nov 17, 2013", "userURL": "http://www.goodreads.com/user/show/6809291-michele", "userReview": "This book is a sequel to Good Things. However, you can figure out where everyone fits in this book even if you haven't read the first one. Having read the first one, I wasn't bored silly with half the book being a rehash of Good Things. Life is made up of ups and downs..."}], "description": "The star of Mia King's \"entertaining\"(Seattle Times) debut novel Good Things is back-and she's got a full plate. Deidre McIntosh is everyone's favorite go-to person. She seems so successful, so capable, so just plain perfect, with a popular cooking show, her own line of cakes and cookies, and an ideal relationship with Kevin Johnson-considered one of the most desirable men in Seattle. Then Kevin's ex-fiancée, sultry magazine publisher Sabine Durant, suddenly appears, and Deidre needs help. Already intimidated by Kevin's glamorous, moneyed world-and his sister, who wants Deidre out of Kevin's life-she fears she's no match for Sabine. And the go-to girl must figure out where to go next before the tablecloth is pulled out from under her...", "title": "Table Manners", "url": "https://www.goodreads.com/book/show/8260928-table-manners", "average": 3.42, "cover": "", "reviews": 69, "authors": [{"url": "https://www.goodreads.com/author/show/365556.Mia_King", "name": "Mia King"}], "type": ["Womens Fiction", "Fiction", "Romance", "Food and Drink", "Food and Drink"], "outlinks": ["http://www.goodreads.com/book/show/8260928-table-manners", "http://www.goodreads.com/book/show/6322594-table-manners", "http://www.goodreads.com/book/show/683077.Good_Things", "http://www.goodreads.com/book/show/2873085-sweet-life", "http://www.goodreads.com/book/show/23813647-family-room", "http://www.goodreads.com/book/show/33118996-miracle-essential-oils"]}