{"ratings": 464, "userreviews": [{"userName": "Jacob Overmark", "userReviewDate": "Oct 30, 2016", "userURL": "http://www.goodreads.com/user/show/41670556-jacob-overmark", "userReview": "Generally a good thriller, but ...Too many themes, even if they are there to provide \"deep background\". We are introduced to racial issues, various degrees of family secrets, domestic violence, drug and prostitution issues in Amsterdam and a lot more. All boiled down to a hardened businessman offering expensive consultancy services if you are in need af a hostile take over of your closest competitor; meet Peter de Boer. Naturally such work need a dark background, and it would be hard to find a darker one. As the plot(s) unfolds, enter Nicky, the beautiful, and intelligent Indonesian girl with serious family issues, who will eventually save the day and run away with the prince.I´m not trying to spoil the reading experience to anyone, that obvious is it where that part of the story is moving. A cousin and an aunt, a some-time mistress and a few not too trusty employees. The ones that have been mutilated by the tough business methods play there part too, not to mention the Iraqi intelligence freelancers. Ooh, CIA is there too.The novel draws on the circumstances of The Bijlmermeer Crash of October 4th 1992, which even today are well hidden from prying public eyes. This part of the plot is not entirely unlikely, and it could from my point of view have been utilized to much better effect had some of the 600 pages been set aside for it. We are provided with unnecessary details and sideplots in order to keep the story going on. My overall conclusion, the author works too hard on making every tiny bit of the story plausible, and make a happy ending. Read in DanishDutch and German translations available."}, {"userName": "Nikki", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/61864190-nikki", "userReview": "Characters’ profundity: *Characters’ reliability: **Story’s profundity: *Story’s reliability: *This book is clearly old and written in the early years of Olsen’s career. His sense of humor, that usually makes me laugh out loud, is pretty absent here. It is what makes his stories interesting and it keeps up the pace, but this book is just boring. There is a reason why I didn’t finish it. In certain parts of the book, so many names are introduced that I couldn’t distinguish who everyone was anymore. The relationships between those characters were also unclear. I still don’t know who the bad guy was. Also, sometimes I didn’t know what certain events had to do with the overall storyline. They didn’t seem relevant at all. I skipped those pages. Same thing with the relationship between Nicky and Peter: it led nowhere. There’s only one positive thing: Olsen does know how to describe the neighborhood in Amsterdam. We all can imagine a red light district with whores at every corner of the street and young guys who destroyed their lives with drugs and abuse their girlfriends. Olsen was clearly not capable of keeping my attention. A pity."}, {"userName": "Anja", "userReviewDate": "Jan 23, 2015", "userURL": "http://www.goodreads.com/user/show/5149499-anja", "userReview": "Historien foregår i Amsterdam og omegn med afstikkere til bl.a. København og Saddam Husseins Irak. Man bliver introduceret til Nicky Landsaats verden i det fattige kvarter ved Amsterdams kanaler, hvor alfonser kæmper om magten og luderne. I kontrast til Nicky´s verden, møder vi det rige og måske lige så kriminelle miljø omkring Peter de Boers firma som overtager andre firmaer (firmaknuser). Derudover møder vi Saddam Husseins håndlangere (alias Den Irakiske Efterretningstjeneste), Irakiske Kurdere der er flygtet til Holland, og den frygtelige El Al, Boeing 747 ulykke i 1992. I et hæsblæsende tempo følger vi helten og heltinden, som jeg gerne vil kalde dem, Nicky og Peter de Boer. Nicky bliver ansat i Peter´s firma og viser sig yderst kompetent og nyttig - og derudover er hun er smuk pige! (mere siger jeg ikke).Man følger de 2 gennem hele bogen, Peter´s firma og Nicky´s familie og alle de ulykker de bliver udsat for. Det er helt utroligt hvad de overlever, og man sidder og fryder sig hver gang de \"genopstår\" og vinder over det onde. Her er Nicky fx ved at få knækket halsen af én af de irakiske håndlangere: \"Det var den lyd, som hun i en tid optrådte med for sine fascinerede kammerater, og den lyd hun nu, i dette ultimative øjeblik hvor hendes bøddel tog fat i hendes kranie og vred det voldsomt til siden, ganske instinktivt frembragte.Og det var også den lyd, der fik manden til at give slip på hendes hoved med en tilfreds grynten, så hun faldt fremover mod boksdøren med en følelse af, at nakkemusklerne var revet over\".Bogen var oprindeligt udgivet som \"Firmaknuseren\" men forståeligt nok blev det ændret til \"og hun takkede guderne\". Handlingen centrerer sig nemlig meget omkring Nicky´s baggrund, som på sin mors side stammer fra Molukkerne i Indonesien og sin fordrukne hollandske far. Inden moderen dør, sørger hun for at Nicky får overgivet sin Indonesiske arv og fortæller hende om \"dokunen\" som har forudset alt. Alt dette skal selvfølgelig læses, men det giver absolut mening af ændre titlen. Mange hændelser i bogen kan man nikke genkendende til, og andre er forfatterens pure opspind, men han formår at pusle det hele sammen i et troværdigt spind af tro, kærlighed, krig, ulykke, hævn, mord osv. Man skal stå tidligt op for at følge med, men heldigvis er der 600 sider at gøre godt med (og ikke 1 side for meget, hvis du spørger mig). Kapitlerne er korte og man følger henholdsvis de 2 hovedpersoner og de andre implicerede i passende intervaller. Jeg kan ikke lade være med at drage en lille parallel til en vis Michael Blomkvist og Lisbeth Salander (Stieg Larssons trilogi), hvilket absolut er et plus for romanen. Der bliver brugt rigtig mange ord i bogen, hvilket gør at man på intet tidspunkt får lov til at hvile, og det tog mig derfor lidt længere tid at læse bogen. Jussi Adler-Olsen kan noget med ord!"}, {"userName": "Susanne", "userReviewDate": "Feb 10, 2017", "userURL": "http://www.goodreads.com/user/show/44513764-susanne", "userReview": "Hat mich überhaupt nicht gepackt. Schon zu Beginn wollte ich es abbrechen, habe mich dann aber doch durchgekämpft.Eigentlich ist der Hintergrund der Story vielversprechend, aber irgendwie versandet alles.Kein Vergleich mit den anderen Büchern, die ich von diesem Autor schon gelesen habe."}, {"userName": "Halalilodri", "userReviewDate": "Feb 10, 2018", "userURL": "http://www.goodreads.com/user/show/27810530-halalilodri", "userReview": "Einige Ingenieure und Architekten hätten sich über die fragilen logischen Konstruktionen gewundert."}, {"userName": "Broggschi", "userReviewDate": "May 05, 2017", "userURL": "http://www.goodreads.com/user/show/67239000-broggschi", "userReview": "Solider Thriller, der andere Wege geht"}, {"userName": "Petra Donatz", "userReviewDate": "Nov 09, 2015", "userURL": "http://www.goodreads.com/user/show/19226653-petra-donatz", "userReview": "Gastrezension von KarlKlappentextEin Mann, der professionell Unternehmen vernichtet. Eine Frau, die sich von ihrer Vergangenheit befreit. Eine Liebe in den Zeiten des Terrors.Der niederländische Geschäftsmann Peter de Boer leitet ein Unternehmen, das darauf spezialisiert ist, große Firmen zu zerschlagen. Er wirbt die Halbindonesierin Nicky Landsaat als Trainee an und macht die junge Frau rasch zu seiner Vertrauten.Als der irakische Geheimdienst de Boer mit der Zerschlagung eines westeuropäischen Konzerns beauftragt, steht er mit dem Rücken zur Wand. Er verweigert den Auftrag – doch es gibt ein Geheimnis in seiner Vergangenheit, das seinem Auftraggeber durchaus bekannt ist. Und plötzlich finden de Boer und Landsaat sich einer furchtbaren Verschwörung ausgesetzt, in der Geld, internationale Politik, Kriminalität und Terrorismus ihr Schicksal zu besiegeln scheinen.Ein rasanter Thriller und ein packender Gesellschaftsroman, in dem die Schreckensszenarien der Gegenwart thematisiert werden: Terrorimus, Nahostkonflikt und Finanzkrisen.Der AutorJussi Adler-Olsen wurde am 2. August 1950 unter dem bürgerlichen Namen Carl Valdemar Jussi Henry Adler-Olsen in Kopenhagen geboren. Er studierte Medizin, Soziologie, Politische Geschichte und Film. Bevor er 1995 mit dem Schreiben begann, arbeitete er in verschiedensten Berufen: als Redakteur für Magazine und Comics, als Koordinator der dänischen Friedensbewegung, war Verlagschef im Bonnier-Wochenblatt TV Guiden und Aufsichtsratsvorsitzender bei verschiedenen Energiekonzernen. Sein Hobby: Das Renovieren alter Häuser. Er ist verheiratet und Vater eines Sohnes.Meine MeinungStoryNiederlande 1996 : Peter de Boer hat einen ungewöhnlichen Job, er hat ein Unternehmen, das es sich zu Aufgabe gemacht hat, im Kundenauftrag Konkurrenzunternehmen zu vernichten. Der irakische Geheimdienst wird auf ihn aufmerksam und verlangt die Zerschlagung eines großen Konzerns. Außerdem soll er eine verlorengegangene Fracht, einer 1992 abgestürzten El-AL Maschine wiederfinden, die Halbindonesierin Nicky Landsaat hilft ihm dabei .SchreibstilDas Buch erfordert ein wenig Aufmerksamkeit. Es kommen viele Handlungstränge zusammen die leicht für Verwirrung sorgen, wie de Boer`s Vergangenheit, seiner Eltern, sein Bruder, seine Firma, Mitarbeit die gegen ihn Arbeiten, mehrere Geheimdienste, Nicky Laadsaat leben und ihre Vergangenheit.CharaktereAn einem Charakter, der Firmen vernichtet ( und damit auch Arbeitsplätze) damit andere mehr Profit machen, ist es schwer, gefallen zu finden. Einzig mit Nicky die aus einer schwierigen Familiensituation kommt konnte ich mitfühlen.Mein FazitNeben der Karl Moek Reihe erscheinen regelmäßig Romane von Adler Olsen, die mit der Reihe nichts zu tun haben, wie, Das Alphabethaus, das Washington Diskret und nun Takeover. Bereits beim Washington Diskret habe ich mich gefragt wie es sein kann das ein Autor auf der einen Seite so gute Triller schreiben kann, auf der andren Seite dann so absurde Geschichten schreibt. Leider war das Washington Diskret keine Ausnahme, denn Takeover ist auch nicht besser. Eine konfuse Geschichte, verwirrend, vorhersehbar und stellenweise unlogisch. Ich müsste aber Spoilern um das näher auszuführen. Laut den Angaben des Autors sind sowohl das Washington Diskret als auch Takeover schon vor 15 Jahren geschrieben worden. Vieleicht hätte man die Manuskripte besser im Safe gelassen. Mit einer Veröffentlichung hat der Autor sich keinen Gefallen getan.Leider kann ich hierfür nur zwei von fünf Sternen vergeben."}, {"userName": "Heidy", "userReviewDate": "Feb 25, 2017", "userURL": "http://www.goodreads.com/user/show/25493317-heidy", "userReview": "Habe 65 Seiten gelesen und gebe auf, weil ich mich nur langweile oder ärgere - dieses Buch sagt mir überhaupt nicht zu... Zwei kaputte Typen: Er ein Firmenzerstörer-Arschloch, sie aus einer oberkaputten Familie, für die ich mich nun gar nicht interessiere - ihre kaputten Geschwister und ihre merkwürdigen Eltern, sowas von übertrieben...! Und sie selbst scheint auch hauptsächlich ein karrieregeiles Arschloch zu sein..."}, {"userName": "Brenda", "userReviewDate": "Jun 17, 2012", "userURL": "http://www.goodreads.com/user/show/10286051-brenda", "userReview": "DE BEDRIJFSTERRORISTDeensThriller528 pagina'sEerste druk: Politikens, Kopenhagen (Denemarken)Peter de Boer, financier van duistere praktijken met een al even duister verleden, schakelt in opdracht van derden bedrijven uit voor elke concurrent totdat hij zelf het slachtoffer wordt van chantage. Zakenman Marc Franken de Vires, die zich evenzeer bezighoudt met louche deals, dwingt hem via kennis over De Boers verleden om enkele zaken voor hem op te knappen. De Vires, een man die gevaarlijke connecties blijkt te onderhouden met het regime van Saddam Hussein, eist o.a. dat Peter een bekende oliemaatschappij een zware slag toebrengt. Al snel raakt ook Peters vriendin Nicky, een meisje uit een kansarm milieu, betrokken bij deze minder fraaie kant van de zakenwereld. Wanneer Peter bovendien wordt gedwongen om de feiten over de werkelijke lading van de El-Al Boeing die destijds in de Bijlmer neerstortte te achterhalen, raken hij en Nicky nog verder verwikkeld in een internationaal complot en is het nog maar de vraag of zij hier heelhuids uit kunnen komen..."}, {"userName": "Sonja", "userReviewDate": "Nov 17, 2011", "userURL": "http://www.goodreads.com/user/show/5844296-sonja", "userReview": "Dit boek speelt zich af in Nederland en vertelt het verhaal van Peter de Boer, een zakenman met een bedenkelijk verleden. De Boer schakelt bedrijven uit in opdracht van de concurrentie, totdat hij onder druk wordt gezet door een collega. Hij raakt verwikkeld in een internationaal complot. En het is nog maar de vraag of hij zich daaruit kan redden. Het wordt pas echt spannend als Peter gedwongen wordt vrij te geven wat de werkelijke lading was van de Boeing die neerstortte in de Bijlmer. De complottheorieën vliegen je om de oren, en dat zorgt ervoor dat je dit boek uit wilt lezen. Ook Nicky, de vriendin van Peter krijgt goed gestalte en hun relatie wordt verder uitgediept."}, {"userName": "Danick Wiberg", "userReviewDate": "Apr 05, 2014", "userURL": "http://www.goodreads.com/user/show/27150389-danick-wiberg", "userReview": "Complicated, hard to follow (on audiobook) and not all too exciting. Rather disappointed as I usually like Jussi Adler-Olsen's books. Also happened to be a subject I wasn't all too interested in, so that might have affected my rating though. There were a lot of traps the author could have fallen into, as in getting too technical or listing the numbers too much, but he refrained from that, so good job by the author, but not a book for me."}, {"userName": "Saskia", "userReviewDate": "Aug 16, 2012", "userURL": "http://www.goodreads.com/user/show/9571714-saskia", "userReview": "Bij een tripje naar Kopenhagen hoort natuurlijk een boek van een Deense schrijver. Op Schiphol vond ik dit boek van Jussi Adler-Olsen. Het boek speelt zich af in 1996 in ons eigen Nederland en dan vooral in Amsterdam en Haarlem. Het verhaal is meer Ludlum-achtig dan misdaadthrillerig (verwacht geen Serie Q/Stieg Larson-achtig plot!) en leest lekker weg. Ik vond de ontwikkelingen op liefdesgebied wel erg zoetsappig..."}, {"userName": "Thomas Nielsen", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/5878875-thomas-nielsen", "userReview": "Skuffende bog. Det er jo aldrig et godt tegn, når man får lyst til at læse en anden bog ind imellem. Eller at de sidste 100 sider ikke bliver læst den samme nat. Det er masse flotte ord på de rigtige tidspunkter. Men der er alt for lidt fremdrift i bogen. Konspirationerne bliver så indviklet, at man kan have sin tvivl om forfatteren selv kunne følge med til sidst."}, {"userName": "Lene", "userReviewDate": "Mar 28, 2012", "userURL": "http://www.goodreads.com/user/show/8438096-lene", "userReview": "Som med de fleste af Jussis bøger, skal man lige godt ind i den inden man bliver fanget. Jeg vil markere den her som hans svære to'er, men han klarer det nu meget godt alligevel. Jeg kan anbefale denne bog til dem der godt kan lide krimi, uden for mange lig."}, {"userName": "Ole Phillip", "userReviewDate": "Aug 24, 2015", "userURL": "http://www.goodreads.com/user/show/12806423-ole-phillip", "userReview": "Hvad skal jeg sige? De bøger jeg har læst af JAO kan klart deles op i Afdeling Q og så de andre. De andre, tidligere bøger er ikke lige mig, Hun takkede guderne er borderline 2/5 men jeg gav den 3/5 fordi jeg er for flink..."}, {"userName": "Henrik", "userReviewDate": "Jul 28, 2011", "userURL": "http://www.goodreads.com/user/show/5867140-henrik", "userReview": "Jeg er gået i gang med de 3 bøger som Jussi Adler-Olsen skrev før \"Afdeling Q\" serien. Den første (Alfabethuset) var en kæmpe skuffelse - men \"Og hun takkede guderne\" var faktisk ganske god. Minder mig mig lidt om den amerikanske forfatter Joseph Finder."}, {"userName": "Mads", "userReviewDate": "Jul 24, 2011", "userURL": "http://www.goodreads.com/user/show/5571546-mads", "userReview": "God triller der holder læseren fanget. Avanceret og på samme tid banal i sin beskrivelse af menneskelig ondskab."}, {"userName": "Per", "userReviewDate": "Oct 13, 2012", "userURL": "http://www.goodreads.com/user/show/10190878-per", "userReview": "En spændene bog af danske Jussi. om kolde forretningsmænd og terroisme"}, {"userName": "Thomas", "userReviewDate": "Feb 21, 2012", "userURL": "http://www.goodreads.com/user/show/7850935-thomas", "userReview": "Der var passager, hvor jeg blev rørt, og det vil jeg trods alt give 2 stjerner for. Plottet og historien var kedeligt."}, {"userName": "Vibeke Døssing", "userReviewDate": "Jul 31, 2013", "userURL": "http://www.goodreads.com/user/show/16719825-vibeke-d-ssing", "userReview": "Spændende, men den kan ikke måle sig med de bøger, han har skrevet om afdeling q"}, {"userName": "Torben", "userReviewDate": "Jun 21, 2014", "userURL": "http://www.goodreads.com/user/show/12988899-torben", "userReview": "Very, very nice. Surpricing plot, dangerously mixed with facts from the real world. Very cunningly told."}, {"userName": "Julia Hentschel", "userReviewDate": "Oct 04, 2016", "userURL": "http://www.goodreads.com/user/show/56398834-julia-hentschel", "userReview": "Spannender Hintergrund!"}, {"userName": "Emma Højhus", "userReviewDate": "Feb 18, 2014", "userURL": "http://www.goodreads.com/user/show/20216449-emma-h-jhus", "userReview": "Super god!! Ikke så gode som afdeling q-bøgerne, men det er der jo intet der er!"}, {"userName": "Jielus Kuijntjes", "userReviewDate": "May 01, 2013", "userURL": "http://www.goodreads.com/user/show/18877594-jielus-kuijntjes", "userReview": "Niet zo goed als het eerste deel. Toch aan te raden om de cirkel rond te maken!"}, {"userName": "Michael Krarup", "userReviewDate": "Aug 23, 2013", "userURL": "http://www.goodreads.com/user/show/21580701-michael-krarup", "userReview": "http://bogbrokken.blogspot.dk/2012/02..."}, {"userName": "Trine", "userReviewDate": "Aug 28, 2013", "userURL": "http://www.goodreads.com/user/show/21369292-trine", "userReview": "I like it - it is a bit different then what Adler is mostly known for - but not a bad book. Alot of speculation that is a bit too close to reality, which makes it quite the read!"}], "description": "Ein Mann, der professionell Unternehmen vernichtet. Eine Frau, die sich von ihrer Vergangenheit befreit. Eine Liebe in den Zeiten des Terrors.Der niederländische Geschäftsmann Peter de Boer leitet ein Unternehmen, das darauf spezialisiert ist, große Firmen zu zerschlagen. Er wirbt die Halbindonesierin Nicky Landsaat als Trainee an und macht die junge Frau rasch zu seiner Vertrauten.Als der irakische Geheimdienst de Boer mit der Zerschlagung eines westeuropäischen Konzerns beauftragt, steht er mit dem Rücken zur Wand. Er verweigert den Auftrag – doch es gibt ein Geheimnis in seiner Vergangenheit, das seinem Auftraggeber durchaus bekannt ist. Und plötzlich finden de Boer und Landsaat sich einer furchtbaren Verschwörung ausgesetzt, in der Geld, internationale Politik, Kriminalität und Terrorismus ihr Schicksal zu besiegeln scheinen.", "title": "Takeover", "url": "http://www.goodreads.com/book/show/25439864-takeover", "average": 3.37, "cover": "https://images.gr-assets.com/books/1430169158l/25439864.jpg", "reviews": 26, "authors": [{"url": "https://www.goodreads.com/author/show/1734716.Jussi_Adler_Olsen", "name": "Jussi Adler-Olsen"}, {"url": "https://www.goodreads.com/author/show/3114253.Hannes_Thiess", "name": "Hannes Thiess"}, {"url": "https://www.goodreads.com/author/show/863605.Marieke_Heimburger", "name": "Marieke Heimburger"}], "type": ["Mystery", "Thriller", "Fiction"], "outlinks": ["http://www.goodreads.com/book/show/25439864-takeover", "http://www.goodreads.com/book/show/10153870-og-hun-takkede-guderne", "http://www.goodreads.com/book/show/12227826-de-bedrijfsterrorist", "http://www.goodreads.com/book/show/26513106-takeover", "http://www.goodreads.com/book/show/12361972-firmaknuseren", "http://www.goodreads.com/book/show/10822858-the-keeper-of-lost-causes", "http://www.goodreads.com/book/show/13505130-the-absent-one", "http://www.goodreads.com/book/show/7145565-flaskepost-fra-p", "http://www.goodreads.com/book/show/10008056-journal-64", "http://www.goodreads.com/book/show/24611980-the-hanging-girl"]}