{"ratings": 95472, "userreviews": [{"userName": "Blacky *Romance Addict*", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/8310179-blacky-romance-addict", "userReview": "Amazing. A must-read. Every single sentence from that guy's brain/mouth is priceless. My mind is in awesome-coma, so I'm gonna try to show my feelings the best I can :))This book:To the author for writing it:What parts of the book are absolutely amazing:Drew's POV:The sex scenes from Drew's POV:The romance:This book is just:And I want:Best book ever to be written completely from the hero's POV!I don't remember the last time I had so much fun reading something!Seriously people, don't read too many reviews, just go in blind and read the book!!!!!!! You'll love it more!!! And it is completely awesome!!!!Thanks V, Shelly and Rach for reading this with me <3"}, {"userName": "Navessa", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/18104163-navessa", "userReview": "I am Navessa's curiosity. When Navessa sees people spamming a book with five star reviews I make her investigate because I’m a nosy bastard. I am Navessa's hesitation. When Navessa sees that the reviews are nothing but pictures of people creaming themselves followed by lists of sexy/funny quotes I make her pause to consider how these things have gone in the past.I am Navessa's Id. When Navessa's worry is about to get the best of her I override that motha fucka and click the ‘Buy Now’ button. I am Navessa's fear. When the Id takes over and the self-sabotaging begins I immediately start to panic. I am Navessa's optimism. I shove her fear aside with reassurances like “Maybe it’ll be different this time.” and “Everyone thinks this is funny. You like funny!”I am Navessa's acceptance. I acknowledge all behaviors and encourage her to start reading. I am Navessa's sense of humor. Parts of this book amuse me greatly. I urge her to keep reading. I am Navessa's annoyance. I am more powerful than Navessa's sense of humor and scissor-kick it into submission.I am Navessa's left eyebrow. When the misogyny begins I climb up her forehead. I am Navessa's right eyebrow. When the misogyny begins I get green with envy because I suck at arching. I am Navessa's sense of self worth. I wonder why we’re still reading. I am Navessa's feminism. “KILL IT WITH FIRE!!!”Blog | Facebook | Twitter | Instagram | Pinterest"}, {"userName": "Aestas Book Blog", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/5604583-aestas-book-blog", "userReview": "Hilarious, romantic, all-out FUN!! Think Wallbanger meets Beautiful Bastard :)You smiling yet? I was hooked from the first line and smiling wide by the end of the first page. If you are a fan of enemies-to-lovers stories, you will LOVE Tangled!I swear half my book is highlighted. I laughed out loud, grinned till my cheeks ached and just generally loved it!The story is about Drew. In real life, Drew is a clean-shaven, well-groomed, expensive suit wearing professional. But, at the start of the story, he’s a miserable un-showered, un-shaven heap locked in a messy apartment overflowing with old pizza boxes while claiming to have the flu.Right.What he really has is a bad case of the Break Up.See Real Life Drew was once a player. Why settle for one when there were so many willing ones tripping over themselves to be with him?“I’ve never seduced a woman before.Shocking, I know.Let me clarify. I’ve never had to seduce a woman before, not in the typical sense. Usually it just takes a look, a wink, a smile. A friendly greeting, maybe a drink or two. After that, the only verbal exchange involves short, one-word phrases like harder, more, lower… You get the point.”  But he’s fallen in love. Finally. Problem is, she’s getting married… to someone else. Hence the miserable, moping, un-shaved heap. This is his story.It starts off going back in time to when they first met. Drew meets Kate at a club one night and, despite the flirting, she walks away. When Kate gets hired by his office, it puts him in a frustrating situation because office romances are on his no-no list.  “Kate Brooks is officially scratched off my list of potentials. She is forbidden, untouchable, a no-way-never. Right next to my friends’ ex-girlfriends, the boss’ daughter, and my sister’s best friends.Well, that last category is a bit of a gray area.”  We are told the story by Drew. He can be a bit of an asshat but you really just can’t help falling for him – he’s that lovable. He both narrates the events and breaks the 4th wall by talking directly to us as the reader. It’s totally awesome! It’s like he’s right there telling you the story. There are times when his commentary on what was going on just had me in stitches. Here’s a random quote:  “Once again, to the ladies out there — here’s a fact for you: Men pretty much have sex on the brain twenty-four-seven. The exact figure is like every 5.2 seconds or some shit like that.The point is, when you ask, “What do you want for dinner?” we’re thinking about screwing you on the kitchen counter. When you’re telling us about the sappy film you watched with your girlfriends last week, we’re thinking about the porno we saw on cable last night. When you show us the designer shoes you bought on sale, we’re thinking how nice they would look on our shoulders.I just thought you’d want to know. Don’t shoot the messenger.”  And if you like strong heroines, you will LOVE Kate. She is smart, confident, sassy and absolutely determined not to become another notch on Drew’s bed post. She has plans, dreams, goals and no time for a playboy.  “If we’re going to work together, Drew, I think we’re should get a few things straight. I’m not your sweetheart. My name is Kate — Katherine. Use it. And I’m not a kiss-ass. I don’t have to be. My work speaks for itself.”  Their banter and ‘sparring’ was just priceless! Tangled was essentially an enemies-to-lovers story about guy falling in love for the first time with a girl who goes toe-to-toe with him on everything. I loved watching them work through their issues. And when Drew finally decides to fight for Kate’s heart, the lengths to which he goes are just laugh-out-loud awesome!  “It makes me want to kiss her and strangle her at the same time. I’ve never been into S&M, but I’m beginning to see its benefits.”  The book wasn’t always funny per say, but the whole mood was light hearted. The sex was hot, the characters were lovable, the writing was witty and it has a happy ending :)If you are looking for a FUN read, this is it!!!!4.5 stars Thank you to the publisher for providing me an ARC to review. ******************************BLURB -->  Drew Evans is a winner. Handsome and arrogant, he makes multimillion dollar business deals and seduces New York’s most beautiful women with just a smile. He has loyal friends and an indulgent family. So why has he been shuttered in his apartment for seven days, miserable and depressed? He’ll tell you he has the flu.But we all know that’s not really true.Katherine Brooks is brilliant, beautiful and ambitious. She refuses to let anything - or anyone - derail her path to success. When Kate is hired as the new associate at Drew’s father’s investment banking firm, every aspect of the dashing playboy’s life is thrown into a tailspin. The professional competition she brings is unnerving, his attraction to her is distracting, his failure to entice her into his bed is exasperating. Then, just when Drew is on the cusp of having everything he wants, his overblown confidence threatens to ruin it all. Will he be able untangle his feelings of lust and tenderness, frustration and fulfillment? Will he rise to the most important challenge of his life? Can Drew Evans win at love? Tangled is not your mother’s romance novel. It is an outrageous, passionate, witty narrative about a man who knows a lot about women…just not as much as he thinks he knows. As he tells his story, Drew learns the one thing he never wanted in life, is the only thing he can’t live without. For more of my reviews, visit Aestas Book BlogAnd come join the Aestas Book Blog  Facebook Page"}, {"userName": "Baba  ", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/4669232-baba", "userReview": "[Kate won't take me back, (hide spoiler)]"}, {"userName": "\"That's All\" Ash", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/5606933-that-s-all-ash", "userReview": "So after seeing this book completely TAKE OVER my newsfeed in what could only be described as “ Goodreads Tangled-Gate of 2013”… \n I finally had to cave and read this book. And for the next two days… you wanna know what I was doing?A WHOOOOOOOLE LOTTA THIS: \n\n\n\n\n And might I just say…Snaughling?That’s some intense shit. ;) But seriously, you’re going to be doing that ugly-laughing thing where you know, you hug lower body and mascara’s running down your face and you’re rolling on the ground making disturbing noises and people don’t know whether someone attacked you or if maybe you should be attacked.I’m just saying!It’s goin’ to happen. So you better start writing that “Thank You” letter to your yoga instructor now.  Oh! And Drew Evans?You and me, buddy. \n Oh! And Emma Chase?You did good, girl…YOU DID GOOD!"}, {"userName": "Debra", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/13247178-debra", "userReview": "[When Drew tries to make things up with Kate, he goes all out, flowers, balloons, a music band...but Kate doesn't give in easily and I liked the fact that she stond up for herself like that instead of forgiving him right away. (hide spoiler)]"}, {"userName": "Christy", "userReviewDate": "May 06, 2013", "userURL": "http://www.goodreads.com/user/show/11284813-christy", "userReview": "5+++ Fantastic and Hilarious Stars!!!\nIf you are like me and you adore the lovable assholes, the jerks, and the manwhores... then Drew Evans is just the guy for you!!! This book had me hooked from the very first page and I couldn’t get enough! Being inside Drew Evan’s head was amazing! One of the funniest and most enjoyable stories I have read in a really long time! \nMeet Drew Evans. He is a successful business man, a handsome guy, he’s got great friends, a loving family, and as many women as he could ever want. Drew is hot and Drew knows it. Drew doesn’t do relationships. He never makes promises, he just does his thing. \nThroughout this story, Drew gives us a ton of fun facts and info:\u2028\nMen are visual. We wouldn’t be fucking you if we didn’t want to look at you. You can write that down.I control my dick. My dick does not control me.I sleep naked, by the way. You should try it. If you haven’t slept naked, you haven’t lived. But thats beside the point.For those ladies out there who are listening, let me give you some free advice: If a guy who you just met at a club calls you baby, sweetheart, angel or any other generic endearment? Don’t make the mistake of thinking he’s so into you, he’s already thinking up pet names. It’s because he can’t or doesn’t care to remember your actual name.Deep down- I’m a momma’s boy. I’m man enough to admit it. And trust me, I’m not the only one. Explains a lot, doesn’t it?Here’s a fact for you – once I’m done, I’m done. I’m not the kind of guy who rides the same rollercoaster twice \nYou get the idea of what kind of guy he is, yeah? Well, Drew hasn’t been himself. He has ‘the flu’. The last week he hasn’t been well. And it all has to do with one woman. Katherine Brooks.\nKate works with Drew. She is new at the firm and she is ready to succeed. She is smart, beautiful, feisty and she intrigues Drew in every way. There is something different about Kate. While competing against each other for the same account, these two bicker and banter back and forth... its hilarious! There is also some major sexual tension going on, but there are complications. They get to know each other better and Drew decides he wants Kate. Drew screws up a ton, but he is a guy, what do you expect? He goes through some great lengths to make it better. \nSome of the BEST lines:\nIt makes me want to kiss her and strangle her at the same time. I’ve never been into S&M. But I’m beginning to see its benefits.Edward Cullen can take his stupid heroine and OD on it. Kate is my own personal brand of Viagra.Twelve days. Its a frigging record. I haven’t had a drought like this since the winter of ninety-nine. “God! Oh God!”\u2028“God’s not the one fucking you, baby.”“Drew... Drew... yes... Drew!”Much better.“You have no sense of self-preservation, do you?”\u2028“No, not at the moment. I’m too focused on... fornication.”I blame Adam. Now theres a guy who had the world by the balls. Walking around naked, a hot chick to satisfy his every whim. I sure hope that apple was tasty, ‘cause he really fucked it up for the rest of us.\nThis is how I looked a majority of the book:\nI can’t tell you how impressed I was with this debut novel! I don’t think I have ever read a book that has made me smile and laugh so much. I love the male pov and it was a treat to have the whole story written in the male’s pov! The whole time I was reading, I felt like Drew was talking to me. Drew is the best kind of character. He is funny, sarcastic, sexy and sweet! I couldn’t get enough of him! And I liked Kate too lol! The whole thing- It was great! Can I say there was nothing I didn’t like about this one! Loved everything it! Going on the favorites shelf for sure. Emma Chase- I will read ANYTHING you write lady! This was fantastic! Looking for a fun and awesome read... pick this one up!!!"}, {"userName": "Jill", "userReviewDate": "May 21, 2013", "userURL": "http://www.goodreads.com/user/show/3820197-jill", "userReview": "[ (hide spoiler)]"}, {"userName": "Anne", "userReviewDate": "Oct 11, 2014", "userURL": "http://www.goodreads.com/user/show/1720620-anne", "userReview": "Douchebags, FTW! <--reread 2017This one held up during a second reading, and I'd still recommend it to anyone who isn't looking for prince charming to actually be...charming.Also.In the story, Drew is a brunette, but since the beauty of books is that I can imagine whatever the fuck I want... Original review: 2014LOVED THIS! LOVED IT!I laughed, and laughed, and laughed, and then I laughed some more. Sooooo good!I have to say that I understand why some people found this book (Drew's voice in particular) offensive, rude, and obnoxious. He's a self-centered man-whore, and his inner thoughts are not even slightly redeeming. We first meet him while he's getting a BJ from a random redhead in a bathroom, and his immediate thoughts are only how quickly he can extract himself from her and move on to the next good time. Because why in the world would he have sex with the same woman twice?Hang on. Did she just say she had a twin? Aaaaand we're back in business! Is Drew honest, or is he just a horrible person? Maybe a little bit of both.Thing is, I married a guy who sounds like Drew. Many years later, I'm used to that particular brand of honesty, so it cracked me up on several different levels. However, if you don't like leading men who aren't PC, then you'll want to steer clear of this one because this guy is guaranteed to offend you.I get it, I do. It's just that my husband has used the excuse \n\"because I'm not a giant vagina\"\n to get out of doing so many things with me that I'm desensitized to it.At any rate, I loved Drew and Kate's story, and I can see myself coming back and revisiting this book over and over again.This a typical romance in that Drew is unbelievably sexy, unbelievably rich, and unbelievably skilled with women.I should be annoyed with his lack of Real-World issues, but this was funny enough that I managed to overlook his...lack of flaws, I guess? Tangled is one of those stories that I just chalked up to complete fantasy, and decided not to let my sensible side squish the fun.Mild Spoilers Ahead: Here's what I thought the author did right:First, when Drew realizes he's in love, he doesn't run off and deny it. It doesn't make sense when they have characters do that, you know? If you're in love, you act the fool. You do the whole embarrassing PDA stuff, you talk about them until your friends want to strangle you, and you otherwise just act all goofy and stupid.You don't run off. Not even relationship-shy dudes.I think that's something certain people tell themselves when their love interest runs for the hills.Oh, they're just scared of their feelings!Ehhh. I think they just don't like you.Maybe I'm wrong. I'm not.Second, it takes Kate a reasonable amount of convincing to take Drew back at the end.I know that some of you are probably thinking she took him back too soon, but let's face it, she was crazy about him. If you already want to believe someone, then it doesn't usually take much for them to convince you of something. She hung in there longer than I would have...I'm not sure how I missed out on this little gem, but I'm sure glad I found it.If you haven't read this one yet, you need to check it out!\nPS - You can thank Jeff & Trish for all of the extra Hemsworth gifs I had laying around..."}, {"userName": "Heather K (dentist in my spare time)", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/13070326-heather-k-dentist-in-my-spare-time", "userReview": "*1.5 stars*Okay, I know that everyone loves this book. But, honestly, I despised it.This book sort of reminded me of a Kristen Ashley book. There was this stereotype of what a \"guy\" is, and how a \"guy\" thinks. But...I've known a guy or two in my day. This book reads like what a GIRL thinks a guy is like. Tangled had so many loathsome tropes. We get a magical vagina turning a pigheaded guy into a devoted man. We get the adorable niece (which can be replaced by doting younger sister in some books), who shows a dickhead's \"loving\" side. We get blatant misogyny and even SEXUAL HARRASMENT at work framed as \"just teasing\" and \"all in good fun,\" offset by, of course, an even bigger asshole who \"crosses the line\" and shows that the MC isn't all that bad. The male MC doesn't respect the female MC. He doesn't respect her boundaries, he doesn't respect her intelligence, and he doesn't show that he is worthy of her for a hot second. I didn't think this book was funny. I didn't think this book was entertaining. I didn't think the male MC read like a man or how a man thinks. The only reason this book gets an extra 1/2 a star is because the narrator did a nice job reading the story, but if I didn't spend good money on the ebook + the audiobook upgrade, I would have DNFed it (like I wanted to do!) ages ago. No offense to my dozens of friends who loved this one, but the sooner I forget this book, the better."}, {"userName": "Katerina", "userReviewDate": "Jun 18, 2016", "userURL": "http://www.goodreads.com/user/show/5014021-katerina", "userReview": "“Women fall in love quicker than men. Easier and more often. But when guys fall? We go down harder. And when things go bad? When it's not us who ends it? We don't get to walk away.We crawl.”\n\nMy hands have been itching to write a new review because, you know, it's more fun than highlighting the cases you have to know by heart. (I will not cry I will not cry I will not cry) So when God showed mercy and I could finally take a break and read a book before returning to the living hell known as Torts (I will not cry I will not cry I will not cry) I wanted something to cheer me up. Something yummilicious. Smexy. Something to leave me in the end smiling and giggling and cursing real life with its slim chances of finding Mr Perfect. And Tangled was exactly what I needed!\n\n“It makes me want to kiss her and strangle her at the same time. I’ve never been into S&M. But I’m beginning to see its benefits.”\n\nDrew Evans is every girl's dream; successful, devilishly handsome and charming, he'll make you combust with one look and rip off your clothes (and his) with one touch. There's only one problem. The woman he can't get out of his head is rejecting him, and now they work in the same firm and they have to compete each other for a huge project. They fight, they share angry kisses and then they fight some more, until things happen and Drew gets the flu and he realizes that maybe his perfect life is not so perfect without Kate Brooks after all.\n\n“Because I had a life once. A life I loved. It was consistent. Fun. It was reliable. Safe. And then one night, a beautiful dark-haired girl came along and blew it all to kingdom come.”\n\nThat's pretty accurate. Drew was delicious, his scenes with Kate were delicious, \neverything was delicious\n! There's no female author that can write a male POV better than Emma Chase, she's the I-know-what-men-think guru! Is this a psychic thing? An otherworld ability? A pact with the devil? I don't know, but it's awesome! Given the situation between Drew and Kate and the reasons they could not be together at first, I'm not sure I would have enjoyed the story the same if it was narrated by Kate!\n\n“Newsflash, ladies: We can’t read your thoughts. And frankly, I’m not entirely sure I’d want to. The female mind is a scary place to be.” \n\nDrew could be a total jackass at some points, but he was a funny and occasionally sweet jackass. The way he talked to the readers, gave advice and commented on his story was extremely entertaining, it felt like there was a movie playing inside my head! And holy bananas! he was \nhot\n. I was so dehydrated due to his hotness that I couldn't even drool. I still can't.When you're in the mood for a book to cheer you up, read Emma Chase. When you're in the mood for a sweet yet hot love story, read Emma Chase. Just read Emma Chase people!"}, {"userName": "Lucia", "userReviewDate": "Mar 15, 2013", "userURL": "http://www.goodreads.com/user/show/8837962-lucia", "userReview": "I don't remember when was the last time I enjoyed any book so much. I laughed, I was entertained, I swooned. Tangled, book with witty and sarcastic hero as narrator, is a MUST READ! This insight into man's head and thinking is fascinating and a lot of fun.My Drew and Kate:SPOILER-FREE REVIEW:Drew Evans used to be always on the top of things, getting everything he wanted and enjoying life of a single good-looking bachelor. Until he got flu which changed him into whinning man, lying down on his couch and watching stupid movies for a whole week. Or was in not the flu that brought this strong man into this pathetic state?After short prologue, story is set four months earlier to the times when Drew is successful gentleman who is enjoying services of various willing ladies every time opportunity arises. Yep, he is a man-whore. Also, Drew is extra confident person so when he meets woman he wants and cannot get, he is not willing to accept it. But what happens when proffesional competion and love gets into his way and complicates things? You get this superb and original romance story. I loved \"the voice\" and style of writing in this book. It was magical, sarcastic, witty and funny. Perfection if you like to read something entertaining with well-thought storyline developement and sexy hero. I just completely adored Drew's inner thoughts and they were pretty hilarious too. I have never read about cockier hero than Drew Evans. But you will fall for him anyway, he is just that awesome. I personally will never forget him.Kate was also awesome character. She was able to keep up with Drew all the time, matched his determination, even outsmarted him quite often. She was smart, gorgeous and ambitious. Dangerous combination when it comes to woman, right?And story itself? It was flawless. There were moments that made me laugh, moments that left me all hot and bothered, as well as angsty or lovely moments. To be honest, I could not find single thing that I would not like about this book. I hope this author will write more books in future. I will be reading it as soon as they come out. After reading Tangled, I am definitely her fan. * ARC provided by author as an exchange for honest review. *MORE REVIEWS ON MY BLOG \nReading Is My Breathing"}, {"userName": "Mo", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/11856352-mo", "userReview": "[Chafed Penis Syndrome (hide spoiler)]"}, {"userName": "SueBee★bring me an alpha!★", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/15735368-suebee-bring-me-an-alpha", "userReview": "★★★★★! Tangled, book 1. Debut by Emma Chase. A hilariously witty tale following a non-committal playboy man-whore in his descent into the oblivion after falling for a girl he can’t have.\n\n\n“My stomach flips with regret and disappointment. What I wouldn’t give for a time machine.”\n\n\nBooks/BONUS chapters in the Tangled series should be read in (this) order:Book 1: TangledBook 1.1: Working Late/The Kiss – Best read after chapter 6 of book 1. PLUS Interview with Drew.Book 1.2: The Bitch Strikes Back – 1 month after book 1Book 1.4:  What a Difference A Year Makes: Exclusive sneak peek into the future Tangled  – 1 year later.Book 1.5:  Holy Frigging MatrimonyBook 2: TwistedBook 3: TamedTangled is just that a twisted, tangled tale about Drew and Kate, who met briefly in a bar only to, come Monday morning, discover that Kate is the new-hire at Drew’s Investment banking firm. Story is brilliantly told entirely from Drew’s POV and we get to follow him as he is thrown into what starts as an attempt at seducing a co-worker/sub-ordinate to a competition for an account and downhill from there…I could go on and on about how much I enjoyed reading and stayed up all night to finish it. But this story is best experienced. As a matter of fact don’t even bother reading any further just hurry up and get your copy.Thanks Ms. Chase for an entertaining , witty all-consuming read!If you are still reading this, not heeding my advice, I have included my thoughts on Drew and Kate below plus some quotes to give you an idea of the wonderfulness that is Drew, droll playboy man-whore extraordinaire!\n\n\n“So that’s it. That’s my story. The rise. The fall. The end.” \n\n\n\nAndrew Evans, Drew, the prodigal son; spoiled, jaded and privileged, with uncanny good looks, smarts, wit and sarcasm, has at age twenty-eighth already made partner in his father’s boutique investment banking firm. He spends his weeks masterminding, structuring and closing deals affording him both wealth and industry respect. While his weekends are spent in careless pursuit of his next one-night stand, earning him a scandalous reputation and a never-ending line of potential conquests. That is until Kate! Reading from Drew’s POV was truly a joy. Five words to describe Drew: Sarcastic, witty, smart, insightful and unforgettable.\n\n\n“I tell them how it is, give them a good time and then the cab fare home. Thank you, good night. Don’t call me, ’cause I sure as shit won’t be calling you.”\n\n\n\n\n\n“Newsflash, ladies: We can’t read your thoughts. And frankly, I’m not entirely sure I’d want to. The female mind is a scary place to be.”\n\n\n\nAfter meeting and getting to know Drew it was a pleasure to meet Katherine Brooks, Kate the woman who brought him to his knees or should I say sick-bed. From ordinary rather humble beginnings her intelligence, determination and ambition earned her a scholarship and a MBA at Wharton school of business. Upon her graduation she is hired by the prestigious Evans, Reinhart and Fisher. Her new job will prove challenging on so many levels much thanks to Drew. Not helping matters; she has also brought with her, to the big city, her high-school sweetheart and fiancé. Five words to describe Kate: Smart, beautiful, assertive, classy and loyal.\n\n\n“I’m Drew, by the way.” I hold out my hand. “And you are?” She holds up her hand. “Engaged.” \n\n\nAnd so their roller-coaster story begins; For Drew mostly a descent as his life spins out of control:\n\n\n“Although my mind recognizes that Kate Brooks is now my rival, apparently my c~ck hasn’t gotten the memo.”\n\n\n\n\n\n “I told you how I grew up. I never had to share my toys; I don’t plan on sharing my clients. Ask any four-year-old—sharing sucks.”\n\n\n\n\n\n“I’ve gone cold turkey. Completely. I haven’t even jerked off. Not once. In nine frigging days. I think the buildup of semen is starting to affect my brain. Like sugar to a diabetic.”\n\n\n***Hero rating: 5+ stars Heroine rating: 5 starsSex scenes rating: 5 starsSex scenes frequency: 4.5 starsStoryline concept rating: 5+ starsStorytelling skills rating: 5 starsStory ending rating: 5 starsBook editing rating (5 = no edits spotted): 5 stars************************************************Overall rating: 5+ starsWould I recommend this series: Yes.Would I re-read this series: Yes!!!Would I read future books by this author: Yes."}, {"userName": "Pearl Angeli", "userReviewDate": "Jul 07, 2016", "userURL": "http://www.goodreads.com/user/show/31514572-pearl-angeli", "userReview": "5 Hilarious Stars!\nNEW BOOK BOYFRIEND ALERT\n: Drew frigging EvansWhy it took me so long to read this book is beyond me. If there's a guilty-pleasure New Adult book that is worth your attention, it's Tangled by Emma Chase. It's funny as hell and so addictive. Emma's writing was also so delicious you just can't get enough of it!The story centers around Drew Evans. It's told in his POV. Yes, guys. His and his POV alone. I don't normally encounter a romance book where the only one that speaks is the guy. It's fun and refreshing in a way. It's nice to know Drew's thoughts-- including the dirty and naughty ones. lol. So one night, Drew met this alluring brunette named Katherine 'Kate' Brooks in a club and yes, there was insta-lust in Drew's side (in a not-annoying way, mind you). Since then, he was not able to take Kate off his mind. And surprise! He learned one day that Kate's going to be his new co-worker in the company he's working which is owned by his dad. Now I won't get that far into describing the plot. Let Drew do the talking. Listen to him and prepare yourself for a bunch of laugh-out-loud moments because you'll surely get them here... all the freaking time!Picture me while I was reading thisYou might think that this book only features tons of craziness and sexual nothings. Not. I learned a lot of things from Drew. His relationship tips are so sensible, I tell you guys. You want relationship facts and tips from the playboy's perspective? Drop your Cosmopolitan and listen to Drew.As a sample, \n\n\"Assume nothing. Even if you think you know everything. Even if you're sure that you're right. Get confirmation. That whole \"ass\" cliché about assuming? It's right on the money. And if you're not careful, it could end costing you the best thing that's ever happen to you.\"\n\n\n\n\"Women fall in love quicker than men. Easier and more often. But when guys fall? We go down harder. And when things go bad? When it's not us who ends it? We don't get to walk away. We crawl.\"\n\n... and so much more.What also entertained me most was Drew's set of analogies and comparisons that he added in almost everything that he narrated in this book, like:\n\n\"She's like a Rubik's Cube. So frustrating at times that you want to toss it out the goddamn window. But you don't. You can't. You're compelled to keep playing with it until you figure it out.\"\n\nThere were no dull moments in this book. What it offered was pure entertainment. My favorite scene and the one that definitely had me cracking up was the dinner scene where Drew's little niece Mackenzie talked and spoke a vulgar word that had everyone immediately react in such a funny way. (Drew's dad choking, Matthew spitting up the juice right on Steven's face, etc.) LMAO. I laughed for about three minutes with that! Also, I didn't only admire Drew and Kate's characters but I also adored the secondary ones, especially Delores a.k.a. Deedee. She's one badass woman and I can't wait to read her story and Matthew's.This book also built up a remarkable sexual tension which led to sexual frustration and then some. Basically, the relationship and character development was amazing here. Tangled, as a whole, was a very entertaining rom-com book. It came packed with sizzling hot chemistry between the characters and it's simply designed to make you feel good and happy. I totally enjoyed Drew's POV here. The best! The ending was also wholly satisfying and it left me with a big smile on my face. This was my first Emma Chase book and it certainly won't be the last."}, {"userName": "Lisa Jayne", "userReviewDate": "May 07, 2013", "userURL": "http://www.goodreads.com/user/show/11963959-lisa-jayne", "userReview": "5 TANGLED DREW & KATE STARSI just hopped off the Drew Evans express and Well what can I say? first things bloody first, WHAT.A.RIDE. I didn't want to get off ... I unabashedly fell for Drew and Kate. With that being said, Stop everything, drop everything and forget the following: food, housework, husbands, boyfriends, significant other, pets, social life, sleeping, etc. and READ.THIS.BOOK get your comfy spot, your kindle and dive right in.I've got a total soft spot for a well put together book from the Male point of view. Judging from the front cover of this novel who wouldn't want to get into this males head. This story is completely Refreshing, Outrageously Funny and utterly Lovely, lovely, lovely and yes I enjoyed the verbal foreplay just as much, if not more than these fictional characters.The author sums up this book by her very own words right around 59% mark:\"The dashing playboy meets the take-no-prisoners girl of his dreams, and she snags his heart forever.\"You know the drill ~ he's a man whore, she's the sweetest thing to have graced a books pages. They flirt, they fall out, they can't imagine life without each other blah blah blah ...No STOP, Its more than that, MUCH MORE. I mean it is all of the above, but written so fabulously that you will be hooked. It is Full of heart, comedy gold standard funny and at the same time Devilishly naughty.She's his curveball 'The one'. He's the epitome of 'allergic to commitment twenty something' add to the mix that they come together in a showdown of all office wars and you get ~'Tangled'.This brilliant author has written a book with an air of confidence and originality and I'm pretty convinced I'll stalk this author for future releases. With all of that being said Starting this book I originally felt as though I missed a female voice - yes I'm well aware that the male point of view was a selling point for the story and believe me I was sold too, so after a while I told myself to get over it and enjoy the Drew ride and i did! call me crazy (I'm well aware of that fact) But I have a book butterfly radar, you know the effect of a book stealing your book sanity, the swoons, heart thumping that 'feeling'? well that was missing for me in some ways, but the brilliance of this laugh out loud, fabulously witty book more than compensated and as I got to the end of the book I sat back with a huge smile on my face thinking I understand the hype ~ I.TOTALLY.GET.IT.Standing ovation for this authors debut novel, here's a few of my favourite quotes (the whole book could be highlighted).❤❤“Edward Cullen can take his stupid heroine and OD on it. Kate is my own personal brand of Viagra.” ❤❤“Newsflash, ladies: We can’t read your thoughts. And frankly, I’m not entirely sure I’d want to. The female mind is a scary place to be.” ❤❤“My mother always told me, “Anyone worth doing, is worth doing well.” Okay, she didn’t actually say those exact words, but you get the picture.” Last words from me, this book is stunning, funny, brilliant, sarcastic, touching, amazing, fan- bloody-tastic, but don't take my word for it ... Read on beauties, read on.5 Drew Evans and Kate Brooks forever stars."}, {"userName": "BookHeroin ", "userReviewDate": "May 08, 2013", "userURL": "http://www.goodreads.com/user/show/11352319-bookheroin", "userReview": "TWO STARS  Tangled By  Emma Chase Genres: Comedy/Erotica/Contemporary RomanceKindle Edition, 254 pagesPublished May 20th 2013 by Omnific Publishing~**~~**~**~~~**~~**~**~~*~**~~**~**~~*~**~~*\n\nCalm down you idiot! it is not about you!\nyou should be happy that you are not involved in this disaster!! \nthis book was so bad, i just want to break the damn tablet, but i like my tablet so i suck it up for its sake!EVERYONE is reading this book, so i said what the hell lets read it....\nThe fact that almost everyone gave this book 4-5 stars is absolutely ridiculous! The so-called \"comedy\" was SO forced the entire book. Now you will tell me that it was SUPPOSE to be sarcastic and funny, and that fact that it is from Guy POV play huge part in this. I'll tell you darling this is bullshit!First of all, if you know me you'll know that i LOVE books with boy POV , meaning i read a lot of those, this one was THE WORST!!!And that is NOT a comedy! if you think so, then your sense of humor is dead .I'm sorry for your lost!Some Authors can write HILARIOUS books and you feel that they come naturally. A high school student can write this before even taking writing 101. Sad... Don't get me wrong the idea behind this book is funny and brilliant, but the most important thing here is how to turn this idea to an actual book! YOU FAILED MY FRIEND.I tried, i honestly tried to like it, like everyone else seems to, but i couldn't. I would read something and say hahah this is Fuu, funn,no this is not funny!\nMaybe it's me, maybe i don't have a sense of humor? NAAAH i have an excellent taste and this book is rubbish.Don't get me wrong, there are things that i liked, or i wouldn't give this two whole stars, for instance:The relationship between Drew Evans and his niece. ADORABLE Mackenzie  -the niece is adorable little girl , and i loved each scene she was in. And that what kept me going through the book. There was some \"wisdom\" that Drew gave as a guy to women which i found helpful. To women out there which disparately -in my opinion they need to know about men and how they think:\n\n\"If a guy who you just met at a club calls you baby, sweetheart, angel,or any other generic endearment? Don’t make the mistake of thinking he’s sointo you, he’s already thinking up pet names.It’s because he can’t or doesn’t care to remember your actual name.\"\n\nIf he pees on you then he likes you!... stupid boys!\n\n“Sally Jansen.”I look at him blankly.Who?“Sally Jansen,” he says again, then clarifies, “Third grade.”The picture of a small girl with light brown pigtails and thick glassescomes to mind.I nod. “What about her?”“She was the first girl I ever loved.”Wait. What?“Didn’t you used to call her Smelly Sally?”“Yes.” He nods solemnly. “Yes, I did. And I loved her.”Still confused.“Didn’t you get, like, the entire third grade to call her Smelly Sally?”He nods again and, trying to sound sage, says, “Love makes you do somestupid shit.”I guess so, because…“Didn’t she have to leave early twice a week to go to a therapist becauseyou ragged on her so much?”He ponders this a moment. “Yes, that’s true. You know, there’s a fineline between love and hate, Drew.”“And didn’t Sally Jansen switch schools later that year because—”“Look, the point here, man, is that I liked the girl. Loved her. I thoughtshe was awesome. But I couldn’t deal with those feelings. I didn’t know howto express them the right way.”Matthew’s not usually this in touch with his feminine side.“So you picked on her instead?” I ask.“Sadly, yes.” \n\n Probbaly the best thing that has been said in this book. Sad i know!\n\n\"Just so you know, men don’t expect a woman to smell like Winter Pineor Niagara Falls or whatever the fuck those feminine products say. It’s a pussy—it’s supposed to smell like one. That’s the fucking turn on.\"\n\nI grew some respect for him here:\n\n\"Actions win wars. Actions heal wounds. Not words. Words are cheap.Mine, in particular, have the combined value of pocket lint at the moment.\"\n\n~**~~**~**~~~**~~**~**~~*~**~~**~**~~*~**~~*That's about it, I'm going to go, make myself a nice cup of tea and start reading a new book which actually WORTH reading. Do i recommend this book to yu?"}, {"userName": "Allison ❤️Will Never Conquer Her TBR❤️", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/9080319-allison-will-never-conquer-her-tbr", "userReview": "[image error]"}, {"userName": "Vishous", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/7500821-vishous", "userReview": "I will keep this short..RESISTANCE IS FUTILE...You need to read this book...You will love him and his mind...this was Earth shattering. Off the Richter Scale.\nThis was so refreshing to read! I literally loved every sentence in this book! EVERY! The characters were amazing! Even though Kate got on my nerves later but I can let that slip away because Drew makes up for everything!You would say for him that he's an assh@le but to me he is not!He is EPIC!I swear to God I found the best fiction male mind ever!!!!! Whatever he said I was hooked! Whatever he said is true and you just can't help yourself and not love it! He is MY delicious \"assh@le\"! I would have quoted everything that came out of his mouth but that would be literally the whole book because he tells you the story how he got the flu :)THE FLU:“You’re in dangerous territory, man. You see what Steven goes through. This path leads to the Dark Side. We always said we wouldn’t go there. You sure about this?” Matthew smiles, and in his best Darth Vader voice tells me, “You don’t know the power of the Dark Side.”\"I’ll never get tired of looking at her. Or kissing her. Pussy whipped, thy name is Drew. Yeah I know. It’s okay. I don’t mind. ’Cause if this is the Dark Side? Sign me up. Seriously.\"DREW:\"But this kiss? This is one I won’t forget any time soon. She tastes…Jesus, I’ve never done drugs, but I imagine this is what that first snort of cocaine feels like, that first shot of heroine. Goddamn addictive.\"\"But I can’t help it if they see me, f*ck me, and suddenly want to bear my children. That’s not my problem.\"DREW+KATE:\"To people like Kate and me, a dare is kind of like a hooker at a sex addicts’ convention. There’s almost no chance they’re going to get turned down.\"\"The sound of our bodies slapping and her breathy voice fills the room like an erotic symphony. The New York Philharmonic’s got nothing on us. “God! Oh God!” I smile as I pick up the pace, “God’s not the one fucking you, baby.” Sure, I’m in love, but this is still me here. “Drew…Drew…yes…Drew!” Much better.\"read this book!!! you will laugh, you will love him, you'll swoon, you'll be fangirling, you'll take a cold shower, you won't believe the things he says and you WILL LOVE HIS EVERY F*CKIN WORD THAT COMES OUT OF IS MOUTH :DBUDDY READ WITH MY QUEEN, LITTLE OCD AND MY YEEHAAW SHELLY <3"}, {"userName": "Rosalinda *KRASNORADA*", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/12788865-rosalinda-krasnorada", "userReview": "So... what can I say about this book? You guys already posted great reviews! So I'll keep it sweet and short. I am going to embarrass myself confessing this: I have writing that stupid thing down like a thousand times as in Rosalinda + [insert a random name here] forever.Ok, embarrassment over, I must say I loved this book! It was  JUST WHAT I NEEDED  after Me Before You.Drew helped me to recover from my miserable self. And well, he was feeling miserable too so I guess we both recovered together, how romantic!Drew is a womanizer who is happy with his life. He doesn't want to have a relationship, he wants to fuck them, leave them, end of. Until one night he meets Kate and he feels an instant attraction. She is just nice with him but that's it, she basically explains him she's on a relationship so she just ignores his flirting attempts. What he's not expecting at all is finding her next day in his office as his new colleague because she is his competition now and even though he wants her badly, he wants his job even more, right???This book is hilarious, sexy, intelligent and HOT AS HELL! If you need a quick and funny read, then go for it and enjoy some advices from Drew and his lovely niece.\nNo guy talks to his friends about sex with his girlfriend. Ever \nAwwww, you see? He's sweet too. Go buy and read this awesome book!"}, {"userName": "Alexis *Reality Bites*", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/5587514-alexis-reality-bites", "userReview": "This review may contain MINOR SPOILERS -mature content reader discretion is advised.5 STARS out of 5Genre: Contemporary Romance ComedySOLID 5 STARS!!!! Have you read this??? READ IT!!!! LOVE LOVE LOVED IT!!!!!!!!!!This was a much needed fun read and I must say Drew managed to talk about his penis on just about every damn page. AMAZING RIGHT!LOL!Proving the male brain is constantly onHave you ever read a book and felt like the mc actually sat you down to fill you in on what’s happening in his or her life? Because that is exactly how this book felt. It was as if Drew sat me down and explained exactly how he lost his chance at love with Kate.In Tangled we read how Drew goes from thisTo thisWhen he should be doing this"}, {"userName": "Lana ❇✾Dirty Girl Romance❇✾", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/5498948-lana-dirty-girl-romance", "userReview": "Alright ladies, see that amazingly sexy guy over there? Yep, that's the one, the hot one getting a blow job in the bathroom of a super trendy clubMeet Drew Evans, God's gift to women!Drew is a smooth talking, sexy, successful, man slut. Did I also happen to mention that he's a grade-A asshole? No? Well that's ok, because he's an honest one. He just calls it like he sees it.\nFor those ladies out there who are listening, let me give you some free advice: If a guy who you just met at a club calls you baby, sweetheart, angel, or any other generic endearment? Don’t make the mistake of thinking he’s so into you, he’s already thinking up pet names. It’s because he can’t or doesn’t care to remember your actual name.\nI mean, you can't fault a guy for his honesty, right? He does pretty much lay it all for you.\nDon’t look at me like that. I’m not a bad guy. I don’t lie; I don’t sandbag women with flowery words about a future together and love at first sight. I’m a straight shooter. I’m looking for a good time—for one night—and I tell them so. That’s better than ninety percent of the other guys in here, believe me. And most of the girls in here are looking for the same thing I am. Okay, maybe that’s not exactly true. But I can’t help it if they see me, fuck me, and suddenly want to bear my children. That’s not my problem.\nWell of course they do, Drew, you are a good looking, successful, and rich investment banker after all. Even old women have a thing for you\nOld women have a thing for me. And I don’t mean a pinch-my-cheek, pat-me-on-the-head kind of thing. I mean a grab-my-ass, rub-my-junk, why-don’t-you-push-my-wheelchair-into-the-broom-closet-so-we-can-get-nasty kind of thing. It’s fucking disturbing.\nAll women typically fall over themselves to sleep with you....right? That is until one brown haired, brown eyed beauty turns you down at a club.Much to Drew's dismay, the gorgeous brunette that turns him down is actually Katherine Brooks, a new associate at his father's firm where Drew works. When they are forced to work together to attain a new client for the firm, a competition wrapped up in sexual tension arises between the two. Who cares if Katherine has a fiance?! Drew knows what he wantsWithout giving too much away, let me try to sum up what happens with a few choice quotes...\nNo, I haven’t fucked her. Not that I wouldn’t love to. Trust me, if she didn’t work for me, I’d hit that harder than Mohammed Ali. ✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻The way I see it, I could still go for the gold. Technically speaking, I didn’t meet Kate at work; I met her in a bar. That means she could forgo the label of “coworker” and retain the “random hook-up” status with which she was originally designated. What? I’m a businessman; it’s my job to find loopholes. ✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻As she starts to speak, my mind is suddenly filled with every hot-teacher fantasy I’ve ever had. They’re playing out in my mind right next to the ones about the seemingly sexually repressed librarian who’s really a leather-wearing, handcuff-bearing nymphomaniac. ✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻Then I flip Kate the finger. Immature, I know, but apparently we’re now both functioning at the preschool level, so I’m guessing it’s okay. Kate sneers at me. Then she mouths, You wish. Well—she’s got me there, now doesn’t she? ✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻\"I can take a joke,\" she tells me, sounding insulted. \"Yeah? When?\"\"When it’s not being delivered by a childish jackass who thinks he’s God’s gift to women.\" \"I am not childish.\"God’s gift on the other hand? My record speaks for itself. \"Oh, bite me.\" I wish. \"Nice comeback, Kate. Very mature.\" \"You’re a jerk.\"\"You’re a…an Alexandra.\" ✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻✻\nWhat follows the bickering is a whole lot of awesome and some major STEAMBut then Drew has to go an ruin things with his big wounded male egoBut don't you worry, because what follows that is the grovel to beat all grovelsI also LOVED Drew's relationship with his niece.\nMackenzie raises her hand proudly. “I have a bagina.” I smirk. “Yes, you do sweetheart. And someday, it’s gonna help you rule the world.” “Johnny Fitzgerald has a penis. He say his penis is better than my bagina.” “Johnny Fitzgerald’s an idiot. Vaginas beat penises every time. They’re like kryptonite. Penises are defenseless against them.”\nI could go on and on, but really, you need to read it for yourself to see how hilariously fantastic this books is. All I can tell you is this:This book...it wasSeriously! It wasEvery time I read a new chapter, after I got done with my uncontrollable giggles (the good kind) I thoughtEmma Chase, I cannot believe this is your debut novel. Seriously woman"}, {"userName": "Duchess Nicole", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/2204947-duchess-nicole", "userReview": "“Women fall in love quicker than men. Easier and more often. But when guys fall? We go down harder. And when things go bad? When it's not us who ends it? We don't get to walk away.We crawl.”\nOkay, so I think I was the very last person of my friends to read this book...maybe the last in the world. I thought that I wasn't in the mood for funny. Boy was I wrong.I love an author who writes a story that I end up loving before I realize that I'm already halfway through the book. So if you're not in the mood for funny, don't worry. Drew will suck you in like you wouldn't believe. There's NOTHING so great in a romance book for me than watching a proud man fall to his knees over a woman. Especially when the woman doesn't even try. This book encompasses so much of what I normally like, without caving to the tropes. Kate never tries to lure Drew in. She's just herself. No angst, no drama, NO GIGGLING, no coy glances and ridiculous flirtation. In fact, she actively tries to dissuade drew from page one. She's a confident career woman without being a bitch. But she also titillates the man whore Drew with no effort at all.Poor Drew. It really is like he's hit over the head with a cinder block when he meets Kate...and he just doesn't understand what is happening. The two are sort of frenemies before they realize it, and their banter back and forth and then their actual recon missions to sabotage each other at work is nothing short of hilarious!!! I loved it, I loved it!And then there is the inevitable boinking...which, let me just say...was off the charts hot, and totally unexpected for me. \n“God, she’s beautiful. I mean, look at her. She’s like a volcano going off—fierce and fiery and breathtaking. If she doesn’t find a way to ugly herself down, I’m going to be spending an awful lot of time pissing her off. Which might not be such a bad thing in the end. Angry sex is awesome.” \nOh, and then....\nTHE FALLOUT\n\n“It’s simple guy logic: If a woman is angry? It means she cares. If you’re in a relationship and a chick can’t even be bothered to yell at you? You’re screwed. Indifference is a woman’s kiss of death. It’s the equivalent of a man not interested in sex. In either case—it’s over. You’re done.” \nIt's a doozy. Poor Drew. The stupid idiot. The stupid, stupid MAN!!!! And poor Kate. She tries so hard not to fall for the playboy. What IS it about playboys that gets us EVERY FREAKIN' TIME?!?! We all want to be the one who tames them. And Kate does it inadvertently. It's great to watch, because although this is touted as being hilarious and insightful, it's also very much a romance. Drew and Kate are both heartbroken. They love each other so much, and it's hard to watch them hurt each other because they are truly meant to be. Of course, the ending is a forgone conclusion, but it's still magic every time. Is that a sign of my simple mind? I don't really care. I loved this story! I loved Drew's point of view, his issues, his meldown, his love for his niece, his FLU! Gah! Just as everyone else, I fell for the playboy. Too bad he's Kate's."}, {"userName": "Miriam", "userReviewDate": "Feb 25, 2014", "userURL": "http://www.goodreads.com/user/show/237469-miriam", "userReview": "Oh, I see why romance novels are so rarely written from the point of view of the male love interest: because men are revolting, objectifying, self-centered, manipulative, potty-mouthed assholes. Chase isn't a bad writer -- she's lively, anyway, and her narrator's voice is fairly consistent, except when she tries to insert the occasional sensitive or politically correct sentiment -- but I sincerely hope men aren't all as awful as she imagines them. If it were possible I'd add half a star for having that rare beast, a woman who is actually good at her job (as opposed to the reader being informed that the woman is good at her job while she manifestly demonstrates otherwise). And moreover, good at a job that is competitive and ambitious and puts her into conflict with men. The lawsuit-worthy sexual harassment she puts up with at work is probably realistic, if the opposite of romantic. Nothing in this book was romantic to me. The \"hero\" was a manipulative, spoiled slut, and even when he decided he was in love with his coworker he never displayed any thought for her feelings, desires, or goals. Pressuring her constantly when she's just lost her fiance of ten years? Stalking and harassing her? Humiliating her in the workplace (which he gets away with because he's the boss's son) and preventing her from working effectively? Blackmailing her for a date? None of those were within the realm of acceptable human behavior to me, much less romantic. Oh, but he loves his four-year-old niece* -- awwww. He must be a sweetheart really.The most interesting thing about this book was its attempted intersection of male and female fantasies, although since the male perspective is mediated through the author's imagination of what men think like I'm not sure how useful that is. I preferred the two-author approach in Don't Look Down, where the man and woman were written by different authors. *But not enough to refrain from having inappropriate and foul-mouthed sexual discussions in front of her."}, {"userName": "Farah *Professor Dean's Beauty*", "userReviewDate": "May 20, 2013", "userURL": "http://www.goodreads.com/user/show/13273769-farah-professor-dean-s-beauty", "userReview": "I LoVED Loved LOVED this book!! Where has this book been all my life?I swear I was sitting with a huge GOOFY grin the entire book!This is no ordinary book. Its from a males POV! How refreshing!!At times I wondered to myself, did a female really write this??Emma Chase hit the nail on the head! I swear!!Its like Drew is telling us a story and what's even more impressive is when we get thoughts in our heads, Drew answers the question!!! It was like physically being WITH him!!Absolutely fcuking brilliant!!!I didn't want the book to END!!! It was funny, goofy, romantic and had some of the funniest analogy's I've ever read!!!Did I mention HOW MUCH I LOVED this??Drew is gorgeous, intelligent, rich and oh so sexy!Drew is a male Slut! And make no mistake his proud of it.He is the type to sleep with different woman, in different ways (pun intended) and that's it.\"But here's a fact for you - once I'm done, I'm done. I'm not the kind of guy who rides the same rollercoaster twice\" Work came first, Always..His only love is his family...He likes it that way... Until Kate..\"Yeah, I do have ‘ a thing’ for her. An extreme dislike of her. We can’t stand each other. She’s a pill. I wouldn’t fuck her with a ten-foot dildo.”\"But he doesn't like her right? HA!! who you kidding Drew??\"I don’t spar with Kate because I like her. I do it because her existence is screwing with the trajectory of my career. She’s a nuisance. A fly in my soup. A pain in my ass. As aching as that mother of a bee sting I got on my left cheek at summer camp when I was eleven.\"She's everything he thought he never wanted or needed in his life.\"She tastes… Jesus , I’ve never done drugs, but I imagine this is what that first snort of cocaine feels like, that first shot of heroine. Goddamn addictive.\"She turns his world upside down and takes over his every thought.He wants her and he will have her.. Because Drew always gets what he wants... Always! Problem: She has a douche bag waste of space boyfriend/fiancee.\"Why is Kate still with this loser? That’s the million-dollar question, kids. I’m not a snob. I don’t care if you pump gas or run the register at Mickey-fucking-D’s. If you’re a man, you work—you don’t leech off your girlfriend\"Hmmm..Solution: Fcuk her and get her out his system and move on!\"Apparently, I’ve grown a conscience. I don’t know when it happened, I don’t know how it happened, but I am not happy about it\"Kate is resistant at first but one night she gives in to the sizzzzzzling chemistry they have!Technicality: Drew falls in Love with Kate after an epiphany after sex...\"Edward Cullen can take his stupid heroin and OD on it. Kate is my own personal brand of Viagra.\"Major FcuK Up: Kate makes a choice and Drew assumes the worst resulting in him loosing her and being heartbroken for the first time ever---> AKA The FLUNow we see Drew fight for the woman he wants and loves and the plan of action---> Woo Kate and the rest of us in the process..\"She's magnificent - angelic - gorgeous. Pick a word, any fucking word. The bottom line is, for a moment, I forget how to breathe.\"She's not just perfect - she's perfect for me.\" And Oh what a sweet, loving, cheesy, sexy and sooo soo funny story! Dammit this book is more than a 5star!I don't think there are enough adjectives in the english language to describe how much I LOVED this!!"}, {"userName": "Carol [Goodreads Addict]", "userReviewDate": "Jun 02, 2013", "userURL": "http://www.goodreads.com/user/show/10717098-carol-goodreads-addict", "userReview": "Five stars is NOT enough to give this book. Ten stars wouldn't be enough. I loved, loved, loved Tangled. It was exactly what I needed to read right now. I am actually worried I won't be able to write something here to give it justice. Drew Evans is handsome, and knows it. He has women falling at his feet. And he doesn't believe in relationships. He never spends more than one night with a woman but always makes that night the best she has ever had. Then, he meets Katherine Brooks, Kate, and everything changes. She changes him, she is \"the one!\" Although it takes him awhile to figure that out. But, Kate is engaged to someone else, Billy. And, Kate works at Drew's firm and he has a strict rule that he does not date his co-workers. This book had me laughing out loud most of the way through. Drew is simply hilarious. The names he has for Billy go on and on. Drew has very colorful language, a hilarious way of expressing himself, most of which he says he learned in Catholic School. ha ha And most of which I can't bring myself to repeat. And, once he has finally admitted to himself that he is in love, the lengths he goes through to win Kate back are simply unbelievable. I just can't say how much I loved Drew and his antics. The entire book was told from Drew's POV. But, it was told in a different way than any other book I have read. It was told as if I was sitting in a room with Drew and he was telling the story. There are some pretty steamy sexual scenes in this book and plenty of bad language so it is most definitely for the over 18 crowd. I'm not sure if this is Emma Chase's first book or not but she hit it out of the park with this one and I cannot wait for the next book. Thank you Emma Chase for making my day yesterday spent with Drew and Kate the most fun I've had in a long time. I highly recommend this book."}, {"userName": "Sharon ∞❥ is an emotional book junkie ❥∞ ", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/3275325-sharon-is-an-emotional-book-junkie", "userReview": "ETA 7/7/13 ~ Bonus scene: http://thesubclubbooks.com/?p=14232 ...you won't want to miss it...whips, Star Wars, Batman, Justin Bieber and the Notebook! 4.5 ★'sStraight up, Drew is a player...but he's a straight forward player. He lets his hookups know that he's only out for sex and usually for only one time. That is, until he meets Kate and his whole world is turned upside down. Come to find out not only is Kate engaged but she just started working for his company which is Drew's number one no-no.This book is written from Drew's POV and the author has written it so he \"talks\" to the audience. Even though that's not new, I found it really refreshing and interesting and the things that Drew says are just downright hilarious! \nMy Drew\nYummo, right? Yes...Drew is all that and he knows it and he's not shy about letting you know it. But he is in no way prepared for Kate and he is drawn to her like a moth to flame. He absolutely can not get her out of his mind and fortunately for him, it seems she feels the same way. Kate is interesting and has quite a background...but she had me at her love for the perfect pillow! Since we're essentially having the shoe on the other foot now...we don't know a lot about what she is thinking. Oh, we get the passionate kisses but she is able to reign things in...for now. Then, things happen in Kate's life and she's suddenly available. Drew tries to be a good boy and give her time especially after he walks in on her crying. Poor guy can't even last a week! But at least she did get some time! Drew and Kate together are wonderful, sweet and HOT!! Did I say hot?? W-O-W and lucky for us, the sex scenes are written by a woman because I'm not sure I could have handled them actually written by a man. I think that's my only complaint...having Drew's POV, a male's POV, we miss out on a lot of those romantic things...the sweetness and the softness and instead we get a whole bunch of TESTOSTERONE! But there is a saving grace but I'll get to that in a minute. Drew and Kate have a wonderful weekend but come Monday morning, something happens. And as usual for a man (no judgment here), Drew fears the worse and regresses to his earlier behavior causing him to come down with what he thinks is the FLU!! OMG...he is the biggest baby EVER...and I loved every moment of it! Never fear...with the help of a great set of characters (his friends and family), Drew's able to pull out of his illness and tackle his problem head on. Many kudos to him...even if he went a bit overboard! I would be remiss if I didn't talk about some of the other characters. Drew's friends are just as hilarious and while some are still players, others have settled down and/or are settling down. Matthew and Dee-Dee seem very interesting and I would love to read more about them and I even love Lexi and Steven! But my all time favorite character has to be Mackenzie! What an amazing character and I love her relationship with Drew. The cussing jar and the horse were hilarious! And something else that plays almost as important part as the characters are all the movie references. From Cinderella to Ron Burgundy, Little Mermaid to The Notebook, I loved how EC incorporated it into many of the relationships....just like real life! I loved the ending...Yay for no cliffhanger! And I think most people will be satisfied. I've heard a rumor that there may be a possible book two...that would be awesome! But until then, check out this link for a scene from Kate's POV: (thanks to my lovely friend, D Kristin!)http://asainandwhitegirlbookblog.word...Want more Drew? The author has a website set up called From the Desk of Drew Evans that you can check for even more hilarity...and wisdom? ;) http://www.drewevans.net/Favorite quotes: (way too many to add them all!)♦ \"I know, I know…I said I don’t ride the same coaster twice. But twin coasters? Let me tell you, no man would pass up a ride like that.\"♦ \"Maybe you’ll understand my point of view if I put it this way. You brush your teeth, right? Well, suppose your favorite toothpaste is Aquafresh. But the store is out. All they have is Colgate. What are you going to do? You’re going to use the Colgate, right? You may want to brush with Aquafresh, but when all is said and done, you use what you have to keep those pearly whites clean. See my way of thinking? Good.\"♥ I smile devilishly. “I’d love to eat your cookie, Kate.” She shakes her head at me. “Why do I have the feeling you’re not talking about the chocolate chip variety?”♦ \"In times like this, I always ask myself, \"What would William Wallace do?\"♥ “So I said those things on purpose, so you would think you were nothing to me. That you were just another girl. But you’re not, Kate. You’re not like anyone I’ve ever known. I want to be with you…really be with you. Only you. I’ve never felt this way about anyone. And I know I sound like a freaking Hallmark card, but it’s true. I’ve never wanted all the things I want to have when I’m with you.”♦ “It’s the estrogen. It gives us ESP. If you had a vagina, you’d know too.”"}, {"userName": ".Lili. ", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/8905618-lili", "userReview": "How I would describe this book:My emotions during this book varied between:By the the end I was left with a permanent grin on my face ♥Drew is simply...Kate..This book was refreshing in so many ways starting with the fact that it was COMPLETELY from a male POV. It was the perfect mix of humor and sexiness with sweet romance thrown in. Brilliant debut novel! 5++++ stars!!!!"}, {"userName": "Bibi", "userReviewDate": "Jul 16, 2017", "userURL": "http://www.goodreads.com/user/show/33411728-bibi", "userReview": "Try this: read chapters 1-5, skip to 12, then read the last 2 chapters. Do you think you missed anything? Well, there you have it."}, {"userName": "* Meli Mel *", "userReviewDate": "May 05, 2013", "userURL": "http://www.goodreads.com/user/show/10905711-meli-mel", "userReview": "***5 I CAN'T BREATHE, WIPING TEARS, STOMACH CRAMPING STARS***OMG! I am SO glad I decided to see what all the fuss was about with this book. I FREAKING LOVED IT! Being in Drew's head was absolutely FUN and HILARIOUS! IT IS A MUST READ!\n\n“I’ve never seduced a woman before.Shocking, I know.Let me clarify. I’ve never had to seduce a woman before, not in the typical sense. Usually it just takes a look, a wink, a smile. A friendly greeting, maybe a drink or two. After that, the only verbal exchange involves short, one-word phrases like harder, more, lower… You get the point.”\n\nDrew is a wealthy arrogant playboy that is use to getting his way. He doesn't work to get a woman to sleep with him because he is so handsome and charming that women practically beg him to sleep with them. On a weekend out on the town, he sees a woman that he needs to know, Katherine Brooks. He wants her bad and isn't unsettled by the fact that Kate is engaged because her body language is screaming that she is very much interested. Still, Kate turns him down and he finds out the next day that she is his new co-worker and his father has asked him to take her under his wing. Let the hilarious sexiness begin.\n\n“…You and Kate. It’s obvious you have a thing for her.”“Yeah I do have ‘a thing’ for her. An extreme dislike of her. We can’t stand each other. She’s a pill. I wouldn’t fuck her with a ten foot dildo.”Okay that’s not true. I’d so fuck her. But I wouldn’t like it. Yeah you’re right. That’s not true either.++++++++++++++++++++“She looks like some mythical imp, some fabled pagan sex deity from a Roman legend. Or a well-acted porno.”\n\nI loved Emma Chase's writing style. I was hooked just from the opening lines. It was all completely in Drew's POV and I could not get enough of reading all of the inner ramblings of Drew's mind. The things that came out of his head... some were borderline offensive but you can't help but think it's so true. You should see how much I highlighted this book! It was quite refreshing to read how honest he was. Obviously the inner workings of a woman's and man's mind differ but I enjoyed and was fascinated being in a man's mind. I didn't want it to end!Drew was a bit of a jerk and sarcastic, but really sexy and in then end, you really can't say no to him. He was irresistible and swoony. I want to have your babies! haha! I loved how he started to change and was falling for Kate. He was a freaking idiot at one point, though. Still, I LOVE YOU!!! The way he was trying to make her fall in love with him had me sighing and laughing all at once. When he does something, he goes all out. I loved it!\n\n“God, she’s beautiful. I mean, look at her. She’s like a volcano going off—fierce and fiery and breathtaking. If she doesn’t find a way to ugly herself down, I’m going to be spending an awful lot of time pissing her off. Which might not be such a bad thing in the end. Angry sex is awesome.” +++++++++++++++++\"Edward Cullen can take his stupid heroin and OD on it. Kate is my own personal brand of Viagra.\"+++++++++++++++++“She’s not just perfect – she’s perfect for me.”\n\nI even really liked Kate. She was intelligent, kind, fiesty, and sexy. She was not afraid to be herself or work hard to get what she wants. I loved that she wanted to be independent because of how she grew up. My only complaint would be, HOW COULD YOU NOT SAY YES TO HIM, YOU CRAZY WOMAN?! Other wise, I think she kinda kicked ass.\n\n“If we’re going to work together, Drew, I think we should get a few things straight. I’m not your sweetheart. My name is Kate — Katherine. Use it. And I’m not a kiss-ass. I don’t have to be. My work speaks for itself.”++++++++++++++++“It makes me want to kiss her and strangle her at the same time. I’ve never been into S&M, but I’m beginning to see its benefits.”\n\nIn fact all the characters were very entertaining in their own way.Mackenzie - So freaking adorable with her little swear jar and the questions she would ask.\n\n“Uncle Drew?” “Yes?” “Is you gonna die alone?” I smirk. “I don’t plan on dying for a long time, honey.” “Momma says you gonna die alone. She tol’ Daddy that you gonna die and it be days till a cleanin’ lady find your rottin’ corpse.”+++++++++++++++++“I don’t think Uncle Matthew can come, Momma. He been too busy bein’ pussy whipped. Wha’s pussy whipped, Daddy?” \n\n\"The Bitch\" aka Alexandra, his sister - Was supportive and mean all at once. She kind of reminded me of my relationship with my younger brother. So I thought that was brilliant.Matthew - He had a few hilarious lines that were really great.\n\n“Delores is a gorgeous name, for a gorgeous girl. Plus it rhymes with clitoris … and I really know my way around them. Big fan.” \n\nSeriously, no character got on my nerve. I also need to mention that the sex scenes in his POV, were also really good! *fans self*I had so much fun reading this! I laughed, giggled, snorted, rolled my eyes, sighed, swooned and smiled so much my cheeks were hurting by the end of it. If you want a book that will lift up your spirts, this is it! It was so AWESOME!! I can't say enough about how much I LOVED it!! I am hoping that another book like this will be written by Emma Chase and hopefully coming out soon! *fingers crossed*\n\n\"Now my life is a mess. In a good way. A giant unpredictable web of screw-ups and make-ups. Frustration and tenderness. Annoyance and affection. Lust and love. But that’s okay. Because as long as Kate Brooks is tangled up in that web with me?Well, I can’t imagine anything fucking better than that.\"\n\nI'm not lying... the quotes could go on..."}], "description": "Drew Evans is a winner. Handsome and arrogant, he makes multimillion dollar business deals and seduces New York’s most beautiful women with just a smile. He has loyal friends and an indulgent family. So why has he been shuttered in his apartment for seven days, miserable and depressed? He’ll tell you he has the flu.But we all know that’s not really true.Katherine Brooks is brilliant, beautiful and ambitious. She refuses to let anything - or anyone - derail her path to success. When Kate is hired as the new associate at Drew’s father’s investment banking firm, every aspect of the dashing playboy’s life is thrown into a tailspin. The professional competition she brings is unnerving, his attraction to her is distracting, his failure to entice her into his bed is exasperating. Then, just when Drew is on the cusp of having everything he wants, his overblown confidence threatens to ruin it all. Will he be able untangle his feelings of lust and tenderness, frustration and fulfillment? Will he rise to the most important challenge of his life? Can Drew Evans win at love? Tangled is not your mother’s romance novel. It is an outrageous, passionate, witty narrative about a man who knows a lot about women…just not as much as he thinks he knows. As he tells his story, Drew learns the one thing he never wanted in life, is the only thing he can’t live without.", "title": "Tangled\n      \n          (Tangled #1)", "url": "http://www.goodreads.com/book/show/18297707-tangled", "average": 4.11, "cover": "https://images.gr-assets.com/books/1375808439l/18297707.jpg", "reviews": 8892, "authors": [{"url": "https://www.goodreads.com/author/show/6551005.Emma_Chase", "name": "Emma Chase"}], "type": ["Romance", "Contemporary", "Romance", "New Adult", "Humor"], "outlinks": ["http://www.goodreads.com/book/show/18297707-tangled", "http://www.goodreads.com/book/show/16073738-tangled", "http://www.goodreads.com/book/show/18404884-tangled", "http://www.goodreads.com/book/show/17951186-tangled", "http://www.goodreads.com/book/show/17977710-twisted", "http://www.goodreads.com/book/show/29991719-royally-screwed", "http://www.goodreads.com/book/show/22926485-sustained", "http://www.goodreads.com/book/show/22923997-overruled", "http://www.goodreads.com/book/show/18282724-holy-frigging-matrimony", "http://www.goodreads.com/book/show/28168785-runaway", "http://www.goodreads.com/book/show/35148447-juliet", "http://www.goodreads.com/book/show/35913695-hidden-secrets", "http://www.goodreads.com/book/show/40198274-kiss-me-while-i-sleep", "http://www.goodreads.com/book/show/29420557-breath-of-malice", "http://www.goodreads.com/book/show/35839275-kian", "http://www.goodreads.com/book/show/23745439-greensleeves", "http://www.goodreads.com/book/show/29639736-everything-we-keep", "http://www.goodreads.com/book/show/26186801-someone-like-you", "http://www.goodreads.com/book/show/18800300-from-thin-air", "http://www.goodreads.com/book/show/18950617-sweet-caroline", "http://www.goodreads.com/book/show/31139576-all-the-breaking-waves", "http://www.goodreads.com/book/show/18800331-to-hope", "http://www.goodreads.com/book/show/33016164-royally-bad", "http://www.goodreads.com/book/show/34609092-royally-ruined", "http://www.goodreads.com/book/show/40193474-the-finishing-touches", "http://www.goodreads.com/book/show/40193549-roses", "http://www.goodreads.com/book/show/19032297-accidentally-in-love-with-a-god", "http://www.goodreads.com/book/show/29231863-splinter", "http://www.goodreads.com/book/show/23622993-claimed", "http://www.goodreads.com/book/show/40243614-just-jilted", "http://www.goodreads.com/book/show/40193601-keeping-you-a-secret", "http://www.goodreads.com/book/show/18800455-the-pms-club", "http://www.goodreads.com/book/show/18800812-gypsy", "http://www.goodreads.com/book/show/35708042-bodyguard", "http://www.goodreads.com/book/show/18800579-willow", "http://www.goodreads.com/book/show/30126159-mosaic", "http://www.goodreads.com/book/show/40389026-summer-island", "http://www.goodreads.com/book/show/12369122-because-of-you", "http://www.goodreads.com/book/show/29373539-the-lullaby-sky", "http://www.goodreads.com/book/show/28441063-secretly-hers", "http://www.goodreads.com/book/show/23271170-tycoon-takedown", "http://www.goodreads.com/book/show/18800411-come-high-water", "http://www.goodreads.com/book/show/33001355-before-i-knew", "http://www.goodreads.com/book/show/40205166-the-paradise-of-glass", "http://www.goodreads.com/book/show/32532886-trusting-you-other-lies", "http://www.goodreads.com/book/show/21425515-once-haunted-twice-shy", "http://www.goodreads.com/book/show/40272947-the-pursuit-of-tamsen-littlejohn", "http://www.goodreads.com/book/show/40193595-the-story-of-beautiful-girl", "http://www.goodreads.com/book/show/34873257-the-lullaby-girl", "http://www.goodreads.com/book/show/30184217-say-goodbye-for-now", "http://www.goodreads.com/book/show/40205144-bridged", "http://www.goodreads.com/book/show/18800690-love-is", "http://www.goodreads.com/book/show/26813208-thirty-five-and-a-half-conspiracies", "http://www.goodreads.com/book/show/20489452-thirty-one-and-a-half-regrets", "http://www.goodreads.com/book/show/20687181-thirty-two-and-a-half-complications", "http://www.goodreads.com/book/show/40198652-twenty-eight-and-a-half-wishes", "http://www.goodreads.com/book/show/15836745-twenty-nine-and-a-half-reasons", "http://www.goodreads.com/book/show/36685093-the-unimaginable", "http://www.goodreads.com/book/show/29339972-thirty-six-and-a-half-motives", "http://www.goodreads.com/book/show/23263614-thirty-three-and-a-half-shenanigans", "http://www.goodreads.com/book/show/40199170-thirty-and-a-half-excuses", "http://www.goodreads.com/book/show/24778061-thirty-four-and-a-half-predicaments"]}