{"ratings": 1411, "userreviews": [{"userName": "Delee", "userReviewDate": "Apr 28, 2014", "userURL": "http://www.goodreads.com/user/show/6168268-delee", "userReview": "In my youth I used to listen to The Beach Boys and Jan and Dean sing about Southern California- the beautiful girls and boys, the surf, the sand...sun sun sun...fun fun fun. Everyone was smiling...everyone was friendly...no one had a care in the world. This novel is NOT The Beach Boys or Jan and Dean's version of The Huntington Beach surf culture...far from it. While they were STILL singing Surfin' Safari and Surf City -during the 70s and 80s- serial killers and rapists were using the beaches as hunting grounds, skinheads, biker gangs and clueless runaways were settling in for the long haul, and there were plenty of drugs drugs drugs. TAPPING THE SOURCE is THAT version.18-year-old Ike Tucker has never strayed far from the dead-end desert town of San Acro. Not that he has any real ties to the place- His mother fled loooooooooong ago leaving him and his sister Ellen in the care of her zealot mother and less than warm and fuzzy brother- Gordon. And Ellen took off two years ago without a goodbye- her whereabouts unknown to him......Until a friend of Ellen's tracks Ike down- The young surfer says he knows where she was just a short time ago- but fears she is in danger or already dead. He leaves Ike with a location and the names of the men she was last seen with before she disappeared. Hound Adams, Terry Jacobs and Frank Baker.With only those clues Ike grabs his life savings- and heads off for the last place Ellen was seen- Huntington Beach Ca. His plan- blend in as much as possible, and get close to the locals. So he checks into a cheap hotel, cuts off his jeans, buys a board, and heads to the beach to try his hand at surfing. At first things don't go as well as he hoped, and when he gets punched in the face for not following the proper surfer etiquette- Ike thinks maybe he is going to need a new plan....But his luck seems to change when he meets Preston Marsh- a burned out biker and Vietnam Vet, who used to be one of THE star surfers in the 60s before life beat him down. The two form a bond through their love of bikes and Ike's new found love of surfing. Eventually he trusts him with his story and... Yes...Preston knows Hound Adams- in fact they used to be best friends and business partners back in the day- unfortunately that is all he will say on the matter......And Ike realizes that not only is his friendship with Preston NOT going to make it any easier for him to get closer to Hound Adams or to the truth about what really happened to his sister- it may even make things much more dangerous.TAPPING THE SOURCE was a group-buddy-read for me and four of my GRs gal pals...and it is also a prime example of how people who all get along so well can react so differently to a story- Two looooooooooooved it (one of them being me)- two pretty much hated it...and one couldn't finish. I was shocked...SHOCKED!! But I get it. We can't alllllllll love the same thing. I spent a lot of time while reading- wondering how this book drifted off people's radar over the years? Why isn't everyone reading it? But then I got my answer after comparing notes with my buddies. Ohhhhhhhhh because everyone isn't meeeeeeeeeeee and doesn't think like me. How sad is that? ;)"}, {"userName": "Ivonne Rovira", "userReviewDate": "May 04, 2014", "userURL": "http://www.goodreads.com/user/show/3803671-ivonne-rovira", "userReview": "Skinny sad sack Ike Tucker, not yet 19 years old, takes the Greyhound bus nearly eight hours to Huntington Beach, Calif., to search for his wild runaway sister Ellen, who ran away a year ago. All he has is a crumpled piece of paper with three names and a garbled account of a trip his sister took with those three men to Mexico. Thus, a young man who has lived nowhere but a tiny desert town discovers inner strength and a working knowledge of the ways of the world — including the underworld and the shadowy world of bikers, runaways, and surfer punks. Not knowing anyone in Huntington Beach when he arrives, Ike nonetheless manages to gradually piece together clues to Ellen’s fate. In the meantime, Ike tries to determine who he can trust — and who he cannot. After a leisurely start, in which author Kem Nunn introduces Ike — and us newbies who are reading Tapping the Source — to the world of surfing, the novel, a National Book Award finalist, turns into a gripping page-turner with more twists and turns than the Pacific Coast highway. To reveal more would be to ruin this five-star book. However, be sure to ride this wave."}, {"userName": "Lisa", "userReviewDate": "Jun 23, 2014", "userURL": "http://www.goodreads.com/user/show/3191832-lisa", "userReview": "First of all, I just want to say I have the world's greatest, loveliest goodreads friends. They are smart and classy ladies with great taste in books who respect differing opinions with grace. These gals loved this book and gave it five stars and glowing reviews. Those are the reviews you should probably be reading. This one is from a tired stay-at-home mama who has admittedly odd taste in literature. Anyway, here's my review:I didn't like this. I couldn't get myself to care about these characters and the surfing scenes went on and on and I'm just not that interested. I found I was zoning out a lot and had to keep going back in the narration and listening to it again. It started pretty strong for me, but as soon as Ike meets up with Preston, things just slowed way down. At least for me. But super DUPER props to this narrator, who was sooooo perfect for this type of thing. This was NOT a poorly written book. On the contrary. It was well written and not corny. A bit too much 'language' for my taste and I do hate,hate,hate the use of the 'N' word, it's just something that really bothers me A LOT. This is not historical fiction or anything, so I really can't see why Mr. Nunn felt like throwing that in there. But I digress. If this is your thing, you'd probably dig it. The writing was pretty solid. It just wasn't for me. But it seems to be for everyone else, so hey, Audible is super great about returns and it is a very summer-type of book, so go ahead: give it a go :)"}, {"userName": "Kandice", "userReviewDate": "Jun 11, 2014", "userURL": "http://www.goodreads.com/user/show/383798-kandice", "userReview": "Well, I didn't see that coming!!!! 2.5 stars... Eighteen year old, Ike Tucker is on a mission to find out what happened to his sister, Ellen, who up and left their desert home. After being tipped off, he heads to Huntington Beach, CA. with nothing more than a few hundred bucks and the names of 3 men who were intimately connected with Ellen. Ike is cautious and befriends some local surfers, keeping his motives at bay. Over time, he begins putting pieces of the puzzle together or so he thinks… I read this along with some other GR ladies whom I deeply respect and enjoy. We were pretty much divided; 2 loved it, 2 didn’t love it, and 1 abandoned it. The book was well-written, but the story wasn’t my “wave”. I would, however, recommend Tapping the Source as a summer read for a book club. It is sure to create some interesting discussions. The entertainer in me would suggest hosting your meeting on the beach :-)Later Dudes!"}, {"userName": "Shek", "userReviewDate": "May 12, 2008", "userURL": "http://www.goodreads.com/user/show/153518-shek", "userReview": "This is touted as the best ever surfing novel, or a pre-eminent example of \"surf noir\", and I'm pretty sure it's the only novel I've read that fits easily into either category. They don't tell you this, but it's also a great example of a novel that's running along fine and then suddenly plunges off a cliff. I mean, what the hell was that with the [spoiler]? And the [major spoiler]? That didn't even make any sense! A poorly explained tangent into the realm of [spoiler] aside, it's a fine, well-put-together piece of genre fiction."}, {"userName": "Jenna", "userReviewDate": "Dec 26, 2008", "userURL": "http://www.goodreads.com/user/show/1753805-jenna", "userReview": "I hate using the word \"gritty\" in relation to books, particularly in this case where it seems to be the default reviewers' adjective, along with \"noir\" and \"sun-bleached.\" But gritty she be. This is a gritty, dirty, greasy novel. If it were an object poem it would be cigarette butts, surf wax, warm Mountain Dew, hot sand and lubricated engine parts. Mmm. Lots of drugs, fistfights, yucky sex, culty violence, male bonding, formative mystical experiences, lost youth. It didn't leave me feeling good, but it was honest, uncontrived. The whole \"surf-noir\" tag is totally weird, though, since I don't think there's anything noir about it. Ike's just a kid looking for his sister."}, {"userName": "Adam", "userReviewDate": "Sep 09, 2010", "userURL": "http://www.goodreads.com/user/show/214053-adam", "userReview": "Nunn’s coming of age novel which transcends the limitation of that genre with an unusually likeable protagonist, an interesting mystery, and a setting in a decaying milieu of bikers, surfers, drugs, orgies, punk rock, orgies, porn, ritual murder, and a sense of palpable evil. Each character brings its own set of quirks and contradictions and you never stop guessing what is going on until the very end. An incredible debut and even if you don’t care about surfing(though Nunn very much does and you share his passion as you read) but want to read a modern example of California noir at its most sun bleached and debauched find Nunn."}, {"userName": "Johnny", "userReviewDate": "Sep 27, 2010", "userURL": "http://www.goodreads.com/user/show/1865024-johnny", "userReview": "I had heard about this book for quite some time. Now I know why.A great read, it works as a surfing novel, a crime novel and a coming-of-age story. The three come together to create not only an original world, but a story that is both gripping and never predictable.It allows all the characters to find both the dark and light sides of their humanity. The relationships between characters are immediately complex and real.I highly recommend TAPPING THE SOURCE. Well-written, insightful, and a blast."}, {"userName": "Lance Charnes", "userReviewDate": "Dec 30, 2014", "userURL": "http://www.goodreads.com/user/show/7296900-lance-charnes", "userReview": "Surf noir has been around about as long as surfing has been in the popular mind -- for one, Ross Macdonald dipped a toe in it in 1962 -- and its current strongest practitioner is Don Winslow, whose works I've reviewed in the past. But Kem Nunn was working this wave before Winslow paddled in, and Tapping the Source is the first of his six widely-spaced novels. It exhibits many of the characteristics of a debut: uniqueness, passion, but also issues with pacing and plot resolution.A wayward mother dumped Ike, our eighteen-year-old protagonist (it's hard to call him a hero), in a dead-end desert town. He and sister Ellen grew up longing to go elsewhere, which Ellen eventually did, falling off the map in the process. Then news from Out West sends Ike to Surf City USA, looking for the only person in the world whom he really cares for. He finds that all is not Jan and Dean on the edge of the Pacific.Ike -- quiet, suspicious, shy, self-conscious, naïve -- is vividly drawn. By his nature he's hard to cozy up to, and in many places you'll want to hit him with a clue stick, but that's a function of who he is. He reacts to events in the way you might expect a closed-in kid might, which doesn't always make a lot of sense and isn't always in his best interest. Nunn avoided the trap of making him an investigative adept, natural-born hustler or quick study; he's a plodder in a milieu that eats up plodders without a thought.That milieu is the Huntington Beach, California of 1984, before redevelopment and gentrification wiped out the beach slum, erased the jagged edges and made Surf City safe for rich suburbanites. The HB we see through Ike's eyes is a festering pit of losers, druggies, lost children, mad dogs, gangs (motorcycle and otherwise) and the two-bit businesses that feed off them. Nunn's scene-setting is atmospheric and easily visualized, and most of the supporting cast members are clearly defined and true to their types. Preston and Hound -- the yin-and-yang natural forces who try to lay claim on Ike's soul -- are both fully realized characters who could easily carry their own stories.So why not five stars? As mentioned earlier, Ike is true to his nature, but his nature isn't especially dynamic, and as a result he spends a good deal of time drifting. No doubt a real Ike would do the same, but his lack of drive robs an already prolonged Act II of the energy it needs. You'll guess the supporting cast's secrets much sooner than Ike does, which robs them of their impact. Baddie Milo Drax is much typier than the other major characters; his daddy is Blofeld, and his siblings are all the other slick-entrepreneurs-with-hearts-of-slime that we've seen on TV and in books and films over the past thirty years. While the much-maligned climax makes a certain topical sense -- in 1984, Manson still cast a long shadow over the Southland, and serial killers were all the thing -- if reader comprehension is the author's major goal, it's truly unhelpful to have his POV character stoned as well as generally clueless.Tapping the Source is a good book that could have been great but for Nunn's rookie mistakes. I hope to read one of his later works to see how he's developed as a writer. This has been called one of the great California crime novels. That may overstate the case, but it's a moody, atmospheric evocation of Southern California surf culture before the developers paved it over. Just expect to respect it more than you enjoy it or are thrilled by it."}, {"userName": "Kirk", "userReviewDate": "Aug 07, 2011", "userURL": "http://www.goodreads.com/user/show/667059-kirk", "userReview": "Interesting contrast to Don Winslow's The Dawn Patrol in the small world of surf noir. Winslow's book is a little too cartoonish, with characters that could have come out of a USA Network series c. 1994 (Hey, remember Pacific Blue?). This one seems a little ponderous. That's probably a reflection of style. Thirty years ago you could have your characters self-interrogate themselves as a way of mapping for the reader the development in both character and plot. But now it seems sorta silly for characters to stop mid-action to ask very important questions such as .... What could it mean? For those interested in how style has had to become more streamlined and less internal to exist in a LOL/ROFLMAO world, it makes you wonder. Didn't it ever seem sort of fake to them? How could they not know it wouldn't age well? Why would one not appreciate how it feels like a contrivance? And while we're at it: To be or not to be?That said, there's a level of surf mysticism that sorta fun here and as close to what surf noir should be as any other novel trying to fit into this subgenre. Tapping the Source, of course, refers to the ability to connect into the Godhead of one's potential while slicing a wave. At least, it seems to mean that until deep in the novel it's revealed that TTS actually means something quite different ... something that speaks to the fall into cynicism and corruption that surf culture underwent as it was commercialized on the one hand and corrupted on the other by the Mansonization of youth in the late sixties. And so we have the suitably sleazy Milo Trax, a figure of exploitation. Then there's the naive child, Ike, looking for a lost sister. And somewhere in the middle the Abel and Cain of brahdom, Prez and Hound. One felt such guilt for going to the dark side he went to Vietnam as punishment. The other threw himself into the corruption. Which mentor will Ike choose? Will he ever find his lost sister? And will he ever become a good surfer? And just how many fucking question marks are in this book anyway?No, seriously, it's entertaining. I read it while trapped for a day in an airport. It's more substantial than Dawn Patrol and has many unremarked upon similarities to Robert Stone's Dog Soldiers, especially in the climactic scene that many people here feel costs the storyline its credibility. I'll be reading more Nunn to see how he developed and how his perceptions of surf culture have changed since this cult fave boogied upon the board of readers' oceanic hearts."}, {"userName": "chan", "userReviewDate": "Jun 03, 2018", "userURL": "http://www.goodreads.com/user/show/75727450-chan", "userReview": "If you are looking for a book about surf culture's easy-going way of life, accompanied with music by The Beach Boys, sun-bleached hair, tanned skin and no bad vibes, bruh all day, every day, \nTapping the Source\n isn't it.In the late 1970s/early 1980s, Huntington Beach, California has a small town feel to it. For most people it's just a stop along the way to a better life, wherever that may be. There are (of course) the surfers, but also bikers, drifters, drug dealers, Vietnam war veterans, punks and teenage runaways living in seedy apartment complexes, trying to get by.Overall there isn't much going on within the story itself, but for some reason I still couldn't stop turning the pages. It was fun exploring these streets and beaches and getting to know various groups of shady people with Ike Tucker, an eighteen year old desert town hick - sort of - looking for his missing sister when he isn't sidetracked by sex, drugs and the surf which happens pretty much all the time.My biggest problem was the ending. Not because it was weird (reading it, don't forget that this part of California was still in recovery from the aftermath of the Mansion Family even in 1984 when this book was first published) but because it felt rushed. Before the story just stumbled along and all of a sudden almost out of nowhere crazy shit starts happening and that's it.But like I said, it was fun, nonetheless. And to someone who was never even near an ocean or a surf board before, the descriptions about surfing, the water and the waves not only were beautiful but also felt authentic and approachable - I could almost smell the surfwax."}, {"userName": "AGamble", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/988767-agamble", "userReview": "I like Kem's imagery and how he immerses the reader into a place, but I disliked the lack of strong female voices in this book."}, {"userName": "Will Johnson", "userReviewDate": "Mar 11, 2014", "userURL": "http://www.goodreads.com/user/show/2820455-will-johnson", "userReview": "With the exception of a small snippet of a dialogue at the very end that is still rattling around in my brain in regards to the 'whodunnit' (which I am still a little confused about), this book is pretty flawless.To start, it utilizes world building like the best in the business, creating a tense, dangerous yet real world location and inhabiting it with well drawn, conflicted characters who all have their high and low points.Inside this well built universe is an evolution of the main character, Ike, who is drawn in two dimensions to start with one clear motive and, by novel's end, has become three dimensional, has inherited the attributes of many of the other characters he learned from, has changed physically and mentally and has experienced the results and consequences of several different motivations that have evolved (or devolved) from his original purpose.Lastly, this has surfing in it brah! Real surfing! I've been surfing once and know next to nil about it but was truly taken away by the beauty of it ... and I could only see it in my head.*Spoilers* A lot of people seem to slag off the climax and the ending. My initial thought:I mean, throwing in satanic rituals and cleaning up loose plot threads with a few pages of exposition is not the best way to end a novel that is so based in a 'real' feel, yet, I liked it. It kind of made sense to me ... especially after all the crazy time when, in perspective, it fits in with the reality of the characters. Okay, well that's kind of bullshit ... it is hard to see ALL of it making sense, especially in regards to the novel's principal villain ... but it isn't as nuts and many people make it out to be.An essential crime and surfing novel ... I recommend highly."}, {"userName": "Stephen Sanders", "userReviewDate": "Jul 13, 2011", "userURL": "http://www.goodreads.com/user/show/2794271-stephen-sanders", "userReview": "At its core Tapping the Source is a meditation on loneliness. Ike Turner, a kid from California's Inland Empire, comes to Huntington Beach in search of his sister. He quickly becomes caught in Southern California's surfing culture and takes solace among the waves as he learns to surf. There's something pure and true about the ocean in Nunn's novel. However, that purity has been corrupted by a decaying surfing culture. This corruption of purity is a central theme in the novel. Ike searches throughout the novel for a personal connection with someone that is real, the way it was with his sister before she vanished. This search is mirrored in his connection to the ocean.Beyond these meditations, Tapping the Source has some pretty colorful characters and a fantastic noir mystery, the kind of story that peels away, like an onion, getting more and more complex.A lot has been said about the ending, most of it negative. I thought that the ultimate revelation of what was at the core of the mystery was less unexpected than others seem to think. Nunn left a lot of bread crumbs. More importantly, it ties in well with the themes of the novel. Its a weird ending, to be sure, but I guess I just like my noir weird.Its a great read and a very unique take on the mystery genre. I'm eager to read more Nunn."}, {"userName": "Thomas", "userReviewDate": "Jan 08, 2011", "userURL": "http://www.goodreads.com/user/show/743278-thomas", "userReview": "Kem Nunn wrote a pretty decent unconventional detective story here. Set in the ever mystical backdrop of Huntington Beach California, a troubled young man from the desert leaves his home and goes seeking answers after being told that his runaway sister had probably been murdered. What drew me to this novel was that it served as the \"inspiration\" for one of my favorite junk action movies from the 1990's \"Point Break\" Inspiration is by far the most appropriate term to use. This isn't a story about ex-presidents,FBI, bank robbery or even sky-diving for that matter. And thats ok with me because the story that Kem Nunn wrote is a very good story. So we as the consumer have actually been given two different and yet equally redeeming pieces of entertainment. The common themes are infiltration, surfing and not really a whole lot else. After reading this novel you will be able to recognise very subtle homages to the novel in the movie. Someday hollywood may give us a movie called \"Tapping the Source\" which rings true to this story. And I would welcome the development of such a project. In conclusion, if your looking for a nearly literary murder mystery with exotic description, I would definitely recommend tapping the source."}, {"userName": "Katie", "userReviewDate": "Jan 11, 2009", "userURL": "http://www.goodreads.com/user/show/158390-katie", "userReview": "What a fun book! I keep seeing it categorized as \"surf noir\" ---which is probably true but it seems like kind of an absurd category (how can something be noir when it's so sunny out?), but all of the over-the-top dramatic lines are very in the theme of noir! The book reminded me of when I went to the U.S. Open a few years ago---all of the sponsor representatives were passing out lots of flyers and stickers and junk on the pier, and they were handing out this big sticker that had the \"Top 10 Best Pick-Up Lines to Use at the U.S. Open.\" My Dad and I decided that our favorite one was #4: \"Hey Baby, my name's Mike Huntington and I own this town.\" This book was full of characters who all had lines just like that! \"Listen toots, Mike Huntington is the muscle in this town, and you'd do good to remember it. Now quit askin' questions and get the hell out of here.\""}, {"userName": "Michelle", "userReviewDate": "Jan 20, 2010", "userURL": "http://www.goodreads.com/user/show/1865682-michelle", "userReview": "Very original story..The author is really good at developing the characters [and trust me there are all kinds in this book:].It is really neat how surfing, bikers, 70's lifestyle and mystery are interweaved in the novel. The author also does a great job at keeping you in the dark about how the story will unfold but he gives you enough to where you can't stop turning the pages.It is also written in sort of a different style. The main character is Ike and it is his story or being told from his point of view but he refers to himself in 3rd person a lot so it makes it interesting. It is really easy to read and understand. Really great interesting story.If you are interested in surfing or 70's culture i think you will enjoy this. Good mystery. Also a little bizarre.."}, {"userName": "Ben Loory", "userReviewDate": "Oct 14, 2008", "userURL": "http://www.goodreads.com/user/show/171197-ben-loory", "userReview": "when robert stone blurbs a book, i listen. \"the all-time great surfing novel,\" okay i'm in. turns out those fuckers who made point break were all over this book. which is neither here nor there i suppose. anyway, this is a good, well-written book with a crappy ending (which involves (perhaps feigned) satanism), but not really very much about surfing. more about life in huntington beach, infiltrating a drug gang, etc. coming of age, yadda yadda yadda.still though, made me want to surf. still."}, {"userName": "Lenny Husen", "userReviewDate": "Oct 01, 2007", "userURL": "http://www.goodreads.com/user/show/320372-lenny-husen", "userReview": "The best coming of age novel I've ever read. Gritty, extremely well read, themes of murder, corruption, cheap sex, drugs, a boy loses the one person he has ever loved, his sister, and embarks on a quest to find her. Beautifully written, unforgettable. Every teenager and young adult in the USA should read this book."}, {"userName": "Cyanemi", "userReviewDate": "Jul 29, 2011", "userURL": "http://www.goodreads.com/user/show/3270726-cyanemi", "userReview": "I love the surf noir genre. I don't know how many books are in the genre but I wish there were more. The show, John From Cincinatti got me started on Kem Nunn because the show was a surf noir show and I think Kem Nunn was involved with the production. Sun surf blonds and lots of sordidness."}, {"userName": "Sarah", "userReviewDate": "Mar 18, 2013", "userURL": "http://www.goodreads.com/user/show/8206909-sarah", "userReview": "I would give it a 2.5 if I could. To say there is twist in this plot is an understatement. Towards the end, the plot line jumps off a cliff and into a very dark, seedy and bizarre underworld, then lands in a puddle. Not deep enough for the ocean."}, {"userName": "Chazzi", "userReviewDate": "Aug 15, 2017", "userURL": "http://www.goodreads.com/user/show/7217512-chazzi", "userReview": "I picked this up for the simple reason that it was set in Huntington Beach, CA. I've lived in HB for 40 years and skimming it took me back to about the time I moved here.Ike Tucker was raised in San Arco by his grandmother and uncle. His father had abandoned him and his older sister Ellen, and later his mother ran off with another man. Two years back Ellen had left with a guy too. San Arco was a dry, dusty desert town with nothing to give anyone reason to go there or stay there.Things changed for Ike when a guy, about Ike's age, drove up looking for Ellen's brother. He was dressed in nice clothes and drove a white Camaro. Ellen had told him her brother was a Harley rider and knew all about motorcycles.The guy had come to tell Ike that his sister had been in Huntington Beach, had gone to Mexico with a couple of guys and never returned. The guy was a bit disappointed to find that Ellen's brother was not a Hell raising biker that could ride down and make life miserable for the guys and find Ellen. He did leave Ike with a scrap of paper and three names...the names of the guys Ellen had been with.Ike decided he needed to go down to Huntington Beach and find his sister. He had never really been out of San Arco and wasn't sure what he would find. He had enough money for a bus ticket and to rent a place to stay.Arriving there he found sun, surf, golden tanned surfers and sun-bleached blonde chicks. He also found the dark side of Huntington Beach; drugs, parties that could go on endlessly fueled by drugs, booze and sex. Also the violence that could erupt between surfers and bikers, or surfers when jockeying for prime territory on the waves. He also found that it wasn't going to be a simple thing of asking questions and getting answers.The book is a combination of coming-of-age, surfing and the beach scene, and noir mystery. At times the writing is a bit wordy, but the author paints the scenes so that you can feel the sun or the nighttime, the salt in the air, the mood of the characters. He gives you written cues that trigger the images in your mind. He also weaves a complicated tale with a number of threads to be untangled to see the solution.I found that this is the first in a trilogy written by Nunn. Also that Nunn was a Southern California guy who surfed and had the knowledge, which I think made the atmosphere palpable while reading. A Goodread for me."}, {"userName": "St Fu", "userReviewDate": "Feb 19, 2018", "userURL": "http://www.goodreads.com/user/show/8614696-st-fu", "userReview": "After watching the TV series \nChance\n and finding it somewhat out of the ordinary, I was curious what kind of books the author (and the show's executive producer) wrote. Tapping the Source is mostly pretty ordinary though for the most part quite engaging. In a culture that has lost its values, the one value that prevails is loyalty to one's friends and lovers and the courage to live up to the resultant responsibilities. Ike needs to pay his debt to Ellen, Preston eventually pays his debt to Ike, and even Hound Adams, who preaches the value of rejecting all conventions and thinking for oneself (which in practice turns out to be indistinguishable from selfishness and thrill seeking) demonstrates loyalty at times. Among the values that make it all the way through the novel unresolved are brother-sister incest and sexual fidelity. How the culture lost its values in the first place isn't clear but we believe Hound Adams when he tells us it's bad parenting (Ike's mother deserted him--he never knew his father) and people just following along without thinking for themselves. Every major character in this story is estranged from his family and most are runaways adrift in the freedom that is Huntington Beach.This is ultimately a morality tale, as is \nChance\n. The good are flawed and get caught up in evil or in despair. How did the evil get to be evil? Some weren't (morally) strong enough to resist. Drugs helped them not resist. Others just had too much money. Or maybe their characters aren't written in sufficient detail for them to be complex human beings.Because murder by itself isn't evil enough, we need to upgrade it to satanic ritual murder (performed by and for the wealthy, of course) to get the reader's respect, but this reader found it kind of silly, not to mention a cliche I'd though we'd left in the 90s. That, and the perfectly timed arrival of Preston giving his life and saving the day are the story's chief failings.Still, there are characters and relationships that remain with me long after I finished reading. Just as in \nChance\n."}, {"userName": "Dave N", "userReviewDate": "Jun 15, 2017", "userURL": "http://www.goodreads.com/user/show/32802890-dave-n", "userReview": "[The sudden jump to ritualistic murder and the big shoot-out is cringe-worthy, and the fact that Michelle had to let Ike know that she actually didn't sleep with Hound Adams (dumb name), and so they can feel free to make things work after all (nevermind that he cheated on her with at least a half-dozen other women) was saccharine and boring. (hide spoiler)]"}, {"userName": "Jeannette M. Hartman", "userReviewDate": "Nov 30, 2017", "userURL": "http://www.goodreads.com/user/show/28454642-jeannette-m-hartman", "userReview": "Ike Tucker leaves the deadend town in the desert where he grew up for Huntington Beach, hoping to find out what happened to his sister Ellen, missing for two years. He begins his search with three names and a story told by a young man appears at his uncle's gas station. The young man, who claims to have known Ellen, tells Ike that she went to Mexico with three men who returned without her: Hound Adams, Terry Jacobs and Frank Baker.Naive and inexperienced, Ike arrives in Huntington Beach without a plan. He discovers a world of sun, surf, sex and drugs. The one friend he makes, Preston, a hulking, alcoholic biker, tries to talk Ike into dropping his search and moving on to a better life. He quickly discovers that Preston has his own dark past liked to Adams, Jacobs and Baker.This is a story of courage and loyalty, power and justice and the ability to face and overcome evil. You won't want to put this book down once you start reading and you'll be hungry for more when the story comes to an end."}, {"userName": "Scott Mcconnell", "userReviewDate": "Sep 06, 2017", "userURL": "http://www.goodreads.com/user/show/27152480-scott-mcconnell", "userReview": "I love books about the beach, SoCal, and/or surfing. I love mysteries. This book (nominally) has all those elements. While the writing is lyrical and strong -- it was a finalist for the National Book Award -- but I found the story somewhat over-complicated, sometimes not well developed or integrated, and frankly a little too bleak. \"Redemption,\" but only by improving from a horrible circumstance to a less horrible one. In the end, the dark tones of the book were, for me, too dominant."}, {"userName": "Tim Armstrong", "userReviewDate": "Jun 05, 2017", "userURL": "http://www.goodreads.com/user/show/41899894-tim-armstrong", "userReview": "Long time since I read this. But my memories are all fond ones.This was the first crime novel I'd read where it was centred around the surfing world. And Lynn clearly knew a thing or three about surfing.But the one thing I remember the most about this book was how well it was written. It was firstly surprisingly clever, in style and substance. But it was also well structured and a compelling read. If you are into surfing then don't miss it - there aren't many surfing thrillers after all...."}, {"userName": "Brian Murphy", "userReviewDate": "Feb 01, 2018", "userURL": "http://www.goodreads.com/user/show/77238773-brian-murphy", "userReview": "Great read with an interesting voice. I love the gritty look at the underside of a subculture. This is a page turner that takes you down a dark, dark road.The story is compelling and drives you forward, making it difficult to put down. Those readers who are fans of noir are going to really love this book. I like stories with surfing as a backdrop and this is definitely one of the best out there."}, {"userName": "Rachel", "userReviewDate": "May 10, 2017", "userURL": "http://www.goodreads.com/user/show/12193861-rachel", "userReview": "Wow! I could not put this book down! Reads like a good movie and the end threw me for a loop. You don't have to know jack about surfing to get into this book, which my preconceived notions expected. Have to thank my old neighborhood, Park Slope, yet again, for an awesome read that I never would have found on my own. Terrific!!!"}, {"userName": "Eloise", "userReviewDate": "Jul 27, 2017", "userURL": "http://www.goodreads.com/user/show/66034054-eloise", "userReview": "I read this book because one of my sons has surfed his whole life and holds a waterman's reverence for the ocean. The descriptions of the ocean and the surfing are absolutely gorgeous. The book, however, is also filled with danger, hooligans, nut cases, and more. It is not a warm and cuddly read, but I respect the author's amazing talent and am glad I read it."}], "description": "People go to Huntington Beach in search of the endless parties, the ultimate highs and the perfect waves. Ike Tucker has come to look for his missing sister and for the three men who may have murdered her. In that place of gilded surfers and sun-bleached blondes, Ike's search takes him on a journey through a twisted world of crazed Vietnam vets, sadistic surfers, drug dealers, and mysterious seducers. Ike looks into the shadows and finds parties that drift towards pointless violence, joyless vacations and highs you might never come down from ... and a sea of old hatreds and dreams gone bad. And if he's not careful, his is a journey from which he will never return.", "title": "Tapping the Source", "url": "http://www.goodreads.com/book/show/483195.Tapping_the_Source", "average": 3.98, "cover": "https://images.gr-assets.com/books/1328857598l/483195.jpg", "reviews": 153, "authors": [{"url": "https://www.goodreads.com/author/show/138813.Kem_Nunn", "name": "Kem Nunn"}], "type": ["Fiction", "Mystery", "Mystery", "Mystery"], "outlinks": ["http://www.goodreads.com/book/show/483195.Tapping_the_Source", "http://www.goodreads.com/book/show/19125034-tapping-the-source", "http://www.goodreads.com/book/show/22037900-tapping-the-source", "http://www.goodreads.com/book/show/1989884.Tapping_the_Source", "http://www.goodreads.com/book/show/2285402.Tapping_The_Source", "http://www.goodreads.com/book/show/13544524-tapping-the-source", "http://www.goodreads.com/book/show/13260318-tapping-the-source", "http://www.goodreads.com/book/show/17933571-tapping-the-source", "http://www.goodreads.com/book/show/237192.The_Dogs_of_Winter", "http://www.goodreads.com/book/show/397978.Tijuana_Straits", "http://www.goodreads.com/book/show/18144131-chance", "http://www.goodreads.com/book/show/696449.Pomona_Queen", "http://www.goodreads.com/book/show/1045392.Unassigned_Territory"]}